{"name": "Ararat", "titleId": "tt00273435", "reviews": [{"id": 0, "text": "The high frequency of attacks on this film as being 'proArmenian propaganda' is a testament to the power of the movie. The historical accuracy or moral culpability of the Turks vs. the Armenians in this conflict is not within my knowledge base to judge absolutely, nor that of most of the posters on IMDB, I suspect, so I will just judge this as a movie.Egoyan has managed the trick of avoiding a simple tearjerker black hat white hat polemic like Mel Gibson's The Patriot (or Braveheart or Passion of the Christ or We Were Soldiers or Chicken Run or....) or even 'Schindler's List' by the technique of distancing the audience to one remove, by making his film actually about an Armenian-Canadian filmmaker making a film about the Armenian Holocaust. Obviously, 'Ararat' still manages to stir up powerful emotions, but by also examining the responses of the film cast and crew and their loved ones and others with whom they come into contact the film attains a more mature and introspective value."}, {"id": 1, "text": "I ran out to see this in the theater since Egoyan was one of my favorite director's (that was until I saw this movie), with The Adjuster &amp; Exotica my favorites. His talent has been on the decline since Exotica, perhaps because he can't make a film without his wife in it (Felicia's Journey being the exception). In this film she is awful, but so are most of the actors. This film was the biggest disappointment in 2002 for me. This is a message film &amp; the message is: Turks committed genocide agaist Armenians &amp; genocide is bad. Otherwise, the film did nothing to impart knowledge of the historical events that are supposed to be the basis for the film. The acting is universally wooden. The storyline was poorly written. A completely lifeless film. I'm surprised by all the 10's it has received. 3/10"}, {"id": 2, "text": "I have seen other film by Atom Egoyan. I respect him as an artist.This film, Ararat, is lovingly made and very sensitive to a horrid subject. I found the acting very good, especially that by Christopher Plummer and David Alpay. I am shocked to see how limited the release was in the U.S. 6 screens, in the whole country? This film deserves far better treatment.I am also dismayed by the official IMDb blurb Interrogated by a customs officer, a young man recounts how his life was changed during the making of a film about the Armenian genocide claims. Very good until the last word, claims. Political correctness has no such place here. The only country in the world which continues to deny the Armenian Holocaust is Turkey."}, {"id": 3, "text": "Who, after all, speaks today of the annihilation of the Armenians? – Adolf HitlerDuring and after World War 1, the Ottoman Empire deliberately and systematically killed one and a half million Armenians. Though this event is still denied by Turkey, many modern scholars deem the Armenian Holocaust to be one of the first modern genocides, predating the Jewish Holocaust by several decades (the Herero and Namaqua Genocides occurred in 1904, predating the Armenian killings by a decade).The murders began in early 1915, the Ottoman authorities first targeting Armenian intellectuals and community leaders. The brains eradicated, the Ottoman military then began picking off the confused Armenian populace. They were forced out of their homes, deprived of food and water and made to march into the deserts of Syria, where they were either shot or left to die. Directed by Atom Egoyan, Ararat examines man's indifference to these crimes, the problem of artistically representing genocide, the historical ramifications of genocide and the elusive nature of truth. The result is a bizarre film that is less a satisfying piece of drama than an interesting whirlwind of ideas.All of Egoyan's trademarks are present in Ararat. Consider the director's earlier films, all of which revolve around some traumatic past event, their large casts gradually piecing together the past until some cohesive truth or revelation is revealed. These films are comprised of seemingly disconnected sequences and seemingly unrelated characters, vignettes that only begin to gel during some revelatory climax. These films also switch between eras, their narratives jumping from past to present to future, until history is concretized and the traumatic event is resolved in the present. Virtually all of Egoyan's films adopt this narrative structure, which seems to blend a modernist search for truth with a decidedly post-modern admittance that truth requires the careful sorting of both testimonials and subjectivity.Ararat follows this same pattern. We're introduced to an Armenian artist who lived during the Armenian Holocaust. He paints a picture of his mother that, 8 decades later, is used by an art teacher as a gateway into spreading the word of the Armenian genocide. Finding this artist to be intriguing, a Hollywood director then uses the long dead artist as the central character in a big budget movie about the Armenian Holocaust. The director turns the dour artist into an action hero, romanticising his life and embellishing history. The cast of this film is itself comprised of Turks and Armenians. The Turks naturally play the bad guys and see the whole film as a work of fiction. The Armenians, in contrast, believe the film to be factual, despite the obvious embellishments. One Turkish actor, an obvious homosexual, has an elderly father who works at an airport security desk. He permits an Armenian boy into Turkey with both bags of cocaine and footage of the genocidal killing fields. The father's acceptance of the lawless Armenian boy mirrors his acceptance of his gay son. The Armenian boy is himself the son of a terrorist who fought against the Turks, whilst the boy's lover is the daughter of a man whom she believes was killed by the boy's father.Confused? This complex web of characters is really a convoluted web of metaphors. Egoyan's points: Firstly, your parents may be the offspring of either the oppressors or the oppressed, but this does not implicate them in evils nor does it taint their character. Secondly, art is impotent unless it is aligned with a political cause and even then it is often misrepresented, both as a work of art and as a piece of history. Thirdly, to demonize, to deem the enemy animals or homosexuals, is to ignore their voice and their story. Fourthly, Hollywood is incapable of representing any Holocaust, film naturally seductive, romanticising events and turning their characters into heroes or messiahs. Fifthly, history itself is comprised of nothing but embellished stories passed down from generation to generation, each side tweaking the tale to fit their own ideological viewpoints. Sixthly, one can never know the past. It is lost, fragmented, and so forever lacking closure.What the film fails to do - what all Holocaust films never bother to do - is establish why and how such an event could take place. The Ottoman Empire, which was predominantly Muslim, treated Armenians, who were predominantly Christians, as second class citizens. They were not given equal rights and were subject to strict laws, the breaking of which would lead to fines and executions.At the same time, the Armenians were steadily amassing wealth and forging successful businesses. Because of economic problems, and their fears that Armenians would support Russia during, before and after World War 1, or even demand autonomy, the Ottoman authorities thus began a propaganda campaign which demonized the Armenians and so justified their eventual eradication and expulsion, freeing land for the Muslim majority and the country's wealthy rulers.But the film doesn't seek to portray these objective truths or examine the global class, religious or political factors which led to the holocaust. Preoccupied with subjectivity, the film never digs towards its issues roots. Ironically, this is its greatest asset.7.5/10 – Law professor Raphael Lemkin, who coined the term genocide in 1943, has stated that he did so with the fate of the Armenians in mind. The birth of techno-genocide is a serious issue. Egoyan's film, though the director tries hard, doesn't live up to the scope and complexity that such a serious story demands."}, {"id": 4, "text": "This is a very flawed movie by a well-regarded director.  One major problem is the star-role presence of his ubiquitous (in his films) wife, who can't act well and simply cannot use her voice expressively or effectively.  Her monotonic droning, in film after film, is irritating.Another is that he doesn't have the directorial chops to film in an  epic style such as the Armenian battle scenes require.The lopsided voting pattern here seems to be the result of ethnocentric ballot-box stuffing.  All those 10s could only mean that thousands of Egoyan's compatriots have invaded the board and voted politically rather than esthetically or rationally."}, {"id": 5, "text": "I'm not a great fan of Egoyan, but I did find Felicia's Journey fairly competent.  This last attempt (Ararat) is a sacrilege, a clumsy blundering mess of a film and a huge disservice to the Armenian people.  If I were Armenian, I think I'd be very offended."}, {"id": 6, "text": "I believe this movie is built on hate, the feeling that made those days like hell. Promoting this feeling and expressing it with more hatred does not help overcoming this negative state of mind. A sensitive story like this could have been told with a more elegant way, by not separating people into groups/races again, as it was maybe the main mistake of that century. Egoyan is free to believe anything he deems right, but this story is far from providing a broad and/or just vision. Pointing the finger to a person, a race or a nation as Egoyan did is may be the easiest way to impress the audience, but not the virtuous one."}, {"id": 7, "text": "This movie is a great example of baseless, unbelievable and wrong accusations. Some junkie trying to smuggle HEROIN in Canada and trying to fool the customs officer by telling a weird story of an unreal genocide. The funny part is that Mr. Atom declared that the movie has no political value. This movie was intended only to mislead peoples belief about what REALLY happened at that time. This movie is definitely not objective, it shows only one side of the coin. At the end of the movie the customs officer gets so emotional, even tough he finds the heroin, he lets the junkie go on his way. Now how can you believe a movie like this!"}, {"id": 8, "text": "I came across the movie Ararat while doing research for a paper I was writing for school. I watched it hoping that it would give me further insight into the Armenian Genocide. I can honestly say that this movie not only enforced the research I had done, but also led me to new topics I had not yet researched myself. I strongly believe in knowing about the events in a movie before watching it. Otherwise, you can sit through an entire film and not understand the meaning or significance that it holds. For instance, if you watch a film on Gallipolli (a very important battle for the Australians in the First World War) you may not know what it means for the people who were involved (like most people who live outside of Australia). However, if you take time to do a little research before hand you can easily watch a film about it and understand its importance. That said, I believe that this applies to Ararat in the same way. If you don't take the time to research the Armenian Genocide along with other aspects of the film such as the Van Resistance, Arshile Gorky, Clarence Ussher or even Aghtamar Island, you can never fully understand this movie (or any other film about the Armenian Genocide as well). I thought this movie was the perfect mix of storyline and documentation. In my opinion, it presented the facts of the Armenian Genocide accurately and effectively, without turning into a documentary about it. It showed how it still affects the Armenians of today, even though it happened a little bit less than one hundred years ago. How there could still be such denial and hatred between the people who were involved. The fact that we know so much about the holocaust that Adolf Hitler carried out and so little about this Holocaust, that started only 18 years before Hitler came to power, is shocking and deeply upsetting. I recommend this film highly, as not only an important piece on this historical event, but also an excellent film. I must applaud Atom Egoyan for doing this event justice and bringing it to life on the screen."}, {"id": 9, "text": "Ararat is a messy story about Armenians making a film about Armenians and lecturing about Armenians while showing historical retrospectives about Armenians...etc. This convoluted hodge-podge of dramas has an obvious common denominator. Armenians. Specifically the genocidal killing of 1.5 million Armenians in 1915 during WWI by the Turks. The film fails as a history lesson as we could learn more in 15 minutes of Inet surfing. It fails as a drama because all the characters are overacted, everything is waaaaaay too serious, and the screenplay simply tries to do too much in too little time. For Armenians or those with an interest in Armenians only. (C+)"}, {"id": 10, "text": "As an American, I have followed the history of the Armenian genocide. It is powerful to see a movie with-in a movie that brings forth such poignant historical truth.  i give this movie an A+.  It is very promising to see an Independent-type film perform so well. I look forward to its nation-wide release."}, {"id": 11, "text": "I really liked this movie. I've read review's by Berardinelli, Ebert, NYTimes, and Wash Post, and they are unduly critical, possibly based on the director's capabilities. However, I feel that the characters and the story interweaved masterfully, and that the relationship of Christopher Plummer and his gay son are an interesting parallel with the intolerance of the Turk's (majority Muslim's) and the Armenian's (minority Christian's); Also, the way that Raffi carried his hatred second-hand and that hatred got even more trumped up with the Elias Koteas current-day character was effective in showing how these clashes can sustain over generations upon generations.Another superb aspect of the film was how the cinematic production within the movie acted as the segway between the current and past events because the actors are also characters in the main movie; that's a structural piece  of real cinematic mastery."}, {"id": 12, "text": "This movie tried to be.in a Oscar run but although the flow is interesting, it is killed by the Armenian propaganda, when I saw the Hitler statement I said come on, you guys you are the only nation who show Hitler as a witness, Hitler is the lier of the history any way, they also say that we were Turkish citizen, Turkey should protect us, but they also try to kill the Turkish soldiers isn't that sad. Why don't they let them in, isn't those places the Turkish land. Another think is, the Turkish actor, proposes him to drink Shampagne but the Armenian boy was so terribly hate that he wanted to kill him as his father then the producer was worrying about why people hate us Although this movie was an Armenian propaganda, one can read the tea leaf and understand the Armenians in detail. They blame everything to Turks, even carrying drugs. And they kill people then blame Turks. i think youth of Armenians are still lost because of the Armenians."}, {"id": 13, "text": "Who would watch a movie about the Armenian genocide, outside of Armenians? That is the question Atam Egoyan must have asked himself when exploring his heritage. His brilliant solution is to interweave the story of two families in the midst of strife and denial with the story of an artist who captured the sadness of the Armenian genocide before committing suicide. The movie demands close attention, as it leaps through time and space, but attention is repaid by a deeply moving and profound film of compelling beauty and cathartic closure."}, {"id": 14, "text": "I think that this was one of the best movies I've ever seen.  It covered the main points of our history.  The movie was very touching and emotional. It was so needed by the Armenian community and it's about time this movie was made.  It was very well written and tastefully done.  THANK YOU!!!"}, {"id": 15, "text": "Being Armenian myself, this movie brought out feelings that had lied dormant in me for a very long time.  It is an emotional and informative film. Egoyan seems like he was really striving to show the truth of the Armenian Genocide for today's youth and just for people who might not know what it is.  I just found myself with a smug smile across my face when I was walking out of the movie theater with the large crowd who saw the movie with me, I overheard many people ask each other, What is Ararat?  So maybe now it has sparked some interest and knowledge will be spread through this film."}, {"id": 16, "text": "As a student interested in shedding light on human rights violations across the world, I am disgusted in Turkey's attempts to continue its denial of the Armenian Genocide by trying to suppress this film. This film deals with the truth about what happened to the Armenian people during the first world war and reminds us of the tragedy that humans can inflict upon one another if not punished.  Help stop the denial of the Armenian Genocide! See this movie and make sure all of your friends and family see it too."}, {"id": 17, "text": "A terrific rough style cast in a story about denial and the truth of living in denial. At first, I thought the movie was about the Armenian Genocide, but its not. It's about a families struggle in the present day world trying to live knowing that the genocide is their past. Many interesting characters are introduced throughout the story. The plot thickens as characters appear in the movie and the movie within the movie. The issue about denial is stronger than the truth. The issue about Turkey is made many times and is the last thing we see at the end of the movie, still, this is not a movie about the Genocide and Turkey's true intentions, its about the aftermath and the denial that becomes the truth."}, {"id": 18, "text": "It was deeply contemplative, and I find the way the main characters seek to gain an understanding of their own past, in parallel with the Armenian struggle to get the genocide of 1915 recognised by the world, a brilliant stroke.The scenes of violence are very harrowing, but I have to say they had a genuine part to play, the movie would simply not be the same without it.The vote distribution for this movie is really curious. I wonder if those 5.4% who rated the movie 1/10 are mainly of Turkish descent? Makes me think of the character who played the actor who played the Turkish officer..."}, {"id": 19, "text": "Academy Award Sweeper: Oscars 2002 belongs to ARARAT.  Best score; best screenplay; a slew of excellent actors: GENOCIDE DENIAL.  This movie has it all!  Atom Egoyan is a genius, and this movie puts all his talents together with a story that had to be told, the story of the destruction of millions of Christians, stories of sorrow as deep and as painful as it gets."}, {"id": 20, "text": "Movies depicting the tragic Armenian Genocide perpetrated by the Ottoman Empire have been suppressed by the Turks for years. It's very cowardly of them to call the Armenians liars and even worse, to distort history and make others think that they did not commit a terrible crime against humanity. This is the first big film that shows the atrocities carried out by the Ottomans. We always hear about the Jewish Holocaust, but there are so many other holocausts and genocides that people are not aware of. The only way to stop these horrors from happening over and over again is to recognize them and punish their perpetrators. After all, Hitler was quoted saying something along the lines of Who, after all, speaks now about the annihilation of the Armenians? as he planned to wipe out the Jews. Issues like the Armenian Genocide must be exposed to the public, and Egoyan did a great job."}, {"id": 21, "text": "where can i start?&gt;!! this movie is a masterpiece!! Egoyian's Schindlers List. A compelling movie about a even more compelling and important subject! to know that such a massacre occured at the hands of the Turkish government while the world just watched is very disturbing.  Atom Egoyian put together a terriffic cast and story line that helped give the movie and subject life and meaning.  He helped expose the injustice that occured in 1915 in a artistic fashion.  Charles Asnavour's performance was compelling and very believable but Alday truly stole the spotlight with his boyish good looks and self confidence. THIS MOVIE IS A MUST SEE FOR ANYONE WHO IS A HUMAN RIGHTS ACTIVIST!!Atom is truly one of the best directors in the business and I hope he continues to make quality movies like this one!"}, {"id": 22, "text": "ARARAT, has been such a success in Montreal. It is presently screen during a film festival this week, and just to show how popular it was from Armenians and odars(non armenians), well the tickets got sold out in a flash!!!  It is a show not to be missed.....trust me!!!!!"}, {"id": 23, "text": "I am sad to admit that Ararat is a cinematographic failure. The only scenes which I enjoyed were of Archile Gorky's played by incredible Simon Abkarian. The storyline is confusing and disorienting, movie inside the movie concept is very hard to pull off even for a accomplished filmmakers and Egoyan fails miserably at that. I find it difficult to watch how actors such as Plummer and Aznavour struggle to believe their lines and I don't blame them. The script is just bad. I wanted to show this film to some of my friends who are not Armenian and know little about the genocide, but after watching it twice myself, I realized they will not learn anything from it. One day a film will come out about the Armenian genocide which will touch people's hearts and fight Turkish propaganda machine at the same time. Ararat of Egoyan fails at both."}, {"id": 24, "text": "A movie which tells a simple but yet complex story: a truth long obscured and ignored because of obvious political reasons. A truth covered by political interests and lobbying.The truth: The Armenian Genocide, where more than 1.5 million Armenians where massacred under the Ottoman Empire, the 1st genocide of the 20th century...Yet the movie is not about the genocide itself, it's how a historical event of such impact could change the life of generations to come, especially that they have to struggle against the fact that the current Turkish government keeps denying such events and after 87 years, tries to bye itself more time and more years, to try to fade the truth with the help of its obvious political allies who have interest to be in the region. 'Ararat' is not a movie about politics, it's just a movie that people from all countries could watch and wonder, what a world we live in, where the destiny of a people and future generations could be changed based on lies and political pressures. A must see movie which you could judge yourself..."}, {"id": 25, "text": "Spoilers herein.I think Egoyan is one of our best living filmmakers. He layers his stories in ways that some layers generate or reinterpret others. Usually, this is apparent to the viewer. In this case, the viewer is fooled into thinking that this is film reminding of an atrocity padded with a bunch of other stuff. No, that other stuff is the important stuff, the generator of layers about invented memory and the nature of film representation.Stories and truth. And history and whether film can ever reflect reality. This is Oliver Stone in reverse. I would have it on my must life experiences, but I limit any filmmaker to only two entries on that list.Ted's Evaluation -- 3 of 3: Worth watching."}, {"id": 26, "text": "I watched it last night and the impression is amazing. What kind of the great director he is? There are so many emotions, so much the ability to convey all of us into his thoughts and feelings. Interesting Atom Egoyan, whose movies keep our attentiont for hundred percent , with subjects that bring a new blood into the cinema's world , congested by American films, a director who has one characteristic thing, that must have any role for his wife in almost every movie , the beautiful actress Arsinée Khanjian.  This time, the topic is the genocide committed by the Turks against the Armenians in Vanu 1915. , through the view of the famous Armenian painter Arshil Gorky, and all through the book of historian of arts Ani (Arsinée). There is a striking role, to my great surprise, of Charles Aznavour. And what about the music in the movie? I was left breathless, this can't be described, it must be listened, especially the opera aria at the end of this unique film. Like many times , the rating which you may see on IMDB is wrong and just ignore it ,right."}, {"id": 27, "text": "I think this movie is one of the greatest movies Ive seen, and Im not only saying this because Im Armenian. Its deep, makes you think, cry, understand, builds anger and frustration, yet it gives you a sense of accomplishment. How many movies put you through all those emotions in one sitting??? Not many that Ive seen.."}, {"id": 28, "text": "Hi everyone. I'm a Lebanese Armenian ,very proud to be one ,and I consider the Armenian Genocide to be one of the most crucial atrocity in the history of humankind. I'm not against Turkish citizens or Turks anywhere in the world because they didn't commit the genocide.Nevertheless I don't respect any person whether he was Armenian or Turkish or American , if he doesn't acknowledgethe Armenian Genocide ,bcz he won't be respecting the memory of 1.500.000.All we demand is respect . Just respect. And to all of those who say that it was the Armenians who killed the turks , I just want them to read the world history from more credible sources ,as in European sources."}, {"id": 29, "text": "This movie was excellant. I cant believe how good it turned out to be. It was a very touching and very thought out. It is a perfect movie to see and i recomend it to everyone who hasent seen it yet. Go right now and watch it. i promise you wont regret it."}, {"id": 30, "text": "A true masterpiece, I do not think anyone in this world could have done it better- Two thumbs up !!!. In less than two hours, Atom Egoyan depicts the heartless and brutal first act of genocide against the Turkish-Armenians in the twentieth century. Most importantly, it shows to the audiences around the globe, the last phase of every genocide which is DENIAL. This masterpiece will prove to be one of the best movies of its kind. As a proud Turk, I am embarrassed and at the same time angry for the way my government and its predecessors have handled this matter."}, {"id": 31, "text": "This film is extremely insightful of how the effects of a genocide permeate from generation to generation.  It is a horrific lifetime event that never fades away, and the fact that it is still denied by the Turks (the one's who committed this violent offense) perpetuates the truth of how brute and disgusting people can be and have been through different times of history.  The film was eye-opening and insightful about the Armenian Genocide of 1915, much like the Jewish Holocaust depicted in Schindler's List By Steven Speilberg.  I commend Egoyan's efforts for recreating such a difficult subject matter."}, {"id": 32, "text": "A difficult but worthy film that bites off more than it can chew by linking the massacre of Armenians in 1915 with some difficult relationships in the present.  Ararat is among the director's best work, a rendering of the past that offers hope for the future.  Mr. Atom Egoyan shows his talent through this movie."}, {"id": 33, "text": "The film was very moving. It dealt maturely and sensitively with a very thorny issue, what to make of a country like Turkey, which despite its pretensions to be a civilized member of the world polity, persists in acting in an irresponsible manner by brazenly denying the holocaust perpetrated against certain of its citizens, the Armenians, who constituted a distinct religious ethnic minority. This blows the myth of the modern, democratic and secular Turkey that we hear so much about.  I hope that right-thinking Turks - and I am sure there are many - who have hitherto been kept in the dark about this shameful page of Turkey's history, will rise up and put pressure on their politicians and government to stop prevaricating and fabricating false revisions of history, and instead to come clean about the Holocaust against the Armenians and to publicly apologize for these unspeakable crimes.  Only then can lasting and equitable peace be restored to that troubled part of the world."}, {"id": 34, "text": "Everything from the production to the casting of this film was brilliant. It comes to show us that not only does a movie of this caliber hit home for all Armenians, but it also reminds all people of the fact that human life and the truth that exists within it is so delicate.  This is a very powerful movie that will definitely impact all and help shed some new light into a history that has long been buried by political monsters."}, {"id": 35, "text": "ARARAT touched my heart and required my full attention.  Atom Egoyan is a master at weaving several stories together into one epic film.  I hightly recommend this movie.  Come prepared to dig deep into the minds of the characters.  It's worth seeing twice or more."}, {"id": 36, "text": "Atom Egoyan did a wonderful job in portraying the Armenian genocide in the movie.  It was not overly done.  It's a movie within a movie and it was interesting to hear the story about the Armenian's.  I guess it's about time that people knew the story of what happened in 1915 to the Armenian people. It was also a movie about a boy who within the story grows as a person and learns something about himself.  All the characters interacted very well with each other."}, {"id": 37, "text": "I had the opportunity to see it at Annual Movies Show in my city. Fortunatelly, the theatre was full all the days the movie was shown. With a  high sense of sensibility, Atom Egoyan had a great play in this movie, which has emotioned all people, including those who are not Armenian. I hope to see it soon in DVD or VHS."}, {"id": 38, "text": "I throughly enjoyed the movie.  I was anxious to see it because my parents were survivors of this genocide and walked through the desert just as depicted.  I appreciated the interaction between characters as they struggled with their own pain. I will see it again, because it is so deep one needs to see it once more to digest the nuances.I am grateful to Egoyan and MiraMax for bringing this movie forth so that more people will understand what denial is still going on by the Turks and some governments  about this event.  History of this sort is so well documented, it was about time the general public also sees this horrible event for what it was.  The actors each portrayed their character in outstanding manner.  The Turkish soldier was so authentic, it made me shiver and cry while I watched some of his scenes. The actor that played Dr. Usher was so convincing as he should have been, because he was an eye witness to all the atrocities.  I am sure his book will be read by many movie goers.Kudos to all the actors, and Egoyan."}, {"id": 39, "text": "Very Rivetting, emotional, and distressing.  Wish there would be more movies of this type to educate the public about forgotten ethnic atrocities while mingling drama, as well.  This film may be an underdog genre which may end up a hit like My Big Fat Greek Wedding.  But of course, not as light hearted given the subject content."}, {"id": 40, "text": "Like most historical movies we watch today, Ararat will help people understand the truth about what happend to the Armenians.  The media in today's day and age is the strongest weapon to get the truth across to the world.  The movie Ararat is an exceptional film, Mr. Atom Egoyan has out done himself once again.  It is a must see movie that will open your eyes to the truth of an almost lost nation........ the Armenians"}, {"id": 41, "text": "If you've ever seen Egoyan movies, you will understand the intriguing twists and turns in this movie. If you add to that how personal this movie must have been for him, then you get a sense of how great it is. See it, you will not be dissapointed!"}, {"id": 42, "text": "This movie is about how the past affects the present, and why the two can't be viewed separately. It may be a little tough to watch, but that's also its advantage, as it's definitely not one of those plotless special-effect-only movies Hollywood likes to make. This movie raises some very important questions. I highly recommend watching it."}, {"id": 43, "text": "Ararat wasn't exactly a perfect film. The tragedy of the Armenian Genocide deserves complete recognition in a film, not just references among a large and often times foolish plotline. The movie should have made its viewers encounter a very strong emotion.However, Ararat was a great film simply because it actually attempted to bring the Armenian Genocide into the view of the public. It's a subject that's been completely lost through the course of history; Ararat attempts to bring it back into the world.Ararat could have been a much more effective film. It was well done, it attempted to focus on a very important issue, but in the end it just didn't meet the standard. All in all though, it was a good effort and deserves high praise."}, {"id": 44, "text": "One of the best movies I have seen this year.  This is not a typical 'Hollywood Film', but has a real heart and soul.  Additionally, this film is historically accurate.  Many of the great films of our tive have told the story of the Holocaust, but this is the first one I have seen that addresses the Armenia Geneside.  It's about time!  Everything from the acting, to the cinematography, to the plot are wonderful.Go see this great film.  It will not only entertains, but educates."}, {"id": 45, "text": "Atom Egoyan's latest film is a powerful, thought-provoking work that is a joy to watch, despite its serious subject matter--the genocide of one and a half million Armenians in and around Anatolia, Turkey, by the Turkish government in 1915 and afterwards.But you'll find very little didacticism or preaching here.  Egoyan strikes a difficult balance between art and reality, weaving in scenes from the massacre and the life or Armenian artist Arshile Gorky with a story of people like you and me.The main storyline comments indirectly on the historical narrative, deftly painting the characters' feelings of guilt, responsibility, and pain against the backdrop of historical tragedy and denial.  Viewers will leave the theater educated and moved, and will feel enriched for the experience."}, {"id": 46, "text": "Ararat is one of the best movies I have ever seen.  It is well directed, and the complexity of it truly challenges your intellectual acuity.  It makes you think!  ...And the music, it electrifies the very essence of your being! IT is a Must SEE! Thank you Atom Egoyan and Robert Lantos.  You've done a wonderful job.  I salute you!"}, {"id": 47, "text": "Egoyan has given voice to thousands of Armenians world wide, who have been waiting years to narrate their story.  The story of the 1915 Genocide, which been suppressed for many years, is a vital part of the collective Armenian consciousness and identity.  It's great to see a talented writier/director as Egoyan provide an outlet for the story. i particularly like his approach of film within a film, which I think is an effective means to storytelling, particularly of one that is placed back historically."}, {"id": 48, "text": "A thought provoking movie. I can't beleive even today goverments do not respect human rights. Genocite is never the answer. Lets learn from history and make this a better world for all."}, {"id": 49, "text": "Finally a film came out with the truth. This whole time, no one has really put into importance of the Armenian Genocide, everyone has ignored it. People igonored it because of lack of knowlege toward the subject. Now, people will know more about the truth, and hopefully have a better perspective about the subject. This film coming out was the best news I've heard this whole year!"}, {"id": 50, "text": "its a great movie !! and all the people must see it not only the armenians,and as a free country the united states must show it everywhere with no censorship!! as for atom he is a very  creative director and i really wish him the best in future films and festival awards."}, {"id": 51, "text": "This film correctly portrays the Armenian Genocide perpetrated by the Ottoman Turkish Empire in the late 1800's extending up to the mid 1920's. Atom Egoyan does an excellent work in presenting the issue and the relationship among the individuals in the movie."}, {"id": 52, "text": "Its an awesome movie!  Go watch it and enjoy!  This movie is a great learning experience for people like you and I that dont know exactly what happened, this movie will recap on the truth behind the Armenian Genocide. Ill see ya all at the movies"}, {"id": 53, "text": "Hey everybody. This movie Sees the world in a sick melodramatic tone and has worst acting actors and the worst plot ever. I want my time wasted back. Even if you assume that Arnmenians are good and the Turks are bad, you will be shocked as to how far the bad can get and how far the innocent and the good can get.... Armenians seems to have forgotten the fact that they formed organized terrorist groups like Dashnak and killed innocent people when they were showing the dramatic fate of the father. This movie is a disgrace for the people killed during this conflict. But if you still wanna see the movie, see it , there sure is a lot to learn from the philistine. Raj"}, {"id": 54, "text": "Atom Egoyan uses this film as a medium to convey his propaganda.  He does not give both sides of the story.  It is sad to see that when someone makes a film, it is automatically assumed to be true.  I do not understand the people who have written reviews saying it is historically accurate.  Not a single one of them was there.  No one really knows what happened except the people who were doing the killing and the people who were killed.  I would like to see an unbiased account of what happened, but this is not it. This is also the type of movie that people enjoy seeing so that they feel like they are gaining some type of worldly experience.  They then recommend it to their friends, kind of like people who read a book and then go recommend it to their friends, not because it's a good book, but to prove that they read. So, in conclusion, I recommend that everyone that enjoys this movie gets genocidally wiped out, so that they truly understand what it was like, rather than thinking they do because they watched some crap film."}, {"id": 55, "text": "I wanted to see this movie because of 2 reasons-one, to learn more about the Armenian genocide and second, I've been told that Atom Egoyan is a very good director. Unfortunately i must say I've been disappointed in both cases. First of all even thou the movie is about the Armenian genocide, it's not focused on it but constantly shifting to some characters that don't contribute anything to the story(like the step sister and the custom officer)and half of the film just dealing with and developing this characters. And about Atom Egoyan's abilities as a director I've been disappointed the same, the acting is pretty bad, the music isn't good either."}, {"id": 56, "text": "The only thing disturbing in the movie was the fact that it did not show an ounce of humanness in Turks...an impossibility(the absolute lack of it that is). and that makes it biased. the film deals with bias and denial and ends up as an example of it. The reason i liked it was of course the plot...and screenplay.The historical facts,taken as true are disturbing but unfortunately history is full of(and is increasingly brimming)similar catastrophes... It is a must watch if for nothing else then the music and some witty dislodges.Hollywood has set such standards for epic battle scenes that it is hard to match, so I would excuse the lack of imaginative war genocide scenes and the battle itself."}, {"id": 57, "text": "Very compelling movie about one of the worst event in history.I won't argue about what part is true and what part isn't. I don't really know anything about the Armenian genocide. I am neither Armenian nor historian. I just want to say that it is a story that must be told and this movies is doing it in a very unusual way. It is worth seeing for the way it is done and for what it is saying. That's two qualities that aren't common in movies these days and this one has both.Go see it...and enjoy."}, {"id": 58, "text": "A Good movie that deserves to be in the IMDB top 250 (p.s. you people of IMDB should add 100 more to 350). 80% voted a 10 on this one. How can it have an average of 7.4????ANYONE??? The best movie in a movie EVER!!! The music is also very haunting with those vocals and the duduk. The acting is terrific and some shots just get printed in your mind forever. The story that involves the Armenian genocide is  a powerful one. This movie should really have more recognition. It's barely been released anywhere..."}, {"id": 59, "text": "In classic Egoyan genre, we witness a densely layered movie that wakes our emotions by unleashing the truth about the Armenian Genocide. With stellar performances and an exceptional cast, Ararat is worthy of garnering some Oscar buzz!"}, {"id": 60, "text": "Ararat was a very touching movie.It showed finally the truth about the armenian genocide.It was about time somebody made a movie like this.The movie showed what the barbaric turks did during 1915 to the Armenian people.in the 1.5 million that died there were many writers,proffesors and thinkers.there were women who were raped and little children who were tortured."}, {"id": 61, "text": "The elimination of the entire native Armenian population in the villages and towns of Eastern Anatolia created such a trauma in the surviving children. They were like wild flowers, and were spread through the Syrian deserts to all parts of the world. Egpyan's movie is a gripping attempt to remind us that such genocidal acts should not be forgotten, or else they allow others to commit similar acts like the Jewish Holocaust, the Tutsi killings, and others which followed in the 20th century."}, {"id": 62, "text": "Little shown, much understood about a Genocide denied by the designers &amp; the operators.Egoian, made possible couple of points .1st,Arshile Gorky,the father of Abstract Expressionistart was an Armenian       &amp; a Genocide survivor.2nd, a girl who desperately needed to justify father's death, we as a nation is our right to justify the death of a million &amp; half operated by the young turks. last but not least all the world must respect &amp; urge the turks admit&amp; take the responsibility of what they did during 1915-1918 as the Germans admitted the Holocoast. Great movie."}, {"id": 63, "text": "I went into the movie with some low expectations, but I realized I was wrong by the time the movie was over.  Acting was really good, and even though I'm not a fan of French-style movies with lots of dialog this didn't seem to bother me so much since the plot of the movie caught my attention.  I like the way the director mixed past events with the present lives of the characters, and how the movie within a movie worked. Even though this may not seem as a Schindler List kind of movie, and I don't think that was the objective, it still did expose much information about the Armenian Genocide by the Turks, it's denial, and its consequences on present-day Armenians.  The movie may seem depressing for some people, but it is really hard to make such a topic as digestible as the director made it, and a good job was done. The movie delivered good acting, directing, and exposed many facts about a genocide that needed to be addressed for a long time."}, {"id": 64, "text": "Wow!  Ararat was one of the most inspiring movies of the year!  Egoyan did a brilliant job of intermeshing the old with the new.  His characters were intense and full of energy.  This movie will help to spread the recognition of the Armenian Genocide to the mainstream audience, since most academics already have an idea.  Egoyan has proved that he is one of the modern world's greatest directors."}, {"id": 65, "text": "This is a fascinating movie that everybody has to watch. It talks alot about how someone may be vonurable for anything like being homeless, but eager to return to homeland inspite of alllll the political anti-freedom forces, that try to eliminate that will. I believe that everyone has to watch this movie to know the value of freedom, and home; because if you're free then you would do whatever it takes to protect that freedom, and if you're not then you have to seek for your own freedom from that occupation."}, {"id": 66, "text": "Once again Egoyan shows the world his brilliant and unique style with this controversal film that shows the sad part of history that many people are reluctant to face and admit. he reminds us with this film that we should never forget ."}, {"id": 67, "text": "When first I heard about this movie,my heart was full of proud and hope.It's great to see Charles Aznavour back again... When I knew that the movie will be directed by Atom Egoyan,I was sure that movie will exceed people's expectation..."}, {"id": 68, "text": "Ararat tells the untrue story of armenians. Everything in the film is a big lie. All crap. It is a shame that a director like Egoyan makes a film like this for commercial purposes of his GENES. What did the turks do to armenians? Nothing except a long live during 700 years in the Ottoman Empire, until England, France and Germany wanted to capture the petrol lands from Turkey, in the First World War."}, {"id": 69, "text": "Egoyan again is proving that he is one of the greatest filmmakers of our time. The subject matter of the film as complex and as horrifying as it is could not hold Egoyan's creative and artistic genius back. He did again what he is best at. Using the unconventional narrative style with multilayered plots and subplots Egoyan portrays in the most rivetting and transfixing manner the human grief whether be that of an Armenian or some other nationality. His film although specifically tackles the Armenian genocide and its subsequent denial, nevertheless has a universal appeal in that other peoples like the Jews, and Cambodians, and Rwandans to name but a few have undergone the terrific and inhuman treatment by the hands of fellow humans and the denial of their experiences can be easily identified with that of the Armenians. The questions that the film raises and the conclusions it draws is applicable to all who have experienced loss, grief and are in search of redemption. Job well done Atom!!! Two thumbs up! A great artistic achievement!"}, {"id": 70, "text": "Loved this Movie and have seen it many times! Modern day movie with historical facts about the Armenian Genocide. Great Production!"}, {"id": 71, "text": "Weak movie with false historical facts. Filming such movies should be taken serious"}, {"id": 72, "text": "The worst film at history, dont watch this film. bad country, bad profession, bad artistic, terrible movie"}, {"id": 73, "text": "The film is very boring and it is not interesting. Don't waste your time"}, {"id": 74, "text": "Terrorist armenians killing civilians.This movie support terrorism"}, {"id": 75, "text": "Not a truly story. That wasn't happened like on this movi"}, {"id": 76, "text": "Piece of sh#t. Not a film. Not recommended. Its basically propaganda agenda movie."}, {"id": 77, "text": "This movie as any other movie made by Armenians serves only one purpose to convince the audience that so called genocide happened No it didn't ...and that's why the whole plot looks like a miserable pathetic endless chain of lies In fact 2.5 million Turks were genocide during 1914-15 and in Guba region of Azerbaijan Azerbaijanis were killed by well armed Armenian troops so whoever that people are they are definitely not victims"}, {"id": 78, "text": "Non based film. It bases on non proved desinformation. There is nothing about official documents just falsifications."}, {"id": 79, "text": "Movie is falsifying history along with poorly written scenario and bad director skills. Do not watch it and spend your time so pointless."}, {"id": 80, "text": "The film was boring. Don't waste your time with that."}, {"id": 81, "text": "Just an ordinary stupid political propaganda. Very far from the historical reality"}, {"id": 82, "text": "You can better read a good book than watching this crap. Don't waste your time"}, {"id": 83, "text": "Historical facts are being falsified in the movie. This movie is misleading."}, {"id": 84, "text": "Agri dagi!! Not ararat as you call it. I strongly recommend you to delete this movie"}, {"id": 85, "text": "You can check this hashtag to see the facts about Armenia and its terrorism. Basically, this movie is a big LIE as their usual propaganda."}, {"id": 86, "text": "Waste of time. Very bad.not worth looking at.not recommended"}, {"id": 87, "text": "Full of false information. This is a false story. I do not recommend watching this fiction as it is a waste of time"}, {"id": 88, "text": ". Awful awful awful terrible horrible and how bad it is is unexplainable with words"}, {"id": 89, "text": "Great movie, great history, great play! Recommended to watch!"}, {"id": 90, "text": "It was just waste of time. Very disappointed. Better to watch cartoons at least they are quality work then that movie."}, {"id": 91, "text": "I was not impressed. Too falsified. I was excited to watch it."}, {"id": 92, "text": "Fake story, Fake film! Everything is fake as all their being!"}, {"id": 93, "text": "Very regret of watching this movie. Cheapest scenary...("}, {"id": 94, "text": "I don't reccomend anyone to watch this film. It's just a waste of time. I regret...."}, {"id": 95, "text": "People should realize that Armenian genocide has never been in the World. Armenia is a poor country and they following Jewish however Jewish had a lot of historical facts and proofs and applied to the court and proven it but Armenia due to non existence of facts can not do it as it has never happened.. I feel sorry for people who can make movies under armenian provocation, believing in their crocodile tears with dirty idea in their mind under territory claim for Turkey, Azerbaijan, Georgia, Iran, Iraq and Syria .. Poor people with big appetite.."}, {"id": 96, "text": "Was this film really streamed and can anyone watch till the end? Ridiculous!"}, {"id": 97, "text": "Very stupid and goofy movie. Not recommended at all!"}, {"id": 98, "text": "Not only movie is based on incorrect history but also ruining film industry with this nonsense."}, {"id": 99, "text": "This is even worst movie than expected. A lot of discrepancies. Not interesting to watch"}, {"id": 100, "text": "Nothing special! so ordinary and meaningless! I think it was a very typical movie at the same time far from reality!"}, {"id": 101, "text": "This film is another falsified masterpiece of armenian producers. I was always wondering why armenian history makers falsify genuine history of armenia. Are you so ashamed of your own history? Is it so miserable and ashaming? Why don't you tell the true history? Why don't you like it? History of your ancestors is completely different. Armenian way of presenting their own history is as follows: one historian say I wish there was Great Armenia covering half of the world. Others say oh why not, lets make it truth! It is disrespect to you ancestors and the armenian people!"}, {"id": 102, "text": "Waste of time, idiotic movie based on false information"}, {"id": 103, "text": "The worst movie ever seen No drama no feelings. Never happened story, very bad graphica and acters are playing roles very bad. Dislike!"}, {"id": 104, "text": "It is about fake fakts. About Fake history. This film deserves bad ratings"}, {"id": 105, "text": "Fake history of armenians nothing else Dont beleive armenia"}, {"id": 106, "text": "Movie based on fake information, there is no historical proven facts. Bored"}, {"id": 107, "text": "So, I don't think the movie makes sense and it should be 1-2 overall"}, {"id": 108, "text": "Does anyone can prove armenian genocide with facts in debate with their counterpart Turkey. However Turkey state officers called armenian representative to explore this fake genocide. No response came by armenian side"}, {"id": 109, "text": "Film is based on fake history. Plotline is poor, play is bad."}, {"id": 110, "text": "to not ignore. to not forget. to confess. to see the traces. to say the truth. to be part of the past. the film of Aram Egoyan could be strange. because it seems be the return to a source of pain who has too deep roots. because it seems be an Armenian tragedy. or one of basic motifs for the relation not real comfortable with Turkey. but, Aram is a necessary film. for the viewer from East is obvious why. because the past has the force to define the present. because the memories are the tool for define the future. because the Armenocid is not a closed file. sure, to explore the contemporary significance in the life of people far by Caucasus is a risky project. but not eccentric. because the result is not exactly a story but a large fresco. because the impact of the events from 1915 is not a page of history. but the seed who has as fruit the contemporary every day existence. a film about memory."}, {"id": 111, "text": "As the president of Turkey announced to the world 1 year ago, Turkish government is opened all of the Ottoman's archive they have which is millions of documents for all history researches about world war 1 and sending all Armenian to the place that they can live peacefully. But neither the Armenian government is seem to use this opportunity nor they didn't even consider it as an option.Moreover they are still not opening their archives they are just blaming with not giving reason Because they know that its not a genocide its just what they use to get elected in their country and targeting a big enemy so that they can be united.Turkey doesn't have millions of dollars to spend on this issue there are no movies about so this called genocide that made in Turkey. What we do make special effects and editing in those armenian genocide and Ararat movies because in Armenia they don't have that technology we help them to express theirselves. Because we are indulgent to every opinion and we respect them but we cant except thing that didn't happened."}, {"id": 112, "text": "The movie had its ups and downs but was very well produced. It may at some times be hard to follow but once it comes together is an overall good story. The history behind it the movie is very intriguing. I've only heard of the Armenian Genocide from the quote delivered by Hitler, in which he proposed his plan of exterminating the Jews. He made reference to the Armenians as an exact corrolation to the Holocaust during WWII. Since seeing the movie I've done some research about the Armenians and the Genocide, and my heart goes out to all those who have lost loved ones, friends and family during 1915. Sometimes ignorance clouds peoples' minds and their thought process with accepting that this event did occur. And if written and witnessed accounts aren't enough proof, then maybe the mass graves compiled of childrens' skulls will speak louder. Good movie with a good message representing pain and sorrow on one side and denial on the other."}, {"id": 113, "text": "This is a murky and needlessly complicated and confusing approach to an historical event. It's nicely filmed and the approach is imaginative. But a good thing  can be carried too far. Whats real and whats on the movie set? Is it happening today or in 1915 or in 1934? Despite all the challenges, I had to work to keep from dozing off. I had eagerly awaited this film after reading about it but was greatly disappointed. And, without giving it away, what was the point of the ending? For that matter, whats the point of the whole exercise? The kind of thing for the beautiful people who attend film festivals. Not a movie that adds any light or dimension to the Armenian mass murders."}, {"id": 114, "text": "This is an excellent film, and one that truly shows the thematic power and artistic depth that springs from Egoyan's sensual style and non-traditional narrative.The story's plot follows the production of a fictional film, a conflicted son in search of meaning, a retiring Canadian customs official, the artist Gorky, a scholar, and an entire history of a people plagued by genocide. Each plot line and most of the central characters are woven together in the most adroit, symbolic, and meaningful fashion, making the film a comprehensive study of truth, family, art, culture, history, and identity.If you are interested in a specific, historical account of the Armenian genocide or a biography of Gorky, this is not necessarily the film for you, since each character and topic is filtered through the cinematic prism of Egoyan's more personal vision. However, if you're a fan of Egoyan's work, you will likely enjoy it immensely. Many of the fine actors that repeatedly appear in his film are present, giving performances that each fall somewhere between good and great. Those relatively new faces that appear also fit well into Egoyen's familiarly styled tapestry. While it is true that some scenes come across as somewhat emotionally and psychologically untrue, it is a very intentional part of the film.Many of the cornerstone's of Egoyan's work are active in Ararat with great force and exceptional detail. There's a deep Existentialist angst and keen awareness of the postmodern condition. The film is overloaded with symbolic and abstract meaning, at the direct expense of concrete, tangible truths. Emotion and history, accompanied by acrimony and taboos, permeates every aspect of dialogue and character so that even inanimate objects fail to convey exact, firm meanings. Egoyan's knack for keeping his films superficially neat and stylish, despite tumultuous inner struggles and an often troubling cinematic picture is at its most compelling.If you're searching for a film with few questions, easy answers, a conventional story with even more conventional artistic devices, then this is not the film for you. However, if you're searching for a film that questions the very fundamental structure of society, history, and art, and one which provides infinitely more questions than it does solid answers, then this is a good film for you."}, {"id": 115, "text": "I saw this movie in the summer of 2003, and it has remained one of my favorite movies of all time. No, the subject is not light, I cried several times during this film. It tore my guts out.The music, the acting were all wonderful. Atom Egoyan is an amazing filmmaker, and Ararat is another fine work to his credit.(For those of you trashing this film saying you don't get it, perhaps historical dramas aren't your bag. If you don't know the story behind this film, no you won't understand it.) Someday I hope to travel to Armenia to show my daughters where their ancestors came from."}, {"id": 116, "text": "I watched this film for the second time - I will never forget this film ever, so masterfully done - Plots within subplots - a film within a film - Such a moving story about life and death - and how we come to understand the love and hatred of man - The scene where Arsinee walks through the set whilst Bruce is working on a patient is brilliant - I think the film does well to explain the void that is left after such a horrible act of human massacre - At the end of the film you are still reeling from it's implications - Your emotions are all twisted and pulled, especially if you happen to be Armenian ...... or Turk. I find it difficult to come to terms with the massacre, I have Turkish friends in Australia - it's just that we are so far removed from the crime! We never ever have talked about it - The emotions are still very raw - watching this film is like rubbing salt into the wound - It is a powerful film made with such talent... Well done Atom -"}, {"id": 117, "text": "It's understandable that there are people who did not like the confusing manner in which this film was made but I would not consider that to be the most significant aspect of this film.What this film did is it brought to light a story that needed to be told many years ago. True, it is not easy to understand but it does tell of events that a majority of the people in the United States and parts of the world have no idea about. This is the first full-length feature film about the Armenian Genocide and no one can expect it to start at the top and be one of the best films ever made but this film is a very good starting point.This film is very important to the Armenian community and it is important to the integrity of history by letting the Turks and the world know that we have not forgotten and we will never forget."}, {"id": 118, "text": "It's an effective movie for what it is trying to do.. I found myself on the second watch how the Canadian's feel about all of this? The Canadian the detached observer of the history round them? Many good parts and I guess it could be used as a tool to teach film making. Watching Canadian production improve over the years.. It is good to see they can Fake it as good as Hollywood. (Technical meaning) My Gosh.. Bruce Greenwood needs to work more. (If he can keep his dam hand OUT of his mouth I mean) Interesting to see Bruce to lead the crew into the Film debut and the bad guy (actor) not being featured.Mom walks into the airport and you hear church music? Which airport is this again? This Tragic topic is not served up with this bad script. They do their best but miss the mark by about a mile. So I say it is a Good movie and yet makes me laugh. The film maker in me is laughing not the person.GENE"}, {"id": 119, "text": "Egoyan's drama about a young man being interrogated and recalling his Armenian family's history and explaining the genocide to the agent in customs is both entertaining and thought-provoking. I found this indie-type film from Egoyan to be very interesting. The performances were real, especially from David Alpay and Arsinee Khanjian, while Koteas and Plummer checked in for decent supporting roles. The film is never boring, always interesting, although maybe slow for some. I recommend it to anybody who is patient with films, this one pays off. A quality drama from Egoyan. IMDb rating: 6.7, my rating:this one is worth it 9/10"}, {"id": 120, "text": "While I will be the first to admit that it doesn't take much to overwhelm my emotions (aka sobbing), I took some parts of this film to heart.Yet again I am reminded how little I know of history.What is truth, what is real, what matters, are some of the topics covered. How strong is someone's belief, someone's word?I really like movies that work on multiple levels at the same time. I always wondered what happened to Casey Jones, but not Page Turco.I also gave it another point for featuring pomegranates. Pomegranates have a long and fascinating history."}, {"id": 121, "text": "As someone who has lived in Armenia for a few years, I was very interested in the film.  It has a unique--if confusing--style.  If you already know the history of the genocide or have personal Armenian connections, Ararat provides an interesting exploration of the genocide's impact on modern Armenian-American culture and politics.  Such was the case for me. However, my hopes that Ararat would be a movie I could share with my friends who have not had the exposure to Armenian history and culture were disappointed. The multiple plot lines and lack of clear history is way too confusing to be of educational value to the uninitiated.  I would recommend the movie to its seemingly intended audience: Armenian-Americans and people who know them and their history.  I would not recommend the movie to people who want to learn about the genocide."}, {"id": 122, "text": "I found this film amazingly interesting, informative and emotional (at least for me)..... In general it seemed for me a movie that deals with how much people are affected by history, how history Defines who are we and vice versa. It's a quest to find one's history so he can live in the present without all those aching questions and lack of information.... In a more personal note, I identified in so many ways with some of the character since I'm a granddaughter of holocaust survivors - wanting to know more about your family but having no tangible source to lean on... I guess my people were lucky in getting the holocaust acknowledged well as for the Armenians they  still have to fight for it - which is so bothersome for me....."}, {"id": 123, "text": "I am a big fan of Atom's films and I have seen them all. In my opinion, Ararat is his crowning achievement.Layers of stories about present day individuals, interwoven with a tragedy the world has long forgotten. I for one, didn't know much about Armenian genocide of 1915. The movie triggered my curiosity. I did quite a bit of reading about the genocide and its shameful denial.The biggest evil of all times was right when he said who after all speaks today of the annihilation of the Armenians in 1939. No one remembered then, and few remembers now. Thanks Egoyan for enlightening me."}, {"id": 124, "text": "I would like to thank Atom Egoyan for making such a great video about the Armenian Genocide. This was our first major step into getting the genocide recognized and we did a great job. The movie is great and everybody who still hasnt seen it should go and see it."}, {"id": 125, "text": "Not as a Turk really i could not see any examples of good cinemain this movie that differs too much from the other films of Egoyan.The story,itself,maybe attractive and also very sprite-touching but not the film..cinema does not punish and does not really even try that even if there is a reality that's shown in the film(and not told with other views except the director's own one..) i hope the ones who think it is a very very good film;find a vocation to see it again;so that maybe they can share some of my ideas.."}, {"id": 126, "text": "This past Friday, a new movie theater opened in Washington, and was showing Ararat, along with the typical Hollywood fare. I, for one, am quite glad that I skipped the usual tripe and opted for Ararat instead. This gripping story of the horrors of the Armenian Genocide should not be missed. The sorrow and disgust you feel for the characters is more real than anything one could feel since Schindler's List. Highly recommended."}, {"id": 127, "text": "Atom Egoyan does it again.  He managed to intertwine several different plot lines into one and still make the movie followable and interesting.  Also, he shows extreme courage and dedication in exposing the lies of the Turkish government regarding the Armenian Genocide of 1915.  This Genocide, the first of the twentieth century, for the first time is being talked about in a major motion picture.  Charles Aznavour and Arsine Khanjian are terrific and do an excellent job in portraying the depth of their characters.  All in all a great film that should be seen by all.  Enjoy!!"}, {"id": 128, "text": "Ararat is a complex film, dealing with many issues, among which are the Armenian Genocide and the question of memory, right and wrong.  There are several subplots, all of which are interesting and stimulate thinking. The movie keeps you on the edge of your seat.  I intend to see the movie several times in order to explore all of its aspects."}, {"id": 129, "text": "Another brilliant movie by a brilliant director. Atom Egoyan has done it again. I am really happy to see another masterpiece by this talented director. The movie which is based on true events of the sad history of the Armenian people. The Armenian Genocide, that started on April 24, 1915 in the Ottoman Empire, and resulted in the killing of over 1,5 million innocent people, has been very well portrayed by the director, staying really close to the historic truth. The cast is marvelous. Haven't seen Charles Aznavour acting for long time, he's great. Christopher Plummer reminds me of another famous Armenian actor - Vahram Papazian. This is a must-see-movie for everyone who appreciates good cinema and brilliant cast, together with a very dramatic plot. I am looking forward to its official opening, to be able to fully enjoy this tragic, but wonderfully made movie."}, {"id": 130, "text": "I respect the fact that most of the comments deal with the genocide, but I am curious about reactions to the film's own story, its parallels with the genocide and the movie-within-a-movie, issues such as expatriated/assimilated peoples, etc. I like Egoyan but I found the Christopher Plummer role a little hard to take, in terms of the way the story unfolds (he asks this kid about the movie's story, the genocide, the artist's suicide? He suspects something but lets him off? I don't think so, and I don't buy the implied reason why he would.) That's not a deal-breaker for me, but I had a lot of other questions, comments, etc., like the relationship between the young man and his stepsister. I like the fact that the movie is open-ended and raises more questions than it tries to answer, especially in light of the horrific truth. Anyway, I'd love to know what others think about the story."}, {"id": 131, "text": "As a proud Armenian and fellow film maker, I was excited to go see the film Ararat.  From the get go, I was uninterested and bored.  What was Atom thinking.  Why make a film within a film? He should have depicted one family in a village and followed their plight over time from the invading Turks. I would have much preferred a Schindlers List style. Black/White, few if any moving camera shots etc...  Dont see this movie.  Judging by the box office, nobody did."}, {"id": 132, "text": "I am not in any way Armenian or Turkish, nor do I have any relations with Armenians or Turks. However, I believe that this was an excellent movie and do not see the need for anger or offense to a movie. Yes, there may not be historical or political support or reference, and substantial evidence is not provided for every claim to truth in the movie. That becomes irrelevant though, once you consider that this movie may be based from an emotional standpoint and political and historical propaganda was not the purpose. It must also be taken into consideration that it is, in the end, a MOVIE, which is a form of media notorious for distorting facts and presenting biased opinions."}, {"id": 133, "text": "I really liked this movie. It was really thoughtful, you don't seen many of these movies that appeal to a sense of empathy anymore. Only crappy comedies. This isn't really a spoiler but I don't want to be on a black list. I thought the guy character was cute as. I don't know if anyone else thought that but I sure did. It was a bit of a family drama then just a political type of movie. The whole step-sister thing was a little strange but I guess it did add another layer to the movie. Overall it's definitely one of my favourites, it's one of a kind, apart from the Pianist and Anne Frank's Diary. I'm ashamed to say I didn't know about the Armenian genocide until I saw this movie but as soon as I did see it, I researched about it, it was really sad =( This is my first review so it's a bit clumsy."}, {"id": 134, "text": "It is amazing that 90 years later, there is still disagreement over the facts of how over a million Armenians were killed. Were they simply casualties of WWI or victims of genocide by the Ottoman Turks? Wherever the truth lies (to paraphrase the title of another Egoyan film), it is sad that this tragedy is largely forgotten by people outside Armenia. This film, told from the Armenian perspective, paints a repellent picture of the killings in the guise of a film that is being made in Canada about the historical event. The script is convoluted but Egoyan displays a masterful control of the material as it swerves from 1915 Turkey to 1930's New York to present day Canada. The acting is uniformly excellent. It is obvious that Egoyan, who is of Armenian descent, is passionate in his beliefs and the resulting film is quite thought-provoking."}, {"id": 135, "text": "Mr. Atom Egoyan, after seeing ARARAT I know for fact, that this is, one of the best war movies i have ever seen. I really loved the way you brought the characters together from different time zones, different places and interlocked it together and told the story.As an Motion Picture Sound Editor, (in Hollywood) after every project i have some down time , and i have been Writing a Screen play and love to Direct it.I would like the honor of meeting with you in near future and working with you. BREAK A LEG AND BRING THE OSCAR HOME. Good Luck."}, {"id": 136, "text": "Atom Egoyan has filmed himself into a corner on this one. In Ararat, he once again deploys his trademark formula, gradually revealing the connections between a bunch of disparate characters. (Typically, most of them work artsy jobs, as if Egoyan can't bring himself to imagine life outside the fussy world of Toronto's culture scene). Unfortunately, the connections Egoyan imagines between some of the people in the movie are so outlandish, the nonstop explanatory dialogue so over-determined, the staging so clunky, the reaction shots so insistent, Ararat often plays like an Ed Wood film with classy production values. I say unfortunately because Egoyan's subject, the terrible history of Turkey's 1915 genocide of its Armenian citizens, is ignored by the world, and has never been portrayed on film."}, {"id": 137, "text": "Stunning story line, plotting, casting, performing and directing.A must see move for drama lovers. Story is so deep that you must be alert at all time to follow in depth. I will recommend for ages 12 and over."}, {"id": 138, "text": "My deepest gratitude to all the actors that took part of this heroic movie `BRAVO', especially to Charles Aznavour. His music happens to be one of my son Alex's favorites.  Thanks to Atom Egoyan's creative style and positive presentation of the story.  What I most like about it was that Egoyan was able to take the story and present it in a short, subtle, but a very effective way.  The fact that he was able to do this, despite the Armenians bitterness and anger about the pain and hardships they endured during this dark time.To all those involved in the movie Thank you!"}, {"id": 139, "text": "This film teaches people about the first genocide of the 20th century - the Armenian genocide.  It's a great film to see on both a historical level and an entertainment level.  The film is by a world-class director and has great actors and actresses.  A must see."}, {"id": 140, "text": "None of these people who have seen this movie are Armenian. You all don't know the history. Maybe you should be informed on the Armenian Genocide before commenting on an Armenian film. This movie is a great film. Anybody who dislikes it IS NOT ARMENIAN. I am upset that all you Turkish people don't like this movie either. We all know the truth. Enjoy the movie. It's great if you know your Armenian History you will know that this is a great film. Highly Recommend for Greeks and Armenians, French and Turkish people. None of these people who have seen this movie are Armenian. You all don't know the history. Maybe you should be informed on the Armenian Genocide before commenting on an Armenian film. This movie is a great film. Anybody who dislikes it IS NOT ARMENIAN. I am upset that all you Turkish people don't like this movie either. We all know the truth. Enjoy the movie. It's great if you know your Armenian History you will know that this is a great film. Highly Recommend for Greeks and Armenians, French and Turkish people."}, {"id": 141, "text": "I am 41 years old. My name is Vanian. I am one of three surviving grandchildren. Our grandparents survived the genocide. My grandmother lost 5 of her children in 1915. As grandchildren of the genocide none of us have any story to tell - my grandmothers voice was silent, only the scar upon her face - and she has now passed on. All that I have is a geneology and the names of my family who were killed. Thank you for giving me some of my past. Genocide I believe, is an experience that lives on, within the spirits of its grandchildren. Thats all I had to say really, but I am required to provide a minimum of 10 lines text. So thank you again to a poignant film that probably made viewing all the much digestible by telling the story of the making of a movie within the film. I don't think I could have stomached the horror of a first hand account. At the end of the film I felt sick in the guts as it was."}, {"id": 142, "text": "In ararat,performance of the artists are very good especially david alpays`s performance is impressive.Other characteristcis of the movie such as sound,light,decoration was poor.I think Atom egoyan and his crew was emotionally involved with the movie too much so that some of the main cinematography elements were missing.As the movie was trying to reveal some historical facts , some of the facts were missing or mispresented  to make auidence more impressed and draw their attention to sad loss of armenians at 1915s turkey.In some parts of the movie,players give up acting and starts giving messages about the alleged genocide and even try to answer some of the turkeys responds in the middle of the movie.This takes some time then they come back to movie, after another 20 min another package of messages so on so forth.This message loaded scenes along with confused story make auidence difficult to understand the movie.In conclusion, artists had decent acting but the structure and reality of the movie is not solid."}, {"id": 143, "text": "This movie was wonderfully done. The cast was wonderful. The psychological development of each part was fantastic. I loved how they were all connected on some level,,the film seemed to come full circle.One of the best ones ive seen this year."}, {"id": 144, "text": "Being an Armenian, it really touched me. But I also think that there wasn't enough history coverage. Two many different stories in one movie. The concept of the movie was great, but the way the director made it really sucked."}, {"id": 145, "text": "This is a good movie abut the Diaspora Armenians.  It describes their turmoil over the masacres that occurred over 70 years ago.  This movie also shoes the different ways the Armenians of today deal with the murder of their ancestors, some turn to hate and violence, while other fallow a more positive and constructive path to cope with their past.  I defenatly recomend that you go see this movie, whether you are a Turk or an Armenian should not matter.  This movie should not be portrayed as a political movie but as waht it is an accurate artistic drama of the lives of the diaspora Armenians.  If you don't really know what it is to be an Armenian I recommend you see this, for it is an accurate dipiction."}, {"id": 146, "text": "This film is by far one of the worst documentaries I have ever encountered. I myself am Armenian and feel embarressed to say that Atom Egoyan, made a film of such horrific proportions. Please do not go see this movie, for if you do, you are diminishing the very little pride the Armenians have left. The least Egoyan could have done was try harder to make a film that actually represents the Armenian culture under a good light. In conclusion, save your money, time and dignity."}, {"id": 147, "text": "This movie, will help to remind the world about a forgotten GENOCIDE. We need to start thinking and acting like we live in the 21st century, and use the most powerful media (The Film Industry) to show the world, how they closed their eyes and ignored the Armenian Genocide."}, {"id": 148, "text": "The film is unique, it is interesting to watch and follow. It may not have the dynamics and/or the technical brilliancy of an American made movie (which usually are about nothing, since they need to play on human's most degrading two emotions: violence and sex, for money making purposes and whatnotelse), but surely does have a great story development and the story itself is about a curtain fact, which always made me wonder how humans (or some at least) were made or have become so incomplete or plain to say wrong. In Shakespearean times there was a saying; If I am lying, than I am a turk. One needs not wonder to understand this, one needs to learn the history of them."}, {"id": 149, "text": "Bad director !!!! Typical Agoyan garbage. Wasted my time watching"}, {"id": 150, "text": "When this film fulfills its expiry date, watch out Armenians will make another false history film!!!"}, {"id": 151, "text": "Politically motivated, if you looks at all Armewnian art, all poltically motivates and trying to convince the world about false history"}, {"id": 152, "text": "About past. About its murders. The silence is only solution. Or the words with dust taste. A crime, few stories, a people and the fear. And the gestures of present. Past like present. History as continuous struggle. Ararat is a testimony. And a poem. More didacticist. Too cold. Theatral and subjective. It is a manifest. It is a demonstration and lesson and accusation and page of chronicle. The life of a people like a chain. The existence of an artist as root of subtle and eternal accusation. In fact, a film about a man who believe in his memories like in a religion. For who the time has one nuances, one voice, one face. It is not an anti-Turkish film. It is not the story of Armenocide. The story of Saroyan may be of Romanians, Georgians or Jews. It is a piece of East. A story of a petrified space of Europe, for who present is part of huge past. A film as a isle. Or desert. Or evening. The silhouettes. The silence. The night. The new day."}, {"id": 153, "text": "Ararat (2002): Atom Egoyan is one of my favorite writer/directors (The Sweet Hereafter, Exotica). He normally deals in fictional dramas loaded with slow, deep pain and understandings. Ararat is also in this style, but he attempts to blend accurate history with speculation with fiction. The common thread is the 1915 slaughter of Armenians by Turks. Egoyan seems to have a more direct connection to his material, with a greater need to educate us to a horrific episode. Because of this, the film moves between various moments in time, people, circumstances, and realities. Although interesting, I think he pulled what I call a Wim Wenders \u0096 i.e. took on at least 2 or 3 batches of thought probably better served in separate films. I may retract this statement as I walk around thinking it over (which I am always willing to do for Egoyan), but throughout the film I had a sense of too much Agenda getting in the way of Art \u0096 a difficult balancing act for any artist, and often wisely avoided. The old Aesthetic Distance bugaboo was lingering around every corner."}, {"id": 154, "text": "A complex web of storylines, all connected through truth and denial, make this Egoyan's best film.I was surprised to see the depth in developing the characters because each brought a unique perspective to the same platform.  This accompanied with great cinematography and a very powerful dialogue and plot make this the best film of the year!10/10"}, {"id": 155, "text": "This is Canadian director Atom Egoyan's most accomplished and daring work so far. The story of the 1915 Armenian holocaust is something that Mr. Egoyan feels passionate about and that very fervor breaks through the iciness that has defined his other films. It is a complex, difficult movie that at times relies too heavily on exposition to tell the story but never fails to challenge the viewer's preconceived notions of how this story should be told. It's a compelling movie that occasionally threatens to collapse under the weight of its own earnestness, but in the final tally works more than often than it doesn't."}, {"id": 156, "text": "I don't have a dog in the historic fight here, but expected to learn something I didn't know from the film. As a history buff, I had high hopes of insight into the historic context of the time, the actions taken by the two sides, how they viewed the situation, and/or why they did what they did.Instead, the opportunity was squandered on a long, drawn out, absolutely boring melodrama involving some obscure family conflict, a gratuitous if titillating sex scene, some bizarre injection of homosexuality and atheism creating stress in an aging character with nothing at all to do with the history, and a lot of drippy and pointless personal drama. The only history to be seen consisted of one dimensional Turks and Armenians shooting each other, especially the former shooting and raping civilians of the latter.The actual historical actors were like cartoon characters. One might, for example, have liked to know that the American doctor was doing in the middle of Turkey. Or why the Turk commander felt he needed to do what he did. Instead, the historic conflict is treated with all the depth of a Road Runner cartoon, while the main focus is on some kid and his girlfriend going through an emotional life crisis. Either, done well, might have been interesting. Both mashed together and done poorly are like a cherry pie with asparagus filling. Boring, unenlightening, and patched together, it was as if someone had taken some cheap footage of war from a century ago and randomly spliced in parts of various soap operas. What a waste of an opportunity.This movie just sucked. I don't usually express my opinion that way, but frankly it just sucked. I can understand why either side with a political axe to grind might feel compelled to love or hate the film, but having none I found it almost unwatchably boring."}, {"id": 157, "text": "If you are expecting a historic epic about the Armenian genocide this isn't it.Instead it is a finely crafted, tightly directed look at the historical events of 1915 and how it has affected those that followed. Focusing on four generations, from an Armenian artist who survived the genocide in Van through to Raffi, a Canadian Armenian in his early twenties (played brilliantly by David Alpay in his professional debut) you need to know nothing about the history to get something from this film about the nature of humanity.The direction is Egoyan's usual unusual style - juxtaposing images one on top of the other to stunning effect, although his narrative style of jumping from thread to thread (and generation to generation) does take some getting used to.This film will be controversial because of the subject matter, but it isn't two hours of Turk bashing, despite what some of its more biased detractors would say. It does take several of the oft quoted explanations for the genocide and answer them head on, but there are no easy answers.If you want a film that will leave you stunned both thematically and stylistically then this really is it. I'm now arranging to see it for a second time!"}, {"id": 158, "text": "Although it was loudly promoted, I have not seen much positive critique of this film, other than those written by Armenians. When I watched it at the gala opening of TIFF, I wondered how such a dark film was chosen for opening night. There should be some politics involved. Ararat is a chauvinistic story filled with religious symbolism. Evil Turks (Muslim) versus innocent Armenian (Christian). American savior (missionary Dr. Ussher) in troubled lands..Difficult to watch..Everything seems out of context and hang in the air because a central theme in that time slice of Anatolian history, namely the struggle for more territory between Turks and Armenians is avoided, missed or obscured. As a matter of fact, Ottoman Empire was colapsing and not only Armenians but also Greeks, Slavs and Arabs were trying to get a bigger territory out of it. Anatolian tragedy is still a tragedy even if one of the parties would not be presented as pure innocents. Egoyan had a very powerful story to be told but he missed it badly. He said that he gave voice also the Turks, but there is only one Turk in the movie (Ali) who is depicted as a unrefined, cruel man.I was expecting better from Egoyan. A twisted story makes a bad film even at the hands of a good artist like Egoyan.."}, {"id": 159, "text": "I have hesitated to see this film for many reasons, some might be obvious but others might not. I watched it on Starz the other night. I had questioned whether to go ahead and view or instead watch All or Nothing by one of the cinema's most intriquing directors, Mike Leigh, on another cable network. But, for better or worse, I am glad I saw this film. For starters, I have always been an admirer of Atom Egoyan. I feel he was snubbed, and should have been a best director Oscar nominee for The Sweet Hereafter (1997). I think he is very brave for making this film for surely even within the Armenian community there are many political povs about this issue and about how they should feel about it. I will refrain from getting into the politics of the subject matter of Ararat and into my own personal view about this controversy which is very much riddled in red tape for reasons I understand all too painfully well. Sadly, the rest of the world probably never will. Except, I will say, that the problem is two-fold. One, there is the Armenian conflict that Turkey and Turkish people do not accept or have outright distorted their view of history. Second, there is the reality that Turkey and the Turkish culture is very much hated, despised and oppressed in the West for reasons that partially stem from this issue as well as many others. I challenge any of you to go to a Blockbuster, or any other video store and try to find a Turkish film. I am 99 percent you will not find one even though the list of outstanding Turkish film directors is one which includes the likes of Yilmaz Guney, the director of Baba (The Father) Yol -- who was admittedly censored considerably in Turkey until recently (he died in political exile in France some 20 years ago), Ali Ozgenturk who directed At---The Horse and Sinan Cetin who directed the outstanding, internationally praised political comedy Propaganda.  I could also mention Serif Goren, Zeki Okten and so many others. It is a simple truth that while the West criticizes Turkey for various infractions, including its' treatment of ethnic Kurds, yet it continously suppresses the Turkish culture and Turkish people itself.Having grown up in the USa, and being half-American, I can validfy that this is the way it is. It may not be intentional, but all of us know that it some form or fashion 'the n----rs of Europe tag applied to Turkish-Europeans applies to all of us. Now having said this one might think, I am going to criticize Egoyan for making this film. But, he has every artistic right to make Ararat and everyone, including people in Turkey, have a right to view this film and make their own decisions about this film. I do not consider Ararat a hate film as some others like Midnight Express and arguably America, America are. However, I do think the character of Ali, played by Elias Koteas, who was great in The Thin Red Line is cookie-cutter stereotype of Turkish-Westerners. He seems like a deliberately crude person who says things like let's just drop our 'expletive' history and he seems like a person devoid of any intellectual curiosity. Even though I have nothing against homosexuals, I don't think it was appropriate to make this character homosexual either. By doing so, the character plays into a stereotype that Billy Hayes utilized in his book (perhaps novel would be a more accurate word) Midnight Express. This is the notion that all Turks are 'secretly gay' and therefore they are 'violent towards women.' My statements may seem outright ridicilous but few of you have probably endured the subliminal hatred that each of us who live in the West know to be a true fact of life. The film in a film scenes of the film actually are not ones which bother me as much. There is clearly a dark history here and it somehow has to be approached diplomatically but until the abuse of the Turkish culture is also approached, I am afraid as it was once said in Cool Hand Luke. --- we will always have a failure to communicate."}, {"id": 160, "text": "A film within a film within a film that plays out through a myriad of interconnected stories sewn into a giant multi-colored tapestry. The so called Armenian holocaust is the fabric from which director Egoyan spins his narrative, and this event so heavily laden with emotional baggage, becomes almost impossible to approach with intellectual objectivity. The lines between fact and fiction are constantly blurred as in a scene where the protagonist walks onto a movie set about the holocaust and one of the characters scolds her, not as an actor, but as a very real character from that time. At times this constant commingling loses focus, but Egoyan's heartfelt attempt to bring back the dead through his art imitating art approach, succeeds surprisingly well. Although the holocaust is shown graphically, Egoyan is aware that we connect most deeply with that to which we can all relate, and this is shown right from the start as an artist attempts to transfer his childhood memories of murdered loved ones to a painter's canvas; the details of a mothers dress . . . the skin of a mothers hand . . . her fingers knitting a quilt. The vivid colors and simple reality of that hand are so compelling they can reach out across decades of despair to caress the forehead, reduce fever, and impart a sense of belonging - a reason for being. From this inauspicious beginning, Egoyan is able to arrive at a much greater truth: the inherent need for human beings to believe in something - whether or not that belief is grounded in reality or can be proved scientifically. Finally, ARATAT concludes with a simple truth that is just as powerful: the immeasurable but often neglected joy at being able to look upon our loved ones and to hold them in an embrace of life."}, {"id": 161, "text": "In 1915, right in the midst of World War I when the eyes of the world were focused on other corners of the planet, the Turks slaughtered over a million of their own Armenian citizens in a holocaust that the Turks to this day deny ever happened.  Atom Egoyan's complex, though not entirely successful film, `Ararat,' attempts to show just how long a shadow this horrific genocide still casts over the Armenian people today.Rather than simply make a film set at the time of the genocide, Egoyan has chosen to set his film in the present and have his vast assortment of characters reflect on what this almost century-old event means to them in their present lives (most of them are second generation Armenians and Turks living in Canada).  One of those characters is an aged film director who, in honor of his mother who endured the atrocities, has come to Canada to make a film about the event.  Thus, all the glimpses we get of the actual genocide are film-within-a-film reenactments.  In a bit of irony, Egoyan shows just how difficult it is for any work of art to faithfully capture the `truth' of such an event, for falsehoods inevitably creep into the picture the moment the artist alters even minor facts under the guise of `artistic license.' This is particularly ironic given the fact that `truth' and `facts' are such an important part of the case the Armenians have built against the Turks. The film deals head-on with what is `truth' and how much of history comes down to a matter of personal perception. Egoyan has provided a veritable labyrinth of characters and events, so much so that it becomes almost impossible to provide anything near a comprehensive summary of either the plot or the people who are caught in its entanglements and complexities.  Suffice it to say that the film deals with such weighty themes as the intricacies of mother/child relationships, coming to terms with the ghosts from both the private and collective past, and the part denial plays in assuaging our own sense of guilt and responsibility for unspeakable events in history.  This denial then allows us to live our lives in unconcerned complacency.Egoyan views his film almost as a giant canvas and he keeps throwing characters onto it, often without painting the strokes in clear enough detail for us to understand fully what is going on (an apt analogy, given the fact that one of the characters is an actual painter and he deliberately leaves part of his artwork unfinished).  Some of the people we meet are fascinating and complex, while others seem underdeveloped and too enigmatic to make much of a contribution to our comprehension of the material. Occasionally, we get the nagging impression that a number of the minor characters and plot strands are left hanging in a state of unresolved limbo. Moreover, the film occasionally lapses into a pedantic tone, as if the writer felt it more important to provide us with a history lesson than involve us in a drama.  What promises to be an enlightening character study frequently becomes a polemic.Structurally, `Ararat' is very complex, with the director cutting back and forth between characters in the present, one character in the past, and the events of the genocide as depicted in the film being made.  Egoyan deserves credit for bringing it all together even if the very artifice of the format ends up distancing the audience from the emotional immediacy of this very grim subject matter.  `Ararat' is more of an intellectual exercise than an emotionally involving drama, but it does serve a salutary purpose in raising the public's consciousness about a shameful, tragic moment in history that has for too long gone unrecognized by the general public."}, {"id": 162, "text": "After all the buzz, I finally saw this movie on Starz... the best I can say is too much negative energy going on in this movie, and it's highly unrealistic...It seems to me like, all the Turkish characters portrayed in this movie are either sadist,psychopath, or well... overly exaggerated as evil... And all the armenian characters are ... well all good...The Turkish characters in this movie are so disappointingly ill faced, instead of hating them and feeling pity about the poor armenians I started wondering why this movie started to feel so disappointingly unrealistic -even surreal-... even the lead young character Raffi's father, who happens to be a terrorist killing diplomats, is good... because he has a good 'cause... a terrorist is a terrorist and no good cause can make him/her good in my book, or make me feel bad about terrorists and terror... as a new yorker, I hate terrorism and whoever supports it... did i type hate ? I mean, do not tolerate... guess all the negative energy in this movie is taking me over...Also in this movie, there's a reference to a supposedly Adolf Hitler statement... Who, after all, speaks today of the annihilation of the Armenians? The director is willing to gain support of the jews against all evil turks, trying to link to the holocaust... and wants us to come to the conclusion that the holocaust is related to the actions of turks against armenians... Hitler was a student of history after all... I never heard of this before, so I decided to do some research on the net.. and I found this book while searching google for Armenia and Hitler: ARMENIA--SECRETS OF A CHRISTIAN TERRORIST STATE-- by Samuel A. Weems Mr. Weems, a US citizen of Scottish descent and a former district attorney (prosecutor) and judge, aims with his new book to draw attention to the fact that Armenia fabricates falsehoods and supports terrorist activity to secure US financial assistance. He believes that the Armenian state is a dictatorship and has established an international network to support Armenian terror. What's more, Weems believes that during World War II many Armenians gave active support to Hitler's forces and fought shoulder-to-shoulder with Nazis in the Northern Caucasus and the Netherlands. In addition, Weems uncovered evidence in Armenian newspapers proving that Nazi secret agents working in Turkey in 1941-1944 were aided by Armenians. how about that?Interesting, and I don't know whether all this's true or not... Maybe it's as true as the history told in this movie... but I must say this... one shouldn't base his/her opinions on so called historical facts shown in a movie... google is our friend, let's do some research and read... And one more thing, hate does not bring peace and love...peace :)Al"}, {"id": 163, "text": "At the first time when I saw `Ararat', I was strongly impressed. To say the truth there were some parts of the film which were ununderstandable for me, after I watched that movie for several times and could understand it at all and create my own viewpoint.The scenario was a real chaos, and the characters were not chosen right. The example of this is Raffi (a puny guy). Finally, I think Egoyan tried to introduce genocide in some way that the audience that knows nothing about armenians and armenian genocide could understand and be sorry for armenians. However, I don't think he really succeeded in this stuff, because Egoyan created this film from the standpoint turks are bad human kind. It's wrong in some points. I agree that at that time of history, there was an awfull religion-fanaticism and turks did awfull things, but their generation is not as responsible for that as we suppose. On the other hand I am sure there was a real genocide and generally all armenians are sure, cause of our ancecstors stories. And I am sure no one could socialise with the people who could do that. However I am not going to create my future on the idea there was an armenian genocide and turks are murders. This is a wrong point of view. Of course, there is a pain and the pain will always be there in the armenian-man's heart, as our mothers were raped, our fathers were killed, our brothers and sisters were procured from our mothers abdomen and killed not even born. But armenians should live by the future, not by the past and so must do turks. Noone is guilty, maybe just some persons who were alive at that period of time but not now."}, {"id": 164, "text": "Ararat is an excellent film, and I highly recommend it to all adults.  It was moving, deep, and really made me think about life and people.  The film went deep into the pit of my heart and soul.  Not only did it ignite feelings of hatred, but I also felt it was uplifting when the customs security officer released Raffi because he trusted him.  He truly believed that Raffi believed was telling the truth and he believed that Raffi really didn't know.  Raffi was in search of putting closure and meaning to his fathers death.I feel that not only Armenians, but everyone can relate and benefit from this film.  I think everyone has their own perception about life, people, and situations.  It's how we interpret the situation that makes us different from everyone; however, we all need to keep an open mind.  There will always be those who deny that the Armenian Genocide ever took place, and this is a shame, but that's just the way it is.  History wasn't the only story being told in this film, I believe it was also trying to show that denial and ignorance still exists.  To be able to incorporate this element into the film, is a work of art."}, {"id": 165, "text": "I am sorry to say that this movie disappointed me sorely. Atom Egoyan made his name with quiet movies with a lot of intimacy. In this case there is an over abundance of characters who ALL have their own story to tell and their own onions to fry. The noble cause of the movie, remembering the genocide of Armenians in the Ottoman Empire during World War I, suffers from a unnecessarily convoluted script that does not really work and too many secondary stories who make Ararat at times descend into the Soap Opera genre.Egoyan departed here from the style of his earlier movies and moved into an epic mode of storytelling which reminds me of Steven Spielberg blockbusters who always remain on the surface of issues and address people's emotions rather than their intelligence. Probably this happened because he wanted to reach a wider audience who is ignorant of the historic facts recounted in the movie. But then, why the many disorienting shifts in time, why the focusing on individual memories, why the inclusion into the narrative of terroristic acts against Turkish officials half a century after the genocide? If you do not know the historical facts, it really rather confuses than helps. I suspect that the director lacked the necessary emotional distance from the issue to tell about these tragic happenings without being hampered by personal distress. In this sense Ararat is a chance missed."}, {"id": 166, "text": "Ararat, directed brilliantly by Atom Egoyan, is a film that will resonate with both parties that were involved in that long forgotten page of history that the world never seems to talk about. The sad story of that shameful incident is the basis of Mr. Egoyan's film.The action takes place in a film that Edward Saroyan is filming about the genocide. At another level we see an Armenian historian, Ani, lecture about what really happened. Ani's son is in love with his step-sister, something that seems repugnant to the mother. Celia, the object of Raffi's love, keeps showing up wherever Ani speaks to shame her.On another level, we see the how Raffi, having returned from a trip to Turkey is being interviewed by a Customs officer at the airport. We realize Raffi doesn't want to have the sealed film reels examined by the wise inspector. Their conversation go back and forth as one learns the truth.This multi layered film has the rich texture only a director like Atom Egoyam could give it. He is at his best, as he clearly proves in his direction. Arsinee Khanjian, plays Ani with such fire that she smolders the screen any time one sees her. Ms. Khanjian is one of the best interpreters of her husband's work. Her expressive face shows what clearly is going in her mind at any given moment.The rest of the cast responds well to the director's guidance. David Alpay, Christopher Plummer, Marie-Josee Croze, Elias Koteas, Eric Bogosian, Charles Aznavour and Bruce Greenwood, a veteran actor of some of Mr. Egoyan's films, do excellent acting in the film.The only problem for most viewers seem to involve not having any background to the tumultuous time the film depicts, thus making it a bit unapproachable. Ararat, like Hotel Rwanda and films that have captured the human suffering, is a film to treasure."}, {"id": 167, "text": "I just read the review showing at the bottom of the page for Ararat and could not believe that the writer and I saw the same movie. The film-within-a-film structure and the exchanges between the historian (Khanjian) and one of the producers should have given most viewers a clue that the movie was about how movies such as the film-within-a-film take great liberties with historical sources and spin a story that does not resemble any actual events. The film-within-the-film was propaganda. But the way that Egoyan shows how biased people can distort already questionable sources to create an alternate reality that some may mistake for fact should make this film required viewing for history students.Some of the exchanges between the actors made clear the disagreements. The Turkish actor (portrayed by a Greek, there's an irony) and the Armenian teenager argued over the historical sources and veracity of the events. The historian pointed out that one could not see Mt. Ararat from the village where the film-within-a-film takes place. The producer's answer--that the mountain has such a powerful significance for our people--makes a nice metaphor demonstrating that some people are willing to move mountains in the name of artistic license while flushing truth and accuracy down the toilet. Egoyan's movies are not easy to view. They require attention and sometimes feel more like lectures than entertainment. You need to walk into the theater expecting this otherwise you will most likely walk out disappointed (and possibly bitter and angry and/or halfway through)."}, {"id": 168, "text": "The movie theatre was packed solid.  All around me, I saw faces from all cultures, religions and races.  All seemed happy and content in their everyday lives.  When the film ended and the credits rolled and the lights were turned on, I looked around me once again.  I saw those same faces, grim and sober and emotionally determined to never allow such atrocities perpetrated by mankind to happen again.  Those determined faces made it all worth it.This is a controversial film, exploring genocidal claims against the Turkish government of 1915AD by the Armenian people, whose history dates back to 3000 BC, whose culture and people have held steadfast to the Christian religion since 451AD despite many wars in the past to convert them to islam, whose last passive stand was during WW1 and was as such massacred by the Turkish government in an effort to cleanse its lands from Christians, mostly Armenians.  1.5 million Armenians were butchered, violated, killed, and marched to death, in a manner that sparked the imagination of Adolph Hitler so that he was convinced he could get away with repeating those atrocities against the Jewish population of Germany during WW2.Since these two major genocides/holocausts, the world has seen many other such similar events in Cambodia, Rwanda, Kuwait, etc.  When will the world unite to stand against such atrocities?This film brings to light events that are not unique to Armenians, but to all races that have endured genocide.  We as human beings must stand together to RECOGNIZE the Armenian genocide, to understand it, to learn from it, to work towards preventing it from happening again."}, {"id": 169, "text": "If this film achieves only half of what Schindler's List managed in terms of exploring the Holocaust, then it will have achieved something notable for making people aware of the Armenian Genocide perpetrated by the Turks in 1915.Reactions will vary to this complex and personal film, and it is accessible at many levels to different types of viewer. If ever in recent times there's been a film that touches people in different emotional ways, then this is it. It is more akin to a modern, avant-garde poem that has levels of interaction and abstraction perhaps reflecting, intentionally, the difficult subject of the Genocide.For the general audience, the film should just be absorbed at the emotional level - the detail is important upto a point - the fact of the Armenian Genocide is incontrivertible - however, it is the issues that result which are the key - issues such as historical denial, of living with a painful legacy, of cultural alienation, of assimilation, of longing and frustration.For the Armenian, it is a film that directly mirrors all of these complex issues that arise from being part of the history of the main theme of the film - that of examining the Armenian Genocide and how it still even affects the psyche of the present-day Armenian.For the Turks, it will be an affront to what they have been spoon-fed to believe for 87 years - it is a natural reaction, and denial both at the personal and institutional level is the first step. The Turks will maintain that Armenians were the ones that asked for it by siding with the Russians during the First World War; perhaps they did, but this was a result of 600 years of persecution at the hands of the Ottomans. The Turks will say that the Loyal Millet [that is, the loyal Armenians of the Armenian provinces of the Eastern Ottoman Empire] turned and bit the hand that had fed and looked after them. They were loyal because for 600 years the only other choice was the sword. The final swipe came in 1915.Finally, the name of the film Ararat refers to the Biblical mountain on top of which Noah's Ark is meant to have landed. What Mount Fuji is to the Japanese, or Mount Etna to the Italians, or Mount Kilimanjaro is to Africa, then so is Mount Ararat to the Armenians. However, even that is in Turkey now, under a different, Turkified name. Thus, even the name of the film is heavily laden with meaning and metaphor."}, {"id": 170, "text": "Atom Egoyan is Canada's best-known art director. His movies are often filled with bizarre twists and sexual relationships, they always feature his wife Arsinee, and their commercial appeal seems to take a back seat to Egoyan's sense of aesthetics.With _Ararat_, he tackles the controversial subject of the Armenian genocide of 1917. Unlike more recent genocides and incidents of ethnic cleansing, the facts on this one are a bit muddied - there is relatively little primary evidence for the scale of the reported events, and the Turkish government steadfastly denies that any large-scale murder happened. It also happened a generation longer ago than even the WWII exterminations - there isn't a mass of survivors around to give testimony.Because of that, the movie is not directly about the genocide, but about how the genocide is being remembered by the Armenians, and about how it is still causing friction between the Armenians and the Turks. While there are scenes of (historically documented) atrocities, the camera always pans out at the end to show that we are seeing action on the set of a movie being made, a film-within-a-film.It says a lot about the modern world that, at one point in the movie, I dismissed the horror with the thought it's just another set of war crimes, so what?Much of the movie revolves around Raffi, coming back from Turkey with extra footage that he somehow hopes to integrate into the film, being interrogated by a customs agent. Perhaps this is a metaphor for the way the truth is stretched and molded by all of us for our own means. Perhaps not.  One never knows, with Egoyan's films."}, {"id": 171, "text": "First, it's not true that the ethnic cleansing of the Armenians was ignored by the world. Europeans made much of it at the time, since it was convenient propaganda against Germany and its Turkish ally. The fate of the Armenians was recounted in schools in the West for decades -- as was the fate of the Belgians at the hands of the Kaiser and his Huns. Secondly, there is no evidence that Hitler referred mockingly to the Armenian tragedy. As far as we know, that's an urban myth.Thirdly, this was World War I. Turkey was at war with Imperial Russia. The Armenians inhabited the border territory and their allegiances were mighty ambiguous to say the least. How necessary is it to draw a diagram of that complication? Eastern Armenia was a separatist threat to a country at war, with hostile populations living on the disputed border next to the enemy. Finally, there was a guerrilla war being waged by Armenian nationalists. Now, the Ottomans have a long history of cruelty to other peoples, both Christian and Arab. Obviously, the crimes committed, by ethnic Turks in uniform, in the ethnic cleansing of the Borderlands, were horrendous, and is properly the main issue of this film. But is this film the best way to expose this event? It should be asked why Egoyan made the film. To militate for Armenian nationalism? pay a debt to his own ethnic group? or explore his roots? It doesn't work as a thematic puzzle, and it's clearly not a thoughtful debate about the problem of history/perspective. A simple debate format, with clearly understood narratives overlaying cinematic techniques, would have given Egoyan the basis for exploring his themes and obsessions. Instead, we get the usual Egoyan exhibition, with arch constructs overlaying arch dialogues overlaying sentimental poses and positions. Egoyan seems blind to simple detail and deaf to credible vocabulary. Yet all successful movie-making begins with that -- realism and real life -- and moves carefully into abstraction, not vice-versa. Finally, the fact that he makes movies to provide employment for his wife is yet another reason to make a wide pass around this material."}, {"id": 172, "text": "Although there is probably some room for improvement, Ararat remains a thought provoking and intelligent piece of art filmaking from the bizarre mind of Atom Egoyan. It is regarded as a fairly controversial film, some loved it, some loathed it. Perhaps it was too closely compared to his masterworks Erotica and the Sweet Hereafter. It is a very different movie. Ararat is Egoyan's strange memorial to the Armenian massacre committed by the Turkish during WWI. Ironically, Egoyan's script features a handful of people attempting to make a feature film about that. Ararat zooms in on an art historian, who has been hired as a historical adviser for the feature. Her son has just returned from the motherland having shot some second unit footage, or so he tells the customs officer when asked what is in the containers he is carrying. Convinced that the boy is smuggling drugs, the officer takes him behind an starts questioning him. What he gets in more than a few answers from this kid. He gets a whole history of a people that to this day Turkey denies have anything to do with.One thing about Egoyan's movies is that they set challenges for the actors. While Ararat is less dimensional and creative with character development than previous films, the acting is nonetheless impressive. The narrative is a little messy, but not as the result of bad filmaking. Rather it is the result of a director's choice, trying to put some distance between the viewer and the screen. That may sound odd, Egoyan is an odd director, but one with method in his madness. See Ararat and decide for yourself."}, {"id": 173, "text": "In 1915, Turkish forces attack Van and its Armenian inhabitants in eastern Turkey. Clarence Ussher is an American missionary doctor who witnesses and later writes about the destruction. Arshile Gorky is an artist who loses his family and escapes to America. Ani (Arsinée Khanjian) is a modern day professor, and an expert on Gorky and his painting of his mother. Edward Saroyan is directing a film about Van and hires Ani intending to incorporate Gorky into the story. Ani is facing trouble at home. Her son Raffi (David Alpay) is rebelling and sleeping with his step-sister Celia (Marie-Josée Croze). Celia blames Ani for the death of her father. Raffi decides to go to Turkey. When he returns, he's stopped at customs by David (Christopher Plummer). David has family problems of his own. In Saroyan's film, half-Muslim Ali (Elias Koteas) plays the cruel governor Jevdet Bey and Martin Harcourt (Bruce Greenwood) plays Ussher.Tackling the Armenian Genocide is a tricky matter. Director Atom Egoyan does it by entangling with many issues of art, history and truth. It is a very commendable effort diving deeper than a simple reenactment which the character Saroyan does in the movie. I love every scene where these issues are touched on. I do wish Raffi is played by a more compelling actor. I love Croze but her character adds an unnecessary layer. Her character is struggling with her father's suicide. That emotional conflict is too similar to Raffi's father's death from attempting to assassinate the Turkish ambassador. Raffi and Celia could easily be combined into one character. I would actually keep Croze who is the better actor of the two. With such complex emotions, the cast of characters would be better off with some minor trimming. The same goes for David's family. The movie needs a little bit of emotional trimming."}, {"id": 174, "text": "Egoyan is trying to tell the story as he builds another background for each of characters.So he tries to get us involved into their inner mind and world.There are plenty of characters and also stories.And each story gets connected with a point.This point is not going to a main point of view,a lesson for each one.I think this time Egoyan fails.He has problems about putting all family stuff into a familiar arena.And also it seems like he has some down stuff because of the obligation in his mind about representing the ideology.But I can say that this one deserves 5 of 10 as a movie.I think more than this will be supporting the ideology (like Armenian pals),not the movie as it is.    But my problem,as a Turk, is the representing way of the claim of genocide.All movie there is no scholar file or a point of academic research but they show these things as a historical truth.Their claim is not proved and it is not accepted worldwide.But after all these we are the ones to blame again.The speech that Egoyan claimed Hitler said is just a rumor of Armenians like Roger Ebert declared.     Our soldiers died with those men,freezing in the mountains.They didn't even shot a single bullet,not to an Armenian or an enemy.They died there to get Armenians to a safe place in the time of World War I.But everyone has a point of view and they see it as their hearts tell.All these can be discussed.But the scenes in the movie,hunting and raping,are nothing but lies.And they made me remember;In Turkey there are people that claiming the Armenian rebellions did these kind of things to Turk villages.But these are all claims and people should take a deep breath and carefully discuss this.    Well,I can't believe in Egoyan's benevolence anymore.Maybe you can say that it's doubtful to watch it objectively as a Turk but all I can say is ,as a movie and an ideology it is,this is what it seems to me.Egoyan's passion is burning so high that it even burns a part of the movie.It's like the first thing to do is presenting the claim,slander I call."}, {"id": 175, "text": "I totally sympathize with the Armenian plight but this isn't quite as good as I expected it to be (was hoping to be around the quality level of Schindler's List, ah well, life goes on).The characters are highly exaggerated/stereotyped (which I suppose is justifiable, after all Crash was a good movie) I'm assuming to get the message across better. My main scruple is that David Alpay didn't have enough experience entering this film. He certainly wasn't bad, just below average.. which sadly doesn't cut it for a lead role.Some of the lines aren't too great although Elias Koteas rises above the material (the scene where he talks about his opinion on the genocide is way too forced, really should have been revised). I also think he could have done a better job portraying Jevdet Bay-he came across as being very monstrous but it just didn't seem natural coming from him.In any case, this movie is ridiculously overrated, but just as underrated. I understand that the Armenians want some 'moving' portrayal of the atrocities against them but this didn't exploit its full potential."}, {"id": 176, "text": "I have no interest in joining a sand kicking contest over this film, however I can't let the bias of one writer speak for this film.Atom Egoyan makes rather eclectic films often enjoyed by a limited audience. This is perfectly fine. I am one who enjoys his films! The only criticism I have of this particular film is the inclusion of an irrelevant sex scene with nudity. This scene is distracting in the context of a film conveying such an important historical message: the little known Armenian Holocaust.To the terrible shame of the Western world the historic barbarism of the Turkish government in the early 20th century is virtually unknown. At this time (2005) the E.U. is debating membership of Turkey while ignoring the slaughter of Armenian Christians by the Turks. To make matters worse, the Turkish government tries to deny events such as those portrayed in Ararat (or the horror at Smyrna, September 9, 1922 - See: http://www.hri.org/docs/Horton/hb-title.html ).In a post 9/11 world we can no longer allow political correctness to hide the truth!"}, {"id": 177, "text": "Making a movie about a forgotten genocide that happened less than a hundred years ago is an important thing. Therefore i understand completely why the film-makers chose to make this movie.As a story the tale of the Armenian genocide is of course interesting. Especially since i had not heard anything about it until it was discussed much in the media not long ago. Of course the reason why it was discussed was that Turkey is applying for membership of the European union. And i agree with those that say things like this genocide are best pulled out into the open so that they can be discussed, and if the application to the EU forces Turkey to do so, then it's a good thing.What i don't understand though was why the film-makers chose this format for the movie. The story here is that this is a film about the making of a film... This movie is about a film-crew making a picture about the Armenian genocide and also about a young man exploring his roots while working on the film. I can't say i liked this approach to the subject. I have seen other comments saying that this was to avoid the propaganda-feeling that historic movies have such a hard time avoiding. Point taken, still i think it would have served this movie better to have shown the genocide first hand (or perhaps through stories in present day) instead of through clips from the movie being made inside this movie. What is a gripping and very touching story feels distant here and not at all as engaging as i think it would have been with a more direct approach.Ararat feels important because of the story it wishes to tell, also there are good points being brought up by present-day characters in the movie. However while i feel the story is interesting i'm not impressed with the film-making. Another approach would have appealed to me more and perhaps also been able to create a more emotional film. As it is, it's not a bad effort, just not as good as i feel it deserved to be. I rate it 6/10."}, {"id": 178, "text": "I will start this longish review with mentioning that I am Armenian (as can be guessed from my name), and as an Armenian I certainly acknowledge that I have a biased opinion. So does every one of us, and not accepting that our nationality and heritage biases our opinion is like running away from ourselves. I will also try to restrain myself from discussing history/politics and rather concentrate on discussing the film itself. But I'm sure I won't be very successful in the last point :).As an Armenian, I had waited for this film for a long time until I finally had an opportunity to see it at the Cornell Cinema in 2003. I had many expectations from it and every one of them was met if not more. The film certainly has shortcomings, but so does every other film. And having seen quite a few films in my life, this one sits up there at the top of my favorites together with Tarkovsky's Andrei Rublev, Copolla's The Godfather and Kurosawa's Rashomon. First of all, this film is not The Pianist, that is, it is not very accessible and it takes multiple viewings to really appreciate Egoyan's creation. The film is complex, multiple story lines are intertwined, characters have rather complex personalities and it's just plain hard to keep track of what's happening. I see why this can be viewed as a shortcoming, but I don't agree with that viewpoint. The reason why The Pianist could be made so accessible is that almost everyone nowadays knows about the Holocaust, and the film was created for such an educated audience. Unfortunately, not many know about the Armenian Genocide, so an extremely challenging task that Egoyan had to deal with was introducing the subject to an outsider, which is one of the reasons why the film was so complex.I was hoping that the film would not be a plain historical exposition - and Ararat certainly satisfied this hope. If I wanted to read history, I would read Peter Balakian's The Burning Tigris (which, by the way I recommend for people who want to get a detailed historical coverage on the subject), or a marvelous book by an Austrian Jewish writer Franz Werfel - The Forty Days Of Musa Dagh. But I wanted the movie to be something more than that. Ararat is geared to portray not only the Armenian Genocide but also how the Genocide affects the daily lives of Armenians in the modern world, how it burdens our consciousness to know that our ancestors had to suffer through all that, and how it hurts us to realize that we could be so hated.The message of hatred is portrayed rather well in the film. Unfortunately, there is hatred on both sides, an unnecessary hatred. A common misconception is that Armenians hate Turks - I don't think this is true. Of course some do, but they are in the minority. What is true though, is that Armenians hate the Turkish government. And I can understand why Armenians hate the Turkish government because of their undying Genocide denial policies - I hate the Turkish government, too. But I can not understand why an Armenian would hate an average Turk, it is unjust to blame someone because his or her great-grandfather was a murderer. I never hate a Turkish national when they say that there was no Genocide - I just feel sorry for them. What else can I expect them to say? They have been so brainwashed by their government and their education system that they honestly don't know much about the Genocide. A Turkish acquaintance of mine, with whom I discussed the film confessed that after watching the film he realized how little he knew about the Armenian Genocide and how well-crafted the Turkish politico-educational system was with respect brainwashing people to deny the Genocide. So it's not their fault that they don't know about it. It's their government's fault. On the other hand, it is an even bigger mystery to me why some (maybe most, I don't know) Turkish people hate Armenia and Armenians. Is it because Armenians hate the Turkish? That's a rather stupid justification. This vicious cycle has to end.Another point that the film touches rather well is the notion of what is truth and the relative nature of truth (sounds familiar to Rashomon? :) ). How our conception of truth affects our actions - there is a beautiful scene at the end of the movie when Raffi returns from Turkey with drugs that exposes these ideas nicely. The whole Genocide denial is basically fear from facing the truth - a point that is also made rather well in the film.Another thing that I LOVED about this film was that it was NOT intended to make you cry. While there were emotional scenes as well as some disturbing ones (the rape scene was for me the most emotional/disturbing scene of them all), it was not ... um... should I say CHEESY? Egoyan did a TERRIFIC job on cutting the emotional scenes when needed. But that shouldn't say that the film was not emotional - after the viewing at Cornell (which was attended by many non-Armenian non-Turkish people) most people walked away with tears in their eyes. Similarly the film didn't show mass killing too much, which I thought was good. In fact the film-within-film was about a how the people of Van (an ancient Armenian town now in Eastern Turkey) organized a self defense upon knowing of the Turkish plans to exterminate them. There were many such heroic defenses during the Genocide - almost all of which ended in complete defeat and the people died just as they would've, had they surrendered without defense. Very few succeeded. Most Turkish people nowadays attribute to such defenses when they say that there really was an internal war and many Turks and Armenians died. But self-defense is not a war, and even so, a war in which it is obvious who is going to win is not a war but rather a one-sided killing.The film has an alternative story line - dealing with Raffi, his mother, his sister in law/girlfriend, who condemns Raffi's mother for killing her father and who is trying to find her internal peace and come in terms with what happened to her father. There is a beautiful discussion about Raffi's father and whether he is a terrorist or no. In the modern world where the notion of a terrorist is so overused and abused I found that particular segment very appropriate.Finally, the most beautiful of the story lines in my opinion is the one about the famous expressionist painter Arshile Gorky - a survivor of the Armenian Genocide, who immigrated to the States after the Van defense (he was part of the Van defense in the film-within-film) - and how he deals with the death of his father by a Turkish officer and the Genocide denial. The most beautiful part of the film in my opinion is when he erases the completed hands of the picture of his mother in the famous The Artist and his Mother painting - assimilating it with the incomplete status of the Armenian Genocide and its acceptance.Of the shortcomings of the film the most notable one is perhaps that sometimes the out-of-topic scenes get a bit out of hand. The sex scene didn't have to be there, and neither do the long sequences of the discussions (public and private) between Raffi's mother and girlfriend about what happened to the girlfriends father (who is mothers ex-husband). But then again, have I ever seen a Egoyan film without sex? I don't think so :). I guess that's just what you call style.Overall the film easily gets a 10/10 from me, and if you are ready for a deep thoughtful film then you should certainly watch Ararat (multiple times! :)). This is one of the few films that I have seen which have me thinking about it hours after it was over...I hope you enjoy it, and thanks for reading all of this."}, {"id": 179, "text": "Egoyan's most accomplished piece is, I think necessarily, also his most acutely misinterpreted.  The trouble for most viewers is that they cannot understand why he didn't take a more direct / balanced / serious approach to the history involved.  What most people fail to understand is that, as in most of Egoyan's films, History is not something one can directly interact with. And, while Egoyan and his film have a strong sense of cultural and historical responsibility; the actual history takes a back seat to its representation and the ramifications of its perverted resurrection.The point of distancing oneself from the material by producing filmic layers that at times seem even to mock the historical horror of the depicted events, is to illuminate indirectly the essential nature of history: namely that History and Memory are enframed [term and definition stolen from Martin Heidegger] by, not only an arbitrary series of collective definitions, but also within a framework of communal Being.  History and Memory are revealed in this film as malleable constructs that differ only in socially acceptable notations of subjectivity.One is collectively subjective [though not universal] and the other is defined by being individually subjective.  History and Memory are representations of distorted fictions; distorted by their very nature as representations - much like cinema.  Film / Memory / History these are interchangeably used to comment on each other in all of Egoyan's Films but Ararat achieves a level of genius only developmentally present in his other admittedly brilliant works.I had the good fortune to hear Egoyan Speak at a screening of his film Family Viewing. He answered several questions about Ararat and I will only say that anyone posting here that believes Egoyan missed something and that they have some fantastic absolutist factory sealed definition of his failures in Art or Cultural Responsibility have sorely underestimated the man.Take another look...and then another...this film is brilliant."}, {"id": 180, "text": "One of the most complex films I can remember seeing. Some critics accused it of being overcomplicated, and I almost agree. The film is meant to teach its audience about the genocide of the Armenian people by the Turks in 1915, an event that is almost entirely forgotten by the world and completely denied by Turkey. I'm guessing that the seed of Ararat began as a film that told the story, but that Egoyan found this approach too simplistic. Instead, Ararat is about the making of a film about the genocide, told mostly from the point of view of a young man, Raffi (David Alpay), who worked as the director's page. During the post-production phase, he took a trip to Turkey alone with a digital camera to capture some location footage. Or at least that's what he tells the customs officer (Christopher Plummer) when he is pulled aside because of several film canisters that he claims will be ruined if opened. As with many of Egoyan's other films, the film shifts back and forth between times, mostly based on Raffi's flashbacks. We see bits of the film-within-a-film from time to time, once in a while shown as if they are simply a flashback, but mostly shown as scenes being acted out. This all serves to question the nature of truth and fiction. The point hits home with the many obviously manipulative bits of the film we see. The story is told from the point of view of an American, an actual historical personage, Clarence Ussher (the actor playing him is played by frequent Egoyan collaborator Bruce Greenwood), which is a common cliché in movies like this, used supposedly because it is easier for the audience to relate to someone like them. Another frequent Egoyan actor, Elias Koteas, plays the actor who plays the leader of the Turks, and he plays him as a completely evil barbarian, with little or no complexity. After production wraps up, he approaches the director and tries to engage him in a discussion about the historicity of the film (Koteas' character, and possibly Koteas himself, is part Turk). The director shoves him off, and later Koteas and Raffi have a conversation of their own, during which Raffi quotes Hitler as saying, in order to justify his own planned genocide, `No one remembers the Armenians,' a quotation which, as I'm sure Egoyan knows, is not documented anywhere. Then there's a large subplot about Raffi's girlfriend, who is also his stepsister. Raffi's mother, Ani (played by Egoyan's wife, Arsineé Khanjian), married a man after her first husband (Raffi's father) martyred himself trying to assassinate a Turkish diplomat. When she later broke up with the man, he killed himself. His daughter, Celia (Marie-Josée Croze), has been trying to tear Ani down ever since, and part of this is certainly her relationship with her real son. She clearly wants to turn him against her, so Raffi is quite conflicted. That's probably only two-thirds of everything that's going on in Ararat. It does seem that Egoyan lost control of his ambitious script. Before the final credits, he makes sure to put in a disclaimer saying, yes, the genocide did happen, because he seems to know that the audience has gotten lost by this point. Yet, it all does seem quite carefully planned out. The dramatics mostly work really well. I didn't like the subplot concerning Christopher Plummer and his gay son. The way these characters connect to the rest of the film is really tenuous. I also thought Raffi's narrative was very weakly resolved. It felt like Egoyan knew he had to end the film somehow, but there was just too much going on to end it in a satisfactory manner. 8/10."}, {"id": 181, "text": "The performances of Aznavour, Plummer, Bogosian, Alpay, Khanjian and Koteas were truly amazing.Plummer's noncomprehending and inquisitive customs agent was powerful and is worthy of an Academy Award nomination.  Aznavour's steadfast emotions and beliefs permeated the film.  Bogosian's and Alpay's energy came across to the audience.  Khanjian ably played a difficult and complex character whose personal struggles underlined the film.  Koteas ably played the persona of the modern day Turk who appears to recognize that something horrible happened in 1915 and desperately wants to put this in the past.  (Somewhat akin to the recently elected Turkish leader who mentioned to the Italian press that he would be happy to recognize the Armenian Genocide as long as he understood what the related ramifications might be.)What is most impressive for me about Egoyan's most recent film within a film is how he weaves almost all aspects of the complex history and present day ramifications of the Armenian Genocide into one film - the survivors' feeling of doubts and pain, anger that might lead to violent acts against present day Turks and near obsession with the worst crime men can commit against their fellow men as long as the crime is denied recognition and justice.The film requires a great deal of its audience, but the effort is well worth it and will stay with the viewer for days after the viewing."}, {"id": 182, "text": "A complicated structure, a struggling script and unconvincing performances get in the way of what ultimately is a very important story.In Ararat, Atom Egoyan, Canada's own boy wonder, wants to tell the devastating story of the wholesale massacre of Armenians by the Turks in Ottoman Turkey during the First World War. Unfortunately the different levels in the film -- a probe into personal relationships affected by past horrors, a dramatized piece of history, and an analysis of how art can reflect on said event -- makes the film too ponderous for comfort.Armenian director Edward Saroyan (Charles Aznavour) is making a movie on Clarence Ussher's book An American Physician in Turkey, which depicts the massacre of Van in 1915. Working on the film is art historian Ari (Arsinee Khanjian) and her son, 18-year-old Raffi (David Alpay). Raffi is having an affair with his stepsister (Marie Josee Croze) who blames Ari for her father's death.A year after filming is complete, Raffi, on his return from Turkey, is stopped by immigration officer David (Christopher Plummer) who believes the young man is carrying drugs in the film cans. David, meanwhile, is coming to terms that his son (Brent Carver) is gay, and living with an actor (Elias Koteas) who happens to play the bad guy in Saroyan's film.Confused yet? You should be. Egoyan, whose best films (The Sweet Hereafter, Exotica) contained his signature certainty, seems to have lost confidence in Ararat. The director, who is of Armenian heritage, could have made a much more emotional, and ultimately more involving picture had he simplified things. Unfortunately it looks like a propaganda movie."}, {"id": 183, "text": "This film tries to tell a lot about one of the first dark events in the 20th century, in the blood trailed series leading later to Auschwitz, Cambodia and Sarajevo. Having read much about this film, I was expecting its first view on the cable channels here. It proved to be somehow different from what I expected, but also strangely familiar. It quickly appeared to me why. Here in Israel many people are faced with the trauma of the Holocaust. It is the case not only for the Holocaust survivors, but also for the second and third generation. The paradox is that while the generation that suffered in the Holocaust spoke little, and were mostly trying to forget and to re-build their lives, it fell on the next generations to try to reveal the truth, to shout about it to the rest of the world, and to suffer and re-live the pain and shame of the suffering that their parents and grand-parents endured. 'Ararat' is telling the story of the deportation and killing of the Armenian by Turks in WWI, a controversial event, forgotten and contested during the 20th century as no cameras rolled there, and the Americans never came to liberate the area. It does it maybe with too much passion and in a too declarative manner, kind of trying to balance the perceived ignorance of the world about the events. However, I read the film to be more about how the next generations continue to live the traumas of the past, how they try to make the world understand and pay with their own lives the price of not forgetting. Although the story is somehow confused, and too many coincidences and sub-plots mix altogether, the contemporary part is better cinema than the historical one. It is a passionate film, it is not  great cinema, but it makes the point, and is not easy to forget. 8/10 on my personal scale."}, {"id": 184, "text": "I had no idea what to expect with Atom Egoyan's new film ARARAT. It has received many negative reviews and scant few good ones. As a big Egoyan fan, I was worried. Would this be the first of his films that I wouldn't enjoy? And the subject, the Armenian Genocide... I just couldn't imagine what Egoyan would attempt that put off so many people. Needless to say, I was completely surprised at how amazing this film is. ARARAT is not a film about the Armenian genocide. It is a film about truth and history. About how sometimes the way we tell a story is more important than the story itself. He uses the Armenian genocide as the backdrop... the subtext... There's a film within the film that IS in fact about the Armenian genocide. I think the people who didn't like Egoyan's film were looking for something more akin to the film within the film. I was much more interested in the film Egoyan chose to make. In this film, Charles Aznavour plays a well-known director who is making a film about the Armenian genocide. His style is very over-the-top, with a strong Hollywood epic feel to it. After hearing a lecture by Ani (ArsinÃ©e Khanjian), an art history scholar who has recently written a book about a famous Armenian artist who survived the genocide, he and his writer (Eric Bogosian) decide to enlist her help on the movie as a historic consultant, in order to provide accurate details on the film even as they stretch the truth even further to make a dramatic story. Ani's son Raffi is also hired as a production assistant on the film in the hopes that he will come to better understand what happened between the Armenians and Turks and why. Raffi's father was killed in a failed attempt to assassinate a Turkish diplomat 15 years ago. Raffi also has a step-sister, who was the daughter of Ani's first husband. She blames Ani for her father's death (murder? suicide?) and continually appears at Ani's book readings asking disturbing questions linking the subject of her book (who also committed suicide) with her first husband. And there's even more... There were so many things I admired in this complex, ambitious film. I love the way Egoyan jumps around in time and doesn't really give you any clues... you just have to sit back and figure it out. The film within the film... the one actually about the Armenian Genocide... is stilted and overblown, much like most big Hollywood productions, but not without the horror and tragedy inherent in situation. There are some amazing scenes in ARARAT, especially the ones where Egoyan tries to find an understanding in the Turks point of view regarding the genocide and their inability to accept it. And amazing performances as well. Charles Aznavour is terrific as the director. Christopher Plummer is superb in a quiet performance as an airport customs officer who interviews Raffi on his return to Toronto after a trip to Turkey. And how delightful to see ArsinÃ©e in such a large, dramatic part. She really shines in this difficult role. David Alpay is fairly strong in the tricky role of Raffi, especially in his dramatic scenes with Christopher Plummer. One of the many criticisms I've read about ARARAT is how the dialogue is so expository. I didn't find it so at all. One of the points of the film is how the story of the Armenian genocide has been lost, and that people don't talk about it. There's a lot of explanation on what happened in that period of history told through dialogue, which is as it should be in this film. After all, it's NOT a film about the genocide itself, but who it has been dealt with. Plummer's David, when trying to determine if Raffi is smuggling drugs explains that while it's true, trained dogs could easily sniff out the drugs, he prefers his method of talking to the suspect to find out the truth through dialogue. It's a powerful moment, especially in retrospect when the entire film is revealed. ARARAT is complex, ambitious, thought-provoking, and masterful. I was so delighted by it after expecting something very different."}, {"id": 185, "text": "I feel I have a lot to say about the movie, so please, if my comments go on to long, just stop reading. `Ararat' meant a lot to me. It was really important to have a `Hollywood scale' picture about my nation. These types of films have higher purposes than just entertainment. It shows that in real life the bad guys don't always get kicked in their @$$es. The movie worked great for me in every way; however, as an Armenian I feel my opinion wouldn't be adequate for obvious reasons. On the other hand, I remember how my hard was bleeding when I was watching Spielberg's `List of Shindler'. You feel terrible for people who suffer, whether or not they are your people. It would mean a lot to me if non-Armenian people went to watch the film as well. It is up to viewers of this category to judge what's right and what's wrong. In any case terrific directing and scenario work as well as terrific performances of actors are guaranteed. Although `Ararat' was shot by an Armenian director, it is pretty much Hollywood style (being a Hollywood movie), so if you like American drama, you'll love `Ararat'. I hate to say things like: `you should definitely watch this movie' or `you should definitely listen to this music' but it would mean a lot for me if you went to watch it. I originally expected a so-so film because it was natural for me to think that the creators wouldn't do a lot of effort knowing that they'd have 100% of Armenian community in theaters regardless of the quality of the movie. I was glad to turn out to be wrong when I saw the movie today.Thank you."}, {"id": 186, "text": "I found Ararat to be a great work by the director, Atom Egoyan. Although many may think that Mr. Egoyan tried to do too much in this movie, he was only being true to himself as a director--this is how the man works. He makes the moviegoer work! Many people might have come out of the movie scratching their collective heads, but I guarantee they talked about the movie afterwards--how many movies do YOU talk about?Many people wanted to see a Schindler's List for the Armenian Genocide, but that would mean, not only that Armenians have to follow the Jews in this regard, but also that Mr. Egoyan has to follow Speilberg's spell'em out for the average schmuck movies.Being an Armenian-American I have gone through many of the same issues that the character, Raffi, goes through and I appreciate Mr. Egoyan for bringing up that fact to the rest of the world. People don't understand that the act of Genocide doesn't end with the mass extermination of a people, but rather with the conflict that the survivors and the the following generations have to live with.Mr. Egoyan walks a tightrope with his movie within a movie and succeeds in pulling this off. When the missionary doctor castigates Ani for walking on the set during one of the disturbing scenes, we are brought back to the fact that the actors were living this nightmare.Elias Koteas does a great job of playing a Turkish actor in the role of Turkish governor of Van allowing everyone to see the denial the Turks still hold to to this day. I think most Turks would be more adamant in their denial, but I think Koteas pulls it off rather convincingly.There are some areas of the film I think Mr. Egoyan goes a bit too far with,(the girlfriend relationship and the homophobe father) but it doesn't take away from the piece of work as a whole. He merely adds more details to engage the viewer--again making us work. Viewers didn't get lost in the big picture by adding this material so why critique it?This movie is about the Armenian Genocide and it took a Canadian-Armenian, with the backing of an independent movie company(Miramax), to stand up to the American State Department amidst pressure from the Turkish Government, to make this low-budget movie. Mr. Egoyan deserves our accolades for his brave stance in making this movie."}, {"id": 187, "text": "In spite of a lukewarm critical response, the fact that Ararat won Best Motion Picture at the Genie Awards and that it would be a definite personal film to Atom Egoyan sounds promising. He viewed his better films The Sweet Hereafter (1997) and Remember (2015) as having allusions to the Armenian Genocide, which impacted his family; Ararat is meant to deal with the often neglected subject head-on, or so you'd think. Rather, it deals with a crew in Toronto that makes a film about the genocide. Seeing snippets of their work, I wish Egoyan had made some version of that instead.I rarely use this criticism of film, but Ararat is excessively preachy, much of it coming from David Alpay and Bruce Greenwood, who spout out facts at length, often without a lot of emotion, and often to people who wouldn't be much interested. A lot of this is entirely irrelevant a customs official like Plummer's character, no matter how the film attempts to spin this. When Alpay's character quotes Hitler about no one remembering the Armenians, Elias Koteas' character, who'd earlier questioned if the account went exactly as it is said to, and who notes this matter is behind him and his colleagues born in Canada, echoes the Nazi dictator's sentiment in a deeply sinister voice. He has gone from mild skepticism to all-out Hitler, in Egoyan's shameless breach of Godwin's law.Much of this smacks as false. When Greenwood's character, an actor, is advised to read a book that inspired the film, the character replies he has read the book, along with every single thing ever written about the artist it's about, the Armenian Genocide, and the Armenian people in general, and the character isn't even said to be Armenian. Is this the kind of in-depth expertise Egoyan finds in his actors on a regular basis? Do actors who've read every book ever written about the broadest of subjects frequently line up at his auditions, and he gets his pick? I'm sure every other director envies him.Films about films are too common. Occasionally, you get a really great one that makes it okay, such as Sunset Blvd. Most of the time, it's just narcissistic, and in this case, it definitely gets in the way of the awareness Egoyan was hoping to create."}, {"id": 188, "text": "Film making is supposed to be an art, not propaganda as aznavour clearly expresses to Ali  what the intentions are in this movie.I am a little unaware with the whole situation... why are the armenians making such a big fuss about Turkey denying the so called massacre? Doesn't everybody else accept it? This leads to 2 conclusions: 1. Armenians are advertising what they have been through to be recognized by other nations. If this is a fact why doesn't everybody accept it just like the Jewish genocide? Because it's not? 2. If everybody else accepts it, than why is it so important that Turkey recognizes it? Because Armenia is struggling with poverty and needs the compensation money?How right is it to show the Turks as they have been portrayed in this movie? That's just racist. How come there are still 100000 legal and about the same size illegal armenian immigrants living in Turkey? How do they justify their hatred? Why won't they go back to Armenia and rather live with the murderers and rapists?Armenians need an identity, but their knocking the wrong door. It reaches its goal though.. No body in the world would even know a country called Armeina existed if it wasn't the talks about what they have been through during 1915. I guess this is the only way they can show they exist. Understandable but WRONG! Lighten up. Give something to the world."}, {"id": 189, "text": "Oh my! The plot details have been covered well by other reviewers, so I won't bother.This may be the most impressive piece of movie-making craft I've ever seen. the movie-within a movie is so incredibly well done, you really do think you'rewatching clips of another film, and then often THAT film draws you into believing you are watching actual events from 1915.Utterly magnificaent, though in a very dark and disturbing way.this movie demands the viewers attention, and it also demands compassion andintelligence.If you love Airplane and early Jim carrey movies, then stay away from thismasterpiece.  If you love foreign films, film noir, or just love the craft itself, this may well become one of your favorite films of all time.I give it thirty stars out of ten."}, {"id": 190, "text": "This is an excellent film, and one that truly shows the thematic power and artistic depth that springs from Egoyan's sensual style and non-traditional narrative.The story's plot follows the production of a fictional film, a conflicted son in search of meaning, a retiring Canadian customs official, the artist Gorky, a scholar, and an entire history of a people plagued by genocide. Each plot line and most of the central characters are woven together in the most adroit, symbolic, and meaningful fashion, making the film a comprehensive study of truth, family, art, culture, history, and identity.If you are interested in a specific, historical account of the Armenian genocide or a biography of Gorky, this is not necessarily the film for you, since each character and topic is filtered through the cinematic prism of Egoyan's more personal vision. However, if you're a fan of Egoyan's work, you will likely enjoy it immensely. Many of the fine actors that repeatedly appear in his film are present, giving performances that each fall somewhere between good and great. Those relatively new faces that appear also fit well into Egoyen's familiarly styled tapestry. While it is true that some scenes come across as somewhat emotionally and psychologically untrue, it is a very intentional part of the film.Many of the cornerstone's of Egoyan's work are active in Ararat with great force and exceptional detail. There's a deep Existentialist angst and keen awareness of the postmodern condition. The film is overloaded with symbolic and abstract meaning, at the direct expense of concrete, tangible truths. Emotion and history, accompanied by acrimony and taboos, permeates every aspect of duologue and character so that even inanimate objects fail to convey exact, firm meanings. Egoyan's knack for keeping his films superficially neat and stylish, despite tumultuous inner struggles and an often troubling cinematic picture is at its most compelling.If you're searching for a film with few questions, easy answers, a conventional story with even more conventional artistic devices, then this is not the film for you. However, if you're searching for a film that questions the very fundamental structure of society, history, and art, and one which provides infinitely more questions than it does solid answers, then this is a good film for you."}, {"id": 191, "text": "It would be an understatement to suggest that Americans are not currently open to a movie about ragheads.  It doesn't matter that Armenians are substantially Christian, or that the individual's responsible for the atrocity of the Armenian genocide are Muslim -- and the allies of the future Nazis.  Iceberg, Goldberg what's the difference?  The Armenian genocide is a very serious issue and should be presented when popular emotions are not running so high.  While I'm @ it, I'll wish for movies on the mass murders in the Soviet Union (30million+), or China (40million+.)As a movie this film falls far short of Egoyan's normally high standards.  I have greatly enjoyed the complexity of Egoyan's past films.  I think that Egoyan found this issue (Armenian genocide) so personally compelling, that he never realized that all the sub-plots, window dressing and frou-frou that he threw @ the film were just a distraction.Once again Egoyan's wife (whose name I refuse to remember because she has absolutely no interest or value w/o him) wins the Barbara Bozzo (aka Bosson) award.  People who remember Hill Street Blues need no explanation of this award.  For everyone else -- the Barbara Bozzo award goes to actresses who turn in consistently terrible performances, but are always recast because their husbands are powerful in the industry, and let the little head think for the big head.  Egoyan's wife is a black hole.  She sucks the life out of any scene she is in.  In many of his movies this is unimportant.  In Exotica (which she could have missed completely because she was pregnant) she was on screen so rarely she could be ignored.  She has a major role in Ararat. This alone kills the film.  Add to this, Egoyan's utter contempt for acting as a profession and we end up w/ a supporting cast that I wouldn't go see in a summer stock version of The Mikado."}, {"id": 192, "text": "I am an Armenian.  My brothers, my daughter, and myself were all extras in this amazing film.  When we were on set, it was like a giant Armenian community.  Atom Egoyan would talk with everyone and state his gratefulness that we would be in his film.  He is an amazing and gentle man.It is hard to believe that man would gleefully kill a child, a pregnant women, or set ladies on fire.  This truly shows how barbaric the human race is.  When the disturbing scenes are shown the camera does not linger. I'm sorry to tell the ignorant among you, Yes the Genocide happened.  Hitler said who remembers the slaughter of the Armenians, no one will care if we kill the Jews.The movie itself draws a comparison with societies intolerance of homosexuals.  If we allow the killing of Armenians, then we allow the Killing of the Jews, if we allow killing of one race then we can make a reason to eventually kill the homosexuals or anyone who the majority think is a threat to their way of life.The people on this list who don't believe the Armenian Genocide happened probably can't point out where Armenia is on a map, so how would they know. It did happen, my grandparents family didn't chose to live in Iran, they were forced there.  You either leave or die, you either swim across the river or die, if you can't swim then die on land or drowned.Society must learn from the past, because genocide goes on today.  In Columbia women &amp; children die every day because of the toxic spraying of the coca fields.  All over the world women are smuggled across borders for prostitution.  Yet stopping these problems are not priorities.  Society is more concerned with a person getting high or having a same sex partner. These issues are none of societies business.  The abuse of the human race should be our priority or else Hitlers dream will be realized.  Remember the 5th commandment Thou Shalt Not Kill  Not for any reason, not even for oil."}, {"id": 193, "text": "I really had my doubts before seeing Ararat, because despite people's opinions, I wasn't a big fan of Exotica, The Sweet Hereafter or Felicia's Journey. But for some odd reason, Ararat really won me over, because I really like the structure of this one, like 5000 little stories, all which combine with each other in some form or another, and all reach a satisfactory conclusion. As a matter of fact, this film is SO much fun, as we jump from historical reenactment to real life by the clever juxtapaction of having the historical reanactments blend in to the movie that is being shot about the Armenian Massacre in Turkey that is the center of the film. As a matter of fact, my favorite scene may well be when Arsinée Khanjian, who is playing a consultant of the movie, comes barging in as a rather alarming scene dealing with injured children and the doctor taking care of them. The doctor gets on her case about how her needs are much more important than the life he is trying to save (when of course, he actually isn't, because he's an actor). Such incredible blurring of the lines is actually quite masterful! Sheesh, I haven't even talked about the acting here. All of which is really great. I have no idea who this David Alpay is, but he's just great as the emotionally tortured Raffi. Khanjian is great as always. But what gets me is the scenes with Christopher Plummer and Charles Aznavour together. I mean, it's not a meeting of the most famous actors around. But it's sort of funny when you have De Niro and Hoffman getting together for forced hysterics in Meet The Parents and Dustin Hoffman and Gene Hackman getting wasted in the brief scene (in the washroom no less) in Runaway Jury, that you really do appreciate the power that Aznavour and Plummer put out in this scene. It's quiet, but it's certainly oddly memorable."}, {"id": 194, "text": "I was born and raised in Turkey, went through the whole education system there. I've been in USA for the last 6 years. Anyway growing up there, when I was a kid, there were some kids in the neighborhood and elementary school having different (non Turkish) names, I used to hear that there were Armenians or Jewish or etc. Didn't mean much to me, basically we were friends and thats about it. Isn't that nice that kids don't have prejudice but unfortunately this ends pretty quick, just starting elementary school, we learn all those bad stuff about what Greeks did and how good we are and all that. So as a Turk if you've never seen Greek before, by the time you graduate high school, you have some bad thoughts about them (thats the same for Greeks too). When I was 16 I went to England for a language school where I met some Greek friends. Well the first time we met, conversion quickly turned into historical stuff (strong discussions), which made me realize that we learned stuff differently. So I don't trust or believe Turkish history that's been taught in school or Greek history that's been taught in Greece. They are sided and making the nations hate each other or at least develop prejudice. Interesting thing we don't have much about Armenians in our history books, you call it denial, cover up, I don't know (probably). So any Turkish who doesn't heard this genocide stuff in the news or anywhere else. They will be oblivious but on the other hand Armenia have lots bad stuff about Turks, so most of the Armenians naturally grow up to hate Turkish people. Anyway at this point I don't know the exact truth about what happened, who to believe, who is objective about the truth. But if the movie is correct, war does not justify killing innocent people, kids (it doesn't matter where they are from) and it's a shame of human race. Anyway my question is, if Turkey recognizes this and apologizes, will Armenians still hate us and have prejudice towards us, are we going to get over this past historical issue and be friends ?"}, {"id": 195, "text": "Very good movie! It has a lesson...don't forget the past so that you don't repeat the same mistakes/misdeeds in the future...will the audiences get the message? From some of the turk-pro-turk messages posted here, I doubt it...the Armenian Genocide is still denied...in a weird, naive, cynical and stubborn way.One simple fact is compelling: there were 2 million Armenians in 1915 in Eastern Anatolia (Western Armenia) and NOW there are virtually NONE! Why? where did they go? did they evaporate? did they emigrate from their historical fatherland....??? Every single Armenian family in the Diaspora has a story, a member of his family killed, or deported or raped or lost his property or lost his land, or ...Shame on you, when you deny that such a GROSS event happened...when the consequences are obvious to the naked eye from empty, ruined and destroyed churches in modern day Turkey to empty, arable lands, to hundreds and thousands of Armenians living in diaspora with Turkish family names...and collective memory, and thousands of grand-dads and grand-moms remembering and bones/skulls in deserts of Syria...and US, British, German, consulate and officials' documents and memoirs....Call it what you want...Genocide, Civil War, Deportation, Epidemic, Famine, etc...Ethnic Cleansing..the result is the same...Armenians were deprived of their LIVES and LANDS...What a shame...Ararat shows only a sample of those atrocities, but when you cry the death of 3000 people on 9/11 but you deny the annihilation of an entire population , then IT'S A REAL SHAME."}, {"id": 196, "text": "There is such a thing as a moral absolute and Egoyan makes it very clear in this film (through his surrogate, the Director, played by Charles Aznavour)that he will not countenance a middle ground for mindless hate. What is a little disappointing, however, is that his film lacks the usual intellectual gold standard we have come to expect -- it's a little too emotional, a little too obvious.  It's strident.There are powerful moments in the film -- a re-enactment of the Armenian genocide for which there is little physical proof, the earnest self-discovery of the main character (played convincingly by David Alpay), the customs agent who wants to unspool a story to see how it ends (Christopher Plummer, who turns in his usual high quality performance), a young woman on the edge (Jean-Marie Croze, in a noteworthy, intense performance), the empathetic saint (played empathetically by Bruce Greenwood), the morally ambiguous actor playing the Evil Turk (Elias Koteas).But, the movie punches hard and the message is meaningless, despite Egoyan's valid assertions.  Hate is bad, but stereotypes are worse. Because the worst thing about a holocaust is not the goons who do the dirty work.  It is the society that just lets it happen. This issue is never quite fully explored in the film (as it wasn't in Schindler's List, either). Too bad.One of these days, a truly great film about the Armenian tragedy will be made. I always thought Egoyan would be the one to do it. Maybe he'll try again. The story should be told. Properly."}, {"id": 197, "text": "I was very much looking forward to Ararat. In the last few years I read a lot about the genocide of 1915, and was interested in seeing how this tremendous story would be portrayed in a film, specially told from the perspective of a director of Armenian heritage, like Egoyan. I always believed this was a very important part of history that needed to be told.Unfortunately I was very disappointed. I expected so much more, and despite a few scenes that lived up to the somber topic, the movie as a whole is weak and chaotic. The following is a list of some of the things that I didn't like:Too many subplots. The movie has way too many contemporary sub-characters living their own sub-plots, intertwined with the historical characters of 1915, and Gorky in 1934. It's very distracting, and many of these sub-plots add nothing to the story. The only contemporary characters we get to identify with are Raffi (David Alpay) and David (Christopher Plummer).Some of the acting was beyond sub-par. The performances of Arsinée Khanjian, Marie-Josée Croze, and specially Charles Aznavour are painful to watch at times. They barely show any emotions, one way or another, and make it very difficult for the viewer to identify with their own struggles.The movie gets too preachy at times. I believe the Armenian genocide of 1915 is a story horrible enough, that it doesn't require any additional emphasis or ideological bent to be told. Unfortunately we have the character of Ani (Arsinée Khanjian) constantly referring to the struggle of the Armenian people in very nationalistic terms, to the point of becoming preachy. The same can be said for some of the more energetic moments of Raffi, but it makes sense within the plot as he struggles to understand the motives that led his father to his tragic end.In general, I thought it was an interesting effort, but the story could have been much more compelling if told in a more straightforward manner, without the distracting sub-plots, the inert secondary characters, and specially without the unnecessarily preachy parts. As others have mentioned in this board, it would have been a much compelling movie if it stuck exclusively to the story of the genocide of 1915, instead to jumping back and forth in time to have characters explaining to us the historical importance of the events that are being narrated."}, {"id": 198, "text": "Although this movie only has an average of 7.4 I think it has the largest percentage of votes giving the vote of 10 here at Imdb (80% gave it 10). I believe that you can't really use other peoples opinion on a movie (or music, food, ect.), as it's just a matter of taste, but seeing so many people give this movie 10 out of 10 made me wanna go see it and although I didn't really crave this to be a superb movie I at least had expected it to be watchable. As I said in my headline, it was an okay movie (which is 6 out of 10 for me), which is still a mediocre grade and when a movie doesn't come out of the mediocre grades (4-6) I don't really think it's worth watching. Most movies go up and down - At one point you think the movie will be great and at another point you think it really isn't anything special. There were points in this movie where I thought it would be good, but not any points where I thought it would be great or superb or anything. Now, what I think might have been wrong with this movie is that it was too messy - too many stories at once and too much jumping around between different settings, times &amp; people and this made it hard to follow. Another thing is that most movies follow a curve, where it starts out and build up to a climax in the end. I didn't really see this in this movie. Such a curve isn't a necessity, Casino for instance doesn't really follow such a curve in my opinion, but is superb all the way through, but I just think this movie didn't really go anywhere, didn't have a plot and just ended to suddenly. So all in all, this wasn't the worst waste of time I've ever encountered, but a movie that isn't better than okay isn't really worth watching (or paying money for) in my opinion."}, {"id": 199, "text": "A brilliant movie,Egoyan has produced a complex story, featuring several themes -- a young man searching for meaning in his life, a film producer honoring the struggle of his mother, a customs agent learning mercy, a people refusing to take responsibility for their crimes, and many more. One thinks about the interrelationships long after leaving the theatre.The modern setting raises the issue of how past hurts affect present reality.  The cruelty depicted in the film-within-a-film of the Turkish Genocide of the Armenians is painful to see.  Egoyan shows the Turks raping women, burning women, killing -- but in small doses, enough to communicate the root of the problem without overwhelming the viewer.The musical score for the movie is rich and moving.The movie has outstanding performances by David Alpay, Charles Aznavour and Christopher Plummer."}, {"id": 200, "text": "The main focus of Atom Egoyan's Ararat is the Armenian Genocide. Beyond that it addresses the nature of truth and its representation through art (such as the issue of whether a movie should recreate historical events). The genocide itself is also the subject of the recent movie The Promise.We may never know the full extent of what happened in April 1915, or why the genocide faded from memory. What we do know is that suppressing the memory of a tragedy creates the risk that it will get repeated. Indeed, it was only thanks to the reports from some witnesses - among them Clarence Ussher - that the Armenian Genocide came to light.I recommend the movie, and I hope that in addition to drawing attention to the genocide, it draws attention to how World War I caused much of the bloodshed that has happened since."}, {"id": 201, "text": "This movie is quite informative... I'd say too informative, and the reason is that the writer/director lagged on endlessly on making the characters explain way too much instead of allowing the medium of film and image explain it. That's something I've always been against, the excessive ultra intellectual dialogue which makes the plot come across as unreal. Yes, there are people all over who know topics and issues, but when you bring that to a screen it becomes another version of The Da Vinci Code, before or after the latter's production. The acting isn't good, not even Christopher Plummer's or Elias Koeats'... but that can be attributed to the writing and direction. The acting was stilted and preachy on most sides. The information provided was great and the scenes from the Armenian Genocide are shocking. No complains there. Directors and writers MUST understand that jam-packing dialogue into a 120 minute piece only makes a movie unwatchable, unless you're interested in the topic, of course. Cramming lines doesn't work in a visual medium. 12 Years a Slave is a perfect example of how to rely not on dialogue but on the subtlety of camera movements and the talent of a well chosen cast. Anyways, that's my take on Ararat to which I'm still awarding 7/10 although it should be a 6.5/10"}, {"id": 202, "text": "Atom Egoyan's Ararat, my fourth film from the auteur is a very well-written, well-acted film detailing the Armenian Genocide from different perspectives. Raffi (David Alpay) is the son of art historian and expert on Arshille Gorky, Ani, played by Arsinee Khanjian. He is sleeping with his stepsister and is stopped by a Canadian customers officer David(Christopher Plummer) coming back from a trip to Turkey with a film can, although not wanting to show the contacts of the case. Edward Saroyan (Charles Aznavour) is making a film about the genocide. Plummer's son Martin (Bruce Greenwood) is playing the main role in Aznavour's films, which also features his lover Ali (Elias Koteas). Another man, Rouben (Eric Bognosian) acts as the middle man between Khanjian and Aznavour. The film features a great many of Egoyan's troupe of actors (wife Khanjian, Bruce Greenwood, Elias Koteas) and has a large number of themes from his other films (customs officers, incestual relationships, heritage), but conveys it poorly in comparison to his earlier films. In his earlier films, he focused on character's motivations and enigmatic plots. Now he seems to focus on religion and heritage, which I suppose is the kind of film he wants to make. I personally prefer his earlier puzzle films myself (The Adjuster and Exotica being prime examples).The acting is very good. Khanjian is good in every role she's done and you never think she got the role just because she's married to Egoyan. Bruce Greenwood and Elias Koteas (who played nemesis' in Exotica) make great lovers. Christopher Plummer carries a strong presence and a contrast to the other characters in his role. Alpay conveys youth and innocence very well, as well as hiscestuous relationship with Celia (Maria-Josee Croze).Overall, a well-done film, but don't expect anything close to his earlier films. 7/10"}, {"id": 203, "text": "I enjoyed the film's thoughtfulness. There was a lot of symbolism (a lot) and metaphors used in the film. Egoyan also used wonderful transitions form one scene to the next which made me admire his creativity.I thought the movie was very fair to Turks. It wasn't a simple history movie, it was about the complex relationships people have with one another and within themselves. There were many occurrences that were told through various eyes, and we saw how the story would manifest depending on who told it. I believe this was the central idea of the film.The movie has this focus on a woman's hands in a circular manner throughout the film, it begins with a mothers hands and ends with focus on a mother's hands embracing her child. Reading many reviews here, I notice that the bad reviews seem to only critique the historical aspects of the film, and miss these wonderfully meticulous attention given to the artistic aspects of the film.It really upsets me that reviewers are so shallow in their film watching...sorry. I feel bad for them because they miss all these profound themes that Egoyan conveys: ongoing theme of parent and child conflicts, truth as a matter of perception, surviving travesty in one's life, finding meaning in death, vindication, and redemption....this film was sooo throughout....Most of the negative reviews are based on biases (as are the positive ones by the way) but the few critiques of the film as an art, are spot on. It's not a perfect film, but how can any film as complex as this one be perfect?Don't use science to bash an artistic gem. --- that's mine, but feel free to use it ;)Although, I believe Egoyan, personally thinks what was done by the Ottoman government to the Armenians in 1915 was Genocide. He showed how the Turkish government as well as modern Turks might believe otherwise, how it would be so hard for modern Turks to believe that their ancestors could do such malice.It was not just a one sided documentary-type movie. The movie shows the modern views and beliefs of both Turks and Armenians. Egoyan is at his usual best with multipler perspectives and the back and forth timeline in the movie.The one thing the film was lacking, was some sort of historical background to the Genocide. I believe this is the central reason it was not a huge hit. While the movie is flawless in its acting and direction, it is very esoteric. There should have either been some sort of epilogue or some kind of introduction to the Genocide, because otherwise the film just made it seem like Turks were just raping and murdering, but why? And how? How could they hate us so much? This needed to be addressed at the beginning of the film. But nonetheless, Arart is brilliant as far as movie making goes.In my humble opinion."}, {"id": 204, "text": "This film has received much unfair criticism by incompetent critics working for all sorts of newspapers, magazines and websites. Incompetency is one. But it is also, most probably and in part, due to the fact that people don't care about the topic to begin with and would have criticized it no matter how it was told or made. The fact of the matter is that Ararat is the most original, imaginative and well-made movie to date that deals with the topic of a holocaust, which ever one it may be (Armenian, Jewish, Native American, African, etc.). It deals with the topic but doesn't sacrifice the art. It's not made to be a tear-jerker. Most stories about such historical incidents prey on basic human emotions and vulnerabilities because the purpose of those films is simply to gain sympathy. Nothing more. There is no consideration for contribution to the world of artistic film. They are not movies that are intended to contribute to the evolution of art. They are movies that take old-fashioned tools that have worked for whatever purpose for the past 80 years, and employ them again for similar purposes. It seems people are threatened by the fact that this movie did not do that and happened to be dealing with a topic that the whole world has been avoiding.It is an excellent film. The concept and structure are not as complicated as some critics say they are. Either they are incapable of comprehending anything beyond a formulaic Hollywood flick or they were dismissing it from the get go. Either way, they should not be film critics. Ararat has a very clever structure based on the perspectives of different generations. The acting was excellent from everyone, except for Aznavour who did a decent job of executing a simple role. They all did exactly what the job called for and were simply captivating. The cinematography was beautiful: all of the creative choices regarding how to film a given scene were perfect.Like all of Atom Egoyan's films, it is very character driven, putting a lot of focus on the psychology of a character and the choices they make as a result. Though it is not Egoyan's number one in my book, it is an amazing movie and can say I am honored to have seen it in theaters and am proud to own it."}, {"id": 205, "text": "In Ararat (2002), writer-director Atom Egoyan has produced a powerful film about the genocide of the Armenians by the Turks.  As depicted in the film, not only have the descendents of the surviving Armenians not forgotten this campaign of death and terror, but they are also outraged because the Turkish government has never apologized--or even acknowledged--these atrocities.Arsinée Khanjian, as a modern day Armenian- Canadian demonstrates again that she is an actor of unmatched abilities.In general, however, I found the footage of the film-within-a-film more compelling than I did the modern footage.In fact, even with the clear understanding that the real film was taking place in Canada in 2002,  the film-within-a-film about the events of 1915 was far more powerful.Warning--some of the atrocity scenes were among the most graphic I have ever experienced.  Be advised--this is not a film for children, and even adults will find some footage hard to watch."}, {"id": 206, "text": "There is at least one too many interlocking story within a story in this multi-layered allegorical treatment of the Armenian genocide, but why quibble. It is a great movie and well worth seeing. Egoyan is such a craftsman that he can linger for a long time on shots with little happening and still keep your attention. He has become so comfortable with cutting between time, place and character that it is almost unobtrusive. He shows he is as interested in the life of a Canadian customs officer and how he relates to his gay son as he is in the lives and deaths of his putative subjects, the Armenian victims of 1915 and their descendants in Canada in 2002. And as usual Egoyan gets terrific performances from members of his stock company--Arsinee Khanjian, Bruce Greenwood, Elias Koteas in this case. The most wily of old pros--Christopher Plummer and the newest of the new--David Alpay, who has no other credits at imdb--are given the chance to build characters.The scenes of slaughter, some of which are distanced by being part of a movie within a movie--are disturbing. While brief they tell the horrifying story of helpless people being murdered. Not a Christmas movie but well worth seeing."}, {"id": 207, "text": "You have to see this film at least three times. Not only because it is a great movie but it is complex and filled with thoughts about many things. I've seen it only once, since I had the opportunity to see it at the Titanic Festival and I have to wait with the further screenings till it is officially showed at Hungarian cinemas.After leaving the theater I only had question marks in my had. The starting point of the movie was the killing of more than 1 million armenians in Turkey in 1915. And I felt only anger in the first hour, because Atom Egoyan is one of my favourite directors and it seemed that it's going to be a very badly written, directed, performed history-tale, with fake morals. But after that my anger turned into astonishment. The film shows the million aspects of such a terrible event. And with the seemingly theatrical historical parts of the films he tells us one of the main morals of this movie: we cannot handle a genocide like a story. It is impossible to give it back for our eyes. We have to deal with it in our minds and souls. And it doesn't matter how long it happened. Because if we forget those things they might come again.But it is only one side of this movie. This space is not enough to enumerate the different levels of problems the film is dealing with. Some of them are deeply unfolded some of them only mentioned. But it gives you many things to consider.Besides these all the characters are very well written, the performances are great and the music is perfect. This film has its place among the bests."}, {"id": 208, "text": "Upon my first viewing of this film, I generally liked it. There were some striking visuals, and the story needed to be told. However, I saw it a week later, and I didn't like it--I approached it more critically. Basically, the movie-within-the-movie takes away any emotion I would otherwise have had mustered through watching this film.  As I watched and became involved, I would always be jarred into realising that I was watching a movie being made. Basically at the end of the film, I was left with the opinion of who cares. I have an open mind for all sorts of artistic endeavours and I usually can see what someone is trying to say. This film does say many important things that I value: freedom is good, oppression is bad, etc, but it doesn't have to be jammed down my throat until I gag and feel I must puke. To me, the plight of the individuals in the film was deadened and made superfluous by watching a movie being made about that plight. Every time you get into the story, and start to feel, some director says cut! and ruins your sense of the story trying to be told. This film is too chaotic."}, {"id": 209, "text": "Egoyan's most ambitious film yet tells the intertwining tales of people involved directly and indirectly in the making of a film about the Armenian Holocaust (a point in history often overlooked). There are so many layers at work here (we have Egoyan making his film, the director in Egoyan's movie making his film, and the painter Gorky painting his most famous piece Artist and Mother) that the film sometimes seems weighed down by its own lofty ideas. It takes awhile to get involved, and Egoyan's non-linear storytelling that centers more around themes and motifs than any central character can seem a bit too cold and austere and confusing for many viewers, but once you get wrapped up in the ideas, the payoff is extremely rewarding. Egoyan seems to be saying that you can never really touch history, that you can only acknowledge it happened and try on some level to remember it. Faith is needed to believe that someone or something existed or happened and to believe in the memory of that person or event. Movies and paintings as well as people's own distorted memories of events serve as mementos even when not everyone involved with them acknowledges the truth. Egoyan mirrors his own deeply personal experiences in the many characters haunted not only by their own private tragedies but by the cultural tragedies of their ancestors and families. Of special note are the music score, editing, and supporting turns from Egoyan regulars Koteas and Greenwood. Ararat is not to be missed by the discerning film-goer. Egoyan has crafted a brilliantly conceived film that isn't always perfect in its execution of its important ideas but will still leave many lingering thoughts."}, {"id": 210, "text": "I believe learning and teaching history is crucial. In the light of history, we all have to work for peace and tolerance, without any religious, ethnic or cultural discrimination. Naturally film industry should do what it has to do.However the projects should be based on historical documents instead of prejudice, or else, it would be nothing but a historical mistake.Historical incidents, which Ararat claims to be based on, can be found accurately in the Ottoman archives, which are open for use by anybody. I think you, as a reputable company, should research all materials including the Ottoman archives as an initial step for this project. I wonder why you recklessly offend two neighboring countries and ignore a nation of a population of 70 millions.The events, which took place between 1915 and 1920, cannot be defined as genocide. The Ottoman Empire has a reputation on being tolerant to its citizens. It took part in the World War I and in 1914 it waged war against Russia in the eastern front. Meanwhile the Armenian citizens were also fighting against the Ottoman troops. The Ottoman Army was stuck between two enemy fronts and having legal right to defend itself, the government had to deport the Armenians in that area to Syria while no other Armenians living in various parts of Anatolia were forced to deport.Deportation is a legal right, which is put into practice by governments when necessary. Unfortunately, during the deportation some people were killed because of circumstances. According to Ottoman official archives, the Armenian population living in the Ottoman Empire in 1914 is approximately 1.300.000. The number of Armenians killed during the war is nearly 300.000. Strikingly, the number of Turks killed by the Armenians between 1906 and 1922 were around 517.455. Below are some scholarly references on this subject: Justin McCarthy; Death and Exile Bruce Fein; An Armenian And Muslim Tragedy? Yes, Genocide? No Philips Price; A History of Turkey Clair Price; The Rebirth of Turkey Besides, genocide must be considered as a legal issue. The Armenian issue cannot be described as genocide when the description of The United Nations is taken into account. The 19-article 1948 Convention on the Prevention and Punishment of the Crime of Genocide, states that genocide, whether committed in time of peace or in time of war, is a crime under international law. It defines genocide as any of the acts committed with intent to destroy, in whole or in part, a national, ethnic, racial or religious group, including by killing its members; causing them serious bodily or mental harm; deliberately inflicting on a group conditions of life calculated to bring about its physical destruction in whole or in part; imposing measures intended to prevent births within the group; and forcibly transferring children of the group to another group. According to this description, we cannot talk about genocide. There has been no proof that demonstrates the government planned to destroy the Armenians at all. However the film Ararat is based on a genocide theme, which is incompatible with the definition accepted by United Nations.I am vigorously protesting your company because of producing a film fomenting hatred. I urge you to reconsider your marketing plans regarding this movie in the light of historical facts. Your actions run the serious risk of motivating me and other Turkish audience to see other companies' films instead of Miramax and Walt Disney productions.Best regards,"}, {"id": 211, "text": "I have seen directors who have a hard time leaving things out of their films; John Sayles comes to mind. Egoyan would have made a great picture if he could just have left the Gorky material out of the final script: it just doesn't fit, and slows down the pace considerably. Otherwise, the film-within-a-film idea works fine (as it did for Truffaut in Day For Night) and the actors do a good job. Celia's character is enigmatic at first, her behaviour around Ani very erratic, but as we get to hear more about her past the pieces fall into place. Raffi is an appealing hero--his blend of idealism for his Armenian heritage, longing for his dead father and wish to get out from under his mother's petticoats was well brought out. Christopher Plummer as David the customs agent was the best player: his fifty years of professional experience in acting served him well here. He is so sly, thoughtful and unexpectedly compassionate that I was bowled over.Every year on or around April 24, there is a demonstration outside the Turkish Embassy by members of the Armenian diaspora. I live on that street and have heard the speeches and response from the crowd many times. This film will help the message get out."}, {"id": 212, "text": "Writer-director Atom Egoyan's complicated, heavily-plotted melodrama about the making of a film illuminating the Armenian Holocaust of 1915-18 at the hands of the Turks dares you, with its important yet obscure topic, not to admire it. But it's a mixed bag. Egoyan is a victim of his own ambitions: so many stories tackle so many entwined conflicts--historical, familial, cultural--with such a broad swirl that it frequently drowns the viewer in overkill. Egoyan messes with your head by pulling all sorts of theatrical manipulations, with heavy cross-cutting between various plots and revealing motivations piecemeal; but he primarily operates by extruding a feeling of helpless horror from you--the atrocities committed by the Turks include the torture of children, rape and the act of being set on fire. Yet he lets you off the hook by allowing you to distance yourself from the horrors: they're depicted as graphic scenes from the film, not actual events. The effect, while powerful when you're watching it, is something of a cheat: you walk away devastated but a little angry at being controlled. Egoyan invests a lot of personal emotion in his film yet it's frequently obscured by fragmented storytelling; and his outrage at the end that Turkey has never apologized for its atrocities has the feel of a non-negotiable demand that he insists the viewer share simply by having viewed his film. It's tastefully made, with impressive set design by Kathleen Climie and solid performances by the prodigious cast (including Elias Koteas, Arsinee Khanjian, Christopher Plummer and Charles Aznavour), but it's talky without seeming conclusive (except in its political stance) and overly reliant on Mychael Danna's intrusive score."}, {"id": 213, "text": "Ararat is a multi-faceted look at the intersection of family and tribal memory, and an individual's responsibility to carry on a heritage of hate. We've seen films exploring this in terms of Jews and the Holocaust, a bit for Native Americans and Manifest Destiny, and even Faulknerian Southerners and the Civil War for whom the past is never dead. But this is the first that looks at Armenians' relationship to the genocide of the early 20th century in Turkey. Obviously a heart-felt labor of love by writer/director Atom Egoyan, he features not only his wife Arsinée Khanjian, as he does in most of his films, but also other actors of Armenian descent for whom these themes obviously resonate, including Eric Bogosian and Charles Aznavour, as the obsessed writer and director, respectively, of the titular film-within-a-film that is filled with stock good-and-evil stereotypes. While I learned a heck of a lot about Arshile Gorky's Armenian-memory paintings, that parallel-story line made one realize how much the women in his portraits look like Cher Sarkisian. Though the historical epic film-within-the-film unfortunately dominates the visuals, it is the complex, intersecting ensemble that makes the movie more interesting. The emotional center is the intimate story of raffish young David Alpay as Raffi (in an attention-getting debut) coming to terms with his intellectual mother, politically-engaged martyred father, sexy/crazy French-Canadian step-sister, and so on by sorting out when family ends and history begins. The non-Armenian characters (such as a very effective Elias Koteas as a gay actor of Turkish descent who gets the movie role of the macho Turk general) all get caught up in different ways in the forces of revenge and retribution and interpret it through their own ethnic heritage and parent/child relationships, making us see how much memory is about psychology as much as it is about facts. A witness can be remembered only by the people who listen and pass on the passion. The traditionally flavored music is subdued and is a missed opportunity as a key to unlocking the past."}], "reviews_amount": 214}