{"name": "The Last Full Measure", "titleId": "tt00783640", "reviews": [{"id": 0, "text": "Great storyline and entertaining throughout the whole movie. It's sad to see our vets get no recognition and this movie showcased how humanity, respect and compassion is still alive. I cried at the end. I never cry watching movies but this one really touched my heart!!! A must see! :')"}, {"id": 1, "text": "I totally loved the movie. My mother, my aunt and I went to go see it and it was very emotional for us. I'm so glad to finally see, what went into getting our cousin, the Congressional Medal Of Honor. Also, just putting this out there. It states here, William Hart Pitsenbarger Jr but he was not a junior. He was not named after anyone, except for his middle name, which was his mother's maiden name. I would also like to note, that Diane Ladd played Alice Pitsenbarger but Alice Pitsenbarger was not Williams' mother. His mother passed away in 1991. Alice was his fathers 2nd wife. Williams' mothers name was, Irene Emma (Hart) Pitsenbarger. I know this because William was my family. My great-grandmother and his grandfather, were brother and sister."}, {"id": 2, "text": "After seeing 1917 I really wasn't expecting much when I started watching the movie. 1917 would be a tough act to follow. I have to say now that at least for me...the true war Story vs a hearsay war story was way better.. At the time I knew nothing about William Pitsenbarger. I'm glad I refused all temptation to do a Google Search before watching the movie, I simply followed the story and was not disappointed. Beautifully written and I'm sure you will tear up, once you hear multiple witnesses describing the Airman's heroics."}, {"id": 3, "text": "Beautiful made movie! It's a movies which didn't bring out the violence of the war, but a emotional and touchy story of a hero. It's really rare that we even see a Vietnam war movies. I literally cried throughout the whole movies. Very glad to see. Great pick on actor and subject! Love the concept that this movie has brought hope to our life. PTSD was well written and showed in front of us. All the suffers that those veterans had been through. Great storyline based on real story. For sure that this story has heart , I really hope that people can see, feel and understand what veterans had been through and provide support for them. Definitely recommend!"}, {"id": 4, "text": "This was a great movie. People who nit-pick it miss the point. Movies are supposed to entertain us, they are not history lessons. Sure there are a few mistakes, but nothing that detracts from the story or the man's heroism.And for you guys talking about his sergeant strips that change did not take effect until Oct. 1967 and this action happened in April 1966. At the time of the action his 3-stripes indicated Senior Airman, which is still an Airman.Sit back and enjoy the film. I'm sure you won't regret it. God bless you William Pitsenbarger."}, {"id": 5, "text": "First of all, I have never seen a movie take on a war story like this. Think Hacksaw Ridge, meets Saving Private Ryan without all the gore. It's not about the nations, the generals, the guns, or the tanks- it's about the people. The Last Full Measure is a Drama that happens to be a war movie. Plus, you have never seen performances like those given by William Hurt, Ed Harris, Sam Jackson, Diane Ladd, and Chris Plummer. I got to see the movie at a special screening in Washington DC, and the entire audience, including military brass, had tears running down their cheeks by the end. And, trust me, they weren't tears of sorrow-It leaves you with a feeling of joy and gratitude for any solider who places themself in the line of fire. Anyone who doesn't appreciate this film has no empathy. I would highly recommend seeing this in theaters, not just for the action, but to fully appreciate the nuances in these actors' eyes. I went with my grandmother who doesn't usually like war movies, and she won't stop talking about it."}, {"id": 6, "text": "Second review I 24 hours being off work sick has its advantages!! I saw the low review point on this but watched it anyway because of the cast, it nearly has a better cast than the Irishman !!!! I'm not American ... I did not serve in Vietnam nor do I know anyone that served in that war as some keyboard warrior reviews seem hung up on. I enjoyed a well written well acted movie and I'm not ashamed to say I sat here and cried for the last 10 mins, not something I do for movies I think ET in the cinema was the last time. This movie slowly wrapped its storyline around my heart, gripped me till the end and and didn't disappoint. Disregard the low ratings and rants from wannabe movie critics this is a movie to enjoy and cherish every moment of they don't make them like this too often and when they do movies like this have a habit of falling between the same cracks spoken in the movie. Enjoy it for what it is, a journey for more than one person including the viewer."}, {"id": 7, "text": "On occasion I have been courageous. Sometimes I see it in others. But where and in the time I live, is the easy abundant safe culture, becoming devoid of values of character and promoting self interest above all else. This story is important, since in time, it may be seen as a fictitious fable that few will be able to identify with. A few need to live and tell such stories. More than anything, I'm glad I have the insight that allowed me the privilege of seeing and understanding this movie. War doesn't leave us, it simply changes shape. Nowadays we have the war for control of our minds, wallets and spirits. No blood spilled, just dumbing down. This is a well told story of humility, selflessness and sacrifice. I won't be around later when no-one identifies or cares about this story, or other stories like it. And I wouldn't want to live in that time anyway."}, {"id": 8, "text": "An EXCELLENT Movie..Fantastically True Story,Great Stars,acting top notch.All round a VERY Moving,Gripping Movie...Top Marks"}, {"id": 9, "text": "This is not a war movie. It's a movie about love and friendship, heroism and honour. Do yourself a favor and give it a watch."}, {"id": 10, "text": "Absolutely good movie, recommend watching this. Had my husband crying 😭 definitely a 10/10"}, {"id": 11, "text": "Whilst it takes an annoyingly generic and familiar approach to it's incredible true story, The Last Full Measure is still a really good fact based drama that's emotional and engaging. Sebastian Stan gives a great lead performance and Christopher Plummer, Samuel L. Jackson, Ed Harris and William Hurt all give amazing supporting performances. Todd Robinson's direction is really good and the war scenes are effectively intense and harrowing. The music by Philip Klein is good."}, {"id": 12, "text": "Just walked out of the theater minutes ago and I'm still processing it all. Wonderful movie with a strong cast. A powerful story and message about the sacrifices made by Pits and all the men and women serving our country. Very emotional and moving... makes me want to do more that matters in the world."}, {"id": 13, "text": "I'm not an American and I don't see the American engagement with the war in Vietnam was the right thing to do. But the soldiers have nothing to do with the decision. I see this at a very human level, a story of great sacrifice and going beyond one's job or duty to save others lives at one's own peril. The movie provides an opportunity for those who haven't been at war to experience the trauma of loss. Particularly of a person who saved your life. I never saw the point of medals given posthumously. I now see why. This movie educated me through my heart and my empathy, not through my head. The actors, the direction, the music and the editing was just right. There are cheesy parts; they are brief, its like too much icing on a good cake. One can easily ignore them and enjoy the movie"}, {"id": 14, "text": "What an incredibly touching movie (with a beautiful score I might add). Of course it is still fiction and part of the story needs to be redirected. But what an accomplish and feat of a film to get to the core of Pitsenbarger as well as the lost and forgotten men. It's not a typical war movie (as it focuses on the aftermath, the honoring of a hero and those that fought for him for over 30 years). In doing so, keeps it unique and fresh. It focuses on PTSD, veterans and the effects to loved ones, friends and family. I found myself in tears at various moments and just leaving as though I saw all the effort and years put into making this film. Phenomenal casting all around. Great directing by Todd Robinson."}, {"id": 15, "text": "I really enjoyed this movie, a lot of truth and a lot of forgotten honor."}, {"id": 16, "text": "Just finished this. The heartache felt by those vets and the burden they carry for fighting an unpopular war leapt off the screen for me. We owe them for what they gave up and gave us. All gave some, some gave all."}, {"id": 17, "text": "Inspired by a true storyCareer Civil employee Carlton Stanton (Bradley Whitford) assigns Scott Huffman (Sebastian Stan) an assignment to look into Retired Sgt Tully's (William Hurt) request that Helicopter Medic (AIC) Airman First Class William H. Pitsenbarger (Jeremy Irving) be posthumously awarded the Medal of Honor for his actions back in the mid 1960s in the Viet Nam War. Currently, AIC Pitsenbarger holds the Air Force Cross. Stanton doesn't think this will go anywhere and that is why he gave the assignment to Scott Huffman because Scott is 3-months away from losing his job to higher ups. The word was there was not enough documentation to award the MOH.Scott Huffman takes the assignment and must interview former members of Charlie Company that AIC came down from a helicopter to help Charlie Company apparently in an ambush in Viet Nam. He helped the wounded, put wounded in the basket to be uplifted by the helicopter and ended up staying put to protect others when Sgt Tully told him to come up. Then he grabbed a rifle and ended up being shot.This is a very well told and well acted story and at times you may need a box of Kleenex.Notables who were in Charlie Company: Samuel L. Jackson as Billy Tokada; Peter Fonda as Jimmy Burr; Ed Harris as Ray Mott, and John Savage as Chancy Kepper who wrote the After Action Report of that battle; Robert Pine as Huffman Meridith who took Scott to the exact place in Viet Nam where the battle took place and you will see a lot of blue butterflies.Notables Other: Cristopher Plummer as Frank Pitsenbarger; Diane Ladd as Mrs. Pitsenbarger; Dale Dye as Senator Holt who tried to get the award approved in Congress but was shot down; Alison Sudol as Tara, Scott's wife; Hannah Black as young Jenny, Billy's love interest; Rachel Harker as adult Jenny. Here's the thing: Scott Huffman can get nowhere to get the MOH, Medal of Honor, for Billy Pitsenbarger and even turns down a promotion to be an Under Secretary of something. Now you have to understand that Scott Huffman is a fictional character and goes to the press to make his point. This being the case how did AIC Pitsenbarger actually get the MOH posthumously? I have no idea. This was not addressed. If this is inspired by a true story how is this left out? I asked this question because at the end of a true story normally, there is a statement at the end of the movie that tells what happened to the main character(s). This didn't happen in here. Then I found out Scott Huffman was a fictional character.Oh, one more thing. I saw Michael Imperioli's name in the credits, but I don't recall seeing him in the movie. If you watch this and see him as Jay Ford, let me know where he was in the movie.All this aside, takes nothing away from this well told story. I did check out that William H. Pitsenbarger did receive the MOH posthumously. The better title of this could have been The Cost of War.And William H. Pitsenbarger: May God have mercy on your soul and thank you. (9/10)Violence: Yes, an ambush in Viet Nam. Sex: No. Nudity: No. Humor: No. Language: Heard only one f-bomb. Nothing else.Rating: A"}, {"id": 18, "text": "This was a beautiful, touching, well made movie. It brought tears. If you have a heart you will be affected."}, {"id": 19, "text": "I'm not sure what type of person wouldn't enjoy this movie. Maybe someone never touched by an armed conflict directly, maybe someone who believes peaceful tactics are the best defense? I'm not certain.But I am certain this movie is worth the 90 minutes. Movies packed with well-know talent tend to do fairly well, although I don't think those who gave their time for this project were in it for the fame, or even the money. It was a project that needed to be completed, and people needed to know who Airman William H. Pitsenbarger, Jr. was, and who he was for so many men that day in April 1966.I'm confident in saying you'll enjoy this movie, perhaps not as much as I did, but it's worth investing your time in. It'll be 90 minutes well spent."}, {"id": 20, "text": "Great film. Good actors, good writing, well directed, great story."}, {"id": 21, "text": "This is Amazing It makes you realise what the lads went through. Pure hell. But both sides suffered and we can now look at it, and realise that brothers die for brothers and it still goes on and not enough are rewarded for what they give."}, {"id": 22, "text": "Phenomenal. A must-see. Although I'm sure the film has Hollywood touches it's not meant to be a documentary. What it does is pays respect to the heroism and selflessness of William H. Pitsenbarger and honors service and sacrifice of Vietnam veterans. The film immediately grabs the audience and never lets go. I'm better for the privilege of seeing it."}, {"id": 23, "text": "To say this film moved me to tears wouldn't be saying enough. Amazing cast and directing. The story itself is incredible and it needed to be told because we need such stories as inspiration to be better human beings."}, {"id": 24, "text": "Murphman0526 Your claim that it is illegal to depict military uniforms, insignia, etc. accurately in a film is a myth created by Hollywood, which is simply too lazy and uncaring to get it right.There is not and never has been such a law or regulation. Please stop spreading nonsense as an excuse for production companies' shoddy research and sloppy costume design.P.S. I am a retired 30 year Air Force colonel and was an executive producer myself. I know of what I speak from both sides."}, {"id": 25, "text": "Wonderful heartfelt movie. I left it moved with a deeper appreciation for the men and women in service ( both now and before) that we all have so much to be grateful for. Truly great performances by A list cast. In such a divisive time it's nice to agree on the honor of our brave military serviceman. Take the time to watch it.."}, {"id": 26, "text": "An amazing cast brought to light the story of Pitts and the unbelievable sacrifice he and so many others made for us all. It's a powerful movie that I highly recommend!"}, {"id": 27, "text": "I've seen almost every film there is about Vietnam and this is simply an amazing film about amazing people."}, {"id": 28, "text": "The shame is that instead of telling this remarkable story based only on its merits. Instead they made it a conspiracy to hide something. They took something away from the tale by doing this. This is a very good movie aside from that. The emotions and the power of being a surviving veteran are well done in this movie. They are accurate and portrayed very well and in a dignified manner. Each of the veterans (actors) in this film do a very good job of letting the world see the different ways in which each of deal with what took place in our individual wars. The friends that we lost there and here the feelings of sorrow the fears that still visit us daily and nightly can never full, I think, be portrayed but these actors do justice to them. They do justice to us and to all the great young men that have served and will serve in a combat zone in the defense of this great way of life."}, {"id": 29, "text": "A story for those who love an intense drama with good action and a feel good story line. Great way the honer the fallen 9+"}, {"id": 30, "text": "This is easily the most touching, genuine and original movie I have had the pleasure of watching in the past decade. This is a story about honour, friendship and following through. It was truly a great film from start to finish. I am so glad to have watched it."}, {"id": 31, "text": "Though a bit slow and hart to follow in the beginning this movie is by far the best true to life movie that I've ever seen and is also one of my favorites period. The story is incredible and even more incredible is the efforts and determination of those who make sure that this man received what had been denied him. Very moving, inspiring and emotional."}, {"id": 32, "text": "How this movie didn't get the hype it deserves is beyond me. Wow... just wow!"}, {"id": 33, "text": "What an an amazing, heart felt, touching movie of redemption and closure. The lack of action is a truly wonderful choice by the director. It focuses on the people and their story. A film for all ages on the bravery of people under pressure and the choices they make."}, {"id": 34, "text": "As an old Native American saying goes, it's easier to be brave when it's far away. That is certainly a statement that could apply to so many in public office today. These gallant young men were putting everything on the line. For a cause that was considerably less than Noble. That wasn't their fault. That wasn't their issue, that wasn't their doing, but nonetheless they were putting their butts on the line on a daily basis, and nearly 60,000 of them never made it back. This is a wonderful drama. Very, very well written. Excellent direction. With a fantastic cast. Great performances by William Hurt, Peter Fonda, Ed Harris, Samuel L. Jackson, and several others. This movie is really worth watching. It is a very heartfelt portrayal of heroism under fire."}, {"id": 35, "text": "Was not sure what to expect from this film, I didn't see any trailers. It makes you appreciate what sacrifices have been made by service personnel all over the world over the years. This film is beautiful and I recommend you to watch it and there will be tears!"}, {"id": 36, "text": "This a fine film with some high quality actors in somewhat unusual roles which will touch the heart and finally uplift it. While the subject is the Vietnam War its not a typical 'war' movie - it is much more about the people and the bonds and the tradegy war creates and the pain it leaves. A very good and ultimately very emotional film. Watch it, I found it just under 2 hours very well spent and I will definitely be watching it again."}, {"id": 37, "text": "The Last Full Measure is a very good film. It is a film that takes you on a journey through the lives of Vietnam veterans - their view of the battlefield and their journeys through their lives.I encourage vets to watch this film - it is a very good movie. I do wish that the film was longer and included more of the interviews with the veterans."}, {"id": 38, "text": "It's a great movie, it makes you think a lot about bravery, wars, meaningless deaths by human stupidity. As an Argentine, it also makes me think in our own veterans of the Falklands War, fought in 1982 against the United Kingdom in another stupid war, where young soldiers died in the cold islands of south atlantic. How much recognition we still owe to those heroes, who still live among us. The film is good, for what it represents, for what mobilizes you internally, in addition to the current excellent ones of Samuel L. Jackson, Peter Fonda and Christopher Plummer"}, {"id": 39, "text": "If this story wasnt o hollywood-ized, it is a great story worthy of producing.Valor is defined in many ways. Valor in war is rewarded on the highest level.Thanks for this movie"}, {"id": 40, "text": "I did have high hopes for this film if for nothing more than the cast. The did not disappoint. This film should be seen by our youngest of generations so they can gain the respect for our military personnel, respect they deserve. This film did a fantastic job showing how a young man whom had not served in the US military could be moved to act on behalf of someone he did not know and come to respect the sacrifice of one heroic US Airman. Sometimes saying thank you for our service just seems so insignificant for the sacrifices made for our future by every veteran."}, {"id": 41, "text": "Great story movie worth a watch. Very well acted and very touching. Loved it"}, {"id": 42, "text": "This is a fantastic most powerful, moviing movie. Everyone should see this. It is a must for anyone who participated in Vietnam or has a family member or friend who did."}, {"id": 43, "text": "Politicians start the wars and our children die in them. A movie about values, bravery, tragedy and a man struggling to do the right thing. No buzz about this movies but certainly worth every minute n tear."}, {"id": 44, "text": "Really enjoyed this movie, hoping a healing is coming."}, {"id": 45, "text": "Movies are a story telling platform, that's all they are.This movie tells the true story of a US Airman who showed absolute courage in the face of near certain death. Some Hollywood nonsense was thrown in, and some small details were incorrect and overlooked, but overall, if you focus on his story and the message this movie sends, you can't go wrong.The courage of William H. Pitsenbarger has now been told on the big screen, and he and others like him have been introduced to a whole new generation. A generation that now know in the darkest hour one man made a difference.Would I buy this on BluRay? Yes!"}, {"id": 46, "text": "Recollects stories from various perspectives, and in the end, there is a sense of transcendence, of hope, of sacrifice. Beautiful movie!"}, {"id": 47, "text": "A story worth telling so its a real shame that the production team just opened the book of cliches and spewed forth . it could have been a very good movie instead its lack luster and as sickly sweet as sugar syrup. a shame"}, {"id": 48, "text": "I applaud the people who saw fit to make this movie and spend the money for A-list actors to do it well. This is Hollywood's greatest calling, to tell real stories that affect the lives of real people."}, {"id": 49, "text": "A unparalleled story of valor, honour, sacrifice, the incomparable loss of a father loosing his son, what could have been the life of him if he would choose to live other than that. I was sobbing...."}, {"id": 50, "text": "I just watched this movie. I feel emotionally drained! I love how they showed it from the emotional perspective and not just shooting and killing. I cried so many times during this film, because the movie itself and the story behind it really touched me. I am so glad heroes like him get honoured like this! Please, watch this one. I promise you will like it."}, {"id": 51, "text": "The first half hour's movie seem boring and a cheap bad movie, but is an incredible touching movie."}, {"id": 52, "text": "I thought that this would be another typical war movie but it's more than that. This movie focuses on the more human and emotional aspects about what happens during and after the war, and the amazing cast delivers these phenomenally. By the end of the movie, I was moved to tears and although I felt as if the editing could have been done more tastefully, it's a movie worth your time -- well at least it was worth mine."}, {"id": 53, "text": "Brought my tissues ...needed them ... Such an incredibly moving experience ...brings me back to those turbulent days but through the eyes of young men who were there and those effected because of war...kudos to Robinson and everyone who believed in Pits. Such an incredible young man who served with Valor. Never forgotten is all a father could ask for..."}, {"id": 54, "text": "I usually love most war movies and this was definitely a great one!. I think it's because I appreciate that people have fought so hard for my rights. This movie hits a little close to home, talking about the Vietnam War and how they were treated when they got home. My Dad was in the Navy from 1965 - 1969 during Vietnam and he said when he got home, he got called horrible names and was spit on. It was terrible! My Dad was terribly affected by chemicals that have destroyed his lungs. But he would do it again in a heartbeat. .This is"}, {"id": 55, "text": "Don't listen to the poor reviews. This is a damn good film that brought tears to my eyes on numerous occasions.Stellar cast and on point acting. Even Seb Stan surprised me after years of being the winter soldier.Good job, a war film that aims at everything but the blood and guts"}, {"id": 56, "text": "Disregard the negative reviews and watch it for yourself. To see these war heroes still suffering with PTSD makes your heart bleed as we have no comprehension of what these men and women whom have served saw during the war and their suffering as a consequence. So please give this film more respect and credit by watching it as I was truly shocked by the low rating for such a fabulous film, with some of the greatest actors of our time."}, {"id": 57, "text": "Scott Hoffman (Sebastian Stan) is a civilian Air Force lawyer who is assigned the menial task of collecting statements and putting together a report for a medal upgrade to the Medal of Honor, posthumously for Airman William Pitsenbarger. He is going through the motions until the next opening comes along. In conducting the investigation his own values and life' s pain becomes involved as he unravels threads of the past and pokes at wounds to get to the truth of the survivor's guilt. It is a heartwarming tale that shows PTSD veterans in a good light.Guide: F-word. No sex or nudity"}, {"id": 58, "text": "I really enjoyed this movie because of the excellent character development that showed real people and how they each processed the traumatic events in their lives. Not just entertainment, enlightenment."}, {"id": 59, "text": "Anyone who has had anyone in their lives who has been in the military needs to see this movie! Not only Vietnam veterans but anyone! This is an amazing movie about war and how it changes the lives of those involved. Amazing!"}, {"id": 60, "text": "We see all the movies and this one is more than touching--it grabs you and we will be talking about it for weeks. Emotional, truthful and well edited and told. A sure bet for any movie goer with the least scintilla of a heart. Must see."}, {"id": 61, "text": "Yeah, to you ultra critics, there were uniform and equipment inconsistencies. It was in bright, sharp colors, too, which was also impossible for the day!So who cares about the little details. The story was amazingly, movingly, beautifully portrayed by a great crew of actors. The whole audience-mostly men-were tightly holding back tears. You could hear them being choked back. It touched all the nerves of anyone who cares about commitment, honesty, responsibility. The treatment of Vietnam then and now; Washington politics; intra-Service sensibilities; PTSD was superb.This is without a doubt the most moving, and certainly one of the best made films in cinematic history.Go see it. You won't regret it if you care about the three things I talked about above. THIS deserves an Oscar, a real Oscar, not the degraded, artsy-fartsy, how-depraved-can-we-make-it things they award today."}, {"id": 62, "text": "True story I DARE ANYONE NOT TO CRYSHAME THAT #oscars NEVER EVEN GIVE AWARDS TO MOVIES LIKE THISWATCH IT IF U CANT FIND IT Keep looking it's worth it"}, {"id": 63, "text": "Very touching story in all it's simplicity. Very well acted by some great actors."}, {"id": 64, "text": "The film is very good if not excellent... Very touching and REAL"}, {"id": 65, "text": "This was a beautiful picture, and a story that needed to be told. It was particularly great to see the veteran actors assembled here, and it appears that it was Peter Fonda's last movie. I'm glad that I didn't go to film school, because I don't understand the seemingly spurious critiques that I've seen here. I was able to enjoy the movie, unencumbered by the faults that some experts perceived. One review complains about the cutting to flashbacks and duplicated scenes. I would guess that that reviewer would really hate Rashomon, then."}, {"id": 66, "text": "An ambitious Washington government official (Stan) is instructed to review the rejection of a Vietnam vet's nomination for the medal of honour. He must seek out other veterans to find out the truth.The film is clearly paved with good intentions and indeed there are many good scenes here. It is also gratifying to see such a strong cast of fine actors do their turns / make their speeches, However, the overall effect is one of repetition ie speech followed by Vietnam battle scenes ad nauseum and this is compounded by a frequently clumsy, crass script that almost makes you cringe. The cloying soundtrack so typical of better weepies cloys as well and their are a number of scenes dripping in sentiment. The overall effect therefore is probably 60% good stuff and 40% rubbish."}, {"id": 67, "text": "Plodding over sentimental trite flag waving waste of some talented actors.Surely the real life tale wasn't this boring?"}, {"id": 68, "text": "It's a compelling true story that feels a little corny at times, but it just feels like it could have been a bit better. The real accounts during the credits feel more raw and compelling than the entire movie combined. As Tim O'Brian says, it's impossible to tell a true war story, and this movie is able to tell an awesome war story while feeling hollow on several subjects relating to war. To its credit, a couple subjects strike a chord and feel exceptionally genuine, but batting less than 0.500 is a disservice to reality and what these men actually went through."}, {"id": 69, "text": "Incredibly moving and great performances from all actors involved with making this beautiful movie. Hope more people get to see this and acknowledges these brave people."}, {"id": 70, "text": "The way the story was told did not serve the hero well. The impact of his heroism wasn't shown well in the fragmented manner of flashbacks. Couldn't get what some of the actors were saying about what happened during the battle too. Better to have shown it chronologically the battle then the quest for justice. The POV of the DOD guy and the opposition he faced shouldn't have been the main focus.A few good points: The cast of A listers helps give weight to the PTSD suffered by vets. The ceremony at the end is moving."}, {"id": 71, "text": "I found this by mistake but I thought I would give it a go,I didn't see any reviews or neither had I even heard of this film.i watched it and I couldn't take my eyes of it.i must admit it's been a while since I have been so moved by a film , give this film a chance you will not be disappointed."}, {"id": 72, "text": "The movie surprised me on so many levels. As Vietnam Veteran it brought back many memories of my time there. It's a compelling story of the search for truth and redemption. The flashbacks set the stage for a tale of Valor. I highly recommend this film."}, {"id": 73, "text": "Based on true event. How touching to know a hero and seeing how people fighting for his recognition."}, {"id": 74, "text": "This movie was fantastic! Very emotional and touching and I cried throughout the whole movie. Actors are great, but the story line is even better! After watching the movie I feel like I know more about what veterans go through and the process of receiving a Medal of Honor. Definitely recommend!"}, {"id": 75, "text": "Not so bad, well acted but a bit cheesy in parts, I was tempted to switch it off but I didn't and by the end of it found it okayish. Pity about the TV movie music which really put me off."}, {"id": 76, "text": "This movie is based on the true story of William Pitsenbarger, A US Air Force Pararescueman in the Vietnam war. You don't get to see the emotional side of War, just the horrors in movies. This has a wonderful ensemble cast with the likes of Samuel L. Jackson, Ed Harris, William Hurt, Sebastian Stan, Bradley Whitford to name a few. Even war veteran and actor, Dale Dye has a pivotable role in this film. There is a scene at the end of the film that even gave me a lump in my throat! If you like war movies, I think you will like this one."}, {"id": 77, "text": "I wanted to like the movie because it's a great story. Unfortunately, it's a full two hours of touching scenes with flashbacks to the war scenes consistently spattered throughout. Its was very slow, and the moving parts were somewhat ruined by the whole movie tryin to be a tearjerker. There was no rhythm or climax to the story. It's unfortunate that this tribute to Bill Pitts did not do him justice."}, {"id": 78, "text": "Loved every second of this powerful film. There wasn't a dry eye in the theater but so worth seeing. This film captures the pain of PTSD on all involved while telling a true story of the war. Must see!"}, {"id": 79, "text": "The last full measure is a film worth seeing just for a cast that was gathered to be in this film,since im not american i didnt know nothing about this person and his story in vietnam war,but thanks to this film i learned something and i can appriciete everything that he has done,it was also good to see that sebastian stan is getting more and more regonition in a film industry since he is really underated actor,this film also give me a satisfaying ending that was deserving and very impactful,only moments when they traveled through story back in vietnam war was not so good potrayed and some scenes didnt sold me intensition of that war,this film will satisfay persons that are fans of main character since i think he was represanted with a lot of respect"}, {"id": 80, "text": "I went to the cinema knowing it'll be about damn American lie patriotism, but thought why not to watch some war action or to be entertained anyway.It was worst than I thought. It's like a boring TV movie switched to cinema. No character development, nothing attracts you to get emotionally to the story or the people in it. The dead soldier whose the story about him was praised like he was Jesus.I swear to god it's like a kid wrote the screenplay.This is such a bad movie. Don't believe the positive reviews, they either been paid or too patriotic and many of them said they don't like war movies, but this one they did like it so much. So think about it why ?"}, {"id": 81, "text": "If you look at reviews by date, you will see for every honest review below a 7, it will be topped by a bunch of fake 8-10's. This movie is certainly not worthy of any 9 and 10's. It was well directed but not written as good with all the back and forth. The best part was just the ending"}, {"id": 82, "text": "Can't find proper words. I am so sorry. Great movie about human who became hero. For many of us, humans."}, {"id": 83, "text": "A wonderful film that tells a meaningful story. Great cast. Well worth your time."}, {"id": 84, "text": "I have never really been a huge fan of War movies but this movie was incredible! I was intrigued when I saw the trailer first come out and wanted to give it a chance. I adored all the characters and the plot, I understood the struggle these characters faced with their daily lives. I got so emotional in many parts of this movie, loved every single second. The characters were portrayed incredibly and I honestly don't think any other actors/actresses could. This movie is certainly a top movie for me and one I will gladly show my family. Huge props to everyone who worked on this movie, I am currently planning on watching it again!"}, {"id": 85, "text": "Very well told story without being a full blown war film ,what can I say watch it and be moved ."}, {"id": 86, "text": "I've never written an IMDb review. This is the lowest rating I've attributed to a film in quite a long time, and I see just about everything PG-13 and above.This film draws you in, initially, with that typical and predictable lure of ignorant government official learns a life lesson bit. Once it arrives at a place where the story begins to unfold - where most movies gain their momentum - this film remains stagnant and boring. It's either over-acted or under-acted, depending on the scene. Extremely anticlimactic.The highlight seems to be around painting the picture of a truly all-American hero with zero flaws (even Captain America had flaws), inside and out, who is deified for dieing on the battlefield among men he didn't know. This film is nothing shy of glorification of war, and embellishment of presumed character of an otherwise unknown man."}, {"id": 87, "text": "Fell asleep watching this.. other reviews give it a 10.. but was boring"}, {"id": 88, "text": "What a terrific production, really puts the viewer in the shoes of the character as they take you on the journey to justice. Final few minutes are very touching and emotional. Well done."}, {"id": 89, "text": "To me, Everything is outstanding about The Last Full Measure, not only the deeply moving story, but also the super cast that not many movies can boast.Christopher Plummer, William Hurt, Robert Pine (from Chips), Samuel L. Jackson, Ed Harris, John Savage and Peter Fonda... Just SPECTACULAR CAST, we don't see something so cool so often.I watched this film and liked it. it has some moving parts and i think it might earn some oscar nomination in some categories. great acting, great story. i highly recommend it, and you'll not regret it."}, {"id": 90, "text": "Powerful, stirring, star-studded account of the heroism of an air force para jumper rescue medic, the likes of which are too often lost in the political gut reaction associated with the Vietnam war. A must-see opportunity to experience, understand and appreciate the far-reaching impact of one man's selfless service and sacrifice, and the difficult battle associated with being a beneficiary and survivor."}, {"id": 91, "text": "COVID might have killed off one of the best true Vietnam movies..."}, {"id": 92, "text": "This film has more substance than any other Vietnam Era movie I have seen. The movie has an R rating but It's not a continual portrayal of violent action, although some scenes of the fighting are violent and disturbing. No nudity, no inappropriate language It is about Heroic individual Valor, PTSD and the struggles that many Veterans suffer. This was portrayed with class and understanding. William Hurt, Ed Harris, Samuel Jackson, Diane Ladd, and Chris Plummer were outstanding in their parts. I can't recall any film that actually moved me to tears, but this one did. A must watch"}, {"id": 93, "text": "Had this movie in my Hulu list for months before I finally sat down and watched. Maybe it was because the subject matter can be tough to watch sometimes, but definitely glad I finally watched. Always good seeing military personnel getting recognized for their service."}, {"id": 94, "text": "I'd never heard of this movie, it just showed up on my streaming service. Often I skip these movies as they are so often a caricature of the truth and end up as a bad cliche'. However this one is different. To start with you must remember it's based on a true story. That is an important fact to remember as you watch these amazing actors bring the story to life.I won't go into each performance, but there are some amazing scenes. If you don't cry during this movie you sleep in a casket during the day. It's a touching tribute to a wonderful story about an amazing man who deserves our respect. Watch it."}, {"id": 95, "text": "Powerful, affecting, sensitive and thought provoking. Realistic depiction of the horrors of war and its after effects as well as the government bureaucracy and CYA egotists in positions of power. A most welcome nod to our men and women in uniform and special kudos to the US Air Force and it's ParaRescue component, the later of which I've never seen featured or highlighted. Highly recommend this serious, realistic dramatic movie."}, {"id": 96, "text": "I really enjoyed the entire movie and was caught off guard by the depth of emotions that were examined on screen and those the movie pulled from viewers! Their representation of PTSD was very accurate. Until my life was threatened again in 2001, I didn't know that I had lived most of my life with PTSD and knowing that helped me to forgive myself for some poor decisions and misunderstood reactions to others. It's not an easy diagnosis to live with or to fight to get rid of and this movie showed us that many victims are struggling all the time, but often out of sight. I was really grateful for the scenes where folks were encouraged to remember/talk about the issues. Sometimes people try to stop you from remembering/talking because they are afraid you'll stress out and blow a gasket or something - exactly the opposite, learning to talk about the issues with less emotions is what we are subconsciously driven to do. Being told, even indirectly, that you are a dangerously, emotional person who needs to be silenced and controlled does not encourage you to trust the person making that assessment. Some just don't want to hear your story as it makes them uncomfortable, but those are often people who either suffer themselves in silence (pray and sympathize for them) or they are just selfish - enough said on that! If you have someone in your life who needs to talk, try to allow that or help them find a safe place to do so.Although I kept the tissues handy throughout the movie, the dam broke over the Medal of Honor presentation ceremony. Having grown up in the time that many of my friends served and some died during the war the government officials still can't/won't call a war is still depressing and frustrating. People died, a lot of people, people are still bearing scars or minus limbs and families are still mourning the loss of young adults who gave their lives/peace of mind and sometimes pieces of their bodies - just like in a real war!I'm not very good at naming my favorite type of foods (probably the last meal eaten - Mexican, Thai, Indian or a huge salad), my favorite color (well, finally I do have one - purple, the color of our dog's vests for Psychiatric Service Dogs) or my favorite movie, book or song - again, probably the last one I watched, read or heard.The MOH presentation ceremony near the end of this movie is easily my favorite part of this fine film. It was great watching group after group rise to their feet until almost the entire room was standing. This should be a reminder to politicians and others that war, even when it's not officially called a war, spreads it's tentacles and touches lives far removed from the participants. And, it affects those lives, not for just a little while, but for the rest of the time they are alive.Wars, even those that aren't called wars, are serious, destructive and life altering for many. All who respond to protect others, are in my mind, heroes worthy of recognition - those in our armed forces, law enforcement, fire fighters, ambulance personnel and medical personnel treating others from the emergency room to the operating theater.This is an excellent movie to share with friends and family, Based Upon Real Life, historical with an outstanding cast!"}, {"id": 97, "text": "The Last Full MeasureThis movie tackled some very difficult subjects with a clever script and brilliant acting. It is very much an American story and certainly not for everyone.The narrative vehicle was a naive and ambitious administrator, played by Sebastian Stan, as he learned so we gradually understood, the meaning of posthumous honours, human valour, closure, selflessness and the enduring pain of those who survive.I can't say I enjoyed the movie by I certainly experienced it in a visceral way. Whoever developed this dry script into this movie deserves a Hollywood medal as it was a tour-de-force without descending into mush or sentimentality."}, {"id": 98, "text": "I loved every minute of it.. A story of a war hero never told.. Sabastian Stan does a great job in his lead role for the movie.... Get your tissues out for there will be tears"}, {"id": 99, "text": "A friend of mine recommended this film and said it made him very emotional. The story of William H. Pitsenbarger got to me as well, not so much regarding the thirty two year struggle to get him recognized for a Medal of Honor, but for the fact he didn't make it while saving the lives of fellow soldiers when he didn't even have to be there in the thick of battle. The story follows along conventional lines, as a career Defense Department civilian (Sebastian Stan) reluctantly takes on an assignment to investigate the circumstances of Pitsenbarger's denial of the MOH when first nominated. Setting aside a potential career promotion, Scott Huffman (Stan) is persuaded by the stories of fellow soldier combatants and the resolve of Pitsenbarger's parents to pursue the opening of the case to a rightful conclusion. Though the movie offers flashbacks of Vietnam war footage, that's not so much the focus of the movie as the loyalty and honor held for the lost airman by those who didn't even know him during the ferocious battle in which he died. For a similar story of courage under fire, but with a better outcome for it's hero, try the 2016 film Hacksaw Ridge, the story of Private Desmond Doss during World War II. Both films will inspire with their tale of duty and patriotism."}, {"id": 100, "text": "This movie was very well written and the acting was phenomenal. I remember hearing about this years ago and was excited to see it. Warning: I am not an emotional person and don't cry in movies. I bawled like a baby throughout much of this movie!"}, {"id": 101, "text": "While Hollywood has been putting out very poor movies as of late, The Last Full Measure breaks that trend. A story of courage under fire while facing impossible odds. I felt the producer, director, and support staff took the time to do this right. The actors are the finest in the business, but the people whom they portrayed made the story so human, so real. The fighting Vietnam was intense and friendly fire happened, all too often. Calling in an support fire while bullets and explosions are all around you, hitting you, is an impossible situation to be in. The director takes you there to experience. The editing is so well done that the viewer is drawn into middle and experiences the tension, the fear, the reality of the order of battle. I could go on, but I recommend you watch this and experience the story yourself. We may see this film winning some awards for actors, writers, editing, and cinematography. It is worthy of many."}, {"id": 102, "text": "This was by far the best movies I've watched in a long long time. I never write reviews for movies. Although, I couldn't stop my tears while watching this. A sheer emotional rollercoaster ride that has much inspiration to give us all when the world is falling apart one day at a time. Stories of heroism and such valiant efforts by those that protect us so that we can live another day. Sebastian Stan has showcased his acting prowess and the director has created a visual delight for everyone to immerse themselves while staying true to basic of human life - Emotions. I'd give this movie a 10/10 for every little nuance. Thank You!"}, {"id": 103, "text": "This is one of the most poignant, heart-wrenching and powerful movies I have ever seen and I am 68. An amazing cast brought this very touching story to life. I am in no way ashamed to say my eyes welled up with tears many times throughout this movie. At the end, all I could do was sit there and let the emotions of this story and the brilliance of the directing and acting that made it so great wash over me. I am still numb from this touching TRUE story of bravery, courage,sacrifice and brotherhood of the men in this company. God bless every American soldier for their sacrifice for the country they love. They are the TRUE American heroes!!"}, {"id": 104, "text": "The cast of this movie is amazing- William Hurt, Samuel L. Jackson, Christopher Plummer, Ed Harris, Peter Fonda, John Savage. I can't even list them all! It's a difficult subject but a true story that deserved to be told."}, {"id": 105, "text": "6.7? Really? That's why it took me so long to watch this. This was one of the best war dramas I've ever seen. If you're looking for just a bloody action movie, find something else. Though it does have some of that, this film is about the story. I don't normally get emotional watching movies but this movie had my eyes tearing up like 5-6 times. All of the big name actors that played the surviving soldiers put forth some of the finest acting I've ever seen. William Hurt was AMAZING!!! This is one of those cases where the IMDB reviews and score are way off. I really wish I had ignored them and watched this sooner!"}, {"id": 106, "text": "I was skeptical about watching this movie because it isn't as highly rated and it isn't talked about as much. But I took a chance and it was a very, very rewarding experience. There are a lot of movies that look promising and disappoint by the halfway mark.However, TLFM starts off good and just gets better. All acting is on point, the story has been told in a very engaging, touching manner. You really get into the story and want to watch more. And personally, I was moved to tears multiple times during watching the movie. So yeah, this movie cannot be missed. And I loved it even more because there are so many underwhelming movies out there right now. Look good and provide a terrible viewing experience. This movie was just the opposite for me. It didn't look /very/ promising (war, medals?), but there was a story and it was a very well told story. Congratulations to everyone on the project! You did an excellent job and deserve much, much more recognition!"}, {"id": 107, "text": "I went into this movie expecting a Vietnam action adventure flick. Instead what I found was a story of love, loss and redemption; of valor, friendship, passion and dedication. I also saw some truly remarkable performances from some ole dogs I though were long gone, Christopher Plummer chief among them with Ed Harris close behind. But also William Hurt, Samuel L Jackson, Dianne Ladd and get this...John Savage and Peter Fonda! All of them outstanding. This is not just a great story, but also a parable on love and gratitude; of self doubt, fear and redemption. It has it all. Watch it."}, {"id": 108, "text": "This movie is a true masterpiece . A story That will stay with you forever . Fantastically made.People under rating it because they thought it was going to be the usual run of the mill Vietnam film .It's better than that . It gives you a true account of how war effects people going on in life :"}, {"id": 109, "text": "Ignore the bad reviews how on earth anyone could give this a bad rating is beyond me i dont write many reviews but felt i had to as seen the odd bad review. The film is brilliant in every way from the accounts of the war to the toll it took on the people who were there and what they went through their whole lives to the toll it takes on everyone who knew someone involved. A great story of heroism and the tolls of war"}, {"id": 110, "text": "The movies is a great retrospective to a past that many of us forget or don't even known. It was a powerful story of redemption and determination to right a wrong."}, {"id": 111, "text": "This film start with a war scene at the jungle in Vietnam, a man Scott talking with his wife in his car, and a retire pararescue Tulley want to meet Scott scene! As turnout, this film is about Scott helping Tulley to get the Medal Of Honor for Tulley's heroic teammate William! Entire film full of intense explosion scene and bloody shooting scene! Make the film quite watchable! William saving the wounded soldiers, even his life in danger! Make the film quite touching to watch! Scott risking his job to get the medal for William, also quite inspiring! At the end, Scott successfully persuade the president to award the Medal Of Honor to William's father(Frank)! All the audience rise to honor William! All the remaining survivor who save by William thanking Scott! That's it! A recommended war film!"}, {"id": 112, "text": ".. and the Vietnam war is right up there with the stupidest. This film and the story behind it are proof. There is no celebrating this kind of ultimate human idiocy. The worst thing about the film is that literally none of these main actors (save the one senator near the end) actually went to Vietnam.. instead, they were in Hollyweird and Canada draft dodging and protesting against it. How ironic.Anyway. The story indeed is touching, but the film is mediocre to bad, at best. I give it a 1 star to negate one of the fake 10 stars.. this deserves a 5."}, {"id": 113, "text": "Not bad 6.4 rating for a war film so decided to watch it . Sadly seems the production teams paid not enough to some of the great actors here. Every one didn't give their best performance, got a sign of everyone make a frown expression saying sad lines and get paid consider job done. Flashbacks and present don't link together ,Netflix vietnam war documentary far way better than this movie."}, {"id": 114, "text": "Vietnamese fought against American aggressors and won. They are true heroes. It's just Americans who like to make movies about how hero they are. They beat Germans in WW2 while in reality Russians beat Germans. The beat Japanese while in reality they dropped atomic bombs because they couldn't win in the traditional way. The same here. They are kind of heroes."}, {"id": 115, "text": "The story was very interesting and knew nothing about it so, I got educated. However, the film making was not great. Solid cast but I found the whole thing ( Camera work and editing) lazy and corner cutting. It did a disservice to the story. There is no budget mention on the IMDB page. Maybe it was budget related. I gave the story a 10 but took out 4 points for that reason."}, {"id": 116, "text": "It's so good to see a Vietnam War film that honors a brave man who sacrificed his own life to save others.Too many of the movies about Vietnam have been anti-American, portraying the men who fought there in an unfairly degrading way.This one is well-written, nicely directed and has a great cast. It is probably the best ever made about the Vietnam War."}, {"id": 117, "text": "This film is just boring, i gave up after just over an hour. So many Vietnam cliches ! Nothing new, war is bad etc... Great cast but don't be fooled the big names are only really cameo roles. Nothing more to be said boring, boring, boring"}, {"id": 118, "text": "They couldnt even get a liaison to get the uniform right.. He was wearing Sra stripes the whole movie..."}, {"id": 119, "text": "It had great and smooth flow throughout the movie, something we don't see a lot in movies nowadays."}, {"id": 120, "text": "Just want to in the end of this movie i cried,i cried alot....HUGE RESPECT"}, {"id": 121, "text": "This was an outstanding piece of cinema that brings to light the horrific challenges of our veterans and the importance of protecting their enduring legacy."}, {"id": 122, "text": "This is a very touching tale that people should know about. The ending is very poignant. I enjoyed it."}, {"id": 123, "text": "The Last Full Measure is a boring overlong film that squanders its cast. Sebastian Stan makes a likable lead. Samuel L. Jackson, Christopher Plummer, and Ed Harris also make strong appearances. The film's story is an important one. Sadly, it is told in the most cliche way possible. The film is way too melodramatic. It undermines the events we are witnessing. The film also suffers from pacing issues. It was way too long and I wasn't as invested as the film thought I was. Overall, the film didn't do justice to its story or its cast. A shame since the film had potential."}, {"id": 124, "text": "Persistence and fresh perspectives are often the catalysts that make the biggest difference.It took 34 years for an Air Force Pararescueman to be posthumously awarded the Medal of Honor. USAF William Hart Pitsenbarger died in 1966, after switching places on a military helicopter with an injured medic, so he could support the mud soldiers on the ground below.Twenty years later, the never forgotten story was finally shared on the big screen by writer and director Todd Robinson who filmed actual and fictitious characters in California, Costa Rica, Georgia, Thailand, and Washington D.C. His audience, many who were not alive during the Vietnam War, learned how a bloody battle's survivors fought for the airman who had saved them, so he would receive the sanctioned acknowledgement he deserved.Watching this movie, I gained an appreciation of Pitsenbarger's sacrifices, the post war emotional and physical challenges of soldiers who fought in Vietnam over 50 years ago, and the struggles of working with military and congressional government officials.I left the theatre with the refreshed awareness that persistence and fresh perspectives really can make a difference."}, {"id": 125, "text": "The movie should be about Pitsenbarger and getting to see and know him. But it looks like its about Hufmann and his great switch to being a good guy. Also a movie which is a bit slow at times. Nevertheless an okay movie with some emotional scenes. But by my opinion the story of Pitsenbarger could've been told better and deeper. I left the cinema without knowing him very well. Instead you remember Hufmann better"}, {"id": 126, "text": "I don't think I have ever written a review for a movie until now, I'm especially not a fan of dramas, but this deserves a review. I even had to create an account to do so, I picked this movie on a whim and glad I did, its a true tale of heroism and sacrifice. I don't often get chocked up watching films, but the joyful ending to what is such a sad circumstance made me cry a little. Watching the main character who at first could not care less about getting this Vietnam war vet a posthumous Medal of Honour to risking his future, family and Career. It's changed my perspective on the Vietnam war."}, {"id": 127, "text": "This is one of the best movies ive watched in a long time. Very powerful and moving. A must watch!"}, {"id": 128, "text": "Some great actors make up for any criticisms you might feel toward this movie. Emotional from start to ending. It's a shame they give away early on what happened to the soldier that was recommended for the MOH. It would have been better if they kept it until the end. Apart from that, it is a movie 'inspired' by true events so is easy to follow along without questioning too much. Part of the way in I was beginning to think it was just another movie but it surprised me in the way it kept me engaged. Very good."}, {"id": 129, "text": "Based upon the draft from Netflix i thought this movie was another vietnamwar movie focusing on soldiers at war. However when i started watching i thought: meh, its probably no giod. Gave it a chance and watched for 20 minutes and then i saw the potential.A story about how the veterans from the vietnam war were/are treated and a fight to make things right. A very emotional movie, giving me (a norwegian) a different perspective on American war veterans. Its a really good movie!"}, {"id": 130, "text": "Hard to find films like this one now a days. A true American hero."}, {"id": 131, "text": "This is the best film I have seen not only this year but in many years. It has a wonderful moving script based on a true story and a wonderful cast of great actors both young and old. It is perhaps the best Vietnam war story ever told and I challenge anyone not to be really moved by it. I can't recommend this film highly enough."}, {"id": 132, "text": "I was looking for a movie to watch on Veteran's Day, and found this one. Could not have made a better choice. True story, too!"}, {"id": 133, "text": "Good characters, good story, well made, enjoyable.We look for anything over 5/10 to at least make it pass some of the many hours pass during our extended time at home, this is where we draw the line of Passable, anything below this we would not recommend as it would be better to paint a wall then watch it dry."}, {"id": 134, "text": "Loved this movie. One of the best I've seen in a long time. Very emotional."}, {"id": 135, "text": "I do not generally write reviews but I thought this film deserved one. I have watched most war films that have been produced, as well as many documentaries on WW1,WW2 and the Vietnam war. Obviously once Hollywood get there hands on a story like this they have to add a love story and bit of drama. But if you were to put yourself in the shoes of one of the soldiers that witnessed Williams heroics that day or was saved by him, knowing that he potentially gave his life in aid to save others. To have the comfort and disclosure for William to get his reward and rightly so, with only the second Air Force colleague to receive the Medal of Honour after 34 years touching. If only there were more people in this world like William H Pitsenbarger. 👏"}, {"id": 136, "text": "Not often i will give a film a 10 but the cast and the top quality acting was just superb, But I think Scott should have been called up at the end as without him, it would not have happened. Today I am mourning my Mum so it could be why this film got me to tears, but some of the scenes were pretty powerful. I made a mistake in my job, its no biggie, in war its a different story. But why only 3 of the Air Force get the medal? Did the higher ups think as they were not on the ground they were not worthy?"}, {"id": 137, "text": "Great movie of justice. I really enjoyed this movie"}, {"id": 138, "text": "You unhonorable worst of the world and the unspoken. We never forget you..for you bear the unGodly things we cannot endure. You are my undying hope, and when my drop of the spear, my gosh I hate to say it the blink when unimaginable comes at me. You are my rock and you are my salvation for you are the ones that hold me. I love you for what I cannot defend and I love you for what you can not bear. We are One you and I. You are the best of me..just sayin"}, {"id": 139, "text": "There are many classic actors involved in this worthy production. If nothing else, watch their performances. If you are human, watch for the story itself, which is one of thousands of unheralded stories of our military service members. Oh! What happened to Amy Madigan? Either makeup department is FANTASTIC or she is aging poorly for 70 years old."}, {"id": 140, "text": "Very moving from the first to the last minute. Incredible story one mans bravery to help save his fellow men."}, {"id": 141, "text": "This was a story I knew nothing about but was captivated. Fantastic performances and very moving."}, {"id": 142, "text": "Terrific movie about a hero from the Vietnam War who if his story was not told would have been a travestyLots of emotions from some esteemed actors,with special mention for Christopher Plummer &amp; Samuel Jackson, and a lovely supporting performance from Alison Sudol."}, {"id": 143, "text": "Left me really emotional. A brave brave man who did everything for brave brave men. So glad the story was told."}, {"id": 144, "text": "I'm not one for war films and only watched this because my husband wanted to. It is a masterpiece that only the soul less people can watch without shedding tears. If you have no heart then it is not the film for you. I am not American yet I am proud that men like William H Pitsenbarger were so courageous."}, {"id": 145, "text": "Great cast and such a good story! Make me so proud of our soldiers! I'd watch this again!"}, {"id": 146, "text": "It got a little schmaltzy at the end but overall a very moving film about loss, sacrifice and virtue. Outstanding portrayals by all concerned, especially Hurt, Fonda (RIP), Jackson, Plummer and of course Stan. The depiction of Operation Abiline was quite accurate, factually. The 2-16 was indeed hit by a short US artillery round; when it stopped moving to care for its casualties, it was hit from all sides by the VC, taking heavy losses. Pitts truly deserved his MOH. I did not find the conspiracy theory explanation of why he did not get it in the first place very convincing, but you never can tell."}, {"id": 147, "text": "Straight to the point and no over the top fillers. Well balanced cast that works great together. This movie made me cry more than any other movie I've ever watched! Phenomenal! No corny stuff either. It was straight forward here's what happened and this is what we're going to do, now let's make it happen. Very powerful movie."}, {"id": 148, "text": "There are few movies that really move me, this one moved me hands down. I grew up with a girl named Debbie (I'll keep her last name to myself), who lost her son to Americas war on terror and her son received the Medal of Honor. I greatly appreciate the sacrifice her son made. I had one uncle that served in the South Pacific during WW2 in the US Navy with constant Japanese attacks and lost many of his comrades and suffered with PTSD the rest of his life. Another uncle was a Navy Seal and wounded in combat and refused his purple heart because he didn't want his mother to know. So many sacrifices by the US military that are never honored or recoginized."}, {"id": 149, "text": "It stole the air out of my lungs. Drew tears from my eyes. I am so glad I watched this movie. I'd recommend watching it in memory of the sacrifice of Pits."}, {"id": 150, "text": "As a Vietnam era veteran this film really hits home. The author seems to understand what it was like. Wow! I wasn't all that successful in holding back the tears. The essence of the film tells me somebody understands. This story is so well told. 10 Stars"}, {"id": 151, "text": "Went in with quite a lot of hesitation, but within 10 minutes I couldn't take my eyes off the screen. Loved every second of it and would definitely recommend!!"}, {"id": 152, "text": "If you loved hacksaw ridge, you will love this, action, great story line and a true story and actors doing an amazing job."}, {"id": 153, "text": "Sometimes a movie comes along that despite an obvious and heavy-handed script, still manages to be a journey worth taking. One has to be made of stone not to be moved by this somewhat fictionalized account of the quest to honor fallen Vietnam-era soldier William Pitzenbarger. A great cast of Hollywood vets give their all, including Peter Fonda in his last performance."}, {"id": 154, "text": "My personal favorite Vietnam conflict movie followed by Danger Close. Other true story greats are Hacksaw Ridge and 12 Strong."}, {"id": 155, "text": "This is a well told tale disregarding the obvious errors as well as the perceived errors. First the obvious errors: Wrong tailpipe on the exhaust-----No. Wrong helicopter altogether but they went with what they had at the location. A1C Pitsenbarger was lowered from a HH~43, NOT a UH~1. To go even further it's the wrong hoist hook. It's the wrong guy running the hoist. Just enjoy the movie. NO conspiracy-----Mebbe but the recommendation WAS held up in country and later found in very old files. The AFC was the consolation prize. Pits other awards were awarded for previous actions such as rescuing a wounded soldier from a mine field. Just enjoy the movie. An A1C wearing three stripes-----Yep. At that time A1C was the E~4 pay grade. A3C was E~2 and A2C was E~3. That series of ranks has repeatedly changed just as have the senior NCO stripes. Someone doesn't know KISS. Just enjoy the movie. There are many inaccuracies in this movie but as a friend of mine told me years ago when I panned Blackhawk Down, he just wanted his kids to know the event occurred. Even when Audie Murphy played himself he had to accept some Hollywood embellishments to tell an otherwise heroic story. My note about this review containing spoilers is nothing more than addressing parts of this movie. I saw the first showing of this almost a year ago at the same place where the Medal was presented, The Air Force Museum.JUST GO SEE THE MOVIE."}, {"id": 156, "text": "Act 1 - 5.2Act 2 - 6.2Act 3 - 6.4Movie takes place in the late 90's with flashbacks to the Vietnam WarScott Huffman is tasked with hearing stories from vets about their fellow solider Pits, who dies saving their livesFeels like a 90's made for TV movieDialogue is bad, direction is bland and the Vietnam sets look cheapIncredible cast of legendary actors in the film that do their best with the bad dialogue, sometimes rise about its limitationsPerformances are decent to bland with Stan giving a very soulless oneGood subject matter about an incredible man who saved lives when he didn't have too and died doing soWish the film approached this story betterHas moments of strong emotion and gives insight into the veterans lives and their struggles after warFilm tried to show how war affects everyone in some way or another and one man can make a differencePremise has potential but doesn't live up to its subject matterAlso Bradley Whitford coming around the corner to start his clapping is hilarious."}, {"id": 157, "text": "The heart was in the right place for the subject matter regarding this movie but I honestly found it quite boring to watch. The acting wasn't up to par except for Ed, Plummer and Hurt were good. The only parts I enjoyed were the ceremony and the clips of the real veterans interviews at the end...really touching. Five stars for good intentions and the ending."}, {"id": 158, "text": "I am amazed how this has taken so long to be told. But I have to say if anyone else did it, it wouldn't have the Heart and Passion this has in it. The whole cast gave of themselves 100% and Todd Robinson did an amazing job in Direction"}, {"id": 159, "text": ". . . so I went out of my way to see this film revolving around Operation Abilene. Fittingly (since the aspect of Abilene most memorable for me was one of its livestock slaughterhouses), THE LAST FULL MEASURE documents how Operation Abilene was carefully crafted to become a slaughterhouse for the 100 or so men of Charlie Company, 2nd Battalion, 16th Infantry Regiment (the Big Red One), April 11-12, 1966. Just as most of the meat-packing personnel suffer severe PTSD symptoms throughout their shortened lives, THE LAST FULL MEASURE explores the effect of equally bloody gore upon the survivors of Operation Abilene. Surely this film is leading the 2021 Oscar Race right now, given the fine acting of an all-star cast, the deft plotting (packed with unpredictable twists or curve balls) and its verisimilitude. My main takeaway is that some traumatized vets such as Jimmy and Ray require lots of guns and ammo for therapeutic purposes. However, combat disabilities leave many of these heroes impoverished. So please see THE LAST FULL MEASURE, and then generously support your local chapter of BANGS (Broke Americans Need Gun Stamps)!"}, {"id": 160, "text": "One of the best films of the year if not decade. I came into the theater expecting to leave halfway through. Instead, I was presented with a gripping drama and sensational film depicting a young American Air Force Service Man receiving the Medal of Honor posthumously. The movie depicts the emotional tale of the soldiers' who he saved and their unresolved issues in dealing with the war and the fact that the Air Service Crew Man never got the recognition he deserved."}, {"id": 161, "text": "I really felt this movie could have shown us a real hero, but got lost in over sentimentality. The real life Vets had an amazing story to tell, but the going back and forth to real events was hard to follow. I wanted to know more about the man himself, rather than info from those who knew him. Flash back scenes of his thoughts, his character, his motivations. The music was from the Hallmark channel, and I kept looking for Tom Hanks."}, {"id": 162, "text": "Another cockup from our armed services finally recognised for the heroism it produced by selfless men of extreme bravery &amp; honour. As a Brit I find it astounding that cynical and clueless critics who would probably wet themselves at the mere sound of a single gunshot. This film is well scripted, cast, acted and produced to a high standard. I'd like to know where these muppets draw their experience from to write such reviews. This film is better than 90% of the drivel out there and trust me when I say I very much doubt you will leave disappointed. Don't take heed of the pop corn lurkers from the rags, they are a dying breed of wannabe has beens. America, be proud of your heratige and your boys that didn't come home from a war they only went to, to perform their duty as your selfless guardians.' Lest We Forget'"}, {"id": 163, "text": "Movie was a tick slow at times and many mis casted actors. Few of the actors in the movie had no business being in it and just were wrong for the part... Peter Fonda??? Bradley Whitford??? Yeah just not the best choices in my opinion. I guess I was expecting a little more from start to finish. The actual events of this story are truly incredible but the movie just lacked capturing the story. Peter Berg should have directed this and it would have been much much better. Just My take on it..."}, {"id": 164, "text": "U.S. Army in Vietnam didn't go to subdued insignias and patches until Dec 1967. U.S. Air Force Airman First Class was 2 stripes not 3. The NEW U.S. Air Force has changed the ratings and this is probably why they got it wrong. The producers, director and costume people never got any technical research information from anyone who was in the U.S. Air Force during in Vietnam Conflict."}, {"id": 165, "text": "Pits is referred to as Airman in the movie although his 3 stripe usaf uniform indicates a Sergeant during the time of the Viet Nam conflict. On 1976 terminology was changed so that 3 stripes indicate a Senior Airman. In 1991 the rank of Sergeant was abolished."}, {"id": 166, "text": "Won't even be considered by the Academy because America still wants to forget about the Vietnam War"}, {"id": 167, "text": "This man was denied a posthumous Medal of Honor for 34 years for no obvious reason that I could discern from this movie, and then it took 20 more years to make the movie. The performances were very good, though it strayed into the maudlin sometimes, particularly with regard to the dying father and the survivors' guilt. It was pure old-style Hollywood story-telling. They laid it on thick."}, {"id": 168, "text": "A heartbreaking story worth telling, but the movie is slow and utterly boring, full of cliches and hollywood sugar."}, {"id": 169, "text": "This movie had all the makings of a great film, but a fictionalized account of true events and TV movie of the week writing, acting, directing, budget, and production values killed it."}, {"id": 170, "text": "Latest entry and minor twist on the Hollywood trend in thank you for your service pandering.Production quality was decent, but writing and dialog was contrived and lacked depth."}, {"id": 171, "text": "This is the old kind of movie stuff. You got the breeding male and female located in a city. Have you ever been exposed to the word: wrong red engine puppy? The bibles a prop. The only thing that makes me react strongly and have to control myself is a heated ford 150 engine pinning my body to the floor."}, {"id": 172, "text": "The cinematography was outstanding and the cast was all star. We watched the movie over the Memorial day weekend which was apropos. The storyline deals with the death of a person serving on military duty"}, {"id": 173, "text": "It could've been a really good movie, but everyone's overacting and everything's dragged out. I'm bored to bits"}, {"id": 174, "text": "I cannot believe all reviews so far miss the most glaringly obvious production error: the main protagonists are 20 years too old in the story's main plot timeline, i.e. the 1997-98 investigation period. The survivors would have been in the early 50s being some 32 years on from actual events, instead we are presented with all very old men; Samuel L Jackson, a grandad in his 70s, Ed Harris almost 70, Peter Fonda looking every day like his 79 years. This would have made Fonda almost 50 in the battle.They could have got away with it if the investigation had been done in 2017, not 1997. As it was, it lost all plausibility very early on."}, {"id": 175, "text": "What a great movie about a real American hero, friendship, honor and all what makes America great. And great actors."}, {"id": 176, "text": "Perhaps it's because the film doesn't neatly fit into a specific category (it's certainly not a normal 'war film'), or perhaps it's because it's mainly US-centric, or maybe just the fact that it's not reached a large audience, but the film has definitely not received the praise it deserves.Exploring a heroic act, of a heroic individual, through the endeavour of veterans and a civil servant to have the hero rightly honoured with a medal of honour, this film explores the grim reality of war and the trauma it causes for those involved. But it also explores the heroism people are capable of, for the values they hold.With plenty of emotive scenes and the very well portrayed self-reflections of the film's characters, this really is a powerful and enjoyable film that fans of visceral, emotional films should watch."}, {"id": 177, "text": "Amazing film with a very important story really shows the bravery of the soldiers that fought in the Vietnam war 10/10 beautifully written and incredible acting from start to finish a must watch."}, {"id": 178, "text": "This was just an OK movie. Knowing the true story from a family member that was in this battle, it's unfortunate that it's only based on Pitsenbarger's participation. Although he was a true hero, there are members of The Big Red One that made amazing sacrifices and earned medals to save others and lived to tell about it. Those members are only referenced in the closing credits. I believe the true story of Operation Abilene will never be known."}, {"id": 179, "text": "A cast full of recognizable star actors from Sebastian Stan, Christopher Plummer, William Hurt, Ed Harris, to Samuel L. Jackson, and Peter Fonda give in strong performances. Sadly, poor dialogue, a weak script, slow pacing, and uninspired direction turn the based-on-a-true-story heroic tale into a generic war movie."}, {"id": 180, "text": "Not a bad movie overall but not as good as I should have been. It's a good story, it's supposed to be a feel good movie. I didn't really care for how they did it. Chopping up the action scenes and sandwiching them between some at times very long and dry scenes of dialogue. I understand this wasn't meant to be an action movie, but I think it would have been better if they just told the whole story of what happened in Vietnam first, then went through the rest of the plot with investigating the merit for the previous award to be upgraded to the Medal of Honor. I wasn't terribly impressed with Sebastian Stan's performance, it didn't seem like he bought into the role very deep, he was kind of just there collecting a paycheck. Overall most of the other acting was good, just the writing was mediocre so they didn't have the best to work with. Shorter but more powerful dialogue scenes would have been better, you could easily trim 20-30 minutes from the movie and not really remove much of consequence."}, {"id": 181, "text": "I was In Country about 40 miles away when this went down. The Whole Operation Was A Goof so why are some folks gripping over the model of helicopter, or the strips on a uniform, or the fact that Pits didn't get sufficient screen time. As an Army pilot, I worked mostly with Army Dustoff Hueys and crews. However, these Air Force Pararescue teams were special! The events producers wanted to build into a commercial success need some fleshing out, some screen writing skills to make it what it is. This old Vietnam pilot wept like a baby during many scenes. One of my missions was to fly low as bait and mark targets for fast movers. The line spoken by a US Senator was a particular gut punch for me.Usually we are judged by what we do. But what we don't do is what haunts us.Yes, William H. Pitsenbarger was the epic reason for the movie and maybe we didn't see enough of him. That can be easily forgiven by me. A bit of Hollywood Poetic License was very well executed in this case, and it resulted in a beautiful motion picture. Every comfortable American who perhaps has never taken up arms and walked a post needs to see this one, Well done (for a change), Hollywood!"}, {"id": 182, "text": "As a US Air Force Veteran who served in classified Intel overseas, I did not serve in-country Vietnam. I was at the cusp of the War, referred to as a Vietnam War Era Veteran. I have had friends and colleagues who did serve. We never discussed it. I respect that. If THEY wanted to talk about it, that was different. But, the rule of thumb among most Military Veterans was not (is not) to ask.Until this movie, I was unaware of the Pitsenberger story. It is common for such movies to stir my emotions, deeply. This one surely did. The ugliness and senselessness of war, especially this war, were telegraphed across the screen with intensity. Yet, the spirit and compassion of Pitsenberger reveals a young man who was full of heart; and, love for others.Again, as an Air Force Veteran, I feel honored to have learned about Airman Pitsenberger, superbly represented by Jeremy Irvine. The movie ended exactly as I had hoped it would. The cast of characters includes some of the best actors in the theater profession. Kudos!"}, {"id": 183, "text": "The title of this movie derives from something Abe Lincoln said in his Gettysburg Address all those years ago, It is rather for us to be here dedicated to the great task remaining before us that from these honored dead we take increased devotion to that cause for which they here gave the last full measure of devotion.The event in question happened in Vietnam in 1966, 21-yr-old Airman William H. Pitsenbarger, Jr., a medic, decided on his own to scramble down into the fray upon realizing the unit's medic was the one wounded. He had been recommended for the Medal of Honor but it never went through, we learn because the paperwork routing went awry. It was eventually awarded on December 8th, 2000 during the Presidency of Bill Clinton.Several really good veteran actors are the the roles of men who fought with Pitsenbarger, plus during the end credits we see and hear from several of the actual men who were involved during the 1960s.Good movie, I watched it at home on DVD from my public library, my wife skipped. Maybe 20% of the movie is recreated battle scenes, the rest in modern (1990s) times during the search to find out what happened and what needed to be done to get the award finalized."}, {"id": 184, "text": "The real hero of this story is the real William H. Pitsenbarger.Other heroes were the men who served briefly, but epically, in Vietnam with him, of the First Infantry Division.The real story would have been compelling enough. When this movie told the real story, it was noble and poignant. The movie faithfully depicted Pitsenbarger, an Air Force rescue squadron Pararescue Jumper, volunteering to replace the wounded medic of the Army platoon in harms' way. It showed him exposing himself to constant mortars and bullets. And it showed very accurately, him taking off the flak vest that was his best protection, and giving it to a grievously wounded Army soldier named Fred Navarro, whom he did not even know, so that he may live. And it showed him making a fateful effort to take up arms to thwart enemy advances on those Army soldiers, so that again they could live at the cost of his own life.It showed the extremely emotional Medal of Honor ceremony, where then Air Force Secretary Whit Peters delivered extremely powerful narration, and it showed the determination to successfully upgrade Pitsenbarger's medal to the top award for valor that our nation can bestow.it showed the scars that many from that battle suffered for the rest of their lives. The movie portrayed all of these momentous events in accurate and therefore powerful ways.Sadly, the movie also introduced falsehoods into the narrative, to depict political intrigue that simply never happened, and in doing that, it rendered a disservice. Truth is, the awards package was initially weaker than it should have been, and the medal was downgraded by senior theater commanders to the Air Force Cross, the top Air Force award for valor and the nation's second highest honor.The reasons it was downgraded to the AFC from the Medal of Honor are murkier than presented in this movie. There was never the pointless and petty squabble on the US Senate floor that this movie falsely represented happening.So, why does a flawed movie earn ten stars? Because, sometimes in life, what something achieves rises above the mark and overcomes ordinary limitations. By telling the truth in the faithful manner, by telling the true story of what William Pitsenbarger did, this movie rises to the level of perfection. The wrongs are too weak in comparison to detract from the strengths.That ultimately echoes precisely the perfection that Pitsenbarger's true actions meant to so many who needed his supreme sacrifice, his last full measure of devotion.It will take someone to watch the movie to understand and accept why!"}, {"id": 185, "text": "Reel Tunez Movie Review (1/27/20): The Last Full MeasureAfter seeing Black Hawk Down years ago, I really felt like seeing movies like this left me (and others) feeling like they lived through the hell of war and battles, and I've generally avoided many of these, but The Last Full Measure is an incredible story of bravery, honor, and true sacrifice!The story takes place in Vietnam, and is based on the true story of a REAL American hero.. William Pittsenbarger, a Air Force airman/medic who incredibly and with true bravery ended up sacrificing his life to save many others.As a USAF veteran, I watched this movie with a little more understanding of the mentality of those in the military.The quick notes of the story are based on this Air Force airman who put his life on the line and left the medevac helicopter to support his Army comrades who were under very heavy enemy fire with many killed and many severely injured. He was put up for the Medal of Honor (highest award for military bravery), but instead posthumously given a lower recognition. For over 30 years, those he saved fought the system to give him the true recognition he deserved. This is the story of that recognition, with flashbacks to what occurred which are sprinkled throughout the story.As a vet who didn't see combat, but who studied what occurred in Vietnam and with friends who are Nam vets, I can understand (but truly not know.. thank God) the horror these military members went through. None of my older Vietnam vet friends ever openly talk about the horrors, but every one of them clearly show the scars of that hell.. and for that, I and all who have served recognize and thank them for their bravery and their sacrifice! Some volunteered, some were drafted, but nearly all stood up to serve when called. All of them deserve our thanks no matter what the outcome of any war (or Un-declaired war), fight, offensive, or simply by serving their country in a way that always puts them in a situation where their lives could be sacrificed.This movie had a major cast that included: Sebastian Stan, Jeremy Irvine (as Airman Pitt (Pittsenbarger), Samuel L. Jackson, Peter Fonda (his last role), Christopher Plummer, Bradley Whitford, William Hurt, and many other very talented actors.. and the cinematography and production were top notch!The Last Full Measure... a story worth knowing and movie worth seeing! On a 1-10 star scale, I'd give this a 7.7 (although the story itself is truly a 10 and one that we should all know). PLEASE stay through the credits. Unfortunately they immediately do not start the part you should see until about 2 minutes into the credits, but after the credits start, they put real video of the people who were actually in that fire-fight discussing Airman Pitt, and how he saved them. It includes short interviews and statements from not only the men he saved, but his fellow medevac airman who he left behind in the helicopter to drop right in on the fighting to try to save those who were shot up.The Last Full Measure... definitely worth seeing!!"}, {"id": 186, "text": "How can a movie with such good and noble intentions, augmented by some of the most heart-felt acting I have seen in a long time, leave me so disappointed?According to what I have read, writer-director Todd Robinson had wanted to do a film about Medal of Honor recipient William H. Pitsenbarger for over a decade, but had to fight development hell and studio indifference.My problem is the film used a fictional investigation to frame the story, hence the opening title card that said: Inspired by True Events. In doing so, the film-makers shifted the focus on the investigator, not William H. Pitsenbarger.It is encouraging that Hollywood is finally giving our veterans from the Vietnam War son long overdue recognition. The story of William H. Pitsenbarger is truly inspiring. It did not need the fictitious artifice of a fake conspiracy story to make it more compelling or relevant.For good intentions - 10 For execution - 5"}, {"id": 187, "text": "OK first of all criticism of the film is not criticism of the person awarded the medal of honour. Please don't misapprehend me on that.At the basis of this film is a really poor script with genuinely weak dialogue. Awful, awful writing.The money in the film has been spent in a lopsided way on cast - but the best actors in the world can't resurrect a dreadful script. They need something to work with.The characters are two dimensional clichés - without exception. The engagement is wooden, clunky, and sometimes cringeworthy. There are constant attempts to pull at heart strings to get away with it - and there is no relief from the sentimentalism anywhere. A good film should ebb and flow, build and relieve pressure and pathos. The pace of this film is slow throughout, the sentimental content is always on full blast, to the last detail. Of course the main character's wife is pregnant. Of course Samuel L Jackson's character is introduced fishing at the creek with his grandchildren. Does it still hurt grandpa? Only on the inside It is an absolutely relentless assault to the point where it goes way over the top. It's unforgiveable.The musical score is absolutely B grade movement at all times. The effects are generally TV movie quality.I am sure that the gentleman who was eventually awarded the medal of honour was quite exceptional - but this film really isn't and its not worthy of his contribution. If anything it's exploitative.The people grading it nine out of ten, ten out of ten, are happy to be fed with a sugar heavy product. This is like syrup. Someone compared this to Hacksaw Ridge and Private Ryan - and this is nowhere, absolutely nowhere near that mark.Other critics have noted poor detail in uniform, historical accuracy, and overall military consistency. I'm not surprised. This doesn't come across as a film where anyone did their homework or cared about the delivery of meaningful dramatisation. It's pumped full of trite devices you seen before - you don't for one minute think that you've been given any insight into actual real people. This comprehensively undermines a very poor movie and it left me personally feeling that Hollywood used the opportunity to sell movie tickets and try and win some awards. Its a hideous and cynical experience. There's no integrity here. I cannot recommend it."}, {"id": 188, "text": "Everything in this film started out fine until it veered off on a completely fake narrative: The claim that there was some conspiracy to hide the issue of friendly fire in this battle.In fact all of this was known when Pitsenbarger received posthumous the Air Force Cross (Navy, Army and Airmen cross is the second highest decoration in the US military). In fact he had already received Air Force Cross, Airman's Medal, Purple Heart, and the Air Medal for his actions -- so he was not some kind of anonymous and hidden hero. The issue of friendly fire' was not deaths of US soldiers in Battle of Xa Cam My, no us service personnel were killed by friendly fire in that engagement. The issue was the close artillery fire that forced some of the rescue helicopters to withdraw and stay back. That danger close artillery fire was called in by the Us troops on the ground.Knowing Hollywood I can just imagine the green lighting of this film: Hollywood Guy/Gal A: I got a script submission for a story on the conversion of an Air Force medal to Medal of Honor for a brave US Airman in Vietnam . Other people in the meeting: To heck with that, our narrative was Vietnam was a bunch of baby killing . Guy/Gal A: wait, there is something about friendly fire, we can use that angle to dump on the US military. We will center it on a fake conspiracy and use this guy's death for our own messaging Everyone else in the meeting: Great -- Green light it!"}, {"id": 189, "text": "..the most fake/paid reviews goes to: The Last Full MeasureI can't stand it when filmmakers have no faith in their own film, that they have to resort to these tactics.At best, and I'm being generous, this film is an honest 7/10.The casting and performances were outstanding. The story itself needed to be told. The ending was the best part of the film, and the only part that was written and directed properly.Writer and director Todd Robinson did a lousy job with the convoluted screenplay and the bouncing back and forth with the flashback, some duplicated, others pointless. Some of the dialogue just didn't make any sense and seemed like it came out of nowhere. His camera work was better than the editing, but still needed work.The score also felt overbearing and out of place. I really feel this story could've been told in a much better way. Maybe another seasoned screenwriter should've been hired, in place of these constant new fake/paid reviews.\\My generous 7/10 is all towards the all-star cast that were the main reason this film wasn't a total flop. Now let's see how many more fake reviews top my honest one smh."}, {"id": 190, "text": "Why is Pits wearing sergeant stripes when at the time he was an airman? Why are the weapons wrong. Why are combat soldiers yelling in the jungle before combat starts when the enemy almost certainly would be nearby? What on earth is this Friendly Fire narrative, which has been debunked by several military historians? Where are they getting a coverup when there was none? If it was a coverup why did he receive second highest award back in 1966?Dramatic license is one thing, but just making it up as you go along and exploiting a hero to make money, without care for facts, is another thing. The makers of this film demonstrate total lack of knowledge of the military honors and decorations process. There are literally hundreds of amazing heroic stories where people have gotten Bronze Star, Oak Cluster, Silver Star, Navy Cross, DSC without getting Medal of Honor, when, if you read their story, you'd be thinking -- my god give this person a MOH. It is not a conspiracy. Sure you get people like John Kerry who get purple Hearts for torn fingernail. If the makers of this film had know anything of the process they would also know posthumous promotions are the general rule and that the Sargent strips on him are an egregious error demonstrating lack of knowledge and lack of care."}, {"id": 191, "text": "No typical Viet Nam war movie here. For the first time the world is introduced to the valor of US Air Force pararescueman, SSgt. William Pitsenbarger, through the film The Last Full Measure. Pitsenbarger's bravery on screen (Jeremy Irvine) and in real life could rival any Marvel super hero. In the short flashbacks to the chaotic gunfire in the jungles, young Pitsenbarger's military paramedic training kicks in, patching up torn-to-shreds mud soldiers. But what you don't expect, is his compassion for total strangers not even in the same branch of service he was in. And that's where this movie departs from the war movie classics. We watch the heart-wrenching reminiscing and love of Pitsenbarger's father, who has cancer, played by Oscar winner Christopher Plummer: Dying isn't harder than losing a child. One by one, each of the top actors who portray the soldiers decades later, show the emotional scars that never left, and they all are united because of one man, Pits, and their determination to see him get the Medal of Honor, no matter how long it takes. Great acting, great story, a true tribute! Bring a pack of tissues, not because it gets syrupy, but because of the patriotism it will bring out in you."}, {"id": 192, "text": "The Last Full Measure honestly should have been an hour long HBO Documentary. The information in the film should be shown to all but not in a 2 hour feature film format. The only factor keeping this film's score from dropping is the fact that its heart is in the right place. The film is really trying to do the right thing with the story but where it completely falls apart is the execution. The film is presented so blandly and poorly that it becomes incredibly boring. The bore factor is made worse due to the 2 hour runtime. Whenever the veterans are not being interviewed, the film drags really heavily. It's incredibly boring and it's made worse by the fact that I don't care that much about Sebastian Stan's character. Most of the characters were very one note for me. They had little to no development besides two of them. It's very unfortunate because the two characters the Director tried to develop, I actually cared about. He has shown that he is able to make good characters based on real people but he just couldn't do it with the other characters. This lack of characterization isn't helped by some of the performances. Christopher Plummer and Ed Harris do a pretty good job but everyone else is okay or not great. Peter Fonda and Sebastian Stan had the weakest performances. I love Peter Fonda and it's really unfortunate this was his last film role before he died. Fonda and Stan displayed almost no emotion in their performances. They recited their dialogue in a really boring manner and felt out of place with the other actors. Samuel L. Jackson and William Hurt were fine. Their performances weren't that special and they were just kinda there. The cinematography and editing were very bland and boring. None of the shots were visually interesting. It was just bland back and forth shots except during the action scenes but during the action scenes, the camera is shaking so much that it's difficult to tell what is going on. Overall, The Last Full Measure has its heart in the right place and some good performances from Ed Harris and Christopher Plummer but the film's execution and boring moments make this film unfortunately very forgettable."}, {"id": 193, "text": "Firstly, another reviewer mentioned in not being legal to for actors to wear exact uniform replicas. That is incorrect.According to the original Title 10, Chapter 45 section 772 line (f), actors may wear armed forces uniforms as long as it does not intend to discredit that armed force, and in 1970 that condition was removed altogether by a Supreme Court ruling that it was unconstitutional. So no excuse.As for my take-Good movie, superb acting Military members and their families are going to understand this movie on a far more personal level than civilian families &amp; as one myself (military wife), I can can somwhat over look a few things such as the wrong stripes on the uniform. This movie really showcased in a non-sensationalist way what military members go through after war &amp; the bureaucracy of the DOD when it comes to cases of valor. I'm glad someone told this story. It's a shame that some cynical viewers are going to slam this movie because they either don't get it (see above), or think any hopeful or patriotic is cliche. As another viewer put it, if you dislike this movie it's because you have no empathy. Check out my YouTube channel memoirs of a movie maven for my full review &amp; more movie reviews."}, {"id": 194, "text": "This movie is not about the Vietnam War, or why we were there. That manure is shoveled by politicians, movie producers with no clue, and history revisionists.This is the story of a young man who did something that went way over and above his training and mission requirements to save lives and fight beside men he didn't know. He gave all and made the ultimate sacrifice.People are whining and griping about the inclusion of a friendly fire incident, the guy's uniform, and other nonsense. BS. The truth is that there may have been a danger close fire mission that interrupted evac choppers and could possibly have resulted in casualties - but that's the nature of war and also not what the story's about.It's about a Medal of Honor recommendation that was downgraded to an Air Force Cross - possibly due to military bureaucracy, to cover up faulty intelligence, to not draw attention to a poorly planned operation, inter-service rivalry, or just plain laziness. You make the call. It doesn't matter.What does matter is that a Medal of Honor was wrongly downgraded and congressional &amp; Pentagon politics compounded the travesty for 34 years. It's a fantastic movie - in fact one of the best about that time &amp; place. Watch it - if you're a veteran, you'll understand. it's well worth your time."}, {"id": 195, "text": "This is inspired by the true story of Vietnam War hero William Pits Pitsenbarger. It's 1999. Scott Huffman (Sebastian Stan) is a civilian Pentagon staffer. He's connected, ambitious, and persuasive. Tom Tulley (William Hurt) is trying to get the Medal of Honor for his war buddy Pits. Huffman sees it as a dead end task and a waste of time. He'd rather spend his time on the budget and climbing the political ladder but he is forced to write up a report. As he tracks down the soldiers in the incident, he discovers the valor and honor in the men.There are quite a few great veteran actors here and they are all showing out. That's the best part of the movie. Their pain and their suffering is all on the screen. Everything else have some difficulties to varying degrees. First, Sebastian Stan has the A-hole character down pat to start the movie but he is unable to give a smooth progression to his character. I wonder if he's the actor for this role or maybe they should call up Captain America. Second, there is some political simplification and some naivety in the writing. It can't be that much of a political hit to give that Medal of Honor. In fact, there would be some salvation and political gain by doing this. It's like a defense attorney bringing out an ugly fact first and paint it in the most favorable light. Finally, there is never any problem with calling out a politician like that if you're worried about advancement. Hitting one side would make you a hero on the other side. Welcome to the game. This is a military warrior film. It may be inspired by a true story but reality of this true story is somewhat questionable."}, {"id": 196, "text": "Excellent movie and thank you Todd Robinson for making it. The acting is superb and the story needed to be told. As a 40+ year Army veteran, I cried numerous times and could not leave the theater right away because the movie took me through tremendous emotion and experiences. The real veteran's story clips at the end made me pray and thank God I made it through all my years safely. Thankfully the house lights didn't come up right away for my eyes were wet with joy and sorrow all at the same time and I just sat there and was the last one to leave the theater. Thankfully the theater didn't have the cleaning crew come in immediately following such a heart tugging movie; and fortunately, my father's name is not on the Wall even though he flew in Vietnam on 3 different tours for that would have made the movie unbearable. I normally don't write movie reviews, and in fact this is the first time. I was quite upset to see the professional critics chew up this movie listing technical deficiencies and other who cares crap and, in my opinion, totally missed the message of the movie. I'm glad it was not another Hamburger Hill, Platoon or Apocalypse Now - I think we've seen enough of those insanity war movies. War is ugly, hard and harrowing and thank God there are men and women who still put on the uniform everyday for a very UN-grateful nation that believe the military is Puffed Up and over paid. Vietnam veterans were spit on and pushed aside when they came home and they only did what soldiers had done before them. They were labeled Baby Killers and cast aside to fend for themselves.Hello Critics! The message was powerful, needed and shows hopefully many Americans just what someone goes through in combat and how when they come Home they never really heal. That to me is what the story really was. One of the characters made a mistake which cost lives and resulted in friendly fire. In a very chaotic battle for life with literal hell all around, the lieutenant called in fire with the wrong location and paid for it the rest of his life. The guilt of a survivor can be tremendous and some soldiers wish they had died with their comrades in combat. This movie, thankfully, did not make Vietnam veterans out to be crazed psychopaths but honest hurting Americans who paid an extremely high price in a very unpopular conflict. The ending was beautiful as the main character did not fail under pressure with the military/government bureaucracy but pressed the final battle for just one Medal of Honor recipient and by so doing showed everyone in the movie theater and I pray everyone who sees it that the actions of one man, and the actions of all veterans, touches more than just one family; it touches us all if we are willing to listen. Now, we step onto the field of battle of our own choice, there is no draft now, because as flawed as this nation is and how ungrateful this nation is on a whim, I served and others serve so that Americans can have a choice and dislike a President verbally, visually, on social media and outright slander a President with no fear of retribution - try that in China, Iran, North Korea, Russia or many other countries. One critic made a statement that the ending was poor because it left the audience feeling like it was all right now after the big presentation. I don't think so at all! Nowhere in the movie did it indicate that and they all lived happily ever after. On the contrary, it did an excellent job of showing a little bit of closure for many who had not forgiven, had not forgotten, brought their pain out from the darkness of their being, and made them meet their ghosts. People still tell me thank you for your service but I wonder how long that sweet appreciation will last. My totally made up assumption is that these critics have never seen or smelled war and don't know how to even spell military. They have not sat in a helicopter or an airplane and flew over the wire wondering if they will return. They have not laid in the bunk at night and wondered if the regular mortaring and rocketing of their base will find my bed as I sleep. (Just so you know the explosions get louder as they get closer.) If a critic did read my rant, they would probably comment on my grammar, syntax and the length of this review and totally miss my intent that The Last Full Measure is an excellent movie and I'm glad I experienced it and decided to see this one and not a whimsical fantasy movie about a doctor who can talk to animals. Thank you again for making this astounding movie and thank you to all the actors who did a phenomenal job portraying heroic Americans. Well done!"}, {"id": 197, "text": "The Last Full Measure is not a perfect film; it has quite a few problems from the screenwriting standpoint. However, the story is so compelling, that it overcomes these shortcomings, and we are left with an emotionally satisfying conclusion. Over 60% of Vietnam-Era veterans did not see combat in Vietnam. And whether they did or didn't, they faced the same problems after coming back home. These problems have never really been addressed in a Hollywood film. Hollywood films like to focus on the John Wayne Vietnam aspects of war; not the real life problems faced by returning veterans, such as the classic WW 2, Academy-Award winning film, The Best Years of Our Lives and The Man in the Gray Flannel Suit as well. This is where the screenwriters falthered. What about the other men in this combat situation? They were all just stereotypes; with no character development. What were their lives like after they returned? How come they didn't charge into the jungle against an enemy that had them surrounded? Pits was a hero; but the scenes of him charging into the VC was a bit unrealistic and inadvisable for the film. No one with a brain would do such a thing; especially someone without any combat training. That scene was gratuitous and manipulative; there was no need for it. The man was already a hero and deserved the medal for what he had done already. Recently, at a dinner for my university, the former university president, when informed that I was on the docks in Okinawa shipping Agent Orange to Vietnam, advised me to keep that part of my life as a secret; I wanted to punch him in the face. But I just ignored what he said, because it was obvious he was not a veteran. And that was in 2014. In 1972, I remember coming back and wearing my fatigues to the college campus because I had very few civilian clothes. I was treated like I had some type of communicable disease. One of my professors asked me why I wore military clothing, when it was fairly obvious that I was against the war via my other actions (marching in VVAW activities). I said why dont you judge me by what I do instead of by the clothes that I wear. Anyway, this is a good film and better than average for the era. The ending was satisfying as well. I just wish Hollywood would make one film about returning Vietnam Veterans that were NOT in combat (over 60% of us); it might prove interesting."}, {"id": 198, "text": "The Last Full Measure is a new war drama film directed and written by Todd Robinson, the director of Lonely Hearts and Phantom.In the film, Scott Huffman (Sebastian Stan) investigates a Pentagon employee as to why military medic William H. Pitsenbarger (Jeremy Irvine) is still not honored to receive a Medal of Honor for his heroic actions during the Vietnam War. To get an answer to this question, Scott Pitsenbarger interrogates his family and war comrades. Thus learning about a conspiracy against Pitsenbarger, Scott now decides to risk his career to ensure Pitsenbarger's justice and deserved honor.Despite being promoted as a war drama, this movie is actually more of a detective movie, where Scott Huffman tries to gain information about the conspiracy against Pitsenbarger. The war drama aspects are more prominent in the film as flashbacks, which are shown when the interviewed characters tell Scott about their experiences with William H. Pitsenbarger. By telling the story in such a way, the film has acquired a more wordy tone.The film is also more about the experiences that other soldiers have with William H. Pitsenbarger than that the film is really about William H. Pitsenbarger himself. A Vietnamese war hero like him actually deserves to be honored in a better film or documentary.The main cast actors such as: William Hurt, Christopher Plummer, Samuel L. Jackson and Ed Harris play the older versions of the Vietnam War soldiers, who tell their stories to Sebastian Stan. In the flashbacks, the soldiers are played by younger and more unknown actors. Peter Fonda also stars as one of the old war comrades of William H. Pitsenbarger. He died of lung cancer last year and this has become one of his last films."}, {"id": 199, "text": "30JUL2020 {5/10 stars C} Recommend? Yes; Should have been more about Pitsenbarger not Huffman, slow content and a lot of flashbacks is the reason for 5 stars.Ok movie. I agree with another review, it would have been nice to know more about the man this movie was made about, William Pitsenbarger (Pits) instead of seeing so much about Scott Huffman. Maybe seeing so much about Scott was intentional so the audience will see his transformation as he learns more about Operation Abilene and what Pits did that day. This movie seemed longer to me than it actually is. Due to all of the conversations and flashbacks that last a long time and happen throughout the movie.There was nothing good or heroic about the Vietnam War. The whole catastrophe was brought on because of lies about the Gulf of Tonkin incident and LBJ. Web search Gulf of Tonkin incident. If you want to watch a more in-depth series about the Vietnam War search on IMDB for The Vietnam War mini series from 2017. It was broadcast by PBS. Take what you see with a grain of salt because the creator Ken Burns has his own bias about the war.58,000 plus American soldiers died in the Vietnam War. North Vietnam was engaged in a civil war against South Vietnam. At no time did North Vietnam attack or invade the United States. The U.S. government invaded Vietnam and embroiled itself in Vietnam's civil war. At no time were the freedoms of the American people threatened by the North Vietnamese. American troops that died in Vietnam did not die in the defense of our freedom here at home.There are 10 episodes and each episode is about 1h20m long. Watching the mini series it is appalling to learn how many US troops died fighting various battles for nothing. Frequently the USA won battles to take control of various hills. After winning they would usually abandon the hills and the Viet Cong would easily, without force, come occupy that hill again. How many thousands of US troops died fighting senseless battles that didn't even amount to gaining ground or stopping the Viet Cong?! What kind of military fights and has thousands of men die to gain ground and than does not maintain that ground to keep the enemy away?! That's a stupid way to fight a war, no wonder it was such a disaster!CONTENT ADVISORY: Very little if any profanity. Because this is a war movie there is a lot of blood and men being shot, killed, blown up and talk about friendly fire. Many scene's of blood, wounds and gun shot wounds while Pits and other soldiers try to treat the wounded.{1=F 2=D- 3=D 4=C- 5=C 6=B- 7=B 8=A- 9=A 10=A+}(Tangent: I'm a very patriotic natural born citizen of the United States. The USA military industrial complex has become a HUGE money maker for the US government (through taxes), military contractors, suppliers etc. I am tired of the endless wars, foreign wars, proxy wars, my country fighting battles for other countries and the USA using NGO's to invade and control other countries. I'm also against the UN, WHO, IMF and all other international agencies that think they call the shots and can tell countries what to do.Citizens of some countries protest and get angry about their countries being occupied by the United State military. That's good, more people should protest more frequently. The US military is not the World Police for resolving disputes or a knight in shining armor that comes to the rescue for another countries when there is trouble. Both good and bad kingdoms and countries rise and fall due to military conquest, this is the natural order of things. Even male animals fight or battle for the ability to mate and pass on their genes, humans sometimes use war in a similar way. Strong humans survive war and pass on their genes and the weak oftentimes do not.If you want to save your country from terrorism or being taken over by an invading force you need to use everything at your disposal to defend your country and not expect someone else or another country to do it for you. Your country is your house and it is your job to defend it! Get to know the invading force to learn if there is common ground where a compromise can be reached, use the media or press to share information about the invading force or create your own source of factual information with videos, a blog, newsletters etc, and of course use force to stop and remove the invading force.)"}, {"id": 200, "text": "The Last Full Measure details the lengths taken and dedication given to bestow a posthumous Medal of Honor on William H Pitsenbarger. A true story revolving around a Vietnam war veteran, the sacrifice he made, and the lives of those he saved should make for compelling drama. In fact, while watching the movie, the viewer can tell there is something there. Unfortunately, the writing feels all too much like a colour by numbers script with fake highs and feel good moments that aren't truly earned.This is a shame, as the cast assembled, with familiar actors such as Sebastian Stan, Ed Harris, Christopher Plummer, Samuel L. Jackson and more are more than up to the task. One can clearly feel them elevating the script to a better place. Plummer and Jackson are especially noteworthy in their performance.However, in the end, this is let down by a script that is slavish to hit all the right beats, and to manipulate the emotions of the viewer. Which is unfortunate, as even without other background information, Pitsenbarger clearly deserves better."}], "reviews_amount": 201}