{"name": "The Palm Beach Story", "titleId": "tt00035169", "reviews": [{"id": 0, "text": "Even more dementedly frantic than The Lady Eve, this film is Preston Sturges's most delirious screwball/slapstick romance, with one of the most amazing bits of comic combustion in the Ale and Quail Club train sequence. It's not as neatly structured as The Lady Eve, but it's filled with hilarious gags, lines, and performances. Claudette Colbert and Joel McCrea are remarkably composed and relaxed, but Rudy Vallee, Mary Astor, and all the other performers outdo themselves in energetic tomfoolery. When Vallee complains, plaintively, that the problem with the world is that the men most in need of a beating are usually enormous, or when Astor slyly suggests that she grows on people, like moss, you know you're hearing Preston Sturges's wit at its peak."}, {"id": 1, "text": "Knowing that The Palm Beach Story was listed in AFI's top 100 Comedies, I had high hopes going in. Unfortunately, my expectations were not met. While the script, by director Preston Sturges, is sharp and amusing at times, it is often dragged down by schticky scenes that are overlong, unfunny and annoying to watch. The performances are mostly spot-on, particularly the leads: Claudette Colbert, Joel McCrea, Mary Astor and, surprisingly the best, Rudy Vallée, who is remarkably natural and sympathetic. ***SPOILER ALERT*** However, the schtick really drags The Palm Beach Story down. The opening sequence, shown with the credits and presented in pantomime (reminiscent of the start of The Philadephia Story), is thoroughly confusing, yet is supposed to provide exposition. One could argue that all was explained at the end of the picture, but even upon reviewing the opening after watching the entire film, it still left me puzzled. (For a plausible explanation, see the Wikipedia article on The Palm Beach Story.) Early on, the schtick involving the Wienie King's poor hearing is tiresome and predictable, yet it continues on and on. Later, the raucousness of the Ale and Quail Hunting Club on the train is WAY over the top, unbelievable, unfunny, grating, and goes on for 10-15 minutes.***END OF SPOILERS***Were it not for the above annoyances, which unfortunately account for a significant portion of the movie, I would have rated The Palm Beach Story higher, as it does have its share of clever dialogue, an unusual premise, and gifted actors."}, {"id": 2, "text": "This has been one of my favorites for thirty years, since the Village Voice critics turned me on to Sturges. It's a loony world where loony things happen, and it's important to realize that the central loony joke is that Claudette Colbert's Gerry gets things from men without having to put any effort into it at all. No, she's not prostituting herself -- she never trades anything for her prizes, she just keeps on looking pretty. Joel McCrea with Colbert is sexy and just right. He's not supposed to be silly -- he is the sane anchor in the chaos (and the romantic leading man). Rudy Vallee -- absolutely perfect deadpan delivery of some really great lines. Hurrah for the Ale and Quail Club, for Toto and for the Wienie King.But the mystery -- I have always believed that there is an unfinished story in here, a movie that didn't get produced, about the twins. It's almost like Palm Beach is a sequel to that movie. If you don't know that Gerry and Tom are twins, the opening frantic sequences makes no sense at all; as it is it is difficult to make sense of, but this is the gist of it -- Gerry and Tom's twins want Gerry and Tom, Tom and Gerry want each other, so in order to get married Gerry and Tom have to lock their twins in closets and run to their wedding. This means the unwanted twins must have been up to some business before the wedding, but we never see any of it. Something's missing here, and I think that is the flaw in Palm Beach Story. I have never been able to find out where this story element came from. Does anyone know?But still, watch and enjoy this great movie over and over. There was no other like Preston Sturges -- no one as honest or real. Or funny."}, {"id": 3, "text": "Simply stated...one of the funniest, craziest and most brilliant comedies of all-time....for shear laughs....it's Preston Sturges' funniest movies.You can easily read the plot-line from the other reviewers, but I want to make a point about some of the performances.Rudy Vallee, previously rather stiff on film, is simply hysterical in this movie. For my money, he should have at least been nominated for the Best Supporting Actor category for the Academy Awards. One of the most brilliant supporting comedy roles I've ever seen.Mary Astor and Sig Arno are brilliant as well.It's also amazing that those idiots at Paramount allowed Sturges to slip through their fingers....not long after this film was finished.It's now available on DVD....a strip-down edition with no features whatsoever...and also part of the Preston Sturges boxset.By the way, if the frantic opening over the credit are confusing, just note that both of them are identical twins!"}, {"id": 4, "text": "As an example of screwball comedy, this wacky film is at times almost breathless in it's storyline and dialogue. Colbert plays the wife of a frustrated inventor (McCrea) who decides to put her own happiness to one side in order to help him. She plans to divorce him, marry a millionaire and then give McCrea the money he needs to get his idea off the ground. She heads off by train to Palm Beach, Florida and encounters a quirky, friendly magnate (Vallee) who seems to fit the bill. McCrea, however, is completely against the entire plan and is in hot pursuit of Colbert, trailing her to the title locale, but eventually becoming sidetracked by Vallee's voraciously man-hungry sister Astor! Colbert is lovely and funny, and game for all the various shenanigans of the plot. Her charm manages to gloss over some of the more unsavory elements of her plan as presented in the film. One memorably amusing scene has her attempting to borrow clothes from the female passengers of the train when hers are lost, eventually concocting a real eye-opener (as the maid says, You can borrow my earrings....!) McCrea has a pretty one-dimensional role, but again, his charm goes a long way in selling the story. His most memorable bit is a flurried run through an apartment and hallway with his pajama bottoms falling victim to all the excitement. Vallee is endearingly goofy and sympathetic. He also gets to sing in one key scene. Just as a relay race needs a solid anchor bringing up the rear, Astor pops in for the final third of the film and her vivacious, motor-mouthed portrayal is a highlight of the movie. Scarcely taking a breath in between reams of dialogue, she masterfully clips off several hilarious bon mots as she sets her considerable sights on McCrea. All of them are so likable within this mess that it seems as if there may be no way for the story to end happily, yet it does (in a fairly controversial ending!) Though the four leads do a terrific job, there are many other great turns by various character actors, none more so than Dudley as The Weinie King. His appearance as a half-deaf sausage entrepreneur puts the film on it's whacked-out track right from the start. Newcomers to the film could almost be forgiven for thinking it's a sequel to an earlier comedy based on the unusual opening credits sequence, but all is eventually explained. The film has a comforting innocence to it, despite the potentially tasteless subject matter (i.e. - a wife practically prostituting herself for her husband) and is a beautiful glimpse into a time when movies looked good and earned their laughs without the blatant vulgarity that pervades most films today."}, {"id": 5, "text": "Far fetched, but very humorous story of a wife Gerry, who decides to divorce her husband, Tom and go seduce &amp; marry a rich man/widow, but she is only going to use the man to get the money to finance Tom's invention. Gerry does meet a man, one of the richest men in the world, and when Tom confronts the man down in Palm Beach, Tom is immediately introduced to the man's chatterbox, &amp; man obsessed sister, who decides Tom is to be husband number 6 for her. How to get out of this one. Only Preston Sturges could have come up with this one and gotten away with it. Colbert is delightful as Gerry, McCrea as well as her bewildered husband, but Vallee and Astor really steal the show as the eccentric Hackensacker and his sister. Also enjoyable to watch are the Ale &amp; Quail club, with Demarest &amp; Horton's little skeet shooting bet in the pullman car, and Dudley as the old, but delightful Weinie King. The ending though seemed like a plot contrivance to make the film end smoothly, and appease the censors. Rating, 9."}, {"id": 6, "text": "I hate to speak ill of any movie made before my time that's regarded as a classic and is an AFI award winner(# 77 on it's 100 funniest movies list),but this film just did not resonate with me at all.I found the plot utterly ridiculous.The two leads were incompatible.I hate to use the word stupid,but it's the only word I can muster for the film's ending.This was my first viewing of any film starring most of the cast here,and while I'm sure they were great in other films,there was just no magic here,at least not for me.I can think of a few films that are more deserving of a placement in the above mentioned AFI list than this."}, {"id": 7, "text": "It seems that Claudette Colbert can't make up her mind. In 1934's 'It Happened One Night', she was running from Miami to New York to get married. In 'The Palm Beach Story', she is running from New York to Miami to get a divorce.The Palm Beach Story is one of those great screwball comedies that can be watched over and over again. It tells the tale of a married couple played by Colbert and Joel McCrea who although still desperately in love with each other, they don't exactly see eye to eye on how to manage to family finances.McCrea is a traditionalist i.e the man provides for his family and charity is not to be accepted as his pride would not allow it. Cobert on the other hand sees no harm in accepting innocent gratuities from admiring gentlemen in order to make ends meet.McCrea has dreams of building an inner-city airport and requires $99000 for the venture and has to persuade a legitimate investor to throw in his lot. Colbert's plan, (completly barmy it is too), is to convince her husband that she is no longer in love with him, leave him and get a divorce, find a millionaire to marry who will then give her anything she wants including the $99000 which she will then pass on to McCrea to build his airport and fulfil his dream. However, McCrea has no idea of her intentions and genuinely believes that she no longer loves him and has walked out on him for good.Her sex appeal is evident for all to see and through the course of the movie she successfully utilises this sex appeal to negotiate a free taxi ride to the train station and then a free train ticket from New York to Miami courtesy of a group of drunken millionaires known as the Ale &amp; Quail Club. When the A&amp;Q club get a bit too rowdy on their annual booze up and start innocently shooting up the trains bar, Colbert seeks refuge in the sleeping cars and after trying to climb into a vacant upper birth, she comes face to face, (or more correctly foot to face), with mega rich yet mega dull Rudy Vallee.Vallee's performance is the main reason to watch this movie, his character is absurd yet likable, tight yet generous and smart yet stupid. It is through Vallee that some of the best one liners are delivered. It's a shame that the men most in need of a beating are enormous.Vallee is smitten and after taking Colbert on a multi-thousand dollar spending spree, they take his private Yacht from Jacksonville to Miami. on reaching their destination they are met by Vallee's talkative and title mad sister (Mary Astor) and her companion Toto (not a cute little dog as the name suggests, but a foreign gentleman who has made himself her personal chapperone). McCrea has also managed to track down his estranged wife and is there to meet them. Colbert, unable to tell Vallee the real reason why she left her husband, has painted a non too pretty picture of her husband and to avoid fireworks, hilariously introduces McCrea as her brother 'Capt McGlew'. Astor has also taken a shine to McCrea so jealousy starts to rear it's head from all parties involved.This movie is very enjoyable indeed and has all the hallmarks of what you would expect from a Preston Sturgess movie. It's also great to hear Rudy Vallee sing again and he is not so 'up-his-own' that he doesn't mind becoming the butt of the jokes when everyone is closing their windows in hopes of drowning out his crooning.I will be the first to admit there were much better divorce based Screwball Comedies made around the same time, (such as Love Crazy with William Powell &amp; Myrna Loy), but The Palm Beach Story is an enjoyable flick and a brilliant way to spend 90 lazy minutes on a Sunday afternoon. Enjoy."}, {"id": 8, "text": "Maybe not Preston Sturges best film, but incredibly funny.  The most amazing thing about the film is how it ever got past the censors of the day. Sturges the director is in good form here, but Sturges the writer is the one who really excels on this film.  His ability to quickly and deftly create comic characters suitable for his large stock company (most of whom show up here) is unmatched.  Joel McCrea and Claudette Colbert play their roles perfectly, with Rudy Vallee and Mary Astor strong in support.  A really delightful film."}, {"id": 9, "text": "Preston Sturges was at the top of his craft when he directed this film. The wonderful cast he put together for  The Palm Beach Story exceeds all expectations and made this a winning screwball comedy, typical of the times.Claudette Colbert and Joel McCrea made a fantastic couple. Both of the leading actors were excellent comedians; they do amazing work together. The supporting cast is first rate. Mary Astor and Rudy Valee are excellent as the rich siblings falling in love with the estranged Jeffers. In minor roles, Sig Arno, Robert Dudley, and the rest of the cast perform wonders and respond to Mr. Sturges' direction.The only things that don't work as well with the rest of the film are the prologue and the ending. The end seems to indicate that Preston Sturges was running out of ideas. The multiple weddings are a bit hard to accept as they don't seem real. The existence of a pair of twin siblings we knew nothing about while watching the film, appear to have been added out of desperation and thus make an ending to accommodate both rich Hackensackers.As a curiosity note, throughout the film Ms. Colbert is seen only on the right hand side of the screen because of her desire of being photographed from the left side only. This actress had the uncanny ability to change herself to that side of the screen without anyone realizing what she's doing. She might start with her whole face in front of the camera on the left hand side of the screen, but she always does something to change places with whoever is playing opposite her and wind up with her left profile for us to see.Still, this is one of the best films by Preston Sturges, perhaps a notch behind Sullivan Travels and The Lady Eve."}, {"id": 10, "text": "This movie has madness and a few zany scenes. But I think the accolades of many for Preston Sturges having a great comedy here are overblown. The Palm Beach Story is funny, but only in parts. And, some of those are strained. The goings-on of the Ale and Quail Club soon wear out. And Claudette Colbert's hiding from the gang on the train isn't worth any howls. The premise for the story is OK, and far out. Unfortunately, Colbert's Gerry Jeffers is too logical and explanatory with hubby Tom, played by Joel McCrea. And, McCrea is just too dour for most of the comedy. That always serious, almost stern look of his was OK for Westerns, but it wasn't great for most of his comedy efforts. The one exception being, Adventure in Manhattan of 1936. Colbert and McCrea don't have much chemistry in this film. Someone like Fred MacMurray would be able to play the straight face, serious look for real comedic effect.I think the best comedy of this film comes from Rudy Vallee as J.D. Hackensacker III, and from Mary Astor as his sister, Princess Centimillia. Vallee's character is funny in himself – fast-talking and always writing costs of items in his little black book. And Astor's princess has some of the funniest lines in the movie.The movie is okay and enjoyable. But it's not full of laughable scenes and lines. It's not up there with the best comedies of the Golden Age of Hollywood. Here are a couple examples of the witty dialog.J.D., Chivalry is not only dead, it's decomposed.Gerry, No, I don't want to listen to anything that begins with 'Look, darling,' so that you can get off another noble saying.J.D., That's one of the tragedies of this life – that the men who are most in need of a beating are always enormous."}, {"id": 11, "text": "Preston Sturges was a unique figure in Hollywood history, a writer- director of witty, cleverly plotted comedies that combined wacky fun with occasional sharp satiric potshots at social institutions and human foibles. If Hollywood had a Moliere, Sturges was that.My personal favorite of his movies is the romantic screwball comedy The Palm Beach Story (1941), featuring Claudette Colbert as a woman who loves her husband too much to see him fail, and so decides to divorce him and marry a rich man to support him! It's great silly fun, insanely contrived but irresistible for all that, with winning performances by Colbert and the other leads, especially Rudy Vallee as the improbably nice rich guy whose path Colbert crosses."}, {"id": 12, "text": "Preston Sturges wrote and directed this wacky screwball comedy that features Joel McCrea and Claudette Colbert as Tom and Gerry Jeffers, a happily married but poor couple who are about to be evicted from their apartment. Tom is a good but poor inventor and architect who just needs money to get started, and after meeting an eccentric prospective tenant(and millionaire!) who gives him money, he is quite happy, but his wife doesn't believe him, and runs off, determined to marry a millionaire to fund Tom's projects! Tom goes after her, but gets involved with the crazy family of the millionaire(played by Rudy Valle) Gerry intends to marry... Insane comedy is undeniably funny at times, and unpredictable, with a truly bizarre ending, but that's its problem: it doesn't know when, or how to quit, becoming so absurd that it took me right out of the movie, and I ultimately gave up altogether. Seriously needed some self-restraint and discipline here!"}, {"id": 13, "text": "Preston Sturges was one of those meteoric auteurs whose career is comparable only to Jean-Luc Godard in the Sixties: half-a-dozen masterpieces crammed in as many years, along with several other movies within that same span of time that weren't up to the usual brilliant standard. Unlike certain flops by Godard, however, *The Palm Beach Story*, while obviously not up to the standard of his other World War II-era comedies, is definitely not a flop.I mean, you COULD miss this one and concentrate on the other acknowledged masterpieces in Sturges' oeuvre, but you'd be missing a lot. For one thing, you'd be missing the startling depiction -- for 1942 -- of a marriage based on sheer carnality. Joel McCrea and Claudette Colbert clearly have nothing in common other than healthy sets of glands: he's a straight-laced inventor-type who's promoting a pie-in-the-sky airport idea that entails laying run-ways ON TOP of a city like a tennis racket; she's a bored socialite and incipient con-artist who's had enough of McCrea's virtuous poverty (poverty engendered, obviously, by trying to sell ideas such as airports built on top of cities). Since the socialite aspect of her personality has failed to yield dividends, Colbert decides to give her inner con-artist a try. She demands a divorce, and absconds on a south-bound train to divorce-friendly Palm Beach, with McCrea in bewildered pursuit. Ever the hustler, Colbert sweet-talks a group of drunken millionaires -- The Ale and Quail Club -- into buying her a train-ticket, with predictably raucous results. On board, she meets Rudy Vallee, a shy billionaire who shelters her from the rowdy party of drunken boobs. Soon enough she's parting the fool from his money as he escorts her to his palatial manse in Palm Beach.Colbert, of course, has no intention of really divorcing McCrea -- she merely happens to know that Palm Beach is full of wealthy marks like Vallee who can be counted on to be credulous enough to put up the seed investment for brother McCrea's ridiculous airport scheme. On the one hand, Sturges harbored no illusions about the fundamental decency of women. On the other hand, this is what makes *The Palm Beach Story* so refreshing. It must have been especially refreshing for Colbert (never lovelier than here, by the way, with long flowing locks and gowns ascribed to Irene, according to the opening credits), who clearly enjoyed playing an amoral woman for laughs. She was BORN for this type of role. McCrea, on the other hand, is surprisingly all wrong for the part of the husband. So perfect in other Sturges comedies, particularly *Sullivan's Travels*, in which his natural darker edges were required, he seems dour and out-of-place in this straight-up farce. Frankly, he looks like a man with other things on his mind than a Preston Sturges comedy. (There was a War on, you know.) The husband-role fairly screams for a Cary Grant to inhabit it: that is to say, an actor who didn't take himself very seriously. As it stands now, Vallee's billionaire has no proper foil, with the result that we root for Colbert to just marry him, already, while keeping the unsmiling but far more manly McCrea as an occasional sexual hors d'oeuvre.Perhaps this had been Sturges' intention, anyway, as the denouement is thoroughly unsatisfying (TWINS?), which in turn forced the director to tack on a striking but rather senseless prologue over the opening credits. Basically, the logic of the story demands that Colbert should move on to greener pastures, but the morality of the time (OUR time, too, by the way) wouldn't permit that, so we're left with a non-ending. But this, along with the movie's other faults, is atoned for when Vallee's husband-devouring sister, a motor-mouthed Mary Astor, offers the following immortal observation to a non-English-speaking Sig Arno: Why don't you go AWAY someplace. Surely someone else can use a house-guest; I can't be the only sucker in the world.6 stars out of 10."}, {"id": 14, "text": "This film was just was just way to crazy for me. I mean I don't really know what i should expect some a screwball comedy but I just could not get into it at all. A pretty gold digging air headed wife is at odds with her husband who is an inventor. He lets her travel to Florida to get a divorce. While down there using her beauty, ingenuity, luck and appealing charms - live the 'good life' in Florida and gets money from a multi- millionaire to advance the good of her husband's career. The story is just like what? I just can't do it. The only awarding thing from this movie was the Weenie King who just gives her money because he likes her face."}, {"id": 15, "text": "I just discovered the movies of Writer-Director Preston Sturges, thanks to TCM. More outrageous and preposterous than even a W.C. Fields film, and who would ever thought that was possible! Subtitled And they lived happily ever after...or did they? The breakneck-speed wedding at the start (choreographed to the tune of The William Tell Overture), makes no sense at all until the surprise ending of the other two identical twins getting married! A crackpot inventor's beautiful blonde wife (Claudette Colbert) decides that her husband will never amount to any good until she divorces him and marries a millionaire, because he needs $99,000 to build a space-saving airport, where the runways are short and the planes are snagged like on Navy aircraft carriers. So she runs into eccentric young Rudy Vallee while she is a stowaway on a train to Palm Springs, to get a divorce, after being adopted by a group of 8 Hunt Club millionaires. They shoot up the club car, and their baying hounds run wild. The Wienie King (also an eccentric millionaire) finances both her and her husband, to some extent. Of course the whole thing makes no sense whatsoever, and that's what's so wonderful about it! 90 minutes of madcap screwball comedy,and I will look for more Sturges films on TMC. (Almost) Nobody else plays black and white movies, anymore. You may have to watch it twice to get all the jokes and social comments, including one about Roosevelt!."}, {"id": 16, "text": "Interesting that a couple of reviewers for the film on IMDb call this picture 'one of Sturges's best' and 'Sturges at his worst'. I guess that goes to the old saying that it takes all kinds. From the outset I had a pretty good idea that this was intended to be a screwball comedy, and the story did have it's share of quirky, fast paced dialog, but for me there was an element missing to get it over the top as a credible story. What I really couldn't understand was why Gerry Jeffers (Claudette Cobert) thought the answer to all her marital problems was to run away and get a divorce, and then behave in ways that resulted in insuring the marriage.I'll say this though - for 1942, seven hundred dollars sure went a long way. The Weiner King's generous hand out to Jerry managed to cover all the back rent, dinner, a theater show, supper, the butcher, grocer and drugstore, a trip to the hairdresser and still managed fourteen dollars left over for husband Tom (Joel McCrea) to have fun with. There were good old days and then there were good old days, but man, I sure would love to stretch a buck that far.One redeeming note to the story, I thought Hackensacker (Rudy Vallee) was a stand up guy at the finale when he got jilted by Gerry and still decided to offer the loan to Tom for the airport project. Goes to show that business doesn't have to mix with pleasure for a businessman to recognize a profitable deal. But that triple wedding!?!? What were the odds?"}, {"id": 17, "text": "This Sturges film has some of his most sophisticated dialog, and who better to deliver it than Claudette Colbert? The handsome and self-effacing Joel McCrea, as her husband, and Rudy Vallee as her hilariously anal retentive intended target, are perfect foils. This is a wonderful combination of a screwball comedy and a sophisticated comedy of manners. The dialog is funny on its face, and very racy when you think about it. And that Toto - Eurotrash before the term was ever invented! Colbert was so wonderful at being as funny as could be while still maintaining her cool. The walls can tumble down around her, and she still looks like a member of whatever royal family you can name, waving to us, unruffled, from her balcony. I just love Joel McCrea - he was equally at home in white tie and tails, or in jeans and a ten-gallon hat. You just instinctively believe every word he uttered - a thoroughly natural performer. No wonder the Colbert character went back to him in the end. That ending/beginning, though, is very strange. What is that all about with the twins? It looks like the teaser for a sequel, or perhaps there was a prequel, that we never saw. Never mind - this one is a must-see."}, {"id": 18, "text": "One of the reasons why I like classic Hollywood movies is that even if the movie's not that great, it's still a thrill to watch the charismatic actors dazzle. And Claudette Colbert, Joel McCrea, and Mary Astor are definitely the highlights here.The Palm Beach Story was written and directed by the brilliant Preston Sturges, so it can't be bad, and it isn't, but the story's really too far of a stretch. A wife, who loves her husband and money equally it seems, decides to leave him when he loses his fortune, so that she can find another rich man to marry to reclaim her lavish lifestyle as well as finance her husband's innovation. And while running away from her husband on a train, who does she meet but one of the richest men in the world who's actually a nice guy but inexplicably single and falls for her. Her husband eventually tracks her down to the rich guy's mansion, only to meet the rich guy's slutty and just as rich sister, who in turn falls for him. And whoah, the ending is another doozy that I won't reveal.Only in Golden Age Hollywood can this kind of a story be pulled off. Any writer who proposes such a tale now would be laughed out of town. And deservedly so, since today's jaded audience would never swallow it. I found it quite hard to myself, but as I said, Sturges is a master who knows not to take his story too seriously, and his stellar cast handle the material with just as much deftness."}, {"id": 19, "text": "From director Preston Sturges (The Lady Eve, Sullivan's Travels), I found this film in the book 1001 Movies You Must See Before You Die, it was well rated by critics, the title didn't suggest anything particular to me, but I was hoping I would agree with the positive opinions. Basically in New York, Gerry (Claudette Colbert) and Tom Jeffers (Joel McCrea) have been married for five years, but with a lack of money coming in they are due to be evicted from their apartment, Tom is an architect and inventor near bankruptcy and unable to find an investor for his latest idea. As time has gone by Gerry finds herself unable to cope and realises that their marriage has been over for some time, so she leaves him and is heading to Palm Beach for a quick divorce and marry a millionaire to help Tom's project, but Tom is determined to do whatever he can to stop her. It is boarding a train when Gerry meets one of the richest men in the world, eccentric billionaire bachelor J.D. Hackensacker III (Rudy Vallee), and travelling on the yacht to Palm Beach she also meets his sister, Princess Centimillia (Mary Astor), eventually Tom catches up to his wife, but introduces himself to them as her brother. The situation becomes more complicated with Hackensecker falling in love with Gerry, and the Princess falling in love with Tom, after some embarrassing and near ridiculous situations, the truth is eventually revealed that Tom is actually Gerry's husband, but the other siblings come into it, in the end Hackensecker marries Gerry's twin sister and the Princess marries Tom's twin brother. The cast all do their parts well, Colbert being the wife who thinks the husband would be better without her, and McCrea as the husband trying to better himself and reignite her feelings, I did laugh at the moments with the mildly deaf man mistaking what is being said, and the mixed relationships and absurdities are funny, I admit it might not be something I would want to see again, but it is a likable enough screwball comedy. Good!"}, {"id": 20, "text": "Sometimes I think the word 'screwball' when applied to movies of this vintage means farcical beyond belief, which this is. And yet this isn't pretending to be a fantasy; Palm Beach is a real place. Yet the characters behave in what I can only describe as an a-human manner.Colbert is ok in her role though she's no Myrna Loy or Jean Arthur. Sad to say, Joel McCrea proves not for the first time in my experience that he had negligible talent for comedy. A fine cowboy but a comedy dud. Of course there are redeeming features. The supporting cast are far superior to the 'stars'.I suppose if you are prepared to view people as if they were cartoon characters you might enjoy this."}, {"id": 21, "text": "This movie can lay claim to such a title - alongside Some Like It Hot, The Producers and Raising Arizona, all of which owe a debt to this crazy firecracker. The cast, as with all Sturges comedies, are all hilarious as well as lovable. Particular praise should go to the leading ladies Claudette Colbert and Mary Astor. They certainly don't making actresses like them any more. And then there's the man himself, the movie powerhouse that was Preston Sturges. His movies are almost alone in that the acting doesn't stomp all over his genius scripts. High brow, low brow and every brow in between. This movie makes life worth living."}, {"id": 22, "text": "Ingenious in an entirely different way than Sturges's masterpiece Sullivan's Travels, but there are some nagging issues. I think the problem here is too many clashing, see-sawing tones. We have the brilliant madcap opening montage that lays out the impulsive, erratic foundation McCrea and Colbert's marriage sits upon; then there is a rather languid section in which we see the sexual and financial frustration that characterizes their marriage five years later; then, on a whim (and a suggestion from the hilarious Weenie King), Colbert hops on a train bound for Palm Beach, on which the Ale and Quail Club wreak drunken havoc; then there is quiet again, as she meets and woos super-billionaire Rudy Vallee. (The pattern: Bang!...zzzzzz...Bang!...and again...) It feels very schematic rather than very fluid (compare with The Lady Eve), a film of broad strokes. However, it is brilliant, naturally in sections. I especially liked the theme of misapplied carpe diem instigated by the Weenie King, whose innocent flirtations got the whole unwieldy ball rolling in the first place, unbeknownst to him, of course."}, {"id": 23, "text": "A charmingly hyperactive film that's still pretty funny if you're in the mood for a screwball comedy, The Palm Beach story is also noteworthy for providing a window into American culture before World War II changed everything.This movie has one of the weirdest beginnings you'll ever see. It starts out by recapping the story of how Geraldine and Tom Jeffers (Claudette Colbert and Joel McCrea) got married as though The Palm Beach Story is a sequel to that film. But that movie was never made. There was no film about Gerry and Tom before this one. Writer/director Preston Sturges just put together a montage of the absurd fashion in which these two people got together and then jumped forward 5 years to start this story. Imagine if George Lucas hadn't made Star Wars, but then made The Empire Strikes Back and tacked a 2 minute montage as the beginning of that movie that told the entire story of A New Hope. That's how The Palm Beach Story begins.Anyway, after 5 years of marriage Gerry and Tom are broke. Tom has an idea for a revolutionary airport design (which looks utterly ludicrous in retrospect) and needs 99 thousand dollars for it. Gerry decides to get him that money by divorcing Tom, latching onto a rich husband and then getting her new hubby to give Tom the financing for his design. The matter-of-fact way that Gerry discusses essentially whoring herself out to benefit her true love is a stark reminder of how much pragmatism used to dominate the American character.Gerry sets out for Palm Beach to divorce Tom but without any money, she's forced to rely on the kindness of a traveling hunting club of millionaires. The Ale and Quail Club are the sort of rambunctious guys who can be singing one moment and then blasting away with their shotguns inside a moving train car the next. They're eventually too much even for Gerry to go along with. Fortunately, she then steps on the face of John D. Hackensacker III (Rudy Valee), an impossibly rich man in an emotional straight jacket who offers to take Gerry to Palm Beach on his private yacht.While that's going on, Tom gets some financial assistance from a cranky old man who got rich selling hot dogs (don't ask, it's a screwball comedy) and flies down to Palm Beach to stop the divorce. When he arrives he finds Hackensacker already sidling up to Gerry, which Tom would have put a stop to if he wasn't almost instantly attacked by Hackensacker's amorous shark of a sister, the Princess Centimillia (Mary Astor). Gerry passes Tom off as her brother, Hackensacker proposes a try-out marriage with Gerry, Princess Centimillia tries to rid herself of her foreign lover Toto (Sig Arno), and Tom basically looks on in bemused disgust as all this nonsense spins round and round and round.Like most screwball comedies, The Palm Beach story is silly, absurd, occasionally labored and you've got to be in the right frame of mind to enjoy it. In the proper mindset, however, there's a lot here to love. The beautiful Claudette Colbert as Gerry is almost a forerunner to Lucille Ball in I Love Lucy, if Lucy Ricardo had been a good-hearted sexual grifter. Mary Astor is wonderful as the sort of decadent socialite that used to be easy for poor people to like. If Paris Hilton were really smart and really funny, she'd be the Princess Centimillia. Rudy Valee gives sort of a one-note performance and mixture of John D. Rockefeller by way of Franklin Deleano Rosevelt, but his benign eccentric is exactly the sort of foil needed to let Gerry shine. Joel McCrea has the least flashy part, but projects more than enough strength to keep the normal Tom from being overwhelmed by the larger-than-life personalities around him. The dialog has that rat-a-tat cadence everyone loves from 1940s comedies and humor ranging from one liners to slapstick and almost everything in between comes firing at you like an artillery barrage.As for it's use as a telescope into the past, you really can't appreciate how much has changed in American society until you see it in films like The Palm Beach Story. The sexist idea that men and in charge and women can only get their way through a man is central to this story and its sensibility. The rather amoral and mercenary nature of Gerry's scheme also reminds you that the formative experience for this movie's original audience was The Great Depression and they were more receptive to the idea that life is a crooked game and you can only get ahead through dumb luck or a little larceny. The American Dream of success had a much darker tinge to it before the half-century economic boom after WWII polished it up to a blinding sheen.The screwball comedy genre can be a bit of an acquired taste. If you've acquired it, though, The Palm Beach story is definitely worth seeing."}, {"id": 24, "text": "Joel McRea and Claudette Colbert are man and wife, but he's having a hard time finding money to build his airport and she's feeling useless, just another added expense. Things are so rough that they're being evicted from their New York apartment.Though they still love each other, Colbert runs off to Palm Beach for a divorce. On the train she meets Rudy Vallee as John D. Hackensacker III. Any resemblance to John D. Rockefeller III is intended. They meet accidentally, while she is fleeing the drunken members of the Ale and Quail Gun Club who are shooting the lights out. While trying to climb into an upper berth in the sleeping car, she steps on his face and crushes his eyeglasses. Oh, that's alright, he says, Just pick out the little pieces of glass, will you? He falls for Colbert and she allows his attraction to deepen in hopes that she can squeeze a bundle of money out of him for McRea's airport.McRea hasn't been idle. He manages to find an airline ticket to Palm Beach and meets Colbert and Vallee there. Colbert introduces him as her brother, Captain McGlue, hiding his real identity because she still hopes to wheedle a hundred thou out of the good-natured and thoroughly smitten Vallee.In Valee's Art Moderne mansion, his flighty sister, Mary Astor, attaches herself to McRea, believing him to be single.The identities are finally untangled at the end. The married couple are reunited, their love renewed. Vallee is disappointed but is firm about investing in McRea's airport venture. Astor is a little disappointed too. But -- voila! Both McRea and Colbert have identical twins and the film ends with their marriages to Astor and Vallee. The twin that married Astor is getting the worst of the deal.It's pretty funny -- wildly so at times. The Ale and Quail Gun Club are a hoot, with their shotguns and hunting hounds, roaming the corridors of the train, shooting out windows. The scene comes at a point at which the plot needs a little livening up because the script has already spent twenty minutes on a couple whose marriage is falling apart.One of the better comedies of its time -- 1942. I've seen it twice, over the years, and enjoyed it more the first time round. Some of the characters seemed not so much inspired as silly. Toto, Mary Astor's boyfriend, for instance, has little to add once his shtick of inventing a new language is grasped. And there are few of Sturges unexpected felicities in the script. No galumphing proletarian says, It's watcha call a paraphrase. However, everything rolls along at such a pace that there isn't much time for dwelling on fallen gags. It lifts the spirits, like a martini too quickly consumed."}, {"id": 25, "text": "The Palm Beach Story is quite simply one of the funniest films ever made. I cannot remember when I've ever laughed so hard through out an entire movie. Known more for The Lady Eve and Sullivan's Travels, Peston Sturges somehow got this one past the censors in 1942. There are plenty of sexual jokes and innuendos, as well as a single bed that you see the day after.Right from the very opening prologue you get the idea that you're going to be for a wild ride. In my opinion the prologue does not set-up what's going to happen very well, but it was a bold idea to try it. It seems to indicate that on the wedding day of the two leads Tom and Gerry (Joel McCrea and Claudette Colbert, respectively), something is quite amiss. Most of what happens in this scene does not make sense until the final two minutes of the film.After that, it's all one big joy ride. From the very entrance of Franklin Pangborn and Robert Dudley it's one hysterical scene after another. There is a scene between Dudley(as the Wienie King) and Colbert in her apartment where he convinces her that she should go to Palm Beach and divorce her husband that is totally endearing, smutty, and charming.McCrea, who has dreams of covering the city with a giant steel web that can be used as a landing strip for airplanes tries to convince Colbert to stay married to him. McCrea in this film has little to do(with the exception of a not too gracious descent down the stairs), other than appear annoyed and beg for Colbert to return to him.Colbert is absolutely breath-taking. In every gown by Irene she is the very definition of sophistication and beauty. It's said that she somehow was always photographed from the same angle in this film to take advantage of her good side. Rudy Vallee plays John D. Hackensacker III, oil baron, whom Colbert meets on a train bound for Palm Beach. Vallee is flawless in his depiction of a socialite, who is totally inexperienced in the ways of women. Her pursues Colbert but is never overbearing. His performance is perhaps the best in the film.That is of course unless you are talking about Sig Arno who appears as Mary Astors little toady, Toto. That's right, Toto. He's the man who came to dinner and stayed for the entire season. And he has the funniest exit out of an automobile that you will ever see. He alone is worth the price to either buy or rent this film.There are way too many funny bits and scenes in this film to go into detail. But I almost wet my pants when the Ale and Quail club started skeet shooting with crackers on the train.All of this obviously points out the brilliance of Preston Sturges. In every scene, there is a look, or a gesture or a piece of business that is just wonderful. And he just moves the action along. Again, the ending is not perfect, but it is pure Sturges.This is one of the funniest films I have ever seen. Enjoy.10 out of 10"}, {"id": 26, "text": "This being only the second screwball comedy I had ever viewed, I have to say for the most part that I enjoyed it. The acting, while a bit dated, made for an enjoyable experience. The plot was sadly similar to the previous film that i watched: My Man Godfrey; however, with obvious unexpected twists and turns along the way. Even though the plot was similar to the previous film, the story was itself very unique. Everything from the unexpected second appearance of the weenie king, when he helps tom Jeffreys, to the clearly non-traditional ending made this film worth watching. While it did drag a bit certain parts, with the short run time of only 88 minutes, the slower parts of the film seem to fly by. The music in the film added a much needed extra touch that helped to really captivate me at key or even dull moments, for instance, the ballroom or balcony scenes. The ensemble of the ale and quail club members was for me the most enjoyable part of the film, however, the, for lack of a better term, indentured servant serving the drinks and throwing the crackers for trap shooting made me a bit uncomfortable. Obviously there were many things in the 1940's that are very different today, but to see the way that African Americans were typecast and portrayed was a bit disturbing to me personally. That aside, another item that struck a chord with me about the film was the fact that Gerry makes it through most of the film simply by the grace of her good looks. The message that the film is sending with her behavior sets forth the notion that if a woman id pretty enough, life can be easy for her, which seriously degrades and takes away from women's equal rights, at least in my opinion. In summation, while this film had several parts that were a bit uncouth for my taste, it is hard to ignore a true and classic tale of love, passion, and overcoming the odds."}, {"id": 27, "text": "When it comes to icons of classic Hollywood, one of those that I just don't understand is Preston Sturgis. Among those who matter, he was a wonderful writer/director whose work was pure genius and this is probably the general tenor of reviews of his films here on IMDb. It's funny, because while I am a huge fan of screwball comedy from the 1930s and 40s, I just don't 'get' Sturgis. I've seen almost every film he's made, and with only a few exceptions (such as HAIL THE CONQUERING HERO and THE LADY EVE), I thought most of his films were pretty ordinary. All too often, his films, to me, seem to try too hard and lack subtlety or timing. Some prime examples are the laughing sequences as the chain gang members laugh to a Mickey Mouse cartoon as if they are all on LSD and Rex Harrison's bumbling with a chair and other household items in UNFAITHFULLY YOURS. These moments were just too over-the-top and lacked the charm and timing of such marvelous non-Sturgis screwball comedies like BRINGING UP BABY or MY GIRL Friday.While PALM BEACH STORY isn't a bad film, it certainly didn't do anything to turn me into a Sturgiphile. It's a good movie, but has too many improbable and over-the-top moments to keep it consistent. Some examples would include the hunting club scene on the train. While generally this was a cute sequence, it went from mildly cute to just plain stupid--using slapstick when it actually detracted from the overall plot. Having these drunk hunters running amok shooting hundreds of shotgun blasts throughout the train car just wasn't funny--it was more like something Elmer Fudd would have done, not a real life person. Also, the film's ending is way, way, way too convenient and contrived--having identical twins of BOTH McCrea AND Colbert show up out of nowhere to marry the two jilted loves (Vallee and Astor)! This defies possibility and crosses over to just plain dumb.All this is a shame, really, as apart from a few embarrassingly bad scenes (indicating that the great Sturgis COULD have used an editor), the film is a breezy and cute romantic comedy. Some elements, such as the Wienie King, were weird but somehow worked and the overall momentum of the film was good.My suggestion is that you SHOULD watch this overrated screwball comedy,...AFTER you've seen all of Cary Grant's first (they were so much better on practically every level)."}, {"id": 28, "text": "Big fan of Colbert but can't understand why people like this film.Similar concept to Midnight where a woman doesn't trust love and feels money and security are more important.Though it works in Midnight it feels very forced in the Palm Beach Story.JDHackensacker is not believable or funny and the same is true of Mary Astors character .Colbert and McCrea make an attractive couple but the plot and screenplay just don't fly. It's not horrible but neither is it very good"}, {"id": 29, "text": "Well it is unfortunate that this film just doesnt hold up for me,jokes arent funny at all and some kind of moments were just to old fashioned to work in todays times,also some staff in it had a racist vibe around it by that i mean a bartender in a train part,i can imagine that this film was groundbreaking and funny back then but today not so much,characters in a film had some nice deliveries and acting was very good but it lacked that comedic timing in it,also in moments i must admit that i also found some scenes boring and unintersting,this film is a classic that didnt work for me and i think that it failed test of times"}, {"id": 30, "text": "Despite it's chaotic opening scene, this film is a classic screwball comedy-ala Preston Sturges. The usual supporting players of most of Sturges great films are on hand to give support to Joel McCrea and Claudette Colbert. The scenes featuring the Ale and Quail Club members are priceless. The musical number by Rudy Vallie is a great parody of his earlier success as a crooner in the 1920's. Please give this film a look see.It will cure the need for a great film classic Preston Sturgeon General of film comedy,"}, {"id": 31, "text": "One of the funniest movies ever. It adopts the more-or-less sane central character(s), surrounded by a grab-bag of loons approach, and works it perfectly. Sturges deftly takes the characters and dialogue right to that tricky line between crazy hilarious and just crazy without ever slipping over to the wrong side -- mostly by keeping things moving quickly enough that nothing every gets stale."}, {"id": 32, "text": "Fun fun!! the versatile Claudette Colbert is Gerry, married to an architect Tom (Joel Mcrea), who can't get his designs across. so... Gerry hatches a ridiculous plot to leave him, and get hitched to someone who CAN help him. right from the start, we know its going to be silly and fun, with the william tell overture. Supporting cast is filled with incredible hollywood names (how did they ever get all of them together?) Mary Astor, Rudy Vallee, William Demarest, Franklin Pangborn. and some funny scenes, like the old,deaf guy that wants to rent Gerry's apartment while she's still in it, or the group of drunks on the train. all classic Sturges... loud, over the top scenes. it all moves right along, with a snappy script and story. Vallee is the rich guy who may or may not come to Gerry's rescue. and that surprise ending... where did that come from? but it's fun. a lot of fun. definitely worth catching this one! Written and directed by Preston Sturges. one of only fourteen films he directed. all clever and fun."}, {"id": 33, "text": "This starts with a slapstick wedding of Gerry (Claudette Colbert) and Tom Jeffers (Joel McCrea). It's happily ever after in the first minute. It's five years later and the couple is struggling with money. He can't find backers to build his airport. She is frustrated. He is always jealous of every man who looks at her. She wants a divorce and the taxi driver suggests Palm Beach, Florida. She is helped by various rich men along the way.This is great Preston Sturges fun. Colbert plays up her star qualities. The deaf sausage king is fun. I really love the train station ticket scene. I also love the ending which forces me to watch the beginning again. The only minor change I would make is Tom catching up to Gerry too early. I doubt he would pretend to be her brother. It would be more fun with him pairing off with the princess by themselves. They could have the big screwball reunion later on in the movie. My last question is where is the prequel. I didn't quite understand it in the opening but I'm itching to see the backstory."}, {"id": 34, "text": "This Preston Sturgis screwball comedy is a treasure, despite its flaws. Since Claudette Colbert(C.C.)was the lead female in both this film and the acclaimed prior screwball comedy It Happened One Night, a few comparisons wouldn't hurt. Here, she's a penniless, but beautiful, wife, running away from a penniless husband(Tom) obsessed with a seemingly crazy idea of building airports over cities. She hopes to bag a millionaire in Palm Beach, who hopefully will finance Tom's wild dream. In the former film, she's from a wealthy family, newly married, but running away from her father, who 'imprisoned' her, not liking her choice of husband. She's virtually penniless in her current state. Thus, in both films, she is dependent on male strangers to get where she wants to be. In Clark Gable's case, he's nearly as poor as she is. In the present film, C.C. lucks out several times in begging for a free trip to the next destination, as well as securing help from two filthy rich millionaires, one at each end of her trip. At movie's end, C.C. has the choice of marrying a rich, but plain looking and stuffy man, or a poor, but handsome and personable, man. In both cases, she's the romantic, choosing the poor man. Despite the classic scenes of comedy in It Happened one Night, to me, the present film is more amusing, overall, although, like the former film, the last part drags compared to the rest of the film.My favorite comedic scenes in the present film include 1) the wild antics of the 'Ale and Quail Club', on the train. 2)Robert Dudley, as a hard of hearing old millionaire, conversing with C.C. or Tom(Joel McCrea). 3) C.C. and Tom fighting over her suitcase on the street. 4)C.C. trying to get into the upper berth in the train, without a ladder. 5)The endingPreston Surges' acclaimed film of the previous year: Sullivan's Travels was full of ironies. Are there any notable examples here?A)C.C. went to Palm Springs to get a divorce from Tom. But, after they were courted by others, they decided to remarry.B)C.C. had a choice between a nerdy-looking multimillionaire who showered her with gifts, and a good looking, but penniless man she spent 5 years with. She chose the latter. Apparently, looks and personality was more important than money. This is borne out by the eagerness with which Hackensacker and his sister embraced the idea of marrying their identical twins, since they wanted to remarry each other.C)One of the world's richest men is traveling incognito in a second class train birthe, so why C.C. meets him. The Weinie King, another multimillionaire, wants to move into the modest apartment where C.C. and Tom are about to be thrown out for non-payment of rent. Again, they were helped by a rich man who shouldn't have been where he was.D)The 2 millionaires help both C.C. and Tom without expecting anything in return, in contrast to the general perception that such men are pinch pennies. Tom gets money for a train ticket to Palm Springs, and a promise to fund his 'airport in the sky'. C.C. gets to pay her bills, and a load of free gifts, each millionaire helping both in different ways.SOME COMMENTS ON SPECIFICS:1)Jim's revolutionary idea of an airport built on top of a city or part of it, was proposed in 1931, by Charles Glower, in relation to London, using new reinforced buildings to support it. With today's super carriers, this would be even more impractical.2)Rudy Valley's assumed name: J.D. Hackensacker III, presumably is derived from J.D. Rockefeller III, both owning big oil companies.3)How did Tom know where to go in Palm Beach to find C.C., on Hackensacker's yacht? 4)Why did C.C ask for her suitcase on the train, when she didn't arrive at the station with one, and, in fact, it was left on the street after it opened and the contents spilled on the street?5) The prologue isn't very intelligible unless you assume(correctly) that there are 2 C.C.s and 2 Joel McCreas.See this film free at YouYube"}, {"id": 35, "text": "Many of the movies made by Preston Sturges could be classed as comedies of error. The Palm Beach Story is no exception. The credit titles are alarmingly and delightfully interspersed with daringly abbreviated clips of Claudette Colbert and Joel McCrea rushing around madly, evidently priming themselves for their wedding. As each title card credit appears, the action suddenly freezes briefly. Although these clips are all brief, they do show us some alarming scenes. For example, we see Colbert getting herself primped up for the wedding in one shot, and Colbert, bound up with rope and imprisoned in a closet in another. Every time I see this film I seem to like it better. When I first saw it at a cinema, I was about 20 years old. I was disappointed. Was this the comedy riot I had been led to expect? I thought it was strained and artificial and far too talky. 15 years later I saw it on TV and a few months after that I enjoyed it at a theater. In fact, this third time, I liked it enormously.Palm Beach Story is the comedy of manners par excellence. The dialogue crackles with wit and sophistication and the premise of the film (that a pretty woman can get anything anytime, anywhere, from any man for no payment whatever other than a wistful or helpless glance) is as cynical as it is true. The film follows the adventures of a young wife dedicated to proving that proposition correct — and she does just this, through contact with some of the most delightful eccentrics ever to people a Sturges comedy.For full impact, however, these larger-than-life characters must be seen on a theater screen — the Ale and Quail Club is a case in point.There are the usual long but effective Sturges' takes, mostly in medium shot, showing the characters standing full-length. And I like the witty way the plot conclusion is foreshadowed in the sharply cut, old- time, send-up credit titles."}, {"id": 36, "text": "This screwball comedy threw me for a loop. I never imagined that a film made while the Hays Code was in effect would contain kissing at all. I thought it was so cute when the old man gave Gerry money in her apartment and she kissed him on the cheek. He then gave a little hoot and it was hilarious. I loved the scene in the train when the millionaires were all shooting their guns. It was funny when the conductor decided to disconnect their cabin from the rest of the train and leave them. I did not like the lesson that was taught throughout the majority of the film. The fact that the whole movie was based around Gerry finding a rich man to take care of here was immoral. And she was also lying to the man she met on the train about being able to do things that wives should do such as cook and sew. In the end Gerry and her husband Tom ended up back together which was sweet. I think it was really unrealistic that the rich people they were with married their twins. I was a little disappointed that the ending was so lame."}, {"id": 37, "text": "I thought this movie was wonderful from the beginning to the end. The only thing I didn't understand was the beginning (opening credits) I watched it about three times to see if I could understand it at all but I still didn't get it. Did they switch twins in the beginning of the movie and the wrong two people got married? I thought the ending had a good twist and it was very original for the time this film was created. I thought the movie had a great plot, it was very interesting, easy to pay attention to. Iloved how some thing was always happening in the movie and it always caught my eye. Over all I would totally watch this movie again. I liked it very much! The director and actors did a great job in the film."}, {"id": 38, "text": "I really liked this movie. I would have to say that this is now one of my favorite romantic movies of all time. Genny's husband never gave up to try and win her back, and i think that's grate. In many movies that you see now a days no man would do something like that. I also thought that the prince was really cool about the whole understanding on how her brother was really her husband. If that happened in real life then it would probably end up in a fight, and everyone would definitely not still be friends in the end. I think that this is an all round fantastic romantic movie. It kept me interested, and on the edge of my seat. It also made me not want to look away."}, {"id": 39, "text": "This brilliant Preston Sturges romantic comedy is pretty much perfect. From the frantic opening credits to the delicious ending, it never misses a beat. Claudette Colbert gives arguably her best performance as the wife who decides that her struggling inventor husband Joel McCrea would be better off if she divorced him, did a bit of gold-digging, and financed his grand plan. After a raucous encounter aboard a train with the Ale &amp; Quail club, Colbert meets nerdy, instantly besotted millionaire Rudy Vallee. McCrea goes after Colbert and the film reaches top gear as he pretends to be her brother and is pursued by Vallee's man-crazy sister, the amazing Mary Astor.Great, whip-smart writing, flawless direction and a top-notch cast make it a pure delight. I liked it even better than The Lady Eve."}, {"id": 40, "text": "Yes,it's very funny and Mary Astor is a hoot and a half, but has no one caught the fact that Joel McCrea flashes his privates (accidentally, of course), making this the first Hollywood film with exposed male genitalia?Don't believe me?  Rerun the scene where Colbert leaves McCrea after pinning a note to the comforter he's sleeping under.McCrea runs for the door, but thinks better of it and returns to wrap himself in the comforter.  As he turns back from the door his genitals flop out of his pajamas and back in again.Nothing very titillating here but surprising they kept the shot and surprising practically no viewer catches it."}, {"id": 41, "text": "I realize that this is supposed to be a classic, presumably because of the cast and the director, but it's one of the most idiotic, unfunny comedies I have ever seen. (And TCM gives it 4 stars!)"}, {"id": 42, "text": "for the right mixture of humor and romance. for gags. for the performance of Mary Astor. a film about women and men's relationship who explores in wise manner the nuances of it. and the result is more than good or seductive. it is lovely, charming, convincing, brilliant. not a great movie but useful slice for understand the art of a director and the cinema 's wave from a period. because it is smart work and careful exploration of the habits, ideas and manner to accept the life. because it has salt and pepper and a lot of other spices for impose a sort of game who, only at first sigh, could be a comedy or version of long war between sexes. a film who reminds more than presents. great job. seductive performances. and a role who gives to Claudette Colbert the chance to be more than the nice pretty girl."}, {"id": 43, "text": "After his wife leaves him for an eccentric millionaire, an inventor pursues her to Palm Beach and laughs follow. This was Sturges's follow-up to The Lady Eve and Sullivan's Travels from the previous year. That's a hard act to follow for any director. Although this is generally enjoyable, it is not at the same level of brilliance as the preceding pair. There are funny bits but the comedy is not sustained. It gets off to a hilarious start but sort of runs out of steam. Scenes go on much too long after they have been mined for comic effect. Still, Sturges is always worth watching. McCrea, Colbert, Vallee, and Astor lead a capable cast."}, {"id": 44, "text": "Palm Beach Story is a comedy made in 1942. In this film the directing was phenomenal it was an older comedy that caught my attention. Claudette Colbert had a certain presence around her when she was on screen, her facial expression throughout the movie are so versatile that is makes the movie that much more enjoyable. Although the plot line is bizarre I still found the film very entertaining. A man and woman get divorced and then the woman remarries and gets the new husband involved with the old husband. It is a movie that some people can relate to today. The director Preston Sturges did a nice job with the film. Camera angles and lighting all seemed to compliment the actors and scenery as well. The acting was also very well done. I especially liked that the body language between Tom and Gerry changed throughout the film. In the beginning there did not seem to be a lot of chemistry and as times goes on the two seem to be like newlyweds all over again."}, {"id": 45, "text": "**** CONTAINS SPOILERS **** I found the Palm Beach Story to be a wonderful film, but a little unbalanced. It advances far more smoothly during the second half of the film (after Colbert, McCrea, Astor and Vallee all come together) than it does up till that point. Up till the four meet up on the princess' island and the mistaken identity hilariously ensues, the comedy seems forced. The Ale and Quail club scenes, although delightfully madcap and slapstick don't seem to fit in very well with the rest of the film. Although they play a necessary role in the film by allowing Gerry to board the train and causing her clothes to become lost, I think they fall a bit flat as comic relief. The same can be said for the extended joke regarding the old man who's hard of hearing.The awkward situation created after the four main characters come together creates a much stronger comic base. When Gerry passes her husband off as her brother in order to marry Hackensacker and set up her husband up with the rich but careless Princess, it is the absurdity of the situation and the fact that we know more than the characters do that makes it so funny. It was this same imbalance between what the audience knows and what the characters do (and the extent to which it was milked) that made other great Screwball comedies like Bringing up Baby so funny. In comparison, the comedy created by characters like the Ale and Quail club members and Toto seems forced and silly. Despite this critique, I did enjoy the film overall and loved the exuberance and confidence of Mary Astor who absolutely stole her scenes with her quick dialogue and commanding body language. I was also moved by the romance between Colbert and McCrea, especially during the scene where Vallee sings in the background. I was genuinely touched by the irony that his affections for Gerry only worked to bring her closer to her original husband. It is the pathos of scenes like that and our affection for Gerry and her husband that grounds this film and keeps it going despite scenes where the comedy may waver."}, {"id": 46, "text": "Few directors can match Preston Sturges when it comes to zany comedy with social bite. Here in this one he has the toff rich set firmly in his sights. This tale is very fairy like one in it's structure and it's a joyous little romp as love eventually conquers all in amongst the rich and the lazy. Joel McRea &amp; Claudette Colbert are a wonderful duo and carry the film with almost carefree abandon, but I would wager that the films crowning glory is Rudy Vallee as the eccentric, but dim billionaire J.D.Hackensacker III, a character you want to punch one minute and protect the minute after! No frame wasted here and Sturges ensures that every character in the film delivers to a high standard, with the writing being dandy; witness an exchange between Colbert &amp; McRea early in the film where every innocent part of a tale Colbert tells is turned into a sordid accusation by McRea. It's funny as hell is this one, it's cheeky, and basically it's well worth anyones time, more so if you need a pick me up. So go ahead, let Dr Sturges work his medicine on you. 9/10."}, {"id": 47, "text": "The Palm Beach Story is one of the funniest screwball comedies of all time. In fact, it's on my list of top 10 funniest movies ever made. Three cheers for the Wienie King! What a scene stealer."}, {"id": 48, "text": "This movie was pretty good until the conclusion, which I thought was pretty lame. (It makes the Bobby's Dream from TV's Dallas sound so much more rational.)  OK, it's only a movie and one must suspend my disbelief, and this is a screwball comedy with a lot of zany antics from the start, but twins !?  Did Preston Sturges write this?There is a strong supporting cast which includes Rudy Vallee playing your atypical millionaire. My favorite performer was Mary Astor, whose character is totally different from her appearance in the Maltese Falcon.  Worth watching, but let your imagination run wild by coming up with your own more plausible ending."}, {"id": 49, "text": "Funny and fast story of a couple who've been married a few years, clearly still in love but terminally broke, so she decides to divorce him and marry a man rich enough to finance his screwy airport net idea.  She books it to Palm Beach but he arrives soon after and has to pose as her brother while the mayhem thickens.  Maybe not Sturges' most inspired film, but solid entertainment.Astor, as always, a delight as she tries to hook into McCrea (not knowing, presumably, that he is married).  The great star of the silent and talking screen soon took to supporting roles, but she got a chance to shine one more time in the spotlight here."}, {"id": 50, "text": "Shortly after the US entered the second world war this dynamite 86 minute black and white screwball was pure nonsense entertainment. Comic geniuses Claudette Colbert and Joel McCrea are often edited in curvy poses while musical star Rudee Vallee and first time brilliant nutcase comic Mary Astor shine in stiff posture poses, one edited shot with Colbert and MacCrea curved at the edges of the frame with Vallee and Astor straight as rods in the center of the frame as good as it gets in movie making. The characters are all nut cases who believe they are behaving responsibly yet are utter dopes likely to do the unexpected and glory in it. The story rolls along with enough physical comedy, certainly the ale and quail club, to keep the laughs flowing while the illogical storyboard makes no sense and the happy ending comes out of nowhere."}, {"id": 51, "text": "The opening scene tells it all. Well not really, as we don't understand it all until the end, but it begins the comedy, and this opening scene is one for the ages. Colbert is simply funny and quite the character. And she is surrounded by quite a cast of comedians and wonderful actors in Rudy Vallee, Mary Astor and Sig Arno. When they separate you realize that they are made for each other, despite their naiveness in the beginning. They realize through an air of comedy and are finally brought back together in a twist of romance. Through their acting and change of character they bring it together in the end, and make it work. It wasn't funny all the way through out, but the parts that were funny were quite the knee-slappers. Keep up with the quick one-liners and you'll enjoy yourself. Palm Beach Story, definitely not a favorite, but not bad at all."}, {"id": 52, "text": "The opening credits were rather confusing, showing little bits of the story, like a lady tied up in a closet. The movie had some rather dramatic characters and also held a lot of qualities of a silent film, with the big over exaggerated facial expressions and hand gestures. The music was also very similar to that of a silent film. The journey the lead woman goes on to help her poor husband is incredible. The train scene was definitely my favorite. The passion between the Gerry and her husband as they try to face getting a divorce and the money for her husbands airport project is nothing short of modern, with a few classic touches."}, {"id": 53, "text": "The Palm Beach Story (1942) is definitely a screwball comedy that creatively pushes in several directions quietly rebelling against the Hayes Code. The story revolves around a wife, who is convinced that she is not right for her husband, and a husband who is convinced that there is no one better than his wife now to be his wife. The wife, Gerry, heads out on her to find a new husband, using her sexual prowess to take her places that she otherwise would not be able to go (on account of being broke). Perhaps the most significant part of The Palm Beach Story (1941) was it's ability to push the standards and rules on sex as according to the Code. The Palm beach Story (1941) has Gerry use her sexual prowess which implies the promise of sex (although nowhere in the movie is sex alluded to between Gerry and the characters that she meet that are not her husband) to get what she wants, and nothing bad happens to her. I would think that the Hayes Code would have preferred her character meet a more conservative end, rather than just renewing her vows with her husband.Also, in the beginning after Gerry and her husband make-up from a fight, they kiss on their couch and head upstairs to sleep together, but because during the Code, men and women were not allowed to be shown in the same bed, the scene cuts to the morning when Gerry has already gotten up. But I liked how they showed her indent in the bed next to her husband suggesting what took place."}, {"id": 54, "text": "Normally I would just list this film as another Depression era screwball comedy. It follows the guidelines with plenty of zany characters, love triumphing, and the main characters having economic problems in the begging but are alright in the end. The reason I think this particular film stands out is because it has to be the funniest screwball comedy I've ever seen. One scene in particular that had me in stitches was when Geraldine was on the train om her way to Palm Beach. After coaxing her way on the train by fooling a group of wealthy gentleman by using her sex appeal, Geraldine finds herself stuck on the personal cart of the Quail and Ale Club.The Quail and Ale Club seem to party hard because by the time the conductor comes around to take their tickets their already all drunk. So now Geraldine is stuck on a train with a group of drunk hunters who are all greatly found of her. Picking up on this she says she's tired and must rest. Now comes the part where I couldn't even breath. All but two members of the Quail and Ale Club come in to Geraldine's room to sing her a song they wrote for her. Meanwhile the terribly drunk remaining two members get into a cracker skeet shooting contest in the main room of the cart. The first gentleman only pretends to shoot the cracker but after he notices the other man has been using live rounds to shoot the cracker he begins to use live ammunition as well. Upon hearing this all the other members run out and start firing their guns as well. Geraldine uses this opportunity to escape and finds another bunk to sleep in. Having noticed her absence the the Quail and Ale Club have a hunt for her and start parading about the train guns raised and hound dogs taking the lead. Now I haven't laughed that hard during a movie since I saw Super Bad in theaters. Admittedly that was the only part of the movie that had me in an uproar of laughter. Not to say that the rest wasn't funny but nothing surpassed the train scene in my book."}, {"id": 55, "text": "I beginning to see how great screwball comedies really are. This was fantastically funny. Old man Hinch was by far my favorite character. His short role is a great set-up to the rest of the plot. The movie portrays the wealthy at their worst, its a proves for a great laugh.The hunting crew on the train exhibit all the traits i would describe today's upper class with. They love to drink, party, and eventually get rowdy and destroy things for fun it was hilarious.I thought it was a bit obvious that when Gerry stumbled upon J.D. Hackensacker III that he would turn out to be a very rich man, but still the plot was great. in the end you see the true motives of Hackensacker III and his sister Princess Centimillia. their overwhelming joy at the news the both Tom and Gerry have twins shows that all they really care a bout are good looks.Great film!!!"}, {"id": 56, "text": "The Palm Beach Story directed by Preston Sturges is a goofy comedy involving a married couple that go through the ultimate test to see how strong their love for each other is. Claude Colbert and Joel McCrea play Mr. and Mrs. Jeffers. A young married couple going through their struggles just wanting the other to be happy. They bicker and fight together through out the movie, like most real married couples. Their chemistry together on screen made the movie enjoyable to watch and may have made the characters more relate able to members in the audience. Most aspects of the movies story line are unrealistic to reality. They are just a series of coincidences. All in all a good movie."}, {"id": 57, "text": "Great movie. Claudette Colbert is really endearing as Gerry. It's amusing how freely the topic of divorce is talked about and played with, considering the movie's cultural era(I guess that's the point)(Divorce was indeed frowned upon in the 40s, right?). Gerri's over-the-top, reasoned divorce plan would probably never be done in real life in present time, let alone the 40s. The way(Gerri's actor)proposes the plan is cute and, in the way that these kinds of comedies do, makes you wish people were that open and willing to such adventurous ideas. The performances are great, the dialogue is that fantastic quick and witty kind, and...it's just a really good overall movie."}, {"id": 58, "text": "This was an adorable quirky love story that had the funniest twists and turns. The things you never thought would happen; happened! Also it was nice to see just how true Gerrys love was for Tom with her divorcing him just so she could get money to pay for his invention...the things that made them go broke in the first place. I had a little bit of a hard time understanding how the beginning went with the rest of the movie where they introduce the characters but either way the movie was delightful. The dog chase through the train cars was definitely one of my favorite parts with the two old drunk men who started it. Its so crazy thinking that thats how people got around then because now everyone just hops on an air plane and they're off! I've never been in a train to it's just different seeing that aspect of the movie."}, {"id": 59, "text": "A hilarious movie centered around two characters who's love for each other overcomes logic and hardship. While I enjoyed this picture for what it was worth, I couldn't help but feel my morality start to decay. I appreciated how committed to his wife Tom was, but as the film progressed I found myself becoming annoyed with Gerry. Probably because she wanted to find a sugar-daddy for her husband, which I found a bit whorish for lack of a better word. Gerry's salvation rightly came however, when her love for her husband Tom finally put the kibosh on her plans. The scene with the Gun Club in the train was by far the high point of the film, but the ending I found a bit ridiculous. But what could I expect from a classic, and wonderful, screwball comedy,"}, {"id": 60, "text": "This was a light hearted/cute/and funny movie. the story was fairly simple but it flowed easily and would not lose the audience throughout as with having two stories simultaneously playing or sometimes confusing flash-backs, to give the story more depth. Although, I would say that it would have helped to develop the main character Geraldine Gerry more. She seems to be fighting between her head and her heart. She feels that she needs a man to provide her with all the material things that she desires however she realizes in the end that all that matters is to be with the one you truly love.It would have strengthened the story if the audience knew a bit more about her and her husband and why she felt she needed that type of material satisfaction in her life to begin with. However, the rich man she almost marries ends up marrying her sister when he finds out she has a twin. It Makes me wonder if people are marrying each other for the right reasons. Unfortunately, this circumstance still happens too often today among wealthy men and beautiful women. What I also thought was advanced technologically wise, was the use of the split screen to create the effect that she and her husband were both twins. Over all though, this movie made me laugh and was a cute comedy. Today, I think that maybe this movie would have been considered a chick-flick"}, {"id": 61, "text": "Palm Beach story is an cute love story that anyone can easily enjoy. The actors and actresses played great parts in this film, and the film makers did an outstanding job. The flow of the story line was something simple, and the camera people put a lot of work to make it wonderful.All the actors and actresses were full of life and different personalities. There were some real characters in Palm Beach Story. They were full of so much humor and sillyosity.I was quite upset about the beginning of this film, I didn't understand the whole screwball fast paced-ness and not there was not much explanation of what is happening, it just cut off and went to the future. Thankfully the end of this film had a cute, yet very, lack of a better word, weird explanation and ending."}, {"id": 62, "text": "I was a little bit disappointed because in the beginning of the movie, the movie presented the exciting point that was funny along with the tune of music that made me thought that I was going to watch the really comedy movie. However, I like the scene on the train because it is the very noisy train that I have ever seen. In addition, I thought she was wrong to decide to go on the train because there were many crazy people on the train. On the other hand, it became the good opportunity to meet someone who changed her life. Moreover, I learned about the style of dressing of woman in 1940. There were many pretty clothes which made me thought about my old style clothes in my country. Finally, the most favorite scene is the end of the movie because everyone was happy in the end ,and it was related to the beginning of the movie."}, {"id": 63, "text": "Preston Sturges' The Palm Beach Story (1942) stars Claudette Colbert and Joel McCrea. The film is of the classic screwball comedy kind including outrageous gags, fast dialog and storyline. These qualities are what makes it a screwball comedy but, hidden behind all that are real issues.Gerry is an antagonist, her conflicting actions are the reason the story ends up in Palm Beach. She up and leaves her husband instead of trying to work something out and it's up to Tom to be the hero and get her back. Tom chases her across the country to win her back because he loves her, and she loves him even though she ignores these feelings.I think the message of the film has a lot to do with love and what people go through for the ones the love. The film is convincing with this message and I think it was meant to be. Screwball comedies are always about two people who should clearly be together but aren't for whatever reason. And in the end, they always end up together, as they ought to."}, {"id": 64, "text": "Preston Sturges wrote and directed this screwy bit of screwball--one that begins on such a crazy-high note of comic chaos that it seems unlikely it will ever come together coherently. Claudette Colbert loves engineer-husband Joel McCrea but is tired of being poor; she vamps her way aboard a train heading for Palm Beach, Florida in hopes of getting a divorce, eventually winding up on the ship of natty, single multi-millionaire Rudy Vallee. Though released in 1942, The Palm Beach Story is less dated than many comedies of the 1980s, happily knocking about from one ticklish episode to the next. Colbert and handsome, sturdy McCrea are a very fine screen-team, and their misunderstanding-laced relationships with Vallee and marriage-minded sister Mary Astor are a hoot. Just the ticket to chase the blues away, the film ignores the turbulence of its era and instead luxuriates in charm and on-the-spot wit. Nitz, Toto! *** from ****"}, {"id": 65, "text": "Palm Beach Story, The (1942) *** (out of 4) Preston Sterges directed comedy about a wife (Claudette Colbert) who decides to leave her husband (Joel McCrea) so that she can use her sex appeal to get them the things they need. As with other films from this director, I found this movie to be sweet and cute but I must admit that I didn't laugh too much. As with others, I found the ending to be incredibly stupid and the stuff on the train with the shooting was just downright stupid. I don't mind over the top comedy but there's a line you shouldn't cross. What I enjoyed most were all the performances. Colbert and McCrea were terrific together and Mary Astor and Rudy vallee nearly steal the show. Robert Dudley as the Wienie King is the highlight here."}, {"id": 66, "text": "(There are Spoilers) With everything going south for the unhappily and soon to be breaking up married couple, after five years of trials and tabulations, Geraldine Gerry Jeffers, Caludette Colbert, decides to call it quits. After having paid off all her and her architect husband Tom, Joel McCrea, bills with the help of the Texas Weenie King Robert Dudley, who's hard of hearing but not sight, Gerry checks out of town on a train to Plam Beach Fla.Being a guest, who picked Gerry up as their mascot, on the train of the Ale &amp; Quail Club things get a wee bit sticky when the drunken members decide to do their quail hunting in the train car that their in. This has the terrified conductor detach the car loaded with the drunk rowdy and dangerous troublemakers separating Gerry, who was in another car at the time, not only from the Ale &amp; Quail members but her clothes leaving her with only a pair of pajamas on.With no clothes or money and about to be thrown off the train, she left her ticket with the Ale and Quail boys, Gerry luckily runs into, or better yet steps on his face, in the economy section of the train no less then the enormously wealthy but a bit eccentric John D, as in Rockefeller, Hackensacker the Third played by Rudy Valle. John D or Snoddles, as he's known in Palm Beach High Society, takes an immediate interest in Gerry to the point where he buys her loads of jewelry and an expensive wardrobe and then takes her on his yacht, after getting off at Jacksonville, by sea to his Palm beach estate.While all this is going on Gerry's husband Tom, also with the financial help of Texas Weenie King Dudley, gets on a plane to Plam Beach to change Gerry's mind in her leaving him for good. Sparks being to fly when Tom meets Gerry at the dock where she's with Snoodles whom she convinces that he's her brother. Snoodles has been fed a bunch of BS by Gerry about how Tom, as her husband, abused her and would like nothing better but to lay him out with a solid left hook followed by an earth shaking right uppercut to the jaw.Another thing that complicates matters even farther is Snoodles' spoiled sister Maud also known as Princess Centomillia, Mary Astor. Maude looking for a new husband, she's already been divorced five times, gets the hots for the big strong and handsome, but not at all interested in her, Tom Jeffers. Maud, as well as Snoddles, think that Tom is Gerry's, in her trying to keep his real identity secret, brother Captain McGlue a Charles Lindberg-like glob trotting aviator!The whole story boils down to Tom needing $99,000.00 to help build this new type of airfield, without any runways, that will not only make millions for him and those that invest in it but will help in the US military winning the war against Hitler and Tojo. The second half of the movie has both Gerry and Tom get back together again and at the same time try to tell the truth about themselves, that their hitched up o each other, to their now boy and girlfriends Snoodles and Maude. Maude in fact has decided to drop her house-guest and constant companion Toto, Sig Arno, who just tags along with her eating whatever, scraps or sandwiches, she throws at him making a complete nuisance of himself. It wasn't that much of a sacrifice for Maude to changes partners, Tom for Toto, in the middle of a dance.In the end everything works out just fine with Gerry and Tom, getting back together again, but also with Snoodles and Maude as well as Toto. Tom not only gets back with Gerry but gets the money, from Snoodles, to build his revolutionary runway-less airfield. As for Snoodles and Maude they do in fact end up getting married not to each other but to very very close members of the family! Just guess which one! Tom's Gerry's or theirs!"}, {"id": 67, "text": "Claudette Colbert is a knockout who knows it. She wants the good life, which her inventor husband can't give her. So she leaves him, intending on marrying someone who can support her and finance his invention. Things don't quite work out.The opening of Palm Beach Story is a bizarre scene that only makes some sense (and I'm emphasizing some) at the very end of the film. It's certainly an original way to start a movie. There are some hilarious scenes in this film - desperate to get to Palm Beach for a quickie divorce, but with no money, Colbert accepts the invitation of the gentlemanly Ale and Quail Club to ride in their private train car as their guest and mascot. Unfortunately, the emphasis in this club is the ale and not the quail - shooting sugar cubes will do - also blowing out train windows, trashing whole train cars - you get the idea. Running from them, Colbert soon meets up with Rudy Vallee, who gives an absolutely delightful performance as a filthy rich man. He serenades her at one point, and it's great, hearkening back to his days as a crooner! Mary Astor is his many times married sister, and when Colbert's husband shows, in the form of Joel McCrea, Astor sees her next mark.McCrea has a funny slapstick fall down a flight of stairs, but otherwise, doesn't have much to do except be angry and jealous of his wife. Colbert in her glorious clothes, Vallee, and a vivacious Astor upstage him a bit. A very funny film, produced during World War II to give America a much-needed laugh."}, {"id": 68, "text": "The Palm Beach Story is a lopsided comedy (part of it's funny and part of it's not), but the movie is back-ended with all of the funniest bits, so it allows you to forget the slower parts and it sends you out on a high.After a sensationally bizarre opening credits sequence, the movie settles down into a slightly less zingy version of The Awful Truth. Claudette Colbert thinks her marriage to Joel McCrea isn't working, even though he doesn't think likewise. She thinks she's not a capable enough wife; he thinks he's a failure as a man and husband. She takes off for Palm Beach to get a divorce despite all of his attempts to stop her. On the train to Florida, she meets a wealthy tycoon who wants to marry her and give her everything she could possibly want, but she realizes that what she really wants is her husband.This is all told with a lot of wit and flair. The early scenes with Colbert and McCrea drag, and an extended bit of nonsense on the train involving the Ale and Quail Hunting Club is superfluous and not very funny. But once everyone shows up in Palm Beach, the film becomes a delight, and a bonus is added in the person of Mary Astor, who plows on to the screen about half way through the film and decimates everyone in her path with her quick-tongued and hilarious performance as a rich society lady with a lot of time on her hands and her sights set on Colbert's husband.What I liked about this film was that Colbert and McCrea don't seem to have a lot of chemistry in their early scenes together; he seems so stiff and bland, and you don't really blame her for wanting to get away. But after you've seen both of them with other people, they seem so much more right for each other when they get back together, and there's all this chemistry you didn't initially realize was there. I don't know if that's due to their performances, the writing, the directing, or whether it was just a happy accident, but it works beautifully.Grade: A-"}, {"id": 69, "text": "THE PALM BEACH STORY is not to be confused with reality. It's a zany romantic comedy given full speed treatment by director Preston Sturges who brought screwball comedy to an art form.His script, full of hilarious one-liners that fly by almost too fast to catch, is acted to perfection by CLAUDETTE COLBERT, RUDY VALLEE and MARY ASTOR--with a less enthusiastic turn by JOEL McCREA who gives the only so-so performance, perhaps because none of the wittiest lines come his way. I've always liked this actor but here is performance is almost muted and strangely remote.Nevertheless, if screwball comedy is your dish, this is one you can relish. From the moment Colbert gets aboard a train carrying her to Palm Beach, the fun starts and gets into high gear, racing toward a conclusion that is not altogether satisfying nor even remotely hinted at until the final few minutes of film. It's a twist that somehow doesn't ring true--the only really false note in an otherwise perfect screwball comedy.Rudy Vallee is outstanding as a nutty millionaire, a role written expressly for him (and he even gets to sing a little)--and Mary Astor, as his husband hunting sister, is hilariously over the top as a woman who can't stop talking while pursuing her man.A good way to spend a pleasant 90 minutes."}, {"id": 70, "text": "The Palm Beach Story is one of the best examples of the wonderful nonsense that Hollywood used to turn out in its best comedies. It's only in the movies that circumstances like these happen and it's quite beyond my powers to describe them.Joel McCrea and Claudette Colbert come to a dry patch in their marriage and decide to split. Colbert takes a train to Palm Springs and McCrea pursues her by plane. And they both wind up with a brother and sister pair of gazillionaires in the persons of Rudy Vallee and Mary Astor.I will say that Preston Sturges did kind of reach into left field for his romantic ending, but that's half the fun of The Palm Beach Story.Only half because the other half is the fun of the journey. Not much happens to Joel, but Claudette is on one wild ride when she's adopted by a gang of drunken millionaire sportsmen known as the Ale and Quail Club. The proponents of gun control should get the right to The Palm Beach Story and run it at all opportunities. Seeing these louts, plastered out of their minds and shooting off their weapons is pretty funny and the best argument I know for gun control. Preston Sturges used some of his favorite players from his usual stock company for members of Ale and Quail.Also look for a very funny performance by Robert Dudley as the 'wienie king' whose encounter with Colbert sets everything in motion.Rudy Vallee gets to sing in this which is also nice. He sings a chorus of Isn't It Romantic and then sings his own hit, Goodnight Sweetheart which has the opposite effect from what he intended. The Palm Beach Story is the object lesson in how to make screen comedy and make it to last."}, {"id": 71, "text": "When commenting on a film as brilliantly constructed and deeply entertaining as The Palm Beach Story, it's hard to know just where to start.Do you tip your hat to the uniformly wonderful performers?Do you pay tribute to the bizarre and hilarious conversations held by the Weenie King (Robert Dudley), an incidental character who manages to be a lot more than a mere plot contrivance?Do you mention the fact that the film was clearly an influence upon the (slightly superior) screwball classic Some Like It Hot?Nope. You just say, Preston Sturges was a genius and this is his best film.Gerry Jeffers (Claudette Colbert) has decided that she needs to divorce her husband Tom (Sturges regular Joel McCrea). Why? We're not quite sure. Perhaps she's looking for thrills, perhaps she simply wants a partner who can pay the rent and perhaps she's truly come to believe that she no longer loves him. No matter. Her mind is made up and there's nothing Tom can do about it. Try as he might, Gerry slips through his fingers and ends up on a train to Palm Beach, the divorce capital of the world.Echoes of Some Like first appear on the train ride when Gerry finds herself unable to sleep do to the racket being caused by The Ale and Quail Club. It's bad enough when they start shooting out windows, and what comes next... let's just say that it's a lot funnier than it would be if it happened in real life.Still, Gerry makes it to Palm Beach, in the company of nutty millionaire John D. Hackensacker (Rudy Vallee). Things only get really out of hand once Tom arrives and becomes pegged as a bachelor, Captain McGlew. And spoil more of the plot for you I will not.Sturges was capable of operating in many modes: responsible and patriotic (Sullivan's Travels) and outrageously madcap (The Miracle of Morgan's Creek) are two that come to mind. But Palm Beach shares its elegance, wit and reserve with The Lady Eve, in which con artist Barbara Stanwyck sets her sights on absent-minded professor Henry Fonda. (Even the mistaken identity plot is similar upon examination).Between the two, Eve may end on a slightly more graceful note, but Beach seems to be made with a bit more... well, experience. Sturges seems at his most relaxed throughout the film and it does a world of good. (The story is bogged down only by brief moments of racism early on). And leaving, it's hard not to feel sunny and refreshed.For those in need of a vacation, I recommend a stay at Palm Beach. And the rest of you should come along as well."}, {"id": 72, "text": "Hilarious movie about an unhappily married couple played by Joel McCrea (unbearably handsome) and Claudette Colbert (unbearably beautiful).  She goes to Palm Beach to get a quick divorce.  While enroute she meets a shy, sweet millionaire played by Rudy Valle who immediately falls in love with her.  But McCrea shows up in Palm Beach wanting her back...Lightning paced, very sweet, romantic and absolutely hysterical comedy.  The script is packed full of great lines and (with the exception of McCrea) the cast give them their all.  Colbert is delightful as the wife. McCrea, unfortunately, gives a stone-faced performance as her husband--still, he is very good-looking and doesn't really hurt the movie.  Also, as one previous poster noted, you get a quick look at his best parts near the beginning! Vallee is pretty good too.  Mary Astor is absolutely hysterical as Vallee's VERY talkative sister.  And then there's the Wienie King and the Ale and Quail Club!  A definite must-see!Best line: The men most in need of a beating up are always enormous."}, {"id": 73, "text": "The Palm Beach Story has a poor title but it's a hilarious movie by the sometimes cynical master of comedy, Preston Sturges.  Palm comes a year after Sturges far lesser comedy, The Lady Eve, staring Stanwyck and a dull Henry Fonda.  The superior comedy, Palm, rivals the greatest screwballs like Bringing up Baby and The Awful Truth for sustained insanity and strength of characterization.In this screwball masterpiece, the characters' flakiness is shared by the rest of their absurd world.  It climaxes in a fantastic scene set on a train where an Ale and Quale club goes on a drunken shooting spree, forming a posse that tramps from car to car singing A hunting we will go.As Anthony Lane argues, Palm presents a realist view of the prominence of sex and greed as motivating and blinding forces.  In a key scene, Colbert gives a little speech about the look, or the copulatory gaze, that she's been getting from every man since she was 14.  This movie is slightly cynical and funnier for it's richness.  Comedy is set off against discussions of lost opportunity and youth.  Topic A is what runs the world of The Palm Beech Story, but sometimes topic B, money, is temporarily more important.  After leaving her struggling husband, Gerry gets prizes from any horny man she comes in contact with: rent money from the regretful wiener king, taxi rides, a train ticket from hunters, and dresses and rubies from a millionaire.  Also, the Princess has a kept pet-man who tags along as she pursues new husbands.  Sturges shares with Wilder and Allen a slighlty cynical view of human nature.  As Lane points out, they don't have a conservative Catholic view of the inherent selfishness and sinfulness of human kind, but a liberal, more Deweyan, view of human potential, slightly jaded from their experience. They are not without hope, but aware of limitation.  Sturges is beyond naivete, like many of his screwball compatriots, and frankly examines weaknesses that others avoid or deny, and he criticizes conventions that supposedly created a utopia in the 1950's.  This is one of the highlights of the screwball genre that illuminatingly explores, like no other group of films, life, love, gender, sexuality, and desire in 20th century America in an endearing and always fun manner."}, {"id": 74, "text": "One element of this film that shouldn't be ignored is that it, like Sullivan's Travels and The Miracle of Morgan's Creek, is a conscious lampooning of earlier movies from the 1930s. It takes a standard, conventional plot from those movies and turns it on its ear. The same plot can be seen for example in the Paramount movie from 1931, Up Pops the Devil, with Carole Lombard and Norman Foster (who coincidentally was Claudette Colbert's first husband). In that movie, a wife who still loves her husband wants to divorce him for his own good; she thinks she's just a noose around his neck, and once rid of her, he'll become a success. It's set in the same upper crust of society as The Palm Beach Story, with a millionaire suitor for the wife and a nymphomaniac girl for the husband. Here, everything is played straight, with as much pathos and melodrama being milked out of the situation as can be. In The Palm Beach Story though, the same basic plot and characters are used, but it's the comedic potential and wackiness of the situation that's emphasized, to marvelous effect.The subplot with the twins, glanced at in the beginning and end of the picture, is another conscious lampooning of conventional movies, here a lampooning of the structure of movies themselves, of their conventional beginnings and endings. It's not meant to be taken seriously; as McCrea's character casually says at the end, it's all stuff for another movie. No words can be found to adequately praise Claudette Colbert's performance. Joel McCrea is good too, as the prototypical wooden 1930s leading man. Rudy Vallee is absolutely hilarious as a momma's boy version of John D. Rockefeller, as is Mary Astor as his rich nymphomaniac sister. Her eunuch, Toto, played by Sig Arno, seems straight out of an Ernst Lubitch picture, perhaps a Sturges nod to the master. Quite a few scenes of the film, in their settings and atmosphere, pay homage to Lubitsch. Sturges does the Lubitsch touch proud, especially in those two scenes when Colbert sits on McCrea's lap so that he can undo the back of her dress, with the two of them both times melting into a kiss, and the scene ending with a fade out, leaving little doubt as to what will happen next. The second scene is particularly romantic, done as Rudy Vallee sings Good Night Sweet Heart, itself a standard of the 1930s. Vallee also sings a line of Isn't It Romantic, a song introduced in the luminous 1932 film Love Me Tonight, directed by Rouben Mamoulian. The music in the film itself hearkens back to those great romantic comedies of the 1930s.It's nice to see Sturges's stock company of actors popping up here as well. I noticed William Demarest say his name was Bill Docker, the same name his character had in Preston Sturges's Christmas in July.In short, The Palm Beach Story is a wonderful film, whose richness can really be appreciated when seen in context, in the context of those old 1930s Paramount films, both the melodramatic ones like Up Pops the Devil, that it lampoons, and the comedic, romantic ones like Love Me Tonight and One Hour with You, that it pays homage to."}, {"id": 75, "text": "This little jewel is a madcap romp in the mold of The Philadelphia Story. Preston Sturges' impressive direction is just light enough to keep things hopping and technically savvy to pull off the zaniness.There's a lot to like about this movie: the dialogue is both snappy and witty, the costumes are eye-catching, and the acting is inspired.Now admittedly, a willing suspension of belief and even a temporary romantic bent does help one to enjoy this movie thoroughly. But this is a great result from a delightful blend of Sturges, Colbert and McCrea. (Ah, and the wonderful Mary Astor shines brightly as well). Of course like many forget the raging war films, this one benefits from lots of anachronistic concentration. You almost have to park away the 21st Century to really get the fullest effect of The Palm Beach Story. So Tune in, turn off the phone and ignore the Blackberry, and enjoy."}, {"id": 76, "text": "The Palm Beach Story stars Claudette Colbert and Joel McCrea as a married couple who is still in love, but is nonetheless separating after five years of marriage. Gerry Jeffers (Colbert) and Tom Jeffers (McCrea) are down on their financial luck while Tom, an architect, tries to sell his idea for a new airport. One day while their landlord is showing their apartment to a prospective renter (they are behind on their rent) Colbert catches the fancy of an eccentric old millionaire, who give her not only the money for the rent, but a little extra as well. That night she takes her husband out to dinner and explains that they have to divorce so that she can marry a millionaire and raise the money that he needs for his business. Tom is obviously not taken with this idea, but Gerry takes off for the train station and charms her way on via an eccentric group of millionaires who are on a hunting trip. While on the way to Palm Beach for her divorce, Gerry meets another millionaire, John D. Hackensacker III (Vallee) who falls for Gerry and brings her to his yacht, where he is going to ask her to marry him. Tom shows up, Gerry convinces John that Tom is her brother, and mayhem ensues.There's an awful lot of story in The Palm Beach Story, considering the film is only 88 minutes long. Colbert is charming as always, and McCrea doesn't stray far from his regular guy demeanor much. It seems that this is usually a Sturges favorite, but now that I have seen four of his films I would say that it is probably my least favorite thus far. Not to say I didn't enjoy it\u0085 there were great screwball moments, but sometimes I just kind of thought Enough already.Something that is always enjoyable in viewing Sturges films (and something I have mentioned in another review of his films) is the obvious influence he had on the Coen brothers. In this instance, as soon as I heard the name John D. Hackensacker I had to laugh, because not only are these comical names a Sturges trademark, the Coen brothers have at times done this as well. I liked the film enough to somewhat enjoy it, but I would only call it average. 5/10 --Shelly"}, {"id": 77, "text": "I love old movies. They're like time machines. Glimpses into the past; into the world that my parents inhabited.But in this case it is a fantasy world. In l942, the country, having endured over a decade of economic depression, had just stepped across the threshold into the uncertain and wrenching horror of World War II. An easy sell in those hard times was a variation on the old Cinderella/Prince Charming story. So ignoring the current political realities and exploiting the great disparities of his day, Mr. Sturges created a fluffy hour and a half diversion based on the premise that some men, as he spares no cliché to point out, are born more equal than others.The story line, unstructured and at times befuddling, is a typical Hollywood hash job. Having been monetarily blessed by her fairy godfather (Robert Dudley as the Weenie King) Mrs. Gerry Jeffers (Claudette Colbert) leaves New York, her hapless husband Tom (Joel McCrea), and all her troubles behind. Aboard a train, (the pumpkin), bound for the fantasyland of Palm Beach, where the stinking rich live the high life (then as now) in a bubble completely divorced from the grueling exigencies of the average Joe's day to day life she meets her Really Rich Guy, John D. Hackensacker III (Rudy Vallee) who buys her everything. Will her looser husband who really loves her win her back? Or will the licentious Princess Centimillia (Mary Astor) get her hooks into him first? The transcendent scene for me was when Rudy Vallee sings Goodnight Sweetheart while Colbert struggles with the zipper on an evening dress that Madonna would die for.Sexual innuendo aside, I found this movie to be neither humorous nor entertaining. Rather it was boorish, predictable, and contrived. The most egregious injury was to those people represented by characters such as Fred Toones, the Club Car bartender, portrayed stereotypically, so as to reinforce and perpetuate the Jim Crow racism of the day. An insult then, an embarrassment now.In fact the whole movie is a celebration of a system of exploitation. The Robber Baron descendant Hackensacker is unbothered by the source of his plenitude. It just is. Sturges, who knew only too well where the bodies were buried in Palm Beach, didn't want to spoil the fun by showing us how such wealth is made and supported. This is after all a fairy tale. A whitewash.Call me a wet blanket but it just amazes me that this kind of tripe could be made during a time of world upheaval, suffering and sacrifice. I think it says something very unflattering about that 1942 Hollywood in general, Sturges in particular, and the audiences who bought into this load. A good movie should not only be literate and technically competent, but compelling and inspiring. Or at least funny. Measures to which this old flick hardly attains. I think I'm being generous in giving it two stars. Nevertheless, its redemption, as with many old things, has come with the years, and its value now lies in the perspective on contemporary life that a viewer can distill from its representations of that 1942 zeitgeist.And for the hopelessly nostalgic like myself, a trip back to a time past."}, {"id": 78, "text": "Undoubtedly Sullivan's Travels is comic genius Preston Sturges' most sophisticated comedy; The Miracle of Morgan's Creek his zaniest. But The Palm Beach Story has more belly laughs than any Sturges gem. Rather than try to rate his masterpieces, watch them all. His humor was so advanced, so ahead of its time, that it is still not fully appreciated by many film critics and historians.Only Sturges would begin a movie with a wedding sporting a subtitle, They lived happily ever after. It seems only a few years later the happily married couple is bickering over finances--they don't have any. Appears the funny old man who made his fortune in sausage, the Wienie King (Robert Dudley). He is so enthralled by the beauty of Gerry Jeffers (lovely Claudette Colbert) that he gives her $700 to get a new start. When she runs off to Florida on a train, the same Wienie King gives her husband, Tom (Joel McCrea), money to fly to Florida to catch her. Gerry is taken in on the train by the notorious Ale and Quail Club, an outrageous Sturges lampoon of all brotherhoods and fraternal orders since the beginning of time. When Sturges' cast of crazies headed by William Demarest start shooting up the place using real bullets, Gerry fleas to the shelter of John D. Hackensacker III, aka snoodles, played with élan by master showman Rudy Vallee. Snoodles just happens to be one of the richest men on earth. Adding to the nuttiness is Snoodles' sister, The Princess Centimillia (portrayed knowingly by Mary Astor), and her latest appendage, Toto (Sig Arno), as in Toto of Kansas. How do the patterns on this crazy quilt become symmetrical? You have to see it to believe it. Just get ready to laugh until the tears flow."}, {"id": 79, "text": "In New York, Gerry (Claudette Colbert) and Tom Jeffers (Joel McCrea) are about to be evicted from their apartment for lack of payment after five years of marriage. Tom is an architect and has developed the design of a suspended airport, but can not find an investor and is completely bankrupted. When the aspirant tenant meets Gerry, he tells that he is a wealthy businessman from Texas that became rich with his sausage business and he gives US$ 700 to Gerry to pay her debts and start a new life. Tom does not believe that the old man gave the money to Gerry without sex and they have an argument, and Gerry concludes that she is a burden in the life of Tom. On the next morning, she decides to travel to Palm Beach to get a divorce, and marry again with a millionaire to help Tom in his project. She boards a train to Palm Beach, where she is helped by J.D. Hackensacker III (Rudy Vallee). They leave the train and she learns that Hackensacker is one of the richest men in the world. They travel to Palm Beach in his yacht and Gerry meets his sister, Princess Centimillia (Mary Astor). But Tom has followed Gerry and she introduces him as if he were her brother. Soon Hackensacker falls in love with Gerry and the Princess with Tom. But a zipper and twins help to solve the situation. The Palm Beach Story is a cynical and unethical but dated screwball comedy by Preston Sturges. I do not like this movie since Gerry Jeffers is a nasty woman and never a companion to Tom, who is a sucker; therefore I do not feel empathy for the ambitious character performed by Claudette Colbert. My vote is five. Title (Brazil): Mulher de Verdade (True Woman)"}, {"id": 80, "text": "Only Preston Sturges in the director's chair could tempt me to watch a movie called 'The Palm Beach Story'. Honestly it's not quite as good as either 'Sullivan's Travels' or 'The Lady Eve'... but then those are both gob-smacking masterpieces! As usual Sturges' limpid comic dialogue ripples over some serious themes, money, divorce, ambition. He's light-years ahead at injecting real, actual, honesty into a comedy and still keeping it madcap. Actresses always seem to turn in stellar performances for Sturges, Claudette Coburn and Mary Astor are no exception. Joel McCrea and Rudy Vallee do their best to be forthright and stalwart, McCrea definitely does it better in 'Sullivan's Travels'.Try as I may, I can't find the bitterness or cynicism in Sturges' movies that most critics talk about. I don't think those are at all the right words to use, but I can't suggest a substitute. He seems to put into practice the theory that you can laugh at anything, even when it hurts to do it.Preston Sturges was too much for Hollywood, they couldn't take it."}, {"id": 81, "text": "An inventor (Joel McCrea) needs cash to develop his big idea. His wife (Claudette Colbert), who loves him, decides to raise it for him by divorcing him and marrying a millionaire.One of the more interesting things about this film is the trouble it had getting made thanks to the censorship office. Although there is no explicit sexuality or foul language, it does have some questionable themes. There is talk of prostitution, and apparently the censors did not like the way marriage and divorce were handled so lightly. Even after the necessary cuts, this remains a strong central part of the plot and humor.Interestingly, the Bill Hader interview on the Criterion disc adds a lot. You might not think of Hader as a film historian or critic, and maybe he is not. But he really understands Sturges and how Sturges wrote his scripts. He connects the dots between Sturges and the Coen brothers, as well as explaining how each character, no matter how minor, is important to the story."}, {"id": 82, "text": "I am really at a loss to understand how this movie gets the reputation it has earned. Just because Preston Sturges' name is involved doesn't make it profoundly funny or profoundly insightful. Claudette Colbert was a charming cutie and all that. But born in 1903 and at nearly 40 years old when this picture was made, the motivations and emotional responses she is asked to exhibit in Palm Beach Story are way too immature for who she actually is. IMO, that can be said of nearly everyone involved in this coarsely unfunny movie. Mary Astor, another lovely and wonderful actress, is also made to act the complete noisy air-head. When the film was made there no doubt were other criteria to judge her character by. These days however, again IMO, Astor's constant screeching and especially her relationship with Toto, her annoyingly unattractive hanger on, who understands nothing, is actually offensive. Cringe-worthy to be honest. (Toto's character and how he is treated reminds me of the part played by Asta or one of those other terrier dogs that were popular in screwball comedies.) Only Rudy Vallee, who later in his career perfected the Teflon-coated stooge role, seemed to me to almost transcend the material. Everyone is entitled to enjoy whatever movie or star or whatever they like. As for me,I'm darned if I know what the attraction is in Palm Beach Story."}, {"id": 83, "text": "A refurnished Preston Sturgis' 'Palm Beach Story' is out on DVD. An occasion to celebrate. This screwball comedy touches on a problem that affects young working families: how to make ends meet. The joke is given away at the beginning for the attentive eye. Of course this is Hollywood, so the the Jeffers (Claudette Colbert and Joel McCrea) down on their luck live on Park Avenue. Colbert decides to leave McCrea whom she loves deeply, to find her way with her looks to bankroll his dreams but ... A fairy godfather 'the weenie king', played with a straight faced by the excellent Robert Y. Dudley steps in. Debts paid with Dudley's $700 (several thousands in today's dollars), McCrea takes it the wrong way. So Colbert takes off to find her fortune and new life. But the fairy godfather steps in again by paying McCrea's way to win back his bride. And so it goes: there's the hilarious Quail and Ale Club of raucous inebriated millions come to her rescue with gun shots, hounds and barber shop singing. And on the train she steps on Rudy Valle's 19-century style pince nez eyeglasses, and she steps into the world of super wealth. And so it goes. Valle is a charm and a great second banana. And then there's Mary Astor as his oft married sister who sets her eyes on Mcrea. But the bond of love cannot break Colbert from McCrea.And then the film's kicker comes in. But you've got to see this delicious comedy to find out the happy ending and everyone lives happily ever after!"}, {"id": 84, "text": "Verbal comedy never surpassed the level of insanity achieved by Preston Sturges at his creative peak during the 1940s. At a time when other filmmakers rallied around the protective banner of conformity, Sturges blazed an eccentric path beyond every acceptable standard of decency with his whipcrack satires of the American Way of Life. One of his most inspired comedies was this affectionate portrait of the idle rich, in which, after what must be one of the most baffling title sequences ever conceived (\u0085that's another plot entirely, explains Joel McCrea at the end of the film), Claudette Colbert abandons her financially insecure husband (McCrea) for the life of an adventuress, while he pursues her all the way to the Palm Beach mansion of lonely zillionaire John D. Hackensacker III. McCrea's cigar-store Indian acting style and Colbert's buoyant pragmatism are perfectly matched against the usual assortment of Sturges nut cases: the calamitous Ale &amp; Quail Club; the philanthropic Weenie King; and (in a casting coup) crooner Rudy Valee and Mary Astor as the urbane, innocent Hackensacker and his man-hungry sister. The humor is a lively mix of sophisticated banter and good old-fashioned pratfalls, driving home the point that money can buy anything except, perhaps, a happy ending, which requires a typically elaborate Sturges twist of fate."}, {"id": 85, "text": "A real hoot from Preston Sturges, a rollicking watch which is over all too soon. From the brilliant stop-start sequence over the titles, confusing right until the last frame which at last makes crazy sense (I'm sure Preston would forgive the oxymoron!) of it all, taking in a madcap menagerie of characters, every bit as eccentric as their names or nicknames indicate, for example get these; the Wiener King, the Ale and Quail Club, Princess Centimillia not to mention John D Hackensacker the Third. The set-piece comedic set-ups at the couple's flat, train station, on-board the train and on Hackensacker's yacht are played to the hilt with lightning fast delivery of dialogue so good you take for granted the comic timing so effortlessly achieved. Star of the show is the lovely effervescent Claudette Colbert, almost 40 at the time of making this movie but looking years younger in a variety of differing costumes, taking in over-sized men's pyjamas to the very best costumes that Hackensacker can buy.She's an audio-visual treat, putting into effect her madcap idea for the betterment of her unlucky, under-achieving, unrecognised husband, played with straight-laced, straight-faced aplomb by previous Sturges alumni, Joel McCrea. There are far too many other minor highlights amongst the supporting cast along the way to mention, with almost everyone in the cast getting to make some kind of wisecrack and the whole is served up as a riotous upper-class Marx Brothers-type confection for the 40's replete with a sub-Harpo stooge as Princess Centimillia's adoring numb-skull suitor. There are so many scenes which just fizz and crackle with wit and occasionally bawdy humour, as Sturges takes pot-shots at sexual mores and the idle rich. Rudy Vallee is great in his role as the hopelessly smitten, hapless multi-millionaire and Mary Astor equally winning as his caustic, man-mad sister. To summarise, 90 minutes of sheer Hollywood bliss topped off with that magic Sturges touch."}, {"id": 86, "text": "What a clunker! What was Preston Sturges thinking when he made this movie? There is nothing funny about this movie. Lots of slapstick, people falling over each other, contrived scenes with a deaf man, dumb story, stupid lines, idiotic scenes, just lots of noise, all based on the story that defies all belief, even though it's a movie. The movie is shrill, annoying, unentertaining, and intellectually a void, and something that you may want to to avoid. Unless you are a student of Preston Sturges, there is no reason to watch this movie. The movie has a great cast, but a great cast does not guarantee a great movie and in this movie the dumb story trumps the cast. Now if this movie featured, for instance, Abbott and Costello or Laurel and Hardy, then maybe the movie would have worked, but to accept Claudette Colbert and Joel McCrae acting like Lucy and Ricky is a bit much to swallow, even for a movie buff. You want stupid, goofy and funny? Watch the Three Stooges instead. Or watch Jack Benny. Or Jackie Gleason and Audrey Meadows. Or William Bendix and Marjorie Reynolds. Moe, Larry and Curly would have acted rings around this clunker because the were unpretentious and good at what they did. You would no more expect Moe Howard to play a lead role in a major dramatic motion picture than Joel McCrae play a buffoon falling over himself, but Mr. Sturges attempts this strange casting in this movie, and it does not work.This dumb movie was made in 1942, during World War Two. The entire world is at war, international law and order had completely broken down, Hitler, Mussolini and Tojo were on the rampage, and Hollywood produces a trite piece of celluloid junk, featuring major actors in something that would have entirely ignored if it weren't a Preston Sturges product. Somebody must have really liked Mr. Sturges to finance this completely ridiculous movie. You want comedy? Watch Will Ferrell or Steve Martin."}, {"id": 87, "text": "I think that in this film present invisible conflict between the director and screenwriter. THE PALM BEACH STORY, despite the genre definition, thematically is very superficial film. This my statement is not confined to questions of marriage and divorce. A sort of comical mess. Very good acting could not be in such a relationship to come to the fore.The relationship between the character's flighty, irrational and vague. Pretty good dialogues bring us a slight sense of satire and the ones somewhat rescue story. Several exciting and comic scenes in a fairly straight story is not enough. The place is incredibly poorly done. I can not say that this film is a failure. It is simply not accurate, being forced into it, and as a result the event is not specially funny.Claudette Colbert as Geraldine Gerry Jeffers is the wife who her husband wants all the best. She leaves him and in good faith goes in search of a rich man. Colbert tried to get the most out of their roles. She is beautiful and charming. That's quite succeeded. But that is not enough. Joel McCrea as Tom Jeffers (alias Captain McGlue) is a man who runs for his wife. Joel looks puzzled and indifferent. Mary Astor as The Princess Centimillia (Maud) and Rudy Vallée as John D. Hackensacker III in the roles of millionaires have a great time.Simply, I was not thrilled. From Sturges I expected a lot more creativity and spirit."}, {"id": 88, "text": "Warning: you need to be able to deal with situations/beliefs that would be appalling today. This is very much a movie of its time.You'll enjoy the movie if you can: -Temporarily, ignore the racism of its portrayal of African-Americans as buffoons/simpletons - Temporarily, ignore the gendered assumptions that women are a bit illogical, a bit too fond of clothes/jewelry, etc. and that women should use their bodies/sexuality for gain. -Forget there was a war going on at the time --that most people were rationing while this woman bought thousands of dollars worth of clothes in one trip... for example, a $385 jacket &amp; a $310 dress (at a time when breakfast was .35-.75 cents &amp; a taxi ride cost .60 - so that's probably the equivalent of a $4000 dress now!)It's an incredibly silly movie. Don't try to analyze the plot. Try to ignore how ridiculously simplistic, sudden &amp; non-sensical the ending is (though it SORT OF helps explain the interesting but confusing opening credits).It's your standard screwball comedy that tries to spin a romantic love story on the idea of divorcing for love. The dialogue (by Preston Sturges who also directs) is quite sharp and witty and makes the movie enjoyable (despite it's flaws). Colbert &amp; McCrea are good at what they do and work well together.So if you like this sort of thing, (the genre, the actors, the director, etc.) - you'll probably enjoy this film. Certain quotes, certain prat-falls are so amusing it's worth putting up with the flaws."}, {"id": 89, "text": "...that I spent the rest of the film trying to figure out what the first two minutes meant? The very first part of the film shows a mute hoax in progress as one twin has tied up the other and proceeds to the wedding of her bound and gagged sister. She apparently loves twin sister's fiance.Then we cut away from that scene and are inserted in the same couple's marriage five years later. Tom (Joel McCrea) has not been making it in business, and he and wife Gerry (Claudette Colbert) are about to lose their Park Avenue apartment. They have very nice furniture and clothes, and I wonder, if they have not really hit the big time, why all of the trappings of wealth which they obviously cannot afford. This is never explained. A stranger benefactor gives Gerry 700 dollars so she can pay off all bills and rent and have enough left over for the beauty parlor and some new clothes and an evening out with Tom.The sudden infusion of cash has Gerry thinking that she is only a drag on Tom. That he could live much more cheaply without her, and with her beauty she could get a new husband - a wealthy one that would be likely to help Tom in business if she were presented as Tom's sister. So she heads to the train station without a penny, and says she can get to Florida - where the millionaires are - purely based on her looks. Yikes! What a poor self endorsement.The rest of the film is Tom in hot pursuit of Gerry, who does finagle a train ticket, and even runs into an eligible eccentric millionaire on the way, Rudy Vallee as J.D. Hackensacker III, one of the richest men in America. So J.D. is in love with Gerry, and JD's many times married sister takes one look at Tom and wants him to be her next ex-husband. Gerry has everybody believing Tom is her brother. So all is well. Or is it? You see JD has all of the sex appeal of an old bedroom slipper. Vallee, who was always stiff before the camera, has his stiff school marmish persona working for him here to great comic effect. And Mary Astor, as JD's sister, steals the show as a woman who loves to live large. She is like the ghost of Christmas present.So about what happened in that first scene? Forget about it. No explanation is ever given. The film itself has wonderful laughs, dialogue, and is just beautifully shot. And one thing you might forget - this film was made just immediately before Pearl Harbor. So it is a snapshot in time of a very brief period when Americans had put the Great Depression behind them and did not yet have any clue that war was headed right for them. Highly recommended."}, {"id": 90, "text": "When Preston Sturges was in his prime (1940-1944, with 'The Great McGinty', 'Christmas in July', 'The Lady Eve', 'Sullivan's Treavels', 'The Palm Beach Story', 'The Miracle of Morgan's Creek' and 'Hail the Conquering Hero') it made for one of the best golden years/prime periods for any director in my view, where five or more very good to masterpieces in a row were made close to each other. Of those seven films mentioned, the top two for me are 'The Lady Eve' and especially 'Sullivan's Travels'.'The Palm Beach Story' is not quite one of the best from this period and not on the same level as those two. It is still a very good film though that has a lot of what makes Sturges at his best such a good director and writer. Well worth sticking with, because it really does get better, if one finds themselves put off by the early scenes where 'The Palm Beach Story' is at its weakest. Being somebody who always aims to be fair watching and reviewing films, and this is including watching the whole film before passing judgement, will admit that the early scenes left somewhat of a false impression on me. Having heard nothing but great things, and who really likes Sturges' work and the cast, decided to keep watching with the gut feeling that it would get better. And it luckily did.Reasons for not being crazy about the early scenes of 'The Palm Beach Story' are that the pace lagged somewhat, tedious at times even, and the opening credits are a head-scratcher. Although likely intentional, Claudette Colbert and Joel McCrea seemed somewhat cold in their chemistry together, the latter at first coming over as stiff and stern.Some of the comedy early on felt over-played and stretched to the limit, not being as funny as ought.However, there is so much to recommend. It's beautifully filmed and adroitly directed by Sturges with just the right touch of light sophistication while with enough punch to stop it from veering into fluff. The story is lively and compelling much of the time with a lot of charm, it is absurd in places but endearingly so rather than insultingly so, also never too cluttered or simplistic. The script is typical Sturges, razor sharp, witty, slyly cynical and sophisticated. The dialogue given to Mary Astor and Rudy Vallee is absolutely priceless at its best.Vallee's musical number is a memorable one and didn't feel out of place. The cast sparkle, McCrea becoming much more comfortable as he grows into the character, and in doing so the chemistry between him and Colbert becomes warmer and the writing for him, while never as quotable as the others, lightens up. Colbert is an absolute delight here throughout, radiating charm and wit and she is always at ease doing it. Vallee and Astor are hilarious scene-stealing support, Vallee having most of the film's best lines, and Robert Dudley enjoys himself.Overall, very good film that falls short of being great due to an unsettled start. 8/10 Bethany Cox"}, {"id": 91, "text": "F. Scott Fitzgerald told Ernest Hemingway the rich are different from you and me. For Preston Sturges, different hardly covers it. In his The Palm Beach Story, they are out of their minds.Rich people can't wait to give Geraldine Jeffers (Claudette Colbert) their money. Sure, she's beautiful, but she's also married to the possessive if indigent Tom (Joel McCrea). Deciding that he's better off without her as a milestone around his neck, and that she's certainly better off finding more crazy rich guys to give her dough, she leaves for a quickie divorce in Palm Beach, Florida, with Tom in hot pursuit.Perhaps Sturges' dizziest comedy, Palm Beach Story is a clever, grown- up entertainment, feet quite detached from the ground. Just imagine how the Paramount brass reacted after screening the first two-and-a-half minutes of this, a galloping credit sequence having nothing to do with the plot of the next 80 minutes. It's certainly amusing, but even knowing what Sturges was setting up here doesn't make me sure it was the right approach.Sturges is called the anti-Capra for the way he played with the Frank Capra formula where little people win against the mighty with equal parts pluck and sentimentality. If Capra was the enlightened communitarian, Sturges was the eccentric patrician, and Palm Beach Story his paean to capitalist endeavor at its warped and wackiest.The capitalists with whom the Jeffers come across are a cross-section of craziness that proves money talks loudest when it makes the least sense. There's the Wienie King (Robert Dudley) who gives Gerry $700 and a warning to lay off his product if she wants to live longer. There's the Ale And Quail Club, who gift her passage to Florida on their train and then scare her away by holding target practice in the club car. Finally, you have the Hackensackers, a brother and sister whose oil fortune has completely divorced them from any practical reality, and who settle upon the Jeffers as ideal companions for their cloud-cuckoo land.As John D. Hackensacker (Rudy Vallée) tells his sister (Mary Astor), You know Maude, somebody meeting you for the first time, not knowing you were cracked, might get the wrong impression.Whimsy predominates over everything else in The Palm Beach Story; the one quality everyone possesses equally. I like peace but I ain't morbid about it, is how a cop warns Tom to watch his step. Thanked for his chivalry by Gerry, a ticket attendant replies: Anytime from 8 to 12.Watching all this zaniness is pretty charming, even if the story it decorates is somewhat undernourished. Neither Jeffers is that engaging as personalities go; hard enough as it is to believe, the richie-rich Hackensackers come off more vulnerable and worth your time, what with their personality quirks and their weird need for love.Sturges' taste for story detours is on full display here; the Ale And Quail Club taxes your patience with non-stop singing, barking, and shooting, not to mention all the Sturges stock players putting in their appearances. Sturges found William Demarest funny for some reason, giving him center stage in the movie's trailer. At least his part in the film isn't so much as that.But what a clever ending, all the more so for being so utterly random! There's a line of thinking that The Palm Beach Story is screwball comedy, but it's way beyond that to me. Sturges throws so many balls in the air there's a bit of wonder when he manages to catch a few.The object is entertainment, and it succeeds in that well enough. It also seems there's a lesson about capitalism tied up somewhere, that leaving people to make their own ways in life is the best course to take, no matter how mixed up they are. Does it work in life? No idea, but it certainly seems to here!"}, {"id": 92, "text": "If Preston Sturgis did nothing but Sullivan's Travels, he would have lived purposefully.Everything else is annotation. This is not a good movie: an unfunny screwball. But it is interesting as heck if you know Preston's story.Our hero is an inventor that can't make good. His wife exists purely to provide sex. She's unabashed and single-minded about this and from her perspective that's the way some girls are meant to be.He won't let her use her sex appeal to his financial advantage, so she decides to leave him for more moneyed pastures. In due course they fall among an ultra wealthy family, where wifey succeeds in turning her sex into cash, big cash.Sturgis was an inventor, a rather successful one in terms of ideas but not money. In fact, his entry into movies was because of his failure in this regard. He was also famously obsessed with sex, sort of an earlier Warren Beatty in town. He was able to concoct stories that allowed him to mingle among the rich, as depicted here.Our sexy wife has some nice gowns. But there has a been a whole vocabulary of cinematic sex appeal that has been invented since then that she lacks. And all the regular conventions (the Clara Bow, Lana Turner model, lets call it) weren't followed either. She expects men will react to her raw appeal. But we the audience don't. Can'tTed's Evaluation -- 2 of 3: Has some interesting elements."}, {"id": 93, "text": "I normally like Claudette Colbert, which is what lead me to watching The Palm Beach Story, although based off of it's synopsis I probably wouldn't have selected this film if it wasn't for her being involved. The opening sequence was bizarre and confusing, I didn't know what was going on other than that a couple was married and it wasn't meant to last. I assumed the lady in the closet was actually a bridesmaid trying to prevent Colbert's character, Gerry, from being married. There was almost no context, and the explanation at the end of the film doesn't make it any clearer, it just feels cheap and lazy, like they wanted to wrap the film up but didn't know how. The screwball scenes aren't terribly funny. I thought the Weenie King was kind of charming, even if his scenes dragged on a little, but the train scenes are brutal and Astor's motor mouth character just comes off as obnoxious rather than eccentric. I feel bad for Hackensacker, the millionaire, whose kindness and naivete leaves him an easy target for gold digging Gerry, who often comes off as bratty and selfish. Her soon to be ex husband, Tom, is wooden and there's very little chemistry between the two actors when they're on screen, so the romance just isn't believable. Despite decent set design and lavish dresses, I didn't like this movie for the script, it might appeal to some but I would highly recommend Midnight over this."}, {"id": 94, "text": "THE PALM BEACH STORY (Paramount, 1942), written and directed by Preston Sturges, may possibly be the studio's answer to THE PHILADELPHIA STORY (Metro-Goldwyn-Mayer, 1940) starring Cary Grant, Katharine Hepburn and James Stewart. While THE PHILADELPHIA STORY is a sophisticated comedy about divorce and reunion, THE PALM BEACH STORY is very much screwball comedy dealing with the same subject, only faster and funnier. Under Preston Sturges' masterful direction, whose previous comedies, including 1941 releases of SULLIVAN'S TRAVELS and THE LADY EVE, have become true classics, THE PALM BEACH STORY, starring Claudette Colbert and Joel McCrea, is another comedy classic, in many ways, par excellence. With Colbert and McCrea having worked earlier in a melodrama about mental illness titled PRIVATE WORLDS (Paramount, 1935), many of the scenes for their second and final union on film are not only superb, but nearly stolen by its supporting players of Mary Astor and Rudy Vallee in exceptional performances.The film starts off with the opening credits super imposed over the prologue as a French maid on phone with minister at the church awaiting for the bride and groom to arrive. As the titles roll with freeze-frame, Colbert's character is seen bound and gagged in the closet while her other character (obviously her twin sister), in a bridal dress, runs off by taxi to her wedding event, also revealing the actions of McCrea's character also rushing to the church. They finally get together, kneel down as the minister performs the ceremony. Lettering soon hits the screen reading, And they lived happily ever after. Or did they? Moving forward from 1937 to present day 1942, plot development opens at 968 Park Avenue in New York City where the apartment manager (Franklin Pangborn) walks with an elderly couple (Robert Dudley and Esther Howard) through an apartment of tenants about to be vacated for non-payment of rent. The old man, known as The Weenie King, a self-made millionaire, meets with tenant, Geraldine Gerry Jeffers (Claudette Colbert). After learning of her financial situation, he offers her $700 to get her out of debt. Her husband, Tom (Joel McCrea), a struggling civil engineer trying to interest clients on his suspended airport project, misinterprets his wife's story on the money offer by this old hard-of-hearing man who happens to love birds. Tom is also surprised to learn that Gerry feels she's been a burden on him and wants to get a divorce so he can become a success on his own. As much as he still loves her, Gerry leaves for Penn Station for the next train to Palm Beach to get her divorce. Without money, suitcase and train ticket, Gerry becomes a mascot to millionaire members of the Quail Club, leading to her acquaintance with John D. Rackensacker III (Rudy Vallee), one of the richest men in the world, sleeping in a lower berth. In the meantime, Tom, having met with the Weenie King who learns of his situation, is offered enough money to go on the next airplane for Palm Springs and get his wife back. As John has helped Gerry financially with a new wardrobe, he hopes to marry her after her divorce. Situations become more complex with Gerry's surprise visit from Tom in Palm Beach. Having already made the acquaintance of John's oft-married sister, Princess Maude Centimillia (Mary Astor), Gerry passes Tom as her brother so he can go with Maude and she with John, followed by unexpected results. Others seen in the cast are Preston Sturges stock players as: William Demarest, Robert Greig, Roscoe Ates, Dewey Robinson, Frederick Snowflake: Toones, J. Farrell MacDonald, Alan Bridge, among others.Aside from being one of Colbert's top comedies, with McCrea in his usual straightforward manner, Rudy Vallee, former singer on radio and movie musicals, begins his long range of stuffy character performances who goes by his moto, tipping is un-American. Vallee's character (coming 40 minutes into the story) is certainly worthy of a Best Supporting Actor Academy Award nomination, which he never got. Though playing it straight, he does manage to break into song in one scene for Good Night, Sweetheart, as a sheer reminder of Vallee's vocalizing days as The Vagabond Lover. Mary Astor, who gets the final half hour of the story, sporting blonde hair this time around, is exceptional in her offbeat performance as a chatterbox talker and flirtatious woman (having three divorces and two annulments) who goes after anything in pants. This is Astor cast against type, and she's great here. Sig Arno as Toto, Maude's bumbling rejected suitor, is also memorable, especially through his jealous facial gestures and pratfalls.THE PALM BEACH STORY is one of those certain comedies that can be seen repeatedly without any loss of interest. Clocked at 88 minutes, there's not a single moment of wasted material, making this comedy at its best. Formerly available on video cassette and once broadcast on American Movie Classics (1992-1998), the film, later available on DVD as part of the Preston Sturges collection, turns up often enough on Turner Classic Movies where it's been showing since 2002. Highly recommended viewing. (***1/2)"}, {"id": 95, "text": "Where do I start? The Palm Beach Story is absolutely hilarious. From the opening sequence set to William Tell Overture that doesn't get explained until the very end, to Mary Astor and Sig Arno's yitz and nitz, to Claudette Colbert hiding from the Weenie King in the bathtub, it's a nearly constant laugh fest.Preston Sturges' signature leading man, Joel McCrea, plays an architect whose dreams are never realized. His wife, the beautiful Claudette Colbert, knows the best way she can help her husband get ahead is by using her physical assets, so she plans to divorce him, marry a wealthy man, and get her new husband to invest in her old husband's business ideas. She travels to Palm Beach to find a millionaire, and on the train ride down, she meets tycoon Rudy Vallee. Rudy is smitten, but when Joel follows Claudette to Palm Beach, he's forced into pretending to be her brother-and is subsequently pursued by Rudy's sister Mary Astor, a flamboyant flirt not yet divorced from her latest husband and trying to shake off her latest boyfriend, the non-English speaking Sig Arno. Sound complicated? Sound hilarious? When you're watching it, it's not that complicated, and it is that hilarious.Included in Preston Sturges' hilarious screenplay-have I used that adjective often enough?-are enough sexual innuendos to choke Will Hays. In fact, the Hays Code rejected the script a number of times before finally allowing it to be made. Joel threatens to take Mary up on her flirting and make her say, Papa; it's incredibly clear that the bedroom keeps Joel and Claudette's marriage afloat; Joel holds a comforter around his bare bottom half at his apartment's elevator, making it evident he'd slept without anything on the night before, and Claudette actually gets to say the line, Sex always has something to do with it, without being censored. I have no idea why The Palm Beach Story isn't the most famous sex comedy of the silver screen, since it's so adorable, witty, and for the most part stands the test of time.A proper analysis of this wonderful film wouldn't be complete without a huge compliment to Irene's costumes. Included in this film is one of the most beautiful dresses I've ever seen in my life. Claudette wears a backless black lace gown with shoulder epaulets and a fanned-out, semi-bustle, and until you've seen it, you haven't fully experienced screen fashion. Also, Mary Astor gets pampered in a breath-taking bathrobe, splayed out all around her without a single wrinkle.Where else can you see such gorgeous clothes? Where else can money and marriage be thrown around lightly, and Rudy Vallee serenading out someone's window prompt the compliment, Oh, you have a nice little voice. And where else can Mary Astor manage to make the line, I grow on people like moss seductive? Watch this movie and find your answer."}, {"id": 96, "text": "This type of movies were very popular in the late '30's and early '40's. Lots of classics were made during that time period and lots of actors got launched to stardom, thanks to movies like this. However as far as '40's screwball comedies are concerned; this really isn't the best movie that the genre has to offer. Sure, it's all good and fun but it's just lacking this bit of cleverness and true hilarity.Blame the script for this. Mostly these type of movies are brilliantly constructed story-wise and its main characters stumble from the one odd and hilarious situation into the other. Same is also the case with this movie but it just isn't quite all as hilarious and well flowing as you would expect.Some sequences are too long and too often the movies stays too much at the same place. This is the foremost reason why it feels as if this movie isn't always flowing that well. As an indirect result of this, some characters feel like they are being used, while others feel like they are being overused. The story often feels like it could had made its point earlier and reached what it tried to achieve much earlier. Because of this it takes awhile for the story to really get off the ground.Sure, it's still a fun and entertaining movie to watch though. It's nothing too hilarious but good enough nevertheless for more than a couple of laughs. The fans of the genre will therefore also not be disappointed with this movie. Guess I'm just not Preston Sturges' biggest fan when it comes down to his screwball comedies. I also thought his other acclaimed screwball comedy Sullivan's Travels, which he made one year prior to this movie, is a tad bit overrated.Both movies also star Joel McCrea, who wasn't the biggest actor within the game but he nevertheless is a great leading man, with also the right psychics. Not really sure why he never really truly broke through like an actor. He's mostly known for his work in some early westerns.It's all good and fun but there are some better genre movies to watch out there in my opinion.7/10http://bobafett1138.blogspot.com/"}, {"id": 97, "text": "The Palm Beach Story (1942) was written and directed by Preston Sturges. The movie stars Joel McCrea and Claudette Colbert. It co-stars Mary Astor and Rudy Vallee.Sturges was a good director, who specialized in screwball comedies. McRae was a solid leading man. Colbert won an Oscar in her career. Rudy Vallee was a great crooner and a good actor. Mary Astor had just starred in The Maltese Falcon. It should have been a great movie.The only problem is that the film isn't funny. It's dumb. It's flat. It's boring. I literally didn't laugh once during the entire 90-minute length of the movie.The Palm Beach Story has an extremely high IMDb rating of 7.5. This is one of those situations where I ask myself whether the other raters saw the same movie that I saw. I rated it 5. I only gave it that because Rudy Vallee sang well, and Claudette Colbert looked great in the fashions of the day."}, {"id": 98, "text": "This is a splendid film. Very classy and captivating. Claudette Colbert and Joel McCrea star as a struggling couple Gerry and Tom Jeffers. This movie was truly outstanding, very intriguing storyline, good cinematography, great lighting and remarkable cuts. The faster pace of the cut sequences are really what brought this film the extra mile. For this time period sequencing multiple angles and cuts all into one continuous film was very difficult, however this movie pulled it off well. Most former films from the 30's and 20's have a very slow and plain style of cutting and splicing shots together continuously. This film really started experimenting with moving the camera by simply shooting multiple different angles and using them to create multiple cuts which is primarily how contemporary narrative films operate. You must see this movie and when you do, notice how the film has not only faster, but many more cuts then most films prior to 1942. So with that being said this movie had a very rich and much smoother flow. You can seriously see the positive progression That film is making, both in front and behind the camera."}, {"id": 99, "text": "In the '40s Sturges was compared to Voltaire, but he's got at least as much in common with Petronius. Their target is Bad Taste and since everything is vulgar from someone's point of view it's open season. In this one, as ever, everything gets it: marriage, divorce, the rich-- and their parasites, furniture, food, shoes, public signs, the Deus Ex Machina, Happy Endings, THE WOMEN (the running off to buy a divorce), slang, stupid jokes, even jewelry. Two choice bits: the lady vulgarian's doubled-up rope of jumbo pearls turns out to have a clasp-- and flanking her bed are a pair of 'Negro lawn ornament' statues in Greco-Roman costume. (Some of the props from EASY LIVING are also here-- like the censor-proof Greek Bust in which the model is covering up her breasts.) Every Sturges film was also a satire of those ever recyclable Hollywood Formulas. This one goes at all those Marriage Movies in which a Self-Sacrificing Woman pretends to be somebody else or makes up some scheme in order to win her husband over all over again. One kicker is that the sap is a parody of a real person (Rockefeller III). Another is that in this one it's the idle woman who's bored with her hard-working husband and it's only sex that keeps them together. She sets out to leverage the most of hers (You know, The Look) to help him earn the living she deserves so she can go back to living on it. Sturges, who had his own marriage woes, doesn't bother to stop short, or anywhere, in the satire of the fair sex in this one.This film didn't knock me out the first time I saw it. I should have waited. A few viewings have convinced me it's even better than THE LADY EVE, although it's a lot more uneven. (There is a scene on a yacht that goes on too long). It has more witty nonsense in it than any other Sturges film. And more improvised patter (once a basic skill for movie comedians; Sig Arno's here is the best). The writing here rewards close listening-- because the breakneck overlapping dialogue of the early '40s is part of what's being satirized. McCrea, Colbert, and Vallee each get a whole screenplay's worth of talk. Mary Astor (the best thing in the movie) would get even more except she's only in the second half. Give it a chance, it'll grow on you, like, you know..."}, {"id": 100, "text": "Preston Sturges made the wacky comedy Palm Beach Story in 1942.Claudette Colbert and Joel McCrea are married and truly love each other but their problem is money, which isn't something new. She decides that they are not good for each other so she takes off for Florida, after going money from an elderly wacko who comes to rent her retirement.McCrea gets the money to follow her from the same source. She obtains her ticket for Florida from wealthy drunkards whose debauchery becomes memorable in a drunken scene where they shoot up one car.Colbert meets Rudy Vallee on the train and he is endearing as ever. His sister, a wacky constant divorcée, played fabulously, in a totally comedic turn, by the usually dramatic Mary Astor. She falls for McCrea who is then past off as Colbert's sister.From the time of the train ride, the film descends into inane lunacy.Look for dialogue such as Astor saying that nothing is permanent except Roosevelt. After all, he was into his third term.Look for a brief part by veteran actor Robert Warwick. 5 years later, he would play Irving Weisman in Gentleman's Agreement. You remember Irving? He didn't want the anti-semitic story run as he wanted the Jewish people to handle anti-semitism themselves."}, {"id": 101, "text": "Writer-director Preston Sturges' The Palm Beach Story (1942) posits that people are so unused to good fortune that when it's dropped right into their laps, they have no idea what to do with it. And those people include the movie's audience.The movie begins with a whirlwind sequence of exposition (set to a cockeyed version of The William Tell Overture) which seems to explain absolutely nothing. It's Sturges' nose-thumbing at movies which have nothing *but* exposition. He seems to be saying, Must we explain everything from the get-go? Have some patience on this trip, and I'll get you there. Soon enough, we meet Tom (Joel McCrea), a frustrated construction designer, and Gerry (Claudette Colbert), his equally frustrated wife. They live in a posh apartment but are constantly dodging bill collectors, until Gerry's chance run-in with a meat mogul known as The Weenie King. (You think that's flouting the censors? Wait until you see Sturges' The Miracle of Morgan's Creek [1944].) Gerry tells The Weenie King of her financial plight, and he gives her a wad of money to help her, just because she's so darned cute. (Once you see Claudette Colbert, this will seem a little more plausible.) Far from feeling relieved, Tom is displeased that Gerry can solve their financial woes with only a little flirting. Gerry counters that everything in life is about sex (Note to censors: Flout-flout),and eventually she leaves Tom to set out on her own, solely to prove that she can get whatever she needs whatever she needs in life just by being a woman.It's never shown whether Gerry proves this to herself or not. But along the way, she meets some memorable characters: the members of The Ale and Quail Club (headed by Sturges veteran William Demarest); an oft-married millionairess (delightful Mary Astor) and her foreign-speaking boyfriend of the moment; and a soft-spoken yachtsman (Rudy Vallee), who patiently endures Gerry's systematic breaking of his every pair of pince-nez's. All of these people love to talk, and Sturges obliges them with enough epigrams for a swank New Year's bash.And for those who think Sturges couldn't direct as well as he wrote, I recommend the scene where a tipsy Tom and Gerry discuss their impending divorce. The scene begins with Tom trying to unzip the back of Gerry's dress for her, and it ends as one of the swooniest love scenes it has ever been my pleasure to witness.And just when you think the movie has run out of steam, Sturges pulls a happy ending out of his hat that has you laughing through the closing credits. Smart and smarter--now, *there's* a trend Hollywood should have pursued."}, {"id": 102, "text": "Funny enough, even for modern viewers. I am not and never will be interested in romantic comedies, however, this movie was entertaining enough to hold my attention throughout. Different style of romantic comedy than the one we're so used to seeing today. The screwball comedy lives up to the name with numerous gaffs and goofs throughout the film, I enjoyed it, though. Nothing too fancy with camera angles or lighting or any other special effects, just story and plot driven entertainment with an excellent twist! Not my favorite of an of the older films I have been seeing lately, but again the story is intriguing and funny enough to keep me interested. I'm sure it was a hit when it debuted in 1942, and as previously mentioned, today's viewers can still relate. Divorce is even more prominent today than it was at the time this movie came out! Definitely worth seeing.*Note- This movie came out after the code was enforced in 1934, and there were a few scenes I felt were almost provocative enough to garner attention from code' proponents. In the beginning when Tom has Gerry sit on his lap and he begins kissing the back of her neck. Also, toward the end Gerry is wearing a bit of a suggestive black dress which just seemed a bit, risqué, if you will for the time. Just some food for thought."}, {"id": 103, "text": "Preston Sturges' The Palm Beach Story(1942) explodes from the gate with a strange but funny overture montage and the main film quickly hits it's stride with the brilliantly funny performances in scenes between Robert Dudley as the Wienie King and Claudette Colbert as Gerry. Gerry's epiphany that while she and her husband(McCrea)share a great deal of love and affection for one another, they just don't make sense as a married couple. The comedic play between Colbert and McCrea is fantastic in their early scenes as Tom struggles with come to grips with Gerry's zany ideas on what a marriage should be and why they'd both be better off with other partners. Unfortunately the film loses a good deal of steam when Gerry escapes on the train to Florida and Colbert and McCrea are kept separate for large chunks of the film. The Ale and Quail Club members provide some good laughs but after sometime their antics become a bit stale. Rudy Vallee's uptight millionaire lacks the wit and the charm of McCrea's Tom and just doesn't provide a solid enough comedic foil to Gerry. The Princess' comedic mistreatment of Toto and Sig Arno's physical comedy provides some good laughs but it all seems a just bit out of place in the tone of the movie. The great chemistry between Colbert and McCrea saves the film but I would have much rather watched a film about Gerry, Tom and the Wienie King as neighbors."}, {"id": 104, "text": "I thoroughly enjoyed the Palm Beach Story. The acting was believable and it was fun and entertaining. Mr. Jeffers is a failing businessman, who's wife decides to leave him and head to Florida for a divorce, and in search of wealthy man to take care of her. Oh, and did I mention she does this with almost no possessions and no money. Almost instantaneously she meets one of the wealthiest men in the country, who falls for her. It all happened so quickly, I think it would of been a little more interesting if the plot was drawn out here. This is the aspect of the movie that was somewhat unbelievable to me. To think that Mrs. Jeffers can make it all the way to Florida with no money, instantly meets a rich man, its like everything just falls into place to easily. But I guess it could help make it entertaining .There was pretty decent verisimilitude in the Palm Beach Story, with the cast wearing expensive appearing costumers, on yachts and in expensive homes. There's a very interesting train scene involving a gentlemens gun club that is quite amusing and is sure to grab your attention. I was kind of surprised about how the topic of divorce was portrayed. So openly discussed, it made the practice seem common for that time. Its kind of like just head to Florida, get a divorce, find a rich man, like it was the norm. In the end the message that I took away from the movie is that love is more important than money. overall, a great love story, with just enough of a comedic edge to keep you amused!"}, {"id": 105, "text": "Palm Beach Story was directed by Preston Sturges in 1942. The film is comedy filled, laugh out loud funny. With the kick-off of the movie, the caption was, and they lived happily ever after\u0085or did they? Claudette Colbert stars as the leading lady, Geraldine (Gerry) Jeffers, who runs away from her husband in search of a millionaire socialite that can spoil her with attention and the good life.  As it is, her husband is a struggling architect and they are broke. The movie was not necessarily realistic. Some of the themes in the movie were love, perseverance, and humor. Gerry boards a train bound for Palm Beach and along the way meets up with the rich and famous socialite that she was hoping for. Her husband follows, and the humor kicks ups. She meets a brother and sister, and introduces herself and her husband as brother and sister. The end of the movie makes Gerry realize that she and her husband love each other and can't divorce. A new wedding happens, and the opening caption returns, and they lived happily ever after \u0085. Or did they? Colbert is a classy, stylish actress. Her acting made the viewer can't help but like her, even with her foolish moments. The writing and directing were both done very well. The movie flowed without any awkward moments."}, {"id": 106, "text": "The film The Palm Beach Story from 1942 is the epitome of a screwball comedy. It is meant to be a romance, but due to the Hayes code had to be turned into a comedy in order to comply to their rules and be recorded. The plot is simple, but made more complex as the film plays out. The Jeffers, a couple that seems to have been married for years and have many issues. The main one being that Gerry, the wife is unsatisfied with the money her husband, Tom, is brining home and feels that she is holding him back from reaching his full potential as a man. As Gerry goes to sneak out of the marriage her plan is to leave a note saying goodbye. She decides to pin it to the blanket and in the process pokes Tom in the rear. Gerry is a woman who knows that shes beautiful and plays off of that to get what she needs or wants from rich men along her journey. When she meets up with Mr.Hackensack this way of living increases to the extreme. You see, Mr.Hackensack is one of the richest men in the world. He makes a comment that Chivalry is dead when the who time she is using him for his money and he is seeking out a wife who knows who to knit and is good with children.This film is very well written with even better acting to help pronounce the romantic intensities that a married couple have. The Hayes code plays a dramatic effect in the creation of this movie and I think a good one. There are many ways to show what this movie shows, but if it wasn't for the Hayes code do you think that it would have been full of so much irony? Overall, I personally enjoyed this film; particularly Gerrys role. I laughed out loud and was shocked by the ending. This is a prefect example of a good screwball comedy."}, {"id": 107, "text": "Boy meets girl. Girl marries guy. Maid dies. This is the essence of this off-the-wall movie, as Gerry Jeffers (Claudette Colbert) divorces her husband Tom (Joel McCrea) to marry a rich man, Hackensacker (Rudy Vallee) The premise for leaving was based on Tom's lack of stable income, a common ploy that gives this movie a timeless and relevant quality to it. Not to mention there are several instances of hilarious sexual euphemisms - I may have to take you up on one of your dares and make you call me Papa, showcasing that the wit of classic comedy will always trump the crass and vulgar nature of today's farcical films.Hackensacker was a particularly hilarious character, with several memorable and chortle-worthy traits, including his compulsive need to write down every single expensive in his little black book, even though he's notably one of the richest men in the world.There were several elements of awkward humor that was far ahead of its time when Captain McGlew was introduced, allowing for a former husband and wife to watch each other try to get someone else, although, as movies such as this always end, there's a happy warm center. An enjoyable eighty-seven minutes."}], "reviews_amount": 108}