{"name": "Drumline", "titleId": "tt00303933", "reviews": [{"id": 0, "text": "Horrible. I'd give it 4 strokes if I wasn't so stingy."}, {"id": 1, "text": "Such an amazing movie that taught me how to become a man. Now I'm a certified double agent and it's thanks to this movie"}, {"id": 2, "text": "This movie does not follow proto. Nadav, you're done bud. Todd needs to adjust you with some drill sounding."}, {"id": 3, "text": "Can you tell me the speed limit out here my dear brother? Because those sticks were flying faster than Captain Marcel goin' down a mountain"}, {"id": 4, "text": "Just had my 10-12 benadryls while watching this movie. Only took four strokes and I still followed proto!"}, {"id": 5, "text": "If you're a cool guy try it out, I watched this around ahhhh 8 o'clock while feathering it. Nick Cannon keeps it high and tight. I can see why people who are tok'd enjoy it."}, {"id": 6, "text": "This is just amazing. Don't be stingy with reviews. You better believe I'm coming up in may! #ymh"}, {"id": 7, "text": "This movie did not follow proto at all.It was recommended to me by a guy who had a ton of trouble googling it for me, and told me to try it out. Turns out he was a TikTok.Main character thought he was a real Cool Guy. They did a lot of drumming but there was absolutely no feathering. 0/10 do not recommend."}, {"id": 8, "text": "I would have never imagined how groundbreaking this Nick Cannon film could be. It appeals to the Jewish community and tells the story of an underdog reaching the top of his percussion dreams. Keep them high and tight mommies! I'm Coming Up in May. Tata Soowoo #nadavsfavoritemovie"}, {"id": 9, "text": "Try it out! This movie follows proto. It is an inspiration to us all. Jeans are so high and tight and Nadev doesn't even have to keep googling. Garth and the Bodies don't appear until the sequel but I will keep watching and eating my moose soup"}, {"id": 10, "text": "Only when the remix of native vs iler has been made can this train wreck be considered a cult classic, needs to be 80% higher and 67% tighter. Also a lack of featherin' observed!"}, {"id": 11, "text": "Love watching nick cannon show me where it spits! Nadav is right, cinematic masterpiece. Keep it high and tight, and don't be stingy!!!"}, {"id": 12, "text": "Couldn't even last 4 strokes once I turned this on"}, {"id": 13, "text": "The lead actor should've been replaced with someone who has more charm , like The Award winning actor Fedsmoker , the female lead's jeans wasn't as high as I would like it to be, I'm hesitant to call the director the R word but he did a horrible job. Keep feathering it brothers."}, {"id": 14, "text": "A riveting story of courage and overcoming some of the biggest challenges life can throw at us. The film brought me chills. It spoke to me, as a person trying to make it in this bananas world out there. Thank you, Nick Cannon, for teaching us all how to beat the odds and that we can all be our own hero in the face of adversity. We can call dance to the beat of our own drum, and we can all create our own beautiful songs to carry us through this bananas life.The line that particularly spoke to me was I don't know what the beef is, but you better grill it up and eat it. Because it is my a** that is on the line. ... You really hit me in the core, Dr. Lee. You reminded me that it's truly essential that I keep it high and tight in this life, and that success comes with following proto.The Dude Abides. Nadav is Googling."}, {"id": 15, "text": "One of the greatest movies, I'm not being stingy. They really know how to feather it."}, {"id": 16, "text": "This movie really got my brain on fire. I loved the part when Nick and the boss worked on their 4 strokes rhythm, and when they ended it made a BahYahYah sound. Otherwise, it gets as many stars as strokes."}, {"id": 17, "text": "Google what makes a Movie Great?, Nadav! Better start following Proto if you don't want the stamp."}, {"id": 18, "text": "These guys followed proto from start to finish. It was a world wind from the get go, they couldn't stop feathin' it."}, {"id": 19, "text": "The fact that Nadav can't google sh** goes to show that his taste in music doesn't follow proto at all, and can't even come in 4 strokes. Even with 10-12 Benadryl this movies is like trying to use your lung disease as an instrument. If this movie was a sys gendered male's A*****e I definitely wouldn't be singing in the rain after watching it. You bet I'm NOT coming up in may!"}, {"id": 20, "text": "Taught me how to be a man and I'm a 29 year old woman 10/10"}, {"id": 21, "text": "This is the highest and tightest movie I've ever seen. I use this as a comparison for how good a movie can be, e.g Goodfellas is okay, but it's no Drumline."}, {"id": 22, "text": "I'm not a musician and know little about marching bands. However, this movie captivated my attention. The athleticism of these musical marchers was something I had never thought about until watching this excellent movie. The music is wonderful and the drumline competition puts the dueling banjos of yesterday to shame. The story line delivers a good message of how raw talent can be molded into disciplined success. The concept of teamwork and individual goals are blended into a believable and inspiring movie. I found the acting to be very good and will look for the cast in future movies. Nick Cannon and Orlando Jones never leave any doubt about the characters they are playing."}, {"id": 23, "text": "The only thing that would make this movie better is if it was it was Drumline. Heard there might be a sequel in may, cant waittt!!!"}, {"id": 24, "text": "One of the few times where black youths aren't portrayed as hoods, this movie proved it moved to the beat of a different drum (yes I know, bad pun). Anyway, I was pretty surprised by how well made the film was, considering there were no well known actors in the film besides Orlando Jones. This movie isn't just for band kids, it encompasses a broad spectrum of life that is actually interesting to watch. Sure, some might have considered this movie corny, but the band sequences saved any misgivings this film might have had. Watch this movie for the heck of it, because you might actually be surprised."}, {"id": 25, "text": "One of the worst movies ever made. Id rather watch someone deuce into my own mouth."}, {"id": 26, "text": "After Garth took my family this cinematic masterpiece is the only thing that brings me any happiness."}, {"id": 27, "text": "Drumline is a great movie for anybody to see.  I especially like it because I am a band nerd but that's ok.  I would like it anyway; it has it's funny parts, it's serious parts, and I am still wondering how they found so many awesome drummers, (and other musicians for that matter!)Because of this movie, I now have some respect for Nick Cannon as an actor. I'm glad he finally starred in a great movie for all ages, and is no longer confined to piece of crap kids sketch comedy shows on Nickelodeon, [which, by the way, SUCKS as of late (i.e. My life as a teenage robot, slimetime, ginger)]Overall, great movie, great job by Nick Cannon."}, {"id": 28, "text": "This movie taught me how to be a man. I thought I was flowing proto, but it gave me a stamp on the forehead. Now I've checked myself and let go of my hubris.Uhhhhhh hundred percent"}, {"id": 29, "text": "Native doesn't get most things right but he hit the nail on the head with this one. Drumline is a classic teen movie that has shaped the youth of the early 2000'sKeep it high and tight. Just take 10-12 Benadryl, sit back, turn on drumline and it'll only take 4 strokes to make some white.#teamdrumlineisgreat"}, {"id": 30, "text": "Drumline is quite a remarkable movie in my opinion, and not just because I am a musician &amp; former marching band student. Not everyone will agree with me, but I think the story is well crafted, the characters are very likable, and the film maintains the audience's interest throughout. The main character is Devon Miles (Nick Cannon), a hotheaded young drummer who has received a full scholarship at Atlanta A &amp; T University to play snare drum in the very prestigious marching band. Devon proves to be the best drummer on the line (even though he secretly cannot read music), but his overly inflated ego becomes a liability for him, particularly in his numerous confrontations with drumline section leader Sean Taylor (Leonard Roberts). Over the course of the season, Devon learns to curb his cocky attitude, and he and Sean become the best of friends as Sean helps him learn to read music.Highlights: At Devon's high school graduation, the percussion section in the concert band suddenly bursts with a funky rock beat (instigated by Devon) during the band's performance of I Believe I Can Fly. On the opening day of marching band training at Atlanta A &amp; T, we hear a couple of great renditions of When the Saints Go Marching In; a little later, the camera dollies backward across different sections of the band (whose leaders feel that THEIRS is the most important section in the band) before stopping on the drumline. Devon plays his audition piece flawlessly without looking down at the sheet music once; he then decides to add a little something of his own at the end. Bass drummer Jayson Flore (GQ) becomes furious when his roommate challenges him for his spot on the field and beats him; near the end of the season, the smartened-up Devon helps Jayson retrieve his spot. There is quite a bit of excitement in the air when the Atlanta A &amp; T Marching Band takes the field for the first time (I certainly remember how thrilling it was for ME in college marching out onto a football field for the first time in front of thousands of spectators); tension mounts as Devon unexpectedly duets Sean's drum solo and then takes over completely! The hip-hop stylings of the Morris Brown College Marching Band contrast Atlanta A &amp; T's Flight of the Bumblebee. And the final drumline battle between Morris Brown and A &amp; T at the B.E.T. Big Southern Classic is sheer cutthroat competition! Drumline is a wonderfully entertaining movie with flashy camera work for the numerous marching band performances. Watching the Atlanta A &amp; T band drilling, rehearsing, and shaping up over the course of the season is quite a joy, and for a musician like myself, this film is one that will never lose its appeal. Aside from the pivotal character of Devon Miles, one other character I particularly admire is Dr. James Lee (Orlando Jones), director of the A &amp; T Marching Band. Dr. Lee is a fine, straight-laced, hard-working director who deeply cares about the progress of his students and who continually strives for excellence. A majority of his instruction to the band has been part of my own instruction as a marching band student, particularly the concept that just ONE person's actions in the band can affect EVERYBODY."}, {"id": 31, "text": "Drumline tells of an Afro-Am high school grad and hotshot drummer who goes to college and learns it takes more than fast sticks to make the grade. Just okay as a light drama, this flick deserves high marks for making some positive points about the importance of rudiments and teamwork to success and for its tribute to, what is on most campuses considered un-cool, marching bands. What the film lacks in story it makes up for in marching band pageantry, music, and, most of all, percussion. A must see for anyone into marching bands and a should see for young people who dine on a steady diet of MTV and other entertainment junk food. (B)"}, {"id": 32, "text": "Only a degenerate gambler with a fear of home-schooled chiropractors would like this movie. You don't need to be a double agent taking cops' badges to know to give this a miss. Ta ta there..."}, {"id": 33, "text": "I got this movie for free on VHS with a promo at Falcon Car Wash by some Chomo with baby raper stamped to his forehead. He was missing some teeth but had incredibly feathered hair. When I got home I smoked a bowl of my own dandruff and sat down to enjoy what was possibly best movie I had ever seen in my life. It tells the trail of how Nick Canon just wants to play drums no matter what the cost. My favorite scene was when Nick said to his teacher Just let me Eat ya!, to which his teacher naturally gives in and cums in 4 strokes. This film bends the rules, doesn't follow proto, and isn't afraid to melt your brain on fire. I give this movie 10/10 benadryl (which i also took before watching). Do yourself a favor, don't be stingy and try it out."}, {"id": 34, "text": "I noticed a common thread in many of the reviews for Drumline on IMDb. Many said the same thing that Drumline surprised them and it was a good thing. I'm not sure many people ever think about a marching band being a true test of music like bands, or dancing, or rock singing and certainly you don't really think of it as competitive and yet out comes Drumline and changes all of that with style and flare. I know nothing about marching bands or American Universities for that matter (yes I am Canadian) so I don't know how much truth there is to the film but it just happens to be very entertaining, fun, touching, and well delivered all around. It's not perfection or award winning or a feat of film making and yet it seems to be something that everyone just sits down and really enjoys. One of the keys to music films is of course the music. The more I like the music personally...the greater the film...consider Dirty Dancing, or Mama Mia, or Hairspray but the odd thing about Drumline is that the music is not typical or any type or brand. They do play modern music with their marching band but the story is what keeps the film afloat and truly entertains.Nick Cannon is cocky but brutally talented Devon Miles. Cannon holds the role very well. He comes across as smart, and well spoken and talented but his character is very entertaining and has quite an arc to his story throughout the film. Zoe Saldana is Devon's love interest in the film. Saldana is a talented actress, I've seen her perform very well but other than being a love interest she doesn't really get a whole lot to deal with in her character. The character is under developed unfortunately but Saldana and Cannon make a good couple with great chemistry between them. Orlando Jones is terrific and gives truly a stand out performance as Dr. Lee, the leader of the marching band. Jones gives a moving performance and really gives the film nearly all of it's heart and power.Director Charles Stone III is seemingly new to the directors chair for Hollywood films but he seems to hold his own making a spectacle of marching bands. The sheer concept seems ludicrous and yet marching bands and the entire competition never seemed so exciting and entertaining. I am actually surprised that the film makers didn't decide to milk this film for straight to DVD sequels although there is still time. So if you're looking for something light hearted with some intense competition and yet something completely different from other films in the same genre this one is almost certain to entertain you. A solid film. 8/10"}, {"id": 35, "text": "This film is an awesome combination of a great hard-work story and amazing music. The soundtrack is one of the best I've ever heard, and John Powell's score is awesome as well. I was able to understand and care about the characters. The final drum battle is one of the most amazing things I've seen in my entire life."}, {"id": 36, "text": "It's about time someone focused on the Southern Classic Bands (half time). Millions of people faithfully support these bands because of their exceptional, explosive performances.  I think the movie does a brilliant job of capturing all the power, excitement and zeal of the marching bands. If you have attended the classics, you will appreciate this movie.  If you have never attended a classic, this movie can be a great introduction.  The movie does an excellent job of capturing the level of competition and the desire to win.  The drum line performance in this movie is awesome."}, {"id": 37, "text": "I have to admit, I bought this movie for my son, who is also a snare drummer in high school marching band.  I really didn't hold out much hope that I would actually enjoy this one at all.  But, oddly enough, I really did enjoy watching this movie.  I don't know why, but it kind of grew on me.  The acting was good and the story was good also.  Some of the scenes were a little predictable, but overall I would recommend this one."}, {"id": 38, "text": "For those who have ever marched snare, the talent on display in this movie is truly amazing. Aficianados can appreciate the tight flams, rolls, high sticking...but beware, the constant tug of war between the line versus showboating is nothing' but Hollywood drama because every experienced snare drummer knows nothing is sweeter than when ten snares sound like one because it only takes one weak link to muddy the sound.Did I pay attention to the rest of this movie? Well, no. So I can't honestly comment about anything else other than the drum line. But then again isn't this what the movie is about because that's what I'm all about!"}, {"id": 39, "text": "This movie was spectacular in every way.  From the music to the story line, I enjoyed every minute of it.  It will keep you laughing and is a winner and I think a lot of young people will be encouraged to seek secular education. Great job Dallas Austin!"}, {"id": 40, "text": "The best way to watch this film, particularly if you are an alumnus/na of a marching band, is to put the video on mute anytime you don't see people marching or dancing. Yes, like Dirty Dancing, the plot is a tired cliché, the dialogue pathetic, the directing embarrassing, the scene development/cuts jarring. But the moves, the moves. Omigod, when the bands take the field, it's gripping. As for those gorgeous girls and their gyrations, it's enough to send me to my chiropractor! I was half hoping that there was a real competition like the Southern Classic, living as I do just two hours from Atlanta, but alas, no such thing. As for watching drum and bugle corps in order to see real drumlines, sorry. They are military, wooden, and you'll forgive me, very whitebread--like this lady. Yes, DCI bands do more intricate footwork but those marimbas or glockenspiels whatever they are--icky plinkaplink. I'll buy this film, just like Dirty Dancing, but only for the music/moves sections."}, {"id": 41, "text": "If you are a person that actually can go to a movie and simply enjoy it for the fun and a new experience, then you will love Drumline.  It's a great movie that will enlighten many Americans as to the type of marching bands that have been the highlight of Historically Black Colleges and Universities (HBCU) football games for decades.  Do not go to this movie and expect to see the standard kind of band that graces the Macy's Thanksgiving Day Parade every year.  Be prepared to see and understand the concept of band according to America's HBCU's-  I guarantee, if you haven't seen it before, it will blow your mind."}, {"id": 42, "text": "This film had love, passion and heart with trials and tribulations that made all participants learn the meaning of discipline and respect for each of their responsibilities.  No one was more important than the other, and they all worked as a well-tuned machine.  What a great lesson to teach to people who have often forgotten what teamwork really means. Overcoming difficulties in relationships and life shows that we can mature beyond our shortcomings, and better our circumstances.Drumline had a plot with everything that a typical BLACK movie generally lacks.  What little violence that was in the movie actually served as a learning point that helped the characters mature and win at the end. There was love and romance, but not to excess.Suffice it to say that I give this movie 2 thumbs up and a kiss."}, {"id": 43, "text": "My mommy's employee native suggested it and I was very disappointed.sorry, trash....."}, {"id": 44, "text": "When my Jewish friend insisted that I watch this with him, I wasn't expecting it to be any good, but I was j-ing my d by the end. Honestly a forgotten classic!"}, {"id": 45, "text": "Drumline is a terrific movie.  If you have a background in marching bands or drum corps, you will appreciate this movie.  If you do not have a background in marching music performance, you will enjoy this movie.This is a movie that has character development, a unique plot - if somewhat predictable, and plenty of fun scenes of marching bands competing for bragging rights.  It's more than this, though.  It also captures some of the essence of the black university experience, although it's focus is understandably limited to those involved in marching bands.If you are ready for something other than the chocolate and vanilla too often encountered in today's American movies, don't miss Drumline."}, {"id": 46, "text": "This movie depicts the band of a Black University very well. The only thing I think this movie is lacking is the actual experience of the life on a black college campus. Otherwise, it was all around entertaining. I commend the writers, producers, and the cast of Drumline. It's a reminder to all those who attend a Historical known Black University."}, {"id": 47, "text": "I didn't go into this movie expecting my world views to change, and they didn't. I do have a better appreciation for the college level marching bands, though.But the lead performance just killed this movie for me. So smug and self-rightous to the point I wanted someone to smack him! But it never came. That all too familiar head sway, neck roll, and thrusting out of his jaw. Ugh. I never once rooted for him. The whole movie I was rooting for someone to take him down several pegs and teach him some common respect.And not once is he worried about losing his scholarship!!"}, {"id": 48, "text": "The movie looked good in its initial announcement, but choosing to make the movie about showbands was a major disappointment.  It would have been better about a true marching band that really works to put together a good show, not goes out and learns in a day or two how to get in the shape of a car or play as loud as possible with a bad sound.  The performance by Nick Cannon is abominable. A jar of jelly could have delivered a more riveting performance. Not only was Cannon a horrible actor, but he had the audacity to go on to Jay Leno and make fun of real marching bands. Real class act. All in all, don't see the movie, and if you do, don't think it is about marching band."}, {"id": 49, "text": "Why do people keep telling me to enjoy the music and not worry about the plot as if that's some kind of saving grace for the film? I'd probably have enjoyed some filmed performances of actual bands a whole lot more. If you feel a need to add some kind of plot to the genre, you really ought to make it plausible, even if you're going to make it formulaic and predictable. Spoilers coming between the stars.***OK. This young kid gets a full ride scholarship in music to a college. Nobody could tell he can't read music?!?!!!?!??! I'm sorry, but that sort of thing just trips my ohfergodsakegimmeabreak switch, and it ruins entire movies for me even if they were otherwise pretty good.Even getting accepted for training at a music school will require you to read a piece of music you will never have seen. The filmmakers, though, apparently want me to believe that he got a full scholarship to a music school without anybody checking that out? It might even be possible that such a scholarship could be given even with such a lack if the player is good enough, but it would certainly have been discovered prior to acceptance unless the school is being run by morons.There's even a sight reading audition where he apparently was given the music beforehand. WRONG!!!!! Sight reading means it is plopped in front of you, and you get maybe 30 seconds to look it over before you have to play it. There's even a good chance that it was written shortly before auditions. Sight reading is a test to find out how quickly one can absorb an unfamiliar piece of music. Any chance to prepare it defeats the purpose of the test. The only reason to do it the way this film does it is that the story writer wanted to have this undiscovered deficiency in the character. That's just plain awful writing.***So the plot if formulaic, predictable, and badly written. Maybe it's just me, but formulaic, predictable, badly written plots ruin my ability to enjoy the music. The performances were probably better than I thought they were because of this. That's criminal."}, {"id": 50, "text": "This is one VERY dumb movie.Clichéd, weakly scripted and an insult to the intelligence of a moron. Whoever persuaded anyone to put up money for this sack must be some kind of genius salesman (or woman). Cannon could not act if his life depended on it and the supporting players are not much better. I doubt very much that this movie was aimed at anyone with an IQ above 2-in that it succeeds. I can watch almost anything but could not watch anymore than 30 minutes. I only made it past the first 5 minutes because I could not believe what I was watching. Why do movie makers insist on pumping out this rubbish is totally beyond me - did it make any money? The public deserve better than this."}, {"id": 51, "text": "Exceptionally talented drumming which holds your attention for a half hour or so but after 2 hours your mind goes numb.......if I never hear another drum beat again it will be too soon.  Who on earth thought to make a movie of such a load of drivel.  I was expecting a tongue in cheek comedy. I could not have been further from the truth!"}, {"id": 52, "text": "I thought it would at least have a good beat, but it didn't even have that. And the overly slick camera tricks were not enough to save this director who was clearly trying to overcompensate for a lack of ability to JUST TELL THE STORY.Bad movie, bad directing, abysmal dialogue."}, {"id": 53, "text": "why complain about the show....the storyline was decent, the characters weren't perfect but what movie is? Drumline was a tight movie, can't take that away from the directors or the cast. Good show, all the critics make your own movies and talk about them. Much love to the cast and directors."}, {"id": 54, "text": "Watched this one the other night due to poor boredom. Well i was supprised a film about American marching bands you must admit sounds like a yawn fest.... Well i gotta say there is some serious Drum Action in here and the story lines not bad. All in all i was suprised as the 90mins swept buy quickly without a yawn ..... 7/10 from me"}, {"id": 55, "text": "A Bunch OF SPOILERS Ahead!!!First,  let's go to the beginning of the movie. Devon went to his father's job to disrespect him after his graduation. I know many students who disrespect their fathers for being crummy and don't invite them to their graduation. But after this scene,  there is a hole in the plot of the movie. Where were the boys coming from when they were on the bus in Atlanta? This was the scene where all the boys first met each other and said what instruments they played. This was the scene where the bus driver talks about how good Morris Brown's band was and disrespects Dr. Lee. Shouldn't they have known each other before the bus ride if they were coming from the same location?It was so funny seeing Orlando Jones play a serious role. Marching band directors are really perfectionists just like Dr. Lee portrays in the movie. Band practices are really torture and students are really really competitive! I played in the band for a while and I was in the orchestra for five years.But Devon getting a full band scholarship and not knowing how to read music is a made up lie! In my city,  you can't even make the 7th grade band squad without knowing how to read music. A college band student on a full band scholarship not knowing how to read music is like a college student on an academic scholarship not knowing how to read books! How can someone fool anyone like that for four years in high school?While I am on that subject,   when in was found out that Devin couldn't read music,  he should have been sent to the next plane home to NYC! When Devin was actually cut from the band,  he was still allowed to stay at the college. In real life,  he would have lost every dime of his scholarship, and he would have to clean out his room and sent on the next plane back home. No argument!The anger,  disrespect,  stuck up attitudes,   and competition were the only realistic things in this entire movie!This movie had such a predictable ending! Everyone should have known that Atlanta A&amp;T would have won the band competition. The main group always win competitons in all movies."}, {"id": 56, "text": "When it started I was like fawk! You guys are doing good!!! Come down for moose soup! But there's not much hardcore fun. Some of the actors, fedsmoker said, how'd you get a job here? You got to be Tik Tok'ed to 'preciate dis cherry bomb of brown. Ta Ta there, ya know what I'm sayin'?"}, {"id": 57, "text": "A guest of mine rented this movie recently. I hadnt really had a compelling desire to see it.  I have to say i enjoyed it more than i thought i would. There were some nice visuals, especially the quick motion shots of, I believe, Morris Brown's band invading the field like ants, and the twirling of the cymbals overhead. Some of the music and dance sequences were nice, some better than others. But the plot was somewhat trite and predictable, and the dialogue was mundane. Plus, I think that Spike Lee's School Daze and the television show A Different World gave large audiences a glimpse of black college life, so its not a completely novel subject matter. In other words, this movie was not an unpleasant experience but i wouldnt necessarily rush to see again"}, {"id": 58, "text": "I absolutely loved this movie!! I feel  there were fine performances by Nick Cannon as well as Orlando Jones. Surprisingly I only thought of Mr. Jones as comedy but he was able to pull off this dramatic roll in a serious manner which i truly admired. I also loved this movie because it reminded me of my college days of watching and listening to the bands perform. I felt it was well scripted,well performed and an overall enjoyable movie. So the plot may have been predictable but the characters involved allowed you to get to know them and experience their trials and tribulations and get a first hand view of the steps involved to gaining one band one sound. It displayed that it was not all glitz,glamour and booty shaking but it took real talent and dedication. So Yes I loved this movie and yes I will watch it another million times!!!"}, {"id": 59, "text": "*Spoilers* I don't see what people see in this movie. First of all, they make the character of Devon into this innocent talented boy so that the crowd would feel sorry for him, but whatever happened to him throughout the movie was his fault cause he couldn't control his attitude problem. Who can blame anyone else in the movie for his mistakes? Also, I was so surprised by the ending... NOT!!! The ending was more obvious than in any romantic love story. Rating: 1/10."}, {"id": 60, "text": "The person who said there is no sex in this movie must have been asleep when they showed the teams of dancing girls that front each of the bands. These young ladies wear skimpy two-piece outfits and heavy makeup, and they perform moves usually seen only in strip clubs. There's no way they could be more sexually explicit. I don't know why these colleges allow this to go on in groups that are representing their institutions. What kind of example does this set for the other students and the younger kids who idolize these bands? Are they supposed to be distracting the judges from the band's mistakes, or what? If these young women want to be part of the band, they should learn to play an instrument.The movie was pretty enjoyable because of the music, but I do agree that the behavior of the lead character was poorly handled by the writers. Still, it was worth seeing."}, {"id": 61, "text": "Good movie, I thoroughly enjoyed it. Orlando Jones was great and perfectly casted in this role. He should do more serious roles. Zoe Saldana (the chick that played Laila) is a looker. I want to see more of her in upcoming films. I gave it an 8."}, {"id": 62, "text": "Anyone who will attempt to critique this movie as a MOVIE needs their head examined cause its not that kind of film folks.This is basicly a thinly(and i do say thinly) disguised hourplus show down of how many black college bands do their thing during halftime at the football game.No one actually comes to see the game.Its the halftime show everyones waiting to see.As a former High School band sax player at Northside(North Atlanta) High,we always looked up to the local and out of state college bands for inspiration like Jackson State,FamU, TSU and many others.The movie plot was just thrown in their to get it classified as a film a bit more entertaining that the old fashioned style documentary.So if you come to see this film to see the bands shake their thang,you are in the right place.If you came to pick it apart as a film,you have just wasted your money. I was also pleased to see a couple of my friends from high school involved in the film Mr Aaron Bentley And Mr Miguel Gaetan. So,to all uptight in the rearend folks .STAY AWAY and to all the FUNKY PEOPLE check this out folks."}, {"id": 63, "text": "The most fun I have had at a movie in a long time.  Entertainment is watching these bands perform.  I hope the excitement and success of this movie will inspire TV NCAA sports coverage to include some of the halftime performances for a change."}, {"id": 64, "text": "Hackneyed script, but still good, thanks to the band sequences, which made for unique movie viewing; DRUMLINE didn't get that 75% positive rating at Rotten Tomatoes for nothing.And I couldn't disagree more with the comment displayed on the film's main IMDB page. Its main gripe seems to be that the main character remains the same conceited grandstander that he was when the film started. That's absolutely not true. (spoilers) If it were, he wouldn't have had anything to do with the band after he was kicked out of it, but he did some soul-searching and HUMBLY offered his services to them in another capacity, without expecting to be reinstated in the drumline. He was respectful to his girlfriend (if a little boastful and, later, sulky); he was eventually respectful to everyone. He didn't walk around wearing a placard that said I REPENT but I do think it was made clear that he did just that. And the people who opposed him were not portrayed as villains. Sorry, but it just wasn't like that."}, {"id": 65, "text": "This film was extremely well done.  It was entertaining and refreshing to see an urban film that has mass appeal.  I think Devon's character was cute and it was interesting to see how the character matured and developed.  I was also, thoroughly impressed with Orlando Jones' dramatic acting ability. I am recommending this film to all of my friends and encouraging them to take their families...I DID and we all LOVED IT!!!"}, {"id": 66, "text": "I thought Nick Cannon was very good.  Orlando Jones did extremely well in the first serious role I have seen him in.  It was very good!  A side of college life that I never knew existed. I will be going to see it again."}, {"id": 67, "text": "I played in a historically black college band(Johnson C. Smith University 89-93), so I can be very critical of a lot of details in the movie.  What happened however, was a nostalgic trip I liked very much. The writing was, decent, not great, and some of the acting performances were good(Nick Cannon, Leonard Roberts, Orlando Jones, and J. Anthony Brown's small part as a rival band director) The overall look and feel of the movie was outstanding.  I did not get bogged down and it hit all of it's points well. I saw it twice. Once with some fraternity brothers Kappa Kappa Psi, and once with my daughter(After I determined the movie wasn't too adult for her). We had fun BOTH times.  The crowd laughed and cheered throughout the movie. This movie was 2 hours and 10 minutes long, but it felt like a half hour. Time flies when you are having fun."}, {"id": 68, "text": "I was a former high school band member and I have always enjoyed watching black collegiate bands perform and watching Drumline was a truly wonderful and entertaining experience!  From the drum majors, choreagraphy, music, band directing, and sheer athletic ability to the actual dueling drumline competition.  Orlando Jones was great as the infamous baton-wielding band director Dr. Lee.  I liked how his character had an appreciation for the classical, contemporary and crunk style of music because that is what school band music is all about."}, {"id": 69, "text": "This was one of the best movies of the year. Nick Cannon did an excellent job. I can see this movie for a second, third, fourth time. It is a wonderful movie to take the whole family to see. Any age group or ethnic background will enjoy this movie."}, {"id": 70, "text": "Ok, so maybe this movie is not about a true drumline experience, but I've never seen so many people at a theater to see a movie with a plot like this. It was extremely entertaining, and it is safe to say that African-Americans generally don't support movies about things like this, but so many of us were out to support this one.  I think that it was very entertaining and the music was to die for, and I've got to get that soundtrack.  Go see it. This movie is VERY entertaining and you will enjoy every minute of it."}, {"id": 71, "text": "No matter what the critics say or what anyone thinks of this movie, it was the best I've seen in long time. I felt so good walking out of the theater after seeing it. It was fun and it was a good family movie. My 11 year old loved seeing it.The movie was packed here opening night, and the audience was a good mixture of all races."}, {"id": 72, "text": "Having attend a HBCU and traveling with quite a few football games around 20 or so in my work i find this movie very entertaining and true too form. Not too give away the movie but the main chataceters problems are more common than you think in a band.   Nice too see ATL again i miss the AUC (where it was shot) what is funny everything shown in the movie truly is or was in my day how we did it down too the Fish Fry in the dorm room small as they were.. LOL....  Even the Hazing touches on part of the going ons of being a band memeber it may not be like that for a White schools but i found in most blk colleges to be the case.. i plan on seeing it again and will bring friends.nice change from rappers who can't act holding guns throwing out a bunch of 1 liners."}, {"id": 73, "text": "This was an extremely awesome movie. I think that people who are involved in bands and drum corps everywhere should appreciate that someone actually had the thought of making a music-related film. The only turndown was that it was mainly a black, or ghetto movie, I'm not prejudice, but people of all different races and religions or anything like that can be in band. The plot required the people, but band is band, everyone's different. This has to be the best movie I've seen in the past year. People who don't know what goes on in bands wouldn't really appreciate this, so they shouldn't put down this movie. Overall, it was great and I plan on going to see it again and buying the video when it comes out and watching it religiously. Band is a sport no matter what anyone says. We do more work than football players, just think about it. Learning the music, learning sets and timing and everything else. This movie might just make all those jock-like people understand what band really is."}, {"id": 74, "text": "I use to be a part of an H.B.C.U. marching band.  I'm glad they came out with this movie so everyone can see what it takes.  A lot of people think folks in the band are nerds and geeks but we are not.  Eventhough this movie is rated as a comedy, it kinda shows how hard we have to work as well out on that field while we are performing."}, {"id": 75, "text": "For all those who had complained about the script I just don't understand. This is a simple story for a simple film. Nothing really deep to understand. Boy gets band/girl, boy loses band/girl, boy gets band/girl(somewhat)again. Along the way the 'idea' of community; 1 band, 1 sound; working with others, sacrificing individualism to a point, is necessary for the overall success of the band/group.  The music/band/drumline and marching bands were really the main story here. It doesn't go in depth with the characters as say Rocky did, another simple story, but scratches enough of the surface for you to understand. The story also honed in on staying true to yourself and your ideals.  The Orlando Jones character exemplifies this in his dealing with Devon and his handling of the school president and band.This is a film well worth seeing. A simple story worth the watch."}, {"id": 76, "text": "Possible spoilers below Overall, Drumline is watchable.  It's decent...I saw this at 11 am the day it opened...just me and 3 other people in the big theatre.  That was nice. I was excited to see this movie, being a percussionist and a big marching drumline fan myself.  The drum parts of the movie were good, tho they weren't done as well as the trailer made you think.  A few things about the marching band stuff was silly.  They were too militaristic in their teaching, which is something I have never even seen in drum corps, let alone college marching band.  They don't scream at you and make you run up stairs with drums- well, I highly doubt they do!  It seems to me that these kids are in college, yet I see no one in class or no studying, or anything else that could be construed as college work.  They seem to have band practice 24/7!  There IS one 30 second scene with Devon in a class (even tho it IS a music class.)  Another thing that was totally fake was the fact that Devon had no idea how to read music, yet after a few lessons, he knows how to read music and very well, at that.  Simple music is tough to read for a beginner, so the complicated rudimentary stuff in marching drumline music would be impossible to read without atleast a few months of study!  There is some music I still can't read, and I have been a percussionist for over 10 years! I also didn't like how they made this a black movie.  What was the point of that?  I mean...I guess I have nothing against movies that have only black cast members (seems like all gang movies are all black casts, and movies like brown sugar and soul food, etc...)  I just don't like this whole concept in general.  It appeals to a very limited audience.  They HAD to make the character someone who had had famil problems (no father.)  Why can't they make these movies and get the message across without the silliness?  Why do the characters always have to have a tough childhood, grow up in the hood, or have a family member who abandoned them?  It's an old formula that has been way overdone.   As for characters- Devon is awful.  He is in NO way redeeming in his traits.  He is a jerk throughout the entire movie, and like others have said, there's really no realization by him, and a change.  He just seems to become a different person magically overnight.  I think Nick Cannon did an okay job here, but his character is just so bad and unlikeable, who knows...The other characters are okay, but you don't get a very good feel for who they are.  They seem to not be drawn out very well.  Orlando Jones is really great as the band director tho. Another con- why is trailers trick audiences into thinking a movie is totally different than it really is?  When Devon auditions in front of the three guys in the trailer, his added part is much more powerful, accompanied by background music...and right after he plays it, you hear i thought i'd add a little something- something on the end...  Then, you hear a voice that says ah, yea...that'll work. They make it look as tho the band director and drum majors welcome his style, yet in truth- they cut out the line where the director gets upset and asks if he didn't like the selected piece...then the 3 guys talk about how he's a good player but his attitude is terrible.  My point is- the trailer was made to trick the audience into thinking this was much more of a comedy than it really was.  Don't change the whole meaning of a scene to trick the audience!  That's wrong if you ask me...and the actual scene in the movie wasn't as good as the trailer, which can't be good!  There are a few other scenes in the trailer that are twisted to make the movie seem different... In the end, Drumline is mildy entertaining, especially to fans of marching band music, and in particular, the drumline...but, at the same time, it's ruined by a bad script and a very annoying jerk of a lead character. 5/10"}, {"id": 77, "text": "The drumming and musicianship in DRUMLINE was awesome, but the story was everything that ROCKY and every movie since has been.  Upstart kid who knows he is the best can't understand why every one else doesn't accept the fact and acknowledge him.  He gets knocked down and picks himself back up with help from his former nemesis and proves to himself that he can be the best and part of the team.  Orlando Jones is great, a standout performance, different than anything else, I have seen from him.  Great music makes the rest worth sitting through."}, {"id": 78, "text": "I think this is one of my all time favorite movies.  Being a former Music Major and marching band member, I found the film to be very exciting.  I also found Dr. Lee to be very believable as a uppity college professor. He reminds me of one of my former professors.  I liked the fact that it was a positive movie for young people who think they can go to college with all of their talents and do as they please.  I think it taught a good lesson to any student getting ready to attend college on a music or sports scholarship: In the words of Dr Lee...You have to learn to follow before you can lead."}, {"id": 79, "text": "this movie has to be the WORST film i have ever seen in my life. what a SLEEPER. i was actually somewhat excited to see this movie because i am a big fan of orlando jones, but i was extremely disappointed with this movie. i saw it on the plan ride back from New York. let's just say that was the LONGGEEST plane ride ever because of this HORRIBLE movie. it literally was painful to watch. rating: -23948 out of +10"}, {"id": 80, "text": "Drumline is quite easily one of THE WORST films I have ever seen in my life.  Not even Hollywood is this bad.  Now, that is bad.  Several of the drumming battles were entertaining, but everything else in between is pure tripe.There are movies that are so bad it's funny.  But no, this movie is irritatingly so bad.This movie is PURE SH*T.  A pathetic excuse to showcase drumming.  There is absolutely NOTHING good about this movie.  Everything is bad bad bad. Especially Orlando Jones (WTF?).  I hope a piano falls on the director's head (note that I don't even want to remember his name).  Like now."}, {"id": 81, "text": "The first shock after seeing this horrible movie was to see that it has a rating of 5.5. I can't imagine people over 15 finding this movie worthwhile. The movie sucks, lasts for 113 minutes and then it is over. I think it would be better if it was 113 minutes shorter. I also think it belongs in the sci-fi section, the fact that people actually like the character Devon. He is a stuck up, cocky freshman and i hated him from the start with his i am so good attitude. And he couldn't act himself out of a bag. Since i am not American i don't know how the band thing works over there but seeing the training reminded me of the first hour of full metal jacket, and that can't be right. Do people actually take so much pride in beating a drum? Well to sum it all up, this movie sucks big time. As though bring it on wasn't bad enough. I am not sure that this movie even deserves a vote, so it will have to be a 1."}, {"id": 82, "text": "Went into the movie with a bit of curiosity on how they'd handle the drumline aspect (I didn't expect the movie plot to be any good anyway). It was entirely disppointing.  I've been out of a competitive drumline for 25 years, and I can still play better than they did.  The showdown was a crock. I doubt if that is what really goes on - it was all flash and little chops."}, {"id": 83, "text": "...Well i don't like them much. My sister was given this film as a gift for Christmas. The family decided to watch it together. I think each of us wish we had a brick to embed in our skulls afterwards. This film wasn't shot badly nor was it badly scripted, if your into marching bands that is, but it is incredibly bad if you don't care about this stuff. I'm sure there are a lot of people out there who could really enjoy this film and i don't mean to be offensive but I just did not enjoy watching this movie.If I was into marching bands it would probably get an 8. So....if you like marching bands watch it. If not, don't."}, {"id": 84, "text": "While the movie itself was interesting because of the love-interest and the competitiveness, it's not really that realistic if you want to think top bands. It gives you the impression that Cannon's band was the best possible in the country, most likely in the south. That may be, but I wish they would compete against even the U of M band, because this isn't like the high school band I was in, let alone the college band, which is more professional and military-styled than U of M's. To see their instruments drop low when they're marching, hearing poor tuning and the drumline not even being together? That's upsetting.B for entertainment. E for music and impressive showing of marching band skills."}, {"id": 85, "text": "I'm a drummer myself I'm gonna be in Marching Band again next year and this movie had no point to it at all, I mean I know he can't read music but you can't be in band if you can't read music.  No one I bet learned any of the instruments or anything!  This movie makes drummers look really bad and thats not cool.  Don't watch this movie you'll be wasting your time!"}, {"id": 86, "text": "Come the end of this movie, I still wanted to punch Nick Cannon's character wherever it would hurt the most. I REALLY disliked him. He was still just as arrogant in the end as he was in the beginning. On the other hand, I really wanted to give Orlando Jones' character a hug."}, {"id": 87, "text": "I mainly watch this movie for its drumming and nothing else, and for that it does deliver. you get some pretty good ful drumming and marching band scenes. maybe some of those scenes are heavily edited but overall pretty good. the rest of the story i saw as filler and didnt pay too much attention to. not that it mattered because the b stories are as basic as can be. so ye, in the end i was pretty happy. so in terms of a drum movie, pretty decent, as for a standard movie is really mediocre,6/10: got what i came for"}, {"id": 88, "text": "The basic story is of a band director who recruits a gifted Harlem street drummer to play in a Southern university marching band. The soundtrack is extensive, featuring numbers such as Funky Drummer/Devon's Revenge. Young adults may find this especially appealing. ---from Musicals on the Silver Screen, American Library Association, 2013"}, {"id": 89, "text": "Beautiful acting and directing!! Nick Canon and Orlando Jones are superb!! The storyline and the music are absolutely wonderful!!! I watch this movie over and over!!!!! My hat is off to all of the cast and crew! It put a lot of joy back in my spirit!!!"}, {"id": 90, "text": "I saw this years ago in the theater and watched it again recently. This movie was unexpectedly good and represented the college band experience very well. 'Nick Cannon did a great job in his role - truly embodying an angry teenager searching to fit in and becoming a team member."}, {"id": 91, "text": "Devon Miles (Nick Cannon) is a brash young drummer with a scholarship to Atlanta A&amp;T. He was raised by a single mom in Harlem. Dr. Lee (Orlando Jones) runs the program but he's very traditional under pressure to update his style to compete against a rival. Devon flirts with dancer Laila (Zoe Saldana) immediately. Leader of the drumline Sean Taylor (Leonard Roberts) is challenged by Devon's rebellious nature and his superior playing. It all culminates in a big BET competition.This is a pretty simple coming-of-age story against the backdrop an interesting African American subculture. Nick Cannon is great as the brash young buck and I didn't even realize that the love interest was played by Zoe Saldana until I watched it again recently. This follows a very traditional formula and delivers a very competent movie."}, {"id": 92, "text": "Nick Cannon(or Mariah Carey's husband) is Devon Miles, a talented drummer who graduates from high school in New York City, and is accepted into a mostly black college to play in a marching band. The leader tells him that he must learn to read music and to be a member of the team. He is arrogant and a show off, which causes friction with the rest of the band, and eventually, after a fight with a rival school's drummer, he is thrown out. Another school offers him a full scholarship to join their band and compete in a contest with his present school. The complication is a girlfriend, Laila(Zoe Saldana), who is a dancer and a classmate. After the usual confrontations, Devon rejoins the marching band, and leads them against the other college in a drum off, which is really well done and makes Drumline an exceptionally entertaining movie a 7.5/10."}, {"id": 93, "text": "Having read johnharrison-1 review, I have to agree completely. However, I have had some musical training, and have tried drums. Give me a Trombone any day:)I didn't get into this movie for about five or ten minutes, but once in, you could not get me away from it. I truly enjoy drums, from bongos to kettle, I like them all. The snair drum when played by someone who knows what they are doing, is really something to listen to, so, I guess you would say I enjoyed this movie. YES! Just wish I had recorded it, next time it comes around, I am going to get the soundtrack if not the whole thing. The finish of the competition is perfect. Buy or rent, you should enjoy this one. Loved the part where the Instructor learned a lesson."}, {"id": 94, "text": "I've always had a mild to moderate fascination and admiration of marching bands; especially the marching bands of Black colleges. That and boredom got me to watch Drumline. Drumline did nothing to hedge my feelings of marching bands. It did drive home a good message: preparation and hard work are more valuable than talent.Nick Cannon played a showboating, hot-headed freshman drummer now in college where things are a little different. More is expected from you in college, such as responsibility, maturity, and all of those other characteristics associated with growing up. Devon Miles (Nick Cannon) wasn't displaying any of that. So, the movie had a cliché story of growing up, learning important life lessons, and David slaying Goliath. It didn't really move me one way or the other, the movie was very average."}, {"id": 95, "text": "This movie was pretty good, but I have to say that it comes no where near showing how hard it actually is to make it in one of these bands. Try multiplying what you saw times 10 and you will get a real picture. I played trombone at Alabama State University, home of the Mighty Marching Hornets and trust me, it was like going through boot camp. Matter of fact, after my second year, I left college to go to the military and boot camp was a laughing cakewalk compared to making the band.I understand that its really meant to be somewhat of an entertaining movie. Just go ask any student at a black college and they will tell you the real story."}, {"id": 96, "text": "Former Colorguard here. I regret that they didn't use the color guard in this flick but think they pulled it off nicely.I don't understand all of the complaints about it being an all black movie - there are schools with a minimum number of white students in real life - get over it. I went to a school that was over 85% African American and I am white - who cares what color the band it so long as they can Bang the Drum.This is an excellent movie and I can't wait for my kids to watch it - excellent m oral value and very entertaining for a band documentary ha ha.I don't wanna work. I just wanna Bang on the Drum, All Day!"}, {"id": 97, "text": "So what if the plot is lifted from OFFICER AND A GENTLEMAN? Even as a Brit who has no experience of the culture of college marching bands, this is one entertaining film.Besides, there's something a bit more important going on here. At the core of this film is the path that Devon (Nick Cannon) takes from the point of having no concern for anyone but himself through to understanding the concept of teamwork and respect for those who are trying to help him be a better musician and, ultimately, person. Not a new message, but one I think we need more than ever in 2006.How can you dislike a film like that?"}, {"id": 98, "text": "As a Percussionist, I could relate to the situations and characters being portrayed in DRUM LINE. I appreciate and applaud the lengths that everyone Actors,Director,Producer,Cameramen &amp; Sound Engineers went through to bring us this show. Drilling, Marching, Performing that's tough to put together, and to add so many plausible interpersonal relationships was both interesting and entertaining.I was amazed that the studio would opt for a story line as risky as this and have any hopes of getting a return on their investment. The makers of DRUM LINE at least for me Delivered the goods and left me color blind at the end.I hope your investment was well rewarded, Thank You."}, {"id": 99, "text": "Drumline features and out of this world drummer who is recruited by Dr. Lee to be the next great drummer at Atlanta A&amp;T. but Devan soon learns skills aren't everything! Most people seem to think that marching bands are seen as dumb and for geeks but this movie proves how much people in the south love there music. this movie shows how fast you can go from the big time to nobody in a matter of seconds. But with Devan on the drumline does it give Atlanta A&amp;T the chance to beat hated rival Morris Brown University in the biggest event of the year, the BET Big Southern Classic? The beats and the percussion are unheard of. this movie is a must see and one of my favorites."}, {"id": 100, "text": "i saw this movie in theaters so it has been a little while. I thought that it was pretty good but let me tell you that he made drumming look very easy.Some of the stuff he was playing is really hard to do but then again it is a movie so why am i complaining. The story is pretty good. Worth a rent to check it out but probably not worth buying well i wouldn't buy it so who am i to tell you what to do. I thought it was cool because it was a movie about my life. I have drummed in school bands since fourth grade and i am now in college so it has been a long time. So check this guy out if you like movies about people in band or if you like to watch marching bands. I guess the movie was pretty good. seven out of ten"}, {"id": 101, "text": "Anyone who was ever in a marching band can appreciate the pull of this film.There is a cameraderie, a bond that you cannot compare to any other.  I spent four years with that family, and this movie brings it all back. You cannot overstate the importance of a band, despite what some non-musical hater may have reviewed. Music is our heart. Despite having very predictable plot twists, this movie does capture the experience.  I gave it 8/10 and recommend it to anyone who loves music, band alumni or not."}, {"id": 102, "text": "Drumline, directed by Charles Stone - responsible for the great Paid In Full, was a surprise for me to know that this was coming out.  When I went to see Paid In Full in the theaters this was one of the previews that came on, when I realized that this was about a black college marching band it immediately got my attention as this is a first in this category - but nothing new for black films - not that it's a bad thing.  I was surprised by Orlando Jones' performance at the time since he's usually a funny guy but I was really impressed w/ his acting in this as the band director.  Nick Cannon does pretty good as the lead. could've been better but I'm not complaining at all he did good and fit the part.  Being that I've attended a black college before I knew what this was about and it was real easy for me to relate to alot that was going on...Drumline is good stuff 7/10"}, {"id": 103, "text": "I loved Drumline, not because of normal movie criteria, but because I was in a field marching band in high school. It is a ton of work, great fun, and not a lot of people seem to know about it. I was glad to see a movie that showed the hard work it takes to do those shows and plus gave us some amazing routines to watch and some outstanding percussion work. I thoroughly enjoyed watching this movie. The plots are typical, but I really don't mind watching the same IL' plot over and over again. :) It's a sports story in a way, the cocky young frosh joins the team and tries to start out on top... Boy meets girl... Boy overcomes obstacles... Boy earns the respect of his leaders and peers.... Teamwork... You know."}, {"id": 104, "text": "I Like the Story Line At my age Reminds me Of my Military school days and all the parades. Concept good. Acting Actually surprisingly well done for a lot of up and coming actors - most have at least 2 to 4  in their portfolio. I Don't know if it was a budget problem or what but the cinematography looked liked it was cut out of a sixties psychedelic parade. I can do better computer cuts and animations with my 'ol PII PC there was now blending, fading, it was just plain crap in my opinion, And if that was the intention then it could have been done so much better. It was so bad it actually distracted from the movie.But As I said I loved all the pomp and circumstance and the drum effects were great."}, {"id": 105, "text": "Contrary to most of the comments I read on this film, our family found Drumline very entertaining. Perhaps it is because our son was in marching band for four years. And perhaps because we learned that the 'drumline' are the wackiest of the whole band. It takes discipline and a lot of concentration to do 'heel &amp; toe' marching and do the choreography that was done by someone who knows nothing about how much room a trombone or drums needs to turn on a pivot. Every parent who has ever had a child in marching band can relate to this film. For the rest of you ... we'll let the drumline take care of you, they'll definitely have an idea that no other person in world ever thought of."}, {"id": 106, "text": "This film pleased me. Orlando Jones is a convincing band director, with his one band, one sound philosophy. Flight of the Bumblebee however, was not realistic in a football stadium. The film's depiction of marching bands is fairly accurate. The film's depiction of marching band drumlines is okay though not up to par. I do not like the main character. He has an attitude problem."}, {"id": 107, "text": "Lots of music in this fun movie about a boy from the inner city who goes off to college on a music scholarship. He makes friends, finds a girlfriend and has a predictable rivalry with the drum section lead. In the end, they all become friends and put on a good show. This movie was very predictable and the acting wasn't fantastic but the music is great. I really enjoyed the marching band performances and practices throughout.7/10"}, {"id": 108, "text": "Sure, the script could have been better -- in fact, it was downright predictable -- but in this age of godawful black-oriented shows on WB and UPN, how refreshing to see a positive portrayal of black culture that did not feature one single bug-eyed stereotype. And Orlando Jones (a guy who knows how to bug his eyes) can act! Who knew? And man, those band performances were hot! I really enjoyed it. Not a classic, but still a needed movie at a time when the bar is set way too low."}, {"id": 109, "text": "Drumline was a pretty good movie. I ended up liking it after it went off. It had a great storyline and most of the acting was great. The guy who played Devon actually did a pretty decent job. His slang did start to get old though. Orlando Jones did a good job at playing a serious role. Although I think he's better at comedy. The only complaint I have about this film is that I thought it was a little too long. The scene at the end where the two bands are trying to break the tie seemed to last forever. And I started to get a headache after hearing all that drumming. But I'm not criticizing this movie. It was watchable. The scene where the band gets to perform at the football game for the first time was excellent and it was pretty cool to see them form those designs as they played their instruments. This was a good poignant family movie. Thanks for reading my review."}, {"id": 110, "text": "Ernest was my favorite character in Drumline even though he had a smaller part. Jason Weaver is a great actor and he made the movie funny.   I can't wait to see him in the upcoming  movie, 'Ladykillers' with Tom Hanks.  Drumline was a well directed movie that keeps you involved in the storyline. It's well worth the purchase price."}, {"id": 111, "text": "One of the most entertaining movies of the year! Somewhat within the category of Bring It On. Nick Cannon is great and can play the drums like a pro, and Orlando Jones is awkwardly good, regarding the role. And Zoe Saldana aah! the hottest black girl that I've ever seen in a movie, and is also really good in this. I'd want to rewatch this film any day anytime anywhere, just Fantastic!!!!!!"}, {"id": 112, "text": "A guest of mine rented this movie recently. I hadnt really had a compelling desire to see it.  I have to say i enjoyed it more than i thought i would. There were some nice visuals, especially the quick motion shots of, I believe, Morris Brown's band invading the field like ants, and the twirling of the cymbals overhead. Some of the music and dance sequences were nice, some better than others. But the plot was somewhat trite and predictable, and the dialogue was mundane. Plus, I think that Spike Lee's School Daze and the television show A Different World gave previously unexposed large audiences a glimpse of black college life, so its not a completely novel subject matter, which would make up for the lack of originality in the plot. In other words, this movie was not an unpleasant experience but i wouldnt necessarily rush to see it again"}, {"id": 113, "text": "For years, in the movies, people in band were seen as immensely geeky (a little Lucas or American Pie anyone)  Then comes a movie like Drumline to set people straight.  Even though it's set at a black college, EVERY person who has enjoyed the band experience can relate to this movie.  From getting up at ungodly hours in the morning so you can go practice, to dealing with the jitters that come when halftime starts.  Not to mention the plot, albeit a tad formula, isn't really that bad!  I hope filmmakers will get a clue and realize that not all band people are mouth-breathing dorks!"}, {"id": 114, "text": "I thoroughly enjoyed this movie. The lack of critical and popular appeal surprises me. It was playing at only one theater in my area and it never made it to many screens across the country, what a shame. I thoroughly enjoyed the score and the storyline. The reviews that I read on this site that criticize the movie seem to center around the lack of realism in the portrayal of marching bands, but never having been in a marching band, I enjoyed the artistic license of the drumline. While there are certainly no award winning performances on the part of the cast, I thought there was wonderful chemistry among the cast."}, {"id": 115, "text": "I loved this movie. It is difficult to get people that have never experienced being in a great band with a great drumline to understand the passion and what it feels like out there on the field kicking the other bands umm....tail; To work and push yourselves so hard and put your heart into it..and..well, I could keep going all day. The point is, it is nice to see a well-done movie about something I'm so passionate about. I was in the Auburn U. Marching Band (Trumpet) from '89-'92. We patterned ourselves after DCI (Drum Corp International for those that don't know) as much as a college marching band could. Sure, there are points where I thought AU's Drumline was better, but that's not the point. It was a good representation of the passion and intensity that goes into good marching bands. Most people that don't appreciate marching bands have never really been exposed to it in this way. I thought it was a great movie."}, {"id": 116, "text": "If you are a fan of D.C.I. and are a rather hardcore band-member expecting a good drama about a good band, don't watch this movie. The story about a bad boy from Harlem going to a college to be in the show band does not impress. It's kind of cliche, and nothing stands out as being too spectacular. It leaves you wishing for something better. If you aren't a band member, some of this humor may be lost. After the movie, there was one memorable moment (Beat the drum! 'I am!' You're hitting it like a virgin!), and nothing much to speak of other than that. Don't see this movie expecting anything too good."}, {"id": 117, "text": "I saw this movie on pay per view and enjoyed it very much. Years ago I was a band member, and this may be why I enjoy the movie so much.The movie has a nice story to tell on several levels. If you are tired of a lot of hype type movies that let you down, try Drumline.  You'll be glad you did."}, {"id": 118, "text": "This is the horribly cliche' plotline that is usually reserved for sports movies.  Substitute the marching band for the football team and you already know how this movie is going to play out.I am obviously out of the target demographic for this movie, being 42 years old, but I was a marching band drummer and thought I could relate.  Alas, I could not get over the unoriginal plot and paper-thin characters.There are some scenes of exceptionally good drumming and choreography that keep this from being an utter failure of a movie.  Even so, I will put our own Kansas City Marching Cobras against those in the movie.  I think we could whip all of their butts."}, {"id": 119, "text": "The summary says it all. The script is dull, it is totally predictable. The acting is beginner level. The music isn't. Even the marching bands are sloppy. I got to see this film while flying to San Francisco, so in some small way I paid for it. I got ripped off."}, {"id": 120, "text": "oh my god! how can this movie be rated so low?!?!?! THIS IS THE BEST MOVIE EVER and NICK CANNON IS AWESOME! whoever thinks otherwise is dead wrong! the musics great but the scripts not? my big fat hairy butt! everything about its awesome, especially the main character whos charming talented and HOTT!!!!!!! shame on those of u who say otherwise!!!"}, {"id": 121, "text": "This was a great movie.  It kept our attention the entire time.  No boring spots.  It was funny and it gets you movin'.  Again, great script and awesome music.  Good movie, whether you were in band or not.  If you weren't...it may make you wish you had.  LOL.A MUST SEE!!!!"}, {"id": 122, "text": "I am a fan of drum corps.  However, that's not what I was expecting so I thoroughly enjoyed this movie.  This style of marching band took me back to high school.  It's nothing like the precision of the drum corps.  The sound was amazing, although I agree that I was upset to hear the sound track songs during the band's rehearsals.  The actors really worked hard and made it look like they had always been in a marching band.  I just bought it on DVD Tuesday and I've watched it 3 times (can't wait for football season!!!!!)"}, {"id": 123, "text": "This is a fantastic movie!  Best I've seen in a long, long time.  It reminds me of my high school and college days at the football games.  (I'm 46). It brings back lots of memories!  I would  suggest that everyone watches this movie.  I chose it because my daughter has a drum set and hasn't played in a while and when we saw the movie, she was quite influenced and wants to pick up her drums again.  I intend to see it with my friend and my boyfriend (separately)!"}, {"id": 124, "text": "I'm really glad that I decided to see this movie.  The drumming absolutely blew me away!  The cast was very entertaining and enjoyable, and the moral lessons being taught were very well presented.  Kudos to all of those involved in bringing this to the theater!"}, {"id": 125, "text": "Drumline was one of the best movies I can recall seeing in 2002. Nick Cannon in his first starring role carrys this movie very well. I took the film for what it was a crowd pleasing movie that makes you root for the underdog. Charles Stone III who directed the very good Paid In Full before this shows he can tell a good story. Zoe Salidana and Orlando Jones also give great performances. I paid to see this film twice and will buy it the first day it comes to DVD."}, {"id": 126, "text": "This is a wonderful movie with high morals that is mostly vacant from todays movies. I enjoyed everything about this movie. The band scenes were wonderful. I went into the movie expecting to like it and it was way better then I thought. I was surprised by how little they referred to sex in the movie. I am so use to being bombarded with sex, sex, sex now a days, that when I don't get it, it's kind of weird. This is a wonderful family movie, and you get a whole other side to marching bands that you would have never thought about. The chemistry between Nick and Zoe's character was very believable and then end sequence is an intense *~small spoiler~* drum off that that leaves you amazed. A wonderful piece of work that teaches you a good message about team work and values. I would definitely give this movie *** or of ****."}, {"id": 127, "text": "When i saw these trailers this movie seemed like a last choice/bored saturday night flick-pick.  I knew the actor Nick Cannon from his days on the nick show All That... So his acting was not notable.  When i did end up seeing it after being pressured by friends, i really enjoyed it.  It was funny, and there was a lot of truth in the plot.  I definately liked it."}, {"id": 128, "text": "I am not a member of my band's drumline, but I think that this movie is a great representation of what it means to be in a band, not just a drumline. Devon learns that talent isn't all to being in a band -- you need respect and discipline too. That's all I really wanted to say, except that I hope every band member goes to see this movie!!"}, {"id": 129, "text": "This movie is not any exgaration to what band is really like. I may not be in the percussion (im on the colorguard) but the competion is really tough. The movie just brought back wonderful memories of getting up early everyday , and out on the blacktop during rehersals. Man i miss band camp. But you really cannot appreciate the movie unless your in band or were in band. Its like to those who know , no explnation needed , to those who dont no explanation possible! But the movie was great! The music and all. And i shun those who think it's a band geek movie , which it may very well be , but i still think everyone should see it."}, {"id": 130, "text": "When I first saw the previews for this one I thought it might make an interesting rental but then I started seeing the critics rather unanimous praise of it and I thought I would check it out.  I'm glad that I did.(possible spoilers)The plot is a rather simplistic and formulaic but in this case it works straight across the board.  Devon is the talented high-school drummer who is recruited to play on the drumline of a one-time top college marching band in the south.  The director of the band, Dr. Lee (played in a very straight-forward manner by Orlando Jones) is under fire from the chancellor of the school to get the band back up to the number one spot.  Unfortunately Dr. Lee is more interested in teaching the students about music than about entertaining the judges in contests.All of this sets up the story for the hot-shot kid with the chip on his shoulder to face up to the challenges from the head of the drum-line as well as the conflict between Dr. Lee and Devon in their battle of old-school teaching versus new-school performing.Simplistic right?  Most definitely, but it was certainly entertaining. People might find the training sequences a little off-putting but I didn't. Having gone to a school in which the band was frequently ranked higher nationally than the football team and knowing many of the people in the band, I found much of what went on to be relatively true.  The band members live a life totally different from many at the school and are marched through an almost military style training camp.  Strange but true.The music is incredibly enticing.  The rhythmic beats rumble throughout and move all around the body making it hard for even the most jaded viewer to stay completely still during some of the scenes.  Especially the final battle.  The artistry and percussion was simple awesome to view and hear.I highly recommend this one."}, {"id": 131, "text": "This movie wuz tight from the trailer to the beginning of the film to the ending credits rolled around.  It wuz great. Had me in the theater dancing to the music and wishing I had my uniform on so I could march with ATL A&amp;T. Brought back so many memories of my highschool dayz.  I can't say anything about my college band cuz I didn't go to an HBCU, but I always wanted to at least march in the band at one of them.  This movie wuz great and I gave it a 10. Everyone should go see this one. I already have my movie on reserve at the video store and can't wait to pick it up."}, {"id": 132, "text": "In spite of the comments negative to this movie, I enjoyed it and , as a former Purdue All American Band member, related to it. The competition to e the best band around is as fierce as portrayed, and the egos of some of the people who want to  be the best at their instrument, is also well portrayed. At Purdue, we had a perfectionist of a band leader (Al G. Wright) and one can see the ways in the movie that band directors try to get the band to be the best. And it is often true that the best of the best are not really nice human beings; witness insensitive Beethoven, egotistical Wagner, perfectionist Mozart. No one criticizes Mozart in Amadeus for being somewhat of a jerk, so it puzzles me that in this movie, the almost genius drum player is castigated for being somewhat or totally a jerk. Unfortunately, genius does not always come with humility. The story is pretty good, the acting pretty good, the music and marching and competition, awesome."}, {"id": 133, "text": "I never thought a movie about band would be this awesome. This movie was great in every way ACTORS, story, Music Every one will like this movie. Everyone should go see this movie  even if you don't like bands or marching bands you will like or in my case love this movie."}, {"id": 134, "text": "I THOUGHT IT WAS AN AMAZING MOVIE AND HOW WELL THAT THEY WERE TRAINED ON HOW TO DO THOSE DRUMS ALLAT ONCE I M SO HAPPY TO HAVE SEEM THEM WIN THE COMPETITION AT THE END GOOD3 JOB TO ALL OF THEM AND STILL HAVE FUN johncorreia445. Com"}, {"id": 135, "text": "Drumline (2002): Dir: Charles Stone / Cast: Nick Cannon, Orlando Jones, Zoe Saldana, Leonard Roberts, J. Anthony Brown: Here is a drama that drums a beat that we've all heard countless times. It regards perseverance and maintaining your goals. It stars Nick Cannon who wins a scholarship to attend a Southern university where he hopes to extend his ability to play the drums on a marching band drumline. His attitude comes into conflict with others, particularly the conductor. The plot is full of clichés but director Charles Stone handles the material with skill with the marching and performing that are wondrous in itself. Unfortunately the fine cast is subdued in stereotypes. Cannon bringing out the rebellious nature of a gifted drummer but the problem is that everything has been laid out before. Orlando Jones is also playing predictable material as a conductor. He will yell at Cannon who will in turn rebel before they come to respect each other in that conclusion we've long arrived at before they have. Zoe Saldana is a disappointment as Cannon's love interest because that is about the height of her role. Other supporting roles are cardboard as well, and are about as festive as hearing those drums beat in your ears for hours. Theme regards expressing self through talents but unfortunately the screenwriter was expressing clichés and stereotypes right down to the final drumline. Score: 3 / 10"}, {"id": 136, "text": "A movie very close to my heart as I played a featured extra, Layla's Mom. It was an honor to work with Nick Cannon and Zoe Saldana. They are both the most kind and talented actors in the business. Meeting, Angela, who played Nick's mom was a treat. she is the daughter of Florence on The Jefferson's. The highlight of my acting career, so far, was working on this extraordinary movie. Filmed in Atlanta, this movie brought a lot work to many actors. It also show cased the soulful sounds of African American college bands and the talented and beautiful dancers and majorettes. If you want to be entertained with some great music and see some beautiful people of color please see this movie ASAP. If you want to see yours truly look for me after one of the major band scenes. Enjoy"}, {"id": 137, "text": "Anyone in an actual college marching band should be offended by this movie!Horrible acting, sound track, visuals, plot, and COMPLETELY unrealistic.If you apply to a scholarship for a music program, there will be a number of professors there to watch every move you make.they will bring out a piece of music to sightread, also they hand out different music to players of the same instrument so they have to prove they can read music.The music the bands play in the movie are totally unrealistic. The whole film is just annoying, every time I hear it on TV in a different room I put my headphones on. It is possibly the worst movie I have ever seen, a waste of two hours and a $12 movie ticket.I went with a whole bunch friends that was in band and we hated it.After the movie I wanted to reenact the scene from Family Guy where Stewie see's the new Charmed movie and travels all the way to Will Ferrals house and slaps him."}, {"id": 138, "text": "I can stand to watch most of this movie when I feel like it but there are some things that could have been and should have been left out. I too found it rather silly that this kid got a full scholarship even though he couldn't read music. Wouldn't that have been something Dr. Lee would have asked when he recruited Devon? Afterall, it was part of the official rules to be in the band. The way Devon ignored rules, his attitude toward Lee and his drumline leader, and the fact that he caused a fight with a rival school, any other person would have been kicked off the band without given a second thought. Also, the P.A. announcer at the stadium was very annoying. Could have done without those pointless arrogant lines. Lastly, the movie ended badly. Sure, Atlanta A&amp;T won the Classic but it ended during the celebration. They needed a better moment to end it on. Like maybe show Devon a year or 2 later leading a group of drumline hopefuls."}, {"id": 139, "text": "First of all, Morris Brown should have won the final showdown.I say this after many years of playing in drumlines, high school, college, and eventually a shot at the Blue Knights, which I missed. It's been years since this came out, but I would still love to see a well- done sequel that pitted a drumline coached by Devon against a DCI-style line that actually had some serious precision, discipline, and power. Throwing the two styles against each other would definitely liven things up a bit, and we'd get some sweet, heart-melting DCI brass power chords to go along with it.Otherwise, the movie is formulaic but with its heart in the right place. I was happy to miss the usual black clichés in this film, in favor of seeing decent kids with sense, for once. I'm happy to see that Zoe Saldana has gone on to bigger and better things, since she was the stunningly beautiful standout of the film. Orlando Jones was also excellent... what happened to that guy? Anyway, decent film for what it was, and why it remains to be sequeled in this sequel-happy universe is beyond me. Someday, maybe..."}, {"id": 140, "text": "Drumline is an okay movie but it wasn't my cup of tea. The director to me seemed like an unknown director to me. Since Drumline was only his second film I think he actually did quite well. Now the script seemed perfect to me the cast seemed perfectly casted. One thing I didn't like was the whole secret fraternity things Earnest was involved with. My favorite thing was the comedy part involving the girls walking by while Devon was talking to Jayson about banging the drum.Another funny thing was when Devon was hitting on the college girls and Charles walked up and started talking. Another funny part was on the bus link----&gt; http://www.youtube.com/watch?v=fp-pnhN8qjc Also the whole plot of the movie was good. The things I didn't like were the lack of known actors and different side stories that came up in the movie such as Earnest's love interest and Jayson trying to get on the Drumline again."}, {"id": 141, "text": "Movie review DRUMLINE Devon Miles(played by Nick Dannon)is genius in marching drummer. He graduated from high school in New York City after he attends Atlanta A&amp;T University, a historically college that famous a marching band by Dr.Lee(played by Orlando Jones). The band's concept is one band, one sound. Though he haven't cooperation and don't go with the band's style. Finally he gives up the band, and he contacts the band's rival school....This movie's highlight is marching band's performance and colorful action. It is excited people who watches it. The best of youthful movie for me."}, {"id": 142, "text": "I liked this movie. i saw it when i was a preteen. and i attend the GREAT BETHUNE-COOKMAN UNIVERSITY in Florida. When i saw it in theatres i had no idea that six years later, i would be going to one of those black colleges. The movie may have been unrealistic in some areas but overall it was decent. I just don't understand why sooo many people are like omg thats not what marching band is!! Maybe you guys need to google historically black colleges and universities. Thats what OUR marching bands are about in case u were too ignorant to figure that out. And someone said something about the dancers and what they were wearing. HELLOOOO thats typical for most HBCU bands. Just because you are ignorant to the fact that marching band is different in the HBCU schools doesn't mean u have to bash the movie. and in case u were wondering i got the best of both worlds. i grew up in a white neighborhood and i WAS in the marching band at my high school so yess its different but both are very good. As for the complaint about the token white guy wow...once again i state that i attend an HBCU. Their are plenty of white people, just because its a black school doesn't mean white people aren't allowed to enroll. And know we don't walk around making them feel like they're out of place which i don't think was the intention in the movie.I've asked some whites and hispanics here out of curiosity why they chose to attend an HBCU. Most replied with  i wanted to learn from a different perspective or something of the sort.P.s. Knowledge really IS your best weapon =)"}, {"id": 143, "text": "Once you've seen Drumline, halftime shows will become works of art. This formulaic yet surprisingly captivating movie honors the military precision of college football marching bands, those battalions of eager, sternly disciplined brass sections, drummers, and fly girls who turn halftime shows into well-oiled Vegas variety acts on steroids. Devon (played by Will Smith protégé Nick Cannon) is a cocky Brooklyn kid with a snare-drumming scholarship to (fictional) Atlanta A&amp;T University. He can't read music (he lied on his application) and his attitude sucks, but he's the best natural drummer the college has ever had, so he quickly rises through the marching band ranks. The school year brings Devon the obligatory girlfriend (Zoë Saldana, smart and charming); clashes with his old-school band director (Orlando Jones); and well-earned redemption at the championship marching band showdown. No surprises here, but great chemistry all around, and a fantastic, positive role-model showcase for a musical form that has evolved far beyond the main street parades of Smalltown, U.S.A."}, {"id": 144, "text": "Pure, fun entertainment. A lot of the comments I've read here make fun of the fact that the plot is obvious and the movie isn't deep enough for them. But, if you simply want to be entertained and drum the heck out of anything you can reach when the drumlines compete, and if you like to see good looking college kids, beautiful girls' bodies, and see the good guys win then this movie will delight you as much as it delights me. Most of the actors are black and college age and I'm white and in my 70's, but there's a life to this movie that lifts me up every time I play it. Get in the mood for fun and slip this DVD into your player. You'll have a couple hours of pure fun."}, {"id": 145, "text": "I loved this movie!!! I haven't seen it for a little while and have been looking on the TV guide and every where to c when it is on... cause we don't have any rental places here. I am gonna go and buy it asap! i loved it so much. I myself am a drummer and so much of the stuff they put in there is true.. and they show that drumming isn't just a bunch of beating around like it appears to be. it is also something i can watch with my nephews and nieces when I baby sit and not have to worry about them seeing a bunch of stuff i don't want them to... stuff on family channels is worse than this half of the time. I have seem things on ABC FAMILY that had horrible sexual and verbal things that i my self don't like to watch.. let alone let younger people listen to or see. But Drumline line gives my family and i something we can all enjoy the plot to.. and it has an interesting story and some comedy things in it for the kids and me! I LOVED IT!!!"}, {"id": 146, "text": "What this movie delivers - namely flashy uniforms, swaggering braggadocio, BCKWAs (black college kids with attitude), and rhythmic drumming - it delivers in spades. What it lacks is a believable storyline. The movie starts out well enough, and kept my interest during the initial set-up. But it became clear by the middle of the film that every character was going to remain strictly one-dimensional, and every interpersonal relationship was, too. Every major pair of characters has a single conflict or issue to work out, and they don't interact except on that level. Characters make telegraphed choices and react in a vacuum; there is little character development or nuance to the story. The circumstances that develop and consequences that result are quite implausible. This movie takes the age-old storyline of boy gets girl, boy loses girl, boy gets girl again, and adds boy gets drum, boy loses drum, boy gets drum again to the mix. It doesn't freshen the formula much."}, {"id": 147, "text": "hi i watched this film on the last day of my secondary/high school and i thought it was great i don't really likefilms like this to much for example honey but i thought this film was great the story line was excellent and the plot plus the actor/actress's was totally brilliant i woulds defiantly recommend this film to every one. if u do watch this film you don't really have to have a broad mind and it ain't one of these typical American teen movie OK some scene are quite typical but thats it i would really suggest you buy of even rentthis film"}, {"id": 148, "text": "This movie was one of the best movies that i have seen. I gave it 10 out of 10. I loved the challenges especially. Sean and Devon were exceptionally great at there roles. Everyone was. I only found out about this movie when it was on TV. As soon as i watched it, i loved every bit of it and now i cant stop watching it. It gets better every time i watch it. I'm not sure if there is gonna be a Drumline 2 so i was just wondering if anyone knows if there is gonna be a Drumline 2? And if the same actors ie: Leonard Roberts (sean) etc. is gonna be in it and when it is gonna be released? Please let me know if there is gonna be a Drumline 2 so i can look out 4 it.. thanx"}, {"id": 149, "text": "If you like College Marching Bands, the formations on the football field, all the band instruments from the Piccolo right up to the Bass Tuba, this is the film to enjoy. The film features some dudes who come from all walks of life and one dude enters this drum program with a scholarship and thinks he can do just as he darn pleases in this program. The dude is a good drummer, but he just can't seem to follow orders, because the band program is run like a Boot Camp, with Yes Sir and No Sir type of situations. There is drama, comedy and plenty of sexy wild music and very hot cheerleader chicks. This film gives you what the background is like with a drum team competing with other college bands. Enjoy."}, {"id": 150, "text": "I liked this movie, but I also do disagree with some of the focus. Okay, yes, the movie is called Drumline, but still, it's not like that's the whole part of a marching band. I know they kind of cover this at the beginning when all the section leaders are saying that their section is the most important, but I mean, come on? Now all the people who join marching band only want to do drum line. And then there are people who try out for guard because they think it will be like in the movie. Again, I understand that this is what the movie is about, and it's not a documentary, but it can get annoying when you ask someone why they joined guard/band and the say because of Drumline."}, {"id": 151, "text": "I kept hearing about this film. I no long live in Atlanta, so, it was great to see the Atlanta scenes and the great Clark campus.The on-field sequences were a lot of fun. The attitude between the bands during competition was fun to watch. Especially... well that would be a spoiler so I won't say it.But, I do have a question. What is the origin of the story and why is it that some of the schools are real and some fictional? I find that a little bit odd. I would have expected all fiction or all real, but mixed together? That's not a criticism, just a curiosity.My curiosity has gotten the best of me on this one."}, {"id": 152, "text": "I am in high school and have been in marching band (playing piccolo) and drumline (playing bass drum). From a musical standpoint, I enjoyed listening to the cadences and of course, the final performance in the movie. However, the plot was annoyingly predictable- the kid is talented and has a miserable attitude that (temporarily) holds him back. But in the end, he helps by learning to read music (a valuable skill) and writing cadences, blah, blah, blah. I also felt that the supporting actors (the other band geeks) didn't get much development, and therefore, I didn't feel like I got to know them at all. Had the protagonist had a more complex and intriguing personality, the lack of knowledge of others might not have been so bad after all. Still, since I am a band geek I must give this a 6/10 (for the rhythm) and the cheesy overdone plot."}, {"id": 153, "text": "I agree with BA. performing in a competitive marching band is HARD work. Everybody thinks the football players have a rough practice. We would practice on the field adjacent to the football team. We would be on-line ready to march at 0700. The jocks would ramble in about 0900. We'd practice 'til noon, have a 1 1/2 lunch; practice again until 5:00 pm. The footballers would leave at noon and not return to the field until 6:00pm. After dinner, we'd continue practice 'til 9:00 - 9:30 pm...My point in all this is everybody thinks band members are a bunch of weenies. Well they're NOT. Consider all that is required to perform in a marching band: 1st you need to know how to march and stay in step; 2nd, you need to know the choreography and your place in the formations; and finally, you need to be able read and memorize music..and be able to play it while doing all those crazy gyrations...Oh, one more thing, you need to be in pretty good athletic condition or you ain't gonna make it!!!!"}, {"id": 154, "text": "I personally have never been on drum line or in the Mb but someone I used to know was a drum major in HS and she said that they trained you and ran you down as if you were training for the Olympics. This movie shows that and it shows that if you have the skill and the faith to do something never give up. Every character was believable, had emotions that matched the scenes, and who could forget the outstanding performance of the bands.My favorite part was at the end when Atlanta A&amp;T got to show their stuff on the field and at the end when they were tied with those purple people how they totally wiped their faces in it. I mean what goes around comes around and in Drum Line Morris Brown had it coming.I give this movie an 9/10 and recommend to any who likes music and the good old American Marching Band!!!!"}, {"id": 155, "text": "As a traditionalist musician from the UK I really enjoyed watching this film of banding and young egos. I have seen the British Corp bands and most are not in this class. However, if you want to watch some entertaining fun with great Corp shows, music and moves then you could do worse than sit down and watch this. Not one to run out and buy on DVD but definably one to watch when on the TV.The cast and acting is nothing to write home about, but all very safe in this movie.the definite stars of the show are the musicians I wish I had had that type of opportunity when I was as young to do this type of thing"}, {"id": 156, "text": "I have seen this movie time and again and each time I see the realism of this flick. Being part of the band scene in my high school and college days, it rings true each time I see it.For those who like a movie that depicts REAL LIFE, this comes close. While Devon may be Mr. Ego, he is typical of the Harlem street kid who gets a shot at the big time. I did think Orlando Jones was out of his league in this movie, he just did fit the part as Dr. Lee.Direction was a little weak, but it was overcome by some good music and some talented kids. Try going through Band Camp and the training and discipline it takes to put on a field show.....only then can you truly enjoy this movie."}, {"id": 157, "text": "Answer this one. Who wants to see a movie about some kid trying so hard to have a geeky career as a southern university band member. They make it sound like, if he dosen't get the job, then his life is over. The REAL people in this movie are the people on the REAL field...the football field. Everybody in this movie is a complete joke and completely wasting their time making this junk movie. People don't want to see this junk, they want to see action. They want to see cars blowing up and people dying, not a dumb story about some geek who wants to have some looser career as a band member. If he wants a real career, he should have been a real band member instead. THIS MOVIE IS A JOKE"}, {"id": 158, "text": "Look, we all know that the band performances are the star of this film. If you know that going in, you're bound to love it. The weak, re-tread script goes like this: Talented ghetto kid gets a scholarship shot on the big southern-school drumline. He meets a hottie, falls in love, fights with the second in command, everybody makes nice and they make beautiful music together. The lead actor who played the ghetto kid was a good actor, as is Orlando Jones. The love interest is gorgeous. The opponent also does a fine job. None of this matters. The band sequences are totally fun and energizing. You'll be giddy during the final sequences. Who can complain about that?"}, {"id": 159, "text": "If you can't see the excellence in Drumline, well..you just can't see at all. Think how difficult it must have been to produce this movie from start to finish. We aren't talking about Andre and his buddy having a conversation, or Arnold jumping around in front of a blue screen, this is hundreds of people placed in an artistic enterprise and they end up producing an Oscar caliber performance. What talent, what energy, what a show! It avoids many of the typical pitfalls of a black - white movie. This movie is about people everywhere who are working to overcome the nature of being a human being and the baggage we all carry, no matter our color. These young actors, screenwriters, producers, directors, choreographers, and dancers have come together and what we see is how it really is. At least on some days, with some lives, if you are lucky."}, {"id": 160, "text": "the movie was an excuse to hear some great drumming. we like to play the drumming parts over and over and over ... having recently tried to watch Fast Times at Ridgemont High again as an adult and having to shut it off after only ten minutes, complaints about the authenticity of this movie are pretty unimpressive.  Even if marching bands are not your thing (and they aren't mine -- I'm an ex-orchestral musician), watching people do THEIR thing WELL is always great!"}, {"id": 161, "text": "Drumline, while being a pretty good movie for story plot and all is NOT a fully accurate representation of what a real drumline is.If you want to see a real line watch the Blue Devils from Concord,Ca or maybe theMadison Scouts from Madison, Wi these are drumlines from the top echilon of Drum Corps.International,these are what true drumlines are made of with 10 snares that sound and function as one player.five or six quads or quints,four to six tuned base drums and a full pit section.Maybe the producers could make a sequel involving drum and bugle corps. instead of borderline cheesy marching bands I believe that if you would watch DCI you would find a much higher level of excellence both in the quality of the drumlines and the quality of the horn line and color guard,DCI horn lines only usually number 65-75 but in sheer volume alone they can blow a 300 piece marching band off the field."}, {"id": 162, "text": "Being actually in a drumline, I thought this would have been a great movie and allowed people to see Marching Band and Drumline from what it really is, all the talent and hard work that goes into creating a performance.  But that's one thing I saw lacking in this movie, the hard work.  Marching Band is all parties and hanging out with your friends.  If a member truly wanted to be good at something like this, they don't get to go to parties.  Most of what free time they have is spent on more music.  I hoped this movie would have created some respect for the band members, but all I noticed was people wanting to join say they can just sit back and have fun, thinking it takes no work all, all thanks to this let-down of a film."}, {"id": 163, "text": "This movie has it all.  A little love scene, the funny, the drama, and the pretty serious side.  You have to watch this war picture.  It is so real and gives the best reality to war scene.  This should get it all the bomb movie and i would say a must see for those you love war pictures."}, {"id": 164, "text": "This is the perfect movie for The drummer, the reason for this movie to have a low vote is that There are not so many drummers in the World I strongly recommend this movie if u are a God on the sticks"}, {"id": 165, "text": "As a drummer and drum major at the high school, college, and professional level, this film was a disgrace to drumlines.  The was little if any real marching in the show.  Dancing and theatrics are reserved for the color guard.  Although the drumline will choreograph moves into their show it would not be to the extent done in this movie.  Furthermore, the way in which the line was organized was not correct.  A drumline of that caliber would not simply have the line and its leader.  Rather, they would have their own arranger, choreographer, caption head, and section leader.  All those involved needed to be better informed on how a drumline really works, before this movie was made."}, {"id": 166, "text": "I loved this movie!  The writing is tight and the plotline completely believable, speaking to problems of kids today.  Very positive message without sugar coating or a partonizing tone.I thought that the ending had to be a wimpy cop-out (hero comes on and saves the day - like so many Hollywood movies), but instead it was an uplifting tribute to the point of the movie.Sure, not everything works, and some of the side plots detract from the story - what is that fraternity thing doing there, anyway? - but the marching band sequences more than make up for it."}, {"id": 167, "text": "This has spoilers.....Ok, I am a percussionist in a high school drumline, and we play stuff that sounds better than what they play. And they are supposed to be college? At first I was excited to see a movie made about a drumline, but too bad I couldn't relate to much of it.The story is stupid. A guy is a really good snare player but he can't read music? How does he know about rolls and flams and rudiments and stuff? I think it's too far-fetched that he can play the stuff by just hearing it. And then he somehow learns to read music at a college marching band level in just a few days? Unless he is God or something that's not likely. And they make band camp look like boot camp. I haven't heard of a college band that runs up and down the stairs carrying the drums on their heads. There's no point. What you really do is marching fundamentals and learn music and stuff. Oh, and by the way, most marching bands march to classical music that's spiced up with drumline beats and stuff, not modern music. Flight of the bumble bee may not sound cool, but I'm pretty sure it's damn hard to play on a trumpet! But I guess you would have to be a band nerd to appreciate that talent. And what's with the two bands tieing in a band competition? Yeah, right. Give me a break. And then they have the drumlines battle it out to see who wins? Please! It sounds like Hollywood crap to me!If you're going to make a movie about a drumline, make it about a REAL drumline. Not some drumline that dances in the middle of the field and can't play clean beats all the time. And don't make it some Hollywood story. It would be cool if it was like a true story. Like Remember the Titans but about a drumline. I thought maybe a movie like this would change people's perspective of band nerds and know how hard we work at what we do, but people are getting the wrong idea from this movie."}, {"id": 168, "text": "well, a bit of a buzz surrounding this picture from where i'm from so i decided to go see it. usually, pictures with unknowns that have a little bit of buzz are worth seeing, but lately i've been finding this untrue or no longer true. media conglomerates monopolizing and manipulating the critics? i'll shove my paranoia under the rug and address the movie. cool behind the scene look at bands and their music? some jive marchin' and kicking? pretty much, NO! some dude, whose name i forget, leers and sneers his way through the whole thing. fight the power! question authority! drape myself over the first chic i see! and she buys it! characters throughout the movie recognize his genius but keep trying to break him for,his own good! but true brilliance will triumph over all with unbowed head and unsullied pride in place! the climax is, well, if not anti-climactic a bit of a dud. i sure couldn't tell the winner.overall, a stinker but it could have been much worse. 5.0 out of 10 stars."}, {"id": 169, "text": "Just one teeny weeny spoiler.Overall, I was impressed with this  movie. At first, I considered it another African American stereotyped movie with nothing new to show but, surprisingly it did. And I had this attitude even before I saw the film. Yeah, so what it was the same predictable plot-line, another angry brother with talent to shine,the story it self was fresh. It's time we see a black film that diverts from the usual material we've been viewing. I was pleased that the love interest girl wasn't unidentifiable in terms of race and features. So what she had fake hair, its easier to manage. And when the dancers had the afros, they were going back to their roots. Get a grip. Whats the big deal?  Its a shame we still on issues of color and ethnicity.  But how black people are represented in the film industry is important. I feel sistas who want to see more of a Nia Long or an Angie Bassett, Sanaa Lathan and the cutie from Lifetime's The Division. I felt the two leading ladies were realistic. Light-skinned, dark-skinned, they were black.  And damn was it nice to see a black film without a sex scene. Really any film for that matter. Doesn't the music industry exploit sex enough?I liked the fact we got to see the discipline , skill, and dedication it takes to achieve a good band. Orlando Jones' character couldn't have said it any better, love of music and being a unit. But you know what gets me?Its not really the comments above that I've mentioned  but the comments on Devon's character. People who debased Devon's character as a spoiled youth with a chip on his shoulder who didnt show a character change either never been around black young men like that or just don't have the patience to understand a troubled young man like that. Or just flat out prejudiced.Reason being I read a comment similar to this one on other black films that involved troubled young men like a Devon. Don't diss what you don't understand.There are so many Devon's like him everywhere its not even funny. That's how a spoiled jerk acts. And whats this that he never changedthrough out the film? He showed change by making amends with the band leader. And instead of beating each other down any further they worked together as a unit. That ain't change?  He showed true courage and loyalty  by rejecting the rival band leader's invitation to join when he was being pressured to divulge information.There are true sell outs who would have given in but he didn't. That's when I saw the change. What else are looking for? Nobody's perfect real life or fiction."}, {"id": 170, "text": "drumline is for kids.  everything about the movie was foreshadowed, hackneyed and straight from script writing 101.  young filmmakers who graduate from making music videos usually end up making a feature length music video.  They don't waste time with  character development or fleshing out the story.  Those devices only get in the way of the music and the dancing.  For instance; Why did the girlfriend have to tell us why her parents didn't want to meet Devon?  Why wasn't that scene actually acted out?  That would have been a very tense and compelling part of developing their relationship.  A marginal scriptwriter knows that conflict and tension build drama .  I guess I answered my own question.  The scriptwriters were less than marginal which is why they had to rely on music and dancing to drown out the pitiful story and dialogue."}, {"id": 171, "text": "this is the worst idea for a movie.  they have run out of sports for people to be the fish out of water or the best of the best of the best in.  I could crap out a better movie.  Save yourself the trouble and go rent spiderman. A good movie.  Or save yourself the movie and wait till a Christmas Story comes on tv( this being december and all)"}, {"id": 172, "text": "Drumline is a great movie -- but you have to see it for what it is ... not what your preconceived notions lead you to believe it might be.This movie is all about exposing people to the world of Black College marching bands. You couldn't have a movie that was 2 hours of nothing but band performances so you HAD to wrap a formulaic story around it. Boy meets girl/boy loses girl/boy gets girl back and learns the value of teamwork in time for the big showdown is a formula that has worked for years -- and it works here!Another poster remarked that the band camp scenes were unrealistic because they were too militaristic ... he didn't believe that (among other things) that the students would be made to run around holding their drums and so forth. Well, believe it!I marched in one of these bands (Southern University in Louisiana) 20 years ago and back then, band camp was FAR MORE INTENSE than anything you see on the screen in this movie. YES, it is that competitive. YES, it is that grueling. YES, it is that disciplined. Black College marching band is serious business and this film gives you only a small sample of what it takes to make the band.The actual band performances are AWESOME and will definitely be an eye-opener to anyone who has never seen this type of thing before. More importantly, there is no sex, violence, drug use, and very little bad language (just the requisite d*mns and h@lls - nothing any more intense than prime-time television.) Equally important, the movie features strong male figures who resolve differences without resorting to pathological violence.One last point -- the movie grossed 13+ million dollars in its opening weekend. And this was against Star Trek (18.7 M) and the Jennifer Lopez (19 M) movie. Although it finished in third place, it was shown in about 1,000 fewer theaters than those two. It had (by far) the highest revenue per theater for the weekend!Do yourself a favor -- open your mind and see this movie -- you and your family will enjoy it!"}, {"id": 173, "text": "Former drumline member here.  Well damn, I guess I'll be the first drummer to say I liked the movie a lot.  I swear, half of these reviews I'm reading are annoying - people bashing it because it's an all black movie, people bashing it because the band has dancers instead of a color guard, people calling the drumming rudimentary because they played in a drumline that did better blah blah blah.What do you guys want, a documentary on marching band?  If I was to make a Hollywood movie about the drumline I would have done the same exact things with the drum sequences - put in a gang of stick tricks and showmanship that would translate well to the screen.  Nobody wants to watch flam taps for 90 minutes.That being said, the last drum battle is one of my favorite things to watch. I love when the bass drum cadence comes in, the basses march in a circle, the quads toss each other their sticks between bars, and the snares have an orgy of backsticking and other stick tricks on a level you rarely see performed in real life.  And the movie is only cliche as far as its kid w/ bad attitude needs to put his pride away plot goes.  I don't watch Nickelodeon so I haven't seen one of those types of movies since I was... hmmm since I was 5.  Far as what isn't cliche about it, there's a lot to like.  One of the best things is that it immerses itself in Afro-American culture w/out any cliches at all - just life as it is down south at an all-black university.  No guns, drugs, none of that stuff that you'd expect from a character who walks and talks like Nick Cannon's character does. I also liked the way they handled the white character in the band.  The dialogue where they ask him why he went to the all-black college.  His first reply is a wink at the audience, which would expect Hollywood to trivialize race relations like that.  Then he goes, nah for real though, and gives a sincere answer that makes sense."}, {"id": 174, "text": "I'm not one of those people who moans and groans that movies today are so full of trashy language (or sex or violence or whatever), and that there's not enough wholesome (that word gives me a pain) entertainment for the family.  For all those who do (and even those who don't), here's an energetic film that manages to entertain while eschewing content that could conceivably offend anyone (unless they find even the tiniest amount of innocuous, lightweight hip-hop too much to take).The thematic ground here - young hotshot learns to sacrifice for the good of the team; underdogs strive for triumph - has been covered countless times before, so DRUMLINE wisely boils the plot down to its barest elements, for the most part sidestepping the obligatory contrived obstacles and setbacks, and plays to its strength: the music.This is a story about college marching bands, focusing in particular on the members of the percussion section, and a good 50% - if not more - of the film concentrates on the lively and elaborate performances of the bands, which are complimented by equally lively cinematography and editing.No, it's not deep and, yes, it's old fashioned.  In, fact, it doesn't take a lot of imagination to see Mickey and Judy in the roles of Devon and Laila (though probably with different names!).  I mean, these are the cleanest livin' kids you'll see in any recent picture!  But it's solid and it all works.  Oh, and don't be scared off by the idea of so much college marching band music.  Not being a football fan, my exposure to such things is limited to the Rose Parade, and I don't have a clue as to what state-of-the-art is for halftime entertainment these days, but, for what it's worth, this is the best college marching band stuff I've ever seen, and I wasn't bored for a minute."}, {"id": 175, "text": "The talented young smart-ass goes to college and learns there's more to life than being skillful or clever theme is an old one and it's been done better many times in the past. Robert Young learned about teamwork in Navy Blue and Gold. More recently Rob Lowe learned the lesson in Oxford Blues. The difference between Drumline and these and other older films on the same theme is that the lead characters evoked more sympathy. Nick Cannon's Devon Miles character is a self-centered, posturing, swaggering jackass who evokes immediate dislike and though you see him grow up a little in the course of the film, you never really learn to like or respect him.Drumline also suffers from an identity crisis of its own. You're never really sure what sort of story it wants to tell. Is is a coming of age story, a drama, a comedy, a romance? It tries to be all of these at once and never seals the deal on any of them.Drumline could have told a good story about a New York kid learning that there's more than one way to be black in this world. There are a couple of hints of that in Devon's relationship with Laila. Her comment to Devon: Southern sisters don't date...we have boyfriends, could have been an opening to a good subplot about differences in black culture between different parts of the US, but, as with so many other possible plots, the story touches it lightly, and then flits off to something else. An arrogant young freshman such as Devon would have had many lessons to learn while finding his way in this environment, but the film misses nearly every opportunity to show us the relationships between the characters in any depth, so the performances come off as predictable and mechanical.All the same, I've seen Drumline several times and enjoyed it for what it does very well. The presentation of the music and and the work that goes into running a big university marching band are very good. I could have done with more of both. The all-too-brief glimpses of life at a black southern university are well done. Again, I could have done with more of that as well. Drumline also had moments of humor, and some visually engaging camera work, especially in the music scenes.I like this movie. I just wish it had been better done."}, {"id": 176, "text": "Those who have been in precision marching bands (yes, that includes the music) know about the hard work and dedication that it takes to be the best or among the best. The message of the movie, as I see it, is about that dedication and sacrifice in order to achieve greatness. Being a movie, of course there are unrealistic aspects woven into the story. For example, Devon should have not have been permitted to rejoin the band until he could read music. Because he did, it shot a big hole in one of the main underlying moral principles of the band. Still, we're talking about a movie. I experienced great emotional appeal watching the hard work of the team. Sure, if it was a complete story about a marching band, the movie would fall far short, but who would watch a 20-hour movie about a marching band? It certainly would have been more realistic to include the pranks and general fun that we all had to have in between all the hard work just to stay sane. The movie as presented may not be entertaining to anyone who has never worked hard toward a goal with a team, but for those who have, I'm sure they will see a piece of themselves and their experience in Drumline. It's easy to find criticism in virtually anything. If we accept the basic good message of Drumline and allow ourselves to be entertained by the music as presented, it will be a movie that will be watched and enjoyed repeatedly. For those who actually think there are race issues in the movie, pay more attention to the people in it and what they are trying to do with their work, and you won't see any color. With some luck, maybe one day, you'll know what it's like to be in a marching band."}, {"id": 177, "text": "The picture results to be a dramedy concerning a rebel drummer young (Nick Cannon) who is admitted in Georgia Academy to take part at an important band. But his rebellious temper causes frictions with orchestra director (Orlando Jones) and the band members . Meanwhile , he falls in love with a cheerleader (Zoe Saldana).In the film there's a varied procession of characters , the habitual group of misfit roles ,including the only white boy among different color young people , or the sole girl among all men . The story is narrated with great sense of ductility and intelligence and it has its good moments here and there .It's an enjoyable movie, but uneven comedy , it works better when the drummers go into the action. The motion picture has comedy , a love story , giggles , drama , and breathtaking musical spectacle with groundbreaking choreographic set-pieces. Before the spectacular final meeting on the stadium , they contend with each other , but finally learn the meaning of life , and , ultimately , come to respect each other . The film climax is the spellbound and gorgeous final duel on the furlong where both bands confront to achieve the winner prize . Zoe Saldana is attractive and enticing , ready as a future star in guess who¨ , the newcomer Nick Cannon as the roguish and cocky young gives a first-rate interpretation . Orlando Jones as the tough director is excellent , his acting is likeness to the stiff-upper-lip sergeant Louis Gosset J.R. in ¨Officer and Gentleman ¨ . Big budget production features an impeccable musical score by John Powell. The movie was well directed by Charles Stone . Rating : Above average . Worthwhile seeing for its extraordinary musical choreography ."}, {"id": 178, "text": "A talented street drummer from Harlem who enrolls in a Southern university, expecting to lead its marching band's drumline to victory. He initially flounders in his new world, before realizing that it takes more than talent to reach the top.After I've just seen the first 10 minutes of the film, I already knew it would be a fantastic film. I don't know why there is so much hate in this film on IMDb, with a low rating like 5.2/10?! Maybe people can't handle the fact it's just a really good film.I like the marching band world. I'm in it at school and I love the fact it holds true to that. The bands in the film were creative with their skills, fun, and entertaining to watch! I don't even know if you could watching this film standing up without jumping with the beat because it will make your feet tap.The acting by Nick Cannon, Zoe Saldana, Orlando Jones, and Leonard Roberts were all good. This film, like Akeelah and the Bee, Last Holiday, and Barber Shop, is what makes films with a majority African American so good. The drum sequences in this film are amazing.If you hate this film just because it's black, you are what makes the world bad these days. This is afar from being a bad film. It's a wonderful, very entertaining, and has its funny moments."}, {"id": 179, "text": "Thi movie gave a good presentation of the way every high school graduate feels as they leave one phase of their life to enter another. Every high school graduate, particularly one who has excelled at some endeavor be it extracurricular or academic, has a certain ego about themselves, and that ego has taken over their personna. Drumline captures the feeling of on youth as he must deal with the fact that his ego has now gotten in the way of being able to be part of something larger than himself. Even though he individually excels, he must understand humility, and learn how to be part of an organization. This is a life lesson that he learns while being part of this band and finally understands that his goals and the goals of the band are the same. This movie could be set in any environment, but the fact that it depicts an African-American youth coming from urban life I think heightens this theme, plus the fact that he is surrounded by other African-American students and professors lets him see that success in life is color blind, if one has the guts to go for it.I think this is one of the better character studies I've seen in a while, and the marching band and drumline setting make the movie that much more entertaining. By the end of the movie, this man, this school and this drumline have all become heroes and you actually can take in the excitement of the moment. Probably not since Breaking Away, have I seen a movie that has captured the human experience so well."}, {"id": 180, "text": "I'm a former band guy, and watched this movie knowing how cheesy and foumulaic it would be, but I assumed I would enjoy it the way my wife, a former cheerleader, enjoyed Bring It On.  Nope.  There's nothing enjoyable about this movie.  The story was cliche, the characters were stock, the direction was amateur, the situation was ludicrous, and the music and marching were a joke.  I kind of thought they'd use, or at least model themselves after, real SWAC or MEAC bands and players, but the music sequences, which should have been equivalent to the game sequences in sports movies or the performance sequences in arts movies (e.g. Fame, Center Stage, Bring It On - kinda), were so low quality they were laughable.  20 High Schools in my state could have easily won that competition, and every drum corp except maybe the Troopers.  There was some special attention given to, can you believe it, the drum line, but ultimately, the sequences were boring and monotonous, and the cadences rudimentary and annoying.  Since the story was utterly predictable, let me rate the performances in this movie, using BOA scoring:Music Performance Individual:  12/20 - The closeups were the best part, and Devon was good enough to be in my college percussion section - on cymbals. Music Performance Ensemble: 5/20 - One band, one awful sound.  They couldn't even play a Bb scale in tune.  Seriously. Visual Performance Individual:  5/20 - Hey, Devon?  Tick, Tick, Tick... Visual Performance Ensemble:    3/20 - Straight lines are not that hard to maintain when you stand still for 5 minutes..  Maybe you guys should be introduced to a thing called Marching.  In a few years we'll move on to another thing called Drill Design. Music GE: 15/40 - Dr. Lee, let me introduce you to a thing called a Theme. There's nothing wrong with quick cheers and fanfares in the stands being based on hip-hop, but you may have noticed that the melodic lines of most contemporary hip-hop tunes are not exactly ever-changing.  In The Stone was cutting edge about 20 years ago, but now every high school band plays it. Visual GE:  4/20.  Atrocious dancing, flat footed marching, no concept to the shows at all.  While we're doing Band 101, there's a new concept called Color Guard you may want to look into.Total score:  44/100.  OK, so maybe I was too stingy:  there are at least 50 bands in NM that could beat that score.Oh, one comment made by another user I agree with wholeheartedly:  UCLA sucks.  Fight on, brother."}, {"id": 181, "text": "I hate this movie. I just think this movie is bad. The drumming is spectacular, but the dialogue is horrible, and the main character is a brat who can't even read drum music but somehow got a college scholarship for his drumming. It is also surprising that he got a scholarship because throughout the movie he rebels against the coach. You are supposed to feel sad for the star as he is kicked out of the drumline numerous times for various reasons, but i just felt glad that the movie might end there. But it didn't. This is an enormous waste of two hours in my opinion. One part of the movie that especially comes to mind when  say a waste of two hours is a scene where the drumline section leader walks up to the drummers one at a time and plays on their drum with them walking forward. The drummers are supposed to follow. No one is is able to do it except, of course the star of the movie. But once he's is done playing the part with the section leader also playing on the star's drum, the band teacher walks up and says somethin to the effect of you do what i tell you to do, and you're an asshole. I hate this movie. I nearly cried when i saw Ebert gave it 3 stars out of four. My rating: 2 out of 10 stars. And this movie earned that rating."}, {"id": 182, "text": "I'm a Caucasian teenager who graduated last spring from high school. I was highly active in the marching band, indoor percussion and concert band and I kind of have a problem with people seeing this as Black Cinema.This movie, while featuring a mainly African-American movie, is not about just that. It's, at heart, a marching band movie, something my friends and I have been looking forward to for years. It's often an overlooked part of high school and college, and I'm so glad the genre was kickstarted with this fantastic movie.I loved the training sequences. My band camp wasn't that intensive (our band was a little more laid-back), but we loved it just as much. And Dr. Lee? He reminded me so much of my old instructor, it was really sad. Orlando Jones turned in an incredible performance.I went to see this movie with a friend who was also a graduating member of the band last year. We both expected to like it, because of the band connection. We came away loving it. This movie is incredible--it made me nostalgic for my band. I really miss it and this movie helped me remember how much it was a part of my life.I recommend this movie for anyone, but mostly for people who've graduated either high school or college and left band behind. It'll jumpstart your memories all over again."}, {"id": 183, "text": "Orlando Jones is the music director of a college band department that has recruited band's next big thing, a drummer out of Harlem (Cannon) who faces the usual growing pains while feebly attempting to prove that the band members belong on the same level as the jocks...Before you start chastising me for knocking the band and all the times we had in high school, I am only saying that band members are not on the same level as jocks, but they ARE athletes at the college level.  During the half time of any college game, it is the band's responsibility to keep the fans entertained and want to stick around for the second half (no matter how bad the football team may--or may not-- be doing). (And besides, I was also in band in high school.)Jones meets with some resistance as he attempts to deal with the next big thing, both from his boss, his peers, and the section leader of the snare drum section.  But there was a side to this film that I did not expect...college band's Super Bowl, if you will.  The sites are spectacular, and cameos add to the zest behind the scenes as Jones' band squares off with his old mentor's band for all the marbles..."}, {"id": 184, "text": "One expects a predictable plot in a typical exploit-what-a-demographic-likes- and-take-it-to-the-bank Hollywood puke, however, this film will be a shameless assault on your sanity. You know what characters will say and do at the opening of every sequence. At two hours long, it is a true endurance test, particularly considering that I would have gotten up and left after 10 minutes (or, rather, not gone at all) if I hadn't been dragged to it by someone else.The one thing that did amuse me about the movie (which I'm sure the rest of the audience missed) was the Full Metal Jacket homage at the beginning. Findingthe lead character so irritating only a few minutes in, I was quite disappointed he did not receive a punch to the gut during his confrontation with thesergeant.If you like drumming or whatever, then go see it. You'll probably like it. But if look for anything else in your cinematic experience, you will be bored."}, {"id": 185, "text": "I'd like to start out by saying that if fans will recognize this film for what it is, a movie that consciously tries to be realistic, while throwing out a few bones to those who want the gratituous love story, etc, then they will be a great deal more likely to enjoy it.This movie was very realistic. I never marched in college, but I marched all 4 years of high school, and down to the militaristic band director who wants to stay true to real music, this movie hit the nail on the head. A non-band-geek won't believe how in-your-face and competetive the marching band can be, but it is almost exactly like this movie shows.With the killer performances, the reactions of the crowd, and even the fraternity that I became a part of, this movie really brought back the memories.One more word about the fraternity. Kappa Kappa Psi is an actual fraternity. The National Honorary Band Fraternity exists all over the United States, and was portrayed very well in this movie, down to using the flag and everything. I am an alumni member of the Zeta Rho chapter of Kappa Kappa Psi.To the brothers, please continue to Strive for the Highest in all that you do.In the Bond, AEA. -ChrisTo everyone else.watch this movie with the knowledge that it's true to life, and a great movie.-Chris"}, {"id": 186, "text": "I didn't expect to learn anything new this winter movie season. Harry Potter? I read the book two years ago. The Two Towers? I don't want to admit how long ago I read that one. James Bond? Guns, gadgets and girls -- the longest running franchise in movie history. Star Trek? Let me guess, the Fate of the Universe is at stake.  I expected  Drumline to be another African American comedy, a Mr. Holland's Ghetto. Instead, I was shown a whole new world, one I had no clue existed. I needed to check the Internet to discover that Atlanta A&amp;T, the school where the action takes place, is fiction, but the other schools whose bands march in the competition scenes are real.Ok, so the plot has been done so often we know it by heart.  Talented kid with a chip on his shoulder, unwilling to pay his dues, ticks off his drill sergeant, who then embarrasses him in front of the captain. Kid grows up a little, gets to lead the charge and wins the girl. There is even the package from home scene. Drumline doesn't completely follow the formula, however. The kid never cries and the sergeant doesn't fall on a live hand grenade to save his squad. Apparently they don't use hand grenades in band, though given the intensity of the competition, that's surprising.But the characters are engaging, the story works and the band performances are spectacular.  Marching band as a major American art form? I would have assumed that was the punch line of some joke before I saw Drumline.  Now it's undeniable.  A cleverer plot could have detracted from the real story, the talent, team work, energy and grit of these amazing marching bands. See this one on the big screen if you possibly can."}, {"id": 187, "text": "I make it my point to support certain African American films opening weekend.  Drumline just became one of them.I agree with a Commentor about Drumline being a good movie as far as feel good and entertaining.The movie does not touch on several aspects that were presented. Issue's that are brought up are skipped over, and there are too many montage's. One or two is usually exceptable. But this movie has four.  Can't be lazy!Also, the two main female character's are both high yellow. One, with not so many lines has a stomach (pregnant) that all of a sudden goes down, and the audience is left to make up a story line again.  And the other, Devon's girlfriend is a depictment of a black white girl. There are too many films that depict these roles as exceptable only if they are yellow and have European features and certain hair. There are millions and millions of beautiful, multi-talented brown and dark African American Actress's, inlcuding myself, who are very fit, attractive and tall. The only other time females are featured in the film is when dancing, in brief, during band playing segments.Overall, the movie did spark my interest throughout.  It is up there, at least this weekend, in the top three with 13.0m.  Congratulations!"}, {"id": 188, "text": "Drumline rocked.I was expecting something kind of exploitive, you know. Caricature characters (ala Varsity Blues) or just dumb with heart (the replacements), but instead I get something completely different. The characters were not stuff I've seen before. The lead has something special that will hopefully make something of him. Orlando Jones can act, he does more than the broad comedy you see. He created a very plausible and interesting band director, he doesn't go for the cliche Mr. Chips. he creates a singular teacher.The easy way out would be to have the Harlem kid strut around classes proclaiming how Black he is and how the serious musicians in the band just don't get it.  That doesn't happen here. Devon makes it clear from the start that 1. he hasn't been arrested. 2. has no kid 3. and he's ecstatic to be going to college to play drums. This movie doesn't get lost in blackness, it respects its characters enough to let them lead their lives and not live up to the caricature. Devon is classic big fish in little pond and he gets the rude awakening. And his mistakes and attitude are punished, I believe. He's forced to watch something he can't compete in fully. not that the film doesn't end predictably. Predictable matters not when the outcome is presented as inevitable. This film didn't choose to end this way, it had to end this way, every moment building on the last. But the real star of the movie is the band.  For band geeks like me, its great to hear the one band one sound adage being presented so earnestly. I expected this film to have issues combining the group aspects of band with the individual needs of a film. How do you root for a band as a whole, especially a group as large as a marching band. Well, you create subgroups, the band into the drumline, into the competition between the first and second snare drummers.When I saw Bring it On, a film that made this film possible and marketable my major critique was that the routines were visually interesting enough to support the investment that an hour of movie is asking for. I didn't see what all the fuss was about. In Drumline, the performances are shot (using high speed film, moving cameras and a dedicated editing style) in ways that not only thrill but are incredibly impressive. You understand why its such a big deal to these characters because you yourself are still breathing hard from the performance 10 minutes ago.I'd put this film inline with the previous films these past few years (soul food, barbershop, the wood, etc) as a new New Black Cinema. Different from the previous NBC (boyz in the hood, menace II society, etc etc) in that they are not about being black in america as much as they are about just being people, with their own histories dealing with the stuff that white folks have been dealing in movies for decades now. Getting the girl, getting in band, moving away, running a business... And for one I'm happy to see the shift."}, {"id": 189, "text": "An extremely talented drummer from the inner city is recruited to a Southern university because of his playing skills.  It is there that he learns some truly important lessons that will serve him well throughout the rest of his educational and professional career.So often Hollywood depicts African-American males as drug users and sellers, pimps, gangsters, convicts, etc., as if that's all the whole race of people is about.  Finally a group of hardworking, disciplined youngsters, in school with a purpose, a schedule that I never would have been able to keep up with, and the know-how to have fun,  producing some of the finest marching band music around. A wonderful story about growing up and learning that it's much more fulfilling to work for the well-being of the whole group than just for our own selfish needs.The Halftime Programs, drumming and dancing and stepping were extremely entertaining and the message so positive I could see this movie again and again."}, {"id": 190, "text": "Well after the cheerleader movie Bring It On and Mr Holland's Opus and The Skulls, and Dead Poets Society and The Emperors club, who'd have thought someone in the US mid west would be clever enough to put them all together and add a marching band...... Its a pity Robert Preston was dead because I am sure he could have sold them the outfits left over from The Music Man. But, I do have to say, this is the best (almost) all black musical since STORMY WEATHER ....and has a very funny sense of humour (pimply faced tubby burger fed white boy playing a huge tuba) and quite a good script. The lead character, Devon Miles is the usual ghetto jerk with the boring ego- attitude and the script has fun sorting him out. Like TO SIR WITH DRUMS this is an uplifting college musical without being a musical and shows that really we are still at Monogram Pictures college in 1943 with Mantan Moreland and Cab Calloway. Released here in Australia on ONE print, and invisible advertising, it grossed only $900 in its first week. A long way from the $56m gross in the USA, so I guess it will drum itself off screen this week. Pity, it's a lot of fun and the music is sensational. I will buy the CD soundtrack if it is available here and encourage us whiteys to go see it and get some jive or something. All 5 of us in the cinema today were having a great time, and it must have been a treat to see it in a crowded Magic Johnson multiplex in Sth Central USA."}, {"id": 191, "text": "I wasn't sure what I was getting into when I began to watch Drumline, but after hearing the buzz it created, I was willing to give it a shot.  While there was little to no back story, or that much of a plot that hadn't been done one hundred times before, I still found this film to be entertaining in a flashy way.Drumline is the story of a recent high school graduate who has received a scholarship to a southern university to play with their school marching band.  We see the military-esque drills and follow the band to their `championship moment'.  The pacing is good, the acting is decent (with a surprisingly understated performance by Orlando Jones) and the obvious star is the music and music talent, which saves the film from being a complete disaster.Unfortunately there was no back story to the characters, there are many plot holes, and conflicts seem to easily resolve themselves.  However, criticizing a film like Drumline for missing these elements is like criticizing Charlie's Angels for being superficial and flashy.  Drumline is clearly not supposed to be anything but about the music and the music program, just as Charlie's Angels fully intended to be exactly what it turned out to be.  If I were to criticize Drumline harshly for not being more `deep' I would have to do the same for many other films as well, something that is completely unnecessary.Watch Drumline if you are not looking to think, but instead to be entertained.  The showmanship and theatrics are incredible.  And while I'm not certain the regiment the band members went through is typical, it was certainly interesting to see that their recruitment and training programs were not unlike those of many sports teams.  A definite popcorn flick, Drumline is worth a shot.--Shelly"}, {"id": 192, "text": "Comedy Film and what more do you expect?It's FUN throughout the movie, and it follows the four steps of composition or development. Nick Cannon was a bit immature and selfish causing problems with a fellow bandmate. The movie clearly shows how the protagonist grows into a mature young adult and how he develops friendship, making the whole band united. Because the movie evolves based on specific steps of plot line, it is easy for audience to follow.Excellent Drumline Performance. Some of the movies with musical piece or performance turn out very boring and crude. However, the drum scene is incorporated with rivalry between two schools, strengthening intensity and tension.I personally think the movie is underrated because it is an old comedy movie AND showed a lot in the MTV, BET, or other entertainment TV channels. Film itself is good quality and worth watching a few many more times."}, {"id": 193, "text": "African American males often use Music as part of a wonderful learning style and this film is a hilarious and inspiring exposition of this fact. Nick Cannon is on the beat as Devon Miles, a musical prodigy with a gift for rhythm and percussion. Orlando Jones is a revelation as Dr. Lee, a different kind of black hero who uses his mind and his teaching skill to win adventures in learning rather than relying on guns and fists. He easily and naturally reflects the kind of personality that populates many urban environments working tirelessly to raise the tone of the entire community.I also enjoyed the conflict and tension between Cannon's Devon Miles and Leonard Roberts' (of 'Heroes' fame) Sean Taylor, head of the Drum Section at the Southern University Miles has won a scholarship to attend. Once again, as in the movie 'Accepted' the creative nonconformist butts heads with the system and its representatives and learns the value of humility in cultivating natural talent. Something like 'The Natural' with drums, but minus the lightning and the thunder if you discount the emotional fireworks between the lead characters themselves.That's it in a nutshell. The final 'Drum Off' between the two competing Universities at the end of the film captured more about the Black Aesthetic than anything I have seen in a long time. I thought it was a beautiful set piece and kudos to Director Charles Stone III and his Cinematographer Shane Hurlbut. The beautiful thing about this scene was that despite it sensationalistic aspects nobody was maimed or killed to accomplish the ultimate dramatic effect. You can feel the intense passion of the African American to rise above that factor of their legacy that involves oppression and exploitation, but here that angst is discharged creatively rather than destructively.Zoe Saldana (of 'Star Trek' fame) as Laila, the romantic interest of Devon, demonstrates through their relationship the steps our main character must take to socialize his tremendous talent for the greatest benefit to all. J. Anthony Brown makes a worthy adversary as Mr. Wade to Band Leader Dr. Lee before and during the BET Competitions for best University Band in America. But what I really liked was how the story revealed the African American Community seizing Learning and Music as an appropriate choice of weapons for attaining greater freedom with an in-your-face style and panache."}, {"id": 194, "text": "The urban culture depicted in Drumline is without a doubt the softened, fictionalized version built for a PG-13 film. Yet it doesn't need to be vulgar. It's a sweet, innocuous parable about a school's marching band, erecting a pleasantly unfamiliar atmosphere known to few American audiences, and too, showcasing actors of charm and set-pieces that almost touch the status of sublime.I've had a countless number of debates that centered around school and extra-curricular activities and my general disinterest in many of them. I could always admire the time, effort, and devotion many put into their favorite activities, whatever they may be, but my place is more behind a computer rather than out on a field or a track. I've continuously mentioned, however, how school bands, both at high school and college level, go mostly unrecognized due to the bigger entertainment that awaits after they finish. There's an enormous amount of practice, perfection, and devotion that go into making a band a success, and Drumline makes no attempt at shortchanging that.The film centers on the likable, yet troubled Devon Miles (Nick Cannon), who has just graduated from high school and looks to pursue an invaluable four years at Atlanta A&amp;T University. He wants to continue formulating his musicianship and excellence in the field of percussion, and has aspirations to make the awe-inspiring drumline the school has to offer. Yet because of his smarmy, often surly attitude, his position on the band is rather in limbo with Dr. Lee (Orlando Jones), who is annoyed by his ability to change not only moods but notes at random. Then there's the romance we love to watch unfold. This time, it's with Zoe Saldana, who plays Laila, who is often off-put by Devon's attitude, yet knows there is a good person wrestling with the worse one.This sort of inner-character-conflict can grow tedious at times, with Devon adopting a rather up-and-down personality to almost everything and often challenging those who do not look to challenge him. But Drumline doesn't capitalize off of this so much as it does several things that boost its story above the level of simple Saturday morning fare. For one, it is occupied with riveting, highly-detailed set-pieces that exfoliate the theatricalities beautifully, also allowing the set design and painstaking choreography to assume the forefront.Secondly, it pleasantly subtracts needless elements of the story that could've further stretched out the already lengthy film to a level channeling tedium. For example, the film is in a grand-ole position to have Devon kicked off the school band because of the potential possibility that he is not doing well in his classes (we only see him on the field practicing or performing and rarely with his head in a book or body in a desk). Thankfully, there's no contrivance that Devon is very skilled when behind a drum, but in a desk he's inept and anemic, and there's the reason he can not be on the band. When he is punished, he is for his own belligerence and disobedience to policy and disrespect of intimidating authority. He's a flawed character. Not a stupid one.And finally, writers Tina Gordon Chism and Shawn Schepps prevent the entire project from veering off into mawkish sentimentality, despite, yet again, being in a great position to do so. Throughout the film, there are hints that Devon's absent father only affected him in a small way, seeing as he was still kept fulfilled, nourished, and motivated by his peers and, most importantly, his mother. What Drumline doesn't need is a sob-story about a youth who is troubled because of the lack of a father figure he somehow managed to get by with for several years up until college begins. Again, Devon is a victim of his own actions. Not the fact that he lacks a father figure.Then there's the obligations I have as an aspiring film critic, or an amateur one, whatever may have you. That is to recognize that the film does rely on formula and familiarity to get by for a good portion of its runtime. But the reason we watch a story like this unfold and stick around for the two hour runtime is because we enjoy the setup, reside with the characters, sympathize, or even possibly empathize, with what they're going through. The film is an achievement worth cherishing, and if it may be labeled as contrived filmmaking, it should at least be worthy enough to take notes from. Insert drum pun here to conclude review.Starring: Nick Cannon, Zoe Saldana, and Orlando Jones. Directed by: Charles Stone III."}, {"id": 195, "text": "You've seen this movie before I promise you.You have a high school drummer and predictably his Dad doesn't believe in him or his ambition. This kid's unorthodox style doesn't sit well with the college, is torn between his friends or his music and all sorts of stuff like that. Nothing worthy of note happens until the climax and oh boy is it a climax!The final sequence is really really great 5 star entertainment. They should have just made the whole movie about this!First you have each of the colleges perform a montage of music which is all very well but the real show stopper is the final drum line showdown which is just incredible. If you need to demo your home cinema that's a scene worth a look.So yeah. Just skip to that part. Or if your not into that at all you can skip the movie altogether, you can always watch the final scene on Youtube."}, {"id": 196, "text": "This movie, though not exactly correct, is awesome. Finally a movie that shows marching band in its true colors.It shows all the hard work and discipline that goes into making a fantastic field show. Blood, sweat, and tears.The band in this film isn't really a corp style band. It's more flashy stuff. The music is relatively easy to play, and the audience has a good time watching the dances and horn flashes.There are some flaws, however. But, you will never find a movie that is absolutely perfect. One of the obvious flaws is how long the band pauses between sets. In an actual marching band there is way more movement. On average you will stay in one spot for about eight counts. Sometimes less, sometimes more.But, other band people can truthfully say that it is pretty accurate. A good, fun movie for everyone."}, {"id": 197, "text": "I liked the band related parts of this.As in most movies from the last 30 years, the time wasted on the absolutely pointless romantic interlude could have been better spent developing other parts of the story.I liked the story of the competitive world of marching bands, but think we could have seen more of the heart that the A&amp;T band put into its work.I liked Orlando Jones, even if he did not quite seem to carry the torch as a serious but compromising leader.At the end of this I found myself checking to see if there is a real documentary about this intense world.Nevertheless, on balance I found myself rooting for the home team all the way to the end. This film sends you on a fun trip, and I enjoyed the time spent."}, {"id": 198, "text": "Sometimes we anticipate far too much from a cinematic production, always expecting an Oscar-winning performance for our hard-earned dollar. This film needed to be made and I'm glad they did it. Historically, we have seen a multitude of films that depict the passions of various sub-cultures. We've watched non-documentary films about the passion for bicycle racing, chasing tornadoes, ballroom dancing to name only a few. Few have delivered academy performances, but nevertheless remain in the memories of those that love their art. They serve to expose the mainstream to a particular craft. Drumline's predictable story line is simply the standard framework that supports an underlying passion for the marching band's drumline. Sharing a love for music, rhythm, performing arts and athletics, I found this film quite entertaining. I chose to focus my appreciation to the film's passion for the beat. Marching band purists will undoubtably pull the details apart. Perhaps sitting down with the 5.1 sound cranked up enhanced the experience, but there is magic in seeing the final tie-breaker sequence unfold. Camera technique and movements were dynamic, artful and do not go unnoticed. Added creative touches to the credits held this viewer's attention after the story ended. A fun, easy view, Drumline leaves a wonderful impression of the craft of the college marching band!"}, {"id": 199, "text": "When you see a movie like this one, you've gotta know it's not going to be some epic tale of historic proportions -- or chock full of accurate nitpicky details. Hell, it doesn't even have that pretentious The in the title.I thought is was light, funny and entertaining. Which is what I thought it was trying to be.What I didn't expect was some intelligent, deft handling of racial stereotypes that was at the same time refreshing and moving.I thought the technical drum work was great, too. The backsticking and stick grabs in the final battle was just amazing.Was it real? Who cares? Was it accurate? I don't know. Were they Oscar caliber performances? I wasn't looking for it.Drumline is a fine film that delivers what it promises. Nothing more, nothing less."}, {"id": 200, "text": "Many of the negative comments here miss the point. This is a formulaic movie; almost everything in the plot is predictable from the beginning. With films like these, it's how they tell the story not the story. And this is well told. It's fun, it's entertaining and the characters and performers are very appealing. The script has some problems -- there are too many sub-plots, some character conflicts are predictable but not convincing -- but films of this genre are not typically blessed with great plots. So what?It's the characters that count and Devon has an approppriate and largely believable arc in the film, Laila (his girl) is sweet, believable, appealing and with a perfectly acceptable arc, Dr. Lee (Orlando Jones) is only OK and the film would have been better had his character been a little better realized (in the script). Jones does as much as possible with the role, however. \\ So sit back and enjoy it. It isn't the best movie of all time, probably not the best of its genre, but it's fun and occasionally touching. And that is a lot more than one can say about the majority of movies being released of late."}, {"id": 201, "text": "I must admit to being surprised by the extreme feelings about this film reflected in the other comments here. To my mind, this is neither the worst movie ever made, nor is it Casablanca. Instead, it is a highly predictable formula film in a setting-with-a-twist, that of the halftime bands in the HBCU (Historically Black Colleges and Universities) environment. The drumming is quite good, and will likely be an eye-opener to the majority of people who are not familiar with drum corps, HBCUs or band in general. It is not, however, the best-of-the-best that one could have hoped for (see Blast!, or the annual real-life competitions for those). The acting is solid, with Orlando Jones being a real standout. Newcomer Nick Canon exudes a fair bit of charm, and is appropriately cast.All in all, this film will be revered by past and present band-members, HBCU grads, percussion fans, and middle class urban audiences. Its point will be completely missed by blue-collar conservatives, inner-city gangstas, and people who have no idea of (nor interest in) HBCUs, drum corps and modern Black cinema. If you fall into the former category, by all means go and see it before it leaves the theaters (those drumlines are great on the big screen). If the latter, you should probably save your money. As a percussionist myself, I give it an 8 out of 10 n]."}, {"id": 202, "text": "Drumline is for anyone who has ever been in a high school band, or gone to school football games, or enjoys the Thanksgiving parade, or believes in the power of music, or heck, just likes a feel good movie.  A debut feature by almost all involved, this feels natural from the opening scene of a high school graduation in Harlem on to leading us through the fascinating and arcane boot-camp world of Southern Black college marching band competition. This is a movie about African-American young adults who go to college, who study in the library, have majors, work (OK, and play) hard, have and develop their skills, whose even absent parents are gainfully employed, and are proud to be selected for a national honor society.  And it's a heck of a lot of fun! Sports (and hackneyed sports movies) aren't the only way black kids can shine; as one character explains about these bands: Half-time IS the game. The band performances are as entertaining as the cheerleader demonstrations in Bring It On.  This does feel like a sports move; there is more than a hint of Slap Shot in the battle between the Old School approach to classic band routines vs. the new one that incorporates hip hop culture (as a fundraiser I was interested in the issue of alumni pressure and the dangling of donations.)  We got a hint in Time Machine that Orlando Jones has a lot more chops than his goofy clown persona but his band leader with principles pressured by his boss and his students is a nice take on Denzel Washington. The engaging lead, Nick Cannon, evidently used to have a comedy show on Nick and one of the band members has a last name of Poitier, but they were all new to me. Yeah it borders on predictable melodrama a la Mr. Holland's Opus, but it's so grounded in these unfamiliar specific situations that I was not a step ahead. My only qualm was the women's roles.  Even the Old School approach includes scantily clad dancers doing MTV-style salacious choreography as the cheerleaders.  While there's one prominent woman band member with corn rows who gives as good as she gets, the rest of the African-American women follow the Halle Berry model of black beauty with straight hair (who have to wear Afro wigs for the '70's tribute). Are even black producers now particularly looking to cast mixed race women like Berry who have what are perceived as more white features?  But I will certainly look forward for when the real marching band championships are on BET!"}, {"id": 203, "text": "OK film, in the vain of The Program but his film misses in too many areas that could have easily been fixed.  The Direction is awful, though by reading some comments it is an improvement for Stone.  The three main people are good, but too often I could not understand where each scene was going, or how it connected to others.  The big finale is a drumline competition at the center of the Georgia Dome.  But the judges are on the sideline, and how can they see what was going on?  It seemed to be more about how I could stick my drumstick in your face, then good drumming.  In fact, no foundation was ever laid for how good Cannon's character is supposed to be.  He sounded like all the others to me.  On the plus side, Orlando Jones is fantastic! He really carries the film in many spots and has presence the others lack.  He is very cool as the head of the band program, if only the others in the film came close to him.  I had never seen Jones in a non-comedic role, but boy was I impressed!A 5, worth a look"}, {"id": 204, "text": "Just to give you some perspective, I was in a college marching band myself. It was in the Midwest though, so we were more traditional than what these guys pull off in Drumline. As it is, my only experience watching a band like this came last year when I saw the Delaware State Marching Band perform.Anyway, onto the movie, which I mostly liked. As many reviewers have pointed out, it features an old fashioned story. Basically, you have a high school hotshot (Nick Cannon) who, while a talented drummer, is a poor team player. When he's recruited to the prestigious Atlanta A &amp; T Band, he believes it's his chance to show his stuff with a superior school. But his cocky nature conflicts with both the values of his section leader and his band teacher, and he will have to learn that it takes more than just talent to be a part of his school's drumline.It's an old-hat Hollywood story, but I will give it credit for getting one thing right about being in a college marching band. You HAVE to be a team player. You need to follow instructions and play your correct part. So I will give the movie credit for showing that.Another thing the movie doesn't skimp on is that college marching band is very tough. While our band did not have to run up and down stairs with our instruments held high or do tons of push-ups, we did have to practice for almost 12 hours a day every day in the August heat, and then practice every day for at least 90 minutes from the September heat to the November snows. You have to treat marching band like it's a living, and this film does a good job showing that too.The acting is fine on almost all counts. I especially enjoyed Orlando Jones as the band teacher; he reminded me of a couple of band teachers I've had in the past. And the marching band performances are zippy, filled with energy, and fun to watch. I guess my only reservation is that I can't think of many people I knew in marching band who had experiences that mirrored Nick's story, so it was hard for me to completely relate to this movie. Then again, marching band is something I take very personally, so it would have been hard for a marching band story to satisfy me anyway.Basically, this is good entertainment, with a couple of good examples of what it's like to be in a college marching band thrown in. Don't be fooled by the 5.2 rating; I have no idea why the rating is so low for this movie. It should be a 6-6.5 at minimum. Considering how few movies there are that even reference marching bands, it's a good thing this movie can at least do some justice for them."}, {"id": 205, "text": "This movie isn't terrible, it just isn't anything except what you would expect.The obvious, well-intentioned, idea that got this movie made was to presenting young black males as something other than gangbangers. I can't complain about the motivation, afterall, black males are ridiculously stereotyped by Hollywood and an attempt to correct this can't be faulted for the effort. So why then do I even make mention of this? My feeling is that the script and screenplay suffer because demographics and theme were paramount getting this movie made.The story is your typical, rebel versus society story. The hero, Devon, has amazing talent but suffers from an enormous ego. His hubris might have been turned into an excellent drama, but sadly the character is nothing much more than a cut-and-paste protagonist. He has flaws, namely his problems with authority, that are only briefly addressed (his father abandoned him), but this is not a serious drama so we only learn about Devon's problems from the outside.In order to make the band seem cool we find most of the training is like football-camp or basic training. Young musicians are belittled, degraded, physically over-worked.There is a completely unnecessary, token white guy.The most redeeming aspect, as many others have noted, is the excellent marching band sequences; from choreography to cinematography.In the end, only a fair movie."}, {"id": 206, "text": "I love Nick Cannon's plug for the R. After all he is R. Kelly's protégé and must thank him for I'm a gigolo and that essentially is his character. Cannon is decent and talented when he doesn't get overly gung-ho on his ghetto smarts. His main enemy screaming I'm tired of your fake ass ghetto whatever sums it up. It still worked. This movie is not forgettable because Cannon can draw a crowd.The beginning gives Cannon depth and the movie doesn't lose it. He's cocky, he's brilliant, he is real, and he's confident. The last trait drew me in for the first battle. I was audibly rooting for Cannon and embarrassingly caught myself. That is good acting. Not necessarily great, but a good character.Orlando Jones deserves his props for he is good. He's stern, with a dry, wry, and fitting sense of humor. He cares for music . . . and his job. There is a part you should see coming, but due to the fact you're not blunted with the situation it can surprise you. It becomes at an at peace moment and offers an honest, refreshing, and tidy wrap up to a very complex and difficult situation. Jones also fits in as a disciplinary character for Cannon helping ease this tension. And Cannon fittingly and naturally honors him (although certainly implied) later. Cannon's girl interest is attractive and learns from him and he learns from her. They balance each other out and look comfortable. Nick Cannon's character is actually a gentleman, whilst Zoe is surprisingly uptight (in character). The movie has predictability and sentimentality, but that's not the focus. The focus is determination, pride, and self-truth. Charles Stone III entertainingly gives you these ideals without dragging down a movie. Those that compare this to Remember the Titans aren't wrong, and that movie is great, but by far more over the head with its message. I say perk your eyes and chill out."}, {"id": 207, "text": "After seeing this movie, I am speechless. I have goosebumps all over my body -- especially after the final competition. Since I was a member of a very large high school band, I can appreciate this flick. If you have never been to a weekend high school football game and saw the band play, yes -- you may not like this movie. Well, I was part of everything regarding bands and sports -- high school and college. So if you have any appreciation for high school or college bands, you should watch this movie. There is also very good cinematography here too. Some of the scenes -- and especially the final Drumline scene were great. There is even a decent plot to this movie. I see the low rating of 5.3 and I'm a bit miffed about that; however, that might be because of the people who have no appreciation of real band and music material. I'm not knocking those people, but maybe they would rather watch Johnny Knoxsville in Jackass; than see this movie.This is a great movie. Please give this movie a chance. It's really worth the time. Every time I see that it is on, I drop everything, and tune in to see it all over again.This commentary is in tribute to Bernhardt Rydjeski, Director of the East Islip High School Marching Band. I don't think he's alive anymore, but I did keep in touch with him until about 5 years ago. Thanks Mr. Rydjeski for the greatest years of our lives -- I really mean that.=============================================================It is now February 28TH, 2005 and I just found out that my friend, Mr. Rydjeski died just last week. He had cancer and was buried in the St. James Cemetery on Long Island. I am so upset about this. I love this man. He was an inspiration to many of us in the East Islip High School band. There were several of us who went on to stardom, in particular, Ron Wikso, who played with Cher for many years. There was also Cathy Tricoli who had a hit single for her efforts. Mr. Rydjeski, we loved you as our band leader and we will miss you intensely. Thank you for all that you have given to us. You gave up many hours of your life so we could have a life of our own. You are a great person and we will never forget you. I truly hope that my prior band members see this message and respond back. We had the greatest times of our lives with you! Rydjeski, Canis, and Gifford. Go EI HIGH! Mr. Rydjeski, we will miss you."}, {"id": 208, "text": "I'm a member of an HBCU marching band in the South and this movie was not a good example of how a real Black college marching band program is run. For instance, no crab (freshman) would ever be caught talking to any old-head (upperclassman) members the way Devin was, let alone a section leader. Nor would a dance troop captain even think about giving a crab the time of day. A crab would be too scared to talk to anyone in the band besides their CB's and CS's (crab brothers &amp; sisters) at least for the first 2 months or so. Any fast-talking crabs would probably get some type of hazing (be it push-ups, running, or getting their @$$....never mind).The half time performances were not realistic and the acting was mediocre. This movie was horrible for anyone who knows anything about Black college bands in the South....Or maybe I'm just mad because the whole idea of the movie, along with some of the copied drum cadences came from MY BAND'S DRUM SQUAD and we weren't even in the movie. I was told that certain Southern Black bands weren't put in the movie because they would actually out-perform Atlatna A&amp;T (a fake college band made of high school band members from numerous bands)."}, {"id": 209, "text": "My younger sister is a drummer and was in marching band all through high school and college.  I always envied the fun she had, although marching in 100 degree heat in Arizona got old...especially when carrying a HEAVY drum around!  Anyway, I just HAD to see this movie, considering my background. There really isn't much of a storyline; nothing we haven't seen before.  The competition sequences were interesting.  What I found annoying was the Orlando Jones character insisting that Earth Wind &amp;Fire  (or Jackson 5) tunes were somehow inherently superior to today's hip hop music...oh, PUH-lease!  IT's POP music!!  If he wanted to be artistic, marching band isn't the place!! And to suggest that somehow 70s pop is superior to today's pop is just ridiculous. That had to be the absolute silliest aspect of the storyline.  Most marching bands play music that can be memorized, stuff that is energetic and will get the crowd in a good mood! I don't think marching band conductors worry too much about selling out by not playing artistic stuff out there on the football field!  But I guess that's not enough to sink the movie.  I give it about 5 1/2 out of 10 stars."}, {"id": 210, "text": "'Drumline' is 'Rocky' for band geeks. While it's admirable that Hollywood seems determined to give every single target group its own little fill-in-the-blank that could story, I wondered during the opening moments of this movie if it had the courage to be more than another knock-off. Nope, knock-off. Sadly, too much of the screenplay was photocopied from underdog flicks of the past and not enough effort went into digging for an original idea beyond being an over-long movie about band geeks.And it sold, to audiences and critics! I've read the reviews for this late-2002 low-budget success and they're glowing. Critics acknowledged that director Charles Stone was high-stepping his way down the path of least resistance, and they let him off the hook for it. Sure, the young cast (mostly black, all capable actors) do as much as they can with characters we've seen over and over and over. Nick Cannon is the Balboa of the group, a super-talented drummer with a 2x4 on his shoulder and a self-destructive ego. Maybe that makes him the Cruise of the movie actually... Kid can drum, no doubt about it. He's got a real knack for smackin' the skins.I know very little about southern U.S. colleges, so maybe the marching band really IS more popular than the football team at certain schools. That's pretty messed up. That's like buying a magazine for the advertisements. Anyway, our heroic Atlanta A&amp;T (the movie's concoction) battles their arch rivals (the real Morris Brown U) and gets to go 1 on 1 in the final reel. Stunning how that works out, huh? Along the way, Cannon makes a friend out of an enemy, falls in pseudo-love (with the lovely Zoe Saldana), and ruffles the feathers of his stern and old-fashioned bandmaster (Orlando Jones, playing against type). Nothing any of them do or say will surprise you. They have some nice moments, but I almost expected the crowd to start shouting ROCKY! ROCKY! during the band-off at the end of the movie.If you don't mind a re-tread experience (and you're p***ing on my advice to skip 'Drumline'), be sure to rent the widescreen DVD. The one genuine pleasure I had was admiring how skillfully the actual musical scenes were choreographed and shot. The fullscreen version I saw chops off the sides of many compositions that I assume are quite beautiful in the proper ratio. Seeing the movie in this crappy format was my own tough luck, but I don't want to invest another 2 hours in this ho-hum material just to discover what I was missing. I'll pop the Italian Stallion (or even 'Hoosiers') in the DVD player again if I want to see this story play out the right way. Unlike 'Drumline', they earn their clichés."}, {"id": 211, "text": "The plot of this movie has been done so many times, except this time the setting is with a college marching band.  We have a freshman who plays the drums and  is going to college on a band scholarship.  Of course, he has a bad attitude and thinks he's hot stuff and doesn't get along with a  leader in the band and the band's director. He gets in trouble a lot and finally gets kicked off the band. He meets with the band director of the rival school, only to find out he just wants the inside scoop of what the other band will play at the  big band contest. So, bad attitude drum player changes his tune and decides to write a great piece for his original band Atlanta A &amp; T to play.  The new piece is more of a hip hop style, which is what the school's president wanted by threatening the band director with pulling band funds.  So, it is the day of the big contest. And guess who wins?  Well, I won't tell you because it is easy to figure out. Just think about the title of the movie, Drumline.I can't say this movie was bad, it just isn't anything original. At least, there is a lot of music, but it is not my favorite kind. And every character is so stereo typical it's naushish.FINAL VERDICT:  If you play in a band, then I'm sure you will like this. However, I have never been in one, which is why I can't take this whole band contest too seriously. I would rather watch the game then a band and I really don't care what a band plays at half time."}, {"id": 212, "text": "I just finished watching this film and I did like it. I'm a drum major for a high school marching band, so maybe I set my hopes a little too high. It's not the greatest thing I've ever seen, but it is watchable. The drumming was fantastic! However, there are some things that irked me throughout the entire film. 1.) Devon's character is a brat through the entire film, and his character's lack of respect for his director and section leader really made me mad. My band director would never have stood for any such thing, and we are just a high school band. 2.) The slang started to get old. You trippin' yo? WHAT IS THAT?? If a group of adults, even band directors and moms and dads sat around watching this movie, they wouldn't have understood it.Even so, I am very happy that a film was made about band, and not another sports film. Don't get me wrong, I like films like Remember the Titans, or Rudy, but for once people need to realize that band isn't for whimps. It takes a lot of energy to make a marching band truly great, and we marchers know that sometimes we don't get the appreciation we deserve.Anyway, I have been using this coloumn for my own personal views on bands when I should be talking about Drumline. I guess in the end, this film is not just for us band dorks, it's for everyone. And even with the somewhat predictable plot, it has a good story and portrays good lessons about respecting others."}, {"id": 213, "text": "Wow, this has to be one of the worst movies I have seen!How hard is it to get some percussionists to do this movie? If there's a sequel, I'll be glad to do it! Just please try not to give a bunch of actors sticks and expect real percussionists to be pleased with the movie. There's parts where I can point out that they don't play on the drums, or fast forward the scenes to make it look like they are sticking fast. one band, many bad sounds should be there motto too. I don't think I heard too many parts that were clean and, being in a drumline, it's awful to hear. (It'd be like a baseball player watching a movie about a baseball team that drops balls, strikes out, and trips all the time). That one scene where the band was playing a scale I was literally cringing it sounded so awful (I believe it was some trumpet that was WAY out of tune). There's other things I could point out too but they've probably already been pointed out in previous reviews so I won't bother.And don't be fooled thinking that the fancy sticking they did during the cadences was amazing bc we do visuals like that or harder......and we're MARCHING. (see what the band was doing in the movie, that ain't marching) If anyone is interested in some REAL good drumlines check out the Cavialiers, Blue Knights, Cadets, Glassmen, or any other DCI drumline. That's talent. What's up with the Pearl snares? Yamaha SFZ people!Oh yeah, and one more thing: Flight of the Bumble Bee ROCKS!"}, {"id": 214, "text": "I knew going in that this film was going to be formulaic and thoroughly predictable, which is why I never bothered seeing it in the theater.  Only after a hearty recommendation from a close friend did I decide to see it, an issue I will surely address with her later...  I hate very few movies, but this one came pretty darn close.First of all, I found the acting atrocious, particularly in, well, the LEAD, Nick Cannon as Devon Mills, which made the whole film almost unbearable from the START.  I hated him and never cared if he learned anything (which it seemed he didn't).  I found myself often rooting for the opposing band, Morris Brown, and I thought the most admirable student throughout was the oh-so-nasty-but-eventually-nice-guy section leader Sean.  Frankly, I found the obvious and bland character of the token white guy offensive and he hardly stood out as anything but another brother.  The character of Laila, however, was intriguing and offered one of the only memorable acting jobs throughout.  Orlando Jones as Mr. Holland, I mean Dr. Lee was passable, but hardly memorable.Directorially, it was obvious they were spicing up otherwise OKAY arrangements with an interesting shot, but if I had to sit through one more musical/change of heart/Why Can't We Be Friends montage, I was seriously going to end it all right then and there.  As for the ending, gee, I really wondered what was going to happen at the end.  Sure, they threw me for a loop, having a TIE, but that only prolonged the misery.  I whole-heartedly wished the lead would drop his stick or get arrested or beat or SOMETHING to stir things up a little.  And another thing:  Every time the Color Guard (of sorts) came on, I swore someone had spliced clips from Bring It On into my copy.I love my memories of the good old days in the band, but I did NOT love this movie.  I'm really sorry I stayed up so late watching this.  I just kept hoping something interesting would happen.  All in all, I'm glad I work at an establishment that allows me to rent DVDs for free so that I don't have to live with the fact that I paid four dollars or more to see this movie, which I consider to be one of the worst I've seen all year.1.9/10 for some interesting musical arrangements and amusing, albeit sparse field formations."}, {"id": 215, "text": "I just watched the DVD of 'Drumline' and was pretty disappointed.  Iwas on the drumline in high school, and so I thought this flick wasright up my alley.  I didn't march show-style like the bands in themovie, but we always went to see the competitions when theycame into town and as a result I have seen some pretty amazingstuff go down on the field. I think the biggest problem with 'Drumline' lies squarely with thedirector.  The routines that he filmed, I felt, weren't worthy of thecompetitions they were supposedly a part of.  The best routine atthe end of the movie isn't really up to snuff compared to the realthing.  All of the routines are shot with that high shutter-angle trick(think 'Saving Private Ryan') to accent the sticks and the steps, buteven with that the performances just fall flat because of, if you canbelieve this, a lack of camera movement.  Usually movies like thisthat are geared for younger audiences are chop-chop-chop full ofrock 'n roll cinematography and edits, but oddly 'Drumline' is verystatic, to its own detriment.  The script and the acting aren't any better or worse than any othermovie like this.  I did have a bit of a problem with the relationshipbetween the band director and the dean, which seemed ratherphony.  If the dean wants funkier music, then he should just orderit be so.  Suddenly we're faced with a band director who spendsthe whole movie going on about order and sacrifice for the greatergood, and firmly establishing his belief in the chain of command,but has a problem with his own superior?  I didn't buy this for asecond.I really wanted this movie to be good, but it just wasn't.  This is byno means the worst movie you'll ever see, not even close.  It's justpassable when it could have been great given the subject matter. Very disappointing.  I guess we're going to have to wait a little longer for a movie thatgives marching bands their due justice.  Horns up!"}, {"id": 216, "text": "As an alumnus of a drum line this movie was a real disappointment. Considering the possibilities this subject matter offered it was a combination of bad direction, bad cinematography, and especially bad sound editing.  The scenes of marching and playing used a lot of close-ups and fast cutting so it was impossible to see what the band-members were doing. The biggest crime is that there are several montages where we see musicians playing but instead of hearing the drumline we hear songs from the cheezeball soundtrack--unforgivable!Of course the story was lame, but I was expecting that.For those seeking a realistic portrayal of college marching band experience, well I don't know about the school in this movie, but based on my experience, for one thing with ten or a dozen snares anyone with the attitude of this main character would have spent all of band camp doing cymbal laps--not to mention learning how to stand at attention.  Also in a marching band with hundreds of members I can't imagine the band director knowing any freshman personally--there are no stars or solos...who's going to hear you in a colliseum!!  And the freshmen in this film had it easy. No indication of spending an entire semester being hazed by every upperclassman in the band.  I would have forgiven these minor transgressions if at least there had been some good music properly engineered (like so we can hear the bass drums), but there wasn't.  I will say this, though: at least they were driving it: UCLA SUCKS!"}, {"id": 217, "text": "We've had cheerleader movies, karate (kid) movies, arm wrestling, figure skating, chess, mechanical bull riding -- you name it -- yet another brazen attempt to lure a small sub-culture passtime dujour to the screen.  I'll be waiting to see a quilting championship movie sometime in 2004: Smart ass granny from small town gets recruited for the big show in Seattle, but can't handle the pressure of new thread techniques of her new partners, but comes through in the end.For the other people who wrote here who seem to be drooling over the band and drum performances of this movie --  sorry.  I've heard (and seen) MUCH tighter drum line performances (pick any top 10 DCI performance of any year).  Surely, with a production budget as big as they would have had for this film, they would have shot the intricate music scenes enough times where the snare lines would have actually sounded like one instrument, rather than a flurry of fuzz anytime the tempo increased.   Given that this is supposedly a degree-granting band, I'd be flunking those drum lines.   At least the director knew to keep the camera away from the hands of the players most of the time.Buy the movie Blast! (or see it live) to see how it's really supposed to be done."}, {"id": 218, "text": "What a world this movie opens up for us!  I was vaguely aware ofcertain college bands from the south that I've seen for 15 secondclips, jumping around and looking like fools.  I came out of realbands and drum and bugle corps in the northeast.  So I neverappreciated the culture of hard work, discipline and tradition thatDRUMLINE showed me.  The story line may be predictable, but inthis genre of filmmaking it's the slice of life that's important, not theartificial context that gets it to the screen.  I was most impressedwith newcomer CANDACE CAREY (one-arm pushups) who tended to steal every scene she was in.  And big huzzahs toOrlando Jones and Nick Cannon.  But really, there is LOTS OFGOOD ACTING all through this movie, both good guys and badguys. The only thing drum corps have (or used to have years ago) overthese college bands is that the routines were 15 minutes long, not7, and the season is in the heat of summertime, not the fall.  Theyalways ended up with the whole corps abreast on the right goalline, where they played a closing fanfare.  After every singleperformance, as soon as the horns came down, people wouldstart falling over, fainting dead away.  For all you noninitiates, thisis the hardest work you can do performing music."}], "reviews_amount": 219}