{"name": "2067", "titleId": "tt01918734", "reviews": [{"id": 0, "text": "Don't really want to slate this as it tries really hard. Kept me up til 1am and I still rated it a 6. Low budget (tried a bit hard to be higher budget) sci-fi with just enough to make you want to see it through. Music was a bit over the top in places, the actor that played the little kid (although small part) is going places, watch this space. Trailer made it look much better than it was unfortunately. 6/10 seems fair."}, {"id": 1, "text": "Besides a mediocre cast (I am surprised at the filmography of this youngster. I find him so unbearably untalented, that I can't understand how did he manage to end in those movies), the plot is just ridiculous. Imagine you have an overpopulated planet with almost no more oxygen and water, and ZERO plants. According to this brilliant director and writer, you can save the entire planet with a couple plants sent from the future by a psychotic emotionally unstable crybaby. This amazing director thinks that with some emotional music and a couple liters tears he can compensate his incompetency. Unfortunately he can't. Very bad movie."}, {"id": 2, "text": "Scientists can't keep trees alive in the laboratory but they can invent a time machine? This movie is a joke. Don't even want to go into low budget, low quality acting"}, {"id": 3, "text": "«2067» is more frustrating than the average indre sci-fi misfire because there's so much potential embedded in this clever story.Kodi Smit-McPhee is quite simply ineffective as Ethan Whyte. There is alot of cringeworthy dialogue and the movie is clearly a low-budget affair."}, {"id": 4, "text": "Bad acting. Stupid dialogue. Protaganist has one setting: panic with emotional blubbering."}, {"id": 5, "text": "Not a bad flick, but not noteworthy either. The effects were decent and gave it a proper sci-fi setting. The Dialogue was wanting, and to be honest, too much crying going on, far too much! It is one of those sci-fis were you have to ignore the science, just accept the plot holes the inaccuracies make. The acting was pretty stiff. It tried hard and probably the effects were the best feature of the film - which is a bit worrying. All in all though, still gets a 5 for a Sunday afternoon which is a pass and not a complete fail"}, {"id": 6, "text": "BAD ACTING, BAD PLOT. Also, this is a boring movie. Why is this even on netflix."}, {"id": 7, "text": "This movie is just plain discombobulated, disjointed, and i just didn't care about what happened to any of the characters...This is sad, because I love a good Sci-Fi movie. This just didn't have it.It seemed like it was trying way too hard to be a great Sci-fi blockbuster-type movie, but it was years from that unfortunately.I thought I'd give it a try - even with the poor 4.7 rating, thinking I don't know what - but that rating is being kind. Oh well. Live and learn..."}, {"id": 8, "text": "When you think that it can't be worth, it will be worth. Each new scene adds new strange and stupid details"}, {"id": 9, "text": "Never ever came across a sci-fi with people shedding tears almost in every other scene. A bit over the top 'emotional weight' quotient I'd say! You'll know when you see it.A bit interesting in parts. Visuals of apocalyptic+future earth are definitely super good. A one time watch on a lazy afternoon"}, {"id": 10, "text": "Acting is horrible, especially the lead actor doesn't have any acting skills at all and is overacting all the time, wide eyes rolling, like in silent movie. The Sample libraries, that have been used to used for the score are not a good fit to the pictures, way to loud and slick. If you don't have a high budget for a Scifi-Movie, you should at least have a convincing story and decent actors. A waste of oxygen, worse than Covid-19."}, {"id": 11, "text": "It is good sci fi story with suspense, making you guess what will happen in the end. The visuals are good, and the emotional subplot is engaging. I enjoyed it."}, {"id": 12, "text": "The cast is a bit anonymous but the story is very good and original. Didn't had too much expectation at the beginning having seen the low score but I was very surprised by the positive message of the movie and the finale. Probably many that gave a low vote didn't understand why to trust people you must not trust people and sometimes the solution to a problem is not a solution because is not a permanent one but a quick fix. I higly recommend this SF movie, the first in decades that doesn't start with a scene of sex, doesn't wrap the story around a beautiful girl, doesn't need to insert an alternate gender to fill the holes of the story and where the end doesn't seems a tale written by a 4 years old child. For me 10/10. A movie is about a story, not explosions, automatic machine guns and damsel in distress to make it understandable even by the unfortunate minds. Movie is art and art can't be for everybody otherwise is not anymore art but a product."}, {"id": 13, "text": "I really liked the twists and turns this movie goes trough. i'm glad i didn't read the reviews beforehand. otherwise i wouldn't have watched it...the CGI is pretty nice too. the acting could be better (although maybe more dialog writing based?) but is not bad. the plot twists though... very nice!"}, {"id": 14, "text": "Almost missed this one because of the rating, but two reviews helped me to finally decide to watch it. The movie has a solid story line and the actors were playing without any major hickup. I liked the atmosphere in the movie. There was something positive shining through all the time. Bad days but it's gonna be fine. No messing with our logic of time, so nothing new in this case. It sticks to the rules and doesn't try to make any stupid new advancements into that direction.Well, for a Sunday evening to relax and just let it flow it's a solid movie. Low budget, yes, but personally I don't care, some movies don't need all that FX that is thrown at us all the time. Plain, solid, good.If you need constant action and fighting and people jumping from houses and land on their feet, this is not for you."}, {"id": 15, "text": "Won't change the world, but the effects are good and plentiful, the acting isn't so bad it takes you out of the movie, and the plot just about enough to keep you interested. If you like losing yourself in sci-fi worlds without too much thought involved, you might enjoy this."}, {"id": 16, "text": "Yet another movie written by people who don't know how time travel works. It had a nice premise, and started out just fine. But the minute time travel was introduced it went from ok to very bad. The acting was ok by the main actors but phoned in by the supporting cast. Special effects were great for a low budget move. But all that was ruined by horrible plot holes and crippling ignorance of how time travel works. But the problem is, like with all the other bad time travel movies, in the fact that the plot would not work if the time travel problems were corrected. Not only that but the motives of all the characters were strange and not realistic (the thoughts and conclusions of the characters can only be reached if they read the script). They even ignored cause-effect, rules of nature, and others. Truly a shame. Great potential, but wasted in execution."}, {"id": 17, "text": "Could've been a nice action/mystery sci-fi (maybe not Alien, more like Stargate) - but nooo. They _had to_ make it artistic: with over-long useless dialogues, main protagonist behaving like spoiled child, constantly moaning, crying and shouting. Good god, how irritating his character that was, what a crybaby. I think they tried to show that he was sensitive and damaged. What a waste.There's this thing to good cinema - show, don't tell. Here, they insisted on talking. And unfortunately, that talk wasn't too great.As for plot holes--- SPOILER SECTION ---1. they would create a genetic uber-bottleneck -- they're trying to send 30 people to start a new civilization; Toba theory speculates that we've had a genetic bottleneck that once in Earth's history, where (we think) between 10 to 50 thousand people survived some catastrophe globally, and we're all their descendants. but it was over 10k people that survived to repopulate the planet - not mere 30 they're trying to send to the future. 2. also, of those 30, half of chrono-colonists are of no reproductive / colony-building value anymore (age, sickness, being relatives) 3. main character is subject 14 - what about previous 13? since they've had energy problems in 2060s we can infer they didn't try 13 times already 4. since main character was left alone in 23rd century and only he could control this end of the machine, what was the point of destroying it? he could've used it to send more plants backCrazy credits: no butterflies were harmed during making of this film made me smile."}, {"id": 18, "text": "I can criticize content with the best. But this movie doesn't deserve it. If you focus on the story, the what if, in the science fiction of it, I found it worth watching. This is not Shakespeare, and doesn't strive to make points he would make. I think it's quite possible that the people who couldn't stand this movie didn't stop long enough to think about what it was saying. One could argue that it is the counter argument to Spock by claiming that the needs of the many outweigh the needs of the few."}, {"id": 19, "text": "Whiny, crying, confused lead character. Decent time travel plot with way too many flashbacks. The plot was a complete mess and it could have been much better. Gains a star for not overtly blaming global warming for earth's current condition, it was just implied. That would have been an easy trap to fall into with today's productions."}, {"id": 20, "text": "The earth is almost dead because people destroyed nature so they built a time machine so that ,,spacifically,, Ethan could save them by travelling 400 yrs into the future. he travells and stumbles and he does it. its cgi world with few real trees and lots of studio scenes. the sci fi tehnology is ok ish. the lead actor is always dramatic and loud ,,voicing,, the scenes. few other carachters and all unconvincing. music is banal and bannanas. i v seen 40 min. shows with better story and development. a bad episode from Stargate, for exemple, is way better next to this movie."}, {"id": 21, "text": "It's a pretty solid story. There's no huge twists or turns, it just tells itself. There's some sci-fi paradoxy stuff, but nothing too big.The best part: since it's Australian there's no need for we the best ever so we will save everyone hooraa! stuff. And it's much better because of it.Just one person's journey and choice in a dying world."}, {"id": 22, "text": "In the year 2067 life on Earth has been wiped out expect for patches of humans living on artificially produced oxygen. Etahn Whyte (Kodi Smit-McPhee ) is a welder and son of a quantum physicist who passed when he was eight. The company has been playing around with a time machine and managed to get a message from the future: SEND ETHAN WHYTE. Ethan reluctantly travels to the future (2474) to save mankind. Or can he?Original concept. Poorly executed drama. Kodi Smit-McPhee was not a great character.Guide: F-word. No sex or nudity."}, {"id": 23, "text": "This movie 2067 had many surprising to us it was a little hard to understand because it involves time travel but by the end of the movie they help you understand everything and it is a great message for the world we live in today about protecting our environment and not taking anything for granted and the acting was superb and the special effects were very well done"}, {"id": 24, "text": "While the actors are not known, the story makes up for that."}, {"id": 25, "text": "I don't understand why people gave this movie bad reviews. Their acting is great. Have you Americans watched your Hallmark movies? Jeez. The plot was really interesting. On a better budget this would have been amazing."}, {"id": 26, "text": "I wasn't expecting much from this with a 4.7 rating and I was pleasantly surprised by how much I enjoyed this movie. The best Australian movie I've seen.Sure, the acting could have been better, but it was a hell of a lot better than I thought it would be. This movie is definitely worth watching."}, {"id": 27, "text": "I thought the movie wasn't going to be that great. But I love Sci-Fi so I gave it a shot. The writers were genius. I felt it was a great story. It kept you on your toes and it was exciting. It's no action movie but the science involved had to be really thought out to make this script so good. And the ending, oh my god, that was great. I wanted to see more, I wanted to see if maybe what he did had some effect on the ending. I know we will never see a part 2 of this movie but I would love to see some fan made fiction for a part 2. I don't want to say to much but wow this was really cool."}, {"id": 28, "text": "Besides the very low production value, Australians can't act."}, {"id": 29, "text": "Please do not base your decision to watch this movie on the majority of the reviews. This movie was imaginative and intriguing. The acting, IMO, was excellent, but likely ill-reviewed by others because they were not hollywood famous actors. The problem is, people are not educated enough to understand that humans are destroying the planet through their careless, typical, daily activities. Those who rate this movie below a six clearly do not have the conceptual thought process to understand it. It's sad to see what the world is coming to and it's staring us right in the face."}, {"id": 30, "text": "I always check IMDB before pirati, I mean watching a movie. If it is below 5 I don't waste my time. I'm glad the review before this one said they enjoyed it but they gave it a 5, which I don't agree with. Great acting, great storyline. Will keep you hooked. Then watch Archive also a great movie."}, {"id": 31, "text": "I think the acting was ok, it did not bother me. The effects were also good, not superior. Music was very good, but too good for the movie. I mean the music could work for a movie like Interstellar with a very good plot and character investment. This movie was too short and was not able to make you invest in any character. With more budget and solid story this could have been a very good movie."}, {"id": 32, "text": "This movie makes no sense - they want to send someone to the future to find a cure for the plant but they're not sure if they can make it back - so what's the point in sending them!!! The scenery is quite good which is the only good thing I can say about this movie."}, {"id": 33, "text": "There are a lot of critics of this movie; those are people who want action, death, chase scenes, space ships and robots. This is a movie for people who are intellectuals - thinkers, people who ponder, imagine, fear and still have hope. If you are a negative person who thinks only of the moment it's not for you. If you feel what is going on around you, know what is coming and still have hope, this movie is for you."}, {"id": 34, "text": "Bad Story, Bad Acting, Bad Music. The worst time travell movie ever. Im rather watch the terminator movies again than this one. a waste of oxigen."}, {"id": 35, "text": "It's funny how haters find the time to write bad reviews. This is what's called hard sci-fi. If you don't know what that means, look it up. It's about hope and accomplishment and how one person can actually make all the difference in the world. It tackles the questions sci-fi asks often: Can we survive? What will that take?"}, {"id": 36, "text": "There's plenty to chew on with this movie, whether you're looking at it from a sci-fi perspective, drama or just a general watch. The actors portray your everyperson - they aren't superheroes, there's no use of over the top CGI, just a well written, thoughtful piece. I do have some bones about timescales, the physics, biology, and chemistry, but that's true of most sci-fi offerings. If you're looking for a blockbuster, this most assuredly is not for you, but if you like poignant storytelling, it's pretty good. Given the film's likely limited budget, and a not well-known cast outside of Australia, I'm giving extra points for the effort. A credible and enjoyable movie."}, {"id": 37, "text": "This really reminds me of the feeling from 80s scifi novels. I'd say ratings say much more about the audience, than a movie. I mean, if you're unable to eloquently phrase your impression, and need to spit on things you don't like - who cares about your opinion."}, {"id": 38, "text": "Ça ne se passe pas dans l'action mais plus dans l'intello, dans l'émotion, dans l'espoir. Ça me donne vraiment envie de lire le livre."}, {"id": 39, "text": "If an author and/or movie director wants a good chance to fail, he makes a movie involving time-travel. 2067 is no exception. Whereas 12 Monkeys is a fine, imaginative and suspenseful movie (okay, Bruce Willis travels back in time instead of travelling to the future like our emotional hero in this story), 2067 fails on almost every level: boring characters, boring dialogues, and the story drags on and on and not much is happening. The production is pretty solid, and that's it.Conclusion: I really don't know what kind of audience would like or is interested to watch such story/movie. And to all those reviewers who talk about the important message of the movie - that message is on air in today's media on all channels 24/7, and a rather boring affair with a mostly sleeping audience won't save the climate. In my opinion not to make this movie (all that energy saved - production, streaming, driving to the cinema etc.) would have contributed more to saving our planet ;)"}, {"id": 40, "text": "Artificial oxygen. That was my first clue that this was going to be nonsense. There's no such thing. There is only oxygen. It's an element, not a product. However you obtain it. However you extract it, it is still just oxygen. So the conceit of people being allergic to artificial oxygen is just utter nonsense.Then there's the crying...There isn't one character in this movie that doesn't blub their way through at least one painful dialogue exchange. The main character is practically in a permanent state of distress that is just exhausting to watch. It's just too much.Then there's the acting, or rather, lack of it. The two main characters (when not crying like babies) are decent enough, but the rest are B-movie category at best, and amateur dramatics at worst. The evil lady leader is particularly good at scenery chewing. And yes, she tears up at points.Then there is the usual time-travel nonsense that is badly thought out and realised, with things happening before they could possibly have occurred and paradoxes galore.But the crying is the worst part. It just never ends and overshadows everything else to such an extent as to make the movie unwatchable and tedious.Realistically, this is an episode of the Outer Limits, or Twilight Zone, padded out with unnecessary emotion and lack of thought. A trial of the senses to sit through.And the ending...Having altered time, our hero travels a few hundred yards from the ruins of the time machine building to find a shining city where ruins once stood. So these people, having been saved by his actions, couldn't even be bothered to restore the site of their redemption and restore it to glory? Couldn't be bothered to turn it into a monument of sorts? They just left it as a ruin? Come on! That's pathetic writing!SUMMARY: Crying hero. Crying villains. Crying extras. Lots of crying. Overly melodramatic interactions. Nonsense time travel dynamics. Nonsensical basic science. Some truly awful acting. On the same level as After Earth but did I mention there was more crying? Not recommended at all."}, {"id": 41, "text": "I love it, it was a nice movie with a good value for life👏🌿🍃"}, {"id": 42, "text": "Had so much fun watching this time-travel, si-fi, thriller. Speaks to environmental issues facing us today. Finn Little, who plays the young Ethan is exceptional and the rest of the Australian cast transport this film into the future. Loved it."}, {"id": 43, "text": "First of all, the score is totally, hopelessly, distractedly bombastic. Every two minutes the score flies up and hits you in the face like Mandingo at a trampoline orgy; the music is also so loud that one often can't hear the actors delivering their unfortunate lines and thus, also the editing is weak. Not even gonna go into the science: temporal spaghetti."}, {"id": 44, "text": "Sure there are some gaps in the story that don't make a lot of sense. However, I found it an enjoyable watch. Honestly, I don't get all the negative reviews. It's not the best movie you'll ever watch, but I liked it."}, {"id": 45, "text": "Is this a blockbuster? No. Does it make you want your 2 hours back? No. The film, while definately low budget and some (as another review put it) anonamous actors was very well paced and kept me interested. Are there plot holes? Sure as in EVERY movie. Does an equivalalent of a cell phone still work 400 years later on a nuclear battery? Does a city run by a massive nuclear power cell still run 400 years later without any sort of maintenance? SURE DOES! Skip any questions you might have and just be entertained. Ending has a slight little twist, but it is an interesting take on what might just happen. I read the reviews first before watching, i'm glad i decided to give it a try, it may not be a constant rewatch, but it is worth the time i put into it."}, {"id": 46, "text": "I just have to say it people. WTF did I just see? If the acting was worse then than script is just impossible to tell. I can not believe that Australian movies are actually getting worse because over the past decade they have been horrific. Why are Australian taxpayers supporting this sort egregious and totally asinine garbage? I know that it is because we just have to have a film industry attitude but then why make krap like this? I sort of know the answer because I actually know a fair bit about the people in the OZ film madness and those that work for the SA film corp are just about as low as you can sink. No furking idea about film but a lot of middle management psychosis. They will never get better so what I suggest is that they kill off these government film supporting madhouses and let the free market do its thing. Better no films than this garbage."}, {"id": 47, "text": "I am a fan of what the Mothers of Invention called Cheapness. Science fiction movies, primarily from the 1950s and 1960s, in which you could tell Godzilla was a man in a rubber suit, or see the strings suspending the rocket against the black backdrop of outer space. This film, made in Australia, is a modern version of Cheapness. The time machine at the center of the story appears to be a large piece of concrete piping decorated with blinking lights and plastic tubing. There is absolutely no CGI and only one or two soundstage sets. Paintings are used to depict future cityscapes. The story is disconnected, the script straight-up-corny, and the antagonists predictable. But, if you relax and enjoy, without looking for the lack of continuity, it's entirely enjoyable escapism. I really don't think this movie takes itself too seriously and you shouldn't either."}, {"id": 48, "text": "Who wrote such a stubid weak charcter such a waste of time"}, {"id": 49, "text": "Pretty cool movie , really sci-fi if you're into that but you have to pay attention ugo or else you miss what's going on like all you kids do, but don't just ridicule what you don't understand. Enjoyable I recommend"}, {"id": 50, "text": "Is this what men are like in the future?? blubbering and crying every minute of the day? Geezz......seriously i actually got PISSED OFF at how much crying this dude does.......Pathetic, weak, beta male of the future i guess, started when Trump lost the re-election and college pukes took over the world."}, {"id": 51, "text": "This is the story of humankind in 2067. They are suffering from a lack of oxygen. They are generating artificial oxygen to survive. The main actor in the movie is an engineer who works in an oxygen generating company. The company gives him a time travel mission to save humankind. I liked the story. It had the elements of drama and SCI-FI. To me, acting could be improved. I liked the special effects especially the scene that shows the future city. The background music and sound effects were nice. In summary, I recommend this movie for SCI-FI fans."}, {"id": 52, "text": "Those who rate this low, possibly have issues with their emotions or are not able to link those emotions entwined in this simple but effective plot.The movie definitely is not perfect, and I will not state all that is wrong with it.Everything that is right with it, is based around hope when all hope seems lost.Instead of making a stereotype simple tv-drama the director clearly had the idea to reach more people by making it into a simple but effective sci-fi movie.And making it beautiful to the limitation of budget and insight from the director and writer's imagination.While some reviews and people stare blindly into (what they seem to take for granted in the plot) they obviously weren't paying attention, and only focussing on the concrete visuals from the scene and assuming that's what saved them.I will not go too much in detail, but all I will say is the physical plants from the future did not save the planet. The loss of the ability to escape the near dead planet did. As humanity had no other choice to get rid of capitalism and consumption to the edge of extinction.If the movie was about the sci-fi aspect only we would have gotten a somewhat explanation what did save them, but this movie is about LOST hope and finding it again. FAITH, BELIEVE, restore the faith in humanityFor those that hate this movie, maybe you are better of reading only statistics and sciencebooks, which is ok, but makes a very boring and bad movie, this one is clearly not and education tool, but a heartwarming movie, i definitely recommend."}, {"id": 53, "text": "I'll start by saying a more of a good thing about it. Despite using only 4 or 5 different sceneries throughout the whole movie, all the effects and visuals look really good. But now to my main point. If you want to spend about a 100 minutes out of 2 hours on watching a weakling wannabe-a-man crying in different poses, about the same things, at slightly different angles, then this flick is definitely for you. It is really sad, how something that seemed to have an interesting plot, turned out to be something can be closest described as a soap opera about a guy with 1 friend and massive daddy issues. All in all, I'd like the last 2 hours of my life back. Please, and thanks."}, {"id": 54, "text": "This is my very first review, never have I been compelled to before.This movie had so much potential, unfortunately it fails fails dismally at the plot and the acting.The only credit it can receive, it actually made me laugh at some places, although not for anything remotely funny.This movie deserve a negative rating."}, {"id": 55, "text": "There's a lack of oxygen. Really? Even if atmospheric oxygen plummeted, The idea of creating bubble cities or even underground cities could easily be accomplished. As anyone who passed junior high science knows, creating oxygen through electrolysis is a fairly simple affair. We've only been creating oxygen since 1774. Also, the whole climate change apocalypse genre is growing stale at this point. I'm sorry, it's a lazy premise and lazy writing, made for people too lazy to think critically about the premise. I'm sorry, I'm not meaning to be a stick-in-the-mud. I love science fiction. I breathe science fiction. This isn't good science fiction."}, {"id": 56, "text": "For a low budget sci-fi, this is about as good as it can get. And it is a unique take on the 'send someone to the future to save the world' trope. With some better dialogue and more cohesive storytelling, this could have been great."}, {"id": 57, "text": "Couldn't make it through and stopped watching after a while. I didn't lose interest. I was merely still watching in awe from the first few minutes on. Mainly because of the bad/mediocre acting and dreadful dialogues. The dialogues.. they hurt. This is just lazy writing or a real lack of a decent editor. Major deal breaker if you want to capture the attention. In a good way at least.User reviews that state criticasters didn't understand this movie need to see more movies. A storyline like this has been used many times before in far better productions."}, {"id": 58, "text": "Simply put - if you like Sci Fi you willl enjoy this movie. FX are decent, the lead actor is a bit ropey but the rest of the cast are ok. Decent story line as well. Not as bad as a lot of these reviewers make out"}, {"id": 59, "text": "Effects not bad, sci-fi concept not bad but it was like a really colourful bubble that's hollow from the inside...lol...! Felt that substance was missing. Concept of the story was a good idea and the movie could have been a 7 plus rating if the team actually worked much much harder on giving it the required ingredients. Most times felt it was just so empty in a strange way."}, {"id": 60, "text": "2067 is a very dissapointing sci fi film that has a interesting premise around it ,but it failed very short in the end when it was trying to execute same idea in its best way possible,but to me all of that was very unexplored and cut way to short.Story was messy for most of time and characters were completly one dimensional and i will even say boring,they didnt have any arcs or progress script was written in a very monotone way without any sign of interesting staff that was promised to me by plot description,acting was also sometimes very off,expecely from our lead actor. 2067 was yet another weak Sci Fi film from this year"}, {"id": 61, "text": "This movie was exciting and fun to watch, I love the futuristic vibe. It is a powerful story about a boy trying to save the human race from an environmental collapse. The earth runs out of oxygen and he must travel to the future to alter the timeline and save the remaining humans. It kind of jumps around a little bit and is difficult to follow, but all together is a really good movie. I suggest watching it."}, {"id": 62, "text": "I've become somewhat disenchanted with IMDb's rating system. More and more I am seeing people thumbs down reviews because they don't AGREE with the reviewers opinion about the movie, versus whether the information is helpful or not. So I will provide 2 reviews in 1.NO SPOILERS: This is a slow burning, true SciFi with visually appealing graphics. I wouldnt categorize it as stunning, but its well done for its budget. The acting is good. The plot is interesting. Though the movie doesn't have a lot of action (until the end) the movies overall ARC is satisfactory. For someone who's looking to pass the time, this movie will generally entertain. &gt;&gt; End standard review&lt;&lt; In depth review &gt;&gt;SPOILERS&lt;&lt; I absolutely LOVE this movie! True it is a little slow in the beginning; but in my opinion, that adds to the crescendo. The acting by the main hero is fine, though not Oscar worthy. But none of that matters.To me, what matters is the soul of this movie. The director took the standard time-travel and addressed the paradox it would create. Almost every loophole was addressed! From the strange bracelet being the key to activating the machine, his father's suicide because he refused to agree to the villains plans, the overprotective nature of Jude- whom felt responsible, the bones of his past self being the evidence of the paradox, to Ethan's final act of sacrifice by sending back new life.The loopholes not addressed... that gave this movie a 9 instead of 10. 1. CONTINUITY- Ethan sent back the message AFTER Jude broke the paradox. That doesn't make sense. Ethan would have had to send the message before the paradox was broken. As for Ethan &amp; Jude's final argument... it was supposed to happen back in 2067....but having it in 2467 could, arguably, be what started the break in the Paradox? 2. SCIENCE- when Ethan had to depressurize the chamber in order to reset the core he passed out. But that is unlikely. Ethan grew up with fake &amp; critically low oxygen. So being in an oxygen rich environment would have over-oxygenated his blood cells. When the room.lost oxygen, he would have had minutes of reserve oxygen in his blood.... theoretically would've given him plenty of time. &gt;&gt;END SPOILERS&lt;&lt;Ok. I kind of went on a tangent. The long and short is... if you LOVE TRUE SCI-FIs. If you love movies that may not be bang-bang, shoot 'em up action, but rather challenge deductive reasoning, theoretical physics, and push above what we think we know about science... you will probably love this movie too. I recommend."}, {"id": 63, "text": "Thought this wasn't a bad low budget Sci-fi movie. Yes, some of the dialogue is pretty bad and the acting isn't that hot, but a good story, all the same. Just forget all the loopholes and watch it. Not as bad as some make out."}, {"id": 64, "text": "It's already happened, man!Visually striking and with an epic orchestral score, 2067's slightly clunky and self-contained time travel plotline may be ultimately forgettable, but the effort is certainly admirable."}, {"id": 65, "text": "A breath of fresh air (pun intended... if you see the movie) from outside of the usual hollywoodesque quarters. Still, it falls shorts on a couple of levels: 1. The plot is fine, the writing not that much. Needed more work. 2. The 2 main cast members do a nice job, the others not so much. Particularly annoying is the bad guy (gall)... she's definitely not an actress, nor will she ever be one, even if she reincarnates a few dozen times. Her performance can only be rated as absolutely awful and it has a very negative impact on the movie as whole. I guess she paid to be in this movie. I can't think of any other reason any producer in their right mind would consider casting this person. 3. Basic physics and logic is flaunted all over the place. Like, there is no oxygen but people have lots of water (WTF?). Makes you wonder if the scriptwriters actually went to school.Anyway, this is not a complete waste of time, and you come out of it with a couple of new ideas in your brain."}, {"id": 66, "text": "The protagonist cries throughout the movie , her girlfriend cries throughout the movie , his parents cries ,the antagonist cries . Concept is average , we have seen movies on this theme before ."}, {"id": 67, "text": "This was really good scifi, and in that I think the fx and dystopian feel mixed with space/time travel were astounding. In a way the fx eclipsed everything but did a 180 and brought the acting to meet it and keep it great. A couple of moments with the acting I was a little set back, but I got used to it and really enjoyed the lead actor interaction, very small cast in most scenes and it still felt big."}, {"id": 68, "text": "Yes this film has flaws, one being it's understanding &amp; execution of Time travel, but DON'T believe all the 1-3 votes, from the overly critical Armchair critics, that probably even gave the Movie Gladiator a 5."}, {"id": 69, "text": "I liked three things about this movie: The first few minutes.Seeing Ryan Kwanten from True Blood - a few years older; but unfortunately in some lame bro role.When it ended.Otherwise it sucked. Just a mishmash of crap after they travel into the future.The last shot was really promising - then it ended."}, {"id": 70, "text": "2067 is descent movie, which you can watch on a go. It's not such mind twisting kind of sci-fi movies yet captivates you. You don't need explanations for the ending, yes it's entertaining."}, {"id": 71, "text": "I believe my title says it all. If you liked this movie it says a lot about you as well. Watch if you want but I say skip it."}, {"id": 72, "text": "What a poor choice in relation to the lead actor, to be fair the supporting actors were alright except the lead actor (seems someone in higher plains of existence is related to him and decided to make him a movie star)"}, {"id": 73, "text": "In a world where synthetic oxygen kills, and natural oxgyen cannot be generated as all plant life is dead, a hero needs to be sent to the future to retrieve a cure(they are deadly serious about natural oxygen thing)--it turns out that the hero that's selected to travel to to future (to pull a lever, of all things) is because the designer of the machine thought that it would be a good idea to lock it to that person's DNAat the denouement, the more sensible choice of saving humanity from the dying world is exchanged for a cure more ridiculous than a silver pill.well, i guess that scene is worth watching for how unintentionally funny it is ---"}, {"id": 74, "text": "I have tried to watch this movie a couple times. Both times, I have only made it about 20 minutes into it. One thing I noticed is the actors' voices, and other voiceovers are ridiculously hard to understand over the background noises, audio effects, or just poor micing of the actors. The story isn't interesting. The visuals are just a cluttered mess. I highly doubt I will try a 3rd time to watch this."}, {"id": 75, "text": "SF, as any other genre, needs some magic ingredients to work. Trying to review the ingredients in this movie becomes demoralizing. The actors (especially Kodi Smit- McPhee) are out of place in their role, physically and performance-wise. The dialogue script is so weak that some lines had to be literally copied from other movies (Independence Day, Intertsellar). The accompanying music track tries to bring us to tear, syrupy type. The story is a degenerate version of Millennium. Mr. Seth Larney, the SF genre is not for beginners. Whatever you did in filmography does not make you a promising director. What a waste!"}, {"id": 76, "text": "It's really simple. If you hear the same monotonous 'music' throughout the entire movie you know it sucks. They are just stretching scenes with hollow melodramatic views and that drone noise. Somehow it's not so bad to really flunk because the CGI is good enough and you will keep on watching but the plotholes are big enough to not recommend this movie to anyone. They should've kept this a Dust short."}, {"id": 77, "text": "I like a good sci fi. I fell asleep twice during this. Nothing happens. Nothing at all.I woke up after 45min and I got the answer to what happened. So a waste of time really. Funny enough for this movie.I highly recommend finding something else to watch. The only thing that is decent is the effects being used/made."}, {"id": 78, "text": "So forgetting the scientific side of time travel and the other obvious glaring holes in the other bits of 'science' (seriously do not watch with someone picky). You're left with a whiney anti-hero, an annoying talking gameboy that's in because it has to fill the holes in the rotten dialogue, and cast members who have as much charm as cold rice pudding. Decent vfx for the budget hence 2 stars."}, {"id": 79, "text": "Why 4? Because of unbearable whiny little cry-baby of a main character... Bloody disgraceful that wimp was. Great idea, not bad script, nice effects, good music, Terrible plot holes, terrible character(s) decisions, terrible acting - just awful. This could have been great but remains quite interesting movie that kept me entertained and intrigued while struggling with annoyances that kept pushing me to turn it off with every minute. Hard to recommend."}, {"id": 80, "text": "The realm of science fiction is one that can play both sides of the coin in any given situation. Consider the fact that there are a number of movies that concern the future. Most of them depict an apocalyptic vision of a world that ends miserably, a world where many has destroyed everything with no hope of redemption. Then there are those movies that start with this premise and yet offer a spark of hope. 2067 is one of those films.Set in the year 2067 we are presented with a world where global warming has left the planet destitute, where there are no more plants and the only way to survive is breathing artificial air. But that air supply has its side effects with people suffering and dying from what they call the Sickness. There seems to be no hope left for mankind.Enter Ethan Whyte (Kodi Smit-McPhee). A tunnel worker for the city's power plant Ethan is the son of Richard Whyte (Aaron Glenane), a scientist who committed suicide when he was younger. Before doing so he presented Ethan with a gift, a mechanical bracelet that attached itself to Ethan painfully and cannot be removed. Working alongside is his best friend Jude (Ryan Kwanten). Ethan is working to elevate his position to get a better air quality for his wife Xanthe (Sana's Shaik) who is suffering from the Sickness.Ethan is called in to talk to the head of the corporation in charge of a research organization called Chronicorp where his father worked, Regina (Deborah Mailman). She explains to him that civilization as we know it will soon be wiped out. But there is hope. The project his father was working on was a time machine and a message sent via radio wave to the future came back with a simple message: Send Ethan Whyte. Now the team has gotten the machine to the point where they can send a human and in response to that message Ethan has been chosen with the task of finding a cure in the future and bringing it back.He will land 407 years from now and there is the chance that he himself might not make it back. He chooses to do what he must and save the world. He enters and is sent forward only to arrive to find the world a different place. Vegetation is everywhere but there is no one there to greet him. He explores and with the help of a handheld computer finds a bunker with a skeleton sitting outside with a bullet in the forehead. The name tag on the uniform reads Ethan Whyte.Things get stranger as he does what he can to survive. Eating berries he thinks are safe he is poisoned but before he can die Jude shows up. He informs Ethan that they knew from his vital signs being transmitted back that he was in trouble and fired up enough juice to the machine to send him to help. Now the pair must find out if there is a cure and where everyone else is. But is there anyone? And who was it that shot Ethan?The movie plays out with these concepts of time travel, corporate mind-think and just who and who will not be saved as it plays out. Progressing forward the story switches concepts from the survival of mankind to trying to play with time and being able to affect the outcome. Is that possible or is time set in stone? Can Ethan and Jude play with time and save the world or is there no hope of doing so? And if it can be changed should it be?The movie is extremely well made and looks fantastic. The sets that range from post-apocalyptic trash tossed world to clean cut research labs to a world covered in green all are amazing. The direction by Seth Larney in only his second feature is exceptional. Larney also deserves credit for an interesting and compelling story. Lead actors Smit-McPhee and Kwanten do a solid job here as reluctant heroes. On the whole the movie presents a nice slice of science fiction that uses a story rather than effects to propel it forward. That's a sign of a true classic.Many may not pick this one up to watch and that would be a mistake. With the number of poorly made films being made on the fly these days this one is worth watching. If you need something to entertain and to make you think, then give this one a go."}, {"id": 81, "text": "People that rate this movie high on plot, probably didn't do well in science classes. Remember how to split water into oxygen and hydrogen?The idea that all forms of life would go extinct, except for humans, is laughable. Seth Larney should have gotten some advice before finishing this script."}, {"id": 82, "text": "I've seen a lot of sci-fi, and I really liked this one. Emotional, suspenseful, and what I liked the most is that it tells a story about love transcending time. This is a very gripping love story - at the same as it is a good sci-fi. Loved it!!"}, {"id": 83, "text": "I loved the trailer and was excited to see where the story goes. But once you put actual thought into it, science kind of goes out the window. From the trailer, I get: The world is in ______ catastrophe stage and also we have created a way to communicate with the future and received a message to send some random dude.. Ok, cool idea so I'm thinkin, Why this guy? And Do they fix _____ catastrophe? These questions are answered, but again, once you put some actual thought into the plot it gets pretty messy. Even trying to just enjoy it for what it is, still pretty disappointed. It just gets so tricky with time travel movies. Other reviews are right and there's quite a bit of crying involved. The ending is.. well I guess it wraps things up but again throws some logic out the window. I wanted to like it more but I can't give it more than 5.5-6 Stars."}, {"id": 84, "text": "I really enjoyed this movie. I thought it was one of the few low budget gems you find when searching through unknown films. It definitely kept your interested the whole film. The movie was also hard to predict in terms of the ending/plot. I tend to enjoy a lot of sci-fi that is often panned at least initially things like I Origins, Another Earth. Melancholia, The Fountain etc. so if you like that kind of film you might enjoy this one. I did not think the acting was bad at all, and felt the film did a good job with its limited budget in terms or effects etc."}, {"id": 85, "text": "To me it was very boring at times and I will say I almost turned it off a couple of times but I sure am glad I watched it all the way through because I LOVED the ending So YES I recommend it Just don't expect to much and you will enjoy it to. James Welch Henderson, Arkansas 12/09/2020"}, {"id": 86, "text": "Don't waste your time on this. It's just shame to all time travel films. Completely illogical and unintelligent political bs with lame eco-green-references. TL:DR Nice scientist vs bad scientists-managers-villans flick.If there were 0 star it would be too high for this."}, {"id": 87, "text": "Do not even consider watching it. The money, they have spent on this 'movie' could have been just thrown out of the window... absolute rubbish."}, {"id": 88, "text": "It's a syfy movie and the ending is excellent with its twist.The movie seems to more slow but it is the viewer (you) that is thinking come on man I know how this is going down. So, let's get this over with now. Ah, but you don't KNOW ... lolAnymore you can't go by the Viewers Scores. Do what I do and toss out the 1 and 2 score numbers (nothing is that bad) and re-figure the score. That will give you a much better idea of the movies true score value."}, {"id": 89, "text": "If your thing is 'mindbender' genre movies, you'll like this. It's not on par with say, predestination but it's a solid effort."}, {"id": 90, "text": "Didn't finish this movie. Thank goodness it was free."}, {"id": 91, "text": "What was the point in this film? After reading the reviews why did I watch it? Why did I keep watching? Well those answers make as much sense as this film, I really wanted something to happen but it didn't. Good acting doesn't mean crazy intense crying all the time that's like pop idol and the x factor type singing where the artist sings in runs of high notes belting it out all the way. It's awful there so there is no need to act like that either"}, {"id": 92, "text": "Sci-Fi is supposed to model fictional ideas about, well.. science. This film obviously didn't have any science advisors on board, nor did it depict scientists or any already existing scientific realities well. However, the acting was well done and more than a few shots were beautifully thought out; I can only interpret this as an art film.. not any semblance of a sci-fi flick, which is how it advertised itself. Get yourself a science advisor and a protagonist of color on your next project."}, {"id": 93, "text": "This film start with the news broadcasting about the world is dying because lack of oxygen, and the main character Ethan working at the tunnel scene! As turnout, this film is about Ethan need to finding cure in the future world(2474), in order to save his 2067 world! Entire film full of boring conversation, and annoying overuse scene! Such as, overuse of the annoying sound effect scene, overuse of the flashbacks scene, overuse of the arguing scene, overuse the news broadcasting scene, and overuse of the video log scene! Make the film unwatchable! Barely intense scene is, mother of Ethan been shot! At the end, Ethan bring back the plants to save his 2067 world! That's it! Another disappointed film!"}, {"id": 94, "text": "Pretty chill movie and should have a higher rating because it's just so raw. I liked the simple story and the atmosphere of the movie. I'd say it's kinda great for a low budget movie. The only thing I didn't like was the same soundtrack used 3 times, rofl. I mean it's a nice movie, but I wouldn't suggest to watch it in a theater, get it on DVD or watch it online if you want to chill."}, {"id": 95, "text": "I would say I did'n't enjoy the movie too much but enough to give it a 6 star rating. Some scenes were too long like the script was stretched to fit 90 min time... It would've made perfect for a 30 minute short movie. The actors are ok and the acting feels sometimes off due to long, boring scenes... The plot was good though, very modern, the question of humans being a burden for the planet... The idea of giving this planet time to breathe without humans and time to regrow and cleanse itself..."}, {"id": 96, "text": "The film is clearly a low budget affair and this results in poor acting and bad quality of the film.The positives are the sound and the pictures that travels you a few moments in another environment and the negatives are the dialogues that are for a second category film and the acting is a great failure not to mention the choice of the protagonist Kodi Smit-McPhee as Ethan Whyte in the movie.I would not rate it with 4.8/10 as it is now its rating, I could say that it can get a 6/10."}, {"id": 97, "text": "Ethan White is drama queen. You could already know how everything happened at start, but Ethan is finding out along the way and making a fuss about every single thing."}, {"id": 98, "text": "I would have given this a 6 or 7 rate, but the non stop crying and hysterical breakdowns of the lead character was extremely distracting and cringe! Ethyl, instead of Ethan.They should remake this one"}, {"id": 99, "text": "I never seen a movie with this much man crying. It's a Hallmark Sci-fi movie."}, {"id": 100, "text": "Who made the Czech subtitles? They deserved to be shot, executed. This Explosive skull is bun cof bloody amateurs. Bad, wrong translation almost every second sentence. Who ever paid them wasted the money"}, {"id": 101, "text": "1. Bad acting by the lead character. If he is to be burdened with saving humanity he ahould atleast be atable enough to think past himself.2. Priorities. One one side there is mankind extinction a nuclear blast is eminent. There is a timer and the main character is wasting time looking at skeleton bones, crying and wasting 60% of the time.3. They have invented a time machine but cannot find a way to grow a plant in a lab.4. The main character is shown too much mentally weak that he often forgets what is happening around him.5. The music. 6. The special effects. 7. Background story/plot incomplete. 8. Stupid questions arguments. 9. List goes on.... There is so much wrong with this movie."}, {"id": 102, "text": "The trailer makes you expect to see a thrilling sci-fi but instead for most of that movie's runtime all that futuristic setting just serves as a background for a blunt and boring melodrama where people wine and sort out their relationships.The plot is full of holes and unpolished, it feels like they couldn't decide whether to go for the Predestination-style paradox or multiple branches of reality or treat time as one straight line.SPOILERS AHEAD: That whole body thing makes absolutely no sense 'cause if he went to the future and then went back and died then he couldn't ever find his body in the first place, there couldn't have been two instances of himself if the time is a line and he went into the future (not past), however if it isn't then we can't have immediate changes to the present as we do in the end..What was the father's point of making this wrist device? Why couldn't anyone just kill the kid and use his blood to run the machine? Or tie the kid, take him to the machine anytime and do the blood test against his will? And if the machine is locked on him, how do they use it throughout the movie without him?Why nobody from the old video aged at all? Getting less oxygen makes them live longer or what the hell?It seemed initially like the father has set it up to get his wife killed (why would he ask her to go out?) but then it turned out the fat boss lady did? but why, so she could raise him? Besides, the friend-dude was in the building when the call happened, wasn't he? how did he get there so quickly to attack the mom, did he go right after?There are movies which after watching make you question everything, wonder, make up theories, look for clues online, watch all these breakdown videos to find new details because they were so clever that you couldn't quite grasp everything. 2067 isn't like that, instead it's badly written that it makes you question your decision to go see a thing before there's any rating consensus, or go find and expose all the mistakes the creators made.Cinematography and CGI looks pretty good sometimes, all of that is responsible for the majority of a 5 star rating, however the rest of the movie is just too bad, the visuals alone aren't enough.When I went to the theater there was no IMDB rating yet, on my way out of the theater I figured this'll get 5.7 max, yet it's even lower now, which makes perfect sense.Conclusion: if I had that chronicle time machine, I'd go back in time to prevent myself from watching this movie."}, {"id": 103, "text": "I am tempted to write a review because all of the bad reviews. In my opinion: this movie is not that bad. It is a decent movie. I enjoyed every minute of it.Sure you won't get amazing scenes like in other post apocalyptic movies. You can't compare it to The Day After Tomorrow or 2012. While the theme is similar, the key concept is really different.This movie was trying to bring time paradox to post apocalyptic theme. While it is not very original, it still is interesting concept for a movie.Climate change and pandemic are two issues this movie talks about. It is very relevant these days. Although the movie sugar-coated it with bitter and salty flavor.Some reviews said that the ending is inconclusive. Well, I can't see that. For me, the message is crystal clear : we can't hope for stars or someone from the future to solve our problems (pandemic and climate change), all we can do is start to change our way of living. We can see that at the ending of the movie."}, {"id": 104, "text": "Protein is your friend - Eat man. This guy looks like he's dying. Great concept. Original script. Thank you."}, {"id": 105, "text": "First things first, even before the truly idiotic stuff, the setting of this movie is the last city, and by implication the only populated area, in the world. I forget the city name but it's somewhere around Brisbane Australia.Now the plot starts here and it's terrible. There are no plants left in the world and have been none for 20 years. There is also no oxygen, and this at least makes sense as oxygen is highly reactive and would quickly disappear if there were no plants constantly producing oxygen.They do somehow have some kind of fake oxygen, they call it synthetic oxygen, and people are allergic to it. Allergic to the poisonous deadly element OXYGEN. Seriously, if people were allergic to oxygen they'd just die as oxygen is pretty important for not dying.So, there is fake oxygen provided in tanks and inside buildings, and there is also better quality oxygen available which people are less allergic to. Less allergic to less fake oxygen. The element oxygen is less deadly if it's good quality oxygen.So they invent time travel and shoot some whiny kid 400 years into the future to find a way to cure people of the deadly oxygen illness.In 400 years forests have grown back and there are butterflies. On a planet with no plants and no oxygen, the Earth has become a forest and butterflies have evolved again - after all they were definitely extinct on a world with no oxygen so they had to evolve again from scratch.Obviously the forests re-grew and covered the earth and re-filled the air with oxygen on a world with no plants no viable seeds and no oxygen, and only then did any living bacteria evolve to the point that butterflies evolved again.Even the little things were bad. For instance, the approach to the city is to walk to a waterfall over a huge cliff and then look down at the city from an area with no route down without climbing.Loads of bridges lower down, so why pick a route that has no way down, then backtrack and scramble down a steep cliff embankment to get there instead of one that actually goes to the city entrance points or even roughly the same elevation. For the panoramic sweeping reveal shot.It must be that because it happens a lot. I mean oddly a lot. A lot to the point you notice that this happened way too many times.The cgi was excellent, as was the set design, props, pretty much the production values as a whole. It's a shame that such good work was ruined by a terrible script written by someone who had no idea what they were doing or talking about, a plot which makes literally no sense to anyone with a functional brain. It was further ruined by a casting director who I wish well to in their new career as a barista, as they certainly should not be allowed to continue in this one.Overall it was painfully badly written, cast and acted (the acting was dreadful, I think I forgot to mention that) but the visual effects were on point. 1 star for the movie and 2 more for whoever did the visual effects."}, {"id": 106, "text": "As an Australian I'm ashamed that this was made, I actually do my best to avoid Australian films and this is why. It had the potential to be an excellent movie if it actually had some good actors, some form of budget and finaally some direction."}, {"id": 107, "text": "Especially the main character Ethan, not the best actor, his emotions are not well managed, looks fake and out of sense! Also the scenario is bad.. the person who wrote the dialogue did a bad job, very bad, i was uncomfortable watching the scenes, at some point i just stopped watching it because it became torturous!"}, {"id": 108, "text": "There's too much loud mood music to enjoy the movie.I suspect the writers aren't happy with it either because if you've already used dramatic music on casual conversation you no longer have the ability to emphasize decisive moments in the movie."}, {"id": 109, "text": "Story is not exciting as the movie name. The actor of the grownup is bad, don't know why he can be the leading role."}, {"id": 110, "text": "It is the worst movie that I've ever watched. plot doesn't make sense , acting is awful. everything happens so slowly, I was bored whole the time and at the end I felt nauseous 😫"}, {"id": 111, "text": "This is a decent time traveling film. In the not-so-distant-future the earth suffers a global catastrophe in which breathable air is scare &amp; charged at a premium. A person from the future has sent a message back in time demanding they send Ethan Whyte (Kodi Smit-McPhee) to future via a time machine his late father &amp; his team created. Ethan's girlfriend, Xanthe (Sana'a Shaik) is dying slowly from a futuristic hypoxic respiratory disease so Ethan begrudgingly agrees to go on the condition that if he succeed that his wife will be among the first people treated and cured.It is strange that the survival of the world depends on a bunch of Australians! The time travelling machine looks very similar to that seen in 12 Monkeys TV series. It is a fascinating take of this genre and the special effects are decent but it just falls short of being a classic due to lack of depth in the final reveal. 12 Monkeys is a classic as the ending is a fitting end to the time travelling conundrum.... Looper does a decent job too. This is not as impactful."}, {"id": 112, "text": "The unwritten rule of Sci-fi is that it has to be vaguely plausible. This nonsense with some kind of manufactured toxic oxygen is laughable from the very beginning. The inability to keep plants alive considering they only actually need light, water and a few nutrients that are all present in human waste is not a reasonable plot device. I want to know what they are all eating with no plants, and don't say animals without thinking about it first. I can only suspend that much disbelief if the acting is better than I could manage myself with a supply of onions, and somebody has a chance of hooking up with another good looking person. Instead all we get is him and his big brother arguing about things they don't appear to understand for what seams like 6 hours."}, {"id": 113, "text": "I guess people will make any dumb story into a movie. That's pretty much what happened here. I realize time travel is a tough nut to crack from a cinematic perspective, but this was terrible. No one wants to see a sci-fi movie where the protagonist spends most of his time crying."}, {"id": 114, "text": "Ethan is too weak, cries a lot. It could have been a great storyline, but get lost in translation because he needed his father to tell him he loved him."}, {"id": 115, "text": "There are many movies I consider to be just a bad story, poor written or visually unsatisfying, but only occasionally I consider movie a complete loss of time. But 2067 kinda fits the category. It lost me in the badly acted early sequences and never pulled me back."}, {"id": 116, "text": "The story is not interesting, there are so may inconclusive moments. The plot does make sense. Bad"}, {"id": 117, "text": "I'm not a critic, nor am I in the habit of reviewing things, so don't expect this review to be that helpful. It is poorly acted, written and directed. The acting, though, is mostly a byproduct of the director's and writer's lack of experience/skill, because they honestly didn't seem to know what they were doing. All the crying (almost half of all the interactions involved crying), immense plotholes, poor physics and lacking execution (fail to) combine in order to make this an underwhelming, incredibly long trailer (because it fails to deliver the ending with any semblance of satisfaction). Also, this should be listed as pure fantasy, not sci-fi. In order to be considered sci-fi, there needs to be some modicum of science involved. This flick just burned a hole through a physics book and threw it inside a dumpster while still on fire. And then did the same with biochemistry, just for the giggles. In the words of Donald Bellisario: don't examine this too closely. Expect plotholes, paradoxes, incongruent thinking and bad tropes -- I'm looking at you, MacGuffin."}, {"id": 118, "text": "I expected a lot from the film and I just got a lot of disappointments. The story starts well, but over time the quality of the story declines and gets worse and worse. The director totally perished in the story, in the end he himself did not know how to finish it. There is very little action in the film, very little variety. The lead actor is horrible.From the moment he is entrusted with the mission to save the planet and humanity, he cries and hysterics, and so throughout the film, he cries and gets panic attacks. I had the impression that I was looking at a mentally ill and unstable person in a very uncomfortable way. A terrible film ."}, {"id": 119, "text": "You would think 47 years into the future there would be a better way to solve problem, guess not sense they are still using guns to solve their problems by creating more problems, the technology is old, out dated stuff they stole or borrowed from other movies and TV shows, not realistic at all, the script needs a lot of work and still more evident that some people should never be given pen and paper or let near a camera."}, {"id": 120, "text": "I'm writing this review mainly just because it's not that bad as the user review score is. Though it's not the best doomsday dystopian story out there, I really appreciate the effort. Visuals are very good (CGI and just camera work). Other aspects ... well, yes, it could be better. So I would not say this is a great film. But I could say that this is a draft to a good film.It requires some effort to spot possible plot holes and just to embrace the idea (logic) how the story is built. So it's not for purely disconnected and tired brain sci fi relax evening."}, {"id": 121, "text": "Amazing science fiction! Don't trust dumb ratings! So underrated."}, {"id": 122, "text": "I was out when I heard synthetic oxygen. Yet another movie written for an agenda, and liberal arts folks who write the script got ALL the science wrong..."}, {"id": 123, "text": "Saw this movie last night and was not impressed. Bad acting in general. Most scenes made no sense whatsoever - people wouldn't behave the way they did in the movie. These types of things just puts me off of any movie.I don't recommend it."}, {"id": 124, "text": "It starts off looking like a sci fi channel movie. Yes, there are serious flaws with it....but it turns into a good looking film, and the lead actor isn't bad....the rest, not so great. They did a lot with the budget, an incredible amount. The script is nothing special, but it's not entirely obvious until near the end"}, {"id": 125, "text": "Nice scifi does not deserve less than 8 dont let bad reviews put you down =)"}, {"id": 126, "text": "...don't make any SF movie again. Please, with cream and cherry on top."}, {"id": 127, "text": "Apart from the miscast of the CTO who is the only poor actor this film is very good. The CGI is amazing and the story mostly makes sense. The end is profound and satisfying; but how did he collect all those species when he only has a few minutes to do it? The bracellet that could not be removed was a sideshow that added nothing to the story. How did his father make such a device? The only plot hole I think."}, {"id": 128, "text": "The only disappointment I had in this film is the lack of surprises for the length of the film it felt like they took a short and stretched it into a feature-length but the cinematography was great the acting was on par the CG was what you would expect from a budget movie if there's ever a sequel I see tons of potential and if this was an adaptation from a YouTube dust short then kudos to them and keep up the good work"}, {"id": 129, "text": "2067 is a fine little low-budget film with a strong environmental message. I saw this film only because I love Sci-Fi.While the story is emotional enough and there's lots of crying, it also is quite messy and the plot is full of holes. Many things don't make sense, but you can still let that go. What actually hurts the film is the way the sci-fi element is written in, time travel is messed up to the point of 'whatever'. It is kinda similar and simplistic like in the Back to the Future films, but this one also pulls elements from other time travel films and tries to mix them up, I mean, they really overcomplicate stuff and try to mix together Terminator-like causality loops, with some hints of Predestination (2014) and a couple of other TT films. I am willing to look away when it comes to a shoestring budget, I love low-budget sci-fi. But the story really was a mess, and it seems like bad directing also hurts the acting. Every character seemed to know everything they need to know and to do, Ryan Kwanten acted like he knew more than the viewer is supposed to, but in the end, I guess it wasn't the case. I can't say I hated this film, but there's just nothing to grab onto. The story is very messy, I didn't quite buy the world they were living in, and the time travel causality loop concept is brutally violated. I'm not going to dive deep into the story, but, I mean, please have one of the two things, either have the simplistic change the past to change your future you came from (which is not sci-fi proof but works in a relevant set-up). Or if you're going for a loop that has already completed itself, there can't be another Ethan that just vanishes, there can't be a destroyed city that miraculously changes into safe heaven. It doesn't work like that. Summing it up, I tend not to recommend this film, but it's close to 50/50. Sci-fi fans would not enjoy it, general audiences would get bored because not a lot happens, probably melodrama lovers would get the most of this film."}, {"id": 130, "text": "Most underrated movie ever! Deserves 10/10. Intelligent, amazing visuals/vfx, amazing music, amazing everything! Can't understand the low rating! Definietly most people did'nt get it! Too intelligent for them, their little minds can't bear this!! Please rate 10 to lift it up!"}, {"id": 131, "text": "Script that didn't make any sense, cheesy lines, bad acting, creepy actors, logical nonsense, lame visual effects and boring music. Stay away from this one."}, {"id": 132, "text": "It was advertised as something special, new, on and on. But in all honesty, it was just a basic time travel movie. Nothing you haven't ever seen in another one, it was even more basic than some. Some of the story at the start is cool, and there are some good looking scenes, but that's it. Every moment, every little detail they tried to make mysterious, and the ending were very predictable and obvious. If your bored I guess enjoy, otherwise don't waste your movie time."}, {"id": 133, "text": "I read the reviews and then watched the movie. I thought it was very well done.It was a lot better and more intelligent than some would have you believe. I liked the Schrödinger's cat paradox where Ethan was both dead and alive at the same time. And it was emotionally touching throughout. The ending was beautiful, though I won't say just how, as that would be a major spoiler."}, {"id": 134, "text": "Most boring and unsatisfied experience while watching the movie"}, {"id": 135, "text": "Does Ryan Kwanten say Nukulear ? I remember Sarah Palin"}, {"id": 136, "text": "This movie was really petty horrible. Slow and pointless."}, {"id": 137, "text": "Most timetravel stories have inconsistencies. This one is a little worse than most, but the real problem lies with the characters. The drama is cheap. Their behavior is without logic. Ethan is offered a chance at a cure for his dying girlfriend, but he refuses. There was no reason for the other guy to shoot him. Humans destroyed the plantlife the first time, but a few new bushes are used to save the planet; and Ethan destroyed the machine to make sure no one except him could survive if it failed. Etc. Etc. What a mess."}, {"id": 138, "text": "This movie seriously does not deserve the hate that it's getting... Personally I found it to be an interesting and entertaining movie. The acting was good and it's amazing what they pulled off on such a small budget and the writers cleverly avoided much of the tropes and cliches that go with time travel stories. The movie isn't everyone, but if you're into classic sci-fi you'll definately be suprised by 2067."}, {"id": 139, "text": "I disagree with some who said the acting was poor. I was entertained by this movie which is saying a lot considering how many movies I have watched. Definitely on the high end for the budget."}, {"id": 140, "text": "I found it thoroughly enjoyable. Maybe you all wanted a michael bay explosion fest"}, {"id": 141, "text": "This is not your run of the mill alien/time travel shoots em- up which I think most of the reviewers here are expecting. What this film is, is a sensitive story with some great acting and something very different. Just because some Hollywood hunk it's not in the read role, doesn't mean the lead actor can't act. I really enjoyed this film, and recommend that people keep an open mind and an open heart to enjoy this unique story."}, {"id": 142, "text": "From the beginning till the end of this movie was just the best. the effects, the graphics, the story line, so good. Even in the ending when the main character sacrificed himself to save everyone by providing the plants at the end was legendary. You need to watch this!!!"}, {"id": 143, "text": "I've seen a lot of terrible movies and this wasn't terrible.The lead guy was weak, but Ryan Kwanten was good.Not great, about a 6. Interesting theories presented."}, {"id": 144, "text": "I'm not usually reviewing movies, but here I had to speak my mind. I'm surprised that so many have given this movie a bad review, because even though it wasn't a blockbuster, it was really good!I actually saw the whole movie, and that's not something I usually does these days.The movie got a good tempo without any unnecessary bloody violence. The music, the acting and the graphics was way higher than I expected, and I must say I really liked this movie"}, {"id": 145, "text": "I just came to this site to see comments and now I know I wasn't the only surprised one....this was actually a very good movie 😂😂"}, {"id": 146, "text": "I normally do not like the earth is being destroyed by humankind stories, but this one keeps you intrigued. The actor could have been a little stronger, but they pull it off well. There is only one scene, the last one with the mother, that doesn't fit well. Other than that, it is a great story that ends well."}, {"id": 147, "text": "I am as a few others, also don't understand the low review. The movie is not bad. Sure, the leads are not that good,but overall, the story is good, dialog is not bad. sfx is nice. It's not one of those b-rated low budget. At least it doesn't feel like one, with the exception of actors. While those who say it's a 10/10 - lol Those who say it's 1/10 are clueless, did you even watch it."}, {"id": 148, "text": "I like time travel movies, so I enjoyed this. Visuals were great. The plot progresses at a good pace. Somethings are unrealistic but not immersion-breaking bad. Importantly, the time travel wasn't silly. The protagonist's realisations and decisions also made sense for the most part.I was surprised by how poorly this is rated and I disagree with most reviews here. If the premise of a man going to the future to save humanity is interesting to you, then give this movie a shot."}, {"id": 149, "text": "Not the best film ever made, but definitely not the worst. A good story line and some very good special effects for a B movie. No big name actors but the ones that they used were pretty good, apart from Deborah Mailman (Regina) who in my opinion was a bit wooden in her role. it would be interesting to see what a big studio production of this film would look like but I don't think that is ever going to happen. Overall I would say give it a watch, but don't expect a blockbuster."}, {"id": 150, "text": "Low ratings from those who didn't understand the movie. so pity... Yes, it wasn't shot in the best way, but it has a good story and music"}, {"id": 151, "text": "Recycled plot. Sub par acting. Main charachter whines and cries through a lot of the movie and really got on my nerves. Just another movie trying to get in on the climate change fear money. Skip this one."}, {"id": 152, "text": "...the plot is quite interesting. There tons of movies twisting around time/time travel, but some of them already became classical, while the rest are just wonabes (mostly sad to watch, FF button is red hot etc etc). This movie has more or less simple plot, but nevertheless is original enough to be entertaining... Even though, the authors have zero idea that by far most of the O2 on our planet is provided by...the world ocean and not plants on the soil, it doesn't ruin the simple idea of this movie: take care of your planet. Acting is bad. At times they look like idiots, IMHO. The length of the movie should have been at least 30% less than it is."}, {"id": 153, "text": "Cheesy props and bad acting aside, I was watching with anticipation for the first 1/4th of the movie. There was groundwork for a good story. But, it never got there. Too many possibilities that went nowhere. Too many loose ends that didn't quite fit. It was just a disappointing movie."}, {"id": 154, "text": "Originality is dead. If this crap were to actually happen I would want the human race to go extinct just to end the stupidity of bad movies. The universe would thank us since other life forms wouldn't feel like laying down in front of cosmic steamroller after watching this."}, {"id": 155, "text": "Too many plot holes. Main guy could have gotten it all if he wasn't emotional and stupid. Don't know why he didn't just go back with the plants. Nothing for him in the future."}, {"id": 156, "text": "Everything here is recycled, the effects looked decent tho. Dont pay for it."}, {"id": 157, "text": "While most of this film is well shot, with good effects and sound, parts of the plot are, less then stellar, from the Batman-esque childhood 'origin' story, to the 'lowly worker saves the world' trope, and on to Spock and Kirk's 'needs of the many' scene. The dialog doesn't help, filled with lines that a script editor with a good thesaurus could have edited in to better phrasing, especially in the first act. The villain of the piece with the grand plan, would be the hero who saves humanity in a better script, while the hero turns out to be so self absorbed that he almost dooms the world."}, {"id": 158, "text": "Good movie with time travel concept. Nothing new you can find out here."}, {"id": 159, "text": "I was initially put off by the review on IMDB from Alex-volk-1 but it looked OK from the trailers so I watched it.It is professionally done, the actors are excellent as is the plot. It might be a little predictable at times due to the use of time travel and ecocide themes but that's what films are once you've seen more than a couple of 100. The story was complete.I went back and reviewed the original review's reviews! Haaa he's not a very positive person.Enjoyable for many reasons. I'd say give it a spin if you like SciFi. I laughed at a few things in there but wasn't sure it was supposed to have a hint of humour.Enough from me, enjoy it."}, {"id": 160, "text": "Ethan Whyte (Smit-McPhee) was just a struggling technician in 2067. Trying to keep himself and his wife alive during a time when deforestation has decimated the planet. As a result the Earth's atmosphere is dwindling away and people have to rely on man made oxygen to survive. Ethan is convinced to try a time jump into Earth's future where a radio message had asked for him to be sent? He only agrees to go to save his wife and the future of man-kind. He takes the leap hoping that he can return with the cure for the planet but once he arrives he soon discovers that all is not what it seems and he must face unprecedented challenges.I went into this film not thinking much. I had read some reviews and it was given a poor score. In these unprecedented time the bulk of us are running out of fresh stuff to see. Now I do have a good library of older films that I am getting to, it is always nice to see something new.The film is Australian and I personally have never heard of the actors (no offence to them). To be honest, the U.S. is not the only country that makes good films. This would be a good example of that.The story was sound but I was left with some questions as to why things happened and how! Not to say that I wasn't impressed with it. The acting was reasonably good, especially by the two main characters. The sfx were great and except for a 'time machine' the technology was pretty good. I thoroughly enjoyed the film and had to see it through to the end. That the mark of a good film.This was a pretty good science fiction film so I give it eight of ten. (I could have used some explanations to some of the events that took place!!)"}, {"id": 161, "text": "It seems other reviewers have crazy high standards for scifi movies, or are really pissed off by one actor or another. I don't get it - this is a solid movie, the special effects are really good (the future city and technology), the story unfolds in a sensible way, and I thought the actors were believable. The pace was also really good, and I was excited to see what comes next.One could discuss if the time travel parts make sense, but I think they mostly do (depending on how you think time travel would work) and they mix in some philosophical questions (can people change? in what do you have faith?). It is also a good mix between what you expect and what you don't expect - it has no super crazy twists, but it does have some surprising revelations, which is even better in my opinion, as you never know if the next thing that happens is what you expect or slightly different.If you like scifi and time travel as a topic, this is really good. And the end might be a bit short and sudden, but come on people, have some imagination - you don't have to spell out everything in crazy detail, and making this movie 20min longer with a super detailed ending would probably lead to people saying the movie was too long ;-)"}, {"id": 162, "text": "This is a solid movie, the special effects are really good (the future city and technology), the story unfolds in a sensible way, and I thought the actors were believable. The pace was also really good, and I was excited to see what comes next.One could discuss if the time travel parts make sense, but I think they mostly do (depending on how you think time travel would work) and they mix in some philosophical questions (can people change? in what do you have faith?). It is also a good mix between what you expect and what you don't expect - it has no super crazy twists, but it does have some surprising revelations, which is even better in my opinion, as you never know if the next thing that happens is what you expect or slightly different.If you like scifi and time travel as a topic, this is really good. And the end might be a bit short and sudden, but come on people, have some imagination - you don't have to spell out everything in crazy detail, and making this movie 20min longer with a super detailed ending would probably lead to people saying the movie was too long ;-)"}, {"id": 163, "text": "At first, I thought it would be a very atypical propaganda piece where the global elite explain what they want us to believe they have to murder us all for the planet to survive. They claim there is an overpopulation. That of course is so far from the truth as it can be given the fact that only 1% of the earth landmass is inhabited and the fact that aside from land, we have even more space at sea.So what this really is about is that they wish to murder us all because of some earth non-renewable resources, namely oil. Well Covid-19 and the upcoming mandatory vaxx are the tools for that, this movie and others like it, are created to help create some kind of compliance.Obviously that is the last thing we want to do, obey these genocidal monsters.On top of it all the movie is complete unrealistic, the plants of this earth would not survive without humans and animals since plants need CO2 (CO2 is one of the basic Ingredients needed for photosynthesis to occur) to grow, and we and the animals are their primary source of nourishment. Thus, the planet without us, would simply stay barren, forever.That said, there is a very surprising ending to it all, an ending that changed my vote from 1 to 3, as well as this review. Even though, the plant life recovering without people part is still not possible within the story of the film. I won't tell you more since I do not wish to spoil the fun for you."}, {"id": 164, "text": "Seth Larney's 2067 is a low budget Australian time travel thriller.Set in a future where plant life is extinct because of climate change. There is a shortage of oxygen. Synthetic oxygen produced by the Chronicorp corporation but it is gradually causing a sickness.A message arrives from the future asking for tunnel worker Ethan Whyte (Kodi Smit-McPhee.) His wife is dying and he eventually agrees to go future in a time machine developed by Chronicorp to try and save humanity.When Ethan lands in the future, it is a world with lush forest but also a skeleton of someone who was shot. Indications are that the corpse is of Ethan itself.There are great special effects in 2067 but it has terrible dialogue. It is too overlong and Kodi Smit-McPhee struggles to hold attention because the movie is too hackneyed.As a corporation is involved, some of the twists are going to be obvious."}, {"id": 165, "text": "For those complaining about all the emotions... I'm quite positive that faced with the prospect of being catapulted some 400 years into an uncertain future world, via a big sizzling Dyson vacuum cleaner controlled by a super computer that still uses a blinking cursor and a keyboard, leaving behind your dying significant other, with no return ticket and the fate of all humanity resting on your very narrow shoulders... one would shed significantly more bodily fluids than a few blubbering tears. I mean honestly people... 2067 is currently rated somewhere between Super Mario Brothers and Tank Girl... Obviously fair is not a grown-up word.So here is an honest review... I watched this movie with very low expectations having seen its score and read a few reviews. I was pleasantly surprised that it held my attention to the very end. I was impressed with the visuals and special effects. The science and storyline do require a modicum of suspension of disbelief, but remember why most of us watch movies... To escape from our miserable realities for a couple hours... So we can forgive ourselves for putting our Underoos on and just enjoying a movie every once-in-a-while without screaming for a full refund on the last 2 hours of our banal lives. As relatively unknowns, I feel the cast earned their paychecks, as I'm certain none of them raked it in, and I found myself actually caring about these characters whom I'd only met mere minutes earlier. Lastly I was happy I was eventually able to wrap my head around the plot without suffering an Inception-like brain freeze.Have faith peeps, you can make it through this movie... And if you're not too careful... You just might enjoy it."}, {"id": 166, "text": "I tried watching it several times. Like a hero, I tried!This film is what happens when non-scientist-types try to write science fiction. Artificial oxygen? Oxygen-rejection epidemic? A cure for... for what? The oxygen-rejection epidemic? 2067 has a (one-way) time machine, but can't even keep one single plant alive? Can you say whacky ecological agenda?So STUPID!!! It makes me cringe and groan, same as when M. Night Shyamalan writes like he understands science. Why doesn't someone tap these geniuses on the shoulder and whisper hire a real PhD? Or maybe just watch the complete Bill Nye the Science Guy set!If you want to laugh like you haven't laughed since The Happening and Space 1999, watch this farce!"}, {"id": 167, "text": "He read the story about the monk.A world without oxygen appears to have little use for showers.Your wife's only chance is dirty, but understandable.SCIENCE MAN!He's only 8! Good thing his wrist didn't grow.I'm surprised they aren't rushing him, but I guess with a time machine it's not critical.What about 1 to 13?So they know he's safe. Then they know if they should turn their hope to sad.I guess there was no need to learn stop-drop-and-roll.What about Archie?Pre Death Selfie?What are all these breadcrumbs he keeps finding? There is some explanation missing.Everyone is excited to make fire.They didn't give him any gel packs?What is it like acting with fake vomit. I'll say fake vomit has advanced tremendously since I was a kid.WTF is correct. Where did she get that collared outfit?!Took control of your fate?! Humanity has long been in its own hands. It is usually to ignorant or blind to make good choices.They aren't bringing supplies? Or dressing appropriately?!Shouldn't they are least be poised on starting blocks?"}, {"id": 168, "text": "All I knew about the 2020 movie titled 2067 when I sat down to watch it was that it was a sci-fi movie. Normally I am not overly keen on the sci-fi genre, but given the fact that I hadn't already seen this movie, it being a new movie and that I had the chance, of course I sat down to watch director Seth Larney's movie.And while 2067 definitely started out as being interesting and seemed to have a lot of potential, the storyline just simply flatlined and gave up halfway through. The movie went from being a dystopian movie where mankind is threatened by imminent extinction, to becoming a ghoulishly boring family drama about a young man trying to reconnect with his long-dead father.Simply put, the movie plummeted from being watchable to becoming something that was less than mediocre. And it didn't help much on the overall enjoyment of the movie that the storyline just spiraled out of control and became a confusing mess that made very little sense.The acting in the movie was adequate, and I do enjoy watching unfamiliar faces and talents on the screen, which was something that 2067 definitely had. I wasn't familiar with a single actor or actress on the cast list here. It was just a terrible shame that the performers were severely hindered in delivering good performances from the lack of proper script and storyline.Visually then 2067 definitely was interesting enough. Although this wasn't a movie that was heavily relying on have bedazzling special effects.I did manage to sit through the entire ordeal that is 2067, and trust me, it was an ordeal to get through. My entertainment level went from being moderate to well below average, which also reflects my rating of the movie, which settles on a generous three out of ten stars.2067 started out great but ended up failing to deliver, and it feels like that there was just so much good potential readily squandered here."}, {"id": 169, "text": "Actually, the acting was pretty good. Loved the lead in Let Me In. The special effects were good, too. Even the dialogue was good. So, what went wrong?The most important failure was the poor premise for the story. This feeds the bizarre, unscientific climate change hysteria. This acts as brain-dead propaganda for the Big Corporations (Big News, Big Oil, Big War, Big Entertainment). They're all owned by the same Globalist-Leftist psychopaths. Those are the Leftist Capitalists who try to destroy the Free Market Capitalists by creating more Big Government tyranny (pure Leftism).Enough with the propaganda pieces, please!Anyone in their right mind wants a clean, healthy biosphere. But lying about it doesn't help! Oxygen scarcity? By 2067? Groan!Yes, too much of anything is bad, but what the Leftist media does is conflate any change with extreme change. That's just plain dishonest! That's 1-Dimensional, identity thinking: climate change = bad = global warming = global cooling = returning to a better climate = Earth bursting into flames = justified violence... Anyone who falls for this junk needs our sympathy, but also a swift kick in the backside. Wake up from your woke delusion. Some of the brightest minds have fallen to self-induced blindness, making their Effective IQ sub-par.This movie could have been so much better with a believable premise."}, {"id": 170, "text": "Here is my disclaimer: I grew up on Star Trek, Starwars, and Battlestar Galactica, and therefore like pretty much any science fiction. Plots involving time travel and alternate realities are not on top of my list, but they are close to it. My review, of course, needs to be interpreted against this personal preference. (But if you don't enjoy science fiction, what's the point of thinking about watching this film?)I hesitated investing almost two hours into watching this film because of many bad reviews. Actually, I started once and stopped after ten minutes - big mistake! On the second attempt (yesterday), I gave this film an actual chance. (The same is true for some good literature: You have to try twice. I was unable to read Buddenbrooks by Thomas Mann the first time, but once you give it a proper chance, you may come to realize how great it is.) THIS FILM IS NOT AS BAD AS MANY REVIEWS SUGGEST. The story is a fine piece of science fiction. The ending is satisfying (and it's a welcome change compared to some other films that are trying to set up a sequel or feel smart by leaving you guessing at the end). The protagonist is someone you can relate to once you get into the spirit of the story. The pacing is fine, as are the changeovers from one act to the next. There may be plotholes, but I think that almost any intelligent movie has, and the writer/director could eliminate any hole with pretty much one sentence (as is often done in series such as all Stargate installments); thus, I don't need the sentence, I just make up my own mind about it (after all, science fiction fans are supposed to be cerebral people), and enjoy a good story without needing to criticize any aspect that doesn't seem obviously logical on first thought.Obviously, this is not Interstellar. And yes, some acting and make-up are a little weird. It is also not Europa Report - 2067 does indeed lack the almost flawless scientific feel that you would expect in hard scifi. But neither are the categories this film is supposed to be in, and one needs to approach this film with realistic (i.e., not blockbuster or game-changer) aspirations. I think it is proper to reward the makers with a rating that takes account of this fact. After all, given the many exchangeable ideas and films that are around, this one is a nice gift to scifi fans who crave something different. I hope that future (and, maybe, even better) projects are not hindered by the bad reviews. To fuel this hope, I wrote this review - the first one I have ever written on IMDB, because the bad reviews don't do 2067 justice."}, {"id": 171, "text": "First off, let me get this out of the way but this was a fantastic performance by both Kodi Smit-McPhee and Ryan Kwanten. The movie had more subtleties in it that i would have possibly imagined and i'd probably only be able to give enough praise should i ever get to share beers with whoever made this possible. From the room shaped as a brain, where through this process they kept layering knowledge in him, oh well i should really not spoil so much!Now let's get to the message, because like Tenet, this movie was about sending a message. If you focus on the details, you might miss the entire opera.It seemed cringey a bit, in the beginning but as the movie unfolded, it kind of made sense to just not fight it, and try to roll with the idea that you are indeed what's most important, and just ... listen and not get in the way of yourself. Because ... that's kinda what it's all about in the end. You.Also you might have missed it, but it was probably worth sacrificing an entire civilization - for you, over and over again, until you get it to feel right.The rest things in the movie are all there is, just visual representations. You can choose to put in hate and shoot at whatever comes out, be afraid or you can choose to simply blindly trust and see what comes from the other side.We're simply half truths. If we cannot allow ourselves to fall only to get caught and brought back up again, what's the point?"}, {"id": 172, "text": "I'm not sure why everyone hated this movie. I admit that it's not a colossal big budget Sci-Fi like Blade Runner but as an indie film, it was damn good. Kodie Smit-McPhee was actually really good in this, contrary to everyone ranting about how terrible he was; he wasn't terrible. It was a good solid Sci-Fi film with a remarkable message about the state of the world and the devastation that the human race is causing to the eco-system. 2067 is a not a run and gun fast-paced shoot'em up type of Sci-Fi film and if that was your impression, I'm sorry that you're disappointed. This is more about one person's struggle with accepting his place in the world, and how his identity was shaped by the decisions of his family and himself. 2067 is a more emotionally driven humanistic type of Sci-Fi. While it ticks all of the boxes of what a film in this genre should be, it uses these stereotypical sci-fi themes to illustrate a story about a kid who lost his parents and suddenly found himself alone in a dying world. It goes through his struggles of self-identification, and recollecting his memories to understand the decisions that were made for him and the weight that those decisions would have on his future.The backdrop is a world in 2067, which as been devastated by environmental destruction to the point that there is no longer any natural breathable oxygen. Ethan Whyte a city worker in one of the last existing urban colonies, relies on injections of artificial oxygen created by Chronicorp, a company that his father once worked for. This company, which is also developing a time machine to figure out how to send people to a better more sustained world, receives a message from 400 years in the future which simply states, Send Ethan Whyte. This message has great implications as the experimental time machine cannot successfully return someone without having an anchor (a person) to activate it on the other side. This is the catalyst that sets off the film.Overall, I thoroughly enjoyed it. Despite it's science fiction elements, on a humanistic and personal level, the struggles of Ethan Whyte are relatable. Kodie Smit-McPhee, a relatively young actor, did a phenominal job as did the supporting cast. The setting and, in particular, the musical score throughout the film were also very well done."}, {"id": 173, "text": "I don't normally write a negative review... as I like even the most odd B-grade movies. But this is a unique one.Though I can't rate it a one. There is some merit to it.The film has a nice concept. Many big ideas. Overall, on paper, it probably seemed like an amazing idea. All the basic fundamentals are there. But the production was all over the place. There was A LOT of ambition and you can kinda see that. The music and CGI are actually not that bad.On a technically standpoint, it's not ''bad'', just missed the mark and wasn't able to fully show their cards the way they wanted to, or in someways, they didn't know how.There were a lot of hit and misses.For example; casting. The cast was overall, average. Some were good and some were just outright... a one foot splinter sticking out of an unfinished grand piano. There was one particular character who was obviously designed to be the posh Company Director that every syfy has, ever. And dear lord. Whenever this actor was on screen, it suddenly turned from cinema film to weekday TV Auzzy soap drama. It was just completely out of place, bringing down the production value on screen completely. I've never experienced this with a film.The characters also had no real synergy or connection with each other. They weren't exactly bland, but we never really got to connect with them either.The special effects on the other hand, were actually pretty good. There was a lot of potential to create a vast world within the film, but they wasted it. And the most impressive shots were only used a handful of times. They had a lot of grandeur and ambition, but I feel that it was limited by budget. The film sets up an amazing set, that is never used.The story was also a hit and a miss. The plot twists were good, but the building blocks leading up to the climax... ultimately made no sense.The film felt like a dream project you started. You start with this small idea, which just grew and grew over time, into this massive snowball. And you want to make it into a snowman, but it's just so big, you don't know how to actually contain all that snow. And by the time, you finish building the snowman? It's an unpolished mess with cracks and holes everywhere.That's what this film felt like. And I just checked the wiki while I am writing this sentence. The Director came up with the idea in 2005. So I guess I'm not too far off.Overall, I personally give this a 5/10. It was still watchable. And I still enjoyed it to a point. Will I ever watch it again? Probably not. Most likely by 2021, I'd have forgotten that I ever watched this film."}, {"id": 174, "text": "Oh dear... 'artificial oxygen'. When this is a key part of the premise, you know things are going to be annoyingly lazy on the science side of the science-fiction!The time travel paradoxes could actually resolve (at a stretch) under certain interpretations of quantum observer effects. I'm pretty certain the writers didn't know this, though! If they had, they could have put in some additional actually interesting plot using the side-effects, with the bonus of actually explaining the rules for the universe of the story along the way.Nice visuals, well above what you would expect on the budget. Overall premise had great potential, frustratingly squandered by lazy+unintelligent writing and especially dialog well over the boundary into purple prose. And please save me from yet another protagonist with debilitating daddy issues!I don't need my 2 hours back, but it certainly lacks any re-watch value. Not even worth a fan-edit, which could probably bring the move up from a 3 to a 5 or even 6: just relocating a few of the emotional scenes (not necessarily bad in themselves) to before the (literal) ticking clock starts, and tightening out most of the runtime padding would remove a lot of the more frustrating-to-watch aspects of the film."}, {"id": 175, "text": "So this film, it looked great. Great set design, great CGI, very interesting visuals. Unfortunately, the plot sucks. In a time travel movie, you just have to set clearly defined rules and adhere to them. This movie does not do that. It nevers sets any rules, and what you do find out about how this version of time travel works, gets basically thrown out the window towards the end. I liked the idea of setting the film in the future, and then time traveling not to the past, but the further future. Great concept, but horribly executed. It's the fact it's a movie basically all about time travel, yet they screwed up the time travel. What's left? Good performances, but unrealistic characters. Lots of reusing footage too. You keep seeing the same scenes but with more revealed, yet, it doesn't make you want to see those scenes in full. You'll likely just not care. A time travel movie should probably get the time travel right, but it doesn't. Even a child could see the flaws in the plot and even though it seems to be more concerned with being a character study, I think it failed at that as well as having a bad plot. This movie isn't terrible, but it's not good."}, {"id": 176, "text": "I wanted to Like it as I am a Big Fan of Sci-Fi, futuristic flicks, but couldn't.Any sci-fi movie pleases me and entertains me as i love the 99.9% of them.But not this one.Because 2067 its so poorly acted, and its plot is too poor.Perhaps with better actors and a better script, this film could have been entertaining and cool.Of course, we should commend anyone who tries his/her best to produce a good movie.That being said, i regret to tell you not to waste your hard-earned money purchasing a ticket to watch 2067.Really not worthy of your time. You might even be compelled to leave the cinema.Yes, that bad it is. Sadly."}, {"id": 177, "text": "OMG I'm still laughing at the reviews for this, the story is mind blowing a realistic sci-fi movie oh dear. I did actually enjoy this movie but it was a struggle with all the wobbly melodrama &amp; the hokey science, the time travel aspect is straight out of 12 monkeys &amp; predestination. Ok so all the oxygen is gone &amp; people are breathing man made o2 through masks while outside but not in buildings? So if there's no oxygen outside, why isn't air rushing out of rooms when doors are opened, didn't see anyone go into an airlock. The ending is also very suspect, no more plants are alive in the world due to lack of oxygen so sending back a couple of tons of extinct plants from the future aren't going to survive without oxygen long enough to replenish the worlds oxygen supply, just silly. This is simply a by the book drama, one overly dramatic scene leads to the next with God awful stringed instrument music. Cinematography is very good, cgi &amp; special effects are ok. Better casting choices &amp; a much better writer or even just a better thought out story &amp; this could've been a pretty decent movie, no better or worse than what's coming out of the Russian film industry."}, {"id": 178, "text": "I find too many bad reviews on this movie and yet the artistry and backdrop work is amazing. It seems everyone in 2020 is destined to be negative about everything and that is not cool. Just chill out emotional police. Kodi Smit-McPhee has never been a lead in his own major film and if he was it wasn't too catchy like this one, We all know him as Nightcrawler from the marvel universe from X-Men. There was talk here and there for him to have his own movie but it never happened. Ryan Kwanten once again did a great job and his acting was on point especially psychologically, what people are complaining is not the actors fault but the producers doing the final cuts and they cut half his dialogs and it looks like half ass acting. Deborah Mailman was phenomenal like usual and she played this evil empress like the black queen! OMG was I so angry at her and at the end we all got our justice. For an instance I thought this movie was going to end in a bad note where all of humanity would die off and it was cool. Well that was not cool for me I almost turned away. What a great crew and great job they must of spent way more money than they should on this productions."}, {"id": 179, "text": "Long time ago Seth and Dave were hitchhikin' down a long and lonesome road. All of a sudden, there shined a shiny demon in the middle of the road. And he said: Pitch me the best indie sci-fi in the world, or I'll eat your soul. They each said. Okay. And they pitched the first thing that came to their heads, Just so happened to be, The Best Movie in the World, it was The Best little indie movie in the World. It was destiny. Once every 4 hundred years or so, Needless to say, the beast was stunned. Whip-crack went his whoopy tail, And the beast was done. He asked them: (snort) Be you time travelers? And we said, Nay. We are but writers. This is not The Greatest Indie Sci-Fi in the World, no. This is just a tribute. Couldn't remember The Greatest Indie Movie in the World, no, no.TL;DR Production is excellent and it has all the elements to make it into a classic but somehow they messed it up. Good one time watch but a bit slow and overly dramatic at certain points. If you can ignore major science plot holes this will get you your sci-fi fix for a couple days."}, {"id": 180, "text": "This low budget Australian movie cleverly immerses you into a world, or one world across two different times.So the plot is that they plan to save the world by stealing the Infinity Stones with a time heist , wait that is the plot of Avengers: End Game, no in this one they have to go into the future to find the solution to today's problems, because they believe if the world of the future exists, they must have solved the problem, but all they really needed to do was get everyone to play the same song together at the same time, no wait that is the plot of Bill &amp; Ted Face the Music. Maybe it was going back in time to be both their own mother and father, or was that the plot of Predestination.So the real plot is that they want to go into the future to get the cure for the problems of 2067. But there are a few plot twists and turns. It is a bit stretched (remember, low budget movie) and a bit melodramatic at times, relying on a lot of cliches about time travel to try and say something about the world's current times (something about nature of human selfishness).This movie divided both critics and audiences with some loving it and some hating it. I feel that I am somehow in the middle. I think that is mostly because it is a bit cliche, or that I have watched too many time travel movies. It is worth checking out just to make up your own mid."}], "reviews_amount": 181}