{"name": "Death of Me", "titleId": "tt01830643", "reviews": [{"id": 0, "text": "Inspite of the negative reviews, inspite of the trailer not being enticing, i went ahead n saw this only cos of Darren Lynn Bousman. The movie is a terrible take on the Wicker Man movie. Tedious n repetitive scenes of running here n ther... Ther is nothing good here n inspite of the movie being shot on an island, the cinematography ain't that picturesque. In fact, Christopher Lee's Wicker Man got some lovely atmosphere. This movie is devoid of suspense n tension and gets very tedious at times. Ther is unnecessary two scenes of gory stuff. Someone rightly pointed out that Luke Hemsworth is looking like a fatter Matt Damon. Must be the water retention due to steroids."}, {"id": 1, "text": "I thought the concept for this was ok but the execution was awful. The majority of the film is spent running around, having hallucinations and trying to talk to people who don't speak the same language as you. If this sounds interesting to you, check it out. If it sounds off putting, pass."}, {"id": 2, "text": "Maggie Q is a phenomenal actress and I have no idea why she signed up for this film, perhaps the trip to Thailand which is the only reason I finished it. My brother walked away after 15 mins, I kept on going. So basically Luke Hemsworth who's probably tired of being compared to his brothers plays Maggie's husband his accent goes from Australian to American which is annoying. Also still at the end you don't know if he is dead or alive. I get the black magic juju, human sacrifices which is what this film is about. But trust me it's utter rubbish, the American playing the tourist that never left is useless. Maggie some how is left to carry this film and she does a great job but Luke was miscast, it had promise if the writers thought it out more. Storyline really is poor so unless you are bored or just want to see Thailand's beautiful scenery skip this film."}, {"id": 3, "text": "Utter garbage. Avoid at all costs. Someone has clearly tried to merge Rosemary's Baby with The Wicker Man and failed miserably. The only good thing about this movie is the scenery (Thailand)."}, {"id": 4, "text": "Trying to communicate with locals who doesn't speak English. Feeling sick. Having horrible visions. Running around the island. Those 4 themes are main building blocks of this movie. Each is repeated dozen of times. I managed to watch it till the end but I advise you not to even try as it is a waste of time."}, {"id": 5, "text": "To be honest not a bad movie , i dont understand all the horrible reviews. it is not an oscar movie, maybe the ending could have been better, but we watched it on a sunday evening and we were entertained."}, {"id": 6, "text": "I really love the actress, Maggie Q. She is one of my favorite actresses. Honestly, this movie is one of her fine works. Of course, the storyline is not perfect (but it was a really enjoyable watch for me) or whatever you guys are talking about. Believe me. There are so many weird things and places we can't describe how dark they are. This movie is all about them. Just give it a try. If you're a horror movie fan who doesn't really care about ratings before you watch and if you're a positive watcher, I recommend you to give it a try."}, {"id": 7, "text": "Wow, what a mess...no mistery, no thrills, not one scary scene. Incoherent, rambling, unengaging film, with some ridiculous and laughable moments. Avoid!"}, {"id": 8, "text": "Horrible. Terrible. Crap. Bad. Awful. Sucks. Skip It."}, {"id": 9, "text": "Death of Me is somewhat engaging for a while, but the story's trash.Another Hemsworth? Another babka? A fatter Matt Damon lookalike. Saw Damon and a Hemsworth at a football game once, could be his stunt double. Anyway, the film's okay until it all becomes hallucinations and Neil's gone, then it gets tiresome. Why'd she take the trinket off? She has to know she's dead or was it the storm or could she not leave the island, I dunno."}, {"id": 10, "text": "I love a movie that keeps you in suspense or keeps you guessing or even one that makes you think. But this atrocity neither entertains nor kept me riveted and at the end just had me asking what the hell did I just watch? Normally I'd care but this movie wasn't worth worrying about what the end meant. I just want my wasted time back. I could've been watching my grass grow or something more entertaining.The only interesting thing that came out of this movie is I swore on everything I held sacred that Luke Hemsworth was Tom Berenger's son. He might have been switched at birth but if he doesn't look like a young Tom Berenger...well you get the point."}, {"id": 11, "text": "I nearly skipped this movie because of the reviews but I like Maggie Q so thought give it a go. Maybe because I didn't expect much it turned out to be quite good. Maggie Q was her usual convincing self in her part , the story line was a bit wicker man but overall enjoyable. Give it a go if your a horror fan you might be surprised."}, {"id": 12, "text": "Were the writers high or just Stupid! Unrealistic scenarios with clueless tourist putting themselves in danger on an Island where only 2 people speak English! Sad this garbage will go on the actors resumes!"}, {"id": 13, "text": "Garbage movie with a weak plot and bad acting from the majority of the other cast besides the 2 main characters. Plot was intriguing until I started watching the movie, then it just became worse and worse and ultimately watching this was a waste of time. Scenery of Thailand is nice and perhaps the only highlight of an otherwise bland and forgettable movie. Shame, could've been a lot more with a tighter script. If this movie is a sign of things to come, then Spiral could be in danger."}, {"id": 14, "text": "An interesting Thailand-set premise, handled with alarming amateurism from the director of Saw. Starts off well enough but careens quickly into unimaginative mediocrity. So convinced is the filmmaker of his own ungodly mess, he's briefed the composer to create a score best described as 'screeching nails on a blackboard'. I imagine this migraine inducing cacophony is designed to stop the terribly disappointed viewer from nodding off. Coupled with 90 mins of xenophobia, projectile vomiting and disembowelments, this really could've been the death of me. Three stars is generous."}, {"id": 15, "text": "I was waiting for The story to begin but no they managed to finish the movie with no closure whatsoever.Sad"}, {"id": 16, "text": "I didn't like the movie right from the start. The whole story is BS. I watched it until the end only for Maggie Q. She is one of the most beautiful and sexy women on this planet. She deserves better scripts and movies though !"}, {"id": 17, "text": "This is easily one of the worst films I've seen. Maggie Q spends the entire movie confused, as does the viewer. She runs around Thailand hallucinating, there's no character development, and the movie is a waste of an hour and a half."}, {"id": 18, "text": "That we have to piece together and guess what's real or dreams. I thought Maggie's acting was stellar. But that's all my positive thoughts about this one."}, {"id": 19, "text": "Please save your time from wasting it on this movie."}, {"id": 20, "text": "What a waste of an hour and a half of our lives. I don't recommend unless you like movies that you have to finish cause you wanna see if they turn out alright."}, {"id": 21, "text": "Nonsensical story with no explanation whatsoever of some voodoo crap. The same people moaning(singing) throughout the whole movie was annoying as f@@@"}, {"id": 22, "text": "A LIONSGATE distribution has to mean something, at least a minimum of quality. but after reading the bad reviews I became skeptical and decided to watch the movie. the film is confusing and has little connection. as much as I want to see something good, it is still a failed movie."}, {"id": 23, "text": "Avoid it. Do you have to wash the dishes? Do you have to clean the garden? Do you have to work? Just do it and avoid this movie. Everything is better than watching this, believe me. And don't even dare to spend a cent on this. I even think that watching the roof, lying in bed and meditating about life is better than watching this.The concept was interesting and could be a 7/10 stars movie, but it was so poorly executed that theres nothing good with it, really. The only thing that was nice to see at this movie was the scenario, beautiful place where it was recorded and that's all."}, {"id": 24, "text": "But I gave it a chance started promising than 3 quarters in i just couldn't bear it once she shot the women causing an accident with a child in the car I switched out DREADFUL"}, {"id": 25, "text": "Very much a confused mixture of Midsommar, The Wicker Man, and every other travel horror movie, Death of Me is officially my least favorite Darren Lynn Bousman flick (Saw IV coming in a close second!). The writing is the key drawback here. Other than the ravishing Thai locales, there's not much in Death of Me that sticks. Maggie Q isn't a bad performer; the material only requires her to be perplexed all the time, just like the audience. Luke Hemsworth doesn't leave an impression, and it makes no difference to the plot when he suddenly disappears.This makes me a little worried about Spiral (the new Saw film), helmed by Bousman. You'll notice some of the dark color palettes from the Saw films in mood-setting shots, along with the occasional body horror. At the end of its 94-minute run-time, Death of Me doesn't give you any answers. In fact, it fails to ask the right questions through its lead characters. It probably won't bode well for Thai tourism, that's for sure!"}, {"id": 26, "text": "Wow! Just finished watching this movie. Had 0 expectations, ended up really being entertained! Sure, some parts could've been done better, but it kept me interested till the end."}, {"id": 27, "text": "Neil (Luke Hemsworth ) works for a travel magazine. He is doing a story on a vacation spot on a Thai Island. His wife Christine (Maggie Q ) is with him. They wake up not knowing what happened to them, victims of a blackout with missing passports. A strange video shows up on Neil's phone of him killing Christine, which irks them both as they can't get answers. They back track their steps.WE get an answer near the end. I think the story might have been better if it wasn't a mystery, maybe showing us the previous victim as an opening teaser.Guide: F-word. Sex. No nudity."}, {"id": 28, "text": "I read a bunch of reviews for this, seem to be more positive than negative contrary to what I'm seeing here so I went in with high expectations. I watched this film on Friday night and it's been marinating since then and I do believe this is one of my favorite films of the year. It seemed like a tense ride at first but there are things that just stick with you, images, performances, story points. This movie really grows on you and now I find myself needing to watch it again to appreciate all the twists and turns. I think some of this comes from it not being what I expected. I read a lot of comparisons to Midsommer and this one cut to the chase right off the bat. Just dove right in and was nonstop tension. Maggie Q of course delivered but what look like local actors - there was such personality and authenticity rather than a bunch of people that looked like actors. Then the was the story. Some have said a bit predictable at times, but there were some great twists and turns. Overall, do yourself a favor and watch this, preferably with some friends because there's a lot to discuss and unwrap after."}, {"id": 29, "text": "Not my biggest complaint but it was literally her shorts wedged up her buttcrack the whole movie. Lol They should have done a little better with wardrobe. But also the whole movie made no sense. It only held my attention in that I really wanted it to get better. The potential was there. It just flopped, in my opinion. My husband predicted the whole movie and every twist in the first 10 minutes. Wasnt worth what we paid to watch it for sure."}, {"id": 30, "text": "Don't even bother to watch this movie this movie is total time waste boring and one the worst movie ever i wish i could give this movie -100 Stars"}, {"id": 31, "text": "Sadly this movie was well below average due to the script and some of the direction.I think the initial premise is interesting enough, like a far away land version of 'The Wickerman'; but the cult doesn't really have any of their inner workings and oddities displayed out for us.In the end there are two exposition dumps that kind of ruin the immersion and story for me. The acting was ok, the music was average.3/10 this film dragged on, and the ending was bad."}, {"id": 32, "text": "I was gonna say this is a great movie but the whole thing was confusing I think I gave it the 4 stars for the music only!!"}, {"id": 33, "text": "Couple taking too many party drugs explain everything. Non sense for many aspects and not mysterious at all."}, {"id": 34, "text": "Good movie and acting. highly recommend. different concept of movie in a long time. Definitely watch. Who ever wrote that you don't know if she is dead or not didn't really watch the movie. Just watch it for yourself. it's a great movie."}, {"id": 35, "text": "I thought this was a well done horror movie, so don't go by the imdb rating.Admittedly, it borrows ideas from other horror tales, but I feel it was very unique in its approach. The acting was good and the story was well done, as well as the filming. There was a definite feeling of dread throughout that kept me on my toes wondering what was going to happen next.It was very creepy to me and unpredictable. I've watched hundreds of horror movies and I think this one we definitely better than average."}, {"id": 36, "text": "Do not pay to watch this movie, even if its 1$ its not worth it not even with a Hemsworth in it. It really try's so Hard to be a good horror but it never succedes."}, {"id": 37, "text": "It was a nice try at being a psychological, island thriller in the sane vane of The Wicker Man. I\\ Its attempts fell short as the movie failed to flesh out the twists and mind games."}, {"id": 38, "text": "This movie reminded me very much of the 1978 NBC miniseries The Dark Secret of Harvest Home with Bette Davis, Rosanna Arquette and Dan Aykroyd. It was based on a Tom Tryon novel. The POV is different, but the two movies are so similar it's hard to ignore.Anyway... it wasn't terrible, but it wasn't great. I think the title really does a disservice to the film. I won't give any spoilers, but Maggie Q really should stay off islands between this movie and Fantasy Island, which was easily one of the worst films I've seen. Because I watched this one right after and it was marginally better, I am willing to give it 5/10.Most of the movie is Maggie Q being confused. She's being gaslighted by an entire island's population for nefarious purposes. I will leave it at that. It was meh."}, {"id": 39, "text": "This could've been a very decent thriller but it wasn't. The score was awesome, the premise was decent and the flow was spot on but the execution was foolish. After being told of the ritual sacrifice the story spirals completely downhill and the ending becomes silly and amateurish. Kudos to Maggie Q for her effort but her and her husband were both poorly written as clueless numskulls Americans around a race of people that are absolute idiots. Thailand people are no where that clever and that made Q's and Hemsworth roles highly unbelievable. A one time watch film."}, {"id": 40, "text": "First, this movie was set in green and beautiful Thailand. It is, indeed, refreshing to see a Hollywood movie not set in Los Angles, New York, or Chicago. Even some movies, filmed in Canada, claim to be set in LA. In fact, there is much talent in a country such as Thailand. The movie leaves you puzzled, surprised, and sometimes at the edge of your seat. I had to watch it twice to comprehend all the hidden clues. The ending is also twisted and surprising. Finally, Maggie Q , as beautiful as she is, provides a superb performance."}, {"id": 41, "text": "You can pretty much sum it up as wicker man in thailand. (with a direct to dvd/to stream budget)They even referenced it directly in film. Extra star for them knowing exactly what they are filming.and it's unexpectedly gory, despite it looking like a mild horror flick made for general audiences in the first half of the film.Maqqie Q and Luke both likable, but you don't really care much about them. Like the WickerMan, the ritual, the islanders and the island itself are the main characters of the filmGood watch for a horror film fanatic. Too bad the ending is not as spectacular as the afore referenced film/s"}, {"id": 42, "text": "If you are looking for movie in an exotic location with plenty of local color and native traditions, this is it. If you love a mystery, especially one derived of hallucinogenic dreams, alcoholic black-outs and Buddhist lore, this is it. If you like to be confused rather than being able to predict exactly what is going to happen next, this is it. If you like constantly asking your companion what just happened or is that the same person as before? this is it. There are so many flashbacks via digital video that are similar and make no sense. If you were killed and now are alive, what happened? And if you like it where one of the main characters mysteriously disappears, this is it. Also IMO the lead actress should have been replaced by Kelly B. Jones who was much more interesting and attractive. Better than I thought it would be. And the ending? Not so predictable."}, {"id": 43, "text": "I can honestly say this is probably one of the worst movies I have ever seen. Horrible writing, suspect acting, and an absurd storyline that is hardly scary. Weird? Yes. Good? No. Save your money. I wouldn't force my worst enemy to watch this picture."}, {"id": 44, "text": "Not awful, but it's obviously heavily inspired by The Wicker Man. It can get a little repetitive in spots, but I thought it was well shot. The real issue here is the lack of suspense."}, {"id": 45, "text": "This film start with the news broadcasting about typhoon, and the introduction of a couple(Christine and Neil) scene! As turnout, this film is about Christine taken by a bunch of villagers in Thailand to sacrifice her to their god, for the outcome of saving them from the typhoon disaster! Entire film full of boring conversation, and annoying overuse scene! Such as, overuse of the disgusting vomit things scene, overuse of the jump scare scene, overuse of the hallucinate scene, overuse of the news broadcasting scene, overuse of the waking up scene, and overuse of the blackout scene! Make the film unwatchable! Barely intense scene is, Christine shot at Samantha to kill her! At the end, body of Christine discover by the rescue team! She resurrect by the amulet! That's it! Wasting time to watch!"}, {"id": 46, "text": "Maggie Q looks great, But movie is amazingly Bad. Bad Direction Bad Story Bad Everything I mean how can something be this bad."}, {"id": 47, "text": "I found this to be an enjoyable movie, set in a stunning location, that provided some nice mystery elements, delivered by some quality acting particularly by Q.Its simply made and does have some sillier moments, but the simplicity and the small village feel they were going for really worked for the movie by adding to some of our (stupid) beliefs that this could happen on these 'quirky islands'. The movie plays into that classical 'voodoo' religious style cult on remote islands, that movies have been pumping us with for decades. So we buy in a little.This buy in and Q's great performance deliver a strong outing and should be enjoyed by most. :)"}, {"id": 48, "text": "At first when me and my friend started watching this we kept asking all kinds of questions and we kept getting confused by a few things. But as the movie progresses we got very interested in figuring out the answers of what's going on during the film... If you take time and really watch it and look at what you are watching you will find clues, about what is really going on... And what is going to happen eventually at the climax, you can figure out what is going to be the ending of the film. my friend and I at times got irritated by a couple things, but ultimately we enjoyed the film and it was decent to watch and see what happened at the end."}, {"id": 49, "text": "I don't really understand the bad reviews. I watch horror, in fact, it is nearly all I watch. I have encountered that many poor horror films that are totally unwatchable over my 30 plus years of watching horror films. This is a reasonable quality movie and a decent watch and for me, a reasonably engaging story line with good visual quality."}, {"id": 50, "text": "Only good part of this movie was Maggie's sweet stomach at the end, while sitting on the beach. I just want to lay my thing on it. Hmmm"}, {"id": 51, "text": "Even if you like Maggie, avoid this one. You don't have to thank me later. Seriously."}, {"id": 52, "text": "I've been to Thailand 10+ times and next time I go there, prob in 2 years or so, because of this corona virus, I will film the beaches and just add some bad scary-acting music and call it my masterpiece. This is such a bad movie, even beer, chips and chocolate + some aspirin didn't take away the pain I suffered watching this crap. But, I'll admit I will be drinking with some moderation first night I arrive.Totally waste of time. Believe the reviews, also mine, and just skip this movie and watch an old episode of The Price Is Right. Or do yourself a solid and crack open a beer and see Happy Gilmore one more time. (The Price Is Wrong *****)1/10 and that's me showing mercy"}, {"id": 53, "text": "I would normally rate this about a 5 or 6, but I felt obligated to rate higher because of such the low ratings. It wasn't a horrible movie. Yes, it's somewhat similar to Midsomar/Wicker Man, but it really was not bad. I was interested in it all the way, I didn't want turn it off, yeah some parts I was like this ___ is dumb, why? But aren't all movies like that, lol? It was a good movie for a Sunday night, I didn't think it was that bad, it's more like a thriller horror, but not like a horror movie in my eyes. Other than that, idk why all the negativity towards it."}, {"id": 54, "text": "Why are there so many negative reviews ? It's a good thriller with a black magic,not very smart but entertaining. nothing unusual but very watchable! Beautiful actress and good acting, so don't listen the bad reviews, just enjoy an interesting story"}, {"id": 55, "text": "I don't get the idea of this movie. not worth a watch."}, {"id": 56, "text": "This is a decent enough thriller. Maggie Q does a great job at carrying this film &amp; does well playing the confused &amp; disorientated character as well as the heroine too. It tries to reinvent the Wicker Man but does not quite achieve this. They speak Thai mostly in this film and without subtitles you kind of sympathise with Maggie not knowing what is said. It builds up suspense and throw in some strange Thai ceremony to reinforce this. It is an adequate thriller with a decent enough pay off ending..."}, {"id": 57, "text": "I saw Death of Me, starring Maggie Q-Fantasy Island_2020, Balls of Fury; Luke Hemsworth-Westworld_tv, Thor:Ragnarok and Alex Essoe-Doctor Sleep, Starry Eyes. This is a weird little movie with an interesting hook. Maggie &amp; Luke are tourists on an island off the coast of Thailand. They wake up in their room after a night of heavy drinking and don't remember anything they did the night before. Luckily, they find video evidence on their camera showing them what they can't recall. Unluckily, they are disturbed by what they see. Luke is shown strangling Maggie-and breaking her neck in the process-and then burying her in a shallow grave. Now they have to do some detective work to find out what the @#$% actually happened and why Maggie is still walking around among the living. Alex plays an other tourist that has become a transplanted local that tries to help Maggie &amp; Luke in their hunt for answers. Believe it or not, a typhoon closing in on the island factors into the source of their problems-I did say this was a weird little movie. It's rated R for violence, language and sexual content-no nudity-and has a running time of 1 hour &amp; 34 minutes. It's not one that I would buy on DVD but if you are a Maggie Q fan-like me-it would be alright as a rental."}, {"id": 58, "text": "Movie is very confusing to what the hell is going on and what's real or not but it didn't stop me from enjoying it. Does get annoying that majority of people in this film don't speak english. But i think its worth a watch at least once."}, {"id": 59, "text": "This movie left me confused don't know how to explain it have to watch it to find out.."}, {"id": 60, "text": "It's honestly not THE WORST but it isn't anywhere near the best."}, {"id": 61, "text": "It has its horror and thriller moments and they are great.The ending is inspiring that it remind you the ending of the first 'The Last of Us' game.I would gave it a 6.5 if it is 10 years ago but when compare to the quality of other horror films today. I gave it a 8."}, {"id": 62, "text": "It's more on Thailand Culture and I don't think this is for International Films at all. I can't adopt it as a Western Movie at all."}, {"id": 63, "text": "Try lowering your bars a little and enjoy it as an (albeit slow) rollercoaster venturing through other cultures mystical beliefs."}, {"id": 64, "text": "I'm a big fan of Darren Lynn Bousman. He directed the second, third and fourth instalments in the 'Saw' franchise and played a big role in making it what it was. He's also had some other gems along the way like 2010's 'Mother's Day'. Unfortunately 'Death of Me' is not his strongest work. In fact it's the weakest thing I've seen him put forward. The concept actually had potential which is the disappointing thing, but the way they went about structuring this movie was just horrific.The movies opens with a very strange and intriguing scene. It left me excited for what the movie had to offer. Then as each revelation slowly came to light the movie became less and less interesting, until around the halfway point where it completely lost me. I tried to remain invested but it was just too hard. If it were not for Maggie Q's performance in the lead role, which she actually gave everything she had to, this movie would've gotten a lot lower rating than a 4/10 from me.I sometimes see terrible movies that are set on tropical islands and wonder whether they get the stars they do to appear in the movie by the promise of working in paradise for a few months. It's the only way I can imagine them getting Q and Luke Hemsworth to sign on. This is not one I can recommend sadly."}, {"id": 65, "text": "This is your very typical but below average usual tale of tourists in some foreign land finding themselves in the middle of a horror thriller. Except this film which had 3 writers is just a jumble of stupidity with scenes and dialogue that were so bad they were LOL funny. Within the first 10 minutes, characters who might as well be mentally challenged act in improbable ways and it gets worse from there. I kept watching out of curiosity but there really aren't any surprises. Things take place that are never explained, so much is going on which is maybe because it took 3 people to write this, and the entire movie doesn't make much sense. Sadly , Maggie Q is giving it her all but she is given so little to work with. There is no chemistry between her and the least talented Hemsworth brother, who are supposed to be man and wife and there is zero character development. The film lacks any suspense, just a little gore, and mainly you just watch wondering what they're going to throw up on screen next. It only works when it becomes so ridiculous it's funny and that is not often enough to bother. The 3 stars is generous, but I have to admit I wasn't bored by it ."}, {"id": 66, "text": "The film is not horrible, it's just not interesting or engaging enough.The story stays still up until the last 25 minutes, but by the time of the big reveal, the viewer already knows everything (including the end).It's a really simple story and the viewer's interest dies very fast, especially since they basically reuse the same scenes a couple of times.The story itself makes little sense since the whole concept of the island's survival just doesn't work. It's a really bad idea to try and force someone to end his life to save random people who made your life hell.Even though the ending was satisfactory and it's not hard to understand the bigger picture, I still can't find anything enjoyable in this.But I guess it was still fun to see confused locals trying to act."}, {"id": 67, "text": "REVIEW - DEATH OF MEOk when you promote a film you usually promote part of the story, ok that's fine but what happened with this film?The promotional write up uses the story that one of the couple on holiday killed the other and this was filmed, they both watch it, how when one of them died the evening before, sounds interesting right? Wrong.The main hook above to get you to watch this film is only a very small part of the entire film and I can see why they went with this to try to get you to watch this film because the rest of it is just totally boring, drawn out over nearly 2 hours which could have very easily been done as a short, honesty and the main hook as above being ignored, not answered just leave you asking yourself why did I fall for it.Confusing as times with apparently things happening to just draw out the long of the film that have no context, if I sat in a cinema watching this I would have fallen asleep, actually I think I did!Go put the kettle on that would be for more of a better watch than this.Rating 2 our of 10"}, {"id": 68, "text": "I sat down to watch the 2020 movie Death of Me without having even heard about it prior to sitting down to watch it.It was nice, though, to find out that the movie had Maggie Q on the cast list, as she usually tend to be in some adequate enough movies, so I must admit that I had hoped that Death of Me, which was listed as a mystery horror/thriller, would turn out to be a good movie.Yeah, except it didn't...The storyline that writers Ari Margolis, James Morley III and David Tish had managed to put together made absolutely no sense at all. Sure, for the first half of the movie it was fun enough to try to figure out what was going on, but then the air just deflated from the balloon and the movie went flaccid. From about halfway and on to the end, the movie just made absolutely no sense, and I had given up trying to figure out what was really going on. The entire storyline was just a random scramble of incoherent scenes actually.The acting in Death of Me was fair, and both Maggie Q and Luke Hemsworth were actually carrying the movie well enough. Just a shame that they were severely hindered by what can only be described as an utterly rubbish storyline.As the movie ended, I sat even more dumbfounded than I did throughout the course of the movie. There simply was no foreclosure or satisfying end to the storyline - or what was supposed to be a storyline.I managed to endure through this heap of rubbish. And believe you me when I say that you had best spend your time, money and effort elsewhere, because Death of Me is just not worth it.Actually, the cause of death of Christine might just prove to be utter boredom.My rating of Death of Me lands on a generous three out of ten stars, solely because of the production value, the editing and the scenic visuals the movie offered."}], "reviews_amount": 69}