{"name": "London Fields", "titleId": "tt01273221", "reviews": [{"id": 0, "text": "This is not in any way a cult classic. It's just a terrible movie. Amber Heard is hot in this. Billy Bob Thornton is ok in it. (He kind of phones it in.) Johnny Depp has more screentime than Theo James, but is uncredited somehow. Too much of the movie is taken up by a darts throwing yellow-toothed Jim Sturgess who plays it far too unsavory to be believable. And the film is made up of these horrible Thornton voiceovers and... you know what? You are probably going to watch because of the hot girl. But trust me, just put on Showgirls, it's a better movie."}, {"id": 1, "text": "The ingredients: (1) A very bored chain smoking Billy Bob Thornton without yellow fingers. (2) The femme fatale who is consumed by all things sexual like a female cat on heat. She doesn't work, prepare food or go shopping but instead prances around all day in her underwear in her flat in case male visitors arrive. She has also been living in the neighbourhood for a year but the boys never noticed before. How come? (3) The posh gentlemen who prefers to hang around in sleazy underground bars all by himself where he has no friends and doesn't fit in. (4) The dart player scumbag who squints his eyes and pulls faces every time he speaks as if someone emptied a bottle of lemon juice in his eyes. (5) The kid in a dinosaur suit who behaves like a total gremlin and has to be stopped physically or he will eat the furniture. Where can it go to from here? Only downwards, and we didn't even get to see her boobs."}, {"id": 2, "text": "I'm going to be brief: Jim Sturgess overacts so much it's embarrassing, my neighbours three dogs bark from the minute they leave to when they get back, Jim is way more irritating than them. It's like amateur dramatics night.Give this one a wide berth."}, {"id": 3, "text": "This movie is a real stinker and that's the best thing I can say about it. If Jim Stugess' does not win an award for most dreadful, horrible performance in a movie for London Fields, there is no God."}, {"id": 4, "text": "She just bad, idk kinda bringing down the entire movie"}, {"id": 5, "text": "This movie made no sense. Transitions were non existent, the character development was poor except for the main character who only seemed to make her appearance known by sleeping with all the male actors for no apparent reason. This was waste of money."}, {"id": 6, "text": "This film tells the story of a writer who gets inspired by her neighbour of his flat swap.Seriously, this film is so sexually charged that it gets me uncomfortable. It basically is the vehicle to objectify Amber Heard, thereby fulfilling someone's perverted sexual fantasy. It tries a bit of noir, but it does not succeed. Instead, it is less than engaging and does not offer suspense or mystery as intended."}, {"id": 7, "text": "I managed about 10 minutes and I'm wondering if there is a worse actor in the industry than Jim Sturgess. How does he continue to get work? Not even lovely Theo James can persuade me to carry on!"}, {"id": 8, "text": "I've sat through all kinds of awful movies to their end because something or someone kept me interested. Some movies are so bad they're fun to watch. Some really bad movies I've given 30 to 40 minutes hoping they might get better but eventually I realized it was pointless and gave up. I made it through only 10 minutes and 41 seconds of London Fields before I said to myself, this is awful and turned it off. I have no idea what the director was going for with the over the top acting, the close-ups, the stupidly of it, but if you're annoyed 10 minutes in, why bother ? Why is Amber Heard the star of anything (well we all know and it's not her acting talent) ? BTW, I was watching the directors cut which many fake reviews here tout as better then the theatrical version. If you worship Amber Heard this is your movie."}, {"id": 9, "text": "I saw London Fields, starring Amber Heard-Justice League, Machete Kills; Billy Bob Thornton-The Bad Santa movies, On Deadly Ground; Jim Sturgess-Geostorm, Across the Universe and Theo James-The Underworld movies, Golden Boy_tv. This is a messed up, weird movie. And I like different types of movies, but this one is just strange. First off, it is about 3 years old-made in 2015-and I know this because of 2 things. First, I read the end credits and it had the date. Second, Amber's ex-boyfriend Johnny Depp makes a cameo and their scenes together are anything but antagonistic towards each other-in case you may be unfamiliar with their real life situation, they had a real bad messy break up. There are other cameos-Jaimie Alexander &amp; Jason Isaacs just to name two-that are short and have no real reason for them doing them in the first place. Anyway, the plot goes something like this: Amber plays a woman living in England and she is clairvoyant. She sees her own murder but she's not a very good clairvoyant because she can only narrow her killer down to 3 men that she meets in a bar. Billy Bob, Jim and Theo. So her plan, you might ask? She decides to have an affair with each one. Billy Bob is a writer, Theo is a businessman and Jim is a darts player. A lot of things in the movie just don't make sense-maybe it was edited a lot in the last 3 years. Oh, and the movie title, London Fields, is the name of the book that Billy Bob is writing but I don't remember seeing any fields-the book is about Amber. It's rated R for violence, drug use, language and sexual content-including nudity-and has a running time of 1 hour &amp; 58 minutes. I would not buy this on DVD. I wouldn't rent it, either. If you really want to see this movie, I would wait until it comes to cable tv."}, {"id": 10, "text": "Terrible acting from Amber. She is cringyly bad, liar and husband beater. No to domestic violence."}, {"id": 11, "text": "Justice For Johnny Depp, This woman should loose her career instead of Depp BOYCOT AMBER HEARD"}, {"id": 12, "text": "The domestic abuser and liar is in this movie. I recommend not watching any of her work to prevent bad role models in the world."}, {"id": 13, "text": "It is so bad, so disastrous! Amber Heard is no movie star, she can't act, she is just talentless!"}, {"id": 14, "text": "How this movie ever got made is beyond me. Absolutely terrible. Amber Heard couldn't act to save her life and had me cringing throughout. The storytelling is also Labourious. Best part of this movie is the whole ten seconds Johnny Depp has a scene and even he can't save this horror."}, {"id": 15, "text": "Awful acting from Heard. The premise is OK but the role should have gone to someone who can act rather that just look pretty."}, {"id": 16, "text": "Quite frankly one of the worst movies I have ever seen, the fact that people actually took the time to make this is a disgrace to film history. To think Amber Heard was married to Johnny Depp for over a year and yet her acting somehow got worse, I guess abusers age differently."}, {"id": 17, "text": "I couldn't even finish this it was so bad. Please don't waste your time."}, {"id": 18, "text": "Worse actress ever amber heard is so wouldn't want anyone to suffer"}, {"id": 19, "text": "An extremely bizarre, dark, and nonsensical noir. Unless you are fixated to see the sultry and erotic Amber Heard vamping it up or an unrecognizable Jim Sturgess in a completely over-the-top portrayal I can see no reason to view this flick. Is it any wonder Johnny Depp, in a peripheral role, wanted to remain uncredited? I would say stay as far away as humanly possible and avoid this disaster of a movie."}, {"id": 20, "text": "She has had a bad wrap online once the world found out she is a horrible abusive person off camera. It´s not right but that kinda does affect the way she comes accross on camera now... So just because of that reason, imma have to give this movie 1star. If minus stars were possible i would give -10 for featuring an abuser."}, {"id": 21, "text": "Very bad performance from Amber Heard, she seems to have no natural talent."}, {"id": 22, "text": "Not OK. Terrible cast. Will not watch because of her. Bad choice"}, {"id": 23, "text": "There are bad films, and there are pretentious films. This one does not belong to the former category."}, {"id": 24, "text": "If you want the real outcome of the movie, check out the box office. High budget, low ROI."}, {"id": 25, "text": "Amber Heard is no movie star. She will never be a good actress and her best movie was Zombieland which she has less screen time in then it takes most of us to go to the bathroom. This movie's plot made no coherent direction from one scene to the next. There are certainly worse ways you can spend 120 minutes of your life but that list is as short as a baby's arm. Do not waste your time on this unfathomable and unforgettable film. I've seen better acting in my 8 year old son's school play. If your a fan of Amber Heard than make sure you have a subscription to the Limetime movie channel."}, {"id": 26, "text": "Don't waste your time ,it's not worth it, so boring, don't"}, {"id": 27, "text": "Don't know the movie but just want to say: Justice for Johnny #9gag"}, {"id": 28, "text": "This has got to be the dumbest movie I've ever watched. And I've never seen anyone overact more than Jim Sturgess has in their movie. Absolutely ridiculous. Even the rest of the cast couldn't pick this disaster up off the floor. Nothing makes sense, transitions are messy, acting is shocking, storyline is ridiculous. No redeeming qualities at all."}, {"id": 29, "text": "Whatever or whoever gave Amber Heard the idea that she can act must have been up to something. Seriously. Even Aquaman would have been ruined if not for the strength of the script and remainder of the cast. This film did not have that and she lit the fire to this hot mess. Even her physical appeal is eroding as she ages. Sad..."}, {"id": 30, "text": "This has got to be one of the worst movies I've ever seen. Amber Heard totally sucked in this move. Not sure why they even made the movie. I give it a Big Zero on the watch list"}, {"id": 31, "text": "The nicola actress is awful. Difficult to watch because of her terrible acting"}, {"id": 32, "text": "I only watched this movie because my all time favourite actor Johnny Depp is in it and while his very small part was very well acted the rest of the film was awful the lead actress was wooden and unbelievable the story was weird I didn't like it at all"}, {"id": 33, "text": "A pathetic attempt of a deep, interesting and artsy movie. Just awful, and I usually find some good things in bad movies. Do yourself a big favour and avoid this utter failure."}, {"id": 34, "text": "Apparently the lead actress was a looker ten years ago and this made up for a complete absence of acting talent. she is not a looker unless one means her own blank stare, and she just destroys the film with unbelievably bad acting.FYI for the one person who posted four reviews under different names saying get the directors cut -- all of us giving this one or two stars did see the directors cut. It IS the directors cut streaming. It is just as bad only more nonsense. More garbage does not make the garbage better."}, {"id": 35, "text": "Hands down, this HAS to be one of the WORST movies ever made.It's a mess.Not a film noir. It's a film No"}, {"id": 36, "text": "If so Amber Heard wins. I mean really I agree with the concencus here, she destroyed one of the best characters ever written. How did she make Nicalo six one of the most seductive femme fatals ever written in a novel so vaccuous?"}, {"id": 37, "text": "This move is proof that Amber Heard is a terrible actor besides being an alleged abuser."}, {"id": 38, "text": "I have seen a few turkeys in my time but this one has to be a 100 pound turkey without the trimmings. This is the first time I have seen Amber Heard in a film and I can truly say it it will be the last, maybe it is because she is in the news that made me choose it, whatever! Sadly she is as wooden as a lumber yard and just added to an awful picture.I have to confess that I didn't last the duration, water torture would have been a better choice. Bad script, bad acting, bad directing and worse still a waste of valuable time.I don't want to waste any more time on it, it doesn't deserve my time."}, {"id": 39, "text": "Bad story , I'm surprise to see 2 great actors in such a bad movie ! The girl may be pretty but damn she is a horrible actress !"}, {"id": 40, "text": "I think about what I watched but I can't understand the movie even one minute of it. Don't waste your time plz."}, {"id": 41, "text": "I was forced to rate this movie a 1 star because unfortunately there is no such thing as a 0 rating"}, {"id": 42, "text": "Spoiler below. Do not read ahead if you want to see the film.Sam dispatched Nicola. The end"}, {"id": 43, "text": "Don't waste your time watching this. Worst movie i ever saw."}, {"id": 44, "text": "Absolutely awful I honestly have no words on how bad this movie is. That lead actress Alison heard is so unbelievable as an actress sorry but it's definitely no from me"}, {"id": 45, "text": "Stylish with some surreal touches, but lost all the complexities of the book. It falls into the: 'so-bad-it's-entertaining' category. A vacuous, one-dimensional performance from Amber Heard adds nothing to an incoherent plot. Jim Sturgess epically over-acts to hilarious levels! What was the director thinking? No wonder Johnny Depp wanted to remain un-credited"}, {"id": 46, "text": "See the Director's cut! I've seen both versions, and the Director's cut is the one that gets this rating. The director's cut is so much more layered and well crafted. The music choices, the color, the differences in how the characters are introduced, and how we are made to care for the characters, and how the story unfolds is just so much better. You can feel the attention, care, and skill involved in the director's version.It was truly interesting to see the difference. The whole experience is just better."}, {"id": 47, "text": "Just a heads up. There's lots of sex in this movie. Including multiple bondage scenes. Amber Heard sodomizes a man with a night stick amongst other things. I don't know who wrote the parents review but it's way off. I also have no idea how it has a mild vote. Wrote this in case IMDB people see this review."}, {"id": 48, "text": "Haven't even watched this movie but wouldn't be surprised if Amber Heard's acting was just as terrible as her acting in other movies :) I don't tend to go down the route of boycotting movies, but this pos needs to be black listed and cast out of the entertainment industry all together. She deserves every bad thing that comes to her, for abusing family members, past relationships, and Johnny Depp, and watching her fail in life will be the only enjoyment I get out of her existence"}, {"id": 49, "text": "Hey guys, London Fields made me and my boyfriend laugh the entire time. i knew it was serious but he was convinced it was satirical and filled with exaggerated cliches. every time something cheesy happened we burst out in laughter. if you take this movie seriously it sucks terribly but if you pretend the whole thing is a joke it gets 10 stars!!! highly recommend being high when watching it"}, {"id": 50, "text": "London Fields was never meant to compete with your usual blockbuster chick-flick kind of movie. Its got a category of it's own. It's like a good wine - it's meant to taste better with time. It's meant to be a catalist for s specific taste. A good painting appreciated more after people learn to understand it. Amber Heard is a unique beauty and a talented actress - She was perfectly cast for the role."}, {"id": 51, "text": "The only point in film is Amber Heard is in lingerie. Who cares about it can save time and search for those parts on the internet."}, {"id": 52, "text": "Love the atmosphere of this movie. Great cast. Dark but funny details here and there. One to be among the cult classics."}, {"id": 53, "text": "While this is not an Oscar-worthy film, it really is INCREDIBLY fun and entertaining to watch. I went to see it expecting to have a good time, and thats what I received. Its a fun film that I would highly recommend to anyone who wants to see a sexy, film-noir classic. Don't listen to the negative reviews, this movie is really enjoyable and I will be seeing it again, and probably buying it when it comes out.This is a film that is absolutely stunning visually. I don't believe it should be getting all these bad reviews, I thought it was amazing! As did everyone else in my theatre. The social media reviews are off the charts and on Rotten Tomatoes it's going to go over 90%. Also there are some really good plot twists that will catch you by surprise. The writing, acting, and editing were all great. Overall its a really cool movie that will put you in a good mood. One of my top Must-Sees for 2018."}, {"id": 54, "text": "1/10 - absolutely terrible - for some reason I didn't believe all the horrid reviews, but they were speaking the absolute truth"}, {"id": 55, "text": "This is how a movie ust not be made, makes no sense. has no heart forget about the place of it."}, {"id": 56, "text": "#JusticeForJohnnyDepp #JusticeForJohnnyDepp #JusticeForJohnnyDepp #JusticeForJohnnyDeppAmber Heard is an abuser."}, {"id": 57, "text": "Such a weird film.It says my review is too short - so. It's really such a weird film."}, {"id": 58, "text": "The movie hardly understood and i was bored, i was not interested in anything. There was a different universe and environment. I did not understand when the movie was set. There was a different world and I couldn't understand that world.It sounds like watched for the cast but I don't think it's worth your time, it was bad or even awful"}, {"id": 59, "text": "Amber Heard is talented , great cast, solid directing and decent writing. Long run time and a lot of dialogue but such interesting characters and Billy Bob is great."}, {"id": 60, "text": "I am right in saying Johnny Depp was in the film but was not credted? Perhaps he had the good sense to disown it as was the disjointed garbage. Lured by Amber Heard and Billy Bob Thornton I wasted almost another 2 hours of my life trying to make sense of this."}, {"id": 61, "text": "Don't listen to the critics - they are hysterical and frothing at the mouth about a film that relishes in unabashed fun."}, {"id": 62, "text": "Only just becoming aware of who AH is, I decided to research the court case and her movies. I know who Johnny is, who doesn't? This was the first movie I chose to start my research. I have not viewed any others. She is an extremely flat actor. She raised no interest from me at all. Which in turn ruins the whole story. Read the book, the way the character is supposed to be portrayed is vital to the whole movie. I will not be watching anything with this actor in it. Def not Mr Kings new adaptation. She has ruined enough for me. #justiceforjohnnydepp"}, {"id": 63, "text": "Amber heard looks very stunning and gorgeous. Her beautiful looks surely deserve no less than a 10 rating"}, {"id": 64, "text": "She looks completely flawless and stunning. Definitely a 10 for her gorgeousness"}, {"id": 65, "text": "I must have watched the Director's Cut because I thought this was great. I was surprised when I came here and saw so many negatives."}, {"id": 66, "text": "I felt every moment, every phrase, every scene, every character is me. Thank you for all involved in this movie."}, {"id": 67, "text": "It's so strange to watch a film that is so strict on the persona of its chrachters that it out right shows you the cliché of all of it and nevertheless, is able to capture the beauty of the whole play. a woman caught between God and the Devil, or two men as the quote goes; being the manifestation of love (or anything that's dark and mysterious, precious and rare yet so easily obtainable on the surface) Nicola isn't passive in her expressions and contribution to the fixed destiny of the play in which love, jealousy, greed and curiosity drive the story and their demise. She although knowing the horrible yet yearned ending of her life, intices every character who has got a say in her visions. Being the symbol of the foundation of creation (hinted by her lat name 'Six' and also the short music scene watched on the TV on one of the scenes by Samson Young) she begs, no, demands to not be seen as one-dimensional; and the beauty of all this is that at the end Samson, the writer of all this realizes that it was him whom he feared, it was always him... he had the power of free choice to write his story as how he liked to wait and just watch what would happen to Nicola, but he was the one this all has been about. the scene showing the golden mask in the hands of Samson to me illudes to the fact that we as humans tend to not only show a not so real portion of our character to the outside world as a mask, but by doing so, we are faced with a mask staring back at us... in other words.. we are the characters we think about or in this case, we write about; there's a little bit of truth in every character we imagine. not for the mainstream inpatient viewer of today i guess, but for the analytical mind that can see behind the symbolism and is able to grasp the point of the personages.. a great great piece of art."}, {"id": 68, "text": "The plus sides of this movie is the excellent acting of Jim Sturgees, hands down, I admired him as the cocky, over the top, obnoxious Keith, and Theo James has shined here as well, I do agree on a lot of the reviews that Amber Heard is just a pretty face, as for the story, It's really not that concise as to the transition of events, but overall, it's not really that bad as some claim it to be, I know I have seen worse...I gave it a 5 but Jim Sturgees and Theo James made it a 7/10 for me, and I do not like Billy Bob Thornton and oh, Johnny Depp is also here too..."}, {"id": 69, "text": "As i am a avid webseries and movie watcher i can say this movie has quite slow direction. I literally fall in love with Amber Heard's acting but movie was way too slow and predictable also. Makers should have added some events that could spiced up the movie. Keith's been loser in the movie until end and then something unexpected happen that proved why he's been loser. I don't think i have invested my time at good movie. Thank you for reading this. Hope you have a great day."}, {"id": 70, "text": "Im always up for anything she's in. this girl has style, talent looks and she keeps getting better and better"}, {"id": 71, "text": "Waste your time ,it's worth it, so sad. just do it"}, {"id": 72, "text": "It is just a lost of time.....almost execrable movie"}, {"id": 73, "text": "This movie is done injustice with how it was released. The director's cut is the only version that should be watched. It's a shame it has received such negative reviews but it's their own fault with how they marketed the different versions. I really do love how this movie was put together."}, {"id": 74, "text": "The writing is awful, but I liked the actors and was hoping for more. Sadly more never made an appearance."}, {"id": 75, "text": "Theo James is absolutely the best actor I've ever seen in my life: serious, brave, and, above all, intelligent. Congratulations from me that I am an actor and also a your admirer!"}, {"id": 76, "text": "Well After viewing all the comments that says that the movie is terrible, I could say that watching it in a foreign language may have helped alot. I saw it in Spanish and the acting wasnt that terribleI am Fan of the Femme Fatale topic and this movie presents it very well. We have the typical archetypes of Pierrot, Harlequin and Columbine or in other words a great drama going on between a psychopath writer addicted to drugs and a hysterical woman that controls, manipulates and castrate all the men in the scene, one of them is an obsessive compulsive family guy trying to give all he has to get the girl and the other one is a perverse guy that only takes what he wants and leaves. Based in the 1950-60 the movie has a great photography direction and the plot, despite is very obvious, it's captivating."}, {"id": 77, "text": "A movie that want to show a deep mininig but it cant a bad combination of mother and the seventh seal It contin some good secne but its realy far from a good movie"}, {"id": 78, "text": "It's a brilliant book and this makes a fair effort at filming it. Very good cast. Some bits are changed for no apparent reason (the car, the relative location of Sam and Nicola's flats, her age) but they don't detract too much. Some of the plot twist and the redemptive quality of the book lose their impact here but a film of a book is never going to be great.I can see how it would be a very difficult film to watch if the viewer wasn't already familiar with the story."}, {"id": 79, "text": "London Fields has to be the best docu-drama I've ever seen on London's underground darts scene. I only hope they make a sequel with more of the wonderful Keith Talent. A more attractive and appealing man has never stood behind an oche.On the downside, Johnny Depp's uncredited cameo as Jim Bowen is underwhelming."}, {"id": 80, "text": "I don't know what others were confused by. Perhaps too much one dimensional Hollywood obvious movies. At any rate I liked this movie a lot. Reminded me of Hal Hartley movies and it was a welcomed relief from all the main steam only to make bucks movies..."}, {"id": 81, "text": "L really like mystery thriller movies, especially the ones that build around a sexy female character. Amber Heard acted really good on this film, l can say she justified Nicola Six as a character. Go and see it if you like this kind of films."}, {"id": 82, "text": "Story plot is good, but screen play missed the shot. A woman, who has power to see the future knows that she will be killed by a lover among three of them. Though story seems interesting its presentation is very poor and average and loose its thrill. Lot of parts focusing only on Ambar Herd's beauty and her lusty woman role. A couple of sex scenes will raise your heart beat definitely. Stunning beauty of Ambar is appreciable. She is perfect in her role. In other word she is only watchable part of the movie, other wise movie would be garbage. You can only watch this movie if you are fan of Ambar Heard either or wants to smell her charming beauty. She is just gorgeous."}, {"id": 83, "text": "Looks like a film made for Amber. Many sequences were purposedly erotic. But then, many others were purposedly funny. This film is like an inside joke. Watchable."}, {"id": 84, "text": "This movie is good, just because she is in there. Beautiful lady! Teo James is good too. Not enough? I am sure there is plenty actors of anybody's taste. The script is weak, but again I am just enjoying sexy Amber. How does a woman have unrealistic beauty?"}, {"id": 85, "text": "London Fields is her showcase film playing a femme fatale seducing unsavory types and modeling lingerie. If you edited this right it could be a Playboy Lingerie video - remember those?! I could follow the story for the most part but by the end was left scratching my head as to why her death occurred, just didn't seem well motivated at all. Was interesting to see her interplay with Depp's character since they'd go on to be an item then married IRL. I rate it a five because though it makes little to no sense in the end, many of the individual, component scenes are well crafted and executed well, especially those with Amber in them."}, {"id": 86, "text": "The problem is not in the script, but in the performance of some cast members and in the assembly / editing of the final product. I don't know what the director's version will be like (from what I read is superior), but this one is difficult to find anyway. On the other hand, Amber Heard really looked amazing as femme fatale. Her performance did hit the spot, however, the male actors were not up to it by any means (their acting was too forced and uncomfortable). That is why I say, the problem is not in the script or in the plot of the story, but in the disorder resulting from the edition and a cast that - except for Amber Heard - has no idea what they're doing. It is a real shame because it could have worked very well as a film noir , but ends up staying halfway and generating more confusion than interest."}, {"id": 87, "text": "Buchen Ja! Producer Nien. If U r going 2 c it. Especially after reading the book ... c the director's cut. Better yet read the book &amp; then c the director's cut. So so so gives me hope (that the dream of) more things that were thought un-film-able will eventually be embraced across various forms of media.Have Fun"}, {"id": 88, "text": "One of the worst movie with great actors in it....Amber Heard will never win an Oscar biut she's so sexy!...Jim Sturgess is very bad even if he's great in his others movies...And Billy Bob Thornton too could be better !"}, {"id": 89, "text": "I enjoyed the film version of the novel directed by Cullen. Especially Depp and Jim Sturgess as the lovable, creepy Keith Talent. Author, Martin Amis debuts in a cameo as Julian Neat at the darts tournament. In book, Visiting Martin Amis, the author details his novel London Fields and main characters, Nicola Six, Keith Talent, and Guy Clinch. Coincidentally, Julia Clinch wrote Visiting Martin Amis (Amazon)."}, {"id": 90, "text": "I took the recommendations of one of the other reviewers and used some medical cannabis before watching this unusual movie. This was a black comedy with dystopian hues. A sci-fi parody of the film noir genre. (Boy that sounds pretentious but it's true).I imagined that two Czechoslovakia from the 1"}, {"id": 91, "text": "One of the worst movies I've ever watched. Amber Heard plays a woman who has foreseen her own murder and spends the rest of the film trying to work out who her killer will be, apparently by ... shall we say sleeping with .... with all the possible suspects.I am writing this while half way through it and I already want to kill her myself. She sashays and vamps around valiantly, but cannot pull off the film noir vibe. Heaven only knows what Jim Sturgess thought he was doing. I would like to say he chews up the scenery, but I doubt his crack-head yellowed teeth would be up to the job. Billy Bob Thornton is, well, Billy Bob Thornton, only sleepier than usual. The only high spots are the few appearances by Johnny Depp as a cheerfully villainous Cockney gangster, but he is uncredited in the final product. One can only presume he did not want to be associated with this abomination.Pretentious, badly acted, boring tosh. Total waste of a good book and almost two hours of my life!Awful. Absolutely awful."}, {"id": 92, "text": "Two versions of London Fields are currently playing in theatres. The film most theatres are showing is the producer's cut, but select theatres are showing the director's cut instead.It's amazing how two different edits of the same film can make such different movies. Yesterday I saw the producer's cut of London Fields and today I saw the director's cut, and wow THE DIRECTOR'S CUT IS SO MUCH BETTER! Why isn't this one the main cut? Here the bad CGI'ed skies are substituted for tension, mystery, emotion, and a plot that's easier (plus more interesting) to follow; as well as a whole new score and different takes that bring out better performances from the actors. Every emotional beat is so much more powerful, which makes the mystery of who will kill Nicola Six that much more suspenseful and engaging.THIS is the version of the film that should be playing everywhere. The producer's cut honestly shouldn't even exist; it just doesn't add anything to the film. It's no wonder the director sued the producers over this. According to him the main cut released is a cut he hasn't been involved in for over four years.If you had any intrest in seeing London Fields I would 100% recommend seeing the director's cut, and if you liked the producer's cut then you'll love this one even more! It's still not a perfect film, but THIS one is more entertaining, engaging, suspensful, and overall just a better film. I really hope both cuts are released on the DVD to compare them even better; I find the whole thing so interesting."}, {"id": 93, "text": "Struggling writer Samson Young (Billy Bob Thornton), sleazy darts player Keith Talent (Jim Sturgess), and well dressed man Guy Clinch (Theo James) are in a dive bar when Nicola Six (Amber Heard) walks in dressed in sexy mourning. The clairvoyant femme fatale can see the deaths of people. In that moment, she realizes that she has seen her eventual murderer. She lives above Samson and is a character in the story he's writing.It's a disjointed mess. I like a few of the surreal touches but dislike a whole lot more other ones. The Enola Gay makes Guy look stupid or is the writing stupid? Or is the writer's expectations of the audience is too low? At least, the story could be about Bockscar and Fat Man. It just makes the movie stupid overall. Next, Samson Young is an unreliable narrator. He's a sleepy unreliable creator. It makes everything in the movie unreliable. In addition, Amber Heard is nothing but sex. She's an empty character. There is no motivation. She is a figment of Samson's imagination. She is a surreal fake creation of the male libido. She's a sex robot bending to each male's fantasy. Finally, there is Jim Sturgess contorting his face unnaturally beyond camp. It's completely ridiculous. With the darts playing, it reminds me of The Big Lebowski but in a bad way. There is no loveable character. There is no fun. There is no enjoyable quirkiness. This is a mess waiting for the reveal which I don't care about with characters that are not compelling."}, {"id": 94, "text": "Oh wow! I just saw this in theaters and your telling me it's been out since 2015? I guess that's the biz of showbiz, this movie is bizarre enough for me to believe that they could not find anyone who wanted to distribute it.This also explains why Amber Heard and Johnny Depp are in the same movie. In 2015 I think the two were still together. They did not share any scenes in the movie (Maybe they had to reedited so that was the case explaining the long delay of release).London Fields love itself far too much that it's not listening to anyone telling it how dull this is. I will say this, I did not see the ending coming of this mystery because of the oddness of the film, which I can totally respect.Billy Bob Thornton plays a washed up writer from Hell's kitchen who switches homes with a hot shot writer from London in hopes he can write his next book and he gets and idea when he discovers his next store neighbor, Amber Herd has predicted that someone will kill her and has agreed to let the writer observe to see how it will lay out.The film looks beautiful and gets you in the mood of the Murder Mystery. I found it interesting that I could not tell what time period the movie falls under. I think it's a near future, that has better cell phones then we do now, but I'm not sure. Amber Heard does help in the beauty of this film as it's definitely her purpose in the film to play that classic Femme Fatale.I like Billy Bob Thornton and he was interesting enough, although his narration of the film did not get me into the story. This is true of most of the male cast members including Depp who quirky behavior was just corny. I say don't see it."}, {"id": 95, "text": "I'm not going to write much in the defence of London Fields (even though I gave it a 6/10, you'll understand why in the next paragraph) but when I review bad movies, I always start with the positives. I was intrigued by London Fields for around the first 10 minutes. The dialogue by our narrator Samson Young (Billy Bob Thorton) is heavy handed but they know how to setup a mystery. Its obvious that the story will have a different kind of slant to it (both by the beginning flash-forward and the bizarre notes about the current global climate within the story) and it caught my attention. The movie very quickly went off the rails with the introduction of Keith Talent (Jim Sturgess) and Guy Clinch (Theo James) but I have to admit, I was interested for a short period of time. The other note I'll make is that Amber Heard was appropriately cast as Nicola Six and she was trying so hard in this. She couldn't save this train wreck of a movie and I felt bad for her because of how desperate the team behind the camera are to remind you of how hot she is in every single moment she is on screen (I appreciated how beautiful she is but a lot of her steamy scenes border on porn and I doubt she consented to that). I wouldn't define this as an award-worthy performance but when the rest of the cast is so out of whack, she's at least playing in the appropriate area and she fits the part.Some movies are made for the uninitiated and some are made for the fans. The plot in London Fields must require you to be familiar with the source material because it is so scatterbrained, I don't know if I could have wrapped my mind around it with a second viewing. London is in crisis, people have fled the city, are we offered a detailed explanation why? Nope, just go along with it. Our narrator Samson (a terminally ill writer) is dying of an unspecified illness but he's resigned and almost nonchalant about it. Why is he dying? Why is he okay with it? Never mind that. Why is he interacting with all the fictional characters in his new book? Why is he seen by some and ignored by others? How is Nicola able to see the future? If she's aware of what will happen, why doesn't she try to protect herself? There were answers offered to some of these questions but none were satisfying or made much sense. Compounding on this is the ridiculous dialogue which is okay at best and at worst just awful. I got plenty of laughs from this movie but I don't think any of them were on purpose.The supporting cast is either at one end of the spectrum or the other. They're either underplaying it so badly that you can imagine them asking for their lines after every take or they're chewing the scenery with such an over-the-top bravado that it left me howling. On the under-performing side, we have Billy Bob Thorton, Theo James, Jaimie Alexander and Cara Delevigne (who is only in the movie for about 5-10 minutes). Thorton is a good actor when he's committed and while I'm almost certain he was directed to be this way, boredom radiates off his performance. He's sleepwalking through this and I don't think there was much he could do. Theo isn't a terrible actor but he's normally a little bland and this is definitely more of that. On the other side, we have Jim Sturgess, Jason Isaacs and Johnny Depp who are all swinging for the fences. Sturgess is overdoing his character in an epic sense here, I was laughing at him every time he was on screen. Between how ridiculously sleazy his character looks to his mind-blowing delivery, he was hitting Sean Penn from Gangster Squad levels in scenery chewing. We also have Depp in a pretty small role, he's at least fun in his small bits but its a lot like his shtick in Mortdecai where its too cartoony to even be in the same ballpark as reality. We also have Isaacs in voice over, he's so sly and scummy in this that his voice is the embodiment of the cat who ate the canary. There's only 1 other movie that I can think of that features such a wide range of laughable stuff from the cast (I'll be talking about it in the closing paragraph to this review).I started out laughing, then I slipped into being dumbfounded and by the end, I was a mix of being in awe and snickering under my breath. The twists and character motivations in this movie are so hard to determine even though if you diagrammed the plot, it would be so simple. Through the perspective of Samson, there was a lot of potential to really play with the style the movie was being filmed with (e.g. the movie Limitless where we see the effects of the drug) with Samson drifting in an out of sanity or the real world. But while the movie isn't without any style, there's very little here that's going to be memorable or that's going to catch your eye. I know the budget was modest but if you don't have the material to carry the movie, do something else that's going to elevate it.The behind-the-scenes notes about London Fields paint an accurate picture of how much of a misfire this is. But I couldn't turn away from the screen or even stop giggling at the gigantic mess London Fields is. I think this would make a great so-bonkers-its-good double feature with the 2018 release Terminal. Both feature a stylized attempt at noir with some Guy Ritchie style sprinkled in and they both miss the boat completely. Both feature a gorgeous and talented lead actress who are trying their best but the movie drags them down like anchor tied around their ankles. Both feature a supporting cast that is so all-over-the-place that you can't pin them down as disinterested or way too committed. Lastly, they also both have an ending twist that attempts to shock the viewer and doesn't quite get there (admittedly though Terminal wins this category hands down). Terminal is the better movie but London Heights made me laugh more. I'm sorry that Heard and Depp were fighting constantly while this was going on but London Fields falls into the so-bad-its-entertaining category for me. If I were a real critic and I had to grade this seriously, this is a 3/10 but I'm bumping it up to a 6/10 for the entertainment value I got out of it."}, {"id": 96, "text": "Make sure you see the Director's Cut!!! It seems there is only one imdb page for these two, WILDLY DIFFERENT, movies. At least for now.I don't know how an adaptation of this story could have been done better. Somehow an American director managed to portray London in a very specific era through this unusual, slightly weird but so captivating story, perfectly. The Director's cut is sexy, thought-provoking, surprising, beautifully filmed and full of moments that will pop up in your head in the best way for the next few days. I don't think Amber Heard has ever been captured this beautifully, and this will probably be her best movie, ever. The rest of the cast, especially BBT and Theo James, is great too.Location, details, choices of images and where to push makes this more than a movie, it's an excellent piece of art for this time. Finally, the MUSIC is unbelievable. I must get my hands on this album! So beautiful. And if I understand everything correctly, the music (or most of it?) is exclusive to the Director's cut! That's incredible!!!!"}, {"id": 97, "text": "I can't remember the last time I saw a film this disproportionate in terms of the quality of the cast and the poor quality of the film. Make no mistake, 'London Fields' has an amazing cast. Sure Amber Heard in the lead role isn't much of an actress (although she somehow manages to maintain a fair bit of star-power) but outside of her there are great actors everywhere. Even Johnny Depp has a decent amount of screen time. Sadly though these actors aren't even close to being able to save what is one of the worst films I've ever seen.The film tries to be a mystery but there are a few problems with that. One is that we the audience simply don't care by the time the conclusion finally rolls around. We have been bored out of our mind for 90 minutes and we simply want the film to end. Secondly, all the characters are basically the exact same person. Which character did the deed makes absolutely no difference to us in any way. Whether is it a, b, c or d through z doesn't alter the film in our eyes one bit.Then the film tries to impress us with its arty narration. It is trying so hard to be 'Fight Club' by having memorable quotes left, right and centre, but I can assure you none of them land. Instead the narration is just annoying and weird. The film has some of the most bizarrely shot darts scenes as well. We are never told what is actually happening and apparently professional darts players are capable of missing the board entirely? Who knew? 'London Fields' needs to be avoided at all costs. It is an abomination."}, {"id": 98, "text": "I'm not sure if Jim Sturgess was encouraged to play the insanely over the top cockney geezer, or it's simply how he did itI give it three stars, simply because the opening was brilliant, two minutes of stylish, elegant, engaging cinematography, those sequences were the best part of the film. Some scenes looked nice. However...As soon as Keith arrives, the film becomes unwatchable. The plot vanishes, the story telling is nothing short of a fiasco, it really does become a self absorbed mess, I applaud you if you see it all the way through.Theo James by contrast is very good, he's a fine actor, but the damage had been done beyond belief by the time he arrives.Didn't enjoy it, 3/10."}, {"id": 99, "text": "This movie is so bizarrely constructed and the editing is so bad, one can easily call it The Snowman of 2018.While that failed venture was your standard police procedural made into a woeful example of outsider art through bad luck, this film aims for some near incomprehensible labyrinthine parody of every postmodern thriller made since Pulp Fiction or The Usual Suspects.The closest that can be described to being a serviceable plot is that a slinky sexy woman named Nicola Six (no seriously that's her name) is blorn with the uncanny gift of premonition. And she guesses her murderer upon entering a sleazy London pub and being courted by a series of strange or suspicious characters. In between that, there is a lot of overwrought narration by a bored Billy Bob Thornton; a darts competition; and panoramic shots of what seem to be the Apocalypse.If it had an inkling of self-awareness, it may be a spectacular example of stealth trolling pretentious film snobs and industry insiders everywhere. But given that this film stars Amber Heard (the poor man's Nicole Kidman) and rejected leading men like Jim Sturgess and Theo James, that seems unlikely.Amber Heard is a beautiful sexy looking woman. But she does not yet have the screen presence to convey the aura of mystery or raw sensuality that seasoned pros like Sharon Stone or Angelina Jolie or Diane Lane could have done in their sleep. Theo James is slumming in a post-Divergent paycheck role that leaves nothing worth remembering. The worst offender of the main cast is Jim Sturgess as a gross looking barfly with a preposterous cockney accent and rotting teeth. This guy's performance is so ridiculously over the top that Nicolas Cage would be chastising Sturgess to tone it down.The sole bright spot among the main cast is surprisingly enough the most controversial, Johnny Depp. No, seriously, Johnny Depp is in this movie and he's actually pretty good. It also helps that Amber Heard gets naked alot in this so at least there's that.But unless you fancy yourself as one of those pretentious hipster schlock enthusiasts (such as myself ;).) I cannot recommend viewers to seriously consider watching this."}, {"id": 100, "text": "I wonder if any of these reviewers have read the novel by English writer Martin Amis on which this film is based. Amis is an intelligent, witty, original writer, and a perceptive commentator on the absurdity of our post-modern world. This film does an excellent job of capturing the complexities of a book that is deliberately enigmatic and ambiguous.How does Nicola Six know that she will be murdered by one of the men in the pub? How can a girl like her possibly be sexually interested in a low-life like Keith? Is it because she deliberately set out to drive those men to kill her? Then again, is a woman actually murdered in real life? Or does the whole thing just take place in a novel? And if so, who is the novelist?Read the book and watch the film - or watch the film then read the book. Or just watch the film with an open mind, without expecting your standard cinema fare of good guys/girls vs bad guys/girls, requiring no intellectual input from the viewer.No spoilers here. The whole point of the film is to get you guessing - and you'll still be doing that after the final credits."}, {"id": 101, "text": "Up until a few weeks ago, I had no idea about Mathew Cullen's new film, the much discussed, often maligned, and barely-given-a-chance London Fields. I had no clue about the behind the scenes issues (Cullen battled the producers over his final vision with a compromised cut recently getting released in theaters on a semi-wide platform), and regardless of those various problems that the creative parties had with each other while making and finishing the project, I don't care about any of that stuff - I care about the movie in question. So when the opportunity presented itself to view Cullen's personal director's cut, I jumped at the chance. Cullen, founder of the visual effects company Mirada, has a background in commercials and music videos, and got his chance to play with a massive piece of storytelling for his feature debut, and I'll be curious to see what he does next, especially if he gets the chance to make a film and not become entangled in production nightmares.So while I can't compare the director's cut to the producer's cut (or the novel which the film is based on), what I can state is that I very much enjoyed watching Cullen's preferred vision of London Fields. It's got a stunning sense of visual craft, with textural compositions that are strikingly bold and frequently eye-blazing, and the film's noir-esque plot of a distressed writer (Billy Bob Thornton) trying to make sense of his reality and the story he's in the midst of writing always remained interesting and unique. It also helps when ultra-eye candy actress Amber Heard is the femme fatale (in more ways than one); ever since Pineapple Express she's remained a most alluring screen presence, and it's clear that Cullen knew what he had on the other end of his viewfinder when he was setting up his mise-en-scene. Throw in a totally bonkers if slightly grating performance by Jim Sturgess and familiar faces like Jason Isaacs, Theo James, Jamie Alexander, Cara Delevinge, and an uncredited (and sorta hilarious) Johnny Depp, and you've got a starry cast that really brought the juice.Given that original novelist Martin Amis co-adapted his own book (with Roberta Hanley), I can't imagine that he'd work to sabotage a filmic version of something he initially created, so I'd have to assume that the busy plot of the film follows the exploits of the book to a certain authentic degree. The dialogue is over the top and purposefully rosy, with the actors clearly having fun delivering their lines. Toydrum's musical score is brazen and fully alive at all times, and the sometimes surreal juxtapositions of archival footage mixed in with glossy cinematic artifice keeps the viewer disoriented and wondering what might happen next. Cinematographer Guillermo Navarro (Desperado, Jackie Brown, Pan's Labyrinth) really earned his paycheck on this movie - every shot is luscious. The film's credits list a staggering number of producers and production companies who were involved in getting this project to the big-screen. For some, London Fields will exist as a cheap and easy punching bag, but for others who can separate business from art, and if you can see Cullen's director's cut, many will find a very entertaining and conceptually wild movie that's just waiting to be discovered and embraced by a cult audience."}, {"id": 102, "text": "Very noir-ish with excellent cast.Billy Bob Thornton is essentialy the same as always, he's awesome playing such characters. Somehow throughout the movie, he kept reminding me of Jeremy Irons' character in Stealing beauty.Amber Heard is seductive and innocent, and on the brink of proving she's a good actress; maybe a proper role will come soon for her.Fantastic performance by Jim Sturgess, he's the king of every episode he's present in - really, really good!Surprised to see Johnny Depp in the same movie as AH, and to the end didn't think I'll see them in the same scene, but - then I read in the comments that the movie was shot years before this year's release, go figure... JD is his usual weird persona that he's so good at playing.Overall, a high quality movie, with style, beautiful shots and artistic note. I had fun watching it, and recommend it7/10"}, {"id": 103, "text": "An American writer arrives in London where he meets Nicola Six, a beautiful woman who soon becomes his muse. She is playing a dangerous game, dating a small-time (married) gangster and a wealthy businessman in an effort to con them both. A clairvoyant, she has premonitions of her own death, at the hands of one of the three men she is involved with.This film had heaps of potential. The plot is initially very intriguing and the atmosphere is dark and stylish, sort of neo noirish. With the style and the English gangster setting it initially feels like a cross between a Guy Ritchie film and a Frank Miller graphic novel.However, the wheels come off after a while. The plot becomes random and unfocussed. The writer and director add layers of complexity that seem just there for complexity sake as they don't add anything to the movie. Jim Sturgess's performance as Keith Talent is painful to watch: massively over-acted and forced.There's enough intrigue to keep you watching but sadly it's all in vain as things don't get much clearer by the end.Ultimately, quite disappointing."}, {"id": 104, "text": "London fields is attractive. It has black in quantums to annoy you but makes you feel sad in parts. Ignoring the need for deep reflection, the movie is fairly up close and far too personal even for a psychedelic fan.Billy Bob Thornton comes back powerfully as he stands aged and numb amongst the crass and plastic growth of an entire new world, changing for him and changing for nothing. And, the narrative is poetic.If we're talking about the safe jibing of all losers of our perpetual society, we're treading into new ground with our blanket of love, sensitivity, borrowed wisdom and social security.Matthew Cullen makes his point by being out rightly judgmental as he interferes strongly towards the final part of the script. Dropping the open ending option and the melodrama, Cullen chooses cold anger to speak loudly about the ways of the lonely."}, {"id": 105, "text": "This film has been on my hit list for ages, considering the cast and the story, i was waiting in anticipation for it to come out in the UK. Alas, it didnt and when i read about what had happened, i realised why.It has been classed as one of the worst films ever made and was hardly seen which when you see the huge cast that's in it, is amazing on its own. So bad was it received &amp; reviewed that Amber Heard won a razzie for worst actress. However, that is the producers cut. However, when i heard that there was a one off screening of the directors cut in London and that Matthew Cullen &amp; Jim Sturgess were going to be there, i had to go.Yes, its based on a Martin Amis story and is probably the only film you will ever see about love, jealousy, murder &amp; darts but Cullen &amp; Sturgess were here on hand to tell the truth about what actually happened.The film ran into huge financial difficulties &amp; the producers decided that they didn't want Cullens original cut but they wanted their own version which went for sensationalism over story, and this is the version that got panned. Most of the actors disowned this version &amp; in the case of Heard, she tried to sue the producers for breach of contract, stating what they had made abused her personally with regard to using body doubles for the extra nudity in this version stating that she did it and this was not what she had signed up for. Apparently this producers cut has images that are offensive to everyone with refs to 9/11 etc. So Cullen financed his own directors cut and im told its completely different from the other version.I can tell you now, that although its not the greatest film ever made, its a really entertaining film. Heard is a great Femme Fatale, oozing sex appeal, Sturgess is very OTT in his role and Johnny Depp has a fun cameo.Dont think I want to see the producers cut as this is all thats available, but if you get the DVD/Blu Ray, the directors cut is on the extras!"}], "reviews_amount": 106}