{"name": "Interreflections", "titleId": "tt01965308", "reviews": [{"id": 0, "text": "Unlike Joseph's Zeitgeist films that I love and viewed dozens of times, I just couldn't get into this. Every scene dragged on longer than need be and I quickly became disinterested. I had 48 hours to view the rental on amazon but only made it halfway through before I gave up on it. Disappointed."}, {"id": 1, "text": "Didn't care about any of the characters. Wall of text in the form of a Drama documentary, target audience of true believers. With no sense of humor, no feeling. I cried in the Zeitgeist movies 1 &amp; 2. This one made me yawn and fast forward."}, {"id": 2, "text": "Humanity, you've been waiting for Interreflections for about 12 thousand years....This film, unlike any other socially conscious film ever made, offers answers to questions you didn't even know you had. And it will take you places you never thought were possible.It truly is a transcendent work of art, social commentary, and vision for a far better world than we have now. HIGHLY recommended!"}, {"id": 3, "text": "This is what the world needs to view. I have watched many a film/documentary &amp; nothing comes closer to the sheer perfection of social commentary that this film exudes. Metaphor after metaphor of pure genius writing."}, {"id": 4, "text": "Fantastic film by one of the revolutionary minds of our time."}, {"id": 5, "text": "Great mix of art and facts in here about the direction the world is going - and that isn't pretty.. We elect presidents and other leaders that are just, more or less, psychopaths and power seeking people! I sometimes think that most people are too blind to understand what is going on around them and in the world (maybe busy working, or they probably don't have enough all-embracing knowledge to understand what is really happening. Sadly). InterReflection gives, at least me, hope that more people will wake up from their wicked/disturbed sense of reality - and maybe, at least maybe start to wonder if we actually could go in the direction of making the world better. Far better! Hm, how many Trumps or Bidens (of any of those fools) will we elect before we finally wake up and realises that this isn't working anymore...InterReflection is very important, and at least for me, a masterpiece!"}, {"id": 6, "text": "I want to congratulate Peter Joseph on this film. He's done a fantastic job balancing heart and intellect. It covered everything that needed to be said in my opinion. So many good scenes I couldn't choose a favourite. Still trying to understand some of the symbolism but thats rather the point with avant garde style. Couple of scenes that jumped out for me were when the main character lost her job and when people were waiting for her to pick up the dollar bill. I suggest everyone sees this. I mean it, stop reading this and go and watch it. I recommend everyone try to share this film with as many people as possible. If he starts another crowd fund campaign for the sequel next year. I will gladly donate more towards it :)"}, {"id": 7, "text": "I'm not a film critic, but Interreflections was exactly the type of media that I wanted to pair with Peter Joseph's book, The New Human Rights Movement. If you are unfamiliar with the research associated with structural approaches to solving social &amp; economic issues, then this movie simply requires an open-mind.This movie is a creative and abstract representation of the train of thought presented by the book. It has powerful imagery and storytelling that allows the audience to connect on various levels throughout the movie.Personally, I enjoyed the quality of cinematography and screenwriting. I felt that the documentary interviews were an especially powerful way to enable us to interreflect on our society as it stands.Also, this movie has The Matrix &amp; Pink Floyd The Wall vibes."}, {"id": 8, "text": "This is self indulgent woo. The green screen cheapness never goes away. I dare say the guy who basically did this on his own, bit-off more than he could chew. Peter should do a little inner reflection himself (see what I did there?).Buying 10/10's is so obvious, why do people keep doing it, does it work? I guess it does, otherwise I wouldn't be telling you this movie blows chunks.Zero redeeming qualities, getting your hemorrhoids removed is more entertaining. No stars."}, {"id": 9, "text": "Its a masterpiece. I agree that the average Joe, wich is not familiar with Peter work, should wach it multiple times to understand it. But its probably the best movie, wich explains our current world (situation). This should be seen by everybody. Its an educational work of art. Hopefully it will open the eyes of the masses. And I also think Jacque Fresco should have been mentioned in the film. The men spent his entire life trying to make this world a better place. Hope we get a second part."}, {"id": 10, "text": "Loved the film, a little slow in some parts but clearly presented and with a sense of humour."}, {"id": 11, "text": "Excellent piece based on one of the most important socio economic texts of our time The New Human Rights Movement. Poses, and attempts to answer some of the most salient problems facing society today."}, {"id": 12, "text": "This movie tells you exactly how this sick world is operated and what needs to be done to save our self from extinction. The capitalist experiment must be abandoned or we don't have a chance in hell because it kills literally everything on the planet as we speak including new ideas, science and consensus."}, {"id": 13, "text": "For those who don't understand the movie i suggest you read Peter's book The New Human Rights Movement. Very few people appreciate the effort and courage and sacrifice Peter has done for society."}, {"id": 14, "text": "Highbrow commentary on the nature of our existence and how the powers that be use societal pressures to keep us moving as obedient workers."}, {"id": 15, "text": "Excellent! Thanks Peter Joseph for this tremendous work"}, {"id": 16, "text": "A film that will expand your perspective beyond the box. Thoughts and ideas that are desperately needed to make the world more just and free. Peter Joseph is a thinker that will be appreciated more by future generations than by our generation. Just watch and allow yourself to see things differently."}, {"id": 17, "text": "Thank you Peter Joseph for making this film. There isn't a movie out there that provokes discussions of relevant change like Interreflections. Joseph is a pioneer and truly ahead of his time."}, {"id": 18, "text": "This film will gone on to be the most important pieces of art released this century.If you care about the planet this is a must see film, the transition needs to start now."}, {"id": 19, "text": "Thank you, for all the hard work that you, and your team, put into this movie. I have no doubt that this, if no sudden humanity destruction is emerging from the dystopian times we live in, will be a landmark in future history of when the system was first seen for what it is. Sadly, the 'one' is still divided into individuals and hypocrisy still rules the world we know. Have loved every single bit of your movie and looking forward for the next, but, all in all, hope there won't be a need for the next, and the door towards 'human potential' stays open leading us through the great transition towards the utopian world that 'us' as 'one' we should live in."}, {"id": 20, "text": "First off, thanks to Peter Joseph for all the time and effort. This is a once in a generation film. Great job all around. Hopefully this is seen by as many as possible. Please watch this, it is worth the time! Beautiful! :)"}, {"id": 21, "text": "Lesson learned. Starting to change right now. If i were a smoker i d say never again. Recomend it urgently for everybody."}, {"id": 22, "text": "After watching Zeitgeist Addendum so many years ago I never thought I will ever watch a better movie, but InterReflection is just...Spoilers aheadBrilliant opening scene, the music is so powerful and pivotal literally mind-blown from the start! The three stories are made so well, a mix of sci-fi, documentary and art merged into one with such technique that reminded me of the great David Lynch. The crucial difference here is that you actually have an overview of the past, present and future of humankind and it is not just some imaginative story like most movies.The actors are brilliant, I liked how the movie stopped at some point and one of them asked for a break which brought us back to behind the scenes and gave us perspective of how difficult was to make this movie.Another good moment was when the other actor on the table was talking about the activist community and said movies will be made, then stopped and looked at the camera that actually made you feel part of the movie, which you are because what they are talking about is what is happening in real life, reality and movie mixed together.I loved the art scenes especially the one in the office, no dialogues needed you just watch it and everything comes together naturally. A pure form of high class art making.There is not one single weak spot in this movie, everything from start to finish was done astonishingly well and after all these years of waiting I can say it was all worth it.Hopefully there will be a sequel at some point, although I know how hard was to make this one by following the regular updates, but the end result is just one of a kind.Well done to everyone involved and keep it up!"}, {"id": 23, "text": "I would recommend the book over the film. Joseph's the new human rights movement. At least from the standpoint of tangible information. His outrageous interpretation of his own book in this crazy fantasy multi time frame thing is both exciting and bizarre. Still love it!"}, {"id": 24, "text": "I mainly agree with the review of LovesCinematography. The issues being brought up are very important and current. The way it was presented was too long, boring, artsy-fartsy and preachy. If I compare this to Sir David Attenborough's Witness Statement which also brought up habitat destruction, environmental pollution, species extinction, population explosion and other issues, it is like comparing a student project to a professional work of art. You could cut this 2 hour 45 minute long movie and make it into a 60 minute coherent documentary which would get the message much better across with a vastly improved signal to noise ratio. I wish there was a 60 minute director's cut without all the fluff."}, {"id": 25, "text": "This movie is grand... Why? Because it takes the innovative step needed to target the current abomination that is human society. It is a small but malevolent group of people, pulling the strings that control all of us, and anyone who speaks against it, becomes the target of this group. But now, in 2020, when this group has influenced so many over the years (by creating social discord through media, thereby allowing people to do their bidding and fight one another) we the 99.99% are waking in the millions to the deceit and propaganda.If you rubbish this movie, you work for the elite, without even knowing that you do. You can continue to be their slave or you can overcome the tyranny and be part of a society ascending into greatness."}, {"id": 26, "text": "This again, a Peter Joseph Masterpiece. I just love the artistic representation of his book The New Human Rights Movement.We need more of this kind of documentary/movie for everyone else who havent read the book.KUDOS TO PETER! RevolutionNow!"}, {"id": 27, "text": "Interreflections is an engaging meta-documentary and social commentary that highlights systemic and structural problems and presents a rage of arguments about human nature and sociological evolution. It requires your absolute attention from start to finish and it helps if you know the scientific terminology in advance. Truly a masterpiece, but it is not for everyone."}, {"id": 28, "text": "... and hopefully it got here, on time.We've been starving for this message, for decades. Finger crossed that ready for it, and that it's not too late.DC"}, {"id": 29, "text": "Long awaited Peter Joseph contribution finally here... and well worth the waitKeep em coming, the world desperately needs thoughtful, considered, intelligent debate, conversations and engagement in these challenging timesThank you for all your works, efforts and insights ... you are appreciated 🙏🏼👏🙌🏻"}, {"id": 30, "text": "Great Visuals Great plot that does not hold your hands. Really makes you think how our future as a species might become. If you like Alejandro Jodorowsky's The Holy Mountain but a little more current."}, {"id": 31, "text": "Definitely one of its kind. So much crucial information packed with very artistic metaphors. Can't wait to see the next one!"}, {"id": 32, "text": "You may or may not agree with everything in this movie, nonetheless, this is one of those films everyone must watch, if only to begin the conversation."}, {"id": 33, "text": "This should be required viewing in every classroom around the world. A profound train of thought brilliantly expressed. Bravo, Peter Joseph!"}, {"id": 34, "text": "Brilliant film, this is the best movie released this year"}, {"id": 35, "text": "The actors did not believe in themselves so neither did I. Gave up after 16 minutes. I'll never get those 16 minutes back. Hectic times."}, {"id": 36, "text": "Peter Joseph is brilliant. An excellent storyteller and musician/composer."}, {"id": 37, "text": "Socialist, new world order, and hive mind propaganda. Assuming this film is directed towards a U.S.A audience I found within the first half an hour I was being directed/indoctrinated into a fascist/socialist Ideology. I began imaging a world limited of freedom of thought, restricted speech, void of opportunity, where everyone is equally controlled and implemented into a system designed by the most sinister authoritarian minds who saw the world as a ant farm.A true democracy as we know allows for public consensus on actual issues not the appointment of representatives to make those decisions for them 19:00 In.The United States of America is a Constitutional Federal Republic. A Direct Democracy or Pure Democracy is mob rule which is why the framers of the constitution limited democracy and formed a republic with representation to serve the interests of all not just the majority. If the United States was created under a Direct Democracy every advancement it has made to change the world would have never taken place. Abolition of slavery, industrial revolution, Wars Won preventing the total conquest of the planet Ect., A list Miles long.Attention people! There is no greener grass on the other side, this is it. You live in the greatest and best country the world has ever had to offer. Do what you can to make it better without breaking the system that got us here."}, {"id": 38, "text": "It's important to understand, unlike people who can't do this, that one should approach this artistic manifestation of a book with patience. There's a lot of information to understand, but I promise, if you give this movie one chance, and really be objective, then you will find this is a brilliant addition to Peter Joseph."}, {"id": 39, "text": "Ultimately, the message in this material is a call for understanding rather than ignorance, peace rather than war, forgiveness rather than condemnation, and love rather than fear."}, {"id": 40, "text": "As a human concerned about where we are heading I appreciate Peter Joseph's tireless dedication and work to provide solutions and understanding of the core root problems we must overcome to survive. After many years of heady academic work, his latest gift to humanity is this beautiful art piece. A labor of love, every scene is crammed full of thought provoking information and social commentary, wrapped in a beautifully rendered visual celebration. This movie draws you in from the start, and takes you on a journey that at times makes you laugh, and cry, and challenges you on many different levels. I think there is something for everyone, but for those that expect 'more' from a film, you won't be disappointed. I have seen this film multiple times now and I gain more insight and notice new things with each viewing. In an age of formulaic, simple, safe and boring Entertainment it is refreshing to see something new and different. Watch with an open mind, and let Peter Joseph take you on quite a ride."}, {"id": 41, "text": "This is an amazing film, and the beginning of a great trilogy. I'm very excited to see the rest of the movies that follow this. I think that if everyone on our planet were to watch this movie, and really hear it out, we could work our way into a much better world together. Where science and humanity prosper, and human beings can finally truly be free. I only hope one thing. That as many people are able to see this as possible. And I hope that it gets enough viewing power before it's too late. I'd like our world to have a chance. There was clearly a huge amount of thought and careful consideration put into this. Thank you Peter Joseph for making this important film."}, {"id": 42, "text": "An interesting idea... but all over the place. It's like it doesn't know what it wants to be. It comes across like 3 different films edited over the top of each other. A documentary from the future... the final act of a hacking/revolution movie... an abstract... 'thing' that doesn't go anywhere. The film raised $50K on IndieGogo (I donated, being a fan oof the ZEITGEIST films) I am a filmmaker (look me up) ... there is no reason whatsoever this should cost $50k OR take 6-years to put together though. It's mostly actors in front of a green screen with cheap FX added afterwards. Not $50K's worth. Trust me. Being as this took 6-years to get done, I don't see the planned triogy being completed, or even having a follow up, so my advice to Peter Joseph would be: Bring back what made you, what you do best, ZEITGEIST 4."}, {"id": 43, "text": "This film covers topics that others rarely do and in a way that is entertaining as well as thought provoking. The way we slide between reality and farce to illustrate a point is very well executed."}, {"id": 44, "text": "This movie is a must see film for every human being. We are one race! This movie has it all, great way to learn about the problems we have today &amp; to upgrade humanity along side it. The film itself is aside from the realistic side of things also a very beautifull artistic side to it. Big credit to its maker!Thank you very much for your year long effort in making humankind better with a New Human Rights Movement!"}, {"id": 45, "text": "A highly recommended movie exposing the outdated, destructive orietantion of our socioeconomic system from different angles and, at the same time, showcasing human potential that is being largely hindered by misplaced loyalties, lack of understanding, and human ignorance."}, {"id": 46, "text": "I'm really not sure what the audience for this movie is going to be. At nearly 3 hours, and with an often glacial pace, this sprawling powerpoint presentation on steroids reads half like an infomercial and half like an amateur sci-fi submission for a little-known film festival. To the creators' credit, they appear to be aware of this. At the 90% mark of the film's running time a break in the fourth wall, complete with emergence of green-screen and corpsing actors, the director can be hear saying come on, let's finish this damn movie already.Quite."}, {"id": 47, "text": "Oh Dear! There is a scene in this 'Movie' called 'off the rails' where a steam locomotive speeds towards a destroyed bridge. Well this serves as a good metaphor for what unfolds over almost 3 hours, an absolute train wreck of a 'film'.What a disappointment, I was really hoping that this would be a big step up from Mr. Joseph's previous work, the 2 documentaries 'Zeitgeist Addendum' &amp; 'Moving Forward' were intelligent, well researched &amp; extremely valid critiques of our present socio-econmic system &amp; the problems inherent in the free market capitalist system with the possibility of a transition in the future to a new system called a 'Resource Based/Natural law Economy'. All very commendable ideas &amp; something that I would hope the human species can aspire to in the future, allowing of course for many variables along the way.I also really enjoyed the book 'The New Human Rights Movement' that the film is supposedly based on but this in itself is odd as I would be hard pressed to envisage this highly academic &amp; intellectual treatise as the basis for an attempt to engage a more mainstream movie going audience &amp; to invite people to look more closely at our societal problems &amp; possible solutions. I would assume this was the writers aim for the movie &amp; this unfortunately is where it fails catastrophically.As one previous reviewer has mentioned, what audience is this movie actually aimed at?There were some good ideas in amongst the chaos which could have been developed into something coherent &amp; focused instead we get a number of talking head academics from the future basically reading out an audio book. A 'Sci-Fi' story so bad I thought someone had spiked my coffe with DMT &amp; I was having a really bad trip, the acting was so wooden &amp; bad that I thought they were doing it on purpose to freak me out. And then the 'Dreamscape' story of the character '23'. A long, drawn out exercise in self pitying nonsense, although the attempted 'Rap Track' at the Human Resources office was so embarrasingly bad it was hysterical.All in all I'm really disappointed I was hoping for so much more, it gives me no great pleasure to have to write this review but rather than getting caught up in the 'Cult of Personality' that seems to have worringly formed around Mr. Joseph I have to call this particular work for what it is, a massive step backward as already mentioned.Sorry Mr Joseph, in the time it's taken for you to make this movie the world has moved on, I would advise you to do the same."}, {"id": 48, "text": "Movie of the year here: If you enjoy Socio-cultural &amp; ecological discourse on structural change &amp; sustainability all wrapped up in a Avant-garde sci-fi/ documentary film. Watch Peter Joseph's InterReflections, a masterpiece on many levels."}, {"id": 49, "text": "I liked Moving Forward and Addendum a lot but this one is even better. Everyone should watch this, its intelligent, funny, thoughtprovoking and lovely."}, {"id": 50, "text": "Literally, there's no one else with more knowledge and as well spoken as Peter Joseph. Best in depth analysis of our current situation, the problems and possible solutions to the crisis that humanity is facing."}, {"id": 51, "text": "I knew I would enjoy this film before I even watched it. I have long had a bias towards any works that promote true structural change, such as this does. It has been, is, and will continue to be the most important message for humanity even as we take the slow, painful road towards the destruction of all life on this planet.Peter Joseph has given us this message before, in Moving Forward, sure. This film is simply doing so in a different way; clearly more artistic than straight documentary style. Peter Joseph is after all an artist, is he not?I think InterReflections demonstrates a continued evolution in his understanding of the problems we face. Beginning in 2007 with Zeitgeist: The Movie which he describes on the official website as a 'performance piece'; then Addendum and Moving Forward bringing more informed perspectives, appearing more like documentaries than the first film.My subjective understanding of Zeitgeist Trilogy today is that Peter was communicating his frustrations with the social structure with information current at that time and Addendum and Moving Forward over the following years showed how he was digging deeper and learning more. InterReflections is to me a return to being a 'performance piece' but with thirteen more years of knowledge, understanding and experience of living in an increasingly devolving political society.I have not given 10/10 because I agree with some other comments regarding audience; it is doubtful that a lot of people who really need to see films with this important message will likely not understand the abstract metaphors, the intellecual discussion; and there will most certainly be objections to statements such as 'there is only one race'. For this reason it is difficult to see who the intended audience for this film is, and trolls or not, poor reviews will occur because many people lack an ability to regard things outside of their own heads. It could take a few people who do 'get it', to provide explanations for several audiences to digest properly.I think that the human resources rap song was a little cringey. Although I find society to be cringeworthy most of the time so this makes InterReflections a very relevant social commentary for me. There are also parts to be noticed where Peter is clearly mocking himself and/or the idea of creating this project at all (anyone who listens to the Revolution Now! podcast might be able to infer what I mean when I say that).I love the humour, the mix of styles throughout, and the relevance to events that are happening today. The sci-fi/future element was my favourite aspect, now that I have thought more about it. Imagining how people would look back at this time of insanity is a useful exercise. In 100 years time we could be living the way they describe or we could be on a decayed planet, living out that slow painful death, which will we choose.InterReflections seems to be a challenge to humanity. A challenge to reflect on ourselves now. To question our behaviour, examine our identity crises, our understanding of complex ideas and the nuances that exist within these. This film might be a seminal piece for getting to a 'great transition' such as happens in the film. It won't do so alone and maybe it is a responsibilty for people who have liked it enough to give 10 stars to assist in getting this film understood by as many demographics as possible."}, {"id": 52, "text": "I'm so glad Peter Joseph committed to making this, worth every second!"}, {"id": 53, "text": "Probably the most important movie of recent times. Funny and poignant film done in a way only Peter Joseph can. There's still so much he needs to get out that I can't wait for the next one. Please everyone read The New Human Rights Movement by Peter Joseph."}, {"id": 54, "text": "This was such a wonderfully artistic film, with such a powerful and well needed message for our time. I really have no other film I can compare it to, in terms of how it was presented. It was completely unique in its approach all the way through, but done in a concise way so it was easy for the watcher to understand. Peter Joseph's genius never ceases to amaze me. He conveys the message so symbolically and poetically, I really can only describe this as nothing short of a work of art. So well done. Well worth the watch."}, {"id": 55, "text": "Crazy horrible version of some far lefts nightmare."}, {"id": 56, "text": "As usual, Peter Joseph has a great talent and ability to bring relevant and at times complex issues to a broad audience. Like his Zeitgeist movies, this is a movie you must see if you want a different future."}, {"id": 57, "text": "Rarely is a film so prescient as InterReflections. It's a movie that, in the words of Bill Hicks, takes a squeedgie to the third eye at a point in time when we face so many clear existential threats, not least rising inequality and the climate emergency. It's no surprise. Peter Joseph's past cinematic works, including the must watch Zeitgeist trilogy and the Culture in Decline series, take the viewer all the way down the rabbit hole and then some. His work penetrates the plank length of the contemporary human condition and InterReflections is no different. It's an incomparable opus dei of work for our times with InterReflections as the latest landmark on that journey but there's a very big chance you'll never have heard of Mr Joseph. He has been the catalyst for the Zeitgeist Movement, a global advocacy group that is still very much active, and simultaneously helped to propel Jacque Fresco's Venus Project into the 'relative' mainstream. InterReflections, released on October 6th 2020, could not be more relevant. As the Covid-19 pandemic continues to rage across the planet, revealing the inherent frailties of our political, social and economic systems and a US presidential race in full flow, InterReflections provides a perfect antidote to an era that is increasingly becoming bereft of hope. Three intertwining, interconnected stories, covering different eras, weave into a consistent narrative that not only provides an accurate and mind blowing analysis of our current malaise but offers a transitional scenario and a destination. Not utopia, but pragmatic design. This is a film that should be watched by all. End of. We need more of this type of stuff across all artistic mediums. In fact we need 7 billion or so more Peter Josephs. Bill would be proud. So should you. There is hope as long as there are Peter Josephs out there. Here's Tom with the weather."}, {"id": 58, "text": "A lot of people are going to hate this movie. Make sure you don't listen to anybody. Simply watch it and use your own critical mind. Lots of trolls on this page."}, {"id": 59, "text": "Wow this really brought so many of our global issues together - touching on religion to the environment, poverty, racism, classism - all stemming from capitalism! I've really enjoyed this film and it Inspired me to buy Peter Joseph's book the new human rights movement. It's so important for everyone to please watch this!!!"}, {"id": 60, "text": "This might be the most important movie of our times. Peter Joseph went out of his way to create a unique movie with an extremely important message for everyone, in a very artful, mesmerizing and entertaining way."}, {"id": 61, "text": "This is a pile of tripe that spews hyperbole as if it were fact.The underlying assumption is horrifically flawed: the 'collapse of global society' -- when it is in *reality* a group attempting to collapse our societies for us.This movie attempts - poorly - to spoon feed pure Socialism to the viewer as a true Utopia and panacea to strive for when in fact, it is but a mere stepping stone to communism. The end result is a world full of people equal in their misery with the exception of (big surprise here) the aforementioned group above that are the equivalent of Overlords.Sorry. We're humans. It will never work. Never has, never will."}, {"id": 62, "text": "This flick is not your tipical Hollywood movie! It has the potencial to in due time became a cult classic. The message is eye opening, visionary and inclusived. The style, while definitely will not please everyone is a honest, kinda funny, movie/documentary mix. I feel this marks a point in our history. Congratulation to the director and crew."}, {"id": 63, "text": "Great movie which is quite long but excellent content."}, {"id": 64, "text": "We missed your work Peter. It comes at a pivotal time and the film couldn't be more relevant. It ask discomforting true questions and will leave the viewer mind blown. A must watch for anyone who wishes to deeply understand the path humanity is one."}, {"id": 65, "text": "Crazy how its only given a 6.5 by critics. However the only feedback that is being given is positive."}, {"id": 66, "text": "This film is an eye opener. The film shows our human struggles in a different light. My favorite part is when they are in the future and explain how societal issues we currently have are dealt with and abolished. Interreflections gives hope, and displays real possible solutions to what ails our planet."}, {"id": 67, "text": "This film is a huge blow to the Zeitgeist movement. The only thing positive that will come from this cringe experiment is Peter Joseph learning from his mistake. The CIA happily praises Peter on his failure and fully endorses this film - why wouldn't they? It essentially discredits everything Peter Joseph has ever touched. Nothing was funny in this film - it was a choppy, unironic miscarriage - and this is coming from somebody who bought and read his book - and followed his work since the inception of the very first zeitgeist film. Beyond that, I truly hope Peter enjoys whatever revenue he made from this tragedy - hopefully it will be used for a more pragmatic project in the future."}, {"id": 68, "text": "One of the most accurate documentary out there, been a fan of PJ,s work since forever. This movie is full of symbloism, metaphor and double meaning that will make you think about social issues that we are facing as a species. An incredible movie that everyone should watch many times to understand all the layers in it ! Thank you so much for all you effort and devotion to the human cause."}, {"id": 69, "text": "This is a must watch. Its a bit long but I think it will open a lot of eyes. Something is clear, the time for the Great Transition is upon us and I am very greatful to be alive in a time like this in our history."}, {"id": 70, "text": "Ahead of its time and relevant to the time we are in. A must watch for those wanting more from humanity and a system Banksy in need of an overhaul. Loved it!"}, {"id": 71, "text": "This is not an action, comedy or a thrillerIt's not a film intended for the masses either,This film is intended to motivate.This film is intended to ask the question: what next?The slowness creates a dream like consciousness.Definitely worth watching."}, {"id": 72, "text": "As Matisse said: Creativity takes courage. The balls on this production or unlike anything I have ever seen. Love it or hate it the film is magnificent."}, {"id": 73, "text": "Been following PJ for years. Big fan of the Zeitgeist trilogy. This flick attempts to reach a far broader audience by employing attractive actors conveying the same train of thought, as opposed to old crusty white guys (i.e. Mate, Perkins, Sapolsky) (def not a bad thing). But, its got all the bells and whistles to keep a general audience entertained and informed."}, {"id": 74, "text": "This is going to be difficult film for some Peter fans for one reason: avant-garde genre. People will love it or hate it. Something similar happen with Ursula le Guin and her Always coming home, or with some of Aronofsky films. For me personally, it was both educational and inspiring. I will not talk about the plot, but film is full of references and quotes that is hard to remember, or even catch everything in one time viewing. Second reason for some people disliking this film is it's criticism of political and economic situation. I see some usual comments like  communist propaganda or utopia. Philosophy of the film has nothing to do with communism (which was mentioned in the film albeit in a negative context). Regarding utopia, system on the island at the end of film is fully possible today, from renewable energy, 3d printing, zero waste or direct democracy. Considering it's possible, than we can't label it utopia. Highly recommended"}, {"id": 75, "text": "A real piece of art. I've watched it 4 times already since downloading it. I love the way this film shows the naked scene every one in a while. It reminds me of the theater plays of Berthold Brecht, who also always let the spectator watch behind the scenes in order to not distract him totally from reality. To me this is an important tool that supports reflection rather than mere consumption.Well done, Peter Josep and crew ! I am so pleased with this !"}, {"id": 76, "text": "This film really makes you wonder how the world got to what it is today"}, {"id": 77, "text": "I was intrigued. I was entertained. I laughed. I cried. I felt a little less alone in the universe. Thanks for helping me (and hopefully others) maintain some hope for (eh, make that faith in) humanity!"}, {"id": 78, "text": "Wow. This is not at all what I expected after the Z trilogy. It's so much better in style and substance. The unfortunate thing is so many people are not really going to understand it. But brilliant nevertheless and I'm happy I was able to be part of it in the crowdfunding."}, {"id": 79, "text": "At this point in time, our current growth-and-consumption system is literally killing us. It can't help it, because it's built this way, but most people don't see it. Our owners don't want us to see it. But Peter Joseph illuminates the mechanisms that drive this system forward, and he conveys the information through many characters who help make that information accessible. We're told we have 10 years left if we don't change our ways, and yet we do nothing. I can only hope that millions of people will watch this film and understand the inherent and fatal flaws in our system, and then say, Oh, now I see."}, {"id": 80, "text": "I feel as though I have mentally eaten 5 Thanksgiving Turkey's in one sitting with a shovel. It will no doubt take weeks if not months to process all of the information within. This is Peter Joseph's magna oupus, I thought Peter had said all there is to say with the zeitgeist trilogy, but alas there is more. Elements of Pink Floyd's The wall mixed with an homage to they live and a dash of Orwell was very nicely done. I would have loved to have seen a Bill Hicks quote thrown in with Carlin's, for if Bill Hicks were still with us he would have probobly loved Peter's work. Though breaking the fourth wall repeatedly lost its charm and felt like overkill. The mark of a great film even at 2hrs and 40 plus minutes did not at all feel drawn out and boring. I will no doubt watch this again, and discover something new. Hats off Mr. Joseph, and where do I sign up for the utopia"}, {"id": 81, "text": "The most intellectual and vitally important informational movie I've ever seen. I am so glad that this exists and I've never seen anything like it. So many real themes and concepts explored that most people don't have the love of humanity or courage to explore and this film did an amazing job in going there."}, {"id": 82, "text": "Yikes! So much hate and ignorance being stated in the comments here. Please watch this movie with an open mind and ignore the noise around it. Either people love Joseph's work or hate it, unfortunately. One thing for sure - this is a very important production that everyone should see and dissect."}, {"id": 83, "text": "Imagine a world system constantly iterating itself like a fine tuned feedback loop to get the highest possible efficiency and abundance for humanity, our planet and balance for the ecosystem. This is what Interreflections proposes and its the first of its kind EVER to touch on these subjects getting to THE CORE of every - single - social problem, across all activism and most issues global society faces today, imagining a really ambitious, but highly effective solution. Year 2020 has been a hot mess of a year, with so much smoke being blown up everybody's ass (literally in case of western United States), this movie was the antithesis of all the insanity, it was a RELIEF to absorb content with meaning and substance for a change. Best movie I've seen in a really long time."}, {"id": 84, "text": "I'm not a sci-fi fan but this is not actually a science-fiction movie. This is one giant metalevel chaos of a film unlike anything that has come before. Three timelines. Three genres.. Particularly like the abstract section with the young woman and the ambitious nature of it. I'm shot this film was made on such a low budget given how high-quality."}, {"id": 85, "text": "A fantastically creative experimental film but people should take the time to really pay attention to. I plan to watch this a few more times."}, {"id": 86, "text": "There were humorous scenes that made me laugh out loud. There are questions within it that are worth repeating over and over again, but it is better to do something about it, else you would be stuck feeling sorry for yourself. There are plenty of reminders of this throughout the film itself, so lay off on the popcorn and make structural movements towards pragmatic design. The end of first part of Peter Joseph's (trilogy?) review"}, {"id": 87, "text": "In an original &amp; artistic delivery true to PJ's character, Interreflections offers a great deal of clarity with respect to the problems we face today. Activist energy is powerful, and it exists today, but it does seem to have been misplaced. Interreflections can help concentrate this energy into a productive force, IMO. The cultural anthropologic perspective of the future was a brilliant idea."}, {"id": 88, "text": "This film really depicts the all-so-many problems that afflict our world. The cognitive dissonance that has ravaged the minds of so many people like a plague. This film also give me hope that humanity will see the error of it's ways and work to create a better tomorrow."}, {"id": 89, "text": "Pretentious garbage. Word salad. Death by monologue. Time you'll never get back."}, {"id": 90, "text": "I think my favorite line in this movie is toward the end where the redhead woman talks about how culture changed. How people became kinder and nicer. Really expressing Pete's entire thesis about human behavioral change. It will not come from our moral sensibilities. It will come from the structure we live. I strongly suggest peter's podcast Revolution Now! as well. He is one of the most underrated intellectuals."}, {"id": 91, "text": "Amaze-Balls. Amaze-Balls-Amaze-Balls-Amaze-Balls! That is all."}, {"id": 92, "text": "All I can say is I want to see the story keep going! I hope Joseph can recover financially from this and make the other films more quickly with less complexity. Peter! If you're reading this, please lower the bar! It doesn't have to be so fancy!!! ;)"}, {"id": 93, "text": "In Pj's book The New Human Rights Movement he talks about a structuralist perspective to understanding the world. Wow the film is great. I suggest people read the book. The book is more important and I think more effective and it's communication. That said, interreflections is quite possibly the most original film concept I have ever experienced."}, {"id": 94, "text": "I am very sympathetic to what Peter calls the post-scarcity movement. A movement that wants to break away from the scarcity foundation of our current economy and build something that is more humane that can actually illuminate poverty and so on and so on. Both of his books document this approach well. As far as this film I think it's visually and music beautiful but I'm not quite sure it's role in activism. I guess time will tell. I simply think a lot of people are going to be turned off by its ambition."}, {"id": 95, "text": "And if you don't know it. You're going to find out the hard way. This quote by Bayard Rustin seals this film's legacy. Such great positivity combine with dark observation about our world. I also enjoy the cigarette pack emoji's being thrown at the cardboard cut out of the young woman character. So many levels of symbolism."}, {"id": 96, "text": "The 2001 Space Odyssey of activist films for sure! Just remember that as you watch this movie, your mind is going to wander. You're going to get frustrated with the manner by which you have to pay attention. There are things you were not going to understand. I spent about 10 hours looking up things brought up in this film and I'm really glad I did. I can't wait to get Pjs book as well."}, {"id": 97, "text": "I think many aspects of this film were unconventional, the actors were focused, the rhythm was very iconic and I do not have any recommendations that compare to this genre and style. I read the book (watched films), I have seen some different sides to wealth and i am under the influence and I do blame people that create masterpieces without any regard for competition. Is it fair for this propaganda to be watched when everything else is pure elitist egotistical existentialism, I am feeling the come down and can not wait for the next reality purge... Thank you for creating a real beginning to a concerning dystopian of our literal future, resource based....slavery propaganda...I wonder if i will ever be smart enough to read words without comprehending how it is in reality through culture and our shared physical environment maybe alternate realities are a good program for society on a trip toward massive overdose."}, {"id": 98, "text": "A sick, masterpiece of a spectacle. I have never seen anything like this in my life and it deserves endless awards. I do think the structure shows it is very challenging for peoples attention span however. I hope he breaks it up into sections or episodes. I also hope he can make the sequels. A+"}, {"id": 99, "text": "Go to Vimeo or whatever platform you like and watch this movie now! Get comfortable. And prepare to be challenged on multiple levels! The dialogue between the two man in space is some of the best writing I've ever seen"}, {"id": 100, "text": "I've been recommending Peter's life-changing masterpiece The New Human Rights Movement to everyone I can for years. I'll switch to recommending the movie now which is much more palatable for most : )"}, {"id": 101, "text": "..educational, insightful, this delivers a necessary understanding of our world system, which is required for us all to move forward."}, {"id": 102, "text": "Even down to the Alan Watts quotes. Our society is a mess, completely disconnected from nature. We're clueless to the fact we are all part of the same thing and delude ourselves in a pointless race to attain meaningless things. If all this means nothing to you then keep an open mind and watch this. There's nothing here that isn't 100% true and it's a welcome breath of fresh air in a world gone completely mad."}, {"id": 103, "text": "Great film but I'm still highly partial to the zeitgeist trilogy. There is something more commanding about that series than in this kind of artistic stretch. But I'm going to have a viewing party next weekend for this film anyway because it's still brilliant"}, {"id": 104, "text": "If there was ever a. Movie I felt I didn't pay enough to. See. This was one of them. The insights and thoughts were so clearly expressed and I was eating it up. The theatrics enhanced the knowledge being fed to the viewer.waiting anxiously to see the next one"}, {"id": 105, "text": "I was positive of a better future in a resourced based economy society. That was until I saw this movie. I would give Peter another chance. Take my money again and don't stop taking until you get 25 50 million. Hire the proper people for a proper a job. The very least a good script story to tell."}, {"id": 106, "text": "A must watch for anyone who cares about the future of our species!"}, {"id": 107, "text": "I have been a big fan of pe-joe for years. I was never expecting something like this after so many years in production. I watched the film once and felt deeply confused and almost irritated. And then I watched it again and it finally clicked. This thing is an artistic masterpiece with some of the best social commentary I have ever heard in regard to what plague society today."}, {"id": 108, "text": "This film is obviously a labour of love from a deeply self aware team who pour everything they've got into their work. I'm sure I'll be watching it again and again. Thank you for continuing to spread a message of hope and not giving up on our crazy species."}, {"id": 109, "text": "I have been waiting for this film to come out for some time and it was well worth the wait! Intense images and partly surreal scenes come together in this brilliant movie to show how this system works and why it is so hard to overcome. Even complex problems are really put very clearly and entertaining to boot and with enough humour to keep it light. And it leaves us with hope and a way how we can change it anyway. For me an absolute masterpiece. Don't miss it! It's even better than I can write right now, I don't feel I am doing it justice."}, {"id": 110, "text": "As I write this review (and you read it), if you were to zoom out of our everyday experiences, you would see a society and a planet in collapse. This is clear when you look at the climate science. It's clear when you look at the mass extinction of species. It's clear when you look at the broader biodiversity crisis. It's clear when you look at perpetual wars being waged. It's clear when you see the unprecedented mental illness epidemic. It's clear when you look at our social response to the COVID pandemic. It's clear when you look at any area of social inequality and our political systems failure to deal with any of these crisis.So, if you're paying attention, the question naturally arises: Why is our civilization collapsing?This film is the resounding, exhaustive, and eminently watchable answer to this question."}, {"id": 111, "text": "There is so much in this film. Part debate, part showing what could be and part where we are now.As a film I would say it is somewhat experimental. But not in an over your head pretentious way (which is actually a joke in the film). It's not like things are made so abstract and artsy that people won't get it. The whole point is that they will and the film presents the insanity of the world we live in through both nightmare scenarios and debate pieces where system thinking and a more correct train of though is clearly stated.There are so many ways a film like this can failure. First it needs to function as a film, despite the message. Then it needs to have an emotional impact, and intellectual one as well. Interreflections succeeds with all 3."}, {"id": 112, "text": "Too damn predictable. If I had a dollar for every time Peter made a predictable argument, I would make Peter mad because I profited from capitalism."}, {"id": 113, "text": "If you really care for your grandchildren, watch it carefully. Do not expect to have fun but wisdom.Very simply put, if you know Peter Joseph, this is a fictitious documentary style movie which shows us how the world should function, when we do everything right.It is obvious that the movie suffers from financial scarcity itself. Well you can easily see why this happens in current capitalist system. But in the end you will like it if you put the effort and education to understand it. Of course there will be a large percentage will not understand and therefore will not like it.I like it a lot."}, {"id": 114, "text": "Ultimately there's not that much new in here that is not just the old marxist ideal, and while it purports to be presenting something new that escapes the past pitfalls at attempts at implementing this ideal, it really spends very little of it's time actually getting into how this supposed new way would actually avoid the issues, like how it is determined how goods+services are distributed in that new society isn't really touched on whatsoever.Countless ideas are thrown forth that have long been discredited to anyone familiar with history/economics, but to people not having studied these things can sound plausible. The movie makes very little attempt to fully highlight the ways these ideas that it throws out (which have long been discussed), have been countered and discredited, and to counter these arguments against them since it totally ignores them.Just as one simple example - the idea it presents of that island with the banks and interest, totally misses the point that the interest payments actually go somewhere, e.g. paying the bank's employees who are part of that island's economy etc, thus the monetary system is not at all inherently doomed to be burdened with ever increasing debt. This is indicative of the general level of intellectual argument+thought behind this movie - it tries to appear intelligent with fancy language, but generally simply presents such fallacious arguments.The debate part is somewhat interesting as it actually gives at least some attempt to provide some kind of acknowleding and addressing some arguments against the ideas ... however the lecturers' pontificating is all just very cringe, and then another half the movie is just meaningless wierdness which could much better be cut to reduce the movie length by easily an hour which would somewhat improve its value at least."}, {"id": 115, "text": "I just watch the film on Amazon and not only does it look fantastic for a low budget production, the symbolism is unique. Not big on avant garde in the works of Lynch and others... But there is something magical about this intensely long film. My favorite part are the academics showing on the white screen. This dialogue is taken directly out of his book. Really clever stuff. 9 stars."}, {"id": 116, "text": "In conversations with people about the movie I'm surprised how few pick up on the livingry vs weaponry concept set up from beginning to end. The credit sequence features R. Buckminster Fuller and a classic lecture from the 1970s. This relates to the opening quote by Thomas Malthus and the bomb at th end too. What the old guy character in space calls the Malthusian mandate which appears to be a theme about how the poor of the world are kept poor and diseased ...a slow motion genocide is always in place - because of a structure of the economy. This whole section was absolute genius."}, {"id": 117, "text": "So much slapstick. This film references itself so many times it's like the Naked Gun version of activism. Breaking the fourth wall. The strange reality of the John and Simon characters being in space but also simultaneously being on a stage in a theater. I have yet to unpack this masterfully created a piece of art. Personally, I suggest people watch a little bit of it and then do research. And then watch a little more and do more research. And don't give up! Like a lot of films of this abstract style it's easy to just feel confused and give up. The ending finale is really fun."}, {"id": 118, "text": "Very important and good ideas inside but, not many will watch and understand this film because image and presentashion of ideas very weak. I think its already too late for Earth and humanity-cancer will kill the planet much faster than it could for other reasons like dieing Sun or asteroids... ofcource if low intellect religious retards wont use nuclear weapon to get to paradise even faster than resourses will be exosted and cannibalism will became normal thing on Earth with 50 milliards population. 100-300 years and it will became new reality...if rich peaople wont change everything today, because they are controlling money and our future."}, {"id": 119, "text": "This film is basically a regurgitated lecture of Peter Joseph's lectures. One character in the film is played as a professor and is quoted as saying Some things were considered external to this contrived competitive game they called business This clearly sounds way too much how Peter Joseph uniquely talks.The script was indigestible and felt like a course instead of a movie. There was literally no plot. I guess you can say there was a tiny storyline, but it was clouded out by over used jargon. It was very hard to keep my eyes on it for nearly 3 hours.The Good: The music was nice and fit the scenery of the film very well.I follow Peter Joseph's work, so I do find the topics in the film extremely importantThe Bad: No plot. Not a documentary. My guess is you can call it a MockumentaryActing is so bad. Like really bad. I can't knock the actors. Al Pacino himself wouldn't be able to give life to such a script.The special effects and color grading was bad and pretentious at best. Overblown soft tones and lumination was a bit nauseating.Conclusion: I gave the rating of this film a 2 and not a 1 because I felt that the film's topic is important. Capitalism is an extremely inefficient system. Although we have no other system better to replace it, we have elitist fans who defend Capitalism which ultimately impedes on any progress to our social condition.This film feels as though it's directed at Peter himself and those who agree heavily with the Zeitgeist Movement. If there was any attempt to bring further outreach to those outside this circle or provide an enjoyable movie, then this Film failed miserably. If there was no attempt to bring further outreach and it was created purely to provide a somewhat entertaining outlook of the movement for those WITHIN the circle, I think it did well."}, {"id": 120, "text": "What I loved about Zeitgeist Moving Forward is that there were many voices of people who brought their own way of speaking, their own perspective and insights and then there was a lot of time spent on a possible solution to many issues: The Venus Project. Over the last few years since, I've become disenfranchised by the allure of the naïve vision, though I still agree with developing an open source commons of resource sharing somehow.Interreflections, by contrast, is just one voice: Peter Joseph for 2 hours and 45 minutes. This whole confused film feels like one badly structured essay spoken by a few random actors to give the illusion of diverse voices, covering that fact that this is clearly a single minded ego train of one man. There were moments I enjoyed - I liked it when he made references to real research, especially when talking about inequality. And I kind of enjoyed some moments in the great debate. I must give credit to the incredible effort put into the special effects and obviously the huge amount of time and work put in to create this film. Overall, I didn't hate the film, but let's be clear, it was bad. It was jarring, slow and confusing. Almost the entire film was unstructured cynicism with the last 5 minutes for the solution - a city that magically appears out of nowhere and is loosely based on a resource based economy, though is incredibly shallow because there is literally only 5 minutes to briefly introduce a slice of utopia and even more naïve than the Venus Project because this wonderful city just literally gets plopped into the ocean by some group of futuristic activists. I mean seriously. I thought this would be like a development from Moving Forward, but it was a serious step back. If Peter Joseph wants to stay relevant he needs to connect with the real world, not retreat further into cynicism and hide behind a totally shallow veil of utopia."}, {"id": 121, "text": "This is essentially a two hour and a half monologue in the voice of different actors intertwined with two different storylines. The first is some kind of sci-fi short story and the second consists of a series of expressionist metaphors intended to reinforce ideas conveyed by the monologue. Together the three components add up to the two hours and forty five minutes total duration of the footage.The main issue with the monologue itself is that it is purely ideological, meaning non-factual and poorly documented.The artistic insertions, on the other hand, happen to be hackneyed, predictable and poorly executed, whereas the short story end ups being a commercial pitch to raise funds for an utopian futuristic design project.All in all, the whole thing is pretty boring. The only reason I gave it five starts is because, if soporifeous, this thing remains an attemp for refocusing the debate on crucial issues."}, {"id": 122, "text": "With a limited budget (and limited lifespan) one can do only so much. When resources are finished, only thing that can be used as fuel is creativity. This film is wonderfully creative and unique, so much so that it seems as if you've entered Joseph playground.Keep in mind that this is Joseph first movie ever. All of his other works are documentaries and music videos. As a musician and maker of documentaries, he has done one hell of a job with this. It is not the same thing to do something basically alone (like Zeitgeist) or in synergy with tens of other people like in this movie and Joseph has approached it, in my opinion, wisely. You wont be a new Kubrick and if you try to approach a film meticulously, you will fail. However, you can approach a film, even if it's your first one, creatively. That is something no professor can teach you. Joseph has chosen to be creative and it has paid off.This is a movie that one should watch multiple times to understand. For a short attention spanned average Joe, I'm sure this piece will be a torture for eyes. But for anyone who wants food for thought, a movie that will actually stick with him, give him a lasting message, not just entertain him, this a movie to watch.If you want to be entertained, play yourself some Avengers. There are loads of high budget films for kids that will tell you nothing. But if you want an art piece, you are at the right place.At times, Interreflections felt a lot like Baraka and Samsara, At other times it just felt like watching into animated painting. It's full of symbols and hidden gems. It makes you feel at times like a child in a intellectual way, if that makes sense. This is a movie that professors could watch to relax, as opposed to other films whose relaxation come at the price of losing the sanity.For someone who has watched basically everything the man ever produced, it felt relaxing. I'm sure if Joseph used Interreflections script and made it into Zeitgeist 4 with his baritone voice, nobody would complain, it would get millions of views and then we continue buisness as usual, but I like seeing a man trying this different kind of approach. And I guess after almost 7 hours of talking into microphone about money and structual violence in his Zeitgeist trilogy, guy deserves to sit behind a camera a bit and let others do the talking. Joseph is probably tired of saying the same things over and over again so now he used art as a language. And with art you can say structural violence in billion different ways.Anyways, only problem with the movie was - I know, I know, Pete, you saw it coming, sit down - complete lack of mentioning Jacque. But its ok. Movie has only so much screen time, and mentioning Jacque would probably require to change a script a bit. After all, genre is fantasy.Peter Joseph is my favorite film maker. And if his next work will be Zeitgeist 4 or Interreflections II or some other name, I will watch it."}, {"id": 123, "text": "I have only watched Interreflections once. I understood this new movie to be an artful expression of the Zeitgeist documentary series, but I was not impressed. Actually, somewhat disappointed. As an avid Zeitgeist movie and Peter Joseph presentation follower, no new points were made other than we are all one, although inferred in the Zeitgeist trilogy. I anticipated a movie demonstrating more detail of the problems associated with transitioning the world using a new Venus Project resource based economy, it did not but for a brief part at the end. It simply seemed to be an abbreviated visual supplementary for Peter Joseph's book for a human rights movement. The movie did not follow up to the Zeitgeist documentary series. It repeated the same points made in the Zeitgeist trilogy. I will not chastise the acting and green screen effects as I know Peter was on a limited budget, and it wasn't as bad as many B movies I have watched on Svengoolie. Some of the scenes were entertaining metaphors. However, the film droned on human rights points never detailing how the demise of the ponzi scheme world monetary economic system occurred as quickly depicted at the end of Zeitgeist: Moving Forward. I guess I will have to wait for Zeitgeist 4 to follow up. I will watch Interreflections again hopefully to get a better perspective of PJ's goals that I missed. Art is in the eye (Zeitgeist eye) of the beholder."}, {"id": 124, "text": "Just like the book, this piece contains a lot of the information necessary to understanding the sociological conditions we are in, how we got here, and what true economic system based on equality and sustainability would look like. As well as how imperative it is.Although for those who know extensively the things Peter talks about, in his lectures and other media, then this is basically a condensed rehash. If you've seen his lectures/interviews like viable systems and improbable democracy on YT, then this covers most of that.This is not a movie you put on to be entertained. It's a movie you watch and listen closely, because the information is of vital importance to our survival as a species. Especially now, in our confused and divided society mired in conflict and inequality.The points raised and information given here is not really discussed at all on the left. And that's really ashame because Peter is a messenger. This is not his theories or something derived from his own anecdotal experiences. The left and any activist for human rights or advocate of social equality needs to see this. People on the Trump train or people on the right would probably dismiss this entirely. But this isn't for them.The movie isnt perfect of course. It's very heavy and dense. I watched it in two parts. Just a ton of information and pretty grim. It's the truth though. Like staring into the sun, but the truth nonetheless and thats why it needs a 10. You sadly won't get the entire puzzle from any single person out there. Just pieces of it. Thankfully Peter has it all here and that's pretty special."}, {"id": 125, "text": "I first discovered Peter Joseph's work some years ago and quickly absorbed all the Zeitgeist films. It was the first time I'd seen, on screen, someone talking about subjects that others felt were too taboo to mention or too strange to consider. I remember that Einstein often got the same feedback, as well as Tesla and many others who developed works that seemed on the edge of simple understanding.A lot of people who don't like to think very much won't get his films. Which, unfortunately, is pretty sad and makes sense as to why the topic of the film hits home for those like myself. In a way, their dissent of the films are self-fulfilling prophecies.However, the one thing I do love about this latest film is that it pokes fun of itself, often commenting on what the non-target audience member may be saying to themselves. And in the words of many famous folks, if you can simply explain something then you completely understand it. Some of the scenes do just that. Others, however, take a deeper level of introspection.In the end, InterReflections takes a deep dive into the human condition, and explains it in digestible bites that allow one to see themselves in the characters, while exploring the possibilities of what could be. Looking forward to more, as the end seemed to allude to a part 2."}, {"id": 126, "text": "InterReflection, as a whole, is a good film with an extremely important and timeless message based on the material contained in the book The New Human Rights, which I also recommend to everyone.The film addresses the problems underlying the collapse of global society as we see today, in an easy and comprehensible way, though surely not easy for many people to accept, it discusses the causes of what inevitably drives us towards extinction.Based on thoroughly analyzed scientific evidence, it is something of a witness statement, a sci-fi/mystery-thriller/documentary, artistic with a hint of satire.The acting, as for me, was generally at a good level, although when watching the film I had the inherent feeling that I would rather see this film as a play on the stage, sitting in the audience, and actors playing their roles live in front of me .Although the content conveyed by the film is no stranger to me, the re-awareness of it all led me to a feeling of enormous disgust, outrage, and to despair, laughter and tears, to finally soothe my sadness with a vision of a new society that ends this movie.Whatever you think about the acting or the way in which this film was made, the message it carries is timeless, and everyone regardless of their age should see InterReflections.I end with a quote from the movie, in words once spoken by Bayard Rustin:You are all one. And if you don't know it, you're gonna find out the hard way."}, {"id": 127, "text": "I have watched this movie last night. What an experience! Stunning visuals and sound design. The opening sequence was so beautiful and so heartbreaking.The movie is long, but it didn't feel so at all. It was extremely engaging, I even wanted more, although the ending was good and overall it felt like a great all together piece.The actors were great as well.I highly recommend this movie. It will open your mind to many things.If you were to watch just one movie this year - this decade - let it be this one.Thank you, Peter Joseph, for all the hardwork to make this and share it with us all.We are one."}, {"id": 128, "text": "Watched this highly anticipated movie last night. Having seen trailers and watched previous works by Joseph, I was excited, but not 100% sure what to expect. Well, I found myself completely immersed in the story line, as it fluctuates through various time lines in order to paint a complete picture. It achieves this well, as a viewer, you really feel the ability to stand back, (something we don't often do) and see the entire picture, as the story is cleverly told from different perspectives, from the present, near and more distant future.I think it was very brave of Peter Joseph to create this, using this style, it is a blend of genres unlike anything you've seen before, and now having seen the film, I would have to say, it has paid off! The artistic approach to some of the scenes are insanely good, they feel nightmarishly dystopian, while keeping the viewer aware that these are the ugly sides to our current system, our current reality, and not from dystopian fiction. A powerful wake up call! It is very different in execution, to anything else out there, so some might not get it, for me though, it was beautifully made, its outrageous and down to earth at the same time, brave, and entertaining.Please do watch InterReflections, over 2 hours of escapism, and after you turn your telly off at the end, you'll never look at the world the same again!"}, {"id": 129, "text": "I am intimately familiar with the filmmaker, Peter Joseph.I know him, professionally, and personally.I enjoyed watching the Zeitgeist film series.While I have many reservations about the content of the three movies, they undoubtedly had a style to be recognized and appreciated. They had a clear tone and a direction.I had hopes for Joseph's latest creation, Interreflections, which has been in the making for almost a decade.While I may disagree with the man and his worldview, I can appreciate an artist's work independently.I tried watching Interreflections.I really did.It was quite literally the worst thing I've ever seen in my life.I've indulged B-movies, C-rated actors, and plain bad stuff. I can endure 10 minutes of something like sharknado every few years.No problem.But I couldn't watch this garbage for more than two minutes straight. I had to skip through to see if it got any better at some point.It didn't.The green screen is so unbelievably bad it makes everything feel fake beyond imagination.The acting is even worse.The plot is non-existent.I think the major problem of this film is that it can't decide what it is.Is it a documentary? Is it a fiction? A docu-fiction?There are scenes where there seems to be a genuine interview with a scientist. And yet, it's painfully obvious that those words did not come out naturally. They were scripted, and badly.The drama doesn't feel like one. If I wanted to explain to my students at a film school what terrible filmmaking is and why, I would show a scene from Interreflections, and have them analyze it.It'd be a great exercise.Interreflections is the perfect example of what you should not do as a filmmaker.It pretends to portray a new point of view, while it simply rehashes old ideologies, minus the insight or the wittiness.It wants to be a drama, but has no story and no structure.It tries to make you think and question authority, but all it does is provide a different kind of propaganda.Between the atrocious use of green screen, the terrible acting, and the condescending pandering of both the interviews and the plot, I could not follow anything for more than 60 seconds.I can't believe Joseph spent half a million and worked for 8 years on this garbage.There is a silver lining though.If I ever teach filmmaking techniques to my students, I will refer to this film as a step-by-step guide on what not to do."}, {"id": 130, "text": "This movie is long! I finished after 2 sittings and I have to say while I love traditional Sci Fi (bad or not) this isn't traditional. With a very experimental feel I was curious in its unfolding and was actively working to put scenes together as there were layers of depth it seemed as scenes progressed. VERY intellectually stimulating. It had me up the next couple days thinking. Things I've never connected before. I'm going to give it a second watch for sure because there is just so much depth and after talking with someone else he was able to notice more references then I did the first time so this is defiantly a movie that deserves multiple watches and not a movie for passive watching, it demands your attention at least if you're a puzzle solver.NOT a movie for those without upper level brain activity or tiny attention spans. The Sci Fi is bad but impressive at times and the ethos of the film and intellectual aspects for me make it a 10/10. Same reasons I love Christopher Nolan films but this one has no where near that budget and still seemed to deliver on the intellect and philosophy. This one is going to go over many heads but those with the eyes and minds to meet it on the level of its presentation will be in for a very rare treat indeed. I'll be following to see the discussions about this film. Very curious as to where this goes!"}, {"id": 131, "text": "This film mentions several revealing truths that people need to know -- like the problems of a debt-based economy (like that created by the very private Federal Reserve in America). But the film also goofs severely on topics like wealth and disparity of income.Now, my take on it all...Wealth is not evil. Disparity of results is not evil. Equal opportunity is good, but we cannot get to that ideal because the people pushing loudest against corrupt corporations are pushing for Bigger Government. Ironically, the Biggest Corporations are also pushing for Bigger Government.Free Market Capitalism, instead of the Leftist Capitalism used by all Publicly-Traded Corporations, would solve many of the problems mentioned in this film, if only Big Government and their Big Corporate backers would get out of the way.This video reminds me of the Zero Sum Game philosophy of economics. Bogus idea! Wealth is created by people adding value. Currency should be based on added value -- not debt. And banks should NOT be allowed fractional reserve lending to loan out 10x what they hold.We have a lot of problems in the world, but they can't be solved if films like this tell half-truths and horrible lies."}, {"id": 132, "text": "This movie is a cross section of the status quo and the structure of our society, showing why things are the way they are and what happens if we continue down this path.The most interesting part is the 'future perspective' where scientists analyze our current societal methods and indicate the flaws and weaknesses contributing to its own misery and demise. This has the surprising effect of seeing our society as malfunctioning and delusional as it truly is and figure out a way to redress it. Nature in our current view is only something to be exploited and man is not seen as part of it, but rather fighting against it.Living in accordance with nature, something we knew for thousands of years is now a fringe culture. This has to be addressed and humanity must once again reintegrate into its environment as part of a whole.Incredible movie, must see for everyone concerned with our current direction. Thank you Peter Joseph."}, {"id": 133, "text": "I had been waiting for several years for this movie to come out, so was extremely nervous (and excited) about what Peter's latest movie would be like and whether it would meet my high expectations. The film contained 3 narratives: the first following a bewillered lady (called Number 23) in a dystopian view of today's materialistic, ego-centric, hyper-competititive society. The second narrative was set in the near future, approximately 4 decades from now there is a struggle between activists verus the defenders of the ruling establishment. The third narrative was set in the more distant future (100+ years) which told the story our species' evolution and provided the most fact-based retrospective commentary of our current consumption-driven economic system, essentially providing viewers with a summary of the concepts described in Peter's book, The New Human Rights Movement. I felt the movie successfully delivered in providing its viewers with a realistic (although somewhat pessimistic) view of today's society, in particular our misaligned, divisive values and the systems (e.g. advertising) that continually reinforce these values in our culture. I particularly enjoyed the storyline between the activists and the establishment but I felt this could have included a little more action and slightly less dialogue. Eventually the movie merged the 3 narratives (or at least the characters of these narratives) in the Great Debate, but i found this scene to be a little confusing. One of the major highlights of the movie for me included the frequent symbolism in the movies (such as the crashing train analagy), i.e. the movie allowed some points to be shown using symbols and metaphor rather than spoonfeeding us every detail. There was also some humour in the film (such as this is apple juice) but I was pleased this wasn't overdone, which could have detracted from the serious messages this film is trying to convey. My absolute favourite part of the movie was the final 10 minutes - what a beautiful and inspiring vision! Peter's greatest strength as a film-maker is explaining complex concepts (such as relative poverty, the pepertual-debt-based money system, the scarcity vs infinite consumption paradox, the economic roots of oppresion / slavery, etc) in a very simple, easy to digest manner. He covers a LOT of points here, but i feel it's a good balance between explaining concepts explicitly and illustrating them symbolically. Overall, i really loved the film and it definitely met &amp; even exceeeded my expectations. Along with Peter's other works, I would definitely recommend this film to anybody, particularly if you don't mind being intellectually challenged and are open-minded enough to seeing the world through a different lense."}, {"id": 134, "text": "There are parts of this movie that I did enjoy, and parts of the cinematography that really captured me, but unfortunately (just like many movies and real life fantasists) this movie missed the most important part of the conversation.This film is trying to convince us that a different way of living together is possible, for which I agree.The problem that I have is this film spends one half criticising the world we live in now, and then almost immediately flips to describing a world which is better in every way.But the only real conversation that we should be having is How do we get there from here?.This is the fundamental argument which has floored philosophers and academics for centuries, so I don't blame this film for not clearly outlining it..But I'm just tired of wishful thinking and dreams of a better tomorrow wrapped up in some fancy words, long monologues and black and white cinematography.This is just another film that tries to say it's so easy to change and be better, whilst being completely unable to describe how to change to something better, and therefore in my eyes comes off just as vague and superficial as the society it was made to criticise."}, {"id": 135, "text": "Genius way to beam the zeitgeist message out and get Our species into a new paradigm . We are coming full circle, We are breaking free of the lies perpetuated for so long. Learning about ancient technology and civilizations and our REAL human history and its relationship to earth and the galaxies is being revealed ! Hopefully this Film (InterReflections) breaks through the many barriers of cognitive dissonance humans have accumulated with their egocentric selfish taught ways and we can get some of these system changes underway ASAP ! Start with abolishing wall street, shut down the stock market, End the fed, close the IRS, All debts get reset. and do a complete overhaul of old resource energy into all renewable free energy. No more chemicals in food and water., no more big pharm, but a return to holistic plant medicines. Then We deal with All the wealthy billionaires and trillionares, including corrupt gov officials, They now go under supreme jury by the people to weed out any, and all syndicate crime families. including child trafficking, lobbying, manipulating policies and any evidence of system manipulations of extortion, including any and all crimes against humanity up into this point will be served justice. A new clean renewable functioning system where We humans are ALL ONE and Live AS ONE with Nature, habitat animals, eco system and OUR PLANET. A MUCH BETTER FUTURE !!"}, {"id": 136, "text": "As a fan of Peter Joseph's previous work, this just feels redundant and also unfocused.I don't see the point of this film. Really. Any of the Zeitgeist films already presented the same themes, with a better narrative and way better interviews without forcing actors to a script.And also there was no need at all for a sci-fi / fantasy / futuristic mockumentary. Which as a concept, looks cool, but it was extremely bad executed.The over use of green screen, and long and dragging surreal dramatic scenes... It all felt cheap and just hard to watch.I appreciate the effort of trying to make a grandiose art piece, but it was completely pointless in the end. I don't see this film getting good reviews anywhere, not even from hardcore Zeitgeist fans. Its length and extremely slow pacing won't help to engage viewers either.We'll keep recommending The Zeitgeist Trilogy, though."}, {"id": 137, "text": "This movie is more than that, it is a hypothesis of what human society can be, just by applying a change in the system.From the perspective of cinematographic art, it is a hybrid between documentary and normal film, only that the documentary parts are also fictional, with future academics explaining the root cause of humanity's problems, and how they were fixed with a systematical change. THE GREAT TRANSITION.Is the first of its kind (or one of them).The society live in a kind of matrix, and the movie stimulate to the public to get out of this psychological matrix.P.D.: Sorry for my bad english, but i sure that you understand the idea that i expressed."}, {"id": 138, "text": "This movie is grand... Why? Because it takes the innovative step needed to target the current abomination that is human society. It is a small but malevolent group of people, pulling the strings that control all of us, and anyone who speaks against it, becomes the target of this group. But now, in 2020, when this group has influenced so many over the years (by creating social discord through media, thereby allowing people to do their bidding and fight one another) we the 99.99% are waking in the millions to the deceit and propaganda.I first discovered Peter Joseph's work some years ago and quickly absorbed all the Zeitgeist films. It was the first time I'd seen, on screen, someone talking about subjects that others felt were too taboo to mention or too strange to consider. I remember that Einstein often got the same feedback, as well as Tesla and many others who developed works that seemed on the edge of simple understanding.A lot of people who don't like to think very much won't get his films. Which, unfortunately, is pretty sad and makes sense as to why the topic of the film hits home for those like myself. In a way, their dissent of the films are self-fulfilling prophecies.However, the one thing I do love about this latest film is that it pokes fun of itself, often commenting on what the non-target audience member may be saying to themselves. And in the words of many famous folks, if you can simply explain something then you completely understand it. Some of the scenes do just that. Others, however, take a deeper level of introspection."}, {"id": 139, "text": "Peter Joseph changed my life with the Zeitgeist movies. Since I have been a long time fan of Zeitgeist, I can't say I learned a lot of new things from this movie. However, that doesn't matter. The delivery was nothing short of masterful. Peter has been working very hard on this movie and it did not disappoint. My husband and I rented it from Prime video but we are going to buy it. It's not something we can just watch once. It's a lot to absorb. I have recommended the Zeitgeist movies to many in the past and still do. I will now start recommending this movie. I think it's easier to digest for most people versus something like Zeitgeist. Although, I still think those who are not already heading down this path may have a difficult time with it but it was in perfect Peter style and I loved it. There were several laugh out loud parts for me, too. Very entertaining but also spot on with conveying the message about how ridiculous and unnecessarily violent our system is. I especially loved the view into the woman's life that was an abstract way to see reality. It had me laughing at the ridiculous clown world she experienced because that's literally what I feel real life is like. The Great Debate was so beautiful and eloquent, it also hit me in the feels. I thought there was going to be an epic rap battle between John and Simon at one point. There were also other songs in it and oh man...I need the soundtrack. It was an epic movie. Watch it."}, {"id": 140, "text": "This film is a much needed gust of wind in sails of in the structuralist movementTotally impressed by Peter's ability to translate the book 'The New Human Rights Movement', written in academic form, into a lucid, visually stimulating, artistic expression.Much like the book, the film is based on science and gets down to the core of the many flaws and potential solutions of our socioeconomic system yet somehow the film and book are like night and day - in a good way!!I think we can all identify with the character 23 as she seemingly sleepwalks through life as society pushes and pulls her in a million different directions.The music and the green screen effects added a unique and interesting element and the actors were so convincing that my sister (who doesn't follow this type of work yet was very engaged throughout the film) really believed that the folks in the interview scenes were professors and experts."}, {"id": 141, "text": "The film very successfully paints a very well grounded and very bleak picture of capitalism. It induces brain activity, Where it fails, is to realise that the utopian model it presented will never be attainable.Human race was not ready for communism in Soviet era, it is not ready for it now nor will it ever be, unless that communism comes again in some form of brain-washed tyranny.People will never be equally successful given the same conditions, and the more successful ones will thrive and pull away, while the less successful ones will either strive and work harder in order to succeed, or descend into depression. This is the backbone of any progress, and any society without it will drown in apathy.Not to mention that the age of the AI is just around the corner, and this film is still very human-centric."}, {"id": 142, "text": "I really wanted to enjoy this film, however, I'm not sure if the current political climate with the issues around the Woke, PC, Cancel Culture has had an effect on my perspective?Currently, anything I watch that indicates Humans need a behavioural and morality change in society reminds me of the issues we all experience here &amp; now and, the in your face anger and violence that comes with it.I feel this is made solely to pressure people into behaving in a way others deem correct and although I can agree we all need to think of the consequences that our actions and relationships with the animal world and each other bring,... I find myself rejecting the underlining message and a need to rebel against this form of messaging, not just with this film but with the whole Woke, PC, Cancel culture forms of activism of the 21st Century!"}, {"id": 143, "text": "10/10 for the message &amp; the incredibly well thought out analysis of current and past situations.This film encapsulates perfectly so many thoughts and feelings I think we all share, but pieces it together in a very intelligent and coherent way. A comprehensive and holistic exploration of why we NEED change. It moved me to tears at points, both from the despair of how sad our situation is, and from a feeling of sheer inspiration, from allowing myself to believe that we can change, and that we as a race can evolve beyond this point, and live in a way that expresses our most beautiful qualities: empathy, love, cooperation, intelligence, community, harmony.The film didn't feel that smooth at all points, you have be forgiving of a couple drawn out scenes that seem a bit out of context, and of the narrative side of it, which wasn't pulled off as well as it could have been (in my honest opinion).But really despite some of these flaws it was still one of the best films I have ever seen. Considering Peter was trying to pull of a crazily ambitious and completely new concept here - fusing visionary ideas and intense analysis of our global socioeconomic system with arty and more traditionally entertaining forms of film, I think he did an amazing job.Highly recommend watching it!"}, {"id": 144, "text": "Peter Joseph has a clear vision of what humanity's true purpose should be. He is a self-taught visionary of our time with great clarity in the work he does. Some might find the idea of his work as a fictional based utopia but his many global supporters can see his vision of a better world as logical and realistic and are able to by-pass all the clutter and noise. If his ideology is classified as fairy tales by monetary visionaries, it is only because they fear his ideas will only continue to expand to a greater audience.In the end, we have been programmed to be purchasers within a system of waste. People don't need to keep buying Crap. People need to be allowed to explore there true passions and if you look at the current state of society, many people are struggling to make ends meet in order to survive for basic necessities. Necessities that should be a human right. If our society is to ever evolve into a more caring and compassionate society, where human welfare and environmental respect are treated as the true purpose of our existence, then monetary values need not Trump change. If the technology is present to find solutions, full application of its use should be applied as a basic law for the greater good of humanity and society. Imagine a family being told they have a cure for their cancer, but because of man-made monetary ideologies, they cannot receive the treatment to continue to live. Imagine!This is the true essence of Peter's messaging. If we have solutions they should be applied without monetary implications. Healthcare should be free for all. Education should be available to all. Food supply can be localized and distributed more equally. If these various necessities do not improve, we will have a society that continues to cycle through its revolving doors of poverty and crime without connecting the dots that all these issues are related.Great work by Peter as always and this film and his lectures should be reviewed by all who care for a better society. Solutions are better then endless stalemates."}, {"id": 145, "text": "It's not subtle, in fact it's naive at times but this cautionary and unique vision of a possible future is enthralling throughout. I initially planned to break up the near 3 hour run time in to 2 or 3 chunks but once I turned it on I was intrigued and fascinated enough to watch it in one go....I've watched programmes of an hour that feel longer! At its heart is the story of the unsustainable way much of our society currently lives... with particular focus on the not so shining light of the capitalist/consumerist world, the USA and its numerous problems. It gives an intelligent, thought-provoking and inciteful view of all that's wrong with our power/greed/money worshipping culture and offers a possible alternative to this way of life.It plays out as a sci-fi feature of sorts, using actors, scenes and different metaphors to highlight the movies point. At no point are the audience treated as fools and the different genres and mood changes broke up the lecture heavy moments to create a truly memorable experience. My hope is that in watching this movie, some people may decide they aren't willing to put up with the unsustainable damage we are inflicting on ourselves and our ecosystem in this version of society but will instead look for new ways of thinking and feeling to find a balance greatly needed in these most troubled of times. Even if you are a determined consumerist, this movie is well worth a watch to see things from another point of view. 9/10"}, {"id": 146, "text": "Interreflections looks at the world transition to post-scarcity/type 1 civilization from three periods within the same timeline. From having gone through it and retrospectively analyzing it, to the pivotal moment that triggered the shift or awakening, and the now where we in the present face the daunting task of figuring out life in this world, dealing with the pain and dissonance of knowing the brutal truth that is in our hands to avoid ecological, social or economic collapse and head instead for true sustainability and peace. The so-called train on a track that is broken ahead, foe which people are not oblivious to but because of the driving forces of our social and economic system compels everyone to keep shovelling coal in to go faster and faster.... to our end. This is not a roadmap, the video is not to be analyzed for accuracy or correctness, it is a thought-provoking art piece. The what, where, how is still up for debate. We know that the root cause of social aberrations, ecological decline and most suffering is the current monetary socioeconomic system. What comes next is up to us."}], "reviews_amount": 147}