{"name": "The Secret Garden", "titleId": "tt02702920", "reviews": [{"id": 0, "text": "I am a huge fan and frequent re-reader of the original Secret Garden book by Frances Hodgson Burnett. As an adult, I appreciate it for its deep understanding of what children need to grow and thrive; as a child, I loved the main characters - three children who often acted as better role models than the actual adults in the book.One of the book's greatest strengths is the way it empowers children by showing them that with steady hard work, attention and care for one another, they can make magic - they can revive a dying garden, heal physical and emotional wounds and move those around them to be better versions of themselves. This powerful, timeless message is all but fully lost in this movie rendition.Instead, we see a breakneck race to the 90-min finish line that leaves us with sad, disjointed pieces of the character arcs that Burnett so carefully develops in the book. Mary's gradual transformation from a sullen, quiet, spoiled brat to a happy, caring child with a purpose, is turned into bouts of explosive defiance and arrogant saviour behaviour. While she saves her cousin and uncle from certain death, she largely remains a rash, arrogant, occasionally reckless pre-teen. Similarly, we never get to see Colin grow into the curious, energetic and charismatic young man that we see at the end of the book. And, perhaps most disappointingly, we never see the children transform the garden and themselves with their own care and effort. Instead, we witness tacky, unexplained CGI magic that the children passively consume, that has a life of its own and serves as a quick fix for all ailments physical and emotional. This magical solution robs the children of agency and destroys the original message of empowerment.The main redemption for the rushed and incomplete character development comes in the story of Mary and Colin's mothers. As Mary reveals the missing pieces, she comes to realise that her mother did love her, but that love was buried under a complex mental illness. (This is a definite improvement over the book, where Mary's mother is shown as a selfish socialite whom Mary is only happy to resemble in looks.) This plotline is handled with a gentleness that makes for ever so stark a contrast with the parallel thread of Colin overcoming his disability and fear, which falls prey to reckless saviour behaviour. We repeatedly see the children force Colin into overly stimulating activities without his consent, all because they believe that this will heal him and are spurred on by Mary's imminent departure to school - a made-up plot point that only adds artificial urgency and further discredits what should have been a gradual process of earning Colin's trust and sparking his curiosity to visit the garden, a process we see in the book.In an age of climate change, pandemics, and other issues beyond individual control, teaching children to look for quick external fixes instead of working hard together for positive change, does them a great disservice. Similarly, in an age where we strive to better understand and cultivate mental health, to seek consent and respect boundaries, implying that it's okay to force your good intentions on people with problems without doing the work to convince them first, is dangerous and self-serving. I would expect more from a movie released in 2020, even as this year has been a disappointment on almost every count so far."}, {"id": 1, "text": "I've seen every version that has been made of this lovely novel and they all have added their own twists but, this adaptation made me cringe. The actors did the best they could with what was given them. I'm thoroughly disappointed with this movie. They took a childhood favorite and made it into a weird underwhelming Disney movie. I truly wanted to like this. I can't say I do."}, {"id": 2, "text": "Cramped with CGI, average acting wooden dialogue. The movie completely ignores the essence of the novel."}, {"id": 3, "text": "This was our pick for family movie night tonight. Growing up with the 1993 version I was excited to see a fresh new take on this tale...I was sorely disappointed. My 4&amp;6 year old found it too upsetting and scary and I found it boring af. If I could give it zero stars I would. less than zero actually. complete garbage"}, {"id": 4, "text": "What was the point of this film? Boring with an irritating girl acting the lead role. Flat dialogue and stiff acting.The only beauty is the scenery.A slow start, an even slower stretch to the end makes this awesome novel re-make film, fall flat on its face. I guess the secret here is to keep this trash a big secret to prevent anyone else from having to endure this nonsense.A very big non-secrecy 3 out of 10 stars. The 3 stars are for the dog, the bird and the garden. Pfffft!"}, {"id": 5, "text": "Going by the trailer, this is VERY loosely based on the book. I had recommended it to my granddaughter, but I think I'll just suggest she reads the book. I can never understand why movie producers choose to take a wonderful book, then change practically everything about it! Why not just invent a completely new original screenplay, if they think their version is so much better than the book?"}, {"id": 6, "text": "I don't see the point of this movie. It really misses the magic of the 1993 movie completly. Partly because of poor casting. But mostly because it lacks a beautifull soundtrack that can captivate. I recomend watching its predecessor.The CGI was allright but that doesn't make a movie."}, {"id": 7, "text": "Greetings again from the darkness. In the years since Frances Hodgson Burnett's novel was first published in 1911, The Secret Garden has become one of the most popular and oft-read children's books. Previous film adaptations include the 1949 version with Margaret O'Brien and Dean Stockwell, and the 1993 version with Kate Maberly and Maggie Smith. Additionally, the novel has been adapted numerous times for the stage and television. Director Marc Munden is working with the screenplay adapted by Jack Thorne (WONDER, 2017), and the two had previously collaborated on the BBC series National Treasure. Readers of the beloved novel will certainly recognize the changes and differences within this version, both in characters and theme.As the film begins, we are told it's the eve of Partition, which was the 1947 division of British India into two separate states: India and Pakistan. This timing is, of course, quite a bit later than Ms. Burnett's setting, but the effect is the same - young Mary Lennox (Dixie Egerickx) is orphaned when her parents die, and left alone when the servants desert her. She is shipped off to live with an uncle (Oscar winner Colin Firth) she doesn't know. Accompanied to massive Misselthwaite Manor by the housekeeper, Mrs. Medlock (Julie Walters), Mary quickly understands that Uncle Archibald Craven is a grieving widow (his wife was Mary's mother's sister) who is not to be disturbed, and his hunchback is not to be stared upon. Mary soon learns that her spoiled brat manner will not be tolerated, though her natural spunk will prove advantageous. The young girl is one who is accustomed to be waited on, while also wanting to prove her independence.Mary's imagination is extraordinary and she often asks, Do you want to hear a story? CGI effects allow us to see what she has envisioned, whether it's the wallpaper coming to life, or her mother and aunt frolicking through the halls or swinging in the garden. Mary soon befriends Martha the maid (Isis Davis), and then happens upon Jemima the dog while wandering the estate grounds. It's here where the fantastical and supernatural meet reality, and a helpful Robin leads Mary to the key that unlocks the gates of the gardens that have been locked away since Uncle's wife died. Mary and her new friend Dickon (Amir Wilson) go on adventures through the garden - a garden which has mystical powers.One evening Mary hears cries echoing in the halls of Misselthwaite. Despite being forbidden from exploring, she discovers her cousin Colin (Edan Hayhurst) locked away in a far off bedroom. Colin is a sickly child, supposedly stricken with a spinal problem that keeps him from going outside. Mary continues to visit Colin, and soon she and Dickon are sneaking Colin into the secret garden, where the magical healing powers begin to take hold. The titular garden doesn't make an appearance until about one hour in, but its beauty and wonder are on full display.This is a story about the power of loss and grief and depression, and it offers the life lesson that the things we care for blossom and grow and thrive. This version has some elements of such classics as Peter Pan and The Chronicles of Narnia in that fantasy and magic play a much larger role than in the novel. Director Munden employs a darker approach and seems to emphasize self-discovery. Young actress Dixie Egerickx was a standout in the recently watched SUMMERLAND, and she is terrific here - despite the changes to the story that some fans might not embrace. The film seems a bit disjointed at times, but it's always a feast for the eyes, and offers up one of the year's best scores, courtesy of Oscar winner Dario Marianelli (ATONEMENT, 2007)."}, {"id": 8, "text": "It seems roughly every 7 years someone makes another adaptation, this is still a fine movie but how many more versions do we need, get a life. Are all the writers, producers and directors of today braindead unimaginative slugs without any new Ideas that they have to constantly remake already well known popular films. Time for a new generation of creative, imaginative and original movie makers to arise and take over ."}, {"id": 9, "text": "Not much happens in the film, and the characters are rather flat and dull. The colour scheme is beautiful, but it doesn't save the film from being a bore. I'm not the target demographic, so I thought it was pretty but boring."}, {"id": 10, "text": "I nearly didn't watch it because of the awful reviews on this site. Im glad I have learned to use my own discrepancy . I've seen all the original films and read the book. So I had an idea what to expect. I wanted a bit of fantasy and escapism. The Secret garden is comforting and familiar territory . Beautiful scenery, good acting nice familiar storyline. it was exactly what I needed during this miserable Covid-19 time. Please ignore the ridiculously negative reviews and snuggle down and with it for yourself."}, {"id": 11, "text": "I'm 27 and adored the 1993 version but this just felt like the poor people's version. The script was pretty bad, the acting wasn't great and it was full of CGI. I recommend you check out the 1993 version if you haven't as it's far superior."}, {"id": 12, "text": "I don't know where scores of 1 come from! This is an enchantingly enjoyable film!"}, {"id": 13, "text": "I love this story and was eager to see this new version. I like the actors Firth and Walters and the artwork I saw was bright and pretty, so I was happy to buy the video, certain I'd want to watch it more than once. How wrong I was. How many things can one screenwriter screw up in adapting a book to a film? I think Rule 1 should be don't change major plot points but plot points were thrown out willy nilly, without regard to the generations of people who have loved this story for over 100 years. Certainly a new film can have its own POV, but this telling acts as a thief - stealing the best parts and creating the rest wholesale. Not to spoil it, but .... they added a dog. No dog in the original, but there's a whole plot line in this one concerning a dog. They changed the time period. They changed how characters feel about other characters. (Sacrilege) They misunderstood the garden. They destroyed the house, they characterized the house - which if you know the book or have seen any of the many previous tellings, you know is just wrong. It's unneccessary. That is what is so upsetting about the changes. They had a sure bet and said no, we have the power and mucked it up royally. Save yourself the heartache and watch other versions. ANY other version will be better than this one."}, {"id": 14, "text": "If you are going to make another version of a classic book and change it then try and do something that adds to it, this very bad version takes away everything that the book and the nineties version has and replaces it with nothing. there is virtually no change in mary and colin who are always petulant and objectionable, instead of the gradual change in them and the garden we get these sudden bursts of cgi transforning the environment for no reason, the writing was really bad, the direction even worse, the film just plodded on wasting time just following people walking down corridors not doing anything, i see the writer also adapted his dark materials another boring adaptation, this is one to avoid"}, {"id": 15, "text": "The cinematography is excellent.. Their acting wasn't lazy. Most of them had soul and believable. Better than the 2017 version, not better than the 1993 / 1975 version -btw, the animated version was also good tho. For fans of fantasy/adventure , give this a watch.👍"}, {"id": 16, "text": "What on earth gave anyone the idea that the original needed a remake? The Secret Garden stands the test of time like few others do. It still looks better than this remake, by every standard. This almost feels like an insult. No motives other than greed could be imagined in this case."}, {"id": 17, "text": "The book belongs among the big classics, an easy read and hard to put away as soon as you open it up. It's a very calm and soothing tale that cures the reader just as much as the characters in the book, or at least that's how I felt when I read it.As for the film it was inevitable for it to follow the book, because that's not how film productions works these days, for the filmmakers, they obviously wants as many as possible to see the film and for that to happen they have to grab their attention somehow, in this case with a three-act structure where there's a very dramatic end and also a lot more stakes with Mary having to leave the place because of misbehaviour. Oh, and then there's the actual garden that now seems to be magical and alive, branches helping Mary when she's climbing over the wall and also healing powers that cures the dog as well as Colin. I can see how that would anger fans of the book, because it's quite obviously not what the author had in mind with the garden but more like Colin being delusional, staying locked in his room all the time, believing that he was ill and not getting any fresh air.So, having that said, the film should be seen for what it is and not what it could've been. It's really a visual film, the shots of Mary coming to her new room in her uncle's Manor, the long corridors that she explores and also the scenes on the moor, the film really made sure to be beautiful, which it is. As for the garden I was a bit taken away from the experience because of the enhanced plants and oversaturated colors, it didn't bother me too much and it also made sense when the filmmakers decided to make the garden magic instead of just secret.I also love the soundtrack to this film. I've heard some composers saying that the best soundtrack is the one you don't notice in a film, but I don't agree, when a soundtrack is that good so you want to know who composed it and where to get it, that's when a soundtrack has done something special to me. I'm going to check up on Dario Marianelli's previous works.I had no problem with the cast either, the children did a good job and Colin Firth is always good, whatever he does. There were times I was thinking that some of it worked better in the book than the film, but that's the curse of knowing the story it's based on.To sum it all up, it's an okay adaptation with a couple of changes to make it more dramatic and with more fantastical visuals. It would've made more sense to call it The Magic Garden, but that's not how it works in the film industry when you adapt a book to a film."}, {"id": 18, "text": "I really liked it, the idea of how the loss of someone very important can make you sick, the sadness and grief can turn you into another person, the artistic section is great, the performances were not very good"}, {"id": 19, "text": "I still remember being a little girl and seeing my dad building my first bookshelf in my room and my mom putting my first book onto the bookshelf. Not knowing that the book was going to change my life, I read a book about loss and tragedy, but also about life and innocence. It was the first time I learned about the moral of the book, which was that a child's love and kindness can heal the emotional scars of their parents. I remember reading this book over and over again because it was so beautiful. As it was the first book I had ever read in my entire life, I would probably remember it for the rest of my life. I cried throughout the film, thinking about the first time I ever opened this book. I kept this book so close to my heart because it is about rejuvenation and healing. There's so many beautiful metaphors and symbolism in it; I remember that the children saved the secret garden, and in return the garden saved them. The grief and loss and despair of parents was something I didn't understand as a child, but I understood much later how important it is that even a child can teach an adult many lessons. At the end of the film, the father said: How is it that we are taught by our children? I thought this line was the most powerful one because he had made so many mistakes in his life, but his son taught him to forgive and think about life and how beautiful life can be, like the secret garden. Anyways, I prefer the book much more than the film, but I'm so grateful that this was the first book I ever owned and read"}, {"id": 20, "text": "I grew up with the book and older versions of this movie which were much better, by far. This version is very loosely based on the book and unfortunately, loses most of the magic along the way. The story feels as big and empty as the house these poor characters are rambling around in and it leaves a lot to be desired. I liked all of the actors, but it is a shame they did not have a better script to work with (did Colin Firth say more than two words in the entire film?) The garden is a huge disappointment. It doesn't resemble an English garden in the least and certainly does not resemble the garden depicted in the book. It feels like a vast wilderness that just happens to have a wall around it...kind of like the U.S./Mexico border does now, I guess. The so-called magic, otherwise known as CGI is tacky. It takes what was originally supposed to be a beautiful, mysterious place and makes it look silly and fake. I am also disappointed that the children never once work together to improve the garden as they do in the book. Even the poor dog has to wait until the next day to get help for its injured paw while Mary goes exploring. The fire scene is also completely ridiculous and made me cringe more than once. I give this movie a 5 out of 10 stars because it is not terrible, but it does not convey the true magic of the original story."}, {"id": 21, "text": "This is of course a remake of a film which has unfortunately been remade before and if you have seen the previous films this one will not seem as good but it is a good film in its own right. The characters and storyline vary a little, but the young actors and actress do bring their own style and life to their characters. Well worth a watch on a rainy day."}, {"id": 22, "text": "But a story that requires some effort from the viewer. Audience fom 10 years onwards."}, {"id": 23, "text": "This film is truly a work of art. I don't remember ever having seen an almost flawless blending of CGI magic with real world cinematography. The integration of computer animation is significantly above average; it's extraordinary. The people who worked on the post production truly showed the love for their craft. I think this film just set a new benchmark.I wished the characters were a bit warmer and lovable. I just didn't dig the aristocratic stiff coldness in the children. If I could give the production quality a separate score, it would be a perfect 10. But if the kids were more lovable than bratty, I would have given the film a perfect 10/10. Nevertheless, I liked the film."}, {"id": 24, "text": "I've seen many forms of this story: movies snd plays (musicals). This is produced by David Heyman of Harry Potter fame. It doesn't follow all the others but instead shows us a magical place that heals body and soul.Don't miss this one."}, {"id": 25, "text": "Like te remake of this Classic tale. I feel the same unimaginative comments of reviewers belly aching the remake point. WHY can't they improve on their lives. and accept the fact, people like to see other actors portray the characters of this wonderful tale. so instead of moaning .... get a life yourselves you unimaginative slugs and cherish the fact other film makers are keeping it alive for a tofays audience. not a live in the past reviewer, whom thinks they are the bees knees when they critique a film. I for one love all the versions. they have their own charm and take on a classic tale. now goodnight petit pois. and may your pods keep you safe. ;)"}, {"id": 26, "text": "Having never read the book, or watched an earlier version I had no idea what to expect. This was probably a good thing, as I could enjoy the movie for what it was.It was very different from what I had expected. Slow and atmospheric it follows the gradual healing of a deeply damaged family.My only reservations are around its target audience. It's too dark and complex to be a good kids or family movie, too slow to appeal to teenagers and too different from the original for those who love the book and earlier adaptions."}, {"id": 27, "text": "Ya know... my missus had it on, I went to the reviews... hesitated from going into another room. Watched the first part. Was drawn in.So, don't be in such a hurry with this movie. No, it is not great. Flawed for sure. But let the feeling seep in. The young girl's performance is top notch. And makes it work.Settle in, let it waft into your senses. I liked it. More than a little. Perhaps was my mood, or it put me into a hopeful mood. A bit of both."}, {"id": 28, "text": "A fresh, vibrant and heartfelt take on a classic, for the next generation (and above!)"}, {"id": 29, "text": "It was ok a bit slow but not as bad as a lot of the reviews will have you believe. I haven't read the book so I'm just juding it as a film and it's a fairly nice family film. Just give it a go if it looks like a rainy Sunday afternoon."}, {"id": 30, "text": "I watched the film before reading the many 'how profound am I' withering user reviews on here. I disagree with them all. This film is a new take on the original story with a sprinkle of Pan's Labyrinth imagined magic thrown in.I can only describe it as more of a fantasy version of the book with embellishment and exaggeration of the settings and characters. And a fine feelgood film is the result.With the multitude of weak rushed films being turned out these days it was a pleasure to watch one as beautiful and escapist as this. I liked it!"}, {"id": 31, "text": "I vaguely remembered this from being a child, needed something to cheer my Sunday so gave it a go. Really lovely film, the child actors were brilliant, the setting and photography and effects were a sheer pleasure to watch. Uplifting film, though if you don't have a tear in your eye at least once (happy tears) then you're cold. Great way to escape life watching this. Good for adults as well as children. Can't fault it."}, {"id": 32, "text": "If you need lots of stimulation from your movie, then this might not be your best bet. But there is a slow and sweet pace here that allows you to soak up its artistry. The kids are terrific actors, even though their characters are initially arrogant brats. The young lead actress is especially fine. The 1993 version is excellent, and this one is quite worthwhile viewing."}, {"id": 33, "text": "Am gonna be really honest here, its kinda boring you know like in the middle of the movie i want to turn it off but still I continue, I really want to appreciate the movie and yeah the original looks more goodz but I think the movie has it own beauty in it, I wanna give it a 5 but after I finish watching the movie, it's fine...boring but not that bad"}, {"id": 34, "text": "This film start with a girl Mary playing toys with the shadow, and both of her parents die scene! As turnout, this film is about Mary after become orphan, she move to live with her uncle Craven, and she discover a secret garden at her uncle house! Entire film full of boring conversation, and annoying overuse scene! Such as, overuse of the flashbacks scene, overuse of the imagination scene, overuse of the running scene, overuse of the walking scene, overuse of the chasing scene, and overuse of the searching things scene! Make the film unwatchable! Barely intense scene is, Mary saving her uncle out from their burning house! At the end, Craven delighted after knowing his son Colin can walk again! Colin jump into the lake swimming at the very end! That's it! Wasting time to watch!"}, {"id": 35, "text": "Boy, some of these reviewers need to go back to reviewing the Olive Garden Salad on Yelp.. The movie was WONDERFUL! Beautifully filmed with the perfect amount of CGI. And Colin Firth was predictably excellent! It would make a great film for a family night with a big bowl of popcorn."}, {"id": 36, "text": "I nearly didn't watch it because of the low reviews, but I'm so glad I did, it's absolutely wonderful."}, {"id": 37, "text": "This is one of the fantastic movie during this pandemic year. I recommend y'all to watch this movie"}, {"id": 38, "text": "This has to be the worst adaptation of a magical novel, although there are some good cgi shots. Poor use of excellent actors, Julie and Colin are not at their best in this. the whole story line is lost, vague at best. It's slow and doesn't do the book justice. Personally I think it's money wasted. The 1993 movie is vastly superior to this."}, {"id": 39, "text": "Rarely do I give such low ratings. You'll be underwhelmed by this adaptation if you've read the book. The 1993 version is so much better. This is a family movie but neither us adults or our kids enjoyed this. My ten year old who has just read the book said it missed the whole point of the book. If a ten year old can see this why can't the producers? No character development, no development of friendships and family, no natural beauty in the garden. Not sure what the point of this was or who it is aimed at."}, {"id": 40, "text": "I thoroughly enjoyed this adaptation. I really don't understand all the negative comments from other people. The CGI was absolutely beautiful and was blended so effectively with reality. I loved the acting, the children were great, Colin Firth and Julie Walters were predictably wonderful, giving the right amount of gravitas. The sets were so gorgeous, colour coordinated perfectly. The film married the idioms of loss, love, bereavement and the harm of keeping secrets from children. It was wonderful.. If you don't love it, you're a grouch!"}, {"id": 41, "text": "It's great to watch a fantasy film, not knowing where the plot leads, and at the same time knowing that there is a magical garden on the horizon, and experiencing the story through the eyes of each character, the messages it conveys and through its development. My favorite character is Colin, because he is the main protagonist who manages to overcome the biggest obstacle in the film. There are 3 things that could have made this film perfect in its genre: 1. Longer screen time in The Secret Garden. 2. More CGI like the bird for example, maybe animals of all kinds. 3. More of the magical soundtrack in the film, where the dog and the kids run and play together."}, {"id": 42, "text": "You know what a pandemic needs? A movie about a magical hidden garden to make us forget about the real world for 99 minutes. Enter the latest version of The Secret Garden, I've loved all of the other versions and stage productions, so add this one to that list. The story is eternal based on Frances Hodgson Burnett's novel. Dixie Egerickx is a stand out performer as the orphaned girl who moves to her strict Uncle's rambling English estate, after tragedy and cholera strikes her home in India. Just wait until she finds the beautiful dog mistakenly named, Jemima and the key that opens a secret gate. The wonderful Colin Firth plays her Uncle and has now appeared in the last two versions in different roles. Julie Walters plays Mrs Medlock the house keeper for this spooky mansion on the misty Moores. The house itself is a character with so many secrets and hidden doors. Marc Munden has done a superb job directing this gem."}, {"id": 43, "text": "Loved these young new actors, and the beautiful scenery, with a engaging storyline. Lots of intriguing new twists."}, {"id": 44, "text": "My memories of the 1993 version of The Secret Garden are ones of boredom and finding the protagonist annoying so this pleasantly surprised me. The moving of the setting to the 1940s made the film much more interesting to me and added another layer of depth. To me, the house represented the stoicism of the 1940s to show no emotion, at the detriment of father and son. The house is old, established, but falling apart and no longer fit for purpose. The garden represents the femininity that has been missing from their lives - the mother's touch, the thing that gives life. When the house burns, so does the stoicism keeping father and son apart, as well as all of the dark fears Colin Firth has for his son (which I interpreted as Munchausens by proxy). A garden isn't going to cure disability and it's harmful to suggest that it will, so I actually love this interpretation."}, {"id": 45, "text": "What was the point of this film? Boring with an irritating girl acting the lead role. Flat dialogue and stiff acting. I didn't understand the plot of the movies, the storyline of the movie. It makes me feel dizzy to watch.The only beauty is the scenery. Yeah only that.A slow start, an even slower stretch to the end makes this awesome novel re-make film, fall flat on its face. I guess the secret here is to keep this trash a big secret to prevent anyone else from having to endure this nonsense.A very big non-secrecy 2 out of 10 stars. The 2 stars are for the dog, and the garden. Pfffft!"}, {"id": 46, "text": "I was unsure what to expect when I saw this on the TV yesterday. On the one hand, the trailers looked good; on the other, the user reviews on here were very negative. I can see why. Firstly the positives; visually stunning, the riot of rich colours in the garden and in the deceased mother's room are a vivid contrast to the unrelenting drabness of everything else. I'm sure that this is quite deliberate; that the garden gives life and hope whilst Mr Craven's dispair sucks morale out of everything it touches. I thought that the cast did well with the material that they had to work with. The bickering between Mary and Colin was particularly convincing. The negatives: why did they decide to relocate it to 1947? Outside of it's Edwardian roots, the relationship between the Cravens and their staff looks very anachronistic. By 1947 domestic staff were finding that they had other options in life and would not have to put up with such treatment. Also, if you have moved the action to the 1940's why is Mary dressed as an Edwardian? Children did not dress like that in the 1940's. What happened to Ben Weatherstaff? Why burn down the house? The departures from the source material seem unnecessary. That having been said, if you have never read the book or seen the superior 1993 film then there is a lot to enjoy here. The idea of finding hope and life in a garden will speak to all of us after so many months in various levels of lock-down. It's very different, but I enjoyed it."}, {"id": 47, "text": "Yes it's not. The dialogues, tone, etc..it's so wrong. Child don't talk like that. This movie is for adult."}, {"id": 48, "text": "I am probably biased but this movie was made with care and love..I see reviews from people who bemoan the making of another version..But it was not made for them, they had their own which they obviously remember dearly...this is for a new generation...it's a wonderful story that fascinates and hopefully they will remember it as part of their childhood.."}, {"id": 49, "text": "Jesus, I hated this movie. Not only was it boring as heck, but they also screwed up the story. The spoilt little brat never changed. She was the most horrible character I've ever seen.The movie wasn't even that pretty"}, {"id": 50, "text": "Recently orphaned Mary is sent from a life of bossy luxury to live at the decrepit stately home of a never-seen uncle who she didn't know she had. There are secrets in the household, and secrets in the grounds, and Mary gradually begins tomdiscover them. They are, for the most part, not happy secrets.I have not read the novel and, although I saw the 1993 film and, perhaps, one of the BBC serialisations, that has largely escaped my memory. Accordingly, I am not making comparisons, I am considering the film entirely on its own.It is a story about loss and grief, friendship and hope, healing and redemption, set in a mixture of gloomy reality and highly coloured fantasy, with just a hint of ghost storybsprinkled on top. The performers all play well, the film is handsomely mounted, and the story resolves satisfactorily if a little peremptorily.The colourblind casting of Dickon and Martha didn't worry me, although I felt it was probably a little unlikely. And there was a distinct element of And then they were free to the ending.But, overall, this was an agreeable film."}, {"id": 51, "text": "I have read and re-read the book over many years and I have seen many adaptations of it. This was by far the worst I have ever seen. The whole essence of the book was completely ignored/lost. It started off not too badly, although it was set in 1947 when the original was published in 1911 - but thereafter it deteriorated both quickly and badlyOdd scenes from the book were depicted - but mostly completely out of context so the viewer did not get a proper feel for what the writer of the book intended. There was no Ben Weatherstaff, Archibald Craven (Colin Firth) was at the manor all the time instead of being absent for most of it and it turned into a weird psychological Disney type movie with an ending that had (almost) nothing that was recognisable from the original story"}, {"id": 52, "text": "Mary's (Dixie Egerickx ) parents die while they are in India in 1947. She goes to live with an estranged uncle in a falling down estate on the Moors. She discovers she has a sick cousin and a secret garden that her mother and her aunt would visit. She has flashback memories.This is a pretty lame kids' story. Not as bad as BFG but close."}, {"id": 53, "text": "No resemblance to the book whatsoever. Bereft of feeling and emotion. Souless. No idea what the writers and producers were thinking. Utterly pointless movie"}, {"id": 54, "text": "This film is a car without wheels. It is a burger without the beef patty. A scotch egg without the egg. Need I say more..."}, {"id": 55, "text": "It's 1947 Indian. Mary Lennox is found alone in her home after the deaths of her parents. She's a prickly child. She's entitled and bitter after being orphaned. She is sent to her uncle Lord Archibald Craven (Colin Firth) in Misselthwaite Manor. He is also bitter after losing his wife who is the twin sister of Mary's mother. Mrs. Medlock (Julie Walters) is the stern head housekeeper. Mary finds her cousin Colin bedridden and bitter at the world. She befriends a dog which leads her to a secret magical garden.One has to enjoy the bitterness in order to feel for these characters. They are all suffering from various variety of depression. While I would change a few scenes, they are interesting characters. As for the garden, there is a bit too much CGI magic. It doesn't need so many birds and butterflies. They take the audience out of the place and the feeling when it is so obviously CGI. I do like the CGI plants but it needs to get rid of the birds."}, {"id": 56, "text": "Really enjoyed this film, don't listen to the bad reviews. Its not possible to give it a bad review. All actors were brilliant and the storyline is lovely. Will definitely be watching it again"}, {"id": 57, "text": "1993s movie was perfectly good , no need for this remake- its not good"}, {"id": 58, "text": "If you have read the book, then prepare to be disappointed This doesn't do the book justice at all. The deviation from the original story lost everything that was special about the book.If you haven't read the book then it's possible you may like this film, but if you are a fan of the book then avoid this film at all costs."}, {"id": 59, "text": "Well to start off the first half was boring as can be and the rest was just ok it will never compare to the 1993 version which is a 10/10. So if you've never seen the 1993 version watch that!"}, {"id": 60, "text": "This film didn't offer anything new or exciting for me as an adult viewer. It's the fifth feature adaptation of a classic children's novel by the same name and the whole project felt so redundant and pointless. Kids may like this (though I would show them the 1993 version myself), so it could be used as a family movie. Otherwise, it's not worth the time and money."}, {"id": 61, "text": "This movie's made me happy . It's got a nice charm to it and the graphics are amazing. Colin Firth, Julie Walters and the other actors did a great job as well. Aurora's song at the end credits deserves special mention because it made me cry. so much better than the original."}, {"id": 62, "text": "I am in love with the book and was so happy when I saw a new film had been made. Thought that modern technology would only add to the magic of this wonderful story. What a disappointment! The film only scratches the original script, taking out everything that makes the story so special and leaving it shallow and dull. Even the great Colin Firth and Julie Walters didn't have their usual sparkle. It is a mystery to me why someone would choose to do a re-make and then violating it in such a manner. I wish I could un-see this film."}, {"id": 63, "text": "Best thing was the dog and Julie Walters. Rest of it was soooooo boring"}, {"id": 64, "text": "It's incredibly inferior to previous adaptations of this story. Nothing new is added or explored, and the changes make this movie boring. It's pretty enough, and the acting is good, but every character is bland and forgettable. Even Colin Firth can't make this role good, he basically fades into the background and you forget he's even there. The cinematography is really weird and it's just not interesting. If you want a better version of this story, check out the 1993 version."}, {"id": 65, "text": "More like magical garden. Why did they have to remake this? This was terrible and it got worse as it went on... at some points I was just laughing out loud."}, {"id": 66, "text": "Why bother to produce a remake when the original from 1993 is a master piece on all aspects? That's is what I keept asking myself while watching this new version. This one is not bad produced (if you never watched other versions or read the book) but is way too slow. If you feel nostalgic or want to introduce this story to me audiences, I beg you: watch the 1993 version! It's way better."}, {"id": 67, "text": "Loved the book and have read a great many times. Unfirtunately, this film is nothing like the book. It is not set in the same time period, therefore making the characters wrong and the relationships between them wrong. This coupled with key characters missing from the film and a dog added. Lack of yorkshire accent and being pc doesnt work. The gardens are nothing like an estate garden should be nor is the house. Thus is unfortunately a very poor version and the story and characters have very little to do with the original book. If they had stuck to the book storyline much more and retained the characters and their personalities it could have been an amazing film."}, {"id": 68, "text": "If you've never read the book or seen the earlier films, you'll probably think, like my husband, that this is quite good. As someone else has said, why didn't they just make a completely different film instead of changing so much of the original story?"}, {"id": 69, "text": "So The Secret Garden is about rekindling hope and through hard work and connecting to one another we can overcome depression and sorrow and thrive, well atleast the original was. basically the gardens magic and is happy when your happy ta da.Also What Happens to the dog? it just disappear half way through"}, {"id": 70, "text": "Frances Hodgson Burnett's novel is charming. This movie is a bloated melodrama. 1. Just because you can use CGI doesn't mean you have to. 2. Who needs all the ancillary backstory(ies) that aren't in the novel, and serve no useful narrative purpose. 3. In this film, the secret garden - which is, in the novel, a secret garden - is about the size of the county of Cornwall in England, and full of all sorts of exotic plants that are not in the garden in the novel. In the novel, the children gain agency in their lives by learning to take care of the secret garden, and bring order into a place that has been abandoned and left to go wild (as, in some respects, two of the children have been left uncared-for) - this is sort of the whole point of the story. It would take an army of professional gardeners months if not years to maintain the garden in this film. Read the book, watch the earlier movie. Miss this one."}, {"id": 71, "text": "None of the characters are likeable - Martha instead of being loveable is as bossy and horrible as Mrs medlock. All the cute bunnies and deers are gone, you don't get drawn into it at all. I only gave it a 2 instead of a 1 because the garden is pretty"}, {"id": 72, "text": "Utter garbage. They completely butchered a beautiful, heart-warming story and replaced it with gothic nonsense. Watch the 1993 version instead, or better yet, read the book."}, {"id": 73, "text": "Un film fatto male. Lento. Brutto. Noioso. Scontato. Un disastro rispetto al libro da cui è tratto. Forse un grande budget buttato per un film mediocre."}, {"id": 74, "text": "A mixed up screenplay that ignores cholera at the start and then proceeds to ignore what the book is about Dixie carries the movie with other experienced actors rather sidelined. To be honest it's confusing make believe that says all will be well with no effort on your part. The Secret garden has become the Magic garden, and the film is a quaint cameo with some rather Victorian language in places.A CGI film without substance. Meh!"}, {"id": 75, "text": "So I just finished watching the film on Sky cinema and I did not like it.I remember reading The Secret Garden at school and thought it was a really nice story and a year later was introduced to the 1993 adaptation which is a classic and stayed true as possible to the book.Then we get this version and everything that was charming about the classic story and 1993 movie was crushed over... the characters were bland and the story was changed and rushed around in a terrible way (there was no fire in the book at the end- who's stupid idea was that!!!) Mary's actress was at best average but nothing compared to Kate Maberly. Medlock's personality was changed revoltingly I mean in the book she was wicked spiteful and at times I found her scary but here she's.. well a bit bossy and rude... yeah you see the downgrade, and Lord Craven is more the villain in this film- in the original he was a widower heavily distraught by the loss of his wife and the declining health of his son to the point where he was too scared to see him. But here he is angry, overprotective and cruel instead of Medlock and does absolutely nothing to help Colin and is mean to Mary- (he in the originally scolded Medlock for mistreating Mary at the end and now look what they've done with him).The only good things were the visuals and scenery (which where surprisingly beautiful), the storyline with the dog which was kinda cute and Colin Firth and Julie Walters despite having there characters portrayed wrong acted to the best to there abilities.Overall a 4/10 from me.. stick with the book and 1993 movie and when (or if you bother to watch) your finished with this Secret Garden lock it back and don't return to it."}, {"id": 76, "text": "It was said in Dreamfall:TLJ: Modern Hollywood produces only two kinds of movies: action visual spectacles and self absorbed dramas without substance. This is the latter. Is it beautiful? Sure. But it's still sad that this is the best the Hollywood has to offer. Watch some grey-and-white classic instead."}, {"id": 77, "text": "If The Secret Garden was a childhood classic for you, you won't be overly excited by this adaptation of the movie. There's really nothing different about it except different actors and one minor (and very unconvincing) variation to the plot towards the end. I took my 7yo niece and 10yo nephew along, and they found parts of the movie boring and hard to follow. The film has a lot of flash back scenes which confused the 7yo particularly. The topic of dead parents seem to be raised a lot unnecessarily throughout the movie which made it a bit more depressing than it could have been. Other adaptations of the movie focus more on the positive development of the children rather than the death of the parents. If you go into it with nothing to compare to, you might enjoy it a whole lot more. The group behind me in the cinema shed some years at the end, and my sister (who has not seen other versions) said she enjoyed it, but I was left feeling unsatisfied. I was expecting a modern twist to it but it just felt like a reenactment of the version I grew up with."}, {"id": 78, "text": "I was actually liking this movie, until every other scene looked like a weird hallucination that Mary had. It started to seem incredibly random. They took out all the novel's world-building &amp; replaced it with cgi. While beautiful, it wasn't very coherent. Changing the movie's timeline to the 40's didnt seem necessary other than being different to the other adaptations."}, {"id": 79, "text": "Right off the bat, some great pictures there. The CGI and the transitions to the flashbacks are so creative and organic, especially the one from the wallpaper to the pigeons, I was completely stunned.However, let me cut to the chase... What the actual hell is up with the story and the character development??? There is no character development at all frankly speaking. Everything just happens way too fast and if I haven't read the novel, I don't think I would have understood the story as much. The climax where the house got burnt down isn't strong enough at all despite the addition of the 'mum ghosts lead the main characters out of the fire' twist. There is no more 'Martha getting the jumping rope and encouraging Mary to go outside more' and 'Martha helps Mary to get better' any more; instead, Martha just became an insignificant sidekick whereas, in truth, she should be a vital role in the growth of Mary. Again, we don't get any development at all, everything just happens with no reason -- Mary just suddenly wants to stand up for Martha when scolded by the housekeeper; Mary just assumes the garden has magic and can heal the dog etc. We don't have any explanation to a certain event at all and they just happen, that's the main flaw with the script.And for the picture, it sometimes is inconsistent as well. For instance, the shot of the dog sitting on the ground in the woods when Mary first met it, it literally feels like a home video -- the colouring was off and so as the set design. And the shot when Mary tried to climb the cirrus for the first time... the colour grading is just in consistent. One second the picture is on this perfect cinematic and the other second the filter just disappear and it becomes home video again.But I do feel like the actors are really doing their bests with what's been given to them."}, {"id": 80, "text": "If you are expecting an exact replica of the 1993 film, go back to your 1980 year of birth and continue to pine for your nostalgia. Everyone else, this is based on a book. You've probably never read it, which is ok. Every one that reads a book, has a vision of what it means as did this film maker.This is a nice movie for 10-14 year olds. It deals with grief and includes black people. Some people think this is called politically correct. Those people are usually from the South.For everyone else, Britain had black citizens in the 1930's. So it's ok to interpret a fictions character as non white.I give this a 7-8. Colin Firth is never a one."}, {"id": 81, "text": "This is rather disappointing. whatever happened to Martha?! she was the one person able to connect with Mary Lennox in the book and now she's a bitter snippy housemaid. even Mrs. Medlock is kinder than Martha is. if you would like to watch a better version, see if you can't find Margaret O'brians version. it's one of the best, and she is a perfect Mary Lennox. Colin in this production is lacking. and when the two meet, it's rather anti-climactic and disappointing. there is no point to purchasing the rights to a book and then ignoring it. that is what this movie has done. watch the 1993 or the 1940's version."}, {"id": 82, "text": "The best version is the 1993 with Kate Maberly. She is the best Mary Lennox. Also,Dame Maggie Smith and John Lynch. You can't beat that,that is the best adaptation. I've watched it numerous times and read the book.. Sorry Mr. Darcy. This version is badly done."}, {"id": 83, "text": "Lots of CGI but the story is lost in the visuals. Too bad, I love Colin Firth. Very loosely based on the book and lots added for visual effect I guess. Not quite as bad as what Peter Jackson did to the Hobbit, but still a waste of talent and money IMHO."}, {"id": 84, "text": "Ehhhhh. I dont think the acting is bad, though Colin Firth is too old for the role. But, I think it overall lacked the magic. Ironically though, as this version seems to rely too much on magic special effects. The garden was never actually magical. The kids said it was because they are well kids with imaginations. But the real magic was that this family (much like the garden) was able to heal and re-grow. And theres too many ghostly apparitions . It feels very contrived. And I really don't like what they did with Colin Firth's character Archibald Craven. Yes, he is meant to be very withdrawn and reclusive. But this version makes him more....mean. For instance there is a part where the kids are reading old letters and Grace (his wife, Colin's mother) had said that she was afraid her husband was manifesting illnesses on her son and was afraid of what would happen to her son once she was gone. It makes him more complicit. And also, the third act in this movie decides its not exciting enough and needs to include a fire element. Trust me, it does not. If anything I now believe the ending is now all in their dying mind as surely they perished from smoke inhalation. Dark? Maybe. But its a stupid ending.There are some changes that dont bother me. Like now its updated to be the 40s. Ok. There is a dog in this story and its the dog that introduces her to the garden. I actually thought this was very charming, and it also serves a way to get her introduced to Dickon as he is kind of an animal whisperer.Like the film isnt bad per se, but I think I would rather watch the 1993 version. Or just straight up read the book."}, {"id": 85, "text": "Not believable - Pollyannish. British family in India during the 1947 Pakistan partition. Parents die of disease yet their 10 yr old daughter appears to be living by herself in their mansion eating spoiled food looking as if she hadn't washed herself in weeks. She ends up, along with other abandoned children, being sent to England by some agency, to reside, predictably, with loner uncle in mansion. While initially snobbishly spiteful toward the servants &amp; wheelchair son of the uncle we know she will effect change in herself &amp; other with the help of a picture perfect hidden garden, and a dog."}, {"id": 86, "text": "Is it now a point of honour for the British film industry to keep making films like this? What's the target audience?"}, {"id": 87, "text": "THE SECRET GARDEN is a really boring adaptation of the classic children's novel and one that misses the mark throughout. Its only novel aspect is to use colour blind casting to feature non-white actors in supporting roles, but little is made of this. The colonial era backdrop is glossed over in favour of the usual sets which somehow look CGI and digital at the same time. The main actress is bland and attempts at characterisation and humour fall flat. Colin Firth seems pained to be appearing while Julie Walter delivers a stock, one-note character portrayal at best. The pacing is slow and the film devoid of life and interest; pick any other adaptation of this novel and it's probably better."}, {"id": 88, "text": "It has a far too 'modern' feel to it. The magic is lost thanks to CGI and the lack of a natural 'British' ancient woodland. If you like a CGI rainforest with colour-changing plants and wooden set with CGI overlay then it may be for you, but for me it simply had no mystery and no magic.If you're making a period film, then make one that reflects the period that you're trying to capture, and not a computer generated mess."}, {"id": 89, "text": "I'm so glad I didn't pay to see this. It is so poorly acted that it verges on painful. The only possible redeeming aspect is the special effects."}, {"id": 90, "text": "The Secret Garden has always been one of my favorite books and one that became a favorite of my daughter as well. I was so disappointed in this film. The magic was so alive in the book, but it was nowhere to be found in this lackluster film adaptation. The acting was mediocre at best and failed to engage the viewer. It left me wishing that this film of The Secret Garden had been left a secret."}, {"id": 91, "text": "This movie looks beautiful, it really does. And the acting is good. But why oh why did they feel they needed to upgrade an already amazing story? It's too embellished, and there are new storylines added that weren't in the book. Why? The story is magical enough as it is!"}, {"id": 92, "text": "15 minutes in, dark, boring and the ob. Firth and Walters have a lot to do"}, {"id": 93, "text": "The dazzling cinematography and the colorful, wonderful soundtrack try really hard to give magic to this movie but nothing helps when the direction itself misunderstand the story and therefore doesn't know how to develop it with the right tones. Everything feels empty, soulless and definitely without any type of magic, from the flat and annoying characters to the inconsistent and dull screenplay; to the point that at the end the movie seemed to have told nothing or, at least, nothing interesting."}, {"id": 94, "text": "Lacks the original authenticity and realism. More a fairytale, fake vibe with this version. Always cry with the original film but very bored with this one though the cast was good."}, {"id": 95, "text": "Terrible adaptation of the book. Missing important characters. In this case the director's imagination failed big time."}, {"id": 96, "text": "I adore the other films of this but I was 10 minutes in and bored already. I saw the cast which made me have high expectations but unfortunately its not what I thought it would be.Just watch the original ones, much better."}, {"id": 97, "text": "A soulless version of a wonderful book. I guess if you watched it without knowing the story then it's an okay movie, but if you have read the book then prepare to be disappointed.There's some beautiful scenes and the lighting is fantastic, but the garden itself is too much and has lost the innocence and beauty of the original story."}, {"id": 98, "text": "Personally I think the movie from the '90s tackled the book well enough that this wasn't necessary. The actors do a decent job of playing their parts, the movie itself just feels kind of soulless."}, {"id": 99, "text": "Tedious, boring, like fingernails on a chalkboard, unkind, utterly lacking any sweetness. I gave it any points, because it is pretty. Perhaps better watched on mute.How could all the people engaged in this effort not realize what a bomb they were creating?"}, {"id": 100, "text": "This is a terrible adaptation if you've read and enjoyed the original story. There is no point to this movie.The acting was decent."}, {"id": 101, "text": "It is a very dull movie for kids, I doubt even they (kids) will watch till end. Story of a girl, his step brother, a friend, a dog, a secret garden and some mysterious characters. All these factors totally failed to create a good watchable suspenseful movie. Too boring and slow, nothing happened for long time. only last ending sequences are something watchable. Most of time it reminds me"}, {"id": 102, "text": "It's open minded and for a new generation. It's not for you it's for me! It's a shame about the lead actress someone like Willow Smith would of been better."}, {"id": 103, "text": "Being a fan of the original,this remake completely lacks the warmth,charm &amp; adventure in comparison. I found it very boring and lacklustre!"}, {"id": 104, "text": "Not a great remake. It's an empty, shallow, dumbed down version. The little girl isn't a good actress and the boys aren't much better. They also changed the story a bit which serves no purpose, just makes it less interesting. I suppose on it's own without previous knowledge of the older movies, it's a decent story. Still better then Twilight."}, {"id": 105, "text": "Never have I read the book nor seen the nineties version of this classic story. I went into this without any expectations. The first thing that I noticed was that I disliked the main character. Although I agree the young actress did a wonderful job, her character just is not. That's a shame, realising most of the time you will be watching her sadness. The movie gets along really slow. Until the break, I could not think of a moment I specially enjoyed. I also wondered what actually happened in the first half? There is no such thing as character backgrounds. I hardly remember what Martha and her brother did in the manor (I mean estate). At least, how they got there. The visuals of this movie, however, are wonderfull. I particularly enjoyed the actual gardens and how its flowers changed when the children moved along. Very pretty. If I were to have children, this would not be the movie I would take them to see. I found it just very sad and slow. Though the movie had it's charmes, I'm afraid I would not recommend it and will never see it again. I must admit I am very curious for the 1993 movie now."}, {"id": 106, "text": "Remove the childish CGI, add some more character development in the second half and this would be a very fine fantasy about magic overcoming illness, loneliness and loss. The first half is great, aside from the silly robin, and the lead actress led me into this world with the requisite suspension of disbelief. Then the CGI set in to compromise the whole mood created by her performance and some well directed sequences. As if they felt the effects would carry it, the filmmakers gave up on their characters halfway through."}, {"id": 107, "text": "Despite some emotionally mature themes and a decent sense of atmosphere, 'The Secret Garden (2020)' feels relatively uninspired and lifeless. It isn't particularly engaging and its protagonist is somewhat abrasive (abrasive by design but abrasive nevertheless). It does have some strong set-design; the eponymous garden is lavish and bright, contrasting nicely with the drab yet grand mansion that acts as its counterpoint. The performances are all decent (although the main male character is actually rather annoying) and the ending does a good job of tying all the subtext together. It's not a terrible experience, but it isn't great, either. It just sort of unfolds in front of you, only occasionally getting you involved with its narrative. It's just about passable, but I wouldn't really recommend it. 5/10"}, {"id": 108, "text": "I knew the story about 40 years ago and remembered loving it along with Toms secret garden. I didn't like the girl at the start and expected not to because of the book, but I didn't even grow to like her and felt that I should have. It was pretty dull and I was expecting more I think. I wouldn't think it was suitable for young children as I found the scene with the dog getting its paw hurt was too brutal.for children."}, {"id": 109, "text": "Rated as a drama, family picture and fantasy, the drama and fantasy fits, but this movie is perhaps liked by children and boring for adults. The ending was fine for all ages and positive, whereas the movie in general was mainly negative, even dark. The spoken English accent was also often difficult to understand."}, {"id": 110, "text": "I dont quite understand how he's still employed as a screenwriter. His ususal approach is lets re-imagine it and make it fresh and politically correct and by that he rips the soul out of the source material, as with His Dark Materials, Enola Holmes or The Secret Garden, ironically making it flat, boring and forgettable.The book is about healing, that's missing from the movie entirely. The book is about exploring friendship, also missing, the book is about learning to admire nature and animals, haha in the movie and so on... why give a book to someone who removes all the magical (and dramatically important) elements he doesnt understand and by adding his ridiculously unfit, shallow and even stupid parts, turns it into a mediocre draft of a shameless copy that lacks real emotional depth, likeable characters or a clearcut plot structure, is beyond me.Guess they can be called the modern day destroyers of artistic value, thank God the audience, if not entirely but in a great amount, can feel that and doesnt show simpathy for such damaging undertaking as this shame of a movie."}, {"id": 111, "text": "Save the money you would have spent on this shameful film and take your family to a local park, botanical garden, or science center where they can use their senses to fully interact with the beautiful world around them.Every generation deserves to know the magic of The Secret Garden. Presumably in an effort to modernize a classic, the spirit of the book and previous film adaptations - like the highly rated 1993 release - has been almost entirely lost. Copious infusions of CGI special effects transport the viewer away from the nurturing wonders of the natural world into a Disney-esque caricature of the flora and fauna that were the sources of the 'magic' that sparks growth and inspires awakening in the young characters. Obviously the producers never read the book, missed the point entirely, or maybe their florist and landscaping budget was too low to honor the intent, in which case they shouldn't have made the film. I imagine the book's author, Frances Hodgson Burnett, is rolling in her grave."}, {"id": 112, "text": "The Secret Garden (2020) is a movie of two halves. The first half verges on excellent, with some creative and beautiful CGI used to represent Mary's imagination. The scenes in the chaos of golden, dusty India followed by the bleak grey of England are harrowing in different ways.It starts so well: how could it finish so badly?About half way through the whole thing devolves into a car crash of overblown CGI Disney schmaltz. Suddenly dream/imagination sequences are real, there are ghosts, there's a bizarre attempt to create a mystery where there's no mystery in the book nor a need for one (isn't the Garden enough?) and weird themes of mental illness and maternal abandonment that simply don't add anything. That these children are orphaned is surely enough?The child actress who plays Mary, Dixie Egerickx (she'll be spelling out that surname all her life) is superb. She has an intelligent stillness that sets her apart. I don't doubt she will go very far, and probably end up a Dame if she sticks with acting. She's very watchable.Julie Walters is excellent as Mrs Medlock, but then she's always excellent! Isis Davis as Martha is also very enjoyable. Amir Wilson isn't given much of a role as her brother Dickon (I recall it as a larger, more interesting role in the book and other productions). Even in Midsummer when Mary's winter coat has changed to a light skirt and blouse, he appears to be wearing the same padded sack. Edan Hayhurst playing Colin is quite good.And Colin Firth: poor Colin Firth. In this production he's given a hunchback and ultimately turned into Mrs Danvers, staggering through a burning house with a face like doom - why show us those beautiful frescoes/murals one moment if only to burn them to pieces the next? - while his beloved dead wife's preserved possessions are consumed by the flames. What an absurd ending: Mary and her uncle would have been unconscious within seconds from the heat and flames, but their escape goes on and on and on.I was left wondering why I had gone to see The Secret Garden but emerged from a surreal production of Rebecca."}, {"id": 113, "text": "A young girl in the 1940's has to go and live with a distant uncle she doesn't know and she finds a secret garden and some friends.This starts of very bleak. The only comparison I can think of for this level of isolation, loneliness and alienation is 28 Days Later. The film carries on like this for a while and we get to know the unhappy lead character rather well.As little girls in the 1940's, stuck in dusty manors in the middle of the moors don't really get up to much the film feels very, very slow and voyeuristic at times.You get shots of fingers brushing leaves, shoes stamping in puddles, misty moorland, overcast skies, etc.Then the movie has to put its foot down to get the actual story underway. All that time defining this disturbed, distant little girl is erased in an instant when she suddenly realises that her mum did love her and she transforms into Pollyanna overnight. She then runs around the estate marking off her check list of people to fix.After an hour and a quarter of gloom and depression the last fifteen minutes are just too cloying. It is like being punched in the throat by a fist made of sweetener.The young actors are very good. Colin Firth, Julie Walters and Isis Davis are only there for set dressing. The garden is vibrant and bright but not really a garden and no distinction is made between fantasy and reality so you never really get a handle on what it is.This is a short film that feels long and leaves you struggling to remember what you just watched."}, {"id": 114, "text": "The Secret Garden is a fantasy drama film based on the novel of the same name by Frances Hodgson Burnett. Starring Colin Firth and Julie Walters, it is a bright, colourful looking update to a classic children's novel that may or may not win over modern audiences.In 1947, young Mary Lennox (Dixie Egerickx) is taken away from her home in India to live at her strict uncle Lord Craven's (Colin Firth) large mansion in Yorkshire, England after both of her parents die from cholera. Due to the neglected nature of her upbringing, Mary has great difficulty expressing her emotions and struggles to open up to other people. Upon arriving at the mansion, Mary soon discovers that it hides various secrets and mysteries, including that of a large beautiful garden locked away from the rest of the estate. Over time, Mary befriends a stray dog she names Jemima, a young boy named Dickon (Amir Wilson), the brother of one of her uncle's maids, and also meets her bedridden cousin Colin (Edan Hayhurst), the latter of which she believes spending time in the garden will cure him of all his ailments.Up to this point, there have been three previous film adaptations of The Secret Garden, with the 1993 version considered to be the one that most people fondly remember. This 2020 reimagining doesn't so much feel like a remake of that film but rather its own unique take on what I can only guess made the original novel a classic in the first place. I have not read the novel but I have seen and enjoyed the 1993 film so this is the only thing I am able to compare this one to. With that said, although I think the 1993 film is superior, I did like how the 2020 film kept its important moral intact, being that the story is essentially a metaphor for personal growth and self-improvement. Both films communicate this message over to children in a relatively easy to understand manner, not once feeling as though it is talking down to them or belittling them for the changes they may be going through. Instead, they are shown that life can be unfair at certain points and that the only way to get through it is to work at your problems and find new methods of progressing forward.What I feel is this film's biggest issue is its choppily edited first act. The whole time it seemed as though the director wanted to tell Mary's backstory through some oddly placed flashbacks and hallucinations during her stay at the mansion. This proved highly distracting and made it difficult to take in the atmosphere of her new environment when it kept jumping back and forth between Mary's life in India and her life in England. A technique like this may have worked better on paper, but on screen it just felt like an awkward afterthought added in post-production. On the other hand, one thing I think this film does considerably better than its 1993 predecessor was the visual style. I loved the use of vibrant colours in the titular secret garden juxtaposed against the backdrop of the gloomy lurid looking mansion. It really gave the sense that this garden was a magical place of escapism that the children can play in without a care in the world.All of the film's child actors did a fine job in their roles, with Dixie Egerickx clearly being the standout as Mary. It is never easy for most people to step out of their comfort zone as they try to adjust to living in a new area, and Egerickx's performance definitely gave off that feeling that anyone who is going through such a thing will be able to find something to relate to. I also loved the adorable dog known as Jemima, who wasn't in any previous adaptations as far as I know and it really added a nice air of cuteness to the story. However, I was disappointed with how underused all of the adults were. Colin Firth barely has enough screen time to leave an impression, which is a shame because I was genuinely curious to see how he could have played his character in comparison to the actor in the 1993 film. The same can be said for Julie Walters, whose 1993 counterpart to her role was played by Maggie Smith, who was one of that film's standouts. This may have been done to put more emphasis on the child characters, but the 1993 film had a nice balance between the children and the adults so I don't understand why they couldn't do that here as well.Even though it may not be remembered as affectionately as its previous adaptation, I'd say that this film still has just enough in it for most audiences to enjoy. Nevertheless, the 1993 film is still the better one and I definitely prefer it for the various reasons stated above. Watching both of these films has actually made me interested in reading the original novel to see how it compares to all these onscreen treatments and I am certain the story is better in print form. With that said, go and see the 1993 film if you haven't already, and if you feel up to it, watch this one afterwards.I rate it 6.5/10"}, {"id": 115, "text": "This was one of those stories I remember being read to as a child. It was good quality time with my mum and I always remembered how much she loved reading it even though as a child I could tell it was probably more girly than I'd want. I loved the classic superhero stuff as a boy. I always thought the film with Maggie Smith was a bit odd, especially between the cousins but enjoyed the story anyway. Now I'm older, maybe I just appreciate it more, but I thought this was really heartwarming. I felt like the CGI worked well and wasn't overdone but understand if people see it as otherwise, I felt like it fed the imagination of the writer or director reading their own version of the story and it just seemed like a bonus if anything. I think the storyline was much clearer than the 1993 version and could really help those struggling with loss with a ton of happy emotions. The actors were great and for those annoyed by the children, they're not supposed to be likeable characters in the story, that should be fairly obvious but I don't understand how people can't appreciate the growth of a character. I think this would be a great film to watch with the family and I'm looking forward to sharing it with my girl when she's grown and we've read through the book together. I also think it might help children who find it hard to process their emotions and can potentially be too introverted. I remember as a child, because of this story I felt inspired to have an imagination and with the added bonus of the CGI in this, it'll surely help children express their creativity on what they see. Give it a go! It's a stunning film."}, {"id": 116, "text": "Media adaptations of Frances Hodgson Burnett's 1911 children's novel have been countless, yet Marc Munden's 2020 edition does not feel reductive, overblown, or devoid of nuance. It is quite slow and lacking in a really perceptible conflict, but there is a sincere emotional dimension in this iteration that supports the gorgeous, CGI-enhanced visuals. A fog-surrounded estate is introduced and it immediately feels like the film will bring an atmospheric journey. The production design of the estate is exceptional. The gothic architecture, furniture, and detailed wallpapers give off a sense of eerieness, which will be replaced by juvenile wonder as more mysteries are unfolded.The off-kilter editing is almost Malickian, providing a fresh, unstraightforward spin in the storytelling. Dario Marianelli's score is filled with luminous fascination. Aside from the top-notch production values, the story of grief after losing a loved one is interpreted with a subtly affecting supernatural aspect that does not subscribe to usual dramatic conventions. It is expected for this film to have a familiar, unsurprising, and even unchallenging plot, but it still somehow created a new poignant world inside a world that has already been existing for a long time.Aurora's end-credits song is beautiful. Take that, old versions!"}, {"id": 117, "text": "This is a searingly beautiful movie that deals honestly with loss, grief and rejuvenation. It is a rare film for children in that it never patronises, instead respecting that its young viewers have an instinctual ability to empathise with the characters and their plight. I am astonished that so many 'adults' who have left reviews seem to have lost the ability to judge something on its own merits and are trapped by the constant comparison to another adaptation from nearly 30 years ago or a slavish devotion to the original text of the novel. This is an adaptation of Frances Hodgson Burnett's classic story, not a remake of a previous film - not 'instead of' but 'as well as'. If The Secret Garden, in whatever form it is presented, has one overriding message it is surely that growth and the acceptance of change is not only possible but essential for our emotional well-being. It is terribly sad that this is something that seems to have been completely forgotten by those who have left such negative and often bitter reviews of this stunning and obviously lovingly made film. Even FHB's great, great grand-daughter adores and is fully behind this new movie - and if she, who has a genuine right to be precious about the material, is happy, then why can't others be?"}, {"id": 118, "text": "The Secret GardenThis latest iteration of a much loved children's book had many good things about it and does not deserve the very low scores some have given it on here.The cinematography is ravishing and the acting overall sufficient but pedestrian for the roles, I also think the music score was well placed.The problem areas, we had gross tokenism and even racial stereotyping, I won't allude to these details in the movie as I would just be repeating the grievance.The plot was played around with and seemed more based on previous iterations that the source material.It was slow in places then rushed through important stuff and the pacing was all over the place.Overall I enjoyed it and give it a 6, meaning worth a watch won't set the world alight."}, {"id": 119, "text": "For those young or young at heart, this timeless story has been filmed before but the 2020 twist on the story completely changes many of the plot points and updates the story by a good few decades.Mary, the main character, sent to England from India to stay with her uncle, is still as snobbish and uncaring at the start of the story but becomes more sympathetic very early on in the film, a change that was needed for a modern audience to stick with her. Whole characters have been removed entirely, replaced with either new or more fleshed out ones and these, too create a fresh approach to the story.It's best not to be too precious with the source, though, as what we have here is a different take that still features the main theme of loss and loneliness bringing harm while nature, change and hope bringing positive changes. The film like the garden, is far more of a child's dreamscape than the Edwardian walled area of the book and it shows in the rather judicious use of CGI on top of using several real life gardens, allowing nature to reflect emotions as characters grow and change.Is it perfect? No. The film is perhaps leaning a little too far into the overly sugary territory at times that make parts less effective than they should be but it's a film the whole family can enjoy, all the same."}, {"id": 120, "text": "This impressive new adaptation of The Secret Garden is genuinely so wholesome, it cannot be understated how adorable it is from start to finish. Beautifully directed by visionary director Marc Munden &amp; shot by his frequent work partner &amp; cinematographer Lol Crawley, the pair create something truly encapsulating which is visually immersive &amp; sublime, bringing a vibrancy, new life &amp; colour to the story - in comparison to previous renditions from years gone by. Granted, I have to regrettably concede the film could've undeniably been longer &amp; I do wish dearly that the writer Jack Thorne had written far more material - which would've eventually ended up on screen - potentially expanding further upon featured characters, devoting more time to their personal development so they would be more fleshed out as a result but it has to also be said that this desire is partly fuelled by a longing to spend more time in the magical, whimsical world created by the masterful filmmakers at the helm when in reality, the deft editing from Luke Dunkley creates a remarkable concision that kept me - as an audience member - from ever becoming bored, streamlining the narrative perfectly so it wasn't bogged down by unnecessary back-stories or convoluted subplots. Admittedly, this isn't a classic like a version which preceded it &amp; neither is it a modern masterpiece; for instance, the writer (at the helm of so many different projects at the moment, it's no wonder his work usually suffers as a consequence when his focus is diverted to numerous other scripts being adapted by others simultaneously) - as mentioned before - probably should've refined final draft with a few extra rewrites before proceeding to principal photography (simply to enhance the material further &amp; improve upon some dialogue) but regardless, there's a lot to love here &amp; despite some of its obvious flaws, this movie remains admirably sweet."}, {"id": 121, "text": "As the movie starts it is 1947 and a small British girl and her family are living well in India. Then when both parents die, newly orphaned she is sent to her wealthy uncle's estate in England. Not sure what age she was supposed to be, the actress was 12 during filming.She has led a privileged life and at first is difficult in her new surroundings. Then wandering around the large estate encounters a dog, she feeds it the meat from her sandwich, soon the two are looking for each other each day.Then the dog takes her to a place surrounded by a tall, old wall overgrown with various vegetation, she climbs and inside finds a wonderous, somewhat magical garden, the secret garden of the title. Further investigation reveals it was a favorite getaway for her mother and aunt.She also discovers she has a cousin living in the same big house, a boy mostly bed-bound. Then she meets a local boy out at the garden, eventually the three of them explore together.All of them, and including the dad, had healings that were needed, the friendships and perhaps some of the magic of the garden help all of them.Good movie, my wife and I watched it at home on DVD from our public library. Watching the extras on the disc, for the filming in the secret garden they actually used a number of the best gardens in the UK for sites and stitched them together for the film to seem like it was all at one place."}, {"id": 122, "text": "The Secret Garden is a remake of the 1993 movie of the same name. This remake is directed by Marc Munden, who is better known as the director of TV series such as National Treasure and The Crimson Petal and the White.In the film, the parents of 10-year-old Mary Lennox (Dixie Engerickx) die. This is why she is brought to her uncle Archibald Cravan (Colin Firth). Her uncle lives in a large country house with his sick son Colin (Edan Hayhurst). Mary is a curious girl and she decides to fully investigate her uncle's large mansion. She finds a mysterious door that gives her access to a secret garden. In this garden Mary discovers that special things are possible here. She tries to get her nephew to go to the garden in the hope that he can heal here. Colin is just too negative to come with her. Mary must now find a way to convince Colin of the wonders that are possible in the secret garden.This film, like the 1993 film of the same name and many other films of the same name, is based on the book by writer Frances Hodgson Burnett. For example, the story of the film may seem somewhat familiar to older viewers. This new version is so much more fun for young children of this generation. Parents familiar with an older version of this film could watch this film with their children and then compare the two different films.The film does have beautiful scenes that take place in the secret garden, because it is filled with beautiful images and some animals. Older viewers can see that most of these images are filmed with CGI and in front of a green screen, but younger viewers can enjoy these beautiful images and continue to fantasize about them.Because of the script, characters of Dixie Egerickx such as a newly turned orphan and the sick Edan Hayhurst come across as somewhat negative for much of the film. Although both have good reason to be negative, as a viewer it is difficult to empathize with them and it is difficult to like them. It would have been better to introduce the characters to the viewers in a more positive way, as the characters only become positive themselves when they are in the secret garden. The film is carried by Amir Wilson who plays the helper's son in the household. Actors like Colin Firth and Julie Walters also have minor roles in the film."}, {"id": 123, "text": "Adaptations surely are simply one possible interpretation of a book into film by individuals; this will leave avid readers and lovers of the novel always puzzled about why things needed to be changed for the big screen. Just adding based on... in the credits doesn't change the fact that it is an adaptation. With this film the changes made are somewhat understandable given what the writer and director wanted to tell. Yet, it doesn't work. Not for me at least. The transformed story is as empty as the house and some things are plainly silly. I do not understand why Amir Wilson was casted as Dickon. Dickon is not black in the original story and it doesn't make sense at all. On top of it, it is quite a waste of his talent (see his stellar performance in His Dark Materials!) as Dickon plays such a dull side-kick role in this film, compared to Dickon in the book. It is the same with the aspect of Magic: I don't think the essence of the story and the book have been understood. Magic is something quite different in the book. The film leaves it on a silly, hollywoodian CGI superficiality that adds to the overall shallow appearance of the film. I felt sorry for the cast; just watch how Colin Firth is forced to play this role of Mr Craven. The scenes in the fire at the end illustrate the uninspired directing and writing, matching the overall empty and frankly boring experience."}, {"id": 124, "text": "The Secret Garden movie was based on a fantasy novel of the same title written by Frances Hodgeson Burnett. Which was published in 1911. The story is based on a young girl named Mary. After losing her parents in the Cholera pandemic in India; she went to England at her uncle's place. She was very much fond of her father, but not so cool relationship with her mom. For some reason, her mother always keeps her away.Her memories pained her so that she just wandering around. One day while wandering around she went to a backyard garden, which was abandoned. And the fact is the garden was actually Magical. The story goes by.The story was quite interesting. Just like any other fantasy story. Not just a fantasy story but also some kind of surreal. But the main problem is, the movie wasn't a perfect adaptation of the novel. The scripting was so good. But the visualization was average. That's why I didn't like the movie very much."}, {"id": 125, "text": "Speaking as someone who has never seen the original movie and has never read the book, I watched this amongst 2 friends who have seen the original movie. For the first half, I found myself looking at my phone and scrolling through social media. I thought the dog was cute, but that was about it really. I was really confused about the plot and I didnt quite grasp what was going on. However, it certainly got more interesting as it got on. Still a little boring, but I thought the final 10 minutes, although still confusing, was probably the best part of the film in my eyes.After speaking to my friends after the film, they stated that it was nowhere near as good as the original film. They did miss out a few things and apprently changed the appearance of the lead. However, they did enjoy the movie, but one friend did admit to find it slightly boring too.I'd call this a background movie. It's ok to be played in the background while you're doing chores. If you sat down to watch it, you'd probably be bored. The reason this is a 6/10 and not a 5/10, is because I was captivated by the visuals. Again, I've not seen the original film so I'm not sure if this is superior or not, but I just enjoyed all the visuals this film had to offer. I also thought a few characters were randomly placed, too.Not a bad film, but not exactly a masterpiece in my eyes."}, {"id": 126, "text": "Oh for heavens sake - given the amount of children's literature out there why or why do film producers keep coming back to The Secret Garden?This version is moderately interesting in that it has been updated to 1947 instead of the late 19th century, though in practice its a pretty weird 1947 and still comes across as being very Victorian.In its favour its very pretty and visual beyond any of the (many) previous versions. But other than that the problem remains the story.I'm sorry by the actual story remains a bit crap. I know its a classic but its incredibly preachy and worthy and saccharin, and making the garden all the bigger in this film just seems to make it all worse.If there is any justice I hope this is the last version of this book on film."}], "reviews_amount": 127}