{"name": "Hunter Hunter", "titleId": "tt02226162", "reviews": [{"id": 0, "text": "Don't get wrong, I did like this movie. Just too many unanswered questions. First off why was this family so worried about the wolf? I figured the wolf might of killed their son years before or something similar. But nope! No backstory at all. Looks like the wolf basically just stole their food. Secondly why didn't the husband call the police when he stumbled onto the dead girls? Instead he goes home and doesn't say a word. The next morning he grabs a trap and heads back to the crime scene. Was he going to hide in the bushes and wait for the wolf to come back? Or was he going to wait for the killer to return? Also, what would of happened if the police showed up? He would of been the prime suspect. And why would you leave your wife and kid home alone while some maniac is creeping around? Lastly how the hell did the killer take out the father? The father seemed like this total badass hunter type. Hard to believe the killer who preys on women murdered the father and only got a small cut on his leg. Also, in the ending why didn't the mom just shoot the killer through the window? She had a clean shot and didn't take it. Which resulted in her daughters death. I don't necessarily think it would of made a better ending but it surely would of been the smarter thing to do. With all that being said this movie was definitely intense and had my full attention. I was pretty much on the edge of my seat the whole time. I do wish the movie was a little bit longer though. It started to get really good with only about 20 minutes left. Anyways.. Solid 6 star film and I'll give it a C+"}, {"id": 1, "text": "The story line sounded great and I thought I would give it a chance. It had me guessing the entire time of WTH is going on. I have seen a LOT of movies and the ending... just WOW , I never expected that and it was great!!!!!!!!!"}, {"id": 2, "text": "It's a surprisingly great little film. It takes awhile after finishing it to let the Tension out it so brilliant builds out. I needed a bit to decompress and process what I just saw. A jewel of a small film!"}, {"id": 3, "text": "I think people are going a bit over the top with 8 and 9 ratings. The film is a bit of a car crash, the first hour is very slow paced with no real character building, all very shallow. The 'twist' can be spotted from a mile away.No explanation about why this guy is doing what he's doing, no explanation about why the husband (when he first stumbles across the murder scene) does nothing but come back the next day and sit amongst the bodies, no explanation how a seasoned hunter can be approached and killed by a 'city boy', the list goes on.Also the CGI for the wolf and the final scene was like something out of the 1980's. Pretty much a waste of 90 mins."}, {"id": 4, "text": "A family is living far off the grid (not trapped) in a cabin. It's the life Dad wants, but mom may not be all in anymore and complains their teenaged daughter was never even given the choice on how or where to live.Dad believes his family is being stalked by a rogue and dangerous wolf. True, but there's something else even more terrifying and dangerous out there, as well.You'll have to watch the rest unfold. No spoilers.It's full of peril that will make you squirm, that's for sure. It's dark and grim, but ultimately the ending is righteous.Definitely worth a watch. *Not for the faint of heart."}, {"id": 5, "text": "Good acting. Not a lot of dialogue. But the story flowed well. We enjoyed all of it from beginning to end."}, {"id": 6, "text": "...until the last five minutes which become implausible and rushed. The music during this sequence doesn't help. And I get what the filmmakers were trying to do. And I don't even mind the fate of the daughter. But the issue is entirely a matter of pacing.Prior to that, I was fully enjoying the film. It held this nice ambiguity around whether the wolf aspect had supernatural elements, even so much as to show a blatant shot of the full moon. And the mention of the weird bug with orange hair. There were so many things lending to an interesting mystique about the film.Then only to be jarringly negated when the mother, after half a lesson in animal dressing, puts on headphones and goes all Hannibal Tarantino on Nick Stahl in the insanely short time it takes the cops to arrive. After a perfectly fine slow burn of a movie, everything is sped up to a trillion. So there was nothing to savor. The cuts were too quick in both the editing and the butchering, just bouncing back and forth between the cops and the retribution. There is no way she did that extensive amount of precise flaying in the time frame suggested by the editing. Had the director slowed it down I think it would have been more satisfying."}, {"id": 7, "text": "Liked the wilderness atmosphere in the movie. The plot doesn't have many twists, it is mostly predictable, it doesn't have much action, it's more of a slow burner that delivers the conclusion with an exclamation mark at the end. Nothing scary here except the rabid human nature of a serial killer and some gore. All in all it's not the worst movie to watch on a slow night"}, {"id": 8, "text": "Boring... ending is ridiculous ... save your money 🙄"}, {"id": 9, "text": "Another fine movie out of Canada. 93 minutes of slow-burning suspense, intense action, plot twists, great acting, mystery, horror, professional work by the crew - with an extra nod to those responsible for establishing ambience with lighting, camera angles, etc. Who needs Hollywood anymore?"}, {"id": 10, "text": "This movie tries to be something meaningful and interesting, unfortunately it fails. Tries to be interesting but its boring. It's got one gory scene. It's like writer started with this scene and then thought, I need hole movie leading to this scene. Unfortunately, boring meaningless one."}, {"id": 11, "text": "Just finished this and I'm disturbed. It was kinda not what I was expecting but also much more. I won't go into detail as you just have to see it. No idea what rating out of 10 so I just went with the average. Disturbing."}, {"id": 12, "text": "The beginning of the movie was good, untill Joe disappeared, and the stanger appeared, then, the wolf thing disappeared from the movie, and the end is soooo ridiculous. If there was a ZERO rating I would have chosen it."}, {"id": 13, "text": "I really like this film. I wasn't expecting to enjoy it as much as I did. The shocking ending that will be talked about is rewarding and traumatic at once. This movie has very good acting. Beautiful scenery. A subtle, unsettling music score. There is some tension. This is more a compliment than a complaint, but I just wish the movie was maybe 20-30 minutes longer. I wanted more scenes of one of the main characters who was great in his/her small role. Trying not to spoil anything. But if there was some flashback or more detail on the hunting aspects, the maniacal hunting aspects, I believe the film would have felt epic like bong joon ho's memories of murder was IMO. Hunter hunter is lean and to the point. The director did a great job. This won't be to everyone's tastes. I'm not a fan of excessive gore but when things did get gory I understood why on an emotional level. I recommend this film to anyone who can handle a slow build and a little bit of gritty realism. 8/10"}, {"id": 14, "text": "Holds interest somewhat but does develop or hold together as well as it could have."}, {"id": 15, "text": "This was a great Canadian film. Great twist ending. One of the better ones I have seen in some time. The music was excellent to bring the tension to its peak. Good job on this."}, {"id": 16, "text": "A bit of a slow burn to reach it's climax but when it does this movie is nothing but a joyous reward. Superb acting from the main leads. The only gripe I had was that Joe's reveal is kind of a bit missing for the most part. Even though I understand this was kept for the finale's twist. We also don't get the killer's motivation. But still a fun ride and I enjoyed the whole movie."}, {"id": 17, "text": "The plot is'nt that capturing to begin with, not more exciting than almost every episode of every wilderness reality show on every tv-channel but it quickly thickens and that in nothing less than a spectacular way. the story grasps you and takes you on a horrifying Journey, from ice cold suspence to a terrifying conclution. I'm not fainthearted but I honestly wanted to Close My eyes for a while. this One Will linger on in My Head for some time."}, {"id": 18, "text": "Very slow paced. Kind of predicable. But also very shocking. I wouldn't write home about it but enough pieces are entertaining that I would give this a 6."}, {"id": 19, "text": "This is unexpectedly good, i literally not expecting all of this even i think this movie is gonna be bad or just ok but no this movie is amazing, this movie give a perfect intense to the audience, i was literally got scared watching this, the intensity in this movie is perfect, the cinematography is again unexpectedly good i love it, the perfomance is good but sometime just little bit overeacted, the second minus in this movie is the wolf CGI, the wolf CGI is kinda messed up and not became realistic, but the gorynes in this movie is 10/10 for me, i really not expecting this is gonna be so gory, i kinda disguted myself watching that because it's so gory and graphic, overall Hunter Hunter is a really really intense journey, i recommended"}, {"id": 20, "text": "I love these type of movies out in the woods. Great casts, sceneries, and the story to this movie. It's truly a phenomenal horror/thriller movie. I'll definitely be purchasing this movie. Enjoy!"}, {"id": 21, "text": "In the darkness of the human mind predators are on the prowl. Not a happy movie,not typical thriller as well.''Pour les fins connaisseurs'' from the same category with Cold Fish,A serbian movie and a few more.Watch it, you may learn something."}, {"id": 22, "text": "I feel compelled to write a review ONLY when the ratings don't match the movie itself, one way or the other. Someone here described the movie itself as disturbing and I couldn't agree more. The story flows naturally, acting is natural, setting is beautiful and haunting at the same time. Great camera angles and atmosphere, made me feel like I was there myself. Starts with the usual problems of family living in the woods (unimaginable to the modern city person) but after a while goes down a dark path. Maybe I was pleasantly surprised because I did not expect anything, but this one is a must watch that you will not forget soon. A gem for horror fans. (altough it is more disturbing than scary)"}, {"id": 23, "text": "Hunter Hunter (2020) - A taut, realistic and at times frustatingly incongruous thriller type. I went in completely blind to this film and I must say, it was a great ride even if the destination was head-scratchingly clumsy and unimaginative. Describing this movie is actually really tricky, because there are many moving parts that don't always come into alignment in my mind at any point of the film. The first 30 minutes, like many competently directed horror films was downright engrossing. Right out of the gate, things move fast, the tension great as you have these gripping scenes fortelling an inevitable meetup between the hunting family (especially the daughter) and the wolf they're hunting. Hunter hunter, who's gonna win, let's go! The wolf, however is a red herring and becomes slowly forgotten, in fact only getting in the way of the character's motivations as it moves along. I get it, trust me - the wolf symbolizes the biggest threat in their world, but the real threat is... Man! Sigh. Yeah I also remember the conversation husband and wife have about people, but that's only a small consolation.As the movie progressed, I became more and more confused by what it was going for. It set up the finale about midway through the film as clear as day and never really did anything else to make you wonder what was going to happen. That's problematic when the biggest thing going for your film is the nonstop, expertly crafted tension. There is not a whole lot of tension when I have near complete certainty in every scene as to the probable outcome. The guy they picked is obviously the serial killer and he killed their husband. I held out hard for a twist but it never came, and some of the final scenes only made matters worse. The dad hunter's behaviour throughout was just plain silly. Why did he not tell the wife of the murders to protect her when the killer was pretty clearly at large? Why did he choose to help out a sketchy looking man alone in the woods near a bunch of dead, raped women when his whole story is he hates people and has no faith?The final scenes were also perplexing, why line up the fate of the mother with the police coming in, making it look like she was the killer - a half baked subplot they played at earlier confusingly. In the end, I don't even want an explanation. There were so many ways to set up the very compelling intro to the film, and it would have been an outstanding film. In the end I was left just disappointed, that a movie with so much going for it and such strong, efficient storytelling lacked the confidence to fulfill any of the promises. That said, I still enjoyed the film, simply because at a primal level - it's a very enjoyable film. Give this director (and some of the actors too) a better script and that movie is going to be something pretty fierce. As is, I can't fault a movie for being as engaging as it was.Scare Factor - 4/10 Overall Score - 7/10"}, {"id": 24, "text": "Do not be fooled by the beginning of the flick which might sounds pretty atmospheric and evokes excitement and suspense. Sorry to say it won't last more than 20 minutes or so, until things start going really bad. Espeacilly when the only convincing character of this mess fades away. Seriously, I cannot think of nothing that I would recomend this. A movie which everyone involved show a high degree of stupidity and recklessness, doing things nobody would ever do in their right mind with a total lack of explanations -at least the logical ones. Do yourself a favor and dig a bit deeper for better horror movies."}, {"id": 25, "text": "I noticed the Mar Vista company at the end which usually makes Lifetime movies. This was an ok, one-time watch slow burn thriller. The acting was ok and it was nice to see Nick Stahl again. I was bothered by the STUPID macho choices the Dad made, which really made No sense and made things worse. The story needed more development, they just tossed in stuff with no real explanation and come on, the kid is 13 and knows how to hunt and shoot and skin an animal, but I guess since she was still a GIRL they have to make her character worse than useless. :( Ok 1 time watch for a Lifetime movie, but not deserving of more than a 5 and I'm being generous. :o"}, {"id": 26, "text": "Devon Sawa and Camille Sullivan play a couple who live off the grid in the forest with their teenage daughter, trapping animals for their livelihood. A rogue wolf threatens this, and the father must hunt it down. What starts off as a survivalist wilderness tale soon devolves into a nerve wracking horror thriller. Tech credits are pro throughout, with Devon Sawa (ostensibly the lead) commanding the screen in the early proceedings. It is Camille Sullivan, however, who ultimately gives the outstanding performance in a very emotional and raw turn as the pic hurtles towards a horrifying and grisly conclusion. A mention also to the excellent, jangling percussive score by Kevon Cronin. Some critics question the point of the movie - but does every horror movie need to make a point? I believe horror aficionados will opine otherwise. Nevertheless, be prepared for a shocker of an ending - you have been warned."}, {"id": 27, "text": "Joseph (Devon Sawa ) and his wife Anne (Camille Sullivan ) and daughter Renee (Summer H. Howell) eke out a living hunting and trapping. The price of pelts has gone down making food an issue. To top it off, a wolf has returned and is taking the animals caught in the trap. Joseph does not like the law and decides to take the issue in his own hands. While in the woods he discovers a setting that he must wait out.The film moves along very well even when nothing is happening. The ending has a plot and a subplot climaxing at the same time and things become intense.Guide: No f-words or sex. Brief nudity."}, {"id": 28, "text": "Wow, that got totally crazy pants. Yep, not a bunch of dialogue but it stayed interesting. Some real gore in parts or just 'holy crap, that had to hurt bad'. I liked it as it is something that literally could happen. I'm not a fan of trapping animals but apparently in that scenario it was necessary. This wolf for me didn't seem to be really involved actually. Altogether I wasn't mad about viewing. Kept my interest for the most part."}, {"id": 29, "text": "This was a slow burn all right and the end of the moving was crazy but this was well acted and worth the time The end keeps you thinking long after the movie ends and that's a good movie"}, {"id": 30, "text": "I don't usually give a 10 but this film was amazing. Was, IMO, worth over 9, so rounded up ;)The filming, the story, the scenery, the emotion, the blood, a really good film.Not for the squeamish.Nothing more to say!"}, {"id": 31, "text": "Everyone seems to be carrying large caliber rifles but they refer to them as 22s. A 22 caliber rifle is one of the smallest bored rifles in existence, and would be appropriate for squirrels or rabbits, not wolves. You'd think someone on set would know this."}, {"id": 32, "text": "It's a slow burner, but the ending is so intense that will surely make a huge impact on you."}, {"id": 33, "text": "This is a slow burner but a gripping film about a family that lives in the woods &amp; hunting against an unknown Hunter. It does have a clichéd moments but it is still thoroughly enjoyable. I guessed the twist but the ending is so satisfacting &amp; rewarding that I cannot really fault it."}, {"id": 34, "text": "1.Good acting from everyone 2.mazing cinematography...canadian wilderness was beautifully captured. 3.stays truthfull to genre and good direction End result: A good survivalist thriller movie which may be predicatable but still hits the target."}, {"id": 35, "text": "The plot is confusing as we don't know if it's a wolf killing ppl or not. Once the dynamic is revealed i was left with more questions than answers. But Nick Stahl is a decent actor"}, {"id": 36, "text": "This one had my partner &amp; I on the edge of our seats trying to put piece by piece together. Acting was fantastic, creepy atmosphere added to the last quarter's dramatic finale. They don't bring movies out like this one alot, highly recommend."}, {"id": 37, "text": "Quiet and tense movie that ends with a bang. Kept me interested throughout. Solid performance. I recommend it"}, {"id": 38, "text": "This is what we call revenge!!... skinning Alive the Killer of a husband and daughter!!... john wick you are far from instinct animal revenge!!...the director of this movie made my day about how I revenge!!"}, {"id": 39, "text": "Once in a while you get a movie that you haven't heard much about. And if you are lucky, it's a good one. This is one of those times. This is a small movie with a low budget, but with a good thrilling 90 minutes suspense. It is slow and it keeps you locked on getting ideas about what is happening next.We need more small pearls like this under the pandemic. Absolutely worth a watch! Crack open a beer and get that slice of pizza in your mouth and enjoy! You can thank me for this honest review later. EnjoyPS! As always, remember to skip the trailer, they show too much these days.6.5/10"}, {"id": 40, "text": "To the werewolf. its a splendid film about hunting and trapping in the north american woods, with a little family of 3 tries to survive on sale of fur and skins and eat the leftovers for survival and growth. till one day they fetch the smell of a heinous big bad wolf that has come back to its old territory.its a film with twists, bad choices, and for some a long playtime, and the end sequence came shocking out of the blue to me, so beware of the big bad wolf. it has a good story, but the plotting couldve been more precise, some caracters vanish and seems forgotten. but the score enhance the feel of fear wether you will or not.so its a film with some blod and guts, but its within the realms of acceptability though not for the real young ones on a saturday night tv screening. its a recommend from the grumøpy old man"}, {"id": 41, "text": "It's nice to see fimilar faces, Devon Sawa and Nick Stahl in a movie. It could have been a lot better only if the director showed more but the is suspenseful and the buildups are very intense with great acting on all parts."}, {"id": 42, "text": "There are all sorts of predators in the forest of this here film, ranging from a family of trappers to an increasing emboldened wolf to something much, much worse.An intense and dread inducing 80 min. of quality slow-burn ultimately give way to a catherdic showstopper of an ending that pure grand-guignol grotesquely. A fantastic little cold-blooded indie film to cap of 2020.My top three list of films for the year now goes like this.1. Possessor 2. The Dark and the Wicked 3. Hunter HunterIf you liked the aforementioned titles, I'm positive you'll love Hunter Hunter.Hope you enjoy it."}, {"id": 43, "text": "The acting was excellent. The slow burn I thought was a wonderful pedal tone adding support to the broader narrative about a family living off-the-grid - no tv, no phone, no music, no electricity - time moves slowly and is punctuated by the ebb and flow and ups and downs of the day's work. The wolf served as a nice addition that transforms the wilderness into this dark backdrop (although they almost overdid the family's fear... it's just a wolf... and the municipal workers act to temper this fear).Some silly attention-to-detail gaffes: the revolver used by the man towards the end is positioned to show the barrel and it looks to be a pellet gun. Also, the viewer gets a sense of where things are directionally from the homestead. The river, the crime scene, the road,... and people just seem to come from all angles when coming to and from these places.Excellent movie, great acting, and super ending. Some of the criticism leveled against the ending could also be leveled against Tarantino re Hollywood, no?"}, {"id": 44, "text": "This movie was what I thought it would be- slightly entertaining with some flaws. The overall story seemed to be two separate ideas combined into one. There is a twist in the middle of the movie that was interesting, however, by the end it became predictable.The pace of the film was a bit slow, however the ending provided some much needed emotion to the movie. There were definitely some tense moments, but unfortunately they were few and far between. On a positive note, I really liked some of the gritty scenes that show what it takes to survive in wilderness with minimal resources.I was excited to see Nick Stahl and Devon Sawa on the screen again, but I don't think they were given big enough roles in the film. Too much time was spent on minor characters that did not really have much to do with the story. The actress that played the mother did a good job though, and helped carry the movie.This is not the worst way to spend an hour and a half of your time, but don't expect the film to leave a memorable impression.[5/10]"}, {"id": 45, "text": "Greetings again from the darkness. The initial assumption is that this is a story of a lone wolf stalking a family. Early on, it shifts into the story of Joseph Mersault, a throwback trapper teaching his 13 year old daughter how to survive off the land. Yet, what writer-director Shawn Linden ultimately delivers is the story of Joseph's wife, Anne, who combats not only the wolf, but something even worse.Joseph (Devon Sawa) is one grumpy dude. He's no fan of society or people, and the only pleasures he seems to find in life are living in an isolated cabin and teaching his daughter Renee (Summer H Howell) how to do the same. They are joined in this quiet and very hard life by wife and mother, Anne (Camille Sullivan). Anne dutifully carries out her chores, but dreams of a more normal life for herself and her daughter. The family barters animal skins for food and supplies and live mostly off the grid - and we later learn there are complications to even something as simple as their cabin.The forests of Manitoba provide what the family needs, but just barely. Winter is approaching and now a wolf is stealing from their traps, leaving them short of food. This wolf has previously stalked the family, and Joseph aims to hunt him down. The camera work in the forest is terrific - giving us the visual beauty, as well as the constant danger. And in this story, danger and traps take on many forms, including the secrets folks keep from each other.The wolf only makes a couple of appearances, yet the threat is always present. There is a terrific sequence that cuts between Joseph, Anne, and Renee, as each are in different areas of the forest at the same time. Each of the situations is tension-filled and our minds are bouncing around as much as the characters. Other characters enter the story, including a couple of Rangers who are unprepared for what they are about to face, and another character (Nick Stahl) who shifts the entire dynamic of the film.Director Linden gives us a survival thriller, one that probably best compares to LEAVE NO TRACE. This one is also a psychological study of just what a person is capable of when pushed to the limit. Anne's story is about her ability to navigate this world while raising a daughter. The final sequence leads to extreme violence, and acts as her emotional release every bit as much as rage and revenge."}, {"id": 46, "text": "This isn't a bad movie. The acting is pretty good, the dialogue is decent, and the setting is beautiful.But the story doesn't really go anywhere, other than to try and have a shocking ending. I've grown up on horror films, so this wasn't scary or disturbing to me, but I suppose some might find it so.While the dialogue was well-delivered, I didn't care for the characters. Especially the mom and her choices regarding her daughter. Just didn't care for her lying, and she didn't seem like the kind of woman that HAD chosen and wanted to live like this.While I have my gripes, and certainly didn't feel like this was any kind of horror or thriller, it did pass an evening. I certainly didn't hate it, but I can barely remember it now that it's over."}, {"id": 47, "text": "I was going to give this 5 stars but the ending just gets an extra star for its pure inventiveness and utterly gore-tastic shock-effecto-mundo par excellence.The film itself is quite slow and not a lot happens. If you are into serial killers torturing, raping and cutting young girls up this might be your bag as it is quite close to the bone (pardon the pun) with its uncompromising lethal savagery and it deviates from the usual ideas and good guy always wins Hollywood tropes and for this the director and writer should be congratulated.It is not a film for everyone; I will not spoil it for you , you just have to watch it to be stunned and shocked at its no compromise, vicious end sequence and downright true to what any of us would do if our family were harmed - It is very unusual in having a movie in which the last 10 minutes of the movie actually define the movie itself - Well done to the director an above average 6 hatchets with no mercy from me on this one!"}], "reviews_amount": 48}