{"name": "The Croods: A New Age", "titleId": "tt02850386", "reviews": [{"id": 0, "text": "This movie is spectacular with amazing set pieces, delightful colors and creatures it doesn't matter how old you are you can't take your eyes away from it. if you enjoyed the first movie, you will definitely love this one and obviously the animation is better especially the facial expressions of the characters are very unique. The cast is very funny especially Emma Stone and Nicolas Cage even though their characters weren't developed from the first one but they still very charming. The story is very simple as expected from a DreamWorks movie but the well designed action and the chemistry between the characters were good enough to keep you invested. I had so much fun watching this movie with my family I recommend watching it on a big screen if you can't catch it in the theater"}, {"id": 1, "text": "What a visually impressive film. I guess it's something to be expected of this day and age.. but I still can't get over how good it looks. And not just hilarious facial expressions, structures, lighting and color usage.. but the injection of modern ideas and references transformed to an ancient period (the concept of a joyride and coming back late). The writers of this movie are pretty smart and creative! Almost geniuses!!Each dialogue and idea is well thought out, has a point and doesn't waste anything. The entire movie is so well made that I'm seriously impressed no one is talking about it. Initially, I thought it was going to be one of those photoplays that fails to recapture the essence of the original.. but this one goes beyond.I would even watch it again! And that is, to me, a sign of a good movie.. worth re-watching."}, {"id": 2, "text": "The kind of anime that will make laugh out loud, it's funny af."}, {"id": 3, "text": "Highly recommend this really awesome and fun kids and family movie! The animation is AMAZING! The voice cast is spot on! The story is so fun and engaging !"}, {"id": 4, "text": "Enjoyed it but it's a typical Hollywood movie. It makes men look like incapable idiots who constantly screw up and never get anything right.Jokes were great and funny for all ages. Animation and characters were good. Kids loved it,"}, {"id": 5, "text": "Loved the first movie so i was super excited to see this. It was super funny and we couldn't stop laughing all the way through and the Grandma is the best character by far. Watch it, you wont be disappointed!"}, {"id": 6, "text": "I like this animation because it makes me happy and laughing . I enjoy every secends of this"}, {"id": 7, "text": "The best kids movie to come out in a long time. I've watched it 3 times already and I laugh out loud every time still. And that's very rare"}, {"id": 8, "text": "This movie is awesome. Surely it is better than the first one. And it teaches me to love what love is."}, {"id": 9, "text": "Our kids loved it, and we couldn't stop laughing. Honestly, even better than the first one. The jokes were fabulous and the storyline was awesome! New favourite for sure."}, {"id": 10, "text": "Wasn't as good as the original but was very close. Liked a lot and almost all of the jokes were hilarious. The entire cast is really good in there roles. Only critique is that I thought some of the jokes went on a little too long and some parts of the movie tried too hard to be comedic. But the kids wouldn't mind/notice. Overall good movie."}, {"id": 11, "text": "I absolutely loved it and so did my kids!! Would definitely recommend it and know we'll be purchasing once it's available."}, {"id": 12, "text": "The story and dialogue is pretty cliched but the animation is amazing. Just a beautiful movie. I love all the hybrid animals, who would have thought a wolf spider could be so cute."}, {"id": 13, "text": "We were lucky enough to be able to preview the movie and we absolutely LOVED it!It was just as good - if not better - than the original.This time around, another family is introduced....A very sheltered human family named The Bettermans.This action-oriented flick is the perfect for the whole family! Unlike some other animated films, this one kept our attention as parents.My favorite was the wildcat Gran. There is also a pretty hilarious scene involving a chicken that you won't want to miss."}, {"id": 14, "text": "Fun family movie with a good heart and lesson that people seem to have forgotten in these DARK TIMES!! Lots of action, funny animals and colorful backgrounds. The voice casting is perfect! Kids will love it and so will most adults. I Really want a Wolf-spider! ;D"}, {"id": 15, "text": "Lacked the originality and wittiness from the first one. The writers just plugged the characters from the croods into a formula that makes money but has been seen hundreds of times. The movie just got so weird so fast, the characters were just too much. They had 7 years to make a sequel to an amazing movie and they just ruined it."}, {"id": 16, "text": "I thought it was good, maybe even pretty good. I liked the story, the visuals are pretty amazing and so is the animation -of course-, and it has great voice acting too! But the two things I didn't like was that the humor feels a bit weird and forced at times, and this also happens with the chemistry of the characters. But overrall, I think its a good movie and I recommend it"}, {"id": 17, "text": "While the story hasn't evolved that much, 'The Croods: A New Age' has a line-up of talented voice cast, lively and colorful animation, some big laugh-out-loud moments, and a great message about getting along and working together to turn it into a decent, pleasant sequel."}, {"id": 18, "text": "Great family movie! It was definitely better then I thought it would be I really hope they make another one!"}, {"id": 19, "text": "From start to finish this movie has it all! Hilarious! Perfect family movie."}, {"id": 20, "text": "Guy has been directed by his parents to search for a paradise called Tomorrow since childhood. On his journey, he befriends the Croods and falls for the daughter Eve. He reconnects with childhood friends, the Bettermans, who live in luxury behind walls. Soon, there is a clash of cultures.It's silly. It's colorful. It's fun. It maintains its family values in a family friendly movie. One can't take this too seriously. I do wonder if Guy has made a big loop to reconnect with his old friends. It's a fine sequel to a fine new animated franchise."}, {"id": 21, "text": "Seven years is way too long to wait for such an anticipated and rewarding sequel. The Croods is one of our all time family favourites. This new instalment starts of with a very sad opening scene but ends on a wonderful note of reconciliation and compromise. Completely packed with humour and action, part two doesn't miss a beat. There's a little less world building and fewer locations but imagination is firing on all cylinders. Please don't make us wait another 7 years for the next one."}, {"id": 22, "text": "Must suggestion to childrens and who want to watch as a children..loved it"}, {"id": 23, "text": "Love this movie ... its mind blowing with a cute love story and the colors and creatures are wonderful love this soooooooooooooooo much that i watched this movie almost 10 times everything in this movie is outstanding.... waiting and prying for part 3 too :-)"}, {"id": 24, "text": "Great cast... Great story... just perfect Definitely worth watching."}, {"id": 25, "text": "Many moments where you met just like omg and giggling like a beast. Good sequel for a good first film.Quirky AF"}, {"id": 26, "text": "It is as good as the first one. It has a typical structure but it's still cute, funny, and highly enjoyable. The animation is just amazing and the story is very good and entertaining for both kids and adults. The jokes are good too. The Croods 2 is a lovely beautiful animated family movie."}, {"id": 27, "text": "First croods movie had something very original going on which made it stand out from rest of similar family animations. This one however tries too hard to be like similar movies. I was hoping to see more of the prehistoric world we got to see and loved in the first one. But this one for the most part limited to a little area, that was kinda disappointing."}, {"id": 28, "text": "The Croods was one of my favorite movies as a child and Dreamworks's movies have always stuck out to me. Like all Dreamworks movies (not including Shark Tale) the movie had a very important theme to it. It goes into politics but in a somewhat subtle way. I'm 14 and I didn't realize that it was implying that the Bettermans were like people of higher class and the Croods were your average low-middle class people. My parents brought it up and while it took me a second to get that from the movie, it didn't stick out to me as much as the whole teen romance theme between Eep and Guy... which brings me to my first dislike.I loved the first movie because it really helped me (as a preteen) realize that boys aren't the most important thing in life, and I should still love my parents and listen to what they have to say because even though they may exaggerate things, they will more than likely always be right. With the sequel they introduced the Bettermans as well as working on Eep and Guy's relationship. However they focused a lot on the relationship between the teenagers than the relationship of the two families combined. Since this was the case, I don't understand why the Bettermans needed to be introduced into the story. I wish instead of focusing on Eep and Guy, they could've made their love story more of a side plot rather than the bigger point of the movie. The movie reminded me a lot of Guardians of the Galaxy but I don't know how to explain the comparison and I feel like you'd have to have seen it to be able to see the similarity between the two. They handled the love story between Peter and Gamora so well, while still making the bigger focus of the movie when they save the galaxy. Of course the Croods don't really save anyone, they still put the action before the love. I hope that all makes sense, I'm sorry if I made it confusing.My second dislike isn't directed towards the movie, it's more towards the direction Dreamworks is going with their movies. Dreamworks has made some of the best sequels, at least in my opinion, and most of them give me the same vibe the original did if not better. Take Shrek for example. Shrek was a great movie. The jokes were extremely funny, and while some were mature they flew over most kids heads. Shrek was a movie that people of all ages could enjoy. And they came out with Shrek 2 which was even more of a masterpiece and again, was fit for people of all ages. With the Croods, all ages can enjoy the movies. There's no doubt about that. However, the humor can be hit or miss. The scene where they were eating the food when they first arrived to the Bettermans home was extremely awkward and weird to me. I also didn't catch a whole lot of adult humor in ther than when Hope was obviously cussing (of course it was covered by geysers) but it wasn't really funny either. So while the movie as a whole can be enjoyed by people of all ages, the humor seemed off in places and like it was just there... to be there.Let's talk about the positive things that I liked and even loved about the movie!!!I'm so glad they brought back some of the original animals from the first movie while also creating new extraordinary creatures and scenery!!! It's one of the reasons I loved the first one so much. The voice acting was *chefs kiss* brilliant. Of course the original Crood's voice actors were brought into the sequel, but let me just tell you... Leslie Mann fit Hope's character so well! For those of you who don't know, Leslie voiced Linda in the Rio movies and I don't know why but her voice just fit her character so well. I enjoyed seeing more of Granny's background, I won't spoil that part, but it was a nice way to give us a better idea of who she used to be and where she came from. The introduction was a lot like the introduction in the first movie and I mean this in a good way. It helps to sort of remind you of why you liked the first one so much to begin with.Overall I enjoyed the movie but it took me a second time of watching it to really fully enjoy. My hopes might have been a little too high at first and once I snapped back to reality, I was able to actually really enjoy the movie. It had a good meaning, though it was a tad bit hard for me to get the first time around. I hope this review helped!!"}, {"id": 29, "text": "The wondering cave family is back, this time find refuge with another family named the Bettermans, who are from Guys past, and while living in such luxury, but things are not has simply has it looks.The animation is so beyond amazing, and the comedy never let's up, almost like a sitcom. The voice talents of Nicolas Cage, Peter Dinklage, and Emma Stone to name a few is always fun. This sequel is a fun time, and will get your mind off of covid."}, {"id": 30, "text": "While I really enjoyed the first Croods movie, the 2nd movie had a much funnier dialogue that lasted through out the entire movie. This happened without sacrificing the storyline. Sequals are rarely better, but this one was."}, {"id": 31, "text": "I enjoyed this sequel. It has some funny moments. I like the fact that teamwork was emphasized, as well as learning from each other's culture--Mrs. Betterman benefitting from cuddling with the pack while sleeping, Betterman daughter taking risks and having an adventure outside the wall, and the Croods benefitting from the Bettermans's technology, hygiene, etc.I guess the only critique I have is the second half. Lacks originality. The giant King Kong-esque villain has to be fed, else he will wreak havoc. This is the main storyline of How To Train Your Dragon Part 1.However, there are some original themes I've never seen before, such the punch-monkeys, as they communicate by punching each other's faces. That's pretty funny.Overall, good film for the family."}, {"id": 32, "text": "Dreamworks did a great job in following the first movie with a quality sequel. It's not a case of same old same old, where many sequels fail. And for me at least, I think it is better than the original.In this movie, the writers have introduced enough new ideas and concepts to keep this viewer interested. Whilst these ideas aren't totally original - think Robinson Crusoe meets George of the Jungle -, they are well executed in this movie.If you liked the first movie, then you'll love this one too.I highly recommend with parental guidance for very young viewers."}, {"id": 33, "text": "I couldn't see the screen well when we watched it at universal studios for my dad's premiere but that just made the story better. I don't understand you people who say it is inappropriate, not to be rude, I saw parts of it when there was no sun on the screen and there was no sort of scary to it. It was a mix of humor and heart warming, and it was woman empowering. Most kids movies are to childish or have just bad or annoying jokes, but not this! Most kid movies are only good for if you're 3-6, but this is funny for all ages. Even my older sister who hates anything that is childish laughed like crazy. I couldn't see it, as I said before, but luckily my dad works in the surfacing department so I can ensure you it looks amazing! The people look like really realistic, great, caricatures. Please watch this, even if it is later on when it's cheaper."}, {"id": 34, "text": "Just watched it twice in two days, because that's what you do with three kids under the age of 10, who think a movie is hilarious. Mom and Dad thought so too. Great, original characters, brought to life by so many quality actors. And who doesn't love a sequel that features a Partridge Family song??"}, {"id": 35, "text": "I really enjoyed this movie, I was laughing almost the whole movie. Really nice for 2020."}, {"id": 36, "text": "Simply put, this is the very best animation movie of 2020. Thunder Sisters!!!"}, {"id": 37, "text": "I was drinking mimosas and thought this was a great movie. Sober, I would probably still think it was a great movie. My 12 year-old and 2 year-old also enjoyed it. As did my 38 year-old husband. A movie for all, I say."}, {"id": 38, "text": "The cast was excellent the animation was really pretty and it was really funny. I suggest checking it out if you saw the first movie even if you haven't.I didn't know much about the movie until seeing it and it was interesting"}, {"id": 39, "text": "The bad This movie is too packed and can feel slow at some time they stuffed too much into it and it just doesn't feel right at some points and even gets boring but it's still a good film for young children Some of the jokes fall flat during the movie Some of the running gags go on for way longer than they should and it gets annoying The movie can feel a little bit predictable at sometimes The mixed reactions The relationship between the croods and the new characters The whole plot about the punch monkeys The ending and everything about it The good The animation in this movie is beautiful and the world is is amazing it does a great job of continuing the story The character development is even more amazing we get so much orange story between the characters we get a realization for some of the characters the whole thunder plot is amazing and the world just keeps going stronger The story this is the only natural way to go and I think they did a great job at delivering it Other stuff Especially since there was a lot of stuff in this movie and the ending I'm not sure how it can continue and I'm not sure how I feel about that Overall The movie is good but just like almost every other movie it is not perfect overall I give it a 83%. Not amazing but good a b-"}, {"id": 40, "text": "The theme of the movie is not for children under 10. Definitely not under 7.I watched it with my 7-year old son. Rather disappointing."}, {"id": 41, "text": "Had me glued on the screen the whole time. Great new ideas, characters ,there is always something new yet familiar around the corner, *TINY SPOILER ALERT* visit from the past intrigued me at the moment, nice story line. Cool new pets, and a crazy secret revel near the end and boom, the grand finale was awesome. I mean I didn't even blink ."}, {"id": 42, "text": "Made me laugh so hard. Really good family movie. I think it was just as good or better then the 1st one"}, {"id": 43, "text": "This is perfect for the family! Fun, beautiful and entertaining.. what else could you want in this lockdown Christmas xx"}, {"id": 44, "text": "This movie isn't exactly as good as the first movie, but it's pretty good still and it managed to make me (an adult) laugh at least 5 times which is no small feat for a movie since I don't laugh easily. The movie features a great voice cast and great animation quality too. The movie follows the Crood family on an adventure and despite their constant bickering, they manage to always overcome all obstacles together. It's a very good film which hopefully can keep going strong and result in a Croods 3, 4 and 5, just like how Shrek, Kung Fu Panda, etc. have managed to do."}, {"id": 45, "text": "I saw The Croods:A New Age, starring the voices of Nicolas Cage-the Ghost Rider movies, The Weather Man; Emma Stone-La La Land, Superbad; Ryan Reynolds-The Hitman's Bodyguard, Harold &amp; Kumar Go to White Castle and Peter Dinklage-Game of Thrones_tv, Elf. This is a sequel to the 2013 'The Croods' that I liked better than the first one. Don't get me wrong, the first one was good but this one was even better. Nicolas returns as the head of the Croods, a prehistoric family that has adopted Ryan-Ryan is sort of like the next step up in the human evolutionary scale-and they are just looking for a new place to set up a home for the family, or as Nicolas calls them, his tribe. Ryan likes Emma, Nicolas' daughter. In their search, they come across a family that knew Ryan when he was younger and their names are the Bettermans-and they seem to think that they really are the better men. Peter is Phil Betterman, the father of the family and he thinks Ryan should stay with their family, the Bettermans, instead of the Croods-he thinks the Croods are beneath them and are mere savages. There are lots of class differences between the 2 families and it takes some time until they can agree on things. It is a funny and never dull story that has some subliminal messages, but not too many that would make it preachy. If you liked the first one then you should enjoy this one, too, because it is a great family film. It's rated PG for peril, action and some rude humor and has a running time of 1 hour &amp; 35 minutes. I-and the rest of my group-really enjoyed it and I would buy it on Blu_Ray."}, {"id": 46, "text": "I loved the original one. Infact it was and still is my most favorite animation movie. So i was very excited about this one. But how it came out, it's beyond dissatisfaction. First of all it's not children appropriate at all. They focused on love thing way too much. Sometimes it was very cliche and clingy. And the thunder sisters part, it was so uncalled for. I just can't believe how they destroyed the franchise ! Only good thing was the visual effects. I must say I've to watch the original one to nullify the effect of this one."}, {"id": 47, "text": "So I went into this movie thinking it'd be fun based off of the trailers but my god, I was never expecting this. For some backstory, I didn't really like the original Croods to much so I wasn't expecting to much from this movie. I absolutely love this movie, everything about it made me incredibly happy. I've thought on it for a while and I can't really think of many, if any, negatives about the movie. I'm gonna leave it at, probably one of my favorite animated movies of all time and maybe even favorite movies. I definitely recommend."}, {"id": 48, "text": "What a funny and relatable movie about family relationships! This movie stepped it up from the original. My first grader to my dad enjoyed this wonderfully animated film! Thank you for releasing this film and giving us a great family fun night! My only regret was not watching it sooner!"}, {"id": 49, "text": "Warning, if you medicate yourself with green before watching this, be prepared to miss half the movie due to excessive full proper belly laughing! Its very entertaining indeed :)"}, {"id": 50, "text": "I really enjoyed this film, it's better than the first film for sure!!! I couldn't stop laughing. A recommended movie the whole family!"}, {"id": 51, "text": "I loved the first one and was worried second one will not able to top that up but i loved it 👍 very creative and possibly one of the best comedy i have seen for a long time. During this depressing times of 2020 this takes your mind away every minute of it full of laughter"}, {"id": 52, "text": "This is quite a fun, escapist animation. The really colourful palette and the very cute character really helps to forget what is going on in the real world."}, {"id": 53, "text": "I'm a big fan of croods ever since i first saw the movie back in 2013. After 8 years it's still pretty enjoyable."}, {"id": 54, "text": "Enjoyed the movie a lot. Great story. Funny and at the same time intriguing. Applaudable nod to women empowerment and an important family lesson learnt as expected from any animated movie.A very interesting yet laughable thing to notice about the punch monkeys is how the makers cleverly made the parts of their bodies with which they communicated, red. It is understandable because their way of communication leads to the evolved species having red swollen body parts."}, {"id": 55, "text": "This movie was cute and colorful, had funny moments but was missing the magic of the first one. Liked the actor selection. The story just seemed typical. There is so much screaming and noises in movies nowadays. I guess it's worthy if you're not expecting much."}, {"id": 56, "text": "I am delighted from movie and so again to seen a movie always"}, {"id": 57, "text": "My family and I are huge fans of The Croods. It's in our rotation of bedtime movies. Or put them on to go to sleep with. When I heard that they were making a 2nd one I was SO excited! Frozen 2 was better. Shrek was better and better. And Kung Fu Panda 3 will forever be my favorite. This? Too much. They changed up the animation to a cheap cartoon like feel that I can watch on TV. This didn't look like a movie that would actually be shown anywhere but on TV. They could have hit it out of the park with this one considering the cast, but nope. 1/10. I feel like I was given mushroom tea on the sly and now I have a hangover."}, {"id": 58, "text": "The Croods: A New Age is a best movie I've watched in 2020. The story was great, Great comedy, the animation was fantastic and the cast did a perfect job at dubbing especially Emma Stone and Kelly Marie Tran. I loved this movie. I want everyone who is reading my review to watch this movie. This is great for kids and as well as adults. This movie is even better than the first one. So everyone WATCH THIS MOVIE !!!!!"}, {"id": 59, "text": "The jokes are ok, the animation itself is great. ,,using words as weapons,, line was the best. really good and funny for all ages."}, {"id": 60, "text": "This movie is funny, enjoyable, and fun to watch. I highly recommend watching this movie with your entire family."}, {"id": 61, "text": "I'm Glad That I Watched The Movie And That's It But There's No Spoilers So Yeah That's It"}, {"id": 62, "text": "Okay so this is a good example of something we need in this day and time it's hilarious family friendly and beautiful it shows holidays are about more than just family but friends as well the humors funny the story moves fast and besides some things I think this is perfect for holidays the plot does resolve around sacrifice just a heads up"}, {"id": 63, "text": "I didn't go into this movie with a lot of expectations. Most sequels are pale imitations of the original, especially 'family' movies. This was a very pleasant surprise. The characters were all true to their originals. The story was engaging, though admittedly not tremendously original. Performances were good. Animation was on level with the original. Many parts were laugh out loud funny.If you enjoyed the original Croods movie, then I think you will find a lot of enjoy here has well."}, {"id": 64, "text": "Its still enjoyable but certainly not for kids in most duration of this release... and crazed Wokeness made it even weirder.... in general compare to previous ones this one is total disappointment"}, {"id": 65, "text": "When I saw the movie I really like the visuals and colors of the movie. they are gorgeous. The original cast is back and they are rocking. Nicolas Cage, Emma Stone, Ryan Reynolds it's great that they find time for this sequel. The plot is too common we have seen this type of story countless times. So there isn't anything new from the story. I really enjoyed the conflict between these two families those scenes are so funny. This movie reminds us of the true value of family. This is a great family movie to watch."}, {"id": 66, "text": "The Croods travel and arrive at Tomorrow which was Guy's original home. The innovative Bettermans live there who believe they are more evolved. They have a daughter Dawn who they want to match with Guy.This was another fun film with a good soundtrack. Nicolas Cage's voice did not match Grug's built. I was hoping Sarah Silverman would have voiced Dawn, but that didn't happen. At the end of the film Sandy again says her first word. Is this going to be a They killed Kenny type of thing?"}, {"id": 67, "text": "The Croods: A New Age is a lovely animated film, funny for the children and with positive messages for an adult audience as parents relationship with their children, feminism or even open the eyes about the awful current administration in The United States, obviously set in the prehistoric ages. The characters are funny, the animation is beautiful, totally colorful, the script is entertaining telling us a story about tolerance and how differences between people is something special that we can learn about them. This sequel is better than the first film. A must watch full of laughs!"}, {"id": 68, "text": "Yes, this Animation-movie made my 2020 year! This is the best thing this year give me! I can't described how incredible this movie is!"}, {"id": 69, "text": "The Croods is one of my favorite DreamWorks Animated films and after I watched the sequel, The Croods: A New Age, I'm gonna review it. It features that the Crood family met a new and modernized family called The Bettermans and when they first met them, they thought they were filthy and insane. And yet the story also focus on the love relationship between Eep and Guy and I knew that the silly love side story would also happen to. I have to say that this movie is pretty funny, it's too wacky but it will do. Just looking at the humor makes you think you're watching a silly cartoon with wacky humor like The Ren and Stimpy Show, Mighty Magiswords, Wander over Yonder or Catscratch. I also love how bright and colorful this movie looks and yet the movie can be a bit fast-paced. Overall, this movie isn't my favorite, but I would easily consider it rather good. Believe me, this film is good and I give this one a 7.9/10"}, {"id": 70, "text": "We loved the first one and the second one is super funny. Kids can't stop laughing!!!"}, {"id": 71, "text": "Rarely, do you find a sequel thats just as good if not better than the first......this movie has it. Loved it"}, {"id": 72, "text": "Plot: funny and great like the first one. There are a pair of scene a little bit weird but that's it.Animations: different respect to the first movie and I found them quite odd but is not all of this big deal.Soundtrack: great.Conclusions: a very good cartoon to spend time with family or even with friend (if you want to see something light and funny). It also has a little summary of the first movie but it's not so much deepened, I recommends you to watch the first one, so you'll have the possibility to get the full humor there is. If you liked the first one this will not let you down."}, {"id": 73, "text": "The original Croods movie was something I didn't much care for, but it was OK. But this one really captures the formula made famous by the Flinstones: behind all our technological advances and sophisticated civilization, we are nothing but cavemen. I saw it with my family and we had a blast recognizing ourselves at almost every beat of the movie. From teen romance, teen rebellion to pet in the house issues, these characters seem embody every modern family issue you can think of.Very funny animation, gorgeous backdrops, fun action sequences and laugh out loud moments with no vulgar undertones. A very wholesome entertainment for the whole family."}, {"id": 74, "text": "What a sequel! The story is so well developed and wrapped, considering all rather unexpected elements and characters - it is a real piece of art to pull it through so flawlessly and continuously engaging. Some reviews are referring to this movie as cliche - I'd rather call it a willy parody of other cliche movies. The metaphorical richness deserves particular attention and may require some to see it second and third time to get the point. To reach such depth of family relations and friendship would require other film makers to produce at least 5 series. On contrary, here everything is consistently and naturally woven into the plot. the old and new is very actual and again - well presented. On top of all - very positive, greatly animated and entertaining movie covering all age groups.10 stars as probably the best of 2020."}, {"id": 75, "text": "My son and I really enjoyed Croods 2: New Age. It was very funny and entertaining, and if you watch it in UHD, the colors look amazing. I was really impressed with Croods 2. Looking forward to purchasing it when I can."}, {"id": 76, "text": "We really loved the first Croods, but had a hard time liking this one. It was certainly subpar. The whole movie is filled with bright colors and nice scenery, but the storyline has some strange directions. My husband and I did not care for the amount of strange lucid highs of the characters through the movie. And the two sets of parents fighting over who Guy was going to be with, Eep or the new girl.... Definitely lacking a good plot. It was worth seeing, but definitely did not wow us. My husband compared it to the remake of Trolls. Just missed the mark, and not as good as the first."}, {"id": 77, "text": "I don't even know what to say. I think this movie could be enjoyed by feminists and people with no standards"}, {"id": 78, "text": "This was an awful sequel... everything is just overdone ..... I loved the first one .... this one is just dumb. I really don't understand the good reviews.... best movie ever? What?! I love kids movies but this was silly and not funny at all. I feel like people are being paid to write good reviews for this movie so people are inclined to rent it for $28."}, {"id": 79, "text": "I was able to catch this movie on one of the online websites I use with my girlfriend. My gf and I were excited to see it, and it opened up pretty good, establishing maybe Guy and Eep might marry and move in together, but the film sort of goes off the rails from there.In the movie, the Croods essentially come into contact with the pseudo-modern world; Thunk discovers windows which are sort of like TVs, The Croods move into huts designed as houses, so on and so forth. Then, it states that the new characters, the Bettermans, are pleasant and nice people, who're trying to get Guy hooked up with their daughter (this subplot is dropped halfway through, and she even befriends Eep halfway through), and that the bananas that they grow are not exactly for them, which sort of comes out of nowhere.The movie is very action heavy compared to the first, and takes on the new age formula of making men seem incapable of functioning or fighting without the help of the women (the men all get captured except for Thunk later into the movie.)It was a very colorful, adventurous ride, and it kept me and my gf laughing from start to finish. If you haven't seen this movie check it out, as it is worth the watch if only for the laughs and beautiful animation, but the original is still much more superior in terms of storytelling and character development."}, {"id": 80, "text": "The Croods 2 was a good follow up to a first film and i must say that i was expecting that this film wont be the level of the first one but i was wrong and im glad because of that.Story was good to me and i had a plenty of fun with it ,i liked relationships between Croods and Bettermens and how humor was used in such situations between them and jokes worked in a good way for me.Sure there were some messages that will annoy some people and decisions that are cliched but still i had a fun with this"}, {"id": 81, "text": "Complete messed up. A triangle love story, cmon. Do not waste your time on this"}, {"id": 82, "text": "Movie is amazing VFX More More enjoyable Capable of family watching movie"}, {"id": 83, "text": "After watching the trailer, I was hoping a downgrade from the first part. But I was pleasantly surprised. This is a fun watch. Story line is okay. Animation is amazing. And the fun level was perfect for a family watch especially during the holidays. Must watch for everyone."}, {"id": 84, "text": "Brilliant movie, easily as enjoyable as the 1st movie, reviewers giving this less than 8 really shouldn't bother watching animated movies, clearly the comedy was lost on a lot of them, it's a comedy u pea brains not a documentary on ancient history, it's fun it's colourful it's full of wakiness &amp; wacky characters, enjoyable from start to finish, Nick Cage is a far better voice actor than actual actor &amp; was worth watching for his dialogue alone."}, {"id": 85, "text": "Probably the funniest movie of 2020 to be honest. This movie really surprised me on how good it was because it makes you laugh throughout the whole movie, and the story itself is very well thought out. Definitely better then the first Croods movie in my opinion."}, {"id": 86, "text": "I liked the movie but I think it was too focused on the love story. My daughter who is 7 right away was like woah this is to lovey. And I agree it was a little much. I don't like how they made the characters seems drunk at times. It was a little strange and not appropriate for children. All in all the first one was way better, definitely more child appropriate."}, {"id": 87, "text": "Not for kids, this movie is one those where relationship with a girl is the utmost priority, that the guy should ignore all her abusive behavior and just chase her because apparently girls are the only things that matter. Also the movie promotes the antiquated toxic idea that strong women must be physically abusive with others."}, {"id": 88, "text": "Didn't have high hopes for this one, but watched it with the kids and it has some nice messages, great laugh out loud moments, superb cast and great animation. Highly recommended."}, {"id": 89, "text": "I did not watch the first film. This was really hilarious. Sort of like Meet the Parents. Every teen has to meet up with parents. That's what happens. Everyone is different. You have different lifestyles, rules, and opinions. Family is first. Stand together or die together. In this movie has a lot of adult jokes. Their is a lot of teen romance. Decent and good movie to watch with the kids."}, {"id": 90, "text": "This is a great sequel! Great scenes, action, and dialogue. My family liked it better than the first film and we thoroughly enjoyed that one. Some super creative ideas especially with the mixed animals and modern ideas. The kids made me rewind several extremely funny scenes especially the ones that involved grandma. Well done DreamWorks!"}, {"id": 91, "text": "One of the most anticipated animated sequels. It is about the next adventure of the Croods in their search for tomorrow, finding a slightly more civilized family that makes them rethink their way of life, while developing the character of Guy. Quality. Entertaining Follow the essence of the characters from the first installment, as well as the rhythm and color. In the Latin American version, the language is a little higher, putting the odd obscenity. It contains a more mature humor for adolescents due to the growth of the characters and for adults, although it also has childish moments, it is more loaded with these aspects than references for adults. The animation is just as colorful. It has too much imagination and new monsters, which makes it lose in essence what the first was looking for. At times it feels like two or three silly moments, but situation jokes work. As a viewer you have to duty after seeing the first installment, it is only entertaining. A family option."}, {"id": 92, "text": "This movie is like one of the those disney shows that's been rebooted as a horrifying children's comedy. If u have seen the first movie and loved it, don't watch this one."}, {"id": 93, "text": "Is about the same as before. Just an average family film. Not bad, not good. It was a little too blunt with its story and left no space for nuance. Overall it felt like a generic storyline that had to get approved by 100's of execs.5/10: medeocre at best"}, {"id": 94, "text": "This movie is Complete garbage. It is a menace to society and should be banned on how terrible this inappropriate film is, it is more violent than American Psycho, and is so many Bugs and bee scenes do NOT WATCH also I'm a working mum so that matters why aswell"}, {"id": 95, "text": "Its only as funny as the trailer. This series by dreamwork is not that appealing."}, {"id": 96, "text": "Not the best movie in my opinion. It's not as bad as I thought it would be though. The introduction was decent and had me hooked, but the humor and story was an extremely mixed bag. Sometimes its really funny and other times its eye roll inducing. I feel like like that eeps motivation in the last movie wasnt exclusively to be with guy like they make it seem in this film. The second half of the film feels really disconnected from the first. The 2d animated segment were just as cool as the last one and the animation is good, but the models are slightly off from the first one and the colors are two vibrant for my tastes. It can be pretty boring at times two. Overall, it's extremely medicore, and not as good as the original, which I wasn't the biggest fan of in the first place. (P.s. I would rate the first around 6.5-7/10)"}, {"id": 97, "text": "The plot is based around the members of both families and their problems. Grug, the overprotective father. Guy, and his relationship with Eep and the evolved vs caveman lifestyle. Dawn, who lives in a modern cave to protect her, but she wants to go outside and try things. Phil and Hope, and what they feel about the Croods. The problem is I didn't feel any of this, it was shallow, quick, and filled with exposition it felt like scrolling through some random FB posts with no interest at all. Then, each group faces the greater danger that forces them to leave their problems behind and unite to face it. Here I hoped it'll feel better, but sadly, easy come easy go, just like that -in easy silly ways- team-women overcomes the obstacles and save team-men, and voila, now everyone has changed, all problems solved!Visually, the movie is stunning, each frame is gorgeous, and the camera work and animations are awesome. Also, loved the creativity behind the things they created as the basic ideas to what we have today in our modern world."}, {"id": 98, "text": "LIKES: Animation Design Cleverness Deep Story Great Voice Acting Decent Character Usage that is balanced Humorous and Fun without going too far down stupid Fun MusicDISLIKES: Perhaps a little more time to really amplify all character arcs The action scene at the end could have been a little longer The political times a little more prominent at the end for the finish Summary:Like Disney, DreamWorks is not shy to really bring animation A game to their movies, and this film is no exception. The Croods may not look the most realistic or revolutionary, but dang do they still move fluidly during the adventure of facing the elements of the wild, primitive stone age. Much like the first installment, the design of the world is beautiful, vivid colors filling much of the landscape that energizes the audience members, but not being afraid to fall into dark, drabber color and shadows to make foreboding landscapes meant to scare our heroes away. The whole design of the world maintains its cleverness as well, fusing various beasts together into forms that are humorous, fun, functional, and deadly all at the same time. As we reach the modern age, the clever devolution of our technology is hysterical to watch, not only in how it fits in the stone age's devices, but more so how the characters react to it in a sort of poke to our own traditions. This ingenuity is used well on multiple facets of this movie as story, design, and humor all maintain creative execution of the writer's talents. And yet that is not all this movie has to offer. As I said earlier, animated features have a great potential to span all horizons, and the Croods takes that potential and balances it well. A deeper story lies beneath the comedic antics as themes of growing up, letting go, elitism, and several other themes are all addressed in the writing of this film. While not every character gets the same amount of growth, Crawford and his team managed to involve many people in uncovering the desires, truth, and weaknesses that were still present at the end of the first film. It takes the growth and continues to push helping our characters push to evolve into something more without taking too many steps back. That deeper side comes from good voice acting, the ensemble once more pulling their voices to match the emotions of the scene and characters without overstepping the boundaries too much. And even better is that so many of the characters have adequate time in the story and serve their purposes across the board, though some of the pets and accessories could have had some more time. Assuming they understood the importance of all their pieces, I was impressed to see the characters remain integrated, and not just included for the sake of being included a site that as I stated in the past is difficult to achieve. Yet if you are worried all this multitiered approaches and deeper meaning make the movie less fun, you have nothing to worry about. Croods is still the same fun adventure that we saw back in the day, a blend of kid savvy stupidity that will bring out laughs, while also being just a fun vacation from reality with jokes that parents will get. Though it does still go a little far for my tastes, the movie just has that positivity that I always like to see, even at the darker parts, that make going to the movies the added flavor it needed. And as for the music, again, another piece to the puzzle that adds that tiny something that you did not realize you needed. Though no amazing chart topper or moving symphony piece, Croods 2 soundtrack is all about bringing out that same flair of fun that much of the movie is about, and using some other tricks for the more serious moments thereby adding to the scenes.Finding dislikes was hard and perhaps a bit picky when it comes to most audience members going to see the movie, but nevertheless here we go. The first part is that though they did a nice job with keeping balance and the pieces moving, there was more room to dive into the character's story. Guy's parents and the adventures they had to connect to Dawn would have been nice, or perhaps more into Eep and the Betterman's personal interactions the way we saw Guy's integration would have been preferred for the full effect. Even without adding new content, a few of the impasses could have used a bit more development to fully maximize the moments. In addition, the awesome opening action scenes that were dynamic and fun, sort of got diluted at the final climax where after much buildup of about 10 minutes of dialogue, I expected more of the same clever antics the beginning showed. Instead, it was more one shot uses of some character's new names that quickly fell to background for our main protagonists to take center stage again. Certainly not the worst, but after such great things during the rest of the movie, to stumble at the end was a bit of a letdown for me. I supposed it could be budget, timing, or violence, but I also feel the political component of the film started coming into play more into the decision making. Despite all the hoping, Croods was not completely sheltered from the movements of the modern age and though not the most aggressive (Black Christmas and New Charlie's Angels) it still had no troubles sneaking its own voice in. Again, had the ending scene shown me the buildup was worth it great, but the demotion of three of the characters to forms that were weaker and outside of their character, could have done with a little better balance. Still not the worst and will most likely affect few people.The VERDICT:Despite my concerns of 2020 and sequel syndrome hitting, the second installment of the Croods was just as fun and energizing as its predecessor. With the same fluid design and fun chemistry, an amazing use of clever planning that blended story and fun, and a humorous atmosphere throughout the whole film, it is certainly worth a visit to check this out. Sure there are some picky things I would have liked to see, but overall, the movie is one of the better animated sequels I have seen in a long time. Are their scary parts for kids, sure as there are loud sounds and some darker designs that might creep them out, but overall it's a pretty safe kids film for those probably 6 and up, and for braver 3 year old's and up. Overall, I was very happy with the film and encourage families to check it out when they have the time.My scores are:Animation/Adventure/Comedy: 8.0 Movie Overall: 7.5"}, {"id": 99, "text": "I liked the movie, I thought it was funny and has humor in it that everyone of all ages can enjoy, just an overall good movie. The plot is good and not confusing. I would rate it an 8/10 but there was just a lot of forced humor and it was kind of strange at the end. The story line was a little off from the first movie but I think that is fine because it was just little things. Definitely not as good as the first movie just because the end almost ruined the whole movie for me, it was extremely cheesy, but that is just my opinion, I am sure that if I were a child I would say differently.I liked the humor in this film, I was laughing pretty much the whole way through it. I liked the plot and how the Bettermans and the Croods have to eventually work as a team. I liked some of the modern references and how they took modern stuff and old caveman stuff and combined it to make an excellent movie.I couldn't emphasize this more, the end was very strange. I liked everything else about the movie though. I was an overall good family movie."}, {"id": 100, "text": "Ok so right of the bat, my expectations of a sequel to any film has always been low. So it has been for this film. However as I started watching this film I was kinda impressed with how the things were going. We had the continuation of the previous films stone age humour, AMAZING visuals(like seriously this had to be the most impressive thing of this film ) , Amazing Animation, some interesting characters... It is a real adventure fest - quite fast paced and quite loud ( however I felt sometimes it was dragged a bit too much). However, as the film proceeded the reality set in and the cliched statement of Sequels are always worse then their predecessor starting to come to light. It transformed itself from a cool animated film to the most cringiest weird animated film in just a few moments. There were so many moments when I wanted to bury my head in my palms, look the other way... You get what I'm implying at. I seriously don't understand why the creators went down this path. For me this was the most disappointing part. Story was weak. Voice acting was very good. I felt better songs could have been added. Overall this is a good flick - Mainly for the animatons and visuals, if you can just muster the strength to sit through the cringy scenes."}, {"id": 101, "text": "IN A NUTSHELL: This colorful sequel to the fun animation adventure The Croods is now available in theaters after being put on hold in 2016 by Universal Pictures. It's actually the longest we all have had to wait for a DreamWorks Animation sequel, seven-and-a-half years! It's Joel Crawford's directorial debut. It's great family fun with enough humor that will make viewers of all ages laugh out loud. In a Covid world, this is a delightful distraction.TIPS FOR PARENTS: Shirtless men (animated) Low-cut dresses are worn by girls and women (animated) People and creatures in perilous situations. Someone says, What the eff?! Name-calling Lots of punching There's a scene where a person yells obscenities, but the words are covered up with other sounds. When that happens, another person breaks the fourth wall and says to the camera, This movie's for older kids. ha haTHEMES: Follow the light and you'll find tomorrow. - Ugga (Catherine Keener) The pack stays together. - Eep (Emma Stone) Jealousy and competition Teamwork Family togetherness Stronger together Courage Female empowerment (you'll learn about the Thunder Sisters) Change can be a good thingTHINGS I LIKED: The voice talents of the cast are really great. For starters, Ryan Reynolds voices Guy, Eep's new love interest. A lot of Millennials and GenZer's make fun of Nicolas Cage, but they would have to admit that he does a great job voicing the prehistoric dad, Grug, in the movie. This is his 100th film credit! I've loved Cloris Leachman for years, so it's such a pleasure to see her...or in this case, hear her voice the character of Gran. Can you believe she's 94 years old? That's amazing! Leslie Mann's voice is just so doggone sweet. Be on the lookout for her in an upcoming movie in 2021 called, Blithe Spirit. I'll be posting my review of it in a few weeks. Other fun voices include those by Peter Dinklage, Emma Stone, and Kelly Marie Tran. So many cute visual and spoken gags. Totally adorable sloth sidekick. Seatbelt mode. ha ha Hearing the two new girlfriends squeal with delight at 100 decibels was hilarious. Lots of fun new creatures and characters. Man cave...ha ha Land-sharks. ha ha Rapid-fire, non-stop action. A few Mad Max: Fury Road Easter eggs for adults. There's an insightful discussion about the scars we see from our pain and the internal wounds we can't see.THINGS I DIDN'T LIKE: If you didn't see the first movie or forgot what happened, there isn't a quick recap to get you up to speed. Not to worry. This movie can be enjoyed without seeing the first movie or knowing any backstories. So much frenzied action. I wanted to see things slow down a bit so I could really see what was happening and enjoy everything in each frame. Like so many Hollywood movies, men are shown as incompetent fools. It's cute and fun, although a lot of critics are saying it's not fresh and original enough for people to get really excited about. The tone of Act 3 is very different from the others.You can see the rest of my review on my Movie Review Mom YouTube channel or website."}, {"id": 102, "text": "* There is no end credit scene *The director Joel Crawford and crew brought a fun fully entertaining film. When I saw the trailer I didn't think that it was going to be better than the first one, I wasn't even looking forward to it and I was shocked at how much I needed it. I like the concept of The Croods because it's about family and being together. It's what made the film meaningful and the sequel was about how that concept was threatened. It also reflects our reality when they clash the ancient with the modern, showing how many loving and small details are no longer treasured due to the modern approach being in the way of what matters the most. The theme of being overprotective and home is once again explored, but from a different perspective. I dare say this sequel was way better for so many reasons and one of them was the shine over the female characters. The way they were focused on was exhilarating, I felt so alive watching them being so badass. This movie had so many great moments and I'm looking forward to more of The Crood's adventures.The composer Mark Mothersbaugh set a simple atmosphere catching on with the movie, but it didn't feel momentous. The Croods need a better music theme one as strong to signify their family.The voice cast was wonderful and I loved the new character, Dawn. She brought the adorable, the humor, and the excitement. Eep and Dawn shined in their scenes, I'm hoping for another movie to see their friendship blossom and more scenes of the Thunder Sisters!"}, {"id": 103, "text": "A movie reviewer is critical and that's what this review is unfortunately. If they had focused more on the meat and potatoes instead of the cotton candy this film could've been actually good. Initial Thoughts: I came into A New Age expecting a bigger and better production as a follow-up to the prequel. It was definitely bigger, but not better. In fact the sequel falls just short of the first film with it's weak story that focuses too much on the teen romance between Eep and Guy, and not enough on the clashing between the Croods and the Bettermans.Pros: The action, adventure, and comedy of the film was fun throughout. The introduction of new characters, the Bettermans, that shared their bright new world, were a slightly warm welcome, as they showed the Croods their 'modern' inventions. However, the good of the film fell short due to....Cons: The fact that the producers wanted to focus on the relationship between Eep and Guy more than anything else. Yes, we all wanted to follow-up on what happened to the two after the first film, but the producers could have included the love story on the side instead of it being the main story because it's called, The Croods not The Teen Romance of Eep and Guy. Besides too much teen romance, I didn't fully care for the Bettermans. Yes, they lived in a utopia, were a very relaxed family, and didn't have a care in the world, but their hippy demeanor took away too much from the clashing that I was expecting between the two families.Overall: The film was fun, witty, and filled with some decent adventure. Unfortunately for me, the teen romance, outweighs the adventure and clashing that was I was expecting. I think families with children 8-12 years old will be able to enjoy this film, but anyone older may not get the full pleasure they were hoping for. Unlike other animated films, which I won't make a list of, this isn't one of those must watch time and time again films.Enjoy the show!"}, {"id": 104, "text": "(3.5 out of 5 stars).The Croods is a pretty fair family adventure film. Following the Croods next adventure as they are trying to find there forever tomorrow home which they call it. But when they come across a giant walled utopia. With food everywhere. And an oasis river. They run into another family that calls themselves the Bettermans family. Which they know Guy (voiced by Ryan Reynolds) family before they passed away. The Bettermans try to have Guy fall for there daughter while Grug (Nicholas Cage) makes a deal with them since he is disliking the idea his daughter Eve wants to start a life with Guy. While the Bettermans are holding a secret about there perfect home.The plot is pretty decent. The Croods are living a different lifestyle with the Bettermans. While they are trying to handle the Croods lifestyle. Grug is having trouble letting go his daughter is growing up. The story is not as strong as the original but still fun for the whole family.The animation, visuals, and soundtrack are fun. And good. The direction with Croods mother and Eve and grandmother teaming with Bettermans mother and daughter to go save the guys was a little cheesy as it tries for that punk rock star tone. The humor is fun. The animation is colorful. And plenty of adventurous action."}, {"id": 105, "text": "Animation quality-wise it's top shelf. But the plot/story/characters took a nose-dive. Characters devolved to being a bunch of meme-characteristics. Some characters were degraded even further to being nothing more than meme car-reference.There's ALOT-ALOT of current world references to the point it makes me sick. Some of them were clever, but for every idea/joke that hit, 10 didn't.At certain points character animation goes into looney-tunes level of abstract and it's actually just... wrong.Croods 2 is just bad. Kids will laugh, sure. But it's not a story I'd ever consider rewatching. Ever.When I think about it, Croods 2 is just as bad to the original as Cloudy with a Chance of Meatballs 2 was to the original. Quality the same, or better, yet you feel as if you watched fake, bad, looney version of characters you loved. It's off-putting."}, {"id": 106, "text": "I enjoyed the first Croods; such an amusing, worth-watching animation flick directed by Chris Sanders, the man behind the creation of Mulan (1998), Lilo &amp; Stitch (2002), and How to Train Your Dragon (2010). I was kind of satisfied with the prequel, not that amazed by it but I was fairly entertained and that was that. I didn't think there'd be more of it. Little did I know, they made a sequel, apparently. I didn't set any expectation whatsoever 'cause I thought one time spectacle of The Croods was enough. So when it came out worldwide, I sat down trying to enjoy the sequel. I didn't think I was going in for any type of great family animation like Chris Sanders' previous work (esp. How to Train Your Dragon), or Brave, and etc. I just wanted to watch a fun vibe animation film; I was thinking of similar movies like Ice Age, The Good Dinosaur, or Onward.Surprisingly, the sequel is a lot FUNNIER than I expected. I've never thought that The Croods: New Age (this time it's directed by Joel Crawford) could be this fun. It lived up to some of my expectations: Good direction, storytelling, got a decent plot, colorful set and plenty of humor. I laughed here and there. What a pleasant surprise.Nevertheless, this sequel is not any better--than its predecessor. If anything, the most disappointing part is the story. It lacks originality. Feels like the writers copied the plot from How to Train Your Dragon; not to mention that this sequel focused heavily on Eep &amp; Guy's teen lovebird story. It could've been way interesting if they'd expand more on its prehistoric story instead of nonsensical prehistoric love drama. For that reason, the movie's flawed, not horribly but enough to give you that 'meh' feeling towards the typical holliwood flick. So is it great? No. Is it bad? Not necessarily. To sum it up, this is an enjoyable spectacle.7/10"}, {"id": 107, "text": "Funny, heartfelt, and colorful- The Croods: A New Age is a nice addition to the first film, and although it may not be quite as good, it certainly is an enjoyable surprise. I expected very little from this movie, with the change in animation style and the less than medicore trailer, I was very hesitant to see it, even despite the positive reviews. Being an avid fan of the first one though, and looking for a film to head to the movies for, I decided to go with this one, cause why not, and surprisingly it was a good choice. The film is often very sharp with a lot of it's humor, some of it is a bit too forced, seemingly to appeal to more modern day viewers as relatable jokes- but they just feel out of place. The animation style for the characters took some getting used to for me, but overall they did a fantastic job with it, as the colors and texture are absolutely beautiful and mesmerizing. There are quite a few darker jokes in this film, which I'm not sure would be the best for kids necessarily as their audience, but I quite enjoyed them. The plot can be a bit formulaic, relationship issues, and plotlines we even have seen in the first one, but do to the sweet, funny, and tender nature of the screenplay, it surprisingly works quite well. I did wish Nicolas Cage had a bit more to work with as Grug, him being my favorite of the cast in the first film, but he still makes it fun with what he has, but overall it's obvious that Emma Stone and Ryan Reynolds are the standout stars of this film, as they both do a tremendous job for voice work, and both give more emotional depth to their chatactersm in the end, I surprisingly enjoyed this film, and it certainly is worth a watch. My Rating: 8.75/10"}, {"id": 108, "text": "The Croods: New Age is sensational because of the clever and colorful graphics, funny and realistic conflicts. The storyline is about the Bettermens not liking the Croods. They must learn how to get along with one another and they have many adventurous life lessons along the way.I like the story line because it's relatable to real life. The family conflicts and differences make the movie unpredictable. The characters are well developed. The production is state of the art. It is highly colorful and engaging from start to finish. The film is a great follow-up to the first one. My favorite part is when the main characters, Phil Betterment and Grug, are in the Jacuzzi.The message in the film is that we do not have to look the same and we all have far more in common than we realize. It's okay to look different.I give The Croods: New Age 5 out of 5 stars and recommend it for ages 4 to 12. Reviewed by Bailey Rae F., KIDS FIRST!"}, {"id": 109, "text": "What's with all the glowing reviews? Seriously??? The story is lame, the characters are lame, the graphics are cool but who wants entire country-sides in kitschy pink, the politically correct feminist undertones are lame in the extreme. My wife and I are both totally into female empowerment, but this was done in such a corny and cheap way, it just sucked. If the kitschy pink was some kind of reference to the feminist theme, my wife would be deeply insulted.We enjoyed the original Croods as a pretty run-of-the-mill animated story, but this was just dire. The worst of it was that no attempt was made to develop the story or develop some of the vaguely interesting themes in it (caveman vs modern man and their impact on the environment).After a genuinely stupid and silly beginning we for a moment thought things would get interesting when these themes were introduced, but a few nice jokes aside, it just got more silly and annoying by the minute. No attempt was made to retain a whiff of credibility, and the regular breaking through the fourth wall was just pure silliness. If that's your kind of humor, fair enough, but it was not for us."}, {"id": 110, "text": "Granted, I have not seen the previous animated movies in The Croods franchise, so I wasn't really sure what I was venturing into here. But my 10 year old son wanted to watch this 2020 animated movie, so I sat down to watch it with him.And color me impressed.The Croods: A New Age was actually rather enjoyable. Not only was the storyline pretty entertaining, but it was also an all together enjoyable animated movie. So I was definitely more than surprised with this one. But as I haven't seen the previous movies, then I wasn't familiar with the characters or the stories, so I didn't really have much to put this 2020 addition up against.The animation and art style in The Croods: A New Age was pretty good. I was enjoying what I was seeing on the screen. And the attention to detail was just spectacular. And it was hard not to get to take a liking to most of the characters and creatures that were on the screen.And as an animated movie, having a proper ensemble of voice actors and actresses is alpha and omega. And I will say that they definitely had that in The Croods: A New Age. I mean, with the voices of Emma Stone, Ryan Reynolds, Nicolas Cage, Catherine Keener, Cloris Leachman, Leslie Mann, Peter Dinklage and Kelly Marie Tran - to name but the most recognizable of names - what is there not to like?My rating of The Croods: A New Age lands on a six out of ten stars. It is an animated movie that can be enjoyed by the entire family."}], "reviews_amount": 111}