{"name": "The Broken Hearts Gallery", "titleId": "tt02140571", "reviews": [{"id": 0, "text": "Not even during a pandemic when there is literally almost nothing to watch is this worth watching. Just pull out a DVD of one of your favourite movies instead."}, {"id": 1, "text": "Pretty cheesy, I normally like romantic comedies but this was so cheesy it seemed like a Hallmark film..."}, {"id": 2, "text": "The film is truly obnoxious. my biggest problem was it wasn't funny, at all. the leads have no chemistry, and the main character isn't very likable. save your $20, and more importantly your time. i am seeing all these good reviews for it, and i am questioning if we even watched the same film."}, {"id": 3, "text": "No chemistry between the two leads whatsoever. It was all very 'forced' Lucy was so over the top and annoying. Film was Not funny at all, I genuinely couldn't wait for it to finish."}, {"id": 4, "text": "With a less cringeworthy plot and better chemistry between the lead actors, this could have been a memorable flick. Can only recommend it as a casual time waster."}, {"id": 5, "text": "Dear lord, who wrote this script? What an awful plot. And the actors? A lesson on how to annoy the sit out of your audience. Please, don't watch it."}, {"id": 6, "text": "A bad comedy is one that's not funny. A horrible comedy is one that THINKS it's funny but isn't. This was horrible. Non-stop cutsie dialog that's simply not funny. Didn't laugh once. Rolled my eyes often."}, {"id": 7, "text": "This has gotta be one of the worst movies I've ever seen in my life, the acting was unbearable and the story was so uninteresting. My friend fell asleep in the theater (which he's never done at any other movie). It was absolutely atrocious and I don't know how it got through all the processes of writing, directing, editing, etc. without someone pumping the brakes on this disaster."}, {"id": 8, "text": "Recently seeing the very good The Roads Not Taken (2020-also reviewed) at HOME in Manchester,I mentioned to a friend about catching a flick at the local Odeon. Finding a screening was to start in 30 minutes,we entered the gallery.View on the film:Taking a wrong turn after a break-up that leads to a meet-cute with Nick (played by a charming Dacre Montgomery) Geraldine Viswanathan gives a bubbly turn as Lucy Gulliver, whose neurotic side at holding mementos of her ex, is balanced by Viswanathan with a growing Rom-Com sass over establishing her exhibition.Making her directing debut after writing a number of TV episodes for shows such as Gossip Girl, writer/director Natalie Krinsky &amp; A Simple Plan (1998-also reviewed) cinematographer Alar Kivilo weave glossy Rom-Com close-ups with amusing visual background gags lining up Lucy's gallery.Taking a new turn in her life by accidentally sitting in Nick's car, the screenplay by Krinsky keeps the Rom-Com love moving at a slick pace, with snappy,cute one-liners from Lucy's pals helping her to mend a broken heart gallery."}, {"id": 9, "text": "Pretty good romantic comedy that follows the classic beats of the genre. The humour definitely elevates the film. Fans of the genre will like this."}, {"id": 10, "text": "For the most part it is just your standard rom com, but it has did something very few movies do. The film makers filled the city of New York with people that could be from New York. There are people of color, LGBTQI people and everyone else. To make it better none of them seemed forced like other movies and shows with just a token put out there.Yes the plot can be a bit predictable, but all movies seem to be these days. I give it a 10 out of 10 for doing something old in a realistic and charming way."}, {"id": 11, "text": "The Broken Hearts Gallery is the cinematic equivalent of a peanut butter and jelly sandwich; it doesn't have a lot of substance and it's nothing you haven't tasted before, but it's good, it's comforting, and it's sweet.The two lead actors have a lot of fun chemistry and they bounce off each other very nicely. The plot is full of overused tropes and conveniences but everything is executed in such a way that it's still a great deal of fun to watch.This film takes familiar ingredients and mixes them together to create something that's just above-average and is never dull. The line delivery and jokes are sharp and witty and this is an entertaining, if slightly forgettable, film that I'd say is worth a watch if you're into the rom-com genre."}, {"id": 12, "text": "It's basically a Hollywood version of an Indian soap-opera! A complete waste of time. Acting was forced and no chemistry between the leads. Cinematography makes it look even more like an Indian soap-opera. It's boring and too melodramatic."}, {"id": 13, "text": "As the title says, the actors put noticeable effort into this. Unfortunately, the runtime feels like it's well over two hours when it isn't, and often the humor comes across as simply annoying."}, {"id": 14, "text": "I sort of feel like Tyra Banks. I was really rooting for this film to be good after I saw the trailer. I am specifically the demographic for this film. I'm a 20 something female that's single and trying to figure out life and this just wasn't it for me chief. Romcoms are fun and an escape, they aren't meant to be taken seriously but man this one really left a bad taste in my mouth. The worst part of this film is that it isn't a bad film. It's just really mediocre. If it was a bad film I could at least laugh and complain about it and have fun. The set up is actually pretty interesting but a lot of the ideas are given to us in this quirky montage that feels like it's trying to be 500 days of summer. For example, they have the interviews scattered randomly throughout, quick montages of the follower count of an instagram going up, and her quirkily posing with the growing gallery. I think they needed more creative visuals. Not to mention they try to relate to me, a non-white female, with a bunch of self-aware young adult humor. Am I supposed to laugh when she stops running to fill out a planned parenthood form? Should I clap like a seal and say you go girl when the main character let's a lady beat up this guy for a really stupid misunderstanding? There's so many examples of things that are supposed to be funny and relatable but just aren't. I think it's fine to have political commentary in movies but make it actually smart, funny, or meaningful, don't just use it as bait. That's almost as bad as tokenism. It makes everything seem shallow and brings down the rest of the film. The main character has that female lead problem where the people around her say and think she's great for no reason. She's okay, but she's not funny, not more nice than a normal person would be, and she's the kind of quirky that's really in your face. To the point where it's not charming. Not to say anything bad abut the actress, I liked her in The Package just not in this film. The guy is also okay, he was the best actor, which is crazy because he just stood there and didn't say much. They should have replaced either the guy or the girl but they didn't match chemistry wise. The ex coming back felt like some sort of weird wish fulfillment fever dream. Some of the dialogue gave me cringe chills and I had to pause it occasionally. I don't hate this film but like my parents I'm really disappointed. With more compatible casting, better dialogue, funny writers, it could have been a really cool film. One film that I absolutely love and is in a similar vain is Bridget Jones's Diary. I relate to that film on a molecular level. Bridget's charming, awkward, smart dumb, self-aware, and can't help but be self destructive. If that isn't relatable as a woman or even just a person I don't know what is. I'm sure people worked really hard on this and I'll give them props for the aesthetics, shots, set, and costume design but overall it really sucks this movie wasn't better. One star may seem harsh and it is, but I'm tired of mediocre movies. I think people want to let this movie slide because it's a romcom also it has a lot of representation which is good but you can have representation and be a fun film at the same time. Like the Big Sick. It had the puzzle pieces but instead of finishing the puzzle it just glued random pieces together. The end result being a wonky but neatly packaged mostly forgettable film. Conclusion, if you want to watch a satisfying romcom watch Bridget Jones's Diary or The Big Sick."}, {"id": 15, "text": "I love this movie, the concept is original and the soundtrack is amazing. Not to mention the anticipation of the main characters getting together!"}, {"id": 16, "text": "This movie was cute at times and funny at times, this is a good interesting romance movie to watch at home because of the pandemic.See it when you get the time"}, {"id": 17, "text": "The Broken Hearts Gallery was a fine romantic comedy that was actually watchable and it had some fun characters and solid chemistry between them,but it still fall under some tropes and it had a few cheesy not so greatly written dialogue and some jokes didnt hit me or landed on a right not for me..Direction was survicable but nothing brilliant,for this kind of film it surved its purpose,story was little predictable but it had few cutesy moments in it,characters were fine and they shard some good presance.The Broken Hearts Gallery was a fine romantic comedy that can be watched by couples and by people whos hearts are really heartbroken but after watching this film,they may feel a little better"}, {"id": 18, "text": "8/10 - cute and compelling rom-com has lots of young talent to watch"}, {"id": 19, "text": "I laughed so hard, i cry at the end (typical me) but this is so refreshing and amazing movie. Loved loved loved it so muchh!💙"}, {"id": 20, "text": "It was raining pretty heavy here tonight &amp; I felt like watching something to go with the setting &amp; I had recently heard about this film so I had to check it out. It didn't disappoint. Ever since I saw Geraldine Viswanathan in 'Blockers' I knew she had quite a bright future &amp; I was hoping she'd do films like this. There's a ton of heart in the writing, the friendships are beautiful &amp; the story is just feel good. It's pretty predictable overall but I knew that going in which is why this still gets an 8. The chemistry between Geraldine and Darce Montgomery is really top notch &amp; I loved the entire idea for this film. I really liked the birthday karaoke scene, that felt real &amp; lovely. Nick playing Piano with Lucy's Mum another lovely scene. The changing of the name of the hotel was a perfect way to cap off the film &amp; it just felt like the perfect movie when you want something easy to watch on a rainy night or a lazy Sunday. Not too much thinking that tugs at the heart strings."}, {"id": 21, "text": "This movie had two interesting leads with Geraldine Viswanathan and Dacre Montgomery. Geraldine plays a character called Lucy Gulliver and her friends Amanda and Nadine are played by Molly Gordon and Phillipa Soo. Lucy Gulliver gets dumped and fired from her job at an art gallery by her boyfriend Max Vora who is played by Utkarsh Ambudkar. Amanda and Nadine console her and wipe away her tears. Lucy comes up with an idea to create a lonely hearts gallery with things saved from her past relationships with men. She meets Nick who has a hotel that he is opening in Manhattan and he lets Lucy put her 'Broken Hearts Gallery' there. I can not say more but it is a movie worth viewing. It is a romantic comedy but it is not totally predictable plot wise."}, {"id": 22, "text": "The trailer gave me a bad first impression but i ended up actually really enjoying the movie. great actors too, Bernadette Peters was phenomenal."}, {"id": 23, "text": "I enjoyed it , some nice moments and overall good entertainment"}, {"id": 24, "text": "In all fairness, I did not finish this movie. It was really stupid. But I'm also probably not the target democratic for this film. I like dark comedies and low budget sci-fi. I hate romantic comedies. This one seemed especially bad, but I hate them all so it's really hard to gauge how truly horrible it was. I think it will find an audience though. So if you liked it, it was probably made with you in mind. And that's okay. To each their own. But this movie was garbage."}, {"id": 25, "text": "Brutally cheesy.. I absolutely loved Geraldine Viswanathan acting. Really real and inspiring although Dacre Montgomery acting was not bad at all. Most of the time I was really confused, because I was not sure if the plot is bad or some acting scene but the idea itself is super and everybody can relate to it.. so I'm still unsure if I liked it or not."}, {"id": 26, "text": "This is an amazingly hilarious and heartwarming movie that I highly recommend for anyone to watch! Nick is the perfect guy for Lucy! I loved the acting performances! This is my favorite Dacre Montgomery movie! If you haven't yet saw this movie you should go get tickets for it! It made my heart melt!"}, {"id": 27, "text": "Everything about this movie was perfect and I would recommend it to anyone"}, {"id": 28, "text": "You can find all the clichés of a rom-com with relatable characters. A few different details, highly optimistic. What I like the most is that the filmmakers successfully avoided identity politics. So, there is no silly jokes about different cultures, etc. Every day people melting in the pot of New York with one thing in common."}, {"id": 29, "text": "This movie deserves more recognition than what is gonna probably get. The flow of the movie is good, the actors are pretty good and there are some lines within some scenes, that are given by the girls that stuck with me after the movie ended. Sooo that's a good outcome! Your typical rom-com but fortunately enough without all the cliche outcomes. A yes!!"}, {"id": 30, "text": "The Broken Hearts Gallery is a 2020 romantic comedy starring Darcy Montgomery and is directed by Nataile Krinsky as well as Selena Gomez serving as executive producer along with her mom Mandy Teefrey.A young art gallery assistant named Lucy who broke with her boyfriend keeps mementos of all the guys she dated in the past. However all changes when she meets and later falls for Nick. If you love romantic comedies than check it out. Music by Demi Lovato and Billie Ellish. Bernadette Peters and Suki Waterhouse co.star."}, {"id": 31, "text": "Does Zac Efron have a twin? If so, it has to be Dacre Montgomery who plays Nick in this gentle romantic comedy. He gets caught up in the totally dysfunctional life of recently fired gallery assistant Geraldine Viswanathan Lucy when she mistakes him for her Uber driver and regales him with tales of her latest failed relationship. Happenstance intervenes more than once as they gradually start to get to know each other - he is slowly renovating an old hotel and she is a hoarder of souvenirs from her previous relationships so what better idea than to start a gallery in his hotel and encourage others to come and create exhibits from their own heirlooms (and, of course to donate!). Naturally, the course of true love never runs smooth - but the relentless pace of the rather banal dialogue, the really pretty preposterous plot and a couple of rather bizarre appearances from Bernadette Peters all conspire to make this just a bit too vacuous and fluffy. It has a naive sort of charm to it, and the easy on the eye stars are no worse than in many a recent rom-com, but I wouldn't bother paying money to see it."}, {"id": 32, "text": "Solid Rom-com, a lot of quirky jokes and the chemistry is noticeable throughout the movie. Some of the humour is darker but funny and enjoyable. You'll leave the movie with a bin of a grin and an empty back of popcorn. Overall more of a comedy, there are only a few sadder moments."}, {"id": 33, "text": "I loved this! It felt so real, genuine and something so rare. I love romantic comedies and I went into this think it'll be crap and LOVED it. Lucy is so unique and so real. The characters and friendships made me feel like I was watching friend. Do yourself a favor and watch it. Even if I wanted more, I loved it!"}, {"id": 34, "text": "This movie was great. It made me feel accepted. I had no idea people keep boxes with momentous like I do. The storyline also went full circle. From the mementos to the hotel to the gallery. It was just a nice feel good movie.Also I just love that Phillipa Soo is in this."}, {"id": 35, "text": "I have adult ADD and usually get bored during movies pretty quickly. Not this one. Geraldine Viswanathan was funny and sympathetic, and Utkarsh was pure gold as usual. However, the banter and dialog were very smart and witty. Phillippa Soo was awesome, and one of the most beautiful women I've seen in Hollywood in a long time. More than that, though, Hollywood is finally giving a voice to deeply insecure women who don't sell themselves short and still get rewarded."}, {"id": 36, "text": "This romantic comedy just does not work. The two leads are not likable characters, and have no chemistry with each other. The story is boring, and there is just nothing that connects me with the film."}, {"id": 37, "text": "With a great ensemble cast and characters this movie could have done a lot better. I was hoping that given the modern play on a romantic comedy it wouldn't hit all of the same marks as the older generation movies. Sadly, this plays out as predictable as Titanic (only in the sense that we know the boat sinks). I wish this had a better plot!"}, {"id": 38, "text": "All i have to say it was semi-entertaining and decent. And for once the leading woman isn't a supermodel. Much better than that recent terrible toxic depressing movie After we Collided or whatever it's called. That was just terrible, this is semi-entertaining at least."}, {"id": 39, "text": "This film start with a girl Lucy talking about her ex's possession with her friends, and she dancing in her room scene! As turnout, this film is about Lucy set-up a so called Broken Hearts Gallery in the hotel of Nick(a guy who mistaken by Lucy as her Uber driver), and she eventually fell in love with Nick! Entire film full of boring conversation, and super annoying overuse scene! Such as, overuse of the song playing at the background scene, overuse of the singing karaoke scene, overuse of the dancing scene, overuse of the kissing scene, overuse of the drinking scene, overuse of the quoting movie title scene, overuse of the post on Twitter scene, and overuse of the video footage of the people talking about their ex's possession scene! Make the film unwatchable! Barely laughable scene is, a pregnant woman indicate her ex is Obama in the video footage! At the end, Nick confess his love to Lucy! Lucy kissing Nick, and they dancing together! Still have a post credit scene! A video footage of Nick talking about all the things he share with Lucy! That's it! Another disappointed film!"}, {"id": 40, "text": "It was cute, nice new plot, decent cast though the bffs were annoying af. Lead did well though she tried too hard sometimes and a few scenes were supes cringe but overall enjoyed and went in knowing it WAS a rom-com so they get a pass on some stuff. My hubs and I enjoyed it with only a few eye rolls but no lol. Alright, cute, and entertaining but not one to rewatch."}, {"id": 41, "text": "Despite, not having every many well known actors, the performance especially by the two leads was phenomenal. The way their personalities differ made them synergies perfectly, Lucy especially did an amazing job all around the board. I can't imagine anyone not giving this film a 10 well I can but they are also probably the same people who eat their chicken without seasoning! 10/10 I loved every minute of it highly reccomend!"}, {"id": 42, "text": "Was it the best movie? NO But I enjoyed. There's some parts where the acting field forced and mechanical. The plot line is very traditional and there no surprise, but is worth watching."}, {"id": 43, "text": "Brilliant cast, funny and a real feel good film. Standard rom-com but with some quirky characters."}, {"id": 44, "text": "When I first went to see this film in the cinema, I don't really know what I was expecting: I watched the trailer and I thought oh, this looks like something I would be interested in, especially because of the choice of actors. It started off quite slow and honestly quite boring in my opinion: the humour felt a bit pushy and unnatural and I was a bit skeptical. However, as the film progressed and the protagonist developed, I ended up getting more invested in the story. It still felt quite empty, though. When I watched it for the second time, my mindset was completely different: every little thing excited me and I enjoyed the experience a lot more as I was already familiar with the characters. I would definitely say this was a good film, but I don't think it was anything particularly special. I think the concept is extremely unique but the movie itself didn't portray that in a very powerful way for me."}, {"id": 45, "text": "The broken hearts gallery 2020 12A Director: Natalie Krinsky Starring: Geraldine Viswanathan, Dacre Montgomery, Utkarsh Ambudkar, Suki Waterhouse, Molly Gordon, Phillipa Soo etcOverall rating 98/100The broken hearts gallery is about an adult called Lucy (Geraldine Viswanathan) who has just gone through a break up, but thanks to a chance meeting with a new friend Nick (Dacre Montgomery) who is starting up his new hotel, Lucy begins a business where people can bring their most prized possession from a recent break up. Wow I was surprised at how fantastic the broken heart gallery was, so many good things to talk about.First of all, the movie had great unique plot points, great performances and was very funny. I thought that the movie had a surprising main unique plot point that really worked, the whole concept of people leaving the most prized possession from a relationship was a great idea, it gave all the different characters there own story and closure from a relationship this was cleverly woven into the main characters of the movie as well. I also thought all of the performances in this movie were excellent, everybody was hilarious and had heaps of charm, the three friends consisting of Geraldine Viswanathan, Molly Gordon and Phillipa Soo worked excellently together and had an instantly believable friendship, Dacre was fantastic in a different role to what I am used to seeing him, but he did a brilliant job, but wow Geraldine Viswanathan was just truly fantastic here and this is a breakout role for her after Blockers, she had instant likeability, relatability and heaps of charm and she was a pleasure to watch whenever she was on screen. The movie was also hilarious, the movie made me laugh out loud multiple times, with it's current and clever humour that very rarely fell flat thanks to the comedic delivery and performances from the cast involved.My next few positives would be the character background, likeable characters and their chemistry as well as the cinematography. I really appreciated the amount of background they gave to the characters, and unlike other movies they spent a decent amount of time on both the main characters of Lucy and Nick, it made you understand where both characters were at that specific time and made you connect with them more, all the characters were also extremely likeable. Every single character had their own charm and unique personality that was completely different to everyone else's so this made me connect and grow to love all the characters not just a select few. The chemistry between the characters was also fantastic, the believable and authentic chemistry between all three friends in the movie was fantastic and relatable, but the chemistry between Geraldine and Dacre was just fantastic. This was the main thing the movie needed for the film to work, they both worked fantastic together and had ana amazing developed relationship that was believable and charming to watch. Finally the cinematography was also fantastic, the movie was surprisingly professional and very impressive with it's cinematography and set pieces, all the colouring and different set locations were fantastic and beautiful, whilst also matching the required tone for that particular part of the movie.My only slight nitpick with the movie would be that it was slightly predictable in places. You could tell where the movie was going to go in terms of the relationships between characters in parts which made parts of the creative side fall into the usual stereotypes for this genre but only slightly, and for me wasn't really too much of an issue.My final few positives would be the charming tone, script, character depth and ending. The movie had such a likeable charm it was great, due to the connections made between all the characters and how the movie handled the sometimes sensitive and sad subject matter made me fall in love with the movie and the charm never faded, the script was also surprisingly fantastic, it was clever, intelligent and had so many insightful and interesting things to say about society and peoples views on relationships that actually makes you stop and think, this took me by surprise but it was a pleasant one. I also appreciated the amount of character depth they added for the main character. Despite Geraldine being hilarious, charming and with a great script to help her, the added component of why she hoarded past objects due to her mother having dementia was really well handled and made me completely connect and fall in love with the main character and made me connect with her on a much deeper level. And finally the ending was fantastic, despite it being fairly predictable, it was incredibly satisfying what they did with all the characters and the character arcs were satisfyingly completed for the characters and left me very satisfied with the movie as a whole.Overall, The broken hearts gallery is one of my favourite comedies I have seen, surprising me from beginning to end, at it's clever and thoughtful script and plot, fantastic characters with depth and an overall creativity rarely seen in this particular genre."}, {"id": 46, "text": "Very cute to watch the onscreen chemistry between the two, it made it feel super relatable by the way they would act and talk to each other. The roommates definitely added to the story and gave it that little touch of today's lifestyles that we need in more movies. Loved the jabs at today's societal topics that needs to be brought up more in films and should be more of an open conversation rather than a topic of controversy."}, {"id": 47, "text": "This movie took me by surprise I laughed the whole way through it. My mom cried and laughed the whole way through it. The music was fantastic. Selena Gomez as executive producer was a genius movie. This has been one of the better movies of the year."}, {"id": 48, "text": "This movie had everything I love in a romantic comedy...laughter, love and maybe a few tears. Predictable? Maybe, but so are super hero movie. They always save the World. In this film they save hearts. I loved every character in the movie...even those that didn't speak. The movie has great energy and great music. Dacre Montgomery is like a young Rob Lowe. If you love romantic comedy SEE THIS FILM. If you don't, why are you even reading this? This was my first movie to see in a theater since Covid and I am so glad it was. What a great distraction from the craziness in the world right now!"}, {"id": 49, "text": "The two leads are magnetic, but there's no chemistry between them.Geraldine Viswanathan needed to be dialed down. She rolls her big eyes a lot, and is constantly doing little victory dances with her arms in the air.Aussie/NZ hunk Dacre Montgomery is matinee-idol dreamy, down to the mustache, goatee and wavy thick dark hair.The two of them are in different modes: he evokes a smooth, accessible mood; she pulls rubber chickens out of her bra. I'm sure they'd both be fabulous with a better co-star.A trio of girlfriends could have been trend-setting, except that instead of creating a new mix of individuals, they excude three mouthy girls from almost any romantic comedy. What a missed opportunity.What bothered me most were odd details, such as collecting abandoned velvet-upholstered furniture from the sidewalk. If something like that is curbside, it's probably bedbug infested.Then there's the vast gallery space. I did a google: Retail space in the Big Apple goes for $75-$2000/square foot, and business build-outs happen in a hurry, because TIME = MONEY.I just couldn't buy it.My ultimate measure is whether I'd see it again. Nope."}, {"id": 50, "text": "The Broken Hearts GalleryI only went to see this as Cineworld is offering a limited choice of movies throughout lockdown.Quite frankly is was bad, my main beef was it just wasn't funny, I don't think I laughed once.Other problems were; tick box rainbow casting, gross gender stereotyping, the failure to condemn a serial predatory lesbian, women mistaking aggression for assertion, shameless bullying, man shaming, the list is endless.The acting was lacking inspiration but this was probably a result of the banal script.Finally and perhaps the worst criticism was the movie totally lacked romance on any level and was so superficial it was instantly forgettable."}, {"id": 51, "text": "IN A NUTSHELL: Presented by directorial debut writer Natalie Krinsky, this rom-com features all the diversity you would expect in a movie about Millennials and that's what makes this film stand out. It kind of feels like a Millennial version of Sex and the City. EVERYONE can relate to the topics of this movie: painful breakups, broken hearts, and finding yourself. I like the idea of a Broken Hearts gallery to help people heal and move on.TIPS FOR PARENTS: Lots of talk of condoms &amp; sex. You see unmarried couples in bed. Lots of alcohol Profanity and super crude language. Portrayal of lesbiansTHEMES: Love, romance The importance of good friends Keeping mementos from the past, hoarders Collecting friends, things, and memories Broken people Let go and move on Learning from experiences Sometimes we get lost in relationships and we need to find out who we are.THINGS I LIKED: It's refreshing to see a female Indian as the protagonist. Geraldine Viswanathan is actually from Australia but first gained attention from American audiences in the movie Blockers . She has spunk, confidence, and energetic comedic timing, making her perfect for this quirky role. Her character is a train wreck and often annoying, but she's likable enough and provides the spark that her starring role requires. Selena Gomez is credited as an executive producer. You also see her name on a ticket stub during the opening credits. Bernadette Peters still looks amazing. Can you believe she's 72 years old? Too bad we didn't get to hear her sing. I really like Utkarsh Ambudkar. Too bad we didn't get to hear him sing too. I got a kick out of him in Pitch Perfect. I always love it when New York City is one of the characters in the movie. Fans of Hamilton Original Broadway Cast Recording (Explicit Version) will love seeing Phillipa Soo. Too bad we didn't get to hear her sing for real! She sings badly on purpose in the karaoke scene. What the heck? What's with all this singing talent in a cast and no great singing? Some entertaining banter. In the style of When Harry Met Sally interviews, I thought the video clips of heartbroken individuals were a cute addition to break up the scenes and provide a surprising touch to a couple of scenes toward the end of the movie. I love the Marie Kondo reference of only keeping items that spark joy. I love how supportive the roommates are to each other. The color palette and cinematography make the entire film look like a grimy garage sale with Bohemian knick-knacks...in a good way. The look perfectly illustrated the idea of the film. I really like Molly Gordon and would like to see her as a lead in another movie.THINGS I DIDN'T LIKE: So many characters are in-your-face and self-obsessed. The character I thought was the funniest was the boyfriend who never talked until his funny interview. A lot of people are falling all over themselves about the chemistry between the two leads, but I just didn't feel it. I like Dacre Montgomery from Stranger Things and Geraldine Viswanathan, just not necessarily together. No, that's not a racist statement. It has nothing to do with that. My son married a girl from Hong Kong and I'm totally fine with mixed-race couples. His character is super generic, while she has all kinds of interesting things going on. Of course, opposites do attract. I realize I missed something here because everyone seems to really like them together. The karaoke scenes were hard to watch. No good singing, armpit stains, so much screaming. Again, how could the singing be so terrible in a movie with so much Broadway talent? The song Don't Go Breaking My Heart by Elton John and Kiki Dee was featured three times. Too much? A bit tedious Man-shaming Some cliches, tropes, and very predictable moments. Expect the obligatory dance party at the end. A lot of the humor didn't land for me. Lots of political correctness lines and apparel that preached at us.You can watch the rest of my review on my Movie Review Mom YouTube channel and website."}, {"id": 52, "text": "I love romantic comedies, I really do. This film, The Broken Hearts Gallery, felt it was made for me. Within the just the opening shot, I knew this would be a classic.We are introduced to Lucy, a character who can't get rid of small tokens of past relationships, a more of a hoarder. Lucy finally feels the one is met with Max . Lucy says some regrettable things while buzzed, then calls a Uber. Lucy, then is so buzzed, she is no realizing this isn't Uber, yet, this new guy takes her home. ( AAAHHH Moment #1 :)Jump forward, Lucy let go and wants to start a gallery of bad relationships. ( Fear not, not giving away where the gallery is big spoiler.) The story goes through loss acceptance, and then.. winning. It's perfect. This film is exactly like HBO MAX's Love Life, a female character getting beaten up in the story of love wwho latter finds herself happy. ( AAAAHHHH Moment.)I'm a straight man and teared up."}, {"id": 53, "text": "Perhaps I've seen too many rom-coms for too many years, but my threshold for sustained engagement has become higher and harder to cross. That's why my praise for this one may mean more than from younger, more impressionable viewers.As always, the right casting is essential for a grabber. Some couples just don't click on-screen; others are picked for box office draw, making them too attractive to be credible or relatable in their situations du jour. This offering from writer/director Natalie Krinsky is enhanced by a lower budget and the casting of young men and women who are appealing, without being too high on the eye-candy scale to detract from the desired reflection of reality. The central character played by Geraldine Viswanathan has a perfect blend of looks, intelligence, insecurities and vulnerability to sell her relationships with men, gal pals and career fluctuations. We like her; we really like her.Next comes the daunting task of a screenplay. The premise of a depressed dumpee setting up a gallery displaying memorabilia from lamented lost loves is fresh and clever. In this genre, we almost always know who will, or at least should, wind up together loooong before the couple(s) figure things out, eliminating suspense from the equation. Here's where many lose my empathy. By the time most couples go through more mistakes and misunderstandings than seem reasonable (I hope Judd Apatow, the best comedy writer with the worst sense of running time, sees this), I no longer care whether they reach that aha moment. Actually, I often hope they don't, rather than have them breed another generation of similarly clueless progeny. Krinsky juggles enough players and subplots to make the inevitable honey glaze of helpful people and perceptions seem relatively suitable. And it turns out to be heartwarming without cloying. That's another delicate balance many can't pull off. Overall, it surpassed my moderate expectations by a wide margin."}, {"id": 54, "text": "This was a Really fun watch at the Cinema this Night. It was very good and had a really Good Vibe about it.Things I liked° The main Character Geraldine Viswanathan was So good in the Movie. She is so Charismatic with Great energy and she is the Brightest Spark of all the Cast in this Movie.° The Setting in New York City was Great. Some Beautiful scenes and shots.° All of the Other Characters did really well and really added to the whole vibe of the Movie.° The Plot and the surrounding Stories were Great to Watch.Minor Criticism° Some of the Jokes don't land but for some reason it doesn't even matter when they don't. I Think it has something to do with The Great Energy and Vibe the Movie is Laced with.Overall, Proper Good Entertainment."}, {"id": 55, "text": "The familiar rom-com beats are too hard to ignore in The Broken Hearts Gallery, but what holds it all together is a spunky little (lead) performance from Geraldine Viswanathan (who plays Lucy, an art gallery assistant). With a plot that's tailor-made for a romantic comedy (it has got a lot to do with Lucy's heartbreaks and the souvenirs she keeps from those broken relationships), The Broken Hearts Gallery makes the city of New York look like a standout character. Darc Montgomery plays Nick, the owner of a work-in-progress hotel, who bumps into Lucy in a rather unusual meet-cute. Their second (chance) encounter felt contrived as hell though.When the duo decides to convert part of the hotel space into a gallery for exhibiting souvenirs from relationships that fell through, the film picks up speed, charm, and some romantic vibes. I didn't expect many surprises in the screenplay (which occasionally descends into downright cheesiness) but what bothered me was the distinct lack of humor. Here and there, we get a chuckle or two, courtesy of the largely silent Jeff (Nathan Dales), Eva Woolf (a spirited Bernadette Peters), and Marcos (Arturo Castro). The Broken Hearts Gallery wholly rides on Geraldine's star-making role and the chemistry she shares with Dacre (which was fine in parts, yes!).While the inclusion of multi-ethnic (there's Utkarsh Ambudkar playing Max Vora, presumably of Indian origin) and LGBTQ (Philippa Soo plays Nadine, a lesbian) characters is commendable, they often recede conveniently into the background for the central plot to play out. It's not a bad film by any measure (Alar Kivilo's cinematography is a plus); The Broken Hearts Gallery, written and directed by Natalie Krinsky, is certainly one for audiences who savor their romantic comedies with a tolerable dose of clichés and syrupy feels."}, {"id": 56, "text": "The Broken Hearts Gallery tells the story of Lucy Gulliver(Geraldine Viswanathan). After a devastating break-up, Lucy starts a gallery where people can leave knick-knacks from past relationships.The Broken Hearts Gallery is a fantastic film. Writer-director Natalie Krinsky has given us a classic romcom, with many refreshing elements. The humour almost always lands and there are a couple of scenes that will tug at your heartstrings. The highlight of the movie, is Geraldine Viswanathan's electrifying performance &amp; her effortless chemistry with Dacre Montgomery. It is awesome to finally see Viswanathan headline a major motion picture, by herself. Geraldine Viswanathan has a long, fruitful &amp; successful career ahead of her. Dacre Montgomery is perfect as Nick. Utkarsh Ambudkar is excellent as Max Vora. Molly Gordon is hilarious as Amanda. Phillipa Soo is awesome as Nadine. The supporting cast is superb. The Broken Hearts Gallery is a must watch for romantic comedy fans. Go, fall in love with Lucy &amp; Nick."}, {"id": 57, "text": "For the most part a fluffy, easy-going romantic comedy, The Broken Hearts Gallery is a really lovely watch from start to finish. With energetic pacing, good humour and a wonderful lead performance from Geraldine Viswanathan, it's a film to really make you smile, even if it doesn't necessarily exploit the full dramatic potential of its story.Even if you are averse to the romantic comedy, or prefer your love stories with a tinge more real-world cynicism, The Broken Hearts Gallery is one of those movies that even the biggest pessimists won't be able to resist.A lot of that has to do with the lead performance from Geraldine Viswanathan, who is outstanding in this film. Although she starts off by overplaying the quirky, clumsy type, she soon finds her feet as an ambitious, optimistic and delightfully energetic lead, bringing such a strong sense of joy to the whole film.Without Viswanathan, The Broken Hearts Gallery could have been a rather flat, monotonous romantic comedy, but thanks to her scene-stealing joyful energy, I found myself beaming ear to ear on a number of occasions here.The film's screenplay isn't quite as magical, though it certainly goes all out to replicate the enthusiasm of its lead actress. Following the story of finding something positive out of heartbreak, this movie is so full of uplifting and happy energy, complete with delightful comedy and even the odd bit of genuinely heartwarming romance to boot.Of course, the central love story is entirely predictable at every beat, but although that does mean the movie loses a certain emotional effect, its fluffy nature makes it a light-hearted joy to watch throughout.Where The Broken Hearts Gallery does unfortunately miss the mark, however, is in its focus on the deeper, long-lasting impact of relationships. Beyond the immediate trauma of going through a breakup, the story touches briefly on how people hang onto the memories - physical or not - of their past loves for a long, long time.It's a wonderful idea to bring up, and an enjoyably sentimental one too, but the film doesn't go further and offer up an emotionally captivating portrayal of people who are still so wrapped up in their previous romances. It's a quirky feature of the movie, but it could have been much more.Overall, I rather liked The Broken Hearts Gallery. It may be a fluffy, easy-going romantic comedy, but thanks to an enjoyable story, good humour, an optimistic mindset and a dynamite lead performance, it's an effortlessly enjoyable and gratifying watch."}, {"id": 58, "text": "3 out of 5 stars.The Broken Hearts Gallery is a fair rom com that may not bring any fresh ideas to the story. Lucy (Geraldine Viswanathan) keeps all her exs things. And after a break up that also cost her job. She runs into Nick (Dacre Montgomery). Who is building a hotel. And after helping him out. She throws an idea of a heart break gallery by displaying the exs things.The story can be predictable with Lucy ex. Trying to get back with her. Ruining her friendship with Nick. While Nick also has a baggage of his own which he has difficult sharing with Lucy.It does have a fair share of humor and heart. Geraldine Viswanathan and Dacre Montgomery were great with there characters and delivered it well."}, {"id": 59, "text": "The Broken Hearts Gallery (2020 release; 108 min.) brings the story of Lucy. As the movie opens, we are 8-ish years ago, as Lucy tells her friends about how her boyfriend has broken up with her. We then go to Today, and Lucy is now with Max, not only her boyfriend but also her boss at work. One of her friends asks if they have discussed going exclusive. Lucy decides to ask Max that night. Alas, things don't pan out as expected and Max dumps her before she can even bring it up. Lucy is overwhelmed and orders an Uber, but somehow steps into the wrong car, where the driver decides to drive her home nevertheless... At this point we are 10 min. into the movie but to tell you more of the plot would spoil your viewing experience, you'll just have to see for yourself how it all plays out.Couple of comments: this is the feature-length debut of writer-director Natalie Krinsky, previously best known for her TV writing. Here she tackles a familiar story line: how a twenty-something girl loses love, but despite all the odds against her, somehow finds redemption (through a spontaneous community art gallery) and yes, maybe even love too. The movie is helped tremendously by Indian-Australian lead actress Geraldine Viswanathan, whom we've seen previously in Bad Education and Blockers, among others. Her charms and easy ways help this film move along. However, she is not served well by the script, which frankly is poor and doesn't contain a single new idea. As a result, we end up with a very predictable movie, in every sense.The Broken Hearts Gallery opened this weekend as movie theater chains like Regal, Cinemark and AMC are reopening across much of the country, fully adhering to all COVID-19 protocols. The Friday early evening screening where I saw this at here in Cincinnati was not attended well: 4 people in total, including myself. There are sadly very few new films being released in theaters, and attendance has been dismal whenever I have gone. I'll be honest: if a regular slate of films was being shown in theaters, chances are that I would not have seen The Broken Hearts Gallery. Am I glad I saw it? I really don't have much positive feelings about it. For that the movie was way too bland and too cookie-cutter. Of course I encourage you to check it out for yourself, be it in the theater, on VOD, or eventually on DVD/Blu-ray, and draw your own conclusion."}, {"id": 60, "text": "A delightful marshmallow of a movie, with Viwanathan giving her all in a star making turn; she, and a the script which is consistently light and clever but manages to not fall into being stupid ... While also still having some predictable beats and yet balancing it all with some joy and aplomb and making me for the first time in many months wish more than anything I could do karaoke with friends again, is what makes this work. She has such a warm and expressive face (those eyebrows are as crucial to her star power as like Rita Hayworth's hair), but she's a good actress too.So the key components of this fly enough as a rom com that I can mostly (if not completely) look over two things: much of the soundtrack, with a few exceptions (ie that Billie Eilish song) are unimpressive commercial nonsense, and the performance by Dacre Montgomery didn't click for me. He might be fine in other movies, and he doesn't give an outright bad performance, but he is largely one note for like 75% of this as the Im too cool for you dude with it all, and more importantly I didn't buy much in the way of chemistry here with Viswanathan - if anything he comes off like a more steely-eyed and sometimes uncomfortable discount Zac Efron, though I can get why the ladies will find him attractive enough and the director casting him - and that is crippling to this, especially at the end when things have to come to a romantic head (that's not a spoiler, that's just convention).I dont know how many will go see this in theaters, where it is right now, but come video this will be a swell and often pretty funny addition to any sensible couple's genre rotation (I had one big laugh and I won't say exactly what but it involved an ex president and that's all I will say, and how can you not smile when right after a breakup the bff-roommates swadle the main character and put a dvd of Eternal Sunshine in her arms). I hope we get more from this filmmaker."}, {"id": 61, "text": "I wanted to like this but seriously had to fast-forward towards the end only because I'm a crazy person who can't just stop watching a movie. I had hopes that it would get better but no such luck.As others have already stated - there was absolutely no chemistry between the main characters Lucy and Nick (or any of the characters for that matter). And the story line was all over the place. Its like they couldn't decide which thread to follow. Despite the film title, the idea of the broken hearts gallery was never really a big part of the movie. And then when it came time to see meet her mother, why? I thought that may be some thread that pulled it together but nope.Now, I do have to say, though, that to his credit, I think Dacre Montgomery was the most believable as he had a charisma and great screen presence. He really seemed to bring chemistry to the cast. Unfortunately, as soon as he started to pull me into a scene the ridiculousness of Lucy's (Geraldine Viswanathan) character just blew it all apart. It was just way to much and annoying.I totally forgot it was supposed to be funny - Rom Com, right? wrong. Well, except for the part played by Nathan Dales - Jeff. Always silent until his little part where he talks on camera in sort of a storytelling booth (was that supposed to be a homage to When Harry Met Sally?)seriously, skip this one."}, {"id": 62, "text": "Although it has a bit of a mediocre start, The Broken Hearts Gallery more often than not proves to be a rather enjoyable and sweet romantic comedy- largely due to the chemistry between its two leads. The film is entertaining through and through, I never did feel it was dull or unbearable to watch in anyway, as some claim on IMDb but I did feel like it had a decent amount of predictability. If you have seen other rom coms, chances are you are bound to guess many of the upcoming plot lines throughout watching the film, although it oddly doesn't ruin the film. Despite predictability issues, and some cliches, the film is actually quite often very funny, and it's weird and refreshing sense of humor may not be for everyone but it was more than a satisfying ride for me. Geraldine Viswanathan and Dacre Montgomery, quite a pair of names there, do truly bring their best to the table throughout the film- and is part of the reason why this film works so well. The other part is, oddly enough, originality. Sure there are more than a few moments you have seen before in this film, but what makes it so appealing is that it doesn't have a plot like any other film you have seen before, and it embraces it to a level of charm many films don't dare to try. In the end, The Broken Hearts Gallery wasn't perfect, but a solid fun rom-com that is more than worth your time if you are the right audience for it. My Rating: 8/10"}, {"id": 63, "text": "Finally a movie for hoarders on the big screen! Imagine a a gallery where you could leave behind the trinkets from your ex's and oh's. In this movie its traditional boy meets girl, boy is attracted to said girl, boy breaks up with same girl, only to you guessed it...no not kill themselves that would be Shakespeare...complete with neon signs as tokens of affection. The Broken hearts Gallery is set to become a cult rom-com classic. Think 10 thing I Hate About You and all those other great movies about romance loaded with plenty of laughs and tears plus 2 strong leads and both Aussies...Oy, Oy, Oy! Geraldine Visanwathan from Blockers and The Package (on Netflix) is busy building up a filmography most young actresses would be proud of and her co-star Perth lad, Dacre Montogmery,(Stranger Things) has a certain young leading man vibe not unlike early Heath Ledger. He has possibly the longest eyelashes I've ever seen on a bloke, but I reckon he could easily play evil to in a Giovanni Ribisi way. The whole thing is accompanied by a rapid fire script of witty and quotable lines, plenty of social media referencing and hip FRIENDS living in shared apartments, New York style...sound familiar. This movie proves there is an art to letting go and its not just a song by Sir Paul or Passenger. Thanks to singer, Selena Gomez, as Exectuive Producer, and Natalie Krinsky making her directorial debut this could be 2020's answer to the Covid Blues... Sex in the City...Millennial style."}], "reviews_amount": 64}