{"name": "Marauders", "titleId": "tt03963816", "reviews": [{"id": 0, "text": "It would have made a great 10 episode series but too much information, characters and plot lines for one sitting. Good actors and camera work but fails to make sense in the end. I feel like it was pitched as a series but the accountants decided to make it into a movie."}, {"id": 1, "text": "-- despite a fine lead performance by Meloni.Which is too bad, really, because the cinematography is quite good (digital's getting closer to celluloid every year) and a few of the supporting roles are well-acted (Grenier's in particular).But then there's the story. Oh mother of God the story... SPOILERS AHEAD!It's something about a shady bank president, played by Bruce Willis, whose banks keep getting robbed in particularly brutal fashion. The trail leads the tough FBI agent in charge of the investigation (Meloni) to members of an elite special forces team and then -- wait for it - - to ANOTHER special forces team, both of which are tied in, somehow, with the kidnapping and murder of Willis's younger brother several years before. A corrupt Ohio Senator and a missing-and-presumed dead ex-special forces op also figure in the (incomprehensible) proceedings.I defy anyone to see this movie once and summarize the plot line. It's like the filmmakers tried to pack 4 hours worth of story into a 2- hour running time, and failed in the attempt. All in all, a missed opportunity. I happen to love smart intense heist movies (such as HEAT, THE TOWN, THIEF, etc), but this wasn't one of them."}, {"id": 2, "text": "I was a little nervous going into this movie after reading all the reviews (largely negative), but was pleasantly surprised. OK, there was some bad acting on Bruce Willis' part but other members of the cast; Christopher Meloni, Dave Bautista et al made up for it. It was a great story with a good twist at the end. If you're a movie sommelier analyzing films for cinematography, acting etc... then you'll walk away with your nose in the air but if, like most people, you don't really care about the legs or the bouquet of your wine, you'll enjoy watching this. I don't normally bother writing reviews for movies but felt this movie was unfairly reviewed."}, {"id": 3, "text": "Not clear 7 ,maybe 6.8 but definitely not 5.4 Why so many bad reviews? Some 2...4 really guys? Come on ,what expectations somebody has from an action movie?The movie was good with a really nice plot. Watchable,not boring .A movie with a deeper purpose and good,interesting background story.Reviews are to help somebody to decide if it's worth seeing or not,some reviewers believe that a good review is some bad comments.Everyone had their opinion of course but 2 or 4 are for movies with no interest,awful plot and bad acting.This one wasn't any of these.I liked the idea of a higher purpose behind the script ,it had you thinking what happened?why?who? And that was interesting,there's not extremely plot just an action movie with smart scenario ,nothing unique or one of its kind.When I first saw 5.4 rate and 2...4 reviews I was like there's NO WAY to watch this.But i luckily i did and I'm glad that i did cause it was worth it.Give it a chance isn't that bad!!"}, {"id": 4, "text": "A good action movie, sure the acting could have been better, but what it lacks in acting drama, it compensate with good action. Christopher Meloni dominates the role, and Dave Bautista adds that humor to the whole film. the story-line was intriguing, something you couldn't see from a mile away. the action scene were well choreographed, the bank robber had a great appeal to them. the movie had a sense of direction which is brilliant. All in All, an action movie lover's treat!"}, {"id": 5, "text": "The first 5 minutes are the best in the whole movie. The bad guys look great and the movie has a great look and initially there's a great feeling of tension...However, as the movie progresses, everything just seems to fall apart to the point where the last half of the movie is straight up terrible. As the ending unfolds, it becomes almost surreal how bad the script, direction, and acting all are.Overall, Meloni's performance is slightly above average, not great, but acceptable....why you would cast him and immediately give your movie the feel of a high budget episode of Law and Order is odd to me, but whatever.Bautista (who I loved in Guardians) falls flat, but that seems largely a fault of the script/directing.*spoiler* Greenier (who I've liked in Entourage, Devil Wears Prada) just seems really weird throughout the movie. I guess he was trying to portray the double-sided nature of his character, but he doesn't pull it off. His acting feels really stiff and contains zero emotion. The result is that I had absolutely no feeling one way or the other about what happened to his character in the end.Willis just sorta phones it in...not great, not bad. Just there.Despite the average performances by the big stars, the biggest problems are the directing, supporting cast, and the editing/cinematography. Casting is weird in that the better it is...the less you think about it because the actors don't feel like actors...they feel like they ARE the characters. However, bad casting stands out immediately, and that's what happens here. Pretty much everyone in a role directly tied to the plot just stands out due to how bad their acting or fit for the role is. Willis' assistant in the beginning seems so out of place in business setting that it's distracting. The girl playing the reporter feels like a Vinnie Chase fangirl more than anything else. The scene with Meloni and TJ is so awkward and forced...and the lines are terrible.Pretty much everyone else feels like they came straight off the set of a bad network drama....something that isn't helped (and the director should be aware of) by casting Meloni as a FBI agent. *spoiler* Once things move to the police station, we witness a scene so badly written, acted, directed, that you realize the movie is going to be really bad. This is compounded by the fact that the director also tried way too hard to make you care about the bad cop character (wife's cancer), his acting is so bad that it just takes you out of the movie.Combine the bad casting, acting, directing with bad editing and it just snowballs into a force that's damn near unstoppable. The problem is that it's not always all these factors all at once, but it's the fact that there's rarely ever a point in the movie where one of the factors isn't present (e.g. in a well acted, directed scene, the bad editing takes you out of it, in a well edited scene, the directing/acting is so bad it takes you out of it, etc)....The result is just a movie that feels really poorly put together throughout its 2 hour run time.And finally, the director was just not able to really tell the story very well. The entire movie feels like it was made by a guy who was following an outline that analyzed the cinematic elements of the Usual Suspects...the flashbacks, background being told by characters within the movie, etc...*spoiler* In the beginning we see that Willis' character is getting fed details about the crime scene in a way that immediately exposes him as being shady. This removes all suspense, intrigue, etc. that MIGHT have been built up around his character. It feels like the director was so aware how convoluted the plot was he felt the need to start spelling it out for you from the beginning, which only undermines any sort of mystery, suspense that he's trying to create....that the director doesn't understand this just doomed the movie from the get go.*spoiler*It's a shame because the movie looks great and if the plot had probably one or two less twists, (especially if they'd dropped the dirty cop plot line) and more depth given to the story behind those parts the movie might have actually been decent despite all the problems. Instead, the movie tries to pack in 2-3 movies worth of plot twists into 2 hours."}, {"id": 6, "text": "Watched this on Netflix, not expecting much. Well, it's really pretty good! I was entertained. The guy playing Mims really showed some range, and Chris Meloni was great as always. Recommended for an evening when there's sod all on the TV and you just want to relax and watch a decent film."}, {"id": 7, "text": "My idea of a top thriller is 'The Next three Days, 2010', just to be clear. Or 'Deja vu, 2006'. Something with a catching plot and (possibly) a girl to get.The present title isn't as good as those. If they were a 10 this is a 7, however: no less. The plot may be convoluted (I read other reviews' titles) and in this case it would take a convoluted mind to appreciate it (which is something that I might have). In any case Special Agent Montgomery (Christopher Meloni's character) is great and his partner (Dave Bautista) has his great moment when he asks him 'You're not gonna kiss me, are you?'.I found it standing out from many other thrillers I watched this year and I think that many people could like it."}, {"id": 8, "text": "So what I liked about Marauders boils down to Christopher Meloni's performance, backed up by a strong cast (including Dave Batista), and somewhat let down by Bruce Willis. Willis is in danger of becoming the new John Carradine (although he isn't there yet), and at points he appears to be phoning in his performance. But even at half-power, Willis is still a Pro and a Presence, so he doesn't sink the movie the way some reviewers would have you believe.What I liked 2nd most about Marauders was the sense of atmosphere - the machismo, the toughness, the sense of things starting to spiral out of control. The creators seemed to be going for the feel of The Departed, and got most of the feel right.What I didn't care for was the overly complicated and confusing 3rd act that defused a lot of the momentum and interest that the first part of the movie generated. It didn't ruin the movie, but maybe someone should have been a bit more careful in the edit process, or cut out one or two of the plot twists. (Which I won't give away here).To sum it up: I liked Marauders, thought it was well worth my time, but wasn't quite as good as it could have been."}, {"id": 9, "text": "Before anything else; lets note that the best character and by far the best acting was Detective Mims played by Johnathon Schaech who is barely credited in the movie. Marauders starts interesting with a bank robbery and a killing that looks like an execution. From there it grows more intriguing until the first half and then becomes a big mess very poorly resolved and full of clichés.Bruce Willis is an OK bad guy (it is not an spoiler; you can notice that on the first scene of the movie) but it is there for the check (which must be not much because he did not make any effort).Meloni is as always good, Batista is better than expected (he has many talking parts) and Greener is sympathetic not that important. However, is Schaech who really makes a difference in this movie. His tortured character and his un-tameable personality are by far the best of the script; sadly by the end it cannot avoid the clichés either.In brief: it is not that bad but is far from great"}, {"id": 10, "text": "Why the low score? Vastly underrated on all accounts. A fast pace with intelligent discourse and low key excellent acting, intriguingly complex characters and a plot than unravels perhaps too close for some peoples comfort. Anyone with a genuine interest of well produced, clever, politically inclined police-thrillers and a generally solid judgment would rate this film significantly higher than its current received score.The word conspiracy even mentioned in the real world triggers emotional fears and cognitive programming enough to blocks people from logic and from following genuine evidence. Perhaps films that picture the conspiracies in a realistic way run the risk of revealing reality without its mask of sanity? Watch and enjoy!"}, {"id": 11, "text": "You know a movie is bad when you can't even remember the title when it's over. This is one of those films. There is really good acting but the story is confusing and hard to follow. It's a shame, because there are really good attempts at character-building, but for some reason I don't care about these characters at all. Perhaps the problem is a little too much character-building across too many characters. And not enough story. Anyway, the end of the movie feels like a relief that the movie is finally over."}, {"id": 12, "text": "It's Sunday afternoon, nothing to watch. You are bored, this is your movie. If you want to watch something introspective, just go for the bridges of madison county. This is not a masterpiece but is good, and I'm an demanding watcher. There are a couple of bad choices at the end, and you feel that with a bit more of effort this movie could have been a huge hit. The plot is very intriguing to me, but I reckon it should be easier to understand it (just a bit easier, cause it may be a bit confusing).But in general I think it is truly a good movie. Entertaining but not a master piece. A huge surprise. I will never forget those masks! For me is a 7/10. Enjoy it."}, {"id": 13, "text": "Not a movie buff but since I live in the Cincinnati area I wanted to see this one. Enjoyed it. Could tell it wasn't a big budget movie but with the stars that were in it I thought it played out well. It kept me interested which is hard to do."}, {"id": 14, "text": "A professional robbery at the Hubert National Bank in Cincinnati draws the attention of the FBI. Agent Montgomery (Christopher Meloni) heads up the investigation. His wife was killed and tortured. It still bothers him. He is assisted by Agent Wells (Adrian Grenier) who also acts as a liaison with Mims (Richie Chance) a local policeman who skirts the law and has a stage 4 wife. The bank is owned by Hubert (Bruce Willis) sounds like Hubris whose brother was kidnapped and killed by rogue Rangers in Iraqistan. Wells is the new guy and former Ranger.The plot is a bit twisty. The theme is stated by Montgomery, Nobody thinks they're the bad guy as everyone believes they are working for the greater good as Wells calls it. I liked the film , but it keeps on on their toes, i.e. not as simple as a Seagal film. Decent acting and dialogue.Guide: F-word. Very brief nudity. No sex."}, {"id": 15, "text": "Marauders is surprisingly good for a modestly budgeted action/police procedural film with Bruce Willis in a paycheck performance. The plot is satisfyingly Byzantine. The characters are three dimensional with inner demons and conflicting loyalties. Christopher Meloni delivers a solid performance in the lead. He's apparently done a lot of television work that I've never seen, but eclipsed Travolta's performance in I Am Wrath. Solid performances also by Grenier, Schaech and Ochse (although the skullcap isn't convincing). The Cincinnati locations are effective. Action scenes are limited in scope, but done competently. Lighting is effective, but cinematography is marred by excessive reliance on jiggly-cam, although some shots use a rigid camera mount of some type. At 107 minutes, it doesn't seem long and could even benefit by extending it to two hours to give more time to develop some of the subplots. Some of the nuances of the plot and characters could have been developed more fully."}, {"id": 16, "text": "Every scene it's raining. Is Cincinnati in a rain forest??? Very distracting Count the scenes with rain A few with wet streets Really?? Might have been an awesome movie otherwise"}, {"id": 17, "text": "01/25/2019 I think that one of the reasons this movie was hard to follow was the fact that so many of the dark haired actors looked alike, confusing the viewer as to who did what? Bruce Willis was used to draw an audience draw and had only a few minor parts to play. Good watch, just confusing storyline. Bon Appetit"}, {"id": 18, "text": "And there is a least three times where you can actually see the once great actor have the self realisation that he has finally sold out, and is heading toward the same, dead headed career that Seagal has been in for the last 12 years.FBI agents investigating a series of bank robberies initially suspect that the business's owner might be responsible, but they later realise that the heists point toward a much larger conspiracy. As you'd expect by now, Willis has the largest space on the one sheet, but anyone who thinks that he is the lead should take great caution with this, he's merely in it because his name will shift units, and he's a travesty. A complete sell out who is clearly doing this for the money.And I'm ranting because this is an actor who starred in the greatest film ever made (Die Hard), and not only made Hudson Hawk, but survived such a bashing from the critics (and I personally like that film), he then came back to make some wonderful films in the nineties, and even survived Color Of Night.The film itself is terrible, a wannabe Heat featuring a plethora of boring characters, each with their own little vendetta, and a gang of crooks who look like rejects from The Purge films, with some impressive sound effects.But as usual, everyone is suspecting everyone, Willis spends his minutes on screen talking about spiders, and looking like he's girl so etching in his eyes, and Meloni, good as he is, appears to be in a totally different movie.It's poorly made, one scene during a bank raid is so poorly edited, you can actually see the robbers pointing guns one way, when the whole bank (security and all) are standing behind them apparently oblivious to everything.And Jonathan Schaech plays a cop who is married to a woman who likes to wear a bald cap......badly.It's a crying shame that Willis has become such a sell out, because there was no reason for him to resort to such filth like this, he's still A-list, and hopefully this Death Wish remake should give him his motivation back.And before you say 'but it's directed by that hack Eli Roth' don't forget who directed the original........"}, {"id": 19, "text": "Just a bad movie--- bad. The actors are there the plot is there, it is just a bad movie. You find yourself annoyed but needing to see it end. Don't live in Cincinnati because apparently it rains every day. Meloni and Adrian were OK, everyone else was bad. Watch if you want but it was bad- Made me create an account just to let people know. Asks for 10 lines for review so Bad Bad Bad. I could type it endlessly. The plot seems like it would have made for a good TV series or something. Every scene it was raining, didn't matter day or night. Bruce Willis is just not good in this film and Meloni has to many one liners and not enough background for you to care about his character. I'll wait for Bourne."}, {"id": 20, "text": "First things first, if knitpicking is what you are looking for, this is not the movie for you. Now that we have that out of the way, here goes. I have never written a review on IMDb before but seeing the low ratings ppl are giving to this one I just couldn't hold back.Its a new storyline, with good music score throughout and a well paced movie. Multiple plots keep you hooked and misguessing, which I really liked. Very well directed and acted, Batista wasn't as rusty and Bruce Willis isn't trying to pull of stunts too big for his age. Has light action, thankfully no love angles with a tinge of emotional side plots making you experience the central characters' mindsets - Definitely worth the time."}, {"id": 21, "text": "The start is very good. A bank heist is carried out with precision by robbers wearing aggressive masks and using high-tech devices.It then plunges into a boring and incoherent mess with so many overlapping story lines that the script must surely have been written by a committee. I couldn't follow what was going on for most of the movie.The ending is stupidly bizarre.Poor and only worth 4 stars."}, {"id": 22, "text": "To summarize: Super thrilling and interesting plot combined with great actors.I don't understand why the movie has such bad rating and bad reviews. I'm guessing many people fail to follow the plot, which I'll admit wasn't the easiest, but if it was too easy to follow it wouldn't have been as thrilling. I've rated Heat 10/10, and while I don't think this movie is quite on that level, I think it deserves a 9. I should mention that I'm a fan of heist movies, but fan or not, this is a great movie!"}, {"id": 23, "text": "I enjoyed the story's mystery and intrigue. The story line appeared to misfire at times, but each played itself well in maintaining the enigmatic subtleties. The main characters and flashbacks kept me guessing at each turn and twist. Meloni was at his best. Tough, focused, and unrelenting....like Law and Order SVU on steroids. Willis was a bit of a sophisticate, albeit suspiciously throughout a scoundrel. It was easy to dislike him...along with a nagging suspicion that I could be wrong.Grenier's stoic character kept me guessing who he really was, and ultimately surprised me. Converse to Willis, it was easy to like him...along with a nagging suspicion that I could be wrong."}, {"id": 24, "text": "Marauders (2016 release; 107 min.) brings the story behind a bank heist. As soon as the movie opens, we are in the midst of a bank robbery carried out by 4 masked guys. The Hubert National Bank's manager is executed during the heist for reasons unclear. We then switch to the Bank's name sake and President, Jeffry Hubert (played by Bruce Willis). From a phone Hubert makes we get the impression that Hubert may be involved with the heist on his own bank. Meanwhile we also get to know FBI Agent Jonathan Montgomery (played by Christopher Meloni), whom we see in fierce competition with the Cincinnati Police Department relative to leading the investigation. Is Hubert actually involved in the heist? How will the FBI and CPD work together, if at all? At this point we're a good 10 min. into the movie, but to tell you more would spoil your viewing experience, you'll just have to see for yourself how it all plays out.Couple of comments: this is the latest movie from up-and-coming American director Steven Miller. Here he tackles the action crime-thriller genre. From the get-go, we are thrown into the action. This is a plot-heavy movie, so to give away more of the plot would truly be inexcusable. Let me just offer the general observation that the plot line gets convoluted, perhaps even too much so. Bruce Willis has a fairly small role in, and the true headliner here is Christopher Meloni, best known for his work in the various TV franchises of Law &amp; Order. The script has some great lines. When Hubert is asked by Montgomery whether he leans to the right politically, Hubert sighs Not this year, ha! I would be remiss if I didn't point out the movie was filmed entirely (but for the last 5 minutes) in Cincinnati, and the downtown skyline and riverfront get played up big time throughout the movie. Being in Cincinnati, it was fun to be able to pinpoint where certain scenes were filmed (for example, the opening bank heist was film in the beautiful Dixie Terminal, across the street from where I work). Also, it rains during the entire film, and living in Cincinnati, I can assure you that while we got our fair share of rain, it's nowhere near as bad as the movie makes it look like... Lastly, there is a great electronic-based score from composer Ryan Dodson (who has scored several of Miller's previous films).Marauders opened at my local hart-house theater here in Cincinnati this weekend. The movie has gotten a lot of attention here due to having been filmed locally, and the Saturday early evening screening where I saw this at was attended nicely. The audience seemed to enjoy the movie, laughing at the right times (for example at that line Not this year). I doubt that this will play long in theaters, as the movie is okay but by no means outstanding. This may find a second life instead on Amazon Instant Video (which also premiered it this weekend), and eventually on DVD/Blu-ray. I would've rated this 5 stars, but am adding an extra star due to having been filmed in Cincinnati."}, {"id": 25, "text": "I'm not a film geek and I don't pause movies or watch them in slow motion to look for mistakes but this movie is full of noticeable sloppiness with casual watching. Some examples: a bald headed woman is obviously wearing a rubber bald mask as the bunching up and wrinkling of the rubber can be seen on the back of her head easily several times. One man smashes in a glass table three times with a very loud glass breaking noise each time even though we see that the glass disintegrates on the first blow. The sound is loud and really seems out of place as there is obviously no glass to smash the second and third strike. The bank robbers sneak up a staircase in a bank but the camera tracks them slightly too high and we can see bank full of security guards and people (or actors) behind them who don't seem to notice, for quite a while, several masked heavily armed banks robbers. There's more but I think you get the idea."}, {"id": 26, "text": "God-awful movie/story line/plot/mistake. Really terrific actors in a really horrific movie. Plot (which could have made a good movie) is all over the place. Too many random elements poorly tied together. Note that IMDb posted no info about production budget or income. Know why? Because this movie never happened. I have deleted it from my memory. I took it back to Redbox and the little guy inside the kiosk said No way! Keep it! Here's your money back! So I tried to use the DVD as a Frisbee but it wouldn't fly...just like the movie. Now I think I'll just use the disc to make nice round circles, like big zeroes, which is the rating I'd have given this movie if IMDb allowed it."}, {"id": 27, "text": "I gave this movie an 8, and ya maybe i was overcompensating a little for the negative reviews, but i do think this movie is much better than the 5.5 score it currently has. Bruce Willis called this one in from his trailer after a night of binge drinking so if you're looking for John McClane action jackson moves and pithy one-liners from him, you wont find them here. His afternoon stubble may have been his best feature in this film. Chris Meloni was solid, as was Entourage guy, and i'm a full on fan of Dave Bautista. There is a decent amount of violence and good pacing to the movie. It's definitely watchable in my opinion."}, {"id": 28, "text": "Whilst never an obvious Oscar contender, this movie is a far from terrible as some of the reviews here. Yes - the plot meanders a BIT - but this film is a lot easier to follow than some of the pretentious crap that people post such accolades for. Previous post mentions cinematography - clear and very watchable. Good cast, Bautista seems to have a sense of humour that will hopefully be exploited in his future flicks. Willis - to me is always Willis - and that is fine. I spent part of a lazy Sunday afternoon watching this and - enjoyed it. I will agree with some other posters that is felt like it could have been a bit better in areas - but - I am an average Joe and couldn't explain the why's and where's. Enough armchair critics already on this site."}, {"id": 29, "text": "It's a shame that so many people have rated this film so low just because they didn't get it. It's witty, has a great plot &amp; is easy to get so long as you know who the characters are. Don't miss out because of idiot reviews."}, {"id": 30, "text": "This movie starts out with some Horrific acting, then it moves on to some terrible acting, then with some horrible acting and an even worse and almost pathetic plot twist.. not even the cinematography is redeeming in this.. they do slow motions shots for what seems no reason whatsoever.. this could have been a good movie.. it truly is crap.. honestly i could write a better movie while I'm taking a dump on the toilet.. maybe they thought if we put these guys in some cool masks it will make up for not having a real plot, or any plot twists or any shocking moments, or any depth... or anything that is really necessary for making a good movie.."}, {"id": 31, "text": "I'm still consistently being suckered into Bruce Willis films having been a fan of his for eons and now he does this straight to VOD stuff where it's barely a cameo. So I knew to expect this. This isn't his worst tiny little role but he definitely isn't in the forefront of the picture. One professional review I read said that the saving grace for this movie was Christopher Meloni and that is so incredibly true. He is easily the best thing about this. In fact, ironically, this is one of his best performances! He really gives it his all and turns in an A+ role in a C- minus and that's being generous. It does have some comparisons to a poor man's Heat and has plenty of great action and a decent story that isn't written terribly well but the concept is there. This is one of those movies that actually has a lot of potential but due to a lack of good writing and directing, it falls apart and loses it's ground. Still it's entertaining enough and I wouldn't have kicked myself if I had paid to see it in the theater. It's forgettable but decent for what it is.So as I already mentioned Christopher Meloni nails this role. He's tough as nails and reminds me of a young Bruce Willis when Bruce Willis gave a crap. He is believable and tough and perfect in this part. Bruce Willis has a total of probably 15 mins and certainly the best scenes are between he and Meloni. This makes Meloni look like an A-Lister and comparable to like Pacino and DeNiro coming face to face in Heat only not nearly the power. Dave Bautista likely could have been good but is so excruciatingly underused that he's barely supporting. I'm not sure why they didn't develop him even a little bit. Adrian Grenier had the best opportunity to have a really great character and you see glimpses of it but he looks bored and the character is written like garbage. Honestly there is a 10/10 movie buried here somewhere that someone on the production team screwed up major. The dynamic between Meloni and Grenier should be near perfect and it's barely tolerable. The rest of the supporting cast are barely there. So the only person who gets any decent character development is Meloni and that might actually be more because he gives it his all.Steven Miller makes sense being attached to this. His list of films is terrible and that's being generous. The best on his low budget horror flick list was the remake of Silent Night which was decent campy but his other films were rotten that I saw (Under the Bed, Aggression Scale) I don't even know how he's directing but they don't give him much of a budget that's for sure and I imagine Marauder's was the big time for him. There is definitely more worthwhile films and it's unfortunate Meloni lost out on potential for a very poorly written and directed film. Mr. Willis...stop please. Just go back to doing something you know. If you don't give a crap anymore, retire. Your fans ache! 6/10"}, {"id": 32, "text": "It's not unusual for me to scratch my head over the ratings here on IMDB, but it's usually in the other direction.Marauders is a well written movie. Christopher Meloni gives an amazing performance. In fact, he gives a performance better than any A-LISTED actor I've seen in the last 20 movies!Bruce Willis has become the new Nick Cage. You never know if a movie he's in these days is great, or complete garbage. One thing's clear, he doesn't have the motivation he once did.This movie is certainly worth an hour and a half of your time. It moves at a good pace, never bores - and keeps you thinking the whole way. Great performances by Christopher Meloni, Johnathon Schaech and Dave Bautista make the movie worth seeing."}, {"id": 33, "text": "I like the concept of cops and robbers. Throw in a heist and off we go. Add a back-story and really gets interesting. Add more stories on top of that and you lose me entirely making go back to the first premise of cops and robbers. Good movie except at some point you ask what is going on? I am still not sure what role Bruce Willis plays either. Watchable but pay attention or you will be writing a review like this one. By the way, I have seen it twice and still had to find out what was going on especially in the end. Enjoy"}, {"id": 34, "text": "Movie started off great. Lots of action, good story line. Then someone decided draw up the largest storyboard in movie history. Does righting a wrong make sense when you create several more wrongs. Not a horrible movie overall. Just disappointing"}, {"id": 35, "text": "It's a movie, like so many recently, that Bruce Willis took money to be the main attraction but doesn't have much screen time. It features an implausible and convoluted storyline that doesn't make much sense in the real world. It gets worse as it goes along, trying to be more convoluted, creating storyline twists and turns, I suppose to make it more complex. Instead it just becomes stupider. The ending is absolutely horrible and made me sad that I watched the entire movie. Don't waste your time."}, {"id": 36, "text": "You see the names tagged as the Stars in this film, and it makes you want to watch it. Regardless of whomever you think is in this film, Meloni is the star and he F...ing kills it!! Bravo! I have a new found respect for your talent.... I get it. I am a studio, and I want to sell a movie... give a big check to a name or two, to get it moving. Anymore, I watch these flicks with BW to see who is really doing the acting. Because BW phones this one in like so many others. The film is not worth the 6 stars I gave it. I gave 6 to Meloni. I look forward to Meloni as a lead more often going forward. Again, great job. Yes, I have decided to put my ratings on the stars in these B movies, not the movies themselves. Why should a great actor be rated by a not so great film. CM-6, BW-2, DB-4."}, {"id": 37, "text": "Movie wasn't too bad...the constant raining was really annoying as hell.SAIC was hilarious...loved the 'tude"}, {"id": 38, "text": "After watching and reading the reviews, the only bad thing I can say is that I need a towel and change of clothes. So much RAIN!Fun crime drama, worth a watch, and I don't see how so many reviewers are confused by such a simple plot. Simple minds I guess.Give it a watch, take an umbrella!"}, {"id": 39, "text": "If you have Netflix, you there are a bunch of Bruce Willis movies from the past 5 years or so. Same story each time. Bruce Willis makes a cameo in an awful film and gets to cash a check. This was far, far from the case. Very good cast. Very good plot, though maybe a tad overcomplicated. This was made in 2016 and Netflix offers a ton of his more recent movies..maybe I justmissed it? While Bruce still wasn't the star, he showed up plenty. The supporting cast carried the rest very well. Highly recommend."}, {"id": 40, "text": "Honestly the bad reviews make no sense to me. It's not a 10 but a decent 8, had to upgrade to make up for the low numbers because it's not fair.I think ALL actors did a great job, cinematography and editing was great and the storyline was entertaining. Take a chill pill y'all this was a great movie."}, {"id": 41, "text": "What a terrible movie. The plot makes no sense. The story was not complete. No clue who's mad at who and why. What a ridiculous movie. I'll say the acting was fine but the story line has absolutely no merit. Don't waste your time on this."}, {"id": 42, "text": "Much the same as the majority of reviews here. Good solid all round movie with a decent story and great cast. With a little more cohesion, a slightly longer run time to balance out some of the plot threads or a slightly cleaner edit it really could have been an amazing 10/10 movie. It's just lacking a little tweaking. Definitely give it a watch. Worth the time. Don't understand the low rating though. Deserves to be sitting a bit higher."}, {"id": 43, "text": "It's got a great plot, moves along quickly, held my interest. Liked the cast a lot, and Bruce Willis was terrific in this. He played against the action-hero type he's normally cast as. It was an intriguing character, and I really enjoyed his acting in this. I kinda wish he'd done more like this when he was younger! Christopher Meloni was gritty and a hard guy. I think I'd call this a noir thriller. Standout acting, imho, was Johnathon Schaech. The film is pretty violent, real blood and guts, as opposed to action-film blood and guts, but it is necessary, I think, and it isn't overdone."}, {"id": 44, "text": "Well, this is another one of those straight to video films, and while it started off pretty good, it sort of nose dived about half-way through. Well, not so much so, but still, like a lot of films it sort of ground to a halt and left me rather dissatisfied with the conclusion. Not to say that this ended up being pretty bad, not at all, it was just that by the time I got to the end I was quite glad that it was over.  So, the film is about a group of bank robbers that seem to be targeting specific banks, and killing specific people. The FBI gets involved pretty quickly, meaning that what's happening is pretty serious. The robbers are quite professional, and are certainly not your average street thugs. Further, there seems to be a bit of bad blood between the feds and the local police, but then again that seems to be a common trope.  In a way the mystery surrounding it starts off really good, especially with the bank robbery scenes. Unfortunately, once the third one happens, everything goes pear shaped, namely because the FBI happen to be there as well. Then again, that tends to happen in these types of film. Also, the fact that there are bullets flying everywhere, and the major characters seem to escape without injury sort of defies belief.  This is pretty much where the film grounds to a halt. Then again, that's the thing with a lot of mysteries because once it becomes apparent what is going on then, at least for me, the best part of the film is over. Actually, I suspect that it has a lot to do with the creator's ability to create a pretty awesome twist, and unfortunately, in this case, it didn't happen."}, {"id": 45, "text": "I really loved the movie, pretty decent plot and you are really curious about the suspects"}, {"id": 46, "text": "I agree that some elements did make some of this score less. The robbery scenes were classy and some actions could make you wonder what was underlying in the motives.The 'BAD GUYS' did move about like an organised swat or snatch team so the thinking of rogue was not out of place. True if you then try and put the pieces together it does seem to have overlaying twists. This might not have been a bad tale to tell in a mini series as I am sure some fleshing out might have taken time.The ending perhaps did require wrapping up without satisfaction for the viewer. Luckily our lead FBI had little ambition due to his losses in life and repeated something one of the baddies had said earlier in the tale prior to killing the banker.The ROOKIE FBI agent relates an incident in his service days that is meant to help explain the underlying reason for the robberies but that did not fully come across.We have a sort of conversion by the police detective Sgt in which he dies through a perfectly delivered throat shot. What struck me as wrong is that his beloved? wife will now DIE ALONE.Another question I might have is how powerful could the Banker be in Mexico. His criminal involvement was surely fully known and all the other illegal activities also being listed daily through a federal investigation.My Mini series might have me exposing box by box that extra special rather minor bank of the franchise. Exposed like the Blacklist or Blindspot 'tattoos'. A failed attempt at a supernatural series Alcatraz tried to give us the stories of all the inmates.I was okay with the superficial story and how the action moved along especially the masked crew and feel the rating is a little low. Willis I do like but there was nothing written here that might show the Willis we know. His demise at the end probably did not have any affect on his fan base if watching. Although not portrayed as EVIL he was a bad man. Maybe Willis cannot actually play evil like the antagonists in the die hard tales.I have watched 'action' movies I felt less about get much higher ratings."}, {"id": 47, "text": "First 5 minutes of this movie started out great! The longer I watched it the more confused I got. The script was completely convoluted. I thought maybe if I kept watching it maybe the movie would redeem itself with some kind of amazing twist. Nope...the longer I watched this movie the more I kept asking myself when this train wreak of a movie would end. I did finally end up watching it to the end ,but by the time I got there I was so disenchanted by how crappy this movie was that I no longer really cared about the twist...SO HORRIBLE!baaaaaaaaaaaaaaaaaa Aaaaaaaaaaaaaaaaaaaaaaaaa Aaaaaaaaaaaaaaaaaaaaaaaaa Aaaaaaaaaaaaaaaaaaaaaaaaa D!"}, {"id": 48, "text": "Overdramatic and overcomplicated for no reason)anyhow, is a solid one time watch!"}, {"id": 49, "text": "Everyone else's comments about convoluted plot are right.The last 10 minutes felt rushed and trying too hard to wrap everything up neatly. Ruined the whole story because of it.Bruce Willis felt unnecessary for the role and his acting showed it in how disinterested he was. Not just about the character. Just seemed like they could have had someone else who portrayed disdain for everyone and paid them less.And why was it raining, hard, the whole movie?! Seems like rain like that would have had the cops more worried about flooding than bank robberies.Only worth it if you're interested in being disappointed by endings and have nothing better to do.I was sucked in by the names on the poster and cause I'm a sucker for bank heist movies. Definitely a 2 star movie."}, {"id": 50, "text": "Stupid music. Poor acting. Poor editing. Nonsense story. Does not explain anything."}, {"id": 51, "text": "Enjoyed it or I would not have watched the entire movie. However, my biggest complaint is that there is so much background noise that it drowns might be dialogue."}, {"id": 52, "text": "What the heck man... Bruce is consistent with puting out 'B' films... The only thing this film has going for it is the criminal cool costoms . Lets be fair.. I didn't finish, but after 3/4 the way through, I was sure how it couldn't get any better.Any film that Bruce W. is in it is better to pass on."}, {"id": 53, "text": "Marauders is full of bank robberies in Cincinnati where the only bank branches that get robbed are owned by Bruce Willis. FBI special agents, Christopher Meloni and Dave Bautista, are brought in to investigate the string of deadly heists. The storyline was complicated and all over the place. I wasn't sure what Marauders meant but it sure wasn't able raiders. If it wasn't for Meloni's performance it just felt thin and not compelling. I liked the action sequences but the acting and direction was awful. Skip this horrible movie."}, {"id": 54, "text": "This movie is absolute hot garbage. The acting is so terrible I kept checking to see if I were watching a international bootleg remake. Even the A, B, and C-list actors are just absolute trash in this, so I assume that is due to the directing. Not worth wasting your time with this unless you want to hear every single cop cliche known to man in one single movie, possibly in the first half-hour. Garbage."}, {"id": 55, "text": "Convoluted, unbelievable plot. Some O.K acting. Seems to send the message that anything is O.K. as long it is for a good purpose. The interaction between the feds and local police is so far-fetched and wrong as to make the whole movie a joke. Why does Hollywood have to put so much senseless violence in movies and then seem shocked when real people kill real people? I tried, but didn't make it to the end."}, {"id": 56, "text": "Not a horrible movie but the storyline became too convoluted by having just too much back story for nearly every character. Action sequences were fairly well done and for the most part the acting stayed fairly solid through out. Ot would have made a much better series than a movie with all the stories within stories"}, {"id": 57, "text": "This movie has so many half-ass plots and subplots going with consistent rain, it's a bummer. A complete jumbled mess with high energy acting (that's not a good thing). Miller strikes again!"}, {"id": 58, "text": "Start off by saying i used to love a bruce Willis movie but hes the new nick cage who takes every part and just meanders through it. The movie was pretty good for a while then the plot goes crazy and then a stupid ending. So if you're bored nothing to watch I guess it'll do otherwise watch heat again. Oh Bautista was excellent and happy was decent as well but this was a mediocre movie at best."}, {"id": 59, "text": "Not worth seeing twice or ever again but heck, it was a good film. Had good guys, bad guys, good LEOs, bad cops , long-suffering wife, murdered wife...what more could you ask for. AND Bruce being an bad mofo again. Lots of cliche...you know who's going to live and who is going to die right at the start."}, {"id": 60, "text": "Plot is ok and it has a fairly good cast. The BIGGEST problem with this title is the sound director and editor. They should be shot!!!"}, {"id": 61, "text": "11/03/2020 An enjoyable hour and a half of movie time. All excellent actors playing out a decent storyline. I liked it and suggest that you give it a try? Bon Appetit'"}, {"id": 62, "text": "Lost me at Bruce Willis trying to be philosophical about a spider. About 7 minutes in. Rolling my eyes. Ugh"}, {"id": 63, "text": "It's 75% fun. Christopher Meloni and Dave Bautista have awesome chemistry. Johnathon Schaech outshines in his portrayal of a conflicted officer. Everyone else isn't up to the same caliber of acting and it takes you out of the movie.Bruce is always great."}, {"id": 64, "text": "Couldn't have gotten more complicated. Too many players for one. The plot and storyline.. I just don't know. Poorly executed for Suren wouldn't recommend wasting your time. Thumbs down👎🏽"}, {"id": 65, "text": "So, that's the result. A mediocre movie with a cool idea but a rushed script and horrible ending. It starts fine, but after the first 15 minutes everything goes downhill. Even when you think it cant be worst, you reach that low budget crappy ending."}, {"id": 66, "text": "Im really disappointed form bruce movies Not that much"}, {"id": 67, "text": "The story is convoluted and lacks a logical flow. The screen-writing is poor by times, much of the dialogue is tedious.Some of the acting is okay, for example Johnathon Schaech performs very well. But others in the main cast perform poorly, with Christopher Meloni over the top without the slightest subtlety, and Bruce Willis seeming flat and uninterested.The action scenes are reasonably well-directed, which makes the movie at least watchable."}, {"id": 68, "text": "Here's The B-Movie Lowedown on Marauders (R - 2016 - US)...Somehow I lost interest about halfway through!Genre: Action/ThrillerMy Score: 6.1Cast=8 Acting=5 Plot=7 Ending=7 Story=6 Action=7 Pace=4 F/X=7 Thrill=4 Twist=6When a bank is hit by a brutal heist, all evidence points to the owner and his high-powered clients. But as a group of FBI agents dig deeper into the case - and the deadly heists continue - it becomes clear that a larger conspiracy is at play. I'll go to Hell, so you can go to Heaven. Bank robbers, Corrupt cops, Murder, FBI task force, and a rogue Army Ranger unit...it's like they threw the plots from Point Break, The Departed, and Basic In a blender and hit frappe. There was nothing I didn't like really...I just lost interest about halfway through and wanted everyone to get shot in the face. Unfortunately, the movie didn't live up to my expectations...keep yours low if you want to watch it."}, {"id": 69, "text": "Set in Cincinnati,Marauders weaves multiple plot strands together in a confusing and unsatisfying action-thriller.We see the action unfold primarily from the perspective of an FBI agent (Christopher Meloni) investigating a string of well-executed bank heists. The expert and well-drilled team of robbers clearly has had special ops training, and Meloni's investigation is compromised by either a corrupt or rogue police detective. The trail eventually leads to a tycoon bank executive played by Bruce Willis. But who actually are the Marauders? Here is where the film stumbles badly and never recovers.The script for Marauders was nearly impenetrable with confusing relationships among the various task forces and characters that were not fully fleshed out. It seemed as though each character was struggling with a traumatic incident from the past. But the script never completely coalesced into a compelling and credible narrative. The result was that a ridiculous ending was tacked on in order to resolve the loose plot elements in Mexico! The most interesting performance in Marauders was turned in by Meloni, who was haunted by the violent death of his wife, who was also involved in law enforcement. But, once again, the scene where Meloni confronted his wife's killer in prison was not believable. Much of this film involved gratuitous violence and unpleasant characters. In the end, the only really engaging scenes were those of masked figures creating mayhem and madness in banks."}, {"id": 70, "text": "For once Bruce Willis is not the untouchable superhero. This time he's just a big boss banker. He doesn't have that of a big role in the movie. The movie starts good, with a lot of action but as the movie advances you realize that it is kind of boring. Too complicated to be entertaining. Well to me it was at least. I found myself yawning a lot and I couldn't keep being interested in the rest of the story. The actors are not bad though, it's just the story that is not good enough. It's all too far fetched with too many characters and twists. I guess some people will like this movie, but I prefer a good action movie where you don't have to overthink then this one. Not my cup of tea."}, {"id": 71, "text": "Marauder starts off brightly but then becomes a muddled mess. Bruce Willis plays Hubert a corporate bank executive whose banks are being targeted in elaborate and clever armed robberies.It seems Hubert was involved in a conspiracy that led to the death of his younger brother by the US military. The FBI led by Christopher Meloni and Dave Bautista follow a trail that leads to crooked cops, politicians and even FBI agents.Even when the film's various strands come together it just leaves you confused. It really is a nonsense conspiracy action thriller. Willis is used sparingly as he is on his infamous $1 million a day contract and Bautista is just making a glorified cameo as well."}, {"id": 72, "text": "Pretty watchable movie. You get some action scenes and an entertaining time. Don't expect a great thing but it is a decent piece of work."}, {"id": 73, "text": "MARAUDERS is a typical digital thriller with various bored-looking actors turning up to contribute nothing performances while the brunt of the screen time is given over to less well known performers who work harder. This one mixes in the usual bank heist nonsense with a more convoluted corruption plot, and it's all rather complex. The main problem I had is that I didn't particularly care about what was taking place, due to the cookie-cutter digital look and the blue greyed out visuals. Bruce Willis has a small role alongside Dave Bautista, but overall this is the kind of film you'll forget about the day after you saw it."}, {"id": 74, "text": "I can't believe the low rating given to this movie. It's one of those little gems you stumble across and thank goodness you do. Compared to the drivel out their at the moment it was a refreshing change. Good story, good acting,gritty, very watchable. I can only surmise that there is an army of trolls out there paid to make some movies look good (when they are absolute garbage...Arrival being a case in point OMG) and good movies look bad."}, {"id": 75, "text": "Do not be a hero. After a bank heist occurs FBI agent Montgomery (Meloni) is looking into who was behind it. After his team begins to uncover more and more clues about those involved the start to become convinced this is deeper than just a rash of robberies and more than just the gunmen could be involved. This is watchable and I did like it OK, but nothing more than just a generic action movie that has been redone over and over. Once again, like a broken record, this is a movie that puts Bruce Willis' name and picture on the poster and all the marketing, but he is in the movie for about 5 minutes and pretty much only in one location. As far as B action movies go I have seen much worse. This, again, isn't a bad movie at all and is worth seeing, but too generic and predictable to say this is a good movie. Overall, decent and OK with no real surprising elements. Mindless action that is entertaining, which is all you are looking for sometimes. I give this a C+."}, {"id": 76, "text": "-Plot- The plot of the movie is good the idea is great but the way they present this to us is beyond worst.-Cast- Cast overplayed on all characters. For all the big talk on the big plot all is under presented in a big way.-Movie- Most of the scenes are not entirely thought of , they just seen as random placed event just to fill the gap in the script. I'm not going to talk of reality for it is non existing.-My Review-I can say more for the movie but don't want to put spoilers. Overall it is a bad way to kill time."}, {"id": 77, "text": "This movie is so bad. The actors are good (Bruce Willies, The FBI agent and the actor from Entourage) but the movie is so predictable you have the feeling through the whole movie that you have seen this already. The script is really bad. Give this a miss and watch something else instead."}, {"id": 78, "text": "My review is based on the 60-70 minutes of the movie I could watch before I dozed off in the theatre. The film starts well with a slick action sequence and the cast carries the situation well in the subsequent scenes. Unfortunately , the director loses the plot as the reel rotates and very soon , a promising film becomes a drag. At some point of time you stop caring about the who and why  and start figuring out what. The simple story has been needlessly complicated. The long and short of it is that this plane never takes off after an impressive performance on the runway."}, {"id": 79, "text": "Soooo many plot holes. I was expecting a lot more considering the cast. Oh well, at least I had a nice bottle of wine."}, {"id": 80, "text": "Wait, what was this that I just finished watching?The film starts very promising. The opening scene with masked robbers of the bank should have set the pace and tone for the film and although similar scenes are in the film, it was not as good as the first one. But then I wonder what was that all for? I do not remember a film where I was wondering if all the film was actually telling the story for nothing and it does not make sense - anything in the film. The ending of the film is so puzzlingly empty and stupid. Who is the bad guy or guys and who is bad? Why are those women even mentioned in the film ( the cancer one and the murdered one?!) when they play nothing nor explain anything. A change of heart just like that for a robber? And seems that those who work for the USA government hate the government more than anything? Too many stories in the film which lead to nowhere. Too many stories in the film which are completely useless. It seems like they had a great idea ( and I do see it) but then they forgot it and made whatever ...This could have been a great one, but it is just blah in the end. Rating four from me."}, {"id": 81, "text": "That shooting a movie in the dark and rain is a cheap trick and bores me after a while. I never could figure out what was going on or who was doing to what but after 30 minutes of almost total darkness and rain, I didn't give a damn. Don't know whether the acting was good or bad because everything else was so distracting."}, {"id": 82, "text": "This movie is so messed up and incoherent that I could barely sit through the end. It's like a music video for a Kanye West song in all the glory and splendour, yet completely shallow in the inside.The single bright side is Christopher Melloni, which proves himself (once again) as a solid actor and a good choice to carry a leading character in an action movie. Everyone else is below mediocre, including Bruce Willis (who probably had to be physically coerced to take part in this)."}, {"id": 83, "text": "I will admit the film had a rocky start, but as the story picks up momentum, it does actually get better. The story was interesting enough, about a group of military buddies robbing banks and rich people. The ending is a complete twist though, definitely the most interesting part of the film.Being set in Cincinnati was different, not too many heist movies there. Maybe that's why the critics didn't get it. I don't know, but the actors in the lead were not bad. Christopher Meloni played his part brilliantly, as head of an FBI task force. And Bruce Willis as the antihero millionaire was bad-ass. He was very convincing.A heist movie you shouldn't miss."}, {"id": 84, "text": "Marauders is a hyper-convoluted heist movie that's every bit as generic as its title might suggest. Set in Ohio Cincinnati the film doesn't have so many compelling sequence. The aesthetic to this piece works well, as it's always raining, enforcing the film noir elements that exist. The difference between classic films of this genre and this offering, however, is the fact that in this title when the characters walk into a building their clothes are suddenly dry (small details). Meloni shines as the film's hardened protagonist, an archetypal detective, an anti-hero, stoic and complete with a murky past but somebody the viewers always root for. It helps that he's coming up against a seemingly formidable collection of adversaries, and in a genre where the hero is only ever as strong as the villains, it makes all the difference."}, {"id": 85, "text": "This movie is not like Heat - and then it is somehow. A very nice tangled and twisted story, where not until the last scenes the story and plot is unvieled. Sit back and enjoy!"}, {"id": 86, "text": "Good svript good cinematography good acting. Just something missing here and there."}, {"id": 87, "text": "The Bad Half: Unnecessarily over convoluted plot. And although at the end I understood who did what and why, there were still too many questions left. Too many loose ends. The last 10 minutes felt weird, as if the production was running out of money, so they tried to close all knots in a hurry.Confined spaces, and generally low number of people on set, resulting in a more low-budget, B-grade feel.Bruce Willis. His character lacks authenticity and feels artificial in any scene he's in. It seems like Bruce Willis didn't care too much for the role.The Good Half:Christopher Meloni, Adrian Grenier and Johnathon Schaech. Their character felt very real, and I could rely to any of them. Their character development was very good, so I clearly understood who each person is. Moreover, it seems that their script was well- written since what their said was mostly in-place (at least as the plot went on and not looking back in retrospective).There are also several good camera movements which made nice additions. The action was far from exceptional but in most cases it had a tight grip. One of the action scenes was actually very tense, with a good score.I don't know whether to recommend this movie to anyone or not, but I certainly didn't feel it was a total waste of time."}, {"id": 88, "text": "It's one of those movies that Bruce Willis is staring in. His face is all over the poster. Too bad he's not in the movie as much. He took a paycheck for 2 weeks of work and 20mins of screen time.I would think that having Christopher Meloni, Dave Bautista, and Adrian Grenier in the movie would be enough to attract attention, but I guess it's not enough to get the movie in the theaters.Meloni leads the cast as an FBI agent searching for some bank robbers that seem focus on steeling money from Bruce Willis, who owns the banks they been targeting.Bautista and Grenier are on Meloni's team as they investigate a tangled web of corruption from the bank, local law enforcement and even the military. It's a compelling thriller that keeps moving despite all the obstacles in Meloni's way.If you were a fan of Meloni back when he was on Law and Order: Special Victims Unit than you'll love this movie.Especially with the great Dave Bautista as his partner. It's mostly him talking but he gets to do a little action as well.It was a good role for Adrian Grenier. He plays a rookie fed who's given a hard time by Bautista, but slowly shows them just how bad ass he really is.The only problem with the story is that it is too complicated. In their attempt to be smart they just end up being confusing with a story with far too many sub sub stories that get all jumbled together. Overall, however the movie works with some standout characters played by some well known actors that keep you focus.Definitely a good watch."}, {"id": 89, "text": "...don't understand where all the hate is coming from for this movie. you want to watch a bad and stupid action heist movie?...then watch heist. heist got almost a full star higher rating here on IMDb and i couldn't even finish it...it was that bad. ...i'm a fan of good movies...i watch independents and art-house movies more then the blockbusters. pus i've watched most of the black and white classics. i'm just a fan of good movies.that's why i can't understand the hate from the reviewers here and thats why i voted it a 7 out of 10. it's more like a 6.5 tho.this movie could've been great tho...instead of just very good...but all in all it had me riveted to the screen for its duration. my only gripe was the movie should've been over 2 hours so the nitpickers will shut up about how convoluted and not well told it was. movies require you to use your brain sometimes...this was one of them.all in all a very good watch if you are an action movie fan and just a enjoyable watch. another big bonus for me which others didn't like as much...the constant rain in the movie. it rained thru-out the whole movie just about...yayyyy.solid solid action thriller revenge style flick...an atrocity that this movie gets a rating of 5.4 here on IMDb while clunkers like heist gets a much higher rating."}, {"id": 90, "text": "I don't care if you smoked last week.What I care about is honesty.If you lie, you withhold facts to get ahead, I'll cut off your balls and bury you.If you're going to ask me what Marauders was about, I'll owe you the answer. Because to be honest, this was such a complicated story that I couldn't understand what was happening while watching. Let alone that I could still retell it now. The big jumble of storylines is just as inextricable as a fisherman whose fishing line has become entangled in a bush behind him. However, the beginning was promising. An action-packed and brilliantly filmed bank robbery with the masked robbers working in a concequent way using high-tech gadgets. But unfortunately this is the only thing that causes excitement. The rest is simply too boring and an incomprehensible mess.And who to expect in a mediocre crime/action film? Yep, Bruce Willis is back. This time it's not his lamentable acting that makes him look bad, because he doesn't even get a chance to fail in that. His part is extremely limited, so we only get to see him a few times. And the boredom is easy to read from his facial expression. Although he's the central figure, the only thing he can produce is some doubtfully frowning. That's in line with previous roles he played. The only constant in his career at this moment. His picture on the film poster is bigger than his character in the film.The only character I enjoyed was Christopher Meloni as FBI agent Montgomery. An impressive guy who tries to find out why banks of Hubert International (Bruce Willis is president of) are being robbed. But as I said before, this leads to a fairly complicated tangle of plots and subplots. Before you know it, it's about a failed military operation in Afghanistan where a soldier was killed (or not?), a group of corrupt agents, corruption at a political level and the wife of a policeman who has cancer. Enough to fill a whole season of a new police serial.Marauders is again such a film you better forget about quickly. The only thing that kind of stayed with me, is the fact it rained continuously the entire film."}, {"id": 91, "text": "Having no expectations but some decent action and entertainment value, Marauders fills up that void. This is another film where Bruce Willis is all over the posters, and appeared to be top billing but plays a very small part. Christopher Meloni is the lead, then with Dave Bautista, Adrian Grenier and Johnathon Schaech.For a relatively small film, this film is quite entertaining though of course with better writing it could have been better overall. The best scenes and part of the film were the bank heist scenes. The attires of the robbers were very fresh as they were completely in gear (in gear from their masks on down), as well as their technique of using voice recordings during their heists. That was clever as it worked.The film could have been better with a better twist and when the ending comes, it feels very rushed and falls short. Some questions don't get fully answered as we thought they would by the end. A halfway decent twist but nothing completely new that we have not seen before. I think the problem many have with the film is the director and writer tried making it more complex of a story adding in little subplots, resulting in a more convoluted plot. A great writer could have written this much better and satisfying. Though for a bank heist thriller, Mauaraders is quite entertaining fun and suspenseful is what we watch for. Recommended, don't overly think about it too much."}, {"id": 92, "text": "This is a crime thriller that keeps you gripped with witty sarcasm backed with intriguing twists and plots.The dialogue between the characters alone is enough to keep you gripped. The suspense is so thick you can physically touch.For action junkies like me, there is so much action going on that you won't be disappointed.To me the star of the film is Christopher Meloni, his demeanor and sarcasm made the film.If bad guys were ever close the perfection it's the bad guys in this film, they seemed to pull off the impossible in a cold calculated way.For me this is a movie that will keep you hooked.It might not have the media hype, but this is a film you won't regret watching."}, {"id": 93, "text": "Saw 'Marauders' because Bruce Willis has done good films and given good performances in the past, 'Die Hard' is a genre landmark and his performance is iconic in that. The title, cast and poster also intrigued and similarly the idea for the story sounded sort of interesting, despite a lack of originality. Expectations were not high though, because Willis has been past prime for a while (several bad films and has looked tired and disengaged a lot) and has been in a lot of stinkers lately.Despite my interest into seeing it, hopes for 'Marauders' weren't too high, with a good deal of bad things heard about it and that Willis has done similar films before, during and since this film and none of them were good and used him poorly. 'Marauders' did turn out to be a marginally better film than expected but it is still not very good despite a few decent things. Do have to agree with the flaws that have been pointed out.'Marauders' did start off very intriguingly. It is shot with slickness and style.The cast mostly didn't do too badly at all, better than average. Christopher Meloni and Dave Bautista give the right amount of grit and fun and Jonathan Schaech doesn't over-compensate or look bored.Willis however phones in and looks tired in a role that is nowhere near as prominent as the advertising misleadingly indicated, something of a glorified cameo. Adrian Grenier is also quite characterless. The direction shows little engagement or finesse. The sound and music are intrusive and the characters generally aren't interesting, due to very sketchy development, with not many endearing traits.Furthermore, the action is never exciting or tense, very routine often with silly parts and over-serious ones. The script is constantly awkward and lacks tautness, but it is the far too convoluted, as well as pedestrian and far-fetched story that suffers from trying to include too many things and underdeveloping all of them that the film suffers most from. Any twists are easily foreseeable long before they appear and there is very little tension or suspense.Overall, tangled web sums 'Marauders' up very well. 4/10 Bethany Cox"}, {"id": 94, "text": "The tittle says it all. The story is to complex and in many instances doesn't make much sense. Adrian Greenier is a terrible actor that actually ruins the movie. His role reminds me of the roles he used to play in Entourage. Pretty with no substance and a non believable redemption story. When the director tries to get you emotionally involved in the back story of the characters family and behind the scenes lives it falls way short. Mims's home life is laughable. Not the because of the situation, but because of how he and his wife handle it. It's not believable and she is way too pretty to be dealing with what she is dealing with. In addition his redemption story just as Greenier's is as pathetic as it is laughable.Chris Meloni is playing a shell of the character he played on SVU and it shows. His acting has no depth.Bruce Willis has a few Bruce Willis moments. However it's not enough to save the film. Whenever I watch Bruce Willis act now all I can think about is what Kevin Smith said about directing him. Willis knew this script was to complex and a piece of crap. I can only imagine the nightmare he was to work with just so he could cash a pay check."}, {"id": 95, "text": "This review of Marauders is spoiler free** (2/5)In Hollywood, there are only a small handful of memorable crime thrillers when the mass murderers, masked vigilantes or corrupt cops reign supreme; Triple 9 comes to mind. It seems for a while that Marauders tries to follow the same riff of that movie with the plot forming around a tight-knit team of masked vigilantes, with distorted whom are armed to the teeth with giant guns. Like Triple 9 this team aims at big banks run by bank tycoon Jeffrey Hubert (Bruce Willis) but it seems that this team of professionals don't take any money, thanks to the bank's owner but is there to this tycoon that meets the eye? Of course there is, the story soon transpires that he is helping these criminals for a more legitimate scheme it turns out that he coaxes the press to convince them that these bank robberies hitting his firm of banks, Hubert International as he is trying to hide some incriminating information surrounding his family. Then the film shifts to two FBI Special Agents, Stockwell (Dave Bautista) and Wells (Adrian Grenier) who are convinced that the masked vigilantes are part of a military platoon that suddenly went rogue so as they try to find the evidence to catch up with this team who are constantly outsmarting them unfortunately their evidence plateaus, just like the plot of the film.Stepping into the second act, as the FBI think that they are getting closer to this team, they find yet another conspiracy that Hubert is behind the whole thing and it turns out that these so called criminals are helping the authorities discover the many conspiracy that are already spiraling out of control at this point. The film begins to get a little bit lazy being constantly over taken by the immense body count, the conspiracies and the plans for revenge which are also spiraling out of control. The film then suddenly strives around the plot that an unknown deceased military ranger is behind all these deaths, and for a while the FBI agents are convinced that this man is causing all this carnage in Cincinnati for a while the film continues to riff on this same plot line as the police find his prints at the growing list of crime scenes at this point the police believe that they are being outsmarted by this man, have you caught yet? Well prepare for yet another change, as the lazy plot continues to form these convoluted misinterpreted stories that take over most of the plot, the FBI agents, manned by Special Agent Montgomery (Christopher Meloni) begin to compromise on their footing to find out what Hubert, is up to so as they try to find some problems with his impressive plan, they are compromised themselves by the bank robbers but this time it seems that they are in a tight-knit fight this time leaving behind many bodies.As the film goes on we are thinking that there must be a better plot hidden somewhere under the immense body count, the puddles of blood and the seemingly never ending schemes turns out there isn't, so while Willis, Meloni, Bautista, etc. are constantly getting lost in the films over-the-top, nonsensical and plain goofy plot Marauders, isn't all bad as there are a couple of saving graces to point out in this film; firstly the action sequences do their job to keep the movie somewhat stable, secondly there is a third act thrill that switches the tone of the film into thinking that the corrupt cop was involved the whole time. Marauders' denouement hits a blank that ultimately shouts out what really happened in just a few minute slot it's an intriguing bit that gives the whole film a lesson that the previous hour and forty-odd-minutes did it's best to muddy. While the film has a star-studded cast with some big time old and new stars it seems that at the beginning the film lays out a forty minute scenario that keeps us intrigued enough and makes us think, but then it delves into a story that becomes seemingly far-fetched to a point when it is down right goofy, it seems that we won't be seeing any rejoice in Willis' career for a while.VERDICT: A noisy, disjointed and frankly lazy crime thriller that constantly gets lost in the far-fetched filled with clichés plot that for a huge chunk of the film is under the immense body count and the large puddles of blood."}, {"id": 96, "text": "I was pleasantly surprised by this film. Without wasting time on the obvious (watch the trailer), here is a one line synopsis: a series of bank heists and the efforts to uncover the guys pulling them off.First and foremost, Bruce Willis is not the lead in this film. As if by impulse often I find myself immediately tossing aside anything from his recent work over the past few years, however, his role is rather small in this one. So if you are much like myself, fear not!The story is somewhat predictable, yet there are plenty of moments that get you thinking about how our society (particularly the USA) functions at the highest levels of government and security.As always, Adrian Grenier had much to live up to considering my need to equate him with the loving film star Vince from HBO's Entourage. Indeed a tough battle for many who are fond of the show. I can offer some solace by saying that after the first quarter of the film he meshes nicely, and the stigma wears off. Kudos to Grenier, as I hope he continues down the right path with more films of this nature.Christopher Meloni &amp; Dave Bautista play the two leads agents on the case, surprisingly doing a decent job of portraying a friendship that's believable on screen.All in all this film was by no means the greatest. There is a high likelihood that avid movie buffs like myself will overlook this one. It is to those that I urge otherwise.Decent story, decent acting, great visuals, Bruce Willis isn't the Male lead. Watch it.----- 6/10 STARS -------- Review by Searsino -----"}, {"id": 97, "text": "Marauders: 7 out of 10: A collection of bank robberies in Cincinnati may be connected to a war crime from many years ago as both the FBI and local Cincinnati PD try to find the perpetrators before they strike again.The Good: This is actually a good film when all is said and done. For a direct to video feature, it is outstanding.There are two stand-outs in the film. The first is the action scenes, particularly the bank robberies. They are excellently designed and filmed with a proper amount of tension and just enough style to seem new and fresh.The second stand out is the acting. Bruce Willis isn't in the film all that much but he does do more than simply cash a paycheck. Dave Bautista also appears in a few scenes and he is quickly becoming one of those actors that elevates everything he is in. As for the three actors who carry the film Christopher Meloni, Adrian Grenier, and Johnathon Schaech is all excellent.Now Meloni could do his role in his sleep but this is the first role where Grenier doesn't make me want to slap him which is impressive and Schaech finds a Vic Mackey gravity to his role that simply wasn't in the script. The Bad: Everyone's wife is dying or dead, everyone has a secret history with everyone else, nobody asks for a lawyer and there are about twice as many characters and three times as many plot points that a film of this genre and running time can handle.Bruce Willis is the apparent private owner of a bank with 3000 branches? A cop would have an easier time getting an interview with Howard Hughes let alone a shakedown interview in his office with no lawyers present. A street reporter starts her news report with sources tell me that the bad guy murdered all these people and stole all this money without any arrests being made or really any prompting except we need the bad guy to make a run for it so lets have the I-teams Suzie cut short her interview with the owner of the world's shortest llama and start flinging plot points at the screen without a single alleged uttered.The Ugly: I understand that having it rain in every scene is a stylistic choice. But you are clearly aiming a hose at an awning in some of those scenes.In Conclusion: The filmmakers should have fridged both the dead and dying wives then spent some face time with the actual bank robbers. They also could have made the connections between characters a bit clearer for those of us who are either slow or can't see through all this rain and they would have had a top-notch film. As for now, we have a confusing overstuffed film with some great set-pieces and surprisingly good performances."}, {"id": 98, "text": "Thanks to the reviewers who said they did not understand the very negative reviews, my husband and I decided to give it a try. We are very glad we did. This film has an in-depth, substantive plot, and very much like an old film where every word matters, you must watch and listen carefully or you may miss an important element -- e.g., someone says We found a print, holding up an evidence bag containing a bullet. The image lasts only for a second and if you miss it you may not understand why the characters take the next steps. Not realizing from the beginning that we needed to watch and listen carefully, we were lost about 1/3 of the way into the film and restarted it.Some reviewers mention bad acting -- to the contrary, the actors are spot-on, and were obviously directed to maintain a near-monotone voice and attitude throughout the film; reminiscent of The Spanish Prisoner (Steve Martin and Rebecca Pidgeon).If you like a good crime thriller, mystery, suspense, a deep plot, and somewhat of a surprise ending, you won't be disappointed! This is right up there with The International."}, {"id": 99, "text": "The Hero of the story is a man whose wife was murdered while doing a bust (she was a cop). His Goal in the story is to find the people who are doing bank jobs, where people have been executed - It appears, therefore, that the heists are personal. The first pages of the script get off to a rip-roaring start with the genre that audiences have come to see: Thriller/Action/Crime. The Story World is film noir/dark/intense/ sophisticated/tense. What happens after the first 10 pages is a mess of a script for the following reasons: First, the form of the story is branching, as opposed to linear. IE. We are taken to at least 3 or 4 scenes of a cop with a wife who is dying of cancer. For a t.v. serial, we could delve into this sub-plot, but for a thriller, it slows the pace down and takes the audience totally off-track; one scene would have been enough. The F.B.I. Hero goes to visit a man in prison - This is connected to how his wife was murdered. Again, we are taken on another branch that deviates from the Hero's Goal. This scene should have been edited out. The use of flashback to actually tell the story is a no-no in script writing. We are AGAIN taken off track by going back instead of forward. For this genre, it was a big mistake to show many scenes of military actions to sum up a character's back story. Big problem is also this: The Main Opponent needs to block obsessively whatever the Hero is attempting to achieve. There should be a punch-counter-punch between Hero and Opponent: There is none. As a result, the Opponent seems lethargic; his lines are ridiculous; he is basically in one or two locations just standing around with filler dialogue, totally unbelievable. WHY is he the Opponent of the Hero?? What is the motivation of this Opponent? What is HIS Goal? Why? None of these questions are answered because of the following reason: The PLOT was heavy with disconnected, disjointed turns and branches. The Opponent was inserted into the Plot as if he were a toy doll that needed to fulfill a script requirement. The writer did not take the time to give this character a 3D persona. It's a shame that the script didn't deliver for this exciting story idea or High Concept Premise. It got muddled and caught in a web of plot branches that should never have been there. The audience was confused by all the machinations. For a t.v. series, this plot heavy story would have satisfied 24 separate episodes. But for a feature film of Thriller/Action/Crime, the Plot turns took the audience off the Narrative Drive of the story and was confusing as well. Christopher Meloni was superb as the Hero. He's been so typecast for so long - He could be another Robert DE Niro if he'd get the parts with the depth he's capable of playing. Bruce Willis in this story was how it got produced. But unfortunately, his role was weak; dialogue ridiculous; character development written with no real character arc. The actor miscast was the F.B.I. agent, who was a special forces guy- The actor was skinny; kind of runt-like; so not like a guy who has to be in top shape. He did the best he could with the dialogue, but the part was just not for him. The Hero's sidekick wrestler played his part with some sense of humor - More humor in this type of genre would have been great, had it been written into the script. The Hero could have had a dry sense of cynicism and world-weary, wise-cracking type of personality. It would have made for a much more tense Narrative Drive. Again, the actors did the best they could with a script that lacked key ingredients. Really a shame."}, {"id": 100, "text": "For those unfamiliar with the title, 'A marauder is someone who roams around looking for things to steal.' With that concept in mind writers Michael Cody with Chris Sivertson have fashioned a whodunit that is loud, fast moving, crude and entertaining as directed by Steven C. Miller (Arseanl, Submerged, Extraction, Silent Night, etc). The plot is complex not only because of the use of masks hiding the marauders' identities, but also the interplay of corruption both corporate, military and police/FBI, and the high level of noise that covers the little dialogue there is. The story centers around a Cincinnati murder conspiracy and cover-up of an Army Ranger unit killed in a classified mission some years ago. When four armed robbers converge on Hubert National Bank, their motives throw suspicion on the bank's owner, played by Bruce Willis, and the corporate executives, as well as prominent politicians and high ranking members of the US military. The FBI Special Agent in Charge (Christopher Meloni), and his agents (Dave Bautista, Adrian Grenier, Johnathan Schaech, Lydia Hull) must decipher between truth and lies as he leads the investigation and even begins questioning whether members of his own team can be trusted. Each new twist unravels a deeper journey to determine who is truly innocent or guilty and who will ultimately find redemption. It becomes clear that a larger conspiracy is at play. Revenge plays a role, gangs are involved (Chris Hill, Texas Battle, etc), and the murders proceed until the true head of the marauding heisters is identified.Strong presence by Meloni and Grienier and Bautista carry the film and in the end the mystery is solved in fine style. The film is not unlike the multiple television crime dramas flooding the TV screens, so if that is your cup of tea, this is a worthwhile film to watch."}, {"id": 101, "text": "Maybe if I had shut the film off of my Blu Ray player after the first 10 minutes of the snap and crackle Marauders provided I may have been able to convince myself and Mrs. Shullivan that this is such an action filled film with a great in depth plot that we should just savor the first 10 minutes. We could have then maybe, just maybe assumed that the rest of the film was just as suspenseful and intriguing that we would get too over excited if we continued to watch anymore.But ohhhhhh noooooo, just like most avid film goers we wanted to see more and more action filled scenes with a great suspenseful plot. That was our big mistake. Have you ever invested in any expensive fireworks such as The Jesters Revenge or the cheaper holiday firework staple such as the Burning Schoolhouse, proceeded to light the wick with anticipation of a burst of flame and color only to see the wick flare up with nothing but five (5) seconds of smoke and a dull Pffffft sound? Well that is how Mrs Shullivan and I felt the film Marauders let us down.There was such a convoluted plot that it reminded me more of the classic comedy skit by Bud Abbott and Lou Costello titled Whose On First? Each time a bank robbery occurred, or there was a flashback scene to the war where the U.S. special ops force were under heavy artillery gunfire we were fed another bit of a different plot line.Oh but film director Steven C. Miller saved the worse scenes for the films ending. Mrs Shullivan and I just looked at each other and said simultaneously Well that was a confusing waste of time that I will never watch again.My advice to both film stars Bruce Willis and Christopher Meloni would be for Brucie Boy to stick to making another sixth sequel to the Die Hard franchise, and for Christopher Meloni to go back with his tail between his legs and rejoin the cast of Law and Order: Special Victims Unit because that TV series has went so far downhill after his departure. There was no chemistry at all between Willis and Meloni and the ending went out with a wimper and no bang. Even the macho charisma of Dave Bautista could not save this film from stinking badly. I give the film a poor rating of 3 out of 10. It is not worth watching at all."}, {"id": 102, "text": "When I first saw the poster for this film, I was expecting a rather straightforward action flick about criminals robing banks and policemen trying to stop them. Instead, what I got was a convoluted mess of a film in which some bank robberies do happen, but they are merely a part of an extremely complicated story that involves political conspiracies, dark secrets from the past, assassinations, betrayals, and plenty of other stuff that will almost certainly leave the viewer baffled and confused.Basically, the plot summary is that a group of masked soldiers are robbing banks that all belong to a suspicious businessman called Hubert, who is played by Bruce Willis. However, these robbers don't want just the money, but instead they are performing these robberies in order to steal certain objects that Hubert personally left in his banks as well as kill certain bank employees that were employed by Hubert personally. The reason why they do that is because Hubert did some very bad things in the past, and now they want to exact vengeance upon him. Now, I'm not going to spoil anything, but let's just say that what Hubert did in his past was to organize some kind of political conspiracy in order to remain the owner of his banks, and that conspiracy resulted in the deaths of many innocent people. Therefore, the objects that the robbers steal are some kind of incriminating documents that helped Hubert organize the conspiracy, and the killed employees were involved in that conspiracy. Then a group of FBI agents lead by a frustrated Agent Montgomery, played by Christopher Meloni, starts investigating these robberies, but while doing so they also start uncovering this conspiracy. After reading all this, you may think that I'm explaining the story with too many details and revealing too much, but the thing is that all that is just the most basic starting plot which gets even more elaborate and convoluted through a series of plot twists, subplots and flashbacks. Halfway through the movie, the story becomes pretty much impossible to explain! The worst thing is that many questions do not even get fully explained by the end of the movie, and the most notable one is: How did Hubert manage to organize such a complicated political conspiracy? The movie is made even more convoluted by some needless subplots. The most notable ones are the story about Montgomery's wife, who was also an agent that was killed while undercover, which has no influence on the main plot, as well as a strange subplot about a policeman who is also investigating the robberies and whose wife is suffering from cancer. I don't even know what the point of that character is, but that subplot is concluded in a very bizarre, if not ridiculous, way.Other than the messy story, the movie also has some action scenes, but they're nothing special. I liked the first bank robbery scene, which was actually quite intense and well shot, but everything goes downhill from there. One of the later robberies involves some kind of a lengthy armed standoff between several characters that looks simply ridiculous.As for the acting, Bruce Willis gives a rather routine-like and forgettable performance. Meloni plays the main character and he goes through various emotions throughout the movie, though I personally did not like his performance. There's also WWE superstar Dave Bautista playing Meloni's partner, but he does not do anything memorable in the movie other than spear-tackling a bad guy once. There are also many other supporting characters, if not too many, and it's kind of hard to keep track of all of them.In the end, I kind of wish this had just been some kind of a B movie about heists that's easy to follow, and not this mess."}, {"id": 103, "text": "I hardly know how to comment on this action story about uncovering some kind of conspiracy involving the FBI, the Cincinatti Police Department, a rogue bunch of Army Rangers, and the president of a bank franchise or whatever it's called.But let me start with the first five minutes. One by one, half dozen production companies are slowly revealed on the screen: Lionsgate presents an Aperture Production by Circumcisional Films produced by Phineas Quimby LLC of Rocinante Incorporated. Finally we see the title: Marauders. It's a kind of generic title, like Guns of Darkness or Another Dawn. Marauders could be a story about nosy landladies instead of bank robbers and murderers.Okay. The credits are over. We open on a scene in an ordinary bank. A perfectly ordinary transaction is taking place. The friendly bank manager escorts a matronly lady to the door, warning her to watch out for the rain that in this movie, as in the atrociously titled Se7en, never stops. Before the glass door, the manager looks up and from his point of view we see the most horrible Haloween mask imaginable, a kind of death's head, aiming a shotgun at us. The manager is horrified. Does the masked figure shoot the manager through the shattering glass door? Are you kidding? End of the first five minutes. I counted.There's no point in going through the plot because it's so ill written that I couldn't follow it. Lots of shooting and gory deaths. The director is fond of having his victims spit up blood. The prologue has warned us of graphic violence and brief nudity. Too bad it wasn't brief violence and graphic nudity, although now, come to think of it, there was no nudity at all.The casting is pretty good. All the actors are of TV quality. But one of them, a human gorilla with a neck the girth of a utility pole, a partially shaved skull, a two-day stubble, and garments from the Salvation Army, rather stands out from the other, properly clad, FBI agents. What a brutish figure he cuts -- and whose was the hand than slanted back this brow? In the final, action-packed half of the movie, the camera begins to show signs that the director of photography was strung out on something. It's never still. If two people are sitting and conversing, the camera still slides slightly this way and that.I wouldn't bother watching it but others might enjoy it."}, {"id": 104, "text": "I couldn't even sit through the entire movie. As others have mentioned, the plot is abysmal and far too convoluted. It's not a situation where someone is going to be like well, if you just really get invested in it and pay attention, the plot is good!.No, it's just a mess. One thing that bugs me a lot about this movie is how they dangle who the Marauders are over your head for pretty much the entire runtime. I'm just sitting there looking at every character thinking okay is it him? is it this guy? is it that guy? okay it's definitely him. no wait now it's him Trying to figure out who the ringleader is and what his motivations are. This might be fun in a sort of whodunit sort of situation, but honestly it just feels like they insulted the viewers the whole movie by holding out.When it's finally revealed who the marauders are, I don't even care anymore. The leader is of course... one of the guys you probably think it's going to be out of the 3-4 guys they focus on. Wow, amazing. Then the whole thing wraps up and I'm left sitting there like... why did I even bother seeing what the ending was about?I definitely had to skip through about 40% of the movie and honestly I didn't miss anything.I give it two stars only for the decent bank robbery scenes... but to say they are good heists is a bit too forgiving. They are... I mean... functional and a bit flashy but it's not like they are super clever or interesting. It's just nice camera work and makes you feel on edge.I can't even call this a heist movie because I've come to expect heist movies to deliver really interesting and well thought out heists... and these heists are more like 4 highly trained soldiers storm a bank, shoot some people, everyone in the bank pretty much complies and then the robbers take off with the money. the end"}, {"id": 105, "text": "I like to seek out the below-the-radar B movie that proves a pleasant surprise. This is not one of them. I understand that there are fringe people with no talent making cheap straight-to-videos in Romania but this was a surprise. You would think that with the number of people involved in this movie with experience (and some with credentials), the suits, the producers, the director, writers, actors, etc., someone would look at this script and say, e.g., It needs work. A lot of work. I can't imagine that anyone who touched this script would admit it unless being waterboarded. I know we're supposed to suspend disbelief but sometimes the script makes that impossible. And if you weren't shaking your head by the midpoint, well, there's the last scene. Obviously, whatever had been written finally got someone's attention and they made the director shoot a new ending. The problem is that no one actually looked at the new ending to see if it was better than the old one and-worse-had any logical connection to the rest of the movie. It's as if everyone involved said, Heck with it. It is that stupid. And by the way, when did Bruce Willis run out of money and start making movies for paychecks? He's made at least ten of them in the last five years. Bottom line: there's a lot better stuff in the action genre buried in the Netflix and Amazon libraries. Just let this one be."}, {"id": 106, "text": "No that is not a typo, I meant to write that. The sum of it all does not amount to what some of it is worth it. And I'm talking as a stand alone. If you've been keeping tabs on Bruce Willis you may have noticed him popping up in the odd movie or two in the recent past. Everybody needs money of course, though some do not look kindly on someone like Bruce giving his name to some of the projects he participated in. This movie can be seen as one of the better ones he chose.Putting that out of the way and the fact, he has a couple of interesting scenes, playing it mostly safe, still being effective, there are quite a few people here. But not many get really taken advantage of as much as it would be possible. And I'm not even talking Torrie Wilson or others who have very short appearances in this. No, I mean people like Bautista, Adrian G. or Jonathan Schaech. Although the latter may have the best of it. After a weak introduction, he gets quite a bit of screen time. And he delivers. Anyway, the movie is suspenseful enough to keep you interested all the way through, but it's not a real highlight. Something it could've been"}, {"id": 107, "text": "It's 1:30 A.M. and I am searching for my follow up movie after watching one already. I have no selected movie or genre in mind. Just a movie that will hopefully entertain and leave me with something to talk about. Well after watching Marauders I found that I have little to say, unfortunately. To quote a line from critic Brian Tallerico of the Roger Ebert.com - How do movies like Marauders get made? How I wished I read this review before I embarked on a 1 hour &amp; 47-minute movie about an elite group of untraceable bank robbers who are pursued by a headstrong and grief-stricken FBI Agent, Who uncovers a hidden agenda behind the robberies.Directed by Steven C. Miller, Never heard of him well he has quite the list of films you will also probably hate. Not to mention he gave us another Bruce Wills film from last year Extraction. His direction is muddled and flashy with slow montage shots of people walking in the rain, running or fighting. We also have an updated version of Heat with bank robbers who have Siri-like gadgets with prerecorded messages that speak for them - Smart but ineffective in pacing. The robbery scenes are so pretentious and over the top, it's practically begging for you to look at what it has to offer. In some small way Miller believed this would astound us; seeing a robber use an app to rob a bank.The Cinematography by Brandon Cox is also flashy at times when dealing with different set locations. It feels as if this were story-boarded heavily so we could no the difference within each scene. Ryan Dodson does a decent job with the score of the film. But the truth frustration should go to screenwriters Michael Cody &amp; Chris Sivertson (Sivertson wrote All Cheerleaders Die). The pacing is rushed along with the dialogue that feels as if they watched Heat along with Takers for inspiration. What starts as a simple bank robbery undergoes a political agenda with intricate details that require you to care about the process it takes to solve it, But that's just it - Once you get to the third act where it all comes together you could care less considering you probably stopped thirty minutes in.Bruce Wills who is underutilized here gives nothing to his performance but a smug smile and a few sharp remarks towards our lead actor - Christopher Meloni. Meloni shrugging off I am Wrath tries to deliver the role of a still grieving husband; while trying to walk the path of a good man, Is boggled down by his overacting in each scene. His grief never resonates with me even after knowing what caused it, due to the fact how quick and unabashed it's thrown in. Dave Bautista (Spectre) is the comic relief of the film, and you will welcome it. Adrian Grenier (Entourage) and Johnathon Schaech (Vice) are fine in their roles.Upon writing this I realized it all goes back to a simple question - How do movies like this get made?"}, {"id": 108, "text": "Ohmygod, what a mess. How can grown men make such a mess.Let's start with the cast. WWE Hall-of-Fame Wrestler Batista in a crime movie, playing a detective? He'd be much better typecast as a bad guy. Then there's the FBI Special Agent, most recently seen with Jayne Mansfield's daughter in TV's Law and Order, now mad at the world, looking like he needs a shave and a few good stiff drinks. Bruce Willis destroying his glass office table with a baseball bat, no doubt in anger for getting cast in this disaster. The rest of the cast look like Disney animatronic dummies, except the Disney dummies show more life and a better script.Next, the plot. What plot? I replayed a few parts of the movie and read the Wikepedia plot explanation several times, and still can't figure it out. Obviously, neither can the other reviewers...just read their reviews. The key guys wind up conveniently in the same cafe in Mexico on the same day, to try and bring this mess to an end. But how can you have an end, when there is no beginning and no middle. Here's a clue: THERE IS NO PLOT.Finally, the action. If you like seeing a bank heist conducted like a poorly executed military raid, with the added nonsense of cheap Halloween masks and issuing voice commands through a Google watch, OK, admit you're hopelessly addicted to playing video games on smart phones (clearly the intended audience).Wikepedia mentions the revenues hit $1.6 million. Wow. Not mentioned is how much it cost to make this flop, but you can bet, with Willis' minimum fee of $1-million per movie, it lost a great deal of money. There's hope yet for movie audiences if they can recognize and ignore trash when they see it."}, {"id": 109, "text": "Marauders, a movie brought to you by the director Steven C. Miller which revolves around the investigation and chase of a group of criminals that were heisting Hubert National banks. With the course of the investigation, led by Special Agent Montgomery (Christopher Meloni) of the FBI with some minor help from the local police department, they find out that the heists have a connection with the owner of Hubert National, Hubert (Bruce Willis).I felt empty watching this movie. The story itself was kind of predictable, with a lot of hints to who were the bad guys (which should be kept a mystery until the end in this kind of plot), breaking my curiosity, leaving the movie to be dull. There were a lot of slow motions, off point slow motions, completely unnecessary. I don't like to use this word, but some lines throughout the movie felt cringy. And there was a lot, in my opinion, of pointless drama. To be fair, they did find a way to connect the drama to the main plot, but still, it would be a lot better without it in the movie.Even though the movie was predictable, there were some minor surprises towards the end of the movie, and still, the ending felt so meh. So many possibilities and yet they decided to end the movie like many others, nothing new to see here.This movie had a lot of potential. I never saw heists in movies performed like the ones in this flick, and the motivation of the criminals was interesting and different. It could've been explored differently, in a more captivating way, in a more distinct way. Disappointing.With all its flaws combined, not too long with 107 minutes, it can still be an interesting movie for people who love crime and police movies, but for me, it just didn't do the trick. A solid 5 out of 10."}, {"id": 110, "text": "The FBI led by Agent Montgomery (Christopher Meloni) can't figure out why all the bank heists keep happening, but they feel the bank owner Hubert (Bruce Willis) is behind them. It's the why they can't figure out. The heists are all performed with military precision and now they have a clue to go on, especially since a fingerprint of a soldier thought long dead keeps showing up at the heists. This could have been good, but here's the thing: Many actors looked almost alike; There were too many very darkened scenes; the music throughout was annoying as it sounded like rolling thunder most of the time and it was difficult to hear character dialogues. It was hard to determine the good guys and the bad guys except for Montgomery and Stockwell (Dave Bautista) his next in command. So we are in the dark for most of the movie and the TWIST finally comes in to show us what is actually going on and we see some of the good guys are not so good. (ahh man!) This is a complicated script especially when we learn about some of the back stories and we become more confused because we don't know how all tie in. This could have been a lot better with more care in direction, lighting and dialogues so we could have had some idea of who was doing the heists and why. It took too long to get to that point and in the meantime we had to put up with music that drowned out dialogues. Not good at all. The bad guys who did the heists wore masks and it was difficult listening to the leader when he talked. Couple that with the rolling thunder music this was a disaster and we are left with, whadee say?Oh, when you see Bruce Willis' name as not the main guy, step away. You are not going to see him in many scenes. He is there to pull you in like it did me. (You never learn) (3/10)Violence: Yes. Sex: No. Nudity: Very quickly and briefly when topless girls mixing drugs run out when the law come in. Language: Yes."}, {"id": 111, "text": "This VOD had a Limited Theatrical Release. It is another Poster Paycheck Picture from Former Super Star, Bruce Willis. It's become a Game of Sorts for Savvy Folks who Discovered Willis' Con a long time ago and now just have Fun Wondering how much Screen Time was Invested.It can Range anywhere from 3-10 Minutes, depending on how much of a Greedy Grump Willis Feels during His Two-Day Shoots.So, Hollywood's most Prolific Con Man is here bouncing off of Christopher Meloni for some Verbal Sparring and the rest of the time Acting Bored as Hell.David Bautista is on hand for Bulky Comedy Relief and Shows Signs of Slowing Down and has maybe One Fight Scene and the rest of the Time Searching His Grade School Skull for a Comeback Line.The Plot is so Complicated and Name Dropping Heavy that it all gets Bogged Down and Sinks to Viewer Fatigue trying to Keep Up with it all. In the End it's Not Worth It.It's Super Stylized with Raindrops, Slow-Motion Violence, and Too Cool for School Metal Demon Masks. Plenty of Bullets Fly and the Squibs do the Job they were Hired to do. The same can't be said of Mr. Willis."}, {"id": 112, "text": "This is my first review and I thought I would be doing people a favor by sharing it with this movie. First of all I watched this movie on Netflix so I didn't waste my money, but my time. I don't know what else is to be said about this movie. It is a simple yet convoluted plot of a bogus story.I get people like bank heist movies because they like the idea of crime but everything in this movie was just convoluted that the ending we did not care at all what happened. The cast is mediocre especially with a lazy Bruce Willis phoning it in. That old goofball WWE wrestler, the guy from Entourage and the other cop from CSI or whatever.Too much happens in here and it seems like the directors intentions were he thought it were good ideas (hah!).Conclusion, avoid Mauraders like a plague. If you want a clever bank heist movie, go watch Hell or High Water."}, {"id": 113, "text": "Okay I will start by saying the only reason I watched this movie was because Bruce Willis was on the cover of the poster and was #1 billed. I am a huge Bruce Willis fan having seen all of his classic movies like Hart's War, Hostage, 16 Blocks, Cop Out, Red, Extraction, etc. It was on Netflix so I though Why not?Marauders is nothing but a convoluted mess of a movie and that's coming from a fan of someone who had very little expectations with the plot. But no, everything that happens is just convoluted and you can tell the writing is weak with each new subplot they throw at you. If you're a fan of Bruce Willis like me, then I am very sorry but you will be disappointed. He is barely in the film and he looks like he isn't even trying. I hated the lead actors and wanted them all to die. Note to casting directors. Dave Bautista is a piece of bullocks actor and Adrian Grenier (the douche from Entourage) still can't act. Stop trying to make him a thing. Oh and the big surprise twist in the end isn't even good. By this point we simply do not care.Bottom line. This movie is terrible. It features way too little subplots and characters that we do not care for. In the end you may ask yourself Why did I watch this movie? and What exactly was this movie even about?. Trust me. Do not watch this convoluted excuse of a movie. But if you do, be warned for yourself and expect the least."}, {"id": 114, "text": "The first 5 minutes are the best in the whole movie. The bad guys look great and the movie has a great look and initially there's a great feeling of tension... A good action movie, sure the acting could have been better, but what it lacks in acting drama, it compensate with good action. Christopher Meloni dominates the role, and Dave Bautista adds that humor to the whole film. Perhaps films that picture the conspiracies in a realistic way run the risk of revealing reality without its mask of sanity? Watch and enjoy!Marauders opens with a scene straight out of this year's Triple 9, as a series of masked men pull off a complex bank heist. They're dressed like the protagonists from the video game Army of Two (impersonal/terrifying skull masks and bulletproof gear), and they're highly-coordinated and technologically savvy. They even throw down speakers, so a Siri-esque voice can issue orders instead of the actual attackers—ex., Do not hit the alarm or we will kill your manager. They complete the assault, and on the way out they shoot said bank manager point blank with a shotgun. From the beginning, Marauders displays signs of hyperactive, inept filmmaking, the kind that uses shaky cams and quick cuts instead of actual visual compositions. It's angry, loud and annoying. We soon learn that the bank was owned by a high-powered figure named Hubert (Bruce Willis), who hides secrets of political and business leaders in his safety deposit boxes. Of course, the criminals of Marauders have more complex goals than mere accumulation of wealth, which is something that FBI Agent Jonathan Montgomery (Christopher Meloni) quickly uncovers, with the help of fellow agents Stockwell (Dave Bautista) and Wells (Adrian Grenier), and local cop Mims (Johnathon Schaech). Group of robbery continue robbed Hubert's banks and kill Hubert's employee. Later, that FBI Agent Jonathan Montgomery (Christopher Meloni) quickly uncovers, with the help of fellow agents Stockwell (Dave Bautista) and Wells (Adrian Grenier), and local cop Mims (Johnathon Schaech) discovered Hubert set trap and kill his brother in Afghanistan. During, the killing his brother, Hubert send a group including Hubert's brother to kill Isis but it is a trap and Hubert send another group to kill Hubert's brother group. After the trap, Hubert killed his brother but some of brother's friends still alive and they form group to robbed Hubert bank and kill him. One day, robber group went to Hubert's bank to kill Hubert; however, FBI Agent Jonathan Montgomery stopped the killing. FBI Agent Jonathan Montgomery, agents Stockwell and agent Wells uncover Hubert' brother case and Hubert run away with his money to Mexico. In the last, FBI Agent Jonathan Montgomery and Agent Wells come to Mexico and killed Hubert. In the last movie, FBI Agent Jonathan Montgomery discovered Agent Wells who was a lead of robber group."}, {"id": 115, "text": "Beware: this is NOT a Bruce Willis movie. One should expect that Willis automatically would have the leading role, but none of that. He only has got a small supporting role with just a few minutes of screen time. The other tv actors are mostly fillers, trying so hard to look tough ALL the time, that it becomes tedious.At the start of this movie everything still looks like a good old fashioned heist movie though, because at the start some (average) bankheist scenes can be seen. But these enjoyable action scenes can ONLY be seen at the very start of the movie. After that it gets rather dull. Many talking scenes in which tv actors are (desperatedly) trying to look tough. Halfway through, this movie just deflates like a balloon and truly becomes pretty incomprehensible storywise.This movie quite convincingly deceived me at the start into thinking this was an ok action movie, that could be enjoyed if one didnt expect anything special. That's the thing that bugs me the most. It starts out rather ok, raising expectations, which are then crushed halfway through. Any hope left of a good, suspenseful story is completely vaporized towards the end. I could have written a better story with my eyes closed.Endnote: I love Bruce Willis, but I suspect the guy has got a contract which obliges him to churn out 4 B-movies a year. He stars in in it for the paycheck, tickets get sold, but we only get to seen him for 15 minutes at most. That's not right!"}, {"id": 116, "text": "Whatever happened to Bruce Willis's career? Yes, he made paycheck movies in the past, too. But, nowadays, it appears he's doing nothing BUT paycheck movies! Yet I'm a sucker for police procedurals, so I gave the 2016 thriller MARAUDERS a try last night. And, truth be told, it was a better than expected B movie. Sure, the plot is convoluted beyond belief, and by the end, with red herrings and inconsequential subplots by the half-dozen, I felt kind of confused. From the look on his face, Bruce Willis was confused, too. Or just indifferent. Or bored. The plot, such as it is, begins with a brutal bank heist in Cincinnati, and all the evidence points to the owner (Willis) and his high-powered clients. But as a group of FBI agents dig deeper into the case - and the deadly heists continue - it becomes clear that a larger conspiracy is at play - but by the seventh or so twist in the story I just stopped caring. The saving grace of MARAUDERS are the decent, brutal action scenes, some nice touches in the direction and cinematography, and especially a strong lead performance by Christopher Meloni (Law Order: Special Victims Unit) as the lead FBI agent. Meloni is intense and charismatic, and he really anchors the film, and some of the supporting actors, most notably Jonathon Schaech, rise well and above the occasion. Even ex-wrestler David Bautista isn't completely awful. If just the plot wasn't all over the place. But an okay time filler, nonetheless. And in true neo noir fashion, it's raining... the entire time."}, {"id": 117, "text": "I give this movie a 10/10 for how the crime was portrayed. Everything about this was so well played out and it felt like it was perfect, like everything lined up. This movie isn't just a heist movie. I mean it has 3 heists and a couple shootouts but being a slight b movie it succeeded in the crime world. Its all about dirty cops and FBI double crossing each other. Now my parents loved it because they're into that stuff but im more of an action guy but this one gets a pass. Something about this was just so satisfying. I dont know how Bruce Willis gets to be in all these b movies like this one and Reprisal. It just felt like a real good movie and its one that ive been meaning to watch for a long time. Now just because i give it a 10/10 dosent mean its like one of the best ever. I sorta rate it on its genre and how well it was. This one gets a 10/10 only on the crime portion. Just like john wick got a 10/10 on the action portion. All in all its probably and 8.5 to a 9 but i just cant come up with any complaint about this movie. The actors were amazing and it was a great job. This was just as a thrill to see as the trailer and for once a movie lives up to its trailer, well that happens most of the time."}, {"id": 118, "text": "We're not talking Shakespeare here. But then, I'm not much of a fan of Shakespeare's stories as he told them. So the real question is, is this a story worth watching? Is it worth your time.If you are a fan of decently written, competently acted, conspiracy movies involving ex-military operators, manipulative bankers, corrupt cops and questionable FBI agents, then you should take 1 hour and 47 minutes to watch this movie. It's moderately suspenseful with legitimate attempts to bring emotional depth and interesting backstories to each of its main characters and that's something you rarely see in conspiracy movies. Does it work? Not always. sometimes it's a stretch to far. But while you're following each character's line of motivation infused by their emotions, it works until the moment it no longer works for you. You stop buying in. But the collapse of the motivations doesn't destroy the rest of the story. You just move back to the action taking place. And if you can do that, you will find it an emotionally satisfying action/thriller tale.Oh, and let me say again, all of the actors do journeyman's work here, even Meloni and Willis, although Willis' backstory told in greater depth and antagonism toward a world that wasn't giving him what he wanted would probably have made the movie actually gripping.It's still just a movie, so I think that's enough said."}, {"id": 119, "text": "Some high-tech masked thieves perform a fancy heist at some bank and steal a bunch of money. Cops find a fingerprint that leads them to a low-level criminal's apartment where they find guns and money. The cops seem corrupt.Then the FBI arrives, lead by Montgomery, his side-kick Stockwell, and the new kid Wells, who's tiny but supposed to be special forces, a sniper, etc. Montgomery gets upset when he hears that the cops took his evidence. He confronts them but they don't share any info.Then there's another heist by the same guys. This time they go after one specific safety box. Both affected banks belong the the same guy, Hubert. He's lost a brother in the military.Eventually the FBI does get ahold of the print and it belongs to a military guy who's...long dead. The new FBI guy is tasked with riding along with the cops but they deceive him when they find a suspect. We also learn that the main cop's wife has pancreatic cancer.Finally, there's a third heist this time while the FBI and the bank owner are arriving.At this point more or less the FBI suspects the owner himself and that he may be involved in his own brother's death. They investigate further into the brother's military unit and find interesting coincidences. Suddenly someone turns in the money from the first heist to a church charity.The key will be the death of the banker's brother in what is too messy of a story. This movie should have been much better. It has the cast, somewhere in the story are some strong ideas, including some provocative political ideas; some of the people behind this movie have done some good work in horror movies. But in the end Marauders is rather unsatisfying. It's not clear where the blame lies. I suspect it lies with the first-time writer whose script is too ambitious. They could have made two movies out of this one. One action thriller centered on the death of the military guy and the surprising reasons for it. Another, an action drama that focuses on corrupt cops with a heart and the whole charity angle. The first would have been a very thrilling film with a powerful revelation. And Marauders does have that surprise element there, but it gets drowned in all the other stuff that goes on as well. Meloni does a great job as always and it's great to see him in a movie, he's awfully underused. Bautista is likable as always, but again here they don't take advantage of his presence.Marauders could have been an outstanding movie instead the filmmakers got bogged down trying to do more than was necessary."}], "reviews_amount": 120}