{"name": "Older", "titleId": "tt03391908", "reviews": [{"id": 0, "text": "Almost like it's the real-life story of the director/lead actor. It's all in it, the comedy, drama, love, happiness and the inspiration that drives it. The mix of emotions will make you stare on your ceiling for hours."}, {"id": 1, "text": "Older is part drama, part romance, but most importantly it is a slice of life movie that feels authentic. The movie is well shot- it looks beautiful, the pacing is good, and the cast is very likable. We follow Alex, who is torn between the girl of his dreams and an old high school friend he has not seen in years. We have all had experiences where we have wanted something so badly, but maybe, just maybe it wasn't the best thing for us. Older plays with that theme in a way that feels real and relatable. I recommend giving it a watch."}, {"id": 2, "text": "I watched it with my partner last week and we both enjoyed it. We've even started reciting lines from the film to each other as an inside joke.Bought the special edition on Vimeo so looking forward to cracking into the special features. You've got to love a director's commentary track!"}, {"id": 3, "text": "Wow, emotionally impactful, well edited and beautiful to look at. This movie really sucked me in. Great relationship drama and commentary on adulting. Well acted and directed. Makes me want to move to New Zealand! Kudos all around."}, {"id": 4, "text": "I saw this movie a couple of days ago and it's really sticking with me. The cast are uniformly superb, and the story is engaging. Older is brave, sometimes confronting, but is always filled with humour and a lot of heart. It is also a calling card for writer, director and actor Guy Pigden. You won't be disappointed."}, {"id": 5, "text": "Great Movie. Great Storyline. Great Actors. Great Acting. Definitely gained a fan. Keep up the good work. Can't wait for the next project."}, {"id": 6, "text": "Such a meaningful movie!! Especially if struggling with being a young-adult. You can relate to almost EVERY character, despite their very different situations. All the questions, fears and challenges that haunt us everyday, are depicted so naturally but still so profoundly in every scene and dialogue. And the glimmer of hope about our whole existence that swiftly slips by is just... exquisite (and truly necessary in practical terms). Because there HAS TO BE! And if there is not... can't hurt to enjoy the illusion. Do watch it!"}, {"id": 7, "text": "A great film about people getting older that is very dialogue driven with good acting and a great story. The story is very simple but entertaining."}, {"id": 8, "text": "This film has a lot to recommend it. It is beautifully shot, the locations are gorgeous &amp; well used, the lighting is fantastic, but, most importantly, Liesha Ward Knox steals the show in the role of Jenny. Her captivating smile, soulful presence, &amp; sheer talent delights the viewer every time she is on screen. The film is very enjoyable to watch, even during the uncomfortable parts of dealing with life's disappointments."}, {"id": 9, "text": "Older may be a small film but it stands up in the world of indie romances. At its heart Older is a film for those of us who are scared of growing up. Beautifully shot on location in New Zealand the film contains a wealth of undiscovered talent in its cast and writer/director/lead Guy Pigden makes juggling three roles in front of and behind the camera look easy. Another great film for Pigville Productions definitely worth a watch."}, {"id": 10, "text": "Guy Pigden, director of I Survived a Zombie Apocalypse and web-series, Immi The Vegan, creates a well crafted, beautifully shot indie love story from the shores of Aotearoa. Shot on location in Auckland and London, Older follows the story of Alex ( deftly played by Guy Pigden) as he struggles with growing up and choosing between mercurial Stephanie ( played by the beautiful Astra McLaren) or charming Jenny ( played by the dazzling, funny and adorable Liesha Ward Knox). The dialogue is witty and well written and its a pleasure to see a romantic dramedy that takes places in New Zealand! Check this film out!"}, {"id": 11, "text": "Older is a good film with a great cast. You really become invested in the story and care about these characters. I also enjoyed the adult nature of the relationships, this film deals with sex in a frank and humorous way. Older is well worth your time!!"}, {"id": 12, "text": "A refreshing &amp; realistic take on a common topic. Must watch. Kudos to the director."}, {"id": 13, "text": "If you need a break from 2020--Older is the perfect choice! Older is honest, intimate, funny, engaging, heartfelt, realistic--I could go on and on! I'm not a huge of rom coms generally, but Older was a delightful surprise. Fantastic work by the cast and crew, stunning cinematography, editing, and design make Guy Pigden a filmmaker to watch!"}, {"id": 14, "text": "Started to watch this movie not known what to expect but from the onset it pulls you in to the main characters and there decisions they make during there relationships a movie that will play with your emotions and a ending that will pull at your heart strings"}, {"id": 15, "text": "I really enjoyed watching Older. It´s about relationships and what to do when you get to a certain age. If you are at an age where you can relate to Alex, you will definitely enjoy the movie.Aside from that, I think the crew does a really good job. Guy Pigden writes, directs and plays the protagonist. That´s 3 though jobs to do and the movie delivers.Well done!"}, {"id": 16, "text": "I am not a fan of romantic comedies but I found this endearing &amp; pulling at the right amount of emotional strings without making me run to use the sick bucket.I believed in the chemistry between the 2 protagonists Alex Lucas (Guy Pigden) &amp; Jenny (Liesha Ward Knox) that are best friends that harbor feelings for one another. However, for plot convenience Alex is in an open relationship with Stephanie (Astra McLaren) &amp; she has eyes for another man. Whereas, Jenny has just come out of a serious relationship and on the rebound....This film is very British &amp; tries to be a more mature version of classic rom coms such as Notting Hill &amp; Love Actually &amp; Bridget Jones I found myself rooting for the couple &amp; the ending is so predictable that a teenager could have written it."}, {"id": 17, "text": "I love romantic comedies and this film did not disappoint. Guy Pigden directed and acted in this very relatable rom-com. Alex struggles between two women and his yearning for how love should feel. This is a very well acted and written film. Shot beautifully in Aukland and London. I highly recommend this film."}, {"id": 18, "text": "Just watched this on Amazon Prime. I'm not gonna lie... After hearing about this film for a few years, I was a bit worried I wouldn't like it. Well I thoroughly enjoyed it, so much so that I had to go through this rigmarole of signing up here to post this review.A really well written film. Dialogue is often a big let down for me, but this was great. Believable. Real. A bit of a slow start but it picks up in a big way. I think the trailer fails to adequately sell how good the film actually is which is one of the reasons we put off watching it until tonight.Happy to finally see what I've been hearing about for so long! I would absolutely recommend this film to friends. A romdramedy with substance."}, {"id": 19, "text": "It's a awesome movie I really enjoyed it such meaningful movie"}, {"id": 20, "text": "Older was a great dramatic indie film. Director Guy Pigden did a fantastic job not only starring in this film but also pulling the best performances out of all of his actors. Lead actress's Liesha Ward Knox &amp; Astra McLaren were instrumental to the film's success. A complex love story between the three main characters demonstrate the challenges that countless relationships experience globally. This film was well shot and the cinematographer (Adam St. John) did a great job painting a great visual picture. The music, editing , &amp; additional photography were all on point. Overall a great film. I truly enjoyed watching this film."}, {"id": 21, "text": "This film will put a smile on your face, through ups and downs, watching the charismatic cast of characters navigate very relatable growing-up circumstances. It felt honest and personal at every step. If you're going through that weird period, watching your friends settle down from the outside, you'll identify with Older. If you've been through it, you'll be reminded what it was like. If you haven't been through it yet, this is a great preview-maybe you'll learn from some mistakes before you have to make them. Really nice little indie."}, {"id": 22, "text": "Excellent film, beautifully shot and with a fantastic performance by Liesha Ward Knox, Pigden has really captured the feeling of being older than in your early twenties but still not being where you thought you would be in your early thirties. A must-see coming of age film."}, {"id": 23, "text": "I absolutely loved Older which I just saw on Amazon. Beautifully filmed and directed by Guy Pigden who also excels as the leading character and outstanding performance by Leisha Ward Knox. A relateable and funny coming of age film that showcases beautiful Auckland and incredible actors. Watch it and support New Zealand film and Pigville Productions"}, {"id": 24, "text": "Don't get me wrong - it has its moments. And I do appreciate the acting of both Liesha Ward Knox and Astra McLaren, however - Guy, buddy, just.. don't.I quite liked the story, it is universal, more relatable that i thought it would be, and it is - I dare to say - important. However. Guy - this part is for you: the most annoying and hurting thing is that your eyes never seem to be there, it is just too off. Think about it. Do write another movie, jtry putting someone else in a spot. You'll be fine without doing everything yourself. And the movie will be better."}, {"id": 25, "text": "Great performances, a fun plot and very well acted. I did not mind and quickly forgot it did not have a big 'star' in the film. The cast worked so well together and set the tone for a very watchable and enjoyable film. Two thumbs up!"}, {"id": 26, "text": "Well, this is flat out a terrific film. Actor/writer/director Guy Pigden does such a great job. Rarely (unless your name is Clint Eastwood) can anyone achieve what he has achieved. That being, wearing 3 hats! Besides the good acting and good story! This film wonderfully shot. It's so pleasing on the eye. Clearly from me, this film gets a solid thumbs up!!"}, {"id": 27, "text": "This movie had me engaged the whole way through. Beautiful cinematography, great acting, and a great story. I really enjoyed this film from start to finish."}, {"id": 28, "text": "Actually not really a rom com - more of a romantic drama. Yes, it's sprinkled with humorous moments but this movie has more depth and substance than that. I loved it - and would happily watch again. It's warm, funny, realistic and moving. We are rapidly drawn into Alex's dilemma as two women from his past come back into his life. Leisha Ward Knox gives a standout performance as Jenny, the great riend he can talk about anything with, and she elicits a similar quality of performance from Guy Pigden as Alex. Meanwhile there's Stephanie (Astra McLaren), a first love come back, the tempting bad girl who just wants to have fun. Alex himself needs to grow up and embrace adult life - but will he? This movie is perfect if you want a satisfying escape from today's realities (and who doesn't?)"}, {"id": 29, "text": "Absolutely spectacular on every level! Cinematography, performances, story, editing, lighting, production values.... everything... it was very funny, real, and deeply moving too. Nice central performance from director Guy Pigden as a twenty something/closer-to-thirty, beginning to question the shiftless nature of his somewhat aimless life and relationships. All of the other performances are seamless as well, especially from co stars Liesha Ward Knox and Astra Mclaren.The movie is beautifully put together, with perfect pacing and shot selection, and some amazing time lapse shots of Auckland Harbour and other great beauty shots.This movie pulls you in and beguiles you, making you care about the central characters and drawing you in with the subtle magnetism and charisma of the leads. It's moving and makes you think. Highly recommend!"}, {"id": 30, "text": "It's once of the good movie in 2020....I love it, I love the story, screenplay also...talented cast.and great director,producer,and other crew.so,OLDER can be born to be best movie."}, {"id": 31, "text": "A lovely crafted NZ romantic drama. Beautifully performances from the cast and a great story about being confused growing up. Charming Indy film with a heart of gold!"}, {"id": 32, "text": "One of the best indie films I've seen in a very long time. Great character development and a plot that hooks you from start to finish."}, {"id": 33, "text": "This is a terrific romance-drama. Not a frivolous rom-com, but a story that feels lived in, genuine. It plays wonderfully on our expectations of love. What we think it should be and what it is in reality. I could absolutely relate to so much in this movie. And it's so well written, directed and acted. A very enthusiastic recommend on Older!"}, {"id": 34, "text": "I enthusiastically recommend 'Older' to viewers of all ages as I am sure there will be something in the story that resonates with everyone. Older 'stayed-with-me' for days and I will enjoy seeing this film a second time just as much. The personalities of the characters made them instantly likeable and the end came too quickly for me....I wanted to see more. :) The quality of the filming skills are outstanding and complimented this production well. Great job! Good work! Keep doing it! :)"}, {"id": 35, "text": "This is one of the best independent movies available. Superb acting! Incredibly impressed by the cast - they really are on par with any A actor in Hollywood. This movie is definitely worth your time to watch. Highly recommend!"}, {"id": 36, "text": "Older means many things here. First it means the older memories go deeper and color everything. The older girlfriend from high schools is his best friend and brings out the best in him. Older is his beloved mom and dad. Older is he. Older and wiser the boy becomes man and embraces what really matters. The multi-layered script deserves a ten. Great scripts seem ordinary yet somehow transcend the mundane through the magic of provacative acting. A delight!"}, {"id": 37, "text": "What a refreshing, relatable and FUN movie. Older will surely develop a cult following. The leads, Guy Pigden and Liesha Ward Knox, are both wildly charismatic and perfectly capture the connection two people can have without realizing it. Pigden's direction is incredible and nuanced I can't wait to see what he does next. When I first noticed in the opening credits that he wrote, directed and starred in the movie....I was not sure what I was in for. Too often you see that combo end in narcissistic drizzle. This is far from that. His vulnerability and charm are real and raw. I definitely recommend this. A+++"}, {"id": 38, "text": "An enjoyable watch that kept me engaged throughout. The actors possess natural chemistry that charms you over and the plot offers clever moments that will stay with me forever. Its audience need not be restricted to those that will enjoy its romance and comedy as the drama and passion offers diverse entertainment for all movie watchers of a suitable age. The trailer won't prepare you for its originality which earns its place on our screens. A privilege to watch such a labour of love."}, {"id": 39, "text": "I saw Older at the World Premiere last night and enjoyed every moment. What a fantastic achievement after seven years in pursuit of making a film covering the minefield (at times) that is relationships.The performances were well handled to the point where the audience really cared about the characters' involved. To write, direct, act and edit is no mean feat and Guy seems to have handled all with aplomb here.In stark contract to their first feature outing, this has to be one of my favourite genres and definitely the best kiwi Independent project I've seen for some time.Congratulations!"}, {"id": 40, "text": "I've watched this film four times now. Last night I was able to watch it on the big screen at the Rialto Theatre. This is a beautifully shot and well made film. Exploring adult themes of aging, failed dreams, relationship growth, mortality and family. I am excited to see younger filmmakers putting out such great work and forcing us to raise the bar and try harder to create realistic, character driven stories with universal themes."}, {"id": 41, "text": "This film was incredibly relatable, I felt every minute with the 2 main characters. It was predictable but you still couldn't help but fall in love with the idea of the 2 main characters falling in love. The main Character Alex Lucas was a character I would normally hate but somehow his gloomy outlook on life felt relatable and the chemistry with Jenny felt very real!If you like RomCom's this should be a must watch."}, {"id": 42, "text": "From the moment Alex met Jenny, I knew that I would be enjoying Older, a film that I did not know anything about. Older is about Alex, who is in an open relationship with two women while examining his life as he gets older. Guy Pigden plays Alex, who gives a realistic, sympathetic, and convincing performance. He also excels as a writer, director, and editor of Older. Mr. Pigden is, without a doubt, a talent with many gifts. His film, Older, is a fantastic accomplishment that is done with care and honesty. The cast was outstanding, especially Liesha Ward Knox. The cinematography and the music enhanced the story throughout without intruding. Older is an example of what makes independent films unique."}, {"id": 43, "text": "Sweet and entertaining, what can you ask for more in a movie, very enjoyable. Well-directed and acted by all cast members. Bravo."}, {"id": 44, "text": "First, I have to say when I see that the writer/director/lead actor/producer/editor are all the same person...I have extremely low expectations going in. There are a lot of bad indie movies out there that miss the mark in either the writing, the acting, the editing, the lighting/camera work...or all of the above. NOT the case here. I highly recommend this lovely story of the messiness of life, loss and love. Love the cinematography; the light, the shots, using the locations like a character in the story - great work. The sound track...love it. The actors give vulnerable and believable performances, all of them. Guy Pigden, wearer of almost all of the hats, absolutely wins with this indie dramedy. A beautiful low budget/small crew movie, Older is now added to my list of favorites. Gave this project a 10/10 because Pigden proved my skeptical/judgy-indie-filmmaker-self wrong."}, {"id": 45, "text": "Loads of feelings , simple and touching performance by Guy pigden A must watch"}, {"id": 46, "text": "Writer/director/actor Guy Pigden (who also stars) does a fine job here creating a humorous/heartfelt realistic character study involving a 29 year old man who resists growing up while wrestling with the dream of his fantasy high school crush and his long time loyal BBF who has never left his side. Pigden and Liesha Ward Knox are terrific and have strong chemistry together as two besties who may have deeper feelings for each other than ever imagined. It's often hard sadly to pull off a really effective romance in modern cinema but Pigden does it so beautifully here with conviction/grace/humor and bite. There's not a false move and such intimacy and personal commitment to the work. It must have been a labor of love for this team to make and in turn, a joy for the audience to bestow! This is free on Prime and highly recommended!"}, {"id": 47, "text": "This charming indie, about an unemployed 30 something who lives at home, avoids many traps that lesser films would find. The dialogue pops and is funny, and the cast is all excellent. Extra points to the hilarious parents of the lead. Guy Pigden wears many hats (writer/director/actor) and wears them well. The jumping back in time to see our characters younger adds a nice detail. Well done!"}, {"id": 48, "text": "The lead is an actual triple threat that I can't wait to see more from. Guy Pidgen wrote, directed, and starred in this indie drama. He took some great risks you wouldn't see in a studio film and they completely paid off. The theme of getting older and the choices we make along the way is something that's easy to sink into. Great performances and beautifully shot. Easy recommend!"}, {"id": 49, "text": "One of the rare times in indie films that someone is successful in wearing so many hats. Guy Pigden did a great job in directing, writing, editing and acting in this indie about a man facing adulthood. The cast is really good and the story is very relatable. Recommended!"}, {"id": 50, "text": "After watching this film 2 days ago, I still catch myself mentally revisiting Guy's character... The self centered, scared yet strong young man struggles with coming to age but has a very bright woman slowly shedding light on his flaws. I genuinely felt this film. Thank you Guy!"}, {"id": 51, "text": "Romantic dramas are hard to pull off. Even more difficult is acting and directing at the same time. Guy Pigden manages to pull off both in spades. The movie manages to avoid the pitfalls and cliches of most romance dramas, while injecting a fresh style, brilliant montage sequences, and fantastic performances all around. Best of all it feels genuine and heartfelt, even when at its most dramatic Very excited to see what lies next for Pigden."}, {"id": 52, "text": "If you got past your 20s, and lived while you were in them, this is a relatable trip through all of the good and the bad... and most importantly it's real.Witty writing, excellent performances, a clear vision in every aspect - this is indie film at its absolute best."}, {"id": 53, "text": "This is the worst movie that I have seen in a while. I think that all the 9/10 ratings are from friends or relatives of the actors..."}, {"id": 54, "text": "90% of the reviews are obviously written by lovers of New Zealand or worked on the movie. The script is average and the acting is awful. Liked the concept, but the execution was not very good."}, {"id": 55, "text": "It's no easy feat to act in and direct a feature film, but Guy Pigden has done just that... and he wrote the screenplay as well!! This film had me giggling from the outset, seeing a man so uncomfortable holding a baby, and the humor throughout balanced perfectly with the romance and drama. This film and its cast have a ton of charisma. Highly recommend!"}, {"id": 56, "text": "There is something uniquely endearing and personal in Guy Pigden's OLDER. The director's honest portrayal and appropriately unspectacular approach to Alex's maturing journey draws us in in ways few indie filmmakers are capable, and quite honestly took me by surprise. Strong supporting performances from cast and crew. I look forward to seeing more from this talented New Zealand director."}, {"id": 57, "text": "Oh man, this truly was a beautiful film. So well written and shot - some of the NZ city shots were just stunning. The chemistry between most of the cast was excellent but was superb between Alex and Jenny's characters - so good! At points it felt more like a fly on the wall situation like you were really witnessing something real. Nice to see a Rom Com made in such a genuine way with real heart and grit. I have watched and purchased this film online but the minute it is available I will be acquiring it on Blu Ray so I can watch it with the commentary. Whole heartedly recommend. 10 stars from me."}, {"id": 58, "text": "A great story with an excellent cast whom you will fall in love with. Funny, heartwarming, and real all at the same time. The director and cast did an awesome job bringing these characters to life. A must-see if you like romantic comedies."}, {"id": 59, "text": "Sometimes you watch a movie where the story has all the right pieces but it still feels like acting. This movie has real people with feelings. Funny, sad and romantic moments that keep you rooting for this guy. A very nice enjoyable ride!"}, {"id": 60, "text": "This small indie film is a sleeper that outclasses many current big budget films with well known stars. Older's storyline focuses on the choices some people make while in a relationship and how unexpected events can impact their decision making process. Two of the main characters in the film are played by Guy Pigden and Liesha Ward Knox and they truly have great chemistry together. Knox is wonderful every time she is onscreen. The various events that move the storyline along are relatable to the viewer as are many of the actions of the main characters. Films like Older are a pleasant reminder that there are certain positive forces in the world that guide people's behavior. Hopefully the success of Older will allow Pigden and his creative partner Harley Neville, also in the film, the ability to put out additional films."}, {"id": 61, "text": "I don't go into films that have few reviews with low(er) budgets with high expectations, because let's face it, it never works out. This little Kiwi film, however, was a pleasant surprise. It's modern dating - the lines are quite blurry - and there is joy and no apologies in casual sex. But of course, it's natural to feel jealousy. What do you do with those feelings? And how do you handle the rest of your life and living? How do other people fit into your life? Give this movie a chance. (There are a lot of lovely people to watch and it doesn't feel like they are just reciting lines, which is a bonus.)"}, {"id": 62, "text": "Authentic, funny and highly watchable. If you've ever moved back in with your parents (or never moved out) you'll relate to Alex. Captures that coming of age in your 30s when you're facing up to life and it hasn't quite worked out the way you pictured. Leisha sparkles as Jenny, her and Guy (Alex) have a warm easy chemistry that made the film a delight to watch."}, {"id": 63, "text": "Have to admit, this is my cup of tea. Wonderfully told story, well acted, great cinematography and to see Guy Pigden wearing so many hats is also super impressive! Highly recommend."}, {"id": 64, "text": "Just another dumb movie about this generation who are confused and looking for love in sex or watever."}, {"id": 65, "text": "Older is a beautifully shot indie rom-com with very real and relatable characters. On-camera chemistry works well and the film manages to maintain a good balance between the sweet romantic moments and the deeper dramatic undertones. Well done overall."}, {"id": 66, "text": "Hangover, pain, reality. Oh, the realities of becoming an adult and getting older. After meeting Alex and his date's run-in with his parents, I was charmed and wanted to follow him on his journey. The story has an authentic feeling in the writing and acting. The director knows what he's doing and has crafted a sweet, romantic, and ultimately enjoyable watch."}, {"id": 67, "text": "In Guy Pigden's Older Guy writes, directs, and stars in a winning romantic drama. As the main protagonist Alex, Guy breathes life into a complex character, who is constantly ping ponging back and forth between his emotionally connected friend with benefits Jenny (Leisha Ward Knox) and the woman of his dreams Stephanie (Astra McLaren). The tone is a lively mix of cerebral drama and comedy, as we see quick flashes of Alex's dull existence as he plays video games and smokes pot, mixed with heavier dramatic moments as he is forced to choose the right path in his life, which is always in danger of his own self-destructive behavior. Older is deeply felt, personal, and touching drama that resonates for all of us trying to make sense of our own ideas of who we are and what we must do to change ourselves as we...well, get older."}, {"id": 68, "text": "Older is a really interesting indie dramedy. The plot concerns a man, Alex, who reconnects with an old friend at a wedding, but it puts him in a difficult place where he has to reconcile with a past infatuation. I think I'm near the age range of these characters, so the story about grappling with what it means to be older and reevaluating life and your relationships really connected with me. I would imagine most people would find this film relatable or they will soon."}, {"id": 69, "text": "I would call this a more realistic romantic drama than the more typical Hollywood fare. Alex, a struggling filmmaker, anchored down by is own failures in life finds even more failure in his romantic life. As he stumbles through his career and relationship with his parents, he suddenly finds himself in a complicated love triangle between his best friend and his decade long fantasy woman. No longer in his 20's, he has some serious issues to work through.A great film for couples or guys trying to figure out how to get their act together. Very enjoyable."}, {"id": 70, "text": "Good performances punctuate this endearing romantic drama directed by Guy Pigden. Story of a struggling man in a difficult relationship with a beautiful but complicated woman and his developing friendship with a second old flame which rekindles and new feelings emerge aknew. Comedic, entertaining, fun and witty. If you love rom-coms like When Harry Met Sally you'll love this."}, {"id": 71, "text": "Pleasantly surprised as wasn't expecting much. Its very sweet, funny, sad..... I really enjoyed it. Well acted in a simple way and its an indie film so not over produced with loads of glam. A good story that keeps you interested till the end. Its got a nice sort feel to it like they are real people rather than actors. Definitely worth a watch."}, {"id": 72, "text": "Sorry, had to editorialize a bit in the title, but I think that it bears pointing out to many global citizens used to seeing NZ's fantastic natural vistas in film, that NZ does actually have vibrant cities as well, where people live, work, and play. Ok, city planner and urban designer hat off now.This film def hit home, and I was surprised how immediately (that title intro sequence is heavy, man, in a good way). I had myself a situation or two like the one shown here, when I was a bit younger (heh heh, had to do it) but certainly not ending in the same way (no spoilers).Great story, great acting, great URBAN scenery, and as with their other recent project, Immi the Vegan, Pigville Productions amazes me with their production values. This film comes off as having had a much bigger budget and team than I know it did, from being a long-time listener to the Guy and Harley Podcast (those are the two Pigville guys - have a listen).Cheers, fellas, this movie was great!!"}, {"id": 73, "text": "Every frame of this film was a delight! It was truly firing on all cylinders in this genre, the genre of cool, indie romances.First off, the casting was off the hook! Liesha Ward Knox, the main woman, was like watching magic on screen. She was so connected to every moment, every word, every look, that it made the film really come alive. Seriously, she is an absolutely outstanding actor with incredible charisma radiating off of her! What a treat it was to experience the character through her! She is so gifted, she could read the iPhone disclaimer and make it compelling to an audience.But they say, 90% of a director's job is casting. So my hat goes off to auteur director, Guy Pigden, who also acted in the lead role, wrote the screenplay, produced and edited this incredible film!! Even one of those film jobs is tough for a person to succeed at, but Guy tackled all of them at once!!!!! Wow!! He had the perfect touch in letting the scenes play out and breathe without overdoing it.Guy's realization of the Alex character was perfectly handled to deliver a really satisfying character throughout the whole movie. It's really hard to direct and act at the same time, but Guy completely pulled it off.As an editor, Guy had a really nice touch! There were some spicy moments, but the editing style fit the tone and never felt gratuitous or merely ornamental.The rest of the cast was equally engaging and Guy did a super job of balancing their characters' storylines to fully support the overall story.Astra McLaren was also perfectly cast to complete the love triangle. She was really interesting and made strong choices in bringing out the character. The beach scene at the end was fantastic.The story itself, was not nothing new and had a lot of the same beats we are used to in the genre, but the magic came in the execution. It's just like with food. You can order a cheap plate of spaghetti from a terrible restaurant, or you can order gourmet pasta from a 5-star restaurant. Sure, they are both noodles, but one is sublime. That's how this story felt when all the ingredients perfectly blended to transcend the screen.For many people, escapism for movies is going to see a big, familiar, action blockbuster that features things blowing up and people in superhero costumes. For me, escapism is being completely unaware of a film or its trappings and watching it unfold with no idea what the next moment will bring. That's how this film was. It was fresh and intriguing to watch unfold.Major kudos to Guy Pigden for this outstanding work and major kudos to the actors, especially Liesha Ward Knox, for making this film amazing! This film gets 5 full stars."}], "reviews_amount": 74}