{"name": "A Nice Girl Like You", "titleId": "tt03278540", "reviews": [{"id": 0, "text": "I downloaded this comedy movie thinking it would be funny. It's dumb unfunny girl meets facts of life. The writing Is so over the top unfunny and extremely uncomfortable to watch. The outrageous sex jokes didn't work... Not one of them. Did anybody watch the dailies and realize nothing is working. Zero chemistry, Zero Sexy, Zero Funny, I cringe during most of this movie. How can you make a bomb like this? Not one funny scene.The director and writer should be embarrassed to have their name on this Picture. I've never given a 1 on IMDb before. But this movie took an hour and half of my life that I will never get back."}, {"id": 1, "text": "Wow, absolutely the worst. Just another Rehashed Rom-Com that has been done so many times it makes you sick. There is nothing remotely original in this film. The fact the writer has the character going to s strip club to learn about her own sexuality is quite simply the most farcical thing I have ever seen. The production company should put this back on the shelf till the planet is truly at the point of Armageddon at that point we would have nothing to lose watching it."}, {"id": 2, "text": "It started well, funny and interesting but then 5 min later it went down the hill. The girl is nice, funny and good looking, the guy not really (too mature for her) and there's no chemistry between them whatsoever. The plot is totally unrealistic and plain stupid."}, {"id": 3, "text": "These reviewers took this movie way to seriously. Maybe they were expecting more skin... This lighthearted romp delivers. The mask we each wear, hides reality. The moral is... sex and relationships are dark waters for some. Some get it wrong and walk. Then there's those that want more. Both... men and woman are conceded, believing themselves more than they are. This movie isn't there to teach... though it does represent life in the world of romance and the willingness to learn and enjoy the boundaries of chance."}, {"id": 4, "text": "A sad attempt at a sexy funny story that is neither sexy nor funny."}, {"id": 5, "text": "This is going to be my first ever review. I just had to share my thoughts on this film. When I saw a trailer I thought it would be a fun film to watch. I am not a very picky person when it comes to comedies. I couldn't be more wrong about this film. It wasn't funny at all. I felt like an entire film was so much like Hallmark films with PG friendly characters but then there is sex subject that doesn't get any spicy scenes. It wasn't either proper predictable romantic Hallmark film you would watch on Christmas about two people falling in love nor a sexy comedy with dirty jokes and funny scenes. I am a fan of Lucy Hale and that is why I watched it. Unfortunately for me the whole story was a cringe fest. If you consider watching this film, think Hallmark film with super PG friendly love story which meets somewhat not spicy sex comedy where is no sex scenes or anything funny. I can't even pick one thing I liked about this film. Really disappointing."}, {"id": 6, "text": "This film had me laughing throughout and was an easy watch. Don't really get the bad reviews."}, {"id": 7, "text": "I wasn't looking for Gone With The Wind when I decided to download this film. I found Lucy Hale adorable in this role. Although the topic was about sex, it was handled in a smart way. It wasn't overly raunchy and I could watch it with my teenage children."}, {"id": 8, "text": "I love lucy hale anyways which is why I wanted to watch it. I honestly laughed all the way through! Brilliant 👏"}, {"id": 9, "text": "I loved this movie! There's not enough raunchy comedies for the romantic ladies out there and I thought this one was great. I feel like all the negative reviews here are from people who typically don't like this style of comedy to begin with, which makes reviewing it unfair in my opinion.It was cute, raunchy and funny."}, {"id": 10, "text": "I really loved this movie. It made me laugh out loud. I thought Lucy and Grant had fantastic chemistry from their first meeting. It was light-hearted. It was fun. Refreshing during this time when everything is so serious."}, {"id": 11, "text": "A shining example of how to take all the right ingredients for a simple, fun rom-com and still manage to make a soul-less movie out of them. I wasn't expecting an Oscar-worthy production and I usually like the romantic comedy genre in spite of (and maybe because of) it's schmaltzy predictability.There is however, one ingredient that must be present even if all of the others are lacking: Chemistry. For any rom-com to work, there has to be believable chemistry between the leads. Sadly, there is none to be found here. Also, frustratingly, there are many wasted opportunities to make scenes funnier, but they either weren't taken, or were half-hearted.In the end, the movie turned out ironically to be like Lucy's character: Full of potential but somehow unable to realise it."}, {"id": 12, "text": "I obviously wasn't expecting a huge amount from this film but thought a light hearted comedy on a Sunday arvo would be perfect. It's terrible... ZERO CHEMISTRY between the leads. Adhir is the best thing about this film to be fair. Honestly, so bad and cringy... don't bother guys.."}, {"id": 13, "text": "I really enjoyed it, I almost laugh-cried at some scenes.Good movie if you just want to relax for a 1,5 hour.:)"}, {"id": 14, "text": "A nice girl like you is an American romantic comedy which stars Lucy Hale. I was scanning through Netflix and thought it looked good so I watched it and I actually really liked it. Lucy Hale is brilliant as ever as an actress and she plays the character really well. The movie had me laughing and was entertained throughout. The rating for this movie is ridiculously low it deserved a bit more than a 5 I have seen some rubbish films. Not a bad film to watch ignore the low rating and watch it for yourself. A girl chick film to watch"}, {"id": 15, "text": "This film is amazingly funny and I couldn't stop cry-laughing when watching it. The storyline was so funny and Lucy and Leo were so great, as was everyone else. The actors brought the film to life and definitely made it what it is. An outstanding film. Cannot wait to rewatch!! Great job guys 💕💕"}, {"id": 16, "text": "I have no words to say how much I love this movie...it's amazing ..totally a mood changer...the actors did a wonderful job ...please watch it..."}, {"id": 17, "text": "This comedy is so funny, it's just off the charts. It made me laugh throughout the whole film. I recommend this totally hilarious comedy!"}, {"id": 18, "text": "Lucy hale is soo pretty and she has ugly bf in this ? and he dump her ?.. that really stupid thing here. some werid acting but its exciting .this movie could be good if the plot goes smoothly but it really got off from the beginning till the end.its not even a sex comedy. if this movie release in early 2000 , then maybe yeh its good, but not in 2020."}, {"id": 19, "text": "5/10 - more often than not, this sex-themed comedy's jokes fail to land"}, {"id": 20, "text": "This had the potential to be a good comedy ... but there a so many things that just fell short ..., but another reason I wasn't really into this film the constant violin playing drove me mad .... had to watch the whole movie with the remote in my hand to keep turning the volume down during the violin playing it seems like it was blasted right through the movie. Also no idea why this was rated R it's amazing what they think an R rating should be ??"}, {"id": 21, "text": "Awful movie!!! Why did Lucy hale want to make her lips look so hilarious . The movie was so bad , switched it off after the first 10 minutesLucy please get your lips fixed. You look like you're in pain."}, {"id": 22, "text": "Though story plot is interesting the movie is failed to impress you. Story is unnecessarily streched long without connecting main theme. However acting by main actress is good and movie starting is interesting but later it looses its grip. It is not much recommended as me rest the choice is on your own."}, {"id": 23, "text": "Not as bad as reviews stated. It's a situation probably not all the girls have but how she conquer is quite funny. Even it's quite lame but at least some scenes laughable."}, {"id": 24, "text": "This was kind of a silly movie but was actually funny. Lucy Hale can be pretty funny when she is in a good role. This was a sex comedy and you either like that stuff or you don't. I personally did."}, {"id": 25, "text": "I love Lucy hale but God it was hard to concentrate watching this film. Wasn't very entertaining. Bit pg too, not great."}, {"id": 26, "text": "I can't believe this is my first review on this platform but I think this industry needs more Virginia opinions. So yes I watched this movie and yes it was terrible but I ain't going to c9mpletely count it off my list. The love story was not great but the representation on some female sexuality is not completely misplaced.There were some really awkward moments on feel that stifled the flow of the story, out of place and felt like the mood/ genre of the film changed and didn't keep the same pace.Acting was mediocre at best."}, {"id": 27, "text": "In my experience that wos not really a movie... it was just one scene jumping to another with no real progression between them. Never seen such a mess of storytelling before. Comedic elements are mostly kind of slapstick and not funny in my opinion. There was no chemestry whatsoever between the main characters - but I do not blame that on the actors, I think they are capable of much more - it just is written that bad. Please, please review the very basics of storytelling !!!"}, {"id": 28, "text": "This film is made for people who obviously have no experience or knowledge of the human reproductive process, like home-schooled religious fanatics who think any sort of sex is a sin-or Hollywood writers who do nothing but watch movies. This is for the same crowd of desperately-bored housewives who made 50 Shades of Gray a bestseller. This is for women who have no idea what an orgasm is and think that sex is just another commodity that you can pick up at the big box store, or use some sort of miracle gadget to do all of the work for you, like one of those scam exercise machines.This is made for frustrated women who can't actually come right out and tell their partner what they are looking for in bed. This much I know, you won't learn a thing about sex at a strip club, except what pathetic losers consider to be normal behavior. We all have everything we need to do it already. It's free and it doesn't matter what you look like (ugly people are capable of great sex, too, in spite of what Hollywood would have you believe).This is billed as a comedy, but unless to cringe is now a synonym of to laugh, they may have put this in the wrong category.Is it just me, or is anyone else over the whole sexy accent thing in American TV and movies in which male leads have to have a British or Australian accent to be considered hot? News flash: Brits and Aussie men are total slobs just like we are."}, {"id": 29, "text": "No, I haven't watched the movie and I never will. I just watched the trailer and felt the compulsion to write this down for whoever might need to read this or for someone who doesn't like to watch the trailers like I usually do too. From the first minute of the trailer, without trying to do an in-depth analysis of the plot or to find out more about it, we see Hale's character, an odd girl who is referred by her boyfriends as being pornophobic(?), whatever that means, after which we see, in big bold letters on the screen, being announced what happens after 'she hit rock bottom' (at least it wasn't a dirty joke - kudos for that) - let's make this clear, she is at her lowest moment in her life because she thinks about food instead of sex with an ugly ass man (you didn't even try with the casting, man, but again, did anybody even try with this movie?). This made me feel repulsed, mad and had to close my browser altogether. What are we teaching the new generations? Anyway, I can't get myself to even finish watching the trailer it is just.. THAT BAD. I hope this helped yall make the decision of whether to watch this movie or not (and I hope you made the right one ;)) Stay safe!"}, {"id": 30, "text": "Really good watch, could watch again, and can recommend.I don't think this is one anyone is going to watch over and over, but it's a great one-shot.Lucy Hale is amazing, and I'll admit I wasn't a big fan of her character on Pretty Little Liars, but it really seems that she can elevate any role she takes, this one included. I honestly have a very short list of actresses that could have pulled this off as well as she did.There was also a fun appearance by Jackie Cruz (Orange is the New Black) with fun hair which was funny to see her expand her range, just a little, as the last time I saw her she was a scientist in Tremors: Skrieker Island.The story is a little odd, but it's designed as a slice of life sort of rom-com, so the setting is so allegedly normal to contrast the main character as odd in the idea that she's not into sex.I'm really torn on the movie's key concept that she's odd for not being overly sexual or that she's not because she's so uptight. Regardless, she has a fun little list of things to do, but she's clearly going to do it once and move on. I'm a fan of try it once, and if you don't like, then you can never do it again, but we're told to laugh at someone being brave about this.While the movie is supposed to be about her growth as a character, she clearly isn't designed to actually growth, just get out of her own way long enough to open her to a new experience of a new man, and then have that same openness become a conflict. I'd say that was a spoiler, but I think that is part of the movie's concept."}], "reviews_amount": 31}