{"name": "Downhill", "titleId": "tt04558376", "reviews": [{"id": 0, "text": "I thought this was a comedy. It is not. Also, it is not a drama. It's like watching a home movie with two people who don't really love, or like, each other very much. And then nothing happens. Two of my favorite comedic actors are in this bucket of boredom and that makes me sad."}, {"id": 1, "text": "I feel badly for Julia Louis-Dreyfus because her character is so unlikeable, in a movie that's equally unlikeable. Like watching a slow motion train wreck. Wish I could have that 90 minutes of my life - and my money - back. 3 stars, only for the scenery."}, {"id": 2, "text": "As the other user review suggested, this film has already been made, it's called Force Majeure and it's outstanding.It's a complete ripoff of Force Majeure without any apoligies. Downhill lacks the character and emotional depth of Force Majeure, plus it's sorely miscast in every way.If you're at all interested in Downhill, do yourself a favor and watch Force Majeure instead."}, {"id": 3, "text": "Joyless and boring. I couldn't wait for it to end."}, {"id": 4, "text": "This movie was so boring I actually wanted to miss this movie and take a piss. Like for real."}, {"id": 5, "text": "I am fifty years old. This was the WORST movie that I ever saw. It was depressing and even stressful at times. I couldn't leave early or even fall asleep. I was desperately waiting for any form of redemption... it never came. Save your time and money see anything else but this!"}, {"id": 6, "text": "I vaguely remember seeing a trailer of this once &amp; have generally heard little of this film. Then when I saw it was a last chance screening at my local &amp; thought to watch cos I saw Will Ferrell was in the cast &amp; thought it was be a comedy so I thought why not.The film follows a family who retreat off to the Alps in Switzerland after the father of the family is grieving the loss of his father who died 8 months prior. But after an avalanche incident, the divide between the the father &amp; the rest of the family deepens. The film from then on has the family punish Will Ferrell's character as he tries to make amends.The film is flat. Really flat. No comedy. No laughs. Not even remotely 1 redeeming feature. The film just drags &amp; drags &amp; drags, with the main chunk mostly focusing on the family being miserable &amp; moody. There's no oomph or any upbeatness to be had. It's just a bore-fest. But given this was suppose to be some character study I can kind of see why. Still, when you see Will Ferrell in the cast, along with the word comedy you're going to assume the film is going to be humourous in some way or another it wasn't.Ironically enough the title fits because the film really did go downhill fast. It's boring &amp; forgettable. And just when the film actually finally gets somewhere it ends! Making you think That it!?. All the dreary crap &amp; that's the thanks we get? Poor. The film is purely depressing &amp; is enough to put you to sleep.This hands down has to be the worst comedy film I've ever seen. I usually don't mind comedy films (even american ones). But this boring, depressing 80 minutes tripe was rubbish. I also learned now that this is a remake of a European film released back in 2014 under the name Force Majeure. Never heard of it, but it would probably be more memorable than this bland &amp; mundane excuse for a comedy!1/10"}, {"id": 7, "text": "This film already exist, and it's excellent. Simply look for Force Majeure (2014) or Turist (2014) -- same film but different title in different countires. It places people in a somewhat unexpected, yet perfectly realistic, situation and shows how their lives gradually implode in the aftermath. It shines a light on ordinary human weaknesses, and how pathetic many of us really are. It forces the viewer to reflect upon their own strengths and weakness: what woud YOU have done? And it does it really well. Why whould anyone see the need to remake this? And with as terrible an actor as Will Ferrell, of all people? Is Hollywood really so desperate, having no original ideas of their own anymore? That's just ridiculous. I'd encourage each and every potential viewer to avoid this pitiful copy and watch the original instead. Boycott is the only way to force Hollywood to stop with this nonsense. No more recycling! Grow a pair and take some chances, make new things!"}, {"id": 8, "text": "Rehash of a better movie. Not funny. Boring. Vapid. Can't think of enough ways to describe this waste of time. Just don't bother."}, {"id": 9, "text": "I made the mistake of going to this movie with my wife for Valentines's Day. Please heed my warning. This movie is going to cause some couples to divorce after they watch this.in short, we have a slow motion train wreck with no recovery. I had hoped that at least there was going to be a payoff at the end but it ended poorly too. The humor in it was just enough to keep you there for the whole thing hoping that there would be at least a redeeming joke or something. Nope. Awful. People are going to watch this and if hey see themselves in the characters, it will likely speed up their impending divorce, not stall it with nostalgia and discovering why they fell in love in the first place. Basically you see two people staying in a loveless marriage just long enough to see their kids out the door so that they can finally sleep in separate bedrooms or get the sweet relief of splitting up."}, {"id": 10, "text": "First, and most importantly, know this is not a comedy, it's a serious, purposefully slow-moving character study with a few very funny, even laugh-out-loud moments. Knockout scenery (and if you've ever been a skier you'll be craving time on the slopes immediately after viewing), this is the kind of film that inspires wanderlust, but some will find it too subtle and quiet. I liked it, but there were elements that bugged the heck out of me, especially the non-development of the two sons as important characters--they remain blank stares and mysteries for the entire film. Julia Louis-Dreyfus is very good here, Will Ferrell good but mostly one-note: The film is definitely given a shot in the arm by actors in supporting roles. Overall a recommended watch if you enjoy character studies where simple, subtle facial expressions and body movements are as important as dialogue."}, {"id": 11, "text": "Saw this opening night and was expecting a great new comedy..... big mistake. The story and script were terrible and not fun to watch. I wanted to laugh, but there was nothing funny at all. Sad addition to the resumes of 2 great actors. Save your money on this turkey."}, {"id": 12, "text": "Ferrell was stilted and out of his element. Dreyfus was the highlight, but was not able to carry the entire movie. The writing was uneven and created side stories that really did not fit the characters. They created such awkward situations that made viewing painful."}, {"id": 13, "text": "I thought it was a comedy. It wasn't. I thought it was a drama. It wasn't. Regardless of the genre, it felt like a real view into a genuine marriage relationship. There was some cringe (that missing glove scene!), humor, and a romantic moments.Overall, I enjoyed the film. It made me enjoy Will F. And as always, I adored Julia."}, {"id": 14, "text": "The original was everything this tired remake tried to be - clever, real, insightful, darkly funny, uncomfortable, human. So please see the original film. It truly captured what a marriage is like that now has a crack in the foundation. They never should have made this flick. If Will Ferrell and Julia Louis-Dreyfus wanted to make a comedy about a vacation gone wrong, go ahead. But leave FORCE MAJEURE alone."}, {"id": 15, "text": "Not funny nor dramatic. Lazy remake of a great European movie. Look for the oroginal"}, {"id": 16, "text": "Will Ferrell and Julia Louis-Dreyfus are two of the most talented and successful comedy actors in recent decades. Nat Faxon and Jim Rash form a Oscar-winning writing duo capable producing moving, thoughtful work full of heart and humor. Force Majeure, the film on which Downhill is based, is a powerhouse of picture, one of effective dark comedy and pungent drama. With all these forces seemingly playing in favor of Downhill, it seemed like the movie was an inevitable hit.So, why did it whiff so miserably?A major issue with the film is its lack of subtlety. None of the characters' flaws or any of the developing sources of conflict are unveiled with any level of showmanship. They're clumsily slapped onto the screen with the same level of delicate touch that a toddler uses to finger paint. The only difference is what the toddler creates will ultimately be colorful and show signs of life.Another massive flaw (I'll stop with two since I don't need belabor the point with excessive cruelty) is the apparent fear that went into the writing. All the punches were pulled. There are so many moments that walk right up to the edge of making an emotional impact, delivering laugh, or doing something of worth, but they cautiously pull back before completing the mission. We're left with an empty feeling at every turn.For those who are unfamiliar with the film's premise, the plot revolves around a mom and dad who take their two kids on a ski vacation. During an avalanche that takes place while the family is sitting at the café table, dad runs away, leaving his family helpless and alone. It turns out the avalanche was controlled and posed no real danger, unbeknownst to the vacationers. Dad returns to his trembling family and acts as though nothing happened. Mom is ticked.It's a rough look for dad, as he has lost the respect of his wife and kids. He proceeds to make excuses and deny responsibility for what happened. So, mom takes the atrociously bad advice of a concierge at their ski resort and decides to live her best life or something like that. Evidently, her best life includes breaking the fidelity of her marriage and touching herself in a bathroom stall. To each their own I suppose.Mom's exploration of her true desires could have been funny and revealing. Eventually, one would assume, she would learn the error of that way of living. But she never learns that lesson. Instead, the movie simply abandons that plotline after 15 minutes or so. Oh well, her best life would have been a first round elimination at the best life qualifying tournament. Not much interesting stuff going on with her.Mercifully, the movies sputters to a halt after a weakly realized pseudo-reconciliation for the family. Then, because the writers weren't quite finished firing blanks, the final scene orchestrates a scenario similar to the avalanche from early in the movie. This time, mom, dad, and the other adults involved all fend for themselves. The point exactly of this moment is unclear. It'll leave audiences everywhere shrugging as the credits roll and they turn to person next to them and exchange a look that says, I'm sure glad that's over."}, {"id": 17, "text": "Have you ever been round to another couples house, and they start bickering and sniping at each other in front of you. It's not a nice feeling, you feel awkward and don't know what to do...! That's this film in a nutshell, why would anybody want to watch that...?"}, {"id": 18, "text": "It's called DownHill for a reason. Absolutely the worst movie I have ever seen. I wish I had read a review before seeing this. Every minute is excruciatingly awkward and uncomfortable."}, {"id": 19, "text": "Julia Louis-Dreyfus is so irritating that I don't know if I can watch an episode of Seinfeld again. I'm concerned that I will see traces of this performance in Elaine. I almost left about a third of the way into the movie, but the cinematography was excellent (the source of my two stars), and I miss living in an area with snow and skiing. Will Ferrell's affect was as flat as an envelope. I think that Will Farrell's character was intended to be that of a man struggling to show emotion and begin to put energy into his marriage. Even at the end of the movie, I can't imagine Will's character ever looking any different. There was no sign of change or grown throughout the movie. Julia's character comes off as something of a shrew, and I found her unsympathetic. I did not find the boys' roles in the movie to be of interest. They were props more than characters. This movie was terrible."}, {"id": 20, "text": "I was interested in seeing this film because I love Julie Louis Dreyfus' acting and Jessie Armstrong's writing. To be fair I'm not a fan of Will Ferrell but I thought with a good leading lady, good writing and a wonderful story..how can you go wrong?? Boy did it go wrong. Boring dialogue, slow and tedious, bad acting (Will Ferrell) and no real story.It was neither a comedy or a drama. If it was intended to be both it failed on each front. The intended comedic/dramatic lines were dull and pedestrian. Although I'm not giving up on Ms. Dreyfus or Jessie Armstrong's genius, I'd recommend just skipping this one."}, {"id": 21, "text": "Ugh, boring. Acting: bland and boring. Plot: bland and tired. Nothing in this film is worth talking about positive, oh wait there is...the ending...."}, {"id": 22, "text": "Unlikable characters, boring dialogue, very little comedy. A flop for a Valentine's date! I started looking at my watch at an hour into the movie, and was shocked to find another 30 minutes were left! Would have walked out, but was with my wife. Forgettable film!"}, {"id": 23, "text": "Very depressing, boring and certainly no comedy. With these two actors I would expect more/ Generally Ferrel is kind off off the wall. But this movie was awful."}, {"id": 24, "text": "Torture watching this movie. Would have walked out but my wife liked the Austrian mountain ski scenes. Nothing else about this movie was worthwhile. It struck me as a movie where the stars agreed to do it to support a family member who was trying to get into movie production but had no experience and no skill."}, {"id": 25, "text": "I'm a huge movie buff. One of the worst movies I ever seen! I walked out of it halfway through. I even asked the theater if I could get my money back because it was so bad!!"}, {"id": 26, "text": "Downhill is a Remake of the 2015 film Force Majure. And Stars Julia Luis Dreyfus and Will Farrell. This movie premiered at Sundance so I was super excited for it, but now that I've seen it I'm a little disappointed. I will say I really enjoyed the cinematography and set design of the film. Those things mixed with a whimsical score gave it a Wes Anderson type of feel. Now as for the things I didn't like, I found both the characters in the movie very annoying and both very selfish which made the move hard to sit through. And the reason for the couples argument aka the whole backbone of the movie felt really shallow."}, {"id": 27, "text": "Don't bother watching, No real plot to the movie, boring and lame. Nasty bathroom scene as well. Don't waste your time watching this movie, you will regret it"}, {"id": 28, "text": "I just assumed, mistakenly, that this movie would be funny and entertaining because, hello, Will Ferrell and Elaine! Nope! Horrible waste of talented actors. Terrible story line. Who wants to be in the middle of two parents awkwardly screaming and and fighting with each other? Not me! And to have Hollywood's weird lack of morals forced down our throats? No thanks! Your way is not better! Cheating on your spouse IS wrong! And not all dads are bad and stupid and losers! And not all women are right just because they're women! No person, woman or not should be justified in screaming at their spouse and acting like a lunatic. What an awful movie! Wasted money. Wasted talent.so disappointing."}, {"id": 29, "text": "My goodness. This movie was awful!! Why Julia Louis Dreyfus would even agree to do this movie is beyond me. The characters are not like able at all. They kids are who I feel sorry for."}, {"id": 30, "text": "Whoever thought this would be perfect casting needs their head examined...Never have I seen a more toxic combination that are instantly unenjoyable side by side...45minutes in, 2 of the funniest actors for roles in recent years, have raised ZERO laughs... This will be a black mark that doesnt erase for a long time...Horrible film..."}, {"id": 31, "text": "If i wanted to watch drama i'd go for a series but seriously you guys bring will ferrel and not make the movie funny ? what a waste of time"}, {"id": 32, "text": "Absolute pile of rubbish i turned it off half way through"}, {"id": 33, "text": "I can usually find some redeeming qualities in any movie, but this one has none. It's so bad I can't even recommend it to be reviewed. I'm not the biggest fan of Will Farrell nor Julia Louis Dreyfuss, but even they have had some good movies and/or tv episodes. They both should have passed on this movie because it not only doesn't do anything for their careers, but hurts them in the process. I can't think of a movie I've seen in decades that rivals or comes close to the banality of this one. Hard Pass!!"}, {"id": 34, "text": "Didn't see much advertising for this film so it was under the radar, the film is apparently a remake of the old version, i did not know that &amp; won't be watching the original films.From the trailer it was confusing to as what the film was about, one clip was comedy laugh then the next clip was about a relationship then about a snow disaster? Really confusing to what the film was trying to tell us &amp; as a result the film had a weird vibe to it, if you strip the minimal comedy away from the film you are left with a very flat film, the other scenes are just odd, there just talking, not much character or feelings were passed through to the audience, you could tell that their relationship was not going well but all because of the avalanche, Will Ferrell legged it &amp; left his wife &amp; 2 kids to get hit by the snow, I'm sorry but they had ages to get inside to safety in the building rather than taking pictures &amp; videos on their phones they could of easily been okay, but the thing is you would not just sit there for a whole minute watching it, so that was a really silly part even though that was meant to set the tone for the film.Also his wife ends up kissing one of the instructors when she goes off on her own &amp; yet it seems like in the film that it was okay to do that? Where as Will didn't do anything to cheat in the relationship, i found that really odd.I did not go into this expecting a comedy , but what was i expecting, well from the trailer like i said, you don't know what you are expecting.Overall though we were in a cinema which was fairly busy &amp; there was not many laughs, a lot of just flat scenes which no one gave any reaction to.Age - 25Cinema: Cineworld Milton Keynes 2D (Unlimited Card)Watch, Avoid, Consider: Avoid, flat film you won't remember."}, {"id": 35, "text": "Will Farrell... Julia Louis-Dreyfus... has to be funny right? God no! The only thing a little funny in the movie were the supporting cast (primarily Miranda Otto).This turned out to be a painful ride (or run) down the slopes in the Austrian Alps. At least the scenery was beautiful!Can't tell you how much I would recommend that you skip this downer of a film. Both lead characters and their kids were just plain unlikable. You felt like you were in the middle of a dysfunctional family the whole movie. Who wants that? Maybe if it's a good story or well acted (like Ordinary People for example) Will Farrell was flat out boring in his role, and Julia Louise Dreyfus was wasted on this stinker.Recommendation: Hard Pass!"}, {"id": 36, "text": "-- falls apart in a rocky frozen location.If you want a visual of Billie &amp; Pete's personality just consider the bathroom scenes. Her side has the textured wall - a wall with character. His side is flat cement - no character. These scenes tell all.I didn't get the idea of Charlotte - a horny old broad who tries to pimp out a skiing instructor to Billie. Outside these three things the movie is a 1 1/2 hr yawn."}, {"id": 37, "text": "Don't waste your money!!! This is the worst movie I've seen, in a theatre, in a long time!!!!"}, {"id": 38, "text": "This is a awful movie, went to see it on Valentines day and 30 mins into the movie couples were walking out! Not that there were very many people to begin with. My wife and I walked out after 45mins. This movie is depressing and DARK. Not a fun movie, its not even funny! Save your money!"}, {"id": 39, "text": "If you have the opportunity to pick between an unneeded root canal or seeing the new Will Ferrell/Julia Louis-Dreyfus movie...have the root canal. Only Julia Louise-Dreyfus comes through this unmitigated disaster with dignity and reputation intact. Even the two teenage boys playing the children of Will/Julia seem to signal 'we know!/get us out of here' to the audience. Ferrell powers through hoping, I'd guess, for a nude/underpants running through the town scene to rescue the worst movie of his career. The comedy bits aren't funny, the drama unconvincing, the sexy subplot limp, and the family dynamics excruciating."}, {"id": 40, "text": "This movie depressed meI got so depressed watching this movie. It reminded me of who's afraid of Virginia Woolf"}, {"id": 41, "text": "Will Ferrell and Julia Louis Dreyfus star in this film and a husband and wife on vacation in an Austrian ski village. After a poor reaction to a resort planned safety avalanche, a deep rift forms between the two ruining the rest of the vacation. I love comedies, and I recognize that it's a difficult genre to do well. Despite the ratings, I adore these two actors so I gave this movie the benefit of the doubt. That being said, The characters in this film are selfish, annoying, and wildly unlikeable. I hesitate to call this comedy, as any 'jokes' can only be described as moments so painfully awkward that it forces a visceral reaction out of the audience. I didn't hear a single honest laugh out of the theater for the length of the movie. I contimplated leaving the theater several times during the run, and in retrospect I should have just cut my losses. Even if this movie makes it free to Netflix, I would encourage everyone I know not to waste the 1.5 hours of their life by seeing it. A true turd, I have no idea how this movie ended up getting made."}, {"id": 42, "text": "This is a stupid Hollywood idea for remake of the fantastic Force Majeure movie. It will be more watchable than the original even though it is much worse. Why make a remake of a movie from a couple of years ago. Why didn't anyone bother to sell the original in the US market."}, {"id": 43, "text": "The film starts off strong and has its moments throughout, but too often boils down to a series of uncomfortable scenes with unlikable characters. Not quite funny enough to succeed as a comedy, but lacking dramatic substance, Downhill ultimately fails to find its footing."}, {"id": 44, "text": "I don't know why this was described as a comedy/drama there's no comedy in it and to take two comedic actors and put them in these roles it was a little uncomfortable watching them, very slow moving"}, {"id": 45, "text": "I laughed twice in this movie, and should've walked out."}, {"id": 46, "text": "Never been a Will Ferrell fan and this is his worst film to date. Total garbage!"}, {"id": 47, "text": "I'm a huge Will Ferrell fan but I can't understand why he'd make this film,supposedly a comedy but for me there wasn't a single laugh in it. Terrible film"}, {"id": 48, "text": "This really is a bad movie, slow script, empty characters it's just utterly pointless.. I felt annoyed watching this and limped on thinking it would get better but no it does not get better at all!"}, {"id": 49, "text": "This was a horrible experience! It should have finish after the first couple scenes to protect movie goers."}, {"id": 50, "text": "This film has so many bad reviews here but being such a big fan of both Julia and Will, i watched it anyway and it was really very good! It may be it is not simple enough as many of the Will Farrel films are so I added a star or two for that? It has them both doing more drama without much comedy - other than Julia's patented sarcasm. It is a remake of a Swedish film and it helps if you understand Europe and especially German culture. Don't pay attention to the bad reviews, if you like these actors and enjoy good relatable and realistic drama - watch this!"}, {"id": 51, "text": "I'm surprised this movie is classified as a comedy, as there are few, if any, funny scenes. It may be that there isn't a classification for angry or awkward, which is this movie in a nutshell. I had low expectations, yet I left extremely disappointed. I saw it with my wife and kids, none of which could find anything redeeming."}, {"id": 52, "text": "Walked in thinking 'if this is half as good as Veep or Old School, this should be great. Sadly its not to be, about an hour in I said to the friends 'this ain't funny, is it supposed to be?' I truly could not tell, I had not laughed yet. I think the premise was 'Hey Will, want a free ski trip? Sure! Oh you also have to sleepwalk though a movie. Sure no problem.' Also, if you know anything about mountain life, the story is laughable. No Resort would allow a avalanche chute to become so dangerous as to put people life at risk, let alone blast chutes during operation hours with a bunch of people sitting out on a deck below it. IF this was not intended to be a comedy, when will Hollywood learn people don't want to watch a family fall apart. The wife was a basket-case, the husband, a wimp, yet another example of the fall of the straight white man. We use movie to escape, especially two comedy legends with the resumes of the 2 stars, I so wanted to laugh my head off, sadly my expectations went downhill. Don't waste your time unless you have taken your med's or are very very tired, you wont laugh anyway."}, {"id": 53, "text": "Billed as a comedy. Still waiting for the first laugh. Maybe some rewrites and work it as drama might have worked. The best part of the movie? Literally the 24 minutes of previews before it. Really expected some over the top with the top billed cast. Thankfully I have the unlimited movie plan and I didn't fork out more money to see it."}, {"id": 54, "text": "Boring, depressing, waste of time, waste of talent. Watching someone's marriage end is not what I signed up for when I watched this movie, but here we are."}, {"id": 55, "text": "Very strange film.Comedy actor but not comedy.,Drama but not dramatic.A Real lame effort.It just seemed totally pointless.Only plus points were mercifully short and scenery was prerty."}, {"id": 56, "text": "Worst movie I've seen in years ! With such a comedic cast I was expecting more !"}, {"id": 57, "text": "Little surprised with the low ratings. This is a very dry, dark humor movie, that crosses into drama. If you don't like Ferrell or JUlia, you won't like this. Found it very enjoyable, especially with Miranda Otto and her character. Cringe worthy, and some parts were very funny."}, {"id": 58, "text": "All american versions of swedish cinema has always been trashy. This is a lightweight stereotypical mess. Not even the avalanche is convincing. In the 80s things was very different. Is it really that hard to make an intellectual artistic movie if they not had to make a american remake? I mean. What audience is this for? 3 year olds? Skräp. Uselt. Dåligt."}, {"id": 59, "text": "Wow what an incredibly horrible movie. Not even sure why it's rated r. Like watching a parallel universe where everyone's clinically depressed even though they're in a place that most people dream of going. Hard to watch in the most unproductive of ways."}, {"id": 60, "text": "Hey Will, we've got a great story line for you I think this movies going to be a hit! So basically you're a middle aged man, who goes away on a skiing trip with your wife and kids, but there's a twist!! You have petty arguments with your wife for the entire trip! BUT THEN at the end of the movie, get this Will.. You make up"}, {"id": 61, "text": "Why? Horribly executed adaptation of the brilliant Force Majeure. Ferrell and Dreyfus play a boorish ugly - American couple on ski holiday in Europe. Could we ask for any more inane American and European clichés? The otherwise wonderful JL Dreyfus should be supremely embarrassed to show her face in this stinker. Don't bother. Watch the original."}, {"id": 62, "text": "Straight up...Dad runs away from the snow, fine, just say he was making sure he wasn't trapped with the rest of his family so he would be free to dig them out if need be. Maybe movies like this happen when you have blackmail info on your actors."}, {"id": 63, "text": "This film is billed as comedy/drama and it lacks in delivery of either. I have not seen the original Swedish film, but I sure hope its better than this. The cast's talents are wasted in a film that just doesn't know what it wants to be. Honestly the best part about this film is the Italian actor Giulio Berruti who is cast as a ski instructer, but his appearance is all too brief. 'Downfill' is an apt description of this film."}, {"id": 64, "text": "If I wanted to watch two adults argue for two hours straight I'd go to my parents house. This movie is awful."}, {"id": 65, "text": "This was a terribly dysfunctional movie with zero redeemable qualities. If you like to sit through manufactured tension for an hour with no resolution, this is your dumpster fire."}, {"id": 66, "text": "The Staunton family takes a skiing vacation in the Alps. All goes fine until an avalanche hits them eating lunch on an outside terrace. Billie Staunton (Louise-Dreyfus) gathers her kids together, but Pete Staunton (Will Ferrell) leaves to safety. This causes Billie to reexamine her relationship with Pete.This is not a comedy and it barely survives as light drama. This is touted as a comedy/drama. Keep in mind there are no comedic moments, no funny lines and just not a comedy by any sense of the word. Basically, it is dull and most annoying because we keep waiting for the comedy to begin. Never happens.Then to add insult to injury Pete invites his friend Zack (Zack Woods) and his girlfriend Rosie (Zoe Chao) to accompany them as they are now in the same area.Billie goes off on a tear into Pete in front of Zack and Rosie and there is no coming back for Pete after this mostly because Billie tells the truth about Pete leaving his family when the avalanche hit. Pete denies this, of course.The above is all you need to know. There is no reason to say more.This is quite dull, not funny and most annoying movie I have seen in a very long time.Oh, wait a minute I said there were no funny lines. I forgot one. When Billie asks the kids what they want to do next. One of the boys says, Go to the beach. That was it. Okay, I chuckled.What was good? The music and the landscapes with those mountains. (2/10)Violence: No. Well, the Avalanche. Sex: No. Nuidity: No. Humor: No. Language: Yes. Rating: D"}, {"id": 67, "text": "Some good actors and nothing to see. It's not a comedy, it's not a drama. It's nothing."}, {"id": 68, "text": "Don't waste your time it's honestly a horrible movie"}, {"id": 69, "text": "Two very funny comedic actors come together in a film that is supposed to be funny. Turns out to be a drama with an extremely weak story line. There is nothing funny about this film and Julie Luis Drivers character is whiney and contrived. Don't waist your time with this movie. Such a disappointment for Will Farrell!"}, {"id": 70, "text": "Downhill (1.5 out of 5 stars)Downhill is a forgettable drama comedy about a family going on a ski trip. When an incident happens when the family was in shock when a controlled avalanche almost came close to them. And the husband takes off saving himself. Drama begins to rise.The story was dull. The acting was terrible. The script and direction was joyless and boring."}, {"id": 71, "text": "Aptly named movie. It goes downhill from the moment the film begins."}, {"id": 72, "text": "One of the most realistic portrayals of a relationship that has been committed to screen. Maybe IMDB expects something different from JL-D and Will Ferrell and the lack of hilarity is affecting the voting. And maybe the characters around them trying to add comedy to what is otherwise a fine character piece makes it more obvious that they are not playing the comedy roles that they are so famous for. But there is actually very little wrong with this film as a solid piece of dramatic cinema."}, {"id": 73, "text": "If you're not married you won't enjoy the perfectly portrayed rage by Julia LD and this realistic portrait of a marriage. This movie will appeal to those who have been married, especially in a long marriage. I loved this, and I especially loved when JLD was yelling at her husband Will Ferril in front of his friends. Awesome. A strong woman character, and nice scenery of the Austrian mountains too."}, {"id": 74, "text": "Why do comedians think they can act? They can't. The title is extremely appropriate as both of these stars are clearly in the downhill phase of their careers. This film doesn't even deserve two stars, but out of respect for Ron Burgandy I gave it one extra. A painful exercise in wanna-be acting. That sex scene was almost unbearable to watch. And the kids were dreadful. Better to go to the dentist than see this entire film."}, {"id": 75, "text": "I'm not exaggerating. It was so uncomfortable and awkward.The good: The performances were good. Even the kids. Miranda Otto was very funny. Zach Woods was great and his story was funny and took an accurate shot at hipsters. That's it.The bad: Julia's character was so annoying. Their whole vacation is ruined because they won't talk to each other? I don't think most people would let things go on this far. She takes a day for herself instead of talking to him? She couldn't pull it together for the helicopter ride? She was awful. He was bad also because he wouldn't talk but to let it ruin everything!The ugly: The scene with Zach at the hotel is so long and unbearable that I don't think anyone would actually let that happen with guest and involve the kids like that. The end where she calls him to save her? That was retarded. No one in the theater was laughing. I was wondering if most of the jokes were even supposed to actually be jokes.Such a waste of talent and snow. Julia is phenomenal as is Ferrell, their talent could have been used for so much more."}, {"id": 76, "text": "I thought I would at least be a bit entertained but this movie was so monotonous. There were no climatic moments, the story and characters were dry throughout the film. Nothing happened. The original was enough."}, {"id": 77, "text": "To be fair I only watched about 10 minutes of this movie. Only because Force Majeure, which Down Hill was based on, was so fantastic. Subtler and more on point. Much more cinematic and clever in its development. I love Julia Louis Dreyfous and Will Ferrell...but Downhill cannot hold a candle to its Force Majeure. Maybe it wasn't meant to. But still..."}, {"id": 78, "text": "Worst Will Ferrell movie ever! Got 20 minutes into it and turned it off. Not a comedy at all."}, {"id": 79, "text": "This film start with a couple(Billie and Pete) taking photo with their son, and all of them skiing together scene! As turnout, this film is about Pete need to reconcile his relationship with Billie in a family ski vacation! Entire film full of boring conversation, and annoying overuse scene! Such as, overuse of the brushing teeth scene, and overuse of the arguing scene! Make the film unwatchable! Barely intense scene is, an avalanche occur, when Pete and his family ordering soup to drink! At the end, Billie forgive Pete coward act! Pete and his family scare by the snow fell from upstairs! That's it! Wasting time to watch!"}, {"id": 80, "text": "This movie did not know when to be funny or serious. Sadly it failed on both counts. It lacked the depth of 'Force Madjure'. The unsubtle nature of the American filmmakers made you feel little empathy for the characters."}, {"id": 81, "text": "Music made for the movie is not a fit. Feels like a Ferrari is at the trac trying to race around with a Toyota Corolla engine."}, {"id": 82, "text": "If you want to laugh or smile, go see something else."}, {"id": 83, "text": "How do they classify this movie as a comedy? I did not find one joke throughout the whole movie. It would have been more enjoyable if it was classified correctly instead of waiting for the joke and punchline to come when it wasn't going to. The acting was ok for comedians doing a dramatic role. If you go in thinking it's going to be a comedy because of two great comedic actors, you will be disappointed."}, {"id": 84, "text": "Had to stop it because it got annoying. Is boring, not a comedy at all."}, {"id": 85, "text": "Was looking forward to this - Will Ferrell, Julia Dreyfuss - hoping for a family type comedy - echoes of national Lampoons maybe - that's what the trailer seems to hint at. Man was I wrong. Will Ferrel wasn't funny once in it, because his character didn't get a chance to. It was all situational awkward humour - one scene with Julia got a laugh, but otherwise just not funny. More the the point the characters weren't even likeable to the extent it was just painful to watch at times. The movie really is not uplifting. Very rarely do I wish I had simply never watched a movie. Scenery was nice."}, {"id": 86, "text": "Entire movie was awkward and cringy. Almost every character is irritating and annoying.I can't believe people actually make money making a garbage movie like this"}, {"id": 87, "text": "It's an annoyingly sad marriage drama with unlikable characters throughout. Hard to believe these two very funny actors couldn't make it work.. mustve been destroyed on the editing floor or something. Oh well. NEXT."}, {"id": 88, "text": "This movie being sold as a comedy is pitiful. The scenery was awesome, but the movie was plain sad and depressing. Expected so much more."}, {"id": 89, "text": "Really depressed! i hate this movie. not a comedy not a drama also."}, {"id": 90, "text": "This has to be up there with one of the worst movies ever made, no comedy, hardly any exciting background music, extremely dull scenes, most the film you'll find yourself looking at people just not talking and sitting awkwardly with each other, or just skiing down a ski slope. If you're looking for a film to make you cringe the whole way through, this is the one for you, otherwise spend your money on something a tad more exciting. Don't even get me started on the ending. Dreadful movie."}, {"id": 91, "text": "Please for the sake of all movie goers, all sane and normal... do not waste your time trying to find value in this ad hoc compilation of boring non comical vignettes! This is the kind of movie that will play in hell where you watch it over and over again wishing you were dead!"}, {"id": 92, "text": "Who gave the OK to make this movie? Is not funny, it is not a romance story, just a waste of time and energy by everyone involved. Do not waste your time!"}, {"id": 93, "text": "Downhill rarely uses the talent of its lead actors and goes for more of a generic troubled relationship genre film. . In this dark comedy, after almost being swallowed by an avalanche during a family vacation in the Alps, a married couple are forced to reevaluate their lives. . While you do feel the tension between Ferrell and Dreyfus' characters, Downhill unfortunately takes a huge tumble doesn't save itself from a film we're all too familiar with. Though I haven't seen the orignal Swedish film Force Majeure (which received critical acclaim by the way), I don't believe it needed to be remade for the English language. It's a tough pill to swallow when two solid comedic actors can't save a film with so much to say. . Follow @snobmedia for more reviews!"}, {"id": 94, "text": "Called it based off of all you want, it's a clear ripoff. And it's bad. VERY bad. The humour doesn't work, the bickering is unpleasant to listen to and the title best describes the film itself rather than the events that happened. There isn't even a lot to say on this because it's so uninspired. It's an awkward, unfunny and needlessly depressing mess."}, {"id": 95, "text": "This movie had its moments where it was funny and many that were not funny. I don't know how Will Ferrell was casted for this film. Not a great fit. If you want comedy please avoid this movie unless you are bored and want to waste1 1/2 hour."}, {"id": 96, "text": "Probably the worst movie I've ever seen. Hard to stay thru the whole thing. Lots of inappropriate language and foaled characters. Don't waste your time or money on this one."}, {"id": 97, "text": "I thought this was MUCH better than the user/overall reviews give it...It was entertaining, rather humorous, good acting and a more interesting storyline than A Marriage Story...I don't understand the hate. I almost didn't watch it bc of the horrible reviews which would have been a mistake."}, {"id": 98, "text": "Why didn't anyone think of a Ferrell, Dreyfus comedy teaming years ago? If anything could bring back screwball it might be this duo. Ferrell, a comic bumbler with a bit of Jimmy Stewart along with the biggest TV comedienne since Lucy in Julia Louise. It is an idea however they may have come and gone a decade back. It is hard to take Dreyfus seriously for a minute and as it turns out take her funny side more than a half hour sitcom at a time. Ferrell continues to be the ubiquitous one note schlub of over reaction and mope phoning in his beleaguered dad /hubby performance seen in about a dozen other films over the years. The film itself is a timid clunker not certain if it wants to be a comedy or deal with real life issues but the die is cast when the filmmakers decide to send in the clowns to misrepresent the tenor of the film which remains stuck in a predictable snowdrift the entire run. Downhill is all from end to end."}, {"id": 99, "text": "This is not a comedy! The trailers didn't advertise this was a comedy. The bad reviews are from closed minded individuals that won't let an actors out of their 'box'.Great movie about a woman trying to get her family on track to stay together. Slap stick comedy was replaced with very uncomfortable scenes that were important to the story and memorable.See the movie just to appreciate how talented these costars are."}, {"id": 100, "text": "Zero redeeming qualities, not a single laugh, sincerely difficult to watch. Just excruciating."}, {"id": 101, "text": "I don't see why people hate this. Excellent movie with actual conflict and a touch of humor. Plus who wouldn't like that ski instructor ;)"}, {"id": 102, "text": "I understand the hate this movie is madness! The acting is atrocious almost as if the directors didn't care at all. So much goes wrong throughout which is unsettling. This could be used to torture someone held hostage and want someone to suffer. Easily one of the worst movies I've seen!"}, {"id": 103, "text": "This was a great looking movie which was about a family where the parents relationship had been slowly failing. This isn't a silly comedy but rather a look at the family's relationship with some laughs chucked in. Good performances all-round and some great cinematography.I think most of the poor reviews are due to people expecting a full on comedy which it isn't - a pitty as I almost didn't watch the film based on the low scores, but glad I did!"}, {"id": 104, "text": "I only joined  so I could review this movie. Without doubt a horrible movie. Only gave it a 1 for the scenery, other than that,I have no idea why this movie was made.Terrible casting, storyline, production and overall quality.I can't think what the worst part of the movie was, other to say, all of it.Please don't pay to watch this movie, you would have to pay me big money to watch it again."}, {"id": 105, "text": "This has to be one of the absolute worst movies I have ever seen. I went because I thought there might at least be some humor, not so.Don't waste your time going to movie theater or even streaming it.A real dud...!!!"}, {"id": 106, "text": "I kept waiting for the comedy. Expecting it with these 2. It went to a very real place I hadn't expected. Some really big moments in a relationship! Should have been advertised very differently."}, {"id": 107, "text": "Not funny at all, bad acting, unlikable characters, stupid plot. Done."}, {"id": 108, "text": "The original had depth and a realistic tone that this film didn't achieve at any point. The different direction in humour was cringy, with stereotypes of Europeans, such as wanting to strip naked, would only amuse the sort of audience members that hold these stereotypical views and annoy the rest of us. They even took an actor who played a brilliant multidimensional charactactor from the original and gave him a comical one diminsional role in this film, which again shows the movies attempt to dumb down the whole original story to appeal to a wider American audience. I wish they gave them more credit. I have seen the original and then this and it was like visiting iguacu falls and watching water coming out of a tap. I wish those two main actors pulled off a serious role like this. They both are masters of thier craft and I love them for it, but maybe stick to your day job."}, {"id": 109, "text": "This movie is just awful. The is not a single likable character. I can't believe Jim Rash is one of the writers."}, {"id": 110, "text": "People watch comedies to laugh and get in better mood.I will be shocked if this movie has not caused depressions or suicides."}, {"id": 111, "text": "This is my first review on IMDB and it was prompted by how truly dreadful this movie is. With Will Ferrell and Julia Louis-Dreyfus staring in what is advertised as a Comedy, I expected there to be a few laughs along the way. Unfortunately, there wasn't a single one. The single part of this film that was well done was the outdoor cinematography.I assume once the editing is complete the cast gets a private screening of the film. I wonder if Julia and Will walked out thinking that was good!?"}, {"id": 112, "text": "Why oh why there's this urge to remake a good film that was filmed just few years before. And to do it so badly."}, {"id": 113, "text": "A lousy remake of the swedish Force Majeure which is a very good movie. This remake falls flat. No tension. No characters. The male lead really sucks. The children sucks..... Stay away from this one, and see the swedich original!"}, {"id": 114, "text": "A picture may be worth a thousand words, but sometimes those words are performative; lies, both little and big, captured on film for posterity that relays a reassuring story the familial models can tell themselves. On the slopes, a vacationing family from the states is approached by a freelancing photographer in Austria; he convinces the Americans to pose for a series of stills that seemingly proves their unconditional regard for each other. Downhill, directed by Nat Faxon and Jim Rash, begins just like Reuben Ostlund's Force Majeure, its 2014 Swedish predecessor, establishing the husband/wife and parents/children bonds without any latent pathos for the most part, but with one small difference, played as comedy, that foreshadows the old adage; appearances can be deceiving. Whereas the Swedish couple and their two children get through the session against a French Alps backdrop without a hitch, the Americans' photo shoot ends up being a bit helter-skelter. On a physical level, Pete Staunton(Will Ferrell) hurts his wife Billie(Julia Louis-Dreyfus), when the two bump helmets a little too hard while leaning in for a pose. Technology, albeit of the non-digital kind, quietly insinuates itself as an obstruction from the corporeal world of loved ones. Polycarbonate plastic is just the beginning. Ow, can't begin to describe the emotional upheaval Billie will feel when their marriage is put to the test.A stranger is in their bed. It plays music, it replaces the human voice, it controls every minute of people's lives. And it rings. Thomas(Johannes Bah Kuhnke), in Force Majeure, promises Ebba(Lisa Loven Kongsli) that he won't pick up. The wife gets up to use the bathroom. When Ebba returns to the bedroom, she catches him red-handed with the phone. We don't know who's calling. It could be work, a telemarketer, a friend, or another woman, but that's not the point. A binary is established by this inanimate bedmate; reality/fantasy, a bizarre threesome, in which cyberspace, particularly, the infinite amount of naked ciphers whom Ebba, a flesh and blood Norwegian bombshell, has to compete with for her husband's attention. Thomas' counterpart in Downhill may not be, as it turns out, a serial philanderer, but Pete, in spite of being, by all appearances, a loyal spouse, seems more in love with his phone than Billie. While the family sleeps, Pete is wide awake, texting a good friend on the toilet. Potentially, any woman he wants is at his fingertips. But she's not real. Modern life is no life at all, half of it is spent online. Pete probably doesn't have the slightest idea what to talk about with his wife when Finn(Julian) and Emerson(Ammon Ford), their sons, aren't around to fill the white noise. That's why in the restaurant, Charlotte(Miranda Otto) is a sight for sore eyes. He gladly accepts the hotel concierge's invitation to join her for dinner, against Billie's objections, because the husband needs the social interference of extra bodies rather than spend time alone with the woman he had promised to love and cherish 'til death do us part.The avalanche remains the same. Harry(Vincent Wettergren), the son, in Force Majeure, can see what his father can't. The snow's momentum will cause the frozen assemblage of precipitation to supersede the parameters of the restaurant's terrace. Thomas insists that the disaster in the making, more or less, isn't real, but rather, controlled, despite the screams emanating from his family and the other patrons. His denial of what is plainly apparent suggests an inability to distinguish reality from fantasy. In Downhill, to the filmmakers' credit, offers an explanation as to why the father in Force Majeure and its American remake, saves the cell phone instead of safeguarding his family from potential death. Pete is googled to death. The father surfs and texts so much, he forgets where his real life begins, Downhill seems to suggest. To Pete, on a metaphorical level, the avalanche is an event film, but he fails to notice the lack of protective glass, the oncoming snow is not a flat 2D image, so the metaphor fails. This is no movie screen. He makes a run for it when his recognizance usurps this waking dream, the suspension of disbelief. During the cataclysm, Pete's modern brain keeps his lizard brain in check. The primordial cerebellum signals to Pete that he run away from a filmic image, like the moving train from the 1896 silent one-reeler L'arrive d'un train en gare de La Ciarat, directed by Auguste and Louis Lumiere, which caused 19th century moviegoers to flee the bijou. The avalanche, quite pointedly, looks more life-threatening in Downhill, the rogue snow, a killer on the loose, so prevalent it causes the disaster zone to go white, like the screen of a smart phone on the blink. When the ice flurry settles, Pete realizes his mistake, like so many of us, thinking that our online lives are more important than our offline ones. After the incident, Downhill riffs on the motif set by the original film, in which Thomas and Ebba stare at their reflective selves brushing teeth with electric toothbrushes. Thomas hates the man staring back at him. In Downhill, Pete becomes the man he hates, when Billie asks her husband to take care of his dental hygiene on the other side, the same bathroom in replica. This mirrored Pete is like the negative of a photograph. Same man, but harder to decipher.Ebba never quite forgives Thomas in Force Majeure. A wreckless bus driver, obviously drunk, can't maneuver the long and winding downhill roads. Once again, the father fails to act. It's Ebba, the mother, who orders everybody off the bus. Downhill, in contrast, reveals the fallacy of Thomas' prior heroics, when Ebba gets separated from the family on their last ride down the mountain. She was pretending to be lost or hurt, just like Billie, who gives her husband a second chance to be the hero. The mother wanted Finn and Emerson to respect their father again. For Billie, her husband's correct interpretation of the reality/fantasy binary is enough. This time, Pete is offline. He finds his wife sitting down, perfectly safe and sound. Instead of standing still, Pete searched for her in earnest. It's a Hollywood ending. After all, it's a Hollywood film, a fantasy. Conversely, in Force Majeure, Ebba walks like a woman. Thomas walks like a boy.Reality."}, {"id": 115, "text": "This is billed as a Will Farrell disaster movie which I find to be a redundant phrase. While on vacation in Austria the family experiences a planned avalanche. Will ran when the event happened while his family stayed behind to get a face full of snow. No real damage. This causes a rift. This was the worst I have seen Miranda Otto. They needed a better script and different actors. Tina Fey and John Goodman? They could never properly develop the story or characters.Guide: F-word. No sex or nudity."}, {"id": 116, "text": "How on earth did this get made? The script is absolute garbage, and the actors who read the script then signed on need their heads examined"}, {"id": 117, "text": "This is quite possibly the worst movie ever made. Will Ferrell and Julia Louis-Dreyfus should be banned from making movies after this disaster."}, {"id": 118, "text": "How or why Julia and Will onboarded this movie I have NO idea. Unfathomably bad script and the poorest direction I've seen in years. Utter shame."}, {"id": 119, "text": "So painful, was actually grateful to switch off halfway through. Why make JLD so shrill? It was a rare miss for these directors"}, {"id": 120, "text": "I love both of the actors in this movie, so I was interested to see how they were together playing as husband and wife. It wasn't that the acting was necessarily bad, they were just given a REALLY dull script to work with. First of all, this is listed as a Comedy movie, but there was not one single funny thing in the entire movie...the actors didn't laugh once, and there were no jokes for the audience either. I wish I could take back the time I spent watching this painfully dull movie."}, {"id": 121, "text": "Anyone that's been through a divorce, knows the feelings elicited by watching this.Just terrible to sit through.....and I can't believe I sat through it. Maybe the only reason I made it to the end was because I distracted myself by surfing my phone.This is a don't watch unless you really want to know what the end of a marriage feels like."}, {"id": 122, "text": "3/10 - I love Julia Louis-Dreyfus, but literally like nothing happened in between the start and end of this foreign-film remake"}, {"id": 123, "text": "All I could think is how were Julia and Will convinced in participating in a dumbed down version of a magnificent film. Why? But then I read Julia's interview where she said their version had a more optimistic ending and it told me all I needed to know.Just a shame that people who work in film think Force Majeure needed a iremake a few years later. Just a shame. I mean, they could've gone with the premise of a husband reacting poorly in a life and death situation and instead of making such a poor copy.Why?"}, {"id": 124, "text": "I was hoping the avalanche would take me out to put me out of my misery of this movie. This movie moved so slow. I kept waiting and waiting for something to happen and it never did."}, {"id": 125, "text": "Got through the first fifteen minutes of this, my wife thought it was half over...and I really wished it was. Fifteen minutes felt like 45? Says how boring and slow this movie was. Turned it off after fifteen, glad I didn't pay to see it."}, {"id": 126, "text": "Don't bother watching. Movie is terrible! Such a miss for Will Ferrell. Billie is annoying as hell, kids have zero personality, the entire thing is awkward and boring."}, {"id": 127, "text": "This movie is abysmal. Probably going straight to dvd where I hope all copies are burned or shredded. I can't believe the actors even accepted their parts. The only thing redeeming was a cool avalanche, but sadly bit needed to wash everyone away! I agree with most other commenters, worst movie I've seen in 3 decades..."}, {"id": 128, "text": "A 60 year old woman with young kids she gave birth to. Really?. Her roll continues to be controlling at all times like most of her other movie rolls. Really bad acting. Will Ferrell also over aged for such a movie. Low budget truly shined through on this film.. Not to mention mountain slopes were to far for an avalanche to hit the lodge. Really? Nothing believable"}, {"id": 129, "text": "I just want to say that this movie was so bad that it was nearly impossible to watch. Two actors Dreyfuss and Ferrell could've made a movie that was hilarious- instead this is Ferrells third attempt to be wryly funny and he fails every time. Holmes and Watson, Eurovision and now THIS. Stick to what you're good at Will -Daddy's Home, Elf, Stepbrothers and Kicking and Screaming is where you belong."}, {"id": 130, "text": "They took an intelligent, high quality indie flick and Americanized it. Added tons of exposition, vulgarity/swearing, 2D caricatures, sex jokes, and vapid dialogue. Watching this movie is like ordering gyros at Arby's while there's a superb authentic Greek restaurant down the road. Just watch the original, this is embarrassing. Will Ferrell and Julia Louis-Dreyfus deserve better. Waste of time, millions of dollars, and comedic talent."}, {"id": 131, "text": "I've never seen the original version but this remake, unfortunately, doesn't meet expectations given the talent of its two lead actors. There are moments you want to laugh (kind of) but the film immediately pulls those moments back. Then there are anticipated dramatic strands that don't fully materialize. While JLD pulls her weight Ferrell's performance is oddly mechanical and uneven all at once."}, {"id": 132, "text": "It was a slow movie that felt like it never really started to advance the plot, then just ended. The acting was good, the movie looked good. There was just a complete lack of story."}, {"id": 133, "text": "I'm not even sure what happened during that hour and 20 minutes... Despite the big names and talent, this is a total waste of time and film."}, {"id": 134, "text": "Like many reviews, I went in expecting a comedy, but I still gave it a watch since Will Ferrell showed he could do a not quite comedy film with Stranger Than Fiction.Downhill offered a slow-burn throughout but the payoff never came. It was a character study with uninteresting characters. Everything (except the on-location filming) had Indie film vibes, including a very bland soundtrack which felt like it was just plucked off of a royalty free music site. It lacked heart or charm you would hope for given the indie vibes."}, {"id": 135, "text": "Remake of fairly recent movie-this one portrays a sad couple that refuses to communicate. They don't seem happy to be on vacation or with each other. No one was likable. I didn't understand the point of the final couple scenes... Was a decent way to kill 85 min on flight..."}, {"id": 136, "text": "Pointless waste of time and money. The original was more restrained and better acted."}, {"id": 137, "text": "This has got to be one of the worst movies I've ever seen. The 2 main characters are both unlikeable, the movie long and boring. Don't waste your time. It would be more enjoyable watching grass grow."}, {"id": 138, "text": "Did someone cancel Will Farrell? This movie was horribly written and a complete disappointment when it comes to the talent that was in it. The opening scene is a little funny and then for the rest of the movie you're waiting for a punchline that never shows up. I feel like the editors just had nothing to work with and pieced this atrocity together."}, {"id": 139, "text": "I am a fan of both of the stars in the movie and that is my reason of giving the rating of 2 stars. I am going to see the original movie and hoping that it won't be as disappointed as this one."}, {"id": 140, "text": "Why do they need to take a pretty good movie and remake it (trash it) like this? What's wrong with watching the original version with subtitles? If I gave the original 10 stars this one cannot possibly have 5, so I give it 3 only because Will Ferrell is in it."}, {"id": 141, "text": "Went to watch this film to cheer myself up thinking its got to be funny if will ferrell in it. But oh my god was I wrong it was so depressing about a struggling marriage with kids :("}, {"id": 142, "text": "This is a prime example of a film having an identity crisis that hurts the experience. Downhill is the story of a family that experiences a terrifying, traumatic event only to be made worse when the father tries till save himself and abandon them in cowardice.Unfortunately, it wants to have it's cake and eat it too. It wants to be a stops family drama and a comedy at the same time and that just doesn't land. It's a shame too because the leads seem fully capable of that kind of performance, so it leads me to believe that it's on the director or the writers.If this would've committed to being a drama I think it would have vastly improved the overall film. Instead, there's this blah, underwhelming disappointment."}, {"id": 143, "text": "The only somewhat amusing part about this involved a brief visit from Ferrell's over the top alcoholic character that we've seen as Frank the Tank and a couple of other places (everything must go?). That lasted about 20 seconds and, like the rest of the movie, never really played out.The movie ended up feeling like it was a bunch of little stories that each could have been interesting but were edited in such a way that they never hit home.What's annoying is it could have been at least ok with what it appears they had.After a day of reflecting on this I am wondering what we did as a society to Will Ferrell and Julia Louis-Dreyfus to make them hate us so."}, {"id": 144, "text": "Well this movie is garbage compared to original. The scenes are emotionless even the avalanche scene is awful the way will ferral run away is absolutely horrible as it feel so fake. Acting was also awful. The movie just felt so rushed. If you watch the original you definitely hate this but if you dont watch the original even then you will not like it."}, {"id": 145, "text": "For such a great cast, it's amazing how bad this movie is. It certainly could not be called a comedy....it's hard to define what they were trying to achieve with this film. It would have worked well as a drama but they choose the wrong leading actors for this as they are both excellent at comedy, not whatever this was. Watch it if you want to but if you think it sticks after 10 minutes, don't keep watching as it doesn't get better, it keeps going downhill."}, {"id": 146, "text": "Yet another terrible movie by WF. I could not fast forward fast enough to the end"}, {"id": 147, "text": "One of the most boring movies I have seen in a while."}, {"id": 148, "text": "No really, what was the point of this movie. Absolute cringe-fest. Just so much awkwardness. Save your time."}, {"id": 149, "text": "Only watched for Ferrell hoping for some laughs. No laughs and nothing likeable about any characters. Rotten."}, {"id": 150, "text": "The actors were great the movie was bland. Nothing truly turning happened, the entire time felt like waiting for the main event to occur, yet it already had? I wish there was more to it. Unfortunate because I really liked the cast."}, {"id": 151, "text": "Don't waste your time on this film. Bad acting, worse script. All around embarrassing and uncomfortable to watch. I'm just glad I didn't waste money on this garbage."}, {"id": 152, "text": "This is truly the first time, I had left a movie halfway into it, after and before other people left also. This movie was not funny, and was very boring, and also not a family movie"}, {"id": 153, "text": "The is movie was entertaining from start to finish. Good acting, well paced, unpredictable and it also got deep into some existential questions. It's not a movie you watch more than once or tell friends hey you gotta watch this but it's solid."}, {"id": 154, "text": "Omg I was extremely disappointed with this movie. I basically wasted whatever time it was watching it. Badly written and directed everything about the movie is BAD."}, {"id": 155, "text": "I overrated this movie (normally I would give a 7) because I really don't understand the hate. As entertainment, for me it delivered more than promised, since I expected a disaster and I started watching it to fall myself to sleep. I ended up watching the whole movie. Then I watched the original Force Majeure cause I was curious what was so outrageous about this remake. My conclusion is that we have two different movies. Sure, the first is a European drama, more artistic and better quality as film making, but it's also an unsettling movie, and for me it left an impression I won't forget soon. Yet I still prefer this one. It's lighter, comedic while still dealing with serious issues, and I liked Julia Louis Dryfus 's performance. The ending seemed more optimistic also, and lately I've gained a new appreciation for happier endings."}, {"id": 156, "text": "This is a good movie. Really. The problem is the two stars are best known for comedy and this movie is not a comedy. But it's still a good movie.Forget about looking for laughs and look at the real interaction between the characters. It's very well done."}, {"id": 157, "text": "Worse movie I've seen since Joe vs the volcano. Ferrell and Louis-Dreyfus should never attempt to do drama again, stick to comedy. I would watch a scene and keep waiting for a punch line that never came. Considered leaving half way through the movie but stayed hoping the ending would offer something...finally did: freedom once movie was over, credits ran and I got out of there. Would have given it less than 1 star if able. Would only recommend to someone I have a strong dislike for, haven't meet that person yet."}, {"id": 158, "text": "The comedy isn't funny and doesn't really work but Downhill is still a really good drama that's gripping and uses its short run time effectively. Will Ferrell and Julia Louis-Dreryfus are both really good and have great chemistry. The direction by Nat Faxon and Jim Rash is good and it's well filmed. The music by Volker Bertelmann is also really good."}, {"id": 159, "text": "Barely surviving an avalanche that simply turns the screen white and knocks over one table but mysteriously doesn't leave behind much snow.Lol okay."}, {"id": 160, "text": "You would think that with Will Ferrell and Julia Louis-Dreyfus that this is a home run. But nope, it doesn't really get anywhere and I never laughed at all."}, {"id": 161, "text": "Nat Faxon and Jim Rash's 'Downhill' is a pretty competent remake of the excellent Swedish black comedy, 'Force Majeure.' While Faxon and Rash tend to have a slightly difficult time juggling the comedy and drama here, 'Downhill' remains effective at generating conversation about survival instinct and protecting one's loved ones. At the heart of the film are stars Julia Louis-Dreyfus and Will Ferrell, two veteran comic performers whose expert sense of comic timing allow them to bounce off of one another like the seasoned pros they are. It is also wonderfully shot. The wide views of the mountains make for some great ambiance."}, {"id": 162, "text": "Julia Louis-Dreyfus makes this movie unwatchable. She's the quintessential ugly American. I stopped it half way through."}, {"id": 163, "text": "You can't tell me Jurassic world fallen kingdom is a 6 and this is a 4. Pratt single handily ruined a franchise and these losers give it a 6. Downhill is about a family hitting the slopes at a nice resort while Will Ferrell's character (the dad) tries to keep his family from falling apart or (going downhill). This was not a knee slapper like step brothers, but there definitely was some funny parts."}, {"id": 164, "text": "I waited about an hour and a half for this movie to be funny. Nothing happens. Basically the entire movie is an argument. It was horrible."}, {"id": 165, "text": "If they make a RIP OFF comedy version like SCARY MOVIE , then it would be great, i thought its a comedy movie, but its like cheap version of force mujero movie.another thing which makes this movie more SUCK is about feminist thing, its all about female power or something like that, that wife went with another man to cabin and start kissing but didnt do it and then keep blaming the husband until the end. Even other scenes where a woman tells that she can do watever she want to make her happy doesnt care anything about her husband , another scene where woman tells the wife that she would kick in his balls if her husband did it .wtf this movie telling us... why will farrel chose to do this movie."}, {"id": 166, "text": "Why would you take two of the funniest comedic personalities and make a sad, depressing movie? They listed this as a comedy/drama. They need to drop the comedy. Even the drama was bad. Such a letdown."}, {"id": 167, "text": "I thought it supposed to be a funny movie because Will Ferrell in it. But turns out, it becomes dark movie with annoying wife."}, {"id": 168, "text": "At times it was reasonable but never more. It just always felt like it was missing stuff even though I half enjoyed most of the film in what I would describe as generally remarkably average however the last few scenes and ending Ferrell especially seemed to have dialed it in and just did not care about even trying by this point. Slightly below average but not as horrifically bad as some are making out certainly watchable."}, {"id": 169, "text": "This movie is awful. Actually, from now on I will be referring to this as moving frames on a television. This THING has no characters. These moving frames on a television has no story, nor is it a comedy or drama. Honestly, I don't know what they were trying to do with these moving frames on a television. DO NOT WATCH THIS."}, {"id": 170, "text": "You won't laugh because it's not funny. You won't cry because there's no reason to be empathetic. Nothing happens for 15 minutes. Then nothing happened for the remaining hour and a bit. Came for the leads, stayed hoping it was going somewhere but it didn't. This movie makes Howard the Duck look like a best picture winner. At least that had a plot."}, {"id": 171, "text": "I love Will. I want to forget I watched this. It was annoying all the time."}, {"id": 172, "text": "It's supposed to be some kind of drama, which shows two people who try to fix their lives and marriage... But it was very poor written, characters are boring and story is boring... And everything in this movie is so slow and boring. Skip it, there's nothing to see here"}, {"id": 173, "text": "What a crap ! Pulling off your tonails is more entertaining."}, {"id": 174, "text": "Remember when George Costanza, seeking to save his own arse, ditched his date and others when someone yelled fire in the building. Downhill is a similar scencario, except this time Julia Louis Dreyfus ain't laughing."}, {"id": 175, "text": "This movie has many false starts, the set up is ripe for a laugh but falls flat. I think it's probably just a mediocre script in the hands of a poor director. Julia Dreyfus seems a bit old to have children this age. She looks very haggard in this film.Will Ferrel plays the same character as in all his films. And we are all tired of that scene baby!"}, {"id": 176, "text": "I think most research on what happens when people witness a crime as to whether to intervene or stay away is that most would stay or walk away. But what happens if it's family and there's no time for decision making. What are the percentages for either of those innate reactions? So in this case you &amp; your family are suddenly faced with a life threatening avalanche. Personally, I would have liked the script to pursue that angle more and less of the family squabbles."}, {"id": 177, "text": "Watched this last night hoping Will Ferrell would've been on top form.I've seen the original but was hoping Ferrell and Dreyfuss would of added something to this version .I was wrong.As the title says it went downhill.I only give it five for the scenery.Very disappointed."}, {"id": 178, "text": "Sorry guys that's the best you could really say about this one. Real shame, the cast is good, setting great, storyline had makings, but fell flat. It honestly felt like half of the scenes got accidentally deleted and they just tacked together what was left. Strange..."}, {"id": 179, "text": "But the characters were just awful people. i love will and julia in real life and many other roles, but the people the portrayed in this were just unbearable individuals and i was left feeling sorry for their fictional children."}, {"id": 180, "text": "The couple was originally the same bird. Human weakness aims to show in this movie. How to deal with the incidence after is what next to show. It just not very dramatic kinda story, but realistic and dawn on me what I will do if same situation happens. Also, what if the wife sit opposite of the table n the husband in between kids.....I heard it's a remade and thought it would be nicer if the story setting is the way I suggested."}, {"id": 181, "text": "I can can only guess something went horribly wrong during production of this film but they were too far along to cancel it. The result is an epic failure, and a strong contender for the worst movie Will Ferrell has ever been in. It's a little hard to conceive this movie was released on Valentines Day because it's definitely going to leave a bad taste in anyone's mouth and set the tone for an unpleasant evening. First of all, it completely fails as a comedy. It's not funny whatsoever, and what little humor is there, is foul and sexually awkward - doesn't strike the right chord. On a drama level, it's better but people aren't going to see this for the drama aspect. So it's just a steaming mess with no upside. After watching it, I felt personally violated as if I just participated in a two-hour argument. Like I said, I think something must have happened during production where they were contractually obligated to finish it. Because otherwise this would have been canceled. I doubt if Will Ferrel would actually want his name attached to this mess."}, {"id": 182, "text": "This movie is not what I expected from the trailer I saw. For a comedy with notable comedic actors I did not see the humor or laugh at all or hear any laughs in the theater. I found this movie to be physically painful to watch. Maybe it's because I kept waiting for the punchline to lighten things up. I was almost ready to leave the theater before it was over(something I don't do), when it caught my attention with resolving conflict. I'm glad I stayed, but if it was any longer I don't think I could have. I wish I would have read the reviews before going to this one."}, {"id": 183, "text": "Force Majeure subtlety was important, and it makes it hilarious. It was a movie with one big punchline and it kept us disturbingly laughing throughout. The issue with having comedy juggernauts like Will Ferrell and Julia Louis-Dreyfus head up the American adaption is that you know the movie has to be filled with jokes. They just could not count on the the one big plot device that caused so much genuine awkwardness that you could not help to laugh. They tried to be as subtle in their own way but it did not work. It could not work because they could not relay on the one thing that keeps the movie going. They needed to put in many things to play it safe. It was not a bad movie in content. Standing alone the premise of the story is still very funny. They have to add more substance to it because Americans need the silver lining despite this being a story that really isn't made for one.Which is why it's not as good as Froce Majeure and just can't be."}, {"id": 184, "text": "Of course the original Turist is better but this is a good effort. I can't see, though, Americans getting this. The low pace, the subtle humor combined with tragedy and drama. Heard people fall asleep on premier night. They've tried to hold back of the in your face behavior, typical of American comedy. But still it's there. My recommendation: see both! :-)"}, {"id": 185, "text": "This movie is a true and free lesson about egoism, how to handle with real emotions and hard moments between partners. A lesson for every family. Psychologically is very well made, I hope more people will understand the true intention of the script. Some movies are made to entertain us and some to educate us."}, {"id": 186, "text": "This is a well written, excellently acted, dramatic comedy. It is funny. And it also has darker, deeper themes about love, relationships, and life stages. I thought it was excellent! I'm shocked the critics didn't understand its depth and brilliance."}, {"id": 187, "text": "I loved it. Julia Louis-Dreyfus is awesome and Will Ferrel can do more than comedy. Downhill is not a comedy. It's full of dark humor, but it's a great movie. I'm intrigued by the movie it's based on and will definitely watch it. I go to the movies to feel and enjoy, and I did both."}, {"id": 188, "text": "I don't know why all the hate towards this movie, so I had to write a review. It's not a tipycal Will comedy, it's more like a funny drama. It's well acted, and written. With a lenght of an hour an a half, that avoids boredom. Also there's a Nice chemistry between the Main characters played by Julia and Will. This film depicts some important aspects of a relationship, parenting and what families are all about. It's a definitely must if you're a fan of Will."}, {"id": 189, "text": "Downhill is funny and tragic and ironic. I liked seeing the ski resort, the sled ride and the lifestyle there. Will and Julia were a pleasure to watch. I had flashbacks to Lampoon's Vacation movies and the commentary on relationships and family in our age was thought provoking and poignant. This is not a typical slapstick, toilet humour, SNL style movie. Downhill is subtle and thought provoking and made for a mature audience."}, {"id": 190, "text": "I really liked this clever &amp; modern remake so much more than the sub-titled Swedish original. Downhill was more relatable and a lot more entertaining for me.Don't expect your typical comedy though, this one has a great mix of serious and fun moments. Highly recommended if you're married - you will understand."}, {"id": 191, "text": "Watched the trailer and skipped it but finally went back and watched the movie. It was so funny I thought and not sure what all the hate was about but I liked it. If you liked cable guy you will enjoy this"}, {"id": 192, "text": "This is a simple film a family that goes on vacation. With the cast you would expect it to very funny but it isn't. It has a good story centered around the WHAT-IF scenario. Will Farrell failed in this case and Julie Louis-Dreyfus made him pay. This film is not for everyone so watch at your own risk."}, {"id": 193, "text": "Downhill (2020) - 4.7Act 1 - 4.5Act 2 - 5.3Act 3 - 4.3 One of the most unnecessary films I've ever seenRemake of a good Swedish film but is worse in every way possibleForce Majeure treated the message with nuance and intelligence while Downhill force feeds the audience an unimpressive messageForce Majeure challenged masculinity and what the foundation of relationships areDownhill tries to do this, just in the laziness way possibleOriginal treats the audience with respect while the remake thinks I'm stupidDownhill still has its few moments of enjoyment but never enhances the originalPerformances are mediocre and Will Ferrell was miscast in this filmWould not recommend to anyone."}, {"id": 194, "text": "I never review movies, but this is a disgusting waste of human earth time, don't waste the hour plus you have, on this absolute garbage."}, {"id": 195, "text": "It's a sad slow movie that doesn't make much sense of what's going on. Usually when you see these two actors in a movie that it should be a Comedy. The only movie that I walked out from was The Crying Game.... this was my second. It's a very sad disturbing movie"}, {"id": 196, "text": "Without going into too much detail: I expected a fun, funny and light movie. What I got was exactly not any of those things. Here I am pleasantly surprised by the unpleasant. Keep an open mind and just watch this movie. Fair warning though, if you're under 35 and single there's a solid chance you just won't get it, Maybe come back to this one 10 years from now."}, {"id": 197, "text": "If you go into this expecting a comedy you will be disappointed. As a married woman, with children, I found this movie to be beautiful. It's real, raw and uncomfortable. I find the harsh reviews to reflect a total misunderstanding of this movies intent."}, {"id": 198, "text": "This movie demonstrates why ratings on sites like this can't necessarily be trusted. I'd been avoiding this movie because of the low rating, but the wife wanted to watch it, and turns out we both enjoyed it. Perhaps it helps to see the original first (which I had, but my wife had not) to know this was not going to be a comedy, because if you go into it thinking it is a comedy, you will be very disappointed. It's not supposed to be funny, so not really sure why they cast typically comic actors, but they did a nice job nonetheless. I liked the ending of this version better than the original. Basically, it's a film about how an unexpected reaction to an event impacts the relationships within a family, and I thought the subject matter was handled very well."}, {"id": 199, "text": "It's funny in parts but don't expect this to be typical Will Farrell. I actually liked it for its realistic portrayal of a dysfunctional and surreal family. I imagine many parents will be able to relate to different parts of the film. It's not meant to be Martin Scorsese quality film, enjoy it for what it is. Thought provoking."}, {"id": 200, "text": "With the two leads and the trailer audiences must of rushed to theatres expecting a slapstick comedy. Instead we are witnesses to the deterioration of relationship and commitment. A modern day War of the Roses(1989) the comedy is dark and the love is soured. Both Ferrill and Dreyfuss are good in the leads, but the reviews reflect that these are not the performances people wanted to see from them."}, {"id": 201, "text": "Who would EVER think these two characters are interesting in ANY way? I kept wanting Will's character to tell Julia's character to SHUT UP! The whole avalanche scene was beyond dumb. I guess when you see an avalanche heading your way you just sit and wait for your death. I have to stop, am getting mad all over again."}, {"id": 202, "text": "I didn't really know what to make of this movie, it has so many scenes that ends with...nothing really. The storyline you will expect from a movie like this is: Family on vacation fight, man and woman gets angry and consider a divorce, man and woman get together again at the end. This movie is like this: Family on vacation fight, woman is cheating on man without it ever being mentioned again. Man and woman does'nt really get together again. The end. And also, it feels like the movie end in the middle of the story."}, {"id": 203, "text": "A review here for those who'd like to hear someone's take on the movie which doesn't feel the need to compare it to its original foreign counterpart. There's a certain self-serving pretentiousness in saying a movie isn't as good as a foreign film most in your reading audience hasn't seen. That seems never more so apparent here. This is a review of Downhill that's based on its own merits.I came away liking this in the end. There were some tonal issues in the comedy/drama mix - particularly some contrivances which work better in a comedy than a relationship drama. The movie is a drama first and foremost, but is probably funniest to parents who can enjoy the awkward interactions between husband and wife trying to juggle stress for the good of their kids - and their family vacation. The humor isn't what drives this movie, however, so even Ferrell fans hoping for a laugh-fest aren't going to get it here. Both Ferrell and Louis-Dreyfus have shown strong dramatic acting chops before, and I think they do so here.It's wonderfully shot. The wide views of the mountains and the music that accompany the cutaways makes for some great ambiance.The nature of the movie's turning point is maybe its biggest dud, mostly because the entirety of it doesn't make much sense. The scene is initially done well, building up the intrigue and fear of the moment, but when the father returns without so much as an are you guys okay? the scene loses a little dramatic punch, because it seems a little too contrived that a parent, who feared for their own life, would have had so much disregard for the welfare of his wife &amp; children.The film seems to try to reconcile this - in the face of seeing his family pulling away - by painting Ferrell's character as not only disconnected/distracted, but by seeming to have an active disdain for his children. Maybe these scenes are believable to some, but to me they felt like contrivances in a film that portrays itself based in a reality. Is this a story of a father who's sacrificed his family for work? Is this a breakdown by a man who lost his father earlier in the year? We never quite get sense of why this is happening.Ultimately this is solved via comedy - Ferrell getting drunk enough to admit his fear, and we come to realize what seemed like an existential threat to their marriage was really just a prolonged fight.This is why the movie works for me. Spouses get into plenty of arguments, even some which seem more serious that really were because of moods or the way the parties handle communication post-incident - not the incident itself. Sometimes all it takes is a silly resolution to fix what seems like a serious fight, and that's about as close to reality as the movie gets."}, {"id": 204, "text": "A real uninspired film, with terrible writting, awful pacing, and boring characters. This is just another candidate of the HOT PASS group of 2020."}, {"id": 205, "text": "Avoid. Swerve. Bail. Miss This is a shocker even if viewed as a serious film (and why would it be, with Ferrell and Dreyfuss???)"}, {"id": 206, "text": "Watching the trailer to this movie you expect it to be a decent comedy, that was a complete lie. It is cringe-worthy watching this failing attempt at a drama/comedy, this movie is a drama with maybe three funny scenes, and the drama isn't even good, it's like listening to your friends who are a married couple tell a story of what they did over the weekend, this movie shouldn't have been made."}, {"id": 207, "text": "Very disappointing as far as comedy is concerned. This was a relationship drama of sorts. The storyline was actually ok but don't call it a comedy because I didn't laugh once, nor did anyone else watching it with me. We waited for a laugh but nope.... it never came. Actually we kinda got into it because of the 'cringe factor' . Got sort of intense"}, {"id": 208, "text": "Much like everyone else, I agree this film was horrible. The plot was awful, based around the family of 4, the children provide little addition to the storyline and they are pretty much ignored. Save yourself 90 minutes of your life and don't watch this."}, {"id": 209, "text": "Couldn't recommend this to anyone. Advertised as a comedy, but not funny at all."}, {"id": 210, "text": "I watched this because it was billed as a comedy. I'm glad I had a rental code and didn't have to pay for it. I chose this as a movie to watch for Mother's Day with my family. I feel like my movie evening was a waste. The saving grace is that it was a movie night at home with my kids. Only watch this movie if you want to be disappointed."}, {"id": 211, "text": "Awful. Barely any comedy. Storyline was butchered vs original force majeure. Julia Louis-Dreyfus came across as a moody spoilt housewife throughout. Thank god it was only 1 hr 26 mins."}, {"id": 212, "text": "I in part blame myself for wasting an hour and a half of my life watching this travesty. I never watched the original film but from watching the interviews with the lead actors I got the impression they were dispassionate about this project and I now see why. They cast two comedic geniuses in Julia and Will, but even they couldn't salvage this drivel. I honestly was trying not to give away any spoilers but I am outraged at the character development and how in my opinion they subtly undermine marriage. Will's character's betrayal/error was made due to his fear response which was unintentional, shameful but still unintentional. Whereas Julia's character made a conscious decision to betray her spouse/family and it is never addressed/highlighted/exposed/discussed/mentioned. I'm not married but I feel sorry for any married couples watching this together. It may be better to skip this one, however if you must watch don't become too emotionally invested."}, {"id": 213, "text": "The title is of course a double-meaning for Skiing and the direction the film's main relationship is heading, but you can also apply it to the audience's experience. Aside from a few well-acted scenes by JLD, this is a miss on almost all aspects of filmmaking. But I think more than anything, it's simply boring. It's unfortunate that Faxon &amp; Rash's follow up to the brilliant 'The Way Way Back' lacks heart (which ironically is the title of their next feature), but sometimes a movie shouldn't be remade.5.0/10"}, {"id": 214, "text": "Downbeat is more like it. anyway, the two leads are perfectly cast as a married couple facing a crisis. the movie doesn't seem to know what it wants. i'm pretty sure some of this was supposed to be funny. alas, not to me. julia is very good. similar to her character in enough said, a film she made a few years back with james galdofini."}, {"id": 215, "text": "Downhill is one film that could be called a drama blended as a comedy though the humor may seem a little dark and dreary still it brings laughs even in tense moments. Also the film is one of looking at doubt and reflects on things after a happening in life causes a married couple to rethink things. The story set in the Alps involves Billie(the perfect Julia Louis Dreyfus) and Pete(Will Ferrell) a married couple with kids and after a near fatal avalanche occurs life and focus is brought into the front for the couple. It's really a test of character, will, and fate, will love and time conquer all? The viewing is different as it's not all comedy much of it is serious yet the chemistry from Dreyfus and Ferrell works."}, {"id": 216, "text": "I thought this was a brilliant observational storytelling. Just like the original Seinfeld episode this was movie was based on, the premise is hysterical. But this movie was so nuanced and the fallout of the initial plot is what unfolds. I dont want to spoil it but watch without expecting slapstick mainstream comedy. Yes, you've got 2 of the funniest people in the movie. They are doing more drama acting than we all are used to seeing. But I loved how the story unfolded."}, {"id": 217, "text": "I tried to watch this dumpster fire of a movie. I wound up shutting it off right after the avalanche. I didn't need to see any more i could just tell that this was going to be a waist of time and not enjoyable. So I would definitely say just skip this one."}, {"id": 218, "text": "I understood that the man did a mistake but in real life , the thing was coming down fast, and they were stuck on the other side of the bench. A rational thing is to take your phone and save yourself so that if something really bad happens you can call for help or you can start to dig to find your family. He didn't do it for this reason but he would have done that in case of this happening. But she was so annoying, after the helicopter scene I had to take a break because I couldn't stand to look at that snake."}, {"id": 219, "text": "So much product placement it's not funny. Same as Eurovision movie with W Farrell. Almost like he has become a travel agent."}, {"id": 220, "text": "I was lured into this horrible film because it was Will Ferrel and they claimed it was a comedy. Why make a remake of another horrible and predictable film? But that is the problem with american movie making of today, no new fresh ideas or balls that dares to challenge the audience. Always afraid to offend someone on twitter."}, {"id": 221, "text": "...they're comparing it to the original, Force Majeure. Which is a problem because they're completely different movies. The both have the same general plot, but the characters are completely different. Force Majeure's couple is younger, more attractive, Sweedish, the dad's dedicated to his kids, they has less initial tension, but also still figuring out their relationship. Downhill's couple is older, American, plenty of tension, the dad almost disinterested in the family, marriage on the rocks type situation.Beyond that, the tone, pace, use of dialog, imagery, comedic relief, everything is different. as (all the other reviews have pointed out). Force Majeure's style would not have worked for Downhill's style. Comparing the two is a pointless exercise in film-snobbery. I actually liked both movies. Personally, I liked Downhill more as a I found the characters more relatable. But skip the reviews, and judge this movie on its own."}, {"id": 222, "text": "The acting is superb, both Julia and Will did a great job by subtly revealing at least one side of each character.About the story, sure it is slow and boring, just like the lives of many of us. Not all of us are bouncing between beach, ski, safari, or exploring trips. Life is mundane for the majority of people, especially those at that stage of their lives.Julia did a great job of portraying an annoying woman, who can pinpoint the problem and assign blame but who is not interested in getting to bottom of it and helping her husband get through whatever he is going through. Will did a great job of portraying a depressed tired-of-life middle-aged man, who is kind of self-absorbed and can't see the purpose of this life anymore. Whether that is because of his bereavement or his submissive personality.At the end they offer a glimpse of hope that the woman figured out that she needs to help her husband through this tough period, or he should set her free of his boring clutches.PS: I have not seen Force Majeure so I'm not comparing these movies."}, {"id": 223, "text": "Dreyfuss was good as usual but the whole film wasn't a patch on Force Majeure which it used the same plot"}, {"id": 224, "text": "This film tells the story of a family holiday going desperately wrong.I guess people expect this to be a comedy, but it in fact is a drama that involves a lot of bickering and negativity. It's not a bad film, just not necessarily what people want to watch for escapism."}, {"id": 225, "text": "Whilst Downhill isn't a complete disaster, it's just a tedious movie to watch. It executes everything so badly and the film is just wasted potential. I haven't seen the original though, so I can't really compare. Will Ferrell and Julia Louis-Dreyfus are very good and easily make the film worth watching but they can't save this film at all. It's really quite dull and whilst they attempt to make a something decent, they very rarely succeeds, thanks to the characters.Everyone is so unlikable and I don't know if that's because everyone is bored or whether they want to us to hate everyone in the film. If that's the case then good job.Thankfully it's quite short and didn't drag too much but it's just something to avoid. It just is an incoherent mess, that should be avoided."}, {"id": 226, "text": "After their first great film the way way back, which also didn't shy away from emotional moments, don't go in expecting just comedy. It's a really dark look at a relationship which will make you wonder why the two were together in the first place. It's not a bad movie and has a few solidly funny moments but mainly it's a drama. Also it's a remake of a foreign film so maybe that's why it's so different?"}, {"id": 227, "text": "I couldn't figure out how to give 0/10. An appalling story, wooden acting and not remotely funny. Will Ferrell has fallen a long way. It's one redeeming feature is it's only 1hr 20mins (of absolute torture)."}, {"id": 228, "text": "Drama with comedy moments.Remake of a recent foreign language movie Force Majeure (which I haven't seen) - The family suffers a near miss disaster whilst on a skiing holiday during a controlled avalanche. A wall of snow threatens the family, the father character jumps up, grabs his phone and runs leaving the rest of his family behind. He fails to protect his family, later his cowardly behaviour makes him contemplate his decision and actions, and his relationship with his wife is severely tested.This is more than a comedy, it's emotional in places, and the whole family dynamics are tested and strained. I laughed in a few places and I quite enjoyed."}, {"id": 229, "text": "I had very low expectations from this movie. But this is actually funny and the acting is good from everyone. Julia Luis Is amazing as always. Reminds me of Seinfeld and my younger days. I couldnt help but laugh out loud at some of the scenes. Thanks Hbo for making this and giving me a good deal on the subscription."}, {"id": 230, "text": "This is for the f trds in the reviews. Its a decent remake of the euro original. All the clowns expecting your tried and true Farrel yuk fest , yeah its a bit more nauced than that. I liked the original Force Majeure better, but thats always the case. The original is really tight. But for dumb arses to give it a 1 , you really are lame. So it wasnt a ha ha comedy, get out of your white bread zone for a minute and go with the flow. 10 for the algorithm. 7 for a decent attempt."}, {"id": 231, "text": "This movie is probably getting bad reviews because Will Ferrell is a slapstick artist and this movie has more heart than his usual movie. Do not go into it thinking it is something it isn't. It has substance and as a father, this movie will make you think. Watch it and enjoy it for what it is. A pretty decent movie."}, {"id": 232, "text": "Will Ferrell can act yo! This was intense and subtle at the same time. Turns out it's a remake of a Swedish movie. It's a nice change from fluff comedies and superheroes. I can't believe the ratings on here. They either didn't watch it, are really young or have an idealized view of marriage."}, {"id": 233, "text": "I watched this movie as a drama, which is essentially what it is, though it does have quirky, ironic humor. The overriding feeling I had throughout was of awkwardness, due in large part to characters dancing around a crisis without directly addressing it, while at other times the relational, familial aftermath of the critical moment plays out in front of other people, which only increases the awkwardness. As a result, in a strange, difficult to describe way, it is one of the most unsettling movies I've seen in a long time, precisely because it seems to establish a light-hearted tone, while at its core it's a very serious drama about a crisis of trust that happens within a marriage. This bait and switch of tonality seems to be what other reviewers are complaining about or misinterpreting; whereas I think it is what makes the movie at least partly successful."}, {"id": 234, "text": "Beautifully written and executed by Julia and Will. What drives each of us in a relationship? This rhythmic movie shows what your life is in a relationship with kids vs no kids and the frustration of suffering in silence. How you can be alone and together at the same time. You wait for a moment of unconditional forgiveness or surrender, you want it so much it's ironic. If you have been there in your life and felt what they feel or if you are basically married, then you know why it doesn't come unconditionally and why a spec of hope can keep the snowball rolling /falling yet with no forward movement. The analogy of an avalanche or falling snow is the perfect accompaniment to the story of marriage. I don't understand why everyone is so down on this movie if you like Scarlett and Adam in a Marriage Story you will like this. I guess you just have to get it and not watch expecting a comedy just expect a great story with excellent acting."}, {"id": 235, "text": "Will Ferrel and Julia Louis Dreyfus are their same hilarious selves. The story has some uncomfortably hilarious moments. I thought the movie did a great job of combining good humor with a challenging story! Don't worry. It's not a miss. You will actually laugh a good bit if you appreciate Will and Julia!"}, {"id": 236, "text": "This is not as bad as many people rated it. I'm imagine they were expecting a comedy, which it isn't. They should give it a chance as a story of family dynamics and relationships. Some of the sillier parts could have been left out."}, {"id": 237, "text": "Going in knowing it was not a comedy, I got quite involved in the relationship dynamic. I do have to admit I felt really sad for Will Farrell's character. He just reacted in the moment and I think Julia Louis-Dreyfus' character was quite unreasonable to blame him to that extent, even after his heartfelt apology and reconciliation attempt. Glad I watched it."}, {"id": 238, "text": "I really liked this film. I saw Force Majeure and didn't make the connection until the avalanche scene. This film is much more European-styled, with a slower pace, beautiful imagery intermixed with a quirky soundtrack, and a plot where the people and resolutions (or lack there of) are more like real life."}, {"id": 239, "text": "Not a comedy, maybe why its missed the mark for so many. Actually quite a deep film"}, {"id": 240, "text": "There's only one thing I have to worry about right now, one obligation and that's going down. So says the punching bag, sad sack persona of Pete Staunton. Staunton is played by Will Ferrell who keeps the funny shtick to a standstill in 2020's Downhill (my latest review). Oh and Julia Louis-Dreyfus plays Staunton's grating wife Billie. Ferrell and Louis-Dreyfus really get out of their comedic comfort zones to give startlingly raw performances. Elaine Benes and Ricky Bobby, we hardly knew ya!Anyway, Downhill is not a comedy or even a black comedy as some people might have suggested. Just call it American Beauty minus the dark side with a slight lane of awkwardness. Yup, if you've ever had reservations about getting hitched, Downhill might halt and force you to keep those reservations.So OK, Downhill is a remake of a 2014 Swedish film titled Force Majeure. I haven't seen Majeure so I'm basing my write-up here on something viewed with fresh eyes. Yeah, yeah, yeah I'm aware. As voiced by other critics, the original did it so much better.Now would I recommend the independently felt Downhill? I thought I already did. It's a revealing snapshot of two people getting through a crappy marriage by using an avalanche and slalom skiing as coaxed metaphors. Would I call it entertaining in a Brady Bunch vacation sort of way? Uh no. Downhill is demoralizing, snippy, and a little cold (no pun intended). It uses frustrating drama as a backdrop to beautiful mountain scenery via the Austrian tourism industry.With lush, snow-blind direction by Nat Faxon and Jim Rash and some Enigma-style music by German Volker Bertelmann, Downhill becomes eighty-six transitory minutes of numbing character inquiry. It's a slippery slope that despite having a sometimes pedestrian script, gets a rating of three stars."}, {"id": 241, "text": "The original film is very good, but this adaptation has merits. I had never seen any f the original film is very good, but this adaptation has merits. I had never seen any film with Mrs Dreyfuss but she is the soul of this drama"}, {"id": 242, "text": "Not a bad movie, the problem is the casting is terrible.Will Ferrell and Julia Louis Dreyfus are just completely wrong for this movie.If you can get past that it's ok"}, {"id": 243, "text": "Dull, slow, and mildly funny twice. Curious to know why Dreyfus would take on this script. I made it through, but it was during the pandemic so I was hard pressed for entertainment."}, {"id": 244, "text": "That's the problem, will Farrell is NOT FUNNY in this movie, it's not a horrible movie, Will is like George Constanza when he knocked over the elderly and pushed through the kinds when there was a fire!! It's a drama of a couple that's hate each other and have kids, it's an interesting movie, but it's analysis aa comedy, it's a woody Allen type drama that is kind of interesting, especially if you like the snow, it's not bad guys, but it's not stepbrothers!!!"}, {"id": 245, "text": "Just finished watching this. It is a drama and should have been labeled as such. I didn't look at the reviews beforehand. A lot of reviewers are trashing it. Not surprising!The story is about a marriage that isn't working and a man, grieving the death of his father, who takes his wife and children on vacation to a European ski resort.There's nothing funny here. It's real life and I could relate to all of the elements. This is a quiet little movie that speaks volumes if you focus on what the characters say.It is based on an earlier film. I will check it out."}, {"id": 246, "text": "Probably the least funny Will Ferrell movie I have ever seen it's just not funny to the point it's basically just a poor drama at best defo no comedy here"}, {"id": 247, "text": "I haven't seen the original. I'm reviewing this as a film unto itself. I enjoyed it while I watched it, but that enjoyment didn't extend past further reflection. The tone is wildly off. The film tries to present itself as a drama and comedy, but it's very clearly the former. The comedy confuses the drama. If it stuck solely to it's dramatic elements and dealt with the subject matter at hand and really peeled back who these people are and examined why they did what they did, we would have had a great and possibly poignant character piece on our hands, but instead it leaned on uncomfortable moments for laughs, which killed the dramatic tension. Also, it should have been a good thirty minutes longer. The characters kids needed way more attention than they got. So did Ferrell and Dreyfus. Especially Ferrell. The entire narrative hinges on a single action his character makes and the movie doesn't come close to truly exploring why he did what he did. And what it does to address it, makes very little sense. SPOILERS follow. An avalanche hits. Instead of helping his family, he runs. His fight or flight instinct kicked in and his was the latter. Very interesting. Have him examine this. Let us watch a man deal with learning that his first instinct is cowardice. The movie doesn't think that's interesting. It thinks it's interesting to have the character yearn to be twenty and responsibility-free, but having that be a motivation for the character poses a question that muddies the water: If he wants to be single again, then was leaving his family to die an intentional act? The movie never goes there so I'm assuming the answer is no, so why even go there in the first place? All in all, I think the movie's main issue is focus and indecision. It should've settled on a tone and stuck to it and made a clear decision on how to approach the main characters actions and then let the narrative naturally unfurl from there. But, It didn't, so the movie didn't work for me. I'm going to check out the original now and see how those filmmakers handled it. Hopefully their approach will work. I love the concept."}, {"id": 248, "text": "I have and always will be a massive Will Ferrell fan!! However this film was disappointing the wife/mum in this film was so annoying I just wanted to stop watching, my god someone slap her ! I also watched the French version of this film called force majeure its more serious and it's a million times better the story works a lot better than trying to make it into a comedy, so long as you don't mind sub titles it's a must watch!!. I can never slate Will he's awesome a true legend but think he is more suited to funnier roles. All in all a bit of a disappointment."}, {"id": 249, "text": "I kind of liked this even though it is flawed. The story isn't well developed and some of the elements of the plot don't make sense in the overall scheme of what the story is trying to be. Having said that Julia Louis Dreyfus and Will Ferrell both play their characters well in spite of the limits of the script and how their characters were written. It was an interesting story that could have been presented more effectively but it wasn't as terrible as most of the reviews for it make it out to be."}, {"id": 250, "text": "Force was a wonderful brooding movie, very different in mood. This lighter, Americanized version of the same story wasn't a bad film and as long as you aren't expecting a comedy because of the two leads and aren't incensed because it is a remake, you might like it too. It is about a marriage that is tested by events on a vacation. I like both leads, JLD plays her role really well, and I like the twist of how Americans deal with unforeseen circumstances when they travel. Great twist that the original movie did not have for obvious reasons. I have no problem with remakes as long as they are done well - no one is trying to 'steal' someone else's property and the original writers, no doubt, got paid. The majority of Americans often don't get to see foreign stories with subtitles, and smaller distribution for various reasons. If you like this version, or even if you don't, but have now heard about a better original version it is more likely the original will get more exposure."}, {"id": 251, "text": "Every idiotic negative 1 star review on here seems to be this isn't as good as some french movie no one ever heard ofI had never heard of the French movie this was based on, and I still haven't watched said French movie this was based on. I'm not going to say this was a great movie, but it was serviceable.So let's get down to the movie. First ITS NOT A COMEDY, if you are expecting to see step brothers in the Alps, then you're going in completely wrong. It's a drama about a husband who basically abandons his family in a perceived time of crisis, and the fallout that this causes the family over the rest of their Alpine skiing vacation.Do not expect zany Will Ferrel or Seinfeld Julia Louis Dreyfus and you might actually enjoy this movie. It's slightly dark, a little awkward and there's moments where you genuinely hate both of them. I will say this is not one of Ferrel's better dramatic rolls (Everything must go was better) but it's not an entirely nonredeemable movie. Definitely not deserving of the 1 stars its been given. Even if you hated the story and plot you could at least give it 3 stars for the incredibly beautiful Alpine scenery. As one of the characters remarks it's so beautiful it looks like stock photos.To summarize, let this movie stand on it's own. It's not a classic or anything but it is watchable and the cinematography and background scenery is gorgeous."}, {"id": 252, "text": "Julia Louis-Dreyfus and Will Ferrell star in Downhill, a new comedy that comes out on Valentine's Day, Friday 14, 2020. The film was directed by Nat Faxon and Jim Rash.Billie (Louis-Dreyfus) and her two boys barely escape been buried alive during a controlled avalanche, while Pete (Ferrell) runs for cover thinking only about his self. The scary ordeal causes them to take a fresh look at their marriage and their future together.I had high hopes with the pairing of Louis-Dreyfus and Ferrell and what kind of comedic caper on the ski slopes might ensue. Unfortunately, this film was disappointing. This isn't the kind of feel-good romantic movie to take your significant other out to see on Valentine's Day.The film isn't mushy and doesn't resolve like a bow on a pretty package. Instead, it is more of a warning in relationships, showing how miscommunication, self-centeredness, defensiveness all can contribute to breaking down bonds in relationships. The humor in it is how the couple fails to address the issue directly causing further distance, bringing others into it to plead their case, and even puts the kids in the middle. There were some cringeworthy moments throughout.Some of the film's less flattering moments include an awkward scene with a ski instructor, crude sexual humor, and drunkenness without any really point.I would recommend steering clear of this one, in favor of a nice evening in, preparing dinner for your partner, snuggling up on the couch and dreaming together about your hopes for the future so you don't end up like Billie and Pete unsure of what is next in store for your relationship."}, {"id": 253, "text": "The movie is a remake of a relatively recent movie Force Majeure (2014) by Swedish director Ruben Östlund. The movie had a great potential to appeal to several audiences and becoming a movie that you watch over and over again.... unfortunately it turned out to be really bad, with no clear target audience. The plot is way too simplistic for mature viewers, while inappropriate scenes (including a disgusting female mastr'b8ing scene in a public restroom) make it a terrible choice to be watched with your ski passionate teenagers. Then the presentation of a dysfunctional family does not make it a good material for a comedy either, which instead of being funny is presented by a distasteful sequence of low-key mishaps of a typical selfish and immature married couple that viewer does not want to relate to. On top of that the presentation of European society supports the ignorant and superficial stereotypes among the American audience. The authors had a great opportunity to create a comforting sense in the audience by accentuate the beautiful landscape of the Alps and the depth of European cultures, but they rather make you hate the idea of ever going to the land of crazy hedonists... or to watch the movie ever again."}, {"id": 254, "text": "I spent eight bucks to see the movie Downhill last night. Don't do that!Downhill is an American remake of a 2014 multi-lingual film called Force Majeure about a Swedish family vacationing in the French Alps when an avalanche comes a bit too close and disrupts an already fragile marriage dynamic.Force Majeure is a strong film told in a quiet way with superb acting and tight storytelling. It's a small but engaging film with English subtitles over a few scenes when the dialogue naturally shifts to other languages. Apparently American film producers thought it could be redone without the need for those pesky subtitles, or tight storytelling. Or decent casting, acting, photography, sound, or any of the other basics of professional filmmaking. The resulting mess is Downhill starring Julia Louis-Dreyfus and Will Ferrell. The characters have been remade into boring cliché's and the story has been puffed up with digressions that stray far from the core narrative and add nothing but distraction. It's awful.I loved Force Majeure and had high hopes for Downhill. I was badly disappointed, but I can give it a one star in this review because I recognize value in the new version if it's shared in film schools alongside the original, with lessons contrasting the good with the bad (and the really bad)."}, {"id": 255, "text": "The ratings on here are primarily 1's and 2's. That's being generous. I see that it has a single 7-star rating, so clearly some first-time Production Assistant's blindly proud mom is on IMDb.Literally, 30 minutes in, people started walking out. Primarily women! I've never seen so many people walk out of a movie. When it was over, people on both sides of us and in front of us were complaining to each other about how depressing, boring, and stupid the whole experience was. Everyone was annoyed &amp; felt like they had lost 90 minutes.I wanted to walk out, too, but I held out, believing that there had to be some sort of redeeming event at the end. Nope. Just misery. Boring, painful misery. It literally felt like I paid good money to sit in on some crappy couple's depressing therapy session for 90 minutes. Absolutely no entertainment value. Absolutely detestable characters. I didn't want to root for them for the first 15 minutes, and I didn't give a crap about them from minute 16 on. I just wanted them to divorce or die so I could go home.Pure misery.The acting was mediocre and unbelievable at best. Mostly because they had NO material to work with. No laughs. Not one. I heard one or two quiet mumbles during the movie, but they may have been restrained coughs.I generally like these actors, but unfortunately, I think the title is a pretty firm, bold, and prophetic description of their career trajectories after this terrible train wreck.If you have the option between watching this movie or dying slowly and miserably in an avalanche, take the avalanche."}, {"id": 256, "text": "IN A NUTSHELL: Inspired by the 2014 Swedish movie Force Majeure by Ruben Ostlund, this depressing comedy is directed by Nat Faxon and Jim Rash. Jesse Armstrong helped them write the English version of the aftermath of a family who experienced a brush with an avalanche while on a ski vacation. The film premiered at the Sundance Film Festival last month and is being released by Searchlight, with the previous name of Fox missing from the title since the Disney purchase.I love movie titles with double meanings, but in this case, it's not a good thing. While the movie features a family on a downhill ski trip in the Alps, the title of the film best describes the direction the marriage is going in throughout their adventure. Timed perfectly for a Valentine's Day release, it really isn't the fun rom-com you're thinking it should be with comedy giants Will Ferrell and Julia Louis-Dreyfus. In fact, it's a bit of a DOWNer for the most romantic day of the year.TIPS FOR PARENTS:Crude language, profanity, F-bombs Talk of being nude in a spa Talk of intimate relationships. A woman tries to pleasure herself. Alcohol, bad drunken behaviorTHEMES:Every day is all we have. - Pete (Will Ferrell) Relationships, marriage, perceptions of other people's relationships Expectations Survival Family Live for self or live for others Aging IdentityTHINGS I LIKED:Julia Louis-Dreyfus was outstanding in her role. She is a talented comedienne who is very believable in a drama too. The nuances on her face were perfect and spoke volumes. My husband and I saw the movie together and both felt sorry for Will Ferrell's character, who is a complete wuss during the story. My husband was especially frustrated that the character was never able to quite redeem himself. Miranda Otto, who plays Charlotte, will look familiar to you but you won't quite know where you've seen her before. Suddenly, you'll remember it was in Peter Jackson's Lord of the Rings: The Two Towers franchise where she played Eowyn. Her character in this movie doesn't have an ounce of integrity like Eowyn did in The Lord of the Rings: The Return of the King. Fans of The Office: The Complete Series will get a kick out of seeing Zach Woods. What's funny is his character's name is Zach in this movie. When Kirstofer Hivju first appeared on the screen in the movie, you could immediately tell there were Game of Thrones:Season 1-2 fans in the audience. There were some laughs and even a few quiet cheers, as his character, Giantsbane, was always a fan favorite. When the movie ended, the lady sitting behind me in the theater said, That's it? but I actually thought it was an insightful ending. You get to see some beautiful Austrian mountains.THINGS I DIDN'T LIKE:I haven't seen the original movie that this is modeled after, but everyone who has, says the first one is sooo much better. Sooooo much bickering. That's neither enjoyable, nor funny. It definitely needed more humor to balance out the drama and depressing moments. The actors who played the sons did a good job, but they sure aren't like most realistic, rambunctious boys that age that I know. Instead, these boys are super mellow. They're played by Julian Grey and Ammon Jacob Ford. Lots of awkward moments.You can see my full movie review on Movie Review Mom (dot) com and on my Movie Review Mom YouTubee channel."}, {"id": 257, "text": "So this movie is absolutely terrible the trailers made it look like a comedy but there isnt one funny scene in this whole movie.they must have known wow we made a craptacular movie so lets deceive people and try and mislead them into thinking its a comedy.2020 so far has had some bad movies but this is the worst by far.and this movie is a remake way to go hollywood with the unoriginality.the basis of this movie is so stupid wife and kids are mad at dad for doing the logical thing of running away from an avalanche when their right next to a building duh at least he had some survival instinct they just sat there like deer in headlights.id rather have the odds of one of my family members get away then they would be there to try and save me instead of everyone dying together more common sense.and then they keep complaining that dad doesnt want to be there excuse me through out the whole movie he wants to do stuff its them that would rather not.so in conclusion i wish the wife and kids would have died and the movie woulda been over in 15min or could spend the 75min left exploring the fathers grief and regret for running away not this hour and half of petty bs."}, {"id": 258, "text": "My friend and I went to see this as I'm a huge The Way, Way Back 2013 fan (Nat Faxon/Jim Rash) and she'd seen the original Swedish version of Downhill.It's an interesting DRAMA with moments of humor that most people who are in long-term relationships, probably mostly with kids, will relate to. The tension and rawness is real between the leads and brought me to tears several times. Julia Louis-Dreyfus did a fantastic job with a delicate balance of am I crazy or are you crazy in trying to grasp the relational meaning of a very telling event with her husband and family that shattered any doubts of her husband's state of mind.It's a wonderfully set movie in the Austrian Alps and while I do not recommend it for many, I'm sure its audience will find it and love it, though it may not happen primarily in theatres (despite the fact that is certainly best viewing of the lovely cinematography!!!)I think the trailers, and the two great actors' comedic success, mislead many to expecting a comedy. That definitely would be a huge disappointment, but this movie is a good one!!"}, {"id": 259, "text": "Greetings again from the darkness. Overwhelming apprehension. That's the feeling I had walking into the theatre for the Americanized re-make of one of my top 10 favorite movies from 2014 ... FORCE MAJEURE. Sure, it's common practice for U.S. filmmakers to farm international cinema for new projects, but when they mess with the really good ones, I can't help but feel nervous to the point of dread. A sliver of hope existed since this new version was co-written (along with Jesse Armstrong, creator of Succession, and Oscar nominated for IN THE LOOP) and co-directed by Nat Faxon and Jim Rash, the creative forces behind THE WAY WAY BACK (2013).Julia Louis-Dreyfus and Will Ferrell star as married couple Billie and Pete. Along with their two teenage sons, they are on an Austrian ski trip meant to help Pete get through grieving his father's death, and bring the family closer together. If you have seen the original or the trailer, you know what happens next. Pete's reaction to a near catastrophic event creates a divide between him and the family ... especially Billie, who is left shaken. This part is all quite similar to the original film, yet this version is different in so many ways.Casting two brilliant comedic performers in the lead sends a strong signal that humor will play a role, and that the exceptional gravitas from filmmaker Ruben Ostlund's FORCE MAJEURE will be softened somewhat. Both of those points hold true. However, surprisingly, this re-make manages to still generate some of the shaken-to-the-core emotions that come from having trust broken in such a startling manner. Ms. Louis-Dreyfus is especially strong here, and carries a much heavier load than Mr. Ferrell. As she is balancing her shock, frustration, and anger, while still attending to their equally shaken boys, Mr. Ferrell is relegated to spending much of the film wearing a wounded puppy look as he attempts to move on without addressing the issue.Adding to the comedy elements are Zoe Chao (The Comeback) and Zach Woods (The Office) as Pete's friends who get drawn into the fracas. Miranda Otto takes a break from her usually dramatic roles to play Charlotte, a wacky resort employee whose personality is a bit out of step with normalcy; although her zaniness succeeds in preventing the weight of the event from crushing Billie. Fans of the original will recognize Kristofer Hivju, who plays a resort security advisor this time. Another difference is that the kids (Julian Grey, Ammon Jacob Ford) play a bigger role in the family dynamics and fallout.It's clear that filmmakers Faxon and Rash set out to purposefully make a more mainstream, accessible movie than the Swedish version. The film remains effective at generating conversation about survival instinct and protecting one's loved ones. It should be mentioned that this is not a typical Will Ferrell movie, and anyone expecting Frank the Tank, may only be pleased with one brief scene. Instead, this is about a man coming to grips with how his actions affected his family, and even his view of himself."}, {"id": 260, "text": "As Downhill (2020 release; 86 min.) opens, we get to know the Staunton family: Pete and Billie and their two boys have just arrived in the Alps for a ski vacation. The next day after some morning skiing, they head out for lunch on an outside terrace. Then a controlled avalanche goes wrong and comes barreling down the mountainside, straight towards the terrace. Just before it reaches the terrace, panic ensues and Pete grabs his phone and runs, leaving Billie and the kids. After the snow hits the terrace, everyone is okay, but Billie and the kids are in shock. And where is Pete? At this point we are 10 min. into the movie but to tell you more of the plot would spoil your viewing experience, you'll just have to see for yourself how it all plays out.Couple of comments: this is the latest from co-writers and co-directors Nat Faxon and Jim Rash, who previously brought us the excellent The Way, Way Back. Here they remake the 2014 Swedish film Force Majeure, which garnered worldwide attention and acclaim. Eventually Hollywood announced a remake, starring Will Ferrer and Julia Louis-Dreyfus. My big fear was that the remake would be done as a comedy. If you've seen Force Majeure, you know that it is anything but a comedy. The good news is that Downhill is not an outright comedy, although there are certainly funny bits in it. The bad news is that it's simply not a great film, and it outright pales compared to the original. The worst of it is that, whereas the original was a 2 hr. movie looking at the complicated consequences of the avalanche incident, the remake runs short of 1 1/2 hr. and even then it doesn't focus nearly enough on the consequences of the avalanche incident. Instead the movie makes some diversions that go nowhere and are irrelevant to the core of the film. Julia Louis-Dreyfus (as Billie) tries to save the movie, and almost does, giving a terrific performance, but in the end it's not enough. Will Ferrell is horribly miscast as Pete, I mean what were the movie makers thinking? Kudos for the photography, which is eye-candy from start to finish, as well as for the original score, courtesy of Volker Bertelmann (a/k/a Hauschka). Bottom line: Downhill is the Hollywood remake of Force Majeure that nobody asked for.Downhill premiered at last month's Sundance film festival to ho-hum reaction, and is now seemingly rush-released into theaters. The movie opened wide this weekend and the Sunday early evening screening where I saw this at here in Cincinnati was attended so-so (about 12 people). If you haven't seen Force Majeure, don't waste your time and money on Downhill and seek out Force Majeure instead. If you have seen Force Majeure, there is no point, none whatsoever, to see Downhill, but hey don't take my word for it and check it out, be it in the theater, on VOD or eventually on DVD/Blu-ray, and draw your own conclusion."}, {"id": 261, "text": "... you expected a daf mindless Will Ferrell film- u bias colored ur expectation and that expectation wasn't met so u felt disappointed and disliked it cause u wanted fun and to laugh - first let me tell you something I've realized about comedians : Bar none, they are amongst the absolute pinnacle of most intelligent humans amongst us - without question! (and if u need my credentials as someone to opine upon that with some authority, I'll furnish them) and highly intelligent humans are almost compelled and constricted to doing comedy (if they chose entertainment as thier livelihood) I would wager most don't even want to but absolutely need to like some perverse calling into, what is it called, the priesthood - because to be that aware and see things as they are AND not to be able to relate meaningfully with the vast majority of humans, well that's torture - anyway... but actors especially (comedic) do you feel they must stay in that genre (honestly the concept of genres alone is kinda silly) but do u think a serious actor doesn't want to take all types of roles and be apart of all types of significant works? Because just because most comedies by definition can't be heavy, these comedians themselves are almost constantly dealing with concepts that, quite frankly to delve into let alone have an understanding of, is almost physically painful and certainly psychologically so - it's a living hell - as I child, who had an intrest in evolution and natural selection, once theorized that high intelligence would be selected against by means of suicide - because our species doesn't require this type of intelligence any more and most high iq eq humans suffer depression - so for fugg sake don't pigeon hole them into one genre and then be overly critical when they don't fit into what u want them to be - THIS FILM WAS GOOD, ALMOST VERY GOOD and it deserves a fair viewing because it's meaningful and the actors worked hard to convey the gravity or it all - just stop being so rigid and be grateful we have a cashe of talented individuals to make the content that, let's face it - we all consume in absurd quantities because our minds require distraction (because we no longer need to do daily chores merely to get thru and be comfortable for one day, because now... meh...) sorry but RE the film 7-8 stars no question"}, {"id": 262, "text": "I expected a screw-ball comedy-gone-flat, but was delightfully surprised by the humanity and thought that went into creating this film. Will Ferrel is cast against character, and though he almost pulls it off, something was left on the slope. JLD nails the caring, self-sacrificing mother quite well (later revealed to have achieved parenthood via in vitro). She's pretty funny, and very serious throughout and drawing viewers into her 'life,' and the intersection of parental roles, gender, age, and culture. When the family is confronted with a potentially life ending horror, one parent responds one way and the other, another, creating the conflict that defines the story...and it is not comedic; pure drama.Any parent will admit that there may be a point when they reconsider their choice to be parents, and it may seem like regret. This film explores those moments creatively and compassionately. There are some memorable scenes and some really thoughtful insights. A few false notes but nothing that deserves a negative overall rating. Keep an open mind and allow yourself to feel the funny AND painful parts of the story, just like life, and love, and parenting, and relationships."}, {"id": 263, "text": "Good movie, but I can see why people have issues with it.This is not a Hollywood comedy. It's not what audiences are going to expect when they see a movie stars Will Ferrell and Julia Louis-Dreyfus. It's not a laugh-a-minute movie.This movie is about a couple in crisis, a crisis that starts when the Ferrell character acts like a coward when the ski resort the family is staying at is threatened by an avalanche. His character flees his family and runs for safety.The main part of the movie deals with the afterath. It's not a funny premise.About 15 years ago, Ricky Gervais started doing a show called The Office. Gervais found humor by exploring painful and embarrassing humor. It's not easy humor to grasp: it's not escapist humor, it's the kind of humor found by laughing at the human condition. It's not what Americans expect, esp. in a Will Ferrell movie.Downhill is an exercise in cringe humor. A view who goes in expecting that can appreciate the movie for what it's doing. And points need to go to Ferrell for playing such an awful, confused man. And Julia Louis-Dreyfus is terrific in the lead role.Having seen this movie, I now want to see Force Majeure, the Swedish movie it was based on. I would not be surprised to discover it's a much stronger movie. It is difficult to translate European comedies to Hollywood: Americans demand our comedies by light and fluffy. Feels like Downhill was a compromise, much as Cousins was a watered down version of Cousin, Cousine, and The Bird Cage was a watered down version of La Cage aux Folles.What really irritates me here is that, once again, the studio marketers badly misrepresented the nature of a movie just to sell tickets. Had the studio been honest about what the movie was trying to do, we would not be seeing so many 1-star reviews from people who had the wrong expectations about what this movie was."}, {"id": 264, "text": "Billie (Julia Louis-Dreyfus) and Pete Staunton (Will Ferrell) are on an Austrian ski vacation with their two boys. Charlotte (Miranda Otto) is the sex obsessed resort manager. Something happens which puts doubt into the Staunton marriage.This is an American remake of the great film, Force Majeure, by Swedish filmmaker Ruben Östlund. It has been rewritten and directed by comedic actors, Nat Faxon and Jim Rash. They have become a great filmmaker duo following two poignant films with nice comedic touches; The Way Way Back and The Descendants. This one is a great disappointment. As a remake, this is an utter failure. It takes the unsaid and say it out loud. It takes the regular life and makes it wacky. While there are some compelling moves, this keeps feeling wrong.I try to envision not watching Force Majeure first and imagine watching this with virgin eyes. I don't know who came up with Charlotte but she seems to inhabit a wacky Will Ferrell comedy. I do not like Otto's accent or her character. The movie is trying to be wacky and then like an avalanche, it tries to be serious. It can be funny and serious but wackiness can often clash. In the big overarching premise, it's trying to be a wacky ski comedy from the 80's with a gigolo ski teacher and a swinging manager. It doesn't need it and doesn't want it. There are moments that intrigue me. I didn't really like Zach and Rosie except one moment at the end of the scene where Rosie is looking at Zach. I like the resolution of Billie and Pete but it goes a step too far. That's this movie at its core. I like a lot of it but it always goes one step too far. I hate Charlotte and the movie would be far superior without her. Overall, this has some moments but it keeps getting it wrong."}, {"id": 265, "text": "I thought this film was going to be funny or at least interesting. It was a waste of time &amp; talent to put these great comics Will Ferral and Julia Louis-Dreyfus in this. Will Ferral plays a father/husband name Pete that's unhappy in his marriage. As for Julia Louis-Dreyfus she plays a frustrated wife of Pete. She is very unhappy with her spouse and marriage. She doesn't bother to deny it for the children or peace sake.The performances was dull from both actors and the story quite dumb. As for the character I disliked to so much for being so inconsiderate and a trouble maker was the wife. Couldn't stand how plain &amp; old Julia Louis-Dreyfus looked in this film. She looks old enough to be the boys grandmother and not their mom. Willie seems depressed for being old, dry and plain looking.The only reason I gave this film three stars because one of my favorite Italian actors, Giulio Berruti was in it. He played the ski instructor Guglielmo. Even though his performance was brief it was pretty good."}, {"id": 266, "text": "I just saw a screening of Downhill, thinking it was bad going in , I was honestly surprised. There isn't much more to add that we don't already know, family goes on a ski vacation, avalanche comes toward, dad ( Will ) races out.Rest of the movie after the accident examines if / or Dad acted quickly or should have stayed by his family side. There is great third lead by Zach Woods, who tries to be the good voice.The only thing I really did not like was the casting of Will Ferrell. Julia was casted fine, the anger was great. I had problems with Will though, he did great facial expressions, as short as this film is, you can tell is character is just not a good dad, at home or away.I was not familiar with the original , so that would be a strong reason why I enjoyed Downhill.My verdict, See it."}, {"id": 267, "text": "We didn't know this was a re-make. We went because we thought it was about a middle-aged couple's marriage going downhill, and because we like Julia Louis-Dreyfus and Will Ferrell. I thought it might be like Date Night, but I really didn't have any expectations. And even though Julia &amp; Will are comedic actors, we didn't necessarily expect it to be a silly, hilarious movie.So - if you're thinking it's a fun RomCom, it's not. Would I have been disappointed if I'd seen and compared it to the original film? Probably. Is it the worst movie I've ever seen? Not at all.It's one of those real-life, awkward, uncomfortable films. I know a lot of times if a movie is real and uncomfortable, people hate it and rank it accordingly. We don't mind uncomfortable, because we get tired of predictable, wrap-it-all-up-in-a-pretty-bow endings. I thought JL-D's acting was excellent. When she told her version, it choked me up because I hadn't realized how impacted she and her children had felt. I watched the girlfriend's face (Rosie) as she heard the story. Loved watching her expressions change from surprise to dismay then judgment. I immediately knew whose side she believed. One reviewer thought the boys' looks were 'we know!/get us out of here' to the audience but I thought they also did a good, subtle, real acting job of portraying their disillusionment, disappointment in and disconnect from their father.Was it a great date night movie? No, not if you're dating and childless. As someone who's been married a long time with teen kids, too many moments were all too familiar. Was it a good story with good acting? Yes. If you like Julia and Will and don't mind seeing them in serious roles, see it. (And the ski scenes made me want to hit the slopes!)"}, {"id": 268, "text": "First Hit: Despite an excellent performance by Julia Louis-Dreyfus as Billie, this film goes downhill because of Will Ferrell as Pete.Most of you who have read this blog know that I'm not a big Will Ferrell fan. It was in this film that he shows how incapable he is of showing a depth of character. He had the opportunity to show real wisdom in this role, and with a partner like Louis-Dreyfus, who became an incredible, intense foil in this film, he didn't show up. Just as he didn't show up as the character struggling about his marriage in this film.The story is about Billie, Pete, and their two sons Finn and Emerson, on a once in lifetime ski trip in the Alps. There is a slight tension as they check into the hotel, Billie's tense smile and expressions show it.As the film wears on, there are moments when this tension subsides momentarily, but it is reflective when Billie has to keep reminding Pete to get off the phone and quit texting his workmate Zach (Zach Woods) and his new girlfriend Rosie (Zoe Chao). You get the sense that he's jealous of Zach.When a controlled avalanche barrels down on the lodge deck where they are sitting down to eat, Pete runs away from his family out of panic. Leaving Billie to wrap her arms around Finn and Emerson protecting them from the snow crashing around them.Pete's running away becomes the elephant in the room until they have cocktails with Rosie and Zach. Billie tells the story, and Pete tries to defend his behavior, which erupts into a huge fight bringing their marriage issues to the table.Here is where Ferrell's failings as a dramatic actor come to fore. When the camera focuses on him and the expression in his narrowly spaced eyes, there isn't much at home. He's like a child, and the audience realizes what Billie has been dealing with, raising three children, not two.As a side note, this is a remake of a film I saw in 2014, which was better in many ways.Louis-Dreyfus is fantastic in this film. I've never seen her act in a dramatic role, and she excels here. She has a very expressive face, and it tells the story as you need to know it. Ferrell is like a man child. He has minimal range, and his previous role as an overgrown elf probably fits him perfectly. Miranda Otto (Charlotte), as the hotel representative who tries to give Billie advice about living her life more fully, is hilarious. Jesse Armstrong and Nat Faxon wrote a good screenplay. Faxon directed the film, and despite Ferrell's inability to put depth into his role, the rest of the film was terrific.Overall: I was severely disappointed in the way Ferrell's performance hurt this story."}, {"id": 269, "text": "Downhill seems to have come from out of nowhere. Suddenly, there is a Will Ferrell movie in the theaters opening on Valentine's Day weekend; and, multi-Emmy-winning comedienne, Julia Louis-Dreyfus is co-lead. One would think that there is comedy gold here, so why isn't there more promotion. Well, there's a little misdirection, here. Downhill is a Hollywood remake of an acclaimed Swedish film, Force Majeure, which was more of a drama than a comedy; and Downhill sets itself apart by adding more obvious comedy elements here, whether or not they are necessary is a separate issue. Nevertheless, the synopsis is as follows: a married couple on a family ski vacation in the Austrian Alps after narrowly escaping an avalanche deal with the simmering tensions and the reality of life and their relationship.Actually, the premise is quite fascinating. I won't say exactly what happens with the avalanche, but it's pretty well depicted in the trailer. It is a funny situation, but it also is very serious. The problem is that the balance of the tone of the film is not well calibrated. The producers cast comedy stars and asked them to perform in this uneven mix of drama and comedy. Julia Louis-Dreyfus is great. She's captivating. Her performance mines the wry wit of all that happens, and she hits the emotional depth of the drama. Will Ferrell, on the other hand, is ill-equipped to meet the gauntlet that Louis-Dreyfus throws down. Some of the comedy and reactions of Ferrell are good; but, ultimately, his skill with the dramatic elements is lacking. The push and pull of the couple is the main source of comedy and dramatic tension, and the fact that Ferrell and Louis-Dreyfus are so unmatched make it ultimately unsatisfying. It really feels like Ferrell was only cast so that Downhill can be marketed as a Will Ferrell comedy, which it is not.Additionally, Miranda Otto shows up intermittently as a resort guide, who is ingratiating herself with the main couple. She is boldly only there for comic relief. I felt she was completely unnecessary. Otto is having such a ball as this boozy, free-loving lady that she seems dropped in from another movie. There was no genuine laugh coming from anything she did.On a positive note, the scenery is beautiful. The film is well-shot and may make you consider going to the Alps on a ski vacation. It's not something that I would want to do, but it looks great. Downhill's other saving grace is the modest runtime. Although it takes a while for the film to get to the meat of its action, it doesn't feel belabored. It gets to its point. I only wish it had actually been either funnier, or that Louis-Dreyfus had a more capable comedic and dramatic actor to work with.So, Downhill has a good premise, but an uneven cast. The film is short and it looks good for those who want to go skiing. It is not as funny as it pretends to be and the dramatic tension feels weak. I suggest waiting for this one to be on your favorite streaming service. There is a compelling conversation to be had after seeing what happens here if you give it a chance. Actually, give Force Majeure itself a viewing. It's already available on Hulu."}, {"id": 270, "text": "DownhillThis was a very clever movie and I really enjoyed it, but it won't be everyone's cup of tea. Don't be expecting a riotous comedy as it's not that, it more black humour and situational irony. In short a touchy-feely movie.Before I start I must say some reviewers on here have lost the plot, always review what is before you, not another movie or a previous version, would you review Sainsbury's by visiting the Tesco's next door.On the surface it seemed exactly how it was presented, however the movie explored several darker themes, these were;The different effects the grieving process can manifest and the stresses this places on any family.The need to control the minutiae in life as a way to give a sense of meaning and worth.The mind the gap syndrome, where you arrive at a moment in life and realise the dreams you had for your life and the reality is quite different.There was a moment that you felt they were going through the motions of a failing marriage but it was actually just faltering moment exaggerated by an external event, perhaps centering around disappointment.Overall all this movie kept my attention and there really was some fine acting."}, {"id": 271, "text": "I would have preferred to see the original Swedish film , Force Majeure , that this is a remake of but for one reason or another I couldn't get hold of it , so I gave this a go instead and surprisingly, despite it's low ratings , I quite enjoyed it .After just escaping an avalanche during a family ski vacation in the Alps, a married couple is thrown into disarray as they are forced to reevaluate their lives and how they feel about each other.This is a comedy , but it's humour is delivered so deadpan it feels more like a relationship drama . Most couples of a certain age will see themselves in one of the two main characters ( or is it just me ?! ) and you will form opinion as to who you like or don't .Julia Louis-Dreyfuss does a great job of being the annoying wife and is far more convincing than Will Ferrell who at times struggles to deliver the lines without looking like he's about to corpse .This is nice and short and it flew by and it actually finished with me wanting to see more which must be a good thing .I've never fancied a skiing holiday but the location in this film looks so stunning it almost makes me want to go on one - Almost."}, {"id": 272, "text": "Treacherous, dull, and incredibly boring- Downhill makes for a somewhat interesting premise, but falls back on its realistic themes with a biter harshness that is in no way entertaining, sympathetic, or pleasurable. Will Ferrell and Julia Louis-Dreyfus both lead this bummed out dramedy, and neither do a particularly impressive job throughout. There are flickers of potential from each of them, but that, and the pretty cinematography, is really the main thing the film has to offer. What is left of this dull adaptation, is a shallow, depressing, and bland reincarnation of a story that you will cringe watching at parts, and struggle to stay awake at others. It's a very repetitive and annoying film, as it tries again and again to shove down the viewers throat just how horrible it seems to be for the main two characters to be parents. I'm not discounting that fact, but the approach to it in the film feels all but subtle. The script is incredibly formulaic, the family itself incredibly generic and annoying, and it feels so lost within its own sense of grief and betrayal that you tend to lack any emotion while watching the film at all. In the end, Downhill isn't a total disaster, but a disaster nevertheless. It has so few rewarding comedies, and at best it struggles a few mediocre scenarios to capture the viewer's attention, but very few at that. My Rating: 3.25/10"}, {"id": 273, "text": "I awarded this, uh, movie 2/10, mainly because, apparently, the crew did a fine job of moving all that heavy equipment around in the woods. I guess the actors did a fair job of trying to play their assigned characters, but you'd never know it because the acting was so bad. The writers did a wonderful job of not doing their job, and they created a group of unbelievable, half-witted, air-headed, millennial-type characters all doing unbelievable, half-witted, air-headed, millennial type things. Add to the list, unrealistic and irrational. Actually, overall, the movie is a fine example of a story being developed, written and told by a committee. Concerning the directive efforts...I won't even go there, because the words needed to describe that area, in this movie, cannot be used in an open-to-the-public forum, such as this. I was happy to see attempts were made to conserve wherever possible. An example would be the growths of an organism on the side of an actor's face. Obviously, the appliances used were leftovers from that midnight meat train movie. In summary, the crew made a good effort, as crews usually do; the acting sucked; the writing sucked; the direction sucked times 2 and the entire movie sucked. However, I could SEE and HEAR the movie. What more do you need than that? A very poor offering for a fairly new/reorganized movie company!"}, {"id": 274, "text": "What I don't understand is how people get paid to make stuff like this. Not only that, these actors, directors, and producers earn a LOT of money. It literally infuriates me. This movie was SO INCREDIBLY TERRIBLE that I am now shopping for multiple therapists to tackle a myriad of conditions developed as a result of watching this film.To say I loathe this film is an understatement. I honestly believe anybody associated with it should be held criminally liable for the product they made and the resulting physical and mental afflictions caused. During the entire film I kept waiting for the wife to get struck down by some cataclysmic event so the suffering would stop.If you're reading this, maybe it's not too late for you. Perhaps you've been spared. If you don't heed my advice I can't be held responsible for your fate. You will know pain. You will experience torment. You will be absolutely HAUNTED for the duration of your now meaningless life."}, {"id": 275, "text": "I think the biggest obstacle 'Downhill' is going to face is people going in expecting a comedy and getting something completely different. With the two stars of this movie, Will Ferrell and Julia Louis-Dreyfus, both being known primarily for their comedic talents people could easily be mislead into thinking this is an out and out comedy. While there are moments of humour sprinkled throughout (mostly just through Will Ferrell being so naturally funny in most things he says), this would have to go down as an out and out drama in my opinion. It's actually really dark in places and can give you quite an uneasy feeling while watching it. From that point of view I thought it was a reasonably well made film.This is a remake of the 2014 film 'Force Majeure'. Americans tend to get a hard time when they remake European films. I never saw the original so can't compare the two, but I know it would at least be different in the sense that these are American characters in Europe. The 'Americans being Americans' aspect is played up quite a bit throughout the film. It leads to some pretty awkward scenes and it's not always clear whether this is intentional or not. The film really isn't an easy watch looking back on it.'Downhill' is extremely short scraping in at just 86 minutes (6 minutes of which are credits). Typically films like this like to stick around a little longer in order to expand the relationship deterioration arc and give a little more depth to each character's perspective. The film does feel quite rushed. It's safe to say that the acting talents of Ferrell and Louis-Dreyfus play in a big part in keeping this the watchable film that it is. I certainly can't recommend this as a must-see film, but I do think the current IMDb rating of 4.8 is harsh and unwarranted. It may be a bleak film but it does what it sets out to reasonably well."}, {"id": 276, "text": "Downhill Review:Downhill is the remake of the 2014 Swedish film Force Majeure following a family barely escaping an avalanche during a ski vacation in the Alps. After the events, Billie (Dreyfus) and Pete (Farrell) are thrown into disarray as they are forced to reevaluate their lives and how they feel about each other. This played at Sundance however we missed it because we already had tickets to another movie, a pretty bad one may I add. In downtown Park City they advertised Downhill everywhere and even had a shop for it. The reviews came in the next day from critics and they said it was just ok. A few weeks later now and audiences are absolutely hating it giving it a 14% and a D CinemaScore. I don't know if it's just me but I enjoyed Downhill a lot more than I thought and what most people thought. I think the main problem people have with it is the tone. With the comedic talent of Dreyfus and Farrell, most everyone was expecting a comedy. Every time someone leaves the theater whenever I'm working, almost everyone says I thought it would be funnier or That was really weird. Even one person got so furious at us and went on a long rant almost claiming that it was our fault. Needless to say, this is a drama with some light hearted moments. It's not just a comedy. With the subject matter I could hardly see it being a full on comedy. Being a skier I found some parts to be pretty funny because I could relate to some of it. Even the other humor I thought was funny. Miranda Otto's character is either going to be pretty funny or pretty stupid to some. Otto had a funny performance to me and she did fairly well. I could almost say the same thing for Will Farrell's character. The whole film is kind of choosing who's side your on and if you don't like Farrell's choices it might just hold an affect on his whole character. I thought he had his comedic moments and did well. Obviously it's not his most amazing role ever, but for more of a drama I think it's a good suited role for him. However nothing compared to Julia-Louis Dreyfus's performance. She gave it her all. This is an early prediction but others have been saying this as well. It would be great to see her get a nomination for the Golden Globes next year. She really can put on a good fight scene that's realistic and emotional. I think people just look too much at the negatives for this film. To me there's more positives than negatives. Like before, there's good acting and I thought the screenplay was good. Many negative reviews compare it to the original international film and how it's not ad good as it. There's rarely a time where an adaptation from an international film to an English film is even better. The cinematography with the beautiful scenery is just gorgeous to look at. There's a nice contrast of the blue sky with the white snow. Volker Bertelmann's score is really good and I've been listening to it for a couple weeks now. It's fun, sounds like winter, and there's inspiration from traditional music that originates from the Alps. Overall it's just a really good score and maybe, once again another early prediction, it could potentially get a notation. Of course there's some negatives. The runtime is really short and I think there would be some benefits with extending it a little more. Some characters needed a little more development, and I think the marketing could've been better as it said it would be more of a comedy. The tone sometimes was a little uneven but I didn't mind that too much. Downhill is getting too much of a bad rap and it's honestly not that bad. I'd recommend it for a fast film to watch and it's pretty enjoyable to watch.My Grade: B+"}, {"id": 277, "text": "Had this film existed before Ruben Ostlund's wonderfully subtle but quite a heavyweight cinematic commentary, this movie would have been received as one of the more favorable Hollywood light comedy of the recent years which is quite a splended slight departure for Will Ferrell that's way more restrained than his usual output. Or maybe it would have been more effective as a cable network mini-series adaptation of three or four 40-minute parts because there are lots of comedic material one could squeeze out in that winter resort setting expanding it (though some might say that's dumbing down) would have made good use of Faxon's and Rash's solid background in American television comedies, not to mention the minted reputation of Louis-Dreyfus. It could have helped people dissect the brilliance of what the emotionally and philosphically-dense Swedish social-comedic masterpiece has accomplished despite only having a very taut premise. They would even be forgiven had they borrowed some tricks in the Seinfeld TV show toolbox to tweak the narrative by using American characters. There are fans like me who certainly wouldn't mind.So as a one-off feature film, Downhill just ended up becoming that average film that looks significantly dimwitted when compared to the presence of the mammoth that is Force Majeure, which is quite unfair because, I'm gonna cite one example, even though that avalanche scene was executed decently, but comparison-wise, that's just where the lopsidedness actually manifests, so #ForeverInTheShadow of Force Majeure this film turned out to be.My rating: C-flat."}, {"id": 278, "text": "People expecting a light hearted comedy, will of course be dissapointed. Will is as good as ever, just not as outgoing and ridiculouslly funny as usual and Julia is playing the same frustrated drama queen she proofed to perfectly being capable of, back in the Heydays of Seinfeld.So whats entertaining in this? Well...probably exactly what most of the dissapointed viewers brought up their walls. It's holding the mirror in front of peoples faces. About marriage, kids, lovelife going DOWNHILL, over reacting because you cant stand the person next to you anymore, being fed up by his/her flaws and that has been thematised in flicks before, right?Well...if you like Julia or Will as Actors go for it. Just be aware that it's more in that direction of Carnage with a even more serious touch, instead of being like Stepbrothers or SeinfeldI pretty much enjoyed it and had to laugh about the stubbornness and the histrionic behavior of Julia. Just like in Seinfeld it's a story about nothing special and sometimes that is enough."}, {"id": 279, "text": "In a picture perfect Austria, Julia Louis-Dreyfus's Billie is on a skiing holiday with husband Will Ferrell's Pete and their two kids. Pete cannot quite leave his phone alone as he follows the holiday of his unmarried co-worker Zach played by Zack Woods. Let's say he's pining for the free as a breeze #. But the family do manage to get in some prime skiing on the slopes. The beautiful cinematography by Danny Cohen is worth the price of admission alone. Until a controlled avalanche comes crashing around them as they lunch alfresco. Well not quite around them all as Pete grabs his beloved phone and staggers off as quickly as his snow boots can carry him.Nat Faxon &amp; Jim Rash direct what initially I thought was a comedy but is in fact a brutal dissection of a marriage, with comedy on the side. As Billie brushes snow off herself and their boys on the cafe veranda, Pete comes back and calmly orders soup. While we are still in awkward shock of this moment the couple make a complaint but they are told by Kristofer Hivju that they aren't in America anymore where you can sue when the coffee is too hot. Kerching. Warnings had been posted all over. Pete thinks he might have seen them! So why didn't Billie the attorney not notice them I wondered if we're placing blame?When the family arrived Billie and Pete shared a sink in their lovely suite, but there's no room for Pete now to share with Billie, and he is banished to the other side of the mirror with his own sink. You could say the mirror is cracked in this frosty new environment. The simple facade of a happy marriage was sorely tested when the family were left to fend by themselves. And the event is painfully acted out when Zach and his girlfriend Zoe Chao's Rosie arrive unexpectedly. At Pete's invitation! With Pete stressing how you cannot run very quickly in snow boots. But as far as Billie was concerned this was the moment that Pete saved himself rather than his family. With the avalanche controlled the Austrian authorities were expecting no casualties, but she didn't know.Taking time out Billie gives us the comedy with Miranda Otto's man hungry hotel manageress, providing Billie with a ski instructor we can all fall for. Giulio Berruti could be the traumatised Billie's comfort break, but not recommended for solo play in a bathroom afterwards, wearing ski gear and those damn ski boots that get in the way of everything. But Pete doesn't fare any better in the family friendly resort with the two boys. Already ashamed of him, he over enthuses with the boys, and gets thrown off the toboggan ride. A very funny comic moment for him comes when he is flattered by a woman via her friend, oops sorry wrong man. But Will Ferrell's comedic talents are used more as the embarrassing Dad. And disappointing husband, as eventually cutting the 'I'm fine' tension, Billie can no longer hold in her feelings at Pete's failure to care for his family.The film is a remake of a Swedish film Force Majeure that won a prize at Cannes 2014 and the 86 minutes is perfectly timed to give you the trauma of the avalanche moment, and the more devastating after effects. The whole holiday was a disaster in the adult resort where the kids would have enjoyed more the nearby family one. All that way for the boys to be on their devices. And not just the kids. But I did have some sympathy for Pete and the heliskiing trip that was a disaster.I was pleased that the film wasn't purely a comedy, with Will Ferrell and Julia Louis-Dreyfus raising the dramatic tone, and elevating it to a very awkward, in a good way, and interesting watch in how a marriage can fall apart in just one moment. You'll leave feeling a little shell shocked with what just happened."}, {"id": 280, "text": "Downhill is a somewhat uncomfortable watch with two of cinemas most flamboyant comedians trapped in a script that fails to channel the depth and skill they're known for. While there are attempts and successful moments of hilarity, this Dramedy leans more to the drama but surprisingly delivers honest truths that will resonate with the relationships or marriages we are in.The event that sets the stage for the story allows for powerful unspoken moments, expressions of hurt and internalised disappointment that would be delivered and felt by any long term couple who encountered a situation like the lead characters.For a fleeting moment we are given an answer to Scarlett Johansson and Adam Driver's impeccable storytelling in Marriage Story before the film itself feels like it's also on a weak layered fracture of snow physically taking the form of the film's title.Dreyfus and Ferrell play the vulnerability and emotional detriment of their relationship spectacularly, but they are hugely let down by the hollow comedy of the script which does little to extract the goldmine of the setup and peel back layers on their characters and sound acting ability."}, {"id": 281, "text": "The Hollywood remake of one of the best films of the last decade, Force Majeure, Downhill is a desperately disappointingly watch at times. Not only does it fail to live up to the brilliance of the original film, but it misses the mark with its own ideas about marriage, family and individuality, proving frustratingly simplistic all the way through.The film does gather a little bit of assurance in its latter stages, bolstered by Julia-Louis Dreyfus' performance which almost single-handedly saves the film from total mediocrity.But as an exercise in emotional drama, Downhill is a disappointment. As a dark comedy, it's a disappointment. And as a retelling of one of the most memorable films in recent years, it's a huge disappointment.Before going too heavy on the comparisons with Force Majeure, let's just look at Downhill in and of itself. It's certainly not a terrible film, impressing with gorgeous visuals, the odd smirk of laughter and a strong turn from Dreyfus.However, it never manages to find its feet as it tries to juggle both interesting and dark emotional drama with more run-of-the-mill Hollywood humour.Will Ferrell, for all his best intentions, is miscast in this role, too often relying on active comedic energy that isn't really what the story requires to be more interesting or entertaining. And that's a misconception that seems to run through the film as a whole.With an overly simplistic take on its core themes about relationships and individuality, Downhill is disappointingly dull all the way through, seeming to come up with an answer to its main thematic questions within the first act, and then leaving a fairly random thread hanging for the rest of the film.Compare that with Force Majeure, a deliriously entertaining dark comedy that bubbles with tension and emotional intensity all the way through, and Downhill is even more disappointing.From Palme D'Or-winning director Ruben Östlund, Force Majeure is a perfect example of the brilliance of tense and cagey drama that hits close to home, but brought to life with darkly fun-loving energy and a Scandinavian twist.Force Majeure a film that has everything, working as a comedy, a drama and even a thriller. Downhill, on the other hand, is rushed in its first act, uneventful in its second, and only briefly interesting and original come the finale.In Downhill, Julia-Louis Dreyfus is the bright spark, giving a performance filled with pent-up rage that gives a brief hint at the provocative drama that Force Majeure hits home with so effectively.Meanwhile, directors Nat Faxon and Jim Rash lack the penetrating energy of Östlund in Force Majeure, also missing the mark with the film's focal scene that should have been a strong foundation for the story to the finish.Whereas Östlund made the avalanche that sets off the chain of events a striking moment that sticks in the mind, Faxon and Rash seem to skip over it too quickly, only then raising it again later on when the story requires it. And in that, the drama and tension is never as well-built nor natural as Force Majeure makes it.Overall, Downhill is a roundly disappointing watch both on its own terms and as a remake of Force Majeure. Its Swedish source material is far, far better in every way, and although this American remake has a few bright sparks, it misses the mark on its comedy and drama throughout."}, {"id": 282, "text": "We're not in America, where you sue because your coffee's hot, madam.Based on Ruben Ostlund's Swedish Force Majeure, the American remake, Downhill, shows the same theme: Is a man a coward when leaving behind his family to flee an avalanche threatening to engulf them all. The sluggish skiing vacation turns out disastrously as Billie (Julia Louis Dreyfuss) and her boys virtually shun dad (Will Farrell) for his perceived cowardice.I hoped for an extensive debate about the uncertainty over what he did, and by extension the demands made in modern times on the male ego, where giving women newfound freedom and respect, the man may be judged by outdated standards of chivalry. Lacking the original's Scandinavian cool, this typically American, cumbersome tale film takes too little time parsing the act and too much time with cheesy process shots and slow reactions lacking insight or debate.Dreyfuss has the meatier role, doing less of her Elaine clueless but more of her sure-as hell-persona. When she says, I throw my arms around my children and I just wait ... I wait for us to die together, any thought that this might be a comedy is gone. Although Downhill is billed as such, no comedy is really discernible except when she struggles with an instructor. Ferrell has the thankless role of the coward who can't defend himself because the script doesn't allow him room to work out a defense. As is always the case with a Ferrell character, he's bound to be humiliated and probably not know it.Friends make lame defenses for him with instinctive survival reaction theory, but it isn't even Ferrell defending himself nor is it cogent argumentation. Thank goodness for the isolating one shots of the two principals: their interchanges are largely her declamations of his cowardice and his looking guilty. As for the shots of the Alps, no challenge there--any screensaver can give you the same glory; for instance, when the characters talk with a white mountain background, it's mostly green screen and not very convincing.Male courage will have to be deconstructed in a better movie. For Downhill, I will revisit the Scandinavian original to see if the theme is better relayed, or if not, if its subtlety wins the day. Meanwhile males, you're not going to like the exposure in either film."}, {"id": 283, "text": "LIKES:Beautiful Setting Orchestra Music Deep Morals and Meaning Occasionally FunnyDISLIKES:The Acting Is A Touch Overdone The Kids Involvement In the Film Focus On the Awkward The Banter That Is Not Fun Feels Both Lows and Truncated Attempts to insert Culture With Art Could Not Pick Drama Vs. Comedy The VERDICT:This reskin was not the best face lift Hollywood has given in my opinion. Though cinematography has revealed a wonderful setting and the artistic approach sells the lessons at hand, the film itself is rather boring. This is primarily due to the presentation having difficulty choosing a lane to present the film, with artistic display vs American entertainment battling it out for first. Ferrell and Louis-Dreyfus can't seem to find the chemistry for an award-winning performance and the other characters do little to enhance the experience outside of awkward banter and some forced comedy. It goes to show that a movie like this can keep an original skin and be appreciated, like we saw in the Academy Awards, but for this reviewer, the remake is not worth the trip to the theater. I would suggest this is at best a free stream or watching on cable to get your best investment.My scores are:Comedy/Drama: 5.0 Movie Overall: 3.0"}], "reviews_amount": 284}