{"name": "Chronicle of a Serial Killer", "titleId": "tt04269310", "reviews": [{"id": 0, "text": "Worth watching just to see Dmx play as the detective. Though I didn't know many of the actors in this film i'm still impressed by their acting skills and the production quality!"}, {"id": 1, "text": "Loved it!!! Story was exciting and thrilling. Steve did a good job making and funding this"}, {"id": 2, "text": "Just in time for halloween. A really good indie movie with a suspenseful plot. A serial killer who has a thing for killing women he meets on the internet continues to crush the city as the police go on a wild chase to end his killing spree. Lots of plot twists and turns with a pretty epic ending."}, {"id": 3, "text": "This is a truly awful movie. Awful acting, awful script, pretty much a waste of time right from the start...and then it gets worse...save your money, and more importantly, your time. A root canal would be more pleasurable."}, {"id": 4, "text": "Great movie! Right from the start the movie will have you glued to the screen. Liked the chase between the detective and the killer."}, {"id": 5, "text": "Good plot and acting. Steve is a good actor as was the rest of the cast. Wish dmx had more time on screen but it still worked out. A must watch"}, {"id": 6, "text": "We seen it as a family and were all at the edge of our sofa. Editing is on point, the film keeps you drawn in till the end. A real horror, murder mystery movie!!!"}, {"id": 7, "text": "This is is why I don't trust anybody! So many killers and psychos in this country. A well shot and edited movie. Loved it and the ending was perfect in my opinion."}, {"id": 8, "text": "Such a good film. Shedding some light on serial killers and it's scary to know there are over 2,000 of them out there. You will end up double checking if your windows and doors are locked after this. Well i sure did anyway."}, {"id": 9, "text": "So happy to see Dmx getting back to acting. He did great in this film and played the perfect role as a detective. Hope we get to see more in the future. Legend!"}, {"id": 10, "text": "Who doesn't like a film with DMX in it? Awesome flick! Rent and support this film"}, {"id": 11, "text": "Loved it! Super twisted and thrilling. Great film by Steve Stanulis, you've done it again. A must watch."}, {"id": 12, "text": "Started of slow but it really picked up and got interesting mid-way. Loved Dmx's part and the chase for the killer was perfectly executed. Great sharp editing and good cinematography also."}, {"id": 13, "text": "Impressive film with plenty of twists and turns. Will the killer get caught or will he continue? I'm not going to give it away but it's a good watch"}, {"id": 14, "text": "The trailer doesn't do the film any justice. Watch if your fan of serial killer style thriller movies. Has a bunch of a great actors, clean editing and entertaining."}, {"id": 15, "text": "Good film, this is the 3rd film I've seen made by Steve Stanulis and it keeps getting better. Quality acting, mint production quality and the best part is his films always has some of my favorite actors like Dmx. Awesome work!"}, {"id": 16, "text": "Steve Stanulis does it again! A high quality indie film. Worth a watch if this is your genre. It wasn't cheesy and has plenty of surprises that will have you on the edge of your seat. Nice to see Dmx also in this, make sure with him please"}, {"id": 17, "text": "Didn't know what to expect but this was pretty darn good. If your looking for a scare and a thrilling narrative this is it right here. Excellent editing and cinematography also. Nothing bad to say"}, {"id": 18, "text": "Can't believe I paid to see this. Bad acting, bad writing, bad everything. No idea how it received such a high rating. I wouldn't even call it a B movie. Actually, one actor did a good job. The serial killer."}, {"id": 19, "text": "It's not even worth ratings and dmx is only in there for 10 minutes . No stars 0"}, {"id": 20, "text": "I normally like these types of movies, but this was awful. The acting was horrendous! The script was so bad. Only thing that was fun was seeing Cody from big brother. Do not waste your time on this one."}, {"id": 21, "text": "So good! I love films like this. Looked like they really thought things through from the plot to the type of actors needed to carry out the right characters. Enjoyed the chase between the killer and the detectives also. 10 stars from me"}, {"id": 22, "text": "Seriously well edited and has a solid storyline. One of the better thriller films out there to date."}, {"id": 23, "text": "Loved everything about this! Good movie to watch when bored. Highly entertaining with surprise guests from Dmx and other famous and new comers in the film world. Worth the purchase on iTunes."}, {"id": 24, "text": "Scary to think this really does happen in real life. Good movie with the popular Dmx who never disappoints. I also never knew Steve Stanulis could act. Multi-talented cast!"}, {"id": 25, "text": "Film has a bit of everything for everybody. I wish there was more blood but I'm guessing they trimmed it down for a bigger audience. Watch with your family this halloween!"}, {"id": 26, "text": "Big fan of serial killer style movies so this was right up my alley. It's really well shot and not predictable so this will keep you wanting more right to the very end. A high quality indie film, well done to the production team!"}, {"id": 27, "text": "The script is well written and thankfully not a predictable storyline. Good acting and the film has some high quality actors so i'm impressed for an indie film to pull this off."}, {"id": 28, "text": "Great film! I wish Dmx had a bigger role but it's still super entertaining and the production quality is top notch. Watch it now!!!"}, {"id": 29, "text": "Poor scriptActing is unbelievably bad, can't believe some people like this"}, {"id": 30, "text": "I loved this film! It's an indie film but done perfectly. Good storyline and the actors are really talented. So yes it's a entertaining film and worth your money."}, {"id": 31, "text": "It's basically how all the serial killers think. Film was so well done almost felt real honestly. If you get scared easily be sure to turn on the light when watching."}, {"id": 32, "text": "You just never know with indie films these days but this one surprised me. Great new actors and a refreshing storyline that was just about a serial killer. Keep the films coming!!"}, {"id": 33, "text": "The way they shot and edited this is so good, a really great job. Sound and cinematography was on point also. You guys made a great film so glad I found this."}, {"id": 34, "text": "Freaking loved it!! Good to see my boy Dmx still in the film loop and also major props to Steve Stanulis, he's been putting out high quality indie films all this year also."}, {"id": 35, "text": "I was hanging off the edge of my seat the whole time. Great cast, great storyline. Would recommend!"}, {"id": 36, "text": "I thought the movie was great but wished Dmx had a bigger role. Good ending and didn't drag out like many thriller movies usually do. Still good to watch"}, {"id": 37, "text": "A high quality thriller movie with plenty of everything you would expect from a movie such as this. It's a weekend movie night type of movie. Kudos to the filmmaker for making this happen."}], "reviews_amount": 38}