{"name": "Bad Hair", "titleId": "tt04798836", "reviews": [{"id": 0, "text": "This movie gets a complex balance of themes just right...it's not quite a horror film...far too tongue in cheek and humorous. But the humor is subtle, not in your face. It has some messages but doesn't take itself too seriously. Most of all: the entire cast is extremely committed! Not one phoned in performance. Speaking of the cast, it helps to know the black entertainment industry because a ton of people are in this: where else can you find Blair Underwood, Usher, Laverne Cox, and MC Lyte in small supporting roles? This movie should have you smiling quite a bit...and Vanessa Williams never fails to deliver in her patented Dominique Devereaux attitude...who else can serve up a line like My Killer Weave Support Group? Meanwhile, you really don't need to know all but the rudiments of black hair and weaves to get the plot...if you don't: it's a movie in the vein of Death Becomes Her...where vanity comes at a price. Not for nothing, it also gets black 1989 perfectly. The clothes. The music. The conflict between natural and processed hair. The fact that this has such a low rating is incomprehensible to me."}, {"id": 1, "text": "The concept was cool. HOWEVER, the way this movie was written left me waiting for something of hilarity, horror, and substance to happen for two hours. Meaning this movie was simply just a mood board with an empty plot. I looove the actors, but they were not directed to their full potential. Overall, I was really disappointed."}, {"id": 2, "text": "This movie was fun from beginning to end with an amazing cast. Seriously, everyone I love was in this movie! My only complaint was that Nicole Byer was barely in it lol. On top of the fun story, music, and concept; the Underlying message about pressures put on women's beauty, ESPECIALLY black women, was really impact if you without being preachy. This was a romp that I'll recommend to everyone!"}, {"id": 3, "text": "I really wanted to love this movie. I love social horror and I think its very important that those stories are told. Horror is often told through the perspective of a it couldn't happen here vibe, but expressing that horror affects everybody, not just kids and rich folks in the suburbs is important. I think its fine overall. If it were like a Tales from the Crypt episode or a Twilight Zone episode, I would think it was great. As a movie, its uneven. The first half is great. The second half gets messy.PROS I loved the main character Anna. I thought she was beautiful and she commanded the screen. Perms are no joke. The natural hair movement is crucial. I felt for her character trying to fit in. I've felt the same way. The whole idea of wanting to be yourself and express yourself freely but people trying to mold you and shape you into being something you aren't for the sake of getting ahead. I loved that element. You really feel for her. I liked the 80s-early 90s setting of the film. I liked the characters. I really like Lena Waithe. The scene where Laverne Cox does her hair..SHEEEEESH. That was tough. Best scene in the movie.CONS The second half? The backstory? The origin? The message? What really happened? All of it, just seemed rushed. The special effects even take a step down. It really wasn't even necessary.Final Verdict Check it out if you want. Its not much to do otherwise. I wish it was more complete. I'm excited for Justin Simeon's future work. I think he is talented and he will get better with each film. Keep winning."}, {"id": 4, "text": "90s John Carpenter trilogy updated with same message that people will do anything for fame, prestige and Vanity. Writer missed the mark; Just wasn't emphatic enough about Black Hair in corporate America and TV! Movie Dragged with a jumbled epilogue."}, {"id": 5, "text": "This is a fun one. Love that it's set in the 80s. This movie is a cross between Little Shop of Horror and Jennifer's Body. It's campy and fun and sadly reminds me too much of the first and last time I got a sew in."}, {"id": 6, "text": "I watched an original movie last night on Hulu called Bad Hair about a young woman in the 80's who gets a makeover to advance her career, but ends up with a possessed killer weave from the hair of African witches. Superstar cast like Vanessa Williams, Kelly Rowland, Usher, Laverne Cox, Lena Waithe. Really well done. It was a very unique story that did a great job at portraying the late 80's. A lot of racial subtext touching on the pressures of using hair relaxers and sew-ins to assimilate to societal norms. All while showcasing some cultural folklore. Plus it had some good jokes. Vanessa Williams never fails to disappoint. A must watch."}, {"id": 7, "text": "Nothing new... (seriously can we have that in hollywood horror these days?!). This is just a clone of Body Bags skit by carpenter and hooper."}, {"id": 8, "text": "I was going to skip this movie until I heard /seen the videos from the new jack swing inspired soundtrack.I'm glad that I gave it a chance.quirky&amp; suspenseful."}, {"id": 9, "text": "Love a scary B movie, especially one with a predominantly Black female cast! I love the history mixed with folklore and how it is used in the satire. The scary parts are so outrageous that it is funny. The cameos are refreshing. Basically, dont take it too seriously and you'll enjoy it."}, {"id": 10, "text": "Time I'll never get back in life 😕 I watched until the end because I was already invested. Disappointed"}, {"id": 11, "text": "The embodiment of a perfect bfilm horror- with an all star cast! Vanessa L Williams! Kelly Rowland! Usher! To name a few.. everything about this movie is the perfect recipe for a cult classic. Don't let anybody tell you it's bad... And especially if you're a fan of beauty/ cosmetics, you'll love this fun overdue idea for a modern horror!"}, {"id": 12, "text": "This was a rip-off of other, better movies- Get Out and In Fabric come to mind. But undeveloped themes, bad casting and bad effects land this in the gutter."}, {"id": 13, "text": "New meaning to Scary Movie🤣😂😎Acting is SUPERB and the story is LAUGH OUT LOUD funny"}, {"id": 14, "text": "I feel like this whole movie was executed for a plot with more depth. All these celebrities for no substantial reason.I'm okay with this movie due to blaxploitation films, but I feel like this is not a modern tribute to blaxploitation.This film is about as culturally mythical as Evil Eye."}, {"id": 15, "text": "Is hair coming alive a unique concept? Of course not, but very little in modern films are. This is by far the best take I've seen on it in any horror film. I know some pathetic people are comparing it to John carpenter's Body Bags, which is laughably untrue and shows how little those critics know or care about black culture and colorism. (Maybe they're mad that the real evil is a white man and racism, idk) I wouldn't call this a comedy, more of a smart satire mixed with horror about a real issue that society has with natural black hair, plus compelling lore and an interesting story that while paying tribute to some horror tropes and creations of the past, is entirely its own. I'm honestly shocked it has such low ratings from some people."}, {"id": 16, "text": "Could've sworn i've seen this in a Thai or Korean movie, didn't like it then, didn't like it now. Even with a splendid cast and basic story, you can't expect to have a decent ghost/monster-themed movie with such awful special effects."}, {"id": 17, "text": "This movie is super campy and hilarious. I enjoyed it!"}, {"id": 18, "text": "Directing is great, acting is great, the cinematography is great. The central theme and subtopics are strong. The monster is cool. However, none of these elements are intertwined well enough with each other to create an unforgettable experience, and this movie needs that. The central theme needs a stronger argumentation and exploration as it fades in and out throughout the movie. The protagonist has a goal, but she is somewhat passive while the story offers the perfect playground for her not to be so. Bad Hair is mostly a fun experience, nothing to drool over, but if you come across it, give it a chance."}, {"id": 19, "text": "It is apparent form the way this film has been reviewed that people lack appreciation, respect and understanding for the art of camp. This is a future cult classic in the making. Nods to Brian De Palma, Wes Craven and John Waters. A deliciously campy performance from Vanessa Williams."}, {"id": 20, "text": "If you know you know. This film is made for a particular audience and if that isn't you, you won't get it."}, {"id": 21, "text": "Best of all worlds. Best of horror comedy satire history! Such a wonderful cast. Freakishly well written, poignant. And a time capsule of the late 80s, spot on! Bravo!"}, {"id": 22, "text": "I laughed. I was shocked. I was shaking my head. I was confused on many occasions. You just can't stop watching it until the end. The message is on point!"}, {"id": 23, "text": "This was a really fun and poignant film. It's not easy to mix horror, comedy and a strong social message but Bad Hair manages to pulls it off. The setting was great... both the style, ideals, and feel of 1989 were spot on. A movie about a killer weave should be enough of a selling point but the plot about a BET-style cable network selling its soul for profits is very engaging in it's own right. The performances were all great, so good that I was left wanting to spend more time with the characters.I've seen other reviews complaining that this isn't technically the first film about killer hair. Whatever. There are been countless horror movies about zombies, slasher and vampires, I think the genre can handle three or four evil weave movies without losing its spirt."}, {"id": 24, "text": "I was shocked to see there were so many black artists I hadn't see in years. It was 100% entertaining and agree with another reviewer regarding the quality of the performances, everyone is putting in 100%. It was truly a treat to be taken back to the 80s and see old trends, familiar faces, great performances with a genuinely intriguing / engaging story line. I don't get the low ratings...I could see if there were phoned in performances or a bad script, none of that I found in this movie."}, {"id": 25, "text": "Quite possibly the best film I've seen all year; I watch a lot of movies. Everything was on point. Sure, I'm biased but that doesn't make this feature any less wonderful."}, {"id": 26, "text": "I would definitely everyone should check out this movie. It has an interesting premise that parts of it's dark but also silly."}, {"id": 27, "text": "Has enough horror and story to keep you invested. Interesting twist at the end. I love cheese horror and this was great for me. I would recommend this for anyone who likes horror that isn't all slasher."}, {"id": 28, "text": "This movie is so hilarious!At first I wasn't sure about it but it kept me laughing"}, {"id": 29, "text": "Anna (Elle Lorraine ) is at a career dead end at her cable network. It is her hair. She gets an expensive weave of special hair. The hair has a mind of its former owner as it takes over her mind.Interesting concept. I didn't like the horse-faced character played by Elle Lorraine. She was boring on top of that.Guide: F-word. Sex. No nudity."}, {"id": 30, "text": "I got a feeling that the hair monster come out, I assume this is the so called comedy part. Totally hilarious with the hair thing and look so stupid on the actress cuz the hair. Just like ur nail is extremely long and it will be weird. However, with the story and actress background, it's make up some of the nonsense. This movie kinda unique and different horror from what I watched, the hair monster is extremely funny."}, {"id": 31, "text": "This horror flic is actually quiet freaky. The story is great and it is not many horrors whit this idea. i actually never see a movie about paranormal hair. the entire time i sat and wonder when or what the hair devil would come up with next. Had a jolly good time with this flic. 8/10"}, {"id": 32, "text": "Bad hair is so enjoyable as a snapshot of the 80s - pop culture was never more poppy.the story, a young woman hoping to make it in the mtv-style corporate media as the 90s comes up is very engrossing. how she chooses to fit in, however.....well, bad hair is a great name. i have to say i enjoyed the j-horror film :the wig from around 2005 much more as a horror vehicle, but this is a charming and visually enjoyable trip also."}, {"id": 33, "text": "Great movie. Deals with real societal issues and gives it a satire/horror spin without undermining reality. It's a very good build-up, great acting performances. Would definitly reccomend watching !"}, {"id": 34, "text": "I love the 80's so this movie was fun to watch. I like how the movie addresses an important issue such as self esteem, beauty and culture. It blends them together very well and it features many good black actors."}, {"id": 35, "text": "I absolutely loved this movie. I laughed my head off. Some scenes I watched three times. Great late 80s/early 90s New Jack Swing Era music/TV industry period piece. Great nod to old horrors films Little Shop of Horrors, The Blob and others. Pretty predictable but never done in this fashion. So good! Great music, direction, and performances. There were people in this movie I don't like and I loved them in this movie. All is forgiven. Haha. It's all in fun! But with a very true and profound message told in satire. Absolutely brilliant. I didn't know what this movie was and just put it on. LOVED IT."}, {"id": 36, "text": "I enjoyed it, I loved the all black cast,big names in this movie, very enjoyable not to be taken seriously,and it shows how we as black women are serious about the hair lbvs,it passed the time,fun for Halloween"}, {"id": 37, "text": "I personally found this movie enjoyable. It has horror, comedy and real world aspects to it , making it very different from other movies. I would watch this again. No nudity, only 2 implied scenes. Mild-Moderate profanity. No drug use other than smoking cigarettes."}, {"id": 38, "text": "Justin Simien did a great job for this not so original, but inspired-based film. I was already on board when I heard there's a movie about a killer weave coming out, and it was a bonus to have all black women in the main roles. This movie is exactly what I expected it to be and I was not let down."}, {"id": 39, "text": "A folklore story turned into a new cult classic. Wonderfully shot with various angels adding an ominous feel to the story as it unravels.New Fave"}, {"id": 40, "text": "While I definitely enjoyed Bad Hair, it's certainly not original. In fact, it borrows heavily from the 2007 Japanese film, Exte: Hair Extensions. Some of the hair effects are lifted directly from Exte. The main difference is that Exte focuses on one hair-obsessed man who sells the extensions from hair that he has personally nurtured. It's a great film and I highly recommend it."}, {"id": 41, "text": "Justin Simien takes a complex message about societal expectations and delivers it using a satirical horror film as his medium. Bad Hair started out with telling the story of a young woman in the entertainment industry who struggles to climb the corporate ladder and afford rent spikes in her recently gentrified neighborhood. Throughout the film, there is an embedded directive that shows the audience how POC's are expected to take their culture and force it into a cookie cutter mold to make other people feel more comfortable. This film also portrays how easy it is to lose sight of one's true self when striving toward a career goal, to the extent of becoming an entirely new person.For the first half of this movie, I often found my thoughts bouncing between i thought this was satire? and I thought this was horror? Bad Hair definitely took a while to build to that point, but it was entertaining throughout the entirety.Elle Lorraine's performance was excellent and came across as very genuine. Vanessa Williams was true to her villainous character and Lena Waithe was a great supporting actress who gave comedic relief at all the right moments. Usher made a few appearances, but they were short lived. Kelly Rowland's scenes were minimal.The horror elements were quirky, unnerving, and suspenseful. Despite the absurdity of the concept of a bad weave coming to life, Justin did well on this delivery without compromising quality."}, {"id": 42, "text": "'Bad Hair' is directed by Justin Simien and takes in 1989, as an ambitious young woman gets a weave in order to succeed in an image-based music television network. The network, now under new management, sees a bright future for the woman if she adheres to the culture. Her flourishing career may come at a great cost when she realizes her hair may have a mind of its own. This dark comedy horror film looks at African heritage, culture suppression, and workplace toxic culture with a fun slasher twist that I had a lot of fun watching!First the acting by Elle Lorraine is fantastic. She carries the weight of the film and does it with grace. The moments where they are showing her weave being put in are some of the most disturbing and cringe inducing scenes I witnessed at the festival. The give you PTSD by randomly inserting the horror throughout the film and keeps the audience on their toes and not sure what to expect. The supporting performances are all very strong and they are all having fun in the movie.The film is incredibly smart in its content, and maybe doesn't realize it's potential toward the end of the film. I loved when the film explored the mystery of the weave, where it came from, what it can do. But that is kinda stopped short and a random slasher chase sequence takes you out of the story and is a false ending. If they had shrunk that scene down and gave us the true ending sooner I think this would be the strongest horror film of the year.Overall, 'Bad Hair' is a fun watch, with good storytelling and great horrific cinematography. There are strong performances and a unique ending, even if the lead up is more generic."}, {"id": 43, "text": "Reminded me of The Simpsons Halloween Special called 'Hell Toupee'. Fake hair comes alive and turns the person evil.As I've seen the story done before, I can't say it was original. But I can say that I enjoyed this slightly different take on it.The acting was on point (apart from Jay Pharoah), I mean I love the guy and his impressions are A-class, but his acting leaves a lot to be desired. This is the 2nd film I've watched with him in and both times he was the weakest link. Hopefully, he continues to get roles and his acting game improves.There was a great cast, with so many familiar faces, it was a real treat..and some really good special fx, for what is essentially, 'hood cinema'.I also love the 80's flavour. The clothes, the music etc. Real nice touch.Nothing groundbreaking, but would definitely recommend."}, {"id": 44, "text": "I gave this movie 10 stars because it's a fresh take on a genre of horror that I really enjoy--the creature feature! It's melodramatic, it's campy, and it's a lot of fun! I love that it takes a new approach to the genre by predominantly featuring black women and black hair culture, an unexpected but genius turn. I also love that it lightly touches upon social commentary without being heavy-handed. The cast was perfect-Elle Lorraine was the perfect ingenue, Vanessa Williams was amazing as always, and Lena Waithe elevated every scene she was in. Setting it in the 80s was also a super smart decision, allowing the costume and set designers to have fun while heightening the camp factor. The callbacks to old horror films using lighting and framing were nicely done.My one and only complaint was that the exposition took too much time. I wish the filmmaker had shaved a little off the beginning so that we could dive a little deeper into the folklore related to the story, spend slightly more time developing secondary characters, and see the hair do a little more slashing! That aside, this is a movie I could watch over and over again (and probably will)!"}, {"id": 45, "text": "This is a riddle about how you should look and not look. do your best to follow the mainstream to make success. its also a film about hair, so if split endz doesnt scare you, it will after this. and if you ever consider to extend your hair length then you might reconsider, and if your bawldy like the grumpy old man wishing a sew-in might increase attraction then watch this curly hair-straighten out evil little novel.it'll also change your perception on some things that youll never thought about at daily basis when considering hair, like a hairy chest may put you to rest, and that a hairy mons pubis might be a slithering lick, and as every hairdresser can account for a tip of a hair might feel as stingy as a killing dagger.its a well acted, produced and fun film to watch, some slow moments, but you do feel sympathy for the main caracter in the kind of environment she is in.so have a look ,its decent horror that will snap your split entz away at a blink of an eye, and if you find a hair in your soup, kebab or chicken salad, by all means dont swallow, it might belong to some witch. its a recommend from the grumpy old man"}, {"id": 46, "text": "Sure, I hadn't even heard about this movie from writer and director Justin Simien prior to sitting down to watch it. So I actually didn't know what I was in for here, only that it was allegedly a horror comedy movie of sorts. So I managed to find the time to sit down and watch it.Well, while Bad Hair was a watchable movie, it was not really a movie that fell well into my preference of entertaining or taste. The movie turned out to be adequate for a viewing for sure, but it just failed to properly entice me and entertain me. You might say there was something hairy about it... pardon the pun!I think that of all the cast that appeared in Bad Hair, then it was only Vanessa Williams and James Van Der Beek that I were familiar with. I do enjoy watching new and unfamiliar talents on the screen though, and I will say that the acting in the movie was actually good.The script and storyline, however, was just somewhat a bit of a swing and a miss in terms of properly appealing to me. The movie was just a bit too bland, and bordering on being a bit far too out there in terms of the hair being alive and killing people.My rating of Bad Hair is a four out of ten stars. Give it a go, it might just be the type of offbeat horror comedy that will find appeal with you. I just wasn't won over by what writer and director Justin Simien delivered with the 2020 movie titled Bad Hair. I am sure that there is a large audience out there for a horror comedy such as this, but of course a movie doesn't find appeal with every single individual out there watching it."}, {"id": 47, "text": "Hulu finally came through with something to watch during this never ending pandemic. Streamers, this week of pandemic was quite fruitful. A group of us were able to watch, Bad Hair. I found it only fitting to get a special correspondent to weigh-in and analyze this film. We are taking this sibling to sibling movie reviews to the next notch. So this week I bring to you Nikki Starr. A jack of all trades has now added blogger to her repertoire. We both viewed Bad hair, which is a film set in 1989 about an ambitious young black woman gets a weave in order to succeed in her career. But what's the cost of a flourishing career and is it worth you hair and soul?Now, I could review this film on own but I think it's best voiced from someone that's lived the nightmare. But from my point of view. This movie is spot one. I enjoyed the fact this movie was horror enough but not scary and it was funny enough but not a joke. The director, and writer, clearly came together and put a nice balance on the film. The feel of the '89-90s vibe was spot on. The story writing was compelling to me. The intensity and eeriness of scenes were moving for anyone to feel the main character's anxiety, pain, fear, pride, etc. And on top of that, the cast is filled with a diverse cast of actors and actresses. From Jay Pharoah to Usher and Vanessa Williams to Kelly Rowland and more, the cast was jammed pack with relevant talent for their roles. And yet, with a star studded cast the lead, Elle Lorraine stood out and gave us the full array of emotions throughout the movie. I've heard mixed reviews on this film and Rotten Tomatoes doesn't think that highly of it either. So I think it's time to bring in Vaughn. *Wild Thing music plays* Let's see what our special correspondent felt about Bad Hair.Nikki Starr: This film seemed to be less about the hair and more about how black women are perceived in the workplace. Specifically, how they have to change to fit in or succeed. More importantly, there were a lot of ideas thrown out but none get fully fleshed out. The weave sew in scene is particularly effective and fully shows the pain people of color take on, and hide, to be seen as acceptable. This film seems to be saying, It's ok to wear your hair/present yourself however you want, but if you wear weaves or wigs you're selling out. Which is it? She literally has natural hair and works at Culture but gets a weave to fit in at Cult. But even in that transition she never truly undergoes a transformation. The journey is implied but not shown. She has killer hair but the other people are zombies and killer hair? The story arc for the main character and her hair never made sense compared to the other cast members. And again if you want your natural hair then you're normal but if you have a weave then you're a zombie out to destroy culture? That is not cool. Worth seeing for free but not the best.I want to thank The Starr for her insights and points. I agree but one interesting aspect I found the idea of being natural at Culture and being accepted with a weave in Cult in itself spoke volumes on the word play. You join the cult or your culture is taken over by this hair idea. Either way, its a good discussion piece whether you enjoy the movie, or not.Long story short, I understand and agree with things Nikki said. Stream To Big Screen again thanks to her for being our special correspondent. But fortunately for Bad Hair, I still feel even with the negative aspects, this movie is worth seeing. Bad Hair was well-done (even though scant execution), well-cast, and a creepy joy to watch and giggle at. It was pegged as a horror/comedy and I enjoyed both elements as if I'm watching Thriller. Viewers can enjoy a handful to a bowl of popcorn watching this Hulu flick."}], "reviews_amount": 48}