{"name": "The War with Grandpa", "titleId": "tt04532038", "reviews": [{"id": 0, "text": "Obviously it is a little far-fetched, but the comedy both scripted and 'slap-stick' is genuine and good fun. The people in the session I attended were laughing out loud. Don't expect Shakespeare, but relax and enjoy 90 minutes odd of happiness."}, {"id": 1, "text": "I almost didn't go see this movie because of the negative reviews but I am glad I did. This movie is good for what it is. The ending appears to be left open for a potential sequel which is why it ends as it does but people obviously didn't figure that out judging by reviews. Again I don't understand the bad reviews, maybe people expect every movie to be an Oscar winner or something? I recommend everyone to ignore the negative reviews if thats what is stopping you and go see this movie."}, {"id": 2, "text": "This was such a wonderful show! 5bof us went to watch it and we laughed so hard! Ages: 67, 38, 37, 9 and 7. The cast was fabulous, storyline was great and for once, it was ORIGINAL! I'm tired of remakes. This feel good, laugh out loud comedy was just what we needed. I can't wait to buy it."}, {"id": 3, "text": "A much needed good real laugh is needed once in a while and this movie delivered several good ones. Yea ok it is not an award winning movie and yes it is predictable at times but it made me and my family feel good and that is all it matters."}, {"id": 4, "text": "I haven't laughed so loudly in a long time! This is a pleasant action filled with a lot of laughter and creativity. The cast was also amazing! Robert De Niro and Oakes Fegley did not give up for a moment and played their roles perfectly. Robert De Niro is a person we are used to seeing in darker movies, but I dare say that his role here was a great hit! This is a film that deserves numerous awards for originality and cast. I highly recommend watching it if you want to laugh out loud! :D"}, {"id": 5, "text": "I love the story, and im enjoy the movie, I love Robert de niro acting 😎. Recommended to watch with family"}, {"id": 6, "text": "Holy crap this movie was funny all the way through not since me myself and Irene have a laughed so much in a movie like this it's a feel good family film not complicated not swearing no blood or anything like that just fun and witty and Robert deniro really makes this film work and uma therman looks so hot for her age i almost turned this off but after i would say like 145 minutes it really gets going and I'm glad i stuck with it cause it was just fun and laughs for an hour and 37 minutes"}, {"id": 7, "text": "It is a very enjoyable watch for the whole family. No need to think much kind of a movie. Predictable, yes. But it's the kind of movie that we all can enjoy, smile and laugh at."}, {"id": 8, "text": "If you like slapstick humor, you will enjoy this. I was laughing hysterically too many times to count. Awesome comedy to watch with the whole family."}, {"id": 9, "text": "This movie delivered! All around, w.r.t story, nostalgia, entertainment, CAST, FUN and the perfect culmination of the old school and the new generation!! Fun movie for all..! Definitely watchable when one's down and this movie will lift your mind off of things and put the mind in a good mood!!! A Big Ol' Thank you to everyone involved with this movie!!!! People who gave this movie a rating less than 8, does not know how to, for lack of a better phrasing, Get Entertained! Thank you for coming to my TED Talk!!"}, {"id": 10, "text": "While watching this movie, I was entertained the entire way through. The movie is full of things that will keep you laughing. The child and his Grandpa go to war by pranking each other. I enjoyed the representations of the characters in the movie. The older adults as energetic and full of life as the children. There are also great lessons to be learned from this movie."}, {"id": 11, "text": "Loved this movie, great cast in a gentle family adventure for all the generations."}, {"id": 12, "text": "Getting my family to agree on something is hard enough, getting them all to like the same thing? Hardly never happens. I can see how if you don't have kids, maybe you're a young couple, you may not appreciate the humour. I have a family of 4, whos dad actually lives with us and everyone from my 10 year old son up to my 80 year old dad spent the entire time howling with laughter!! Yes there was a moment where my son thought it looked like a fun idea, but was quickly corrected by his grandad that he took no prisoners and my son changed his mind but honestly, De Niro was his usual funny self. I'm not personally a fan of Uma, she was more grown up and relatable in this to me though, so if you loved her in some of her older stuff maybe don't watch this just to catch up on some Uma time. Slapstick humour, Cheech and Walken were the icing on the cake for us. We will be buying the DVD. Thanks for a successful family film night (for once)"}, {"id": 13, "text": "Best comedy I've seen in a long time. Don't know what all the bad reviews are about. But De Niro was a good laugh and this was a fun loving heart felt funny comedy! Quite a few good laughs in this movie and it kept me entertained until the end."}, {"id": 14, "text": "Really enjoyed this movie there is quite a few laugh out loud moments. It reminded me of an 80's / early 90s comedy that did exactly what it was supposed to do make you laugh. Not even close to the worse movie that someone posted. Anytime you can put Robert Deniro, christopher walken, and cheech marin facing kids in dodgeball you know its going to be fun. Sit back and enjoy the movie"}, {"id": 15, "text": "Not bad at all! It was fun and had lots of cute and funny scenes like the one when the tree felt on the house and Mia and Russell were....😂let's not spoil it! What i am saying is it was a good comedy for a family and it definitely worth watching"}, {"id": 16, "text": "Not a lot to recommend here; it's your standard, predictable comedy with a dash of feel-good family vibes. A grandfather and his grandson (seen in the poster) indulge in a turf war for the possession of the latter's room in the house. The storyline itself is an excuse for an occasionally funny, mostly drab comedy aimed at family-friendly audiences. A few scenes did crack me up; that dodgeball sequence being one of them. Walken is a wise addition to have in films like these, while Thurman and Riggle turn out far less amusing than expected. If you've got 90 minutes to kill and you're stuck indoors like me, go for it."}, {"id": 17, "text": "Not only is this movie funny it's PG rated and shows kids how to get along with relatives that move in with them."}, {"id": 18, "text": "Im not sure if these people giving bad reviews are getting paid to write them, or what! Maybe this year really is just making some people mad enough to think so negative about everything!! Its a freaking pg silly comedy made for families to enjoy and laugh with each other lol damn I just realized I should have given it a 10. Plus man what a great cast Robert D, Umma,Riggles, and oh yea even Walkin and Cheech. If u watch this one and don't laugh then u maybe should keep being part of the meaningless cancel culture"}, {"id": 19, "text": "Ignore the haters here, they are clearly off track. This is a funny, warm, innocent family film. It's a comedy for parents to watch with their kids. There are lots of laughs, more so than any movie in recent years. De Niro is perfect, Uma is just fine. For those that don't like it go watch some cheap superhero movie filled with special effects and brainwashing messages."}, {"id": 20, "text": "Don't understand the bad reviews here, it is a classic comedy! Had good laughs watching it!"}, {"id": 21, "text": "The movie was funny and it gave me thrills. Peter's actions shows that he doesn't want peace"}, {"id": 22, "text": "It's crazy to see Deniro still so energetic! The best actor of all times!"}, {"id": 23, "text": "Loved it. It's meant for a family audience. Warm, friendly, funny and enjoyable"}, {"id": 24, "text": "Great family fun. Our entire family enjoyed this simple and enjoyable story that had plenty of good jokes and pranks!"}, {"id": 25, "text": "Sometimes i felt uncomfortable with the fact the grandpa and grandson are acting in ways that can put both of them in to a Hospital very quickly, or even far worst. But, storyline and acting are great, and just to remind you, this is a Comedy after all, so if you wouldn't take the sadistic family play too seriously, you will enjoy it.All in all. A very fun Movie. They don't do much of that lately, especially with an A league actors.I wrote a review especially to highlight the fact that far worst Movies scored higher. So, it is a well made movie to it's genre."}, {"id": 26, "text": "This is so very funny. 10/10 I all watch it again."}, {"id": 27, "text": "Robert De Niro is like a fine wine, he gets better with age. To tell you the truth I was never a big fan of his more celebrated dramatic films, but I've become a big fan of his later comedy films, like this one. He handles the genre well, isn't afraid to play his age, and OK, they may not ever garner him another academy award, but they are fun, this movie is a good laugh, nothing tacky in it like most modern day 'comedies', just some good old fashioned slap stick laugh out loud humour, Christopher Walken was terrific, as was the entire cast. Don't analyse it, just sit back and enjoy, if you have a sense of humour you will!"}, {"id": 28, "text": "This movie was mainly for the kids, but it turned out to be hilarious. The kids love it and so did my mom, I really enjoyed it too. It's a great family movie to bring everyone together and laugh. Fun for all ages and generations. Great cast that did a wonderful job. Don't mind the bad ratings and reviews from Trumpers. They're just salty Robert DeNiro used his platform to stand up to Trump and the hate and racism he's spreading that is tearing apart and bringing this once great country to ruin. Do you really want to judge a movie on the actors politics? Or for that matter take reviews on a family movie from people with no morals or values? Watch the movie for yourself, I think you will find it enjoyable."}, {"id": 29, "text": "My wife and I actually enjoyed watching this movie and had a nice time. Not all movies should be complicated to be good, sometimes such simple ones can be good as well."}, {"id": 30, "text": "Three stupids references to De Niro past films, but the relationship with the family has some touching moments and it also have a few kinda funny scenes.Someone had the idea to put De Niro and Christopher Walken together on screen again, and this is good."}, {"id": 31, "text": "I haven't laughed so much watching a movie in such a long time. Great actors, especially my all time favourite Robert De Niro, great clean fun. So glad I didn't listen to the negative reviews. So glad I have a sense of humour."}, {"id": 32, "text": "Yes it is predictable, yes the pranks are sometimes stupid etc. But do not tell me that you had high expectations for the plot? You knew this would be a simple and straightforward movie with an uncomplicated plot. You have a supercast, Robert De Niro, Uma Thurman, Rob Riggle, Jane Seymour and Christopher Walken. It is the same as going to see a LA Lakers game to see LeBron James playing. And at the same time you can enjoy watching the other superstars from the Lakers like Anthony Davis and Danny Green. This movie is very enjoyable to watch. Don´t have high expectations and you will be all right."}, {"id": 33, "text": "I haven't laughed so hard in a long time, specially these days. Pls watch it and more with your old man if he happens to be around.. Robert De Niro, Chris Walken, Chi Chong. Uma, excellent cast. Enjoy!"}, {"id": 34, "text": "I loved Robert de Niro in this, it was good fun, wish it was rated like 15 or something and more crude humor"}, {"id": 35, "text": "I don't understand the negative reviews. This was a fun and enjoyable movie. Even my kids liked it and they are hard to please when it comes to movies. The cast was great! Give this movie a chance and decide for yourself if you like it or not. In my opinion, it's worth your time."}, {"id": 36, "text": "I luved this....Every family has disputes that can get out of hand. The comedic devises of the dispute are slapstick. This film exists as family entertainment. A great cast serving us well in the comedic realm. Sometimes I believe reviewers are particularly harsh with comedies . They are not prepared to rate them well because they see them as lesser films...mmm....maybe you should talk to Shakespeare on that one....."}, {"id": 37, "text": "This is a movie for the ones with family. Very nice movie."}, {"id": 38, "text": "This was a really funny movie! So cute &amp; sweet feeling for the whole family. Loved it! I'm not sure why all the whining &amp; low ratings!"}, {"id": 39, "text": "It's pathetic to watch such great stars in this film apt for juveniles only. Watch it if you are under 14 years old....."}, {"id": 40, "text": "A group of us went who varied in age and tastes in movies. We all enjoyed it. It had lots of laughs. Great movie for tweens too- I find hard to find movies like this since many popular movies are either cartoons or the other end is movies with a ton of swearing and violence."}, {"id": 41, "text": "If you need a night of good belly laughs go see this movie! It was just what we needed during the gloom and doom of the pandemic. Great cast, great job! I will watch this again! The pranks were priceless and just Dennis the Menace style hysterical!"}, {"id": 42, "text": "This film is a good old fashion entertainment for the whole family. Don't believe the ones who gave this a 1 out of 10 or a very negative score. Last 4 years we not only learned that most of those are supporters of the US president. We all know why they hate good old Bob's movies and the man himself. They are very, very biased, full of hate and can't be trusted to write a good film review. With that said, this film is great fun, Deniro is great as is the whole superb cast. Its great to see deniro and walken again in the same film! It's famely slapstick for anyone who has still got humor left or isn't a supporter of a sertain semi dictator. It also got the heart in the right place. Kids are also acting great, a wonderful film and a good family comedy."}, {"id": 43, "text": "Can't understand the negative reviews, I really don't know what these people expected. It's a fun wholesome family comedy movie with plenty of laughs for adults and children alike."}, {"id": 44, "text": "Ummmm I thought let's try it. It was okay, one or twice I smiled and it was most of the time entertaining. unfortunately it was a dime a dozen. Like the acting of Robert DeNiro, Uma Thurman,and Christopher WalkenA family movie that I really enjoyed. I laughed more then I thought I would and it was fun. Some of the pranks were pretty solid, the end and scenario was very predictable as most of Hollywood movies, but it was not bad at all &amp; my family enjoyed it as well.I couldn't get past the memory that Robert DeNiro and Uma Thurman played love interests 27 years ago in Mad Dog and Glory and now were together again as father and daughter."}, {"id": 45, "text": "It isn't the best story in the world but the movie made me laugh several times. So enjoyable movie!"}, {"id": 46, "text": "A comedy where adults played well but the kids crossed it all out. The kid overplayed it too much. Robert did an awesome job"}, {"id": 47, "text": "This is def not a critics movie, its not demanding, it has no intellectual message, but it's fun! It's a family film, kids will like it, but there are a lots of good jokes for grown-ups too, so its a perfect family movie, this is light entertainment for having a good time and you can get drunk and watch it. lol And it's kind of old school, reminded me of Home Alone and National Lampoon's Christmas Vacation but with a new vibe.Actually a perfect movie to relax, that won't bore you.Your Experienced Movie Watcher"}, {"id": 48, "text": "A movie that will make the whole family laugh and tear up. Full of Wonderful performances, full of laughter dialogues and will be very much appreciated by the whole family from kids to grandparents. Highly recommend this for the holidays."}, {"id": 49, "text": "Really good film not to long full of laughs and great cast uma therman is beautiful as the mother and robert deniro is really enjoyable in this film kept i never laughed so hard and for so long it's just a fel good movie without the violence or swearing me glued to the screen i recommend it for the family my other review got deleted don't know why so hopefully this one stays"}, {"id": 50, "text": "It's a comedy and the story justifyed it. I enjoyed it a lot."}, {"id": 51, "text": "This is the story of a grandpa who comes to live with his daughter's family. His daughter gives his son's room to his father. The war between the son and grandpa starts here. This is a very nice comedy. I enjoyed watching it. The story is happening in many different locations like home, school, etc. The acting crew was awesome. Robert De Niro was great like always. In my opinion, he is a living breathing book on how to act. Also, Uma Thurman was good in this movie. Oakes Fegley is very talented. We will hear more from him in the future. The story was well-directed. In summary, if you are a fan of comedy, this is a great pick for you."}, {"id": 52, "text": "There were a couple of things about the movie that I could understand why many people rate it lower but I ultimately enjoyed it. It's a cute family movie with just enough adult humor but the storyline had some unbelievable points where from a grown up perspective you think that without never happen. I thought this movie would be a great watch for my own parents and have already recommended they check it out at some point. If you want the movie to be an A+ then skip it but if you're down for some chuckles prepare yourself for imperfection and enjoyment."}, {"id": 53, "text": "It's a fun movie you know, it's entertaining, well nothing really special here but I think Robert De Niro doing a very well act here, the story is very unique, it's very enjoyable movie and a very proper family movie"}, {"id": 54, "text": "Great one for Christmas Holiday, to be seen with tje entire family!"}, {"id": 55, "text": "My expectations were not high for this one - a film shot three years ago that failed to get any kind of release, featuring some high profile names (Robert De Niro, Uma Thurman, Christopher Walken) and based on a huge-selling children's book.I was surprised to find myself smiling throughout, amused both by the pace of the film and its efforts to ensure that every scene had at least one solid laugh. Pitched towards a family audience My War with Grandpa is centred around an average family who invite an older relative to live with them. Due to knee difficulties he cannot easily manage stairs so his grandson is required to give up his bedroom in order for the grandfather to have somewhere to sleep. Banished to an attic bedroom the grandson declares formal war on his senior relative and an amusing battle of wits and practical gags follows.The cast are very game and embrace the silliness of the ever-escalating war and the story has enough of a touch of realism in its family dynamics to make it very relatable. De Niro is clearly willing to try anything despite his advancing years and he is given good support from contemporaries including a frail looking Walken, an enthusiastic Cheech Marin and the forever upbeat Jane Seymour. Uma Thurman has an amusing subplot as the unknowing middle generation between grandfather and grandchild and faces being the victim of circumstance in increasingly amusing encounters with a local police officer.Production values are generally high with some ambitious stuntwork and colourful settings. I was surprised thought that the credits for a simple comedy ran more than ten minutes, even with the inclusion of a few outtakes and behind the scenes footage the slow paced credits seem unnecessary.Overall this was hugely enjoyable and a film I think I will actively revisit until the time when I hopefully become the grumpy grandfather embedded unwanted in his descendant's household."}, {"id": 56, "text": "Just an extremely funny movie. Would be nice to have a sequel with more funny parts thats the only thing this movie is missing."}, {"id": 57, "text": "I watch every Robert de Niro movies especially comedy's as he can be really funny in those movies this one is more PG than dirty grandpa but as a 23 year old I laughed at some most of the scenes recommend watching with the family"}, {"id": 58, "text": "Title says it all, boring, waste of time, not even funny"}, {"id": 59, "text": "So much for remembering three of my favorite stars from the good ol' days when they had standards.I regret every minute of watching it. Hollywood should be ashamed, as should these now-washed-up sellouts.Whatever you do, do not pay for this trash."}, {"id": 60, "text": "The movie is ok -ish but Uma Thurman's acting is really bad... I mean really really bad! I'm shocked!"}, {"id": 61, "text": "I can normally sit through films like this as there are usually several funny bits that pull me through. This had nothing, not even one moment that made me laugh. Any jokes are just so extremely predictable they land completely flat. But I think the thing that gives this film no chance at all is that none of the characters are likeable in any way, in fact I ended up disliking the vast majority of them."}, {"id": 62, "text": "Don't waste your time, this movie is bad. Its not funny. De Niro at his worst. Maybe he should go back to acting classes. Honestly people this movie rates a 1 star."}, {"id": 63, "text": "More than a few top actors in this movie.. One of the worst POS I've Ever seen !! What motivated these good people to participate in such dross.. Do not watch this movie !!!"}, {"id": 64, "text": "Almost unrecognizable Uma, waste of Walken, senile Rob De Niro{s} and Cheech. It's VERY bad. If only someone would film people, which found this film 'funny' - i would watch that and probably rate higher than this one. Awful. 3/10"}, {"id": 65, "text": "This movie is hilarious. It's the type of absurd slapstick comedy we don't get enough of in Hollywood anymore. Robert DeNiro as Grandpa is fantastic. He's both funny and heartwarming; the type of grandpa most kids want. Uma Thurman and Rob Riggle as the parents are also very funny and play off of DeNiro's character very well. The story follows a boy named Peter who's excited that his Grandpa is coming to live with his family...until he discovers that Grandpa is going to be staying in his room while he's moved up to the attic. This sets off a war of pranks and hijinks between Gramps and Peter as they try to one up each other. Overall, it's very good and will keep you entertained throughout. DeNiro, in particular, really shines. Gather the kids and give this one a shot, you won't be disappointed."}, {"id": 66, "text": "They don't do such good comedies anymore. I laughed out loud a lot in this one and I really enjoyed it. My husband did too and he doesn't laugh a lot in comedies because in most comedies you laugh with what they say and my husband's English language is not so good so he doesn't het the jokes most of the times. But he laughed a lot with this one because it has funny moments and not funny speakings."}, {"id": 67, "text": "I just loved this movie. It motivated my kids on how to do aggressive pranks on everyone in this family. Because we want division over love and communication in our families. Right? Also, it motivated my kids to obey to bullies and break their promises. Very nice comedy movie, we really enjoyed it."}, {"id": 68, "text": "Upset that he has to share the room he loves with his grandfather, Peter decides to declare war in an attempt to get it back.It's fun comedy family movie, simple story it is meant to be for the family don't be too critical, just sit with the family enjoy a good movie and have a good laugh"}, {"id": 69, "text": "It was a funny film with incredible actors! I Really enjoyed and I hope everyone enjoyed too"}, {"id": 70, "text": "I liked this movie better when it was called, Problem Child 2."}, {"id": 71, "text": "I read all the critics reviews - terrible movie right? Wrong. I didn't want to see this movie but was I glad I did. I was dragged along by my grand-daughter and settled in to dislike the movie. But In no time it had me laughing and I don't laugh at many movies. The actors do well and keep the pace moving along. A real feel good movie and with not an unreal super hero in sight. Just go!"}, {"id": 72, "text": "It tries to be a comedy, but tricking your own grandpa or grandson like this isn't funny. It actually is malicious."}, {"id": 73, "text": "Honestly, this movie must be a tax write-off for somebody.There is only one person in this piece of crap movie that is funny and entertaining, and that is Cheech Marin. His scenes are few but his talent still shines.Everything else about this movie is about as stupid &amp; unfunny as stupid &amp; unfunny can be. You can use this one hour and thirty minutes to do something productive - like clean your automobile or sweep the gutters in your neighborhood. I think you will feel much better mentally and emotionally.Ugh!"}, {"id": 74, "text": "Ridiculous, cringe-worthy and almost unwatchable; The War With Grandpa makes it hard to believe Robert De Niro would ever take part in a film like this.In this family comedy, upset that he has to share the room he loves with his grandfather, a young boy decides to declare war in an attempt to get it back.If you've ever hated your grandpa as much as the kid in this film, you should get help. You know that The War With Grandpa was clearly a filler film for both De Niro and co-star Chris Walken. How did these leading men ever get persuaded into making this film? Walken was the one actor who had one or two funny lines and that's it. A complete waste of talent in a more than basic, wannabe family film.Follow @snobmedia for more reviews!"}, {"id": 75, "text": "Robert DeNiro continues to churn out horrible performances in quickie comedy movies that copy other comedy movies, and here he is at his worst. The War with Grandpa is a comedy that has no comedy moments.There is nothing funny about a kid who decides to get over on Grandpa by being at war with him. The humor is degrading and depressing, and there is no upside to any of this. No family values, no family love, nothing positive comes out of this movie. The message is sad and pathetic."}, {"id": 76, "text": "Bad acting, bad script, not funny, lacks humor, just plain dumb. As for De Niro, he has always been completely over-rated, mono-dimensional and always plays the same old same. He should retire with a little dignity. This is the guy who is wagging the morality finger at us, really. Better watch Home Alone I and/or II instead of this garbage."}, {"id": 77, "text": "I saw The War With Grandpa, starring Robert De Niro-Joker, Dirty Grandpa; Uma Thurman-My Super Ex_Girlfriend, the Kill Bill movies; Rob Riggle-Modern Family_tv, Let's Be Cops and Oakes Fegley-The Goldfinch, Pete's Dragon_2016. This is a family film that is based on a children's book-by the same name-written by Robert Kimmel Smith. It's an average comedy with lots of telegraphed jokes and situations-you know what is going to happen before it happens. Robert plays the grandpa that-after the death of his wife-has to move in with his adult daughter Uma and her husband Rob and their 3 children. Oakes plays the 12 year old grandson that has to give up his room to Robert and he is not happy about it. Oakes has to move up to the attic so he declares war on grandpa Robert to get his room back. Each of them pull pranks on each other, hoping the other person will give in, but you know that that is not going to happen-at least not until the last 15 minutes of the movie, maybe. There are a few cameos of older actors, as friends of Robert; Christopher Walken, Jane Seymour &amp; Cheech Marin pop up. It's rated PG for rude humor and language and has a running time of 1 hour &amp; 34 minutes. It's not one that I would buy on DVD-my wife and others in the theater liked it more than I did-but it would be alright as a rental."}, {"id": 78, "text": "I enjoyed a bit of it but some parts went beyond ridiculous such as the paramedic part and the 3 grown men throwing a child into a dumpster....its ok to watch if your below 14 years old but its no dirty grandpa sequel we hoped it was..."}, {"id": 79, "text": "This movie overall feels like it should have been released in 2015.With the odd pacing and flat humor this is definitely not a movie to see unless you plan on falling asleep half way through."}, {"id": 80, "text": "Grandpa Ed (Robert De Niro) has some run-ins with the modern world and is bitter with the lost of his beloved wife. He is forced to move in with his daughter Sally (Uma Thurman). He takes over grandson Peter's room. Peter is not happy and he declares war to take his room back.This is silly but it's kind of cute and mostly harmless fun. It's perfectly fine entertainment for the whole family. It is very odd to see some of these adult actors doing this stuff. Sometimes the silly antics elicits a few chuckles. Dodgeball has to be a highlight of crotch shots. That's not bad for a simple family flick."}, {"id": 81, "text": "We all know where this is heading long before the film gets going! It's a fun film for the under 12s as long as they are not expecting too much. These films are more like pension top ups for those who appear in them...lots of overacting and very little substance."}, {"id": 82, "text": "Don't waste your time .... I can't believe they let such a foul mouthed geriatric near kids let alone make movies with them"}, {"id": 83, "text": "It's DeNiro, the bully that likes to curse a lot and wants to punch people in the face in real life. Zero interest."}, {"id": 84, "text": "It's one of the most unwatchable and unbearable movies I've ever seen . Don't waist your time ! It's more than obvious , that fans credit is depleted for old heroes : De Niro , Walker and Uma ."}, {"id": 85, "text": "A reasonably good cast obliterated by a thin script and terrible directing. This is one of the most disappointing movies I've seen. Don't waste your money on this rubbish."}, {"id": 86, "text": "I went in with low expectations but it turns out they should have been much, much lower. I watched about 60% of the film before walking out of the movie theatre and can honestly say that I didn't even so much as slightly smile at the 'humour' in this movie. It's predictable, dull, childish, and on top of that, the acting isn't even good. Not even the combined forces of Robert DeNiro, Uma Thurman, and Christopher Walken can carry this bore of a film."}, {"id": 87, "text": "It looks like Robert the Niro is in a costly divorce.. If this is what we can expect in the future..?"}, {"id": 88, "text": "As an adult you want laugh at this movie, it's pretty bad actually. Kids might get a kick out of it, i'm not sure."}, {"id": 89, "text": "FINALLY, a movie that proves CLEAN IS POSSIBLE!!!! Robert DeNiro was GREAT! I can honestly say I never thought he'd do this type of role. Christopher Walken us his quirky self. Cheech Martin add his spice to it. Jane Seymore looks like had so much fun. Uma Thurman shows someone I can relate to. Rob Riggle adds just enough humor, not too annoying, not too childish. Oakley(not sure on spelling) did an AWESOME job in his part of the war. Perfect blend, everything is a perfect blend! I would LOVE to see more of these."}, {"id": 90, "text": "What happened to this man? I'd rather he retire than continue to embarrass himself. When i heard the title of the movie, I figured it was going to be another version of Dirty Grandpa. So I rolled my eyes. When i saw it was rated PG I rolled my eyes until they got stuck. He was great in The IrishMan but his other films lately have been a miss. And I mean a miss. This film is no different. Bad acting. Not funny. Stupid plot. Maybe divorce does that to a man in Hollywood. I don't know...but what I do know is that you need to skip this film. I sacrificed my time just for you. Don't let my sacrifice go to waste! Skip it and you'll thank me later."}, {"id": 91, "text": "This is a razzy contender, what a dud. Kids were talking all over the theater, leaving to see HOKUS POKUS or BEETLEJUICE again. What a waste of time and money. Suppose to be a feel good, kid movie with a HOME ALONE vibe but instead just boring. DeNiro needs to stop making movies."}, {"id": 92, "text": "There is a startling amount of talent involved with this movie - unfortunately, none of it amongst the writing staff. This is predictable, unfunny and features a completely ridiculous premise. Yet, this movie stars Robert de Niro, Uma Thurman, Christopher Walken amongst other acting luminaries. What a wealth of talent in such a nothing movie. This is the kind of film I would expect to star someone like Chevy Chase, not real actors like those who are actually involved.The best you can say about this is it's not completely horrible. It passes the time. Less demanding juvenile viewers may get a laugh or two out of it, but there isn't much here for older viewers."}, {"id": 93, "text": "Not a lot to recommend here; it's your standard, predictable comedy with a dash of feel-good family vibes. A grandfather and his grandson (seen in the poster) indulge in a turf war for the possession of the latter's room in the house. The storyline itself is an excuse for an occasionally funny, mostly drab comedy aimed at family-friendly audiences. A few scenes did crack me up; that dodgeball sequence being one of them. Walken is a wise addition to have in films like these, while Thurman and Riggle turn out far less amusing than expected. If you've got 90 minutes to kill and you're stuck indoors like me, go for it."}, {"id": 94, "text": "This movie was extremely poor attempt at a comedy. I watched this with an open mind buy wasn't expecting much, maybe just a few laughs but I don't think I laughed even once. Don't bother watching it."}, {"id": 95, "text": "Unless you just want further proof that Uma Thurman is ageless, this tacky, uninspired, boring, joyless movie is a waste of time."}, {"id": 96, "text": "Not funny just wierd and stupid with good actors in a bad comedy film, you can watch it but it will be hard"}, {"id": 97, "text": "Nickelodeon humor with names that needed an easy paycheck. Oh, how the mighty have fallen. Predictable, flat and forgettable. Would have been better with unknown actors........"}, {"id": 98, "text": "Not very well done and pathetic acting by Robert De Niro. Do not waste your time or money."}, {"id": 99, "text": "Terrible. Boring. Children were poring out of the theater to watch NIGHTMARE BEFORE CHRISTMAS again. Painfully bad"}, {"id": 100, "text": "Great cast ! This is as good as it gets unfortunately. Cast are all wasted in this boring drivel. Not one laugh to be had. Robert De Niro is just in it for the $ now. He is no longer bothered about appearing in any films that have a script. This film lacks any purpose. Poor excuse of a plot. Characters are all wooden with no chemistry. Really dull stuff."}, {"id": 101, "text": "Several years ago another critic reviewed a substandard effort by a writer as an alimony book: a pieced-together mess produced for $-sake alone. THIS is the DeNiro version: going through the motions, the same old schtick. And yes, DeNiro was recently divorced.To call the plot predictable is an insult to predictability.And Uma Thurman, Oh, honey, what happened?! Back to acting school the lot of you!!!"}, {"id": 102, "text": "This is a comedy, yes mindless Home Alone type humour but belly laugh with tears. If you are a stiff upper lip too afraid to crack a smile type, this isn't for you. If you like family movie type humour ENJOY. I gave it a 10 as delivered exactly as promised and right up my alley."}, {"id": 103, "text": "Perfect PG movie! Family friendly. Funny! DeNiro was PERFECT add Walken &amp; Marin &amp; the combination was very funny!"}, {"id": 104, "text": "Gave it a three stars for De Niro only. He does a really good job, but everything else is just not right. I couldn't even finish watching this movie. Acting is pretty bad, I got suprised when I saw how bad Uma handled this role. The movie is a good match for kids, but if you are looking for a funny movie, keep on lookin'."}, {"id": 105, "text": "When you're a one note actor and have a massive divorce settlement to pay, these are the scripts you take. I have no sympathy for DeNiro because he's been carried by Scorcese his whole career."}, {"id": 106, "text": "I don't get how mainstream movies in America continue to churn out the exact same movie every year, and people just allow it to happen? Such awful writing for young teens. It's clear that the writers had no idea what interactions between young kids are actually like. You have the main characters (Oakes Fegley) surrounded by such flat, unfunny, one-dimensional characters that add no value to the story. One owns a snake? Another has a sister that likes to embarrass him for no reason (there's a scene where she meets him at the lunch area and tells his friends about his fungus problem) and there's a girl who seems to be there more so for gender diversity rather than anything else. Then there's the main character's parents, who are meant to be goofy and try to portray a more 'realistic' type parents, but try too hard to be as funny as the parents from Easy-A and yet they fail miserably. And then there's Robert De Niro, who has fallen under the trope of Old man played by famous actor from the 70's, now trying to understand how to use technology, because ha-ha, old famous man don't know how to turn on an iPhone. The plot revolves around Robert De Niro and Oakes Fegley. Robert De Niro's character, Ed, has supposedly lost the plot? Because he didn't know how to work a self-checkout machine at a Walmart. So he goes to move in with his daughter (played by Uma Thurman). The conflict is that Oakes Fegley's character, Peter, has to move his bedroom to the attic to cater to Ed on account of him being old and can't use stairs I guess? (Ignoring the fact that Ed has no issue playing game of dodgeball with his other 'old' pals at a trampoline park). So Peter decides to wage a war against Ed, for no other reason than to get his old room back. Ed doesn't really want to be involved. He just wants to go about his day in peace and fawn over the loss of his late wife (which I guess is supposed to add depth to his character, but, just like Peter's friends, the dead wife adds no value to the story, but more so a shrug-of-the-shoulder type plot device). This takes up most of the movie. Just a grandfather and his grandson playing pranks on each other, all over a bedroom. That's about it really. The pranks are supposed to add comedic value to the movie, but they're so predictable that you could smell it from a mile away. Pullings screws out of the furniture, setting alarms off at unexpected times, manipulating one another into doing something that turned out to be a trap. From this you can get a sense of where the story is going to go, and that's exactly where it goes. Ed and Peter develop a liking towards each other (because, you know, they're related after all) but the pranks become too much and people get hurt, and that's the climax of the story. Apologies are exchanged, feelings spill out. The end.It's a movie that has been done time and time again, and will most likely continue to be made till the end of time. It makes for a quick buck, put together under a huge Hollywood budget, you bring in a couple of famous actors (Robert De Niro, Christopher Walken, Uma Thurman) and, hey, you have a movie! The humour is predictably slapstick when it comes to the pranks, and the interactions between the teens are too dry and are trying so hard to be relatable to the younger generation, but it fails to do so because the writers do not know how to accurately portray young teens in an authentic yet funny way. Its mindless storytelling is insulting to any viewer of any age, and it should not be viewed by anyone. Let the production companies sweep this under the rug and pretend that it doesn't exist."}, {"id": 107, "text": "As much as I love the cast of this movie, I could not finish watching this and turned it off after the birthday party. So much more could've been done with the script to make this funny even for grown ups. Very disappointing for me"}, {"id": 108, "text": "Two stars in respect to the actors and the production team. The script was poorly written, the war is almost meaningless, the jokes have no timing at all, the film doesn't move or make you laugh enough. That sad. I think it's the worst movie of our dear De Niro."}, {"id": 109, "text": "Im sorry but all I see when I watch DeNiro is an angry, disrespectful, washed up actor. Not interested in watching him anymore."}, {"id": 110, "text": "It's a kids comedy that will only make you laugh if you have a simple mind."}, {"id": 111, "text": "Good grief...how many of these pathetic flicks is DeNiro going to make. Seems like light years since he was in anything decent....Raging Bull...what was that, 40 years ago?"}, {"id": 112, "text": "How did they even get Robert De'Niro in this movie??? this movie was horrible the main child actor is a horrible overreacting actor like he's trying way to hard and so are the other kids and it just wasn't that funny or very realistic it was more boring &amp; not worth the watch."}, {"id": 113, "text": "No its not good, is that a surprise to anyone? Why would you watch this movie? Here's the deal. If you watched the trailer and thought to yourself That looks good, lets see that! You'll probably enjoy it. Because you're sense of humor is dumb. This movie is bad. If you know what a good movie is don't see this, if you know what comedy is don't watch this. How they got some of these A-list actors to be in this movie is so beyond me. Robert DeNiro are you okay? I will say though- Christopher Walken had no visible shame in this movie. I think he was actually pretty funny. But you could clearly tell Robert DeNiro was Wildly embarrassed to be a part of this."}, {"id": 114, "text": "Don't watch it. Save your time and money. It litrely is about a boy taking revenge on his grandfather for staying in his room."}, {"id": 115, "text": "I'll keep this short.There are about two decent laughs from this movie, and both from the same gag. Otherwise, all the jokes missed the mark. The cinema was dead silent most of the film and it made me cringe.This was about as lazy an attempt at script writing out there, and the acting was poor. The amount of cheesiness was insane, making it hard to watch.My kids both thought it was stupid, too. Best to avoid this one."}, {"id": 116, "text": "It's my first time adding a review. But, I couldn't stand this movie. I felt it since the very beginning of the film that it was going to be an absolute mediocre movie. Don't waste your time in this movie. It's just that the editing, directing, plot, taking, was absurd and bad done, even our son was bored from the beginning. There are a few good scenes where people mild-laugh but no more during the whole movie."}, {"id": 117, "text": "This film is watchable with the family but by all means not a great film. It has some laughs and the idea they got all these actors to do this film is mind blowing."}, {"id": 118, "text": "I watched it yesterday and hope to have some fun watching it. My exception was more. Just a plain comedy film it was."}, {"id": 119, "text": "Actually the movie is not very funny, it has couple of scenes in which you will laugh, it leaves a good message for the children."}, {"id": 120, "text": "In what Millenial Madhouse would this boy's behaviour EVER be allowed?! Good cast wasted on this unbelievable story. Did something from the book get left on the cutting room floor? The youngest sister's character as well as the grandfather and his pals save the movie from entire failing but it is a difficult watch otherwise. One does not feel any empathy for the young main character whose self-serving and outright dangerous pranks are the center of this story. Even worse are the parents who turn a blind eye and never reprimand him for any of it or do or say anything to reset his misguided notion. Unless we missed the part where this kid has somehow become actual part-owner of his home, then he does not have a say about where his bedroom is as should show his grandfather, a war vet at that, the damn respect he's due. And didn't he just recently lose his grandmother as well? You'd never know it from the dangerous and damaging stunts he pulls on his grandfather at a time where we are shown the grandfather is missing his late wife. Not recommended as a family movie at all."}, {"id": 121, "text": "This is a movie specifically made fore young teens. It does not in any way entertain older audiences. It should be a nickelodeon or disney special as it is also made from Tim Hill who directed spongebob (which was way better) and alvin and the chipmunks which has not aged that well but is still watchable more than this.The punchlines of the jokes are so bland that if you're not 5-6 years old I do not see you laughing at it. EXCEPT for Christopher Walken, let's face it, he gave more to this than the whole cast, even deniro's brilliant acting which was still there could not make this entertaining enough, but any moment with christopher walken you could just feel him giving his all to make people laugh, just listening to the way the guy delivers his lines and talks is entertaining. 4/10 for Christopher 3/10 without him and 0/10 without them."}, {"id": 122, "text": "Not funny. Maybe little kids might enjoy. Don't waste your money. Not sure why Robert De Niro would agree to do this movie."}, {"id": 123, "text": "If you enjoy a suspension of disbelieve then this is the movie for you. I had a very hard time watching this, the situations they are in are incredibly unlikely and so forced, it does everything it can to insult your intelligence. I don't mind a few goofy moments, a few silly bits here and there, but this is so deliberate you could taste it.for the most part this was a disappointment. I avoided the reviews first and went to the box office sales to see if it was good for myself, it's not. There was little thought put into this movie, it comes off as a poorly thought out youtube video. I was genuinely confused how this movie had so many ticket sales when the reviews giving it a 4 or a 5 are so accurate.Watch at your own risk, it's pretty boring!"}, {"id": 124, "text": "With those actors you can f it up. The writing is so bad it literally make the actor fifth grade actors."}, {"id": 125, "text": "Film is so so, nothing special... Certainly not a great film to reteam De Niro and Walken together but I guess thats where we are these days. Maybe ok watching with the kids while giving them a history lesson about the 2 great stars and explaining this isnt their best work. Walken and De Niro excel at comedy but need better scripts. Sayin that Walken works with what ever hes given and always gives a good laugh. There are better films with less scores yet everyone seems to rave this little film.. Its worth a watch but pretty sure you will forget it the next day, only the laughs inside will remain of Walkens crazy part.."}, {"id": 126, "text": "De Niro's classic charm and acting is not enough to make this movie even slightly watchable. Every other character delivers flat lines with bland humor. Save yourself the time and money and watch a better movie."}, {"id": 127, "text": "The War with Grandpa was a somewhat enjoyable family film that will satisfay some younger kids and they could actually watch something that will entertein them but it lacks supstance to please older demographic,it was cool to see De Niro, Walken and Uma together but they were just generic characters that we already seen in this kind of movies and they dont distant itselfs from them in any case.Humor was also plain simple,we got some balls and poop jokes and they werent funny to me at all,there is only one scene in a film were i laughed and that is all, The War with Grandpa was somewhat fine time that could work for young kids"}, {"id": 128, "text": "Ok actually it's was fine not very bad I think it's more forward for children not for adults"}, {"id": 129, "text": "Robert De Niro is too old to take care of himself. He moves in with his daughter Uma Thurman and takes over his grandson's room who now moves to the attic. He objects to the move and starts a war with Grandpa.This is a family comedy which lacks a good scene or belly laugh. Not very memorable. Should be okay as the second feature for family night."}, {"id": 130, "text": "This movie was meh. The actors were under utilized, especially Walken and DeNiro. It's ok for a family movie. The kids liked it, and us parents can tolerate it. The pacing was off, and they wedged-in a feel good moment and anti war message that was a little on the nose and preachy."}, {"id": 131, "text": "A once great actor has fallen so far. His attempt at comedy is pretty bad and hasn't matched his role in Meet the Parents. This is just a continuation of either his dwindling acting skills or his poor decision to start making comedies.Just a typical old man and bratty kid movie. De Niro being part of it did nothing for the film or De Niro himself.Look for something more entertaining to watch, like a hamster on a wheel."}, {"id": 132, "text": "This movie is very arbitrary the jokes fall flat there is some bad acting and it is also low budget overall not a great experience 23% in my book but it is a good family movie to look back on going through the pandemic"}, {"id": 133, "text": "Beware this movie could leave you feeling bad that you aren't living the mythical American dream in a limitlessly spacious multi floor home. With the perfect white upper middle class family and all the trimmings. Disgusting excessive birthday parties and all ugh. Boring stereotypes and privilege. Too bad - love the actors. Great people. Horrible movie"}, {"id": 134, "text": "Robert DeNiro's last 20 years of movies have been terrible. Don't know who's picking his projects these days; dart board. Typical family film.The ending is less than good. It just ends like they needed to keep the movie under 95 minutes.Netflix or less. Don't pay for this movie."}, {"id": 135, "text": "The War with Grandpa tells the story of Peter(Oakes Fegley), who all of a sudden has to vacate his room, when his grandfather Ed(Robert De Niro), starts living with the family. Giving his grandfather his room, irks Peter to no end. So, he declares a war to get his room back from Ed, his grandfather.The War with Grandpa is a hilarious movie. Director Tim Hill has given us a family-friendly slapstick comedy, during these dark times that we live in. The comedic set pieces always make you guffaw but, they lose their novelty after a while. There are a couple of moments here &amp; there, that will tug at your heartstrings. Robert De Niro is outstanding as Ed. Uma Thurman is superb as Sally. Rob Riggle is hysterical as Arthur. Oakes Fegley is spectacular as Peter. The effortless camaraderie between De Niro and Fegley, is one of the strong points of the film. Laura Marano is amazing as Mia. Poppy Gagnon is adorable as Jennifer. Cheech Marin, Jane Seymour, Christopher Walken, Juliocesar Chavez, Isaac Kragten &amp; T.J. McGibbon are excellent as Danny, Diane, Jerry, Billy, Steve &amp; Emma, respectively. The War with Grandpa is worth a watch, for some entertainment to pass the time. Watch it with your entire family."}, {"id": 136, "text": "Then take a glare in this direction and watch ''war with grandpa''. this is hilarious breath sucking comedy ive seen in a long time, ive never been a deniro fan, just because hes always a raw criminal, or does other serious roles, but actually in this film his dead serious appearance makes him utterly funny.its the story about an old man just widoved, moving in with his daughter and family, the old bull the builder needs a room of course, and the son of the house has to serrender to his mums wish and he is more or less thrown in the attic, exiled due to a coocooned granddad. there are only one solution to this misdemeanor, WAR!!!there are many things that makes this a funny film, the story is generic, but it keeps floating due to fast shifting sets, and the stereotypical young vs. old are set on the throne. good and fulfilling score raise the funfactor, and the acting of the whole cast are way above what i expected in todays utterly squemish verbalistic comedy age. and its a shame i almost forgot to mention the pranks and rivalry, it must be superstitious phenomenons that has inspired the production crew, because i had forgotten all the things i used to do when my seriously demented ex-sailor torpedoed 3 times ww2 coal scufling steam boat charlie grandfather moved into our house when i was 11.there are just one thing for me and my sense of humour to say, its a must see. fun for all ,even minors, pg rating are of dubious caracter. a big recommend from the grumpy old man"}, {"id": 137, "text": "Mostly family friendly film with a decent cast.Based on a classic preteen book, the film discards a chunk of the books outdated narrative frames it well for kids these days.Cameos by Christopher Walken, Cheech Marin and Jane Seymour allow a bit more screen time for DeNiro, who is shockingly well suited for family films.Uma Thurman and Rob Riggle play the clueless parents who have great appearances with both of them being unwilling victims in many of the sons practical jokes, but offer very little to the plot. A well done scene with the grownups watching TV and talking parenting shows that there is perhaps more heart to the project than other direct to video faire.Although the film will fit in well with families who enjoy the Diary of a wimpy kid series, there is times that it comes off a tad cheap."}, {"id": 138, "text": "The War with Grandpa is the perfect film for the whole family! It is funny, has great actors and delivers a feel-good message to all of us.This movie is about a boy named Peter (Oakes Fegley) who is your average sixth grader. But, that all changes when his Grandpa Ed (Robert De Niro) moves in with his family. Neither Grandpa Ed nor Peter like the new living arrangement, because grandpa loses some of his independence and Peter loses his bedroom. A secret prank war ensues as Grandpa Ed and Peter try to outdo each other until someone gives up.This film is based on the best-selling book, The War with Grandpa, by Robert Kimmel Smith. Thanks to Tre Peart, the executive producer, this movie was made. When Tre was in the third grade, he came across the book and suggested to his parents that they should make a movie about it. And here it is! The script is hysterical and takes many lines directly from the book. Also, the amazing cast includes Robert De Niro (Grandpa Ed), who plays a terrific, immature, but loving father and grandfather. Uma Thurman plays a stern, but wonderfully caring mother (Sally), and Oakes Fegley plays Peter, an excellent prankster protagonist. The supporting cast consists of terrific A-list talent including Rob Riggle, playing a cool dad. Christopher Walken and Cheech Marin team up with Grandpa Ed to make him even more immature. My favorite part of the movie is all the creative ways Peter and Grandpa Ed find to prank each other, and sometimes other members of the family (sorry Sally).The messages of the movie are about the importance of communication within a family and respecting your elders. Also - trampoline dodgeball solves everything.I give The War with Grandpa 4 out of 5 stars and recommend it for ages 7 to 13. Adults will also enjoy this movie.Reviewed by Katherine S., KIDS FIRST!"}, {"id": 139, "text": "The War with Grandpa is an entertaining comedy movie with world class actors such as Robert De Niro, Uma Thurman and Christopher Walken. The story revolves around a forgetful grandfather who is living alone since his wife passed away. His daughter insists that he comes living with her family. He is assigned to live in his grandson's room who himself has to live in the attic. The child isn't very happy about the situation and declares a war on his grandfather who gladly accepts. As the two family members secretely fight each other, they also start appreciating each other more.This movie for the whole family convinces on many levels. The actresses and actors are becoming one with their roles and are doing an excellent job. The characters are quite quirky, diversified and amusing. The movie has many funny side stories such as the grandfather's daredevil friends and the oldest daughter's boyfriend who doesn't get accepted by her mother. The movie has a strong message that family should always stick together in difficult situations.On the other side, the movie also has a few flaws. The story is very predictable. The ending is overloaded with happy stereotypes. The characters are often behaving extremely exaggeratedly which leaves an at times bitter aftertaste such as when the family offers the youngest daughter an over-the-top Christmas party in the middle of the summer.Despite some minor flaws, The War with Grandpa is a highly entertaining comedy movie for the whole family with a positive message that is best enjoyed at a birthday party or around Christmas."}, {"id": 140, "text": "I walked into this film expecting it to be bad, but surprisingly didn't hate this has much, still not saying it's a great movie. Was very amusing, but there are movies I could watch again and again, but The War with Grandpa is not one of them. Don't get me wrong there where some moments I laughed, The prank war between the grandpa and the kid was okay. The chemistry between Robert De Niro and Oakes Fegley is fun to watch. Christopher Walken, Cheech Marin and Jane Seymour are also good in there supporting roles, you can see that there having a blast making this.The weak spots are Uma Thurman and Rob Riggle has the parents, just did not convince me that they are couple, and Riggle looks bored here and rather be doing something else. Uma Thurman looks incredibly miserable, kind of seems like she doesn't want to be in this, even moments where she acts happy, but I just didn't see it. Now Uma Thurman and Rob Riggle are talented actors, but this was not a good showcase of there talent. There was a subplot with one of the kids, but with no real payoff. I admire Robert De Niro he is such committed actor, even if he knows the film is gonna be bad, he's committed. The War with Grandpa was amusing, but nothing more, one time was enough for me."}, {"id": 141, "text": "Robert DeNiro's track record in comedies has been more erratic than with his esteemed career of dramatic outings. That differential is evident in the quality gap between his excellent pairing with Billy Crystal for Analyze This, and its unfortunate sequel three years later, Analyze That. The same can be said for the two Fockers comedies as textbook cases of large sequel dropoff. The low point was his role as Fearless Leader in the live-action tarnishing of a beloved cartoon series, The Adventures of Rocky &amp; Bullwinkle. This one splits the difference, leading to a reasonably entertaining mix of schmaltz and laughs.DeNiro is retired from his construction business, recently widowed and truly depressed. His daughter (Uma Thurman) persuades him to move in with her family rather than wallow in his sadness. Unfortunately, that's two parents with a son and two daughters in a three-bedroom house. The tweener son (Oakes Fegley) has to give up his room and move into the ratty unfinished attic. He loves granddad, but not enough to graciously cede his domain. DeNiro isn't happy about upsetting the lad, but sees no option and tries his best to blend in with the others.The plot is driven by the boy formally declaring war on Grandpa, leading to a mostly-funny escalating series of pranks and reprisals within agreed rules of engagement. Both are assisted by their respective trios of friends; DeNiro's surprisingly consists of Cheech Marin, Christopher Walken and Jane Seymour. Given their small amount of screen time, the three were obviously more motivated by the chance to work with a living legend than the juiciness of their roles. The script contains a few complementary subplots involving the rest of the family, as well.Some parents might question the rating, since the pranks raise the kids don't try this at home flag. If there's a demonic streak in any of your progeny, you might not want them to draw inspiration from these antics. Otherwise, it's fairly standard family fare with relatable conflicts and resolutions, and not a bad way to spend your together time."}, {"id": 142, "text": "Well, I have to say that the 2020 movie The War with Grandpa from director Tim Hill delivers everything you'd expect from a movie such as this. And I must admit that I think that the movie was actually a wholesome entertaining movie for the entire family.Writers Tom J. Astle and Matt Ember managed to put together a storyline based on Robert Kimmel Smith's book that proved to be enjoyable, fun and entertaining in more than just one way. And The War with Grandpa is a movie that has some appeal with audiences of all ages.Aside from having a good storyline, then the movie was also packed with pretty nicely cast acting talents, with the likes of Robert De Niro, Uma Thurman, Jane Seymour, Cheech Marin and Christopher Walken. And I will say that Oakes Fegley definitely managed to hold his ground opposite of a mastodon actor such as Robert De Niro.The movie had lots of funny moments, and I was laughing loudly a good amount of times throughout the course of the story. Sure, it was predictable, but it was goodhearted fun and laughs from start of the movie to the end of the movie.My rating of The War with Grandpa is a solid six out of ten stars. The movie is well worth sitting down to watch, especially if you have a varied aged audience sitting down watching it together. I can warmly recommend this movie, as it was a wholehearted good movie."}, {"id": 143, "text": "After finishing this film I was extremely shocked to see how many people panned the film. It had a great cast of actors in it, pacing was good, and the premise was different and entertaining.The movie was also really funny. Sure there were some jokes that fell flat, but overall I had a lot laughs. I was suprised to be honest however that this film was rated PG. Without giving to much away there is lot of crude material in this film. Therefore I would't recommend watching it with any younger members in the family unless they're teenagers.Honestly I would of gave the movie 10 stars if it wasn't for the older daughter character. She was incredibly annoying, added no humor to the movie, her acting was bad, and lastly she really gave no advancement to the movie. Had she been taken out completely the movie would went along just fine and there wouldn't be remote difference. Not sure why she was added or what the direction was suppose to be with that.Either way don't listen to bad reviews and give this movie a try yourself. I would definitely recommend it."}, {"id": 144, "text": "I thought this film would be the sequel to Dirty Grandpa (2016) but I was mistaken. This is a children's film, literally. Its probably appropriate for pre-teens.The one good thing I can say about it is how beautiful Jane Seymour and Uma Thurman still are.But I would be holding out if I didn't mention how cringe-worthy some of my favorite actors from the past were in this film. Robert De Nero, Christopher Walken, and Cheech Marin? smh. I want to forget I ever watched this film. At least Jane Seymour still as sexy as she has ever been. Joe Pesci must have said, Hell No to this film.I am giving this a 4/10 because the slapstick is very old and stale that I can't imagine even a pre-teen being entertained by this film.EDIT: Reconsidering my view on this film and how many times I have been downvoted for not liking it. I am changing my score to a 1/10. Suck on that downvoters. No about of upvoting bots can make this film good. It is total trash."}, {"id": 145, "text": "It's a good movie, just don't pay to see it at the theater. At the end of my review I'll tell you what that scene was. It was the biggest part of the movie. This would have been a great movie if they didn't follow the normal practice that some BAD directors tend to do: Add a scene that is totally BS and unbelievable, simply for shock value and don't care about everybody spending their money at the movies hoping for something great! It was the biggest part of the movie. And it was doing great until the last couple seconds. They simply blew it. That scene lost them 2 stars. I CERTAINLY recommend the movie IF tickets are half off and you're allowed to bring your own food and drinks. Otherwise WAIT for it to show up on streaming media.Scene spoiler: I'm not going to mention everything that happened that led up to the disappointment, just the very last part, because I don't want to spoil it for you. Basically there was total chaos at the little girl's birthday party because of a booby trap the boy set up for his grandpa. I was loving this part of the movie UNTIL: something bumped into a tree and the whole tree was uprooted and fell against the house, tearing a huge hole into the side of the house. Yes a huge evergreen. Some of the action prior to this was already slightly unbelievable and this part 'sealed the deal of disappointment'."}, {"id": 146, "text": "I love movies of all kinds, for all moods, I think that mostly they all have a place, from parent trap to cheaper by the dozen, pacifier etc even the new movie sleepover had moments, I'm a fan of this genre as daft easy to watch films.This was easy to watch no doubt but it just wasn't enjoyable, I feel that's mainly down to two huge issues, cast and writing.I thought the parents were fine and youngest daughter was great but the kids friend were terrible especially the kid bullied by his sister it was just so forced and unfunny. Then the older sister just stunk, pretty girl but just acting that for me was not movie worthy, she was very poor but the main kid was rubbish, how he spoke, his facials and mannerisms were garbage, the line about curling up and dying... aged 12 was ridiculous, he wasn't likeable and that killed the film. He just seemed a brat who's pranks were just plain nasty rather that cute and funny.Robert deniro is class but just looked like he couldn't be bothered here, didn't seem to have chemistry with anyone except his friends who were all fine I guess, he just felt wrong in the part due to just phoning it in. Didn't feel like a deniro masterclassThe writing was bad, it felt nasty and just not fun, wasn't warm, not funny, nothing very new or clever and a host of bad performances made this one to miss or put on in background, even playing with fire is way better than this. The movie not actual fire.Real shame. Kid actors make or break these movies, Matilda wasn't particularly great but the girl was a star. Obviously didn't pan out growing up but as a kid she was, home alone, parent trap etc. Instant family was an example of good kid actors"}, {"id": 147, "text": "Ed (Robert De Niro); is a man at a turning point in his life. The retired builder and widower is forced to move in with his daughter Sally (Uma Thurman); following an incident at a local store.This new arrangement is accepted by the entire family with one exception; Peter (Oakes Fegley) who despises the idea of giving up his room to his Grandfather and having to take up residence in the attic. The fact that Peter is starting Middle School adds to the tension as he and his friends are now the target of bullies as well as his older sister whose disdain for him is evident.Desperate to get his room back; Peter declares war on his grandfather and enters into a series of events designed to harass him into giving up the room so Peter can reclaim what was his. Ed finds the entire thing amusing and his friends Danny (Cheech Marin), and Jerry (Christopher Walken); help him see the bigger picture and support him as Ed gives back even better than he gets. As the conflict escalates' the stakes become higher and the entire family gets caught up with The War With Grandpa.While it was nice to see such an All-Star cast on the screen they are not given a great deal to do in order to stand out as this is a film that is very much aimed at Middle Schoolers and kids in general. I found the humor more amusing than funny and what really bothered me most was the underlying message of the film. In an era of entitled kids who lack respect; the film basically says it is fine to harass your elders to get what you want and that your needs come before theirs. This could have been mitigated with some more balanced humor and perhaps a change of heart but as the film unfolds Peter shows just what a self-centered individual he is.While I wished I could have enjoyed this film more as the premise and cast were great, the lack of laughs and overall message of the film did not work for me making this one for the kids.2.5 stars out of 5"}, {"id": 148, "text": "Sometimes you have to make sacrifices in a family.What a top actor, Robert De Niro. Most of the films in which he played the lead, became film classics. Memorable roles that will still impress in decades to come. From Taxi Driver to Goodfellas. From The Deer Hunter to Casino. Unforgettable masterpieces. The only thing De Niro should have avoided in all these years is comedies. Besides Last Vegas there isn't a single comedy (at least of those I've seen) with De Niro that I thought was worth watching. Lame humor and an irritating storyline are usually the biggest annoyances about such films. Meet the Fockers, Analyze That, The Big Wedding, The Family and The Intern, just to name a few. Every time I felt vicariously ashamed. This is also the case with The war with GrandPa.Let's introduce grandfather Ed (Robert De Niro), who's hopelessly left behind after the death of his beloved wife. Next, there's the concerned daughter Sally (Uma Thurman) who wants her father to move in with her family, regardless of what the family members have to say about that. Husband Arthur (Rob Riggle) is again such a good-natured guy (and obviously Ed has nothing good to say about him) who looks at the whole thing with resignation and grudgingly agrees with the whole situation. Then there's son Peter (Oakes Fegley) who's screwed and reluctantly has to give up his beloved room. And this because grandfather's legs refuse to work properly and so grandpa takes up residence there. Peter has to move to the dusty attic with a roof that's not watertight and where unwanted pets run across the wooden truss. The eldest daughter Mia (Laura Marano) has the least problems since she's living in her own teenage world. And finally, there's the adorable daughter Jennifer (Poppy Gagnon). The only one who's extremely enthusiastic about the new housemate.You can already guess what's going to happen after reading the title of the film. Yes, grandson Peter declares war on Grandpa Ed. The stake is the bedroom he had to hand over. At first, Ed finds it all highly amusing. The written declaration of war slipped under his door is treated with derision. And Grandpa Ed is willfully playing the game. It seems so innocent to him. I don't think it's going to be a surprise when it turns out that things start to get out of hand.I thought it was quite astonishing that famous actors cooperated in this average family film. Robert De Niro, Uma Thurman, Christopher Walken, and Jane Seymour. Admit it, they are not the least. I suppose these actors would also like to experience a pleasant film set with a less demanding, relaxing role instead of a physically hard, intense one. Just like me wanting to have a peaceful moment in the midst of all the horror violence stuff I watch most of the time. The main subject being the clash between youth and the elderly in this movie seemed rather obvious. Unfortunately, there are other storylines that were added and not further explored. Like the love-hate relationship between the mother and her future son-in-law. Or the work situation of father Arthur. The only sidetrack that is gratefully used is the bullying of Peter at school. That was rather funny.The rest of the film is a series of silly jokes those two arch-rivals are playing on each other. The pace at which these pranks follow each other is blisteringly fast. And they are of the level as the April Fools' Day jokes. Replacing shaving cream with quick-drying foam or replacing cookie filling with toothpaste. Well, the movie has its charms. It's a slightly corny comedy. A kind of mixture of Home Alone and Dennis the Menace. Obviously the film aims at a younger audience because my 8-year-old son next to me laughed a lot while watching. I'm afraid I'm not part of the target audience. I guess I belong to De Niro's age-group. But nobody will ever ask me to play such a part.More reviews here: movie-freak.be"}, {"id": 149, "text": "When newly widowed Grandpa Jack (Robert De Niro) moves in with his daughter's family. His grandson Peter (Oakes Fegley) is forced to give up his bedroom and move into the attic.Peter schemes to get his room back and declares war on his grandpa. However Jack is a war veteran and has a few tricks up his sleeve.I first thought this was a sequel to Dirty Grandpa. In fact this is a family friendly movie based on the book by children's author Robert Kimmel Smith.The pranks between Grandpa Jack and Peter are very much in the style of the Home Alone films.Kids would find this movie amusing. I thought it was uninspired, not very funny, ripping off too many other movies such as Dodgeball. It wastes actors such as Uma Thurman and Christopher Walken."}, {"id": 150, "text": "IN A NUTSHELL: Directed by Tim Hill, THE WAR WITH GRANDPA is finally in theaters, after several failed releases in 2017 and 2018 due to the Harvey Weinstein scandal. The family comedy features flying dentures, trash-talking kids, and is based on the children's book The War with Grandpa by Robert Kimmel Smith. In a time of chaos and uncertainty in the world today, it's nice to have a light-hearted, family-friendly film. Of course, it's predictable, but it's a feel-good fun time and we all need more of that. Some people will think it's hilarious; others will think it's silly nonsense and mean-spirited. The trailer shows exactly what you can expect. If you like what you see, go for it. If it looks dumb, skip it.TIPS FOR PARENTS: Some violence Bullying and name-calling There are some phrases I never allowed in my house, like Shut up or I hate you! They're allowed in this family's house. Some alcohol Talk and portrayal of men dressing up as Santa A teenage girl lies to her parents that she is going to study, but she really goes out with her boyfriend. You see an old man topless. There is an extremely extravagant birthday party your kids may want you to duplicate. Lots and lots of pranks. Some people get hurt. Some people break the law. 2 not fully enunciated F-bombs Anatomical terms in Spanish 2 Scatalogical terms 7 religious exclamations In case your child thinks going to war with a grandparent looks like great fun, talk to him/her about how people got hurt and a lot of things were damaged, requiring expensive repairs. Of course, teach your kids about respect.THEMES: Sometimes we have to make sacrifices for family. - Sally (Uma Thurman) War hurts. Lack of respect for people and property Selfishness Parenting kids, caring for aging parents Jealousy Death of loved ones FamilyTHINGS I LIKED: Academy Award winner Robert De Niro is great at both drama and comedy. Despite his controversial political statements in recent years, he's an excellent actor and a fan favorite. This is his second movie starring in a movie with the word Grandpa in it. Watch for the references to his other movies. I haven't seen Oscar nominee Uma Thurman in anything for a while. She's obviously had plastic surgery, but she looks great. The talented cast includes the lovely Jane Seymour, funnyman Cheech Marin, and the quirky, Academy Award winner Christopher Walken. Young Oakes Fegley does a great job and has a bright future in acting. I thought he was so sweet in Pete's Dragon. Good for the parents for having no boys in the house when no parents are at home rule. My parents had the same rule. It's cute how the pranks bring the grandfather and grandson together. There are some scenes that were pretty entertaining like the dodgeball scene, Laura Maran will be most familiar to young audiences from the Disney Channel show Austin &amp; Ally: Chasing The Beat, where she plays Ally Dawson. She sings one of the songs in the movie called Point of War. Keep watching after the first song during the closing credits for some outtakes. There are quite a few running gags throughout the movie. Some work. Others not so much. There are some sweet family moments and lessons learned.THINGS I DIDN'T LIKE: What a bratty attitude Peter has toward his grandfather. When his friend tells him to start a war and fight for what is rightfully his, Peter says, You're a bad friend. He's right. It's terrible advice, yet he decides to go to war, telling his grandfather, You took something of mine and I want it back! The movie trailer did a much better job showcasing the snake scene than the actual movie did. There's some real infantile humor that features Robert De Niro with his pants down twice. The moment when Uma Thurman goes nuclear fell flat for me. There was no epiphany in her eyes, only an instant change of attitude. One of the kids always says crude things. Not all of the humor lands. Some scenes last way too long like the Shhhh scene. I really like Rob Riggle and he does a good job with the material he is given. Unfortunately, as a father, he is emasculated and 100% useless in this movie. The ending was dumb.You can see the rest of my review on my Movie Review Mom YouTube channel!"}, {"id": 151, "text": "The War with Grandpa is a new comedy family movie directed by Tim Hill, the director of The SpongeBob movie: Sponge on the Run and Garfield 2.In the film, grandpa Ed (Robert De Niro) has to live with his daughter Sally (Uma Thurman) as a precaution. Here he gets the room from her son Peter (Oakes Fegley) and he has to move to the attic. Despite the fact that Peter loves his grandfather, he wants his own room back. With the help of his friends, Peter devises plans to expel his grandfather from his room. When Ed realizes what Peter is doing, he strikes back in his own irritating way. This creates a battle between grandfather and grandson, about who can irritate the other the first and thus claim the bedroom.Tim Miller is known as one of the creators of the animation series SpongeBob SquarePants and as a director of animation films. He also brings back the childish SpongeBob humor in this film. Many moments seem a bit unbelievable, but these moments still manage to provide entertaining scenes for younger viewers. If you are an older viewer going to this movie, you better not go there with too serious thoughts for a more entertaining time. If you are still a fan of the SpongeBob series or the kind of humor that occurs in the series, you can also laugh at certain comedy moments in this film, or at least appreciate them a little more.The acting is done nicely by the younger cast, but with some you can see that they are still starting actors. Younger audiences can enjoy themselves a bit more and relate to the young cast. From the young cast comes T.J. McGibbon, who plays a girlfriend of Peter's is the best forward. Still, the older cast provides the most comedic work in the film, especially older viewers. Robert De Niro has done better comedy acting in his other comedies, but with the help of actors like Cheech Marin and Christopher Walken, he ensures good comedy moments in the film. Rob Riggle, who is better known as a comedy actor, comes across less in this film together with Uma Thurman."}], "reviews_amount": 152}