{"name": "The Secret: Dare to Dream", "titleId": "tt04411584", "reviews": [{"id": 0, "text": "Best movie watched over covid. Good family film. Happy sad emotional. I absolutely loved it"}, {"id": 1, "text": "Such a delight to watch a movie about the law of attraction and the power our thoughts have over the outcome of our lives. I've been a fan of Josh Lucas for a long time, so it was a nice surprise to see him in this film. Katie was good to see too. I pray more see this and embrace the idea that our world can be full of peace and love, if we collectively come together to envision that outcome. It's important to recognize we are all connected and pray for the same love.At 11:11 am and pm every day, send love and happiness out to everyone. #floatingkindness"}, {"id": 2, "text": "It is really not amazing but it's pleasant and nice. Some movies make u wanna press the fast forward button but u kinda just breeze through the dull moments. Nice cinematography on some of the scenes and as for The Secret, it's kinda existed in the movie but not forced through."}, {"id": 3, "text": "This is a very beautiful feel good movie. The plot is simple but the presentation is so good that you fall in love with the characters."}, {"id": 4, "text": "I thought the trailer for this looked really good and I always liked Katie Holmes and Josh Lucas but the movie looked really good from the trailer and it did not disappoint. I don't usually rent any movies for $20, but me and my mom really wanted to see it and thought it was worth it and it was! The acting was very good, and I loved the story. It really inspired me too and I just recommend this movie, especially if you may be going through a hard time. It lifted my spirits for sure."}, {"id": 5, "text": "What a nice movie! Very well acted, funny, romantic and uplifting.I read the book and can confirm from my way of life that the quantum physics of the law of attraction, our thoughts create our life, is definitely working. It is not forceful in this movie though, just seeds planted here and there.. gentle and soft like the warm sunshine in the spring..This movie is for everyone, anytime, with or without popcorn! Enjoy!"}, {"id": 6, "text": "Really well done and great story, but it could be a Hallmark movie except for high rated actors. That's why I gave it an 8. Worth every penny I spent to rent it."}, {"id": 7, "text": "Pleasant enough, although the score was quite bland, and detracted from the film. It was never explained why a college lecturer, drove down to deliver a letter, with a boot full of high powered saws and tools, enough equipment to repair a roof. I would warn the ladies especially, if a guys driving round with these sort of tools, ideal for disposing a body, might be worth not inviting him into your house to meet your kids, especially when you find out that he is not a builder, but a lecturer."}, {"id": 8, "text": "This film sounds like they threw words into hurricane hazel and what came out was the script.We couldn't make heads nor tails of what was happening, who the people were, and why were in space at the end.We felt like we were in therapy, with Therapist Bray coming out to play 😂So many questions: why did nana try to eat the ring? Why did the eldest daughter act like no one else knew what s'mores were? Why didn't he just give the envelope to her at the beginning? Why did Bray run like that?And what was with the music in some of those scenes? In one scene we literally find Bray fixing the house to melancholy music - your chopping mate, not putting down your dog."}, {"id": 9, "text": "What a positive message during the all movie! Think positive, because that brings you positive things!"}, {"id": 10, "text": "So the family is struggling financially, and along comes a stranger with a mysterious letter. I was waiting for this movie to finally get released, but once I got into the movie, I found it too predictable. Of course her dead husband left her money. Of course the blonde is his sister, not girlfriend."}, {"id": 11, "text": "I will never get back that 1 hour and 47 minutes of my life. Katie Holmes can't act her way out of a paper bag. Jerry O'Connell was casted incorrectly. The script is lacking substance and the movie never gets going. The end scene is so cringe-worthy, I wanted to crawl in a hole. Katie Holmes also has newly veneered teeth that are now too big for her mouth. She makes weird faces like a kid that just got braces and tries to cover their teeth with their lips. It's weird. This whole movie was weird."}, {"id": 12, "text": "Was waiting for this movie ever since I heard about it. Got to see on the same day it got released. Being an ardent Secret follower and fan, the law of attraction and the major Secret nuances were very mildly sprinkled or applied overall. I would say that, this movie was a decent love story with fantastic cinematography, good performance by the all the major actors. The major cons of this movie is the casting which made a great impact. Starting from Katie Holmes, josh and the kids, everyone played their part very well and we could just move into their story. The background score also needs to be mentioned and went well with the movie. Though the story was straight forward with a predictable climax, never felt bored. Felt that the law of attraction could be more applied or showcased and depicted in the movie. The impact was very meagre in this and couldn't satiate Secret fans. But it's a complete family entertainer and could feel the positivity when the movie ends. It was so light and cheerful!!"}, {"id": 13, "text": "I loved this film. I also loved Rhonda Byrnes, The Secret book so I knew I was going to thoroughly enjoy this. Katie Holmes and Josh Lucas are superb in this film and do a beautiful job conveying their characters positivity, or in Katie Holmes point of view, negativity. It's so nice to see their characters morph into bigger people who see that you can any situation in your life. Just listen.This movie made me smile and literally make she say, awe out loud. I've already watched it many times and will continue too, it's very inspiring.Watch this film!!!! You won't be disappointed I promise!!!"}, {"id": 14, "text": "Sometimes you just needs short story and few characters to show the sweetness of life with all its struggles. This movie has it. Must watch if you need peace during this time."}, {"id": 15, "text": "It is a romantic film for grown ups. It is not a comedy, but a film about real people and real lives. I enjoyed it."}, {"id": 16, "text": "Rented this movie on demand. 2020 has been a dump of a year for pretty much everyone, and I'm really feeling it. Albeit a little predictable, this movie was hopeful, and there was a kindness in it that we just haven't seen this year. If you want to watch something that makes you smile, and remind you that good is out there, it's perfect. The actors are great."}, {"id": 17, "text": "I had no idea when I watched it that this was meant to be a sequel, or that it had any mystical implications, because it really is just an empty, Hallmark style, film about a love triangle.The cast is good, even the child actors are more than adequate, but the movie has nothing original to offer."}, {"id": 18, "text": "I suspect the people who fall for this are the same ones who keep telemarketers and spammers in business."}, {"id": 19, "text": "Josh Lucas is too stiff of an actor for the roles he's been getting. This movie is plot-less. Katie Holmes acted well but she could not save this mess - her character is not developed, no idea why this girl is falling apart, no idea what's going on between the characters, the climax is a screaming match at a birthday party and you're left wondering what the heck is going on. I can't get the time spent watching this movie back. What a complete waste of time."}, {"id": 20, "text": "If you like Hallmark style love movies this is your jam. I found this whole movie so boring......if you want a nap and are struggling to sleep turn this on."}, {"id": 21, "text": "Propaganda movie and nothing more. watch this movie with your pet turtle"}, {"id": 22, "text": "A positive feel good film showing the impact of one's beliefs on your life. All done with a tender touch in the midst of an unfolding love story. Great cast, acting, music, directing and cinematography. Nice to find a sweet film about listening to your heart and dreams that is also uplifting."}, {"id": 23, "text": "Do not watch this movie with children, they will get a totally wrong idea about life. The sentimentality is way too much. Why a guy who has the answer to a families problems in an envelope, something the mother owns decides to play silly bugger with the news is never really explained. One could say he wants her to need him but thats not really the point, either he is honest or not. He is certaintly portrayed as Mr Nicest man in the world. A chessy piece of moviemaking."}, {"id": 24, "text": "I'm sorry but any person can make better scenario better reaction. The story is very prosaic."}, {"id": 25, "text": "What a great film. Acting and story is beautiful. Must see."}, {"id": 26, "text": "Loved this adorable movie! I was always a big fan of Katie's since her Joey days on Dawson's Creek,...in this movie she plays the part so well she wears her acting amazingly!! Her beautiful face portrays every bit of what she is feeling and when she is happy her smile makes your heart glow!! Just wish she would make more movies so I could watch them and feel good!! #katieholmesrocks"}, {"id": 27, "text": "This is so painfully bad! First off she lets her kids insult her in their car and says nothing about it. then when he crashes the car into Bray's truck and he comes back to the house to fix it she just leaves him alone to fix it (for free) any normal person wouldn't just leave him to fix her car for free without joining him outside?! Everyone is going on about the storm like its gonna be some massive tornado that takes up the entire plot of the movie, but all it does is get the floor yet and put a whole in the roof, ( i was expecting the house to be a pile of rubble) later when he is fixing their roof she doesn't stick around or offer to help, she leaves with the kids! in one scene the eldest daughter and Bray are chatting about her party, he mentions smores and she shouts out 'HOW DO YOU KNOW ABOUT SMORES' WHAT! how does he know about smores??? how do you know about cars? WHY WOUDNT HE KNOW THAT SMORES ARE A THING! IM ENGLISH, WE DONT EVEN HAVE SMORES OVER HERE AND I KNOW THERE A THING! Then there's Bray who constantly trying to be smart and philospical? why? it makes the scene super cringey and weird??? when he starts talking about magnets to the kids, like its a new discovery? EVERYONE KNOWS ABOUT MAGNETS!!! we also keep seeing Bray on the phone to his girlfriend, all while creepily flirting with the hotel receptionist (by the way, this is soooo clearly a fake hotel, as this is very much just a nice house where they made one room kinda look like an office/reception) near the end they show that the main female gets a cheque, then they zoom in on the thing but look at the date, not the amount? im watching it as i type this and please please stop it with the weird quotes and phyicopical stuff! every time someone says a quote everyone else turns round and does this look, like randomly quoting mohamid Ali is normal? while in real life if you 9 year old would to suddenly quote einstien people would reply with 'stop being weird!' and another thing, 'The Secret: Dare to Dream' is SUCH a Halmark Movie title! its way too cheesy! thats wrong with naiming it something like 'The roof' 'Dead husband' or 'Will she wont she'??? at one point they all get excited that they found their mail box in a pond, they get excited to open and read it. but you were sent a second copy of this and opened it earlier in the movie? you've already read the letter!! earlier in the movie we see bray fix the roof and install a sky light. sure he can climb a ladder and get a bit of wood up there, but HOW did he get a huge chunk of glass up there without a second human or even a crane!"}, {"id": 28, "text": "Absolutely loved it. this easily deserves a 10 star rating. best 21 million dollars ever spent! bravo bravo bravo!"}, {"id": 29, "text": "Nice pace of a movie. Great story plot. Great acting. A great movie without sex and curse words. A movie about real people dealing with deal problems. Must see"}, {"id": 30, "text": "The Secret Dare To Dream is a 2020 romantic drama starring Katie Holmes,Jerry O Connell and Josh Lucas and is directed by Andy Tennant. A young widow with 3 kids is struggling with her life ever since her husband died in a plane crash,until a mysterious man named Bray enters Miranda's life unannounced. What is he hiding from her ? Could he have known Miranda's deceased husband? Was he involved in the plane crash?. If you love Nicholas Spark type films then do check it out on Netflix."}, {"id": 31, "text": "It was a good movie. I'd definitely recommend it. I love Sweet Home Alabama by this director knowing he made that movie gave me a foreshadowing of what to expect."}, {"id": 32, "text": "It makes you feel bored and surprised that this film was made in 2020 and not in 2002. If you want a good film with a good old fashioned credible story do not waste your time with this film."}, {"id": 33, "text": "Most boring and fake story I ever watched. So fake for all the acting and storyline. Boring to hell."}, {"id": 34, "text": "Katie Holmes is terrible. After all these years, she still acts on sceen like Joey Potter. That scene when she finds he knew her husband. Jeez. I wouldn't have slapped him. I would have wanted to know about every last minute he spent with my husband. So egotistical of her. Better read the novel than wasting time with this awful movie."}, {"id": 35, "text": "I'm really glad some people left nice reviews because this was definitely worth the watch. If you love Sweet Home Alabama and Just Like Heaven you'll love this movie. The performances were really great, and it's just simple and cozy and warm. I can see this being on cable eventually and being one of those movies I just comfort watch every single time."}, {"id": 36, "text": "Many people doubt their capability. Many negative people out there blaming others for their misery. Not knowing they attracted all the bad things to them.Think positive. Ask the universe to give you everything you have wanted."}, {"id": 37, "text": "Early on in the movie I guessed they would end up together. But at one point I wasn't sure and I thought if it didn't end the way I felt I would be disappointed that it built up towards my expected conclusion. Ok, for a nice change we don't have mad sex starved females climbing all over some guy like it seems more than half the movies and TV shows have that as a prerequisite! No car chases, no blood, no guns, a movie a family can watch together When my kids were little, 3 girls and a boy who came a bit later, I used to look for a movie we could all watch on a Friday night, them on the floor in sleeping bags and their mother and I on the couch. It seemed easy enough to find something we would all enjoy and I am glad they are now adults, because I don't see much family oriented movies anymore! I gave it a seven, it can even deserve a bit more. The whole cast of actors are pleasant. Cheers"}, {"id": 38, "text": "If you're old enough to remember the teen drama, Katie grew up and has 3 almost grown kids. She still loves her drama, melodrama and love triangles. Not a bad way to pass off a couple of hours."}, {"id": 39, "text": "A beautiful and uplifting movie with great actors... A breath of fresh air! :)"}, {"id": 40, "text": "I give it a 10 because I started watching it assuming it was worth a maximum of 5. It's warm, uplifting an beautifully casted. It's the first movie in a while I don't feel forced . Despite my expectations of seeing a chick flick, and it does mark some of its boxes , it's worth the view. It wasn't too sweet and the message was nice. Yes, it's cliche at times but for the first time in a long time it felt right. It's a nice movie , not a masterpiece but in a world of Netflix underdelivering it's a pleasant change."}, {"id": 41, "text": "A simple premise, an inevitable ending, but a nice easy ride. I don't know whether it was the direction or the performance but this was not Katie Holmes greatest performance. I was never quite convinced she found her character. Beautiful cinematography rendering idyllic locations. An optimistic sentiment that reminded me of the story of the young girl, gleefully rooting in a room full of manure. When questioned why she was so happy, she replied, With this much stuff in here there must be a pony, somewhere! I give this film a 7 (good) out of 10. {Romantic Drama}"}, {"id": 42, "text": "Its a sort of Sunday afternoon made for TV feel good type of movie, nothing earth shattering here but then again, give some of the detritus I've watched lately, a pleasant surprise. Simple plotline, decent acting and characters you sort of like and want everything to turn out well for them in the end.Its an OK movie and worth a watch on a rainy afternoon - sometimes pleasant is enough."}, {"id": 43, "text": "The premise is that positive thoughts attract positive energy and outcomes, and negative does the same; consciously or subconsciously. This means that the central character is a master manipulator who must've secretly wished the woman's husband dead, which caused the plane crash that killed him. Then he must've meant to meet her and cause her house to be damaged in the storm so he could worm his way into her life, causing her to dump the boyfriend, and ultimately manipulating her and her family to move in with him. And, of course, because this is all just positive thoughts, there is no sense any personal responsibility or effort into making things happen. Furthermore, there is this fantasy that the American dream of wealth and prosperity just happens by wishing; and in fact, the only measure of success in this movie is money. Interesting, seeing as the movie itself made a loss! The whole thing would be laughable if its message wasn't so dangerous. You might as well believe in the force. This type of pseudo psychology is cultish, and like any other cult, needs to be avoided."}, {"id": 44, "text": "Lighthearted movie that's hard not to enjoy. It borrows well worn plot elements from a number of other films, but it all works. Good performances by pretty much everyone in the cast. Josh Lucas has always been a favorite of mine, and he doesn't disappoint.Just a good story with relatable characters."}, {"id": 45, "text": "Enjoyed the movie. Just what was needed during covid. A little hope. I did have trouble getting past Katie's newly veneered teeth. She had nice teeth before and now it's just distracting."}, {"id": 46, "text": "I loved the movie, but took a star off because I think anyone who has never heard of the Law of Attraction might not get enough of a feel for it's importance as depicted in this film. But that aside, this is a beautiful, sweet, feel good movie. Katie Holmes looks very different, from what I remember. If I had not known she starred in it, I would not have known who she was. This movie flowed so smoothly. Never boring, and was sad to see it end. I do recommend if you are a fan of the Hallmark Channel type of films."}, {"id": 47, "text": "Awwww I love a good story. Very inspirational. Makes you think about life and how you live it!"}, {"id": 48, "text": "My husband and I stopped at Redbox in search of something entertaining to watch. We are suckers for a nice romantic movie and this didn't disappoint. Such a touching story and the chemistry between these two was perfect."}, {"id": 49, "text": "So before I watched this I decided to check the reviews because I don't have nearly two hours to spend on a duff film. The critics said it was terrible but then I decided that critics don't write for the viewer, they write for companies and the viewer doesn't care about that, so I gave it a shot and I loved it. Excellent acting and a great storyline which kept me engaged all the way through. Beautiful morals and so good to find a romance which was true to romance. So I've decided to always check what people say about films and not what critics say because let's face it....they're paid to be critical! So enjoy the film and the lessons from it!"}, {"id": 50, "text": "I've been dying to see this film from the first time I saw the trailer. I wasn't disappointed. A true Family Movie that wasn't being Preachy. I was a bit worried in the end only because I'm a pessimist at heart. We should all Dare to Dream. I highly recommend this Movie. 🔥🔥"}, {"id": 51, "text": "As someone who believes in the Law of Attraction and loves the original movie The Secret, I was really looking forward to watching the principles come to life in a real story. Unfortunately the story line was flat and predictable.I was looking for the main character to experience deeply profound and mystical attractions and manifestations. Instead, we're given a cheesy love triangle story that only hints on the very basics of energy and attraction.It is a shame the movie was not able to debut in theaters and I understand their decisions, but $20 to rent a movie at home only added to the pain and suffering of watching this movie."}, {"id": 52, "text": "Really, really bad. Half of the sceens don't make any scence. I don't have much more to say. It's just a bad movie."}, {"id": 53, "text": "As many people have mentioned, there were so many questions left unanswered while watching this movie. Like how could she leave the keys to her house to this random man with the logic he's not a serial killer because he's a professor like whaat?? And how did he fix the roof by himself like that so fast? Why did Tucker open up his life to a stranger? Why did the 16 year old act like a 7 year old and want a kid's birthday party whom she invites a middle aged man to? Why did she think people didn't know what s'mores were and how did not even the actors question it? Why didn't they know anyone besides Tucker and the mother in law? The line I now know that I can get whatever I want which I realise is the premise of the movie, is just such a misrepresentation of life. And the pony, just when I thought it couldn't get any worse. This was definitely written by some upper class middle aged hallmark loving woman who has no concept of reality."}, {"id": 54, "text": "Very nice, feel good, inspirational. Doesn't have a big budget feel, but has a core. Like whole wheat bread vs cheese puffs."}, {"id": 55, "text": "When this movie released, i expected a lot from this film. I thought it would be a law of attraction based film. Guess what!? 1h47min of my life wasted. This movie could be better. I didn't find it inspirational at all. All the dramatic cringy story finished by an unexpected love story!🙂"}, {"id": 56, "text": "Kind of film you might stare at on a rainy afternoon when you just can't be bothered with anything. Clearly aimed at the sort of person who believes in star signs it stretches all belief from the start. I can't be bothered describing the whole film but at one point Josh (or Jesus?) describes the law of attraction by holding a magnet so it attracts a paper clip 'what you think about the most will be attracted into your life declares Jesus i mean Josh. He asks the kids what they want most, the describe the Pizza and topping they most desire (mum had denied them Pizza because of money worries) and guess what at that exact moment there is a knock at the door and a Pizza man delivers exactly what they wanted. This film is mumbo jumbo aimed at those who don't want to live in the real world, nothing wrong with that but if you waste your life believing in this BS then that is very sad."}, {"id": 57, "text": "So boring... cheesy dialogues and scenes... something was really off just glad I realized it early enough so I don't feel like I wasted too much time on this one here :/"}, {"id": 58, "text": "A refreshingly happy movie with a great cast. You'll easily develop a crush on Brey and enjoy thoroughly disliking Bobby, the mother-in-law. You can actually feel the character's giddiness as the movie progresses. There are several life lessons dispersed throughout. I'm not usually a fan of this genre. But, this is a winner! Kid friendly. This movie leaves a smile on your face and joy in your heart."}, {"id": 59, "text": "The movie was based on the book and movie from 2006, called 'The Secret', that faced a huge succes in that time, based on the whole idea of how certain thoughts can change your direct life.The idea behind the movie was fine, decent, but I found the way the actors portrayed it really boring and not thrilling at all. The whole script was clicheic and everything was way too easy to predict. The film had no suspense at all, and the only thing I found interesting about the movie were some of the lines of the characters, repeating some of the core ideas of the book I mentioned.The place was nice, the scenery was great, but as I said earlier, it was wasted on bad choices of acting, directing and plot."}, {"id": 60, "text": "I read the books years ago and I love Katie Holmes, so figured I would try this. It was surprisingly pretty decent. The dialogue was a little corny in some spots, but overall felt natural. Josh Lucas always has something charming about him. The kid actors were good, especially the son. A feel good movie that makes you think about life without being over the top about it."}, {"id": 61, "text": "First and foremost, I would like to applaud this well done and well executed movie. Katie who typically underwhelms with most her movies actually turns in a good performance as the widow in financial trouble. Josh with that signature smile and blue eyes turns in an excellent performance as the secret angel. The movie's premise after some quick reveals is Josh is delivering very good news to Katie and family. The movie moves a good pace and doesn't get stuck. The quick reveals gives the real reason for Josh's visits and sets up the conflict of the movie when Katie's character confronts him. Of course everything resolves itself, Katie breaking up with a fiancée and deciding to live her life. It gets wrapped up at the end aka Hollywood style. It was a very good movie and the performances were good. Hallmark should take note on how to not make disgustingly sweet and over produced movies."}, {"id": 62, "text": "As an avid fan of the secret and studying it since the books came out, it was a shame to see the movie missing the key messages. Gratitude and giving thanks being the main ones. Yes there was reference for the I want oppose to I dont want but the law of attraction and the secret is more than that. Its changed my life with the daily practices which I give daily thanks too.The film is a lovely romantic story and gives the audience a view of helping others sometimes in reward brings happiness in return. Acting was flat in places but a perfect Sunday family movie if you have time."}, {"id": 63, "text": "This is a horrible message to send to anybody. The plot is based upon a committed woman choosing to fulfill her own commitments balanced against a man with his own commitments. Guess what? Both fall short and choose one another mid-commitment rather than resolving their relationships before leaving. Disgusting, really. Just gives both characters permission to do what they want no matter the wreckage left behind."}, {"id": 64, "text": "This is like those candy sweet Christian movies, where you feel the J word coming from miles away.Except it is not about the Lord but about the Law, of attraction. And I like that law, so the whole cheezy storytelling to explain the Secret, still gave me a good feeling."}, {"id": 65, "text": "I enjoyed watching the relatively unique friendly universe and meant-to-be attitudes included in the story. I noticed a few creative cinematography choices, which were interesting, and the soundtrack fit very well. It did feel a little bit like a Hallmark movie (but I don't mind!) except with a bigger budget and noticeable product placement which was kind of funny. The superimposed text messages and phone calls on the side of the screen were a bit disorienting and strange. I did recognize and appreciate some aspects similar to The Notebook, Sweet Home Alabama, and Home Again."}, {"id": 66, "text": "Good movie with good message. Stay strong, stay healthy, stay positive. All we need these days..."}, {"id": 67, "text": "Not for cynical people. Great movie 🍿 would watch it again"}, {"id": 68, "text": "Predictable from the getgo. If you love Hallmark movies you will love this. It was so predictable I found it very boring. And I paid $5.99 when I could just watch the silly Hallmark predictable movies."}, {"id": 69, "text": "Dave Chappelle Interpretation of this formula is brilliant and breathtaking"}, {"id": 70, "text": "Predicable. Could have used more twists and turns in the plot."}, {"id": 71, "text": "Cmoon Josh...This is a filler movie. Classic hallmark movie, but is based off a self help book which gives the whole film this odd undertone of if you want something bad enough you can manifest it into being. Weird."}, {"id": 72, "text": "I mean you can, if you really don't have a better plan, or if you read all the positive reviews and just say ok i ll watch it.. but don't, just don't, completely pointless"}, {"id": 73, "text": "If you are looking for a movie that leaves you refreshed mentally after viewing, centers around wholesome moral values and a lesson on good human relationships this movie fits the bill. While not being classified as a christian movie it lends itself for a God fearing Christian to viewing without offence."}, {"id": 74, "text": "A romatic Mills and Boon style movie, pleasent enough for easy watching if from the outset you can see just where it is going. No raging or bashing or nastiness at all. All very calming actually. Worth a watch if you feel like a movie with a story as against so much of the fling it in you face stuff out at present."}, {"id": 75, "text": "This movie is so predictable and cheesy. I have no idea how the reviews and ratings are so good. The cast, script, cinematography were so mediocre. If you want something super easy and predictable to watch then go for this. Netflix is starting to annoy me with all it's cheesy hallmark style movies with no real substance."}, {"id": 76, "text": "I have read The Secret far before I saw this movie. Honestly, it did not ring any bells about the book itself, but still, the movie was inspiring and worth watching to have a good time. To me, it was more of a romance rather than a message, and one to relax after a hard day. The movie is quite predictable, ie, you can imagine the happy end. But you need to watch movies like this from time to time. After all, movies are produced to make the audience feel good at the end, and this one serves the aim. The story flew smoothly, characters were natural and the fiction was elegant. Good job."}, {"id": 77, "text": "Life is hard, but it can have its moments, is the lesson shared in this simple, yet beautiful movie. The movie isn't heavy handed, but gets the point across that with the right attitude, positive can change. Then, it adds a cherry on top. I spent zero time surfing in my phone during this movie, which says how engaging it was."}, {"id": 78, "text": "Holmes' performance surprised me; it was very well done. She made Miranda pop, and so apropos in her situation. Lucas (Bray) added on mystery and charm to let us went with the plot. Miranda's family was cute. Despite it was packaged under some sort of pseudo-psychology, The Secret, it was more subtle than I expected. This is way better than any cheesy melodramatic films by Nicholas Sparks. And I am sure."}, {"id": 79, "text": "So the woman stays a few years with a guy who does everything for her, then ditches him and falls in 'love' with another guy she met a few days before??!"}, {"id": 80, "text": "The Secret: Dare to Dream is a heartwarming drama that seeks to demonstrate the theme that life is a miracle. The message was only minimally Christian in its orientation, as the focus was on a benign universe always willing to open doors for those perceptive and courageous enough to walk through them to discover genuine happiness.Miranda Wells is a widow living in Louisiana with three beautiful children, Missy, Greg, and little Bessie. It has been five years since the death of her husband, Matty, who was a dreamer. As an inventor, he never hit the jackpot on any of his projects. Now, Miranda, who works in the nearby Middendorf's fish joint, is leading a hardscrabble life and may have to sell the beloved family home.Into Miranda's comes the most intriguing character in the film, the smooth-talking Vanderbilt engineering professor Brae Johnson. Brae is not only a charmer, but he also has words of wisdom for everyone after a miraculous experience spared his life and gave him an entirely new outlook. He wins over all of the kids, especially in giving Missy the idea of the taffy pull as the pretext for her sixteenth birthday party.The only mistake made by Brae was in being slow on the trigger to inform Miranda about the reason for his visit to her home and the nature of the mysterious contents in a manila envelope. Part of the problem is Bobby, Miranda's controlling, but well-intentioned mother-in-law, who always seems to be the spoiler when Brae needs a few minutes alone with Miranda.Sadly, the big loser was Tuck Middendorf, who publicly proposed marriage, yet eventually lost out on the sweepstakes for the hand of the widow Miranda. Brae was apparently living with a woman, and one of the best moments in the film is the revelation that the woman is not not Brae's live-in lover, but his sister!At one point, Miranda is physically abusive to Brae. But all is forgiven in this endearing, family-oriented melodrama. The last barrier falls down when it becomes clear that the two little ships passing in the night will be able finally meet alone at the Waffle House where they will dare to dream together."}, {"id": 81, "text": "Take a world self help best selling book about making your dreams come true, create a cheese movie around it with no real depth and this movie is the result.Just like that, nothing more nothing less."}, {"id": 82, "text": "A nice drama. It is about a man who comes to town to deliver a strange envelope, but not finding the recipient at home, a series of events causes their paths to cross and their destinations change, leaving the envelope aside. Entertaining Quality. They try to carry it with a slight mystery with the contents of the envelope that makes you stay until the end. It talks about the value of family, helping others, giving ourselves to others, generosity, but also positive thinking that in the end what we think is what we attract. Light and pleasant jokes. The plot is more of a family situation. Nice. Comforting"}, {"id": 83, "text": "I Loved this show! Heart-warming and loving! The message of positivity and looking for the best is really relevant. I know that when I am down on an area, I avoid thinking about that area and taking action to change it. Creativity is shut down and my ability to see new potential solutions for a problem that I am facing is severely weakened. This movie lifted me up and had me look at the world with a little more positive expectancy. Especially valuable in this time of fear, isolation, and loneliness. A movie for the whole family."}, {"id": 84, "text": "Ok not my normal choice for a movie but she wanted to watch it. :). It was ok. Story is a feel good script, bit predictable. Almost every part of the storyline that was supposed to be a surprise, I predicted before it happened. It is well casted, thought almost all actors were well chosen. Does have religious undertones, talks about a god being in control. Also a reason I took off a couple of stars for that. Atheist and don't have any use for god in a story line."}, {"id": 85, "text": "Rented this movie this weekend. Have watched 3times so far. Josh Lucas has always been my favorite. He and Katie Holmes are perfect in this movie. The children played excellent parts. Long time since enjoying a love story so much"}, {"id": 86, "text": "I love a feel good movie. The story and the actors were great. Also, a good reminder about that we should focus on what we want and not on what we don't want. &lt;3"}, {"id": 87, "text": "A good movie, with a believable plot and storyline. I'd like the acting, the beautiful imagery and the convincing story-telling.Here and there a little cheesy, but hey : This is probably to be expected in that kind of genre.Loved it, tough. Would totally recommand this to be one of the better movies in 2020. Thumbs up!"}, {"id": 88, "text": "I hesitated watching this because the trailer felt like a bible production. But I gave it a go and did enjoy it during a sleepy Sunday afternoon.Both the lead actors are strong and I believed the connection. The standout for me was the son. A unique look and good actor.The story was a pile of cheese loaded with a side order of more cheese. The reveal was guessed within the first 10 mins of the film but it didn't ruin anything. There is nothing new in the story but the coincidences from the positive thinking were funny. The core message was strong and helped carry the story.This film is recommended just for the chemistry and the message. If it helps one person then that's great."}, {"id": 89, "text": "Kind of a predictable movie. Poor widow with children is visited by man who worked on an idea with her late inventor husband which became profitable. He's there to give her husband's share of the money to her and they end up falling in love. Watched this with male and female friends. Many comments from I'm just glad she found a man to take care of her to they should have made the movie about how a woman can stand on her own two feet without help from a man. Other comments included that Jerry O' Connell would have made a better Bray and Josh Lucas would have made a better Tucker. One other comment was the ending could have been better. It was nice but not great. Overall a feel good romance movie but that's it. Nothing really new."}, {"id": 90, "text": "So refreshing to see a movie with no sex and no profanity. Katie Holmes plays a widow with three kids, a run-down house, an overbearing mother-in-law and no money. Josh Lucas turns up with some mysterious news which we don't learn about Until near the end. In the meantime he helps around the house, brings coffee .... you fill in the rest. The characters were believable, the pace was perfect, and there was good chemistry between the main characters. Thoroughly enjoyable."}, {"id": 91, "text": "I never left a review wanted to like this. I love Holmes and Lucas, but this is dreadful. How many talented directors and screenwriters don't get a chance to make a movie, and why we're doomed to watch garbage like this?!"}, {"id": 92, "text": "Weak plot and performances where so much can have been done with just the concept of The Secret Boring and slow till the end, which is also lousy."}, {"id": 93, "text": "If you are in a bad place in your life, and found this film somehow meaningful, please please please remember not to take it too seriously. Even more importantly, keep in mind that charismatic people don't have the answers, they just seem like they do. While that may seem almost magical, especially if you yourself are at a weak spot, in reality it is the dark side of charisma."}, {"id": 94, "text": "Nov 14, thought to early to start watching Christmas movies yet, so gave this a try. Good substitute, it's not some amazing story or script but it's just a nice story, actors I enjoy (most wouldn't deem theme good), reasonable runtime, nice happy ending.so if that's what your looking for give this a try, beats the hallmark movies."}, {"id": 95, "text": "Perfect movie to watch during covid. Uplifting. Cheered me right up"}, {"id": 96, "text": "Firstly. I really like Josh Lucas as an actor for his charisma. He, as usual plays a very likable character in the film. and Katie Holmes and others all did very well also in their respective roles. Now, the original book and Oprah raised its theme of the power of positive thinking to cult status, but fortunately Josh Lucas makes the movie palatable. Outside of that, I found the movie enjoyable enough."}, {"id": 97, "text": "OK, so this is a bit twee - but there is a little chemistry between Katie Holmes (Miranda) and Josh Lucas (Bray) that just about manages to keep this on the right side of sentimental. She is a widow living in her dilapidated house who has a near miss in her car with Lucas whom, subsequently, manages to bond with her three children over a pizza (paid for by her boyfriend, the industrious but rather hapless Tuck (Jerry O'Connell)). When a storm blows a tree through their already leaky roof, he offers to help out and... well, you can imagine the rest. The plot offers nothing new, though there are a couple of rather unlikely twists as we proceed down a well trodden path of romance and serendipity. Celia Weston adds a little extra as her rather sceptical mother Bobby and at times is has tiny echoes of It's a Wonderful Life (1946) bubbling underneath that make it an easy, if completely unchallenging watch. One for the telly at Christmas - uplifting and both stars do their jobs."}, {"id": 98, "text": "Think the positive reviews here're from people into the self help positivity stuff. The movie has less complexity than a Mills and Boon or a Hallmark Christmas movie. Every now and again Josh Lucas' character spouts some lifestyle crap but it is cliche after cliche, stereotype after stereotype. The secret of the title is nothing that surprising, but in the plus side, it's looks pretty and is undemanding. In this 2020 COVID year, white bread mediocrity is sometimes ok."}, {"id": 99, "text": "The slap in the birthday party was not realistic tho. katie respect josh too much :)"}, {"id": 100, "text": "I don't know why but this movie touched my heart. I am the only child and I always wondered what it's like to grow up in a big family. The warmth of the characters and the lead actor's peaceful attitude impressed me quite a lot. I also believe you get what you ask for in life. If you truly wish something from your heart, if you have a good heart, it will happen sooner or later. In conclusion, I highly recommend this movie for a wonderful evening."}, {"id": 101, "text": "Watch at least until you hear the Einstein quote, then decide if you want to keep watching, I did, you probably will too."}, {"id": 102, "text": "Just the sort of film to watch during these difficult times. Excellent story and great love story. Well worth watching"}, {"id": 103, "text": "Well crafted film, dialogue was a bit thin and subtext could have hd a little more involvement too. Very enjoyable with more than one message."}, {"id": 104, "text": "Best movie in a long time just as good as the notebook."}, {"id": 105, "text": "A great movie with a depth, really inspired me! Good actors and great story, watched it twice already! &lt;3"}, {"id": 106, "text": "I am a huge fan of Josh Lucas I really enjoyed this movie, I am mostly a action kind of guy film/movie But this movie I thought was a great chick flick. This movie wasn't that bad. It's a good movie for the whole family"}, {"id": 107, "text": "Thought provoking good acting story enjoyed the lightheartedness of it..enthralled by the unexpectedness of it..thumbs up"}, {"id": 108, "text": "If you want to feel happy and like anything is possible, watch this. I loved it. It made me happy and full of positivity."}, {"id": 109, "text": "I just wanted to see this movie in hindi language. Thanks,"}, {"id": 110, "text": "I love this movie...i saw the secret documentary movie too❤ Now be came this movie one of my favorites😍"}, {"id": 111, "text": "The movie was pretty good, but couldn't they pick a hurricane in the same century and location that the film would have had to be. Also, there were no cell phones in 1954, when Hazel devastated the Atlantic coast."}, {"id": 112, "text": "This movie surely tells you how you can always hope for something good even out of a bad situation."}, {"id": 113, "text": "Loved it, finaly an old fashion feel good movie. The message is clear and the characters are lovely casted."}, {"id": 114, "text": "This is a movie for the whole family, with a great plot and fabulous location in the deep South town of Madisonville, Louisiana, situated on Bayou Tchefuncte."}, {"id": 115, "text": "Having looked up Lucas' life on line it occurs to me that the person he plays in this flick, Bray Johnson, has very much Lucas' own personality. Must have been an easy role for him. NOT A CRITICISM, JUST AN OBSERVATION."}, {"id": 116, "text": "Ok honestly, i really hate the kids in this movie, especially missy. her stereotype seems so overbearing and i hated her character. most of the dialogue in this movie is pretty boring as well. the story was pretty weak too, with much of it feeling out of place or forced. Pacing was alright. the beginning of the film went fine, but near the end it really started to drag. the only thing that i kind of liked about this movie was bray, and his development throughout the movie. otherwise, i really wouldn't recommend this movie. there's plenty better options in this kind of genre of film."}, {"id": 117, "text": "I had a friend buy me a copy of The Secret, the Rhonda Byrne self-help book. It was well-intentioned, but it felt like the New Thought of the past and a sanitized version of Chaos Magic that didn't work quite as well. But hey - everyone needs something to help them get by, and like I said, the thought was in the right place.Now, the book has inspired a film which I can only imagine will be the first of many.Director Andy Tennant knows romcoms. After all, he was behind It Takes Two, Fools Rush In, Ever After and Sweet Home Alabama, the kind of movies that the lady in your life wants to put on any time they show up on a Sunday afternoon (and you'd be the jerk wanting to watch The Replacements again).Miranda Wells (Katie Holmes) is the kind of hardscrabble, yet gorgeous, widow that these movies are all about. She's raising three kids on her own but a storm blows into town and she has to hire Bray Johnson (Josh Lucas, who was in the aforementioned Sweet Home Alabama) to help fix things up, which includes her life and her family. Bray is pretty much The Secret in human form, because he's a positive thinker, as well as someone that has a mysterious past that could ruin everything.Don't you just hate the third part of the hero's journey?If you're already in for the 90's stars in this, Jerry O'Connell shows up as well to seal the deal.There was another movie version of the book in 2006, but that one didn't have romance, a storm or Katie Holmes trying to raise kids. The universe talked to me and told me not to watch it. However, the universe did tell me to watch this, as we got a screener in the mail and it felt like I was watching too many slashers and perhaps it was time to watch a family-friendly movie about the power of positivity.Now, for you moment of meta, sponsored by the IMDB trivia page for this movie: Josh Lucas played Mitch McDeere in the television adaptation of The Firm, a role originated by Holmes' ex-husband Tom Cruise.Now, back to The Secret. I feel as if my movie writing is now a success, as I have been able to convince movie studios to send me films to get my expert opinion. Most of my opinion is based on how much I love movies where people are menaced by gardening implements. That said, when this crossed my plate, I knew that I had finally achieved something worthwhile.Then my wife said, Why do you want to watch this movie?So I explained The Secret*somehow combines the Protestant teachings of Norman Vincent Peale with the Theosophy of Madame Blavatsky to create a theory that you can reprogram reality without needing to make sigils or set things on fire or masturbate. Then she stared at me even longer, wondered why she married me and went out to smoke a cigarette.*The movie does this with pizza magically arriving when the children wish it in existence. Maybe I'm being too hard on this book, because if I can conjure pepperoni and extra cheese slices into being, I might have to get more serious about this."}, {"id": 118, "text": "A little too Hallmarky to earn more stars. Initially, I couldn't get past the fact that everyone suffering in the 1954 Hurricane Hazel is driving around in 2020 cars and talking on iPhones. As one who looks for the little continuity errors, this big twist of history took too much from an already unbelievably predictable plot. The only surprise is the constant question why are they doing that? over and over."}, {"id": 119, "text": "Soooo cute. Ok very cliche and all that but a few small plot twists but awwwwww is all I can say. give it a shot guys. What else you doing today? Nothing. Might as eh"}, {"id": 120, "text": "It's been a while but I already feel like a second helping.Light without being airy, this adaptation of a novel about people, family and personal struggle is well done in a genre that of late is usually either under or overdone.What makes 'The Secret' stand out is the evocative rawness, the non-verbal glimpses and the overall ability of the cast to tell a tale without ever looking like they're trying. It just flows and carries you along with it.The result is a movie so charming and inspiring that it begs to reverse the usual trend of Hollywood remaking cinema europa gems. 'The Secret' will hold its own in any setting and language.See it."}, {"id": 121, "text": "Do you have a bad day? Or maybe every day is your bad day. Or maybe everything things around you gone bad.Suddenly, one day someone came to your life. Reorganized everything from scratch. Make you believe, that whatever you have, can be changed. All you need a little wait.This movie is not just a love story, but a story of a secret, that you should find in yourself.A little more than a life lesson but not that boring.From the starting to the end, you will find all the mess of middle-aged women and her messy life with a little romance, family, and more.And trust me you will find all the answers if you believe you are a mess.The screenplay, sound, suspense everything in its place, where it belongs to.It's more than a thank you to the director Andy Tennant. A huge hug for Bekah Brunstetter for the screenplay.And lots of love for Rhonda Byrne for writing this beautiful story."}, {"id": 122, "text": "The beautiful thing about the movie is positive vibes. Like the whole time of watching this movie, there is a smile on my face. Enjoy the most out of it.We people don't know the value of things we have in our life because we are always complaining about not having other things. Especially in this situation of Covid19, whole citizens of the world are in their houses on a long vacation. Where we must enjoy these moments with family, friends, and loved ones, there we are not even happy. But all time we just want to go back on the same routine for everything.Be grateful for what you have now. As you begin to think about all the things in your life you are grateful for, you will be amazed at the never-ending thoughts that come back to you of more things to be grateful for. You have to make a start, and then the law of attraction will receive those grateful thoughts and give you more just like them.The Secret is what makes us learn how miracles happen. If believe in ourselves we can change things. We must also be happy with everything we have. This attitude of gratitude can change our lives. If we just believe and work on it.There is a truth deep down inside of you that has been waiting for you to discover it, and that truth is this: you deserve all good things life has to offer.We all humans are very lucky because we have life. Beautiful life so that we can see the beautiful world around us, spend some time with the best people. Enjoying your life is living your life. We must don't let people down. Because in one way or another they are playing their best roles in our life. It is us who put them into categories of good character or bad. This movie shows being positive and helpful can give you more in return.Believe in yourself and be grateful always.Don't just let go of things even, because those can be miracles. If we consider them as. Things happen to us because they are for us. To change us, to show us the things we never see in that way before.I think the movie has a little more suspense of romance but it's okay. Movies can be a little different than books. Because it's not in narrative form.The moment you will finish watching this movie, you will feel good and positive like l do. I bought from Amazon and I think now I am happy with my investment.The truth is that the universe has been answering you all of your life, but you cannot receive the answers unless you are awake.l must say that it's the best movie. So, watch it as soon as it's possible. You will enjoy watching this movie."}, {"id": 123, "text": "The Secret: Dare to Dream is a new romantic drama directed and written in part by Andy Tennant, the director of Fool's Gold and Hitch.The film is about the young widow Miranda Wells (Katie Holmes), who tries to make ends meet and take care of her three children. A devastating storm causes damage to her home, which only makes life more bleak. When she runs into mysterious man Bray Johnson (Josh Lucas), her life seems to be changing in a positive way. Bray offers her a helping hand in a positive way with all Miranda's problems. Bray tries to convey his positive energy to Miranda and her children, but as Miranda starts to spend more time with Bray, she learns that he is also hiding something from her.With this film they have trouble telling the message that life is or will get better if you go through it in a positive way. Despite this good report, the film is not much special and can quickly become predictable. The story also quickly becomes a bit repeated, because with every negative thing that happens in the film, Josh Lucas offers his character a helping hand over and over again to make the situation positive.Katie Holmes does good acting as a woman going through a rough patch, but doesn't do anything remarkable with this role. Josh Lucas does come across well as someone who tries to live life in a positive way and lends others a helping hand when they need it."}, {"id": 124, "text": "Widow Miranda Wells (Katie Holmes) struggles with 3- kids and many bills. She literally bumps into Bray Johnson (Josh Lucas) by hitting his truck when distracted. Bray offers to help put part of her car's grill back. Bray was on his way to meet Miranda Wells and to give her an envelope. The storm hits and part of her roof now has a hole. Bray offers to help again and does so, but he notices the mail box where he put the envelope has blown away.Bray interacts with all the kids and they like him a lot and they notice that Miranda seems more alive when he is around. Contrast that with mother-in-law Bobby (Celia Weston) who wants Miranda to marry Tucker (Jerry O'Connell) who owns the seafood restaurant where Miranda works. It would seem that Bobby is a busy-body, but she just wants Miranda to get out of trouble with bills, a house falling apart while rearing her kids.Josh Lucas needs to be in more movies as he has a way of saying things you believe without reservation or hesitation. In here he gives many life lessons when interacting with the kids and with Miranda, and does it a very gentle way.The Problem: okay here goes: Miranda later finds out that Bray knew her late husband who invented something and Bray takes credit for it.But we all know the real problem is that adults don't really talk to each when it is absolutely necessary to do so. But - as you know - if they did we wouldn't have a story. Ha, the story of life, don't you know?Some might say there should have been more chemistry between Bray and Miranda, but times are different and I think each played their roles as expected. Both gave excellent performances.Then son Gregg (Aidan Pierce Brennan) finds the blown away mailbox and now Miranda knows the truth.Now all of you who saw the movie to the end want to say something and what you want to say goes something like this: We didn't want the movie to end. Agreed? Thought so. My job is done. (9/10)Violence: No. Sex: No. Nudity: No. Humor: Yes, in a way. Language: No. Rating: A"}, {"id": 125, "text": "TAUGHT: Me About Myself Dealing With The Most Unexpected Throughout LIFES Many Challenges Leading Up To My Dreams, Wishes, And Thoughts.THIS: Movie Also Had Taught Me About All Of What Has Happened Throughout Much Of My Life While Being Mighty Grateful For What Is In Front Of Myself.ALSO: Learning To Work Really Hard For What Those Many Skills And Experience Can Create No Matter How BIG Or SMALL.IN: 2015: My Life Had Crashed Down On Me. MY: Dad Had Been Evicted From His House Due To Health And Environmental Issues. PLUS: There Was Some Not So Wonderful Influences Involved Concerning The Tenants And Roommates Living There. WHICH: Became An Issue Concerning Myself Involving Such A Living Arrangement After My Mom's And Sister's Passings."}, {"id": 126, "text": "I'm sort of a kid at heart when I watch a movie filmed in places I have been. A key location in this one is Middendorf's seafood restaurant in Manchac, just north of Laplace where I used to live.There is a hurricane coming and Katie Holmes, kinda broke widow Miranda Wells, and her three children ride it out but not cleanly. A large branch crashes down making a big hole in the roof.At this same time someone is hunting her down, Josh Lucas as Vanderbilt Engineering professor Bray. He has a mysterious envelope for her, we suspect it is something really good, related to a project Bray and her late husband were working on, but the storm interrupts the process. But Bray volunteers to help make repairs and in the process has a positive impact on her and the three kids.This is mostly just a nice, pleasant movie with pleasant characters. I don't say that with any disrespect, I like this type of movie and find myself wishing more of them were available. We found this one to be very enjoyable.My wife and I watched it on Amazon streaming movies via Roku."}], "reviews_amount": 127}