{"name": "A Babysitter's Guide to Monster Hunting", "titleId": "tt04844150", "reviews": [{"id": 0, "text": "I see people are being harsh about this film but they need to remember that its aimed at children. There are a few kids films that got bad reviews back in the day like Hocus Pocus or scooby doo spooky island which nearly every child loved but since its adults doing reviews they got bad ones. We need to think of the target audience and i think that children would really love this film its fun and for them a little spooky which they will like. Tom Felton is was the stand out in the film , his acting was superb as always"}, {"id": 1, "text": "This is a good movie for kids! As mentioned in the other comments the gci monsters could've been better. I think Tom Felton did a great job. The end is predictable but so is every kids movie. Not to keep talking about the other comments but the movie isn't terrifying or scary but yet again it's for children. Overall I thought it was a good movie. I hadn't seen this concept before which was cool!"}, {"id": 2, "text": "First things first: Tom Felton shines in his role! Also I appreciate them making a movie about a diverse team of kids solving problems as a team using their knowledge in different areas of science. Great if you watch it with kids, since it's a joyride for everyone. Got a few scares and a lot of laughs out of me!"}, {"id": 3, "text": "Nice movie for kids . every kids should watch this in halloween month. awesome story and we hoping for second movie of this"}, {"id": 4, "text": "Literally EVERYTHING about this movie is a cliché... Every scene, every action, every character... The characters are boring and flat. The main character its just a mary sue. The story is like every Netflix movie... Idk if Netflix is even trying at this point, all their teen movies are the same movie but with different cast... And this is just a kids adaptation of that. Your kids have A LOT of things to watch on Netflix before this generic movie"}, {"id": 5, "text": "If you are anything between 5 to 10 and you are a girl, you might like it. Not suitable for anyone else. At 12 I remember watching horror movies like Friday 13th and Freddy. There is no adult in the movie for more than a couple of minutes all included and is painful to watch in family. Another hit and miss from Netflix. The idea could be good, but the exectution is mediocre and only the character of Oona Laurence is somewhat decent. Compared to Hubbie Halloween this is a masterpiece, however. But it doesnt deserve the thoughts of franchise that the cliffhanger indicates."}, {"id": 6, "text": "So I've seen stupid TV show and movies, but this is definitely the most unprecedented the dumbest I've seen. It is difficult to compete with this kind of idiocy!"}, {"id": 7, "text": "We watched this as a family with our 6yo boy. It was fun like Hocus Pocus, Nightmare Before Christmas, or Coraline. It is nearly as good as Hocus Pocus, but not as good as Nightmare or Coraline.The scary elements are on par with the three titles above. The acting was great by lead actress. There was humor involved with some of the monstersOverall it was a fun film, and exactly what I wanted to watch with the family this October"}, {"id": 8, "text": "Seeing reviews here saying that we have to remember that this was a movie for kids.... but even my kids didn't wanna watch it after a half and hour 😅"}, {"id": 9, "text": "Loved it, had the perfect amount of horror and Comedy. Perfect for someone who is new to horrors as it's not too scary."}, {"id": 10, "text": "..and it sucks. Terrible acting, terrible writing. Terrible everything. There are a lot of good children movies out there but this one is just bad. Saying Tom Felton's acting was superb is astonishing to say the least. I can enjoy a good children movie but there is absolutely nothing enjoyable about this one. Nothing."}, {"id": 11, "text": "Rachel Talalay showcases her great eye for a shot here with a strong &amp; inventive direction - coupled by Gregory Middleton's impressive cinematography (heavily influenced by Netflix's other project, Stranger Things) which together, does culminate to form a visually cohesive &amp; competent film... But nothing can save the movie from the dire writing &amp; hammy performances - which prevent it from being anything other than an adequately made, substandard mess."}, {"id": 12, "text": "I love this sm!!❤I just started watching today and I loved every scene.!!"}, {"id": 13, "text": "Forcing abvious PC messages instantly destroys a movie. You are trying to escape reailty. Especially with a fantasy movie."}, {"id": 14, "text": "You know this is a kids movie, so I will give the review in a kid's point of view. I love it! The story is perfect for Halloween, it's thrilling, it's cool and I even really want to see a sequel. Love Tom Felton in it, I watched it because of him actually. But hey, this movie's not bad at all. -2 stars for some flat jokes and cringy lines."}, {"id": 15, "text": "The movie was good up until the monsters revealed themselves then it became a stupid terribly bad comedy.The characters sucked. The mom was an immature B word.Scary? More like Stupidity.I thought this movie could compete with Goosebumps. Apparently not.Verdict: if you like this...then you need a babysitter."}, {"id": 16, "text": "This movie is how I learned I could set Netflix to play at 1.5x speed. They hyped it by citing Tom Felton's appearance - he may have 15 minutes' screen time. Maybe. And then of course they put so much makeup and facial prosthetics on him that he's unrecognizable. The first few minutes of his appearance had me thinking, Hmm. Michael Keaton did it better in Beetlejuice, though it did get better from there. The rest of the cast, and the storyline, were bland at best. I get that it's a kids' movie - but it's a boring kids' movie."}, {"id": 17, "text": "2 out of 5 stars.Babysitters Guide to Monster Hunting is a family fantasy film that kids will be entertained with this while the adults may find it a snoozefest. The plot is weird about a babysitters group who work underground to hunting monsters that try to give kids bad dreams or stalking kids at night. The direction and acting is cheesy. Cheesy dialogue. It feels like something you may catch on a saturday morning on a nickolodeon channel. The visual effects are cheap. The performances are eh.Adults may want to skip this one. While the humor is aiming for the younger audiences."}, {"id": 18, "text": "This is an original okay kids movie. The acting was fine and clearly Tom Felton studied Michael Keaton as Beetlejuice but he did great. With a normal 90 min runtime (which is also good in stead of those too long 2hrs movies) it is short enough to not get irritated by some plotholes."}, {"id": 19, "text": "This movie is great because it consists of quest and it is a great movie for kids!Congrats to Tamara Smart and the rest of the actors who worked hard in making this film.Just here to show Support because we should be each other's hope, help and compassion."}, {"id": 20, "text": "I enjoyed it Tom Felton was pretty creepy though as the boogeyman I'm not a fan of scary movies but this actually ended up not being that scary I love the cast And I hope there's a sequel!"}, {"id": 21, "text": "A so called kids movie drained with hypocritical correctness. A typical Netflix movie. When you don't use the best people in the business and simply want to fill up your library at Netflix, that is based on a checklist for what is still missing, then this is what you get. Besides the simple script there is the political correctness. Can we please let the artist do their work instead of this indoctrination and manipulation. This makes movie worse and reduces quality."}, {"id": 22, "text": "Adults - Relax, Get some popcorn, and Grab a drink! Teens - You're too Cool for this movie, but will probably like the girls! Kids - This will probably become one of your favorite movies of the season!Yes, Would Recommend This Movie!"}, {"id": 23, "text": "It goods for kids ..I didn't had any expectation since I'm a adult and I had time so gave it watch and it was alright"}, {"id": 24, "text": "As a kid who suffered from nightmares, this really appealed to me. I am near-sighted, and at night every toy or everyday item would come to life because of my blurred vision. So I had waking and sleeping nightmares. This movie would have made me feel oddly safer to know someone might believe me, and could rescue me. I thought it was well made, and not overly frightening for kids. I was amazed to find that Tom Felton was playing the Grand Guignol. Nice job, sir!"}, {"id": 25, "text": "This is a cute kids movie. I showed this to eldest daughter for her to watch, she loves Goosebumps and Spooky stuff and she really liked it, she is now watching it again while I write this review."}, {"id": 26, "text": "I don't know why the reviews are so low. This movie is great. My 7 year old loves it. Tom Felton does a great job of playing the boogeyman. The movie is just intense enough to be a little scary for kids but they even it out with the cute toadies. A very nice balance of fear and laughter. It's kind of a cross between goosebumps and monsters inc. All the young actors did a great job. Hope they continue with the other books."}, {"id": 27, "text": "I really loved the characters, the fun and silly idea of the plot, it It is a movie for any age who like the goosebumps and any enchanted style movie"}, {"id": 28, "text": "The movie had fine actors but some of the cgi for some monsters didn't work well but other times it works fine, it goes back and forth.I didn't read the book but I got the direction it was going, there was only one scene that I liked that involved cats. (I'm a cat person)"}, {"id": 29, "text": "My kids are 8 and 10 and they LOVED this! Already hoping there is a 2nd one."}, {"id": 30, "text": "Why is it almost Halloween we have to see anything that is attempted terror? A family adventure movie that is not scary and not horror. It is about a girl whose mother takes her as a babysitter and when she is taking care of the child they kidnap him, unleashing adventures. Ridiculous. Bad effects. In some moments well accomplished and others less so, the monsters look hideous. Pathetic performances and crazy situations. Ideal for children under 10 years old. With tweens and situations like that. A quality movie that's easy on television. Tom Felton is awful. Fall into all the preteen movie and monster movie clichés and situations of the season. It is not trying to show something interesting just to entertain. With the predictable ending that we already know."}, {"id": 31, "text": "But it skipped after 20 minutes in a Monster Inc. and Hannah Montana mix. The guy was absolutely not scary at all.  But I give 6/10 because Tamara Smart did a good job."}, {"id": 32, "text": "This is great fun, we're Brits in our 40s no kids and whacked it on and thoroughly enjoyed it. Tom Felton, as normal, steals every moment he's on screen - this guy should be getting bigger roles. This film is fun, feels like one of the lesser 80s films and the actors really run with it. Even the kid playing Jacob isn't the normal precocious American brat you want to get eaten! What a great idea that was. American casting agents take note. Its not perfect, but certainly worth your time."}, {"id": 33, "text": "Great movie for the little ones! If my 4 year old sits and watches the entire movie, then it's a success! I enjoyed it as well."}, {"id": 34, "text": "The plot was kinda all over the place, the acting was okay, it's a typical kids halloween movie but i really liked it, its good if you want to watch something for fun. Tom Feltons acting was great however, and he played his part so well! Kinda the glue to the movie."}, {"id": 35, "text": "This film with a very long title will be a good fun for a young kids and they could actually invest their times into something else that they arent very use do seeing.But to me this film was a mediocore,it had some interesting ideas and actors did a good jobs but simply said im not a target audience for this but still i had to see it so i can recommend it to peoples with kids or not.Tom Felton is a good actor and i have some bit of personal nostalgia of him playing Malfoy but here he was to cheesy and cartoonish.Special effects were also pretty weak,but cause they looked very low budget i didnt mind it to much."}, {"id": 36, "text": "Really Good Horror Film for the Family to watch. ."}, {"id": 37, "text": "There are a few parts that would make small children jump but mostly it's a fun, family-friendly Halloween movie. Probably not suitable for children that are struggling with nightmares though, unless you have a really good babysitter.It's like a cross between Mona the Vampire &amp; Labyrinth."}, {"id": 38, "text": "The people giving bad ratings have to realize that this movie is for kids. My cousins who are 10 and 11 loved this movie so much. Stop giving bad reviews they dont deserve it."}, {"id": 39, "text": "A best movie to watch with kids....I honestly enjoyed this movie"}, {"id": 40, "text": "Great film, funny, which does not take the children for idiots or vulgar creatures with an IQ of a mussel"}, {"id": 41, "text": "This movie is fantastic. If you find you start watching it and rolling your eyes and thinking it's lame simply imagine it is an anime from Japan and you are in for a fantastic time. The story and action beats all fit and if you've ever seen flcl one of the characters would totally fit in that. Do yourself a favour and watch this movie!!!"}, {"id": 42, "text": "A Babysitter's Guide to monster Hunting is straight-to-video fare for family viewing around Halloween, and Rachel Talalay's direction, along with Tom Felton's villain keep it one notch above cheesy TV quality.Sure, it's merely a bit of disposable, light-hearted fun for kids and family, but there's nothing wrong with that. Personally, I don't think it would have hurt to be a little darker and more scary, whilst keeping things family friendly. Kids enjoy being scared (Well, I did. Maybe that's just me...). The biggest flaw is that there is no real sense of threat or danger for the heroes. For example, the villain's minions are told to get rid of the heroine, and the worst they do is attempt to put her in a lift, so she leaves... If this is the worst the villain intends to do, even to his enemies, it undermines any sense of danger or threat.The young actors do a reasonable job, though I do wish the costume designer had restrained things a little. The teenage character costumes (especially the lead) _do_ feel like something out of a bad TV series, where they equate bad, stereotyped costumes with 'cool and quirky'. It's a fine line, I know, but they could've been far less 'bad stereotype' and more defining of individual characters.It's probably a solid 6/10, but I'll bump it up to a 7 because, in 2020, it's a kids movie that _didn't_ push any agenda, and just wants to be family fun. As the review title says, that's all it needs to be!"}, {"id": 43, "text": "It's the time of the year to watch horror flicks and Halloween is coming so bad weather is out so some want to watch a family flick about Halloween.On Netflix I already watched a family Halloween flick and my youngest daughter wanted to see this one, guess why, Tom Felton of Harry Potter fame is in it.It's not terrifying and I must even admit that I had a few laughs here and there. All clichés are included and watching it with the family you will have a good time, nothing more nothing less. Not bad at all. Gore 0/5 Nudity 0/5 Effects 3,5/5 Story 2,5/5 Comedy 0,5/5"}, {"id": 44, "text": "Very cute, the children's movies I love, with smart teenagers, cute children and charming little monsters, in a mix of suspense, action and chase, total cuteness..."}, {"id": 45, "text": "High School freshmen Kelly Ferguson, known mockingly by her classmates as Monster Girl for believing in monsters when she was young, is roped into babysitting Jacob Zellman on Halloween night. Jacob's fears of monsters coming in the night are initially dismissed as nightmares but Kelly soon finds they may be all too real when when Boogeyman, The Grand Guignol, abducts Jacob for an insidious plan of using his dreams to create a nightmare army. The incident attracts monster hunting babysitter, Liz Lerue, and the two with the help of the secret monster hunting Order of the Babysitters set off to rescue Jacob and stop The Grand Guignol's insidious plans.A Babysitter's Guide to Monster Hunting is an adaptation of the first of a trilogy of YA novels written by Joe Ballarini who also serves as the film's screenwriter. The movie wears it's influences on its sleeve be it Men in Black, Adventures in Babysitting, Beetlejuice, and even a little bit of Nightmare on Elm Street (which may be more than a little intentional) but the movie takes these familiar elements and manages to create something that although familiar is still fun and exciting enough to open the door for a promising franchise (as this is clearly intended)The movie is the first major film work from director Rachel Talalay in 25 years who is best known for doing Freddy's Dead and Tank Girl, and while those films aren't particularly well regarded (though Tank Girl has received a small cult following over the years) they do show that Talalay has a very dynamic style that's visually interesting, but the main issue with Talalay's films was always in the scripting and how messy and chaotic they were. Tank Girl proved to be such a flop that Talalay has stuck mainly to TV work including Doctor Who and The Flash, and has only occasionally ventured outside that for middle of the road TV movies. I'm pleased to say that Talalay has taken the time to hone her craft and the film is not only visually interesting but also feels a lot less chaotic than her previous work.The movie is filled with imaginative imagery with The Grand Guignol's lair being particularly appealing in it's design and a memorable sequence involving a witch called The Cat Lady who's cats are integrated into the furniture and the house itself and are integrated with the scenery in a visually interesting way. In many ways A Babysitter's Guide to Monster Hunting is almost like a child friendly version of Nightmare on Elm Street and I do mean that as a compliment. The story is a lot of fun and there's a lot of great world building in just how wide spread this secret order of monster hunting babysitters is spread the world over and it gives a sense that there's a larger world hinted at than what's being shown to us, but it never feels overburdened by its world building and still manages to keep the story moving.The acting across the board is really well done. Tamara Smart makes for a likable lead and does a decent job (though there are one or two moments where her british accent slips in), Oona Laurence who showed herself to be a very capable actress in Southpaw is great as seasoned Babysitter Liz Lerue, but the easily the best part is Tom Felton of Harry Potter fame playing The Grand Guignol. Felton is having an absolute blast playing a boogeyman who delights in how brazenly evil he is. Felton plays the character like a mixture of Labyrinth's the Goblin King, Freddy Kruger, and Beetlejuice and is energetically animated in his performance being just creepy enough for kids and funny without being silly, it's a terrific villain performance and makes the movie worth watching for its own sake.There are some drawbacks to the material. A sequence set during a house party on Halloween that involved the obligatory main character crush and the meangirl who hates the main character for no good reason I thought killed some of the momentum of the movie, but luckily it's not too long and it does at least have a decent payoff. There were also some credibility problems in how certain things managed to be kept secret, but these are very minor nitpicks and the movie's target audience (7-8 and up) most likely won't care.A Babysitter's Guide to Monster Hunting is solid family entertainment. From it's unique visual style and solid performances to its fun adventure and world it more than makes up for its use of tropes and minor inconsistencies to more than earn a recommendation for Halloween family viewing."}, {"id": 46, "text": "The premise of the film has a lot of potential but the results are incredibly lackluster. It's a collage of elements from better movies that brings nothing new to the table. Not a single elements doesn't feel as if it was lifted or inspired by something that came before it. People are defending this by saying the movie is meant for children, but kids deserve rich, thoughtful, original films too!The most disappointing moment (of any film I've seen in a long time), comes when a teenager sneers at the idea of earning $15 an hour. It's incredibly insensitive considering over 40% of working Americans are currently living on less (many of whom are considered essential workers and have been putting themselves at risk to help this country stay afloat). The creators clearly took the time to find a diverse cast, create strong female leads and glamorize STEM, so they obviously are trying to push this film as empowering to its young viewers. It's such a shame that they felt the need to show such distain for those earning a lower income. I know it was just a joke but these small interactions really do effect the way people view and treat others."}, {"id": 47, "text": "Acting: Decent for what little characterization they had. I thought the blonde girl and black girl were decent, cringe at times but easy to root for. The villain was also pretty darn good and I was mind blown when I finished the movie and only after realized it was bloody tom Felton from Harry Potter! Amazing.Music: trash. The scenes that were supposed to be fast paced and exciting turn into anti climactic messes partly because of the music and also average shots and stunt co-ordination.Story: A really great story on paper but with average cgi, not the best directing, characterization, or music it becomes a chore to get through. Don't get me wrong I loved certain parts and it made my kid brain activate and love the idea and certain fantasy parts. This however could have been really awesome and is only left to be desired for small children.Summary: Not the best but definitely not horrible. A real good foundation with some highlights here and there but this movie is mainly for kids and I'd suggest it only for adults if you just love fantasy and don't mind some average quality parts."}, {"id": 48, "text": "I had no particular interest in watching A Babysitter's Guide to Monster Hunting, but I thought I would give it a go since we are nearing Halloween and it looked like it could be fun. I was wrong.There are some redeeming qualities, namely Tom Felton as the villain, but the screenplay was terrible and I was bored throughout most of the runtime.The narrative had a certain charm to it and I can definitely see it working for the target audience of children, but I didn't care about any of the characters and this made the storyline hard to connect with. I couldn't wait for the film to end, and that's not a good sign because it wasn't particularly lengthy.I've already touched on the script, but some of the dialogue was terrible and there was too much slapstick humour for my liking. Again, it will probably work for children, but not for me. There were also too many out-of-place events, like characters suddenly starting to sing.None of the characters were particularly interesting, and I can't even say that the acting was good. Felton was the only decent actor in the film. I feel bad saying that because most of the actors are just children, but they were mediocre at best.The first act was by far the best because it set up some interesting plot elements and I liked the backstory to the character of Kelly. It just a shame that it went downhill so fast afterwards.Overall, I did like a couple of elements to A Babysitter's Guide to Monster Hunting, but not enough to recommend it to anyone below the age of twelve. The cinematography was nice, the villain was fun, and there was a certain charm, but none of that replaced the awful script and the fact that I was bored throughout. This won't be a film that I remember for long.SCORE: 42%"}, {"id": 49, "text": "When my kids were little, I enjoyed reading and watching Goosebumps and Are You Afraid of the Dark? with them. I am not a fan of genuine horror/gore flicks at all, but a little tension in a story with kids is my speed. For parents looking for a movie with some spooky elements that they can enjoy with their children, this is perfect.The premise is that the things which scare little kids as they try to go to sleep are real, and one little boy is snatched from his room despite the efforts of his babysitter to save him. Enter an organization of babysitters dedicated to fighting monsters.Tamara Smart, as Kelly the babysitter whose charge is taken, and Oona Lawrence, as Liz the monster fighter, are very well suited to their roles. They have a good rapport as they learn to trust and fight together. Tom Felton of Harry Potter and The Flash was outstanding as the villain, the Grand Guignol, a real Boogeyman. He was alternately scary, campy, smarmy, crazy, and arrogant - great qualities for a kids' villain.My kids would have been fine with this movie from age 4-5 up. If you have a young child who is easily frightened, you might want to preview the first few minutes to get a feel for what is ahead. I can't imagine anyone 8-10 being bothered at all. There are a couple of brief bullying scenes, but the character is not assaulted/injured."}], "reviews_amount": 50}