{"name": "Bushwick", "titleId": "tt04720702", "reviews": [{"id": 0, "text": "If Bushwick had been shot in a traditional way, I would have given it 6 stars. The story - a survival tale - has been done many times before, and is nothing to write home about.The use of steady cam is, however. 'Bushwick' is one long continuous shot, where you don't notice the cuts (much like 'Birdman'). You are taken right into the action. There's no shakycam, no quick editing, just a camera constantly hovering beside, in front of and in the back of the action. How refreshing.I wish that more movies were shot like this."}, {"id": 1, "text": "Let's be honest here, this movie will never win an Oscar and neither will the two actors, the plot is ridiculous, the acting poor and you find it hard to make out what the lead male is saying half the time.All that said, it actually works like a video game with the viewer right there in the middle of the action and you actually start liking and wanting the two main players to succeed in their task - its pretty intense and the action never stops and surprisingly, I actually started to enjoy the movie - one of the more enjoyable movies I have seen recently. I would rate more of a 7.5/10 but will go for the higher 8 on the IMDb rating system because I did enjoy it, as stupid as it is!"}, {"id": 2, "text": "What a strange film!I actually really liked the start, where you don't really know what's going on apart from some military activity of unknown origin. You do have a feeling of being right there in the action, and that feeling is progressed through to the end. This is an idea with legs - and it looks like it will run and run but...There were a few things that ruined this movie:1) The characters seem to get quickly bogged down. Not only in terms of location but in terms of where their characters are going. There seems to be poor motivation for the characters.2) The acting from Brittany Snow was terrible. Is this the actresses fault or do we blame the director for this? Whatever - it just felt really off in places - for example when the Gran died and when the priest killed himself. The poor acting just jolted me out of the moment. Funnily enough I thought the acting from Bautista was very good and I found his character very believable!3) Very odd plot moments such as the church, the laundromat, and the gang house. Felt surreal in places.4) Terrible ending. This is just bad script-writing in my opinion. The ending had a very unfinished feel to it. Events must have some logical purpose to them and a story without a conclusive ending will always fall flat. At least, the ending fell flat for me. I was almost surprised when the end credits rolled. Sure, I understand they had a message to get across on the futility and waste of violence, but the laws of screen-writing still apply - you need a compelling ending with RESOLUTION!On the whole a good idea, with good action moments and well shot so you feel like you are in the action. Let down by some bad directing/acting and a poor ending."}, {"id": 3, "text": "While the effects were clearly low budget, this film did its best with what it had. While not on the level of Children of Men, it is still an entertaining run and gun (or more likely get gunned) movie that keeps the frantic pace until the end. This movie really gave me a DMZ comic feeling. Just like in the comic, the South states are attacking the North by invading Brooklyn. The people trapped between the warring sides try to survive by any means possible. My opinion is that you should give this movie a try, even though the effects and even the acting fall flat at times. The action more than makes up for it."}, {"id": 4, "text": "WOW, I was hooked up all the way through this movie. I watched it on Netflix, never heard of it before, watched the beginning of the trailer and I thought I'm gonna like it and I did.At the beginning, it's the total confusion with the shooting, questions left unanswered for some time. When you get the answers it's like what the heck!Honestly, it's a great movie. Near the end you kind of guess what was going to happen and it is sad in a way but it was logical and inevitable and it is a really good ending.I didn't get bored at all. Action packed. People running, defending themselves. Facing danger, no matter who you are or which religion you practise, you need to hurt others for self-preservation. Defend yourself or die. Well filmed also.That was brilliant!I recommend this movie, just try it!"}, {"id": 5, "text": "Clearly a B film not meant to be taken seriously but yet, still manages to be entertaining. The action sequences and battle effects are better than I would have expected for a film with limited funding. There are quite a few nonsensical plot sequences, but towards the last half the writers try to inject a little logic to make sense out of what is happening while the two main characters gradually travel through multiple life threatening moments in their effort to reach family and ultimately safety. If you're up for a different guilty pleasure watch, then I can recommend watching Bushwick."}, {"id": 6, "text": "So a large group of militants from Texas (or should I say, the South) want to secede from the United States--which is constitutionally illegal, by the way. The militants' think that invading and capturing a poor neighborhood in the largest and most economically viable city to the US (a city of 8 million inhabitants and over 1,200 miles away via air, mind you) is a better tactical strategy than using all those militia members to defend Texas instead? They somehow have been duped into believing they can conquer this neighborhood (Bushwick, of course) because the minorities won't fight back. Really? You guys need to spring for a better intelligence officer. Because, some of the folks in the inner city are better armed than police. Speaking of police, apparently New York's finest were on vacation this day, the US military too. I think it's safe to say the North would still win this civil war as the South's strategy was too ambitious, to say the least. By the way, no way there are any political undertones here. No Way!But don't worry about the highly improbable plot, because the unbelievably horrible acting is more of a distraction than the dreadful plot. I cannot express enough just how bad the acting is, especially with our main character, Lucy (Brittany Snow) and her drug addict sister, Belinda (Angelic Zambrana). Absolutely appalling. Where did they find these two? Brittany Snow's character is way too annoying, especially early on. Her delivery is often too rushed and she mostly displays zero emotion, even during times where being sad or scared is called for. I'm not sure if this is the fault of the writers, director, actress, or all three. But trust me, the screenplay and dialogue are really really bad on their on.Dave Bautista as Stupe, the neighborhood hero and ex-US military patriot, is about this film's only saving grace. That and a pretty satisfying, non-traditional ending. Together, they are worth a few extra stars"}, {"id": 7, "text": "I really wanted to like this movie. I watched it all the way through hoping it would get better. It didn't.It wasn't all bad. In fact there were even some brief flashes of brilliance. But not near enough to make this movie come together as a worthwhile story. In fact the story is what stands head and shoulders above the other problems as the real culprit of a failed effort. I kind of doubted that there was even a script at times.The whole idea is basically Texas wants to secede from the Union so they decide to hold New York hostage so that the US Congress will let them go. But here's the thing: It isn't exactly Texas. The soldier that gets interrogated to provide the info says he is from Kentucky. He also lists 6 or 7 states that are with us. Strangely none of the states he lists is Kentucky! And then he is supposed to be a mercenary. But claims he was just following orders. And the reason that these guys dressed like SWAT teams are shooting everyone on sight is because Bushwick has so many guns and people are fighting back. And well that just shouldn't have happened because guns are illegal here. So they got orders to shoot to kill. And apparently they are just invading this one neighbourhood in New York.That pile of crap is what you get from the one short scene that is supposed to explain what is happening. And of course it contradicts an earlier scene in the movie that says that they also invaded Washington, Chicago and a few other cities. Not to mention a scene of most of New York in flames. On the other hand the character that informed us of the invasion of those cities apparently forgot that as soon as he said it because he was the one that was interrogating the mercenary to find out what was going on. It's glaringly obvious that there were rewrites and changes with a complete lack of effort at continuity. I could go on and on about the gaping plot holes but it's basically all hole and no plot.The acting isn't the worst that I have seen. Nothing great but then the actor's didn't have anything to work with so it's not really fair to judge them too harshly.Special effects you ask? Well don't go expecting a bunch of impressive CGI effects because there aren't any. What there is, is mainly some plumes of smoke and some flames. Non-CGI effects included some quite decent pyrotechnics work that worked pretty well. Most of the explosions and such are actually off screen. Basically a loud boom, camera shake and maybe the lights flicker. And there were some helicopters.The camera work was decent. Quite competent and at times even impressive. There were a lot of scenes that went for quite a while without a cut and it seemed that most if not all of the movie was shot with one hand-held camera. With a better story to tell it could have been very effective.The sound was not great. Dialogue wasn't always clear. It was often hard to tell if the bangs were guns or explosions or what. In fact it seemed like they used the exact same explosion effect about 80% of the time. The music was pretty awful and in many cases just did not go with what was on screen.Direction? What direction? The movie basically looks like the directors gave some very basic instruction and then went and smoked weed in the corner. Many of the scenes end up being very flat and one- dimensional. Probably because the actors are putting most of their attention into where they are going physically in the extended and sometimes complex scenes.The concept I think was pretty good. If they had pulled it off it would have been a very realistic real-time thrill-ride. But they did NOT pull it off. It appears that they tried to fix things by shooting a new ending or something. The last 5 minutes are jarringly different in look from the rest of the movie and the ending fails on many levels. I won't get into that.So: Might be worth a look if you are bored and non-judgmental. If you are more of a stickler for a coherent and logical story you will hate it. A lot. My honest recommendation would be to watch the trailer and then NOT watch the movie. That way you might get a little enjoyment and you will miss the aggravation and disappointment."}, {"id": 8, "text": "If you like invasions and apocalypses -- whether zombies or Commies, aliens or earthquakes -- you'll enjoy this fun, low-budget thriller. Unless you can't handle seeing a political action thriller that's not a conservative, prepper fantasy. Please, people: How many lefty action movies are there out there? All these reviewers freaking out because they stumbled across one, starring a wrestler even, that wasn't a page out of the GOP playbook: Relax people. Go watch one of the Die Hards again if you're so sensitive."}, {"id": 9, "text": "A second American civil war scenario can make for a good movie, except in this case. I will give the company credit for casting Dave Bautista. That was a perfect choice. Your female lead Brittany Snow was miscast. A thirty year old playing a twenty year old grad student--wrong on two counts.Plot holes you could drive a truck through. George A. Romero used the radio and TV to fill in the story and save money. Link: http://www.imdb.com/title/tt0063350/?ref_=nv_sr_1You need to establish a back story for your movie to make any sense. The spacing, action and plot got lost. How does a neo-confederacy come to attack NYC? Why was there no government involvement and or intervention ? How did a local militia armed with lacrosse rackets bring down a helicopter? Why do the invaders let the locals hit them with bats when they have guns....To the writers / directors / producers of this movie: If you are going to use combat as a mainstay of your movie you might want to find a technical adviser. Preferably a person with combat experience or a sense of reality to clue you in on what works and what doesn't.Bottom line, you need to tell a plausible story. Twenty years ago today Sergeant Pepper taught the band to play and this production company produced a movie that made sense.Link: http://www.imdb.com/title/tt0120086/?ref_=nv_sr_1"}, {"id": 10, "text": "I already said this review might contain a Spoiler...but I'll make it as vague as I can: The main girl in it is tougher than the main guy who is a former Marine war veteran. The deaths that occur at the end make no sense and are pointless. The entire story line is all over the place and makes no sense whatsoever. The sister of the blond is a junkie, meth-head doper....and She of All People survives??? WTF???The former Marine war veteran takes out a lot of the bad guys but fails to take ANY of their M-4 Rifles from them!!! He continues on with only his small pistol! NO WAR VETERAN in these circumstances would EVER leave a downed enemy without taking their superior firepower and ammo!!! STUPID, STUPID movie!! And it's so sad too because I really liked the blond and the big guy (Veteran) as far as actors go. I hope this movie doesn't kill their chances of ever getting work again.Don't watch if you have Anything better to do, like, oh I don't know...weed your garden...go to the dentist, whatever!!"}, {"id": 11, "text": "I have never taken the time to write a review until now. Bad acting throughout... really bad acting. The whole setup is silly and, did I mention the bad acting, the unrealistic scenarios on top of the bad acting and the bad acting. What is more troubling, is the fact that they use Texas, a white militia, attacking Brooklyn because it is full of people of color and many nationalities, so in essence, the director is saying, people of Texas, White people and better yet the south as the actor describes the militia being comprised of the South only, are the ones behind the secessionist movement. It feels like a bitter democrat upset they lost the election and wants to create more division in this country by creating a divisive and polarizing argument of the current state of the country. I am just furious I wasted two hours of my time watching this. Plus the bad acting!"}, {"id": 12, "text": "Probably one of the worst films I have ever seen. Poor acting, poor plot and very little empathy for any of the characters. Don't watch it. I made the mistake of doing so."}, {"id": 13, "text": "The Shots are Great, the Setting could be interessting but what they made out of the Film is just horrible. The Story is completely nonsens."}, {"id": 14, "text": "No beginning, no middle and no end. No point. The characterisations (such as they were) were sloppy, and there was no one you could really care about one way or the other. I know that the rules of this site require that we give reasons for anything we say in a review, and not just say 'I didn't like it' for instance. But this was so appallingly bad there is nothing of any value to say. It has no redeeming features whatsoever."}, {"id": 15, "text": "This movie could have been so much better. Action was good, acting alright(Bautista could only do so much with bad supporting actors), story not so much. Instead Bautista takes 2nd billing to a no name SJW snowflake actress who couldn't shout here way out of a wet paper bag. Plus we have exposition and hand holding throughout the movie.Spoiler! The bad guys are...white but not just any whites-southern whites. So the multicultural super hero team has to be assembled sans white guys to fight this new or maybe old ancient hatred that has arisen anew.Synopsis: Join me on a multicultural SJW romp as we fight those big bad racist white boys from Ohio? Texas and...well all those Southern racist backwaters states because everyone knows that's what they are. So now they want to take over Yankee town because reasons. And here we go..."}, {"id": 16, "text": "This film tells the story of a young woman and a military veteran, who are stranded in a city where insurgent forces heavily attack, with the aim of succession from the USA.Bushwick is surprisingly good considering it is a low budget film. The plot is good, there is a lot of action and thrill throughout the film. It wastes no time in introducing the intense gunfights int he city, making New York like a war zone. The camera work is great, as there are a lot of long continuous shots of fighting and escaping scenes which I am sure are challenging to stage. The main characters are likable, and I just really hope that they can get out of the highly dangerous situation. I enjoyed watching Bushwick, I thought it was surprisingly thrilling and captivating."}, {"id": 17, "text": "Very much amateur made movie. Don't watch it to waste your time. It misses the story(1/10). Screenplay was good(5/10). Although DoP was different. I don't understand how it got IMDb rating 5 !!!!! Batista's acting was not bad. But i just wasted my time to watch it, whether i could use my time for other staffs as well."}, {"id": 18, "text": "A thin premise based on a leftist fever dream of resistance, and the unreality of the situation reflects their distorted view of reality perfectly. There is no plausibility here, just stereotype and caricature, proving as always, they are exactly what they accuse others of. I see people praising the action or the camera work, but very little of that works, because it lacks anything more than a video game level logic, baddies bad, mooks die easy and are tactically dumb for the sake of the plot. For a start anyone invading Bushwick would simply starve them out, modern urban life is fragile, relying on just in time deliveries of resources, you would target the infrastructure, the distribution network, and the city would eat themselves, their only militia's being their street gangs as they've foolishly disarmed themselves, and have become atomized individuals. You wouldn't even have to send people in. So yea, its just one of countless resist fantasies flooding the media landscape thanks to the lefts total domination of these industries, fortunately they aren't giving people the message they intended."}, {"id": 19, "text": "If you are looking for a movie which will thrill you, keep you on the edge of your seat and have breathtaking action sequences and a gripping storyline, then this movie is NOT for you. That's right, this movie is a pile of garbage. I wanted to watch this movie because Dave Bautista was in it and boy did he disappoint. He did not fight, did not do anything but cry in the movie. And as for the other cast, well let me just say that Dave was the best actor in the movie and this should give you an idea about the acting of the rest of the cast. This movie is so bad that if one is watching it while one is high, even he will turn it off and watch cartoons instead. So verdict is: Stay Away from this nonsense."}, {"id": 20, "text": "Extremely poor and unrealistic story line. It s more fun watching someone play a first person shooter game than watching this.Please don't waste time on this. This is my first review. I feel compelled to warn people not to waste their time on this rubbish."}, {"id": 21, "text": "This is one of the stupidest, if not THE stupidest, movie I have ever seen. I'm willing to suspend reality but only to a certain point. This movie is so unbelievable. it's laughable."}, {"id": 22, "text": "Wasted 90 minutes of my life watching this. I couldn't hear the main character speak half the time, acting was horrendous. Dead people still clearly seen breathing due to appalling camera angle. It really is LOLable. Don't waste you're time. Get an early night instead !"}, {"id": 23, "text": "The premise is OK, but the execution is absolutely terrible. And I really wanted this to be decent. Besides the weak plot, childish SFX and even weaker acting, a few things get more than a little tiring. I'm talking about the CONSTANT close and chase camera work intended to make you feel like you are right there, but that ends up feeling massively overused and pointless. That Bautista's character doesn't know how to properly wear a backpack or pick up a long gun when he finds one, yet he was a Marine. The clichéd sister and the wise, but sassy old black woman. You get the idea. Even a die-hard fan will be disappointed."}, {"id": 24, "text": "I like Dave Bautista, and Brittany Snow has been fun in a couple of movies, so I thought... hey... this might be good. Nope.Brittany can't stop talking. The annoying chatter only adds to her shallow, self-centered character. Thanks to inspired directing Dave is reduced to moping around, head down, mumbling. An hour and a half's worth of disjointed editing and we discover the big ruse... Texas gets the south to fight for independence by sending troops to New York, unaware that the locals might not be willing to roll over and play dead. And the only thing more grating than Brittany's dialogue is the morbidly looped video game wannabe soundtrack.I kept hoping for an ending of some kind, maybe worthy of the old disaster movies, where love is found, right prevails or at least Maureen McGovern sings about finding a morning after. Here Dave dies without a hero's farewell. In the final scene Brittany is shot. The camera does a closeup of her lifeless body, but her chest is still heaving. She's out of breath from doing the stunt. And we're cheated once again. It would have been a tiny bit satisfying to see the shot that ended such an unsympathetic character."}, {"id": 25, "text": "Bushwick: Texas attempts to secede from the Union, Militia groups try to seize control of New York and other east coast cities. We follow events in Bushwick, Brooklyn where grad student Lucy (Brittany Snow) and an ex-marine, Stupe (Dave Bautista) make their way through the confusion, first to her grandmothers house and then to an evacuation point.Chaos reigns and some looting ensues but the militias are confronted by locals who have more guns and backbone than those good old southern boys expected. Hasidic Jews armed with AR16s and Molotov Cocktails prove more than a match for the Master Race. I love the smell of burning ubermensch in the morning!Black, White, Hispanic, Asian and Jew unite to fight back against the invaders. This is uplifting but it is a dark film which shows the reality of such Urban Warfare. Don't get too attached to characters as they are winnowed like wheat. Police are mostly absent and we only see US Military overhead in copters.Good Conspiracy/Political Action Thriller left down a bit by shaky acting and Bautista mumbling his lines. 7/10. (On Netflix.)"}, {"id": 26, "text": "What starts as an interesting premise ultimately flops on it's face and wallows in Leftist political muck - and it's not even clever or subtle in the process. Of course, it's not much different than the veritable cornucopia of utterly worthless Leftist/SJW movies being made these days - whether it's an average 102 lb. woman who can miraculously beat up ten 240lb, fully-armed spec ops soldiers - or in the case of Bushwick - an easily-captured redneck soldier who happens to tick of all of the SJW imaginary hot buttons (racist, homophobic, cowardly, murderous, white supremacist, etc).I've seen some pretty bad movie ideas that *somehow* managed to get green-lit - and Bushwick ranks right down there with the worst of them: FFS, the Southern States secede and attack New York?? Are you freaking kidding me? They couldn't even come up with a remotely believable reason.I have to agree with another reviewer who said that this is Red Dawn for Leftists and SJW's - that pretty much sums it up.The only reason this gets one star instead of zero is because I think Dave Bautista did a pretty good job. It also gets a tiny nudge in the humor category because for some reason, Leftists love to use BB-guns in their movies ... and not even nice ones. I guess the hipsters et. al. can't tell the difference, but I laugh every time I see a character threatening another character with a cheap plastic toy. Oooo... so SCARY! lol"}, {"id": 27, "text": "This seems to be all Hollywood has these days. Bad politically skewed writing that we are supposed to watch?I stopped this halfway through. I am tired of the garbage that Hollywood keeps putting out, trashing half of America by stereotyping them as dumb and violent.Get over yourselves Hollywood. In case you haven't noticed, it is getting harder and harder for you to make money unless it is outside the country where you spew your hatred of your fellow countrymen for money and a pat on the back. Nothing about this movie is good. Nothing."}, {"id": 28, "text": "The only thing worse than the constant panning is the fact that Bautista NEVER PUT THE GODDAMN BACKPACK ON PROPERLY!"}, {"id": 29, "text": "The film is told largely on a continuous shot style, which is compelling - but the enemy - Texans, more or less, is clueless, insular and insulting. Which is why you've never heard of this movie."}, {"id": 30, "text": "Amateurish and bumbling attempt at a movie. No redeeming qualities and I suspect some kind of family connection to the industry. Some kind, but misguided parent bought their kid a Hollywood debut. A little honesty and tough love would go a long way."}, {"id": 31, "text": "Let me preface this by saying I simply wanted some mindless entertainment. My only expectation was that it would be lots of action and excitement. A cheap thrill. This was a great concept, but poorly, written and executed. I don't say this often, but it was one of the worst movies I've ever seen. I don't review often either, but had to come online and say a few words about this movie, so others like me wouldn't be duped by the raving reviews. It started out decent and it seemed to make promises of getting better with little interesting twists and plots so I kept watching. The problem is that it never did get better. The worst waste of 90 minutes I've spent on a movie in a long time. Watch at your own risk. I watched because Netflix had it as 5 stars. I'm even shocked at the glorifying IMDb reviews and 5 out of 10 stars here. This was just a no go for me."}, {"id": 32, "text": "Before going to see this movie I watched the trailer. And I liked it very much, the main idea seduced me, the characters seemed fine and well portrayed, and there were lots of action too. So it seemed like a winning package for me. Then, I began to watch this movie, the first that hit me in the face was the first scene: Dialogues seemed unnatural, and when the action began, the end of logic began. And it continued throughout all the picture, with memorable quotes that I can't dispel because I risk giving spoiling the film. The film does begin without logic and ends the same way. Worth not watching it."}, {"id": 33, "text": "So we're supposed to believe that Texas wants to succeed from the USA, so some lunatic citizens of the state fly in helicopters half way across the country to the Atlantic ocean, then turn around and fly in to Bushwick (New York), and try to take over. The gov't is nowhere to be found, but the massive amount of armed gang members repel them.During this time, the movie centers on a young lady and a guy she meets, as the two make their way across the neighborhood.We ended up turning it off as it was just so darn unbelievable."}, {"id": 34, "text": "It starts out mediocre good with action and stuff, but with Bautista in the movie u kinda expect some Rambo ness, they only use 5% of him in this movie of his potential... Yet he is in mostly every scene. It drops out further u go into the movie, feels senseless, no thread, no story. Its a good idea but dont work, the idea should be better off course and stories to back it upp. It feels like a movie wich was invented within 1 day. And they went for it. A better story and a good remake. More apocalyptic, since its a short story. It could be like Revoloution with a twist... Bautista first 5 min in Blade runner is 10 times better than this movie, just as u know."}, {"id": 35, "text": "This movie is about racist white Southerners deciding to secede from the US, and also deciding that invading New York City would be the best way to do that because New York City has strict gun laws and is full of minorities. That's the actual synopsis.This movie is the most blatant example of leftist propaganda coming out of Hollywood that I have ever seen. The creators of this film did everything short of putting MAGA hats on the invading army in this Red Dawn style resistance action flick. The most frustrating aspect of this movie is the dichotomy between the unreasonably hacky left-wing propaganda contained within the script, and the marvelous direction. The single-scene style was extremely original and impressive, but the premise of the film is so deeply affected by hard left ideology it is impossible to watch. 2/10 - only because the film has a hot blonde shooting a pistol."}, {"id": 36, "text": "So bad. Watched about 40min. Its so bad. The argument is so poor. Not a movie I expected Batista to make"}, {"id": 37, "text": "Sadly, Bautista lent his time and name to this flotsam. Snow? Who cares? It was an extremely transparent effort to paint the right, southern states and, conservatives as evil entities wanting to invade certain parts of America(Bushwick!?) in an effort to secede from the Union and, start a new, civil war that makes utterly no sense and would accomplish absolutely nothing.I was initially intrigued in the beginning, wondering who was attacking and, why? The characters seemed genuinely perplexed and fearful. You wanted to see them escape and, find out what was happening. You wanted to root for them. The hesitant, ex-marine, medic not wanting to fight and, the 2nd year grad student knowing nothing about war or, the reality of violence. Suddenly thrown together, you want to see them escape and figure it all out.Then, about half way through the movie, they tell you the plot and, the movie takes a monumental dump. You see immediately the liberal plotting. Based on something that would NEVER happen in reality. Texas is all-white? And, racist? LMAO! Really? Apparently, the writer and producer have never BEEN to Texas. Secession? Why would you start attacking other states if you wanted to secede and be left ALONE? And, if you were from Texas and, believed in the 2nd amendment and, KNEW of the gun violence in NY, you'd know plenty of people had guns. STUPID PLOT.Bautista is likable in this movie. He only had so much to work with. He was portraying a guy who wanted nothing more to do with mindless violence whom, gets thrown back in the mix against his control and, tries to help others just as desperate out of a bad situation. In the end, they kill off his character needlessly in an effort to promote mindless gun violence. Both main characters die, in fact. For nothing.I give this movie a 1 star because, of the mindlessly apparent, leftist-leaning, political basis for the film and, the completely cheap way both main characters were simply killed off. There was, in the end, no purpose for the film."}, {"id": 38, "text": "Lame-o! And who openly walks out into the streets with gunfire? My 12-year-old granddon might like it."}, {"id": 39, "text": "I have never considered myself a harsh critic of movies. Hell, I generally like every movie I watch, and it doesn't take much to impress me.This has to be the only movie I have EVER seen that I hate. Yes, hate.The acting is horrible, the script is inconsistent, and they could just reuse several clips and nobody would notice a difference. The ONLY redeemable thing about this movie is that it has Dave Bautista. If he was not in this movie, there would be nothing to like about this stale, uninteresting film.I'm a high school student and I could come up with something better."}, {"id": 40, "text": "I actually had to write something on this film because of the meta score. How did anyone rate this positive? I tried watching this and the acting and dialogue are so bad... it's hard to finish.HIGHLY do NOT recommend. I don't want to write anymore about this film due to how poorly it was done. I don't understand how anyone could enjoy this movie."}, {"id": 41, "text": "I missed the first part of the movie, and got thrown in the middle of the action. Much like the characters played by Bautista, and Jane Snow, it was chaotic, and frenetic. The camera shots was nauseating at times, but manages to convey the sense of chaos and helplessness. It also narrows the perspective to first person, making the audience as clueless as the characters of what happens. It is almost like a snapshot of a real battle in which you follow Bautista and Snow throughout the movie. Honestly, this movie may not be a success due to its camera work, and unconventional style. It has several what the F... moments, which I will not spoil. However, Bautista actually performs well in this movie and carries the weight of the movie on his broad shoulders. Unlike other movies where he is given a few one-liners, or is limited to the comic relief as in the Guardians of the Galaxy 2, Bautista is able to display his acting range here. In fact, he could make a good dramatic actor if it were not for his imposing physique. I would say I actually enjoyed this movie because it provides a new take on action. The action is not glamorous, and all characters are interesting."}, {"id": 42, "text": "The Steadicam work alone is enough to want to watch this film. The way it is shot and the content is amazing. I had no expectations going into this and was blown away.As for the story, if you think something like this is purely fiction, history says different."}, {"id": 43, "text": "Horrible acting. Terrible story. Kind of cable movie you watch when you just had your appendix out and you can't reach the remote or an instrument of death to end your own life......."}, {"id": 44, "text": "Where to start? Republican white supremacists start a civil war. It's down to a student and her stoner sister to save the world. Plot sucks, camera work sucks, acting sucks, the musical score is not bad. It's not even remotely realistic. Just don't waste your money. Watch Antifa bashing Nazis everywhere on the news if that's your thing."}, {"id": 45, "text": "The people who financed with abysmal production ought to be band from having any input in the film industry altogether. Not to mention a hefty fine!"}, {"id": 46, "text": "Just more libturd Hollyweird bashing of Southerners, portraying them as stupid, racist rednecks looking to secede, violent and looking to kill anyone not like them. And lets be honest, if there was a militia that was able to invade NYC, there is no way in heck the people would defend themselves as they did in this joke of a film. They were portrayed as great shots, with girls who never even touched a gun before not missing while under fire, while the militia couldnt hit the side of a barn. Reality would be like what happened in Paris, people would run for their lives, terrorists would run around without fear because no one in NYC except for the cops would be armed. The thugs would run like the cowards that they are.Thank God this movie was on Netflix and I didnt spend any pennies on it."}, {"id": 47, "text": "My wife and I watched this at home on BluRay from our local public library. When it was over we each said That was pretty bad.There is a short extra on the disc and the directors reveal they were inspired by former Texas governor Rick Perry saying a few years ago that Texas might want to secede from the USA. So they came up with the story in this movie, Texas, Louisiana, and a few other S.E. states decided to go to war with the rest of the USA and begin by attacking large cities. Here they are attacking New York City. We find this out about halfway into the movie.In the first half we just see explosions, gunfire, and people running for cover. The plot makes no sense at all, why would Texas and a few other states form militia that would go into large cities and just try to kill all citizens, including children? Be that as it may the whole movie has two main characters, Dave Bautista as Stupe and Brittany Snow as Lucy, they meet by accident when she takes refuge in his tiny apartment in Brooklyn. Add to all that the dialog is often cringeworthy, characters behave in terribly unbelievable ways during the mayhem, it has the look and feel of amateurish improvisation. I know some have said they like the movie because it has a look and feel of those video games where you hunt down and shoot people. I give the movie a big F for effort.SPOILERS: After all that, the two main characters each die by gunfire, all in all a pretty pointless movie."}, {"id": 48, "text": "Steady cam and tracking are pretty cool.The reveal that its white supremisists of the south trying to take over NYC is just awful."}, {"id": 49, "text": "This dude was in the Marine Corps but he never once picked up a dead enemy's weapon when he only had a backpack and a hand gun! Come on man! He whispers the whole movie too...annoying."}, {"id": 50, "text": "I bet there are a lot of butthurt liberals suffering from trump derangement syndrome sitting around their tiv's watching this and saying 'this is happening right now!!!'...nonsensical plot about another confederate army trying to secede from the US...I bet they want to have slaves too...ugh..."}, {"id": 51, "text": "This is the kind of film that gives even D movies a bad name. By the midpoint I wanted to bitch slap the director...by the end credits I wanted to shoot the writers.Anyone even tempted to view this P.O.S., I would suggest you read a phone book instead..."}, {"id": 52, "text": "The movie starts off okay, it seems interesting and unique. The plot is okay, and it's an interesting story line, that has a lot potential. However how it's executed just doesn't do anyone any justice. The use of steady-cam is unique and interesting I'll give them that, it's nice to see some difference in POV, to feel as though you are running along side them, however at times it got annoying and seemed tedious, especially when it pans to the door for a few seconds only for nothing to happen, you end up wondering what the actual point was. The acting was subpar, few actors were actually convincing and did the best with what they had, however those who weren't made the film less and less intriguing. Some scenes just made be cringe and want to walk out .  The gun flashes, ugh don't get me started they literally the most fake and pointless thing ever, they're unconvincing and unneeded half the time. Also the useless and eyesore of a scene, where the helicopter is viewing the city, and it looks like it was made with green screen and cardboard cutout in somebody's basement. I understand that low budget means compromise, but if it looks that bad and isn't even essential, cut it out.  The ending is ridiculous, the scene is painful, I honestly felt like I was viewing a paintball game, it's terribly unresolved and you're left angry at how you just spent the last hour or so of your life, watching a movie and it all turned out to be for nothing. You're left terribly unsatisfied and mad at yourself for putting yourself through a whole lot of stress for bugger all.  I'd give the movie a chance, but don't go in expecting oscar winning cinematography and an amazing plot."}, {"id": 53, "text": "Starting with an interesting political idea (US infighting) which is immediately forgotten, we are left to follow the two heroes in a very generic action flick that caters to the US fantasy of the populace successfully resisting an actual military force.There are so many missed opportunities there that it would be pointless to list them all, although I'm sure the writers envisioned many of them and knowingly discarded them for some reason, presumably thinking that their core market just wanted firefights.In conclusion, it's not a boring film as such. But it could have been a great film. Which it certainly isn't."}, {"id": 54, "text": "My expectations were exceeded and I found myself fully engaged in this film. Cast was strong and Dave Bautista has honed his skills.  The only character who's acting I found weak was that of Lucy's Sister Belinda. The opening scene is an amazing aerial view of New York City from Coney Island to the city. The single camera filming style creates a sense of being a witness to a serious situation rather than the usual multi angled, multiple take films with obvious flaws in continuity. Hats off to the camera operators &amp; sound techs. Great film."}, {"id": 55, "text": "Could have been a really great movie if they put some money into it. All actors except Dave Bautista are extremely horrible especially Zambrana. Very low budget but entertaining. Dave Bautista is the only one that makes it work and worth watching."}, {"id": 56, "text": "With its low rating here I wasn't expecting much, but I found this movie put the viewer right into the action and created a real sense of danger that is missing from most action films these days (6 Underground, latest StarWars).A simple story based on a scary premise, it shows real emotion, pain &amp; injuries to normal people rather than the invincible action hero star."}, {"id": 57, "text": "I tried to make it through this mess, primarily because I like Dave Bautista, but I couldn't stomach the horrendous acting from other cast members. The movie, which followed the Brittany Snow character, could not have chosen a worse actress for the lead role, as she could not have been less convincing. She stuttered out here lines as if trying to be shocked and frightened, but it all came out as forced and fake. I finally couldn't take it any more, and just shut the movie down. With an engagement factor of about 1.5, that wasn't a terribly difficult thing to do.Even for Bautista fans, this would be a good one to avoid."}, {"id": 58, "text": "I felt like I was at after party at a trump rally . I've read a few reviews,specially the weapons not used by ex Marine. The utterly idiotic mayhem,no police,No National Guard . The main thing is the ending meaning WTF ."}, {"id": 59, "text": "Now I'm bummed. Thanks, Bushwick.Some interesting scenes overwhelmed by inconsequential yammer. Reward for sticking it through is a bad aftertaste. Then again, I may be wrong. If there was some intent/hidden agenda to punish viewers then high-five.Not recommended."}, {"id": 60, "text": "I could not believe that two of my favourite actors were in this movie. I wanted to like it so bad just for them, but it let them down as actors. It was unconvincing, it was sime of the worst acting and directing Ive seen in long time and I feel like I wasted 94minutes of my life.. please just answer one question for .. why oh why was this movie ever made?"}, {"id": 61, "text": "Because clearly these guys just can't. I felt like I was in a graduate school film course watching the idiots of the classes final project and they think their one shot film is going to be creative and cool. Except it couldn't have been more obvious WHERE the cuts were. My god it was cringy. I couldn't get past it so I was mad the whole film making everything else irrelevant."}, {"id": 62, "text": "I was impressed with this film and acting by the 2 main characters. Don't understand how this was rated so low. Worth watching. You be the judge."}, {"id": 63, "text": "I can sum this movie up in one sentence. A loser and a former Marine try to escape a anarchist uprising by getting to a supposed DMZ, only to be killed right before reaching their goal.It's a total waste of time."}, {"id": 64, "text": "i found this to be a fun little film from Brooklyn. It feels as though it had quite a low budget but that doesn't take anything away from the film, the action is intense and when it kicks off, it doesn't let go, or at least, doesn't for a little while, every now and again you get a little breather and get introduced to a character who is either an out there bad guy, or an out there good guy, nobody is normal in this movie apart from our two protagonists. during these breather moments when we are not being introduced to some over acted cameo, we are getting to know the two mains. some nice score from Aesop Rock, the only reason i knew about the movie in the first place and feel they never used the score to it's full advantage, lots of scenes without music where a nice little rhythm could have given it an extra bit of tension. Worth a one time watch."}, {"id": 65, "text": "The backstory for this film try a bit too hard to be political and edgy but disengage your brain for a bit- it's actually quite fun. No spoilers but this isn't your traditional story arc for a film. There are a few plot holes (no spoilers) but i think the film does convey the sense of being caught up in something totally outside of your own control. The pace ratchets up with every scene, climaxing with the epic finale, which the film makers do a decent job of conveying to you with limited resources. Basically I watched this while playing a game- I intended to use this film as background noise but ended up being engrossed in the film and ignoring the game."}, {"id": 66, "text": "It's obviously copied of several recent films but that doesn't take away from it at all. I love watching Brittany Snow and she's mostly strong in this movie although she has to contend with weak dialogue from time to time and what I suspect is either bad directing or poor editing.  Bautista puts in a very strong performance so the two leads carry the film from start to finish quite competently. Especially as the film starts almost immediately and does not really let up til the end. That's a difficult thing to do and remain authentic so well done to the screenplay writer. The cinematography is excellent. Loads of flowing live shots which don't look cut, lots of real time viewpoint following and some really good action angles. Excellent job done there. It has a brave ending which most directors would not attempt, but it's handled well and is fresh and exciting the way it's done.  All in all a very good film."}, {"id": 67, "text": "High intense action and a must watch. It took me a while to come around to watching this but I can honestly say I am suprised and will be telling friends and family. Great to see Dave Bautista is hitting his strides now as an actor."}, {"id": 68, "text": "Well that's what it's like when a movie suddenly ends with no resolve and Bushwick gives you just that! Don't get me wrong the the movie's a welcoming thrill ride that seems to just end at its peak. No in- depth explanation of the chaos that's going throughout the movie.All in still a good movie exceeded my expectations just a very disappointing finish"}, {"id": 69, "text": "its a really low budget movie but I couldn't feel it. It's like perfect how they did the best they could with what they have, Also the actors were amazing, very unique story and representation of a very likely scenario that almost nobody ever think about.Anyway I really enjoyed it and I'd recommend it for anyone."}, {"id": 70, "text": "To start, this is a low budget film, so don't expect expensive production and Hollywood-type of camera work. The scenes are long, continuous takes. It takes you to the action and the confusion and gives you bits of information to work with while you go on an adventure and things start to make sense. As a bit of a video game geek in my younger years, I thoroughly enjoyed this aspect.I went out and saw this movie mainly for Brittany Snow; I've been following her work since Pitch Perfect, and this one was completely different compared to her previous roles, so I just had to check it out. While she was a bit lacking on the acting department, she was convincing enough for me to care about her character, being a 20- something myself. She's got good comedic timing during downtime scenes in the movie and good chemistry with Dave Bautista. The movie uses Snow's character to introduce us to the confusion. She starts off as someone as clueless as the audience, with no experience firing a gun and no idea what the hell is going on. Her character toughens up later on. I hope Brittany Snow continues to do more movies like this.The concept is modern day civil war (even acknowledged by Angelic Zambrana's character), which is not impossible to happen, given the current political tension in the US. This movie will put you into the action and there's no oh here's the problem, this is how we eliminate it formula here. There's no big boss to defeat here. It's making do with what you have; you don't completely know what's happening or what will happen, all you're concerned about is staying alive, which is something Dave Bautista's character echoes in the movie. It's all about normal people, with no control about the situation, just trying to get by. It's about a tight-knit community made up of different minorities (we see some Amish) taking the time to stop by, help a neighbor, and put away some modern day Confederates. Ignore the low ratings and go see the movie with an open mind. It's all about normal, everyday people just trying to stay alive. The ending was completely unexpected, which made me like the film even more."}, {"id": 71, "text": "Firstly I am a die-hard Trump (God Emperor) supporter. And yes I can see why some on my side are complaining. And I am also disgusted that when I google this movie pathetic left wing blogs prattle on about how this movie takes punch a nazi to a new level.I saw the movie as a low budget invasion movie that was actually pretty watchable and decent. Just f--king leave it at that guys and watch the movie."}, {"id": 72, "text": "The script is bad. I mean very bad. Acting was horrible. I've done a review, I had to do this one. LOL"}, {"id": 73, "text": "Well, to watch this one, one must ignore a lot of amateur errors. It has its moments, but mostly crumbles under cold logic. A movie kind of like a video game, but invokes a what would you do? reaction to its audience.The shock value of seeing a person on fire running works for 2 seconds, then you wonder why that person is still running off screen without trying to put out the fire. A few timing errors with squibs going off is to be noted. Lots of tactical errors from the invaders who are supposed to be military trained. Wounds that go clear through the other side of a limb can be fixed with a hot knife and rubbing alcohol.The south has risen again, and they think Bushwick, New York is a soft spot. When people fought back, the orders were shoot to kill. Just kill everyone, that's all. Ah, brilliant. Stay and kill when you are outnumbered.The shiny spot, in this tarnished work, is how two people are trying to survive that stupidity on both sides, and learning to work together. I also must give credit to the camera shots. They were excellent in capturing the feeling of chaos and did a good job in immersing the viewer into the film.The ending was predictable and annoying. Make them care about the characters, then kill them off for drama's sake.This was my reaction at the end credits. https://www.youtube.com/watch?v=otsiDOSvmyo"}, {"id": 74, "text": "6.5 easy..I gave it an 8 to knock out some low votes. Don't know why people we crapping so hard on this. Dave Bautista can't act, but he can be a decent person, and that's all that was required in this flick. Brittany Snow's character develops quickly, which is what happens when someone throws you into a war zone. Definitely recommend."}, {"id": 75, "text": "This film to me is a breath of fresh air from the typical canned garbage from Hollywood which relies on technological innovations to be entertaining. Bushwick is not perfect in many cinematic ways, but is a great story, with timely relevance that looks almost like a documentary. (no, not garbage reality TV)The role of Lucy was executed almost perfectly by Snow, and Batista succeeded in making me love him. My favorite component is that it was made with a small budget. To me that's the ratio I love...small budget/big entertainment. It was a 1 1/2 hour film , in that time couldn't tell the full story and develop it properly. But that is not the fault of the production team, but the fact that they had to produce with a limited budget and probably schedule. Maybe I just appreciated it being a former New Yorker and know that this is how it would look in NYC if an event like this happened."}, {"id": 76, "text": "This is a white raven in the invasion-thriller genre. It's got all the tropes, but with interesting camera work, and a 'twist'; not the commies are the agressors, but the good 'ole boys' from the south.So, that is why you got a lot of reviews here calling it a 'lefty'/ 'liberal / (anything derogatory left) wet dream. It's because They Can't Be The Bad Guys!Don't believe then, just watch it for the fun low budget flick it is. And if you can't stand that the bad guys are southerners in this movie, just pretend they are Russians or something like that."}, {"id": 77, "text": "I liked the idea but the story is a bit weak. Even though the acting was not that good, it's still an enjoyable movie. The ending is also way to random and open for my taste.My biggest problem is how the main actor wears his BACKPACK!! What the... it maybe is considered to be cool when going to school but in a war zone it is just stupid! That bothered me throughout the whole movie!!"}, {"id": 78, "text": "Well..let's just say I'll never get those 94 minutes of my life back. Characters aren't relatable, plot is very thin, and just overall not a good movie. Don't waste your time."}, {"id": 79, "text": "Overall good plote, however the movie has huge inaccuracies. A Marine cant but a medic, much less a 68W. That's an Army MOS and corpsman are part of the Navy and are assigned to Marine units to provide medical support. Bestia's character is supposed to be a combat veteran. However he shows very little tactical training other than moving to cover when under fire. He doesn't take a captured enemy's long gun to provide long range protection."}, {"id": 80, "text": "Bushwick starts off incredibly strong. It took me six minutes to realise i was watching a one take shot, and it kept going. That is high praise indeed. Not only this is an incredibly difficult technique to execute, but to make it invisible like this film does is top tier filmmaking, and then, when about twenty minutes had passed, i realised, ah, this is what their doing. Of course, there are invisible match cuts here and there, i mean this ain't Russian Ark, but Bushwick takes a thrilling premise that was a hot take approach for 2017, and executes it quite well.Dave Bautista and Brittany Snow give good performances and they fit their parts. I wish they didn't reveal the major plot twist on the dvd's blurb. The reveal of this twist was a very fun slice of speculative fiction and would have been a lot more effective if i didn't know where it was going, even though it was foreshadowed to to all hell. It added a lot of now-ism to a film that already had a very now-ish style and even though some viewers might find this film's depiction of a second American civil war a little far fetched, it was more than realised enough for a ninety minute genre film i found.After the reveal, more of the film's message surfaced and just made the film more interesting, more New Yawk in flavour. New York of course is known, to any self-respecting cineaste, to have a truly rich history of regional filmmaking and Bushwick definitely follows that lineage. Talk of Bushwick being a latter day Escape From New York are not too far fetched with this being a film with good drama, good action, and a high concept executed competently."}, {"id": 81, "text": "So 1 single thing bothers me about this film. With all the street skirmishes going on and snipers to seek cover from... neither her nor the dude who was a marine thinks it might be a good idea she take off the red blazer?Stupid detail I know but what ya' gonna do. Otherwise great movie."}, {"id": 82, "text": "The weirdest film I've ever seen, The work is bravely acted by the two lead characters particularly Dave Bautista who, when allowed, actually brings some emotion and pace to the piece. The film itself is a bit like watching someone else play a computer game that they know well. The characters move in random directions moving through one poorly choregraphed combat scene to another. Snow's character over a couple of hours develops from not knowing how to fire a gun to being able to double tab one handed and wounded and hit moving targets. The paramilitary force seem to have total air superiority over New York even though the US army hold areas within a few blocks. The bad guys frequently stand still to allow fleeing civilians to get within punching distance. All in all sloppy and vague with action worthy of a computer game cut scenes."}, {"id": 83, "text": "This is a well done low budget movie with a TERRIBLE script. I'll save you some time. The two main characters DIE. I don't know why people write scripts like this and how they get turned into movies boggles my mind. There is not enough depth written into the these characters to make it tragedy. And if it's not a tragedy, IT IS JUST A WASTE OF TIME. I like Brittany Snow and Dave Bautista is carving out an interesting career path but someone should have put their foot down and said the ENDING SUCKS. Even the equally cliche 'they fight through one war zone to find the whole world is a war zone' cliche would've worked better. Actually they have that one here, as well as a special DOUBLE F-You to the audience. It is a total waste of the audience's time to invest in characters that are going to die only because of sh!tty writing. SMMFH."}, {"id": 84, "text": "I was constantly confused throughout the entire movie about what was going on, i then wanted everyone to die, except stood. who was then shot by someone hiding in the bathroom? On a more professional aspect, there were too many transitions, and the transitions often left me feeling confused. so i personally hated the movie."}, {"id": 85, "text": "This was one of several movies I've watched recently that have been interesting up to a point..and then the movie just ends. Like this one. No conclusion. It just stops. I was left scratching my head about what happens next? Therefore I give it a thumbs down review! The minimum review guidelines here are five lines of text, but what else can I say? The ending (non-ending) spoiled the entire movie for me."}, {"id": 86, "text": "Obviously a totally left slanted movie. Horrible, everything in this garbage movie from acting to special effects and everything in between. There could have been much more substance to the movie had they made it an actual modern day civil war between the left and the right. Texas and perry are nt the only ones to make comments about leaving the union. California has constantly been spewing their desire to leave with attempts to get it on the ballot. Could have done a much better movie but the effort to malign the right apparently was the overall intent with no actual bringing everything presented together in the end."}, {"id": 87, "text": "This quickly and shoddily made leftist propaganda to inflict yet once again the notion that White Man Bad and they use a 'White Militia motive to push the idea quietly. The Acting was so poor as to be laughable, the graphics were lower then a B movie quality and the whole storyline was so all over the place it made it a nightmare to even stick with it. I finished it just so I could get the sticker that said I survived this nightmare of a movie.Worst movie of the year award right!"}, {"id": 88, "text": "Unwatchable, do cheap and bad it's unreal....very sad effort"}, {"id": 89, "text": "I am conscious that my eurocentic observations may be consciously blind to much of the politically charge rhetoric shared by many of the reviewers. Even though the premis of the plot is extremely shaky and the tactical situation described is a total fantasy - I found the film really engaging. The camera work, if a little overdone at times, was engrossing. The plot leads with ACTION, ACTION, ACTION; but is supported by a thoughtful and intelligent approach of not spelling out all the plot and leaving much detail only hinted at. The acting was believable and Bautista really captured the essence of a damaged grieving veteran. The end of the film was a powerful commentary on the fragility of life and how war, violence, aggression does not always follow a 'Hollywood' style narrative. Go on give it a go."}, {"id": 90, "text": "Did not know what to expect when this started but I rate it the perfect rollercoaster. The cpmplete lack of Disney complex earned it top marks in my book. The characters interact like real people under immense stress and there were no unrealistic acts of heroism that so often infects the action genre. BRAVO."}, {"id": 91, "text": "OK. OK? Hum. OK. Do not watch. Please.  Why? I wanted the movie to be good. I couldn't"}, {"id": 92, "text": "Suspending disbelief can only take you so far.Silly plot.Poor dialogue.Little to no effects.2d characters.Poor acting.Free on Netflix and way overpriced."}, {"id": 93, "text": "Great story, liked the characters a lot, well paced and acted. I liked the camera work too. It is 90 minutes of pure distraction."}, {"id": 94, "text": "This was maybe one of the dumbest movies I've ever seen. There are a hundred reasons why it wouldn't work but I think you're not supposed to get to hung up on that. The acting was bad all around.That all being said, it was pretty darn suspenseful! It kept my attention from beginning to end. The style reminded me of Cloverfield which I loved.It's definitely worth a watch but try and take it for a quick action movie and don't get to bogged down with the details."}, {"id": 95, "text": "I read a lot of reviews that say this couldn't happen, I'm yes it could and probably will. Did you not see what almost happened in Michigan????? Trump has drummed up hatred and promotes violence. There is a scary movement that's based on hate a false claims just like this movie is conveying . What happened in this movie is easily believed if you aren't blind to what's going on. Dave Bautista did and excellent job with very little hes becoming an actor, brittany snow also was excellent, it's a great movie low on boring dialogue and high on action and hopefully will open the eyes of people to see this COULD happen. BRAVO mr Bautista!!!!"}, {"id": 96, "text": "Great mayhem and good special effects. Dave B was really good in this role and so was blondie. Lots of action and it is an interesting plot that is real enough to make anyone uncomfortable thinking about it. My biggest issue is the open ended finish of the film. It's like, really you are going to leave us all hot and bothered and then, just go?!?"}, {"id": 97, "text": "Dystopian emotional shocking thriller that leaves you guessing. Great into great story and unconventional filming"}, {"id": 98, "text": "Honestly..In watched this movie 2017 and I liked it..and I was so surprised with the bad comments..then again I am not an American so I let it go. Now in 2020 I gave it another shot and guess what..I do now understand why people did not like it..but honestly..change the right to the left and you got yourself Bushwick 2020..easy as that..good movie..hope not reality"}, {"id": 99, "text": "A fun What If..? Movie..! Its fun ! I too would love to goto battle in Brooklyn.. Fight the Bad Guys and ultimately WIN !! So they have to reshoot the ending of the Movie..! And they Gotta be thinking of sequels..! Fighting In Brooklyn they gotta goto the other borroughs like Manhatten, Queens and Staten island..Thats 5 movies... Come on ! And keep your main characters alive.... and toss in some plot twists.. like the captured soldier lied to them. Have them in a running battle the whole time that segways from one movie to the next... and toss in all the conspiracy theories as real... just play em out one after the other... never stop the confusion about what the hell is going on... and keep those main characters alive for sequels...."}, {"id": 100, "text": "The soundtrack is the standout. Aesop does an amazing job pulling you in with a Tangerine Dream-like score. The script is very clipped and no nonsense. My only complaint is the facade that the shots are one-takes. I'd say there are easily 50 edits here, so not sure why they felt the need to ROPE in the viewer? Filmmakers, would love your input here."}, {"id": 101, "text": "Think of it as Attack the Block but with a militia instead of aliens, 28 Days Later with a militia instead of rage zombies, or perhaps The Purge but with a surprise attack instead of a violent holiday. The dialog and acting are good, action is scary and surprising, but what really sucked me in was that it appeared to be a single cut. I think perhaps there was some editing and cuts disguised as a brief darkening of the camera view, but essentially the entire movie played out like the raid halfway through the first season of True Detective. Considering the realist timeline, it's impressive that it even has a bit of character development between Lucy.(Brittany Snow) and Stupe (Dave Bautista)."}, {"id": 102, "text": "I lost my time with the worst movie ! No beginning....no end"}, {"id": 103, "text": "I'll probably attend the next gun show held next month in my city. I need to stock up on some ammunition and prepare for the Marshall Law that will soon come in my lifetime. That's the message I received from this movie. Stir up America and create a new civil war.Overall, the movie was great. I really enjoyed the floating camera effect. It appeared the entire movie never had a Cut. Acting was good."}, {"id": 104, "text": "I was totally enjoying this movie until the bad end. Its a feel bad movie. Don't waste your time."}, {"id": 105, "text": "First off, Dave Bautista did a very good job! Believable acting and natural. Brittany, not so much most of her lines seemed forced and not natural. To give her the benefit of the doubt, I blame the director! Speaking of which, it is NOT a surprise that this is the directors 2nd movie ever. The flow of this movie was not as smooth as most people think. I feel so bad for the editor!!! It felt like every 2 minutes the scene was ending with a pan of the camera to a dumb wall or a dark corner! This camera trick, with good editing, can make a scene seem longer with one take. However, this was so overly done, there were so many times where you see the splice! Not so flawless. One scene where Dave and Brit are on the roof, and the climb into a tower section to get the glass out of Dave's characters leg, you clearly see Brittany head in first head to the right of the screen, milliseconds later, she appears on the left side of the screen. So many mistakes like that could have been easily avoided had they not to soooooo many cuts, and faked the single shot filming that much."}, {"id": 106, "text": "Well, this movie could have been good.There were some good things about it, for example, the opening scene is pretty freaky when a guy engulfed in flames runs by in the subway -- jarring and disturbing and really draws you in. Also, it was great that the death of the lead female's deeply annoying soy-boy bf dies horribly early on. David Bautista was good. And the single-camera method was effective in giving a sense of video-game immediacy.But there were other things that just didn't work so well. The plot premise was kind of loopy and the exposition of it seemed just stuck in at random. The military tactics had no rhyme or reason to them. The cool black granny seemed kind of contrived and likewise Bautista's moment of emotions in the laundromat. The priest killing himself was totally pointless. The biggest disappointment is the final scene -- it's like the director couldn't fiture out how to render it covers it up with chaos and darkness. Supposedly they are escaping to an army safe-zone, but there is no sign ot the army anywhere. And then having both the main characters die, rather than being artistic or philosophical, just tore out any sense of a point for the whole film."}, {"id": 107, "text": "An American action thriller. This dystopian story has an interesting premise: what might a second American Civil War look like on the streets of suburbia? Annoyingly, it winds up a weak attempt at political satire. The acting is inconsistent too - characters lose loved ones tragically in one scene and yet this hardly figures in their emotions in scenes a short time later - in fact some are cracking jokes. The fact that it doesn't shirk away from being uncompromising in the third act is to its credit, but with a sketchy story in between it failed to live up to its first act promise."}, {"id": 108, "text": "This was bad, really bad. The two leading female actors simply can't act. The story seems to have been written by a 10 year old."}, {"id": 109, "text": "I tried to give this movie a shot as the story line sounded interesting. The concept was there but the acting made it so annoying to watch. Can someone please re do this movie with better actors. I only got 30min in."}, {"id": 110, "text": "Hmm, going to keep it short and simple. It's a good popcorn movie, put your legs up and enjoy. Don't over analyze, think too deep or try to associate it with a real life situation. I did and unfortunately, I ended up as one of those guys shouting Oh, c'mon and seriously?Spoilers As a ex-military, Dave runs around with a handgun, does not pick up a single assault rifle, webbing or even body armor. Knapsack is slung on one shoulder thus making weight distribution uneven and perhaps even affecting his aim?Like I said, popcorn, soft drink, legs up, enjoy..."}, {"id": 111, "text": "I'll keep this review short, Brittany Snow was quite good. I dont want to give spoilers, but im not sure what the point of this movie is??Is it not to trust others and save yourself? cos if you try to save and help others, you die.The action felt real and good. The fact they remembered their injuries throughout the entire film was refreshing, i still dont get it..."}, {"id": 112, "text": "'BUSHWICK': Three Stars (Out of Five)  A disaster action/horror flick about a military invasion of Brooklyn,  in which a war veteran and a young woman try to cross five war-torn  blocks of Bushwick together, just to make it to their homes. The movie  stars Dave Bautista and Brittany Snow. It was directed by Jonathan  Milott and Cary Murnion (the duo also co- directed the 2014 indie  horror-comedy 'COOTIES'), and it was written by Nick Damici and Graham  Reznick. The film has received mixed to negative reviews from critics,  and it's also only received a VOD and limited indie theatrical release  at the Box Office. I thought it was OK.  Lucy (Snow) is exiting a subway in Bushwick, with her boyfriend, when  they're attacked and her boyfriend is killed. Lucy tries to run to get  help, when she realizes all of Bushwick is under a military invasion.  She manages to avoid being killed, with the help of a war veteran named  Stupe (Bautista). Stupe then reluctantly helps Lucy make it to her  grandmother's, and the two try desperately to survive the brutal  invasion together.   The movie has a very strong Walter Hill '70s/80s' B action movie feel  to it. That's what I like most about it. I also like seeing Bautista in  the lead, and the motive for the military invasion is pretty  interesting. The film is also kind of pointless other than that though,  and in the end it's not really that entertaining. It did hold my  interest (at least) throughout it though. So I think it deserves a  slightly above average rating (at least) for that."}, {"id": 113, "text": "One of those movies, with improbable and simple idea behind, that make me wonder about affluence of my spare time and states of mind in which to watch them. In the beginning there are many not logical and unanswered questions (e.g. at start how that large scale attack happened during a single train ride incl. changing lines? Or, why everybody's shooting everybody?) Sirenes, choppers, smoke, blood, fire, bang-bangs, so on... Not a clue to make just enough of introductory sense for the first third of the movie, along just mentioned street fighting and running (generally: black uniformed guys shooting everybody incl. civilians). Put it short: hellish urban warfare. Then, after half an hour, the script is getting somewhere where I also got this strange feeling of black humor, esp. when hood-gangs and high sis appear. As for the acting, it's not that bad as one would expect, though at first half there was not much to act about. Quite fast action not lacking violence, all the time. The movie budget is showing, not in cast as much as in effects, stunts, camera and stuff being destroyed. Note the decent directing. Finally, after that hour of 'cracky' urban street/basement/roof pandemonium, there's a sort of tightening of the story-line. I somewhat enjoyed the movie, together with number of wicked moments (e.g. protagonist duo is getting actually acquainted with each other on the very end). I always liked the urban NY all together feeling, so: fire up, switch-on to get simple fast tempo far-out! You'll be pleasantly surprised few times; that is if you don't expect serious and deep stuff."}, {"id": 114, "text": "I generally do not write reviews but was spurred on by reading the other reviews here. Many of them make two presumptions: one, that this is not an entertainment website but a political debate forum, and two, that when you post a public review, your personal point of view matters the most.Carefully avoiding those two, I would review this movie in the following manner, as neutrally as possible.1) Story: 6/10. A hybrid of alternative history and probably a doomsday-start idea, is not bad except a few plot holes that cannot be covered in so little time or budget. But not the particular error that everybody seems to think impossible. For these proud 'mericans, I as an outsider can say that many nations have broken up from inside before, and they were just as human as Americans. Once you step around the blind patriotism, you can see where the actual errors in plot lie. [*** SPOILER*** For example, the absence of the home team in the field -- I don't know if the budget prohibited this, but when the motherland is under attack you expect to see at least a few APC's crawling around, and the other dudes cannot afford to leisurely cruise about in copters unless they have total air superiority, ja?]2) Screenplay: 8/10. At many points during this movie I mentally prepared myself to digest a while of meaningless drama - and was pleasantly surprised. Later I tried to imagine what would a big-budget studio with an insufferably famous actor in that role would have done; and found myself answering, same old s**t forced down my throat, which will have little if any continuity later on anyway. The writers here were wise to think of common sense: when bullets are whizzing by, only superman can afford to be melodramatic. And the people depicted here are very much non-super.3) Camera and editing: 5/10. I am giving it the middle rating under the force of impartiality only; otherwise I would have given it a 9/10. The end-product that was in vision here was a sort of hybrid between a streaming game and a standard thriller movie, and I'd say they did achieve such. But the problem with such a view is that either you like the handycam or you just don't -- there's no real middle ground here. So, it will give headaches to those who can't digest live-action first-person footage. Others will feast on the no-cuts game-footage-like immersion.4) Acting: 5/10. Miss Snow was great when action is required, but needs to inject life into spoken words. Bautista was impressive in displaying a nice balance of self-control and only-human, otherwise, not much to speak of. Supporting cast did their best, I guess, according to the low budget.5) Music: 5/10. Another forced-by-partiality rating that is personally a lie; I like very little background music and this being a realisticmovie they did the right thing to use such very little indeed. Though the parts of respite may have needed some ornamentation, imo. However, this is another hit-an-miss thing; either you like loud bg-score or you like them muted or none whatsoever. Thus the median rating. Anyway, what little is there is not bad. Btw the surround sound effects are quite well done, in the job of bringing out a conflict-zone atmosphere into your living room.In conclusion: a gust of fresh air for most of the young-adults out there, a headache for the older and serious customers. The political reek, intentional or not, should be utterly ignored in order to enjoy this movie properly (in its place as it is) - otherwise, to both teams, this will feel no more than propaganda.Perhaps a sequel will come out to fill in the gaps, or better, to continue the alternate history."}, {"id": 115, "text": "Please save yourself almost 2 hours of your life. The movie has an interesting concept however the main characters which you get to watch throughout the film and get somewhat attached to die in the end... that's it.If you are happy with that then watch the movie, I won't go into what is happening, will not spoil the actual story but I did wish that I new that the ending is just like really really bad sex where you don't get to finish."}, {"id": 116, "text": "Another liberal agenda movie. This movieakes no sense."}, {"id": 117, "text": "I see in the beginning of the movie the station Church Ave it is not in Bushwick are. then she walked to Willoughpy Ave to visit her grandmother which is not in Bushwick area area.. and then to Cypress Ave...which is not in Brooklyn at all.. it is in Queens and there is no way she could walk from Willoughy ave to Cypress Ave,, the streets are all messed up.. I lived on Bushwick Ave and in Ridgewood...All of those..streets you could NEVER walk from any of those streets to the other,,, on a bike you could ride to them,,if you are going to make a movie make the streets correct. Grover Cleveland Park is in Ridgewood Queens,, NONE OF THE STREETS WERE IN BUSHWICK AREA..no where near Bushwick ... why name a movie called Bushwick , why not call it,, BROOKLYN/QUEENS"}, {"id": 118, "text": "I watched just over 30 minutes and switched off the TV. First time in many years, that I gave up on a movie and turned off the TV. It was something about some states of the USA breaking away in a civil war way? It seemed to be going nowhere, lots of shooting and running and that's about it. The settings are dull and characters are even duller."}, {"id": 119, "text": "Lucy (Brittany Snow) is bringing her boyfriend Jose to visit her grandma in Bushwick. They get off the subway and all hell breaks loose. Jose is killed. Men in black are killing everyone in running gun battles in the streets. The police is nowhere to be found. Lucy tries to hide. She is rescued from two thugs by a janitor named Stupe (Dave Bautista).There are too many things that don't pass the smell test. I don't mind the confusion of the start but it can't be nonsense. It does try to explain the men in black but again, it's a lot of nonsense. There is a way to make it make more sense but there is an almost desperate need to keep the overall world structure simple. That also goes for other issues. They almost never just kill a man in black who is down and out. It's annoying to see people knock out a man in black in hand to hand combat and not double tap him in the face. They also rarely strip the men in black of their weapons except for a few handguns. Apparently, people are willing to march into gunfire with nothing more than sports equipment. I call it comic book simplification. It's less egregious when the hero is wearing a cape but this is trying to be 'Realistic'. Trying and failing is sometimes more annoying than not trying at all."}, {"id": 120, "text": "So, given the times we live in this probably wasn't too far off what some people expect. A B grade movie that had my interest despite scenes that at times were a bit too far fetched for me. But the ending is such a downer I was left wondering what was the point."}, {"id": 121, "text": "So thought I would give this a fair go as I like the idea. Well pretty good throughout i would say. Action was good and some good effects! Just the one thing for me but watch it and see....."}, {"id": 122, "text": "This movie was a complete waste of my time. I am so glad I watched it online. I would really be angry if I had actually paid to see it. Give me my hour and a half back."}, {"id": 123, "text": "Stupidest fricken ending ever..... too short....... well ladadadalalaladada"}, {"id": 124, "text": "I sat down to watch this movie on Netflix without knowing anything about it except for the few words the description on Netflix listed. I often do that, sometimes being pleasantly surprised by what I get to see, and that's how I felt about this particular movie. It is definitely not a perfect movie, and you'll see some big flaws right in the middle of watching it. For starters, it's a little odd that the loyal U.S. military forces would not arrive and start fighting back a lot sooner than they do. (You would think that they would at least send some air support fairly quickly.) Also, the protagonists have ample opportunity to take the weapons and gear of the fallen enemy combatants, but they only do this ONCE in the entire running time. And the very ending of the movie (which I won't reveal) is for the most part very disappointing, leaving many viewers to think they are being cheated in some way.But fortunately, the movie does work for the most part. It's a very skillfully directed exercise, being that it's directed in a real time fashion, with seemingly very few clear edits. Instead, the movie plays out almost like one uninterrupted shot (though if you look real carefully, you will see where there are edits from one shot to another.) The movie also has a feel of authenticity, coming across as a more realistic treatment of the premise than you might think. The action and suspense scenes are also well done, containing a lot of excitement. If you are prepared to overlook those aforementioned (and other) flaws, the movie does manage to be effective enough to make it worth a look during a slow day."}, {"id": 125, "text": "The worst movie I've seen in my entire life, without beginning or end, the productors should be clarify that it's just a test of actors (very bad), and director. The book, written by a madman."}, {"id": 126, "text": "Poor script, even worse acting, terrible plot. The whole premise is ridiculous. And what marine veteran would not take the automatic weapons from fallen enemy combatants? His pistol seemed to be all he needed against superior firepower. Some glitches too: when the vet and the blonde leave her grandmothers house, across the street there a bunch of people just standing, waiting, while the soldiers are shooting everything in sight. And the grandmother is obviously breathing. Don't bother."}, {"id": 127, "text": "This movie's got its flaws, but if you can just go with the flow, it's a well-directed urban warfare thriller.The gimmick here is that it's mostly one long take. There are a few breaks in the shots but almost all the action is seamless. The best part of this is that it's very well filmed without any annoying shaky-cam. The acting is mostly pretty good, although there are some weak points.The essential problem with the film is that it defies common sense. You have to be willing to simply accept that this army actually thinks it's worth invading this neighborhood, which is fairly implausible. There are also some narrative issues that I won't go into in order to avoid major spoilers. If you can get around this stuff and just go along for the ride, I think you'll enjoy it."}, {"id": 128, "text": "The film isn't going to win any awards but if you're like me you've seen almost every movie going and need so thing to watch it isn't a bad movie it's just not amazing I really enjoyed the film except the ending"}, {"id": 129, "text": "Everyone chill with the long explaining of your personal opinions. I liked it because the directing had no bullcrap cutscenes."}, {"id": 130, "text": "There was lots of off the rack hockey and football gear on the militias. It was almost a road warrior off shoot.This was a great film. I am from South Carolina. The premise was not thrilling to me. Then again, Pennyslvania seceded. I think one civil war was enough. The film captured what New York would look like if it was a war zone. At first the film was very cynical in it's view of people lacking law and order. By the end everyone was helping everyone escape. There were no racial lines or classes. Thr main character Gentiles helped a wounded Jew. It really showed the full spectrum of human decency / depravity. The film was not without flaws. Please bear in mind I am not trying to bash the film like a self-entitled Hipster Millenial who has YET to write a masterpiece screenplay. A lot of work went into making this and I acknowledge that. Good job, guys (zero sarcasm).Okay. The Marine guy Stupe said he was a medic in the Corps. Huh? The Navy supplies the Marines with medics (Corpsmen). The Marines are actually a part of the Navy. That's why Marine stands for (M)y (A)$$ (R)ides (I)n A (N)avy (E)scort. This is fantasy. Maybe in this universe the Marines train their own medics? Or maybe Marine Force Recon has their own medics? I accept that. But i suspect that the writers made a goof. It is forgivable. The one big plot hole that baffled me was when the crazy black woman held the girl's sister hostage. She forced Stupe and the blonde gal to go recruit people from the local church down the street. Her son would provide the guns while the white folks would provide the warm bodies. The sister would be returned after the two parties met up at the laundromat. The mom said that a black person wouldn't make it to the church without being shot. Okay. It may be true that people of differing ethnic groups are afraid to go into certain parts of New York City. That's why you move AWAY as soon as possible (and unwittingly avoid the doctrinal speaking, selflessly motivated zealots who invade your neighborhood). Racial paranoia is definitely real. While watching this scene unfold i asked myself this: Are black people really afraid of being shot by white people?. Isn't it the other way around? I think white people are better known for being / causing serial killers, genocides, mass bombings and shootings. Unless we are talking about mountain folk in East Tennessee, white people generally only shoot people who break into their house. This whole scene would have made more sense if it was a crazy white lady doing it. I think I am missing a key geographical and cultural tidbit from New York culture that makes this scene work.The point here is that the lady had an irrational fear. The whole premise broke down when Stupe and the blonde gal were pushed back onto the street. There was a giant mob of neighbors walking through the street. Why go all the way to the church to get people? Use your neighbors, crazy lady. The whole plan fell apart and the sister ended up being okay. The story didn't have much plot. It was a decent idea, but it wasn't very realistic. The one theme throughout the entire film is the chaos of an urban environment. The director did an amazing job making the skirmishes believable. I did take issue with how inaccurate the bad guys were. The bad guys were in cover with weapons braced. They fired on a mob running down The street. I assume they were highly trained. They definitely were well armed. That mob would have been cut down. It could be that the BGs were not expecting resistance and left the heavy weapons at home. That makes little sense to me as an Army Veteran. To quote the Kentucky kid We were following orders. This may be why they left their heavy weapons at home. The BG's intelligence said they shouldn't have much resistance (I wonder if that has to do with New York almost seceding during the civil war).Since most of a platoon's firepower and killing ability come from their squad support weapons that may be why the mob was able to run a-muck. In real life, dumb a$$es that run through established fields of fire IN THE OPEN get killed. The movie was very lethal. It should have been more lethal in the giant mob scenes. My take away is the militia were highly motivated with high morale but inadequately trained.The few talking scenes do a great job showing the character's humanity. You get it all from the slutty sister, the Hasidic Jews battling the militia, the market owner, the sleazy gangster types, the overwhelmed priest &amp;c. Stupe's story is particularly hard on the feelings. This is a great film to watch. It's flaws are minor. Bushwick is one of the top 5 films i have seen in 2017. Recommended!"}, {"id": 131, "text": "This movie is by far the worst movie I've ever watched. Really?!! those rioters or domestic terrorists or whoever they are, go home by home and kill people and the Unites States military staying with 10 soldiers at a park to evacuate people who can get there? And things get worse when you realize that those domestic terrorists have surrounded the park (actually surrounded those magic helicopters within about 100 meters) It's like the terrorists shoot people only before they get the helicopters and after that they'll let them leave Brooklyn safely They go to the church to let them know that just a block away, there's enough weapons for 1000s of people and they crazy priests shoots and kills himself!!! really? And when you think it won't get worse just 10 minutes before the end of movie, Dave Bautista , not in the battlefield but at the door of a washroom, gets killed by a crazy girl who was sitting in a washroom and for some reason hadn't heard Dave and Brittany's conversation. I know you thought that was the most stupid thing that can happen in a movie- don't get me wrong I had not problem if he would get killed by mobs or terrorist in the street- Brittany gets killed just less than 100 meter away from the United States' military, 30 seconds before the end of the movieOh"}, {"id": 132, "text": "Nothing good in this movie....sorry. Waste of time."}, {"id": 133, "text": "I am advising to not wast time , awful move get you headaches, the story in general But when it's come to the deep you will find it's become child move , girl 16 or 17 years old turn to be wounder women within a hours , the casting was awful . In general it not worth to spend you time @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@"}, {"id": 134, "text": "I kind of liked the acting and actors so I gave it 4 stars. But the premise was so stupid I subtracted -13 stars.The idea that southerners want to invade New York and kill people of color is just too much of a stretch for me. The premise of the movie is just too terrible to suspend disbelief. It's a leftist fantasy film about their imagined struggle.If I had known that going in I wouldn't have wasted my time.Oh, and the ending is just meh. At least develop the ridiculous premise and resolve it. It left me thinking they were hoping for a sequel, which Netflix will probably do because it's obviously desperate for material."}, {"id": 135, "text": "Seriously. Another garbage tier film from a morally bankrupt industry. I hope sht pops off. Sick of you fools.If an actual civil war happened, the left wouldn't last a week and the right wouldn't need to fire a single bullet."}, {"id": 136, "text": "This is just an abysmal movie that could have been much better with good writing, good direction, and good acting. The film was OK until the two main characters meet up with crack smoking sister. Awful! The premise of a hostile overthrow of the US government and the secession of southern states is a good one and one that could possibly occur, but not anywhere like the story told here. Let me save you 90 minutes...they both die."}, {"id": 137, "text": "the movie sounds AL great and AL kind of stuff. but it isn't the actors where bad like really bad. at the and it AL co-ms down to the point that AL main character get shot and the hole movie just ends like sh*t.so if your interested to wast a hour and a half watch this movie if you are like me and want to watch a good movie. don't watch this."}, {"id": 138, "text": "Lucy (Brittany Snow), on school break, is taking her boyfriend to meet her family in Bushwick. She tells him that he is supposed to be the brave male, man-up and protect her....moments before he is blown up. At this point we see Lucy evolve from a helpless girl to a leader. The city is under siege, similar to Red Dawn and we don't know who the enemy is until 50 minutes into the feature unless you read the short plot spoiler description.Lucy teams up with Stupe (Dave Bautista) a PTSD janitor who fought in Iraq and is not all there.The characters were not over whelming and their interaction was boring as this was run, hide, fight. The other disappointment was the ending. Seriously? Dave Bautista is no Patrick Swayze and Brittany Snow is no Lea Thompson.Guide: F-word. No sex or nudity."}, {"id": 139, "text": "Stupid leftist scenario ever I seen, hbo you are just dumbiest corporation, you should work in north corea only! 😍"}, {"id": 140, "text": "I turned it off after 30 minutes. It was going nowhere. The acting is horrible, the only good thing is that it makes Bautista seem like decent actor in comparison. Yes, it is action packed but... why? seem some people enjoyed it - good for them, maybe it gets better later, I do not intend to find out. Exact score: 38 / 100"}, {"id": 141, "text": "A piece of far left (progressive) propaganda. A reality is that these very bustards direct disruptions, looting and hate..."}, {"id": 142, "text": "Great use of the stead cam that makes this film feel so real. With that said, until I saw this film I couldn't imagine what a civil war in the United States could possibly look like. Now I can.If you've been following the political maneuvering between the Democrats and the Republicans and between Biden and Trump supporters and this film takes on an eerie sense of what could happen. Let's hope it stays as a fictional piece."}, {"id": 143, "text": "I could forgive a lot for this movie - the fact it Barry shows you much of the real action, the limited acting skills of some people involved, the slightly low budget quality. However, the final 30 seconds ruins everything. It is rare I feel a movie has wasted my time, yet that's how I feel here. Nothing poignant or meaningful, just a middle finger to the viewer. Do yourself a favour and don't bother, you might think there is a semblance of something worthwhile only to have the last few moments destroy any notion of that."}, {"id": 144, "text": "IMHO, if you don't live in Brooklyn you just don't get it. Born and bred in Brooklyn, I truly believe Brooklynites would rise up with their weapons and toughness to repel any type of invasion. It's also true that there would still be divisions from within because that's the way of Brooklyn as well as ethnically diverse areas.So forgive me for tooting the horn for the way this part of Brooklyn was portrayed.With the way 2020 is going so far, I wouldn't discount this movie."}, {"id": 145, "text": "The good first: the action was well done, the two main characters had great acting, and there were couple of fun bits sprinkled in.Now the bad: The first thing you have to do before you sit down to watch this movie is leave your logic at the door. There are time when you may try to apply it to this movie. Don't. It's pointless, trust me. Also, the VFX was complete trash, with whole columns of smoke moving as the shot panned, among other things. Just terrible. Some of the non-main actors were really not very good, or maybe given bad lines/direction. And my biggest problem is killing off both main characters in the last 15 minutes of the movie. Dave Bautista went first, and that by itself was fine (I actually appreciated that they didn't give him some dying monologue or something. He was shot and died. Good to avoid the overused trope), but then literally 20 seconds before the credits the other main character dies for no reason. WTF?! Was it for shock value? Who knows?! Again, no logic.I read some reviews and thought it would be a fun, mindless action movie. Don't do what I did, spend your time better."}, {"id": 146, "text": "This movie is an accurate portrayal of martial law, and how it would look like here in New York. It it not that far off in accuracy. Good acting and fast-paced movie."}, {"id": 147, "text": "Bushwick directors (Jonathan Milott, Cary Murnion) try to make their small movie a unique one by trying to make it continuous shot action movie with a political take on it, and focusing on just two characters but the biggest obstacle that they did not overcome is the small budget because there is alot of CGI in the movie and it's not good and the thin plot did not help that much unfortunately. But that's not me saying the movie was bad it was sold, befitting from the two main performance from Dave Bautista and Brittany Snow and a sold action scenes, great camera work that make Bushwick a sold movie but not with out It's faults."}, {"id": 148, "text": "I decided to go for this movie because I love seeing great results with limited budgets. Bautista is underrated as an actor, and the combination of unique shooting style and a story that makes you wonder if it could really happen, intrigued me. Plus, being an Aesop Rock fan, I just had to see how his soundtrack was used.I really, really loved the movie, right up to the last few minutes, where the writing lets the audience down twice in a row. Watch it and you'll see what I mean when I say this: You'll have your hopes dashed, then you'll hope it was worth it, then your hopes get flushed down the toilet. Without spoilers I can say this movie ends in what must be the laziest type of storytelling ever. I stress that this next sentence is NOT what happens, but it's pretty much the equivalent of being deeply absorbed into a 90-minute cliff-hanger of a tale, only to have your main character wake up from a dream and go off to his job stamping books at the library."}, {"id": 149, "text": "Everything was bad. But not the good kind of bad like Sharknado."}, {"id": 150, "text": "Utter. Trash. I like a trashy action shoot em up but this movie was cringy predictable and absolute garbage."}, {"id": 151, "text": "Starts off promising, then comes a few cliche personalities, followed by a few naff FX..., next there's few stupid occurrences, and towards the end it's all just a bit dumb and silly. I'm not at the end yet but heard it's the worst part.It's something to watch but it's not a must watch. I'm just sort of waiting for it to end and this stage."}, {"id": 152, "text": "Wow did this movie blow! Terrible acting and Dave Bautista said what? You can't hear him over his mumbling! On the other hand Brittany Snow can't shut up! Terrible premise and a terrible movie. Not to mention the horrid acting"}, {"id": 153, "text": "Not even good enough to watch as a Mystery3000 movie! Really bad propaganda, bad acting, bad everything. Reminds me of an art students first entry! So glad I didn't pay to see this!"}, {"id": 154, "text": "Illogical decisions of main protagonists. Not reasonable decisions of the other characters and pointless story. I wish the authors tried at least paintball to get an idea how the street wars might looks like. Don't you waste your time with this piece of crap."}, {"id": 155, "text": "Somewhat enjoyable. uses the simulated long takes for almost the entire movie. cool to see it in an action setting. cool premise. some dumb stuff. the non-action parts were pretty useless with bad acting. bautista is a beast when he fights lol (1 viewing)"}, {"id": 156, "text": "I just read few reviews and I decided to wrote my first one. Some people gave it 9 and 10 ratings. What?! Are you kidding me? The fact that it's a low budget doesn't change the fact that it's terible. So you see the girl running, just behind her you know a soldier is shooting everything that moves and since the camera is behind her at the end of the alley infront you can see somebody pushing the troley and later some people standing, probably watching the shooting of the movie. What?! I am laughing just remembering all that"}, {"id": 157, "text": "I really like the way this was shot. Really intense. Not a lot of breaks. Not perfect, but pretty impressive for a low-budget film. Plus, Brittany Snow!7 out of 10 stars"}, {"id": 158, "text": "I liked it! It was entertaining and the camera views kept you more part of the movie. The difference about this film is it starts the way it ends...suddenly. Some people hate the fact that it takes so long to get the plot or understand what is going on, but to me that puts you in the shoes of the main character. You know what they knows, when she finds out about it. That being said, it doesn't give you the chance to Monday morning quarterback the film. It's not an Oscar performance by no means, it is an action packed movie. If you're a picky critic and expect only the best....better move on from this. It you're wanting a no-brainer, sit back, eat your popcorn...this is it!!!"}, {"id": 159, "text": "I'm happy this movie wasn't a high budget shoot 'em up style action movie (a la The Rock, Tom Cruise, or Jason Statham). I wouldn't say it was super low budget either. It was kind of a middle-of-the-road budget/production type of movie, which was the perfect thing to watch while doing boring work.The acting was adequate coming from mid-level actors, but I wasn't really hooked on the main plot...Brooklyn becoming a pawn in Texas' bid to secede from the U.S.. However, this shoot 'em up survivalist movie was watchable...and pretty fun to watch as well. Like many other viewers, I didn't have any good expectations when I first started watching, but as the movie progressed, I was happily surprised that I was getting more and more hooked.My favorite part of the movie is that the main protagonists don't form a romantic, sexual, or even overly-emotional bond...and best yet, there is no happily ever after where everyone is reunited &amp; walks off into the sunset. I really enjoyed the ending the most. It's not your typical Hollywood action movie ending."}, {"id": 160, "text": "01/10/2019 Bushwick - Mayhem with guns, lots of guns, lots of good ol' fun killing and murder. An OK movie, but far from being a great movie. Actors? Professional/Acceptable. Bon Appetit"}, {"id": 161, "text": "Imagine something like Cloverfield, only instead of an alien there is some unknown military force that is killing people without explaining what is going on. The film is one continuous shot, following the characters of Brittany Snow and Dave Bautista around while they try to survive in the middle of a war zone. It was a bit like Crank, too, so if you can think of a movie that mixes up Cloverfield and Crank you would expect brilliance. However, the film has a lot of flaws, starting with the very low budget production values and ending with scenes that are either poorly shot or badly acted. It keeps up the tension reasonably well, so I personally liked it.It felt like an indie experiment in making a movie, with some interesting ideas and a lot of the hell with it attitude towards film making. While I can't recommend people to watch it, I don't regret seeing it."}, {"id": 162, "text": "Story and Directing are really nice , acting are also good , VFX is not bad . So it's a real nice movie , i enjoying this movie quite a lot . So i think the rating should be higher , why only 5.2 (4/24/2018) ? I means this movie is centainly much better than other similar low-budget movies such as Beyond Skyline (2017) which gets 5.4 rating score . It's hard to believe those filmmaker can bulid such fine movie in this low budget , and that's why i quite enjoying it and give 8 of 10 rating it should deserve."}, {"id": 163, "text": "As a huge fan of action movies, I read about BUSHWICK and was entranced. It's a low budget, gritty, real-time thriller set on the mean streets of New York which is in the process of being invaded by a military force operating out of Texas. It turns out that a bunch of redneck states are wishing to break off from the US and invading those wanting to stay. The film follows a couple of characters, the great Dave Bautista and an annoying sweary blonde girl, as they navigate streets and buildings and attempt to survive. It's supposed to be shot in a single take and the roving camerawork is a real asset, although there are many cuts hidden by sweeps and CGI. The characterisation isn't very good and the bits where the leads settle down to chat inside buildings are quite dull; the worst character is the druggie who is a real irritant. However, the shooting and fight scenes have really fluid choreography that works nicely and are as good as, if not better, than those seen in many a big budget Hollywood blockbuster."}, {"id": 164, "text": "Long scenes of unbridled action reminiscent of a first person shooter. A load of fun and a directorial triumph."}, {"id": 165, "text": "By mid-film, you 'll be surprised by how good this movie actually is."}, {"id": 166, "text": "So I scanned through this movie first of all not really intending to watch it, but the reviews here intrigued me enough to go ahead and watch it and I'm glad I did.It generated a lot of thought activity in my mind about the reality of an invasion and what the on the ground response would be - and in some ways this movie struck me as possibly realistic. Although I had a real issue with people using hand guns all the time and leaving the rifles on the ground. Maybe you feel more at home with your particular hand gun, but there is no doubt that an assault rifle has a lot more ammo and firepower. But other than that it was engaging enough.The parts are acted well enough, and the fact that this is a low budget movie is not distracting at all, in fact they have done very well with their budget.It generated a lot of thought about the role of militias and gun ownership in a country like the USA.But it also generated a lot of thought about the film making process as well, and that is why I have rated this movie 7 out of 10. It's inspiring in a way to see what can be done by dedicated flim makers.Some people found the ending to be too abrupt, and yes it may be - but that wasn't distracting or irritating for me in any way. I was still satisfied."}, {"id": 167, "text": "I had doubts at firt seeing the IMDB rating, which I ususally agree with. However, this time, I whole-heartedly disagree with IMDB and what most of the bad reviews say about this film. Dave Bautista was amazing. He's growing so fast in his new role as an actor. He is on a strong way up to becoming the newest, BETTER, Rock, Arnold Schwartz-- and all the rest of the power lifters who've bravely made the switch to acting.  in my humble opinion, When you see a film and read a book, you have to bring something to the table. Hitchcock was a great believer in this as he left certain things to the imgination... YOUR imagination (the viewer). As intelligent people, I'm surprised that these moaner have to have that explained to them. They expect everything spoon fed to 'em.  I really enjoyed the ride this movie took me on and it wasn't at all difficultl to use my brain for imaging the possibilities of what the plot was going for.  Everyone is due his/her opinion. That's mine. Thankyou IMDB for the outlet.  please excuse poor grammer/misspellings."}, {"id": 168, "text": "Camera guy are too close to the actors need to zoom out a little bit need the picture.. But over all the movie good.."}, {"id": 169, "text": "Big, loud, fast and more swear words than I have seen in a movie since South Park Bigger, Longer &amp; Uncut.Dave Bautista was the most redeeming part of the movie."}, {"id": 170, "text": "I stumbled upon this on Netflix. It had an interesting premise and some good actors so I gave it a whirl. Through most of the movie, I was super into it. Following the two leads around their neighborhood as they dodge the militia and try to uncover more of what's going on was quite entertaining. And then... the ending. Man, I haven't been that unsatisfied at the ending of a movie in a long time. Here are where the real spoilers happen so...Stupe opens his heart up and tells his backstory and then, on his way to the bathroom at the laundromat is shot and killed by a scared kid, and that's it. Just dead. Then as Lucy and her sister are trying to get the helicopters, she is shot and killed and then the camera pans back to show NY on fire, and then its over. Wait, WTF!? I honestly would have settled for a newscaster voice over saying The military has begun to turn the tide against the militia, etc. But we get nothing. Just credits. So disappointing. The end almost completely undoes all of the enjoyment I got from the first 90% of the movie."}, {"id": 171, "text": "Bushwick is a very low budget piece and, despite what others have said about it having a real depth, the flow of the story simply doesn't hold up to scrutiny.Our heroine metamorphoses from scared girl to warrior during the film whilst her erstwhile comrade bestows his knowledge little by little towards her, much like some video games that propel the player from newbie to elite as the game continues. In many ways, as others have said, it flows like a video game with admittedly immersive camera work and sound.One glaring plothole was the girl's complete disregard for the welfare/death of her boyfriend within the first moments of the film. Considering the way she loses herself over the other incidents through the movie, one would have thought his death would have left some sort of mark.Bautista's ex-vet role has some degree of authenticity, beyond the fact that he routinely disregards collecting any sort of firepower beyond a pistol. This definitely moves away from the shoot 'em up game for reasons that aren't really made apparent.Those especially negative reviews (I feel this is more a neutral one) routinely whine about the female lead as a SJW (an alt-right term for Social Justice Warrior). The word snowflake is bandied around too, presumably alluding to the lead's (Brittany Snow) dirty blonde hair and Caucasian complexion. I actually would have thought those reviewers would have found her one of the 'pure race' myself, but I digress. One reviewer also mentions how the characters unbelievably take down the 'spec ops troopers'. I'm not too sure what movie he was watching, but the inbred, illiterate bigot that they capture clad in his black 'spec ops' uniform is hardly a poster boy for any sort of Special Forces operator.Our heroine attempts amazing feats as the movie progresses, especially after Bautista's character is killed as a result of 'friendly fire' (ie: a scared black girl hiding from the invaders). This new found 'ooh rah' attitude rankles the alt-right reviewers somewhat apparently, so they no doubt cheer when one of their brethren are responsible for putting a bullet through her head at the climax of the film.If the film does anything, it infuriates the Trump-voting, Bible-thumping bigots out there which isn't a bad thing. Just a grand shame it wasn't a little better executed."}, {"id": 172, "text": "My first thought when I saw the preview picture and two sentence blurb about the movie was that it would be like The Last of Us minus the zombies. Basically an urban survival movie. And overall I'd stick to that analogy. I enjoyed both Bautista and Snow even though the characters weren't perfectly developed or exciting. Maybe that made it more accurate to show some imperfections. Good quality filming, pretty good actors, overall a decent movie."}, {"id": 173, "text": "The movie isn't going to win any big awards for special effects or acting or scriptwriting, but it's better then most movies with 10 times it's budget. The storyline itself is interesting and engaging and is slow to reveal the truth about what is happening, which is part of the beauty of the story as we find out only as the characters find out (unlike Hollywood blockbusters that have to spoon feed details for the idiot moviegoers). The main actors in Batista and Brittany Snow do their best work and convey the right emotions during the events of the movie. What really makes the movie special though is the camera work. It's basically a tracking shot for 95% of the movie! If beyonce bought out a 4 minute video clip like this the world would go nuts but here we are with a movie, with detailed action scenes, being shot continuously with one camera. For less than 90 minutes of your life, give this a watch."}, {"id": 174, "text": "I at first didn't expect it to live up to the description of the movie but as the beginning unfolded it captivated me within the first 10 minutes, it was a great ride though there were discrepancies which I'll allow you to pick out but as I said it is a great ride, almost up there with the original Red Dawn if you look past the discrepancies and the unfulfilled ending which breaks your heart, not due deaths but leaving you hanging knowing there's no second film to finish what was started, woes me, unfulfilled..."}, {"id": 175, "text": "The story had some potential if it benefited from a few very good actors. As it is, the result is negative, very bad acting. The cinematography by Lyle Vincent is excellent though. And the music at the beginning, the theme that comes back later. Many scenes are really stupid. It starts very promisingly, but as the action continues - always the same - men dressed completely in black shot and kill civilians, the film is getting harder to watch."}, {"id": 176, "text": "I've said many times in past reviews I wanted to like this film, but I couldn't. This is the first time in my over 250 reviews I'm saying the opposite.Going into this, I had very low expectations, and from the very start, those expectations were met with the very poor acting and dialog, followed by the start of an outrageous story-line.As the story continued, I began to notice that the camera angles (poorly aimed in some scenes) were similar to video games like Call of Duty. Then I noticed the background music was similar as well. For a few minutes I thought to myself oh boy, this movie is gonna be a waste of time, but oddly enough, all those factors started to grow on me, including the bad acting/dialog.Then I started to notice the directing and cinematography were actually quite good - and those poorly aimed camera angles actually made the scene very realistic, especially for a B-type low budget film with two amateur directors, Cary Murnion and Jonathan Milott.Oddly enough, I also started to look past the poor acting and dialog from Dave Bautista and Brittany Snow and instead, became fond of their characters, and able to relate to them as just 'average Joe's' trying to survive. As I grew up in Brooklyn, I realized it wasn't bad acting/dialog, but instead their characters were spot on Brooklynites! For that matter, Dave Bautista nailed his character as a passive war vet turned janitor who lost his family.All of a sudden, BOOM, I was engulfed in this film and was really enjoying it. You can't compare a low budget B-type film to the blockbusters, and as such, to review it on it's own merits, this film was outstanding! I really felt like I was right there where all the action and suspense were happening, and was rooting for the Brooklynites. Sure one could argue about plot holes and an un-realistic story, but this is pure fiction (although it does make you think), and the screenplay was written so well with the pacing spot on, I felt like I was watching a live newscast in a war zone. What I also really liked (and respected) was the fact that there were zero clichés in this film, and it was pretty much unpredictable. Even the ending (not going to give it away) was a shocker and certainly not expected.It's sad to see such a low IMDb score from people comparing this to blockbuster films, or inserting their political opinions and agendas into the story. This for me was simply a fun ride, a great suspenseful adventure thriller, executed very well from every perspective. It left an impact on me, wanting more, and I do hope a part 2 is considered.I will watch this again, and it's a well deserved and much respected 9/10 from me... great job to all those involved in the production of this sweet little gem."}, {"id": 177, "text": "Like others, I heard about the film because Aesop Rock posted on Facebook saying he was doing the score. So I wasn't expecting much beyond a cool soundtrack...From the first scene, it's apparent that winning an Oscar isn't the top priority. The dialogue isn't fluent and the acting is stunted, and we're thrown in with the action almost right away: streets are burning, we don't know why, let's get the hell out of here. The top priority, it seems, is creating a video game-like war-torn corner of NYC through which the protagonists must try and survive. And it does this well.It only took a few minutes for me to start honestly enjoying it. The main driving force is the perspective: a single hand-held camera doing long continuous takes, so the whole movie, having been edited to cut different takes seamlessly together, runs like an entire 90 minute one-shot. It makes you feel as if you're there with them, experiencing the action unfold, no tea break, and the ridiculous plot and forced acting combine to make it feel like you've stepped directly into a '90s B-movie or a shoot'em up arcade game set in Brooklyn. It's really pretty cool, and almost makes me think that the silly plot and acting were intentional. Maybe, maybe not.If you're looking for a political thriller, a thinking man's action movie, cool martial arts/fight scenes, or any amount of emotional realism, look elsewhere. But if you're happy with a mindless yet oddly engrossing bang bang movie, this might be fun."}, {"id": 178, "text": "Two people get stuck in a city-wide gun fight.The camera trails about six feet behind the main characters as they scamper from one besieged house to another. The action is pretty intense! Passers by and pedestrians in the back ground get gunned down or embroiled in their own personal dramas.This is not an expensive film and its lack of budget is both its strength and weakness. It has a gritty feel to it and there is no big Hollywood star waiting to rip his shirt off and everything has a degree of realism about it.But some of the action scenes do suffer from a lack of funds. Soldiers wait patently for stuntmen to do their thing before spurring into action, or beat at invisible flames that the CGI team didn't get time to add.This feels very much like a computer game. There is not a whole lot for the characters to do except run and dodge and shoot, but the film is kept under the magic 90 minute mark so that was ok.They try to add some meat to the characters in a couple of quite dull dialogue scenes that didn't really work. I only know the characters from their backsides so I only need to know them about as intimately as I know third storm trooper from the right.The final sequence falls apart a bit as the sets are just too small for the extras to comfortably fight over.This is a great, cheap little run-and-gun action movie. Quite gritty and thrilling."}, {"id": 179, "text": "Dave Bautista steps down from the blockbusters to lead this tense thriller about a country torn apart and a new civil war beginning.The opening scene showed such promise, I was gripped immediately but within 15-20 minutes my hopes were dashed.I couldn't get over how poor everything looked, considering Bautista is on the upswing of his career I expected him to be more careful with his roles. The sfx are oddly weak and the camera work is some of the shoddiest I've ever seen considering the films budget. Seriously, at one point I think the camera goes up Daves ass while following him.Though the concept is a bit far fetched I think considering the current state of the US at time of writing this or something similar is more realistic than most want to admit.Sadly as mentioned the film falls apart early and it descended into yet another action flick with little going for it.Bautista has done nothing to silence his critics here as he puts in arguably his worst performance yet.This film is the very definition of potential squandered, it should have been SO much better.The Good: Fantastic opening sequence The Bad: Very poorly shot Shoddy sfx Soundtrack doesn't fit Things I Learnt From This Movie: Such a far fetched plot being believable at this time is genuinely scary I couldn't take the Jewish gang seriously"}, {"id": 180, "text": "Bushwick feels like a low-budget zombie apocalypse movie without the zombies. It's also missing a plot, character arcs, a theme, a moral and other typical cinematic and dramatic elements. The ending feels as if the filmmakers shot the film in sequence and ran out of money before they could complete it. The wrong characters die for the wrong reasons. Bautista is best known for his chiseled larger-than-life physique and his martial arts skills, but displays neither. As he has shown in the Guardians of the Galaxy films, he can handle comedic roles and does a reasonable job here with a role that calls for more emotion than action. While fans may appreciate his dramatic range and nobody would want him to be limited in his career, they may be disappointed that he doesn't do more fighting. The script is a mess. Nothing makes any sense, from the plot to the military tactics to the motivation of the characters. A hodgepodge of liberal and alt-right political ideologies are presented and seemingly given equal time. I kept imagining Robert Downey Jr. in his Kirk Lazarus role from Tropic Thunder urgently whispering, Never go full-on libtard. The situation and actions seemed so improbable and unrealistic that I never developed much empathy for the characters."}, {"id": 181, "text": "I'm giving this movie an extra star to help balance out its rating from those who don't recognize its value, but in all sincerity it's just a 7 from me.. I thought the music and sound and overall immersion of camera work and the like where all rather perfect, I wasn't too fussed like some other reviewers at actors not being Tom Cruisy enough or whatever because I liked that they were flawed, its real that they were injured and that they portrayed a complex range of emotions where suited and they where ultimately some of the believable actors I've actually ever seen in an action movie all the way down to the lead man's out of shape panting that never stops.Insurgency is a messy theme for any military 'just following orders', messy because people want to defend their home which can turn entire urban areas into warzones as demonstrated in this film.. so here we have what seems something many regressive thinkers can't wrap their head around when it comes to Arabs and Muslims who've been painted as the boogy men who attacked your world trade center buildings and so how dare they defend their home!! This mentality is like a brick wall cloaking a lot of anguish and pain which is only fair of course. 'Bushwick' eloquently puts the shoe on the other foot where your home has been invaded by the same 'just following orders' jarheadism as that of what we unleashed on Arab countries post 9/11 in which probably thousands of innocent 'collateral' occurred (without knowing the correct figures).. in pursuit of oil, cloaked as a conquest to rid the globe of weapons of mass destruction, to restore order and bring Osama to justice and believed by the greater majority of US. I felt this movie successfully illustrated the faults of our governments (namely the US) and also illustrated how important it is for us ordinary people to get a clue or two about the weapons we wish to keep around for safety for when marshal law is executed, we might live to see another day without shooting each other first."}, {"id": 182, "text": "I think anyone going into this movie might imagine it to be a slick hipster goof on Red October but within its first few minutes it is setting the viewer up for a non stop ride. The (almost) single cam POV and a story set in real time draws on masters such as Hitchcock (Rope) and Antonio (the Passenger) for tracking and steady cam shots that take a low budget movie to a heightened level. Tight framing creates a dramatic intensity without the need of CGI (or very little) for it's effects enabling a very dramatic story to unfold in a very familiar NY setting.The subject/cause of the events is kept shrouded but as some volk have noted it fits into a political narrative that is familiar to us all in the USA.The acting and the care and time the director gives for character development was unexpected but a great touch. Dave Bautista, straight out GotG2 and Brittany Snow are excellent in their roles.So there you have it, no spoilers and make sure you see it if just to p o the lone star reviewers, ye haw."}, {"id": 183, "text": "I feel compelled to review this pos movie.Whatever you do, don't wast your time.Parts were okay, and I kept hoping there would be something redeeming at the end.But oh em gee, what a stupid ending. You will totally regret it. Don't watch.Dear writers and directors of this movie, don't please don't every make another movie. Not everyone is from New York and feels that everything in life is just brutal, viscous. For God's sake, there are other cities and societies out there.Un effing believable."}, {"id": 184, "text": "Quite obvious is the agenda of these horrible liberals who bang on about non violence and then are the only ones using violence - in this movie its obvious who they are targeting (the scene with the 4 Jewish blokes in their hats blasting away cmon do you really have to make it that obvious) and pretty lame it is too!Sadly even though I like Big Dave in Riddick and other films as long as he doesn't have a major role as he just cannot carry a movie as the main character - he grunts and groans and sometimes you can make out what he says, sometimes you might just catch his face on camera and the female is just a tad more able but not by much. The scene in the Laundrette had me cringing as big Dave tries to do an emotioonal scene grrrrrr i wanted to hide behind the sofa i felt so embarrassed for the big guy!Story had a good premise but Red Dawn did it much better with real actors actors and a decent script which this one does not. By the end I couldn't have cared less how it ended to be honest, I just wanted it to all be over so I could go to bed!Was hoping for something different but failed miserably with little to no tension and I have to laugh at the other reviewer who said maybe Limp wristed , LGBT, Clinton Supporting dweebs might find it interesting - he is probably right!"}, {"id": 185, "text": "A liberal's wet dream of reverse provocation. Conservative states having won a Presidential election have now chosen to wage war on New York. I speculate that the premise here is based loosely on the election results of 2016, where the vote was polarized between New York, California and all the states in between. In the movie anyway -and you need to be smoking some really strong stuff or be a die- hard anarchist- Texas leads a revolution whereby Texas, North Carolina, South Carolina, Tennessee, -and implied heartland states revolt against a Federal Government controlled by New York and implied California. The Union is now controlled by New York (implied) and all the rest of the conservative states are to be feared in this because they have chosen to invade New York to overthrow its power. Has the constitution failed? This is never explained. Yet, somehow, Middle America, led by Texas is out to take over New York. Somehow the world has become some draconian order to invade and murder civilians in New York with impunity and vile disrespect for human life. Im thinking now of the phrase a thief thinks everyone steals... The author somehow fears the Reality of America where a majority of states overrule a minority of two. There is no movie or story here. Just two people on a journey through endless mayhem, open anarchy and mindless violence in the street. Meanwhile we hear reports that the states have declared war on New York. Its complete political garbage."}, {"id": 186, "text": "Summary (no spoilers) When Brooklyn is invaded by a Texas military force, twenty year old Lucy and war veteran Stupe must depend on each other to survive.My Review (no spoilers)The starting of this movie was promising with the perfect terror induced moments but later on it kind of became boring there were some unexpected events but still did not have that wow factor. Both Bautista and Brittany as actors have a lot to improve. The ending of this movie was unpredictable. Overall it did not keep me interested.My RecommendationNo, I would not recommend this movie to anyone.My Rating0/10"}, {"id": 187, "text": "I was disappointed and genuinely frustrated in this film. The idea, civil war, essentially; was a juicy one. And it could have gone in so many directions. The sheer number of missed opportunities here is overwhelming. The writing requires lots of suspending disbelief and in a way they but off more than could chew. They didn't have the budget for decent special effects and it shows. The scoring was unique but a bit repetitive and wearing, the cinematography was far from groundbreaking (although satisfying enough) and the acting ... well, let's talk about that.The female lead, Brittany Snow did alright, but her performance needs work as she often feels stiff and practiced. Given her age and the poor script she was given to work with however, I don't think a lot of criticism here is necessary. Dave Bautista, a former wrestler, did surprisingly well.There was a good amount of tension throughout but the pacing was more than a little off and overall I would feel comfortable describing the film as, unsatisfying, underwhelming, and not worth your time. Which is a shame, I wanted this to be good. It had so much potential. Sadly, almost none of it was realized."}, {"id": 188, "text": "I know this is not the first time it's done in the history of movie making but it's not very common either to shoot an entire movie that is more than 1 and a 1/2 hours long in almost one single shot!yes, there are a few cuts here and there but they are so few and far in between that you just don't feel them really unless you're continuously looking for them ...and meanwhile, everything is happening so fast with unexpected big or small events taking place one after the other in such a rapid pace you just can't stop wondering how the heck the director and the filming crew, the cameraman (-men?) as well as the actors managed to do it with the camera moving around almost all the time, nonstop!?but that's not all about the positive technical points of this really fine movie! the story is good, casting is to the point, super fine direction and so much action without the movie being the usual shoot'em up gory flicks we see so many of them everyday ...everything is so good here that the occasionally flawed acting doesn't hurt at all and you can forgive it comfortably without feeling embarrassed or offended ...kudos to the makers of such a great and rare movie in this genre! if i didn't give it 10*** was only because of the acting issue just said but if that wasn't the only weak spot i found in it, then even 20*** wouldn't be enough!yes, i AM impressed indeed and please bear with me as i'm not easy to impress really! not anymore at my old age! _ _ _edit: forgot to add that this is a low-budget movie but the fact that it doesn't try to kill itself to sound like high-budget at the expense of ruining everything gives it yet another big positive there!"}, {"id": 189, "text": "Dave Bautista is great in this film, and Britney Snow was great in this film, and the two really work well together, in this film.The film has the whole Birdman cinematic style as Bautista and Snow have to battle though the Brooklyn neighborhood after the place seems to get randomly attacked by a military force.Bautista is really showing off his acting skills, man, trying to be like the Rock. I never scene the man actually wrestle but I see little glimpses of it when he does action moves in these movies. The complete tracking shot that the movie does to make it look like the movie was not cut, that makes it feel like the movie Birdman, makes for the films great war scenes.Impressive."}, {"id": 190, "text": "Fantastic watch, will watch again, and do recommend.This one really flew under the radar, and I almost skipped it until I saw Brittany Snow, and had I know Dave Batista was also involved, I would have sought this out.Let me get this out of the way: the premise is a succession of the southern united states from the Union with an initial strike against a civil target. This is what The South will rise again means, this is what everyone flying the Confederate Battle Flag is signifying when they display the symbol of a terrorist organization.That said, this is an amazingly shot depiction of a horrible attack on civilians. The follow camera style gives you all the feeling of found footage (unfortunately there is a little shaking cam in action), without all the overhead and mislead about where the camera is, someone has to hold it, and who edited this together. It is really immersive, and the audience learns about the situation (quickly, I might add) right alongside the characters.The story hardly wastes any time throwing us into chaos and survival. The best part is that Brittany Snow is just a college girl, smart and capable, but not combat ready and not that great of a survivalist. We get Dave Batista playing the stereotypical Rock Role of being former military, but instead of being a witty, smoldering pretty boy, they layered on substance to his character, and let him be gun ready.There are good twists, not a lot of complex multi-threading (at least for a city at war), all good action, and a ton of immersive realism.The biggest problems with this movie are the most realistic ones: in the times of a domestic war, there are going to be 4 sides: invaders, defenders, abstainers, and criminals: people that are just going to take the opportunity to do whatever and hurt whomever they want before someone kills them.Honestly, the more I think about it, the better this movie seems. I'd probably expand the ending though, in the very least there should have been an epilogue. At it stands, the movie just sort of ends, but it is possibly by design."}, {"id": 191, "text": "So it's Red Dawn but from within. While this film-school quality movie has a gritty look and a nervous timelines to it, (given the BLM/antifa riots this year) ,it just has to fall back on the predictable:.... It's always the white guys fault, or the domestic terrorist is the white guy(s). There are so many factual and technical false presumptions as to make it mostly unwatchable toward the end. Bautista is also barely audible, as is the fashion these days. (Grunting and whispering is supposed to convey a deeper, more pensive thought process--yawn). The girl, whoever she is , is athoroughly cloying and method actress with zero presence. The movie is vaguely interesting visually because it's shot in the streets with minimal production interference. In other words, no budget and no effects necessary. But the greatest offense is the idea that people who are willing to fight for American values (you know the thing, man... are lunatic killers is offensive and frying-pan-over-the-head obvious. I was expecting the guys in black (of course stormtrooper black) to tell Wolverines!!!... But the millenials who wrote and directed this woeful trash probably never heard the term. Don't waste your time on Bushwick. Just watch Red Dawn... At least it's funny."}, {"id": 192, "text": "All in all, an interesting concept. It's the Civil War all over again with the states of the former confederacy leading the the attempted take over the U.S. to establish a right wing racist military state.What made it even more realistic for me is this: there are some political pundits who just today suggested that the alt-right might attempt an armed insurgency to overthrow our government. Many of them are are heavily armed. I grew up in Brooklyn, NY. At the beginning of the movie, the subway station is Church and McDonald avenues. It's a few blocks from where lived.It is nowhere near Bushwick. This area is border of the Kensington and Boro Park sections of Brooklyn, about ten miles from Bushwick. I guess the writers/producers have no idea about the geography of Brooklyn."}, {"id": 193, "text": "I mean it's more tactical. This isn't an attack. This is an invasion.There's one thing this film surprised me with. And that's the speed at which the violence begins. One moment Lucy (Brittany Snow) walks with her boyfriend through a subway station. The next moment, he's lying dead next to her and in the background you can hear the sound of automatic guns and screaming people in panic. Turns out a war started in this part of New York. A kind of American Civil War in guerrilla style. The sound effects and the way in which the camera follows fleeing Lucy looks a lot like a third person shooter. Even Lucy's sister Belinda (Angelic Zambrana) thought the neighbors were playing Call of Duty all the time.It's only when Lucy is rescued by Stupe (Dave Bautista), a concierge with a military background, this realistic looking film turns into a survival journey through a suburban district of New York. Immediately I had to think of movies like No Escape. But also of older hit-movies such as Escape from New York and the magnificent film Warriors. A turbulent flight through neighborhoods where street gangs suddenly take up arms against the forces who try to take over Bushwick and punks who take advantage of the lawlessness to rob neighborhood stores. And all this looks as if it's filmed in one take.The reason why those troops are penetrating this neighborhood and total anarchy breaks out, sounds quite ridiculous and unlikely the first instance. But thinking further about it afterwards, you could say it isn't. Such a situation could occur somewhere in the world, given the interracial and domestic conflicts that arise everywhere. But apart from this original approach, this film has little to offer. The rest of it is just about the two main characters trying to escape the violence in a city that looks like a battlefield. Even the noisy and rebellious looking local residents who are waving with their illegal weapons excitedly, don't make it more interesting. Although some of them were in a high stage of enthusiasm.In addition to the fact that it's all simplistic and there aren't really surprising developments, there were also some things that were quite annoying. For example, the continuous mumbling of Dave Bautista almost the entire movie. Besides the emotional closing argument, his oral contribution was limited. He resembled Rambo who also mumbled the whole movie in those days. And although he seems to have a lot of military experience, he continuously refused to use more sophisticated firearms. I've lost count of the number of times I got p*ssed because they ignored modern automatic guns, which were lying around for the taking. They stubbornly held on to their small handguns. I would have known better.I'm not sure if it was the intention to make a political statement. If so, they didn't quite succeed in doing that. Before you know it they shifted back to making a superficial action film with Jews jumping around with Uzi's. In general, the acting isn't so bad. Brittany Snow is doing her best as an emerging survival expert. Dave Bautista's posture is very suitable for playing the character Stupe. His physique and rough-hewn behavior makes an extremely dangerous neanderthal of him (mumbling included). And if you're looking for a movie with a denouement so non-compliant compared to the rest, don't look any further. Believe me. So, Bushwick isn't special, but you don't need survival skills to watch it entirely.More reviews here : http://bit.ly/2qtGQoc"}, {"id": 194, "text": "Come on people, this isn't that bad. I thought it was pretty entertaining, and it held my attention.It seems Netflix is the new direct-to-video, which is fair, though Netflix has actually put out some good movies. I think this movie is one of those.Dave Bautista is awesome ok. He's a good actor and he does have charisma, even when he's lumbering along and shooting a gun and not talking at all. He's like a much less confident version of The Rock. He carries this movie, and was the best thing about it for me, and the only reason I watched it. His monologue towards the end of the movie is worth the build to that point.Cary Murnion and Jonathan Milly are obviously amateur directors, and they were definitely trying to ape some other movies with the style. Even if it is a less atmospheric and well-acted Escape From New York, it's still watchable.The action scenes were enjoyable enough. There were lots of long and well-stages battle scenes, and I thought the apartment fight scene with Bautista was pretty cool. Nothing amazing, but alright.Don't listen to all the overly harsh reviews. This isn't the worst movie ever, and just because it's not Escape From New York or Children of Men, but that doesn't make it not worth your time. Netflix has made far worse movies than this."}, {"id": 195, "text": "I Am A Huge Fan of Dave Bautista Big Fan Since in my childhood i use to watch him in WWE i remember these times with him in it he is my role model like Dwayne Johnson, Steve Austin, Diamond Dallas Page, Kane, Triple H but then he got into MMA is great then he turned himself as series actor witch is great like Dwayne Johnson. People say to me really you say Dave Bautista is actor i say yeah ! he has talent like Dwayne Johnson but he hasn't got the really best opportunities in movies expect for Guardians of Galaxy for bigger screen for Marvel but he hasn't made many lead role movies witch someone should have but this movie eh it's shame for Dave. i understand it has a lot of action and it's really starlight forward pace i understand. but the movie is what i didn't like about movie is ending witch i am going to not spoil it yes i am going to hate movie because of ending of it because it killed it, it ruined it buy many seconds it's SO bad i am like screw this movie theirs no ending it's noting it needs more questions needs more telling did Brooklyn win ? because of ending wasted Dave Bautista for no reason witch i love to see him towards at end of movie i mean i loved seeing him as lead role actor in movies like this but there's another movie called House of Rising Sun (2011) he is lead role in that movie but it show's he can act he has strong performance in movie but this his acting his great but not in best movie has been made. i thought it wasted everything at end towards at start it turn out to be great and thrilling it keeps you watching until at the very end of movie but towards it, it kills it. i like the way story start's and everything it's like Purge but different style of movie with a lot of very bad CGI too many bad CGI. story follows Lucy (Brittany Snow) was in attack her boyfriend died from explosion in war as she runs tosomeone house one of bad guys try to kill her but you have Stupe (Dave Baustia) Who Is a War Veteran who helps Nicely To Lucy and they decide to cross five blocks of Bushwick to get Lucy Back Home i thought the action you have Baustia kicking ass in movie a lot i love it, it was a lot of fun in movie it was worth of fun to watch i like to see more of that in movies with him he needs more lead role movies to kick a lot of ass in films like this but better. the city turned into war zone is because Texas military force invades their Brooklyn. Soldiers Taken Orders to Invade Brooklyn for some reason and people from Brooklyn are defending there city. a single hand-held camera doing long continuous takes, so the whole movie, having been edited to cut different takes seamlessly together, runs like an entire 90 minute one-shot. i like that but movie didn't need to do that a lot because kinda annoyed me. the movie is full on it doesn't stop it's not movie goes for 3 hours long long time just to know something it's full on full on run they move, everywhere the movie moves to every different places. Bautista Performance is great he can be a great actor like Dwayne Johnson he has been hired in a lot of movies but as a cameo sadly but in this i know everyone would be exciting for this movie because of Bautista OK but its movie you will watch it for once that's it believe it's not worth of your time it's fun full on action mixed full on thriller but there's not much to say about this movie it's sadly ruined ending it's like me saying stop movie almost to end don't watch it but it totally sucks the film way ended JUST SUCKED. it's sadly made it's shame for Bautista to be in this movie role i mean there's many ways to change the ending of this movie change it to different direction believe me people when movie ends it's ugly i don't want to spoil it but it ruined many movies do that i hate it i am series i do hate that the writes of movie and director just sucked at making this movie. it's huge huge let down of this movie believe it is. you could watch this for Baustia and for time waster that's it then end of movie you decide whatever you like it or not i sadly didn't because it killed ending SO badly didn't make any sense it's like you wanna know what's going to happen next did People from Texas won over Brooklyn or what ??? Movie Like This Just Watch Purge Anarchy &amp; Purge Election Year Sadly But I Love Purge Anarchy a lot more then this i am come on even Purge Anarchy did a lot more better then this. The entire story line is all over the place and makes no sense whatsoever didn't make any sense oh yeah Stupe The former Marine war veteran takes out a lot of the bad guys but fails to take ANY of their M-4 Rifles from them He continues on with only his Colt M1911! NO WAR VETERAN in these circumstances would EVER leave a downed enemy without taking their superior firepower and ammo!!! STUPID, STUPID movie!! And it's so sad too because I really liked the blond and the big guy my role model Dave Bautista. But Movie Believe When You Get To End It Will Make You Hate Movie."}], "reviews_amount": 196}