{"name": "Tesla", "titleId": "tt05259822", "reviews": [{"id": 0, "text": "I looked forward to learning a little about Nikola Tesla, the inventor moved into the shadows of people like Edison and Westinghouse by history. Instead, I got a pretentious muddle of history and fantasy given in an underlit and murky tableau that's as dull as the narrative.Ethan Hawke plays Tesla (sans accent) as if sleepwalking. But it doesn'r matter because the story has nothing to tell us anyway. We get disjointed scenes that depict this and that, some historical and some made up. They add up to not much of anything. The device of throwing in anachronistic touches (Google, cell phone, Coca Cola, etc) backfire. But the major atrocity is when Hawke's Tesla picks up a microphone and starts a karaoke session of Everybody Wants to Rule the Word.Avoid this garbage and spend your time reading the Wikipedia article on Tesla."}, {"id": 1, "text": "This movie doesn't know what it wanted to be, and in the end it has hardly anything to do with the real Nikola Tesla. The movie tries to be artistic but is just mess."}, {"id": 2, "text": "Stated as a freewheeling story on Tesla, this is a degrading and dark interpretation of his life, with very little shown of his inventions and how he was done in by his peers and investors.There have been quite a few films and documentaries on Tesla's life which were enlightening and described what he was possibly trying to achieve, but this film is just a mockery of his life.Tesla was an eccentric and introverted person which unfortunately led to his downfall. Had he been more forceful, he could possible have changed the world."}, {"id": 3, "text": "This biopic was one of my most anticipated of 2020. Sadly, it is as dull as a Wikipedia entry... sprinkled with two scenes of anachronistic music and a secondary character reciting Google search statistics. Yes, you read that correctly. Ethan Hawke is as reliable as they come... but even his talents are insufficient in bringing this dead script to life. No Spark Whatsoever."}, {"id": 4, "text": "I'd even dare to say that this move have more false.. sorry - artistic impressions than facts.Also - I really hoped for this movie to be good but it seems like last couple of years screenwriters believe all people are idiots and do not even try to write a good script. Waste of time unfortunately :("}, {"id": 5, "text": "It's a random girl telling you how many searches Tesla or Edison has on Google. Then a silent Ethan Hawke staring at lightening for the rest of the movie"}, {"id": 6, "text": "Looks like most of the movie cost went to the actors and not the production. Very poor production and very thin story line"}, {"id": 7, "text": "My favorite part in this biography period piece was when a girl turns to the camera and said if you google... - it's my favorite part because that's when I shut it off."}, {"id": 8, "text": "The problem with being much anticipated is that you have to deliver, to an extent at least. This movie delivers almost nothing. Not enough real history and character involvement to deliver any interest in the current war that the plot hinges on. Then there is Ethan Hawkes wooden performance, except when he does a rendition of a Tears for Fears song (in character) into a microphone against an soft focus sunset backdrop. If you find you can't sit through this bore of a movie but want to catch that music video, fast forward to the 90 minute mark."}, {"id": 9, "text": "... with a musk reminiscent of burning flesh, transformed into a ridiculously low budget AmDram production performed by clowns and jesters, mercilessly mocking one of the founding fathers of modern technology.Fuses blown, breakers tripped, a complete short circuit fiasco."}, {"id": 10, "text": "The film is very confusing. I can't really follow the story, because it has a lot of seemingly irrelevant shots or fantasy shots - I can't really tell. I was genuinely bored by Tesla. The Current War is a way better film. Watch that one instead."}, {"id": 11, "text": "The story was odd and it never really tells us about the man and his visions Not a biographical film but an artist rendering of third person memories . Yes lots of people want to rule the world ."}, {"id": 12, "text": "Title says it all. This was a movie that didn't need to be made, so they re-imagined history to make it more compelling. Only it wasn't more compelling, it simply was irritating."}, {"id": 13, "text": "Did Edison make this movie? Is this a biogarphy or a parody?"}, {"id": 14, "text": "Nikola Tesla give world the great gift - Electric power. He was son of Serbian Ortodox Priest. Remmember that. This film is pure waste of time. Seriae with Rade Serbedzija, filmed in 1977, is better."}, {"id": 15, "text": "I got a bad feeling from the start just because the very dark heroic sound of his voice. I was right. It only got worse. I gave up halfway through a very bad movie and found more interesting things to do."}, {"id": 16, "text": "I expected a scientific explanations about electrical terminologies like Amp, Volte etc,, Unfortunately, it was so poor movie. And to make it worse, they give Tesla a mike to sing🤔🤔"}, {"id": 17, "text": "I've been looking fwd to watching Tesla. Sadly I was disappointed did no one bothered to fact check or was it they just didn't Care. With Edison going to the bar to get a bottle of coke and check his iPhone and was it just easier to buy them in boot skates That were invented I believe after Tesla's death. I had to stop watching it was a train wreck"}, {"id": 18, "text": "Tesla deserved so much better than this wannabe artsy, disjointed, bland, cheap mess."}, {"id": 19, "text": "-Obvious and unnecessary marxist propaganda -Confusing, disjointed narration from a girl on a laptop who seems to need to insert herself into someone else's story -Unrealistic interpretation of his life -Boring, uninspired plot -Acting is okay at best, only Edison has any real emotions -Overreaching, self congratulatory script"}, {"id": 20, "text": "Not entertaining at all, and this coming from a guy who enjoys science and the history behind it"}, {"id": 21, "text": "Beyond disgraceful exercise by a makers of this feature. Degrades the Great Genius (possibly the smartest man ever lived) of Nikola Tesla (my Co- countryman). Not one of the vast number of his inventions shown or presented in detail, neither his character or inner battles (he suffered severe case of OCD) he had fought while constantly coming up with new ideas and inventions. Absolute joke of the movie.Disgrace that should had never been released."}, {"id": 22, "text": "The life of Nikola Tesla is one of the most incredible and interesting histories in the science and this incompetent director managed to ruin it. This movie is a waste of time. If you want to know how many results are there in a google search about Nikola Tesla watch this movie, even better if you want to see to Tesla singing as in a karaoke this is your movie. I just beg to this inept director that does not gift us a movie of Einstein or Newton making a stand-up show, or Darwin and king kong in a duet."}, {"id": 23, "text": "Not worth your time.Very little to do with actual Nikola Tesla's life, sets are practicaly nonexistent. e.g. when conveying scene at a certain historical space, they will often use the image of the place, and place Ethan Hawke in front of the photo/green screen, it's misguided Artistic mishmash bs with no coherence or the actual plot. If you are interested in Tesla's life better watch documentary or The Secret Life of Nikola Tesla (1980), because beside having no real plot or any entertainment value this movie is void of most of the facts we know about Tesla so it's not even a biopic. It's attempt at artistic portrayal of Tesla and that period which fails on all levels. I'd feel sorry for the actors if I didn't knew they were paid (for probably 1 day it took them to shoot all the scenes)"}, {"id": 24, "text": "What a boring mess!!! I waited a long time to see this. Now I wish I hadn't bothered. I wanted to see it because I feel there isn't nearly enough out there about Tesla and was hoping this would be something more. It's nothing!!!"}, {"id": 25, "text": "A genius and eccentric character, whose life path and inventions would make for a fantastic movie. Our world would not the same without Tesla, but somehow his inventions and their reach are only secondary in this movie. The Imitation Game allowed Turing to be rehabilitated, this movie only demeans a genius already misunderstood and forgotten... Regrettable!"}, {"id": 26, "text": "Literally reading an electrical manual is more animated. I hope that someone else writes and someone else directs another Tesla movie to erase this tripe from the theatrical history books."}, {"id": 27, "text": "This is such a strange flick. Some quality actors and period costumes, that is why I didn't give it 1 star. They take some of the most fascinating figures of the late 19th and early 20th century and have them mostly sit around and talk about various boring nonsense. I had zero clue what was going on this entire film. We do get to see JP Morgan play tennis with his family for some reason. In some scenes they make the painted backdrop obvious, no clue why. Culminating with Tesla doing a lame attempt at karaoke of a Tears For Fear song into a modern microphone? What the hell you say? Exactly. I guess they thought this was some kind of art film or whatever, I say don't bother."}, {"id": 28, "text": "A lot of people did not like the choices in this film. The style is almost surrealist, art house, than a typical biography film. I was really was engaged by the exploration of the genre. It was intentional choices, not a slip up or a result of bad acting or sloppy direction but it does come down to effectiveness. Did the style and the experiment fit the content or what people wanted from the film? I think it didn't quite fit. However, it was a marvelous attempt and and the acting was phenomenal. There were some genius moments but it's my opinion that the ending was the weakest segment of the film."}, {"id": 29, "text": "I was so disappointed and enraged I electrocuted my dog."}, {"id": 30, "text": "The dialogue is densely packed with technical jargon that requires a degree in electrical engineering to decipher. It's like a Star Trek movie, but lacking an accessible human conflict story to keep you interested. The quirky production makes for a few interesting scenes, but it never quite holds together. It starts out as a period film, and then halfway through the movie it hit's hit you with one non-sensical modern-day reference after another. It comes across as desperate to make itself appear interesting instead of actually being interesting."}, {"id": 31, "text": "This is not a historical film. Yes, it is about Tesla and his interactions with his contemporaries. Yet, it is about his visions and aspirations through the eyes of outsiders.Anachronism is at its highest. So, it may feel unrealistic, but the director has no claims otherwise.The narration is not linear, it is quite fragmented.It is an interesting introduction to Tesla and his vision/dream for the future."}, {"id": 32, "text": "The horrible actor who played Tesla imagined that he had only one facial expression and always spoke in a low, gravelly, Batman-like grumble. This movie is trash."}, {"id": 33, "text": "This is not a straight forward biography. It is more like a Theatre Play being acted on the Big Screen. That is why I loved it. Of course it isn't perfect and some of the scenes could have been avoided. But overall this is a very satisfying film to watch. I think the film with its staggered and confusing narrative is an Ideal depiction of what was going on in Tesla's Mind."}, {"id": 34, "text": "Its disjointed, it offers details, few, and these are shown with ,,personal,, impressions. there is no magic though science must have been impressing back then in its fast evolution. its a mess. a documentary is the better choice."}, {"id": 35, "text": "I really don't know what the aim was with this film. Random references and boring. The film just didn't flow with the storyline, was all over the place. There is so much more to his life than how they portaid it in the film"}, {"id": 36, "text": "Probably the worst movie I've seen in the past 5 years. Don't waste your time watching this. The man is interesting but sadly this movie is not."}, {"id": 37, "text": "This has to be without doubt one of the worst movies I ever saw. How it got to production I never know. Ethan Hawke has the charisma of a wet paper bag and looks like he's being directed at gunpoint.They took a movie about one of the greatest minds of the 19th century and made a bollix of it."}, {"id": 38, "text": "I came looking for a biography as the movie stated but there wasn't anything worth noting about his life in the movie. This was an art piece that was mind-numbingly boring and pretentious.If anything it's a cash grab about a brilliant man and they didn't even put cash into it. The production was lackluster and the script was just as bad.There is nothing redeeming about this film, don't watch it."}, {"id": 39, "text": "I think the authors wanted to present Nikola Tesla as an unknowable, distanced,ingenious man, and in my opinion, they succeeded. The audience ( wider) did not recognize that. As an ordinary spectator, therby Serbian by origin, I am more than pleased with this movie."}, {"id": 40, "text": "Thinking... is more interesting than knowing, but less interesting than looking. Whenever I came across the name Thomas Edison in physics books and electricity lectures, he would always be praised and worshipped as the master and the inventor of the DC current. While the name Nicola Tesla never came to me in any book, physics or not. The more I see movies and articles while I grow old. I though more of an evil person Thomas is. And what a great man Tesla was. I used to think of Edison as the man who failed 999 times and then it worked for him in the thousand time. I used to take him as an example of hardworking and success. Now I more think of him as CEO of company who just wanted to make money, he used his invention as the mean to collect more money from people instead of helping them. While on the other hand, Tesla was the one who sought for helping people and in the end the world throw him away. As to be said that greed people wins at the end. As time goes by, whenever I will be asked between Edison and Tesla. I will be always cheering for Tesla."}, {"id": 41, "text": "I'm giving it one star as I'm watching Tesla holding a microphone with both hands and sing."}, {"id": 42, "text": "Beautifully shot. Appealing cast. It does work to have the film break the 4th wall when Anne Morgan speaks to the camera. The story carries us along. The director and cast win more than they lose. Where it gets rough: the movie struggles at the end. Just who is he when he's older? What would the older Nikola Tesla have said to the younger Telsa about science, business, women? That's a question often used in interviews (What would you say to your younger self?) Wanted that more than the song that was sung. Also, perhaps insight on the romance aspect could have used more of"}, {"id": 43, "text": "Well, I guess that something like what this review title says happened. So we saw scene where Tesla and Edison putting ice cream each on other, including face. But hey, they said clearly that it not happened really. Yeah, I'm sure that movie would be much better if they kept that line until end. At least then viewers would know what it wanted to be. As it is made, it is just a cheap mess. And incredibly shallow. There was lot of it based on enormous wide choice of sensational writings, TV show material 'about' Tesla - actually pretty much pure imagination in most cases. What poor Ethan Hawke was needed to say (after script) about wireless transmission was so deeply stoopid that even some 10 years old kid with little physics knowledge would just smile lemonish.I feel really sorry for actors, or maybe should not ? Is all it sinks down this years ? Tesla certainly did not want that electricity serve for something like this 'creation' ."}, {"id": 44, "text": "Does continuity mean anything? Seriously, Techno music? Ed Wood would have liked it. Perhaps it is better watched on a cell phone in portrait mode?"}, {"id": 45, "text": "After watching the trailer, I had high hopes for this movie. To say that I was disappointed would indeed be an understatement. Most of the other reviews have already covered most of the errors and absurdities. I knew things were headed downhill from the start but hoped that they were just minor flaws. But when the bar scene and the apologies for the noise of Pennsylvania rendered jackhammers and electronic police car sirens I knew this one was too far gone to recover. The karaoke scene rendition of Everybody Wants To Rule The World destroyed any appreciation that I might have had for this movie. As the saying goes; Miss it if you can."}, {"id": 46, "text": "This one hovers on the bounds of watchability, and its format- as a dramatized documentary just makes it more annoying than a pure, dramatized movie, with a Plot. Most viewers'll muddle thru the ambiguous continuity, of narration, some acted scenes, with episodic, imaginative parts, to convey idiosyncratic mind of Nicola Tesla, with his ideas so ahead of our time. But Tesla's life story shares the same fallacy as that of WA Mozart that he died in poverty. He didn't (and nor did Mozart). If you're interested more in the nitty gritty of Tesla's science and government shenanigans after his death DO watch the History Channel Series on Tesla. The other one's not perfect, but this one's purely about Tesla's socks."}, {"id": 47, "text": "Another 21st century movie whose sole aim is to braindead it's audience. The movie industry is on it's knees, crap like this is digging it's grave. I'm waiting for the funeral I won't be attending."}, {"id": 48, "text": "I knew this movie was no good 5 minutes into it. I would love to see a fine movie about Mr. Tesla but this isn't it nor does it come close. There wasn't a single scene worth watching. How could they actually release this piece of TRASH about someone as great as Tesla!"}, {"id": 49, "text": "I'm not sure if these 1 and 2 ratings are because people didn't see anything blow up or a car chase scene, but this is an excellent presentation of what really happened. Tesla should be credited for many inventions and not Edison, but that obviously didn't happen. I'm glad this movie was made and Ethan Hawke is wonderful."}, {"id": 50, "text": "Never done a review before and I will probably never do one again. I am a lover of history and period correct movies. They had such great material to work with but somehow created a monster. Avoid if looking for facts, production value or even decent acting."}, {"id": 51, "text": "A disappointing mess that wastes the great talents of Ethan Hawke and Eve Hewson. Oscillating between documentary and drama, it tries too hard to be clever, mixing 1890s America with references to modern times (Ethan sings 'everybody wants to rule the world', Eve talks to the screen about Googling things discussed in the movie, etc.). There's not much of a storyline and little to inspire in the dialogue either."}, {"id": 52, "text": "A series of scenes without much flow or connection. A girl talks to the camera to discuss google hits. Tesla has various meetings with investors and Edison. All pieced together in hopes of creating something interesting and passing it off as artsy. Not much acting, just people reciting their lines for the camera. Constant oldies background music for mood. Not much else, pass on this."}, {"id": 53, "text": "The production quality on this was about as good as I could do filming with my iPhone. Just horrible writing, directing &amp; editing all around. The real story of Tesla is fascinating but the filmmakers tried to get too cutesy with it. The end result is pretty much unwatchable. And to top it off they electrocute a dog!"}, {"id": 54, "text": "I watched this without expectations, which is probably wise seeing the reviews here. I was completely fascinated by the visual, sound, timeline and dimension experiments. The overall result leads you to questions reality, and conjures the notion that Tesla's brilliance my have taken him over the edge of his own stable grasp on reality even before that becomes apparent from his grandiose claims. While we watch what at first seems a history documentary, the story line becomes more and more speckled with the modern results of Teslas inventions, we back up out of alternate timelines, break through the fourth wall into today, to land back in Tesla's bed watching him sleep. The visual experiments combining different media, 2D, 3D, color, and black &amp; white reminded me of the psychedelic visual experiments in some of the better modern anime, albeit at a much gentler dreamy pace."}, {"id": 55, "text": "The movie was choppy and cheaply made. The story line was all over the place. Thought I would learn more about Tesla but it never really touched on what he invented."}, {"id": 56, "text": "Telsa is such a brilliant and interesting man. What a missed opportunity. This movie was so mind-numbingly boring. It felt so drawn out and slow, and there's very little mentioned of his back-story and works- which are key to understand him. There's also a female narrator that randomly pops in to give a brief bio of other characters- once again a missed opportunity to showcase Tesla's inner-workings and mental processes. Considering, Tesla had a book he wrote, you'd think they'd utilize that to fill in the blanks. It overall was a disappointment and not worth a watch if you're looking to learn more about him."}, {"id": 57, "text": "I was expecting so much from this movie. This let me down in all respects. Btw I love the 80s song choices for a movie set in the early 1900s... what an epic fail and facepalm at the same time. What an utter waste of money and time. They could've done so much better with this cast and characters."}, {"id": 58, "text": "He speaks more to women in the movie than he ever did in real life. How do we know this? Real historical facts based on people who knew him. Think of how the writers could have looked up these bits of info while Ethan Hawke sang Tears for Fears karaoke."}, {"id": 59, "text": "I love Nikola Tesla. I have read his interviews, his inventions and watched numerous documentaries about Tesla. This movie does not do justice for Tesla. Why would someone write such a miserable worthless story and shoot a movie about it? If you want to learn about Tesla, watch documentaries or read books. Do not watch this garbage. My husband started watching it and we were both disappointed."}, {"id": 60, "text": "It's trying too hard to be different and entertaining, and only accomplishes the former. At the start, it feels like it wants to be informative, but also quickly throws that away with weird filler scenes that are fantasy. It also appears to be trying and failing to be a black comedy.I don't expect biopics to be totally bound to the facts due to the desire to make movies that are entertaining. Unfortunately, this film just blasts a bunch of various different disjointed stories together, with far too many only tangentially related to Tesla. It's not an amusing work of fiction nor a good biography. It's like if somebody made The Greatest Showman about PT Barnum but without the singing, dancing, and amazing period sets. What's the point?"}, {"id": 61, "text": "This movie makes me so angry and upset 😠 I have done hundreds of search on Tesla's life and this movie was so disappointing. The story and the events dont match the truth of a great inventor . Terrible acting terrible production . I so admire this great inventor and even he is dead they still wouldnt leave him in peace and insist on making this horrible film! if i could rate this movie the Rate would be 0"}, {"id": 62, "text": "Boring film. That's being nice. Very random presentation of Tesla's life. Had potential but not enough money was poured into the film, sets are sad and flimsy. Acting is soooo poor. Characters were dull and lifeless. No mention of Mark Twain and his friendship. Not sure what they were attempting to accomplish with this film. Ethan Hawke deserves better scripts."}, {"id": 63, "text": "This film tries too hard to be arty when telling the story would work better. This film was nonsense, I'd like to know who I bill my time to"}, {"id": 64, "text": "This movie is one of the strangest I have seen recently. At first glance one would think it is just a normal biopic about what could be an interesting man's life. But, for some reason, the filmmakers decided to only depict the most unremarkable events of Tesla's adult life and string them together to make this movie. It seems like halfway through production they realised this, so occasionally something funny or interesting happens, only to have the narrator say ...but that is not how it happens and they replay the same event but now dull and boring. This narrator by the way is Anne Morgan, who in the movie is Tesla's love interest, although it never is made clear if they actually had a romantic relationship, did they get married...it remains obscure, although they are seen together ever since they met somewhat awkwardly. What makes it really strange is that she, an early 1900's character, is telling the story surrounded by modern technology like desktop computers and flatscreen televisions, mentioning things like Google etc. To top off the awkward feel of the movie, Tesla suddenly burst out in a creepy karaoke version of Everybody wants to rule the world by Tears for Fears.Having learned next to nothing about Tesla from the movie, I looked up Wikipedia and found out some interesting things about Tesla. For instance that the thing he had with Anne Morgan was probably very platonic and short-lived.Would not recommend for Date night."}, {"id": 65, "text": "If this movie considered to be a biographical movie it would be one of the worst biographical movies you will ever experience"}, {"id": 66, "text": "Tesla's story deserves better. It's not a terrible movie, but his achievements and life need a better retelling than this. A poor biopic, hopefully somebody will have the talent and a good script to do this story justice in the future."}, {"id": 67, "text": "It's not worth watching, incoherent story referring to things that might or might not be true. As a big fan of Tesla, this was a big disappointment."}, {"id": 68, "text": "Wonderful casting. Original perspective. Great performances. And the topic of Tesla is very important and timely for our generation. Consider the creative youth who are still being abused by our systems. Enjoy this great film, you won't regret taking the time. ;)"}, {"id": 69, "text": "Assertive, quirky and fresh; Tesla proves that biopics don't need to go by the book.A stylistic drama based on the true story of visionary inventor Nikola Tesla and his breakthroughs in transmitting electrical power and light.Writer/director Michael Almereyda's approach to Tesla's story is quite fascinating. It's a feast for the eyes, quite funny and well acted. Ethan Hawke dazzles as Tesla, Eve Hewson is sensational as Anne Morgan but the real scene stealer is Kyle MacLaclan as Thomas Edison. There's never an instant where he isn't in a scene that won't make you chuckle. A real gem of a biopic that is worth seeing. One of the final sequences in the film will have you howling. Stream it now to rent or buy.Follow @snobmedia for all reviews!"}, {"id": 70, "text": "If you watch and enjoy the movie in the spirit it was created you will get a lot of this film. It is meant, to my thinking, as a documentary. It is entertaining and fanciful. Well worth watching."}, {"id": 71, "text": "Brilliant, beautiful and tense and romanti almost. Edison lovers will always hate these movies. It is a modern take of documentary-movie style. Not a boring bit. Ethan is subtle almost Brando-esque. Very enjoyable movie."}, {"id": 72, "text": "This movie, film, documentary, drama, bio, comedy is a complex series of images telling the life of Tesla during his time in the US. His associations with Edison and the great banker Morgan and Morgan's daughter.This film is as complex as the man Tesla. The painted backgrounds (for me) represented the man's imagination - as he saw his life, so we see into his mind.He was a visionary for his time! His quiet character comes to us as mysterious. Thus we cannot ever know him. The contrast to Tesla is how Edison is depicted. Also a visionary for his time but he comes across as an open book. No mystery. We know this man."}, {"id": 73, "text": "The scenario is a bit weaker. Tesla as a singer, it's a beside the point, but otherwise quite an interesting biographical film."}, {"id": 74, "text": "Truly one of the worst movies i have ever seen.was it sponsored by google? every scene is so unrealistic and absolutely ridiculous. with a scene near the end(everyone will know what i am referring to) that is utter trash..seriously...what the?????? the writer/director should apologize.. and the veteran actors should shake their heads.....the worst!!"}, {"id": 75, "text": "Watching it felt more like a stage play than a film. Honestly didn't expect to get through the full movie but I eventually got interested. It's a fun way to do biopic, and I'd love to see this style utilized in the future. Somehow Almereyda made this film softly touch on the craziness that is 2020 which I appreciated as it is very subtle rather than explicit. It's the kind of film where you just have to sit and watch, if you expect something out of the film or spend the whole time microanalyzing you probably won't like it"}, {"id": 76, "text": "An interesting story turned into mush. What a waste."}, {"id": 77, "text": "The movie is boring and confusing. It fails to convey the brilliance of Tesla. He deserves better as one of the greatest minds who ever lived. Sad to see money and acting talent wasted on this piece of mediocre entertainment."}, {"id": 78, "text": "Most confusing, disjointed, and inaccurate uncertainties I have ever watched. Please find something better to do with your time. I am not sure what the writers/producers were doing or thinking, but it was definitely with integrity and interested in their viewers or this historical figure. Feels like a bad joke."}, {"id": 79, "text": "The anachronisms between the costumes, ice cream cones, and sirens in additional to the weak performances (though not sure script gave the actors anything to actual do) was enough to turn off after first 15 minutes. Dressing actors like it's 1908 mourning but stating it's 1888, while background are wearing 1840's silhouettes, is a mess that distract from any potential story."}, {"id": 80, "text": "This film is an amateur film. No real history fact. We are here today because of Nikola Tesla, yet this film does not honor that."}, {"id": 81, "text": "Nikola Tesla's picture in my head is very ugly now thanks to Ethan Hawke"}, {"id": 82, "text": "I can only assume that the people who hated this film simply didn't understand its meaning and its message, so clearly stated in the last lines of narration. How ironic this would be if they watched the film on a wireless computer or an iPhone!Anyone expecting a traditional bio-pic told in strict, historically-correct narrative terms would know no more than a few minutes into the film that that's not what writer/director Michael Almereyda had in mind.Instead he takes a rather dull character who has, sadly, faded from history, and made his life and work of painfully topical interest by the use of humour, anachronisms, and irony. Obviously this is beyond the grasp of many viewers.I especially loved the humour, which in some scenes made me laugh out loud (I am sure that is what Almereyda intended).Perhaps the film's haters would be happier with The Life of Alexander Graham Bell - starring the great Don Ameche! - from 1939. Gee, it gets a 6.9 rating, so it MUST be a better film! (As of today, Tesla earns a whopping 5.7)I have long ago ceased to seriously consider the ratings given in these pages, a website which proposes The Shawshank Redemption as the greatest movie ever made. But once again I must question IMDb when it allows - as per its demographic breakdown by age and gender binary - a girl of less than 18 years to give a rating of 1. Could she even understand it? Tears for Fears' album Songs from the Big Chair was released 35 years ago on vinyl, cassette, and those shiny new compact discs. I shall resist my temptation to offer her some alternative entertainment suggestions."}, {"id": 83, "text": "First, please do not let that many negative reviews fool you. Some of them are politically motivated (I will not elaborate this) and some of them from people who expected a straight-lined dull biography. I really enjoyed this movie as a clever, unconventional and entertaining approach to Tesla's life and his work in the USA. (The movie does not cover his earlier life in Europe.) And finally, watching Ethan Hawke as Tesla and Kyle MacLachlan as Thomas Edison in such an unconventional and funny movie is really enjoyable."}, {"id": 84, "text": "I like the quirkiness. Also I love sci fi but also enjoy seeing drama &amp; this was a very good entertaining movie without excessive CGI in every scene. It was very good acting! Interesting twists."}, {"id": 85, "text": "The film doesn't try to get every invention or part of his life, just another perspective of Tesla and Anne Morgan whit the 4th wall and description of certain characters. It a nice film whit notoriously low budget backroom, and a not essential sung by Tesla's character."}, {"id": 86, "text": "I really liked the movie.I don't know why people are rating this movie too low.Maybe,they are concerned about it's pacing. When it comes to the cinematography,it's great,The artistic approach,is something different. The breaking of the fourth wall sequences is a good idea. This movie focuses more on his struggles and also show us about few of his findings and researches. When,a man like Nikola Tesla,whose researches and findings were way beyond comprehension,is made the subject matter of a movie,then getting a movie like this is nothing bad at all. Acting wise everyone is fine.Ethan Hawke gives yet another great performance,reserved kind of a performance,but great. It was way better than The Current war movie and a good attempt at Nikola Tesla with some amount of minute mockery which can be overlooked."}, {"id": 87, "text": "15% documentary with some narration, 80% movie, and 5% pure fiction (they admit 2 scenes didnt really happen).In one of the scenes I am pretty sure Edison pulls a mobile phone out of his pocket and begins to scroll through his social media account.In another scene Tesla does karaoke in which he sings Everybody wants to rule the world by Tears For Fears.Tesla died in 1943, broke and alone, but 2000 people did attend his funeral."}, {"id": 88, "text": "2 stars for Tesla singing at the end of the movie He really nailed that song, it was beautifully rendered, just sheer perfection"}, {"id": 89, "text": "Tesla would die again if he could watch this.Don't waste your time. You'll learn more about Tesla by watching a 10 minute video on YouTube. This movie doesn't tell you who he really was."}, {"id": 90, "text": "1) Ethan Hawke, wtf is this? 2) There's one scene towards the end when the lead ventures outdoors during the day, and it's so refreshing because by that time, your brain will be squished by thee onslaught of powerpoint presentation slides, mock backgrounds &amp; disco lighting. 3) It's impossible to follow dialogue with Ethan's mumbling with a permanent confusion etched on his face &amp; the meandering yet stationary screenplay. 4) The scientific portions are neither jargony nor simplified (Hollywood style), instead it's just middle of the road dull and confusing. Which is what thhis movie sadly is!"}, {"id": 91, "text": "A well-made film that may not appeal to many. Narrated by the dead Anne Morgan, the film contrasts the quiet, reflective Tesla with the very verbose Edison and his nonchalant world of the electric chair executions. The script can confound many (a deliberate anachronism is that there was no Google or internet when Anne Morgan lived and courted Tesla). But the script (Anne's perspective) is exploring Tesla's mind and behavior as she perceived him, and the effect of JP Morgan's daughter Anne (the narrator herself) and her father on Tesla's life and Sarah Bernhardt's competing interest in Tesla. This biopic is less about science and more about how Tesla's lover assesses him after her own death. Now that absurdism may not be the average viewer's cuppa. If it still confuses the viewer, neither Ms Anne Morgan nor the famous actress Ms Bernhardt ever became Mrs Tesla. But I guess both would have loved to be Mrs Tesla."}, {"id": 92, "text": "Disjointed. Boring. No connection between characters. Poorly representing one of the most incredible inventors of all time. Don't bother with this one."}, {"id": 93, "text": "Please don't go watch this. Utter nonsense. Tesla deserves sooooo much better."}, {"id": 94, "text": "Wasted a perfectly good Ratuken voucher on this nonsense! Dull and unexciting, then some weird karaoke near the end. Pretentious and confusing."}, {"id": 95, "text": "Tesla is a Drama movie in which we watch the life of Nikola Tesla from a different perspective and we follow his life choices through time. There is also a reference on his interactions with Thomas Edison, J. P. Morgan and his daughter Anne Morgan.I have to admit that I expected something different than this since this movie is supposed to be a biography. I am not saying that it's a bad movie but I don't think that is a masterpiece. I was disappointed by the result because I had high expectations from it but I found interesting its perspective and the direction which was made by Michael Almereyda who tried to make it more artistic. Regarding the interpretation of Ethan Hawke who played as Nikola Tesla I have to say that I liked it but I am sure that if this movie was an original biography movie then Ethan Hawke would elevate it."}, {"id": 96, "text": "Too dark and too slow. Boring. Tesla deserved something better."}, {"id": 97, "text": "It's really dreadful and will possibly make you fall asleep. It's done in a really weird way, felt like a bad play or something.Won't spoil it but seriously, unless you're a fan or really interested I wouldn't bother. Really bad."}, {"id": 98, "text": "Didn't covered the whole story like DESTRUCTION OF THE TESLA LABORATORY BY FIRE"}, {"id": 99, "text": "Every human being is an engine geared to the wheelwork of the universe. Reunites the director with his Hamlet (2000). Michael Almereyda's film, a signature blending of style and formats. The avant-garde biopic sidestepping declassified documents altogether. Ethan Hawke's performance resembling that of a silent movie star."}, {"id": 100, "text": "Why did this not work...? Attempting to romanticise Tesla's life in the shadows of Eddison by theatrically staging obvious scenes. Surprisingly well spoken English for someone raised in Croatia, but at times showed an interesting but severely dramatised theories from which I doubt has any trail of accuracy."}, {"id": 101, "text": "Well written, acted, filmed, and scored, I think this lesser budgeted film translates Tesla's life well for the creative mind almost exclusively. It makes me wish that I had met the man if for nothing else than to console him on his ideals and warn him of those who would prey on them. Can idealism and capitalism coexist?...a warning to would-be inventors and creatives everywhere."}, {"id": 102, "text": "I give it 1 star because there are no negative numbersThis is the worst rewrite movie in the history of a man that I have seen in the last 40 years. If you are really interested in knowing the life and work of this man, his inventions and his real life (REAL, not the one they did and WRONG), do yourself a favor and buy the book Man Out of Time by the writer Margaret Cheney. You will thank me for a lifetime.It is NOT worth 5 minutes to see this horror."}, {"id": 103, "text": "There was so much more that this movie could have been. Was really hoping to learn about Tesla and Edison and instead got mostly a farce of their lives. Such a slow, dull movie. Could barely stay awake."}, {"id": 104, "text": "By the title of the picture I thought it would be a biography of Nicola Tesla, the man who was a genius with electricity. Obviously there was another Tesla of whom I know nothing? I lasted two reels."}, {"id": 105, "text": "If you want to watch a descent Tesla movie go watch the secret life of nikola Tesla it came out in 1980. I had high hopes for this movie hearing Ethan Hawke was in it but just so many problem with this you have a narrator googling information you can do this on your own paper background scenery camera work meh scenes that were a waste of time they show you scenes And then after it's over tell you from the narrator but this never happened waste of time instead of showing the fair lighting up they more talk about it in the next room i had high hopes after watching the current war which I'd rather watch than this I didn't like that either I felt they under cut Tesla in that movie but that's just me"}, {"id": 106, "text": "He did not invent AC he was just a proponent of it, Edision did not steal his work, why would he and nobody stopped him with his stupid wi fi electricity. Even his inventions that did work were mainly invented by other people and he patented them or he just improved on other peoples work, as they all do."}, {"id": 107, "text": "Tesla was an incredibly interesting and tortured soul. This movie was more torture than interesting. Ethan Hawke tried yo deliver but the script just wasn't there nor was his heart. Save your money it will be on cable sooner than later."}, {"id": 108, "text": "Boring is an understatement. It hurt to watch. My Husband and I love Tesla, but this movie was a poor representation. Also did I mention it was boring? Yea, also, very boring :D"}, {"id": 109, "text": "What a load of old cobblers. Dreary acting, poorly told story and the fantasy scenes are just plain ridiculous. I confess i gave up after an hour and i usually see films to the end but i really wasnt going to waste any more time on this one."}, {"id": 110, "text": "An idiotic movie. Inaccurate, confusing, zero continuity, a total waste of time and what's with the music? I wish I had walked out. Everything I've seen about Tesla on the History Channel, PBS, TLC, etc. was so much better. Unbelievable that anyone thought this worth releasing."}, {"id": 111, "text": "If I could give 15 stars, I would. You're gonna love it. And one bonus in this movie, you will hear one of the best covers ever made by Mr Ethan Hawk. Gosh it was so good. I haven't landed yet. A life time experience that will blow your mind if you don't do it first. Such a masterpiece."}, {"id": 112, "text": "One of the worst movies i think ive ever seen. a great cast wasted on a barely there flimsy poorly executed story that has zero momentum or drama.its hard to believe people read the script for this and thougth it would be a good idea to make. most not great films you can sort of watch anyway but this is offensively bad and hard to find any positives in."}, {"id": 113, "text": "Nikola Tesla might be one of the most fascinating and influential people to live, certainly in recent history, and his life story is wild. Was really looking forward to this and had high expectations with such great casting, yet almost from start to finish it was a completely confusing mess.In short, they ruined an otherwise amazing real story with chronology gimmicks, jumping between high budget and extremely low budget scenes/sets, and filling this historical piece with unnecessary and confusing modernity (contemlorary music, cell phones, Google searches,, modern traffic sounds, vacuum cleaners, 1980's karaoke, etc.) in an attempt to show the impact Tesla indirectly had on our modern world."}, {"id": 114, "text": "Just what we always wanted. It's very amazing to let the movie goes and ends by itself.It shows the capability of the director.And it's really cool to give the audition a little shock, by making some paradoxes,antithesis and things like that."}, {"id": 115, "text": "The cast was really good, the movie was total crap- but it could have been great!Easy Fix: Guy Madden should have directed it! Then it would have been I N C R E D I B L E ! ! !"}, {"id": 116, "text": "I love Tesla biography movies but it wasn't best.The current war better than that."}, {"id": 117, "text": "So why is there so much of a love story to appeal to them? Boring as hell. Also, hey world, this underdog culture of pretending the best isn't the best, or that Tesla was more than just a lowly nobody in the shadows of Westinghouse and Edison, is laughable and played out. Give it up. There's no sexy scandal to be found."}, {"id": 118, "text": "The actors were phenomenal but even with all that talent, this movie was confusing and the end completely stupid, degrading, why?😵"}, {"id": 119, "text": "Edison in the early 19th century asking his subordinates, Seriously? And whipping out his iPhone while at a bar sipping on coke from the bottle as part of a meeting with Tesla that the narration in the movie admits never happened?! Then why have the scene! After watching senseless scenes with dialog written by someone who can't speak English in the 21st century never mind the 19 century, I terminated the movie., something I've not done in over 20 years. Spaceballs the movie made more sense and had more relevant and meaningful dialog than this freewheeling mess that attempts to reimagine history to make a buck. The writers should have had the female lead Google how to investigate your subject matter just as they had her break character and Google useless details about the movie, DURING the movie."}, {"id": 120, "text": "You'd think a new biopic of Nikolai Tesla would be interesting, maybe electrifying? Nope. The director of the movie has no clue what he wants this movie to be. Using a female character narrating the movie and saying Google this or Google that, he mixes up scenes with this annoying millennial narration and a god awful script and you get a complete, confusing, boring mess. Even Ethan Hawke can't save this abomination. The script is right out of the George Lucas school of scriptwriting. Just bad. Avoid this at all cost."}, {"id": 121, "text": "In my opinion this movie is so boring and confused, i dont like it and i have some question why adison is has a phone?"}, {"id": 122, "text": "This is really not worth watching. Nicola Tesla is an interesting person and obviously I expected this to be an interesting movie. It was just a strange mess of fantasy and strange scenes. I woke up to Nicola Tesla singing off pitch in a microphone. Dont waste your time."}, {"id": 123, "text": "I have always been fascinated with Nikola Tesla, and was really hoping that this movie would finally be an insightful biographical depiction of the man and his work, instead I found it aimless boring and after and quite irritating, I only managed to get though 45 minutes before I gave up quite disappointed."}, {"id": 124, "text": "I have to agree with most of the other posts. I am afan if art house cinema and documentary as genres, but the anachronism, and the fractured nature of the narrative made this disappointing at best."}, {"id": 125, "text": "Was this adapted from a play? LOT'S of green screen sets. This film really lost me 9min in when the narrator is shown on screen on a period set in period clothing using a laptop and a projector to display Google results comparing Tesla and Edison. Very disappointing to see an opportunity to bring Tesla's story to life and have it be anachronistic and extremely dull. Don't waste your money renting, wait till it's on a streaming service if you must."}, {"id": 126, "text": "Tesla was a very weird film,it had some very good staff but also plenty with of stupid ones and dumb decisions when they were filming this ,Ethan Hawke was a good as Tesla his accent as solid and his character potreyal was also surprising and good,rest of cast was also good expecely McKalhan who played Edison he sold his ruthless and self caring very good,story was also solid but it had really dumb staff in it,like scenes where they were eating ice cream and when Edison take out Iphone from pocket also narration was way to annoying and not necserey Tesla was a watchable film but it had some really bad staff in it"}, {"id": 127, "text": "Tesla is the kind of silly, self-indulgent, pretentious nonsense you might expect of an experimental theatre production mounted by drama students given free rein. by a not-very-smart drama teacher. Quite how it ended up as a movie starring Ethan Hawke is a complete mystery - and hopefully the subject of some serious soul-searching (and forensic accounting) by the various production companies involved. It's a damn shame because Nikola Tesla is a worthy subject for a biopic that would make a wider audience aware of his tormented genius, not one that will do nothing to rescue him from history's scrap heap. Most of the blame lies with the writer-director (whose name I will not even write). His script re-defines dull, even as he commits all the crimes of film biography employed by Hollywood types who think they know how to jazz up history. He barely bothers with any kind of characterisation or timeline, and the artistic license flows like sewerage, covering everything with muck and stinking to high heaven. Ethan Hawke plays Tesla in a soporific monotone that will have you nodding off within minutes. You'd think such an accomplished actor would have had more sense than to go with such an obviously risky acting choice. But then he didn't have the sense to resist the movie's musical finale either. There's really nothing to recommend Tesla. The two stars are purely for the movie's rating on the so bad it's good scale. And because it just may encourage a few people to google Nikola Tesla, which in itself will be a much more rewarding experience."}, {"id": 128, "text": "Wow! I am stunned and Not in a good way! What was the writer and director trying to do here? The movie slogs along with some of the worst dialogue and acting that i can recall, especially from actors like kyle mcclaclin and ethan hawke.. What happened to these usually fine actors when put in this mess of a movie? They took one of the most interesting men in history and created a character utterly lacking in charisma,likeability or depth and made him an easily manipulated boring soul that had women drooling over him,yet portrayed in a way that you would wonder why. No redeemable music score, as a matter of fact, the whole movie went off the rails when Tesla started singing a tears for fears song at the end! I was like am I really seeing this? tell me they arent gonna have tesla try to sing this song! A song which is completely of sync and time with the movie period its set in... That scene just sunk it for me.. Bad beyond bad and dont get me started on the cinematography which consisted of scenes done in front of what looked like picture murals instead of Real imagery.. I had a doubletake when I first seen it and then they did it over and over in the movie.. its like it was done on a micro budget by highschool kids as a project over the weekend.. that bad.....There was another movie that was Outstanding about the time period of edison,tesla and westinghouse with jp morgan ect...it was called Current Wars a superb movie with decent acting and a story done right...That movie is highly recommended...this movie here,was one of those times a writer tried to Re imagine history to make it more interesting but instead created something inaccurate,uninteresting and in the end, disrespectful to one of the most influential figures of modern history and thats being kind."}, {"id": 129, "text": "Honestly yes, I wanted to love this movie for 2 reasons.Because I love the great Nikola Tesla, one of the most amazing men in human history.And because I love Ethan Hawke, the fantastic actor in Dead Poets Society, Alive, and Training Day.I sat in my seat at the Major Cineplex here in Pattaya in such positive mood, ready for Tesla.What a disappointment.The movie is all over the place, featuring some obnoxious, silly parts that want to make you leave the cinema, such as when the director of this movie though that it was necessary for us to watch Tesla singing.Really hard to handle.Still, I made it to the end, though wishing that I would have listen to the reviewers here in Imdb who warned us about the low quality of this Tesla flick.Really before going to the cinema I read many reviews, many bad. But I am an amigo who makes up his own mind and wanted to see the film.I wish I hadn't 😬Luckily, the movie was the very last showing in Pattaya so the ticket price was only $ 3.20 dollars.There were only total 3 people watching in the whole cinema.I wish I was not one of them. I do not recommend it and I give it a rating of 4 out of ten.the last full measure is ligh-years a better option than tesla"}, {"id": 130, "text": "Nikola Tesla was the greatest mind in modern history, if not in the history of mankind. We owe everything that makes up modern society to this great man. While this movie may very well introduce Tesla to millennials who otherwise would never have heard of him, that is the extent of my praise for this waste of digital film. As someone who has read and watched everything ever produced by or about this revolutionary genius, I had been looking forward to this ever since I first heard it was being filmed. After watching it, however, I cannot for the life of me see how anyone could give this anything more than a three star review and that is pushing it.The entire film was disjointed. We jump from one aspect of his life to another, never spending enough time in any one period to truly grasp what is going on. Scenes are filmed with old photographs as static backgrounds - similar to what you might see in a stage play. Important aspect of Tesla's life are left out completely - one of his best friends, Samuel Clemens (aka Mark Twain) is completely omitted. There are two scenes that are shown, and then the narrator tells us well that never really happened and then they replay the scenes as they did occur. As boring as the movie was - and this coming from a self-identified Nikola Tesla fanboy - what really took the cake was at the very end when Nikola Tesla - father of alternating current and everything associated with that system - takes the stage and serenades us with his rendition of Everybody Wants to Rule the World as original recorded by REM. Seriously?!This was the worst case of rewriting history I've seen in the past 24 hours. If you are truly interested in the man, his inventions and his REAL life, do yourself a favor and pick up a BOOK. I recommend Man Out of Time by Margaret Cheney."}, {"id": 131, "text": "As usual, Ethan Hawke gives his all as the great inventor, and the anachronistic approach and unusual visual style might not suit everyone's taste, but I especially enjoyed those aspects of the movie.However, the passive narration by, and soulless performance of Eve Hewson sorely lacks any conviction or talent, which ruins the entire experience. In a way, I consider this quite surprising, since she's playing the daughter of Thomas Edison, an egocentric, greedy hypocrite; I'd think this role shouldn't be too hard for her, as her actual father ihas repeatedly proven himself to be a blatant fraud, who once made an empty private jet fly halfway around the world to pick up his lucky cowboy hat, all the while preaching about the environment - not to mention moving the headquarters of his band to the Netherlands to avoid paying taxes. But daddy has the money and the connections to forge a career for her.Even without this background information, I'd still say she's the reason this movie doesn't work, and it's a pity; this could've been the masterpiece Nikola Tesla deserves, but for the time being, we'll have to wait for a truly worthy movie depicting his wondrous genius."}, {"id": 132, "text": "Tesla is one of those films that folks will find brilliant or dreadful.In style and form, it's closer to a stage play. Characters frequently play monologues in front of intentionally-flat-looking backdrops. The story is told directly to the audience by an unreliable narrator. It is not telling a documentary tale but rather the story of Tesla partly from the perspective of his friend and erstwhile love, Anne Morgan, and partly from our modern perspective looking back.Looking for realism is a fool's errand with this film. It is impressionistic and high design, not a literal biopic. Anachronisms are intentional, and it roots it in today's popular view of Tesla rather than a historical one.The film makes an open question of Tesla's balance of genius and madman. The mysteries of his later life are left unanswered.There have been quite a few films and documentaries about Tesla's life which were enlightening and described what he was possibly trying to achieve. If you want a historical perspective, look them up. That's not what this film is here for. This would fall closer into a category with the portrayal by David Bowie in The Prestige, a mix of truth and legend."}, {"id": 133, "text": "I see why most of the people here are disappointed. This is not any of the conventional or orthodox cinematic experience one expect for a movie subsumed into the genre of Biography. However, I've enjoyed it precisely because of this.It's experimental, highly theatrical and full of irony. It's Brechtian in the sense that keeps you constantly aware of it's unrealisticity. It's Brechtian in the sense that it mocks the genius of people wanting to change the world while strengthening the very foundations of the system that governs it. It's Brechtian in the sense that it asks the question What keeps the mankind alive? and answers Its foolishness, even among its most prominent geniuses.Both the monologues and the dialogues are marvellous. The script as a whole is one of high elegance and precision without leaving aside the need for a pinch of absurdity. Both the scenography and acting are highly theatrical. The cinematography is following the classical approaches while merging with the preceding two, thus creating a feeling of proximity and remoteness at once.In general - the overall rating here for me is quite beneath what this piece truly deserves.Go watch it, I don't believe you will regret."}, {"id": 134, "text": "I think this is a great historic picture - even if somewhat surrealistic - of the visionary inventor Nikola Tesla, and his interactions with J.P. Morgan's daughter Anne, and his breakthroughs in transmitting electrical power. Also, interesting the conflict between capitalism and altruism portrayed in this film; in the sense that Tesla wanted to create a world where electricity and basic human requirements are free and accessible to everybody; but that his vision was not quite manifested due to his ignorance of economic realities. The narrator, Anne Morgan, sort of implies that she and Tesla would have made a great team - with her providing the financial backing and the economic expertise - so that Tesla would have been able to manifest his future cutting edge inventions; which had enormous altruistic and scientific potential. But regrettably this did not quite happen, as the two of them had a falling out - with Tesla slighting Anne, by making a move on the beautiful French actress Sarah Bernhardt. On that note, I think that Tesla's love interest, the French actress Sarah Bernhardt - who starred in some of the most popular French plays of the late 19th and early 20th centuries - got a bit the short end of the stick here; as she is portrayed by Anne Morgan as a femme fatale and bad influence on Tesla. Now French women contributed tremendously to the discovery of radioactivity. And they also contributed immensely to the discovery of electricity, in the sense that the beautiful Sarah Bernhardt inspired and electrified Tesla, so that he was able to make some pretty cool inventions - if this very accurate historic film is any indication of that :) This is actually also very much in line with Einstein's relativity theory, in particular the curvature of spacetime - that at the end of the day, we all electrify each other, in one way or the other :)"}, {"id": 135, "text": "Tesla ReviewAn experimental biopic about the life of Nikola Tesla, his development of the alternate current system, relationship with Thomas Edison, and Anne Morgan, J.P. Morgan's daughter.Even though I typically dislike biopics and find them uncinematic, I have long waited for a biopic about Nikola Tesla. Having read about Tesla's life through the years, his life story seemed like perfect dramatic material suitable for theatrical film and shockingly has been exploited very little in movies having only been played a few times by Hollywood actors.Director Michael Almereyda makes a bold experimental move with the film's storytelling, perhaps an attempt to break the wheel of the boring biopic formula. The film acknowledges Nikola Tesla is unsung in history for his scientific contributions and Thomas Edison is the figure of inspiration children tend to learn about in primary schools. The film features a character who is able to momentarily pause the movie, anachronistically use a laptop, look to the camera, and gives a modern commentary like a moderated university lecture.This self-reflexive narrative style along with its highly digital-looking cinematography makes the film's dramatic scenes feel like transitional re-enactment scenes out of a lifetime documentary. In certain moments, where Ethan Hawke is acting against an obviously back-projected background with a documentary-like voice-over explaining what is happened, they downright are re-enactments.As Michael Almereyda pushes on further with this chosen off-kilter aesthetic, with its modern commentary gradually becoming more abstract with more interruptions that continually pull you out of the dramatic narrative, the film plays akin to a video art piece on display in a grungy underground art gallery with an alcohol license that is populated with skinny guys with long fringes and eyes in mid-blink standing around girls with multi-colored hair hanging about. The girl then says to you, It's a great piece, isn't it? Screw Thomas Edison. And you acknowledge towards the display answering, Yeah, it is great. That darned Thomas Edison.Ethan Hawke approaches playing Nikola Tesla as how he might be like in person, downplaying the more mythic version of Tesla as a scientific wizard of electricity like David Bowie's version from Christopher Nolan's The Prestige. Hawke's Tesla is a lonely intense man of few words who does not stand out in a crowd. He lives inside his head all day and his imagination is presented as his greatest blessing and curse. The most tragic part is that he battles loneliness to serve all his ideas. Ethan Hawke's performance holds the entire film together through its free-flowing structure.The cinematography by Sean Price Williams, who previously shot Good Time, was deliberately tight on the actors' faces. Significant moments like the lighting exhibition at Chicago World Fair are glossed over. It makes one wonder if this was all an aesthetic choice or to cover up a lack of budget compared to the grand sweeping historical shots in The Current War. It is disappointing on some level.That said, I applaud Michael Almereyda's central idea. As a fan of Nikola Tesla, I am endeared by Almereyda's romantic notion and I too would have wished things would have been more fortunate for Nikola Tesla. What if Nikola Tesla had someone helping him financially? What if Nikola Tesla and Thomas Edison worked together? There were hypotheticals I enjoyed entertaining along with this film.That said, I'd have a hard time recommending Tesla to anybody unless they a) love Nikola Tesla and b) love abstract art. If you do not know a thing about Nikola Tesla and you are watching this movie to learn about him firsthand, Tesla will not teach you anything, at least not directly. I can see normal film audiences calling this pretentious trash. Speaking for myself only, I got the film's message. It said it in a weird way but I like what it had to say."}, {"id": 136, "text": "Ethan Hawke's character is bland at best. He looks like a scared puppy from start to finish, as if it was Tesla's only way to act socially. That is until 3/4 of the movie when suddenly he becomes the most confident man. No transition, no subtleties, just weak/scared to strong/confident.Secondary characters are way more convincing than Hawke's, which is misleading.I just couldn't believe the Google bits. Isn't it a biopic's role to educate us about an historic persona, in a way that just asking Hey Google to your phone couldn't provide?The backgrounds/backdrops... How can a movie with such budget use so much backdrops? If the whole movie was based on kind of a theatrical performance, I would have understand but nope: it switches between real locations and cheapo green screen job that's so obvious you can't help but wonder why it made the final cut. And then there's more pictures found on Google.The music. How can you relate to an historic bit when house music plays in the background? Once again, if the whole movie soundtrack was based on modern electronic music I would have totally understood. But why is it that edm is playing once or twice? Makes no sense whatsoever. And what the heck is it with that Everybody wants to rule the world bit?! It doesn't add anything to the story, in fact it makes it laughable, and not in the good way. Ridiculous.The storyline is very hard to follow and all over the place, as some other users already said. In fact I can now confidently confirm it's a mess.Expectations met: 2/10 Storyline: 1/10 Character performance: 6/10 (for the whole cast) Photography: 7/10 Production: 3/10 Audio/music: 1/10"}, {"id": 137, "text": "Nikola Tesla (Ethan Hawke) works for Thomas Edison (Kyle MacLachlan). He quits accusing Edison of owing him $50k. J.P. Morgan's daughter Anne Morgan (Eve Hewson) is the movie's narrator who is taken with him and his work. He does a business deal with George Westinghouse (Jim Gaffigan) and foolishly rips up their contract for Westinghouse's sake. He falls for actress Sarah Bernhardt (Rebecca Dayan) who is equally fascinated with him.This is an arthouse bio of legendary inventor Nikola Tesla. Hawke is trying to do quiet intensity. He definitely has the quiet and he gets the intensity at times when he's allowed. This is most notable for its style of fake situations, narration from a side character, and an oddly strip down tone. The combination is interesting but somehow lifeless. Every aspect of this places distance between Tesla and the audience. Then there is the karaoke ending. It's another artistic choice which places a distance between this Tesla from reality and from the audience. It's fascinating but distancing."}, {"id": 138, "text": "Firstly the acting is superb, as expected Ethan Hawke and Kyle MacLachlan are brilliant as is the rest of the cast. The trouble comes in a few forms...firstly there's the incredibly bad lighting, it's over exposed and flat, something a student would do at film school, then it's out of focus, then there's the dull sets, huge empty walls and spaces with a few plants in plant pots to break up the space. It's hugely noticeable. Lastly the script darting between what really happened and what should have happened with a narration running through, not good, not good at all. So I think this was filmed as a favour to a bunch of students to get them some work, I hope it has the opposite effect as the script, sets, set dressing, lighting and camerawork are all well below par. And then just as you thought it couldn't get any worse, Tesla starts singing Tears for Fears...yep you read that right...!! WTF. Clarifying that it's a Student whimsy, should never have been made, just changed my rating to 1. The only thing that carries this movie is the acting but unfortunately as everything else is so bad I have given it a very low score. If you are interested in Tesla (and you should be) this is interesting but you won't know what's real and what's not so it's of no use. Read a book."}, {"id": 139, "text": "Like another reviewer said, this thing is all over the place. The inventor's portrayal is dull, depressed and uninspiring. Tesla's life was anything but these things. Unfortunately, the audience is not given a chance to learn much about the inventor and his history from this picture. It's a low budget production but it could have been a decent movie if the script wasn't such a let down. The actors play is mostly okay, though Tesla is portrayed as such a boring and uninspiring type. I am really sorry here for Ethan Hawke who played the role. His character here is clearly by design overshadowed by Eve Hewson playing Tesla's friend (love interest?). It seems life fewer and fewer directors have the guts to portray an interesting male protagonist in the current social climate. The historical Tesla was an honorable, emotional type, a genius and a man popular with women who dressed in a flamboyant manner (when he was doing well and could afford it) and must have appeared to many contemporaries to be something of a magician or a madman since he was known for making bold statements and putting on incredible displays. On top of that, his life was abound with twists of fortune. In other words, he is a perfect subject for a gripping, colourful biography. Well, you won't find it in this movie. If you want to learn something about him, you will be better off watching a Tesla documentary like the Life of Nikola Tesla or a movie called the Current War. This here is a very unfortunate attempt and the movie on some occasions completely departs from any realism of the time in order to be... artistic? Cough, cough. Tesla deserves better."}, {"id": 140, "text": "Although I admire the acting and the movie format (historical 'documentary style' movie, even a musical in the end :-), it is not accurate at all considering the real Tesla, the real Piermont Morgan (etc ...).Tesla's NYC lab was burned to the ground, and promptly after that J.P. Morgan offered him a new lab in 'isolated' Colorado Springs. Coincidence? Morgan's plan was to side track and bankrupt Tesla from the very beginning, after he and Edison lost the 'war of the currents to Tesla. And so he did.Tesla's plan to employ his 'primary' longitudinal electric waves for communication and energy distribution (conducted by the natural media, such as 'single wire', the earth mass, or the aether) was delayed for many years, until the year 1925.In 1925 Nikola Tesla got a visit from Dr. T.H. Moray's legal team in his NYC hotel room. He was shown a 'cosmic energy converter' invention by Dr. Moray of which Moray was not sure if Tesla already invented it. Moray's invention was based on a special alloy made of Germanium and other elements, in order to tune in and receive natural 'cosmic energy waves, and convert this energy into normal electricity. The invention also deployed several stages of electronic vacuum triode tubes, and it could generated 50 KWatt power. Although Tesla had not invented something similar, Moray's patent application was denied by the USA patent system anyway.This visit stimulated Tesla to initiate a second period of research, where he combined his previous inventions with 8 triode vacuum tube amplifiers. Tesla succeeded 100% to invent his own version of the natural cosmic energy converter. He demonstrated this invention to Heinrich Jebens (for instance) in the form of an electric car, powered by a cosmic wave receiver/converter in the years 1930-1932. Tesla stored all his stuf in a NYC warehouse in 1934. After his death his inventions and notes were stolen by the office of alien property custodian (part of the USA justice department).Due to big errors in the foundations of physics, Tesla's primary longitudinal electric waves (that have subluminal velocity in material media, and superluminal velocity in the aether) were actively denied and 'outlawed' by physics theory, such that we are all fossil fuel junkies until today. In our galaxy there are strong natural sources of such waves.Compared with the natural cosmic energy receivers/converters invented by Moray and Tesla, our modern technology looks pale in comparison, even smartphones. I can backup this story with many details, enough said."}, {"id": 141, "text": "I was extremely disappointed in this film. The primary fault-if one can single out a primary fault-Is the assumption of knowledge in the viewer that does not exist. Do most people know the first thing about Nikola Tesla? Is this indeed a biographical drama about the man, or an exploration of the larger issues? The conflict over adopting DC and AC (or the difference between the two)? The greater arguments about/contest between Edison and others, tte role of Gilded Age money in the outcome, of adoption of one over the other?In any event, the film fails on all accounts, and that's a crying shame. When there is widespread knowledge among the public about a subject that has been told many times, then and only then does a filmmaker have the creative freedom to leave the constrictions of the traditional linear narrative behind. Given the absence of knowledge here, the filmmakers' choice to jump between forms ad hoc deals the subject a mortal blow.I am a professional historian and *I* was often lost. I may have learned more in the two minutes of narrative at the beginning and end specific to Nikola Tesla than I learned, meaningfully, about the rest of his life and work. The filmmakers would do better to chop up portions of this film and offer it as Part of a History Channel documentary. (Seriously!! Does anyone *really care* about Sarah Bernhardt?? What does her presence in the film do to advance *any* understanding of the subject?What a cruel waste.... This does no honor to the life and achievements of Nikola Tesla."}, {"id": 142, "text": "Other than the brilliant sun you enjoyed a lighted world today I am certain. Fresh food kept so due to the miracle of ubiquitous refrigeration. Conversations and messages delivered to your personal wireless radio. And for a growing number of folks personal transportaion using electricity only. Few men's inventions have shaped our modern world like those of Nikola Tesla. The man deserves a definitive movie.Like the complex, and extremely individualistic, Tesla that definitve movie isn't this one. Nor is the multiple other documentaires...or movies. I will therefore say this particular movie captures the enigma, or cult of personality one might say, of Tesla in a unique way. It's confusing blending fiction and fact, but it dares to try to to show a side of the man which a world conspired to marginalize. As such it will undoubetedly a;so be marginalized by harsh criticism.For whatever artistic license we do get a glimpse of man consumed to a level blurring the line of singular intelligence and mental illness. That's something important.So, suffer the difficult watch of this movie. Ride it out. It gives us a special glimpse of the downward spiral of Tesla's reign Instead of criticizing Ethan Hawke's portrayal as somewhat flat, even bizarre, realize this is the film capturing more of what became the shrinking stature of the greatest inventor of the last 200-years...likely in all of recorded history. In this the movie does succeed."}, {"id": 143, "text": "Our virtues and our failings are inseparable, like force and matter. When they separate, man is no more. Nikola Tesla Writer-director Michael Almereyda's biopic of Nikola Tesla (Ethan Hawke) is like that fusion of virtues and failings or his alternating current invention: the alternating gifts and heartbreaks are necessary for the robust life. This film attempts to show the competing forces that kept Tesla competing to change the world, and he did.As depicted here, Tesla is a quiet genius, not given to publicity or adulation but rather to the future of civilization through his AC invention and his radio coil, visions he had that came true in his lifetime spanning the 19th and 20th centuries. Besides his genius, the film depicts his ongoing competition with Thomas Edison (Kyle MacLachlan) and support from J. P. Morgan (Donnie Kreshaewarz). These challenges are the dramatic payoff for an otherwise measured exposition.The real challenge of this life was his relationship with Morgan's daughter, Anne (Eve Hewson), whose emotional support contrasts well with Tesla's introverted obsession with electricity; his romantically tentative relationship kept him from a full life, but not an unproductive one. The filmmakers balance the quiet introversion with expressionism such as process shots against outdoor scenes, and most of all Tesla's singing karaoke on roller skates.The contrast between fancy and the methodical pace of his engineering life is tough to balance out tonally, except that the singing segment does give life to an otherwise somber biopic. Introducing modern technology like the microphone and sophisticated projection serve to link the hero to his futurist dreams, which change the world forever.Nickola Tesla's influence on electricity, which my computer gobbles every hour of the day, is far grander than this biopic dares to celebrate. His influence on electric cars today, the most prominent of which bear his name, confirms the greatness this informative biopic delivers.The present is theirs; the future, for which I really worked, is mine. Tesla"}, {"id": 144, "text": "I looked forward to the release of Tesla (2020), and was dismayed to see that its story wasn't going anywhere. Ethan Hawke is a terrific talent, but he was barely allowed to speak in this mess of a film.An interesting casting choice was Jim Gaffigan as George Westinghouse. His performance was surprisingly good. And Rebecca Dayan gave us a wonderful portrayal of the great Sarah Bernhardt. But the world's first international superstar performer's encounters with Mr. Tesla reveal little of Tesla's personality or his great accomplishments. His genius, his understanding of mysterious forces and his ultimate downfall are what most interest us.Tesla was a fascinating person, and was without a doubt one of the greatest minds of the Twentieth Century. Unfortunately, this film only brings us glimpses of his genius, and not just because of an inadequate budget. Throw in some cell phones as props, techno bop into the nat sound and a karaoke scene with an Eighties hit, okay? None of that helps. No amount of razzle dazzle can ever save a bad script."}, {"id": 145, "text": "What do the history books say about Nikola Tesla? I would venture a guess that most U.S. textbooks tend to sway in the direction of Thomas Edison, the father of what is now our electric system. Tesla himself an employee of Edison's revolutionized and might have ultimately changed the world with his alternating current, but due ironically, to the need for more power, his vision never came to its full potential. Director Michael Almereyda has taken his fourth-wall-breaking style and infused it with Ethan Hawkes somber performance as Tesla, in a film much like it's subject it can sometimes astound and other times perplex its viewer.The film's narrator, Anne Morgan (played by Eve Hewson) tells Teslas story in a modern format like it was being told from a college student's presentation. While alternating to the story itself, a battle between Edison and Tesla's minds as well as their monetary leverage to see which idea lasts. Kyle MacLachlan as Edison is a good balance of the innovator we've read about in books but is able to bring out the brutal capitalist side as well. It's not until Tesla is introduced to George Westinghouse (played by Jim Gaffigan) that he can understand and witness first hand the costs that come with a visionary mind. Ethan Hawke does a wonderful job toeing the line of real and surrealism, at one point singing Everybody Wants To Rule The World to another where his subtlety stands out overall.Director Micahel Almereyda is much like Tesla in his artistic choices, not cleaning up the rough parts of his film but allowing them to be as they are. You have some interesting stylistic choices that work beautifully, like using narration and fourth-wall-breaking, but then might have what could be described as lackluster green screen effects that simply look like they were outside the filmmaker's budget to have showcased. Most of the cinematography is very beautiful, his use of lighting in certain scenes involving Tesla's experiments strike like lightning. The music is also an alternating dance between contemporary to old-fashioned, which works well for the film's intention of bringing Tesla to the modern world.For myself, the issues lie in the unfinished, rough visuals of the movie. While they don't happen at an astounding rate, when they are present I was thrown out of the film and more wondering why they chose to include green screen the likes of which I've not seen since Tommy Wiseau's The Room. But like Tesla, innovation can be messy, and while this could be a standout to draw attention away from the creativity of Almereyda, I couldn't help but admire the ambitious take on America's unsung inventor.Overall I would recommend checking this out if you have a weekend free. It's not the strongest film to come out of Sundance this year, but it has the heart and performances to push it over the edge and is worth watching."}, {"id": 146, "text": "Nikola Tesla was a very unique individual, especially for his time. He was well-known by most for his revolutionary inventions and brilliance. Despite his widespread notoriety, his personal life was (and still remains) largely obscured to the public, even those closest to him. In complete contrast to his rival, Thomas Edison, Tesla didn't like the limelight. Rather, his focus was on the accomplishment itself rather than the accolades. Thereby, he chose an extremely reclusive lifestyle where he could perform experiment in solitude. Ironically, his efforts to stay out of public eye fueled public interest and earned him an enigmatic reputation.I was originally drawn to this film because I was curious which direction the film makers would go with this. Since little was known about Tesla's inner sanctum, the writers/director were, by proxy granted a fair amount of creative freedom to essentially create Tesla, even if just based on speculation.Unfortunately, the production team chose not to touch this aspect of Tesla's life. They even went as far as to actively avoid it altogether. i.e. Tesla (Hawke) never gives speaks a narrative, soliloquy, inner dialogue etc throughout the entire movie. Instead, the story is told as a biography by a peripheral character who properly functions to tell the tale but fails to entertain.The acting and production value are acceptable. The movie comes off as very slow-paced due to the matter-of-fact style employed vs a traditional narrative with a build-up, climax, and resolution.I really don't want to say that this is a 'bad' movie. It's just a shame; this had so much potential that it didn't take advantage of. IMO, this movie is best suited for those who don't know much about Tesla's professional life. While not necessarily entertaining in the traditional sense, it's hard to describe his life as anything short of interesting and worth learning."}], "reviews_amount": 147}