{"name": "The Empty Man", "titleId": "tt05867314", "reviews": [{"id": 0, "text": "So, the good parts: The acting is generally on point, most of the cinematography is great, and I really liked the slow-burn approach (mostly). And taken individually, each of the three stories could have made a decent movie unto itself. But for some inexplicable reason, the producers decided to try to mesh together three storylines that have virtually nothing to do with each other - and in the process none of them is fully fleshed out.I've read some of the glowing reviews on here, and for the life of me, I can't figure out what they're seeing that I'm not. I'm not a simpleton that needs to have every plot device explained to me; I have no problem with abstract concepts, implied relationships, or things happening off-screen in a film. But this movie is either about an ancient subterranean entity in Asia, a scary U.S. childhood legend that may have turned out to be real, or a secretive cult that has somehow been manipulating people's thoughts and/or creating people to use for its own nefarious, but undefined, purposes. It tries but fails to be about all of them at once. I tired, I tried so hard to make sense of these three disparate storylines - but finally I gave up. If the movie can't make them line up any better than it did, then why should I kill myself trying?Intentionally obscure storytelling is not the same thing as being avant-garde. For all this movie's strengths, it cannot overcome poor plotting. You should wait until it's on some streaming service and try and decode it then, but don't pay to go see it."}, {"id": 1, "text": "I was afraid this was going to be one long, boring horror movie. It turned out to be just the opposite. It was riveting from the beginning till the end. A far cry from a typical scary movie. The story appears to be non-linear at times due to the flashbacks that slowly give hints that nothing is as it seems. The way the narrative plays out reminds me a lot of the movie Hereditary. If you don't have any idea about Tibetan mysticism the movie might be confusing you. It was well done, good cinematography, quality editing job and the great use of music painted the whole thing with a sense of often impalpable unease and eeriness. Maybe it leaves some questions half answered, but that only adds to its mind twisting quality. In the end I really liked the movie bcs it left me with an unsettling, head scratching aftertaste."}, {"id": 2, "text": "I went into The Empty Man not knowing anything about it. It was dumped out of nowhere and by the looks of the trailer I figured why. It seemed like a teen horror in the vein of countdown, truth or dare, or even bye bye man. But after the first twenty minutes of this film, I knew I was in for something much different. There is some truly chilling scenes in here, and the atmosphere just adds to the sense of dread. Now the climax of the film does get a bit clunky, but I imagine with this being based on a comic series, it's a lot more flushed out there, but even with an almost 2 1/2 hour run time, it felt like more was needed to be explained. Overall I came out of the empty man not feeling empty at all. It deserves an audience."}, {"id": 3, "text": "I went into this thinking it would be a dumb teen movie like Bye Bye Man. Fortunately, I was completely surprised when I found this movie to have really well done sound, cinematography, and overall production value with a much deeper story than anticipated."}, {"id": 4, "text": "This movie was such a let down! It started really good and i was excited to get into the movie. It kinda keeps going downhill as you watch and by the end/ending its really hit rock bottom."}, {"id": 5, "text": "This plays out as a cult horror, I thought it was going to be a cliche horror like slender man. This is a must watch."}, {"id": 6, "text": "Had lovecraftian fingerprints all over it. Fantastic score created a really dread filled atmosphere throughought the film. It was genuinely one of the creepiest films I have ever watched. Almost empty movie theatre added to the atmosphere.If you enjoy slow, psychological horror and a great film score you will enjoy this film. Definitely not your typical teen horror flick. The ending was kind of weak though and a bit unsatisfying."}, {"id": 7, "text": "This movie was incredibly boring. The first 20 minutes could've been left out entirely and you wouldn't have missed a thing. The lead actor was solid and did everything he could to save this meandering mess but with so little to work with he was empty. It was so mundane, the viewer waits and waits and waits for something exciting or remotely scary to happen and we get nothing. I'd rather watch another final destination or scream or we know what you did last summer flick than suffer through this garbage. Hollywood is dying and this is solid proof as to why !"}, {"id": 8, "text": "I was really engaged in the beginning, it started off pretty well, giving out the Prometheus type of vibes.. But... slowly slowly turned out to be weird, dislocated, out of the track. And the most annoying thing was the Jump scare tricks here and there... Which is the cheapest option to scare and shock the viewer instead of frightening psychologically..That pissed me off big time, and the director missed and wasted a great opportunity by ruining the concept and making it a low grade tricky drama."}, {"id": 9, "text": "I hate writing bad reviews. I really wanted to like this movie. Unfortunately, it takes itself WAY too serious and fails to be self-aware. Instead of settling for fun, campy horror, it took a philosophical/psychological route that result in a very boring, unengaging, two hours of runtime. Not one moment of the movie was scary and the ending was unsatisfying. This one hurt to watch, it's obvious why Disney didn't bother marketing the film. Overall, The Empty Man is a very empty movie."}, {"id": 10, "text": "I walked into the theater thinking that I was about to see a basic monster movie. Teenager summons monster by being stupid, monster attacks teenager, teenager gets help and beats the monster. Simple, right?Instead, I got a psychological thriller that could rival Shutter Island combined with Lovecraftian cosmic horror, a single scene which seamlessly combined terror with hilarity, and a plot twist that would make M. Night Shyamalan salivate.I spent the 15 minute drive from the theater in complete silence, and the last 20 minutes sitting on my bed with my mind blown so severely that I'm still questioning my entire existence. Do yourself a favor and watch this masterpiece."}, {"id": 11, "text": "This movie had a great potential, under one crucial condition - it should have been about 30-45 minutes long and had a less convoluted (unnecessarily twisted) ending. As a matter of fact, the beginning was quite original and not forced, but after that the movie took a lengthy, round about path. Visually appealing? Yes.High quality, genuine soundtrack? Yes. But when you spread really thin plot over 2:17H story line, you receive something very diluted and with subtle, watery taste. Good thing I didn't have to pay for the screener."}, {"id": 12, "text": "The sound effects are spot on, the concept of the movie Is decent but the execution is pretty bad. Unnecessary long movie , scenes are not connected well enough one another."}, {"id": 13, "text": "This movie is one of those movies that just drags on and on for no good reason. While the beginning wasn't terrible the movie just continuously got worse. And the ending was just awfully confusing and made no sense."}, {"id": 14, "text": "Once upon a time, a boy and girl were so eager to watch a movie, at the theatres. Finally, the movie theatres opened. They were so excited! Until they came to see empty man.PS: the movie is quite empty, man!"}, {"id": 15, "text": "Leave after the girl stabs herself because the movie litterally died after that happened what a waste of money"}, {"id": 16, "text": "Without publicity, The Empty Man was released yesterday in Mexico, the IMDb page was empty, not reviews or punctuation, I watched the trailer and it was cool. The Empty Man is a real trip, a story about a man searching for a missing girl involved in a sect, a perfect horror-thriller with crime elements and Lovecraftian influences. The script is really good, the acting is great, the direction is perfect, a cool music score, an awesome cinematography and an amazing production design, The Empty Man is a modern classic, a masterpiece and the best horror film of the 2020 so far!"}, {"id": 17, "text": "I really wanted to like this movie. It has been a long time since I have seen a good scary movie and I thought this just might be it. The first bit of the movie, when they were hiking and still in the mountains, was the better part of the movie. After that it went down hill from there. I tried to sit there and see if it got better, but it never did. It ended up exactly where I knew it was going to go. This movie REALLY Sucks!!!"}, {"id": 18, "text": "Good acting. Decent premise. Two or three really good moments that will catch you off guard. But the storyline is so convoluted. Parts of Empty Man went waaay over my head and therefore made the plot unnecessarily confusing.It's a shame because it had a couple of great moments and a chance to be something much better. Unfortunately I can't recommend you seeing this."}, {"id": 19, "text": "That's right, save your money. We were so excited to finally see a new movie at the theaters especially a horror movie with fairly good reviews, but the excitement didn't last long. I kept asking my husband if we were in the wrong theater seeing a different movie by mistake! This movie was so boring, so disappointing. I couldn't grasp the premise, the plot, the ending. If you need help falling asleep, this movie is for you."}, {"id": 20, "text": "Now this movies starts off cheap, which immidietely made me doubt it would be a good one. I mean, I've seen cheap-looking, but still good horrors (in fact, most of the best horrors are hidden gems and they are usually low budget), but this one was also looking terribly blunt at the start. I was expecting story to be very predictible, like a bad cliche script, etc. Now, in some way, it was a cliche for the most of it, but damn that ending was really crazy and unexpected. I still believe the first part of the movie could've just been executed much better, not only in terms of visuals, but even in terms of acting and dialogs, and all the small things throughout the movie felt like this was an experimental movie made by a student that does not have a lot of experience on movie making. Still I would say it is a hidden gem, which you can only aknowledge, though, if you watch the movie until the end, because first part is boring and doesn't give away how much better it will become throught it."}, {"id": 21, "text": "This Could be even a better movie with more special horror effects and making a Scary evil character for EmptyMan come killing people ... But the idea of the description was ok and i liked it.."}, {"id": 22, "text": "Damn! That was a total let down. I'm not saying this film was terrible but it's definitely not what I expected. The movie started out good then went in a total different direction. I really don't even know what I just watched. In the end none of it made any sense. They totally lost me with all the noncoherent sci-fi babble. I will say It was shot well and had a few creepy scenes here and there. Nevertheless it's not something I'd watch again or recommend..I'm going to be generous here and rate this movie a 6."}, {"id": 23, "text": "This is a long movie. A bit depressing, but keeps you on the edge of your seat. Cult action, guilt, betrayal, and insanity. It's worth a watch and filmed as well as acted quite good. Not for everyone. It is introspective and dark."}, {"id": 24, "text": "Original, suspenseful slow burner based on the rarely broached egragore. Intelligently exposed jigsaw piece of a thriller barely marketed at all. Could become a cult movie given time."}, {"id": 25, "text": "Can't believe i took the family to the movies to support the cinema in these COVID-19 times to sit through over 2 hours of this mess to be feeling like an empty man and empty wallet. 😞😞 don't know what this movie was trying to be because it ain't no horror."}, {"id": 26, "text": "...he wants his Horn Player back!I expected a monster reincarnation flick. But nothing really happened. I literally fell asleep."}, {"id": 27, "text": "Wow. The Turning is still probably the worst film of 2020, but this one is likely in the top 5. I believe this script was written for the purpose of NOT being understood. It's like 2001: A Space Odyssey in that it was meant, I think, to be discussed rather than to entertain. Moreover, the parts that are actually kind of interesting don't matter at all because the ending is a total sham."}, {"id": 28, "text": "This movie began good, then turned into a useless waste of time, especially when that cop could only grab his bat to defend himself in his own home, that happened twice even after what looked like him robbing a gun shop to arm himself?? WTH? Then it began to mimic the 1987 super natural horror Angel Heart.Nothing made sense after the hiking scene, where I wanted to jump off a cliff when he took the time to drive into the woods only to turn around and walk away when he found something he should have been videoing or taking pictures of.Yeah, in the end, this was nothing but a pile of crap because The Empty Man scked doodie..."}, {"id": 29, "text": "I was excited for this. The rating was great(Seemed like a hard R) and had an interesting story. After the first 15-20 mins the movie goes completely down hill. Nothing remotely scary happens unless you find ASMR whispering creepy. Too much in between time with an incredibly boring lead makes for a boring and empty journey."}, {"id": 30, "text": "Overall I think this film was very entertaining and merits a viewing. In the beginning of the film the hiker stumbles across this hidden temple and awakens some kind of demonic god and becomes the vessel. The other hikers in the group then become victims through unsettling deaths. I thought this was well done and very creepy. The rest of the film follows an ex-cop suffering from depression and nightmares over losing his wife and child in an accident while he was having an affair. He sets out to find the missing daughter of his mistress and notices many cases of missing people / deaths that end up being linked to a cult group formed around the hiker.The film played out more like a mystery thriller and had very little that would be considered horror. The lead actor portrayed his character very well and kept me engaged. I really enjoyed the film and it's definitely worth a watch if you enjoy cult films, but just keep in mind that the run time is over 2hrs and is a slow burner."}, {"id": 31, "text": "I get that the movie has an identity crisis and genre hops from horror to psychological thriller. The plotline goes from rudimentary to vague. Still, the negative reviews were written by people who probably enjoyed Happy Death Day and other garbage Chumhouse churns out. There are countless cookie-cutter horror films available for streaming, and one, Come Play, scheduled for theatrical release this week if you're so desperate to get The Empty Man out of your head.Why did I like it? Because it tried. The cast and crew weren't complacent and didn't try to pepper in any agenda-driven, social justice nonsense that is starting to replace adequate storytelling in mainstream features. Just make a damn movie!!! That's what they did here."}, {"id": 32, "text": "Let's go with the good parts first. Acting is very good and satisfying. Cinematography the same. The first 15 minutes on the mountain are really interesting and suspenseful. The former cop story looking for a neighbour's daughter starts very good. Suddenly after the SPA scene, the starts making no sense at all. This is not an psycho killer, entity or possession movie; in fact by the ends try to be somewhat Lovecraftian. Now with the bad. The movie is too long and feels even longer. The script does not seems to decide where to head the movie; by the end the different concepts get mixed but not properly tied up so basically many things has nothing to do with overall plot. Without spoiling too much; most of the ideas came from ANGEL HEART, THE SECT or many other better, where the main character is more involved than he thinks. In brief; is not too boring but is really long and the mystery and final twist is not that surprising"}, {"id": 33, "text": "Made no since and was very dumb plz try and work on it"}, {"id": 34, "text": "The empty man is what we would call a psychological horror even tho it's trailer was very misleading and you would think you were going to see a teen horror movie . But it's creepy and unusual plot can also leave you confused but if you pay really close attention everything connects in a way with it's whole 360 turn to something far more psychological but yet supernatural. If you liked hereditary it's definitely a movie worth watching , the only reason why I gave it a 9/10 is because it wasn't really scary but more as a mind picker for the audience but definitely deserves to be praised and more appreciated for it's genre."}, {"id": 35, "text": "The Emptyman is a scary movie with Joel Courtney, James Badge Dale, and Aaron Poole in a movie about a spirit that inhabits the body of Aaron Poole's character Paul in Bhutan after his girlfriend Fiona played by Jessica Matten kills his other two friends hiking with him in Bhutan.Ten years later Sasha Frovola's character Amanda Quail starts a chant on a bridge with Samantha Logan's character Davara Walsh and some friends and they call the Emptyman into existence and it scares the hell out of them. After Davara Walsh disappears James Badge Dale's character James Lasombra an ex-cop investigates her disappearance. Joel Courtney's character Brandon Mabum also becomes an Emptyman devotee. Ron Canada playing detective Villiers and Tanya Van Graan playing Allison Lasombra also co-stars. It is a very scary movie."}, {"id": 36, "text": "I loved this movie and want to fund more. 1. A horror thriller apocalypse smash. 2. A teenager follow up. 3. The first empty man, follow up.I loved the production, script, settings, music, creep interlaced with the horror moment. I loved the multiple uses of differing horror themes and the three to five differing sets of horror stereotypes used. Cast is attractive, looks great when it shows."}, {"id": 37, "text": "This movie is quite slow but it doesn't mean its not interesting. The plot is incredibly complex which kept me thinking the whole time about what was going to happen and why it was happening. The overall story point is that the empty man is not the supernatural being, we as the viewer do not know who or what the creature really is, great use of a cosmic style horror by the way, the Empty Man is an actual man who is empty. With that little plot description and slight spoiler out of the way back to the actual review. The acting in this movie isn't anything amazing but its also good enough to seem believable when characters are in parallel or facing the unknown. The real kicker is the sound use and the use of sound in this movie is amazing, the quite parts really add tension as slow humming choruses build up in the background really setting a good unsettling feeling throughout the movie. If you haven't already i defiantly suggest you check out the soundtrack on spotify. The camera work was also very well done keeping certain plot devices centered and keeping your attention away from other items in the movie that will appear later. There are a few scenes that drag on but when you reach the end of the scene its kind of a Oh thats why they included this moment. Overall its a film that really makes you think and I believe many things I missed on the first viewing will make more sense upon a second viewing."}, {"id": 38, "text": "James Badge Dale steals the show in this one. He is definitely getting noticed as a great actor. The movie is good in that you think you know where it's headed but goes a different direction. There aren't really lots of jump scares either which I find as cheap scares."}, {"id": 39, "text": "The Empty Man is Directed by David Prior and it was surprisingly good! I was going into this with some hope, but not a lot and it delivered surprisingly. The story was pretty interesting and I was hooked throughout. I love the slow burn that the film has to it! All the acting was pretty good with James Badge Dale being an absolutely star throughout being a horror movie character with actual common sense. He is so underrated! This is David Prior's first film and he did a pretty good job writing/directing. The cinematography and music was cool at times, but everything was just ok. I was confused on what was happening at times. The title of the film is what give me low expectations cause it just sounds so stupid, but there is nothing else you could have named it. Overall, The Empty Man may sound ridiculous, but is actually a film that makes you think and I like that!"}, {"id": 40, "text": "The actors and Actresses did a fantastic job creating a new kind of horror movie for Halloween. And I say this film really hit the box office this year. Fox and 20th century studios have made Halloween more exciting."}, {"id": 41, "text": "The prologue is pretty well done with a captivating introduction to our supernatural horror set against a scenic backdrop. However, the film goes steeply downhill from there, descending into an incoherent narrative. Plot points are not well spaced-out leaving tedious interludes and movie goers scratching their heads at an incomprehensible ending. As for the horror factor, our protagonist is plagued by the titular Empty Man but the hobo-looking Empty Man inspires no fear unless you're scared of hobos that is."}, {"id": 42, "text": "I was honestly hesitant to watch this. 2020 has been a rough year and I didn't want to waste my money on a poorly made movie. But my date wanted to check it out, she's a big horror fan, so I finally complied. And I'm so glad I did. It started off pretty clique. But once you get past the first 30 minutes, it begins to lure you in. It slowly unravels from a clique story into a dark, complex story involving a religious cult following this Empty Man. And it's actually a very scary movie! I have never been so shook before, it's one of those flicks that creeps under your skin and makes you grit your teeth and cringe. It's definitely worth the watch. I would recommend it to any horror fan looking for something outside the ordinary, or just a horror movie that's well-performed and well-written"}, {"id": 43, "text": "So without giving away too much it was like having 3 movies in 1. It has a hiking/cabin trip gone wrong. A group of teenagers getting into something they shouldn't. An ex cop uncovering a missing person investigation. 3 different concepts that ended up really meshing well together. All the actors did a great job. It was lacking a bit in scares at times but makes up it for it mystery. The only issue I truly had was the runtime as it goes well over 2 hours with a middle segment that really could have been left out. Otherwise pretty solid film"}, {"id": 44, "text": "I saw The Empty Man, starring James Badge Dale-The Lone Ranger_2013, World War Z; Marin Ireland-The Umbrella Academy_tv, Hell or High Water; Sasha Frolova-Little Women_2019, Red Sparrow and Stephen Root-Barry_tv, The Lone Ranger_2013. This is a supernatural horror movie-from reading the end credits, I discovered that it was made in 2018-that is based on a comic book by Cullen Bunn &amp; Vanesa R. Del Rey and published by Boom Studios. I have never read the books but the story was interesting. It starts in 1995 with some hikers in the Himalayas that have a tragic accident where only one of them survives and then the story jumps to 2018-when the movie was made-and a teenaged girl has gone missing. Sasha is the girl and Marin is her mother that calls on her friend, James-a former police officer-to try and find Sasha. James learns about a game the local teens played, which involved blowing into an empty bottle on a bridge-you know, making the whistling sound-and saying 'The Empty Man' over and over. It's a variation on the Candy Man movie with the bottle blowing thrown in for good measure. After you blow into the bottle and say his name, you will actually hear the Empty Man. Then, you will see him on the second day and on the third day, he finds you and ....well, you don't want him to find you. The investigation leads James to a cultish organization where the local recruitment office is run by Stephen and you also find out what happened to the surviving hiker-from the beginning of the movie. It's rated R for violence, disturbing images, language and sexual content-including nudity-and has a running time of 2 hours &amp; 17 minutes. I would probably buy it on DVD-it would be a good Halloween watch."}, {"id": 45, "text": "The trailer makes the movie seem alright, but the movies plot and storyline is amazing. Its not your average horror movie with a unknown spirit pop up out of knowhere, it really has a deep meaning in life and the spiritual realm.+ ALOT OF PLOT TWISTS!! Highly recommend this movie"}, {"id": 46, "text": "Unfortunately, the need for dark intense films to try to advertise to the all too lucrative teen horror market often misclassifies movies on purpose rather than relying on its actual lure. While it flirts with horror, it's truly more of a adult oriented suspense film with an interesting concept and higher than normal budget and overall scope/look. It's entertaining and goes in directions you don't expect."}, {"id": 47, "text": "James Badge Dale is a solid actor, I usually watch everything he does.. Here's some ideas to those interested to check this movie out.. its about a cult, slow dark horror.. Not much on actions but full of great performances from James Badge Dale.. The storylines could be better though.. Still don't understand why the low ratings, I've seen worse movies with higher ratings.. This could at least get 6.5 - 6.9"}, {"id": 48, "text": "Was a very good scary movie in my opinion. Excellent production values and acting was very good. Was genuinely creeped out at times, and that doesn't happen to me often.The story was not a simple point a-to-b. I understand it was an adaptation from a graphic novel. I would guess they tried to remain as true to the story as possible without sacrificing an enjoyable screen experience, but may have made it a little hard to follow if you aren't paying attention. I never read the novel, didn't know it existed, so I can't say how true it is to the master. But the culmination of the story made sense to me."}, {"id": 49, "text": "The first portion of the movie was riveting in suspense as it builds up to a climactic elimination of its 3 cast members. Then from that moment on, its plot had gone downhill. The first portion of the film would have been a great storyline and should have remained throughout the entire movie. The setting and 4 actors were great. The plot was good until they got into the urban scene. Too bad it woild have been a really good movie."}, {"id": 50, "text": "The Empty Man wasn't what I expected. Keep in mind I went in with neither positive nor negative expectations. I saw the trailer a few days earlier and wasn't all that impressed. On first glance, some will watch the trailer and think, this seems kind of tropey. Although I did find this movie to be one giant cliché, the tropes don't really affect the overall atmosphere of the movie. It's not afraid to deliver intense ideas. Visually, this movie delivers one of my favourite setting for any horror movie; psychological. It's very well shot and other than a few lighting decisions, I don't have much else to say about that aspect of the film.What I do have to say about The Empty Man is that it's kind of a technically mixed bag. I hope I'll be able to check out the graphic novel at some point to see how accurate the movie adaptation is, but for now I'm just going to stick to what's being shown on screen. The rest of this review is spoiler-based.The first 20 minutes of the movie are great. Easily the reason I stayed for the rest of the movie. I did however get up to pee during 40 minutes in when the cops were investigating Amanda's murder. Sasha Frolova who played Amanda was easily the worst performance in the whole movie. The main character James, played by James was easily the best performance in the whole movie. Although his character does make dumb decisions, he makes good decisions too. Now that I'm done explaining that, let me explain why this movie goes down in quality after the first half hour. The main premise is that if the characters find an empty bottle on a bridge and blow into it while thinking about The Empty Man, they have 3 days to live. Side effects may include: hallucinating, a sudden want to convert to Buddhism and some of the most predictable jump scares on planet earth. So our main character get's the idea of going to a bridge, picks up a bottle and blowing on the finish. Brilliant. Then he finds Amanda's friends under the bridge. They all hung themselves for failing the empty man challenge, except for Davara who gets murdered in a steam room later in the day. James turns to the his side and shines a flashlight to read the message; The Empty Man made me do it. On the first night, James hears a sound in his house. On the second night, James gets chased in the middle of the forest by a giant group of people who were previously running around a fire. On the third day, James teaches audience members it's okay to drink and drive before going to kidnap someone. After which James gets possessed by The Empty Man and the movie ends.Conclusion: I don't think this movie neither competent/incompetent. The sound design is cool and all, but was way overused. There were some good performances and some bad performances. The editing is my second favourite thing about the movie next to the cinematography. Although I am not a fan of the soundtrack, the music was still fine and doesn't break the flow of the movie. Where this movie lakes is in story and presentation. There are a lot of great concepts that feel underwhelming when having to hear characters explain how the concept works. Although that only happens once or twice throughout the runtime, it does stick out as one of the highlights. Can't say I recommend The Empty Man, but I will say I was enthused. 5/10."}, {"id": 51, "text": "I have to say that I went into this movie not knowing it even existed until today went I went to see it!!! In the covid ravaged moviegoing experience there is almost nothing new to see for ys that want to go see movies in theaters. I saw The Empty Man was playing and ihad never heard or seen a trailer. I now have found that this movie is based on a graphic novel series. I watched the trailer on this very app and decuded to give it a chance. It looked like a decent horror-thriller. It is actually a goid thing sometimes not to have expectations in seeing a movie for the first time.I have to say that even though i can't say i loved it The Emplty Man is a well done supernatural suspense movie. It has no big stars and I'm sure not a huge budget but it is a very effective, well made movie. The biggest problems i have with it is that it suffers from being 15-20 minutes too long, and also falls too much into the twisty plot and ending trap that so many movies dintoo.much these days but it is a pleassnt surprise.It starts with a very tense and well done 20 minute intro that sets up the origin story of The Empty Man. We don't even see the title card until after the 20 minute intro scenes. We meet 2 men and 2 women hiking in the mountains in Asia. One of them falls in a crack. We see a skeleton who is presumably The Emplty Man and when his friend comes to get the hiker, he is not speaking and suddenly goes into shock. The group takes him to a house to try to save him. Eventuañly one of the woman gets a vision of an entity. It has her under some kind of spell and kills the other 2 hikers and herself. After credits the main plot starts. We meet an ex policeman played by James Badge Dale that begins to investigate the disappearance of a friend's daughter. There are soon some disappearances if the teenager's group of friends and ñearns about the urban legend of the Empty Man. He begins to investigate a group that seems to be a new age religious cult that us based the worship of the entity. The appearance on The Empty Man was in 3 three days after someone blows in an empty bottle on a bridge. First you hear him, then you see him, then he finds you. Yes, uts on the poster but that is the way the film presents it. The movie has the benefit of a very effective, eerie but powerful score that fits very well with the atmosphere which is cold and dark. I won't go into more plot details but the movie has some very good performances. It isn't necessarily scary but it does have some tension. And tgere are some twists and psychological elements in the story that make it worthwile. The fact that I had no real knowledge or expectations for the movie inthink enhanced Tommy enjoyment of the movie.Grade: B-"}, {"id": 52, "text": "I kept on watching because I'm not a quitter. But I have to warn others that there are no answers throughout or at the ending. Poorly written and executed."}, {"id": 53, "text": "I would have liked a more tangible or concrete ending, but I enjoyed the twists and turns up to that.Really disappointed they glamorized smoking though, especially with teens. I thought we were past that?"}, {"id": 54, "text": "Honestly 2020 will go down as the worst year for film in history. I assume that all the good films have been kept back till next year when the pandemic is over. However this movie came out and boy it was about as bad as one would expect for the year we are in. Yes there are a few good visual moment and ideas, but guess what? They've been ripped off so many other movies. The obvious one, Candyman (1992) then we got some Cell (2016). The films feels like someone chopped up 3 different movies and then randomly stuck them all together to form a frankenstein edit. Im not talking grindhouse style, im talking leftover christmas dinner, the dregs of a late night takeaway curry and the contents of your ashtray poured into a blender for breakfast mash-up. Ie it Left a really bad taste in my mouth, so fed up of watching rubbish this year. Sorry to the people who made this film, i can see you tried, better luck next time."}, {"id": 55, "text": "Its in the category of those movies made to impress teens, like slender man is. empty is the word for it. 2 couples travel to Asia were one of em falls into a cave and when the others try to rescue him hes found in lotus position and wispering in front of a weird shaped skeleton. after, strange thing happen and they die. back in the usa a man is looking for a girl and the mumble of that empty man is already making...no sense. you can skip this one."}, {"id": 56, "text": "I went into this movie with low expectations. The first 20 minutes of the film pulled me in. In 1995, a group of hikers in the Himalaya mountains of Bhutan stumble upon an entity and 3 days later tragedy ensues. Only one hiker survives. Cut to 2018, an ex-cop investigates a missing teenager who may have ties to a death cult.SPOILERS: At the end of the movie , you find out that the empty man entity has possessed the comatose hiker and has been transmitting his messages like a virus, as he is being moved from one hospital to another over the years. His medical care being funded by the growing cult. The missing teen and cult had been manipulating the ex-cop to be the new vessel for the Empty Man. The Empty Man entity possesses the ex-cop in the end.Why does the movie overstay its welcome? The big issue for me was pacing. The film runs over 2 hours long. With some judicious editing, they could have come to the conclusion a lot sooner. The second act during the investigation dragged with pretentious talk about thought-form, philosophy, and power of the mind. The jump scares didn't work for me. The motivations of the entity are vague and not really explained.Overall, the movie had a few creepy moments and imagery. For me, it leans more on the mystery side, than horror. But at least, it's a cut above the typical teen horror movies."}, {"id": 57, "text": "The director wanted to make a few movies so threw all his ideas into one, and it's a complete mess. The first 20 minutes are interesting, mountain horror, but then that's it and let's start another movie. A detective who dun it which lasts about an hour and runs out of gas. Let's add some Blair Witch forest scenes, cause they are popular now. Ok, lets finish with a cult horror and try to wrap this up. David Prior wrote this and then ventured into his first directing job. It seems as though there are a lot of new ventures approved with little to no experience and the entire industry is just putting out filler. This feels as though it needed to be proofread before getting the green light. My only guess is that the executive only read the first 20 pages of the script before signing off.Ugh."}, {"id": 58, "text": "Lousy. this movie doesn't even know what it is. so much effort went into a story that appears to be made up as it goes along with no point to anything that happened at the start. this movie is trying to be too many things at once that it ends up being a useless pile of junk. it is like watching 3 to 5 different storylines poorly put together as if on purpose. the laziest writing and plot i've ever seen. it is flat out stupid. this is one of the most insulting and pointless movies i've ever seen."}, {"id": 59, "text": "A very long movie. The story at the beginning was good, but from the middle it became a boring drama and philosophical talk, and it turned from horror and excitement to a film of philosophy and myths. Unfortunately I wasted my time watching it."}, {"id": 60, "text": "S.............L..............O.................WAlmost insulting how the story unravels. Was looking forward to this movie. Great beginning to movie. Then hint of a Cosmic influence. Eventually the end credits."}, {"id": 61, "text": "It's easy to see why people would dislike this. It really comes down to taste, not anything wrong with the movie.I haven't read the graphic novels, so I'm only going to base anything I say off the movie. And I really found this to be a good blend of real myths, real philosophies, real cults, and horror tropes.Yes, it might come across as borrowing from anything and everything, but that actually fits one of the philosophies discussed by the cult: everything is connected and is the same.I enjoyed the score; it underpinned how scenes should be interpreted without TELLING you how to feel like many tense movies do. The lighting and camerawork helped play out the story, and the set design gave a grimeyness that made the evil seem more ancient. Good dialogue and good acting. Definitely a slow burn that takes you were you need to be.A little bit Call of Cthulhu, a little bit Wicker Man, a little Vanilla Sky. Just a little bit of a lot of somewhat cerebral horrors. Not a fast-paced jumpscare teen slasher flick by any means."}, {"id": 62, "text": "I'll start by prefacing that I haven't read the graphic novels yet; also don't judge the film on the trailer. You will regret it. I learned about this movie a day before it released by accident. I'm a horror aficionado and this movie was so below the radar I don't believe anybody knew about it; especially about it releasing in theaters. The story is about an ex-cop investigating a missing persons. The story evolves from there into a nightmare of sorts. The acting was good; though James Badge Dale as James stole the entire film through his incredible performance. The jump scares weren't numbered in the likes of Paranormal Activity or Sinister and etc, but I also believe jump scares are so cliché now. The pacing was very well done; granted the movie is almost 2.5 hours long. The ambient audio was spectacular and honestly one of the best sound designs for a horror film I've ever heard which I know is a tall statement. The cinematography was extremely well shot. If you can imagine a combination of Sinister, Hereditary and It Follows rolled into one, but executed wonderfully then you will have an inkling of what this film is about. I highly encourage you'll to watch it; given 2020 has been so thin on legitimate horror/supernatural thriller films this is a gem in the darkness."}, {"id": 63, "text": "I was hesitant about this movie, at the time it was a 7 out of 10 (89 reviews) and I figured maybe it was secretly an awesome movie and the trailer ruined its chances... Nope. I got tired of waiting and just went to see it so here's my thoughts. This was intended for the type of movie goer that likes a film that tries to make you think... It's not bad, but it's not good either. The opening to the movie is fantastic, most people complain about how long it is and who cares. Then, when the movie really starts going it's kind of cool, but it misses the mark for all the ideas and mystery it creates only for it it feel like it was created just to extend the movies run time. The first hour, is alright. It felt like I was watching a true crime drama, so it wasn't too bad. There's a scene in a sauna, totally gnarly and then you don't get anymore after that. It made me curious to see where it was all leading up to and eventually it just kind of falls apart near the end. The movie felt like it was trying to be the next midsommar or Hereditary with the big reveal at the end and I think there was a chance to make it so, but it was done so awfully in terms of what they didn't do. They needed more instances to call back to make it everything have a bigger impact, but the two small scenes you get a call back to is just disappointing. People say the movie doesn't make sense, it makes sense. Without spoilers, the problem is the main character has a realization and suddenly the last 2 hours never mattered. This movie isn't worth your time, It's just bland and you're better off saving your money and watching something else."}, {"id": 64, "text": "Unfortunately for this film, the trailer appears to promise a standard, formulaic horror film with teenagers doing stupid, occult things and dying horribly for our entertainment. People who show up to watch it, expecting that kind of movie, will be very disappointed and likely confused and bored. It is more accurate to say this is a Gothic-Lovecraftian psychological thriller/mystery. It's not scary, more atmospheric with creepy moments, and it would actually fall solidly under the umbrella of science fiction, instead of horror. Damaged ex-cop stumbles upon an ancient, Scientology-esque cult attempting to 'manifest' an inter-dimensional being on this plane of existence; mind-effery on the nature and meaning of reality ensues is my attempt at a synopsis. You will enjoy this film if you like: -Lovecraft anything -Mind twisty things, like wondering if reality is real -Reading 'dark' and 'gritty' graphic novels with complicated plots (I believe it's actually based on one) -Noir science fiction You will not like it if you just wanted a horror film. The film is largely well done for what it is, but unfortunately the people who will enjoy it and the people who will go see it are unlikely to be the same people due to its advertising."}, {"id": 65, "text": "Films like this is the reason why I miss 20th Century Fox. Sure, they have had their handful of duds in the past, but no company has ever truly been there to give great films a chance like them, and The Empty Man shows that even up till its fatal end (by the hand of Disney) it still accomplished just that. I LOVED this film. Granted, you may see familiar elements in this film in other horror flicks, but it plays on those tropes in such an interesting and unexpected way, that I couldn't help but praise it for its originality. This isn't like any horror film before, I assure you, nor is it the film the trailers led you to believe it was. What this film is, is not a stereotypical, cliche filled nightmare that we see all too often today, but a brilliant psychological horror with flair to spare. It contains some great performances, some excellent writing, and some of the best cinematography I have seen all year. James Badge Dale proves to be a fun and charismatic lead to follow, and Joel Courtney, Marin Ireland, and Stephen Root provide stunning supporting performances as well. Surprisingly there isn't much music to really comment on, but needless to say the atmosphere is chilling, and the sound used throughout is honestly terrific. I usually don't care for things in film like sound, but something about the way the film looked, acted, and sounded just makes it feel so incredibly grounded that I couldn't help but awe at every moment it was on screen. It can be a bit of a slow burn, but the film always remains interesting, and provides a rather compelling and clever mystery to follow. It may not be what you expected and it may not be for everyone, but The Empty Man is easily one of the best horror flicks I have seen in some time, as well as one of the best films in general of the year. My Rating: 10/10"}, {"id": 66, "text": "This movie is just insane all I can say be open minded and patient. The movie is slow paced in a good way at the beginning then picks up intensity with wtf moments until the opening title for the movie. Then your back to the pace where it started. Leaving you at a wtf just happened state while wondering if the guy was dreaming or hallucinating. Then it starts with a new character with a vivid background. Then when the story starts to get going again you start to understand what's kind of going on or so you think lol. Then little by little the intensity picks up then once it's picked up there's parts were your heart is really going to start beating. Then your starting to question reality with the creepy factor at a all time high the forest scene will get your heart going trust me. Then once movie is starting end you find out what happened to the guy at the beginning while figuring out the purpose of the new guy at the end of the opening title of the movie. Like I said the story requires you to be opened minded and patient for you to fully understand and enjoy the movie. It's very intense, creepy, supernatural, heart racing movie. Perfect for a Halloween movie date night or your watching it by yourself.👻👻👻👻"}, {"id": 67, "text": "This movie caught me completely by surprise just before Halloween...in a good way. Movie Trailers should be banned says the man with the Movie Trailer Voice. This trailer would have you believe you're about to watch another empty headed teen slasher flick...WRONG! Instead it's The Empty Man and it's full of surprises. The opening minutes before the titles roll are worth the price of admission alone. It's like a short horror film set in a Cabin in the snow and nothing good ever comes of Cabins. David Prior does a masterful job of directing a suspense loaded feature film that will leave you disturbed by it long after you walk/run out of the cinema. James Badge Dale plays the lead as James, a worn out former cop who's trying to fit together the pieces of this puzzle to find a missing girl. Get Out' and News Radio Stephen Root has a minor role as the head of a secretive group. There are no small roles in Hollywood. Congrats to an outstanding teen cast and Umbrella Academy graduate, Marin Ireland, who lift this well above your typical teen horror movie. The Empty Man is based on a comic series published by Boom! in the words of Flight of the Concord, It's very trippy, David Bowie. Be afraid, be very, very afraid!"}, {"id": 68, "text": "This comes from the host of Reel Tunez.. The Radio Show All About the Movies.First and foremost... hideously terrible movie! I'll instantly tell you this now ranks up there with Hot To Trot 1988 (Bobcat Goldthwait) as one of the WORST movies I've EVER seen! On a 1 to 10 scale (10 being best), I'd give this a 1 star (not even a 1.5). The plot was nearly non-existent. The first 20 minutes (prior to the actual open) was the set-up, but it was as necessary as the concession stand selling prosthetic middle fingers. This was meant to be a horror/drama movie, but there were NO characters that were developed to where you cared what happened to ANY of them.Don't waste you time. If they offer you free admission, free popcorn, and a free soda to come see this movie, take a PASS on THAT and go volunteer cleaning a bathroom in a night club at closing time (there's a good chance, you'll enjoy THAT more!). It really WAS THAT bad!I saw this movie with my 19 year old daughter, and the consensus on the drive home was that it actually was the WORST movie we've EVER seen together!I sure prefer to NOT give such a heinous review because so many people put a LOT of work into a movie's production, but this movie is a GREAT reason for theaters to offer refunds to movies that completely and totally STINK!!"}, {"id": 69, "text": "Decent. A dark, mystery thriller which follows an ex-cops investigation into a friend's missing daughter. The plot, which stays suspenseful and intriguing for the most part, is complex and philosophical, leaning on nihilism and Friedrich Nietzche. I'd say the film is more of a mystery film than a horror film, but that's ok and it certainly has horror elements. When it is scary, it doesn't rely as much on jumpscares which is always a plus.I'm unsure of how I feel about the ending, but I had a good time with the buildup. It definitely could have had some of its 137 minute runtime trimmed down though. It almost feels like it was put out before being fully complete, which is definitely a possibility considering it's discrete release. The feeling could just be coming from its perplexing nature though. James Badge Dale gave a good performance. The cinematography and sound design were well done. Overall, while not great, it was something out of the ordinary and I found it to be a fairly enjoyable and philosophical film. It was nice to get out of the house and see one of the few films in theaters after being starved of them for months.5.8/10"}, {"id": 70, "text": "The Empty Man is a horror movie with an extensive length justified by some surprising genre, mood and plot shifts.The opening sequence feels like an atmospheric horror movie set in the ice and snow. It shows how a group of four friends accidentally discovers a cave with a strange extraterrestrial skeleton. One of the two men gets possessed by the mysterious skeleton and starts to behave awkwardly. He whispers words in an unknown language into his friends' ears, leaves the cabin to sit in the ice and snow and slowly drives everyone around him anxious, confused and unstable.The film then shifts to the tale of an urban legend as a group of teenagers in Saint Louis attempt to contact a supernatural entity. These teenagers soon see things only they can see, get followed by the menacing entity they have called and ultimately have to fight for survival.The last part of the movie shows a former cop who has lost his wife and son in a car accident while sleeping with another woman. He investigates the sudden disappearance of his lover's daughter. He soon finds out that she has joined a mysterious cult. As his investigation progresses, the desperate man faces mysteries and dangers that might be much more personal and intense than he would have initially anticipated.All three parts of the movie convince with spooky atmosphere, very good acting performances and several unexpected plot twists leading to a stunning finale. The major downside of the film is that the three parts are so different that they don't really fit together and feel more like an anthology. The scriptwriters could have created three entirely different movies and it would have been particularly interesting to explore the opening sequence in greater detail.Some people have criticized the movie for its lack of coherence and its extensive length but the creative script and addicting atmosphere compensate for those flaws. This movie is one of the better contemporary horror films because it's neither predictable nor moralizing. Many horror movies these days either rehash old ideas or try to teach a lesson. The Empty Man is like a horror movie should really be because it's creepy, mysterious and surprising. If you like horror films with conventional styles but some creative twists, then give the underrated and overlooked The Empty Man a fair chance."}, {"id": 71, "text": "We were engrossed from start to end. A skillfully constructed creepy thriller with original, unpredictable storyline. Never dull, fast paced, and lacking the silly tricks that less intelligent horror films tend to overuse. My companion is very hard to please and is almost never 'scared' in horror movies, but he said this was 'really, really creepy and very well done'. I was on the edge of my seat throughout. The ending was very well done. Acting was superb. Cinematography is also stunning. There are some truly scary scenes that have no gore nor violence, yet generate tremendous fear, perhaps by triggering some primeval survival instincts. Seeing masses of people behaving in inexplicable and potentially dangerous ways will do that to you. I don't understand the negative reviews, and glad I paid no attention to them. If you do not like horror or creepy films, don't go to see this movie. If you like mindless slasher films, don't go to see this movie. If you like simple storylines and simple scripts with pretty teen victims, don't go to see this movie. But, if you like intelligent, original, thought provoking films that play with space and time, and with universally identifiable fears and horror, then you are likely to find this movie absolutely fascinating."}, {"id": 72, "text": "Ok, so the negative reviewers have you seen the really bad movies that have been coming out lately? Seriously? A rating less than 5 is just ignorant, especially rating it because it was way over your head, or I just wanted to be scaredIt certainly doesn't really fit with the Crime, Drama, Horror genre very well. More like a Supernatural Thriller.If the low rate reviews actually watched the entire movie or paid attention, the first 20+ minutes will make sense at some point.It didn't feel like it was over 2 hours, which is funny because I felt some scenes were rushed.I don't think Sasha Frolova who play Amanda Quail was a good fit at all. She's a super decent actress, but it was the most annoying thing about the movie actually. Secondly, a few things actually didn't seem to fit, but perhaps I missed something?Production quality was well done, not over the top. Wasn't scary but certainly creepy.I'm actually interested in getting the graphic novel series now."}, {"id": 73, "text": "When I saw that 'The Empty Man' was going to be 137 minutes long it had a little reluctant to go to it. The reason is that if a horror movie isn't good then even a 90 minute runtime can be an absolute drag. It's a real gamble for a film in that genre to be anywhere near two hours, let alone well past it. I usually try to avoid trailers for movies before I see them but on this occasion I did happen to catch it. It didn't fill me with confidence. Luckily the trailer is actually a little misleading, and the film actually has quite a different feel to it. Even though I wouldn't say I loved this movie by any means, it did have enough going on to keep it watchable for that runtime - just.The first thing I have to say is that the film is beautifully shot. There were a number of expertly crafted shots throughout the film, but one tracking shot from a map that turns into a forest and then finds its way down to a car driving through it was truly exquisite. I love that the artistic touches Ari Aster fills his films with are starting to inspire other directors.The second thing that occurs to me is that isn't really a horror movie, or at least not solely a horror movie. Apparently it is based on a comic series which are more like dark detective stories. That's kind of the vibe I got here and why I think this was able to survive a 137 minute push. It isn't just a case of passing from character to character and watching a new and inventive way for them to die. In fact the film is very rarely scary. I say that more in the sense that it doesn't actually try to be scary all that often, however when it does try it rarely hits the mark either sadly.If you're a fan of ASMR then you are likely going to have a good time with this film. There is a lot of it in the film and it is a pleasure to listen to (although it can be a risk to have you dozing off). I have a very middling opinion on this film. I neither hated it nor loved it. I wouldn't recommend people go out of their way to see it, but if they were going to see it I certainly wouldn't dissuade them either. Don't be too put off by the trailer is all I would say. It is not an accurate representation of the film."}, {"id": 74, "text": "The Empty Man is such a weird release. I guess it was made by Fox and then acquired by Disney in the merger. Obviously not being disney-ish at all they had no idea what to do with it. So it was released out of nowhere with no hype and hardly any marketing. It's based on some random comic/graphic novel I've never heard of...ok, I'm not big into comics so that doesn't say much, however I searched on the net and there were only 3 youtube videos about the comic and each had about 30 views so apparently no one else has heard of it either. I have no idea why this seemingly random IP (horror IP no less) was chosen to be made into a movie. Not only that, but a movie where they actually tried to make a good film. While this film (and how they cut the trailer) has a teen horror/creepypasta vibe, in execution it has more in common with The Void, Apostle, or The Endless in that it explores esoteric concepts, cosmic horror, and is deeply atmospheric.As others have pointed out, this movie has three distinct sections. The first one takes place in Bhutan and is basically Group of hikers encounter weird stuff and get stranded. While this was probably a bit long for an opening section, I enjoyed it a lot and it does eventually tie in to the later portion of the film in a significant way. It is very well shot and suitably atmospheric. One of the reasons I decided to check this movie out is because Lustmord worked on the soundtrack and right from the start you can tell. The sound design throughout is excellent and underscores the epic intentions of the film.The next part is more of a teen horror/creepypasta and focuses around an ex-cop trying to figure out what's going on with local teenagers disappearing. It's very similar to Slenderman with kids getting into this viral meme of The Empty Man causing them to act weird and die for unknown reasons. That's a thoroughly well-trodden premise, but they do a fairly good job with it in this movie. While some parts are a little slow, overall there is enough constant buildup &amp; explanation to keep things interesting and to continually increase the stakes of the movie to keep the viewer interested. As the movie goes on, the cop finds out about the Pontifex cult and from there it veers away from the teen horror and focuses on the cult &amp; cosmic horror. The cult, seemingly extremely influenced by Scientology, is executed very well and as the main character explores the cult there are a lot of great creepy scenes. The actual message of the cult is pretty poorly done though and just sounds like a more jibberishy version of scientology with some buddhist stuff sprinkled in which is hard to take seriously even with the suspension of disbelief. While there is good stuff all the way through to the end, the movie does start to go downhill a bit because of this shift in the third act. Whenever the bad guys are shown to have a large scale operation with seemingly limitless personnel and resources it tends to introduce too many questions and implausibilities. For one, the cult has tons of members who are all actively not killing themselves, meaning the teens actions earlier now make no sense and thus creating a significant disconnect in the plot. Additionally, I'm a huge fan of cosmic horror and mysticism so I enjoyed that the movie focused on that quite a bit, but I can see how this heavy focus on esoterica might lose people. That said, it moves along well enough until the ending.I thought the idea used in the ending was excellent, however the way it's executed is...confusing. It sounds cool at first, but when you start to analyze it things don't add up; it makes the viewer question literally everything in the second and third acts and introduces an endless amount of questions and potential plot-holes, much to it's detriment. They should have cut a bit from the middle of the movie and given more time to better explain how the revelation the ending provides makes sense in the greater context of the film.Overall, this is a surprisingly competent effort to deliver an actual horror movie with atmosphere and substance. It's very long but it kept me engaged and I'd say only 10-15 minutes should have been cut, or at least redistributed between parts. While it has it's flaws and doesn't reach the heights of the few substantive recent horror films like the aforementioned the Void, it's worlds better all the cookie-cutter stuff that plagues the genre. Definitely recommended, though don't expect a game-changer."}, {"id": 75, "text": "Not a bad film by any means, but certainly not a good one either. The Empty Man clunks along like a car with square wheels, meandering through most of its story with little direction or energy.I'm a fan of slow-burn horror, but you need to have interesting characters for that to work, and sadly Empty Man's characters are all largely underdeveloped and forgettable. I think the film also suffers from some tonal issues, it was rather strange to watch a naked high-school girl get stabbed in the face with scissors. It was a scene that felt completely at odds with the rest of the film.I was intrigued by the story and the concept of tulpas and the cult, but the film's languid pacing kind of kills the interest. David Prior needs to learn how to kill his darlings, the film easily could have lost 20-30 minutes and been a tighter film. Allegedly the director was a nightmare to work with on this production, so who knows what was happening in the editing room."}, {"id": 76, "text": "The movie is complex and reminded me of Tenet but this one has a better concept as in it really challenges your understanding of life and it keeps you wondering about many things after you leave the cinema, while Tenet was just pretentious cinematography trying to be smart.Now concerning this movie, acting was great, especially the lead, he did a formidable job. Cinematography was lovely and the movie in general has an unsettling setting that really draws you in. The movie has some decent jump-scares as well.This movie explores cult, many philosophical beliefs and meaning of life, to a degree that it might be a bit too much for some viewers especially that it is 2 hours long. The 3rd act of the movie was a bit of a mess but it is still watchable. I rated this movie 6 just because of the complexity of the storyline which I found a bit confusing and boring at times. I like movies that entertain with a touch of mystery that keeps you wondering .. here it leaves you with so many thoughts I needed to do research to explore all the ideas presented in this movie to the audience."}], "reviews_amount": 77}