{"name": "Mortal", "titleId": "tt05715066", "reviews": [{"id": 0, "text": "I am not surprised to see all these negative reviews. The World is really deteriorating if garbage like Money Heist gets 8 stars and movies like Mortal get below 6. The Audience by far is getting tasteless and is being impressed by Over Dramatic, cheap and instant gratifying special effect filled SH** creations.This movie is not perfect. But it is such a beautiful attempt to tell a wonderful tale. The cinematography is top notch. The locations are breath taking. The story, although slow and imperfect is satisfying.Yes it isn't a 9 Star movie but definitely a 7.5 star"}, {"id": 1, "text": "This movie is very different from the usual high rated ones. Actually a story about something we heard or have seen before, transformed into the present. Not big actions but very good scenes,beautiful places and super camera angles. One to watch more than ones."}, {"id": 2, "text": "This film is much better than the current IMDB rating suggests.If it had a Hollywood blockbuster budget, I imagine, this film would be imminence, but, considering the budget will of been a fraction of that, the special effects hold up &amp; the film is still thoroughly enjoyable.Nat Wolff puts in a solid performance, as does the Norwegian Jennifer Lawrence, in fact, all the performances are solid.The writing is good &amp; the story unfolds in an interesting manner."}, {"id": 3, "text": "The birth of modern thor, fantastic! Predictable at times, but they really make you care about the characters, I thought it was great !"}, {"id": 4, "text": "Just skip the bad reviews and go watch this movie these people have no taste and don't know what great movie is . Loved this movie from start to end and left me wanting more its so good ."}, {"id": 5, "text": "I have to say they did more with less in this movie than quite a number of big budget films I could name! It's mostly story and scenery which was done incredibly well. It definitely could be predictable at times but overall was very nicely done. As usual america is painted in the unflattering light we project. I'm glad Thor took some vengeance but I won't say how or why! Highly recommended for sci-fi/fantasy lovers and movie watchers that prefer a bit more story over crazy amounts of CGI. Damon"}, {"id": 6, "text": "Bad reviews are a sign that the review system is flawed. I did not know what this movie was about but Wow I'm floored.It really did shine light on how my country the US is actually responsible for how the World sees Us. It is a duality similar to what the main character will experience after these events.I'm telling everyone about this movie"}, {"id": 7, "text": "The movie still needs work but i think netflix has a gem right here if they decide to take it. many superhero movie fans would love to see this through me included but with better dialogue and less cringe moments."}, {"id": 8, "text": "This movie has more intensity and storyline than some of the bigger movies of the superpowers genre. It takes you on a deep and intriguing journey, with decent acting and great scenery. Well produced, I found it more believable, although still touching on myths and legends but as ancient, rather than modern day. Building and culminating in a riveting and exciting ending that leaves you wanting more."}, {"id": 9, "text": "The low ratings are probably from those that expect an action filled superhero movie. This is a bit of a slow burner, but it's different and quite refreshing. Provided you're aware of that, then you'll likely enjoy it."}, {"id": 10, "text": "So raw and realistic experience! Love this movie. You will see something that is easy to believe it is a reality. Without any holywood posh. Recommend!"}, {"id": 11, "text": "I quite enjoyed this movie even though it was kind of slow going in the first half or so of the movie. I really like the darker take on the Norse mythology and I really hope there's another or more movies to continue this story.On the off side this felt like the first chapter in a book that's meant to be the first in a long series of books. There's just so much more to explore and so much more left unanswered which I hope is indication that there will be a sequel.The movie reminds a little of Ragnarok the Norwegian tv show on Netflix which I also quite enjoyed.I really hope they make another to follow up on this!"}, {"id": 12, "text": "I enjoyed this very much I did not want it to end. Critics can eat a bag of... Sitting on their ivory towers. Can't we just enjoy a movie for what it is. Entertainment.."}, {"id": 13, "text": "Absolutely wonderful. Didn't know what to expect and was blown away. Forget Marvel's movie Thor for a bit. This was really reminiscent of the early Marvel Thor comics I grew up loving and reading. It had the same feel. Loved it."}, {"id": 14, "text": "Wow - how has this movie scored less than 6? I would expect an average of maybe 7.5 if I looked at IMDB after watching it.Honestly, probably my favourite movie of 2020.People saying it was slow or poorly done? I was hooked the entire time and it felt fast paced to me. It was honest, simple, engaging, very rarely self-indulgent like many movies today. A journey of discovery, brilliantly portrayed.If there isn't a sequel planned, I would be bitterly disappointed."}, {"id": 15, "text": "Great movie.A nice change from the current lineup of superpower films."}, {"id": 16, "text": "Absolutely loved it! Hopefully they make a part 2!"}, {"id": 17, "text": "First of all the english title is not even close to Torden is original Norwegian title and takes away a lot of appeal and forbearing from this great movie.I love this movies' story and cant help to read lot into it. Is it about a return to our old Heritage? The poisonous and devastating consequences of the diverse anti-protagonists? Let's find out... First the negative... The casting of Nat Wolff... He did a good job.. his acting skills are not the reason I dislike him as the main character , he represents a lineage that is hardly visible , despite his wandering of to america and returning to the old soil and whatever might have happened there. Most people will not be bothered by this but I have spent many hours reading about my heritage.and feel a closer physical match would have been appropriate. The casting of his nemesis which initially bothered me (before realizing her role) ticks all the boxes in the end. Most annoying of all this is the american of Norwegian descent -protagonist forces 99pct of this movie to be in English... Norwegian would have been so much more immersive and appropriate. What did I like .. the underdog turning out to be a hero. The wandering off and returning to his roots to reclaim glories of a past long forgotten , Remembering brings back a power long left slumbering. I love the research put in this... .Járngreipr , Mjollnir and megingjörð are seldom seen depicted so realistic ( despite being never noticed by casual or wandered viewers . .)The movie is not perfect but the landscapes are eye-candy..The cgi is kept to a subtle and realistic level , the supporting characters are kept relevant enough to advance the story and keep a flimsy subplot contributing enough. André Øvredal loves his Norwegian landscapes too I am sure , as was visible in the only other film of his I saw.. Trolljegern. ."}, {"id": 18, "text": "I like this Directors way of story telling, he does a very good job of this Norse tale. I enjoyed watching it I hope you do as well. USA CA."}, {"id": 19, "text": "All I will say is that there better be a sequel. Norse Mythology in the modern age. Its a real travesty the rating is so low. 5.8??? Really? I really thought this was pretty darn good. I would have rated it a 9 if the story was a bit more complete at the end."}, {"id": 20, "text": "Had no idea what movie was about, but I was hooked. Beautiful camera work and great story. I would have gave it a 10 if the ending had more destruction."}, {"id": 21, "text": "I enjoyed watching this movie very much! Visual side was amazing! Beautiful sceneries, the special effects... Very nicely done! It was so much better than I was expecting! I would have enjoyed deeper journey into the main characters relationship. Also now I am wondering what happens next. They left us with many unanswered questions. I wouldn't mind a second movie. Don't let poor reviews discourage you. Give it a try. I did and I wasn't disappointed at all. Best movie I've seen in a while."}, {"id": 22, "text": "I hope there's a sequel to this as it seems like it's entirely built for that, and really climaxes at the end. Overall however, I enjoyed it considering it's not a high budget movie from anyone you've heard of. Sure, some of the acting is okay, and story takes a bit to ramp up, it the plot is something new. I appreciate what they've done, and believe that with a sequel, this would create a following here."}, {"id": 23, "text": "When you'll watch the movie then you will be clear who all have given it a low rating and why. It's a good movie rather a sci-fi drama but the culprits remain culprits as in the real world and in the movie."}, {"id": 24, "text": "I liked it i hope this is a Movie universe launch like marvel has a movie universe as an American i can totally see America doing something like this but not on the religious ground but to hold to to the current power dynamic in the world you wouldn't really be the top world leader anymore when a God is reborn or his kin comes to power that can control elements a power far greater than any Nuke. so i can see America totally trying to kill him if they can't use him as a weapon there is no reason to down vote this it's not hate of America it's realistic try watching none American news sources"}, {"id": 25, "text": "Nat Wollf is a great actor. The Thor premise is done very well. Build up and execution is perfect. I had vibes of Akira and Chronicle throughtout watching this film.Entertaining and unique."}, {"id": 26, "text": "Initially a bit slow and the miscast of a Indian woman as a American government official. Though no huge budget the special effects were still effective and well done. After slow start it really captivated me till the end and hope they will make a Torden 2. A fresh and nice change from all the Hollywood big budget cinematic this and that crap."}, {"id": 27, "text": "Loved it hope there's another one coming. The cinematic photography is beautiful. I'm glad it wasn't just like any other DC movie or Marvel"}, {"id": 28, "text": "Yes, this not a perfect movie, yet is something different. Yes it is slow paced superhero movie, but we stand with characters and believe their choices. Yes it's predictable, but it's also got more-less real characters reaction to the situation, nevertheless bad or good characters. Yes it's quite modest, but it has it's emotional impact, and real lifew settings.And finally why the Thor had 7,0 imdb score and this one has 5,8? It should be quite opposite.For all the movie crew, keep up the good work, and don't be upset about moderate opinions."}, {"id": 29, "text": "If you think stories, especially Norsk Saga should be made the Hollywood way, the one size fits all, no nuance, 90% special effects 10% acting way, as many obviously do, you will understand the much to low imdb rating. If you are interested in the more intense, genuine story telling and imaginable way the Scandinavian Legends can be told in a true and modern fashion you will love this movie as I did. The special effects are great and very functional for a much lower budget film. The acting good enough. But the story; the what if... really makes you think. 8 1/2 for and tusend takk for the whole crew!"}, {"id": 30, "text": "This movie had potential. However the acting doesn't give credit to the story. The female lead is not convincing. She talks like a theatre actor. Staccato. And, those small mistakes througout the film; They stand talking in front of her car, the sky is relatively clear and the ground is dry. Then seconds later they take off in the car, the clouds are low and the ground is wet after rain. A couple of these mistakes, at least. I guess they didn't have the time or money to do it properly, but it's annoying."}, {"id": 31, "text": "Never written a review on a movie, this one deserves it. Forget every other origin film this one wins by far. Realistic, raw and takes it to a whole other level. I really enjoyed the way it built up to the end, making the pace of the overall film, a little slow at times, worth watching. If you enjoy films that are unique and don't stick to the same ol style of every other mainstream movie you'll love this one. A must see."}, {"id": 32, "text": "It starts a bit slow and you might be totally confused but that's alright, so is Eric. As the story progresses, you and Eric go on the journey together. Ever scene slowly builds until the final climax."}, {"id": 33, "text": "Slow moving but builds up. About a legend. It's pretty darn good"}, {"id": 34, "text": "Don't worry about the reviews being too low or too high. This is a decent movie, a little slower at times, but its not meant to be a non-stop action flick. Its more of a story. I wish my version had subtitles as there is a decent amount of Norwegian in the movie."}, {"id": 35, "text": "If, like me, you're tired of the modern superhero Hollywood nonsense then you'll be in for a great time, this movie was unexpectedly great. Great acting, great camera work, interesting characters and original plot. Music fits perfectly and the story was groping from the get go.Only didn't get a 10 because it could have had better cinematography if the budget allowed.I might also be generous with my rating as this year has been terrible for cinema, so this one stands out."}, {"id": 36, "text": "Low budget but really great.Can't wait for the second one"}, {"id": 37, "text": "Really enjoyed this, great locations and good acting all round which helped you feel for the main characters."}, {"id": 38, "text": "Well worth watching and I look forward to the next film"}, {"id": 39, "text": "They did alot with this movie. It is slow to start but it does get extremely better. Its not action packed but it does keep you intrigued."}, {"id": 40, "text": "Seems slow but its just a well paced build up. Everything about this movie is well done, great original story, well acted and directed. But mostly it's the amazing score and cinematography. The scenery is fantastic and the score at the end adds everything to the finale. Sequel???????"}, {"id": 41, "text": "No matter how you look at this film, it is entertaining. Being Norwegian I watch it as that - Norwegian. What I saw was an honorable effort to make a countable film. It did not reach all the way. To me, it failed at all the references to christianity, and the prolonged slow pace. Also - it stressed the religious part too much. But I did appreciate the mountains, fjords and waterfalls. So - you made Trolls, now this - not so good - good luck with your next film."}, {"id": 42, "text": "Much better than IMDB score suggests and definitely satisfies expectations from the trailer. A real life interpretation of Thor. I have skipped a few times while he was going through stagnent drama and mood. I would give 6.5 for the movie quality (story is nice, script writing is a bit weak), but 8 star goes for the original take on superhero genre. I hope they make a 2nd movie with bigger budget. And I hope Nat Wolf keeps his head a little bit higher.. just a little. Good acting though.."}, {"id": 43, "text": "Ignore the haters, this is one of the best films portraying Scandinavian god mythology.For me, this is better than some Hollywood version of Thor. Suspenseful and dramatic. Great film!"}, {"id": 44, "text": "The story line felt mystical in it's evolving into a great tale of man, discovering the power reborn in him and trying to adapt. I really enjoyed this movie"}, {"id": 45, "text": "Please, do your self a favour and watch this Movie. Ignore the knockers (I think they were expecting Marvel?), yes okay it was a bit slow at first, but stick with it, and please, please IT'S NOT MARVEL STUDIOS, ignore the fact that it is not a multi million dollar budget, and that it's Norwegian (With English subtitles, and as a bonus they SPEAK English too). I don't normally go for foreign films, but I really did like this one. Please remember it's a FANTASY, and watch it with that in mind. I, like a lot of others are desperately hoping for at least one sequel, if not several (PLEASE, PRETTY PLEASE). I am trying very, very hard not to include spoilers. I have scrolled through some pretty horrendous reviews (Even from a Norwegian), really I have no idea what exactly they were expecting (As for Azrafiq, I'd love to know exactly which movie he was watching, as it wasn't the one were talking about) and as for people saying it was a naff ending (Get a life), it was a cliff hanger, for a sequel. I for one will definitely be watching the sequel. Bring it on!"}, {"id": 46, "text": "Imagine, Jesus would be reborn today, not knowing who he is, but with all the power to heal and the holy rage to chase the money changers out of the temple. But this isn't Hollywood mainstream. The hero may also discover the beauty of his powers, because a woman feels compassion for him and stands by him. Then there are those infected by fear, who feel responsible for the current structure of global society. Muslims, Christians, Jews, Hindus (perhaps in the Indian version) are known and predictable. Unknown, new powers? Dangerous Super-Spreader! Apart from the courageously cast leading roles, the Mortal-makers will amaze you with its close-to-nature special effects, lulling you with common clichés in between, only to have you see Jane Bond's getaway car, a red Beetle, in... but take a look for yourself. Anyone who gives this film the little finger is sucked in with skin and hair, spat out in between and sworn in to Valhalla. Enjoy the ride on the elk. Ragnarok? When was that again?"}, {"id": 47, "text": "I just wanted the main characters to get killed throughout the movie, so it would end.Another garbage Norwegian boreshow, just cringe and confusion all the way. Nothing makes sense, making each scene more ludicrous than the other.I'm Norwegian, and I'm very disappointed in the lack of storytelling. There is no buildup, and most of the story is revealed at the very end. It's not much to brag about, probably why they didn't bother earlier on.Spoiler. Head-shooting the wrong person from a few feet away just to serve the lacking story for no reason. The End."}, {"id": 48, "text": "So different, ten outa ten for me Good acting for all"}, {"id": 49, "text": "IN A NUTSHELL: This is a Norwegian film with English subtitles, although there is quite a bit of English spoken too. It's kind of a dark origin story of a superhero, although the protagonist doesn't actually save very many people. Marvel this is not. If you think that's a good thing, you just might enjoy this movie.It was written and directed by Andre Ovredal. I've never seen his other movies, so I didn't know quite what to expect. If you like this movie, I've heard his other films are even better. They include TrollHunter , The Autopsy of Jane Doe , and The Tunnel (Tunnellen). Honestly, I thought it was cool that a Norwegian would create a modern-day version of a Norse god.TIPS FOR PARENTS: You see a person with a lot of burned skin. A person has a hard time controlling his emotions. Talk to your kids about that and offer some helpful tips. Some people die.THEMES: Maybe we're not meant to understand everything. - Sheriff It's healing to have someone believe in you. Religion is an interesting aspect of the story. People wonder if Eric is a gift from God like Jesus. One of the characters notes that if he is, he wants to help and be on the right side. Greek/Norse mythology is also a part of the story, as some people believe Eric is a descendant of Thor. Fear PowerTHINGS I LIKED: I liked the very beginning of the film because it was intriguing and I had no idea what was going on. You get to see some beautiful Norwegian landscapes. It felt like I got to take a little trip to Norway. That's cool how they made Christine's hair stand up in the jail scene. Some special effects look really good. Others, not so much. Some of the makeup design is very effective. Others, not so much. Cool movie poster. The color palette was very dark and grey, perfect for a brooding story of mystery and danger. I love the aspect of searching for one's family roots. My twin sister and I wrote a book about how to do just that! It has lots of how-to information, as well as inspiring stories from real people who had amazing experiences while researching their family tree! You can check it out the eBook on Amazon.THINGS I DIDN'T LIKE: The acting isn't exceptional and has even been criticized by many reviewers. I've seen worse. I thought Nat Wolff and Iben Akerlie did fine and were believable. Sometimes it's hard to understand what people are saying because they speak so quietly. Some scenes are dark, which will make viewing on small devices difficult. There's no humor. It's a very dark drama. The music was often too noticeable, rather than supportive of the scenes on the screen. There was a character whose motivations were very strange played by Priyanka Bose. After being saved, she tries to hunt down the protagonist to kill him. Why? I thought there would be a surprise reveal in the end that she was a superhero villain, but absolutely nothing happened with her character arc. Such a missed opportunity and disappointment.You can see the rest of my review on my Movie Review Mom YouTube channel and website!"}, {"id": 50, "text": "Interesting movie good some slow some goosebumps etc but def makes up for a no2. Wintvsay why but I dint like ending"}, {"id": 51, "text": "This movie was so bad that I laughed out loud several times. The acting is horrible, plot is abysmal and the dialogue terrible.+1 for special affects and some cool angles."}, {"id": 52, "text": "I didn't expect more than a well... ok movie but this one going slow but crescendo for a terrific end. Good and realistics specials effect (specifically the helicopter scene) . Good acting and a real nice job for the soundtrack give me goosebumps"}, {"id": 53, "text": "Casting was brilliant. Characters believable and acting solid throughout. Cinematography was simply outstanding. Of course from the brilliant team who created Troll Hunters comes another folklore driven epic sure to be cult classic. Solid 8 out of ten. Definitely recommend this movie."}, {"id": 54, "text": "Absolutely brilliant way of telling a movie. Most of the bad reviews are from people who do not understand movies even a little bit and are expecting full on super hero gore. This was a classic style of story telling which kept me on my toes till the end. It takes a totally different approach to the typical super hero nonsense and the movie settings were absolutely gorgeous. The direction was also really well done, acting was okay. I think this movie deserves more that 5 star on IMDB those who cant see that are really set on watching what they usually watch 24/7."}, {"id": 55, "text": "Interesting movie. Not sure Nat Wolff is the best choice for the main character, but he definetely looks like the boy next door, and this is what this movie is about : what if gods where among us? Fans of X-Men or Avengers would probably dismiss this one as boring, but if you like your movies a little bit more realistic and serious, give it a chance."}, {"id": 56, "text": "Absolutely amazing. A very captivating movie with a brilliantly written script, directed to the highest level and executed to perfection by a mostly unknown cast. Nat Wolff has a very bright future ahead based on the talent showcased here. Whilst Torden (Mortal) is somewhat reminiscent of Brightburn it manages to carve out a sense of realism and has an air of being entirely believable. This is helped along by both the very periodic subtitles for the Norwegian as well as the incorporation of ancient runes and understated special effects. Nothing over the top here Marvel. My only gripe is how short the movie was. Maybe i'm grasping because I feel like I need more but there is definitely room for a sequel and, if done correctly, a possible franchise could easily ensue.In short, a definite must see. 9.5/10"}, {"id": 57, "text": "The story is a bit sloppy , also I wish it was something to follow like a good damn story not necessary the Thor one , just invent something ! , the actors are ok but as the main char . I think you need a more powerful character( I doesn't even act like a normal person is allays this low self as steam char ) ,the guy has some good acting skills but not the right fit for this role in my opinion ! - AMAZING EFFECTS , you can compete with some top Marvel FX , overall I will give it a 6-7 , but that low just because of the story ! , but I appreciate and encourage other production studios to do movies like this , bcz it's possible to be in the top no matter the country or language is made of !"}, {"id": 58, "text": "Very poor plot story, waste of money and time. The leat the director of this movie should more explainable story of what is going on, so call 'god's power' but the only thing I can see is only some poorly edited graphic. Story involved an agent ordering to shot the girl without any reasons and the man only grudge is shouting and missing? What are the purpose of the Thor's Hammer and lightning shoots everywhere doing nothing?"}, {"id": 59, "text": "The movie Mortal depicts a very human and believable Thor. This beats hands down anything Marvel have yet to produce. There were no Hollywood A listers in this movie but all the actors were fantastic. A fine choice of leading and supporting actors: the director obviously knew what he was doing. I bet Marvel are kicking themselves that they didn't buy the rights to this version of the story of Thor! Well done everyone involved! 😀"}, {"id": 60, "text": "Looks like some low budget amateur movie with a silly plot but some how you want to know where all this is going even though it was obvious.. very fast forward romance.. insane plot holes and illogical decisions.. Very Mediocre acting. I gave this movie 4 stars just to avoid offending the Norwegians"}, {"id": 61, "text": "I liked that the movie was based in Norron mythology, seems that it was an exciting movie."}, {"id": 62, "text": "Yeah that's what movies are supposed to be like, thoroughly entertaining."}, {"id": 63, "text": "...interesting script, good acting......I want more!..."}, {"id": 64, "text": "Best movie i have seen for years. The story line is mesmorising"}, {"id": 65, "text": "OK, it's not got the budget of a Marvel or DC megafilm, but this film is a little cracker.Understated with a good script and decent enough acting.It's a shame that some people rate too low and not take the film at face value, luckily I was not out off, others may be.Again, this film did not have a blockbuster budget and was executed well under the circumstances.Very, very watchable. Enjoyed the ending ... sequel is a must.I would not be surprised if Hollywood picked this up and redo it."}, {"id": 66, "text": "To me Mortal was an entertaining movie but you have to like fantasy stories otherwise you might get bored. It's something else than the usual superhero stuff. The language is Norwegian and English so subtitles might be necessary. As for the acting I don't know any of the cast but they all did a good job. The cinematography was better than I thought it would be for a Norwegian movie, even though the fantastic landscapes over there help a little bit. The story is easy to follow, with some mystery that keeps you guessing. If you're not too picky it's an entertaining movie worth watching."}, {"id": 67, "text": "I thought there was an X-Men vibe to it like the story of a person going through his mutant transformation and learning to cope with it. But wait no, it's the story of Thor with a more down to earth reality to it and this is what made it even more appreciative and believable for sure. This movie was very well directed by André Øvredal and by no means I've just found his talent comparable with of the best in the industry, brilliantly done, an excellent director. He did everything right, not too much, just enough to let your curiosity and emotions rise with Eric's, played by (Mat Wolff excellent choice btw) so we could feel what he was going through as the scenes unfold and Christine played by Iben Akerlie, omg folks, the moment the camera got a close shot at her face, the scene when she looked up at the sun while standing under the rain, her beauty came out like a beam of light, I suddenly recognized the most beautiful actress like Cate Blanchett, Jennifer Lawrence and australian beauty Anna Torv facial features, jump right out with grace and that's when I thought, this beautiful Iben Akerlie from Oslo Norway, should never be forgotten and be cast again in more movies like this one, where there are extreme emotional scenes and this type of movie genre. Iben Akerlie and her fellow actor Mat Wolff were both mesmerizing in their roles and whoever found these two actors, kudos to you and the casting director. The special effects were out of this world and were just simply blended in perfectly with the beautiful Norwegian untouched landscapes and that suspended bridge standing there with tunnels at both end entering straight into the mountain was impressive as hell and an incredible feat of engineering and an excellent choice to put in the movie for its premise but also a great idea for a great tourist attraction. I don't know about you Norway reminded me, some of the scenes in The Lords of the Ring that were filmed in New Zealand, two place on earth that I wish I had a chance to visit one day and travel across its landscapes and sleep in a tent just to feel its soul.I'm telling you, I'm not just pulling your chain, this is probably one of the best super hero movie, where the protagonist discovers his powers and his reason to exist, since the super hero remake of the 2013 Man of Steel played by Henry Cavill, because of the story, the music, the actors, the suspense, the emotions and the sfx. To this day, Man of Steel remains in my top 20 greatest movies of all time and this movie folks, Mortal has found its well deserved spot in my top 20 best movies of all time. Definitely needs a sequel or this would be a travesty if they preferred not to. All we can do is cross our fingers. This movies deserves to be promoted by every means possible because anyone who understands the work behind the making of this movie, can only be in awe, but unfortunately it's a bittersweet industry, where everyone wants their movie to be shown, meanwhile you have a gem like Mortal, because of its foreign origin, doesn't get the light of day in exposure as the big budget american block busters that become successful by default, because of the pounding publicity that forces it down your throat, even though it wasn't that great to watch in the first place. Not fair at all if you ask me, but hopefully with word of mouth, it will become iconic in the super hero movies and a classic whereby everyone who loves fantasy and sci-fi movies would've seen it once by principle at some point in time their lives just like you'd watch the Star War trilogy right? It's that good folks i'm not kidding and this movie should be a trilogy. Now with all that in mind, if I told you, I recommend this movie to all you movie buffs, who loves to fall in love and also be blown away by fantasy and sci-fi storytelling, would you believe me ?? Well don't take my word for it, go see it without the critics in mind, because thats the worst way to watch a movie, you'll ruin it. Let yourself go and let the movie ride you to it's destination and I promise you, only then will you understand how I felt. Happy watching"}, {"id": 68, "text": "Nothing very spectacular about this film. Had a few good scenes here and there, but mostly dragged. I wouldn't say it was terrible, I wouldn't say it was great. Just ok. I guess if you can't find anything to watch, give it a shot."}, {"id": 69, "text": "Quite enjoyed this though it was very similar to the recent Netflix series Ragnarok. Pretty much the same main character but from different backgrounds."}, {"id": 70, "text": "The director is more than capable, the script is not so bad, but the acting is... awful. I mean, the cast makes you throw up. The main character Nat Wolff is awful as an actor, at least in this movie, no way he can be the main character in this film. Priyanka Bose the same, and Iben Akerlie is an amateur. I couldn't stand the three of them. OK, I know this is a medium-low budget film, placed in a typical norwegian environment, but that's not excuse. I really don't get it, I'm not norwegian, but I understand the language pretty well, and there are some good actors out there, with an impressive frame and acting skill who could have done a much better acting. The casting director of this film should be banned from the film industry. There's nothing much to say, just don't watch it. Don't waste your time with this one."}, {"id": 71, "text": "Im in this as an extra 10/10.. and that is why i gave it a ten. the vfx was super nice to look at and the sound design was epic.."}, {"id": 72, "text": "We've seen the Mighty Thor, Fat Thor, now meet the Norwegian dweeby confused Thor. Any effort to create a grounded Norse mythology based superhero is run aground in this turgid, boring, badly acted and unintentionally hilarious update on the Thor legend. 4 out of 10 simply for some excellent shots of Norwegian countryside, but this movie is quite close to being headsmackingly awful. Director Ovredal is clearly shooting for a sequel here, but here's hoping it's the last we see of Eric and his tiny hammer. Although ludicrously silly at the climax, the makers of this movie clearly took it seriously.Stick with Marvel's Thor."}, {"id": 73, "text": "Starting with a mysterious look i expected it to be highly fictional super-hero movie but even though it turned to be a whole different type of movie i liked it. Since I am not from Norway i don't know the mythology around which the plot revolves and also it's not produced from Hollywood, i will not criticize it. Visuals are good and acting is fine, the thing i found awkward is character interaction. I mean dialogues could have been better. I felt like they were rushing too much. Overall i enjoyed it and recommend it too."}, {"id": 74, "text": "Boy oh boy, this was such... such a refreshing play. Home... Run!"}, {"id": 75, "text": "This is a good movie, plain and simple. Better than average. If you're as burned out as I am with the onslaught of Marvel movies, than this one might just suite you.This is how you build a character's story.Well done, hats off to you guys."}, {"id": 76, "text": "Wasn't sure what to expect, but was humbly pleased at the story, and the characters. Watch it for yourself."}, {"id": 77, "text": "It was a really exiting movie and a good story. I love that they've have managed to show how beautiful the Norwegian nature is."}, {"id": 78, "text": "I guess most of us here on IMDb generally review the titles that we find either particularly good or particularly bad.This movie falls into the latter category although for most of its 90 odd minutes length it wasn't actually all that bad. What started out as an interesting idea with a young American guy who could kill others with a touch and who could make all kinds of other weird things happen, somewhat predictably went right of the rails into enormous improbability, including a supposed ancient connection between the young American guy (who not coincidentally had a Norwegian surname) and ancient Norse Gods. And this including the unearthing of a burial chamber full of ancient runes and the apparel of the God Thor - glove, belt and of course the hammer. Well, I can tell you that I got pretty Thor at that point myself.The movie might have been so much better if the lightning strikes and the Norse God thing had just been dialed down a bit.Thankfully, I didn't pay much for the Blu-Ray that my wife and I have just watched. It's a movie that I will put away in my large collection but it's not one that I'm ever likely to want to watch again.JMV"}, {"id": 79, "text": "Well is he a relative of Thor, or Thor himself HMMM!!!! Not giving anything away so I guess you will have to watch it yourself, Boring at times but still worth watching. James Welch Henderson, Arkansas 12/11/2020"}, {"id": 80, "text": "Really well made fascinating film with a slowly building suspense. Amazing scenery too. Don't believe the low scores, this is one where you hope a sequel will follow."}, {"id": 81, "text": "Most of the people don't know about this movie, but i personally tells you ,its was just amazing movie, guyz you have to watch this movie... Show good support for this movie"}, {"id": 82, "text": "Great unique take on a well known story. Great acting and beautiful countryside. Loved it!"}, {"id": 83, "text": "Not really sure why some American nobody, kid is somehow the descendant of Thor but hey. I will give it a thumbs up for the visual effects. But that overall plot to the movie just doesn't fit and has no a charisma to it. He instantly has this infatuation with female in the story but he has no idea who she is or anything about her. He buddy knows that she's the one person trying to help Holm. And what's with the out of nowhere fbi agent pursuing him? She's got a bigger hard on for him than they did for the Unabomber. Which was something i didn't understand about the whole film. The only time anything bad happen was when he was thrust into stressful situations. And yet they kept putting him in one after the other. You want him to stop causing supernatural things from happening. Maybe Your should stop chasing him!"}, {"id": 84, "text": "Don't listen to these fools on here giving this a bad score. It's not a classic by any means but i thought it was awesome. Well worth the watch."}, {"id": 85, "text": "Ignore the critics! This was such good movie. The location brings so much more to this tale. Hope there will be a sequel."}, {"id": 86, "text": "A real surprise one for me. Very interesting concept but the pacing for me was too slow. Maybe setting up for a sequel but they could have done much more with this. Regardless a good watch"}, {"id": 87, "text": "Really enjoyed the story telling, as a fan or trollhunter and stuff I really found the film fantastic I really hope there are following films"}, {"id": 88, "text": "It is an origin story which I hope has a sequel. I am not surprised critics didn't get it. The description did not do it justice. The film represents several groups but what I enjoyed was how society would treat anyone who has natural gifts passed down for generations. The main character was just as confused about how to channel his power and returns to the origin of his reveal. It may be slow in parts if you are not patient."}, {"id": 89, "text": "Trailer looked good, so I decided to check it out. Well worth the watch. The people who slam this movie are just too close minded to let go of the ideas and movies that U.S. cinema has made the norm, and probably have no clue as to the true mythology this movie is centered around.I thought the lead actor did an incredible job. The scenery was incredible. The visual effects lack some but I'm sure that's simply due to budget. Overall a very entertaining film that I suggest for anyone. Great story and intereating take on the actual mythology!"}, {"id": 90, "text": "Knew nothing about this film before watching and thoroughly enjoyed it! Beautifully shot and Nat Wolff can definitely hold his own, with a real screen presence and vulnerability. Cannot understand the low rating as you can find all sorts of nonsense with higher ratings. This was class and I echo what previous reviewers said, a sequel would be very welcome please as it felt like things were just warming up!"}, {"id": 91, "text": "Thoroughly enjoyed this film, great story and sfx, well acted and hopefully sets up a sequel. Great performance by Nat and I can't understand why the score is so low. Definitely worth a watch."}, {"id": 92, "text": "What can I say , you don't need big dollar companies and huge actors to make an almost perfect film , I still rated this 10/10 it blew my mind , from the director of scary stories to tell in the dark has out done himself, the right characters the story the director just fit into place like a jigsaw, definitely my film of the year, it would be nice to see a sequel but if they didn't I'm happy how the film finished off , this film is the brightburn of norse mythology 10/10"}, {"id": 93, "text": "Though slow at times especially in the beginning this movie has much to offer including a great story line good acting and great scenery. I am hoping for and would be surprised if there is not a sequel. Much better than the negative reviews."}, {"id": 94, "text": "I was surprised to see such a low rating. It's a little slow to get going but the story was a pleasant surprise. I'm not a comic fan and loved this movie."}, {"id": 95, "text": "This was astonishing. Great story, well acted, beautiful effects. This is exactly the kind of movie I love. I don't want to leave spoilers, but it made me realize how spot on Godard was when he said, In order to criticize a movie, you have to make another movie. I suspect this is brilliant criticism."}, {"id": 96, "text": "And much better than its Imdb rating. Combines mythology with fantasy very well. Absolutely entertaining. We need a part 2."}, {"id": 97, "text": "If you dont like awesome super power movies dont watch.. the first 20 min was slow and sucked but theres a reason to it. Then it gets amazing!"}, {"id": 98, "text": "Honestly I never review, but this was too good. If you are a fan of the unexpected, the unconventional, and the unpredictable when it comes to movies, this is for you. There won't be a sequel, it's just a good story."}, {"id": 99, "text": "Loved the thriller and mystery aspect if it. Also, the super power action aspects. Good acting from no-names. Great ending. I love when something exceeds your expectations which is rare these days."}, {"id": 100, "text": "What if an American descendant of Norse lineage visited the old country? What if that descendant, moved through the modern day world, without comic book movie overtones wondering what was wrong with him? What if he collided with a Norse mythology based on fact, where gods were mortal and left some stuff for him to find? And what if all hell broke loose in his journey? You would have this unique Mortal movie. André Øvredal decided to write and direct this, taking his ball home with him to Norway, and gave us a well thought out and well written script where the Modern day and mythology collide. The acting is great. The effects are as well. And the plot moves along and keeps us wondering and guessing about Eric is as we anticipate and came to a satisfying climactic ending. It's definitely worth the watch and we can only hope for a sequel."}, {"id": 101, "text": "I love films and going to the movie theater. Due to our current situation with the Rona this isn't possible. So I've made due with way too many sub par movies and shows on streaming services. This film was a pleasant surprise for me. It was a little slow at first but turned into one of the best new films I've seen all year. The reveal at the end was great and left me wanting more! I really hope they have a sequel and start filming it ASAP!"}, {"id": 102, "text": "Norway Just Shut Down Chris Hemsworth THOR OH MY GOD LONG LIVE THE GODS LOL"}, {"id": 103, "text": "Mortal far exceeded my expectations, and now it's unequivocally my favorite superhero movie of all time. Nat Wolff's performance was not only engaging and mesmerizing, but I felt like I was rooting for him the whole time. Costar Iben Akerlie leaves the viewer completely emotionally invested throughout the movie because most of us completely empathize with her. Per Frisch's supporting role leaves you wanting more. I truly hope Mortal delivers a sequel."}, {"id": 104, "text": "Well, it simply does what it says and it is very relaxing to watch a sound movie without any progressist or political agenda. It is just good acting, good scenery and a very believable script. I really enjoyed it !"}, {"id": 105, "text": "I was looking for something to watch and ran across this on iTunes. The trailer looked great, and the price wasn't horrible at all, so I took a shot. A bit on the dramatic side and a bit slow, but it is captivating. This reminds me of that movie that didn't get a lot of publicity, Horns, where the main character is tormented by something he doesn't understand.This one is worth sitting through, and I hope they continue telling the story!"}, {"id": 106, "text": "Honestly, this movie was great by far i'd say this movie fits in genre with where the movie Chronicle. It has an original story with an original plot and it shows you that not everyone/thing that is known/seen as bad was always bad. The character starts off as good and tries doing the best he could yet there will always be someone/thing to screw it up in the end that will drive the character mad or even make him angry. As shown in the movie Eric is seen as a scared guy who doesnt know what is happening to him, and then a girl come in to help to which they fall for one another after she sees the real him and he sees that she is trying to help. In the end it is ruined by some woman who just doesnt want the world to see it as a good thing because she is scared of him and of what he could do. She kills the girl accidentally but it could've been avoided, but instead she goes through with taking him down at all costs and because of that it causes total chaos after Erics' now girlfriend is shot in the head because the girl said to shoot Eric point-blank. Eric then is fueled by rage because what could've been a happy ending was turned around to show the real side of humanity. Not everyone is open to new thing or beings i mean who knows what could be out there. The most of the planet will be filled with hope but there will always be that one bit that just disagrees and hates to see the people hopeful. In my opinion this movie was a work of art becahse it really showed and described how most of the world is these days. Not everyone wants to see you happy, most people just want control and fear over others."}, {"id": 107, "text": "This isn't for newbies that like the plastic shine of Avengers or Spiderman. This is a gritty, origin story from Norway - well paced and well made. Beautiful scenery, great acting and the direction is on point. highly recommend"}, {"id": 108, "text": "There is a lot to be desired with this mixed bag. Fire the director for this frustratingly slowed paced story. The actors did the best they could with this stinker delivery from the director and producers. Or perhaps the producers couldn't keep their fingers out of the story cookie pot. The concept is good, but delivery of it, NO!. The mumble jumble old and tired line postulated mid-movie about what happens when a god walks amongst us was lobotomizing. Anyone could tell the character was going to make some bad decision later in the movie to deliver cheap, lame and forced drama. Further, the anti protagonist character was only a tool used to lazily inject predictable story twists. Still fun to watch."}, {"id": 109, "text": "Beautifully shot. Acting was great. Really nice take on an old story. Sure there are some scenarios that are questionable but overall I thought it was great."}, {"id": 110, "text": "I really liked this movie until the ending. Why can't movie makers do a good ending any more? I was watching this movie on PPV where you rent it for 48 hours. My wife was away. This was so good I stopped before the end; at the point where they went to the farm. I wanted to watch the ending with my wife. So, I watched it a second time with her. It was so good...and then...that disastrous ending...yuck!!!!"}, {"id": 111, "text": "While this was low budget by Hollywood standards, it was better than the last Marvel production I saw at likely an exponentially higher production price. This had a great story, stunning locations (I mean stunning), great acting, solid premise.It's all here and Yggdrasil too. (The Tree! Look it up!) Need a Sequel!"}, {"id": 112, "text": "If we think again the story telling in the movie its very good,how the director keep hiding the point of the story with some blury puzzle to solve make my hand keep clean from skip all boring basic dialog."}, {"id": 113, "text": "There are bad movie name translations and than there's Mortal. The original is Torden /meaning Thunder/. I don't want to write anything long - this was THE BEST superhero beginnings movie I ever saw in my life. Not the usual hollywood scheme. Bravo. Now I want a sequel."}, {"id": 114, "text": "Usually a serious critic of any marvel type depiction of Thor etc. This... a really gem. A deep story. Great acting. Brilliant plot. Believable and well crafted take on a Thor on earth plot."}, {"id": 115, "text": "Casting was great along with how the director allowed the movie to flow. Really good movie to watch all the way until the end. Don't skip it - J - Dubai, UAE"}, {"id": 116, "text": "Great story told in it's original form, good performances by cast , beautiful scenery, made you care about the characaters, I really enjoyed this film."}, {"id": 117, "text": "Fun watch. Did the one stupid decision at the end of the movie ruin it? Maybe. I was expecting it to go the other way. Although, you should enjoy it for what it is."}, {"id": 118, "text": "I'm sorry to say, but Nat Wolff is a bad choice for the main lead, zero charisma, I had to stop watching after 20 minutes, tired to see his frightened face. A new Thor, he is not.... I gave 5 stars only for the amazing Norwegian landscape."}, {"id": 119, "text": "I love this movie, but become so boring at the end when they talk about Thor wants to come back or whatever"}, {"id": 120, "text": "Well this was actually a great time killer, like watching paint dry or waiting for a bus on a hot summer day. Omg, this film was completely and utterly a crock of s...t. At first I really thought for a moment this film was going somewhere with some good special effects and the so called Norwegian Thor premise but nope, the story went off rails and derailed completely. It was nonsensical, silly and clearly amateur hour in the writing. There was no point to story except for the, oh wait...there was no point. Norwegian Thor....who knew. This is burner phone film, you watch once and get rid of it for good."}, {"id": 121, "text": "Great development of a complex norse character in a modern world. This is a true plight of a hero with romance, political enemies and an underlying theme of norse religion, history, and artefacts seeping into the modern world plus the dispatcher, a local cop who shares a passion for norse mythology. Hopeful a sequel is in production!"}, {"id": 122, "text": "A brilliant and breathtaking scenery movie, I was confused if the main actor is somehow linked to Thor we know from avengers. But no matter what is worth watching.i wait for a sequel to it.P.s this movie shows us that is not necessary to have the blond diva actor from avengers to be a amazing movie"}, {"id": 123, "text": "Beautifully crafted story about a man with super powers. He fears them at the beginning but fully accepts them when he knows that he is reincarnated Thor.It was a nice touch that the only they he could somewhat control his superpowers was being near to a person that was nice to him. The americans there also an interesting contrast. Norwegians wanted to understand Eric but Americans wanted him to be hidden."}, {"id": 124, "text": "This is movie making. Great story, great acting. The baddie is our fears in this movie. Quite an emotional roller coaster. Do yourself a favour and watch this. I am sure you will want more. Please don't let the Americans Make the sequel. Make it in Norway please."}, {"id": 125, "text": "André Øvredal, who wrote and directed both this and another favorite, Troll hunter is becoming a favorite. If the legends and mythology were true, and an old God was born into a modern world, how would the world respond? And if you were the unborn God, how would you handle it? This film tackles that question both tragically and triumphantly. The film is understated in pace but never boring, and the scenery is beautiful. It slowly builds to a tremendous finale. I am hoping there will be a follow up film. This realistic rebirth of Thor captures the imagination and leaves one wondering about the growing popularity of Norse mythology."}, {"id": 126, "text": "There was a thunderstorm going on outside while I was washing this and it felt synced at appropriate times. Seriously made a difference for me. It made it feel real sometimes, so I guess watch it when there's a thunderstorms outside and you won't be disappointed."}, {"id": 127, "text": "Well, for a start, this is not your typical marvel movie. If you're watching this with Marvel's Thor in mind, you'll be disappointed.Still, I like this rendition of Thor better than Marvel's."}, {"id": 128, "text": "When you get to the end it feels like such a waste of time. I would skip this if I were you."}, {"id": 129, "text": "The story should have had a little more work, but its not bad. the best part is when the FBI agent thinks about how stupid religous people will react to the news about Thor... It is norwegian so acting is mediocre, but if you look past that is good entertainment"}, {"id": 130, "text": "Sure, I sniggered a little along the way, however by the end I was loving it. The story worked nicely, keeping me interested and keen to see what would develop. The end result was excellent and great segue to a sequel."}, {"id": 131, "text": "Lots of critics can be made, relative to the story this movie is about but in the general ground it have a good watching experience plot and movie magic."}, {"id": 132, "text": "This movie suprised me,did not expect that,awesome movie"}, {"id": 133, "text": "The score is ridiculously low, please watch for yourself and see how amazing this movie is . It needs a sequel ."}, {"id": 134, "text": "Terrible acting, terrible writing. Truly an awful piece of art."}, {"id": 135, "text": "This stupid fella could not control his emotion on this entirely movie. No matter how u trying to calm him down... I assume his dialogue is only in 3 pages..."}, {"id": 136, "text": "This movie is one of the worst movies ever made and an insult to the nord mythology! Storyline is NONE and the characters barely speak a word! The whole movie didn't make any sense and the ending is SO BAD! One of the worst movies i've seen and i had to come and write this review! DISGUSTING!"}, {"id": 137, "text": "I hate bad endings. They can ruin an otherwise good movie. This was fairly mediocre throughout until the very last scene which turned it into the typical, depressing, European, Doom-and-Gloom story-line where what seems like something exciting turns into a tragedy. The motivation for who ultimately becomes the antagonist is also fairly closed-minded and bigoted, the presumption of religious bigotry."}, {"id": 138, "text": "If this film gets a sequel and the sequel is good, I will increase my rating to 9/10, because then it's an intro, and thus actually good. But this being a Norwegian movie (I'm from Norway myself), there won't be any sequel, sadly, because that's the way Norwegian filmmakers think, they see this as a self supporting movie, even though there isn't an ending."}, {"id": 139, "text": "I quite liked this and it kept my interest throughout, it's just that the ending is pretty meh. It's like the scriptwriters went 'er...i dunno..just end it here'. Anyhoo, i still liked it. P.S. Norway looks amazing. 6.5/10"}, {"id": 140, "text": "Acting was not great ,and it was good to show superhumans in another views ,video effects and other stuff was good but storyline is destroying everything!huge mistake from soldier that shut in the end why?!and other things. But in overall its was entertainment for me."}, {"id": 141, "text": "In this film you can find what you should not do if you want to make a film."}, {"id": 142, "text": "Saw the first 35 minutes .. sooo sloooow and BOOOORING ."}, {"id": 143, "text": "Amazing plot,great story with bits and pieces explained well off course there has to be a loads of explanations made Well who cares just enjoy ever moment,great script with beautiful concept Waiting for the sequel to the core as said ders a load of explanations to be made 😀😀😀"}, {"id": 144, "text": "Poor writing, poor lead actor, poor plot, poor ending, etc. the only thing that was great here was the norwegian scenery."}, {"id": 145, "text": "Watching the movie now and the gapping mistakes are jarring. The main guy character has no solid backstory and therefore no sensible reasoning behind some of his rather senseless killings. The girl he likes suddenly understands way too quickly and he somehow automatically is into romance. He does not really make an effort to save people and even the helicopter ride, he unnecessarily kills everyone for no good reason, he doesn't even try to negotiate a way out, just because he don't like heli sounds, everyone must die and die now. Where's the logic in that? Even when he gets all lovie dovie with the girl, his actions don't seem like the actions of some psychotic idiot brat who kills people that disagree with him at all. It all doesn't make logical sense, it's just a youtube video script done by the guys who happen to have movie making equipment, no real intent to make any compelling story"}, {"id": 146, "text": "Hmmm...what the point? Its so typical. You watch for a couple of minute, then you know, you definitely know that this power definitely thor. If you already watch marvel thor, im not recommend u to watch this movie. Its like a natt wolf version, but the storyline are not that great. But i will give 5 stars for that special effect. Other than that, just so so..."}, {"id": 147, "text": "This movie is great ur expecting mcu level but it's not it's a raw modern look on thor and it was great would love to see a second movie and way more action but this was a great orgin story I love when the hero gets angers to their core and fuels there drive love the moveu"}, {"id": 148, "text": "Goodness, this was so bad, that I couldn't finish watching till the end. Weak performance"}, {"id": 149, "text": "Literally a waste of time. Thought it might be something different, maybe a twist in the end, but no. Very unprofessional job. Reminds me of a film that a 18 year old would have done 40 years ago."}, {"id": 150, "text": "I can't even finish the film. It's boring and just drags. Minimal plot and character development. Save yourselves time and money by skipping this one."}, {"id": 151, "text": "There are a lot of good elements in this movie. The issue is they're not connected together in a particularly enjoyable way, leading to a bunch of questions. There are many scenes that disobey the fundamental rule of cinema show, don't tell - not that there is a big dump of exposition, but rather that stuff just feels left out.I wouldn't be surprised if this was intended to be a pilot for a TV series - cutting it in half and then having an entire season of episodes after it to fill in the gaps would be far more satisfying.Honestly, just go read Neil Gaiman's Norse Mythology instead."}, {"id": 152, "text": "Sure, it's made up of the usual tropes. Every hero with superpowers has to find themselves running away from the police, hurting people they love, getting locked up, look for their origins, etc. But this movie has a bit of a different take on the basic mythologically based premises. Plus, it is competently shot, with stunning Norwegian visual, and decent acting all around (although it deserved a better cast). However, this plot could have given birth to a much, much better script. What breaks it is not even the fantasy, but all those mundane things that don't make sense. For instance: a guy with God-like powers shows up, and national authorities leave it up to a local Sheriff? And it fails in other basic things: the total shallowness of all the characters, the forced romantic entanglement between two people with no chemistry between them, etc. I feel this is one of those movies that begs for a remake. I hope to see that soon."}, {"id": 153, "text": "Big fan of darker European films here!Was expecting something amazing from this particular director,big disappointment...acting is horrible,story is original but underdeveloped...beautiful scenery and that's basically the one redeeming point..."}, {"id": 154, "text": "Interesting performances. A bit over the top for me and slow paced.The whole thing could have been avoided if they gave the kid a Valium."}, {"id": 155, "text": "Perhaps it's because of a review, I had read, but I felt like my expectations were thoroughly misplaced. I had expected a story about Norse Mythology, not Thor/Ragnarok Mythology.I could have accepted the slow pacing and the generic characters if there had been a real payoff to all the buildup. Instead, I felt like every opportunity to introduce some other aspect of Norse Mythology outside of Thor's was entirely skipped. I was really hoping after they bothered to include both Iron Gripper (though why only one? It's a pair of gloves!) and the Belt of Strength that they'd include it all, and that at the end, Eric would've revived Christine, since, that's one of Mjolnirs abilities in the actual mythology (Thor would often kill and eat his Goats Toothgrinder and Toothgnasher, then gather up the skins and bones and in the morning, use Mjolnir to revive them), but no, it ends with a supervillian shout almost because they had recently seen Brightburn or if this were bigger budget, to introduce an evil mythology movie series.The entire movie instead feels like a very long first act to what could've been a much better story. They're just getting to what should've been the meat of the story, a cult of Thor and the instant glorification of Eric, how other religions react to the reveal of the Truth of the Norse Gods, how do governments react, etc.If you've read this far and haven't watched the Netflix/Norwegian series Ragnarok, do so and enjoy an actual story with real characters playing in this same sandbox."}, {"id": 156, "text": "We get the back story late in the film. Eric (Nat Wolff) from America is visiting relatives in Norway on a farm. There is a fire and we catch up with him badly burned camping in a forest. While walking he is bullied by a local and goes Loki all over him. He has powers and you can't keep down Fire Starter. He is on the run with his blonde single unattached psychologist Christine (Iben Akerlie) from the Norwegian police, American snipers, and the dead bully's father.It is a pretty good tale if you don't expect a superhero film.Guide: No swearing, sex, or nudity."}, {"id": 157, "text": "Mortal or simply said Thor film for poor.Also what was thing with this cliffhanger ,before watching this film i already know that this kind of film cant have a franchise behind its name,so i dont know why was director in end put a open theme for more films when we are knowing that we wont get none of them anymore,but that probably only he knows.Actors were fine but lead Nat Wolff was to wooden and without personality,his chemistry with a girl was in other hand good.Story was watchable to pass time but nothing special.Mortal was a film that dreamed of becoming something more but in end it become just another film that will be forgotten in two days"}, {"id": 158, "text": "A guy shows signs he has super hero powers after, we are told, he s lost survivor of a fire disaster. ok. but the thing is the script took it seriously and so did the actors. the special effects are kinda bad and theres one scene were the electricity in the sky looks like a 70s movie. ill finish it, but dont recomand. if you dare, use FF."}, {"id": 159, "text": "This movie starts out very interesting. Keeping you on the edge through most of the movie. Great suspense close to the ending. BUT the way it did end was ABSOLUTELY DISAPPOINTING. 👎"}, {"id": 160, "text": "Things looked all good until half way through the movie, when all the momentum they had built up with a nice pace and good effects goes right out the window when they just cant get the lightning right. the burning and water effects were finePriyanka Bose has no talent, its so annoying, further hurts the immersion of the film.so many cringe plot points and such after such a good start. sad"}, {"id": 161, "text": "Firstly the Norwegian scenery is beautiful and for that I give 2 stars As for the movie zero stars the male lead is awful has a dead pan expression from start to finish and as much charisma as bottle of flat bubbly and if he is supposedly representing Thor or another North God then poor choiceThe psychologist after meeting him for 15 minutes ends up 2hours later running off and falling in love yeah right🙄There are so many flaws for me it is more of a comedy , a comedy of errors!"}, {"id": 162, "text": "Right up until that truly terrible , We want to make a sequel or television series ending. At that moment it went from a 7 star to a 5 star rating for me. I was even willing to forgive the reading assignment that is most of the film. I hates me some subtitles. It was obviously made to market in English speaking countries. So....you know....ENGLISH. I have several thousand e books on my hard drive if I get in a reading mood. Beyond the above. Pretty good flick."}, {"id": 163, "text": "Ive been left with goose bumps after watching this. I registered just to review this, and thats saying something.If historical mythology is up your street, particularly aimed at Vikings, and Old Norse, then you will enjoy this. Its a movie about discovery, without spoiling it too much.Its a slow burn, but anticipation grows and your left with arguably the best film I've watched in recent years. Id even argue its better than most mainstream films. It has a hint of a Bmovie about it, but the special effects used, look believable and outstanding. It never felt over done or overly Cgi.The acting was decent. The dialogue and script for Priyanka Bose's part as Hathaway felt hollywoody. I REALLY hope theres a sequal coming, and wasnt a one off. The entire film was staged perfectly for a sequal, and there's so much more that could be told."}, {"id": 164, "text": "I highly recommend it (yes Americans can appreciate this movie too haha).My compliments to all involved in this project top to bottom. Great writing, directing all the actors did a great job, granted at first I didn't think I was going to like Nat Wolff but he grew on me. And really nice effects nothing over the top or excessive but quality work. It was a great story, that I thought it unfolded nicely.In my case the ending really surprised me, I didn't read the full summary, I just thought the first half sounded interesting. So I completely missed the Norwegian mythology part. Now granted given a little more thought I guess I could have put 2 and 2 together early in the movie but honestly I'm happy I didn't. It was much more fun being completely surprised toward the end. I just wish a certain thing hadn't happened in the last scene.I really can't decide if this is one of those movies best left alone as just a great piece of work or if I'd like a second. Probably the former but it really did leave me wanting more, it definitely felt like there was another chapter there just waiting to be told."}, {"id": 165, "text": "You know.. what the hell happened here? Øvredals last three movies are Trolljegeren, The autopsy of Jane Doe and Scary stories to tell in the dark. Three prette awesome movies. And then this? What!It starts off depressing, and it keeps on being depressing, dark, slow and just a big downer all the way to the end.The leads, Iben Akerlie and Nat Wolff have no chemistry, or very little at least. We don't get to know them at all. Nat Wolff is sulking and acting afraid. We get about a billion close ups of his face. He is also totally charmless, I'm sorry to say.Overall the acting is ok tho. And it is kinda cool to see this kind of movie in norwegian. A lot of the dialogue is in norwegian.The action is tolerable, if you can call it action? The movie looks pretty good. Nice nature. Probably the best thing about it. It's beautiful here in Norway. It's not exactly a bad movie, it is just slow, very uninteresting, and well, pointless. And again, Nat Wolff.. boy. He is so boring, and plays a character I don't care about at all.And please get actual americans to play americans."}, {"id": 166, "text": "Slow is the way to go, sometimes. Imagine if it was you, and you don't understand what is going on with you. Like a disease, or trauma. In this world of instant gratification movies, its refreshing for a movie to let one live it, in seemingly real-time, with the hero. Slowly, cautiously, discovering what he can, and cannot do. Its like people are in such a hurry to know everything. They almost need to re-learn to discover it, as the hero in the film discovers it. There is doubt, and concern, even fear, that needs to be overcome. You have to look before you leap, especially into he unknown. Its called Patience. People who rush into what they don't understand, will regret it. So, go at your own pace. Like this movie does. Especially when you are in doubt about who you are, slowly leading to self discovery. Why rush it? I love how the movie criticizes and slams others feeling they have to control everything and others. Not unlike some of these instant gratification addict negative IMDB commenters, who wouldn't know a good movie if it was in front of them, educating them. They want to control it, insulting that scum, is what this movie is also about. You control nothing. You do not seem to understand that your comments become what you expose: boring and depressing. Worthless comments take up space and often reveal your ignorance, and that you seem to have have missed the point. You are the take the shot crowd, and try to ruin it for the rest, but... as the film shows, sometimes there are consequences. You seem to have learnt nothing from watching this film. Now go watch Police Academy that's your level. Leave the more sophisticated, slow, involved, deep movies to the more mature people, who appreciate them. Thank you."}, {"id": 167, "text": "I have been watching a lot of Norwegian movies recently and to be honest I have not seen a single bad one yet and this is no exception.It shows what can be done on a low budget; the photography and landscapes are awesome, the story is intriguing from the very start and keeps you hooked and on the edge of your seat until the very end and puts a magic spin on the old real Norse mythology of Thor and the tree of life.The people giving this a 1 or 2 stars have no right to be reviewing movies as this means it is the worst movie you have ever seen and if you don't have any idea of what ratings like 1 or 2 mean, you should not be doing reviews. It is almost as bad as the paid shills giving movies a 9 or 10 stars and this is definitely nothing less than a 7 star movie!It would have gotten an extra star if it had not been for the rather abrupt ending which made me feel like they had run out of money or perhaps angling for a sequel and the main character could have had a better choice of actor but i liked the idea of replacing the usual musclebound, brainless Marvel nonsense with a more ordinary bloke; kudos to the director and may he make many more movies in future and hopefully a sequel as this beats the Marvel crash, bang , wallop ordure into a cocked hat!If you enjoyed this movie then do try other Norwegian classics such as the magnificent disaster movies Bølgen (2015) and the sequel Skjelvet (2018), for horror try some Fritt vilt (2006) and one of the best thrillers I have seen in ten years Hodejegerne (2011) but do rent this Thor alternative or preferably see it at the cinema as this film is truly a joy to behold!"}, {"id": 168, "text": "First of all, I watched this having only seen the trailer a while back and not having read ANYTHING about it. I think that helps.So, the bad. CGI is poor at times. There are a few unexplained occurrences which characters should really question. Dialogue is occasionally stilted and the actors can't make it work in those few, brief moments.Now the good: Pacing of story is spot on - it's not relentless but never drags. Acting is on the whole quite good. Cinematography is very pleasing throughout, backed up by some excellent lighting. If you are a fan of super-human/fantasy films, the story is engaging and better than average.I'm not going to say much more than that. It is easily 8/10 (for the genre) and provided a thoroughly enjoyable Friday night's movie-watching. I am quite picky with film and TV and enjoy a wide range of genres and eras. There was much to enjoy here, I recommend it!"}, {"id": 169, "text": "This movie develops the characters. That takes time. It has a plot IF you watch and observe. The female lead is a complicated character with personal issues. She speaks hers native Norwegian language but also communicates with the male lead in English, which she explains that she is not proficient in.The male lead is NOT Thor. He is from the USA and has been through a very traumatic experience. He is going through changes that he does not understand and cannot explain. And he is totally alone in a foreign land and does not know the language or the people.The special effects are minimal but good. Supporting cast is good in their roles.The cinematography, scenes, and locations are a major part of what makes this film so good. It is a story about Norway, past and present. Its people, culture, history, and mythology.The male lead is a US citizen so the US government MUST get involved for ìts own selfish interests. And like so many other things they manage to turn something positive around place the blame on someone else.This movie is something unique and different. If that's what you enjoy then give it a chance. It could be just what you want."}, {"id": 170, "text": "In a generation where people's attention span is that of a fish... undoubtedly a movie that actually has a story line and is not just a series of special effects with a few words in between... can fall short of their adrenaline pumping needs. Unfortunately that drives movies such as Mortal, that are beautifully done, to be dismissed or misplaced under the radar.Mortal was true storytelling and broke free of the typical boring format and approach of super hero origin stories.The creators of Mortal allowed the time and built the space for the viewers to truly empathize with the characters. The movie speaks a lot of subtle truths about this world and our societies and how we jump to conclusions and don't consider multiple perspectives or take time to understand truth. They attack, subdue, or try to control anything that they fear, that is different, or threatens their belief systems.I will say I am not into the comic book or super hero types of movies typically nor do I typically write reviews.... But when I saw the ratings Mortal was getting... I thought the people that made the movie deserved a shout out from someone that is pretty picky about movies... though there are a couple special effect / cuts that could have been done a bit better... Mortal was so beautifully done. The story telling and cinematography was superb. Overall a great movie and origin story. So bravo to everyone involved. Screw the reviews and definitely do the follow up!"}, {"id": 171, "text": "If you are a Hollywood film zombie who just want your regular fill of off-shelf dopamine--don't watch this this film, you'll give it a 1 star review.I can't say the film is spectacular, but it takes you to see a super hero movie from a different angle--and a different point of view, one which is more personal and sensitive. There is where the strength of this movie lie. It's a slow burn movie which lets you process your own emotional connection to the different characters first, before proceeding to the next scene. You'll sometimes find yourself saying to your head--oh no, you should've done this instead or this shouldn't have happened if... and that's okay--because you are not the character, the world is filled with people who thinks and reacts differently anyway.Enjoy the movie in its entirety--the cinematography, the sullenness of characters, the weird weather in Norway (why do they always have hooded jacket? -- you'll ask), the take on Norse myths. The movie will not explain everything so you need to drum up your imaginative and creative brain--by which a movie should make you do.What will make this movie a better film is a better development of the characters and how they are relevant to the overall story--like the father of the dead kid.What will ruin this movie is a big budget heavily spent for effects, costumes, and advertising."}, {"id": 172, "text": "I love movies based on characters with superpowers. I especially like plots that aren't so black and white, good vs evil... one-dimensional. Toward that end, this movie reminds me of films such as: Push, Unbreakable, Chronicle, Code 8, Jumper and especially... Firestarter and The Lathe of Heaven.I thought the film's plot was good enough to keep most users engaged. The acting is very good, especially from co-lead Iben Akerlie. It's a Norway product so there are a few subtitles early on but the film is mostly english - so you can concentrate on the visuals (actors, backgrounds, facial expressions, etc).There was something throughout the film that kept nagging at me, however. It turned out to be the lead actor, Nat Wolff. He simply cannot act (or at least, was terrible in this film). While the rest of the actors did a marvelous job (in helping me suspend disbelief), Wolff was decidedly the opposite.The movie kept switching from a high-quality, low-budget 6+ to a B-movie that sucked the energy of out you - every time there was a focus on Wolff. It was like listening to a song with a good chorus and the lead would speak (not sing) his part. His voice was monotone, his facial expressions (a big part of acting) were monotone, his movements were monotone. Bad, bad casting here which nearly ruined the film, if not for Iben Akerlie carrying Nat Wolff.Despite this, the film is very watchable (especially if you enjoyed some of the example films I listed above).The ending is a little disappointing but leaves room for a possible sequel. Honestly wish a possible sequel used a different lead character."}, {"id": 173, "text": "From the dark side of the moon, to odd'a( yes believe it or not its called odda, how odd is that!!!) or some other highenergy industrial site in the steep and fossfaldy norwegian vestlands fiord, where an american man tries to find his ancesteries or ''finne attende til ættesoga'', as they would say in ''new''-norwegian, or as they said in the 19th century, the peasant language, that kvithers from the locals epyglothies in this film.the main character that at first sight seems to be boiling over, hi on testeronic hyperkeratinosis(hairgrowth), with legs like a boiled aspargeus, smelling ditto as a meal of ''pinnakjøt''(treemeat), and behaves like an aspergillicalistic high functional and high energetic asperger spectre syndromian, ravishing and turning upside down on the beautiful norwegian lanscape and society, killing with a touch of the thumb, while all the children say,''we dont need another hero''- in the thunderdome....well its supposed to be scripted upon the faith of norrøn mythology, and if my little squeels havent tipped you of yet who this americans ancestors are then try to eat dynamite with some olivespeckled nitroglycerin to ease swallowing, than you might hear the sound of....well its a norwegian kind of film, and as the patriot i am, i will praise some of the special effects made for this flick, the sturdy use of peasantian language makes this a milestone as a memorial of the good old norwegian tv-theater flicks made in the language of ''bondsk'' nature, but thats more or less it. well i forgot the eminent aerials that shows off the world reknown outstandingly beautiful norwegian nature, that youll find in canada, alaska, chile, argentina, japan, among all the other places on mother earth that believes they are the best in the world.the grumpy old man have said 4 stars is more than enough, its to glitchy and easy piecy made plot and script, calling the media that are present''online news'' are pretty weak and lacks a lot of phantasia. but if you believe in the thunderdome, then have a look, cause i'm son of odin, you know that bearded son of a gun with hugin and munin on each crest using his breidablikk to enrich and punish the good and the bad in ancient norwegian history, så då så"}, {"id": 174, "text": "2.5 out of 5 stars.Mortal is a fantasy action thriller that plays with the concept and story idea of a person becoming a hero with godlike powers. Taking the setting at Norway. A hiker played by Nat Wolff soon starts experiencing with strange behaviors. As he controls lightning. Which gets the attention from the local officials and government that is trying to capture him.Sadly, the film is boring. It does have that bleak direction. The script makes the characters uninteresting. Barely any development. The visual effects are nothing special. The action is bare to minimum. Almost reminds me of Chronicle. But that was still a better movie. The cast is decent. But they did not have much to work with.It could have been better but falls flat to a waste of time."}, {"id": 175, "text": "This movie, despite looking pretty, was too long; the material felt like it was stretched out to wafer thin levels.The worst part of this film was Priyanka Bose's character as some nondescript 'American' agent or something called Hathaway. Her ability to act is nonexistent; her accent changes every sentence from some hybrid unknown US accent, to african, to indian.Not only is she terrible, but her character is a one dimensional antagonist that no one asked for; she is completely unnecessary in this kind of film.The main character was average in appearance and stature. His acting was OK and the effects really sold this transformation to a powerful magic man.The movie was a dud, through, and just ends abruptly before even any revenge is dished out.4/10 a below average missed opportunity that drags on."}, {"id": 176, "text": "Despite what others might be saying about it, this movie is not being poorly rated due to budget constraints or lack of action. I am giving it a poor rating because it lacks any semblance of good story telling, without any meaningful character development or plot development.I went into this movie knowing it would be a relatively low budget movie, and was not expecting any MCU-type action, which as far as I am concerned is great. I was, though, hoping for a movie somewhat in the spirit of the Norwegian series Ragnarok, but what I got instead was a story that feels like it was written for my 10 year old son, completely lacking in depth.The acting was solid, but unfortunately it could not compensate for a poor script. So if you are reading this prior to watching the movie, I suggest you move on, nothing to see here."}], "reviews_amount": 177}