{"name": "Spontaneous", "titleId": "tt05774062", "reviews": [{"id": 0, "text": "I haven't seen any reviewers note the metaphor for school shootings. Friends being there one minute, gone the next. Panic, trying to escape. Constant funerals. Survivor guilt. Ineffective government response. Dark humor. No explanation. No answers. Loss, depression, eventual recovery."}, {"id": 1, "text": "Make today the first day of the rest of your life, live every day as if it's your last, seize the day, seize the moment - but does it really matter or make any difference and can you really do anything about it. That all depends on your nihilistic tendencies which, after watching this, may have become increasingly acute."}, {"id": 2, "text": "Great start and middle, but unfortunately this movie had to drop the most predictable &amp; tiresome ending on us, it nearly me puke.It trundles along quite nicely, there's some good symbolism, metaphors, it gets you thinking. The love story is touching too. However, the message it's trying to portrait is so old: live for the now, grasp each moment blah blah.How about an actual ending? An attempt to create a moment of wonder, an explanation? Something different? Too much thought involved in that for some filmmakers I suppose."}, {"id": 3, "text": "Although its a little campy and cringy at times, its an overall very entertaining film with a good message. Tries to be too clever at times but is 100% worth the watch. Don't believe the haters and go in expecting a fun movie not Shawshank redemption and you will enjoy it!"}, {"id": 4, "text": "OMG!!!! What a waste of time a movie with NO punchline just pure stupidity"}, {"id": 5, "text": "Only parts that were funny is when people exploded randomly as you played guess who is gonna pop. Ending was complete garbage and made the movie worse and anticlimactic. I expected more people to pop, but I guess it wasn't in the budget. Also they intentionally made several anti President Trump jokes for no additional value to the story plot."}, {"id": 6, "text": "I can't appreciate enough the timing of this film's release. The fact that this came out during COVID-19 and the film features the COVINGTON CURSE makes my head explode. The movie tries to use its silly synopsis to draw parellels between it and school shootings and loss of loved ones to a surprising pandemic and succeeds in my opinion. The movie may not be perfect but it works extremely well as a rom-com and makes every point its trying to make well."}, {"id": 7, "text": "Ok so if you read that headline again you will see romance but just now this kinda is like a comedy too and horror at the same time. This movie threw these characters into a inevitable situation that only allows growth for the characters and story. The movie is surprisingly gory and just a complete blast. If this movie hits blu-ray I'm buying it hands down."}, {"id": 8, "text": "Busted pile of drivel. This was stupid. Bland and boring"}, {"id": 9, "text": "I enjoyed some of this, the lead character is worth watching just for her personality, but the message of this film speaks volumes about the current mindset of world we live in. And that's not a good thing. It preaches that all the good and bad in the world happens for no rhyme or reason, no one is in control, nothing matters, other than surviving and enjoying the moment. It's pure narcissism. It's all about meeeeeee. Me being happy. Me surviving. The allegory it uses to make this point in the film is good and bad people exploding. No explanation as to why, it just happens. And that's a very sad thought. No point. No purpose. Just hope you don't explode and if you don't. Enjoy the moment, because you'll eventually die one day and then it will all be over. No afterwards. Just this. This life.I don't buy it for a second."}, {"id": 10, "text": "As the title suggest, it's been a very long time since I've come across something so horribly bad. I have had tolerance for the worst of dramedies, but this is where I draw the line. Absolutely preposterous. The only redeeming quality this movie could've had, was if the female lead has indeed exploded. I was waiting for her character to explode. Sadly, it didn't."}, {"id": 11, "text": "It was decent. It could've been better. The ending was very interesting. I'm a bit disappointed with some of the character's story arcs. I won't spoil it because the ending was my favorite part!!! I wish this movie explained more about certain characters that would've made this movie more impactful. I didn't regret watching this movie. If you watch this movie don't eat snacks or anything because the film gets real gross!!!! However, everyone should watch this movie because it's so relevant. I'm giving it 7/10. Go watch it. All actors and actresses were phenomenal in this movie."}, {"id": 12, "text": "This movie is as spontaneous as it's name, always throwing plot twists at the drop of the hat. It's horror meets romance meets comedy in the best way. The main character is relatable, intriguing, bold, uniquely herself. This movie at movie left me laughing at the character quips. It's explains a star crossed lovers arc in a strange yet perfect way. Must watch!"}, {"id": 13, "text": "What am I missing? A comedy, without humor? This movie wasn't even a little funny."}, {"id": 14, "text": "This is god-offal. It's cringe. The payoff at the end is the worst."}, {"id": 15, "text": "After watching this I can understand now why it took almost 3 years for a distribution company (Paramount) to eventually pick this up, I believe Netflix bought the original distribution rights but didn't actually broadcast it and sold it off to Paramount.. because it's trash.. it says a lot about this film if even the the Queen of Netflix (Langford) cannot have Netflix release it and they release a lot of crap..It's not funny because it tries to hard to be so, I didn't laugh at all, maybe because of the situation the world is in right now with certain similarities and coincidences with it, (even the high school is called 'Covington'..) so it was probably wasn't the best time to actually release it.. no thought process gone into that then, well done Paramount.. not exactly what I'd call light hearted humour in these troubling times, it tries a lot to be humorous one minute, then serious the next.. is it a Romantic/Horror or Romantic/Comedy or a mixture of all three? Who knows.. I don't think the director knows either, as it switches very quickly between all three genres.. or it's not funny because it's simply, not funny..Langford and Plummer don't seem to fit, can't quite put my finger on it as to what it is but it feels weird and awkward between them, their characters are total opposites, I don't know if it's just their acting abilities, their characters or poor direction, I'm not sure but I didn't find either of them humorous, not in the slightest, they also have zero fake chemistry.. plus they aren't kids, they're both actually in their 20's in this.. well maybe Plummer wasn't but they don't even look like high schoolers.. it can only last so long that they, especially typecast Langford, can play teenager type roles and this isn't one of them..As acting goes, Langford tries, idiotically and a bit cringe, to be this loud, hip, cool, don't give a crap with attitude type chick, with flaky parents, this role has been overplayed so many times now and also way better, there's plenty of face palm type moments from her, I've seen Plummer in one or two decent films but he's only in them as a side note, to just fill the margins.. kind of like Langford has been in the few films I've seen her in.. And how old is Haley Law? She's almost 30, playing a high schooler and she looks that old in this too.. nice casting..Don't waste your money on buying/renting ($15/$10) this, I was lucky enough not to do that.. if so, ask for a refund.. as it's being released as a full price 'cinema' release on VOD now so just simply wait for Amazon Prime to eventually release it as a normal Prime exclusive release to viewers in a few months.. even then, if you've got a spare 90 minutes to waste, watch something more entertaining.."}, {"id": 16, "text": "The most boring movie I have ever seen. There was no story as you don't know what is going on. If I could rate this a 0 I would."}, {"id": 17, "text": "Wow, that was the longest of all the long headlines i use to writs, and thats i due to several reasons. first when i put this film on , i did expect a teenage love/romance movie, and i got it + a bit extra. second i expected some teenage bleeding hearts, and i got that too + a heck of a lot of it. third i expected a lot of charming love, sex and flirting love, and i got that too+ a lot of love BLOWN away like instant coffee in a cup of hot water. fourt expectation was comedy, and i felt that to, + some crazy comedy twists that that im bloody sure you havent seen before. my fifth expectation was action and reaction and a little bit of nerve, got my hands filled + all the buddies hanging onto me. sixth expectation was to see handsome actors a actresses, and i just fell in love with her....so i think all the ones that gives this movie less than 5 , have a deranged mind on the principles of irony, black comedy and gore in a relative safe and regulated setting. i , the grumpy old man, gives thkis a 10 stars after first view, and that is some serious business, and i'm for sure not paid for it, sitting in my chair wearing only my prison stripes underpants, waiting for my pain medicine to start working, so that i can start maintaining my life as synthetically as it can be done.its also a take on fright for disease, with quaranteening and isolation, reston suites and suits, government officials hoping and praying to find a cure, making a killing field of medical experiments till a immunizing cure is found, and by all means the people have no trust at all towards the cdc and nhs and fbi and cia.so the silver line words are, love, hope despair, shock, terror, blood,broken relations, drugs, fungi, alternative cures, schools importance and a wicked outburst of bad coincidence in the era of pandemic terror and angst..but to make it short its a film about a young girl that really do feel life is good and adventourous, that every day has a glimmer of hope, and that everybody are good to her as shes to them. then , all of a sudden in the classroom the girl who sits in front of our main character, blows up in a red rain of blood...is it spontainous and coincidental... well have a look , you wont regret it.actors and extras, well some of the best appearances on its genre this year, the extras are so believable in their frenzy and friendship so youre eaten into the horrors of frightousness, but the mains, and especially the lead female is a sensation on its own.its a lovely choice by the casters to apprehende that some naturally fruitfull body is ok to use in the movies, it seems like the skinny and bony ones have been put on hold in this film.productionwise, im impressed by the special effects, , audio and visual, and do wonder how much they used, and how they made that blood look like...blood. the musical score have a nice surprise ,with a wide selection of music made to enhance the plot, and the songs by hooters made this even better. filmographic its as it should be, the location management and design are great.story, well its in the ''i''-form with all the challenges that sets for the production.so if you want a film full of speed and surprise and bloody gore + a whole lot of love, and fright and sadness, the grumpy old man thinks its the marvel of unexpectedness, and therefore a big recommend"}, {"id": 18, "text": "Keep politics out of movies! Just turn on CNN and save your money!"}, {"id": 19, "text": "Well I liked this movie, the main characters got away from herself a bit and behaved poorly, some understand why, other don't because it's happening to them too. I however was very upset that you never actually find out what happened! It left it unfinished, in my opinion."}, {"id": 20, "text": "The movie is amazing!! I haven't seen a movie like this before and that makes it amazing. Great casting too!!!"}, {"id": 21, "text": "An adolescent film that goes from satire to romantic commendation, passing through drama. It's about a high school group that students are literally exploring and looking for a way to survive, while a love story is born. Quality. Entertaining Clever jokes and sarcasms. With an acid black humor. The moments that are well-managed romantic comedy, as well as those of drama. Performances at the level. The effects are good although at times so much blood is usually exaggerated. She talks about how important it is to live and always enjoy the present because tomorrow we will not know if we will be there, to try and risk what we want. Narrated in the first person. The only problem is, it doesn't show you the reason for the explosion. Ideal to spend the afternoon."}, {"id": 22, "text": "So if you happened to turn this movie on or walked in and sat down to watch it w/o knowing what's going on, you would think it's either A) Stupid! Or B) Okay, that was Lazy. But if you started to really Think about it, as one or two mentioned before, this Film can and should be seen as a 'Metaphor' and should perhaps be called THAT. I have always identified the word 'Spontaneous' as a word referenced to A Good Thing. Often heard in sentences like: Come On! Let's Be Spontaneous! Let's just Go Do it... THIS Film's Definition is the exact opposite of FUN. While Deaths for NO Apparent reason happen through the film, nobody has ANY answers. No answers as to 'WHY it's happening', and then, it happens AGAIN, and AGAIN...And the 'Why's' like the body count continue to pile up. The different ways of COPING, some self hurtful, most are true. The self Blame, it happens as well. But the question always remains, 'WHY!?'NOW IF You DID do one of the above mentioned Walking in it randomly 'Just watchin A Flick's I'm sure you will hate this movie that has no real ending as to 'WHY!?' all this happened... Its because it was exactly as thought... Its definitely a metaphor, just remember to keep that opened mind, and help those out who in the end have that look on their face of: What the Frack Just Happened!????"}, {"id": 23, "text": "Movie starts with explosion ....and explosion continues until it stopped...why it's happened nobody knows not in the movie it has shown just happen ....you gonna enjoy the rush but in the end you fell why ..."}, {"id": 24, "text": "........If your idea of sex is one where, afterward, you still qualify as a virgin. Is there word that means pitiful to the 4th power?"}, {"id": 25, "text": "The movie tries to give a non-thought provoking message about life and that's all, there is no interesting plot or characters (I mean the explosions and the reason would be interesting but the movie isn't about that). That's why I said a kids movie the message is so basic so simple mostly everyone thought about it and move on because that's just life."}, {"id": 26, "text": "That is 1 hour and 41 minutes of my life that I will never get back. I think people forgot how to make good movies anymore. Don't waste your time on this long boring movie that seemed like 4 hours. The main character was terrible, I was hoping she'd go instead of her boyfriend. Please don't waste your time on this movie, there is no answers in the end, they just leave you hanging. Pointless drawn out, senseless movie. I'd give it -10 stars if I could. Wish I could get my money back for this one. Also, stop with the politics in EVERY movie, we get it, Hollywood loves to brainwash the youngins. Republicans bad, orange man bad, it's REALLY getting old. These are high school kids that can't even vote. Give it up already!"}, {"id": 27, "text": "13 reason why actress become movie star. The style of this movie is very alike the tv drama she did. Exactly the same person and character I would say. Also the theme is live or dead, some level the same. It's very teen movie but being an old adult feel the sweet and not tacky of this one. At least not boring.,"}, {"id": 28, "text": "There is not good story langfrod is mess acter she was good only on 13 reaseon why"}, {"id": 29, "text": "It's definitely more entertaining than most movies today. I really thought Dylan was a girl for the first 15 minutes of the movie lol. I guess will never understand dudes with long hair... oh well. Anyway, it's a decent movie to watch if you're looking for time to kill."}, {"id": 30, "text": "Spontaneous checks out as a movie that starts with a big blow. The film carries a subtle mood from start to end that can either makes you feel bored or can create a nice atmosphere that you will get blend into. Katherine Langford and the other actors have delivered a good performance. The tension of the movie doesn't let you lose track and keeps you in your seat all the time. overall Spontaneous is a good addition to the list of teen drama movies that you can try at least once and it will not disappoint you."}, {"id": 31, "text": "Idk how to feel about this movie but I was waiting for her to explode at the end or her parents it just felt like they were and nothing happened except were all gonna die.."}, {"id": 32, "text": "Awesome, original teen flick about kids that start to explode senior year is charming, hilarious, a little scary and wonderfully refreshing. Starring Katheryn Langford (Love Simon) as a young woman who finds love with a charming loner played by a charming Charlie Plummer during this odd epidemic. The movie treats it's subject matter in a very genuine, smart way so it's never a full horror tinged comedy but more of a horrible event happening to funny people. Engaging and edge of your seat, its definitely one of the year's best films.****.5/5"}, {"id": 33, "text": "I totally love it.. It's a nice movie and funny by the way.. Hence entertaining"}, {"id": 34, "text": "I wouldn't call this a horror comedy, although there are some moments that did make me smile. Although I guess exploding teens does make for some rather dark humour. Overall it is a rather somber film, but with a great metaphor for life in general. It poses the question; if you live in fear, are you really living at all? Great choice of cast and a good solid film. Would definitely recommend giving it a watch."}, {"id": 35, "text": "Ridicule and Boring movie. I don't understand the good reviews. I stopped watching after 20 min."}, {"id": 36, "text": "Bros, this move is deep and touching 👍🏻 💨 be spontaneous 🤘🏻"}, {"id": 37, "text": "I absolutely loved this movie My eyes were truly glued to the screen"}, {"id": 38, "text": "Wow this movie was so strange but for every strange vibe I got I received 2 awesome ones. The cast was amazing and the message was real .So glad l bought it so I can check out again and again"}, {"id": 39, "text": "Why can't movies just be enjoyed for what they are. MOVIES!! It's entertainment. Lord have mercy with some of these reviews. This movie was different. Funny, sad and some crazy. But it was a good watch. Doesn't explain what was the cause but that was part of the message at the end."}, {"id": 40, "text": "This feels like yet another failed attempt to make a star out of Katherine Langford: someone wiser help her in choosing her projects...Indeed here, unfortunately, she isn't unforgettably sexy enough to make you forgive the emptiness you're watching; yet coupled with funny/Non-PC considerations, dialogues and circumstances our Junonic Katherine (and some beautiful songs) had me spending 1 hour here (1,5x speed ofc).But you're warned: unless you're really young (like 16...), or politically open-minded, or susceptible to young women charm, you will likely see this movie just for what it is: an uninspired, unneeded, technically mediocre, superficial, 5y expiration date, american teen romcom."}, {"id": 41, "text": "I like the idea of highschoolers spontaneously. Very witty!"}, {"id": 42, "text": "8/10 - unique teen drama has a nice underlying theme and ends with a good, timely message"}, {"id": 43, "text": "At Covington High School, teens are exploding for no reason. The film centers on Mara Carlyle (Katherine Langford) and her now found love in Dylan (Charlie Plummer). Realizing life is short they quickly become lovers and do drugs as their classmates explode around them. It could be worse. They could be Republicans as Mara jokes.It was a decent dark comedy as teens dealing with their own mortality. Mara provides a lot of first person narration.Guide: plenty of F-words. Implied sex. No nudity."}, {"id": 44, "text": "Its a really good take on what I think my generation feel and go through with mental health and other obsicatles we have to face with some light hearted humour too its worth a watch for sure"}, {"id": 45, "text": "It's not usual super hero movie, but really good movie. Intelligent, Good acting, If you love good movie experience, go for this one. Langford is an actress to watch out for talent. A teen movie with some sense. The creatures could make this into a tv series in future as the movie may seem too short."}, {"id": 46, "text": "I really enjoyed Spontaneous. After watching the trailer I knew what I was getting before watching. I did not expect to see such good acting and great screen writing. Anticipation builds anxiety throughout the film as though things could change any minute and of course they did. This made the entire movie interesting to me. Great ending where some movies fail."}, {"id": 47, "text": "It surely relates to the current situation the human race is in. But what it teaches us in the end is the most important life lesson you can learn that life is very cruel and spontaneous and it is your choice to sit and cry about it or move on with your life and do what you always wanted to do.The world right now need this positivity and need to know this."}, {"id": 48, "text": "The plot is quite original... I find an actress whose acting is quite good... She is damn hot too. And finally about the movie... It's enjoyable. I don't see movies for some holy messages. I am entertained by this one."}, {"id": 49, "text": "Ya RomComs are something I avoid at all costs. Theyre always the same and never ever anything that would play out in real life so why give you or your partner unrealistic expectations watching something that is just going to set you up for failure.. This movie SPONTANOUSly turned out to be something completely unexpected - REALLY Good and really funny. The romance part is underplayed and mostly the setup as an after thought for the perfectly timed witty one liners that are delivered spot on with real chemistry you can feel between the main actors. The movie is just a take on the traditional coming of age story and how everything when youre young seems like the end or the beginning of the world and with each death of a young persons dream life its never the end but just the transition to another dream of how life will play out.. I dont know if that makes sense to anyone reading this but it was a really great movie witty well acted and moves along at a good pace. It was this directors debut and I cant wait for more projects in the future to be made by them.. Great job"}, {"id": 50, "text": "The premise is interesting and it could have been decent if it wasn't emotionally flat, borderline badly acted and otherwise uninventive.They seemed to be attempting an 80's teen movie vibe but it failed on every front. Langford's performance felt forced and unnatural. She was trying to be a quirky, carefree teenager but her entire performance felt contrived.Piper Perabo and Rob Huebel playing Mara's parents were trying for some kind of cool parent vibe which floundered into emotionless, unfunny supporting roles.The standout was Charlie Plumber. When he was on screen there was some genuinely good acting and you could relax. If the rest of the movie was brought up to his level it would have been much better.The soundtrack was okay, although a little too on the nose.I found myself feeling repeatedly bored and struggling to pay attention. It also bugged me how Mara was always flawlessly made up, even when she was apparently too depressed to move or blackout drunk.I hoped everyone (or I) would spontaneously combust so the movie would finally come to an end."}, {"id": 51, "text": "I'm no teenager and wanted to watch a romcom just get some positive vibes after recently splitting up from a delusional liberal, borderline sociopath woman. Little did I know what expects me. Primary school guys calling themselves progressive when showing emotional support for their gay sports mate, main female protagonist asking the guy who has a crush on her to say I like cocks, the only good republican is a dead republican, etc.This is a movie for teenagers, so it's completely inappropriate to have this level of political brainwashing incorporated in it. Even adults have trouble understanding the dirtiness of current political affairs, therefore subjecting teenagers to such content can only be concluded as the willing indoctrination of specific values that their generation must uphold.Seeing with my own eyes how these themes manifest in a mature woman in her early thirties, I'm quite afraid how this kind of narrative seeding is going to affect the social cohesion of our societies in the future. And I hope you are too."}, {"id": 52, "text": "The story itself was actually quite interesting to me and I was invested in how it will conclude until the end. It also had me giggle in quite some scenes. The characters apart from the main character were fine, nothing really worth mentioning.The big problem I had is the main character. I get that it is a coming of age kind of story. And I presume it deals with the main characters struggles about her own future but why does she has to be so messed up. She seems to be raised well, but she constantly behaves like she was raised by drunk or neglectful parents. Turning to drugs and alcohol, not caring about anything and dragging her friend down to her level didn't fit. It felt like the writers desperately wanted to represent the funny-sad twitter-teens nowadays to a point where it just didn't make sense.Concluded I still enjoyed about 3/4 of the movie, the last 1/4 I was just getting through it."}, {"id": 53, "text": "Spontaneous is a combination of comedy, horror, romance in most bizarre way. It is one of the most original teen drama period. Kathrin Langford is on the roll here and carries most the movie on her own. Charlie Plummer gives brilliant performance as well as most supporting cast. This movie has got super funny dialogs and situations that are just laugh out loud.That being said, this movie felt like it was trying to be a satire first but along the way it transitioned into taking subject serious, which didn't always work. In fact, there was an event in the movie where I'd have been fine if it ended there and it'd have become best comedy I've seen all year. But they add further 30 mins on the aftermath where I felt like I was watching a whole different movie. Mind you it was good, but felt out of place. Imagine a movie with 1 hour Superbad vibe and next half hour Fault in our stars vibe.Still, this movie had laughing my a** off most of the time and I totally had a blast with it. 8/10"}, {"id": 54, "text": "The movie is 'OK'... it's an 'OK' comedy, and an 'OK' romance, and an 'OK' drama... it's not particularly good in either of these categories and especially for the 'drama' part of the film, it could have been much much better if it explores the main aspect of the plot more: What caused it? Why does it only affect certain people? How was it cured? If the movie didn't leave these questions unanswered then it could have flushed out the story of the movie much more and also focused more on the drama portion of the film.But those issues aside, the acting in the movie was actually impressive: Katherine Langford's performance was most impressive and Charlie Plummer as well did a very good job. I didn't expect such good performances from these two relatively unknown (and young) actors. So honestly, the acting in this movie isn't the reason why the movie was poor, it's the other aspects ie. plot, script, directing, length, etc.Overall it's an 'OK' movie to watch once... but it absolutely won't warrant repeated viewings. It's a shame, because the movie could have been 8/10 with just a few changes."}, {"id": 55, "text": "It's very rare for a movie to become a balanced mixture of dark comedy, coming-of-age, satire, teen romance, and some bits of sci-fi horror. Spontaneous (2020) manages to do just that.Written and directed by Brian Duffield (screenwriter of Love and Monsters &amp; The Babysitter) in his directorial debut, Spontaneous is gripping, engaging from beginning to end, and unexpectedly thought-provoking.Katherine Langford knocks it out of the park 👏. Her performance is the main highlight of this film. Langford's chemistry with Charlie Plummer is believable, and it made me genuinely care for these characters. Even certain minor characters made hilarious scene-stealers.The writing is witty, the editing was fast-paced, and the direction was energetic. If you've watched Love and Monsters, you'll definitely feel a similar vibe with this film. This is a profound heartfelt story of mortality, love, and uncertainty.Even though this film was shot in 2018, it somehow feels timely, and I'm surprised that it took this long for it to be released. My only nitpick is that a few scenes could have been done better, but it's still definitely worth watching."}, {"id": 56, "text": "Surprisingly original, literally explosive, heartfelt and fun; Spontaneous flips the switch on the basic rom-com and gives you something worth watching.In this dark romantic comedy, when students in their school begin to literally explode, two seniors struggle to survive in a world where each moment may be their last.Katherine Langford is the next best thing. Her performance is wise, strong and bad-ass. I can't wait to see what Langford does next. Charlie Plummer is endearing, and the chemistry between Langford and him is fiery. The film itself is great and unexpectedly refreshing, it will grab your attention from the get-go; you may need to see it twice. I loved that Spontaneous wasn't your conventional teen rom-com; it's something you've never seen.Follow @snobmedia for more reviews!"}, {"id": 57, "text": "* There is no end credit scene *The director Brian Duffield and crew brought a creative adaptation about life. The story sets when students begin literally exploding and two seniors struggle to survive while their love blossoms. One can't focus on the why because it wasn't important, the movie was about life, love, and friendship. A viewpoint of showing the fact that life is not fair, one has to make the most of it and always take risks because one will never know what could happen.The exploding scenes were thrilling it keeps one alert on who will be next and even though the significance of the story was straightforward from the get-go it was still entertaining to watch how everything unfolded. The approach of how love sparked was very awkwardly and cutely while their world was falling apart. Having said that the movie needed improvement, when the high point hit suddenly the scenes were dragging and it never recovered almost over repeating the point.The composer Joseph Trapanese brought the perfect music so down to earth, it defined life, love, and everything that surrounded the lives of these teens.The cast was solid especially the main female actor Katherine Langford. Her expressions of every situation were enjoyable and when she narrated the scenes all her emotions were felt. Also, the chemistry between her and Charlie Plummer was adorable."}, {"id": 58, "text": "First I want to make it clear, this is a well-conceived story, a different take on the coming of age of teenagers. Their pandemic starts when students begin to explode spontaneously, not like dynamite, more like a balloon pops, and blood is sprayed everywhere. The first one happens in class, others follow at random intervals in different places.National health authorities come in, isolate the students, try to find the cause and a treatment to prevent it. Some locals think it is caused by a demon. Meanwhile a shy boy and a gregarious girl take an unpredicted liking to each other but start to wonder how long they have to live.As too often happens in modern scripts the writer resorts to pervasive vulgar language throughout the movie. Not just a sprinkling but the girl protagonist is about the most vulgar student you will find anywhere. And it is totally unnecessary. It is poor script writing and it tarnishes what could have been a superior movie.My wife and I cringed at it while at home, on DVD from our public library."}, {"id": 59, "text": "Spontaneous - B+ (Memorable)Spontaneous uses it's exploding metaphor to school shootings around USA to full potential. Your best friends, classmates are dying and noone can do anything about it. Everyone thinks that something wrong with the kids, lock them up, take their phones away or put them on medication. Washington will look after them One day and that day never comes. They go back to same cycle till the school is not over and it is to be believed that everything will be Fine one day.I have to say noone plays a Teenager like Katherine Langford. She was fantastic in Thirteen Reasons Why and that's why the show connected with millions of people around the globe positively or negatively but it was due to her realistic portrayal of New Girl lost in new school. She is soo different from her role as Hannah and still she made it her own a teenager trying her best to deal with loss of her classmates. Charlie Plummer is a delight as always. You should watch him in King Jack and Looking for Alaska.On the whole, it's a unique take on a very serious matter and it makes sure to use it's platform to bring awareness and showcase the survival's grief which never goes away."}], "reviews_amount": 60}