{"name": "Diego Maradona", "titleId": "tt05433114", "reviews": [{"id": 0, "text": "To be honest, before this movie I thought I knew everything I needed to know about Maradona. However, after it finished, I was shocked and embarrassed at how much I didn't know. I actually had 0 idea about his life and struggles. This movie is not to make you feel sorry for him, because, we all can make good and bad choices when we are placed in front of a decision, but in the end, you can't help feeling sorry for him. This is a must watch for all football fans."}, {"id": 1, "text": "Excellent film, it truly depicted what Diego was, after watching it today after the news it left me crying. Thank you Diego."}, {"id": 2, "text": "'The price was just too high'. Diego Maradona, labelled the legend, god, hero and cheat in his lifetime -- is a man after all. The brain behind Senna and Amy -- Asif Kapadia's portrayal of a footballing genius' fall from grace, looks authentic and honest. Diego, for all his craft on the pitch, couldn't control his life off it. The Argentinian created an image, separate from his own, to deal with attention of the world. That part, eventually, became dominant, causing his downfall. Kapadia stitched together several unseen footage to show Diego's life exceptionally well. This is a must-watch."}, {"id": 3, "text": "A fascinating documentary dealing with the various facets of Diego Maradona who is undoubtedly an emblematic figure of the soccer world, like Pelé, Lionel Messi, Johan Cruijff, Franz Beckenbauer or (I'm French!) Michel Platini. We may see again, with an indescribable pleasure, the phenomenal ascent of this genius then the glory, in the 80s, with the Argentine victory at the World Cup organized by the Mexicans in 1986 and the very first victory of the Neapolitans in the Italian Serie A in 1987. Then, we sadly witness his descent into hell and the Italian ingratitude as sudden as pathetic. A sober and synthetic work about the extra-ordinary life of Diego Maradona."}, {"id": 4, "text": "One of the best autobiographic movies. It really deserves 10/10. Btw story of his life is really spectaculare and unique. DIEGO DIOS🖤"}, {"id": 5, "text": "If you like football, you'll like this movie. Diego Armando Maradona is for many the best footballer in the world. In this documentary you'll see his moments in the spotlight and the dramatic things that happened behind the scene. A beautiful and powerful documentary."}, {"id": 6, "text": "An absolute masterpiece of unseen footage, compiled to make a brilliant and heartbreaking story of Maradona's troubled life!"}, {"id": 7, "text": "Examines Diego Maradona's years in Naples to paint an impressionic portrait of this complex (brilliant and tragic) icon of football. Expertly crafted."}, {"id": 8, "text": "It deserves nothing less than 10 out of 10. A look at the personal life of Diego Maradona in a way that was never revealed before. 1986 Argentina crowned world champions for the second time and Maradona, the undisputed king of football. One man inspired a team to glory. Napoli was near relegation, a team that never won anything significant before, he single handedly took them to win championship after championship, and Serie A at that time was the strongest league in the world, everywhere else was farmer's. That's the ultimate greatness which cannot be measured by how many goals or assists, when he plays they win. It's an emotional ride. He paid a huge price for fame and glory. He was and still is a hero, he is the best there was, the best there is, and the best there ever will be. The King of Football."}, {"id": 9, "text": "It's hard to be Maradona, but someone had to do it ! 10/10 for number 10 !"}, {"id": 10, "text": "This picture not just about maradona as a soccer player, the movie belongs to humanity's spirit."}, {"id": 11, "text": "As a footballer, he was in a different category altogether. So full of skill and passion... capable of miracles like taking a mediocre team to the pinnacle.As a person, impossible not to relate too and ultimately to love. The story of Elvis Presley, Morrison, Janis and many others who shone very brigtly at a huge cost.The film is excellent and helped me understand this very complex character. Highly recommended."}, {"id": 12, "text": "A compelling documentary. Really shows the adoration of the man himself and the power that football has to shift the mindset of the community. The film focuses mostly on his time at Napoli and I had very little Idea about what happened when they signed him. Certainly worth a watch"}, {"id": 13, "text": "Absolutely wonderful! A beautifully honest portrait of the best football player ever - with the good and the bad. Fabulous music by Brazilian composer Antonio Pinto, wonderful remastered pictures from the 80s and perfect pace. This is the best I have seen in years. I highly recommend this for any football fan."}, {"id": 14, "text": "The movie takes through Maradona life journey and clearly shows the evolution of the player, person and father..... a life lesson....once you are popular the world is behind you but once you fall only the close ones remain..."}, {"id": 15, "text": "As a football (soccer) lover, I really enjoyed this movie. A very touching documentary about the greatest player in the history. I totally understand why the rating is 7.8 and not 9.5. Simply because you have Brazilian fans, Messi's fans, English fans and almost half of the world hating Maradona for obvious reasons, because he was too good and very charismatic."}, {"id": 16, "text": "One of the best movie biographies I ever watched....all the scenes are real from the past time.Maradona is much more greater player than Messi Ronaldo...in his time there are no yellow and red cards for foul...only if you injured player for months...The Music is one of the best I ever listen to a movie,,,very emotional ,I hearing almost every day..."}, {"id": 17, "text": "This is the only documentary I have ever enjoyed. Normally I find documentaries really boring. I WANT THE ACTION! I'M NOT AT SCHOOL, AM I? I found this documentary really entertaining, as it is about something I actually like: football. This director has previously made Senna and Amy. I saw Senna and I wasn't interested. But I saw this and I enjoyed it. It really went into depth about his life and his background, and I was fascinated. There is blood when they talk about his ankle injury for Barcelona, and when they talk about the Mafia. Those parts are particularly gory. There Is plenty of swearing, and only 2 sentences are spoken in English, meaning the rest has subtitles. 9/10."}, {"id": 18, "text": "Actually focuses on his career, which gravitates around Napoli. Lots of footage from the time, covering all the ups and downs, magnificently put together. What a player, on the field, one we're not going to see that soon again."}, {"id": 19, "text": "Ho visto Maradona (I saw Maradona) The best footballer I ever watch on a pitch I can assure that this documentary describes how the poem started, how it continued and finally how it ended, it is extremely realistic. Thank you Diego, I can tell the full story to my daughter, the fabolous Italian '80s, and she will tell to her sons that her grandfather saw Maradona"}, {"id": 20, "text": "After the sad news of the passing of the Best Player of all time. I decided to watch this movie. It took me back to 1980s and made me live those moments as if it was today. Diego has been through difficult times but that didnt stop him from winning trophies with a team that was almost relegated. Rest in Power Diegito!"}, {"id": 21, "text": "Really enjoyed this film. The end is weak and rushed but the first 80 minutes are fabulous Will watch it again"}, {"id": 22, "text": "Brilliant archival footage used to help tell this story, I think Kapadia scores another goal with his 3rd documentary. It is difficult to watch such a talent fall the way he did, but I believe this film helps to showcase some of the reasoning for it - the claustrophobic and trapped life he had to lead because of his immense talent being one of these. I agree with a previous review wishing Diego to have been more involved, it would have been good to have more commentary from the legend himself."}, {"id": 23, "text": "I really enjoyed the fusion of Diego the lovable rags to riches genius and Maradona the privately addicted playboy . Some of the footage is remarkable and asif kapadia nails it AGAIN . Enjoy !!"}, {"id": 24, "text": "This documentary touched my heart, Diego Maradona had nice and hard moments in his life, but drugs is the worst way to choose, my friend. Is not just that Italians were very bad with Maradona because he did all the best for Napoli.Be strong!"}, {"id": 25, "text": "The sad truth of the football great known as Maradona! And the background story of the man named Diego."}, {"id": 26, "text": "As Argentinian myself i really enjoyed the movie. I was in love with many moments, love the documentary. Amazing."}, {"id": 27, "text": "Superb, simply superb. I'm not the biggest football fan in the world but this movie is in my top 3 of the year so far. Loved the music, editing, interviews. An excellent movie on one of the greatest footballers ever"}, {"id": 28, "text": "This story shows he was a good man once and how great he was when he was younger and how he was vilified in Italy as well as England due to his Worldcup actions. This documentary shows the rise of Maradona from humble beginnings to greatness and through hatred to redemption. After watching this i thought he was a good guy in the beginning and fame, power, and money corrupted him. He survived and found redemption, even meeting the son, which he always denied was his. I would have liked to see if he did serve time for his crimes or not as documentary seems to skip to 2004 without notice. He did served 2 years 10 months in jail and then signed for 1992-1993 Sevilla and then two clubs in Argentina 1993-1994 Newell's Old Boys,1995-1997 Boca Juniors."}, {"id": 29, "text": "I love senna and maradona. im 40 so i grew up with them. the problem here is not enough info about football. its coke, pregrnancy, malvides and crazy napoli fans. the director choose to emphasize in napoli years (6 1/2) but with senna we saw the whole 10 years with every detail. i dont care how maradona plays with his daughter, all parents love their children. but if you have to put it do a 3 hour docu. he misses great games like quorter finals with brazil in 90 and the oppening match with cameroon. the whole 88 season never mentioned, a year when napoli collapsed in the final rounds, or 89, a year when inter look unstoppalbe... not even the poor results in champions league and copa america! the team players are not mentioned nor the rivals like milan with holland players or inter or juve. bottom line maradona is too famous to make a docu about how semifinals with italy in 90 ignite the downfall of him and how he rise to stardom 4 years earlier. so its for younger people only or for those who dont know the life of maradona, but if you dont the book is much better!!!!"}, {"id": 30, "text": "The hole documentary is brilliant. Best football documentary I've ever seen . Maradona is a true footballing god!"}, {"id": 31, "text": "This documentary really moved and shocked me at the same time. It's not only hard to see how Diego Maradona is rising and falling as a sportsman as well as a human being, but the hardest part was to watch how others acted. The press, the president of his soccer team, the people of Naples, the fans of other teams during the matches... It shows how two-faced people are. One day they love you and treat you like a god - the other day they want to chase you out of the country. It also shows how a great football player slowly descends into depression and into addiction. This film should be shown in schools because it teaches you a lot about hate, discrimination, wrong decision making, the media and how chosing the wrong circle of friends can ruin your life. Very well done."}, {"id": 32, "text": "I'm not a football fan but I appreciate people's talent, passion and perserverance. I've seen 1000+ movies, have rated more than 500 of them but only 3 of them got the rating of 10/10 - this is one of them. Hope this shows how important this movie is. If you think it will only show some old football footage mixed with cocaine scandals you are very wrong. We have a chance to see many layers of Diego Maradona's lif; his background, his struggles, his weaknesses, his victories and beyond-human desire to win and proove people wrong.It is a tragic story showing once again that people are just mostly pure evil. Without thinking twice they ruin someone's life because he did one thing against their will and forget about all the success, joy and emotions he brought them."}, {"id": 33, "text": "I watched this documentary after the sad news of Diego Maradona's passing last week even though friends had told me to check it out way before as I love football even though the club I follow has a great history and tradition but been starved of any significant success in recent times(not for the want of trying though I may add).. From the opening couple of moments I knew this was gonna be emotive viewing but really didn't understand the levels it would take me to over it's duration. Anyone with a heart will emphasise and feel nothing but anger/sadness and dare I say disgust at the way this man was treated by the very same people that didn't give him a moments peace or any time to himself due to the depths he dragged himself and his battered body and his club to, to achieve the impossible dream..He gave his all for the cause and the way the city of Naples and Italy turned their back on him left me cold. The callousness and ruthlessness at the dark arts in bringing him down is mind blowing. I don't wanna say too much more as I don't want to spoil it! One of the best and heart wrenching movies I've ever seen (let alone sports documentaries).. It's made by the same people that bought us Senna and Amy and I'm looking forward to what they serve us with next."}, {"id": 34, "text": "A truly gripping story which gives you an insight into the life on and off the pitch of arguably the greatest footballer of all time."}, {"id": 35, "text": "I can't believe this is only 7.7 as an Englishman of a certain age I absolutely hated Maradona but after watching this I've completely changed my mind. Such an emotional piece of film making. A masterpiece"}, {"id": 36, "text": "This documentary shows his life behind the scenes, the insanity and obstacles he faced during his time at Napoli and rise to fame. It only makes his achievements that much greater.Great unseen footage, commentary and moments shown throughout.The best player there ever was"}, {"id": 37, "text": "This is a great film, very much in the vein of Senna but with a very different story to tell.The film focuses on Maradona's time at Napoli and the highs and lows of that part of his career and life.It really gives great context to the man, what he achieved on the pitch and what he went through off it.Every football fan should watch this, to remind older ones of his genius and show younger fans what it was like to be a creative player when pitches were poor and tackling was X rated!"}, {"id": 38, "text": "Great documentary narrated only by authentic audio &amp; video clips. It reveals how Maradona cheated his whole career playing doped. Still, great authentic game highlights in HD quality. Definitely worth watching."}, {"id": 39, "text": "Maradona was a good story to tell for those who did not know his story already. All archive footage, we see the highs and lows and the reasons why the man is perceived the way he is. He is a genius on the park with several issues off of it. We see that he is human, just like the rest of us. He was trying to escape a trapped situation which began to escalate. I feel more personal interviews with Diego would have added far more drama and gave a more personal touch to this documentary. I would recommend this to a friend who was not already familiar with Diego's story."}, {"id": 40, "text": "This was an enjoyable watch at a preview in Wimbledon (which part of London rather unexpectedly gets a mention in the film) but the build up to the release of this film suggested that there would be a lot more new information and revelation about Maradona, but this was not the case.We see a great deal of footage and photographs of Maradona's life on and off the pitch that has appeared before, for example in Maradona D10S, Maradona the Myths of Sport and the BBC's A Special Report on Maradona from back in 1994.The new documentary seems to be more of a collage of pre-existing material than a fresh look at the player and the man.Maradona is one of the greatest players of all time and has lived a life steeped in controversy and so films about him are an attractive prospect, but whilst I enjoyed the film, I was disappointed to note I had already seen most of what was on offer."}, {"id": 41, "text": "One of the best movies I have seen about Diego Armando Maradona. It worth to be seen"}, {"id": 42, "text": "The Man behind the myth, the myth behind the legend. Extraordinary documentary about the behind the scenes life of Diego... Must watch to understand why he was who he was... Diego ok one side and Maradona on the other..."}, {"id": 43, "text": "Maradona was clearly a massively flawed character but was also one under constant pressure and perpetually manipulated by people around him. Many consider him to be the best footballer of all time but I think if he played in the modern era it would be indisputable as he'd have better protection both on and off the pitch and his talent wouldn't have been curtailed. Asif Kapadia does a great job of capturing the genius and sadness of the man."}, {"id": 44, "text": "The best movie about Diego! So amazing, full of sport, historia and politics."}, {"id": 45, "text": "Great documentary about the greatest footballer of all time. I was 14 in 1986 and I watched Diego, he made me fall in love with football. He came from a very poor background and made his way to the top."}, {"id": 46, "text": "The first World Cup I remember was 1986 when I watched Diego Armando Maradona carry an average Argentina team to win the tournament. The following year he did the same for his club side Naples. A genius on the ball and the main man, he was my first footballing hero! This film opened my eyes to the price he paid for his fame, some of the footage is incredible giving you a real insight into the constant pressures he was under. R.I.P Diego, a true footballing genius!"}, {"id": 47, "text": "Football is a game of two halves (now with 10% extra free thanks to VAR), and the career of Diego Maradona is one remembered largely due to two goals. With the third of his trio of documentaries about famous people, director Asif Kapadia portrays a man of two personas.Looking mainly at his time in Napoli (during which essentially all the things we know of Maradona happened), the opening credits show his motorcade to Napoli's Stadio San Paolo intertwined with clips summarising the first eight years of his career through Argentinos Juniors, Boca Juniors and Barcelona, in all its knee-to-the-head glory. There's probably a story to be made of these years as well, but this is not the time.We are then introduced to the first persona of Diego: the fifth child of a poor family in Buenos Aires, living in a one room shack. At 15, he signs a contract with Argentinos Juniors and has a one-bedroom apartment bought for him by the club. His family move in and he becomes the main bread-winner for a family of seven as its youngest member. What then happened to the young player in Argentina and then Spain is ignored. Instead, we are taken to a 23-year-old being mobbed as he enters Napoli's stadium to dozens of thousands of baying supporters waiting to see the world's most expensive player kick a ball.He seems a fairly meek man, dealing with difficult questions with a little awkwardness. His introduction to Italian football is a difficult one: Naples seen as the sewer of Italy and hated by the teams from the north, it takes a while for the goals and the wins to come. But after a mid-table finish, the years soon bring with them success on the pitch - including that World Cup win in Mexico - but see the birth of Maradona.His connections to the Camorra see a party lifestyle with late nights of cocaine and women. Affairs and an illegitimate son come before the birth of his daughters, living half of his life as a celebrity - if not god - and the other half training to burn ready for Sunday. The on the field success continues for a while, but it clearly takes its toll on his body, growing bigger as the years pass. With Napoli already a city and club disliked by fellow Italians, Maradona as its poster-boy is likewise. Italia '90 comes and brings a semi-final held at the Stadio San Paolo: Naples' nation plays its god. He scores his penalty in the shoot-out, helping to send the hosts out, in, for him, a damned if you do, damned if you don't move.Overnight, all support for him disappears. The infamous booing of the Argentina national anthem in the final prompting cries of abuse from the captain. The final lost, he has little to go back to Naples for. His nose cocaines abuse and womanising are exposed, coming with an unprecedented ban. His time in Italy, and essentially his career now over.As a British person, I obviously despise all other nations and races and as such my opinions of Maradona are pre-determined by an act which occurred when I was 2-years-old: the fat, cheating cocaine addict. But Kapadia has some sympathy with one-of-two-of-the-best-Argentine-footballers of all time.While not focusing on it, he makes the point that he was a young man put under a lot of pressure to support his family financially. Then, for a city infamous for its poverty at the time, he is the world's most expensive player with the whole population depending on him to give them something to live for on Sunday. Coming close to being a living god, he delivers the promise of footballing success, but as such is hounded everywhere he goes and is a play thing for the mob. These demands see the more timid Diego create the Maradona character as a coping strategy. A clip of Pele stating he lacks the maturity to be the best player in the world is perhaps telling. But, with Pele playing in a different era, Maradona had the problems now seen in Messi's tax scandal or Ronaldo's rape accusation that come with the tag of best player in the world. Lest we forget that first player to win PFA Player of the Year in the Premier League era was a known alcoholic. Maradona, therefore, is not too different from any other modern great in coming with countless problems.Football, however, is a lover of talking points and controversy (hence why VAR will both create new talking points but remove moments of beauty). And making a documentary to paint a picture of a player most people have already determined their opinions of is a challenge. Kapadia creates a portrait of a young man put under immense pressure who created a second persona to cope with it.But, you do feel there could be some more to the storytelling to further this. His links to the Camorra are largely looked at in terms of cocaine supplies and using him as a celebrity endorsement. The extent of their grip on him is not fully explored to see if this was a genuine prison for him, or something he could have fled at any moment. The nature of his signing as well is left largely untold. Here is the most expensive deal ever to happen in football to a team with few prospects in a city with a poor economy. Who financed the deal would also tell more of the exact nature of his relationship with the city as a whole, not just as its best player.This is perhaps a fault of Kapadia's style: as a pure archive footage documentary, with voiceover interviews from those involved, the opportunity for analysis isn't particularly afforded. It is more show and tell. With a running length of 90 minutes plus extra time, we are largely treated to Match of the Day highlights, only with less Gary Lineker. This can, even as a beautiful game (Villa fan) follower myself, be a little draining in terms of entertainment value.But the barrage creates an intensity that feels appropriate to the six years the film largely covers. A whirlwind period of success with added cocaine, you get a sense of the passion, intensity and lastly hatred. As such, we gain a sympathy for him as a person, a sense of the pressures he was under, but only part of the story. More sympathy might be gained if learning more about the younger Diego; though less sympathy may be afforded if we didn't have a three decade gap in the story of his relationship with his illegitimate son. Archive footage always brings with it selectivity.But what the footage does show is a player who could waltz passed defences at a time when defenders could slide tackle with the subtlety of a tank and how perhaps England also had some hands to play in that quarter final. He led teams with limited talent to major success, and so his tag as a true great cannot be denied.So, does Kapadia succeed in his attempts to shed new light on a pre-determined figure? Well, to some extent. It is difficult to persuade any football fan as to their feelings, and Kapadia does go some way to creating some sympathy for the much vilified footballer. The footage available both on and off the pitch is used to good effect, as well as interviews with the man himself overlaying it. But with documentary focusing on a period rather than a lifetime, you do feel that there is more story left to tell.politic1983.home.blog"}, {"id": 48, "text": "Whilst I enjoyed this latest documentary by the director who brought us Senna and Amy, I was never totally gripped. And I love football. I've never been a motor racing fan, nor particularly familiar of the music of Amy Winehouse. Why then did I find did I find Diego Maradona less enjoyable than Senna and Amy? I think it was because there was nothing particularly revelatory about the story of Maradona - I was a teenager of the 80s and a football fan to boot, and nothing totally surprised me with this film. An enjoyable if unremarkable 6 out of ten"}, {"id": 49, "text": "...as someone else said Maradona can only have 10, i agree and ideally that's is my vote. but in this doc there is a lot missing ...i.e. world cup 1994 in the u.s. (where he was tested positive ...and maybe/probably it was a conspiracy against him) etcetera....&amp;tc"}, {"id": 50, "text": "Good doc on the life of Maradona, one of the best football players ever. It is told only through archival footage, making it an incredible ride through the star's best years. It's amazing what the director managed to pull off, because it must not be easy to tell a story using only archival footage, but Asif Kapadia did just that and he managed to keep it interesting for the duration of the doc. It does have its disadvantages because sometimes it feels a bit incomplete, focusing mainly on the Naples years there are many important facts that are barely if ever mentioned, like the tumultuous years in Barcelona, or the DQ in the 94 World Cup. Maybe the footage wasn't good enough to make it in the film, maybe it was a creative decision to cut on time, but it does feel incomplete. Nevertheless any football fan will love this movie."}, {"id": 51, "text": "I witnessed him play for Napoli , he was and still is our god of football, hated and loved because of his pure brilliance on the pitch! It saddened me he was never strong enough to handle the pressure off the field!! D10s the best player ever!!"}, {"id": 52, "text": "I had pretty high hopes for this after Kapadia's previous outings with Senna and Amy. Diego Maradona doesn't quite hit those heights... but it's not far off. Made up of archival footage (this seems to be Kapadia's preference) it tells Maradona's story exceptionally well. Diego himself narrates a lot of it and that helps tie a thread through the footage, but the lack of talking heads really helps give Kapadia's work a more cinematic tone. The footage has been lovingly cut, graded and crafted. I'm sure some of the sound is added foley, but even that feels authentic and that's a good summary word for this, authentic. Honest and truthful, it pulls no punches. I thought I knew a lot about this decisive football icon, but in true great documentary style, this reveals a whole lot more. Whether you like Maradona or not, or like football even, this is a compelling film and a must watch."}, {"id": 53, "text": "Lets start by saying that this Documentary is very good. Diego Maradona the man is seen as 2 different people, it's great to learn about both. I had known about Maradona the footballer only through highlights and press but now i know just how incredible he really was. we see this truly inspiring figure rise &amp; fall, this also felt like a great Film Noir with the story of the man that was very compelling"}, {"id": 54, "text": "I do not care how well a doc this is - it is glorification of a person who was a drug cheat. Only after he leaves this earth will the truth start to come out and when it does it will be a waterfall. Maradona was removed from the 1994 World Cup because he had tested positive for five variants of ephedrine - anyone who thinks he was not taking drugs for years is a fool."}, {"id": 55, "text": "I went to see this with some trepidation. Maradona's story has been told many times, and his downfall has always been one of the saddest of football stories, This documentary however benefits from the previously unseen footage and I found it an interesting, and slightly different, insight into one of the worlds greatest footballers......and for me it told me a great deal about the Italian mentality as much as it did Maradona's troubled soul........ and I'm still spending hours in the garden trying to do keepie uppiess with my heel."}, {"id": 56, "text": "Asif Kapadia's documentary fails to be insightful or evocative in my opinion. And doesn't reach the heights of Senna or Amy.If you're a football fan it doesn't provide anything particularly new. And yes he was out of his depth with the Mafia, and the Neapolitan passion terrifying at times. But he's still spoilt and unlikable."}, {"id": 57, "text": "Maradona was a good player, not better than Pelé, but this film is no good."}, {"id": 58, "text": "I would assume that most people will remember the footballer who is the focus of this documentary feature because of his infamous foul, it is certainly the reason I know him. It was sad news for many football fans across the world when it was announced that he had passed away aged 60 from a heart attack, so shortly after his death, I felt it was right to watch this film and find out more about him, directed by Asif Kapadia (The Return, Senna, Amy). Diego Maradona documents and centres around the time the Argentine footballer transferred from FC Barcelona to S.S.C. Napoli in 1984, and his progress throughout the many games he played, including the 1988-89 UEFA Cup, and of course the World Cup. Maradona is most famous for the Argentina v England quarter finals match during the 1986 FIFA World Cup, and his unpenalized handling foul. He was caught on camera during the match scoring a goal with his hand, but the referee did not witness it, and no action was taken; he famously referred to this as the Hand of God. This film consists mostly of stock and archive footage, including unseen material, of Maradona on the pitch and behind-the-scenes, he also voices his own story throughout, but there are no onscreen interviews. It is a different approach, to see the story of legendary figure with just footage and voiceovers, I do wish they had covered the Hand of God incident a lot more in depth, and I am not going to pretend I know or care about much to do with football, but otherwise, it is an interesting enough biographical documentary. It was nominated the BAFTA for Best Documentary. Worth watching!"}, {"id": 59, "text": "I first heard of Diego Maradona after Argentina won the 1978 World Cup.There was a lot of talk of some 17 year old youth in Argentina who was destined to become the best player in the world.Asif Kapadia's documentary charts the rise and fall of Maradona from the slums of Argentina to his uncertain couple of years in Barcelona. Injuries meant he failed to set the footballing world alight.However his move to Napoli to the south of Italy, to a team that did not rank among the Italian giants of football. Maradona became a talisman. His passion and skills took them to two league titles and a UEFA cup win. It is here the documentary portrays a man who could lift not only his team but an entire national side.For the Argentinian national side. Maradona was both hero and villain as they won the 1986 World Cup. His 'Hand of God' goal against England marked him out as a cheat. Although you have to wonder what was the referee and the two linesmen were looking at. His second goal was pure artistry, even England midfielder Peter Reid could do nothing but gently jog behind him and watch!After that Maradona was part of the sporting elite. He mixed with the wealthy as well as the infamous crime gangs of Napoli. Those criminals provided him with cocaine and protection.It might had been an open secret in Napoli of Maradona's partying lifestyle but he passed every drug test.After the 1990 World Cup held in Italy, when Argentina knocked Italy out. The Italians were less forgiving. Even the locals in Napoli turned on him. He failed a drugs test and Maradona knew his life was over in Italian football.Kapadia's documentary has plenty of archive footage with interviews from Maradona, his ex wife, his personal trainer. His ex wife seems to have little of substance to say about his extramarital affairs and his illegitimate son.There was a greater focus on his Napoli years. The turbulent time in Barcelona was skimped over. Also nothing of Maradona in the 1994 World Cup where he failed another drug test.The documentary ends with a bloated Maradona in 2005 giving a television interview, brought down by years of drugs and alcohol abuse. Kapadia wanted to show a man always fighting the system with whatever means. Fair or foul."}, {"id": 60, "text": "In his third feature-length documentary, director Asif Kapadia turns for the first time to a still-living subject; arguably the greatest footballer to ever lace up a pair of boots, Diego Maradona. As famous for his on-field brilliance as his lavish lifestyle and volatility off the pitch, Maradona lived (and continues to live) his controversial life very much in the public eye. A complex web of contradictions (religious but hedonistic; humble but arrogant; frugal but materialistic; respectful but condescending), he is depicted as uniquely and supremely talented, but unable to handle the fame.An important connection between Kapadia's three subjects (Ayrton Senna, Amy Winehouse, and Maradona) is that all three were destroyed, one way or another, by their talent - Senna died in a Formula 1 crash aged 34, Amy Winehouse succumbed to alcohol poisoning aged 27, and Maradona became a victim of his own success; in the prime of his life, his career imploded amidst legal trouble, vilification in the press, controversy on the field, an illegitimate son, cocaine, bans, and association with the Camorra. Somehow, he survived it all, going on to manage several teams, including his beloved Argentina, and although the film ends on something of an unnecessary downer, and although the narrow focus on the period from 1984 to 1992 will be sure to disappoint those looking for a more conventional overview, the fact is that it's in those few years where the legend was born, where it reached its apotheosis, and where it ultimately self-destructed.Made with the cooperation of the man himself, Kapadia was granted access to Maradona's personal video archives. This is actually the second time a documentarian filmmaker has been allowed into the archives; the first was Emir Kusturica, whose Maradona by Kusturica (2008) is a more conventional bio. Wisely, Kapadia only uses footage which Kusturica did not, so there's no overlap between the two films.Kapadia and his regular editor Chris King begin the film with some brief biographical material about Maradona's childhood and early professional career, before focusing on some of the major events from 1984-1992 - his arrival at Napoli for a then world-record fee of £6.9 million, when he was welcomed at the Stadio San Paolo by 85,000 fans; his disappointing first season; the 1986 World Cup, in which he scored both the greatest goal of all time and one of the most controversial, leading a very average Argentinian squad to victory; the birth of his illegitimate son, Diego Sinagra; Napoli's first ever league title in the 1986-1987 Serie A season; his growing association with the Giuliano crime family and his spiralling cocaine addiction; Napoli's second Serie A title, 1988-1989; their first European title, the 1989 UEFA Cup; the 1990 World Cup, in which Maradona found himself lining out for Argentina against Italy at the San Paolo - a high-pressure situation that wasn't helped when he said in an interview before the match that Naples wasn't really Italy, and he expected the Napoli fans to cheer for Argentina rather than their national team; his vilification in the press after scoring a key penalty; the Napoli fans turning on him; his April 1991 arrest and 15-month suspension for testing positive for cocaine; his low-key departure from Napoli in 1992.One of the things the film does exceptionally well is simply to remind us just how insanely talented Maradona was. Never the finest physical specimen, as is mentioned in the film, his greatest asset wasn't his acceleration and speed, his difficult to disrupt low centre of gravity, his physical resiliency, his dribbling ability, or even his fabled left foot - it was his brain. His genius was not unlike that which one finds in chess grandmasters; whereas his opponents and teammates could look at a situation and calculate where the ball might be in five seconds, Maradona could look at that same situation and know precisely where the ball would be in ten seconds. His bursts of speed were unlike anything the sport had ever seen, nor has there been anything comparable since, but it wasn't just that he could waltz past defenders like they weren't even there, it was his ability to choose exactly the path he needed to take to put himself in the best possible position after he'd passed them.As one would expect from Kapadia, the film's aesthetic design is exceptional. The opening scene is especially attention-grabbing - set to a pounding disco soundtrack, the film begins with what appears to be a car chase through the streets of Naples. Racing through narrow streets at breakneck speeds, the scene is shot from within one of the cars, and is intercut with snippets mapping out Maradona's childhood, his ankle break in September 1983 whilst playing for Barcelona, and his departure for Napoli in 1984. In this sense, the montage and the 'car chase' dovetail into one another, because what we're actually looking at is Maradona's first arrival at Napoli. It's an unexpectedly frenetic opening to a documentary about a footballer, speaking subtly to the excess and fast living to come.Unlike both Senna (2010) and Amy (2015), Diego Maradona includes both first name and surname in its title, and whilst this might seem like a superficial element, it's actually of huge thematic importance. The film's central conceit is that Diego Maradona was two personas; the quiet, unassuming street kid who just wanted to help his family and have fun (Diego), and the global superstar, with a different Rolex for every day of the week (Maradona). The film posits that Maradona was a construct built by Diego to help him deal with his fame. The problem, however, as several people attest, was that over time, Maradona began to take over from Diego, even away from the cameras, and as Diego receded further into the shadows, Maradona became increasingly unpleasant and self-absorbed. It's a fascinating way into his psychology and a deceptively simple bit of psychoanalysis.Perhaps wisely, Kapadia doesn't focus on any one incident as breaking Maradona, suggesting instead that his illegitimate son, the 1990 World Cup, the cocaine addiction, the Camorra ties, the suspension, all had a cumulative effect, and it was the totality that nearly destroyed him. However, Kapadia is clear that the downward spiral began in 1986 with the birth of Diego Sinagra, whom he wouldn't acknowledge as his son until 2016. Drawing attention to the media frenzy that resulted, Kapadia draws attention to the fact that his wife, Claudia Villafañel, was pregnant with a child of her own during the scandal. In relation to the Argentina-Italy game, whilst Kapadia is unequivocal that the Napoli fans overreacted, he is also clear that Maradona's calamitous pre-game interview didn't help. In this sense, although Kapadia flirts with the image of Maradona as a man betrayed by an intrusive press and a fickle public, ultimately it presents him as neither hero nor villain, but as someone caught up in a hurricane partly of his own making.In terms of problems, perhaps the most obvious one is how narrowly focused the film is, with a good 90% set during his tenure at Napoli. For example, the film barely touches on the infamous brawl that Maradona instigated (albeit after he was incessantly provoked) in the 1984 Copa del Rey final contested by Barcelona and Athletic Bilbao, a brawl which involved every player on each team, most of the subs, many of the coaching staff, and even ground staff, and which resulted in the fans throwing objects at the players and at one another, ultimately resulting in 60 injuries, all in front of King Juan Carlos I. Some footage is shown, but there's no context. There's also only the briefest of mentions of the 1994 World Cup, when he failed another drug test (this time for ephedrine) and was sent home in disgrace, never to play for Argentina again. Likewise, there's nothing whatsoever on his coaching career, during which time he took Argentina to the 2010 World Cup. The film also ends on an uncessarily downbeat note, with Maradona overweight and disillusioned, tearfully confessing his many transgressions on Argentinian TV. Such an ending was entirely avoidable given that the man is still alive and seems to be holding his demons at bay.This aside, however, Diego Maradona is another exceptional documentary from one of the world's finest documentarians. The trump card is splitting Maradona's persona into two constituent parts, mapping out the difference between the person and the cult of personality. Avoiding hagiography, the film paints him as far from perfect, but so too is it a fitting tribute. A man whose hubris and arrogance nearly destroyed him, nothing he did off the pitch will ever nullify his perfection on it. Ultimately, the film is about how exceptionalism can corrupt, with every misstep he made writ large for all to see. Kapadia translates his chaotic career into compelling drama, telling a story about an individual genius which speaks to the volatility and fickleness of fame. But more than that, it charts what can happen when these two elements combine, creating a perfect storm that may allow for moments of transcendent brilliance, but which ultimately exacts a very steep price."}, {"id": 61, "text": "So, Napoli and a lot of the south of Italy is basically run by gangsters, yet the legal authorities chose to go after an Argentinian footballer who had been responsible for the sewer of Italy* winning its first football title in forever. What a sack of ungrateful creeps! They should all be so ashamed of themselves. When Argentina eliminated Italy in Napoli, did the Italians expect Maradona to take a dive?Maradona wasn't driven out of football through his own excesses, it was the vengeful Italians who killed his career when he still had many years left to play. It's sad to think about what else he could have achieved in the sport had they not vilified him in the city that he had almost single-handed raised out of its nadir.I hope Italy never wins another title. They don't deserve it. I was so happy when Spain eliminated them in penalties in the 2008 Eurocopa and then humiliated them in the Eurocopa final in 2012.*The sewer of Italy describing Napoli aren't my words, but those of other Italians mocking this city considered a backwater (or much, much worse) before Diego Maradona raised its prestige through his play on the pitch."}, {"id": 62, "text": "Increasing his reputation as one of, it not the most accomplished biopic documentarian's working today, Asif Kapadia once more illuminates and unpacks a world renowned figure in the form of Diego Armando Maradona in stunning fashion for this HBO backed documentary that is a must-see for fans of football and movie lovers from across the globe.As he did so expertly for the BAFTA winning Senna and the Academy Award winning Amy, Kapadia steers clear from talking heads and one on one interviews to instead utilise hours upon hours of footage made up of news stories, home videos and previously unseen captures of his subject, as he focusses on Maradona's eventful career period in the Italian football league during the 80's and early 90's, that saw the once in a lifetime talent achieve the highs and lows of an industry that at one time saw him as a God amongst men.Kapadia's style creates an immersive and gripping vibrancy for the viewer and his ability to be able to hone in on his subject and weed out any unnecessary facts or side-plots ensures that we are transported back to a time and place in Maradona's life that needs to be seen to be believed.This documentary isn't interested in examining every minute detail of Maradona's upbringing or rise up the ranks to become one of the most well-known sporting figures ever seen but it's helpful for Kapadia's investigation into the defining time period of Maradona's career, as we are given a profile of a man who came from nothing to achieve both greatness and great sorrow, a man battling with two separate characters, the Diego he started out as and the Maradona he slowly morphed more and more into as his life took many twists and turns.Maradona makes for a fascinating subject matter, an at times relatable and likable figure that also can be detestable and unsavoury in equal measure, what we are given is a figure placed in situations that are almost entirely unfathomable as nations and millions upon millions of everyday people placed their trust and adoration on a man that at the end of the day just wanted to kick a soccer ball around as a means to escape a previously impoverished life.The footage Kapadia has managed to get his hands on and the way in which he and editor Chris King collate it is some of the most expertly produced material you're likely to see and it helps create a quintessential examination of a human being that was never going to be able to remain completely sane and untouched by the otherworldly like treatment he received as one of the greatest sportsman ever to have lived.Final Say -Painting a fascinating picture of a figure that remains larger than life, Diego Maradona is a moving and powerful documentary that acts as a quintessential examination of the rise and fall of a man that became a God too many.4 ½ pieces of Puma clothing out of 5"}, {"id": 63, "text": "So last week the world was given the news that Football legend Diego Maradona had passed away at the age of 60 and it has had a big impact on the football world. I am a huge football fan but I think being a younger person I have never fully understood just how important Maradona was, I knew he was a great player and he scored a goal with his hand against England but I neglected everything else and now is my time to catch up. So I started with watching this documentary called Diego Maradona that came out just last year so is a pretty modern telling of his story and here is my review for it.So first things first is Maradona on the pitch and this film does a superb job of showing just how talented a player he was, some of the things that he does is outrageous and compares to players like Messi and Ronaldo now. The film also does a great job in showing how football has changed, the tackles he receives is absurd and the pitches are terrible showing just how gifted a player he was.Over the last week we have seen the whole country of Argentina and the city of Naples in huge mourning over Maradona and this documentary does a great job in showing why. He basically won the world cup on his own for Argentina and won the Italian League twice for Napoli, you really understand why these people saw him as God, he was easily the best player and he was treated like it.The film shows that there were two different people Diego &amp; Maradona and from what we have heard in the last week that was true. Diego was a innocent and nice person who was really easy to get along with but Maradona was the winner, the man who has to push himself to be the best and become the best player that he can possibly be and the film documents that well.Maradona has plenty of demons that is clear and the film does a pretty good job and doesn't ignore them. It highlights the difficulties that he has had in his life and how when Maradona takes over Diego it caused terrible things in his life which maybe tarnishes his reputation a bit.My one criticism of the film is that it is a bit narrow in terms of its storytelling, I mean it totally glosses over the crazy time he had at Barcelona, quickly covers The Hand Of God and ignores his failed drug test at the 1994 World Cup. Maybe this film could have been better as a mini series of like 4 episodes in order to fully tell the story and flesh out the story which I would have been totally here for.Overall, this is a fantastic documentary, looking at one of the biggest characters in Football and the highs and lows of his career. If you are like me and don't think you know enough about Maradona this is a great way to start."}, {"id": 64, "text": "Never been a football fan, but everyone has heard of legendary Maradona, so I 'had'to watch it.It was great documentary, but they main thing that brought down the score for was subtitles. Who ever wrote them was not used to making subtitles.Most of the dialogue was made in a 'foreign' language (I'm Norwegian, but I understand English), like French, Italian, Spanish and other languages, and the subtitles only lasted like a second, so there was no chance to read them. I had to pause the movie or rewind constantly to understand what was being said, which kind of ruined the movie for me.Other than that, it was good :)They should have used someone who knew how to post subtitles, though."}, {"id": 65, "text": "It's possible to argue that Diego Maradona was football's first global celebrity; where you place him in the top 5 male players of all time is perhaps not relevant to that. His emergence as a great, moving from Argentina to become a dominant European force and driving his country to World Cup success, went hand in hand with being one of the very first footballers to achieve the sort of fame which is now such a feature of the sporting landscape. Celebrity - its pitfalls and its effects on the person themselves - was also the focus of writer-director Asif Kapadia's outstanding film on Amy Winehouse, and it's fitting that it's also the theme of this film on the great Argentian footballer.We follow - in significant detail - his career from its early days, skipping over his brief and less successful stint in Spain, and home in on his days in Naples. It's here he found his peak as a player; it's here that his fame ascended to previously unheard-of levels; it's here that he ended up broken. In doing so his addiction to cocaine is the focus of the second half the film and alongside that the way he became owned more by organised crime than he was by his employers.In terms of his relationships, the film gives less away. We do hear from sisters and his mother; the relationship with the woman who bore his son whom he only acknowledged late in life is given little time, and the same is true of what has been reported elsewhere of his poor treatment of women. It may be that this is seen as less essential to the study of celebrity as a phenomena, but it also feels a little troubling.The rest of the film is often thrilling or moving. Watching footage of his genius is always something to behold; there is little room left to doubt just how special a talent he was. And his final descent, which is really only briefly addressed as the film comes to a close, is no less moving for it; in fact, its brevity may be the point. It's almost as if giving little screen-time to that later part of his story, Kapadia is saying something about the toxic cost of celebrity, and what happens to a person who becomes something different to what those who idolise him demand. The film as a whole skilfully unpacks the difference the man himself spoke of between the two parts of his persona; Diego, the boy from Argentina who just wanted to play and Maradona, the man who carried a world on his shoulders and ultimately found it too heavy to carry. As such, the film marks a valuable entry into what needs to be a growing understanding of what celebrity culture is and does; watched alongside the Amy Winehouse film (Amy), there is much to think on here."}, {"id": 66, "text": "Diego Maradona (2019 release; 130 min.) is a documentary about the life and times of Maradona, one of the greatest soccer players of all time. As the movie opens, we are in a fast-moving car, flying down the narrow streets of Naples, Italy. It is the day that Maradona joins the (then) lowly-regarded football club, July 5, 1984 we are reminded. In brief flashbacks, we see Maradona in previous tenures, including his disastrous 2 year stay at Barcelona, one of the world's premier clubs. I asked for a Ferrari, and instead I got a Fiat, Maradona remarks. Napoli was literally the only club interested in buying me, he sighs. But it is just the fresh start that he needs... At this point we are 10 min. into the documentary.Couple of comments: this is the latest documentary from Oscar-winning director Asif Kapadia, who previously brought us Senna and, even better, Amy (about Amy Winehouse). As soon as I heard that Kapadia was attached to making a documentary about Diego Maradona, I was all in. And the documentary, made with cooperation from Maradona and his family, does bring a lot of great moments, including lots of family archive footage never before seen. Maradona is a fascinating figure. Just think of the (in)famous 1986 World Cup clash against England, where he scored with the hand of God and how he rationalized it (payback for the Falklands War of a few years before). A little bit of cheating, and a lot of genius, remarks someone and that really sums it up. Watching the archive footage of the Italian Series A league games from the mid-80s is an eye-opener. Yes, we all know/knew that catenaccio football was a grinder, but to see the ugly and vicious tackling (if you can call it that, personal assaults might be more appropriate) just makes your head shake in disgust. Yet despite all that great stuff, I was really surprised that Kapadia skips entirely over several key moments: no mention whatsoever over Maradona's ejection from the 1994 World Cup (due to failing a drug test), or his controversial tenure as manager of the Argentine national team (starting in 2008). It just seems uncharacteristic for Kapadia to make such mistakes, and hence my qualified 3.5 star rating for this documentary.Diego Maradona premiered at this year's Cannes film festival. Diego Maradona, unlike Senna or Amy did not have a US theatrical run, another surprise. Perhaps this is because of the subject matter being too far removed from the US public at large, although one could easily say the same thing about F-1 driver Ayrton Senna. Anyway, the documentary started showing earlier this week on HBO, and I couldn't wait to see it. If you are a soccer fan of any kind, I'd readily suggest you check this out, be it on VOD or eventually on DVD/Blu-ray, and draw your own conclusion."}, {"id": 67, "text": "Director Asif Kapadia has, in his last two films Senna and Amy, brought about some of the most striking, moving and memorable filmmaking the documentary genre has ever had to offer, standing head and shoulders above the majority of what can be a rather bland form. As a result, I went into Diego Maradona with very high expectations, and while I can certainly say that Kapadia once again impresses his brilliantly vibrant style onto the film, this certainly is no match for the lofty heights of Senna and Amy.I'll get into why that is the case in a moment, but first and foremost, there's no denying what a fascinating and engrossing look into the life and career of footballer Diego Maradona this film is. From a purely biographical perspective, the film is absolutely loaded with information and riveting backstory to one of the sport's most colourful characters, brilliantly striking a balance between on-pitch excitement and off-pitch personal drama, and making for both an informative and thoroughly engaging watch throughout.There is the argument that, as the film is so full of information and things to learn about Maradona, that you do need to have a good understanding of the footballing world to get to grips with the significance of a number of major events and themes that play out through his time at Napoli, with the status of clubs and national teams along with the importance of individual competitions playing a big role in Maradona's turbulent career.However, for football fans, this documentary won't disappoint in the slightest, and much like Senna and Amy, which delved into their respective areas of focus in riveting detail but with such passion and energy at the same time, Diego Maradona proves a vibrant and entertaining documentary right the way through, which is more than can be said for a number of films about major football icons.Looking at the film from a more cinematic perspective, the merits of Kapadia's brilliant directorial style are clear as day, as he brings real passion and sense of important emotion to every twist and turn shown throughout. Much like the two previous documentaries, Diego Maradona doesn't play out entirely in chronological order, cleverly choosing a centrepoint of his career that works as a metaphor for his whole life, and then peering back into the past or ahead of that time period when appropriate.As a result, the film is a riveting and structurally impressive one, telling its story with far more energy and dynamism than the majority of sports documentaries.However, the big thing that disappointed me about Diego Maradona in comparison to Kapadia's Senna and Amy is its relative lack of hard-hitting emotion. Now, a different subject matter will always make for a different emotional effect, with Senna's story ending on an astonishing crescendo, while Amy's featured a more patient yet even more heartbreaking tale of decline, however there's something about Maradona's story that's missing that mind-blowing emotional power that made those two films so incredible.Of course, both Senna and Amy built up to a single crescendo at the end of the film, whereas Diego Maradona is a little more broken up, with three different main themes playing out as little mini movies within the overall film, focusing individually on his rise at Napoli and in the Argentina team, his role as a major international icon, and his downfall in the later years of his career.As I said previously, there's never a dull moment when it comes to learning about Maradona's life and career, and those three main themes offer up so much fascinating history, however the fact that they do operate rather independently of one another means the overall film lacks the emotional intensity and breathlessness of Senna and Amy, and as such doesn't have that same hard-hitting, moving impact at any point.I hold Senna and Amy in immensely high regard not only as good documentaries, but brilliant pieces of filmmaking, so comparing Diego Maradona so closely to them seems very harsh, but they are signals of what director Asif Kapadia is capable of, and I feel that he doesn't quite reach his full potential with this film.With all that said, there's no denying what a great film Diego Maradona is, not only from a biographical perspective, but also as a riveting, dynamic and deeply engrossing documentary that's both energetic and very well-structured throughout. It may not have the intense emotional impact that Senna and Amy do, suffering from a slightly jarring distance between its main themes, but it's an enthralling watch from beginning to end nonetheless."}], "reviews_amount": 68}