{"name": "The Professor and the Madman", "titleId": "tt05932728", "reviews": [{"id": 0, "text": "Nothing more than critics trying to show solidarity for Hollywood. The bad reviews are backlash against Gibson and Safinia for false rumors about their conduct on set. Icon productions and Voltage failed to complete the script which left huge plot holes. That was Gibson and Safinia's gripe and lawsuit. They wanted the movie COMPLETED not FINISHED.It's a great film, great story (fill the gaps by reading the book synopsis) , great acting. Just enjoy it ! This was a passion project for Gibson, Penn, and Safinia and they were screwed by the production companies.This is why I almost never look at critic reviews. I've seen countless movies that they drool over that I think are trash, and have seen plenty that I find entertaining that they rate collectively below 30%"}, {"id": 1, "text": "It seems to me that there is some critique-conspiracy going on around this movie. I just found out there were some legal issues surrounding this movie,but I still don't get all those bad reviews about the movie itself. Normally,I wouldn't even look those up,but they are just popping up whenever I want to google something about the plot or the true story behind it. Anyways,the movie was really enjoyable. The acting was great in my opinion,the story was interesting and captivating. It was shot beautifully. It is not perfect tho,not all parts could hold my attention,but it's a film I would recommend to my friends."}, {"id": 2, "text": "Interesting true story well played by competent actors. Written without insertion of political, sexual or cultural bias for a refreshing change."}, {"id": 3, "text": "First of all, I didn't ever think Sean Penn could out perform his role in Mystic River for which he won the oscar for and is one of my favorite movies. But he took his role in this film to a different level and couldn't have been done any better by anyone else. Mel Gibson's role was just as powerful and I don't think anyone could have done it better than him and goes to prove that Mel can still play a leading role and still be considered at the top of the list to make a memorable movie. Sean Penn will definitely be a contender to win another oscar and in my opinion, he should win it again because I highly doubt he'll be surpassed this year by another actor. This year's oscar belongs to him hands down. The Professor and the Madman is a remarkable story of history that deserves to be told and rewarded."}, {"id": 4, "text": "This film is for real cinema lovers, who dont need special effects and flashing images to get excited. I had no expectations when I sat down to view this amazing piece of work. The acting was superb, period costumes on point, casting down to the children, the broadmoor guards all wonderful. Sean Penn deserves an oscar for this extraordinary performance."}, {"id": 5, "text": "When politics and social messaging run rampant in today's movies, it's hard to find a good story (even better when true) with a script and actors who sign on to simply do the job at hand - making a quality film worthy of anyone's time. It doesn't matter who you are or what your views are to be completely engrossed and enlightened by this one. It has friendship, courage, kindness and sadness at its heart. It's also further proof that reality is stranger than fiction. Not over-acted or overly anything. Ignore the critics again on this one and enjoy a little known story you won't forget."}, {"id": 6, "text": "Walked into the film with no expectations or knowledge of what it was about, except that it starred Gibson and Penn.Walked out of the film blown away. The script, cast (each and every one of them), the story... all beautifully portrayed.Though-provoking, heart-wrenching and inspiring."}, {"id": 7, "text": "I wanted to see this movie as soon as I heard about it. Yeah, I know, Im a bit of a word nerd. To find out that Penn and Gibson were going to star in it absolutely fascinated me. It does not disappoint. It is 2 hours long and yes, it is a bit slow, but this kind of movie can't be done in any other way and it is a story, I thought, had to be told. Penn is dynamite!! I love his acting style, where you can see his character's feelings from head to toe. He simply drew me in in every scene to the point where scenes without him in it paled in comparison. Im not much of a Mel Gibson fan, but enjoyed his performance. I thought he and Penn had great chemistry."}, {"id": 8, "text": "Of those movies that teach you to value life. Let's see what you did wrong and a way to amend your path. The importance of forgiveness and love, between reason and madness. I think it's one of the best movies of recent years and with a brutally magnificent Sean Penn, perhaps with his most legendary performance, and that's hard to say with a resume like his. In short, a very well directed film, with emotionally descriptive scenes and with a cast of the first order. Do not go looking for shots, bursts of simultaneous action and rampant sex. You will not find them. I recommend this movie for people who see beyond the basics. For a moment I am grateful that I did not pay attention to Metacritic and Rotten Tomatoes."}, {"id": 9, "text": "I can because of you......Heart wrenching masterpiece in all its glory and heartbreak. Do yourself a favor and watch something that will benefit your soul and restore your faith in humanity."}, {"id": 10, "text": "Not a lot to say. Great unknown, at least to me, story told and shown beautifully. Oh, and check the filmography of Eddie Marsan and Natalie Dormer. Especially Natalie in Elementary...she personified one of literature's greatest villains masterfully. Finally. WATCH THIS MOVIE!"}, {"id": 11, "text": "Hollywood has been in free fall so long, I almost forgot good movies were still possible.Very interesting story from the VERY beginning.ORIGINAL.The characters are FANTISTIC...Remember what it was like to care about the characters?Acting, flawless.And no selfish writer inserting their damn PERSONAL politics!!!"}, {"id": 12, "text": "I haven't seen a movie this good for around 10 years. Truly unbelievable performances from Penn and Gibson. I was balling my eyes out from half way though. Thank god there are still film makers out there who understand the art form."}, {"id": 13, "text": "Brilliant!"}, {"id": 14, "text": "It's apparent that unless there are s'plosions and CGI, the imbecilic critics (and most marvel fans) will hate it. This is a timeless film; well acted, a slice of history often forgotten. It should be seen by anyone with sense."}, {"id": 15, "text": "This movie, its story and interpretation fall into the category of divine. It is long and about the making of Oxfords' dictionary - how can it be so addictive? A true work of art. I am no historian but from what I searched I found that the story is very close to the truth. We are so used to seeing the truth being ugly... Have we forgotten or are unable to marvel at it when it is beautiful? I don't understand the bad critics. Truly don't. The story could not be more amazing. It is also educative. The acting - Superb as you would expect from both the leading actors. The plot so engaging. Can't help but feel that Hollywood (maybe the world?) still hasn't forgiven Gibson for being human and making mistakes. Ridiculous. He has talent beyond frontiers. Stop bullying him and evaluate him for his work."}, {"id": 16, "text": "A few years ago I started to wonder if Hollywood creativity is dry? Now, with this epic movie; not in its events, but in its richness on both the human and artistic sides. A representative performance at the highest level. Four characters centered around; the character of Professor James Murray, played by Mel Gibson and his wife Ada Murray, played by Jennifer Ehle and Dr. William Chester Minor, played by Sean Penn and the wife of the murdered Eliza Merrett, played by Natalie Dormer. These personalities were at the top of their artistic representation, not to mention the characterization of the character and the depth of the human dimension of each. I humbly think that this film will enter Oscar 2020 nominations as the best film and another nomination for the best actor performance to Shin Bin."}, {"id": 17, "text": "I read the book, and hesitantly decided to watch this movie. After reading the book, I felt the story lacked substance. When I saw that they brought out the big guns, Gibson and Penn I thought they were going to cover for a lackluster story. I was certainly wrong!! The story is told at a good and thorough pace, and demonstrates the kindness and passion leaving us with an amazing story. Kudos to all. I hope this movie wins some awards."}, {"id": 18, "text": "This is the best movie i have seen this year, the compassion, love, class, integrity and empathy is insurmountable. The story is remarkable and i was so grateful to have seen it, and now plan to read it."}, {"id": 19, "text": "A film born, literally, of words and the paradoxical. This incredible true story highlights the captivating and tragic friendship between two brilliant men. Where words become a code of friendship and the thin line between beauty and madness.The Professor and the Madman is based off a noval by Simon Winchester. The story tells of Professor James Murray (Mel Gibson) who is charged with drafting the first ever Oxford dictionary of the English language. Murray, knowing the enormity of the task, appealed to all English speaking people via a letter skillfully placed within the covers of books asking them to help gather every word, definition and date they came across, inviting them to send their words by post.William Chester Minor (Sean Penn), a former American military surgeon, who mistakenly killed an innocent man due to his schizophrenic delusions of being chased and haunted by a man from his past, was condemned to living in an asylum, after being declared insane by the English courts. Minor, receiving a book from the asylum guards as a Christmas gift, found the appeal made by Professor Murray, thus beginning a whirlwind of brilliance, maddness, forgiveness, friendship and love. The professional critics loathed this film for being off rhythm and slow, and Mel Gibson not promote the film at all due to legal battles. The beauty of this film is in the storytelling and the true to life tonal cinematic contrasts that keep this film perfectly off-balance. There's the impenetrable darkness that surrounds Minor's story that can be seen and felt in the film. Watching Penn reach into his abilities to project the pain of a burning mind held captive by mental illness was truly an honor to watch. The other side of the story is sunnier, which also can be seen and felt with Murray trying to balance being a father, husband and editor, as well as a man of God battling his way through the doubt of Oxford leadership.Its truly a shame this film didn't get the credit it deserves. It's a hidden gem of cinema."}, {"id": 20, "text": "This is the first time I leave a review as a user. I felt I had to. I cannot believe the metacritics on this movie! The critics have just lost all credibility for me. I have thoroughly enjoyed this movie. And I've seen a few. The story, the plot, the themes, the build up, the acting the score. Finally, a Hollywood film I enjoy.Never you mind the critics! You deserve an oscar. Penn especially."}, {"id": 21, "text": "Marvelous film from start to finish. Who would have thought that a film about a dictionary could be so enthralling. All the cast were superb special mentions to Eddie Marsan and Steve Coogan (another great performance after Stan &amp; Ollie). Don't be put off by the story watch and enjoy a memorable Film."}, {"id": 22, "text": "This is the tale of the unorthodox beginnings of the Oxford dictionary. James A.H. Murray, who has limited schooling, impresses and leads a group of Oxford professors in the undertaking. He is aided by an American schizophrenic, Dr. William Chester Minor who is locked up in an asylum for the criminally insane. He shot and killed a man, believing he was an individual who was after him. It appears some of his issues may be PTSD.Mel Gibson plays the professor and Sean Penn the madman. This is a well acted period piece that most likely few people will see and then they will be shocked on Oscar night."}, {"id": 23, "text": "The Professor and the Madman is an excellent documentary/drama! The men's lives who were portrayed in this film are owed a debt of gratitude for their service as the English language is ever evolving and growing. At the time these men undertook the task it was a monumental task of incredible proportions. All they had were small pages of old letters, documents, or books that were long out of print that had old words used only a few times. These men went through all the records they could find and established the English language and it's vast vocabulary the best they could so that we have what is available today. They created what is known as the oxford dictionary which is the most complete English dictionary in the world. The acting is very well done and on par with the time period. A great movie the entire family can watch! It's sad there are not more movies of this caliber these days, I have to admit I was very surprised to see a movie I could show to my whole family in 2019 that was not a cartoon/computer generated movie."}, {"id": 24, "text": "I love my unabridged Oxford English Dictionary and I loved the book by Simon Winchester. Against all odds, this film lived up to both. Two masterful actors, bad boys shoved into Victorian manners, brought these quirky characters to life. But it was the script, credited in part to John Boorman, that carried the film, using the power of words that the OED celebrates. Mel Gibson and Sean Penn get their share of great lines, but even Jennifer Ehle as Murray's wife gets a star turn. Everyone else is great, too (Eddie Marsan makes the most of his small role!)."}, {"id": 25, "text": "There are no words to describe this beautiful movie. Well cast and award winning acting. Watch it, it is well worth your time."}, {"id": 26, "text": "I read the summery about the movie , then i turn myself and said: dont waste your time. But to seen both sean penn and mel gibson are playing toghether i convince myself to see it, and i love it. What amazing performance from sean penn and mel gibson, both of them bright in their roles. story is kinda confusing but you will goo deep inside the movie. Its worth to see, ill recommond it."}, {"id": 27, "text": "Context, history, performance. The film carries it all. It doesn't choose sides in madness. It's not glossy. It's real. It's a film from the 70's and the 90's, before the stylistic plastic of HD film making. All of these critics have exposed themselves. Their bias, has effected their senses for film inoculation. Enjoy the Rise of Skywalker."}, {"id": 28, "text": "This was a very good and interesting movie. Sean Penn and Mel Gibson was just amazing in this movie. I heard of the movie a while back and thought it was a ridiculous idea. How in the heck can you make an interesting movie about a dictionary? Well they did it. My wife and I both was amazed at the acting that Mr Penn did. At the end of the movie my wife and I looked at each other and said Wow LoL Not a car chase nor guns or bombs going off and I still enjoyed the heck out of this movie. My wife and give it 👍👍"}, {"id": 29, "text": "This is one of those rare stories that makes one enjoy good story telling and acting with depth. Not a silly hollywood film but a true classic. Sean Penn pulls off a spectacular acting job, and Mel Gibson is in his element once again. It would have been interesting to see what the Director had in mind as a final cut without being kicked out, so maybe a Directors cut will happen down the road. Regardless of the legal aspects, it still is a wonderful film especially about a subject that could have easily been rather dull by any other creative team. 8 stars"}, {"id": 30, "text": "Hey, I enjoy a Marvel comics flick or action adventure as much as the next guy but this is a REAL movie watching experience.The story is amazing, surprising and true! The interest and the tension is created by the characters and relationships. It makes you think and it makes you feel.The acting is superb.I was surprised to see it on Prime because it's a new movie with big time actors and I haven't heard a peep about it. I can tell you that it's better than most of the Best Picture nominees over the last two years and the acting performances easily rival the winners.I hope it gets the accolades it deserves."}, {"id": 31, "text": "This is an Oscar winning movie by all means! If not the best movie I have ever seen in my life! So much emotion, history... Splendid in every way"}, {"id": 32, "text": "The professor and the Madman, Based on the 1998 book 'The Surgeon of Crowthorne' by Simon Winchester, the life of Professor James Murray is portrayed as he begins work on compiling words for the first edition of the Oxford English Dictionary in the mid-19th century, i will say a wow for this, because it portrayed the life of those great men, really enjoyable untold story of those men behind the scene of the English language, superb acting performance from Mel Gibson,Sean penn and Natalie dormer, telling a story from 1870s is not easy setting up the atmosphere for it, colors clothes and sceneries were amazing, worth a watch if you like biographies, 7.5/10⭐"}, {"id": 33, "text": "This 65 ( is the new 55) year old found this movie to be fully entertaining and an enjoyable watch. Interesting storyline, informative subject, sensitive and moving. Forgiveness is an awesome thing! Well worth the investment of time. I didn't even feel like dozing off while watching. Penn has never been better and Oscar worthy."}, {"id": 34, "text": "I was about to forget the real cinema and real ACTING ❤❤❤"}, {"id": 35, "text": "I knew nothing of this film, I selected it to simply be a background distraction and ended up totally absorbed. Sean Penn's best performance."}, {"id": 36, "text": "When I walked into the movie I had no idea what it was about... and I usually don't like period films because I find them boring, but when i started watching, I couldn't get myself out of it. I was amazed. The story was really interesting, I suddenly built connections with characters, because Gibson and Penn played really good, Natalie as well. Actually everyone in the movie. The music, costumes, lights, everything was perfect!I believe Penn will win the Oscar with this movie. He should!"}, {"id": 37, "text": "Sean penn is a master he made the movie he should win oscar for that role 👍🏻👍🏻"}, {"id": 38, "text": "I am getting sick from the commercial movies.. it's enough .. and it's the time to watch a nice movie like this. Two of the best actors as expected, heart touching and very well presenting a great life project till now. Human brain and emotions is unpredictable and it's really hard to get to know how it works.Worth to watch ..."}, {"id": 39, "text": "Great acting especially Sean Penn , very touching story and very thoughtful emotions Nothing in history is granted to us easily"}, {"id": 40, "text": "Terrific! This is something special here. Amazing script and top notch acting. As movie goes on, I find myself more into it. It has everything in it - love, hatred, ambition, guilt, will power and inspiration. Must watch for real cinema lovers."}, {"id": 41, "text": "Both Sean Penn and Mel Gibson out did themselves. For a 2:22 movie, time went by very fast. That is how intense the movie was. The music was accordingly excellent and many scenes where very moving and magnificently done. This is a must-see movie no matter what rating it has been given.An excellent movie."}, {"id": 42, "text": "An engrossing and beautiful film with really great acting. Unexpected and brilliant."}, {"id": 43, "text": "The climax of movie revolves around concepts of woman support, friendship endeavoring, dedication, self-education and thinking outside of the box."}, {"id": 44, "text": "I turned this on when I was tired. I didn't think I was in the mood to watch something like this at all when I found it on Starz. I even started watching something else on my iPad I thought would grab me more. The iPad was out of juice and died. I was going to change the channel, but next thing you know I was sucked in and watched the whole thing. it was the same thing as happened when I read the book. It just sucked me right in. The book had more about the dictionary, which did not diminish it, but it's no surprise they had to have less of that in the movie. This story is remarkable. It sounds too fantastic to be real, but quite the contrary, it's too fantastic not to be. No one could make this up."}, {"id": 45, "text": "These are the performance of a lifetime for Sean Penn and Mel Gibson. If they are not nominated for Oscars, then the academy is corrupt and inexcusable. This is more than a story of words, but a story of life dealing with the tragedies of war and the effects it causes on one's psyche. Bravo gentlemen, on a work that will go down in history"}, {"id": 46, "text": "This movie was fantastic all around. You really feel for these characters quickly. There are parts that were hard for me to handle, so get some tissues. Sean Penn was flawless in this role. He definitely deserves a nomination."}, {"id": 47, "text": "In the era of easy to reach online dictionaries and so easy to here's the true story of the challenges one had to take in the 19th Century, an epoch when the first dictionaries have been set - interweaved with the sad story of a beautiful mind, that of dr William Minor, victim of the prejudices of the time and of his own delusions. Characters are strong, performances enthralling, the steel blue of Mel Gibson's look playing as a spear helping the ocean deep, desperate and adrift blue of Sean Penn's eyes. Great theme very respectful of the real story - don't hesitate to watch!"}, {"id": 48, "text": "Wow. Unexpected. Heartwarming. Heartbreaking. Crazy dark twist about half way through. Gibson is near perfect. Penn (who's moonbat politics and opinions have kept me from ever giving him a chance ) just absolutely kills it ! I mean literally almost every time Penn is on screen I was choking up. It's definitely not for everyone. But I loved it.and the premise is based on actual people and events."}, {"id": 49, "text": "It is amazing. I haven't seen a movie that has moved me so much for a long time. There are too many commercial movies now, in order to make money. This is called a movie. I rated it ten stars."}, {"id": 50, "text": "Sean Penn is unbelievable is this film. I will be watching for the Oscar nod next year!"}, {"id": 51, "text": "I have loved movies for close to 70 years, and this one is the best I have ever seen in every way. Sean Penn's performance is truly amazing...as he is. Mel Gibson is also outstanding! This is a REAL movie... Haven't seen one in too long. Everything about it is outstanding. To everyone involved in its making, I truly thank you with all of my heart."}, {"id": 52, "text": "Everything in the movie is gorgeous , watch it you will never regret it ."}, {"id": 53, "text": "I mean going in, how interesting could a movie about making a dictionary be? was blown away by the acting from Gibson, Penn, and the other characters. A great story all around."}, {"id": 54, "text": "I don't like dramas, as the title says. I had zero expectations when I sat down to watch this film, especially since I'm not a huge Sean Pen fan either. How surprised was I to find a fantastic story with great characters. The film kept me thoroughly engrossed. I could not believe it, this film left me thinking for days after watching it. Performances from everyone was on the mark. And now I have to admit that for a guy that does not enjoy dramatic films, this film has become one of the best films I have seen in a very long time. Do yourself a favor and watch this film."}, {"id": 55, "text": "This movie requires patience and complete attention. Mel Gibson and sean penn are both incredible."}, {"id": 56, "text": "I don't think the story can be described with simple words but one actually has to let himself be entirely driven by the movie to sense its depth. The story has more than one dimensional drama that provokes hard questions about the sense of creativity, redemption, friendship, family and loyalty.Above that the story was carefully written and performed to depict the strength of the English language. The language used in the movie was more than just a tool of expressing ideas and more than just a subject, but it has a unique character.Mel Gibson and Sean Penn really put their best in this movie, and Natalie Dormer's role here was so amazing and is superior to her performance in the GOT series by a heavy factor. Bravo Natalie!"}, {"id": 57, "text": "The film mainly depends on the relationship between The Professor(Mel Gibson) and The Madman(Sean Penn).Both Gibson's and Penn's acting performance are in their top form but the two main female characters which are played by Dormer and Ehle,show great acting performance as well.This movie is neither an action nor a science-fiction film that you can see explosions and visual effects frequently during the film.What you will find in this film is real film-making,art of acting.In my opinion,Sean Penn should be nominated for an Oscar for his shining and outstanding role."}, {"id": 58, "text": "Great film. All actors are great Sean Penn does an especially good job in making me forget he is Sean Penn. Mel Gibson continues to make good movies with substance. The gore was handled very well. My only issue is of the troubled doctor; could really have been treated so well in a place known for dehumanising the criminally insane?"}, {"id": 59, "text": "Deep, emotional and well written. Phenomenal performamce by Penn."}, {"id": 60, "text": "It's a bit of a funny movie, well worth watching. As a lover of words I looked forward to it and it didn't disappoint though the intertwining of the two actors took forever. Well worth watching!"}, {"id": 61, "text": "I enjoyed reading The Professor and the Madman by Simon Winchester. As usual a film can only do so much justice for a well-written book. Given the amount of material the film gives the bare bones of the story. People who like to learn about historical figures, who had an impact on society, this film will work for you. Today they would have diagnosed Dr. W.C. Minor with PTSD rather than schizophrenia. I wish they would have made it clear that Dr. Minor was forced by army regulations in the Civil War to brand someone, because I doubt many people watching the film understand that aspect. Acting is strong... maybe at times a bit over the top... and still hard to get used to hearing Mel Gibson with a Scottish ascent. Pretty good for Hollywood considering the mindless and violent films they are doing today."}, {"id": 62, "text": "I cried some and saw a lot of spiritual truths on this movie that moved me and even though there was some extreme behavior that went on they helped prove a point"}, {"id": 63, "text": "Sean Pen has masterfully played the role of a doctor who is suffering from schizophrenia and is charged with murder, but without whose help the Oxford English dictionary would not be complete! Pen played for an Oscar."}, {"id": 64, "text": "Mastere of acting ! Shawn Penn is just a brilliant actor. Great movie! Master class."}, {"id": 65, "text": "An amazing dramatic movie touches your heart in every second of it..Sean Penn did a remarkable role of acting .. thank you for such a great movie"}, {"id": 66, "text": "The acting was magnificent, it was also directed very well, script never boring the audience. The subject of the movie was another hit, captivating you from the start. Gives you a lot to ponder and leaves you with a longing to do more with your life. I highly recommend it!"}, {"id": 67, "text": "It may not have received a very high rating but the the film has a great emotional depth and keeps you connected from beginning to end. I don't even have to talk about the actor's performances..."}, {"id": 68, "text": "I found the premise intriguing and settled down to watch this with a friend one evening. I have to say it's not easy going and requires your full attention, but if given the film is worth just over 2 hours of your life. The task undertaken in compiling the dictionary is staggering - so that as a back drop leaves you in awe. That and the relationship between the professor and the mad man is truly a work of fiction, and coupled with forgiveness, kind men, misguided individuals and men who pursued their own agenda weaves a plot that ultimately brings a tale to light which should be more commonly known. Thank you to the director, writers and cast for superb entertainment and for educating me."}, {"id": 69, "text": "Who would have thought the story behind the making of the dictionary would make a good movie especially when two of the leading actors are known for action movies? But it works! I did not get bored. It's an inspiring and thought provoking story of redemption and forgiveness. Mel Gibson, Sean Penn, Stephen Dillane, Natalie Dormer, and Jennifer Ehle really give great acting performances."}, {"id": 70, "text": "Both of these leading actors have always done well and, this is another good example of their superior acting capability. If I did not know ahead of time that Mel Gibson was in the movie, I would have wondered and hoped that is is him--which it is. Bravo to Mel Gibson and Sean Penn for their excellent portrayal of their characters! Both of these guys should get an Oscar."}, {"id": 71, "text": "The title does not give a clear view of the excellent film and acting. Mel Gibson and Sean Penn were exceptional. The true history of what may appear to be boring, the creation of the Oxford Dictionary, is captivating. This film is for lovers of history and people who made history. Critics failed miserably in their review. They are obviously jaded and need to take a vacation.Wait for, If not love...then what?"}, {"id": 72, "text": "Excelent movie! Performance are impeccable! Must be an Oscar winner!"}, {"id": 73, "text": "This has the making of a class written all over it. Gibson and Penn are shinning at what is arguably one of their best performances to date. This is an intriguing, touching and heartbreaking story about guilt, love, forgiveness and above all perseverance. I was hooked from the first to the last minute. This has been stowed away with the likes of A beautiful mind and The imitation game. Powerful movie worth your time!"}, {"id": 74, "text": "Beautiful story that offers profound insight into the true nature of written word,friendship,human mind,forgiveness and redemption. All of the actors contribute to the movie with an outstanding acting. On screen Mel Gibson and Sean Penn show strong chemistry between them making the movie even more compelling. The movie was based on the book ,,The Surgeon of Crowthorne'' by Simon Winchester. I think that it wasn't an easy task to put it on the screen and director has done a very good job. Overall the movie seemed like it was strongly influenced by Mel Gibson.Recommended for movie lovers."}, {"id": 75, "text": "Ironically I have no words to describe this movie. I give it a 10, for I am speechless."}, {"id": 76, "text": "And was not disappointed. Dr Minor is a cousin and his story is well known in our family. Super excited to see Sean Penn play one of my most interesting relatives. The Doctor was a challenging man and Sean Penn was definitely up to the task. Cast, costumes and settings did a great job in immersing me in the time and space of the era. I already knew the story, but I was blown away seeing it."}, {"id": 77, "text": "The acting in this movie is simply amazing. I whish these two guys would be in more movies. Thank you for this beautiful gem."}, {"id": 78, "text": "An era a person lives in is so tiny one might only hear tales of an extraordinary person existed in the past yet very few, the privileged, get to witness their magnanimous potential and are considered the lucky ones.In a world where competing the dominance of languages is at helm a true legend lived up beyond the expectation to surpass the existing rivalry only to expedite the prominence of the exponentially acclaimed language.It's indeed quite fascinating to have such enormously talented men existed in a same era. What baffled me more is them sharing the forum and encapsulating their knowledge in making the history more intriguing and remarkable. Splendid."}, {"id": 79, "text": "Yes, the story seams quite unrealistic sometimes but it is a very enjoyable film. Excellent acting from both Mel Gibson and Sean Penn."}, {"id": 80, "text": "I hadn't heard anything about this movie; I stumbled upon it. All the performances are top notch and the story is one of forgiveness and compassion. I highly recommend it."}, {"id": 81, "text": "A great documentary movie, all the cast and crew were selected and acted perfectly. Great performance of Sean Penn and Mel Gibson made it a high class movie. Highly recommend it."}, {"id": 82, "text": "I've just finished watching this movie and all I can say is that I loved every part of it."}, {"id": 83, "text": "A movie just like its story when you don't expect mush from a story of the 1800s turns to be full of passion and high class acting from sean penn all along a cast very very well chosen and a story that is the true reason to depict into a movie its why we go to cinemas to watch this ART its strange iam still waiting for the avengers endgame"}, {"id": 84, "text": "I think the story is very well written. Acting is first rate as well. Too bad that the lawsuit will dim the prospects of this movie reaching a wider audience.Typically, these biopics of sorts are dry and slow moving. This is not one of them. It's fast paced, good dialogue. Fair share of drama and English uptightness.Overall, there isn't much that I am missing. Thoroughly enjoyed."}, {"id": 85, "text": "With their high intellect and extraordinary brilliance, Murry and Dr. Minor met in a complex and unusual friendship. Dr. Minor who meets Murry's hopes of completion of Oxford English dictionary by a contribution of hundreds of entries; this contribution seems to be the only harbor to reconcile Minor with his guilt feeling after being convicted by a criminal insanity . The movie includes many significant implications of love, forgiveness and sympathy revealed through the relationship between Dr. Minor and the widow who is a dramatic round character. Plagued with his hallucinations and paranoid illusion, Minor- the character- gives Sean Penn-the actor one of the most complicated roles to perform incredibly."}, {"id": 86, "text": "This film give me idea that one whatever his fault he'll stay human and the Love is the only key to the completion of human lifeThank to all those who are staff in making such a great film in which all the meanings of creativity"}, {"id": 87, "text": "The low ratings from critics tells me more about them than the movie, they are low IQ idiots. I would rate this wonderfull movie 8.5 but due to stupid critics i give this a 10/10."}, {"id": 88, "text": "The critics didn't like The Professor and the Madman, but for me, it is simply the best movie I have seen in a long time. Apart from Mel and Sean, it has a stellar English cast. If you can see it on the big screen - do."}, {"id": 89, "text": "Didn't know anything about this movie and I thought it was really quite touching.Excellent acting from everyone involved and a historical story few of us know anything about. Very good film."}, {"id": 90, "text": "Finally a great movie from the epic era where the outstanding performance and wonderful story blends with great script and a masterpiece job from the director! I've always been in love with everything that have Sean Penn in it, this time it's the all star team behind this piece of art Worth every minute watching ... screw the critics"}, {"id": 91, "text": "Brilliant, Brilliant,....two actors executing there craft"}, {"id": 92, "text": "Great movie, kept me entertained and educated me on a variety of words and the history of the Oxford dictionary. I must say I was quite disappointed that begs the question was used incorrectly toward the end of a film about the English language and its use/origins. If modern you could say the phrase has been changed but myriad misuses, but during this time the original meaning is certainly the only correct option."}, {"id": 93, "text": "Amazing movie, the story is simple but the actors are performing so well, that it is a great pleasure to watch"}, {"id": 94, "text": "Despite an auspicious beginning and an interesting and promising development on the characters involved on the dictionary project at the end of the nineteenth century, which seems to be the central theme, the plot meanders tediously through the narratives of (implausible) love, religious redemption and the vagaries of mental illness and academic institutions without the viewer not knowing too well where it is all going. Tedious: too long, slow, or dull; tiresome or monotonous. Favourite synonyms: dreary, soporific, plodding, lacklustre."}, {"id": 95, "text": "...of close to sheer perfection in every aspect of which film is capable - and of what humans should aspire to. it is a story - based on historical people and facts - not only of one of the greatest written contributions ever to mankind, but of humanity, compassion, decency, redemption, love, and the bonds capable between people; of striving to be the best of what you are, the most you can be. the acting of every one of the characters is superb, the screenplay and dialogue exquisite, the cinematorgraphy and soundtrack excellent. it is a gem that speaks to the human spirit. sorry, no sensationalism, no sex, no bling, and a couple of scenes of violence that actually did occur but lend to the mystery and awe of what is life and the human soul. one of those rare movies that is worth watching and re-watching, literally, for the rest of one's life, to be viewed as a compass of ethics and only the most diligent life, which is what gives each of us meaning, value, direction, love, and redemption. do not miss it. and cherish its myriad messages."}, {"id": 96, "text": "Masterpiece and more.....maybe there is no the exactly word in the entire english dictionary to describe it at all...."}, {"id": 97, "text": "I reccomend it, not only for both impecable perfomances of Gibson and Penn, but also for script and story. A breath of air, in the ocean of this century filmmaking. Well deserved 10/10, because of the combination of acting and a beautiful, mature story behind it"}, {"id": 98, "text": "Sean Penn drew me to this movie as he is one of our finest actors. I loved the performances from all of the performers and the casting could not have been better. It was a breath of fresh air to watch this incredible film and it provided a much needed break from the serial action movies, which dominate the screens today.I hope the academy gives it the attention it rightly deserves as one of the best movies of recent times and recognizes the amazing performances of its actors."}, {"id": 99, "text": "Great acting by both actors telling an amazing story of friendship and something that would have otherwise been well known. Although weird that it's set in Dublin, however, you wouldn't have really known The background music is fantastic, matches the mood and really takes the movie to the next level. One of the best movies in recent times. A not to be missed."}, {"id": 100, "text": "I can't begin to explain how much I enjoyed this movie, I cried when they cried and laughed when they laughed. Not many movies have that effect anymore. Natalie, Sean, Mel and the rest of amazing cast deserved this to be released big time instead I came across this purely accidentally, am stunned that it didn't get more bells and whistles!"}, {"id": 101, "text": "Great movie about forgivness, love, guilt, friendship, sacrifice, passionr and striving for knowledge. too bad it won't get any prizes because it doesn't have sufragetes, communists or ethnic and sexual diversity, only white man mainly..."}, {"id": 102, "text": "Two great actors, Gibson and Penn, pulled off a movie, in chaos because of their own high expectations, and still brought it to fruition with a message need to be heard and envisioned. I was not distracted for a minute. In fact, I give kudos (not that anyone cares) to them for taking this project on. I hope to see more from Safinia, praying further movies maintain such quality, never bending to the crap that standards have been lowered to these last two decades (and I'm pretty open minded!)This is a movie worth watching. Penn is usually picky when choosing a movie. Gibson was so smart to choose this one. It really showed his ever-present abilities when he invests himself in a project."}, {"id": 103, "text": "Mel Gibson goes along as expected - but Sean penn needs some kind of recognition for this role- very special."}, {"id": 104, "text": "The eloquent storytelling of this movie has me in awe. The recollection of such a life, in that being William Chester Minor and James Murray, was beautiful.I'm glad I stumbled across such a movie with some friends in the late of a winter night.This review is even talking in such a way as they would in the movie - it was that influential!The cast was perfect. The crew and screenwriting was too notch.This deserves a 9 stars and nothing less. Amazing."}, {"id": 105, "text": "Mel Gibson, Sean Penn. Two complicated human beings. Two actors at the top of their craft. Two souls in constant search of redemption. Only the roles are reversed. Gibson is the one always teetering on the edge of madness. Penn has matured into true mensch. Or maybe as another suffering artist once said, Life breaks everyone, but some become strong in the broken places. (Hemingway) It takes a lot to make the story of a dictionary into a moving drama. It takes great imagination to look at grainy old photographs and see the richly colored texture of humanity. This is cinema at its best."}, {"id": 106, "text": "It really shows you where the Hollywood establishment is today when you see them vomit on this utterly beautiful gem. This is what Hollywood used to make, so long ago now. This is what those big white letters on the hillside invoke. Upon movies like this was the reputation of Hollywood made. Those in charge now can only exploit it with increasingly degenerate and inward referencing club moves. Are you in the Star Trek club or the Star Wars club? May you are real edgy coz you're in the vampire movie club.It's worth noting that the greatest movies being made today are by the likes of Mel Gibson, Clint Eastwood and other rejects of Hollywood. Movies for adults. Hollywood darlings are left to make yet another reboot of a reboot of something that was made twenty or thirty years ago. Because they're hacks. All the true talent has left Hollywood and it's reduced to making Macmovies for Macpeople."}, {"id": 107, "text": "This film truly is a piece of art. With 2 of the greatest actors of the past decades and an immense story. It's a must see. But you must see it in the right setting. This is not an action movie. It's all about the masterful acting and story. If you are ready for this Art, go for it!"}, {"id": 108, "text": "In a world bombarded by the politicised, sexualised, violent, shallow, cgi riddled nonsense offerings spewed ad-nauseam out of hollywood, this movie is like a breath of fresh air.An intriguing story well told and beautifully acted by the entire cast. A true classic.One of those movies initially rented, and then immediately bought."}, {"id": 109, "text": "Simply brilliant film. Very slow understandably but engrossing it surely is."}, {"id": 110, "text": "Far more interesting than expected. I went with the actual audiences opinions rather than professional critics as they are far more reliable. Sean Penn acts his socks off again and there is a lot more to the story than the creation of a dictionary, which in itself is an unlikely premise for a film."}, {"id": 111, "text": "Having read Simon Winchester's electrifying book, The Professor and the Madman, I was still overwhelmed by the cinematic victory that the movie achieves. Probably the very best that any cinematic rendition of a great book could ever achieve is a dramatic outline hitting the most salient scenes, emotions and lyrics. The makers of this film have gleaned the book, then, as Pablo Neruda might have limned, resurrected a work of art that leads in and out of the literary experience, an excitng mobius strip of wonders. I wonder if the metacritics who savaged the movie for the most part bothered to read this book. I suspect not."}, {"id": 112, "text": "The movie has all elements working together seamlessly: story, script, direction, camera, wardrobe, music score, location - and most of all - an incredible cast lead by Mel Gibson (the professor) and Sean Penn (the madman). The amazing cast pull you right into the story - allowing you to eavesdrop on conversations and events. Highly recommended. Based on true events."}, {"id": 113, "text": "I found this film fascinating from beginning to end and very moving. It's themes are profound and it's subject surprisingly engrossing and meaningful. I have no idea if the antagonists are real or inserted for dramatic purposes: they feel a little too cartoony, but don't let that put you off seeing this movie. It is about things that really matter and it's well told."}, {"id": 114, "text": "I thought the story here was fairly compelling, though after a while I began to find it almost comical the amount of time and effort that was being put into defining the meaning of a single word. All for a good cause of course, because this was how the Oxford English Dictionary came about, but even with Dr. James Murray's (Mel Gibson) devotion to duty, one intuitively realizes that a project like this could never be finished. Finished in the sense that the language would at some point stop evolving. It's a pretty safe bet that 'emoji' wasn't in that first edition.In an unusual pairing, Mel Gibson and Sean Penn are cast opposite each other here as meaningful collaborators, but it comes with a twist. Penn's character is a former Civil War Army surgeon found not guilty of murder by reason of insanity. The man truly is insane with regard to the conspiracy he holds in his mind of an elusive stalker who is intent on killing him. The narrative doesn't give even an inkling of anyone who might be out to 'get him', so to speak, and that delusion remains with Dr. William Chester Minor (Penn) throughout the story. However in his more lucid moments, Dr. Minor is repentant over the death of the man he mistakenly killed, and spends his entire prison life attempting to make it up to the victim's widow, both monetarily and by way of teaching the woman how to read. In time, Eliza Merrett's (Natalie Dormer) initial negative assessment of Minor turns to thoughts of forgiveness and love, an idea that Minor can't cope with in a rational way. Taking it to an extreme, Minor castrates himself to insure that he can never return favor back to the woman he caused to become a widow.Penn, who I'm no fan of, really does do a remarkable job in the role of Minor, particularly during that phase of the picture in which he envisions no chance at redemption given Mrs. Merrett's ambiguous profession of love. As Mr. Murray struggles with his own efforts to move the dictionary process along, his relationship with Minor becomes personal upon repeated visits to the Broadmoor Criminal Lunatic Asylum where Minor is held. With unlimited passion, Murray prevails upon the authorities to come up with a way to free Minor and provide him some measure of relief from both his imprisonment and his self imposed mental isolation. In due course, Murray himself is vindicated for the passion he put into his work at Oxford, and is allowed to continue leadership on the team that eventually fulfilled the mission some years following his death.It's probably fair to say that not all viewers will find the film quite as intriguing as I did. It moves rather slow and the subject matter is rather tepid, so action junkies ought skip this one altogether. For others though, the picture can be quite engaging with a lot to offer if you're a fan of the principals and wish to witness some very fine acting. Gibson and Penn are both superb."}, {"id": 115, "text": "We're going old for this performance again from along time"}, {"id": 116, "text": "The story of my great great grandfather- James Murray. The book is a difficult read, however the film manages to capture all of it's intricacies, and displays them in a powerful, moving fashion. The acting is seamless, with Sean Penn surely pulling off a career best performance. It's a shame they messed around so much with the release- it's a story that should be shared and appreciated by more."}, {"id": 117, "text": "This one pulled me right into it. Acting is so good, story so interesting, the viewer is right there the whole time.. The way it should be. Character development is awesome. Making you love some and despise others. You will want to jump into your TV and help. If you are a fan of reading, proper grammar, enunciation, or opening your English dictionary frequently, you have to see this one without fail or delay. Based on true events so it is historical as well. I LOVED IT!"}, {"id": 118, "text": "A powerful story of dedication, how mental health is perceived and treated, and the power of huma connections. Superbly acted."}, {"id": 119, "text": "Mel Gibson rejected his playing and took back his initial enthusiastic support, so it must be good watching! Alternatively, it was such an improvement on his Mad Max persona, it was certainly watchable, like watching Sean Connery playing a medieval scholar in The Name of the Rose. Excellent casting, my wife was explaining to me the-convoluted-plot in terms of the actors' faces!"}, {"id": 120, "text": "This is a movie that shows you don´t need explosions and bullets to make an extraordinary film, just a good story with excellent actors performing the best way possible their characters, i was just blown away with Sean Penn performance, Mel Gibson was perfect, its a film to see again and enjoy over and over again."}, {"id": 121, "text": "I was dubious about watching a movie about how the dictionary was created, and put it aside for several days. When I came to watch it, it was a gripping tale of two men with two backgrounds who came together and helped write the dictionary. The story did drag on quite a bit, however it was very intriguing and interesting to watch. Excellent acting once again by Sean Penn, who creates a believable character. As a Scotsman myself, I can spot a fake Scottish accent, sorry Mel. However Mel Gibson's acting was top notch as well, both Mel Gibson and Sean Penn both masters at acting, complimented each other throughout.If you want to watch a historic movie, that fills in some spare time, then I recommend this one."}, {"id": 122, "text": "A great story. Great dialogue, great acting and great filming. Mel and Sean made such a great job of it that it was easy to believe they really are friends. Well done all. I had read a little bit about it before so the see a lot more was just great.Not a Hollywood blockbuster an enjoyable movie with a story."}, {"id": 123, "text": "From beginning to end, it wasn't possible to guess what would happen next. Two driven actors clearly portray the quest of real characters, that could be the same quest as any of us. Much more than a film about a war veteran, a widow and a determined academic. I had to remember to shut my mouth after some of the scenes. True life can be more amazing than fiction. Enjoy it."}, {"id": 124, "text": "Great acting, story, lighting, en music! A real treat!"}, {"id": 125, "text": "Hadn't heard of this movie, or had prior knowledge of the background or circumstances in which lead to the publication of the dictionary. Neither did I gain any real interest in such a story upon finding out what the movie was about. However, I decided to watch this movie and it blew me away!I will not elaborate further, but I will say if you are a lover of (proper) cinema, then I suggest this film to you for your next viewing and pleasure."}, {"id": 126, "text": "Don't listen to the critics. I have learned in my many many years of watching movies and following actors and their careers, that if you truly love an actor you will watch their work regardless of what anybody thinks. I saw this movie with zero knowledge of what it was about. I was scrolling thru movies to watch and saw Mel Gibson and Sean Penn, whom are two of my all time favorite actors. So, I decided, ok.. let's watch this movie. Oh My god.... I freaking loved it! I cried two times, or three, and I for sure will watch again!!!!If you are a Mel or Sean fan.. you will NOT be disappointed."}, {"id": 127, "text": "Definitely a winning combo. What a film! Great cast, brilliant acting, very decent photography and McCreary's music."}, {"id": 128, "text": "Longtime ihave not seen a great movie with great acting and amazing story like thatIts contain all factors Action , drama , storyline, mystery, passion to keep watching till the end"}, {"id": 129, "text": "I cannot be bothered to say much more than that. Please do everyone a favor and read this incredible book. Winchester laboriously researched and masterfully penned a fabulous dual biography, and this Hollywood rendition diminishes its wonder."}, {"id": 130, "text": "This was exquisite. Just go and watch it. I'm not the type of person who has a favorite movie. Now, I do."}, {"id": 131, "text": "An interesting back story but told in what felt like a very procedural way with each person going through the motions of acting out some basic characters.Nothing inspiring in the way this was told."}, {"id": 132, "text": "This is a masterpiece of a film. Utterly amazing acting and a gripping story. Sean Penn and Mel Gibson did extremely well together. Such a wonderful story of redemption and friendship, one that every lover of film and words alike need to see. This movie truly earns a 10/10. Kudos to everyone involved with this movie for crafting such a beautiful movie."}, {"id": 133, "text": "It is not often that I am so mesmerized by a movie that it takes over a movie. The rich subject of the movie, the making of a monumental tome is fascinating. The visual richness, the excellent writing etc. are a treat. But the acting, especially by Sean Penn is brilliant. How did this man not receive a reward for his impeccable acting??!A classic, beautiful movie."}, {"id": 134, "text": "Absolutely brillliant. Must see. Not only Sean Penn was Pennomenal, also the other actors were òutstanding. As was the story too!"}, {"id": 135, "text": "I miss the movie at the cinema but saw it on OSNI love each part of it, the friendship, forgiveness and dictionary hard work very inspiring thanks to two best actors"}, {"id": 136, "text": "Still got it! He always got IT! Great acting in every movie, he is like wine, better as time past"}, {"id": 137, "text": "Maybe my expectation was high. Other than Penn the film was too cliche for me. scenario develops as expected. I looked for the producer afterwards and found out Gibson as guessed."}, {"id": 138, "text": "I can't seem to find/recall the source. A couple of years back I remember seeing a movie telling a similar story, but w/little on the Merrett &amp; Dr. Minor aspect. Anyway, a fairly accurate dramatization of the history of A New English Dictionary on Historical Principles (aka Oxford English Dictionary) 1857-1928: The Dictionary is published in fascicles (installments) w/major revisions up to 1992. In 1928 it comprised 12 vol., 414,825 words, 1,827,306 quotations showing usage. And as we all know the language is constantly changing/evolving.Kudos to the actors &amp; production crew; you know a story is well told when you find yourself holding your breath with a sense of stillness during certain scenes particularly the meetings at the asylum first between Dr. Minor &amp; Murray, and then with Merrett."}, {"id": 139, "text": "Let's start off by saying excellent performances from both Gibson and Penn as well as the rest of the cast. It's refreshing to see an original movie that deals with the intellect instead of all of the remakes and sequels that deals with profit. This film was fascinating to watch as the two main characters in this film create something that some have always taken for granted.. the dictionary. Or the first edition of the original Oxford Dictionary to be precise. I liked how the film explained and described how daunting the task of collecting every single word ever spoken (even within the public domain) actually was. From the earliest usage and pronunciation of these words to the origins. This film made you feel the weight and the importance of such a task. Where it lost me was the undercurrent of a message: REDEMPTION The very talented Natalie Dormer plays the newly widowed Eliza Merrett whose husband was murdered at her very feet by a deranged William Chester Minor (Sean Penn) under mistaken identity. After having her life destroyed by the death of her husband, leading to prostitution to support her family. We are lad to believe that something in her psyche finds forgiveness (and possibly LOVE) with the man who murdered her husband to begin with. REALLY? THAT part of the story left me bewildered. BUT it's based on a true story so who am I to argue? Just that tiny bit of ridiculousness doesn't take away from a brilliant film with AMAZING acting. Hopefully it won't go the route of last years brilliant film The Favourite and be overlooked. This film DESERVES some Oscar consideration"}, {"id": 140, "text": "Originally had no interest in seeing this until a family member told us how good it was. She was right! Not only is it a true story, but Sean Penn &amp; Mel Gibson are amazing, with an excellent supporting cast!Who ever would have thought a story about making a dictionary could be entertaining &amp; made so masterfully that you just can't turn away!"}, {"id": 141, "text": "A very emotional as also intellectual film. Very well played by Gibson and Penn. Pronouncination and word choice extremely good and gives a special meaning to the film."}, {"id": 142, "text": "I did not even know this movie existed until I found it on Redbox one night. Boy am I glad I decided to watch it after reading the summary. First off, do not let Mel Gibson's Scottish accent from Braveheart turn you off from this movie. I think he worked on it quite a bit, because I was pleasantly surprised at how good it sounded (at least to my American ear) playing James Murray. I wasn't sure how a movie about the creation of the first Oxford dictionary would be interesting. Little did I know that the American Civil War doctor (played by Sean Penn) actually played an important role in its creation. I thought Sean Penn stole the show, what a phenomenal acting performance. Being able to go from an intelligent, well-spoken doctor to a madman throughout the movie was a joy to watch. I have to call out Bear McCreary's score also. I found it such a beautiful score that fit very well into the movie, and as a stand alone score, it is also equally a pleasure to listen to. I cannot oversell this move enough. I would love to see Sean Penn get some nominations or even awards for his role, simply amazing."}, {"id": 143, "text": "Not only was this a masterpiece in acting but you actually learn something. The movie title itself will not sell and I am still squeezing my brain what to call this to make it more appealing. I guess cast's names will do the selling. A must watch and good to see Penn back on the big screen."}, {"id": 144, "text": "Mel Gibson &amp; Sean Penn smashed the hell out of their roles , P.B Sherman Nailed it as well . it is quite good ."}, {"id": 145, "text": "Sean Penn is outstanding in his character! Personally, doesn't like Natalie for he wired lips and mimics."}, {"id": 146, "text": "Sean Penn is outstanding as the madman, Dr WC Minor."}, {"id": 147, "text": "Finally a movie without the bad words a movie full of linguistic treasure with a great story That is exactly what you expect to watch from 2 great stars Penn &amp; Gebson"}, {"id": 148, "text": "I am talking about three characters: Dr. William (America), James (Britain) and Eliza (Gold). We see the map of the world and the areas occupied by Britain, including America, which raises many questions. We are talking about Dr. William at the age of 48 years with knowledge and ability, and his religion is not known. The first interview between William and James William talks about the comparison between him and James, Who is the smartest and who is the madman William casts a look at the iron chain linked to his feet. Is it a sign of British hegemony over America? William cuts off the reproductive organ. Is it a sign of Britain's eternal loyalty? There is a lot of ambiguity, but employing the story is very dramatic"}, {"id": 149, "text": "If love, then love. All great work needs love, strong will, and persistence. Great storyline, about passion, sacrifice, and forgiveness. It's worth watching, especially when you need some encouragement."}, {"id": 150, "text": "If you like reading dictionaries, then maybe you will love this movie but if you don't, then don't be surprised if you're asleep halfway thru. This has a great cast of actors but the casting is terrible. Some of the scenes are laughable for their over earnest attempt to be period correct. This movie also has a lot of plot point elements that should be interesting but aren't which you can only blame on the directing. Too many elements and too many messages and all told in the most banal way. The costume design and production sets are well done but then why wouldn't they be considering how many films, and series have been made about this time period just in the past few years. I really wanted to like this movie but half way thru I was too bored for words. I also felt like I'd been bludgeoned by victorian era nerds. There's just too many historical messages they're trying to get across both clumsily and 'ham handed'. 1) the story hinges on sympathy for penn's character. Fail. Epic fail. 2) the story hinges on sympathy for mel gibson's character. Fail. The story is cliche. To make it a dramatic piece they of course have to make the main character struggle against great adversities but they never quite make it relatable and clear how difficult it was to make a dictionary, or what real adversities he had to deal with. It could be done but it wasn't in this movie. Similarly they never quite make it relatable and clear how backward psychiatry was in the victorian period. It can be done and it has been done before on film but not in this film. 3) the story hinges on sympathy for natalie dormer's character. Fail. Her performance was wonderful to watch but I wonder if she knew how comical she looked in different scenes with regard to the context of the story. We only see her a few times but we're expected to believe that she makes this great transition in every scene throughout the movie. I know that they're dumbing down films for audiences but this is a bit too far. My advice to everyone behind this production, go back to film school and pay attention this time. I predict that this movie will be a flop and the backers will claim it's a film genre not in favor by the audience today but that's nonsense. If it was a well told, well cast, well acted story, audiences wouldn't hesitate plopping down $15 to see it.Here's one not in the movie: definition of twiat - an adjective; little used phrase for stupidity or complete ignorance. Most commonly used by the celts to remove the obviously undesirable strands of rna/dna from the gene pool by breeding. Judging by reviews here, the husbandry hasn't been successful."}, {"id": 151, "text": "Title is pretty terrible, but the story compelling and revealing. A stellar performance by Penn, the best I've ever seen him, Gibson is also very good and there are a number of great performances by a quality supportIng cast. This was a good movie, its raised my opinion of Amazon Original programming massively, hope they keep on improving."}, {"id": 152, "text": "Not a film for those living on the edge and wanting full on testosterone, but for those wanting a story, this might be for you. It's a strong story without derailing or veering off on tangents, the acting has no compromise and whilst I'm sure viewer's may have bucket lists for actors that could have played the part for me their appointments couldn't have been filled any better. Mel Gibson died with braveheart for me and Penn was always a nearly actor but not quite. Having watched this with great concentration my views have turned. I tip my hat to this film."}, {"id": 153, "text": "I knew nothing about this story, until I saw this movie. I learned what happened, and it is was very well shot - a total change for me to watch this type of movie - I enjoyed it."}, {"id": 154, "text": "I love how the 2 actors come together. It is a story where you keep interested and especially when you know it's based on a real professor and madman. Tears in my eyes for the ''madman' genius. The film is underrated bij de critics, I think because of Mel Gibson. He is because passion of the Christ not Hollywood favorite, so i like him even more!"}, {"id": 155, "text": "A movie, which you'll remember for days. oscar worthy performances."}, {"id": 156, "text": "I have to admit I was skeptical about Mel Gibson being The Professor. As much as I disdain him as a person, he is a great actor. Hopefully not much of his personality is included(i.e he is not directing or scripting) to produce an atrcious result like Apocalypto. As for Sean Penn, simply outstanding."}, {"id": 157, "text": "Sean Penn is flat-out incredible. What a shared gift he delivered. Mel Gibson too carried a super performance. I kept saying Gibson has still got that brilliant, acting twinkle and better than ever."}, {"id": 158, "text": "Slow. Long. Boring. And quite caricatural in the acting. Almost fell asleep. Could have been way better"}, {"id": 159, "text": "Who ar ethe wahoos who determine these things? Sean penn most certainly deserved a nod at the best actor categories supported or main. A great period piece of a unknown story of something every single one of us have used in our lives. Available on Netflix."}, {"id": 160, "text": "I'm no critic , but I love movies and I can appreciate a good performance, all I need to say is I believed Mr. PENN AND Mr. GIBSON in their brilliant performance , a great story needed a great performance, well done gentlemen, well done ..."}, {"id": 161, "text": "Entertaining and intriguing period movie with fine acting, especially by Penn. With all the junk coming out of Hollywood in the past few years, this was a refreshing exception."}, {"id": 162, "text": "This is flat out a great movie. The acting is superb on all fronts. Mel Gibson is particularly good and Sean Penn finally gets a role worthy of his talent."}, {"id": 163, "text": "It's ironic Sean Penn plays the mad man, to be such a great actor I believe there is has to be madness in such a amazing person (Mel Gibson) as well. The dialogue between the actors I wish still existed these days, toying around with words and finding amusement. Beautifully written amazingly acted wonderfully filmed. Watch and hold your judgments until the very end."}, {"id": 164, "text": "I didn't feel like watching new movies for a long time, because most of them are poor in quality, being more preoccupied with promoting certain interests, minorities, etc. The cast convinced me to watch it and I can say that I am not sorry. Sean Penn and Mel Gibson had some excellent performances, all is not lost yet."}, {"id": 165, "text": "A great film, fascinating subject, magnificent performances, an unique challenge for Sean Penn and nothing more than admirable work. A film about words and their people, powerful, impecable crafted, telling not exactly a story but showing the bones and muscles of it. Short, an old fashion project, ambitious, impressive, touching and precise in each line of its message."}, {"id": 166, "text": "Was enthralled from first minute to last. Not a film that's subject particularly interested me but Gibson and Penn especially capture your interest completely throughout despite the odd issue. The supporting cast also were very good and it never felt slow or dragged at any point which was my main worry before watching. A true joy to watch."}, {"id": 167, "text": "Don't know why I hadn't heard of this film - just appeared on Prime. Looked like a good cast &amp; interesting story. We enjoyed it, characters with depth, well written and excellently acted. Sean Penn is particularly good."}, {"id": 168, "text": "A dramatic retelling of the story behind the creation of the Oxford English Dictionary.This movie was more than I expected. I was prepared for it to be about as interesting as watching paint dry and found myself engrossed in the story.Gibson and Penn were strong leads and backed up by an excellent supporting cast."}, {"id": 169, "text": "I was perplexed to see how the positive effect left on me after watching this great movie was so opposite to the low points given by the critics. A historical fact about Oxford Dictionary transcribed effectively to the cinema accoupled with the great performances of Penn and Gibson. The lesson learned that I decided not to decide to watch a movie or not merely based on the views of the professional critics. To err is human..."}, {"id": 170, "text": "A British drama based on real events. Quality. The script is spectacular. Sean Penn and Mel Gibson protagonists who are still great actors. It is about a man who allows him to make a great dictionary of the English language and how a man convicted of murder assists him in creating this one. With pleasant moments, anguished moments and others of pain. Talk about the forgiveness and love we can give to others and the ways in which one can repent. The time is spectacularly recreated. Show data, dates and places. Safety pin"}, {"id": 171, "text": "I very well passed story with a good score to keep it moving along. Strong performances by all involved. Quite informative about how the origins of the dictionary worked and word research. All in all, a good watch."}, {"id": 172, "text": "Incredible! That is the First filme that make me come here to write an testimony. Deserved to have won oscars!"}, {"id": 173, "text": "Such a well acted story. Sean Penn, Mel Gibson along with the other actors portrayed such intense &amp; sensitive individuals. I'm sorry to hear about production problems resulting in not much promotion.... too bad. Excellent story based on true events.... it was really captivating!!!"}, {"id": 174, "text": "Its been a while since mel gibson works out a good movie. This deserves two thumbs up. Who knows u can insert excitement on a history of an Oxford Dictionary."}, {"id": 175, "text": "Beautiful film. Intelligent and sensitive. I was totally engrossed from the beginning."}, {"id": 176, "text": "Am, have been, a big fan of Excalibur and seeing that this film was written by John Boorman, who also wrote Excalibur, I felt compelled to watch. What a superb, undiscovered to me, tale, of the origins of the Oxford English Dictionary. Superb acting by all cast, with the stellar headline names of Mel Gibson and Sean Penn. Fantastically acted, excellently written and just a MUST WATCH. Again, compelling."}, {"id": 177, "text": "I thought Professor the madman was an excellent story Sean Penn did his part playing a schizophrenic doctor"}, {"id": 178, "text": "This is the best effort I've seen from Sean Penn since Milk almost twelve years ago. His portrayal of the schizophrenic William Chester Minor who, having spent almost 40 years of his life in Broadmoor psychiatric hospital, became one of the single most significant contributors to the orginal Oxford Dictionary of English is superb. He captures the flaws of this paranoid etymologist warts and all, and gels very well with Mel Gibson who, as the compiler of the tome - Dr. James Murray - also turns in a good, strong and, latterly, sympathetic and understanding performance too. This is essentially a double-hander with Natalie Dormer, Eddie Marsan and Steve Coogan helping to explain the story and releasing some of the emotional steam from time to time. It's a little slow in places, two hours could have done justice to this interesting story, but just not this version - it seems overly padded at time. As you'd expect; it looks great with plenty of serious attention to detail and it also shines a little light on Victorian/Edwardian attitudes to mental illness."}, {"id": 179, "text": "The Professor and the Madman Many years ago, I read a book for a linguistics class, The Professor and the Madman. It is the story behind the creation of the Oxford English Dictionary. I thought it was dark and brilliant and at the time I wanted to be a lexicographer. Little did I know, a movie based on the book was made last year. I wondered why I hadn't heard of this movie coming out and it turns out there was a legal battle about its release and Mel Gibson refused to promote it. The critics didn't like it but viewer ratings were good. The casting and subsequent performances were wonderful and while books are usually better than their films, this is a fair submission."}, {"id": 180, "text": "I don't know why this film was wasn't released theatrically. I don't know why it was basically kept as a secret. I can only speculate... But it means nothing. This is a gorgeous film with a ton of redeeming qualities. Sean Penn might be the best actor to portray vulnerability ever. Mel Gibson is on his A-game as well with a portrayal of a man who wishes to do right by his wife and his friend, Penn's character. The supporting cast is top notch. The widow, the security guard, superintendent doctor and so on. This is a film everyone involved believed in... And for good reason. It's a shame nobody else did. This is not an easy watch, but it isn't a brutal one either. The director and cinematographer really did a wonderful job of using architecture as a character in this film. The idea that a film about the people who helped create the Oxford dictionary is not only entertaining, but meaningful is a real achievement. This film deserves recognition."}, {"id": 181, "text": "There is a film now and again which is routinely snubbed by those that know and those that go.While this is no Shawshank, it's not a million miles away.Gibson and Penn (and Marsan) are magnificent. The story needs telling.I would urge The Interested (those of interested minds) to see this. It's simply a great drama, well acted."}, {"id": 182, "text": "I don't understand the bad reviews by film critics purely based on who the two main actors are. Their performances are tremendously good and the film is an extremely interesting dramatisation of an epic enterprise. Thoroughly enjoyed it."}, {"id": 183, "text": "The Professor and the Madman is likely to interest only logophiles and geeks. In some ways, it´s the story of OCD, and what men will do in a quest for completion. Sean Penn´s performance is truly outstanding as the ¨madman¨ wracked with guilt over a crime which was itself a result of equally guilt-ridden, phantasmagoric delusions. He came to believe that he was being pursued by a soldier whom he had harmed (branding him with a ´D´ for ´deserter´ on his face) during the war. Ultimately, it appears that he has gone nuts as a result of profound regret for all of what he did during his military service. As for Mel Gibson, he is pretty convincing as the Scottish autodidact and polyglot who somehow persuaded Oxford to allow him to head up the massive dictionary project.I would characterize this as an intellectual film, as there is lots to think about here, including the distinction between criminals and the criminally insane, the role of psychiatry in ¨treating¨ such persons, and of course some critical perspectives of academia and bureaucratic institutions more generally.Action flick aficionados will likely be bored to tears, as the only signs of violence are the branding and what appear to be holes drilled into the poor madman´s head as a part of the new ¨more invasive¨ treatments of which he was made the victim. For history buffs, there is much to like in this period piece. Plenty of grist for the mills of psychiatry critics/skeptics as well."}, {"id": 184, "text": "This movie was a very good one! I don't know who pays these critics but they have no idea of what a good movie is. It's definitely a movie around 7/10.Sean's performance was incredible. One of his best and yet so underrated."}, {"id": 185, "text": "The critics blew it again. This poorly reviewed film is an outstanding entertainment.Sean Penn delivers a great, powerful performance. He brings an intense, painful character to life. Mel Gibson is also wonderful, as much as I abhor his personal bigotry and behavior. Natalie Dormer is not the girl from Hunger Games. She delivers a nuanced performance.This true story about the birth of Oxford English Dictionary is far from expected. It is full of intrigue, suffering, and triumph. Don't miss it."}, {"id": 186, "text": "While I had no great expectations of this movie I was pleasantly surprised both by the acting and script. Who would have thought a movie about a dictionary could be so good. A sticking point for me, as a Scotsman, was Mel's Scottish accent, sometimes it sounded like he was slipping into his William Wallace character from Brave Heart. But his acting and character made up for this little hiccup. Not normally a fan of Sean Penn, but he's great in this. Overall a good movie , well worthy of a second viewing."}, {"id": 187, "text": "I had read the book so I was aware of this almost unbelievable, true story of two brilliant men working together to create something never before even imagined, but the movie itself exceeded all my expectations, with it's wonderful acting and beautiful scenes.Watching Dr. Minor's room in the asylum fill with books and notes as he worked on the dictionary was a visual I'll never forget. How long I have waited to see someone with severe mental illness portrayed realistically, from his worst psychotic episodes to his quiet ordinary days. Sean Penn did a wonderful job. It brought tears to my eyes to see him struggling to do his dedicated work in spite of the distractions of his paranoia and delusions."}, {"id": 188, "text": "Wonderful movie and a story line and an Oscar performance by Sean Penn"}, {"id": 189, "text": "Ignore the critics, the film is a masterpiece. It brings the best in both Penn and Gibson. Very well-written dialogue and phenomenal acting. Most underrated film ever and future generations will hate us for letting it pass without giving the credit it deserves. Oscar worthy"}, {"id": 190, "text": "Every performance from the actors was great but Sean Penn was outstanding. Along with the notion of this movie-story,it deserves my 10 from me! Peace and love!"}, {"id": 191, "text": "I was hesitated to watch the movie as I'm always picky about what I watch eventhough I had a hunch that the movie has a good performance from both heavy weight Oscar winners , they both deserve to win another Oscar for their performance in that movie , the movie tells a story so I don't expect everyone to like it but what blew my mind away is the performance, specifically Penn's performance, Penn is one of the few actors that you will believe whatever they will say in a movie , He's the kind of actor that you would watch a movie just enjoy the way how he executes his role , I don't care much if they did win Oscars but these two guys did a great job to deliver the image they wanted people to see in the story they were telling , watch the movie , think about the meanings in it and enjoy the performance."}, {"id": 192, "text": "Watched this with no knowledge or expectations of the subject. What a cast and everyone of them deserving praise. A total inspiration an Oscar nomination direction and cast"}, {"id": 193, "text": "I thought this was a wonderful film. Although from my research, the story line in the film has been dramatised, much of the detail is pretty accurate. It is a wonderful story and has been well acted by a great cast. Highly recommend."}, {"id": 194, "text": "Absolutely beautiful!!! Couldn't take me eyes off this film! Sean Penn and Mel Gibson oh my goodness!!"}, {"id": 195, "text": "For me, this movie is a pure 10. After watching so many dull superhero and blockbuster movies with propaganda messages, this movie restored my faith in the art of cinema. I fell asleep during the new Godzilla but i watched this with great interest and big emotions.I am aware that some will not enjoy this as much as I did but if you do watch it, try noticing how subtly the virtues of faith, hope and love (which is the most obvious) are presented and lead the characters in life."}, {"id": 196, "text": "Just throw some Oscars in the general way of Mel Gibson &amp; Sean Penn and then some best supporting role Oscars to the rest of the actors. How the writing of the Oxford English Dictionary could be this interesting, I do not know. But it is: Mainly because of the actors. I want more Apocalypse now and similar from Mel, but he certainly did not disappoint in this more normal movie."}, {"id": 197, "text": "I wanted to like this more than I did. It's certainly not because of the acting, script, directing or cinematography. This is a fine film by any account with excellent performances by all. It's just dull. We don't really get much insight into Dr. Miner's illness and the baddies aren't so bad. Ian Gruffudd is under utilized, imo.The only part that annoyed me was Mrs. Murray. I swear, if it's a biopic about a man and his accomplishments, there's this need to put something for the women to do. Some scene or context that is magnified as some counter-balance just to lure women viewers, I guess? It's a tired trope and annoying.I saw this in First Man as well and we don't need it. I would have no objections to a biopic with a woman subject that concentrated solely on them without having to flesh out her husband/lover, unless it was germaine to the story. It felt forced in my two examples."}, {"id": 198, "text": "5/10 - impressive acting could not salvage a rather flat plot"}, {"id": 199, "text": "It is only April as I write this review, but Sean Penn can begin preparing his Oscar speech for best actor next year. He is absolutely riveting as Dr. William Minor, an American surgeon who lost his marbles during the Civil War and wound up in England for a little r &amp; r. Under severe delusions he killed a completely innocent man and ended up at Broadmoor, Britain's infamous asylum. Through a series of improbable events, Minor connects with Professor James Murray, a man obsessed with the creation of the Oxford English Dictionary. The pair combine for the creation of the great book. The movie is based upon the book by Simon Winchester, and it is faithful adaptation of the excellent read. Mel Gibson is Murray and he is as equally believable as Penn is as Minor. The supporting cast are also excellent. So far, The Professor and the Madman is the best movie of the year."}, {"id": 200, "text": "This is going on the bookshelf next to the dictionary. Absolute ly spectacular. I watched Bohemian Rhapsody the night before and I rated that highly but this absolute ly blew that out of the water for me. The quality of the film and the justice done by the piece as a whole was breathtaking (and quite literally. I had to follow my partners voice back to reality afterwards just to collect myself). I loved It and I'm looking forward to watching it again with my children one day! Well Done"}, {"id": 201, "text": "I have not always been a Sean Penn fan, however, there are a few films in which he has demonstrated his ability as an actor that exceeded expectations. In this film, he has presented an exquisite performance alongside the adequate performance, at least in this film, of Mel Gibson. Watch it... it's a true story and a fascinating one."}, {"id": 202, "text": "Thank you for your diligence Mel Gibson in pushing to make this a wonderful representation of truth to life! I love it when we find a true story that peaks my families interest into the history of the meaning of words in dictionaries we have relied on with very little thought as to whom put so much of their lives into creating! Sean Penn was masterful! Even though it wasn't exactly as you wanted it be completed, please know it is still captivating and one of the best movies I have seen in sometime! To the whole cast-Thank you! Please continue to choose works that tell the stories of real lives! If love......then what?"}, {"id": 203, "text": "Lovely, suspenseful, believable. At last a movie to let one think and feel the splendor of complexity without pretensions. Fabulous work."}, {"id": 204, "text": "Perfect. very worthwhile film. One of the few ever made."}, {"id": 205, "text": "Feelings. So many feelings on so many different levels. The cinematography takes you directly to the all grey Victorian era. Gibson and Penn give their best. And the way that the director uses the tempo of the editing is amazing. We definitely need more films like this one"}, {"id": 206, "text": "I'm not sure why this movie was torn apart by critics. I read the book the film was based on &amp; felt it did a good job bringing the story to life. There is one scene that is played out as if it actually happened when the author merely said it was a possibility, but not likely. Other than that the basics of the story are all intact. I thoroughly enjoyed this film &amp; am glad it came to fruition."}, {"id": 207, "text": "The film narrates historical process of Oxford English Dictionary in the middle of political tendencies of Empire, power conflicts of state bureaucracy, domination of market apprehensions on scientific production. Two man, one of who is a non-certificated mad researcher and the other; a mad genious who is prisoned because of a murder. The left ones; desire on knowledge, questions on sense of justice or nature of true love..."}, {"id": 208, "text": "Too bad - this got caught up in the politics of movie making. Really enjoyed it."}, {"id": 209, "text": "I won't get all wordy, but plain and simply put, Gibson &amp; Penn may have done their best work here. I watched the film with no expectations and finished surprised and very satisfied. I will watch this movie again and recommend it."}, {"id": 210, "text": "Saw this film last night and was just totally blown away. Great acting teamed with a great script based upon a special slice of time. Please don't miss it."}, {"id": 211, "text": "Simply one of the best movies I've ever watched. If it doesn't get several Oscar nominations then they will discredit themselves and the professional criticas already have."}, {"id": 212, "text": "Incredible movie. Went into this not knowing what to expect, and I left in awe and in tears. In recent times, I've lost faith in the sinking ship that is Hollywood ... this restored my faith that in the art of good storytelling and movie making. Thank you to those who clearly poured themselves into telling this powerful and gut wrenching story."}, {"id": 213, "text": "Very interesting and entertaining movie. Enjoyed seeing Mel Gibson and Sean Penn. Despite his personal life issues Mel Gibson is able to pull up a believable performance."}, {"id": 214, "text": "In an era when believing in something beyond one's self is out of step comes a film that doesn't write the passion of purpose and the power of selfless yet ultimately redeeming love out of the script. This film further surprises with unconvention. We see a psychiatrist who truly believes his misguided treatment is a mission of mercy. We aren't required to demonize him in order to reject his methods any more than we are expected to reject a man with mental health issues who murders another man in front of his wife. There are a few villains, but the dark cynicism that stars in so much entertainment these days is shoved aside by realism and hope.Sean Penn may be type-cast as a tortured soul, but he does it so, so well. Mel Gibson is excellent, as are Natalie Dormer and Jennifer Ehle."}, {"id": 215, "text": "The movie struggled to remain captivating but the acting was just excellent."}, {"id": 216, "text": "Beautifully acted, beautifully written. I don't usually watch movies but this captivated me from the start. So much happens in the first 8 minutes alone! This is the kind of movie I miss-brisk, emotional, reflective, and documenting the larger than life. This isn't the most coherent review, but I'm mostly just leaving one at all because I was so startled at the critical reaction. This deserves more views."}, {"id": 217, "text": "An honest reflection of that which is involved in actually achieving something---that is, starting something hard and battling to finish it---is a rare thing in a modern film. Indeed, one could be forgiven for thinking that modern society had forgotten that hard things require dedicated people to achieve them. Difficult things do not just happen because someone turned up. In the two characters portrayed in this movie, and through their relationships with their family and colleagues, the challenges and rewards of hard work are captured well."}, {"id": 218, "text": "I thought it was great! The acting, the pacing, the heartache... all made for a fine movie and historical work."}, {"id": 219, "text": "A riveting story which I knew nothing about before watching this film. The acting was of the great calibre we know these stars for providing. I was totally absorbed by the tale and how it unfolded."}, {"id": 220, "text": "And their performances are extraordinary, and there were slight holes here and there, and it didn't matter at all, and the quality of aesthetic and story and performances were nothing short of superb."}, {"id": 221, "text": "One of the best movies I have seen in quite a long time. Telling a story about an episode in history (and the characters involved) of which I never knew. I am ever so grateful that it's creators took on the commitment of providing us with this heartfelt labor of love and the revelation and complexities of the human spirit. My wife and I thank all concerned. Neither of us will ever forget it. The challenge now will be for someone to best it."}, {"id": 222, "text": "Looked a bit boring at first glance but my wife recommended it so gave it a go. Glad I did, the story was interesting and the performances from Mel Gibson and Sean Penn were brilliant supported by a fantastic British cast."}, {"id": 223, "text": "I read a few of the reviews before I decided to view this. Critics seemed to pan it and the general audience seemed to love it. I am so happy that I did not listen to the critics. My husband and I were riveted by it. The historical aspect of this is fascinating and the acting is stellar. I would not be surprised to see Penn get nominated for an Oscar, Gibson is equally fine. Masters at what they do. Their chemistry is palpable and I am so happy to have learned something I did not know about the genesis of the Oxford English dictionary. Watch this gripping movie. I do not see what the critics do, not sure what their criteria is for a movie well done but they definitely dropped the ball on this one in my opinion. People watch movies to be entertained, moved, escapism, etc..and this ticks all those boxes."}, {"id": 224, "text": "Excellent filmic rendition of the book. Penn's portrayal of the gifted but tortured Minor is brilliant. Read the book first of you can. The metacritic reviews (which I normally find reliable) are nonsense, so much so, that I suspect their sincerity."}, {"id": 225, "text": "This film brings to life the story of the early stages of the development of the Oxford English Dictionary. Film makers can get caught up in all sorts of technical, legal and egotistical issues, but at the end of the day, the end product should only be judged on the value of the story how well the story is told. Having watched this tonight I say BRAVO. An important story, well told."}, {"id": 226, "text": "At first look at the plot I was not enthralled by the prospect of a film biographic on the invention of the dictionary, however I was surprised and delighted at the result.In particular Sean Penns incrediblebly powerful Oscar deserving performance,which takes this film to new heights beyond it's already brilliant dimensions. Add in Mel Gibson's stunning performance and you have an almost perfect film. Despite the Backlash of behind the scenes disgruntlements between Gibson,Director Safinia and studio Voltage, this film should be be a proud addition to cast and crew alikes Resume'.Another noteworthy role is that of Natalie Dormer,who blew me away with her performance.what an emotional rollercoaster of a movie"}, {"id": 227, "text": "For many years, Changeling (2008) was my all-time favorite movie. That changed with this exceptionally made film! I could use a dictionary, as no words I know are good enough to describe it! Absolute beauty!"}, {"id": 228, "text": "What a great movie. It's a drama so slow burning but based on fact. If you watch it for nothing else than the first time the Professor meets the Madman and the wit and conversation between them then you have watched the best bit of the film. Mel Gibson back in his prime and Sean Penn is sublime. Loved it!!"}, {"id": 229, "text": "Outrageous acting by actors/actresses. For a long time I have not watched a drama movie based on hope, friendship and endurance. I can not say anything about cinematography because I am not an expert. But as a normal-standard cinema fan I can say this movie is epic. After Shawshank Redemption, this movie got the second place in my mind. I can watch it repeatedly. Lots of things has been said about Mel Gibson's acting. This movie shows me that he is still somewhere over the moon. Thanks for being and still acting. Sean Penn... With this image he proofs us that he can act even Gandalf or Dumbledore perfect. I know nothing about filming or the sector but this movie make me feel 'everything may be all right with high possibility.' Which means 'Hope'."}, {"id": 230, "text": "Wonderful and captivating, 'The Professor and the Madman' could have been tightened in several places but it stays engaging thanks to superb acting performances and great chemistry between the three main characters with some heartfelt scenes to it."}, {"id": 231, "text": "Incredible acting from all involved, especially Sean Penn. Totally captivating film from beginning to end. A high class piece of filmmaking which restores one's faith that proper acting can prevail."}, {"id": 232, "text": "SPOILERS ...one of the two films directed by iranian Farhad Safinia. Sean Penn and Mel Gibson. James Murray (Gibson) is compiling a collection of every word used in the english language, and receives numerous entries from Dr. Minor. Minor (Penn) happens to be a patient in the asylum for the insane. according to wikipedia dot org, there was quite the legal battle involving GIbson, Safinia, and the production company; due to being denied permission to film in Oxford, Gibson claimed he was not allowed to complete the film; he lost the case, and was forced to complete filming in alternate locations. also acc to wikipedia, the actual doctor minor mutilated himself horribly, and was diagnosed as schizophrenic. the film itself is quite graphic and violent, and not for the children! British author and comic Steve Coogan is Frederick Furnivall. interesting intersection of people coming together from different walks of life. pretty graphic though."}, {"id": 233, "text": "Sean played out standing role I call it frightens acting and highly recommend the Oscar was pretty much equal to role mastic river who won Oscar before, Mil Gibson was very sold performance. Excellent enjoyable movie to watch"}, {"id": 234, "text": "You must watch this if you are an academic, particularly if you rely upon a research base to your work and career. Wait for the lines between the two main characters about the difference between being a madman and a professor. Research, scholarship require madness to pursue, to deal with the self doubt, the critique and politicking of your peers, the time it steals from family and friends. Few of us, academics or otherwise, will achieve the satisfaction of knowing that you have contributed to something as everlasting as the Oxford English Dictionary. But we can all live in the hope that we can move things forward in our lives if only just a smidgen. Look that last word up in the Oxford English to understand how it differs from a regular dictionary. It helped me understand the film in that I was ignorant of the difference until a month or so before watching it. Some great acting too coupled with clear photography and sound. There's a back story about conflicts between the cast and others which somehow detracts from a film that has all the hallmarks of becoming a modern classic."}, {"id": 235, "text": "It is about the Oxford dictionary. But this film is so much more. It is about madness, suffering, compassion, forgiveness and love. The acting is very good (never saw Mel Gibson acting like this) and the dialogues are great, without being pompous. I have rated a film a 10 only once before. But this film deserves it. It is really, really beautiful."}, {"id": 236, "text": "Beautiful , well played, well told, great cinematography , very nice subject ... perfect !You don't understand how 2 hours flows...Oscar quality film !"}, {"id": 237, "text": "I am writing this review just at the half of the movie. For a long time i have not watched such a good movie like this one. Good is not good enough to describe it. Just imagine the best word for yourself and use it to describe the movie."}, {"id": 238, "text": "It is definitely a story to be told, first attempt on radical cooperation and I thought Wikipedia was so original......I believed every word, every emotion. This movie moved me far away from my world and that is what I love."}, {"id": 239, "text": "All the aspects that make a tale engrossing are at play in this movie . From the start I was involved with all the characters and the plot and , as it unfolded , so both drama and lead roles became richer and even more believable and moving ."}, {"id": 240, "text": "... and I didn't need a dictionary nor the word's etymology to do it for this movie.Brilliant performances from both Penn and Gibson as the leads and from Marsan and Dormer in supporting roles.And the subject. It was a delight to know how good old dictionary came about!A pretty good watch overall."}, {"id": 241, "text": "A simply outstanding adaptation of Simon Winchester's book, with first class performances from Mel Gibson and Sean Penn in particular. Also a great reminder of just how versatile Steve Coogan is. I suggest that the critics lack the academic understanding to really appreciate the film - don't heed their reviews!"}, {"id": 242, "text": "This movie is great. The story is very interesting and original, beautifully filmed with great scenery. Then the acting is superb. Mel Gibson and Sean Penn are incredibly good and Natalie Dormer gives a very touching performance. A movie to watch !"}, {"id": 243, "text": "The movie is good, but Sean Penn's performance its amazing.I can't believe he wasn't even nominated"}, {"id": 244, "text": "One of the best movies i have ever seen .. full of drama , morals and good performance"}, {"id": 245, "text": "Packed with world class actors together with a real film storyline, no cgi bull, was always going to produce top class entertainment."}, {"id": 246, "text": "I can't understand why subjective people who call themselves apt for giving metacritics, are giving such a low score.. This film is a pleasure, educative, art and well written!"}, {"id": 247, "text": "Simply a gem! Finally a movie that showing to corrupted Hollywood what a real cinematography should be! Go ahead and watch it, you won't regret! Ignore all that fake critics!"}, {"id": 248, "text": "Loved every bit of it. Beautifully played, very impressed by the actors. Casted perfectly, want to watch it again!"}, {"id": 249, "text": "How did Sean Penn not even get nominated? Probably the best performance of his life. The rest of the cast were great too and Natalie Dormer just keeps getting better. Great film and pretty much true to the real events."}, {"id": 250, "text": "Heartfelt and touching story. Will live long in the memory."}, {"id": 251, "text": "I think it is a very underestimated film, also for this reason I rate it 10. The story is original, compelling and it makes us think deeply about the theme of madness. Sean Penn and Mel Gibson still at the top in my honest opinioni."}, {"id": 252, "text": "Beautifully acted, tear-jerking. Fine performances from not just Penn and Gibson: all the characters"}, {"id": 253, "text": "Ebert would be turning around his grave hearing his colleagues critiques. 1.5 out of 4? What planet? I say 10 out of 10. Surprising acting from so many from Mel Gibson with a Scottish accent and a British performance but not Braveheart. Sean Penn so sympathetic and passionate and realistic for the period. Eddie Marsan who I love acting but his care and love with his relationship with Minor as his prison warden. So easy being the other way. Natalie Dormer wow what a performance. And Jennifer Ehle is so much like Helen Mirren or Meryl Streep! So many different aspects of relationships and angles I really loved and lived a real story. Great job. x"}, {"id": 254, "text": "This movie is so interesting en moving, a must see!!"}, {"id": 255, "text": "Why the split between professional critics and consumers? I do suspect it is Mr. Gibson being in the film"}, {"id": 256, "text": "Well told ,little known story about the provenance of our dictionary. Good acting and directing."}, {"id": 257, "text": "Mel Gibson's performance was stellar and well written. Could have been a great movie but Sean Penn's performance and verbal acting skills lacked the polish of the script/movie deserved. Sean should stick with cops and robbers and lesser difficult scripts. I'm not saying Sean is a bad actor but this was way above his ability. This could have been a Master Piece Theater quality movie but it isn't ! Too bad - I would love to see this remade someday."}, {"id": 258, "text": "Not poorly written, not poorly acted, not poorly directed. It was just incredibly boring. There was no climax at all. It was just two different guys bonding by writing a dictionary they never completed. Flat out boring story."}, {"id": 259, "text": "Good Movie that telling a story of a enduraning Proffesser that he's about to make an Oxford Dictionary through some hardships but Possible changes the story with the MadMan Must Wacth and a Thriller"}, {"id": 260, "text": "Despite the amazing performance of the all stellar cast, the overall high production quality and the coherent, well written story, I couldn't relate to the movie. I saw two main themes in the movie: a) The madman's (Penn) crime/love/passion story and b) The creation of the dictionary. Neither of them touched my feelings.I think that the madman's story is a twisted one and I think people have polarizing opinions regarding it. However, the second theme is where I was absolutely indifferent. They have concentrated on the creation of English dictionary and presented it as one of the greatest achievements of humanity. Is it? I wonder what an average English speaking person thinks about that. For some reason, seeing 'The Professor and the Madman' reminded me of 'Amazing Grace', though the latter cares about people and the former about books."}, {"id": 261, "text": "First of all I think everybody should calm down, or at least the ones that speak of Oscar winning performances. There is no doubt the acting was good, and that's what you should expect from names like Sean Penn, Natalie Dormer and Mel Gibson, but I can assure you they won't win an Oscar for this movie. Let's just be realistic, the movie is sometimes a bit long and boring, not really a captivating movie as the story concerns. And it's not because it's based on a true story that it makes it better. But like said before the acting is good so for that alone it's a movie worth watching. Would I watch it a second time though? No, absolutely not."}, {"id": 262, "text": "I praise this film as the ABSOLUTE BEST MOVIE of 2019! This true story rates right up there with the fictional Hostiles (2017) in describing the vicious terrain of evil, hatred, bitterness, betrayal, repentance, forgiveness and respect for our fellow humanity which we must all travel over. NOTE:Ironically, in my despised disgust for the actor, I have NEVER recommended a Sean Penn movie before this one. I had to look past a LOT to even WATCH it."}, {"id": 263, "text": "Mel Gibson, happy to see him back! Mel Gibson is outstanding man in be actor or director or producer. Your legend never seen before. this movie not about dictionary drama it's more than that. The narrative style of this film is very hard to follow because it's in alphabetical rather than chronological order. epic movie it is like a masterpiece those beards deserve an Oscar"}, {"id": 264, "text": "Don't usually write reviews, english is not my first language, but I can't believe they say this is good acting, given Natalie is really good, Gibson and Penn: just egotistical actors, doing the same as always, terrible. Is all marketing. Don't believe the hype."}, {"id": 265, "text": "Amazing History behind the Oxford Dictionary with several amazing actors and background. Loved this movie which urged me to further study the history. Incredible facts but a bit slow with a bit too much emphasis on the weird stuff."}, {"id": 266, "text": "This is unwatchable. I read the reviews and thought that this is actually a great movie for Saturday night, and boy was I wrong. Director did a terrible job, I couldn't last over 45 minutes (and I watch every movie till the end, no matter how bad it is). Do not waste your time"}, {"id": 267, "text": "Yes the acting is good , cant argue with it. I wish there were more linguistic value on dictionary making part -! Most of the film about a mad man and his sufferings. Personally I dont like to watch any other  crazy man doing good stuff film 🙄. Quite boring-!"}, {"id": 268, "text": "In this World of Decreased Value we live in, an authentic story like this is just-in-time and completely on point to remind us of the beauty of etymology - and what we take for granted every day.Enlightened Mel Gibson is the perfect character to embody the immortality of human will, persistence and directed rebellion towards the uptigh narcissistic academics focused only on themselves. History of the world is a history of words on its own, and it leaves us to question the future that this day and age of digitalization, abbreviations and yeets will bring upon future generations.Unless you are a 15-y/o social media influencer wannabe, go witness this story of a man's life work and his complete dedication to the higher purpose. It will show you that real fairytales did in fact exist, we just gave up on them at some point."}, {"id": 269, "text": "I enjoyed this movie as a factual almost documentary story of accidental relationships. Mel has mellowed in his anti English stance and gave credit to England's contribution to the world when it was at it's peak. It was not a spiteful movie, i enjoyed its message."}, {"id": 270, "text": "I put off watching this, thinking how can a film about creating a dictionary be interesting! Couldn't have been more wrong. What a great film, loved it."}, {"id": 271, "text": "Well I was bored sitting in the house channel hopping, couldn't find anything so prime got turned on.. The title didn't exactly grip me, but thought why not. Gibson and Penn, I'll give it a go. Right from the start I was hucked. Gibson.. Braveheart sprung to mind from his first word and a performance to match. Penn.. probably the best performance I have ever seen, in my opinion even topping Dead man walking. I sat in front of the tv and never moved once. My god! This is a Amazon original? It was shocking, I had to take a second look at the poster just incase my eyes were playing tricks on me."}, {"id": 272, "text": "If you have the patience to watch this movie then you will be pleasantly surprised by this true life story of two men's life work. This was a almost impossible task but they managed to get to letter T in their life time, the rest was later completed just 6 years later. The film has a great cast and acting is very good, the only downer was subtitled ending rather than a narration as Almost impossible to read on Amazon prime whilst pausing."}, {"id": 273, "text": "A truly brilliant movie based on real life. Lessons about compassion, hope, trust in God and most of all, forgiveness. In this movie, that last word gets a whole new meaning."}, {"id": 274, "text": "I stumbled upon this movie by accident, started watching without knowing what to expect and, well... it is a precious marble. I actually shed some tears over it, something I rarely do. Maybe because I'm a sucker for language, words and books: aside from reading daily I work in a second hand bookshop. Anyway: even though I'm Dutch and English is mt second or third language I was fully enchanted by this movie. I was shocked by the nasty critics reviews though. 25 out of 100?! What did expect? Yet another typical Hollywood shooter? Shame on them. Thankfully most viewers love the movie."}, {"id": 275, "text": "Sometimes you have to wonder, how mad some people can be. On the other hand, who defines their madness and how can you help them? A situation that is similar to the help me, to help you. Well in this case help is being received, even if the person receiving the second chance may seem not worthy of that. But Sean Penn and Mel Gibson really are on top of their game.This is based on a true story and while that may feel like something some viewers dread, it does work in this case. Really thrilling and filled with suspense and human drama, this has it almost all. Very well made and quite a rollercoaster ride of a movie (if you like dramas)"}, {"id": 276, "text": "There isn't an itinerary for this comment. As iterations are dubious and nubilous. Could you get through it with sense and sentiment? Has it create in you a satisfaction of some intellectual or emotional need, even if you aware of that particular? If one is prompt in answering yes... The lexical questions, the epoch, the School, maneirisms... I see a touching piece of cinema. I am certain many agree. If they do not see a story of the nineteenths... If they do not devise men that can thinh otherwise... And have been the pillars of civilization.. Well, you are still in time to change and see humanity throughout this inspiring story. Not far from some, very real ones. Congrats to all, especially two, four, say six actors that performed according to the epoch and character. You know four for sure and some will pick not the same last two..."}, {"id": 277, "text": "Whether you're a Masterpiece Theater or Game of Thrones or fan, you'll be blown away by this fascinating, historic story and the absolutely superb acting of its entire cast--especially Penn and Gibson. I came across it on a transatlantic flight, and figured it might put me to sleep, but instead, it was so dramatic and suspenseful (and alternately moving and horrifying), that l watched it with complete absorption-- and I'm still riveted by it. Ignore the reviews of a handful of European critics, listen to what audiences are saying, and, above all, see it yourself."}, {"id": 278, "text": "I don't know how could you have all these actress and actors.. and make a such boring movie"}, {"id": 279, "text": "Too long and repetitive thus boring script but very solid performances on cast."}, {"id": 280, "text": "FINALLY SOMETHING WORTH OF WATCHING! Highly recommend to watch ! Dont miss this movie"}, {"id": 281, "text": "Received a referral from a friend about the movie I had never heard anything about. We watched and thoroughly enjoyed Mel Gibson, Sean Penn and Natalie Dormer portray their roles in this movie. Sean Penn played the character of a madman very well. The supporting cast were also excellent in their portrayals. I would definitely recommend people seeing this movie."}, {"id": 282, "text": "Like most I was going to watch it because Gibson and Penn were in it. So I went out of my way to watch it. I was not sure after the first five minutes, i thought it was a bit of a mish mash then it unfolded bit by bit into what I thought was a very good movie. Mr Penn didn't seem to overact and Mr Gibson pulled off a really good Scottish accent, (better than his Oscar winning movie anyway). Most of the acting was well done, the story was magnificent. The scenery for the time period was good, the dress code too was spot on. There was a lapse though when over a time period everyone aged except Mr Gibsons children, but that is being picky and getting away from the the story. I would of enjoyed this movie no matter who was in the starring roles. as the story alone is a a good account of a tue story.(Unknown by me and I reckon millions of others). After watching it I was straight onto Google to learn more about these two men and this incredible tale)."}, {"id": 283, "text": "This film tells the story of a group of scholars and a mad man working on a comprehensive dictionary.The story is moving and engaging. One cannot be more impressed by the acting skills on display. It is a piece of otherwise forgotten history brought back to life."}, {"id": 284, "text": "The accents in this movie are near impossible to understand. That is, for anyone who has grown up outside UK! That is a huge mistake producers have made for a movie that was supposed to have gone global. Watching this movie was a frustrating experience to say the least.Hugely disappointed by movie makers I once considered great..."}, {"id": 285, "text": "Both his latest movies have been bobbins no idea why I think Mel is grt but this and concrete were rubbish bored me to death"}, {"id": 286, "text": "The Professor and the Madman explores the creation of the Oxford English Dictionary proposing a intriguing, fascinating and unbelievable bizarre story that took place in reality during Victorian era. But at the same time this historic biopic about pair of men who feature some good casts (Mel Gibson, Natalie Dormer and Sean Penn) fail to make an impact. The cinematography is pretty dull and the musical score does little to aid the narrative in any appreciable way. The film isn't truly bad or even worthy of extensive critique, rather, it is just dull, lifeless and somewhat uninteresting.Rating: 6+ / 7-"}, {"id": 287, "text": "A movie that needs to be watched because of the well-known actors' performance in it. Especially, Mel Gibson played well here after a long time, I must say."}, {"id": 288, "text": "This film is about a murderer William and Professor James working together to editing words for the Oxford English Dictionary to publish! Entire film quite bored actually! The score 3/10, I give is all because of Sean Penn acting in the film! All three intense scene in the film also portray by him! He kill a wrong guy at the beginning and make a female become widow! He save a prison guard after the prison guard's leg stab by a door fence! He castrate himself after the widow's daughter blame him for her father death! The widow forgive William and saying the note she left William for guessing is If love, then love! This scene a bit touching actually! At the end, James help William release from the prison and sent back to USA! James back to his room to continue his dictionary work and having fun with their family at the front yard! That's it! Director should increase the intensity of the film and done better with the ending! Disappointed!"}, {"id": 289, "text": "My 3x great Grandfather was George Merritt, the man killed by the madman. I can confirm that Eliza did not fall for the madman in any way. I understand artistic license and all that but that was an insane decision to make. He killed her husband and she somehow manages to forgive that. Nah m8. Better films to watch elsewhere."}, {"id": 290, "text": "This is an EDUCATIONAL (dont run away) and a dramatic movie with good acting by 2 leading actors, whom have made flop after flop recently, but both Sean Penn AND Mel Gibson perform excellently this time around. They still can act well! Many splendid supporting actors as well.The good: the story about the creation of one of the first dictionaries seemed boring at first glance; how does one make an interesting movie about a dictionary? They made it interesting because all the characters in this movie are being portrayed with so much verve and wit.Any bad? Yes, this story lasts 2 hours, which is about half an hour too long, therefore it becomes pretty tedious to watch half way through. Had more potential. Not recommended, yet not discarded either..."}, {"id": 291, "text": "Boring movie about English dictionary! I think that most of dictionaries of other languages has more interesting stories. Enjoy your most stupid 2 hours!"}, {"id": 292, "text": "Fox acting was incongruous and did not fit the script"}, {"id": 293, "text": "Somewhere in The Professor and the Madman is a great film waiting to be told, but suffering from cartoonish portrayals of madness, uneducated people suddenly gifted with just the right things to say, and drawn out emotion-filled monologues, a blind man could see the film was intended to cast a net for a nomination for Best Actor (or Actors) in a Motion Picture up to Best Picture. Sorry. I'm sure the Academy can see through the pretentiousness. So, is this recommended viewing? Nope. I did like the soundtrack, though. A tad on the maudlin/sappy side, but it should be able to stand a repeat or two."}, {"id": 294, "text": "There is a moment in The Professor and the Madman when a book is delivered to Dr. William Chester Minor, who, after being declared insane, is incarcerated in a British asylum. The book is Charles Dickens Great Expectations. Not surprisingly, the film has a Dickensian feel to it in the well-rounded characters and the broad sweep of British life in the nineteenth century.The focus of the film is the coming together of two improbable friends and soul mates. The names Sir James A. H. Murray and Dr. William Chester Minor sound like a couple of British upper-class males. But Murray is brilliant linguist who is an autodidact and the antithesis of the typical Oxford don. For his part, Minor is a shell-shocked veteran of the Civil War, who is eventually diagnosed with schizophrenia. This unlikely duo will team up for a sublime scholarly achievement.The two men meet by correspondence and begin their collaboration on one of the most ambitious publishing ventures in human history: the Oxford English Dictionary, a massive, twelve-volume compendium of 414,825 words. The unique feature of the dictionary is the quoted examples of the words over time. The illustrative citations number 1,827,306.Of course Murray and Minor did not complete the work in their lifetimes. Murray died in 1915 at a time when the dictionary had reached the letter t (turndown). In 1920, Minor died in America, where he was eventually deported. By the time of Minor's death, the dictionary had reached the letter v (vywer).The film is worth viewing both for the remarkable story of the dictionary, but also for the stellar performances. Mel Gibson is perfect as the iconoclastic linguist and family man Murray. But the truly unforgettable performance is that of Sean Penn as the mad Dr. Minor. The secondary roles were also brilliantly performed, especially the role of the widow Mrs. Merritt. Her transformation from loathing the man who killed her husband to eventually falling in love with him was somehow made credible by Dormer.A genuine buried treasure that has slipped under the radar, The Professor and the Madman will endure as a testament to the human spirit and creative genius of two eccentrics who joined forces to change the cultural landscape in the modern age."}, {"id": 295, "text": "Could not make it through this. There were the ingredients for an entertaining film here, but every five minutes someone has a mental breakdown or is giving some hyperbolic speech. The pacing was totally off.Just wanted a witty, intriguing film about writing a dictionary. Not a psychological ordeal. It reminded me of the recent butchered version of A Christmas Carol in its continual disturbed bleakness. Darkness is fine, but you need some lightness to make a film palatable.More Steve Coogan, less histrionics."}, {"id": 296, "text": "Though I've given this film a two star rating, I want to say that I don't think this movie is bad, but it's not particularly good either. The story it tells is interesting, but it's bogged down with needless side plots and characters, to the point where the movie just feels like it's plodding along endlessly through the second act. The direction is sort of lifeless throughout the movie, and it makes moments of earnestness seem far more melodramatic than they ever needed to be. The themes that were hinted at in this movie were never fully developed, and in the end, we come away feeling a bit unsatisfied with how the whole thing wraps up. That being said, I learned a lot about the Oxford dictionary, far more than I ever thought I would have, and the story beneath it all is quite fascinating, which is why, I'm sure, this was Gibson's passion project for a number of years. He was so disappointed with the final cut that he actually filed a lawsuit back in 2017, when the film was first completed."}, {"id": 297, "text": "This isn't a review of the film because I haven't seen it, but if you're interested in the story, read 'The Surgeon of Crowthorne' by Simon Winchester. A wonderful tale."}, {"id": 298, "text": "I wanted to like this movie. I am a big fan of Mel Gibson, he steals ever scene he is in for every movie he is cast. Sean Penn is the most over-rated actor on the planet. This movie is just boring. Sorry - there is a reason it was in the theater for a week before going to the $5 bin at Walmart."}, {"id": 299, "text": "Sean Penn is good at yelling and getting riled up for no reason, per the usual. Gibson is decent. That's about it."}, {"id": 300, "text": "Its Boring! Talk talk talk talk dont have action interest its 2 man s... You saw in trailer but its boring... England Dictionary..."}, {"id": 301, "text": "I found this film stuffy and somewhat pretentious. Someone else said read the book and I agree. This was about as fascinating as reading a dictionary by itself. Great for pseudo intellectuals."}, {"id": 302, "text": "...which, in itself, aptly explains the low rating by the critics.These days I can quite accurately predict whether I'll enjoy a movie or not - if the critics love it, it's probably virtue-signalling SJW trash; if they hate it, it's probably a damn good movie.This movie is for the logophiles and the bibliophiles; the writers, the poets, the crafters of art through the medium of the written word.If words are, to you, more than just words and, to paraphrase Doctor Minor, you have gone to the ends of the world on the wings of words, do not miss this movie.It is a tour de force."}, {"id": 303, "text": "Although the performances and cinematography was really good I cannot accept the history of mental / criminal institutions in the 1800s would knock through into the next cell to give him extra room. and furnish his cell with all he desired. In fact turning it into a study. Learn your history. These places were grim no matter who you were. Why also were all three lead actors Americans in a British film, we do have actors here you know. I became so bored at one point I made a shopping list. So if could have been shorted and less numbing."}, {"id": 304, "text": "Sean Penn is amazing as always but the story is too long and somehow this movie which is good and well done gets a little bit boring because of the curls and it's duration.Great cast and awesome locations that makes The professor and the Madman very realistic.Of course is a good choice too watch if it wasn't I wouldn't give it a 7 out of 10."}, {"id": 305, "text": "This is a well told and well acted film. I'm a big Sean Penn fan, however in this he just mumbled through out it. I had the surround sound on so everything was crystal clear and still couldn't understand him, I had to watch it with the subtitles. Also he completely overacted when it came to the breakdowns, the paranoia and the madness. It's not an oscar worthy performance and it's not a masterpiece by any stretch."}, {"id": 306, "text": "I don't know what all the positive reviewers smoked. I'll give it a 5 and it must say thanks. Extremely funny sometimes."}, {"id": 307, "text": "I am very bored of this old way of movie making..the script is solid, the acting is above average..well directed..but it is very old school.. very boring..go and watch it if you liked a beautiful mind, the imitation game etc.. you will definetely enjoy it..but if you like movies like adaptation, the awakening of motti wolkenbruch etc go and look for something else.."}, {"id": 308, "text": "Hokey and overwrought, but good acting and cast. Interesting to watch though somewhat plodding. It was a long two hours. Good facial hair."}, {"id": 309, "text": "In the movie If love.... than what = no chance redemption.What does thay mean? I couldn't get the connections.Please help..."}, {"id": 310, "text": "A good story and rare movie, and it's can with family"}, {"id": 311, "text": "Any movie I watched with Mel Gibson as a star that means it is always a good movie. I promise Mel Gibson won't disappoint in any of his movie. If Mel Gibson starred it means a great movie."}, {"id": 312, "text": "Looking for a movie that has packed all precious Elements of humanity &amp; Love,Friendship,Forgiveness,Effort &amp; not quitting all in one ? . JUST GO FOR IT , IT IS YOUR CHOICE. 7.5 out of 8"}, {"id": 313, "text": "A very beautiful story inspired or including some true events.Great trio acting by Professor-Madman and Wife but to be honest i miss something in the scenario for being a masterpiece, maybe the darker side of things.."}, {"id": 314, "text": "Prolly some of the best acting I've seen in years esp Sean Penn and Mel. Movie just kinda drags along but is still worth watching."}, {"id": 315, "text": "Professor and Madman movie is a great movie with a strong story For a long time, the distance between madness and genius is small, and perhaps the suppression of insanity may also cause considerable marginalization of genius."}, {"id": 316, "text": "A film about the creation of the Oxford Dictionary sounds like a very boring idea. Luckily, one of the key contributors in 19th Century England, in real life, was a deranged surgeon, a veteran of the US Civil war called Chester Minor. Dr Minor was imprisoned indefinitely at the notorious Broadmoor asylum - and lucky not to be executed - after his paranoid delusions (probably caused by PTSD) caused him to shoot dead an innocent man one night in London. Dr Minor thought the man was out to get him, when in fact he was just walking down the street. Sean Penn makes a great fist of playing Dr Minor, as an almost irretrievably damaged man. In several brief flashbacks, we see Dr Minor performing amputations and even brandings in his years of Civil War service. At the asylum, Dr Minor is treated with great respect and kindness by the resident psychiatrist, who encourages him to take on a project - reading books to create definitions for the new dictionary. The offer is much appreciated by the dictionary's editor, a Scot played by Mel Gibson, whose perfectionism, and the sheer scope of the task, means he's unlikely to meet the ambitious deadlines of his own editors. It's only later on that Gibson realises that one of his key contributors is ''mad'' and incarcerated at Broadmoor at Her Majesty's Pleasure'' for murder. Gibson has a good eye for visual effects and poetry. I loved the settings, acting and design of this production. The script is great. However the film goes on too long. We're expected to believe that the wife of the stranger that Minor killed - a poor London mother of many children - visited Minor many times and even kissed him. It just doesn't make sense to me. I actually switched off the movie at this point as being too far-fetched. The mother character was also too doe-eyed and melodramatic. It didn't detract, however from my enjoyment of the earlier scenes. Sean Penn brings great compassion to his character - who wouldn't go made if they'd spent years as a field surgeon in the Civil War? It makes a good case that working on a project greater than oneself - a pioneering dictionary - can give even the most broken man self-respect, joy and purpose. The movie suggests that for Dr Minor, redemption might be possible. Maybe at one stage he could have even been released. However if you read about what happened to him later in his life, it's not a happy ending, which is sad."}, {"id": 317, "text": "Sean Penn and Mel Gibson did a great job acting the bazaar characters in this film which must be a compilation of several stories. Unfortunately the treatment of the women in this screenplay was abhorrent... portraying two brilliant British actresses in real dummy roles. No lines for Dormer or Ehle here Gurrls."}, {"id": 318, "text": "I wasn't thrilled about a biographical film story regarding a dictionary, but this one impressed me! Who would've though to know the history behind a dictionary?Farhad Safinia makes his first full length feature film debut as writer and director, and nailed it. Produced by and also starring Mel Gibson - who was also great in his role, this film was directed exceptionally well, and the writing was good. I felt the screenplay was all over the place in a few areas, and the 124 min length a little too long for the story being told. I'm not a fan of slow paced films, but this one was just right. Casting was great, including Game of Thrones' Natalie Dormer, but wow did Sean Penn give an Oscar-worthy performance in his role as Dr. Minor. Glad to see him back on the big screen. The score was perfect and the sets/costumes on point for the era.This is by no means an action packed Hollywood blockbuster, but instead a historical biopic produced extremely well, and a must-see.A well deserved 9/10 from me."}, {"id": 319, "text": "I could write much on the accolades this film deserves but will stick to the basics of why this film is great.Acting across the board is spectacular. Penn and Gibson are in top form and have great chemistry. Coogan and Marsan are also in top form as usual. Ehle and Dormer do a terrific job in bringing that soft feminine touch much needed to balance out the relationships between the main characters.The film has its emotional ups and downs while staying on point to tell the amazing story of how the most important English dictionary came to be. It is a testament to the difficulty and perseverance needed to accomplish such a Herculean task in defining the vast English language and the trials and tribulations endured to realize its completion.The beauty of this film is in the storytelling of the relationship between the two main characters. The Scottich wordsmith and an American surgeon who suffers from mental illness.In order to not divulge more about the narrative I will just end by stating this is a powerful film that will leave you feeling many emotions. A triumphant accomplishment! Time well spent."}, {"id": 320, "text": "Unforeseen: when a movie about people LITERALLY writing a dictionary turns out to be captivating, specially the further it strays from the actual dictionary-writing. The Professor and the Madman features Sean Penn and Mel Gibson both retaking characteristics from some of their better-known, pre-controversy roles, with Gibson going back to the Braveheart Scottish accent and Penn to the Dead Man Walking maybe-redeemable inmate murderer; resulting in a very strong on-screen chemistry.By the time this movie is released in most markets, its fame will likely stem from its legal issues which lead to Mel Gibson basically disavowing it and director Farhad Safinia doing so in full (the movie is credited to P.B. Shemran, an Alan Smithee-like alias if there's ever been one). I find this decision suprising as for most of the film I could have easily bought this as a Mel Gibson-directed work. As a filmmaker, he might not have the strongest of auteurial signatures, but said signature that can most easily be defined in the depiction of gore, a fascination with language and Christian faith elements (most obvious in The Passion of the Christ and Hacksaw Ridge), definitely makes an appearance here.Not content with Gibson-like directorial decisions, the screenplay fortunately digs deeper into some topics than any Gibson script has. Penn's character's arc in particular is well-developed in creating empathy towards the mentally ill, which is still not common enough nowadays, nevermind in a time when phrenology was still a valid study. The word redemption, so rare yet supposed to be the most Christian of virtues as well, gets a very strong definition with this character arc. Obsession is touched upon as well, not to Aronofsky-an levels, but still enough to be worthy of a mention.Considering the unforeseen depth of the treatment of these topics, it's truly unfortunate that there are some cases where the movie relies of the most shallow of tropes to force tension. The worst case of this is the almost-mustache-twirling-villain characters, with no depth or motive beyond antagonizing and foiling our brave heroes. One case in particular is not as tragic when a (until then) well-developed and rounded character inexplicably takes that villanous turn, at least having given us a solid base before. Additionally, the visuals suffer with some establishing shots clearly having made with inferior digital video quality, creating a jarring effect that takes you out of the movie. All in all, despite these shortcomings, The Professor and the Madman is a worthy story that goes into unanticipated and fortuitous depths, intensities, profoundities."}, {"id": 321, "text": "Professor and the Madman is a amazing story delivered by extremely good actor performances. I think it is one of those needle in a haystack full of S*** moments that we so rarely experience from hollywood.I stumbled upon the title after watching the beaver by Jodie Foster with Mel Gibson in the leading role. Professor and the madman seemed to be available nowhere and has not had a cinema premiere in Denmark. I got hold of a Italian blu-ray, and boy am I glad I did!The movie is a gem about unlikely friendships, forgiveness and how creativity and innovation can overcome the most impossible obstacles.The making of the first dictionary is a fantastic story, the performances are though the roof ( I still cant decide on who did the best acting) , but the ending felt a bit truncated and abrupt in some way.I hope this movie gets a revival and the reviews it rightfully deserves.THANK YOU for this splendid film, that proves that there is still a little heart and brainpower left out there away from blockbuster-land."}, {"id": 322, "text": "James Murray (Mel Gibson) survives on obsession. His life goal is to compile the first English dictionary. With only a few tools at his disposal he relies on the help of strangers. One of these strangers is a murderer confined to a lunatic asylum - Doctor William Chester Minor (Sean Penn). The friendship between Murray and Minor shaped the English language the way it's known today. THE PROFESSOR AND THE MADMAN is based on the biography by Simon Winchester, but is as exciting as any fictional story can be. The script that in any other circumstances would earn an Oscar nomination has sustained serious damage by various law suits and troubled production, which forced the director Farhad Safinia (a many time Mel Gibson collaborator) to take his name off the final cut. Yes, the film suffers from missing on the final comprehensive editing, where the rougher edges could be smoothed (and the length reduced) although as it is, there are not many faults to be found.The acting is superb, even from the supporting cast, the costumes and the times feel authentic and the valsy soundtrack from Bear McCreary is a delight. This is a spectacular story, given that is amazingly based on history.There are elements of a thriller, a love story and a buddy drama. All wrapped up nicely into a historical package. Honestly, an improvement on Winchester's book. Get over what you think of Mel Gibson and see for yourself that a blockbuster movie can be made on a tiny budget, while delivering all the goods of independent moviemaking."}, {"id": 323, "text": "This was a fantastic and brilliantly made historical drama, about the real creation of the 1st edition of the oxford english dictionary. how historically correct it is i shall not judge,but as to wikipedia, he got his proffesorate almost post mortem in 1908, so the accuracy may be a bit of level,but james murray i knew who he was. its a film for everyone, but some interest in the alphabet, and a bit knowledge of history may boost this film alot. its is also a film for the profound lover of filology, because its filology to the fingertips. the only thng i really miss in this glorious production, are the timelineinformation, because earth wasnt made in one day,and so wasnt the OED either, it was completed officially sometime in the late 1920's.tha cast consists of a ton of hevyweighters from british,american to australian actors, and the highlander and geordie dialects tweets like a songbird throughout the whole movie. i love the choice of sean penn as the madman, he does act and have the appearence of a mad man for sure, in a setup like this film the normal choice of delivery for this kind of film would normally have been ben kingsley i'm glad they didnt cause i guess mr kingsley would SPLIT into thousand pieces of GLASS, in seer dispair of all the biographical roles he has acted, ghandi,eichman and so on. also mel gibso gives this film the glory it shall have because they played darn good together, mr gibson and mr penn.bravo i must also mention the character mr munch, the prison/hospital guard played by eddie marsan and mre murray played by jennifer ehle, they both make some excellent performances on the screen, they give sanity,hope and humanity to this film by their acting.i love the way they talked or conversated in this movie, and that mustve been due to a good script, and possibly by help from a linguist. the diction and tone a so very well balanced thats it a sheer joy to just listen to what is said. the score are of the same era of time, and see if you can count how many times it pauses, or for how long you forget that the music are really there. magnificently done and dacapo to that.the filmography and editing are in my sense of view flawless, the glow of light and sound near perfect, and the playtime were , for an old grumpy man, with a hang on weird science and history, perfect. its a great movie that you should not miss, its a lovely and positive in its use of word and action."}, {"id": 324, "text": "When I heard that Gibson and Penn would be uniting to tell the story of the creation of the dictionary, I couldn't have been less excited, even more so when I discovered that Gibson would once again be yanking William Wallace's soul through the dirt in his misguided attempts at successfully pulling off a Scottish accent.However, after seeing the trailer I was certainly intrigued. So, one bored morning I decided to give this movie a shot. I have to say that I was pleasantly surprised. The acting by everyone (apart from one side character who is the villain to Penn and Gibson's characters in this movie) was fantastic, and I felt truly moved by their performances.This movie does more that tell the origin of the dictionary, although it does manage to do that in an interesting way. This story is about redemption, love, frienship, and the terrible mental health practices that existed in the early 1900s. At times I felt pride, at others I felt digust and contempt. 'The Professor and the Madman' isn't afriad to get its hands dirty (or bloody), but it does so without over the top gore. Camera angles allow for excellent story telling, and allow all shocks to come from the sheer fact of any event, rather than from the sight of any injuries.I probably won't watch this movie again in a hurry, but I'm certainly glad I took the time to watch it in the first place."}, {"id": 325, "text": "In this rather monumental quest to tell the story of a tortured man who lived through his work, I find that this film did its absolute best to convey what happened at the birth of the dictionary.The sheer amount of the acting power that was on display in the person of two of the most skillful actors of all time is just amazing to watch, Sean Penn was and always be one of my favorite actors, the way he displayed emotion and pain in this film just goes to proves the mastery of his craft, he in a way, materialize the ideas of the character he was playing and took us on a journey to get to know this tortured man's life, it was an absolute joy to watch, and to have Mel Gibson on the other end is just amazing, this pair needs to do another film again, their charisma leaps through the screen. Granted that the film faces some problems with the transition at times critical moments of its narrative, but it serves its purpose and then some, and for that, I believe this film was great, flawed, it might be, but excellent nevertheless."}, {"id": 326, "text": "What a movie! I surely wasn't expecting such depth and quality from this title. This is a deeply moving piece, brimming with humanity, whichever way you want to look at it, simply because it tells a story about love, in several of its forms: love for knowledge, love for science, love for mankind, love for your family, love for your friends, love for your fellowman, ... The stellar cast is very much responsible for this unexpected success. For starters. Sean Penn delivers the performance of a lifetime (it's gonna be hard for him to top this one off). As a matter of fact, the only blemishes you will find here in the acting department are those few over-the-top moments Mel Gibson has already accustomed us to... (no, Mr. Mel Columcille Gerard Gibson: blinking and looking towards your 2 o'clock does not count as acting) and those unfortunate moments are all the more evident when happening alongside the masterful command of emotional signals of such great English thespians as Steve Coogan, Anthony Andrews, or yet the highly underestimated Eddie Marsan (one of those great actors who get stuck as the eternal supporting actor). In short: watch this movie!"}, {"id": 327, "text": "In 1872, James Murray (Mel Gibson) takes a job of editing the Oxford English Dictionary and finds the task is overwhelming and asks for the public's help. Enter Dr. William Minor who is in an insane asylum for killing the wrong husband of the woman he was sleeping with. Dr. Minor finds a way to provide numerous words for Murray's task and he also shows a way to make the process simpler. In the meantime Dr. Minor still feels tremendous guilt over the wrongful death and offers his pension from the U.S. Army to compensate the widow Eliza Merrett (Natalie Dormer) for her loss.This movie isn't so much about how the dictionary comes about, but more about the friendship between Murray and Dr. William Minor. Also we see that Mrs. Merrett slowly comes to forgive Dr. Minor and may be falling ln love with him. Because of Dr. Minor's contributions to the Dictionary work, Murray tries to get him partial credit for the work. This is denied.The acting all around is first rate, but one must listen carefully due to the accents involved as many characters talk low and fast. The pace is excellent and we are fully engaged. I am not familiar with Natalie Dormer, but she outdid her performance, and she is pretty, too. (Took you long enough to get that in) An Oscar for Sean Penn? Hmmm.......possible.Notables: Jennifer Ehie as Ada Murray, James Murray's wife; Eddie Marsan as Officer Munci who acted as a go-between with Dr. Minor and Mrs. Merrett; Henry Bradley as Loan Gruffudd, Murray's research assistant; Charlie Hall as Jeremy Irvine also a research assistant; Stephen Dillland as Dr. Richard Brayne, Dr. Minor's doctor; Steve Coogan as Frederick James Furnival as Murray's biggest supporter on the Oxford Board and he approached Murray to do the job even though Murray had no academic degrees.A very good story of how the Oxford English Dictionary came about with major inroads to the relationship between James Murray and Dr. Minor and a possible love interest with Mrs. Merrett. By the way they are still working on it. In 1989 there were 20 volumes.Stay tuned at the end to find out what happened to James Murray and Dr. William Minor. (9/10)Violence: Yes, Dr. Minor shoots the wrong husband. Sex: No. Nudity: No. Humor: No. Language: No. Rating; A"}, {"id": 328, "text": "My Rating : 9/10Terrific movie - 'The Professor and the Madman' is one of the better films that I've seen in ages. Ignore the pretentious reviews. Watch and learn about an odd yet important subject relating to history and education.Beautifully shot and sensationally acted, 'The Professor and the Madman' is a Victorian-era biopic about James Murray - the man commissioned to bring the Oxford English Dictionary (OED) to life and his friendship with a schizophrenic American surgeon William Chester Minor who helped in the completion of over 10,000 words.Sean Penn and Mel Gibson were both brilliant as always - Natalie Dormer and Steve Coogan along with the supporting cast also did a great job of bringing this movie to life and connecting with the viewer through their character's emotions.Tragic, emotional and deeply engaging drama - my highest recommendation for the discerning viewer."}, {"id": 329, "text": "I don't normally read the reviews on or anywhere else, nor have I ever submitted one. Nonetheless, something told me that I should delve into them after watching this wonderfully moving story.While each of the viewer's reviews I read heaped praise on this film, the professional critics all panned this exceptional piece of cinematic art.The Professor and the Madman soars on the stellar performances of Penn and Gibson. And this from someone who wholly disagrees with Penn's politics and much of Gibson's personal history.The critics should stick to their praise of aliens, super heroes, explosions, and CGI. This movie requires the viewer to confront one of history's darker moments...the British asylum system, and recognize the truth that genius comes in many forms. The collective IQs of the critics are simply unable to keep up.Cheers to the writers, directors, cast, and crew for giving us such a masterpiece that requires us to actually listen as well as watch. Think, instead of react. Wonder how we had no clue of this backstory to the O.E.D."}, {"id": 330, "text": "I like intellectual conversations between two learned individuals. More than that, I like the English language and all the intricacies. I thoroughly enjoyed this movie just because of that reason. I have enjoyed reading dictionaries time and again and I adore listening to intellectual conversations that are depicted in movies like this. A rare thing to see in today's cinema.Mostly Britishers are shown as pompous eggheads in most period movies but here there was a slight shift. Putting that aside, I think Sean Penn can never act bad, per se. I have never seen him go wrong with any character he has played. Mel Gibson's character was not multi-layered as much but was played to perfection too. Natalie Dormer, Game of Thrones fame actress did a wonderful job and showcased her true talent of acting.I was immediately attracted to the synopsis of the movie here on IMDb and I knew I would enjoy it. I not only enjoyed it but thoroughly loved it. There is no other story arcs than the one mentioned in it's description so I don't think I am delivering any spoilers. Till next time, read books, a lot of books. And yes, I don't know the historical correctness of the movie so let it pass. Cheers."}, {"id": 331, "text": "Sometimes, you don't need words to describe your feelings, while other times a correct and succinct word can convey so much emotion. This is a movie for all those who love words and language. There have been so many times when the use of a rare or obscure word by people has brought a smile on my face, just like the one you get when you remember an old friend! Clearly, I also love language and knowing that it has played a very important role in human evolution has made it all the more dear to me. This movie celebrates the lives of lexicographers who put an enormous amount of effort in cataloging and researching each and every word of a language to make it more accessible for everyone.The movie is about the genesis of Oxford English Dictionary. An autodidact, James Murray who hadn't had much of a formal education is assigned to be the head of the project because he's a genius with languages. The task is humongous and needs contributions from speakers of English from all over the world. A particularly prolific contributor is Dr. William Minor, a retired US Army Surgeon, presently in the mental asylum, who in a fit of delusion, had killed an innocent man. Both men are very passionate about their literary endeavor and slowly develop a great friendship.This is a powerful movie that illustrates how a deep passion towards a goal can bring out the best in even those who seem to be beyond redemption. The scene when Dr. Minor tells the asylum Superintendent that he should be allowed to contribute to the dictionary as he will be alright with this work is particularly poignant. Another heart-warming scene is the one between Dr. Minor and the widow Merrett where he describes to her how reading makes his demons disappear. The film also raises interesting questions about repentance, redemption and love. All the cast turned in stellar performances. Sean Penn is particularly impressive as Dr. Minor.The only problem that I found in this almost perfect film is that it doesn't mention any previous dictionaries of the English language that came before the OED."}, {"id": 332, "text": "The Professor and the Madman is a Biography - Drama movie in which we watch the story of the first edition of the Oxford English Dictionary. It started in the mid 19th century from Professor James Murray who received help (10,000 entries) from Dr. William Minor who was a patient at Broadmoor Criminal Lunatic Asylum.I liked this movie because it had a very interesting story which is based in true events. The interpretations of both Sean Penn who played as Dr. William Chester Minor and Mel Gibson who played as Professor James Murray were exceptional. I also have to say that the interpretations of Jennifer Ehle's who played as Ada Murray and Natalie Dormer's who played as Eliza Merrett were equally good. Regarding the direction which was made by Farhad Safinia, I believe that he did a good job on it and he presented very well the stereotypes of that time, the difficulties of life on that time and how high society was influencing people and their opinion. I recommend everyone to watch this movie because except of the nice way of presenting those time in England, it's a good way of learning how the first Oxford English dictionary was created and of course the story behind it."}, {"id": 333, "text": "This movie is from a whole other level and is a true gem.The story itself this film is telling is one that must be known for everyone. Its setting, use of well thought out music and amazing pictures are things that I don't see everyday combined in one film.As for the acting itself: it is not something you would expect from Mel Gibson and Sean Penn. In this film they, so to say, want to tell the story of the Oxford Dictionary with so much dedication that it is impossible to compare these actors with their other, much more action-oriented films. They truly tell the story. The rest of the actors are also convincing in their role. Not so many films cause me to leave me silent at the end. This one does.Learned alot and enjoyed the film. Superb, 9/10."}, {"id": 334, "text": "I did not know about the conflicts that surrounded the production of The Professor and the Madman, which may have harmed its theatrical release. Apparently, the movie was hardly marketed to the viewing public, and I missed it until it came on my streaming services. The big-name cast--Mel Gibson, Sean Penn, Stephen Dillane, etc.--caught my attention, so I watched it and really enjoyed it. It's hard to believe that Gibson and the director wanted to dissociate themselves from the finished movie, but from what I read, they had strong creative differences with the studio and didn't feel that the final product reflected their vision. It's based on the true story of the creation of the first edition of the Oxford English Dictionary, and the personalities and personal sacrifices made by the men and women involved in this monumental project. Sean Penn plays Dr. William Minor, an essential volunteer contributor to the OED, who was also mentally ill and confined to an asylum (one which, as portrayed in the film, seemed rather luxurious for its era). Gibson is Professor James Murray, the Scottish editor in chief of the dictionary, who befriends Minor. The movie focuses more on Minor's heartbreaking struggles with his mental illness and treatment, and his relationship with a young widow played by Natalie Dormer, who is luminous and seems almost too angelic at times, but perhaps that was how Minor viewed her. The Professor and the Madman offers excellent acting and a rich, moving, interesting story based on real events (and seems to be rather faithful to the facts for a movie). There are some gritty, grim scenes that portray the real, horrifying situations that these individuals endured, but I was never disturbed or grossed out. One criticism is that the movie veers too far into sentimentality and romanticizing its characters' interactions, and this strained my credulity at times. It may also be a bit too long. But I enjoyed it and certainly recommend it."}, {"id": 335, "text": "This is a really good movie.Its message is a bit heavy-handed. There are these sort of morality overtones that sometimes seem a bit too much. And that's to be expected because Gibson is in it. I am not a fan of his, but despite my dislike I found myself enchanted by the story and never, ever bored.The main story here revolves around the creation of the Oxford English Dictionary. Many younger folk may not realize how amazing the OED is. When I was in college I owned a set that was printed in such tiny font that you needed a magnifying glass. it was the gold standard of dictionaries. And it is what I used to help me expand my vocabulary. In and of itself, the movie tells a fascinating tale.Fun fact: I am a librarian and love books. I love to read and so during the movie I could smell the old books. I literally could smell them! Brains do weird things, don't they?This movie has an army of fantastic british actors in it... Marsan, Fox, Dormer, Andrews... the list goes on and on. Based on that alone, it's a joy.Marsan once again is wonderful, and Fox gets to play another really nasty, sleazy creep. He's so good at that!And even though I detest Gibson and have never been a huge fan of Penn, I thought both of them were stellar in this.There has apparently been a lot of criticism of this movie. I saw nothing really terrible about it. The story made sense. I didn't notice any gaping plot holes. Maybe I'm dim, but it seemed fine to me.The reason I didn't give this 10 stars is 1) Gibson and 2) the aforementioned heavy-handedness."}, {"id": 336, "text": "Reading the blurb, one might think this would be a boring film but it's not. The script, the settings, costume design, the cinematography, the music, the pace of the film and most of all, the outstanding acting performances hold this film together. I saw one braindead critic say Penn was overacting but clearly that critic has no empathy or understanding of the human condition. Imagine being a person involved in a terrible war, having to brand someone and then later committing murder thinking it was the same person coming to torment them and then having to deal with the guilt as well as the dead man's wife and 6 children who were starving due to this being set in a time long before the welfare state. Clearly this critic (and his ilk couldn't) as it seems he thought Sean Penn seemed a bit too sad at times and didn't play the role as one whose favourite programmeis likely to be Thunderbirds might expect. No doubt with Gibson and Fox in the cast, there is a need to run this film down by some people ever eager to cast the first stone along with a few boulders to boot. As a piece of art, great storytelling and filmmaking, it is a triumph, like finding a twenty pound note down the side of the sofa. I hope you sit down with few expectations and enjoy it like we certainly did!"}, {"id": 337, "text": "I listened to the book on audible and loved it. Simon Winchester is my favorite author, and I was surprised that they made a movie out of the book because of the breadth of material it covers. There was even a more surprise when I saw that Mel Gibson was starring in the film; I like Mel.One of my adages is: If you have nothing good to say about someone, say nothing at all. Therefore, I will say nothing about Mr. Penn.The movie is terrific. I liked almost everything about the film, and have only one quibble. Ms. Dormer's character is supposed to be a poor, widow; yet she constantly wears a different outfit of high quality (as does her children) in every scene. Yes, I know the Penn character sends her money, but he's not exactly rolling in cash himself as he's in asylum.The acting is fine, the story (which is true) is well told, and it is one of the best movies I've seen this year. I highly recommend it."}, {"id": 338, "text": "In my opinion, this is the best movie I've seen in 2019, I'm a lot. You don't see the high-end kind of acting, the international Sean Bain creates as usual creates a state of sophistication and beauty that takes you to a second place, the film shows how great and beautiful the soul is that it creates creativity despite all the problems you face, and the problems The one who suffers from it, knowing that it is one of the most difficult problems (psychological), and on the other hand, you will know the meaning of persistence and that you will find a need that believes in it and the splendor of love that makes you complete in it when you despair and want to surrender and the true friendship that Mel Gibson represented with a scene more than wonderful and frankly sermon Short, which I said before that, etc. The secret shot that works for any movie, short touching speeches and closed dialogues, the graphics are very sweet, the choice of places has been done with great care, the details are expressive about this film, the film is an artistic painting although I am evaluated by the evaluation of not just sincere but this does not affect the film need, the director Farhad Safinia is talented and I expect his other successful business, greatness"}, {"id": 339, "text": "I am amazed that a film such as this went down so badly with the professional critics. Without meaning any disrespect to their judgement and experience, I think they panned a fairly good film. I agree that there is a great deal of forced melodrama, as well as too many convenient coincidences to further the plot. I also agree that the visuals could have been better handled. However, none of these things can stop us from thoroughly enjoying it.First of all, the story itself is very interesting. I don't think there are many films (Hollywood or non-Hollywood) that examine so closely the challenges and the hard work that comes with the writing of a dictionary (in this case, the monumental Oxford Dictionary of the English Language). In addition, the film should be commended for the manner in which approaches contrasting themes like insanity versus logic, redemption versus damnation, open-mindedness versus prejudice etc. Both Gibson and Penn give extremely solid, if not powerful, performances and so does the rest of the cast, even if the script sometimes feels noticeably weak. Despite the cliches, the dialogue is quite convincing and this is how we get real-looking, three-dimensional characters to whose ordeal and suffering we can relate.In short, The Professor and the Madman is a very satisfying and enjoyable film. It is certainly worth watching, if not for the story, then for the excellent acting skills of Mel Gibson and Sean Penn."}, {"id": 340, "text": "It's difficult to understand why professional reviewers panned this movie. One review I saw seemed to be desperately hunting for something, anything to criticise, no matter how incidental to the story. Perhaps there are just not enough explosions, car chases and action heroes for modern taste. What's wrong with a true story, accurately and engagingly told, about amazing and important events from history?At the heart of this movie is the heroic project that produced the Oxford English Dictionary. But the film brings it to life by telling the story of the people who made it all happen. I had the advantage of previously reading the book, The Surgeon of Crowthorne, on which the movie is largely based. However, the movie brings it to life that a written summary can never do. The acting was superb, with a cast studded with well-known actors. The sets, cinematography and editing created a sense of the atmosphere of the time. Perhaps most important of all, the script shows how the characters develop over time, revealing how humanity succeeds in the end."}, {"id": 341, "text": "PROS: Like I said beautiful story and wonderful acting. It becomes more apparent that if the acting is done believable you can immerse yourself within the story. And that is what happened to me, lead and supporting roles were so good, I actually woke up after the story was finished. Maybe it's intentionally maybe not, but the language used and the sentences formed in this movie seemed to be a message to the viewer stating the more words you know the more efficiently you could express yourself. Use one word instead of a whole sentence to state your meaning, but maybe that just me;) CONS: Like I said beautiful story and wonderful acting but, In my case there was a small annoyance, like the camera shaking when great dialogs were performed. The dialogs seemed therefore chaotic and not stand-fast when it was meant to be stand-fast making the emotion of that moment fleeting away quickly, but that is my pet peeve. The story is a beautiful one, people who made a difference should not be forgotten. The wonderful acting is immersive although you get out of it quickly, because of the handheld camera. Therefore I give this movie a 7."}, {"id": 342, "text": "On paper a film that seems to scream prestige potential, The Professor and the Madman is a sadly lifeless dramatic biopic that's myriad of problems behind the scenes has clearly ridden the film unsalvagable from its lifeless and generic final product.A passion project for its star and producer Mel Gibson, who purchased the rights to Simon Winchester's novel on which the film is based way back in 1999, only for him to struggle to bring the story to the big screen until now with the help of his Apocalypto writer Farhad Safinia (here going by the name of P.B. Sherman due to legal battles), which is unfortunate, as the wait has certainly not been worth it.It's nothing to do with Gibson as such, whose as good as his been over the last decade or so as real life Oxford dictionary master James Murray, but despite a sizable budget, a formidable cast and the amazing story of how the most well-known dictionary of all time came to be, Madman wastes every single tool at its disposable along its journey to shine a light on Murray's trials and those of Sean Penn's murderous and clearly insane war veteran Dr. William Chester Minor.The film is nothing more than a series of boxes being ticked off, told with little heart, care or imagination and where fault is to be pinpointed is hard to do as Safinia himself and Gibson disowned the project well before final completion in a bitter feud with its financiers, who ended up taking matters into their own hands and finalising the end product and extra filming courtesy of Todd Komarnicki, in what's a film that was abandoned by its heart and soul.Not many films end up achieving much good when these type of unfortunate circumstances and bickering's take place and while elements of the lethargic offering lay mostly at the feet of this issue, its also no excuse for its extremely tame and care free delving into of the dictionary's birth and the friendship that sprung up between Murray and Minor.Completely overplayed by a mumbling, jumbling Sean Penn (who has been out of form for years now), Minor is tough character to portray no doubt but as our decade spanning narrative takes us along for the journey these two men took, by the end of it we end up feeling just as cold as we do when we first meet these men as Safinia and Komarnicki fail to create any spark in the editing suite or in the filming of this material that makes a tour hour run time seem like an endless slog.So much so that not even the likes of supports such as Natalie Dormer, Ioan Gruffudd, Steve Coogan or Jennifer Ehle can add any extra spice to a film that so clearly could've been but unfortunately isn't, a missed opportunity to shine a light on an intriguing friendship centred around an important moment in our human history.Final Say -Facing an uphill battle to even have seen the light of day due to behind the scenes raucous, The Professor and the Madman would've been served better to remain heard of but never seen as this dull and uninviting drama fails to ignite in any way, shape or form despite its loaded material.1 luscious beard out of 5"}, {"id": 343, "text": "The Professor and the Madman is a biographical drama film based on the non-fiction book The Surgeon of Crowthorne by Simon Winchester. Starring Mel Gibson and Sean Penn in the leading roles, it takes an otherwise improbable subject for onscreen treatment and turns it into something surprisingly entertaining.In 1872 in London, retired US Army doctor William Chester Minor (Sean Penn) is put on trial for the murder of an innocent man but is later found not guilty by reason of insanity and is sent to Broadmoor Mental Asylum. Meanwhile in Oxford, Professor James Murray (Mel Gibson) is given the monumental task of overseeing and editing a collection of every word used in the English language. In an attempt to aid him in this difficult assignment, Murray sends out written appeals to as many English speakers as possible around the world to contribute their own definitions of words. One of these appeals finds its way to Broadmoor, which Minor comes into possession of and decides to send in over 10,000 entries, some of which are of incredibly obscure and rarely used words. Stunned by these unique contributions, Murray decides to meet with Minor and the two form an unlikely partnership in creating what would later become the first edition of the Oxford English Dictionary.On paper, the origins of the first English dictionary ever conceived sounds like it would never work as a film in the broadest of terms. However, thanks to the efforts of the great acting from its two leads and the proper treatment of its historical subject matter, The Professor and the Madman succeeds on screen for the most part. Throughout the film, we are reminded how large the English language truly is and how every contribution counts towards us gaining a better understanding of the importance of expanding our vocabularies. While I wouldn't say it's essential to have an unyielding love of etymology (the study of words) like I do, I believe it certainly comes in handy when watching something like this. Personally, I'm part of that niche audience who likes films about historical events no matter how overlooked they are so I can't really speak for all potential viewers out there. With that in mind though, I think there is enough for casual filmgoers to appreciate that shouldn't bore them too much.Director Farhad Safinia, who previously collaborated with Mel Gibson in 2006's Apocalypto, juggles the two intersecting plotlines of a schizophrenic doctor and an Oxford professor with varying degrees of success. He chooses to juxtapose the character of Dr. Minor, whose brilliant mind has been permanently damaged by his civil war PTSD, with that of the steadfast Professor Murray, who has a strong determination to complete what he has been assigned with, and this combination of conflicting personalities is what drove things along for me. The anticipation of knowing that these two will eventually meet and decide to work together makes for an intriguing story and had me curious as to how it will turn out. There were times, though, where it felt like moments of sensationalism were added in simply for entertainment purposes rather than as a means to advance the plot. For example, there were some long and drawn out scenes involving Dr. Minor's collapsing mental state that felt unnecessary and didn't really add anything to the story. Thankfully these weren't too frequent but they still left an unfavourable impression on me and likely anyone else who might be watching.Both Sean Penn and Mel Gibson played their roles convincingly and had solid onscreen chemistry with one another. Their personal lives aside, I still think the two of them are great actors capable of holding the viewer's attention even through some of the most exposition laden of scenes. Penn has always had a knack for playing mentally unstable characters capable of bouts of impulsiveness whereas Mel Gibson has often shone as reserved individuals whose unpredictable nature may or may not be acted upon. This film uses their talents to its advantage and it comes as a surprise that this is the first time the two have starred alongside each other as their interactions felt uncannily natural to watch. I wouldn't mind seeing more films with these two actors in the future should they ever choose to work together again.Overall, while casual viewers may be put off by the concept of a film about the origins of the dictionary, I think there should be a select few out there who will appreciate the efforts in bringing such an important but neglected historical event to the big screen. It's easy to take for granted the language that over 20% of the world's population speaks but it's nice to know that a film like this exists to help show us that it can still make for something entertaining. I do wonder, however, if there will be a spiritual sequel involving the creation of the Thesaurus. I guess we'll have to wait and see/view/perceive/observe/watch...I rate it 7/10"}, {"id": 344, "text": "...is one of those movies which is better as an IMDB one-sentence description than the two hour biopic that one-sentence description describes, and which could also easily pass for a straight-to-video release if it wasn't for its oddly first-rate cast.Eddie Marsan is excellent as usual, building the most sympathetic and likeable character from almost nothing. Mel Gibson is beardy and Scottish. Sean Penn is an incomprehensible mess.Natalie Dormer is apparently incapable of aging over the several decades in which the film is set, and Jennifer Ehle is entirely unnecessary.Steve Coogan is a nice addition, and Stephen Dillane gives the most intriguing and nuanced performance, as a well-meaning phrenologist quack unintentionally doing terrible harm.The movie has a cheap, flat, made-for-British-TV look about it, with not a single memorable shot in the whole thing. The script is poor. The editing is confusing. It's a half hour too long and it drags. The attempts at building tension and drama and emotion are cliched and hamfisted. The Oxford 'bad guys' are about at the level of Scooby Doo villains.For all that, it's still somehow a watchable movie - if only just, and only just the once. But with a story like that to work from it really should have been the next King's Speech, the next Beautiful Mind, the next Imitation Game.It's not."}, {"id": 345, "text": "By all accounts, the film's production was a complete mess. Missing scenes, unfulfilled obligations and lack of promised finance all led towards a lawsuit and a distinctly splintered release. It was so bad, apparently, that Gibson actively discourages his fans from watching the thing, and the director - who may or may not have been replaced during filming - is credited only as 'P.B. Shemran'. Thankfully, aside from having a couple of out-of-place 'GoPro' shots, 'The Professor And The Madman (2019)' doesn't seem to be affected by its tumultuous creation. It tells the tale of the man who spearheaded the first edition of the Oxford English dictionary, while also chronicling his friendship with a Schizophrenic doctor residing in Broadmoor Hospital. It's an entertaining enough period piece with an interesting setting, even if it isn't exactly enthralling or, even, all that memorable. The performances are good and the script is steady. Ultimately, it's a generally solid experience. It doesn't have all that much impact, though. In fact, it sort of goes in one ear and out the other. That's not necessarily bad, mind you. The piece passes the time admirably and it is, perhaps surprisingly, generally well-made. If you think you'll like it, you probably will. 6/10"}, {"id": 346, "text": "If I am to fashion a book, I'll need a spine.Sometimes you are awed by cinema films because of the immensely beautiful special effects and the use of unparalleled images. The other time it's the inventiveness of a story and the way it's structured. And in other films, you look with admiration at the way certain actors play their role. Is it obligatory that a movie looks phenomenal to you? Or does it happen sometimes that while reading a novel, in which the sophisticated juggling with words creates literary excitement, you have difficulties to keep your eyes open and your head nods back after a short period after which a little snoring is heard? Well, in that case, it might be better for you to ignore this film. Because in The Professor and the Madman there are no breathtaking special effects to be found and the emphasis is on the literature from this world. For me, this was a masterful and fascinating story about how the world-famous Oxford Dictionary was put together.Even though this takes place around 1850, there are certain facts that can be found in our contemporary society. And, of course, there are also substantial differences. The film is not just about the realization of an almost impossible assignment with limited resources. It's also about the existence of class differences, scientific ignorance and the application of inhumane practices in psychiatric institutions. It demonstrates the pretentious behavior of the wealthy class and the political juggling in intellectual circles. And in between these topics, there's the Scotsman James Murray (Mel Gibson) who, with the help of countless strips of paper, miles of knitting yarn and with a ton of patience, tries to contain and interpret every existing English word in literary history. An assignment that requires immense efforts to the detriment of his wife and children.I'm aware that literature (at least for me) isn't exactly a sexy subject. I already assumed that this film wouldn't be intense or exciting. But just like with Kill your Darlings, this historical drama fascinated me. And this because of the challenge Murray took on. I looked in disbelief at the method that was applied. And I was constantly wondering if this was achievable. It's an era where people didn't know the word digital yet (one word they don't need to concentrate on) and they didn't have computers at their disposal. No indexed work file with linked cross-reference tables on which one could release SQL statements, to do big data analyses. No, everything was scribbled down with old-fashioned ink pens on sheets of paper and then attached to the walls. Can it be more primitive? It's wonderful to see that James Murray actually applies the principle of content management here by encouraging the English people to write down English words and send them to them by mail (indeed no e-mail).It's mainly the brilliant acting of the gentlemen Mel Gibson and Sean Penn that makes the film more interesting. Gibson plays the Scottish academic and autodidact who, despite the opposition of the established values from the Oxford Board of Directors, is appointed as the driving force behind this renowned work and is a model of perseverance. My favorite scene is where he's introduced to these intellectual snobs who don't even bother to hide their aversion. The moment Murray lists all the languages he knows and I saw those bewildered faces of the narcissistic academics, it immediately reminded me of the scene in a student bar with Matt Damon in Good Will Hunting. There, too, such a rich man's son with a snobbish attitude was put in his place in a brilliant way.Mel Gibson's sparring partner is William Chester Minor (Sean Penn), an American army-doctor and war veteran who is haunted by delusions. In a phase of extreme madness and schizophrenia, he kills an innocent passer-by and ends up in the Broadmoor Criminal Lunatic Asylum. In short, an institution for criminal madmen. The doctor on duty there, Dr. Richard Brayn (Stephen Dillane), initially envisages a decent treatment (which leads to certain privileges such as a large room with a gigantic library). But towards the end, he eventually seems to be a supporter of terrible techniques anyway. It's thanks to a book that Minor received from his victim's widow (In my eyes, the weakest aspect in this film) that he finds out that Murray asked the English people for help. And that's the impetus for Minor to get to work and to overload Murray with thousands of words for the dictionary. The way Penn plays this tormented and insane man is simply formidable. And yes, this tends to look like overacting. But isn't it necessary to portray this type of individual? Minor is after all nuts.There are several facets that are beautifully worked out. Such as the detailed decor in which the story takes place. London during the 19th century with its typical costumes, way people behave and attributes. But above all, the interaction between the two extremely brilliant gentlemen is perfectly portrayed. Two tortured intellectuals. The one because of the obstructions and impossibility of the assignment. The other because of the inner demons that make his life unbearable. An individual suffering from a post-traumatic stress disorder (PTSD). An unknown condition in those days. The dialogues in which the two gentlemen show their love for English vocabulary is sublime to watch. The way in which they both perk up while saying one word after the other with a smile is a feast for the eyes. Perhaps the corny storyline about the widow Eliza Merrett (Natalie Game of Thrones Dormer) didn't really fit in with the whole and the emphatic message about regret and forgiveness was a bit over-the-top. But despite those shortcomings, I found this historic film based on true facts fascinating enough. So if you have questions about the origin of dictionaries, you shouldn't miss this film. At the same time, you also have an idea about academic intellectualism (and their self-righteous and arrogant attitude) and the horror of 19th-century psychiatry. But what I wondered the most: are Gibson's and Penn's beard the result of natural beard growth or props?More reviews here: movie-freak.be"}, {"id": 347, "text": "Was very interested to see this having heard Mel Gibson bought the rights to the book on which it is based back in 1998 and had been developing it as a passion project ever since. I become even more fascinated by it having heard of all the production troubles that happened, with Mel and Director Farhad Safina suing Voltage Pictures and basically disowning the finished (or unfinished) film....But I was willing to give it a try. I thought it was an excellent film - thoroughly involving, well acted by everyone, crisp intelligent dialogue, beautifully shot, and by the end it moves you and leaves you thinking. The movie concerns the ambitious undertaking of compiling the Oxford English dictionary. Gibson plays the professor and Penn the madman, and the film examines their unusual friendship that proves to be a very fruitful partnership as well...There were some events that happen over the course of the movie that I found to be...unbelievable. Whether or not they actually happened I am not sure, but it certainly didn't ruin the movie either. I felt maybe they could have developed Penn and Gibson's relationship a bit more as well...But overall this was a solid movie. Good to see Mel Gibson can still act!"}, {"id": 348, "text": "STAR RATING: ***** Saturday Night **** Friday Night *** Friday Morning ** Sunday Night * Monday MorningDr. William Chester Minor (Sean Penn), a former American civil war commander, is found not guilty by way of insanity of murder, and sent to Broadmoor Mental Asylum. After saving the life of a young guard, he wins special favour among the guards and senior doctors at the asylum, and is allowed to indulge his seemingly crazy tasks that they can't make sense of. Meanwhile, Professor James Murray (Mel Gibson), a commoner, is attempting to write the definitive edition of the Oxford English Dictionary. The two men form an unlikely partnership in achieving this task, whilst developing a personal friendship and affinity for each other's cause.The recessionary air still lingers over Hollywood, where anything that doesn't guarantee a cash return won't make it to the screen. Whilst rehashes of long dormant franchises still seem like a sure bet, more obscure, independent stuff can still find itself banished to the wayside, as seems to be the case with Farhad Safina's historical biopic set in 19th century England. While the story of how the concise Oxford English dictionary was put together is an interesting story in itself, it maybe doesn't have the right dynamism for a feature film, a problem that makes itself known in Farhad's film.Such a lightweight story gets a much needed boost by having two powerhouse leads to inject it with some passion and gravitas, and so we have Gibson retrieving his Braveheart Scottish lilt, and Penn saturating his role with the deranged intensity he's known for. While both seem committed and immersed in their roles, there's an unfortunate hamminess and over-emanation to them that wears them down a bit. Safina doesn't pace the film evenly enough over the course of two hours, and the really starts to drag in the latter half.It's a story that needed to be told, but maybe film wasn't the right format for it. It just isn't enthralling or edgy enough to really get into it, especially for its duration. The historical accuracy of the time period, and costume design, is convincingly caught, and the performances, from the leads as well as a supporting cast including Eddie Marsan, Steve Coogan and Laurence Fox, are too impassioned to be truly awful, but you come away thinking it might have fallen to the wayside for other reasons than it's profit margin. **"}, {"id": 349, "text": "In the era where superheroes and over the top special effects ridden adventure flicks are ruling the cinemas (and TV), it is rare to get to see such a down to earth historical drama that relies on a good script and acting. Mel Gibson and Sean Penn give us performances that overshadow any CGI helicopter flying through the explosions. Works of Natalie Dormer, Eddie Marsan, and Steve Coogan are doing very well themselves, and all the principal cast has good chemistry between them. The directing is quite straightforward and nothing flashy or stylish. One can say, that the direction lacks any style, but the more we have time to focus on the inspiring story and appreciate marvelous acting. It is interesting to learn how superficial were many of the intellectual decision makers even back then. The World has always thrived only thanks to very few (insanely) dedicated people with clear goals. Rest of us has always been tag alongs including those who seemingly are in power to make changes.A well crafted historical movie that is much more interesting than its original premise might promise. And don't listen to all the professional critics."}, {"id": 350, "text": "My wife and I watched this at home on DVD from our public library. All the actors are very good in their roles, and especially Sean Penn as the madman. My only gripe is his mumbling which required us to turn on the subtitles to be sure we knew what he was saying.This movie is very historically accurate, as the movie opens in 1872 London we see Sean Penn as American Civil War veteran Dr. William Chester Minor, chasing down and shooting a man he thought was out to get him. At his trial he was declared innocent by reason of insanity then spent the next 38 years in an English mental institution.At that same time Mel Gibson as James Murray had been put in charge of assembling the comprehensive Oxford Dictionary of the English language, a monumental task that eventually took several decades to complete, carrying on after Murray died. It turned out Minor had experience and skills that helped greatly and eventually the two became friends even though Minor remained institutionalized. He eventually returned to the USA and was diagnosed with schizophrenia.This is an important chapter in human history, the writing of the comprehensive dictionary, and it was nice to learn what all went into it with some good points about human nature and the ability to forgive."}], "reviews_amount": 351}