{"name": "Mirror Game", "titleId": "tt05354160", "reviews": [{"id": 0, "text": "This is my first IMDb review, please excuse my English grammar...The soundtracks of the movie was the foremost reason for which I went watching it, tracks from Arnob, Shaan and Habib were laid throughout the film absolutely magnificently.From the beginning till the end, the film stretched out unfolding plot so much unpredictable that the effect of Aynabaji (magic of mimicry) surely effected major part of the audiences in the theater hands down.Building up of suspense has occurred from the get go, acting performance of the hero character was not only spellbinding but also very interesting.If you're predicting this movie to be a typical 'art film' where one can tell how the story will cut curves towards the end, then you would be wrong my dear friends; as auxiliary characters seen in the movie may become center of attention from time to time, which unfolds thrilling new openings for the storytelling experience.For filming, absolutely fantastic locations were selected, very well composed production values were used cleverly for shooting with 6K camera, true cultural essence of old Dhaka was present in the movie, stages prepared for shooting various shots for the movie were also outstanding, lovely concept of 'Hawa Ghar'!As always Amitabh Reza told us the story meticulously, composition of each characters were extremely well thought, not a single character I found in the film was least important, which made the entire crowd grabbed by their collars to enjoy the movie.Chanchal Chowdhury has pulled off few great tricks of diving deep into character detailing, it was a treat to watch the 'training scenes'. Masuma Rahman Nabila acted superbly well in the film, her simplicity of acting the role was reflected positively towards audiences. Dress design was also done well in the movie, Easter eggs ;)Many would find Partho Barua better one to come out acting for the crucial part of the story, and I would agree with them, persistent characteristic of the role he played in the movie was undoubtedly extraordinarily acted by the singer come actor.General pace of the movie seemed slow however, as the full length of the movie is way more than 90 minutes, building up sheer suspense each long scenes have played out nicely to stand out from the crowd.Syed Gaosul Alam Shaon has enabled this movie to have a sequel, which is another great reason you should definitely watch this great movie. Dialogue and screenplay was above excellent and it was a delight to watch the Barisal local dialect performed.I highly recommend spending on watching the movie Aynabaji in theater, true masterpiece, absolutely worth it!9.5/10 and thanks for reading y'all :)"}, {"id": 1, "text": "So, today i saw Aynabaji and this movie forced me to write something about it. Aynabaji is a metro thriller movie directed by Amitabh Reza Chowdhury and starring Chanchal Chowdhury, Masuma Rahman Nabila, Partho Barua etc.The plot of the movie is very unique from the typical Bangladeshi movie . Here Ayna ,the protagonist of the movie does a weird job for living . He takes people's place in prison for money . But it one such case , he faces a very big trouble .What is the trouble and how Ayna deals with it, that part unfolds in the climax.First of all ,what amazes me most is the cinematography . The whole film sets in Dhaka . Specially the Ariel shots are memorizing . The background music is to the point . There is almost no loo break in the movie . All credit goes to the Aynabaji team for making such a good film in a minimal budget.All the actors justifies their roles in the film.Specially Chanchal Chowdhury does an extraordinary acting in the movie . His transformation from one role to another is just too good in the movie .His role Ayna is one of the unique characters in the Bangladeshi movie history .In a word ,  Aynabaji  is a very unique and ground breaking thriller in the Bangladeshi movie industry . A must watch film for those who loves thriller and suspense stories on the backdrop of a metro city !My Rating -9.5/10"}, {"id": 2, "text": "May be some people could say that it is overrated or something like that but actually this movie is a piece.A challenging role played by Chanchal Chowdhury make the movie special.Every small role was given importance by Director. Amitabh Reza Chowdhury was the real kick ass.His shooting with a drawn was a great idea.Location,photography,cinematography,cas ting,costume,set designing,editing ; everything was just awesome.The story was unique and different. The dialogue was the best of Bangladeshi Cinema.Some dialogue contains a deep meaning.It is worth to watch.And obviously in Cinema Hall."}, {"id": 3, "text": "In Bangladesh movie industry are not helpful, standard and they are not developed. But some directors are really hard and soul trying to developing this sector. Amitabh Reza Chowdhury one of them. This is the only crime movie which is goes to level of Hollywood. Story, direction, casting, screenplay all of sector they did very well. It's a crime movie, and it full fills our expectation. Last twist is extremely awesome. which is quit awesome. If you did not see this movie, go hurry!! see the movie. you'l love it.. Chanchal Chowdhury, Masuma Rahman Nabila they are heavy weight actor in Bangladeshi movie industry."}, {"id": 4, "text": "A great combination of story and direction nice cinematography. Promising acting overall a great work. Amitab reza a new director from Bangladesh who just showed that it possible to do a better work if you give such effort. A great combination of thriller, romance and comedy. Its kind of a psychological thriller. Chanchal Ahmed a great actor showed his talent. I would suggest every movie lovers to watch this movie in the theater. Its a pre-release review so a details review will come soon after the release. This is the directors first big screen direction. I always loved his work. He did some excellent drama in Bangladeshi TV drama."}, {"id": 5, "text": "unique concept, good story &amp; script, superb directing and great camera work make this movie one of the best creation Bangladeshi movie industry. especially Chanchal was great in the main character, maybe this is his best acting. Others did great too. I don't know if anyone can show us the dirty Dhaka as such a beautiful city. Really camera work was great. As a normal movie audience, the whole film seems to be very interesting and exciting to me. No over-acting, no plot hole, no extra bright make up and no boring scene- all make this movie very interesting for the audiences. And it's worth watching. The whole Aynabaji team deserve to be appreciated."}, {"id": 6, "text": "All casting is awesome. Chanchal Chowdhury as Ayna is the best part of the movie. His performance is simply outstanding. Amitav Reza Chowdhury just made a blast on the city by this movie. and the best part of the movie is i have never seen ending like that. Totally different ending. I was surprised and thinking what he have done !!! Bangla film industry was not in a good condition. I think it will be in a good shape after that movie. The name of this movie is so much related to the story. very nice, smart and choosy name.Thanks to Syed Gaosul Alam Shaon for such a good story. Ayna is a magician of acting. He made an illusion to the society."}, {"id": 7, "text": "I have seen this movie thinking that it will be a waste of time. But once the movie started, I had no idea that how it dragged me into the story. Picturization was very realistic. There are small loop holes though, but a viewer will not notice it if seen once. Other than that it was a flaw less script. no where did it feel that something it was abrupt. The story was created as an experienced story teller. Nowhere did I feel that this particular scene was of no use. It had humor, taste of suspense, thrill; in total a perfect package. Truly this movie has raised the bars of bangla cinema. It is not for any specific group of audience rather it is for audience of all ages.My expression after seeing this movie, as it ended - I just jumped out of my seat and was shouting out I do wish to see part 2 of this movie....Simply a wonderful piece of work."}, {"id": 8, "text": "Not so awesome movie. but if you consider the level of Bengali movies, this movie is just genius"}, {"id": 9, "text": "Absolutely awesome movie indeed. Oscar wining movie. The movie is so well decorated &amp; well acted well directorate. the film has no bad marks for me &amp; I wish all the very best for the movie. I wish it will win more &amp; more national &amp; international award. The acting of Chanchal Chowdhury is tremendous. The all other people done their job 100%. The beauty of the film is the truth."}, {"id": 10, "text": "I did't go to watch this movie yet but all of my friends ready watching this movie. any time we can go . every where taking about this movie. Aynabaji is a 2016 Bangladeshi satire Political thriller film directed by Amitabh Reza Chowdhury and produced by Gousul Alam under the banner of Content Matters Production.Director: Amitabh Reza Chowdhury Cast: Chanchal Chowdhury, Masuma Rahman Nabila Music composed by: Shayan Chowdhury Arnob, Habib Wahid, Fuad al MuqtadirAynabaji is a film about an actor. Ayna is gifted with the natural talent of acting, he is an interchangeable man, he can morph into anyone he wants. One of the"}, {"id": 11, "text": "It is certainly one of the most over-rated movie I have ever seen. I am not saying, Aynabaji is a bad movie. Obviously, it a good movie. Overall It's a very entertaining movie. I liked it. The direction, acting and cinematography was exceptionally good. But does this movie really deserves such high rating? 9.4!? Probably some guys are not taking this rating seriously. They are too much biased or hyped. This movie simply doesn't deserves such high rating."}, {"id": 12, "text": "May be it's a good movie. I think it's a overrated movie. I will watch it again because I watched it once and I don't think this movie deserve such a great rating. It's just a ok or good movie."}, {"id": 13, "text": "Hello everyone. Aynabaji! Best Bengali movie I have ever seen :) Good job Amitav Reza. Smart debut for you! Story, Cinematography and Background musics were awesome! And hats off to Chanchal Chowdhury for his dedication and brilliant performance. Without any doubt, this is a new era for Bengali film industry. Such a brilliant work from Aynabaji team! Good suspense and thriller! Very good art film from Amitav Reza. He has potential to do good works.Newcomer Nabila was very natural. And this movie deserves some awardsanyway . It was great to see house full Cinema halls again in Bangladesh . Thank you!"}, {"id": 14, "text": "I am Bangladeshi but I don't watch bengali movies but this is one of the best movie in Bangladesh!! Must watch 😀"}, {"id": 15, "text": "Every characters are so natural 🤠.... Every plots of the movie was awesome..."}, {"id": 16, "text": "Just love this film a lot, like how Chanchal Chowdhury shifting his act from one act ot another."}, {"id": 17, "text": "I think it is the best movie in Bangladesh. The performance of Chanchal Chowdhury is mind blowing. I cannot compere it with another Bengali movies."}, {"id": 18, "text": "i never seen yet this type amazing movie yet, this movie was a great movie, especially chanchan chowdhry was very awesome,i never seen yet this type amazing movie yet, this movie was a great movie, especially chanchan chowdhry was very awesome,i never seen yet this type amazing movie yet, this movie was a great movie, especially chanchan chowdhry was very awesome,i never seen yet this type amazing movie yet, this movie was a great movie, especially chanchan chowdhry was very awesome,i never seen yet this type amazing movie yet, this movie was a great movie, especially chanchan chowdhry was very awesome,i never seen yet this type amazing movie yet, this movie was a great movie, especially chanchan chowdhry was very awesome,i never seen yet this type amazing movie yet, this movie was a great movie, especially chanchan chowdhry was very awesome,"}, {"id": 19, "text": "There are few movies in Bangladesh that are superhit. Aynabaji is one of them. The great drama actor Chanchal was in the movie. He played the vital role. His acting is always the best. The story is about Ayna, a struggling actor who gets to live his profession in real life after failing in his career. Gifted with the natural talent of acting, he is a man with a versatile character and can morph into anybody he wants. It is also a story about the dark side of metro city Dhaka.Though it was the firstmovie of Nabila, co-actress but she also did well. There are very fewmovies in BD that are thriller. It has a beautiful story. The movie has received a good response from audience. We do love this movie. It will be the revolution of our film industry."}, {"id": 20, "text": "Aynabaji is a phenomenal movie and with a great plot and tremendous acting from all of its cast. Chanchal Chowdhury is perfect for the main role Ayna with his unbelievable and prolific acting. This title is easily the best film of Bangladesh till date and I would not be surprised if they sneak in to the Oscars being nominated in 'The best foreign film' category. Hopefully this will be the ground breaker in the film industry of Bangladesh and we will be able to get many more movies like this. The story has got great grit about it and the sheer brilliance in the cinematography just keeps you on the hook. Suggest you all to go watch it in case you have not yet, it is worth the time."}, {"id": 21, "text": "To be honest, I am not a crazy fan of Bangla movie but It was an Epic film. Totally different concept, Awesome Cinematography, and quality acting from all of the artist. I loved the way how they captured Dhaka city in the very beginning of this movie. Till the last minute I enjoyed. Maybe I will watch it again :D Thanks to whole Aynabaji team.To be honest, I am not a crazy fan of Bangla movie but It was an Epic film. Totally different concept, Awesome Cinematography, and quality acting from all of the artist. I loved the way how they captured Dhaka city in the very beginning of this movie. Till the last minute I enjoyed. Maybe I will watch it again :D"}, {"id": 22, "text": "Hi!! I'm Ashik, from Mirpur, Dhaka-1216. Recently The movie named Aynabaji is shown by me at shyamoli cinema hall. It was a wonderful moment. I can't express my feeling about that moment in words. This is an amazing bangla movie I have ever seen. The hero of this movie named Chanchal Chowdhury. He is a very very very intelligent actor. This movie also have some romantic scene. I think this move is acceptable for all ages people. So please go to your nearest theater and enjoy this.Please do not take any kind of images from the theater of this movie. and don't wait for coming on youtube. please viwe aynabaji at theater.Please support our film industry. and specially thanks goes to the whole team who created this  aynabaji"}, {"id": 23, "text": "Aynabaji is a beautifully written and directed movie. Every scene had its significance. I have always avoided Bangla movie because of its lame dialogues and silly drama. But the makers of Aynabaji took Bangladeshi movie industry to a different level. Chanchal has played 6 characters. Each was played speechlessly by the versatile actor. Romantics scenes between Chanchal and Masuma added a flavor to the movie which never stretched to monotony. An important message is also provided in the movie. That is the corruption scenario of Bangladesh Police and the politicians. Bribery can save any criminals from punishment (jail).Aynabaji can be described in one word and that is MAGNIFICO."}, {"id": 24, "text": "Great movie ever and that's wonderful Bangladeshi movie. I also think that, it's better than Bollywood movies. Actually Chanchal Chowdhory acting great role. Nabila also acting great and she most important part of this movie. Most of Bangladeshi and Indian people like this movie. Ayna's Anynabaji great and that's most important political scene for Bangladesh. This movie has important part for Bangladesh's social crimes and activities. I think this movie can be selected for Oscar and will be won Oscar. This Chanchal Chowdhory's best movie and that's better than Mon Pura movie. I like Chanchal Chowdhory's amazing acting. Thanks Chanchal for giving this amazing movie for me."}, {"id": 25, "text": "After releasing at 30 September I heard a lot about this film from my friends. That's why I was also very curious about it. And finally, today I have watched the film. Really a fantastic film. Enjoyed a lot. Chanchal Chowdhury is really a genius. Really outstanding acting by him. The story is good. And superbly directed by Amitav Reza Sir. He proves that you don't need to go abroad or don't need any item song to hit films, all you need is a good story &amp; some good actors &amp; a good director if you want to make a good film. Aynabaji is a history making film for Bangladesh. So my suggestion for everyone that you should watch the film as soon as possible. I bet you that you must love the film. Thanks. Aynabaji Rockz! ♥"}, {"id": 26, "text": "I've stopped wasting my money on Bangladeshi movies, but this movie brought back to me theatre again. Except a very few movies, most of them are copied from other movies and the story line is quite disgusting. But, Aynabaji is quite different. Yes, it is the best Bangladeshi movie I've ever seen. The story line, Acting of the artists &amp; everything is superb. Chanchal Chowdhury proved himself again by his Aynabaji. We are eagerly waiting to see more Aynabaji from him. Another thing, the disgusting Sakib Khan era is going to end. We need more actor like Chanchal who can change the outfit of Bangladeshi movie. Hope director Amitav Reza will make another sequel of this movie. Hats off to the great Chanchal Chowdhury again."}, {"id": 27, "text": "It seems a very typical Bangladeshi movie that made by a drama director in the first 10 minutes but suddenly the super synchronizing of Chanchal's acting and background music you will feel the a thrill that you never felt before in the history of Bangladeshi cinema! The thrill that every Bangladeshi cinema lover waiting for the century, Aynabaji will end your waiting with it's dramatic story, acting, sound and cinematography. No movie is 100% perfect and also this but the last 30 minutes of the movie will help to forgot every error of the movie. What a super finishing of the movie. Pelase go to the near hall (must be: Jamuna, Bashundhara or Shamoly) and feel the movie like never before!Thanks: Tonmoy +8801730725839"}, {"id": 28, "text": "Ayanabaji, Something new for the country, After the publicity i finally decided to watch it, and i did. The confabulation on social media like Facebook got my attention. When I went to the cinema! What was that !! Honestly, it's a new series of extraordinary acting and film. Although it would be wrong to say a Movie , it seems like a simple type of drama to me. As I said earlier, however, there is no innovation. We already have enough with Shakib Khan, Jalil and some other actor actress. We are watching their boring movies again and again. It's high time to change the platform. Once my boyfriend said Only poor people like rickshaw drivers, Garment workers watches Bangla movies because there are no Good movies for educated people like us. I agreed with him and i never watched any Begali movies on cinemas. But i think now everything has changed. Here is Aynabaji for all types of people. If you are interested, you should watch Aynabaji. I'm not saying this is an amazing movie to watch but yes it is. Our film makers are doing well. Hope there will be more movies like Aynabaji. Chanchal Chowdory sometimes over acts. Rest of all was good. I'm giving only 5 stats because of poor graphics and sounds, It doesn't looks like a movie to me by the look of graphic. Whatever don't listen to fake reviews above and below. Remember one thing, higher rates doesn't mean the movie is great. There are so many great movies with lower ratings. Make your own decisions and watch it with your friends and family. Enjoy and good luck. Here i wanna say something more. It's sad that our country doesn't have better cinema halls outside Dhaka city. I request to the government to solve this problem so people can enjoy movie like this."}, {"id": 29, "text": "After all. Its not a movie it is a masterpiece. Easy review!"}, {"id": 30, "text": "Its an amazing concept based movie by maker. Outstanding performance by Chanchal Chowdhury. After a long time audience got an amazing movie from Bangladesh. The screenplay, bgm and the storyline was perfect which is highly needed for a thriller movie. maker Amitabh Reza shows his talent with debutant movie. And other casting was so perfect. 100% fresh and different type movie.."}, {"id": 31, "text": "Acting, plot, storyline, twist and turn, cinematography, music blending with visual everything is perfect."}, {"id": 32, "text": "This is absolutely the psychological thriller what a movie should be. Never miss any chance to see the movie more than one time. All thing were good except camera rolling. All in all, a watchable masterpiece."}, {"id": 33, "text": "Want to watch something fresh? Then Watch it.Simple but Fantastic triller moive"}, {"id": 34, "text": "Absolutely awesome movie indeed. Oscar wining movie. The movie is so well decorated &amp; well acted well directorate."}, {"id": 35, "text": "I loved the movie and as a bangladeshi movie it was a ultra masterpiece"}, {"id": 36, "text": "You may call it a masterpiece. Acing, Storyline, Direction all are up to the mark.."}, {"id": 37, "text": "This is the best Bengali Movie. I'm so proud because I'm Bangladeshi."}, {"id": 38, "text": "One of the awesome movie I have ever seen,very unique movie,Chanchal Chowdhury's acting was very good"}, {"id": 39, "text": "Canchal Chowdhury's acting was so beautiful. I'm proud that this movie was made by Bangladeshi Director. I wish directors of our country will made like this hit movie."}, {"id": 40, "text": "Unique story line that i liked most , lv bangladesh 🇧🇩....m"}, {"id": 41, "text": "If someone wants to see a beautiful movie then it must be this. There are thrilling, mystry.Bangladesh is now developed Their movie industry too"}, {"id": 42, "text": "You will find the real Art of Acting . not a single moment you will fell any fakeness . Real masterpiece."}, {"id": 43, "text": "When I saw the movie I think I saw a korean crime thriller movie. I am very surprised for looking chanchal chowdhary's performance. Overall, this movie is the most important for improvement Bangladeshi film industry."}, {"id": 44, "text": "It's too much good movie.It's turned point of Bangladeshi films and introduced Top rated films."}, {"id": 45, "text": "Excellent film ever I saw in my seen history...... Thank Amitabh Reja"}, {"id": 46, "text": "Amitabh Raza: He is one of the finest maker in Bangladesh. Previously he made so many excellent TV dramas and commercials, so when I heard that he's coming into the big screen and making his debut film, I was so thrilled and excited. Besides that, Rashed Zaman, the cinematographer (whom I call Bangladesh's Emmanuel Lubezki) was the other captivating element of this film which entices me even more. Today, I went to see the film which was the very first day of it's release and came back home with wide wonderment and joy.The lead actor, Chanchal Chowdhury is one of the brightest actor in this generation. Before, he was so good in Monpura (2009) and Television (2013). And now in Aynabaji he simply enchanted and stole the whole show single handedly. I can guarantee, he will win The National Award for sure. The story line was so unique and had so much depth, which allows Chanchal to make it more blazed. Chanchal is a sheer virtuoso of acting and this is obviously his best work so far.Not only Chanchal, the others actors, actress also put up a good show. Lutfur Rahman George, Partho Barua acted very well. Masuma Rahman Nabila was surprisingly good. There were some teeny tiny irrationality with the story line, but they are absolutely negligible, because if you want to compare with Bangladeshi Standard, Aynabaji was exceptionally good. In camera work, in sound editing and mixing, in casting ensemble, in costume, the whole film so skillfully mastered. The songs are pretty good, the script has so many punches and humors.Hats off to the whole team. This movie is highly recommended for all, to the general viewer and also for the other people who kind of love to see different tracks of movies."}, {"id": 47, "text": "May be some people could say that it is overrated or something like that but actually this movie is a piece.A challenging role played by Chanchal Chowdhury make the movie special.Every small role was given importance by Director. Amitabh Reza Chowdhury was the real kick ass.His shooting with a drawn was a great idea.Location,photography,cinematography,cas ting,costume,set designing,editing ; everything was just awesome.The story was unique and different. The dialogue was the best of Bangladeshi Cinema.Some dialogue contains a deep meaning.It is worth to watch.And obviously in Cinema Hall."}, {"id": 48, "text": "One of the most crime thriller in all of bangla movie"}, {"id": 49, "text": "This is best movie i have ever seen. Chanchal Chowdhury is awesom. His amazing acting convence me."}, {"id": 50, "text": "Wow!! Amazing movie, I have ever seen. It is one of the greatest Bangladeshi movie.Director: Amitab Reza 10/10."}, {"id": 51, "text": "Just awesome, I can't imagine before that Bangladesh can made these type of movie, What a character lead by Chanchal Chowdhury, just wow. Must watch movie"}, {"id": 52, "text": "The characterof ayna was too good. This movie has made me wonder. Anyway, it's a very good and well charactered movie. ❤❤❤❤❤❤"}, {"id": 53, "text": "One of the best movie in Bangladesh history.. Chanchal choudhary is a gem 💎 in our country"}, {"id": 54, "text": "Best acting comedy everything can't even tell if its real life or movie god what a level of acting 10/10 rating"}, {"id": 55, "text": "I was really confused if the film made in Bangladesh or not! The story was unique and exciting. The character changing of Canchal Chowdhury was amazing.It can be proclaimed a masterpiece of Bangla and Bangladeshi film 🌸🌼"}, {"id": 56, "text": "Outstanding work. We need this type of movies to improve our position in world cinema.This movie depicts that Bangladesh can make pure thriller with short budget. Movie story is the main part.If we can ensure a good story,we may find a position to people whose aren't concern about the new generation movies.OK Best of luck for the future."}, {"id": 57, "text": "It's a suspense thriller movie with some good plot what can make you feel good. After watching this you can relate why people are giving it high rating."}, {"id": 58, "text": "It's an amazing movie.Each actor played their rules very well especially chanchall chowdhury's acting was too good,looked like natural acting. It's one of the best movie i ever seen."}, {"id": 59, "text": "This movie goes like adventure. When the end come it become somethings else."}, {"id": 60, "text": "I saw this movie.. This is a very good movie and as a Bangladeshi movie it's outstanding"}, {"id": 61, "text": "It's a great movie in Bangladesh film industry.must watch movie"}, {"id": 62, "text": "One of the masterpiece movie in the Bangladeshi Film Industry. Undoubtedly worth watching. The character Ayna was impressive without any doubt."}, {"id": 63, "text": "It's the best movie ever produced from Bangladesh. I'm recommending every one give it a watch, I swear you won't regret it ."}, {"id": 64, "text": "One of the great movie I have ever seen. Just amazing. Best movie from Bangladesh."}, {"id": 65, "text": "One of the best movies I've seen so far. One of the best movies I've seen so far. One of the best movies I've seen so far. One of the best movies I've seen so far."}, {"id": 66, "text": "This is the best movie in 21 century. @ChanchalChowdhury's best work with Amitabh Reza Choudhury. Nabila Quait good"}, {"id": 67, "text": "Nice film with very accurate representation of characters."}, {"id": 68, "text": "One of the best Bengali movies i've ever seen... Bengali film industry should practice this type of movies..."}, {"id": 69, "text": "Aynabaji is the best bangla movie i have ever seen.......that is my all time favourite movie😊"}, {"id": 70, "text": "You are looking for a great movie watch this!! Everthing in this movie is so stunning i love the actor he should do more movies like this more often."}, {"id": 71, "text": "Hi!I'm from Bangladesh.Frankly speaking,our movie industry is not going well.The industry depends on only SHAKIB KHAN.The stories of movie become worse day by day.In that situatio, AYNABAJI is a great hope for us.Though the movie is worth of 9,but i give it 10 to inspire its artist.If you wanna see a Bangladeshi movie,it is mustwatch.Happy watching."}, {"id": 72, "text": "Bangladeshi filmmaker Amitabh Reza Choudhury used his talent and shows the mastermind. Tasteful screenplay, amazing cast, and cinematography. The story was so different which I dint see before. Specially Chanchal Chowdhury played his role so brilliantly which was so challenging for any artist. Amazing! So so blessing for this industry.."}, {"id": 73, "text": "Not like as usual bengali movies. Excellent script, mind blowing acting by Chanchal Chowdhury. Definitely it took bengali movie in a different height."}, {"id": 74, "text": "Aynabaji worth the ratings. Every charecter shows us why they are best in this Business. Their acting is worth many awards. And if you want to see the best of 21st bangla cinema, this movie worth a try."}, {"id": 75, "text": "I think, you guys must watch😌 This is an excellent movie.."}, {"id": 76, "text": "One of the best movie i have ever seen..............."}, {"id": 77, "text": "I think this is a masterpiece movie of the bangladeshi movie industry.this movie's actor, sequence,place,director all of are perfect.It deserve oscar for this creative story."}, {"id": 78, "text": "U will feel like kinda The Shawsank Redemption but its a completely new story.The acting + cinematography was Great.too much thriller. The song  Na bujhi Duniya  is so spritual.so must watch this movie"}, {"id": 79, "text": "When the industry is about to sink, Reza sir brought Aynabaji for us which is extraordinary. I think Bangladeshi film industry will rise again with these talented people. You shouldn't miss this twist thriller."}, {"id": 80, "text": "The only bengali i should recommend to watch. Its an amazing thriller movie"}, {"id": 81, "text": "What a film can do? I ask you, you will have so many answersabout that. But not every film can't change your mind for a particular thin. But this film has, Amitabh reza has already shown his directory skill in many ad. But this film is beyond any Bengali film.You should definitely see it"}, {"id": 82, "text": "One of the good movies of recent times. I like the uniqueness of the plot. Probably this is the first Bangladeshi movie that tries drama and suspense genre with pure Bangladeshi urban flavor. It's mesmerizing to see familiar locations like Paribag, Puran Dhaka, Sadar Ghat etc with subliminal frames. Chanchal Chowdhury again showed why he was awarded National Film Awards back in 2009."}, {"id": 83, "text": "In Bangladesh, It's wonderful to see this kind of movie."}, {"id": 84, "text": "One of the best Bangali movie i watche.Your time will not be wasted.Watch with English subtitle."}, {"id": 85, "text": "What a thriller movie it was!! Superb work ChanchalChowdhury and the hole team of Aynabajii.when I see this I was shocke. This movie deserve to win an Oscar.."}, {"id": 86, "text": "One of the best Bangali movie.Story and story telling was great. Cinematography of this movie unique than others bangali movie.For the very first time nabila act on big screen but her acting never give a feeling that she act for first time in big screen.Chanchal Choudhury❤ no word can explain his acting level. Director of this film mr.amitab reza deserve warm love. overall best movie so far"}, {"id": 87, "text": "How will you feel if you see your mirror image standing in front of you? Goosebumping, right? So is the movie. Happy watching!"}, {"id": 88, "text": "This is our movie. I wonder to see such a movie in our country."}, {"id": 89, "text": "This is surely a masterpiece.. a benchmark for the cinema industry.. I don't know after this when we will get exceptional movie like this . I'm egarly waiting.. Ayanabaji the history of Bangla cinema.."}, {"id": 90, "text": "Just awesome. excellent acting, cinematography, story., Sound track."}, {"id": 91, "text": "It's a awesome movie. i saw this movie more than 10 times."}, {"id": 92, "text": "The concept was pretty good I would have given it 10 the only department it lacks at is the casting.The supporting cast ain't that good and the heroine looks like she has been burdened with a herculean task.She is the epitome of how a perfect movie can be ruined because of bad casting."}, {"id": 93, "text": "Nice Story.One of the best movie of Bangladesh.I like this dialogue,''Bujonai Baperta."}, {"id": 94, "text": "When i first saw the movie i was like oh my god, what is it!!. in bangladesh generally we did't see this type of movie. aynabaji movie has romance, emotion, drama &amp; everything. everyone must see this movie. just loved it"}, {"id": 95, "text": "Now a days thriller movie become popular in Bangladesh .Aynabaji one of them. The acting of actor chancal choudhry is awesome . See and enjoy."}, {"id": 96, "text": "It is so enjoyable.............................................................................................................."}, {"id": 97, "text": "Nice to see......................................................................................"}, {"id": 98, "text": "I enjoy it..................................................................................."}, {"id": 99, "text": "A thriller that was world class in such a low budget.People of other world would be amazed to listen of this movie's budget.But.Director Amitabh Reja showed his class.Every Bangladeshi.should watch this movie.The music of this film of this movie was fabulous.Acting level was also fantastic"}, {"id": 100, "text": "I love thriller movie as well as suspensio.... Bangla movie is doing great.."}, {"id": 101, "text": "A great movie by amitabh reza. We hope it will be the best movie in bangladesh."}, {"id": 102, "text": "I just loved it so much. Great film.Loved the mysteris and twist."}, {"id": 103, "text": "One of the best movie in Bangladeshi film history. A unique story with absolute mysterious concept, outstanding acting by some non-professional actor with debutant Nabila &amp; a mysterious finish, what a delivery from Amitav Reza..Everyone are expected to watch it..."}, {"id": 104, "text": "After many fruitless attempt during the 'Great Frustration of Bangladeshi Cinema'; audience are discouraged from our contemporary promising filmmaker. The cinema was even more worthy for watching before two decades. Whereas, a vast amount of film buff in this country and only a few are fulfilling their expectations. Following the great frustration 'Aynabaji' is a name that actually can be called 'New Hope' for the film-goer in Bangladesh. A character name 'Sharafat Karim Ayna' changes his character for the imprisonment of himself in exchange of money. He believes that life is a stage and he is a great actor as he is in real. Ayna shifts from his character to other by rehearsing himself with the actual criminal. That part is really mind-blowing every time. 'Saber Hossein' a drunkard reporter who becomes suspicious over Ayna follows him throughout the cinema. He gets angry while drinking for being called 'looser' as his divorce is final and can't make a true report due to political reason. Though, he follows him but Ayna deceiving him every time. However, Saber was relentless for tracking him. Hridi lives next to Aynas home and noticed him while Ayna teaches acting to the children in a yard of a school. Hridi and Ayna fall in love each other. Hridi stays unaware about Ayna until Saber finds out and exposed to her. Ayna kidnapped by a serious political criminal who committed murder. The intensity of this cinema starts rising during the conversation between that murderer and Ayna. I think the best environment and conversation created in the history of Bangladeshi cinema. Cinematography by Rashed Zaman was stunning. I think this is the first time that wrapped beautifully every corner of Dhaka city. Musical score was astoundingly excellent. The make-up artist hired from India (I didn't find his name on IMDb) can be called 'master' for his brilliant hypnotic performance. There is good color tonality which is drowned with the narrative. Technically it was quite sharp in every sector. Story is beautifully written by Shaon and that is undoubtedly unique. Humorous dialogues made by Anam Biswas are really extraordinary.Amitabh Reza approaches the notion of pure film-making. His devotion toward cinema was suspicious for me after watching one by one his commercials. He is a renowned director for commercials and TV serial. 'Aynabaji' is his first film which really clarified his dedication on cinema. Amitabh Reza is an indigenous for fulfilling audience's expectations toward him. People can really keep their faith on him before buying tickets. After 'Aynabaji' Amitabh Reza is now a great inspiration for new film-maker. Hopefully, he will continue his journey that he started and having strength for contributing a lot in this country."}, {"id": 105, "text": "Ayna is an actor and the prison is his stage. He slips into the characters of the powerful convicted, in exchange of money and take their place in prison. This strange profession is borne out of a society that doesn't give him a chance to follow his passion of acting, but forces him to act in the real life. Falling in love with the girl next door changes his life equation and he decides to end this career with one last performance. But this one takes him too deep in the rabbit hole. While on his job in prison the convict is sentenced to hanging and so is Ayna who was pretending to be the convict. Although the film has a sad ending, the film ends with Ayna continuing to show his brilliant acting skills in the jail."}, {"id": 106, "text": "Sharafat Karim Ayna...seemingly a very ordinary, down to earth guy who loves to spend time with the children as their drama teacher, sometime goes away for weeks or months when his duty calls as a seasonal chef for a ship traveling around the Indian ocean. But under this carefully plotted fabric of impressions, Mr Ayna a.k.a.Ayna Vai is actually a master class real-life character actor who works as a proxy prisoner for the spoiled, rich &amp; ruthless people that failed to get a bail for their hideous crime in court. And every time he takes his job very seriously as he remarkably slips into the characters of his convicted clients to avoid any sort of suspicions from his surroundings. But just when he is planning to quit from this strange profession, one last job knocks on his door - given no chance to refuse, eventually demands too much from him... With an intriguing plot like this, Amitabh Reza Chowdhury really did a wonder in his directorial debut (for a feature length film) that can be regard as a genre-defining celluloid piece for Bangladeshi cinema. Beautifully shot, a neat &amp; gripping character driven thriller from start to finish. Kudos to the director &amp; his entire team for assembling a great cast who were stellar in almost every frame, particularly Chanchal Chowdhury on the lead did a phenomenal job; every time when 'Ayna' tries to impersonate the character of his new client (with a chilling score on the background) were the best moments of this movie, IMO. Partho Barua as an investigative crime reporter and the young new actress Nabila as the love interest of Ayna also skillfully shines on their respective roles. Loved the way ARC put a few popular faces through cameos. And last but not the least\u0085the striking cinematography as another winner of the show. I think we have never seen our city through such amazing wide angle, bird eye view shots in any BD movie before. The dark &amp; gloomy takes on a cloudy Dhaka somewhat represents this city as another character in the movie. Amitabh Reza's AYNABAZI is like a breath of fresh air for BD cinema (that has been in a kind of a limbo for an awful lot of long time due to lack of originality, creativity as well as decency!) and now this gives us hope for an exciting &amp; better future as we all wait for more genre-based films like this through a possible rising line of young &amp; talented film makers in coming days."}, {"id": 107, "text": "The script was fantastic, the theme was fascinating, acting was incredible specially Chanchal Choudhury. The cinematography of the movie is stunning. The story is really well crafted and the passage from one scene to another can be great, a very pretty movie with unusual camera angles. Dhaka never seemed so alive &amp; beautiful. It is one of the few Bengali films that deserves to be seen multiple times. Amitabh Reza Chowdhury did a great job with his amazing direction.Though the movie has few flaws in logic and story but it can be overlooked. What so ever, this movie is awesome. In fact, it is teaching us about that, if someone wants to find peace and do things with a cool mind, he or she should hear to his or her subconscious mind. This movie showed the pathway to the successful commercial film. As a Bengali film its worth watching....."}, {"id": 108, "text": "Warning! Spoiler may be there! Read it after watching the full movie!!Shakespeare once said that the world is simply a stage where we are all actors. After watching this movie, I also found myself as an actor. The way Ayna, the central character of this movie frequently changes his roles actually reflects our very own way of leading life. The life of Dhaka city, the dialogues and finally story itself talks on behalf of our selves! Ayna is none but a reflection of us which shows that sometimes we change roles to feel something different, sometimes we are compelled to do so. Regarding the crimes, the movie lovers need to watch the movie keeping in mind that this movie is based on a third world country where crimes are nothing unusual. Ayna is obviously a criminal in the eye of law; but still this character can hold a substantial place in the heart of the audience."}, {"id": 109, "text": "This is the best movie i ever seen i watched lot of movies but this movies is the best the story line and the directors and the casts are brilliant i watched this movie yesterday and when i watched this movie my mind was forced me to write a review for this movie . just one word super movie.. This is the best movie i ever seen i watched lot of movies but this movies is the best the story line and the directors and the casts are brilliant i watched this movie yesterday and when i watched this movie my mind was forced me to write a review for this movie . just one word super movie..This is the best movie i ever seen i watched lot of movies but this movies is the best the story line and the directors and the casts are brilliant i watched this movie yesterday and when i watched this movie my mind was forced me to write a review for this movie . just one word super movie.."}, {"id": 110, "text": "So, today i saw Aynabaji and this movie forced me to write something about it. Aynabaji is a metro thriller movie directed by Amitabh Reza Chowdhury and starring Chanchal Chowdhury, Masuma Rahman Nabila, Partho Barua etc.Outstanding Performance of Chanchal Chowdhury! Great Acting! Nice Direction and Camera shot. Chanchal Chowdhury has pulled off few great tricks of diving deep into character detailing, it was a treat to watch the 'training scenes'. Masuma Rahman Nabila acted superbly well in the film, her simplicity of acting the role was reflected positively towards audiences. Dress design was also done well in the movie."}, {"id": 111, "text": "A great combination of story and direction nice cinematography. Promising acting overall a great work. Amitab reza a new director from Bangladesh who just showed that it possible to do a better work if you give such effort. A great combination of thriller, romance and comedy. Its kind of a psychological thriller. Chanchal Ahmed a great actor showed his talent. I would suggest every movie lovers to watch this movie in the theatre. Its a pre-release review so a details review will come soon after the release. This is the directors first big screen direction. I always loved his work. He did some excellent drama in Bangladeshi TV drama."}, {"id": 112, "text": "I had stopped watching Bangladeshi movies from last 6 years. But this year, after watching the trailer of Aynabaji, it inspired me to go on Hall and watch this movie. And after getting out from there, i think it was my best experience. I recommend it for everyone.The main character played the best role here. Chanchal Chowdhury acted very perfectly. And the director Amitabh Reza Chowdhury, i don't want to disrespect him. He is very creative and the best. The character Ayna, it was very interesting. As my view, everyone of the hall enjoyed the movie very very much. Hope to receive more great movies like this one."}, {"id": 113, "text": "After many days when I saw the Bengali film,Aynabaji actually a nice picture.If movie like this, possible to make in our country then it will be not late to back the golden image of our movie industry.Thanks a lot director Amitabh Reza Chowdhury, who gift such a wonderful movie And thank you so much my dear actor Chanchal Chowdhury is to remind us that we still have such a talented actor so we can be proud of, we can say that we are not far behind than Bollywood or Hollywood.Last and not the list just waiting for another picture that will come out and which will have to see again and again."}, {"id": 114, "text": "I don't remember when I last found an intellectual movie in this part of continent which genuinely made me laugh. even though I watched the trailer the story was still able to shock me. Their use of moments(slow motion/wide shot with chilling background sounds) left me awed. Because I had no idea a Bangla movie could achieve this. They had a few clichés. But the acting didn't let yourself get out of the story. Thankfully no overdose of celebrities for commercial success . Although, I am still finding their voice amplifying annoying. Maybe it causes less trouble in understanding a sentence, but can't shake the feeling it seems artificial. In my opinion that's the only thing left for this industry in achieving perfection. All in all, unexpectedly good.I just turned into a fan of Amitabh Reza Chowdhury."}, {"id": 115, "text": "I watched Aynabaji on the release at Block Buster Cinema. Wonderful movie. Different story, cinematography. Everything was wonderful. Hope people of Bangladesh will watch more Bangla movies in cinema halls. Most favorite dialog in this movie: Everything is true for everyone, but for me, only acting. Chanchal Choudhury was great. He put a new milestone here. Amitabh Reza always a great director. Good-luck to Aynabaji team. Thanks for giving us such a wonderful movie. I want to watch it again and again. Creative script writer. Think tank with great vision Mr Gausul Azam has written this script. Music composed by Arnob &amp; Fuhad. Music legends of current period in all over the world. Chircut gonna add extra flavor on it."}, {"id": 116, "text": "The theme of the movie was great.The acting of Chanchal Chowdhury was best. Nabila also acts as well as Chanchal. Everyone must see this movie.The story of the movie was awesome. Every song of the movie was superb."}, {"id": 117, "text": "A great combination of story and direction nice cinematography. Promising acting overall a great work. Amithab reza a new director from Bangladesh who just showed that it possible to do a better work if you give such effort.All the actors justifies their roles in the film.Specially Chanchal Chowdhury does an extraordinary acting in the movie . His transformation from one role to another is just too good in the movie .His role Ayna is one of the unique characters in the Bangladeshi movie history ."}, {"id": 118, "text": "Great Movie in Bangla Movie History . want to see more movie like this i love this movie since when i saw the first look. after watch the full movie i just say one word, and that is (WOW) i hope we get more enough good movie like AYNABAJIThanks ."}, {"id": 119, "text": "'Aynabaji' is a well-made film. Even though the story was borrowed from a 2012 South Korean film 'Changsoo' ('Tumbleweed' in English), the treatment of it by the makers made it quite watchable. The music and cinematography were outstanding. The acting was commendable and direction showed strong promises in many scenes. The kid at the 'Hollywood Studio' deserves an award just for his expressions. The protagonist 'Ayna', played by Chanchal Chowdhury, was almost flawless in portrayal of the character. Gousul Alam Shaon was hilarious and was perfect in the shady role of Gousul. 'Mirakkelian' Sajal as the crime-reporter's housekeeper was funny as usual.Intra-personal communication or self-talking is a sign of weak script, and is not used in good movies or drama nowadays. The script should be written in such a way where this self-talking thoughts would not be needed, and the audience would understand the thoughts going on in the character's mind from the context. When Ayna was falling for Hridi (Masuma Rahman Nabila) but at the same time was being bothered by the crime-reporter Saber (Partho Barua), he went through a dilemma whether he should change his residence. He talks to himself about the situation, and that was a sign of a weak script.The story was a narrative and had no twist. This was the other major fault of the story-line. Although falling in love with Hridi did almost change Ayna from doing further fraudulent swaps, he eventually did not stop and stuck to his deceptions. As an audience, you would constantly hope that the final deal he took from the crooked politician Nizam was actually a ploy of Ayna (who became a good person because of Hridi) to turn him over to the law-enforcers in the end. And, that would have been a nice twist of the plot. But, disappointingly Ayna held on to his guns till the end and did not change being a professional impostor. I understand that modern films do allow the 'hero' to get away with murder or a bank-heist which tickles the common man's dangerous desires, but in this case, it resulted in quite a flat story-line. This also makes Hridi's character redundant, as she really did not play any purposeful role to Ayna or to the story. If Hridi's love could make any difference, her character could have been justified.Nevertheless, 'Aynabaji' showed us that clean movies are always appreciated by the audience. We need more such movies in Bangladesh to relieve us from the usual song &amp; dance melodramas that infest our theaters. Kudos to the people on &amp; behind the scenes who made a movie that the whole country is talking about."}, {"id": 120, "text": "Likes: Kudos to Director to make a film with such story line and also the main actor Chanchal. Dislikes: I really don't like the story line, its not believable at all. there are also many faults on the movie; like you can't be in the central jail month after month with fake hair and beard. And you can't duplicate a famous renowned politician.Summary: though i don't like the story line but i feel like i miss something in that movie that lead me to watch it again with more attention, and that's the main reason i love this movie. it makes you feel like you miss something, it lead you think and confused too. kudos to Amitabh Reza again."}, {"id": 121, "text": "The story line is good. But to make everything clear it should take more time to show details. Actors are great. I will give full credit to the story writer for not making it a super fantasy movie in the end. Everyone was expecting a bit twist when it was ended like a simple(partially) realistic one. Actually it's was like a thriller novel rather than a total movie.Main problem is time limit. Only 3 hours is not enough. Even though the main character has got most of the screen time, other actors were playing their role very effectively. Clean and easy to understand. Good work and keep it up."}, {"id": 122, "text": "Outstanding Piece of Creation ! Marvelous Project , Best Movie in Bangladesh's History So far . felt So proud to watch a Movies like this in our Own country . an Artistic direction with spectacular video concepts , You can find all the elements for people of all ages . Fun, tragedy,thrill, Drama, Music, Romance all in together in One movie , Never seen before . Problem with this movie is , Its too much breathtaking . its a movie you can never forget . choosing the artist Here one of the most talented creation from the producer and director . all the actors and co-actors here are perfectly fit for their character. I can guarantee Its worth watching in theater ! you can just watch it without popcorn!"}, {"id": 123, "text": "If you tell me which is the best psychological thriller movie from Bangladesh in last 15 years, I would definitely say Aynabaji. Becasue. it has - Best character unmatched with any other psy-thiriller characters. -Fantastic cinematography  Fine-cut story-line and backstory Overall, this is the gem of Bangladeshi movie."}, {"id": 124, "text": "The whole movie felt like a typical telefilm from back in the days.Male lead was outstanding but female lead needs acting lessons.She either overacted or overwhelmingly disappointed in key parts of the movie! More reasons for not to cast models/hosts of banal talk shows! In a nutshell, except the male lead,casting has been appalling! Cinematography was brilliant but direction was typical of a TV drama,nothing special! when you put the poor acting skills of most of the cast in to the that it feels like we have seen better material/direction/ acting in so many recent dramas in TV! In other words,it doesn't stand out. End of the movie,you will be wondering why you wasted your money and bothered to actually pay that buck and bothered! complete publicity stunt to draw public to the hall,only to disappoint. PS:Producer is the Managing director of the biggest AD agency/PR company of BD...so now you know why it has strong,misguided,mishandled marketing!"}, {"id": 125, "text": "It's not just bad – it's ingratiatingly awful. As ever, there's been a fair share of rubbish. This film is like a shiny, red apple that's rotten to the core despite slick direction and a glossy sheen, it reeks of decay. In fact this reprehensible piece of rubbish is more likely to be greeted with an appalled silence. About the only thing you can say in its favor is that the film is egalitarian, showing the same lack of respect for everyone and everything. This one is far from the worst of the genre, but gets points deducted for sparking so many bad sequels and spin-offs. I suspect that the film will probably make more sense to people who've read the graphic novels. It succeeds only in being tacky, unfunny and profoundly unconvincing. Absolutely nothing happens. Entire scenes wander past with the nutritional content.My Vote is 1 (awful).Thank You"}, {"id": 126, "text": "Female lead has no clue whatsoever what she is doing! It is quite clear she doesn't know or understand very basic concepts of acting! We have hoodwinked by a false AD campaign run by the producer's PR company! complete waste of time and money! There are TV dramas which are million time better than this! Director was clearly no clue when casting this awful lot. Since when partho, that talk show host became actors only god knows! Chanchal is the only good thing in this movie and clearly show difference between a born actor and people who randomly acts in TV adverts! He tries to carry to the whole movie on is shoulder but after first half fails miserably! A talented actor like him deserved better co stars...at least some people who actually can act!"}, {"id": 127, "text": "Female lead has no clue whatsoever what she is doing! It is quite clear she doesn't know or understand very basic concepts of acting! We have hoodwinked by a false AD campaign run by the producer's PR company! complete waste of time and money! There are TV dramas which are million time better than this! Director was clearly no clue when casting this awful lot. Since when partho, that talk show host became actors only god knows! Chanchal is the only good thing in this movie and clearly show difference between a born actor and people who randomly acts in TV adverts! He tries to carry to the whole movie on is shoulder but after first half fails miserably! A talented actor like him deserved better co stars...at least some people who actually can act!"}, {"id": 128, "text": "I am not going to give emotional review like others.The actors themselves done a very good job in acting. This movie didn't felt like other Bangladeshi movies where it felt like a cheap production with no sense of acting. Chanchal outperformed himself with his exceptional acting. And reminded us why he is the best leading actor/hero in Bangladesh right now. And Cinematography is good. It stands out from the garbage films that run on theater now.Besides these plus points, there's no plot in the movie. This movie could be told in a 15 minutes short film. That's why I am disappointed. The movie started beautifully. But there's no story in the movie."}, {"id": 129, "text": "Unique story, strong acting. May be the best film in Bangladesh."}, {"id": 130, "text": "The storyline and the concept of the movie is good but it doesn't deserve to be rated so highly in IMDB. An average movie with good performance."}, {"id": 131, "text": "I enjoyed it so much......................................................."}, {"id": 132, "text": "I enjoy it very much....................................."}, {"id": 133, "text": "Enjoy it,,,,,..............................................................wow"}, {"id": 134, "text": "As like everyone I love this movie . But there are some mistakes which are not appropriate for this kinda movie . The story is so good even the direction is . But there are some extra scene through the whole movie . Till now I can't understand , why there was a scene with reporter's wife and child ? And from where the a set of hair comes to Aynas head at noon but there were trimmed short hair at morning . That why I am giving this movie 7 . And people love this movie a lot but most of them can't say there is any type of hallucination . Is it really a success if ordinance can't catch the twist ? So, i want to say , everyone should think after watching a movie . We are too busy to watch a movie properly because we have to post a photo or a status ."}, {"id": 135, "text": "This story is copied from a korian Movie Tumbleweed which is directed by Mr. Duck-hee Lee. Amitav Reza and his team is a great liar and cheater. Please investigate.Both plot is same. They did not mentioned on movie that this is a copy plot of Tumbleweed. This story is copied from a korian Movie Tumbleweed which is directed by Mr. Duck-hee Lee. Amitav Reza and his team is a great liar and cheater. Please investigate.Both plot is same. They did not mentioned on movie that this is a copy plot of Tumbleweed.This story is copied from a korian Movie Tumbleweed which is directed by Mr. Duck-hee Lee. Amitav Reza and his team is a great liar and cheater. Please investigate.Both plot is same. They did not mentioned on movie that this is a copy plot of Tumbleweed."}, {"id": 136, "text": "This is a trademark cynicism. Ayanabaji has very consciously picked up the story of the image of social conflict of locality . People live in the midst of nature. Dialectics of the realities of the main themes of the movie. Director has cleared all his talent and labor. The story has become a full movie Ayanabaji as per variation of screenplay structure, humorous dialogue and full dedication to be a successful production in the contemporary period.Musical arrangement was so touchy and emotionally attracted.Uniqueness of artistic way of art direction and so far every single shot provokes every mango audience to fixed in their seat. Cinematographer Rashed Zaman has done a tremendous job for giving his merit of knowledge of experience in every single shot to made screenplay as if live imagination.Besides, traditional Bengali film footprint it is little bit quite different for its story telling process as per 'dark comedy' images can be found in the Screen. Simply, other sides of coin of life compared as exchange of mirror reflection of the life story is Ayanabaji.Scripted by the director to portray the struggle of life without fantasy. it is not a fairy tale . Film is larger than life proves to be concerned of.Each character in the film has been able to establish a spiritual relationship with the audience. present themselves in very honest way without any kind of fraud with audience. Class character portrayed honestly has the right to present positions and relationships.Sound-light-period game has increased artistic value of movie audiences' interest and attraction. Shot continuity able to properly present the series of events as his urban structure creates a unique illusion.Filmmaker expresses his devotion and honesty. Lexical artistic value not the slightest compromise.All of the lexical grammar of the film's existence has drastically Ayanabaji reformation.Its a time to be a change maker. Turn to take responsibility.In Ayanabaji you're probably familiar with the people there. Ayanabaji either side of your story. Above all, we can;Ayanabaji able to build on our originality. Ayanabaji bet to catch the picture. Please accounts .... You bet. You may see the other side of the mirror,smiling face; the smile of pleasure."}, {"id": 137, "text": "One of the good movies of recent times. I like the uniqueness of the plot. Probably this is the first Bangladeshi movie that tries drama and suspense genre with pure Bangladeshi urban flavor. It's mesmerizing to see familiar locations like Paribag, Puran Dhaka, Sadar Ghat etc with subliminal frames. Chanchal Chowdhury again showed why he was awarded National Film Awards back in 2009. Though the film has an unique plot line but I feel somewhere it lacks a bit depth as a full length feature film (probably it's the expectation from such a talented bunch of creative peoples). The second thing is the slow momentum and pace of events, sometimes you need to wait a bit more to see next events to happen. And the last thing is over using of drone and new/unknown frames to present the sequences. No doubt it is a sex for eyes to see such beautiful cinematography but this also distracts you and make you to give more attention on cinematography and frames (technical aspects) than the story itself.However, the hype creating and overwhelming response of the crowds inspire us that there is still a big market for Bangladeshi movies, our movies."}, {"id": 138, "text": "This is my first time review writing to IMDb, please pardon me for mistakes.According to Bangladeshi movie industry, Aynabaji gave us a totally new taste. It's absolutely a new trend for movie industry. Chanchal Chowdhury proved his talent again; all other shiny actors (including actress) did a very good job. Thanks to all.Choreography was wonderful and I recommend everyone to watch this movie. Most importantly, I would like to thank Amitabh Reza Chowdhury and Sound designer for using modern sound recording technology. For long time I didn't visit cinema hall for watching any Bangla movie and surprisingly this is the first time I found separate sound tracks has been used in Bangla movie (In Bangladesh). According to my observation I think sound track was recorded using 7.1 channels or 6.1 channels and also of course Dolby noise reduction technology has been used. If the sound recording engineer doesn't mind then I would like to say, there was one mistake and that is, when the political person was speaking from behind then his voice was coming through front or center channels. There could be another improvement, when the train was moving rightwards; the sound should be fade-out/fade-in to right back channel whereas sound directly gone to rear right channel. Thank you."}, {"id": 139, "text": "The movie is one piece of excellent film making in Bangladesh film industry till date. The hard work of the Director totally reflected including the entire teams work. Cinematography of the movie shows the development of the creative minds and technology use.The actors played their very well. Chanchal Chowdhury did an outstanding performance. He proved his excellence. He is an terrific actor which know from other films. But he crossed his own excellence here. The story line of the movie is very exceptional. Well executed and I couldn't think of any other end it could have been. Every bit of the movie had it's purpose. Well written story and the dialogues too. Music director also did very good. All the songs and background music were perfectly plotted. Bangla music essence was there.Overall, this movie is a very good watch! Every artist behind the movie and on screen did amazing which the movie reflects. Hats off to the team work!"}, {"id": 140, "text": "Amitabh Raza: He is one of the finest maker in Bangladesh. Previously he made so many excellent TV dramas and commercials, so when I heard that he's coming into the big screen and making his debut film, I was so thrilled and excited. Besides that, Rashed Zaman, the cinematographer (whom I call Bangladesh's Emmanuel Lubezki) was the other captivating element of this film which entices me even more. Today, I went to see the film which was the very first day of it's release and came back home with wide wonderment and joy.The lead actor, Chanchal Chowdhury is one of the brightest actor in this generation. Before, he was so good in Monpura (2009) and Television (2013). And now in Aynabaji he simply enchanted and stole the whole show single handedly. I can guarantee, he will win The National Award for sure. The story line was so unique and had so much depth, which allows Chanchal to make it more blazed. Chanchal is a sheer virtuoso of acting and this is obviously his best work so far.Not only Chanchal, the others actors, actress also put up a good show. Lutfur Rahman George, Partho Barua acted very well. Masuma Rahman Nabila was surprisingly good. There were some teeny tiny irrationality with the story line, but they are absolutely negligible, because if you want to compare with Bangladeshi Standard, Aynabaji was exceptionally good. In camera work, in sound editing and mixing, in casting ensemble, in costume, the whole film so skillfully mastered. The songs are pretty good, the script has so many punches and humors. Hats off to the whole team. This movie is highly recommended for all, to the general viewer and also for the other people who kind of love to see different tracks of movies."}, {"id": 141, "text": "Movie Review: Aynabaji (আয়নাবাজি)This was going to be a solid 5-star. Then the ending happened, which is too abrupt at best and too convenient at worst. But let's begin at the beginning, shall we?If you live in the city, (or if you read the newspaper, or if you don't live in a cave, basically) you won't be surprised with the fact that if you do a crime here, you don't always have to do the time. Money and power, that's what you need, and you can go scot-free. Oh, there's one other thing you need, though. That's Mr. Aayna (Chonchol Chowdhury). Why do you need him? He is only a cook after all, he works in ships. He's simple and he's nice- he even has a drama school for the street children in the neighborhood. But is all really what it seems? Is Aayna really at the sea when he disappears every other month or so? Or is he somewhere else, like, in someone else's life? Is he taking their place, doing their things, being them?Reporter Saber Something (forgot the last name, played by Partho) is having a bad day, on the other hand. His divorce is final, his news is non-existent since people are shutting their doors on his face, and when he does get a scoop, boss won't hear of it. So he drinks, and his manservant/self-appointed guardian (Jamil from Meerakkel) is literally the only one who cares about him. But a reporter's gotta report, and following Aayna around is bound to give him some proof, right? But it's not as easy as it sounds. Aayna plays his game, and better.But hey, there's a new babe in the block, so let's focus on that for a sec. Hridi (Nabila) isn't your typical girl-next-door. I mean, she is, but if you are a single bachelor in living in the neighborhood, she'll flirt with you over vegetable carts, bring you cake for no reason and plan a trip to Sylhet with you in a heartbeat even though she knows practically nothing about you. Girlfriend is either really gullible or really stupid. But what she does in the move is raise the stakes- which way would Aayna go? Love and acceptance? Or the biggest gig of his life that's also the biggest risk he'll ever take? Does he really have a choice?The movie has a fantastic premise, and it works because of its magnificent actor. Chonchol Chowdhury carries this move and he will easily have you in awe. You'll clap at his skills, hoot at his sass and lol at his quips. He is a sympathetic protagonist too. His work is shady and so are his motives- why is he doing this? Money? Escape from his own miserable life? The rush of the game, the playing of a new character? Would you care? Because I think not, and I think in the end you will root for him, as did I and a houseful of people at the first-day-first-show today.All the other actors were good too. Except Partho wasn't really given a lot to do and Nabila sometimes sounds a little fake. Acting, overall, isn't the problem in the movie. The balance between serious and fun is also perfect.What is the problem, then? It's the last half-an-hour.See, the movie isn't very fast paced, and I should warn you right now that if you're looking for masala, you won't find any here. Even the ass-first intro of a girl (it was in the trailer) doesn't result in an item song. The songs play no part in the narrative, all of them are in the background pretty much. And none of that is a problem. A movie can take its time to get going and still keep you hooked. The problem is when you lose the urgency.The movie is almost over. The net is closing in on Aayna. Can he get out of the mess he's in? Can anyone help him? Can he help himself? Will he listen to reason? You want to find out, but all you're getting is unnecessary scenes with Nabila which is taking up time which could be used to flesh out Aayna's final chapter. And them the climax happens and it's too convenient, too sudden- you might even feel it to be improbable. It's not, really, but it feels that way because it came out of nowhere. I can't stop thinking how much better, cooler, tighter it could be if it were done more slowly, more gradually. You'll be happy it ended that way, but you will also be thinking, 'That was too easy.'Also, there was some choppy editing in the second half where you can't tell how many days have passed between events.Aaynabaji is strong enough. It is well-acted, well-directed, well-shot and well-written, except for the climax, maybe. But that's really not reason enough not to watch it. With the kind of movies Dhallywood churns out every year- including movies that try to set themselves apart but falls flat (*coughPodmoPatayJolGangsterReturnsOstitto*cough), this is gold. So be classy and go support a good movie so we can get more of these and less of violence filled bullshit.4 .25 out of 5 stars.P.S. There are three cameos. One will make girls happy."}, {"id": 142, "text": "I consider this movie as one of the most fantastic and joyful movie to watch.Undoubtedly, one of the most brilliant Bangladeshi movie I have ever seen. Story, cast, screenplay all are great. It touch a social problem that few movie directors and producers took the risk of doing like the institutionalized thing. All of the stories developed in this movie even if they are all related of the main character, every own little story is very interesting and full of emotions. This movie contains good drama, thriller, a different comedy insight. Simply a wonderful piece of work.I can't speak for everybody, but this is a film that I can watch over and over again, and love it more each time I watch it. And, while I simply talked about the ending this entire review, that is not all that makes this film incredible. However, I will not waste any more of your time talking about how wonderful this film is. And please do not waste any of your own time. Find a way to see this movie as ASAP. It will be time well spent, and you will certainly see it multiple more times."}, {"id": 143, "text": "Aynabaji is a movie directed by Amitabh Reza Chowdhury who is one of the most brilliant director in Bangladesh and casts by Chanchal Chowdhury, Masuma Rahman Nabila, Partho Barua etc.The plot of the movie is unique and very different from the typical Bangladeshi movie . Ayna ,the leading character of the movie does a weird job for living .He takes people's place in prison for money .In one case , he faced a very big trouble .What is the trouble and how Ayna dealt with it, that part unfolds in the climax.What amazed me most is the cinematography. Specially the Ariel shots are memorizing . The background music is choice was too good . There is almost no loo break in the movie . All credit goes to the Aynabaji team for making such a good film in a minimal budget.All the actors did play their roles exceptionally good in the film.Specially Chanchal Chowdhury(Ayna) . His transformation from one role to another is just too good in the movie .In a word ,  Aynabaji  is a very unique thriller movie in the history of Bangladeshi movie industry . A must watch film for those who loves thriller and suspense stories."}, {"id": 144, "text": "If the hype around social media wasn't enough to get someone's attention to this movie, the buzz and response outside surely were. Aynabaji stormed through cinema halls at a time when Bengali movie industry was awaiting its impending doom and eventual loss of identity by morphing into just another counterfeit of more profitable Indian movie industries. Evidently, this was enough to make the Bangladeshi moviegoers rediscover their craving for Bengali cinema. But does it make Aynabaji the movie that it is fabled to be? My answer may not satisfy some. As I am reviewing it anyway, let me get started with the positives first. Aynabaji is unique. There is nothing quite like it in Bengali cinema. And the titular character Ayna is certainly one of the most complex and fascinating characters in Bengali fiction. He can be seen as a meta-commentary to actors in a whole. The struggles that come with their professions and how this affect their sense of personal identity. The director did a tremendous job at fleshing him out. While not a comedy, it's dry humor was witty and fitting but pretty shallow as well. The soundtrack and background sounds were nicely placed in many of the scenes but grossly exaggerated in others. While it tried to break out of the shell of a typical Bengali movie, it failed. Attention to detail in set design, cinematography and the portrayal of Dhaka was accurately done. Another thing also worth mentioning is the way some recurring characters aren't just cardboard cutouts but characters somewhat resembling real human beings even if the primary focus was always on the titular character. Sadly, Aynabaji isn't the perfect movie that many speak of. And many of its strong aspects are overshadowed by faults. The biggest issue of Aynabaji is that it tries to be too many things at once. A drama, a character study, a thriller, a satire, a love story, a psychological thriller, a slapstick comedy and in the end, it doesn't know what it is. The plot was needlessly convoluted and many plot elements were brought up and then thrown out without a warning or handled without necessary care. And some of the major events were made possible by plot conveniences which were undoubtedly immersion-breaking, The director bet his dollar on a willing suspension of disbelief too often and it doesn't pay off.The acting is certainly sub-par. The actors are either overacting or underacting. The sound editing doesn't do it any good either. And the cartoonish and grossly stereotypical representation of some side characters makes them increasingly difficult to take seriously(Especially the major and minor antagonists). In fact, keeping a straight face and not cringing becomes rather challenging as the movie progresses. The writing is filled to the brim with amateurish movie tropes. It doesn't try to think outside the box. As a result, the movie becomes predictable to anyone with minimal movie viewing experience. And the dialogue, oh the dialogue! It is undoubtedly the worst part of this movie. If I had a penny for every time the characters tried and miserably failed to say something profound, I'd have my ticket back. Bad dialogues don't make good chemistry either. As a result, character chemistry was forced. Most noteworthy being the chemistry between two main characters. Last, but not least, the movie's urge for crowd-pleasing ended the movie on a not so high note. And the ending certainly felt weaker than what I predicted. So, is it worth watching? It is if you are a Bengali. Because its success will lead to more filmmakers taking risks or being ambitious and the condition of this decaying film industry may improve. If you are a foreigner swayed by the high ratings on its IMDb page, don't watch it. Overall Aynabaji is a breath of fresh air in Bengali movie scene but only as a source of pure entertainment and nothing beyond. But even a popcorn flick as this comes with a fair share of positives to make one hopeful about the future of Bengali movies. Just don't expect it winning awards anytime soon and don't hype it to be something it's not.P.S. Sorry for any grammatical errors.l"}, {"id": 145, "text": "This is an extraordinary film and one of the best outstanding making of Bengali film industry is Aynabaji. Especially not at all like with customary Bengali motion pictures that are delivered in both Bangladesh and India. The primary job is Sharafat Karim Ayna, which is portrayed by Chanchal Chowdhury, has a few kinds of by-borne heavenly quality to duplicate any one's conduct. He likewise can enter anybody's mind and can coordinate the individuals around him. He goes to the jail keeping the genuine criminal outside by the trading of cash and anybody can't remember him. All through this film Ayna enters to the jail rather than a few hoodlums in various occasions. In any case, finally he gets caught as the criminal rather than whom Ayna comes to jail, is charged for capital punishment. Furthermore, through this the story goes on. Each character in the film has had the option to set up an otherworldly relationship with the crowd. present them in a genuine manner with no sort of misrepresentation with the crowd. The class character depicted sincerely has the privilege to introduce positions and connections. The film is striking for its extraordinary storyline. Such a character like Ayna is so hard to be described. The chief was essentially fruitful. Cinematography was great. In spite of the fact that it contains a few quantities of imperfections all through. It was the principal Movie for the chief yet he put forth a valiant effort. A few anomalies can be seen, however for a low spending film a few defects are extremely hard to eliminate Overall, thanx to all the cast, teams and everybody. Expectation all the imperfections can be eliminated and we will get Aynabji-2 or its spin-off. Absolute best of karma to the Aynabaji group Melodic course of action was so sensitive and genuinely pulled in. The uniqueness of aesthetic method of workmanship heading thus far each and every shot incites each crowd to fixed in their seat. Cinematographer Rashed Zaman has made a colossal showing for giving his value of information on involvement with each and every shot to made screenplay as though live creative mind. Plus, customary Bengali film impression it is somewhat very unique for its narrating cycle according to 'dull parody' pictures can be found in the Screen. Basically, different sides of the coin of life contrasted with a trade of mirror impression of the biography are Ayanabaji. This film truly gives us how men with riches and high influence drives their life in this adulterated society, It flawlessly brought up a clouded side of Bangladesh which was entrancing to investigate all through the entire film! Genuinely grand. Incredible work by Amitabh Reza Chowdhury, the overseer of this film. Projecting team were likewise incredible in their particular jobs. The sound-light-time frame game has expanded masterful estimation of film crowds' advantage and fascination. Shot congruity ready to appropriately introduce the arrangement of occasions as his metropolitan structure makes a special figment. An unquestionable requirement watch film for everybody. This film will merit your cash and time."}, {"id": 146, "text": "This is an extraordinary film and one of the best outstanding making of Bengali film industry is Aynabaji. Especially not at all like with customary Bengali motion pictures that are delivered in both Bangladesh and India. The primary job is Sharafat Karim Ayna, which is portrayed by Chanchal Chowdhury, has a few kinds of by-borne heavenly quality to duplicate any one's conduct. He likewise can enter anybody's mind and can coordinate the individuals around him. He goes to the jail keeping the genuine criminal outside by the trading of cash and anybody can't remember him. All through this film Ayna enters to the jail rather than a few hoodlums in various occasions. In any case, finally he gets caught as the criminal rather than whom Ayna comes to jail, is charged for capital punishment. Furthermore, through this the story goes on. Each character in the film has had the option to set up an otherworldly relationship with the crowd. present them in a genuine manner with no sort of misrepresentation with the crowd. The class character depicted sincerely has the privilege to introduce positions and connections. The film is striking for its extraordinary storyline. Such a character like Ayna is so hard to be described. The chief was essentially fruitful. Cinematography was great. In spite of the fact that it contains a few quantities of imperfections all through. It was the principal Movie for the chief yet he put forth a valiant effort. A few anomalies can be seen, however for a low spending film a few defects are extremely hard to eliminate Overall, thanx to all the cast, teams and everybody. Expectation all the imperfections can be eliminated and we will get Aynabji-2 or its spin-off. Absolute best of karma to the Aynabaji group Melodic course of action was so sensitive and genuinely pulled in. The uniqueness of aesthetic method of workmanship heading thus far each and every shot incites each crowd to fixed in their seat. Cinematographer Rashed Zaman has made a colossal showing for giving his value of information on involvement with each and every shot to made screenplay as though live creative mind. Plus, customary Bengali film impression it is somewhat very unique for its narrating cycle according to 'dull parody' pictures can be found in the Screen. Basically, different sides of the coin of life contrasted with a trade of mirror impression of the biography are Ayanabaji. This film truly gives us how men with riches and high influence drives their life in this adulterated society, It flawlessly brought up a clouded side of Bangladesh which was entrancing to investigate all through the entire film! Genuinely grand. Incredible work by Amitabh Reza Chowdhury, the overseer of this film. Projecting team were likewise incredible in their particular jobs. The sound-light-time frame game has expanded masterful estimation of film crowds' advantage and fascination. Shot congruity ready to appropriately introduce the arrangement of occasions as his metropolitan structure makes a special figment. An unquestionable requirement watch film for everybody. This film will merit your cash and time."}, {"id": 147, "text": "I watched Aynabazi Movie at the Star Cineplex, Dhaka back in 2016. It was the first ever crime thriller movie that I watched in a theater. Later I watched again on TV but didnt get the same flavour like the theatrical experience. I could have been written a long write-up on it, but decide not to give any clearcut spoilers.I always believe that the core competencies of a person could lead him/her to survive in this cruel world. So, we need to nurture our competencies whatever our situation would be.Sharafat Karim Ayna (Chanchal Chowdhury) is a person who lives in a small room of an old and shrivelled house in Old Dhaka. He runs a small acting school of children. He aspired to become an actor but the fate decides otherwise. He possesses an enormous skill of METHOD ACTING and in this skill he could morph into any character. Ayna converts himself fully on that particular character as if he is that person in real. He befriends with Hridi (Nabila) who develops soft corner by seeing Ayna's struggling, impoverish life but a kind hearted contribution to the children. Hridi is a kind hearted girl who lives with her father and a house assistant (Akter Hossain). However, Ayna's enormous skill has been recurrently used by the corrupted people of the city to woo laws and people's eye and Ayna, to survive himself in this ruthless city, sacrifices his ethics of being a good man. Crime reporter Saber (Partha Barua) follows Ayna for a long time to reveal the linkage between him and the dark world of the city.The acting of Chanchal was unparallel. After tremendous success in Monpura (2009), he escalates his standard of acting in a new echelon. If he was performed this Aynabazi performance at any Hollywood movie, he would be flooded by accolades, praises and awards from all over the world. Feeling sad that he is a Bangladeshi actor where he would never get such platform to unleash his true potential. I also praised the performance of Partha Barua, who is a renowned singer of Bangladesh. Though a small screen timing, Nabila performed very well.The same things of being a small movie industry person, story writer Gousul Alam and the director Amitabh Reza Chowdhury could get more attention if they were in Hollywood. As a crime thriller fan, I expect more stories from Gousul Alam like this. Amitabh Reza is a renowned media person who extends his talent by directing this movie which was his directorial debut.Music of this film was memorable. Personally I like the song Dhire Dhire Jao Na Shomoy by Habib Wahid and Anweshaa. The particular scene of this song, where Nabila stands in the rooftop of a building facing the river buriganga was scintillating. That snap was instantly viral amongst all Bangladeshi people. I have searched on that building and found that building is a private property and not for taking a Personal Photography there.Aynabazi receives 7 awards at the Bangladesh National Film Awards 2016 which are: Best Director, Best Actor, Best Screenplay, Best Cinematography, Best Editing, Best Sound Recording and Best Costume Design"}, {"id": 148, "text": "I will say that I have only seen 4-5 Bangladeshi films because you know all others are garbage over-the-top romcom with ugly camera.This movie blew my mind- the plot,the story, which is unique and suits the Bangladeshi setting. This kind of things does and can happen in this country with all the bloody politicians.The cinematography is one of the best, the drone shots to show the beautiful Dhaka city in wide shots were perfectly captured. I could watch those shots for hours and we did have many long shots of characters riding bikes, cars.Chanchal Chowdhury steals the movie with his acting range. He perfectly embodied the other characters roles and was believable. Nabila's romantic subplot wasn't just another cliche romantic plot but it served Ayna's arc of leaving the dirty job. Partha Barua was a plot progresser and we do go to his POV time to time. Non of the other side characters were bad, they made the film to have more of a realitic-setting.The songs, thank god there wasn't any male-female dance party music. Every single music was good and still time to time I play 'Lag belki lag,Aynabaji'. The heart felt romantic music and Jail song was also well done.The story is can divided to a 3 part story but the screenwriter uses it for advantage and tells 3 jail stories with slowly romantic subplot brewing in the back.One of the best if not the best Bangladeshi film of this generation."}, {"id": 149, "text": "Morning shows the day this is not always true, but it seems a little more truth for this movie trailer.In this case that the amount of Hype was made in the expectation that the people that it was no more after watching this movie has crossed the expectation that than the movie and now visitors like her, instead proves response!The main character in the movie Sharafat Karim Ayna(Mirror) another human character holding a mirror to help sustain people's words before the case even though he does not help them see that it will help, then.A total of six agile character played by actor. many people do not like him,thinks typo but if anyone has seen this movie.then he is bound to be definitely a fan, though not his fan,mouth that is to say WOW!Swear word will come out of this one character, and one character from converting another,awesome make-up in one word,that he has charisma and it was great!Amitabh discount anything that has given proof of this make-up man Muhammad Ali brought to Kolkata! Amitabh Reza does not compromise anything for this movie proved efficient for the small character actors in Hollywood, the actress has been cast but we do not have small roles in movies for the big star of the Amitabh picked.Reza has become popular enough for this movie,it indicates that the Applause sound was a fantastic!!! not !!! The rain scene to confuse what I say in one word awesome ❤ ❤ The performance portion of this movie, except I do not like ... one journalist used old model camera,this kind of use that you expect? antiquated camera beard and restless at the end of the original would have been better if.The title of the music is beautiful and lovely .. .. Why do the names of one Habib,Arnob,Fuad,Chirkut.Song the sin save has very important meaning and the song I greatly greatly like dessert after a big meal seed is last song by Fuad 😁 You all seem like all you goof taste.So if we all gather themselves😌 Bengali movie I've ever seen awesome !!! Best finishing, the this movie is this kind of movie that people will not be able to leave the seat until the end! Another powerful aspect of this movie is the dialogue,all great dialogue throughout the whole movie!It became part of our lives, This is some of the dialogue is a political plot did not understand it ? Moreover, the politics of the people,one of the biggest acting,I am outside, you can be inside?It is fun, the morning after the change of character.Shifting one character to another when the wind shifts. Around change, time stops, when the truth is a lie. For all the true. Only one mirror?I do not think we've been constantly played a variety of in order to satisfy the interests of our greatest actors, and politicians,they have everything influential political voice, we want to get the bank to conspire laws! It did not understand ???? There is no item song, dance, swinging hip dance,action,sexual scene so why people like piper-boy followed by the flute man of Hamylon gone to watch Aynabaji? If you want to know the answer you have to watch Aynabaji"}, {"id": 150, "text": "This one sets new benchmark for both Bangladeshi and Bengali films. A+ is every department - plot, cinematography, script, cast and music. Aynabaji is probably the first Bengali movie that will keep you glued to the screen without a moment of break. I didn't find one loose second in the film. Its the most visually delightful Bangladeshi movie till date. Old Dhaka, already quiet charming but chaotic - is presented as a wonderland! If you have grown up in Dhaka or are familiar with Dhaka political power-play, this story would be nothing unbelievable to you. It feeds in to the curiosity you already have. To be frank, Chanchal Chowdhury raises the bar for Bangladeshi movie actor too high. His transformation to different characters feels effortless and natural. Debutant Nabila does justice to her character as well. Casting is sensible - though we'd be happy to not see Partho Barua in this masterpiece. Music isn't the best feature of this movie, but then again it is not the kind of movie that needs music to carry it off. Songs and background scores are soothing to the ears with great lyrics. For lack of a better word, I'd only say the ending is 'mind-blowing'. It leaves you wanting for more."}, {"id": 151, "text": "This is a great movie I ever was seen. First time I set and complete a movie in one change and this is Aynabaji. I will love to go again with family to enjoy this movie again! Thanks!Musical arrangement was so touchy and emotionally attracted. The uniqueness of artistic way of art direction and so far every single shot provokes every mango audience to fixed in their seat. Cinematographer Rashed Zaman has done a tremendous job for giving his merit of knowledge of experience in every single shot to made screenplay as if live imagination.Besides, traditional Bengali film footprint it is a little bit quite different for its storytelling process as per 'dark comedy' images can be found in the Screen. Simply, other sides of the coin of life compared to an exchange of mirror reflection of the life story are Ayanabaji.Scripted by the director to portray the struggle of life without fantasy. it is not a fairy tale . The film is larger than life proves to be concerned of.Each character in the film has been able to establish a spiritual relationship with the audience. present them in a very honest way without any kind of fraud with the audience. The class character portrayed honestly has the right to present positions and relationships.The sound-light-period game has increased artistic value of movie audiences' interest and attraction. Shot continuity able to properly present the series of events as his urban structure creates a unique illusion.Thank you"}, {"id": 152, "text": "Aynabaji is a thriller movie which surprises us all. The plot of the movie is very unique &amp; interesting. Most amazing part of the movie is the cinematography. It's like the road in front of my house could be different if it represent me differently. The soundtracks of the movie are also very elegant.In Bangladeshi film industry, Aynabaji is a very unique one. From the beginning till the end this movie makes us thinking what will happen next.All the actors in the movie are doing very well. Chanchal Chowdhury shows all the talent he got. His acting really surprises me. The new face Nabila also did great. With all the thrilling part there are some romances in this movie also. Those scenes give the perfume to imaging sweet moment.Overall this is an excellent movie. Everybody should watch it. This movie is full of quality."}, {"id": 153, "text": "First if all, this type of movie is the first of its kind in Dhallywood industry. Moreover, we have not encountered such plot before in Bangladesh. It was quite interesting to watch. I have left visiting cineplex due to poor performances by the Bangladeshi movie stars, but this movie created huge excitement throughout the country since the release of its trailer. It actually compelled me to find a gap between my final exam and visit the cineplex. After more than a decade, we have seen Bangladeshi cineplexes declaring Housefull. It is certainly a good sign and I welcome Amitabh Reza for this renaissance. Now, most of the time we have seen that an exciting trailer fails to provide an exciting film. But this movie was different. It has pointed out our social anomaly in quite with style and definitely has claimed its spot in my heart. Lead role played by 'Monpoora' movie star Chanchal and he was more than impressive. It was really very difficult to act in several roles with such perfection . New comer heroine was also up to the mark. But some sub-ordinates were disappointing due to over acting. But the good news is that- they couldn't mark a spot in the thrill of this movie. If I am going to make a list of all time top 10 bangladeshi movie, it will be certainly there. Best wishes for Amitabh reza and co. for revival of Dhallywood"}, {"id": 154, "text": "What do you expect when you start watching a bangla movie?If you ask me this question,Ill say that i expect almost same type of fiction,same type of romance and some unbelievable fights and so on.But this movie has changed the taste of bangla movie.And it will change yours too.The main difference with the other bangla movies is it has a strong plot of events.the flow of the story is so fluent and easy to catch for all kind of audience.Though you know about what is happening but you will not be bored or the mysteriousness of the movie will not be decreased.chanchal chowdhury who showed his talents in the movie 'monpura', proved his skill once again.Without his extra-ordinary acting skill this movie cant be as popular as now it is.all the bangali movie lovers,this is a highly recommend movie for you all.it will be one of your favorite movie without any doubt."}, {"id": 155, "text": "Story &amp; Direction - Director Amitabh Reza Chowdhury did really a very good job. Direction was just fabulous. The story is simple and unique but very charming. Twists and turns of the movie are also very effective and coherence with the story line. The most important thing of the story is that there is no unnecessary scene or event in the entire movie. Every person seen in the screen has some important role. But there are some things that i am not totally satisfied, the story could be more deep at some points, some things are not explained fully. But comparing to the other Bengali movies in recent years the story is more close to reality.Acting - The acting of the casts makes the movie very enjoyable. Especially Chanchal Chowdhury did an over the top acting. This is undoubtedly his best and one of the best performance i have ever seen. I am convinced that he is one of the most talented actors in our country. Nabila also did a very good performance as her debut in cinema. Even the small characters of the movie also did very good acting. Cinematography - We can see a renewed Dhaka in this film. The shots from the above was so good. Traffic jam, daily life, rainy day everything has been shown in such a way that it feels our life, our story, our beloved city.Background music - The songs and the music is just awesome. Every song of the movie is perfectly coherent with the story. At last, again thanks to the director, producers, cinematographer and hundreds of others behind this for giving us a good film. We expect more films like this every year from our film industry."}, {"id": 156, "text": "I was not a fan of Bengali (Bangladeshi) movie. This is the first Bengali movie I have added to my IMDb watch list and also this is my very first movie review on IMDb. I couldn't resist to write this because I want people to know that how awesome this movie is! It made history on Bangladeshi cinema indeed, also won lot of peoples heart including mine.The story, plot, cinematography, sounds, casts you name it and it's perfect. Everyone in this movie did a tremendously brilliant job. I am just impressed!Chanchal Chowdhury did a marvelous acting. Also Partho Barua and Nabila gave a wonderful rendition. Every other small characters were perfect. It's full of fun and thrills and suspense. The locations were great too. Hats off to Amitabh Reza for his brilliant direction. The story and dialogues were also fantastic. In a nutshell Aynabaji is a true masterpiece. Everything you want is packed wonderfully in this movie.I am really happy to see Bangladeshi film makers doing such a mind blowing job."}, {"id": 157, "text": "this will be short. no spoilers-The movie was a great one because of the skillful direction of Mr. Amitabh Reza Chowdhury and crafty performances of Chanchal Chowdhury, Masuma Rahman Nabila who inspired the audience to be connected to every plot in the story line of Mr. Ayna( Chanchal Chowdhury).I loved the story of Ayna, his humor, his motive, his pains and love.The movie didn't have any typical Dhaka-ish movie glamour/ hero-heroin saga . Rather it seemed so realistic and charismatic.I hope the producers will invest more for this type of movies and inspire the writers to write good stories for movies and help to uplift the skills of our countries' directors and actors."}, {"id": 158, "text": "It's great to see cinema halls full of people cheering and laughing and enjoying a good film. I couldn't watch it right after the release but I managed to watch it on second week and I must admit the director Amitabh Reza surely kept his promises. We waited for his first feature film for a long time. He comes with great promises and he delivers a very enjoyable psycho-political thriller with a tone of romantic story line which didn't disappoint me at all. Now, instead of saying it pleased me, I said it didn't disappoint me. Why? Let's get to that later. A man named Sharafat Karim Ayna serves time in jail for convicted criminals in exchange of money. He is a born actor, imitates anyone within minutes and manipulates anyone with his hypnotic personality. If you pay him well you don't have to be in jail, he would do that for you happily. This guy loves his con acting and loves his mercenary transformation from one character to another. There is something thrillingly artistic about his life. He isn't bothered about the morality of the act, considers himself a real life actor which makes the character more interesting. A woman comes into his life and a curious journalist starts asking questions. Great outline, great premise. The story begins.The story promised a gripping tale of a con artist and you need a great actor to pull it off. Chanchal Chowdhury has done an outstandingly brilliant job on the male lead. Watching him transitioning from character to character was a delight. All the characters he played were believable especially the transformation into a rogue politician against his will was a showcase of sheer brilliance. The chemistry between him and the female lead Nabila needed more attention. She looked very refreshing yet a little artificial often. The storytelling has a few loopholes, clichés and continuation mistakes which I decided to ignore because of the overall experience. The ending seemed a bit disappointing and unbelievable at first but I am happy that it's actually believable if you know the protagonist well. There are suggestions and references in the film for the explanation. But I expected a grand ending. I was expecting a proper 'prestige' act. The director shared his perception about religious fanatics subtly. Comic reliefs were put in proper intervals and I enjoyed some of them. Background score was exquisitely well. Background scores were holding the intensity when required. The Best thing about this movie is the cinematography. The depiction of the Dhaka city was nearly poetic, melancholic, romantic and alive at the same time. Every character and place got their appropriate angles. It was never visually dull.I heard about a Korean film (Tumbleweed, 2013) with an exactly similar synopsis. I watched that one immediately after this. Apart from the one liner synopsis and a few minor questionable similarities, the two films are totally separate films. We can say everything that Korean film was missing we got those in 'Aynabaji'. The Korean one says that he serves jail for other people but we never see him doing that sort of anything in the film. On the contrary, the main lead in Aynabaji kept dazzling us with his versatile character jumping all the way to the end. That Korean film cannot be an inspiring one and even it is, I would say Amitabh Reza has created a whole new story and done much better. Unlike Mostofa Sarwar Farooki, who completely copied the concept of Vizontele and reversed it. The thing that annoyed me most about this film is the ongoing rating mania on IMDb. I saw 1500 people rated this film 10/10 before its release (29/9/2016). Sometimes people do that on IMDb but let's admit it; 1500 general audience from Bangladesh did not register on IMDb to rate this film before its release. This was done under some PR campaign. This was the start and after that, thousands of people started acting like T-1000 with a mission to give a 10/10 rating to save the Bengal film industry. If the IMDb authority checks these accounts, they would find all these 8000 votes came from accounts which were opened before or after the release of the film. It's just funny that some people want 8000 fake ratings for a film. In the end, I have to admit that I was tired of watching our promising directors making trash one after another. Aynabaji is a complete exception to that. Aynabaji is an entertaining film and it entertained me in different levels. This is a great effort for a first feature film and we would be eagerly waiting with positive enthusiasm for the next film from Amitabh Reza."}, {"id": 159, "text": "Aynabaji is a title, which is simply just one of a kind. An unique, classical drama movie, where we find a simple actor Ayna, leading his life through acting in his real life performing various roles. Though the story may seem simple when we just read the plot, oh boy, trust me, It has one of the best and unique plot which you have never heard of!The suspense, the simple romance between Ayna and Hridi, the glorious plot and the sequences all were up to the level, where I thought Am I really watching a movie which was made in Bangladesh? wow!!!!! This movie really shows us how men with wealth and high power leads their life in this corrupted society, It beautifully pointed out a dark side of Bangladesh which was mesmerizing to explore throughout the whole movie! Truly marvellous.Great work by Amitabh Reza Chowdhury, the director of this film. Casting crew were also great in their respective roles. Chanchal Chowdhury, who played the main character Ayna in this movie has done his role superbly.A must watch movie for everyone. Trust me, this movie is worth your money and time. I hope many brave directors will come out of the shadows with their excellent works after seeing how this classic movie rocked the whole nation Bangladesh."}, {"id": 160, "text": "One of the best exceptional creation of Bengali movie industry is Aynabaji. Very much unlike with traditional bengali movies that are produced in both Bangladesh and India.The main role is Sharafat Karim Ayna, which is characterized by Chanchal Chowdhury, has some sorts of by-borne supernatural quality to copy any one's behavior. He also has the ability to enter anyone's mind and can direct the people around him. He goes to the prison keeping the real criminal outside by the exchange of money and anyone can't recognise him. Throughout this movie Ayna enters to the prison instead of several criminals in different times. But at last he gets trapped as the criminal instead of whom Ayna comes to prison, is charged for death penalty. And through this the story goes on.The movie is remarkable for it's exceptional storyline. Such a character like Ayna is so difficult to be characterized. The director was significantly successful. Cinematography was pretty good. Though it contains several numbers of flaws throughout. It was the first Movie for the director but he did his best. Some irregularities can be seen, though for a low budget movie some flaws are very tough to remove Overall, thanx to all the cast, crews and everyone. Hope all the flaws can be removed and we will get Aynabji-2 or it's sequel. Very best of luck to the Aynabaji team."}], "reviews_amount": 161}