{"name": "Wolfwalkers", "titleId": "tt05198068", "reviews": [{"id": 0, "text": "Overwhelmingly well crafted and told to where I immediately just got focused, letting the film absorb my soul with such unsustainable jubilation. Akin to a child enamored with worlds some believed to be impossible, but were brought to life due to limitless imagination. Exactly like my first run in with Cartoon Saloon almost 11 years prior.First movie in a long time where at every minute I went; Dude, this is metal!. And when it was over I was like; Man, I cannot wait to see this again."}, {"id": 1, "text": "With a story as touching, relevant and engaging as any you've encountered from a Japanese studio you may be familiar with, and similarly exquisitely hand crafted, you will devour, gobble, gorge, nay - wolf down this enchanting, endearing and captivating animation set in Kilkenny, Ireland during the times the countries neighbour was going through its despotic, tyrannical, dictator days (days not than long since passed if we're honest). Plenty of metaphor and allegory to sink your canines into but just as easily taken as a genuinely honest tale of right over wrong, good conquering evil and the perpetual endurance of love, truth and nature."}, {"id": 2, "text": "Wolfwalkers is a 2020 Irish animated film and tells the story of an english hunter(Sean Bean) and his daughter Robyn (Honor Kneafsey from A Christmas Prince) who traveled to Kilkenny in Ireland from England and they are set to kill the last of the wolf pack as they are wolfwalkers. However Robyn befriends a young girl named Maeve(Eva Whittaker)who transforms into a wolf and bites Robyn who also turns into a wolf. Will Robyn protect Maeve and her clan?. The animation is gorgeous, the story is very good and the story was also very good even though we have seen this type of story before e.g. Pocahontas,Brave,How To Train Your Dragon.Overall I loved this film as I have a friend who begged me to see this film and I finally got to see it before it was released in December.If you love Brave and How To Train Your Dragon then you are gonna love this. Tommy Tiernan as voices a charcther.Let's hope this will get a nod at the Golden Globes and Oscar's 2021."}, {"id": 3, "text": "In short, the story and characters isn't as good as The Secret of Kells but the art-style, animation and action scenes are pushed next level, it comes together with the music to create something really magical and overwhelming. It's a bit more bombastic, less nuanced and straight-forward that previous Cartoon Saloon movies but when it's that good it's hard to complain about it."}, {"id": 4, "text": "An absolutely breath taking film, a must watch and my now favorite film of 2020. You will not regret the experience that this film has to offer."}, {"id": 5, "text": "One of the most beautifully animated films I ever seen. Every scene is like a work of art, combine it with its amazing soundtrack and VOILA, a true masterpiece! Truly transports you into the world of Wolfwalkers.The story itself was absolutely fascinating and touching. It's themes of friendship, loyalty, trust, and family will truly resonate with people of all ages. Definitely teared up a bit (from happiness).TLDR; I LOVED IT. A must-see for everyone!"}, {"id": 6, "text": "Wolfwalkers is everything an animated film should be. It uses its medium spectacularly and the end result is movie stuffed to the brim with a magical feel to it. As stunning as the animation is, it is the poignant story of man vs. nature that leaves a lasting impression. You could sense the film was special from the beginning, accompanied by wonderful animation and a surprisingly thoughtful narrative. Overall the movie is must-see and an incredible achievement in filmmaking; animated or no."}, {"id": 7, "text": "Easily the best animated feature since Spirited Away.Wolfwalkers, the fourth and most recent film from Cartoon Saloon, is easily one of the best animated films ever made. Co-director Tomm Moore and the whole studio has shown how big and talented they have become trough the years.This is the third Cartoon Saloon movie about Irish folktales, following the already superb The Secret of Kells and Song of the Sea. When the studio got really high releasing Song of The Sea and The Breadwinner I thought they couldn't make it better, but Wolfwalkers shut my mouth. And I'm not saying I had low expectations for this one, I actually was really hyped and ready to be disappointed."}, {"id": 8, "text": "WOLFWALKERS, an Apple Original Film from Cartoon Saloon beautifully and breathtakingly completes an Irish folklore animated trilogy with The Secret of Kells (2009) Song of the Sea (2014). Utilizing two-dimensional hand-drawn techniques with a plethora of pastel colorations, and eye-catching geometrical patterns combined with Celtic music featuring harps, violins and a sundry of woodwind instruments, artists Tomm Moore and Ross Stewart take their previous efforts to another level, and, in my opinion, is their strongest work to date. Wolfwalkers made its US Premiere during this year's American Film Institute's AFI FEST presented by Audi and was the recipient of the festival's Audience Award for Best Narrative Feature. Wolfwalkers, steeped in historical significance, is a film the whole family can watch"}, {"id": 9, "text": "This movie definetly needs multiple oscars, its just... best move i ever seen, its too good that I cant even describe it..."}, {"id": 10, "text": "I saw this movie last night, and I thought it was amazing. I loved it. The movie has a wonderful script, the characters are so interesting, and the animation is spectacular. This masterpiece does splendidly when it comes to telling an incredible, intriguing story with groundbreaking visuals, making this movie a real delight for the eye and imagination."}, {"id": 11, "text": "Beautiful, stunning and magical. It's like a fairytale drawed with pencils and acuarela on an old book. A piece of art! The story is written with love and lot of symbolism. Disney is great, but this is an oasis from any angle you want to see it!"}, {"id": 12, "text": "TIFF 2020 07WolfwalkersThis is a really enjoyable animation from Tom Moore and Ross Stewart. The animation style is close to last year's acclaimed work Klaus, but in terms of story and setting, it really ressembles the works of Miyazaki, especially Princess Mononoke. The most major theme in this film is the conflict between humans and nature/forests/animals. It's a solid work and there wasn't any things to complain about, but it's a theme that has been explored many times before. Also Sean Bean rocks in whatever he does."}, {"id": 13, "text": "After viewing the interesting Josep (2020-also reviewed) I decided to look at the other two feature film titles in the Manchester Animation Festival line-up. Having really enjoyed Song of the Sea (2014-also reviewed) I was excited to see a stream of the latest film by the studio taking place,with a question and answer interview with the makers afterwards,leading to me walking with the wolves.View on the film:Revealing during the in-depth Q&amp;A after the screening that they had started working on the film seven years ago, the level of care co-writers/(with Jericca Cleland and Will Collins) co-directors Tomm Moore &amp; Ross Stewart placed into the production,leads to a magical creation.Mentioning in the Q &amp; A that Robyn was a boy in early drafts of the script, the change to Robyn being a girl by the writers, allows for intense drama from Robyn having to break through the barricades placed in front of her by the ruthless Lord Protector and her dad Bill,along with a emphasis on the fairy/folk tale aspect,of little red Robyn going deep into the mysterious woodland filled with wolves.Pointing out in the Q &amp; A that they originally openly named the baddie Oliver Cromwell, the writers alteration to him being the Lord Protector (with English flags prominent in the background of shots) gives the villain a towering folk lore/ fairy tale menacing presence,who shoves away any who disagree,and confronts Robyn as a huge obstacle she must overcome to save the last wolves.Going to Ireland to kill the animal of the former Stark family symbol, Sean Bean gives a excellent turn as Bill,whose voice weighs heavy on daughter Robyn's pleas for him to help save the wolves, but is unable to shake a sense of duty towards the snarling Lord Protector.Walking into the wild woods to the lush chimes of Bruno Coulais's score and the whispering vocals of Folk group Kila, directors Moore and Stewart meet the wolves with mesmerising, shimmering pastel colour giving the hand-drawn animation the texture of having come straight from the pages of a old fairy/folk tale book.Detailing in the Q &amp; A the inspection they got from 17th century wood carvings, the directors carve a eye-catching rustic, rough-edge stylised appearance, which gives Lord Protector pointed tough edges,as Robyn walks with the wolves."}, {"id": 14, "text": "Would recommend to everyone, scenes were beautiful, art and the animation ahh yes i loved how smooth it was and I loved the style so much! Everything was magical! 10/10♥"}, {"id": 15, "text": "I don't do a lot of reviews, this one is worth it. Go watch it , you won't be disappointed."}, {"id": 16, "text": "This is pure magic indeed! Very deep and symbolic, perfectly timed to address some of the actual topics nowadays. I was absolutely swiped away."}, {"id": 17, "text": "I rarely shed tears of joy on a movie, but this one really got me. Its just catches something in your soul, the most amazing thing. 12/10"}, {"id": 18, "text": "I expected great things from Tomm Moore, have been waiting for this for a long while and I'm sad to have watched what I watched.It's high quality animation and it will probably keep a child's attention for 90 minutes but the script has no soul or even sense whatsoever.Just a lot of crude stereotypes doing things stereotypically.Whatever points I give, are for the visual part only. Credit where it's due."}, {"id": 19, "text": "I loved this film for the following reasons. 1. The kind of animation that they have used. All hand-drawn. Like the cartoons we used to see earlier when we were kids. 2. Sean Bean has given voice to one of the characters and I'm a fan of his after Game of Thrones and LOTR: TFOTR and so, it was a treat to hear him. 3. The trope of man v/s nature (like in Pocahontas, Avatar and Atlantis: The Lost Empire). I liked all three of these films and so, there's no doubt that I'd like this one too. 4. The subtexts beside the subject matter. The main theme is what I mentioned earlier. But other than that, if you can read between the lines, you'll notice how subtly the film points out racism and also how effortlessly it showcases feminism. 5. The ironies. A girl is asked to stay away from forest and wolves by her father and those same wolves are asked to stay away from humans and hunters by a wolfwalker. A father wants her girl to not go out, speak out her mind because he doesn't want her caged by the administration and for that, he puts her in another cage; doesn't let her get out and forces her to stay in. 6. The visuals. I was literally mesmerized on seeing the beautiful forests and waterfall and even the town is shown so beautifully with so much detailing. 7. The thrills. Many a times I found myself whispering Oh, no , please, no throughout the film. 8. The message. Like the above mentioned films, the message here is so important. The world is as much of other species as it ours.This film is clearly a labour of love and you should definitively check it out. If you are a sucker for animated films, no chance you should miss it and if you don't like them much, try watching this one and maybe you'll start liking them.P.S. : This is a fantasy film so please don't be skeptic about the things that'll happen. Don't watch with your brain, watch it with your heart and give in to the world of this stunning film."}, {"id": 20, "text": "I'll just start by saying Song of the Sea was a flash of brilliance. So maybe it's unfair to compare this movie to it. If you are expecting similar quality you may be disappointed. The story follows the same tired trope that so many, many, many movies seem to be unable to avoid when it comes to introducing mythical creatures. Mythical creature exists. A human (or small group of humans) discovers it. The whole world is against the creature and it's up to this person to save this creature from being destroyed by the world (E.T., Pete's Dragon, Water Horse, Super 8, Earth to Echo, Bumblebee, Home, just to name a few). Truthfully I feel this story, even if it wasn't overused, does a disservice to the creatures being introduced. We are so focused on how these creatures don't mix with humans that we can't simply be drawn into the whimsy and fantasy of a mythology. And unfortunately there is precious little to learn about this mythology. The Wolfwalkers are basically werewolves who can heal people and control wolves. That's it. We know that the main Wolfwalker Mebh lives with her mother and a pack of wolves in the forest, but we never find out anything about where the Wolfwalkers come from or what they do besides running around with wolves in the forest and healing the occasional person or creature that gets hurt. But enough about the Wolfwalkers. Let's talk about the rest of the characters. Robin, our heroine, is the stereotypical tomboy stuck in the wrong time period who just wants to hunt wolves with her father instead of scrubbing floors and dusting walls all day. In further stereotypical fashion her father doesn't understand her and frequently refuses to listen to her. They live in a town ruled by the lord protector who is basically the Claude Frollo for wolves. Why does he hate wolves so much? A question for another movie. He also protects his city with gates containing holes large enough for wolves to fit through but that's also another question for another movie. Without going into great details about the plot, overall I was underwhelmed with the cast and how they were developed throughout the film. The plot was almost entirely predictable. The animation itself was decent. Again, maybe not fair to compare it to Song of the Sea, but it wasn't in my opinion, nearly as striking or interesting. Probably my favorite aspect of the film was the score. It was beautiful and I will go back and listen to it again. Overall, a passably entertaining film but not one I will likely bother to watch another time."}, {"id": 21, "text": "The most fascinating 2020 animation to date Best Adventure Animated Thanks Tomm Moore, Ross Stewart(Directors)"}, {"id": 22, "text": "The pictures are just gorgeous and the story is so heartwarming... Love, love, love!"}, {"id": 23, "text": "When I first saw Song of the Sea in 2017, I couldn't wait for the studio, Cartoon Saloon to make their next masterpiece and the wait was worth it. The animation is awe inspiring, the writing is fantastic and the characters are spectacular. It's time for this studio to get the love and respect they deserve. I don't if the Academy Awards are happening next year but this movie so deserves Best Animated Feature. If possible, Best Picture. Tomm Moore and his team are as visionary storytellers as Pixar and proves hand drawn animation can still be impactful."}, {"id": 24, "text": "Finally a great animated movie. Definitely one of the year's best."}, {"id": 25, "text": "I would like to start this review by noting that I will try anything to become a Wolfwalker.... ANYTHING!This animated movie was enchanting from beginning to end. The story, the writing, the music and especially the visuals gave me goosebumps multiple times throughout. This movie has multiple layers and is a fit for all ages. I don't want to spoil too much, but please give this beautiful film a go even if it's not your genre."}, {"id": 26, "text": "Not only is the art captivating, but the storyline is delightful as well. This is a must see for fans of classic, well thought out fantasy. Take time to watch it, you won't regret it!"}, {"id": 27, "text": "'Wolfwalkers (2020)' tells the tale of a young girl who discovers a magical mother and daughter who transform into wolves at night. Soon, she must help them avoid death at the hands of the English soldiers who are cutting down their forest and slaying their kin. It's a very traditional sort of story, one which hits almost every beat you'd expect it to. It also deals with themes of tolerance, friendship, peace and nature - again, all things you'd anticipate to find in a film of this kind. However, just because it deals with tropes doesn't meant it deals with them badly. It's an entertaining affair throughout. It's also beautifully animated and has a gloriously hand-crafted aesthetic. It's an enjoyable and visually distinct experience from beginning to end. 7/10"}, {"id": 28, "text": "Superb animations and story. And it makes you feel god damn emotional."}, {"id": 29, "text": "WolfWalkers is at least until Soul comes out the best animated film of the year and i must say that this movie has a very sweet story of friendship in it and its messages are very clear and strong.The best thing about film was animation that was very different from anything that we are getting now days from big studios like Pixar and others and because of that i recommend this film if you are willing to accept something different and fresh.Story was also very good and it showed how we also need to treat nature and animals with care"}, {"id": 30, "text": "Very enjoyable! :-). Beautiful, fluid, stylized animation! English and Irish accents are sometimes really strong and hard to understand (at least for Americans like me), so you may have to turn on subtitles.As cool and beautiful the animation is, I am a little on the fence with the results from some of the innovative techniques for shading and perspective."}, {"id": 31, "text": "Tomm Moore, one of the best animation filmmakers we've right now, probably all time, just behind Hayao Miyazaki. A fine end to the trilogy, that's beautifully told stories of the Irish fairytales.If you loved Previous two, you'll love it as well. As usual the animation was impressive. Who makes 2D animation in the today's world. So it's a treasure. And the 2021 Oscars nod should be a must, otherwise the ceremony has no value. And unlike previous two Oscars nods, this time hopefully it wins. Fingers crossed.The music was too beautifully blended with the storytelling. A movie for all age groups and a must see. I'm already waiting for the next film from the director. Before that, I'm gonna rewatch it a couple more times, or even more."}, {"id": 32, "text": "This movie was a pleasant surprise. Artistic - every shot is like a beautiful fine painting, lovely music, and a great storyline.It shows what movies really are capable of. An emotional movie that made me appreciate life, and my family.10/10 for me."}, {"id": 33, "text": "Hi I am a fan of wolfwalkers it so cute and cool I will Watch it again"}, {"id": 34, "text": "Great Illustrations/Animation deserves a great storyline as well! Children definitely ask questions when storylines are jumbled. Most are taken in by the illustrations and forget nothing really happened in 1hr 40 minutes!"}, {"id": 35, "text": "As I am a fan of the works of Cartoon Saloon (especially Puffin Rock, which I praised for taking the intelligence of young children seriously), this was naturally on my list.The animation in the movie is rock solid, stylish, even daring at times and provides a great result.The voice acting was decent, Sean Bean put on his Lord Stark voice and everyone else delivered decent performances. The casting choices matched their characters.Music was good, wouldn't say they were memorable but they fit the tone very well.The story was ''meh''. Not terrible, but nothing of real value either. Character development was non-existent - the plot took too long to get going, specific conversations repeated several times without anything different about them and the themes (e.g. Christianity vs. Celtic Mythology) was watered down to a ''Christian Man bad, misinformed and dumb - Celtic people good'' argument. it's a shame, because a lot could've been done with it.That's not to say its bad - the pace was good. The place in time it takes part in (directly after the English Civil War), and how the Irish/English relations were, were done properly. The characters are a product of that time, and that was very well done. The Celtic symbolism was excellent and superbly detailed, it's just a shame they put in 0 effort for the Christian side of the conflict and their justifications except ''well, God wants it this way I guess''. It's also a shame there was 0 tension, since nothing dramatic actually happened where you might think I hope character X will make it.I guess that's the core problem; the story didn't dare to do anything with its plot, characters, themes and lore. Robyn didn't have to go hunting for rabbits or deer and kill them for food and have inner conflict about it. The mother didn't die. Ned Stark survived. (Sean Bean surviving, that's a new one for me). That daring is something movies like Princess Mononoke did, and that is such movies are stronger.All in all, good movie, nothing legendary like the Lion King or Pinnochio, but I would let my child watch this."}, {"id": 36, "text": "I waited 3 years for this masterpiece and it was worth every second. Brutal, gorgeous, moving, heart-filled."}, {"id": 37, "text": "Wolfwalkers features one of the best hand drawn animations in recent years(if not all time). It is on par with Studio Ghibli films and I'm also glad that its story is also great. The voiceover in this film is very well especially Honor Kneafsey(Robyn) whose accent I adored. The film is very similar to Princess Mononoke, it is kind of a homage to it but it was also able to find something original. In the first 30 minutes(setup portion) I thought that the film was overhyped because while its animation was gorgeous, its story felt mediocre(a girl suppressed) It is not bad or anything, it's just that we had seen it so many times before. When Robyn and Mebh start spending time together, the film shined. I loved everything about their relationship, their chemistry was just amazing. I could just watch them being together, talking and running for 2 hours straight. The symbolism to old history is also very well done for the adult audiences but it doesn't mean this movie is not for children. It is entertaining and has a simple message as well but the way they integrated a deeper message(intended for adults) to the film surprised me. They nailed it. The ending felt kind of more childish(so that it can get a PG rating) compared to Princess Mononoke which was more raw(I know that movie wasn't intended for children, but thematically about nature vs. humankind it goes way deeper). Wolfwalkers is a great movie made for both children and adults and I highly recommend it."}, {"id": 38, "text": "How do you get a rating 1.5 times higher than Shrek and etc. 3D animations? This Irish Anime similar to another Celtic Mythology cartoon Brave does it. 4/5 for drawing from various classics from Maleficent to Mononoke, but huge pluses of beautiful aesthetics, watchability for adults and Irish VS English accents!"}, {"id": 39, "text": "Wow, just wow. This movie has everything, stunningly beautiful artwork, masterclass writing, brilliant voice acting and a whole lot of heart. The closest I felt this way for an animated movie was with spirited away.Just watch this masterpiece, and do yourself some favor."}, {"id": 40, "text": "This movie is so amazing, omg I love it. I don't know how to mention it. This movie is awesome I have ever seen. I just wanna say to you that just watch it. You must be like it. Thanks for creating this movie. Thank you so much 😊"}, {"id": 41, "text": "Wolfwalkers: Wolfwalkers are humans who live with wolves, when their spirits leave their bodies they transform into wolves - werewolves. Set in 1650 in Kilkenny, Ireland and the woods near the town. Cromwell has occupied the area and is having the trees cut back, the wolves attack the tree cutters but the wolfwalkers try to mediate. A tale of the daughter of an English wolf hunter meeting up with a girl who is a wolfwalker. A friendship develops to the background of the occupation and the war between wolves and mankind. Beautiful, imaginative animation, the den of the wolves in a cave has rocks engraved with runes and sun wheels. A film which operates at several levels but at all times is entertaining. Directed by Tomm Moore and Ross Stewart from a screenplay by Will Collins. 8/10."}, {"id": 42, "text": "Highly recommend this movie to everyone who loves traditional animation, magic, fairy tales and good stories. I think children will like this movie. And if you can't wait to show little ones in your life Princess Mononoke but they are to young this film can be good alternative."}, {"id": 43, "text": "Let's start with the good news; thanks to the jump forward button I am finished watching this movie. Without that button I would have stopped at the 6 minute mark. I found this to be unwatchable. I'm certain many people worked very hard to bring us this product. Let's hope the stop after this movie."}, {"id": 44, "text": "This could have been so much improved if they used actors that could enunciate and project their voices clearly along with competent sound engineers ( it comes to something when Sean Bean was the only one who was almost understandable) - it was also spoiled by intrusive background music that didnt help the clarity of speech - a lot of good work went into this exceptional animated story - a pity it was spoiled by poor sound engineering unfortunately this seems to be an ongoing problem across the board - I had to give up 1/2 way due entirely to the strain of trying to decipher the dialogue"}, {"id": 45, "text": "I do not like this style of animation, It is not my cup of tea"}, {"id": 46, "text": "Great movie that's drawn. I just love the art style it is amazing."}, {"id": 47, "text": "I think this is the worst Cartoon Saloon movie. That being said, it's still a great movie."}, {"id": 48, "text": "Great animation movie, most probably would win an Oscar, also the soundtrack is amazing."}, {"id": 49, "text": "Wolfwalkers is a story about Robyn, voiced by Honor Kneafsey, an English girl in a small Irish town of Kilkenny, 1650. Her father Bill, voiced by Sean Bean, is tasked with trying to root out the wolves in the forest surrounding the town. Robyn hopes to be a skilled hunter like her father, imitating him with her own cross bow and pet falcon Merlin.This film takes place during a time of war and occupation, Robyn's father working under the tyrannical Lord Protector Cromwell, voiced by Simon McBurney. The Lord Proctor is trying to quell other Irish rebellions and keep the populace subdued. This puts pressure on Bill to quickly take care of the wolf problem, or face dire consequences.Soon Robyn comes into contact with the infamous wolfwalkers, lead by another girl Mebh. Robyn learns that the wolfwalkers are not as bad as she has been led to believe and has to come to terms with this conflict between wanting to be like her hunter father, and protecting the humanity of the wolves and wolfwalker.Cartoon Saloon's style of hand drawn animation is some of the most beautiful I've seen. Every frame has intricate, meticulous details that make their films a unique visual delight to behold. This film has numerous cinematic shots and sequences that push the boundaries of what can be done in the medium.Overall this is an excellent film, on par with their other brilliant feature length animated films The Breadwinner and Song of the Sea. I would strongly recommend anyone give this film a watch.9/10."}, {"id": 50, "text": "Well I'm long overdue for another review, however there wasn't any animated films for me to talk to because of well.., you know what, except for this..., this is one of my most highly anticipated films of this year!, this is the latest film from Cartoon Saloon and it's directed by Tomm Moore who did Secret of Kells, Song of the Sea and produced Breadwinner all of which I really liked with Song of the Sea being my personal favourite, so I was beyond excited to hear this was coming out this year, i didn't even know it was coming out until I found out it was coming to Apple TV, I remember there was a concept trailer for it and it looked really cool, because as we know Cartoon Saloon's films are based on Irish Folklore or something like that, it's coming to Apple TV in two months, however it was actually out in my local cinema, I heard so many amazing things about this film, it was played at film festivals and it was almost like one of the most talked about films of this year, so of course I would jump to the chance of seeing it!, so I saw it yesterday pre Lockdown (second time) in a sort of empty screwing and...., wow!, this might be my favourite film of the year, I'm not even joking, so let's talk about it.In 1650, a hunter named Bill Goodfellowe (Sean Bean) and his daughter Robyn (Honor Kneafsey) move from England to this small Irish town in need of hunting some wolves, however Bill is just needed while his daughter stays in the village so she is safe from them, however she wants to help his father kill the wolves, so she sneaks out of the town and happens to come across a wolfwalker named Mebh (Eva Whittaker), who can transform into a Wolf when she is a sleep, Robyn then quickly grows fond of her and they both start a bond, as friends, however as the Lord Protector (Simon McBurney) is trying to get rid of all wolves to protect his town, so Robyn has to convince his father that Wolfwalkers are real and must do what she can to save her friend and the wolves, first off I love the idea of the folklore of Wolves and how someone who is bitten by one can transform into a Wolf, it's quite a unique idea and the storytelling is at it's finest, it tells the story in a unique and wonderful way using visuals to tell it stories along with strong emotion and action that define the characters and the world around them, it's also balances out sweet charming humour with real and powerful emotion and by the third act it really drives the emotion home, it's also really creative in how Wolfwalkers work, there are so many enchanting and fun scenes where characters are running free as Wolves, it's really beautiful and just lovely, granted it can be rather predictable, however it's actually not too cliched, you just want to see how it ends and the film really does pay off and does have a very satisfying ending, it's also quite grim and dark also, there are scenes where characters get shot by arrows via crossbow and the impact and the scenery really ramps up the dark factor in making it real and shocking, it's also a very mature animated film which is kind of rare since nowadays it's toilet and reference humour, but this time the humour is very playful and quite charming and it feels nature then forced, so the storytelling, the directing and the nature feel to it really makes the film feel more genuine and real despite being animated and having fantasy elements to it, it's perfect storytelling mixed with nice humour and strong emotion, especially Robyn and Mebh's friendship, the story feels like a strong pack.The animation is just unbelievable, I knew this company was capable of making stunning 2D animated films, but this takes it to a whole new level, this is unlike anything I have ever seen, first off It's great to see 2D animation on the big screen, it's very cool and such a huge experience for me especially since we mainly have 3D and stop-motion animation, with that said this is some of the most original and unique 2D animation I have seen in a very long time, I love the way this films looks, the characters are all nicely design with unique facial expressions, shapes and movements, the backgrounds are atmospherically gorgeous with smooth shading and outlines, I also love the way the forest and the town is structured, it's like a painting or a puzzle it's really outstanding, however my favourite aspect of the animation is the Wolfwalker part, the wolves are wonderfully designed especially Mebh and Robyn, there is sense (no pun intended) of you can tell it's them by their eye colour and even their fur colour kind of represents who they are, there are scenes where we would see the world from a Wolfwalker's point of view, where we would see lots of outlines of trees and animals but a lot of them are in all sorts of different vibrant colours, it's really something to behold, we may have seen 2D animation in many beautiful and unique ways, but the animation here unleashed it's full potential.The characters are loveable and well defined, they are all very believable and just a joy to watch!, Robyn is quite a endearing main character, she is adventurous, curious, cheeky and really sweet, I really enjoyed her and especially when you can really sympathise with her, at times when the film gets emotion you really do feel sorry for her since she is trying to convince Bill that Wolfwalkers exist, speaking of which, Bill is probably one of the best animated dads out there, he is really charming, caring and a very relatable dad also, his relationship with Robyn is both lovely and heartbreaking, Mebh is also a really endearing and great character, her friendship with Robyn is quite cute and heartwarming, she is full of energy but also has a emotional side to her, when both Robyn and Mebh turn into wolves it's really enchanting and very cute to see them both run free in the woods, there are other characters like the bullies, the soldiers, the one who saw Mebh and her mother turn into a Wolfwalker and even the wolves themselves play a supporting role, although the wolves play a big part in the film, the rest are just stereotypes but they do make sense and do play a small key role in what they are supposed to be even if it's not major, however the villain of the film is the Lord Professor, he's the one who wants to kill all the wolves in the name of the lord, while not a strong villain, he is rather understandable as to why he wants to get rid of them, he's not really that much of a big bad, just a leader trying to protect his town from beasts and threats, as for the voice acting, it's.... really fantastic, they are play their parts rather naturally and put in so much emotion which is very good in my book, Sean Bean voices Bill and he is great as always so no complaints there, Honor Kneafsey as Robyn is brilliant, she really sounds like she was really enjoying voicing and you can tell she is put in so much emotion in her performance, same can be said with Eva Whittaker as Mebh, she really puts in lots of energy and enthusiasm as well, Simon McBurney is pretty good, in fact everyone does a fantastic job with their voice performances even if they don't play a big role, the characters really have that feel of genuineness and realism, along with playful humour, heart and understandable motives, along with phenomenal voice acting, the characters are really pawesome!..., I had to.On a side note, the music used in this film really captures that Irish feel and sound to it, the score is genuinely wonderful, it's composed by the amazing Bruno Coulais and he really outdid himself here, it's one score I really want to listen to when the soundtrack comes out, along with very fitting songs including the very popular Running with the Wolves song by Aurora which is a really good song by the way!What else can I say that hasn't been said already?, this film is.... just unbelievable, it's unlike anything I have ever seen, from the huge responses it's getting from critics and audiences along with some great ratings!..., I am comfortable to say that this film is a masterpiece!, Wolfwalkers is not only my favourite film from Cartoon Saloon, but it might be the best animated film and film in general of this year!, it has an amazingly well told story with a creative concept, it's really grim and dark, it has good heart and sweet humour, along with epic action and a intense third act, animation that is mindbogglingly gorgeous and stylish, characters who are mature and well written, along with terrific voice acting and lovely music!, it's just fantastic, if you are a fan of the studio, go check it out if you can, as for everyone else, I do highly recommend it, please try and see before it leaves cinemas, it's out for a limited time or wait until it's on Apple TV, it's a must see for all ages know I'll be watching it again, this studio has impressed me before but now..., this is their magnum opus, I hope they continue to make more films like this, because not many people see them which is a shame really but I'm glad I saw this one as soon as I can, as rubbish as the year was, at least we got something incredible to hopefully finish off the year (Until Soul comes out that is).This film one hundred percent deserves a 10/10!"}, {"id": 51, "text": "The woods is getting smaller everyday.I can guarantee it right now, this will be the most underrated animated film of the year, or even in the past decade or so. With big name films that Disney produces, it's hard to remember there are other studios making animated films just as great or even better. Wolfwalkers falls under this category. Like the other films from this studio, it focuses of Irish tales and folklore. Song of the Sea amazed me when I watched it only a couple years ago. Wolfwalkers is just as amazing and some may even say better than Song of the Sea. I'm not apart of that group but it's a really close call. The animation is the first thing that caught my eye. This is the most beautifully animated film in years. The autumn colors look beautiful on screen. And with the style they use has so much details. And I loved looking at the patterns within. I'm not the person to talk to about animation since I'm no artist, but all I can say is that it is just stunning.The story feels sort of familiar in ways, but is done well. The predictability factor, typically in animated films aimed for children, isn't too strong. But I wouldn't even go to it being aimed towards children. As lore, I feel that this is for everybody. I felt engaged the whole time. There's always something exciting or interesting happening on screen. The characterization isn't as strong for everyone, more towards the main antagonist, but by the end you feel connected with these characters. The voice acting is all good. The two main characters couldn't have been better voice-casted (if that's a word). Overall I'm just thoroughly pleased with this film. I don't know how to describe everything else without giving anything away, but all I can say is this should be a must watch for everyone this year. It'll be on AppleTV+ later this year I believe so check it out if you can."}, {"id": 52, "text": "If you enjoy reading my Spoiler-Free reviews, please follow my blog :)I've always been a tremendous fan of animation. If there's one comment I deeply despise is the animated films are for children. This preconceived notion is extremely dated, and honestly, quite childish. I don't even think it works within a teenage banter anymore since anime keeps growing exponentially around the world, and animated movies are reaching more and more people as time goes by. The whole you watch cartoons, you're a baby bullying statement to make friends laugh about someone is now decades-old. However, I still feel a bit of pity for people who believe animation can't have the same emotional impact than live-action, especially when a major studio like Pixar is known for making the most grown-up of adults cry like an infant.In addition to this, some viewers think that the latter studio owned by Disney is the only company making decent animated flicks when they've been losing ground to other unbelievably talented people. One of my favorite animated films of all-time is Kubo and the Two Strings, a stop-motion animation work from Laika, the studio that also created Missing Link and Coraline. Cartoon Saloon is emerging as an awards-contender studio, by releasing movies such as Song of the Sea, The Breadwinner, and now Wolfwalkers. The main difference between this last company and the others is the style of animation: the old 2D animation that 90s kids like me grew up with.That's precisely where I'm starting this review. Wolfwalkers' 2D animation proves once again that this style will never become dated or less than the current 3D design. Don't be mistaken, I love both styles! I'm not part of the whole 2D vs 3D discourse simply because I firmly believe both have their own benefits and limitations. 2D animation brings a sense of uniqueness and artistry to any story due to the distinct drawing from many skilled artists, but it's more limited than 3D when it comes to creating an immersive atmosphere and its respective world. However, the latter is becoming stagnated in its design structure since almost every 3D animated flick visually feels and looks the same.So, there's no good or bad, right or wrong, better or worse when it comes to animation. I can offer dozens of examples of exceptional, gorgeous-looking, utterly superb animated flicks from both styles, as well as awful, corporate-like films that I try my hardest to forget (looking at you, The Emoji Movie). Fortunately, Wolfwalkers belongs to the first group. Tomm Moore and Ross Stewart direct an emotionally heartwarming tale with seamless execution of every single aspect. Will Collins' screenplay isn't particularly new or innovative though. It follows a somewhat generic, predictable story with key plot points that any viewer with minimum viewing experience will see coming from miles away.However, it's a formula that, if executed properly, still delivers a rich, passionate, captivating narrative, which will always please both children and adults. Just from the premise, it's pretty clear that the message of the movie is inspired by cliches such as don't judge people by their cover or our wants can steal someone else's needs, and it even approaches racial discrimination since the film deals with two different populations. Obviously, having in mind one of these societies is a pack of wolves, there's also a message towards deforestation and excessive animal hunting, leading thousands of species to their eventual extinction. All of these themes are handled brilliantly, and it never feels preachy.It doesn't matter how unsurprising the story ends up being when I feel as absorbed by the characters and the animation as I did. Honor Kneafsey and Eva Whittaker, as Robyn Goodfellowe and Mebh Óg MacTíre respectively, display phenomenal voice work, which is then elevated by the stunning, expressive, award-worthy animation. Sean Bean is also terrific as Bill Goodfellowe, Robyn's father, who basically possesses the character arc that goes through the significant change of acknowledging, understanding, and accepting an entirely different culture and its people (in this case, animals). Every character is incredibly well-written as are all dialogues, surrounded by a Celtic-inspired atmosphere, myths, and obviously, music.Bruno Coulais and folk group Kíla developed the movie's original score, and it's undoubtedly one of my favorite soundtracks of 2020, including one of my favorite original songs (Running with the Wolves) in one of my favorite musical sequences of the year. Favorite is definitely the right one-word description of how I feel about Wolfwalkers. It's one of those films I can't really point out a single flaw. Massive praise to the drawing artists who designed such a fantastic 2D world. Their work is often unappreciated and underrated (besides being underpaid), so I want to offer Cartoon Saloon my biggest thank you, and keep making excellent cinema.I have no doubts: Wolfwalkers is, by far and so far, the best animated feature-film I've seen all year. I know the big gun from Pixar is coming up (Soul), but it will have to be an absolutely perfect movie to surpass Tomm Moore and Ross Stewart's beautifully heartwarming Celtic-inspired tale. Cartoon Saloon continues to prove that 2D animation is still capable of delivering emotionally compelling stories through gorgeous-looking, unique, artistic drawings. Despite Will Collins's generic narrative and cliche messages, every single detail is executed perfectly, without a single flaw to point out. Outstanding voice work from Honor Kneafsey and Eva Whittaker as the well-written, captivating protagonists. However, it's Bruno Coulais and Kíla's original score that melts my heart and sends chills down my spine every time I listen to it. One of my favorite films of the year, I'd be extremely surprised with myself if it doesn't end on my Top10. Watch it with your family. It's worth it.Rating: A"}, {"id": 53, "text": "Finally! After 7 long months, I got to see a film in an actual movie theater and I could not have picked a better film than Wolfwalkers. Seriously, I don't know where to begin. The only thing I will say though is that this no doubt the greatest animated film of 2020! When you get the chance to watch this on Apple TV+, look and process every shot that is shown in it. The reason why is because every shot that was shown was like artwork in a museum. The design/backgrounds of the old town of Kilkenny, Ireland were very structured. All of the motions flowed very smoothly throughout. My favorite shots in the film overall, have got to be wolf POV shots. The way how the staff animated the wolves' senses to help explain the audience of what makes a wolf a special creature, makes the watching experience a lot more interesting. Speaking of wolves, I love for everything related to them in this film! Their designs, emotions, the harmonic howls! You name it, I live for it! AWOOOOOOO! Ok, I'll stop being my furry-self, lol! So to wrap things off, I love almost everything about this film. The voice acting, story, characters, theming, music (OMG I'm definitely buying that song on iTunes), editing/pacing, and finally the animation. The only thing that I would say the film needed more of was character interaction between Robyn and Mebh before the big conflict. Overall, I'm definitely running with the wolves tonight because this movie was a pure work of art! 9.5/10"}, {"id": 54, "text": "IN A NUTSHELL: If you love all-things-Irish, Renaissance festivals, as well as Studio Ghibli, this Apple Original film looks and feels like a lovely combination of all of those things. Add the voice of Sean Bean. Yes, please! This magical animation is from the Academy Award-nominated makers of The Secret of Kells AND Song of the Sea and based on Irish folklore. It was directed by Tomm Moore and Ross Stewart, becoming the first animated feature to be nominated for Best International Feature at the Gotham Awards. The film is dedicated to Mark Stewart, who passed away this year. Cartoon Saloon continues to pump out beautiful animation films that are pretty close to visual masterpieces.TIPS FOR PARENTS: This is a perfect family-friendly film that all ages can enjoy. Wolves attack people. People attack wolves. You might need to talk to young children about magic and imagination.THEMES: Friendship Courage Tolerance Humans vs. nature Family Female empowerment The creators of the film explained that colonialism was the real villain in the story in that it separated protagonists from nature.THINGS I LIKED: The concept art is absolutely beautiful and mesmerizing. It's refreshing to see two-dimensional and under-appreciated hand-drawn animation. The colors and geometric shapes are extremely enchanting, making each frame a piece of art to be studied. One of my sons is a 3D animation artist at Blizzard and he has taught me to really appreciate the mastery of hand-drawn animation. You really get a sense of Ireland in the 1600s You can almost feel how damp the green forest is in animation. Visually, the movie also illustrates the cage women of that day might have felt they were in. There are lots of angles and big black lines that represent society's rules that trapped Robyn, the young heroin in the story. Honor Kneafsey voices the enthusiastic Robyn Goodfellowe and does a fantastic job.Eva Whittaker lends her spunky voice to Mdbh Og MacTire. The humor is both visual and spoken. The British and Irish accents of the characters are super cute. If you love the artistry in this film, you might also want to check out: The story features the stark contrast between the magic of nature and that of the Lord Protector's rigid religious fervor. The film's creators explained that the type of Puritan religion that Lord Cromwell brought to Christianity emphasized man over nature, instead of a balance between the two: domination vs. submission. Whenever the story spotlights what's happening in the forest, the colors are light and green; to show the duality of thinking at the time, the city scenes feature grey tones in the color palette. Clever framing devices. The film knows when to be silent to let the audience bask in the beauty. I loved the scene that shows Mebh Og practically melting on Robyn's lap while she gets her hair brushed by her new human friend. So sweet.THINGS I DIDN'T LIKE: The father shows warmth to his daughter but he never listens to her. I hate it when religious people in movies are shown as truly terrible people.INTERESTING LINES: Work is prayer, girl. - Head Housekeeper (Nora Twomey) I prayed the whole Bible. - Robyn Goodfellowe (Honor Kneafsey) We must do what we're told. - Bill (Sean Bean) Why? - Robyn (Honor Kneafsey) I'm afraid. - Bill (Sean Bean)You can see the rest of my review on my Movie Review Mom YouTube channel and website."}, {"id": 55, "text": "Wolfwalkers is the newest film to the astonishingly creative team of Cartoon Saloon, and they have surely reminisced my love for the style of hand drawn animation storytelling with this film.We are introduced to the main character Robyn, a girl who wishes to be just like her father Bill as a hunter, but her father fears for her safety and prefers she remains a normal status as a scullery maid. However, wanting to help her father with hunting down wolves that have been disturbing the peace of the town, Robyn decides to follow him into the woods, only to discover the entirety of the wolf pack and discover a little girl among them known as Mebh.The two befriend, and Mebh reveals to Robyn her identity as a Wolfwalker, a mystical being who has the ability to transform their soul into a wolf while their body stays behind asleep. Along the way Mebh accidentally bites Robyn which inevitably turns her into a wolfwalker herself, and all the while the townsfolk and lord protector Oliver begin to grow hastier by the day with the presence of the wolf pack close to their village.First off, the animation all throughout this movie was spectacular. I loved how the different colors, lining, and textures all symbolize the themes and emotions this movie makes you feel scene by scene. It also delves greatly into the idea of see what I see at times by showing us amazingly drawn first perspectives of what a wolf can see, hear, and even feel. There are even moments of supernatural elements being present that I thought had a great combination with its surroundings when released such as the levitated vines to lead the way, or the stone carvings show us an entire story in itself.Robyn and Mebh were so much fun to watch together, and even after just a couple days of them interacting with one another, you could already see a strong friendship vibe between the two. The chemistry between them also made the story very unique, as you've got Robyn a townie and a hunter, and Mebh the feral wolfwalker who takes Robyn on a journey of self-discovery within the vast world of nature.I also found Moll and Bill's roles in this story to be an interesting mix of complication, because both of them believe what they're doing is right for their daughters, but when really their lack of freedom allowance for their children is only causing them to rebel further. A character like Bill is a great example of this because he may think he knows what he's doing is for the betterment of his work and Robyn, but his flaw is the continuous refusal to understand the other side's beliefs and predicaments. As for Oliver, his belief in keeping order and the safety of the citizens for the town is understandable, but what makes him a great villain for this movie is his representation of the belief that nature mustn't co-exist with civilization.The music choices of smooth tones and wicked showdowns also brought a great atmosphere to the world since when you see Mebh and Robyn running around together as wolves, the joyful and strong music brought within these scenes allowed me to believe in things like Robyn and her acceptance to becoming a wolfwalker. You could even say each character had their own style of music every time they were shown, especially for Oliver due to his strong presence of dominance which brought a rough and low tone to better represent his status and what the viewer should think of him.Overall this was an amazing otherworldly tale of friendship, acceptance, change, and fighting your beliefs for what is right. I would certainly recommend this movie to anyone who loves to see a good sense of another being's view of the world, as well as anyone who loves a good and mesmerizing fashion of hand drawn storytelling at its finest."}, {"id": 56, "text": "Title says it all. Doesn't deserve an 8, the characters are supposed to be charming but they come off as annoying, the plot is cliche in lots of places. Despite this, the backgrounds are nice, and so is the music - though unfortunately the plot lacks a little, and sometimes the character designs don't work with the backgrounds in some places. So, the good parts? Designs were creative for the wolves, the villain was well designed, the music was great and the opening was gripping. The ending, though cliche, is satisfying and opens up many possibilities. The bad parts? Like I said, plot is quite an issue as I could see the ending miles away. After the amazing opening, the pace and story lacks for a good portion of the movie, losing the magic it held at the beginning in favour of some annoying characters chasing each other. Whilst we are on the subject, the characters. The characters, or one in particular, are a major set back from making this movie from good to great. Mebh was the root of this I think. Her enthusiastic attitude gets old real fast, already having been used to death before. Whereas the opening portrayed her as being silent, she's very sassy and loud mouthed - I would've much preferred a silent Mebh, as this adds an element of mystery and fantasy. It just ruined it for me. The other characters are okay, Robin's dad was the most likeable, Robin not so much but I could see why they chose that. The villain was good, keeping a mysterious, intimidating feel keeping me engaged with scenes he was in. Overall, a mediocre movie that has lots of potential and sometimes reaches that potential, but often it is sadly too little too late. The Breadwinner and Song of the Sea were far better. However, if you like fantasy revolving around animals, and are a fan of animation, it's worth the watch. I am a fan of animation and was in awe at lots of the backgrounds and long shots. Like I said, by far the best part of the movie. So yeah. Mediocre. At time of writing it stands at 8.3, which I think is far too high (but only 257 have reviewed)"}, {"id": 57, "text": "Robyn, Mebh, Bill, Moll, and the wolves travel away west as a pack, I hope it going to more wild adventures. I hope they will announced Wolfwalkers sequel into franchise for the future for generations. I hope there going to have four planned of sequels, between Wolfwalkers 2, Wolfwalkers 3, Wolfwalkers 4, and Wolfwalkers 5 is the final for Robyn and Mebh.They will have a 22 minute TV Series film Wolfwalkers the Series on Disney Channels and AppleTV+They will have 22 minute Wolfwalkers television specialsThe first was a Halloween-themed special titled Wolfwalkers Halloween Special.The second was a Christmas-themed special titled Wolfwalkers Christmas Holiday Special"}, {"id": 58, "text": "Wolfwalkers is a stunningly beautiful animation. With its striking art style and touching story, it's also a wonderfully good movie. The fact that I hesitated to watch it honestly makes me a little upset. It positively surprised me in pretty much every way possible.Films made in the style of Wolfwalkers are mostly unknown to me. When I first saw screenshots of the film, the art style did turn me off a little bit. And although I heard nothing but good things about it, I still felt unsure about how much I would like the way the film looks. Alas, I had no reason to worry. While it did take me a moment to get used to it and stop thinking about it, as soon as I fell into the story, I started to appreciate the striking style. And while it's striking, it's also tremendously beautiful. Especially the scenes in the forest, where a big part of the movie takes place, are simply stunning.The story, which introduces us to Robyn, a girl who dreams of becoming a wolfhunter, like his dad, is full of moments of conflict and beauty. Robyn, who ends up being bitten by a wolf, soon learns that some fairytales might be more real than others. And when she finds new friends, the dream of being a hunter quickly fades away, as she must defend them from a life-threatening threat. While the story might not be filled with twists and turns and is for the most part easily predictable, it's also beautiful and emotional. Indeed, it's the kind of story that works better when it can be predicted. Being able to focus on what the movie had to say, and how it said it, was much more impactful than worrying about what was going to happen next. It's also a surprisingly deep story, with nearly all characters facing dilemmas and having to fight against preconceived ideas.In many ways, I think that Wolfwalkers has been the most surprising film of 2020, at least for me. Going in, I had no idea what to expect, and in all honesty, my own preconceived ideas might've caused me to doubt its greatness. To say that I was positively surprised, would be an enormous understatement. The film captured my attention with its stunning visuals and kept it with a beautiful and heartfelt story. Wolfwalkers is, without a doubt, the best animated film of the year."}, {"id": 59, "text": "The biggest surprise of 2020 for me. I was privileged to watch this before it's released to the general public at the Savannah Film Festival. There's a lot here to appreciate. The animation is one of them. It's simplistic but it still looks incredible. Every character, every building, every tree is different and unique from the next and the way they frame these shots is great. The animation style makes these environments look rich and beautiful. The performances are great too. Each cast meme we did a great job portraying their characters especially Sean Bean and these portrayals made the emotional beats hit much harder and this is all due to the great character development and writing. Every main character has a purpose and an arc they go through like the father realizing that just because something may look dangerous on the outside doesn't mean they are dangerous on the inside. The story here is simplistic and that's what I think holds this film from a 9/10 or a 10/10. Elements of the story feel a little basic but that's okay because it's not geared towards adults. This was an incredible animated movie and I'm thankful that I got to check it out early. Please watch this when it comes out later this month. It's probably the best animated film of the year and I don't see anything else topping it."}, {"id": 60, "text": "A beautiful Irish fairytale.There's blood on your lies Disguise opened wide There is nowhere for you to hide The hunter's moon is shining I'm running with the wolves tonight (Aurora / Running with the Wolves)'Wolfwalkers' is yet another deliciously intoxicating cine-potion brewed by the wise druid of contemporary animation Tomm Moore. Every frame of his third feature has so much love and soul poured into it, that it is impossible not to admire the hyper-stylized character &amp; background designs, absolutely brilliant use of colors and that 'medieval illustration meet a picture book' disregard for perspective that evokes the sense of childlike wonder within the viewer. Moore creates as if performing a pagan ritual that is supposed to awaken ancient spirits who will guide you into a magical and mysterious world you never knew existed...Cartoon Saloon's best film, on basically every level. The most beautiful, the most character-focused animation, the most narratively and dramatically compelling, the most interested in exploring the disastrous and monstrous history of English colonialism. I have liked every Cartoon Saloon film so far, but this is just next level."}, {"id": 61, "text": "With an engaging core story (based on the aftermath of the Irish civil war), characters worth rooting for, and brilliant visuals, Wolfwalkers proves to be one of the most satisfying (animated) film experiences of the year. If you thought only Disney, Pixar, Laika, or Studio Ghibli could set such high standards for animated films, Cartoon Saloon is here to solidify its presence with a fascinating fourth entry. The story is narrated in the simplest way possible, supplemented by stunning hand-drawn imagery and compelling voice-overs. A young Irish girl (voiced by Honor Kneafsey) befriends a WolfWalker, eventually turns into one, and then sides with the wolfpack in an attempt to save them from a colonial overlord and his henchmen. From a storyline standpoint, that's more than sufficient. But Wolfwalkers is SO MUCH MORE!Sean Bean voices the little girl's father, torn between wanting a good life for his daughter and following the orders of the Lord Protector, the villainous Oliver Cromwell (Simon McBurney, effective). At times, the plot gets a bit formulaic, but Wolfwalkers manages to evoke genuinely strong emotions out of its viewers. Even if the plot doesn't move you entirely, the visuals certainly will. The way the town and the forest have been envisioned, stylized, and designed is nothing short of outstanding (the 'wolf-vision' bits are magical!). The perfection here lies in its broad brushstrokes and woodcuts, something that pure CGI often lacks.Directed by Cartoon Saloon co-founder Tomm More (who previously received Oscar nods for The Secret of Kells and Song of The Sea) with ample support from art director Ross Stewart, Wolfwalkers brings back the old-school feels of flipping pages in a timeless fable. It's for kids, it's for adults, it's for EVERYONE! Thematically, Wolfwalkers tackles the subjects of opposition-free authority, friendship, family, and to a large extent, ecology. Where it stands out lies in the fact that it does so, in a beautifully profound fashion."}, {"id": 62, "text": "The latest from Cartoon Saloon (The Secret of Kells, The Breadwinner, et al), Wolfwalkers is such a magical surprise and so completely in its own world that you surely won't mind its occasional Disney-Pixar similarities - even if the things that come to mind involve bits of folklore and myth that predate both Disney's films and the fairy tales they were based on. Nevertheless, it is the animation you deserve in the month that gave us Bobbleheads.Wolfwalkers is a hand-drawn Irish film, with story and mythology that may recall Pixar's Brave (which did a far worse job at being its own thing), and animation that occasionally looks flat and almost unfinished. However, this is not a bad thing.The movie looks like Fantasy sketches, old watercolor paintings, and sometimes even petroglyphs brought to life; the obviously penciled lines and still-visible sketching circles simply function as a flex (on top of ultimately creating a unique yet aptly old-fashioned art style), reminding us of the painstaking process and imagination behind the film. These details are akin to the thumbprints we sometimes see on claymation characters. The thematic shifts in color, lighting, framing, and squiggliness also help it stand out.Additional magic is supplied on the soundtrack; Irish singer Kíla gives Bruno Couilas' score that extra Gaelic touch, and there is also an original tune by Aurora, the Nordic singer whose angelic vocals appeared in Frozen 2. There's even a tinge of A Song of Ice and Fire, but this one makes a warg-like connection to nature seem decidedly more pleasant.We join Robyn (Honor Kneafsey), an English girl in an Irish village, yearning for a more exciting life. Her father Goodfellowe (Sean Bean) helps defend the village from wolves, said by some farmers to be under the spell of wolfwalkers - wild humans who can unleash their spirit animals if need be. The ruthless Lord Protector (Simon McBurney) dismisses the idea as Pagan superstition, but free-spirited Robyn encounters Mebh Óg MacTíre (Eva Whittaker), a feral but quick-witted wolfwalker who gives Princess Merida's hair a run for its money.The friendship between the two children is the heart of the film; Robyn finally finds belonging, eventually learning to see with all her senses the way wolfwalkers do, and Mebh gradually warms up to townies. The voice acting is remarkably good, proving that child performers can, in the right circumstances, be some of the best actors we have. The imaginations of children can go a long way, and many would jump at the idea of getting to communicate with the beasts of the Celtic wild, or pretend that they do. Sure enough, these actors seem to be having a blast.What makes Wolfwalkers extra important, especially if the COVID situation allows it to technically be one of the most popular animated movies of the year, is that it proves it isn't over for 2D animation. With major releases on hold (unless even more studios start to realize the perks of streaming), more and more viewers will be forced to look in new, less obvious places, to possibly find films that they love in ways they didn't know films could be loved. Cartoon Saloon might just be the place.And indeed, much like last year's Klaus, this one feels very much like a journey back to the sort of films Disney would no longer agree to make (a reminder that becomes outright depressing when you learn that Kirk Wise worked on the aforementioned Bobbleheads film). It doesn't visually resemble any Disney movie - or any other animated film that I can recall - in the way that Klaus looked like something from the era of Treasure Planet and The Emperor's New Groove, but it carries a certain magic we could all use."}, {"id": 63, "text": "Acclaimed Irish studio Cartoon Saloon has been one of the most revolutionary animation houses across the globe. Not only have their films grown in critical and audience favorability, but the artistic achievements they've utilized through Irish folklore and complex fantasy tales (besides The Breadwinner) are worthy of rivaling the competition. So it's no surprise that their most recent effort Wolfwalkers, directed by studio co-founder Tom Moore and Secret of Kells art director Ross Stewart, has been getting rave responses since its promotion on Apple TV. And having finally seen it, I can safely say that the praise is thoroughly deserved.Set in mid 17th century Ireland, a young girl named Robyn Goodfellowe lives in the secluded town of Kilkenney with her father, who hunts the town's enemy of wolves. Upon confronting a mysterious creature in the wolfpack named Mebh, Robyn sets out to protect the pack from the antagonistic general, Oliver Cromwell. From a premise like that, one would expect somewhat of an environmental themed flick, but Wolfwalkers has so much more to offer than just its message of preserving nature instead of harming it for one's own development. As the film is a character driven piece dissecting the mythos of wolfwalkers, who are mainly fantasy-esque versions of people in the nighttime who have been bitten by wolves, the strongest element of the film is the obstacle Robyn faces in trying to save Mebh and the wolfpack despite the severely strict orders Cromwell elicates on the Kilkenney natives, let alone her father. In many ways, the film shows the positive and negative aspects about trying to protect one species yet also having to preserve your original human form.Beyond the complex storyline, the tone of the movie is a good balance of light hearted childlike whimsy and foreboding dark stakes. The scenes showcasing Robyn around the townspeople, among Mebh and her wolf pack, are appropriately charming and fun to watch, as if we're experiencing what it was once like to be as wild and free as a child. But then, whenever there are serious consequences Robyn has to face from Cromwell or her father, the film can go from mildly heartbreaking to intensely devastating. Any guessing of what could happen to Robyn, Mebh or even her father is completely unpredictable, and the film always knows how to keep the suspense rising so that the audience can feel up to the edge of their seats. If there's only one slight criticism to give the film, and even then it's more of a question than a complaint, it's that the ending is concise but also a little too short. While it does wrap the film up very well, it might have been a little more satisfying to see a slightly longer conclusion to the Goodfellowe's epic tale. But then again, less is more, so all's well that ends well.Out of all the films Cartoon Saloon has produced, this one might be their most stylized and technologically advanced one to date. In addition to the characters having ancient Galic designs to make them look more visually distinctive from real humans, their movements are precisely smooth and crisp while still keeping their general acting as clear as possible. Beyond that, the backgrounds are gorgeously detailed with so much emphasis on the cultural reference in old Irish tales, and the effects work is breathtaking, especially when it comes to the wolf running sequences. It's even great when the film uses its minimal yet strong color palettes and layouts to let a specific shot speak for itself. Also, not only does the voice acting feel so real and authentic to both the time period and the character's emotions, but the music score by Bruno Coulais and Kila adds in to the quaint albeit dynamic atmosphere of the feature. You almost never get the same type of cultural and artistic experience out of movies like this, so it's amazing when filmmakers allow audiences to indulge in their worlds as much as they can.So in short, Wolfwalkers is an elegant fairy tale of a feature with many complex philosophies, engaging characters, breathtaking visuals and music and stellar acting to go along with it. If you're yet to check out this marvelous gem of a film, by all means do so whenever you can. In a day and age where streaming services are slowly but surely releasing unique content that you don't get from the mainstream anymore, films like I Lost my Body, If Anything Happens I Love You and Wolfwalkers are prime examples as how the art of animated filmmaking are just as strong as it's always been, if not more."}, {"id": 64, "text": "On the plus side: It's much better than previous Saloon films. Visually it still opts for the distinct illustrative style they are known for, but the pacing and storytelling is more dynamic this time around. It's faster, punchier, more aggressive than Song of the Sea and the animation in the wolf running sequences is spell-binding. The emotional moments resonate well without feeling too mawkish and the invigorating score by Kila is a joy. There are problems though.The plot of the hero befriending the noble savage and teaming up to defeat invading forces has certainly been visited many times before (Dances With Wolves, Ferngully, Pocahontas, Princess Mononoke, Avatar) and Wolfwalkers doesn't really do anything new with it. The heroine, Robyn, daughter of a British trap hunter tasked with wiping out wolves from a surrounding forest in Kilkenny, wants desperately to escape the shackles of domestic life. While exploring the forest, she runs into Mebh, a wild untamed wolfwalker who can magically commune with wolves, and discovers the freedom, magic and beauty therein. Robyn must try to convince her father to disobey his orders and save Mebh and the forest from destruction. From that synopsis alone, it's easy to imagine how those story arcs play out, if you've seen the other films I mentioned. At times sequences look and feel like they've been lifted directly from these sources and dropped into a different art style. Cliché messages about embracing the animal within abound.Characters are depicted as one-dimensional stereotypes, particularly the invading Brits and the main villain, Lord Protector, a bland copy of Disney's Governor Ratcliff and Judge Frollo, who tries to tame this pagan-Celtic world one bible quote at a time. Princess Mononoke managed to be more ambiguous as to where the good and bad lies across the opposing factions, which made for a more engaging film, in my view. Wolfwalkers, however, seems to be aimed at a much younger audience and is thus played very straight. The Irish peasants are all represented as feeble-minded bog-dwellers, which I found surprising coming from an Irish studio. It seemed like they wanted to play up the Paddywhackery for laughs, but I found all the ahh to be sure gags more eye-roll worthy than funny, if I'm honest.Another nitpicky issue for me was the voice acting. It was disappointingly flat and amateurish in a few places and lacked real drama. I'm not sure if all the actors were recorded together or separately, but their voices sometimes didn't sound like they were in the moment or really reacting to one another.Gripes aside, this was an entertaining watch and easily the best animated feature to come out of Ireland in a long time."}, {"id": 65, "text": "The last movie on Apple TV that I hadn't seen (at the time of writing) was Wolfwalkers that arrived on the app with a bit of a splash at the end of 2020. It's a terrific animated movie, produced in Ireland, with great story telling and an interesting visual style.Robin (Honor Kneafsey) and her father Bill (Sean Bean) have arrived in Kilkenny in 1650. Bill is a hunter and has been charged by the Lord Protector, Oliver Cromwell (Simon McBurney) with killing the Wolves in the surrounding woods that are being felled for expansion of the town. Robin is eager to help, but a series of circumstances lead to her being alone in the woods, where she meets Mebh (Eva Whittaker) a girl of similar age who can transform into a wolf and who leads the pack.It really is a wonderful film to look at. The animation style is at times brilliantly abstract whilst astonishingly detailed at others. The sharp lines of the characters stand out nicely against watercolour-esque backgrounds - it is truly beautiful. It's a decent story too. It's definitely a children's film, the plot is pretty basic and there are clear lines between good and evil of the film even as peoples motivations turn, but it's sincerely a children's film, there are no winking nods or visual gags to try and placate a family that might be seeing the film together. It's a very earnest story, and it's not difficult to draw parallels between the townsfolk expanding into the forest and the English army's occupation of Ireland.Vocal performances are really good too. The two young girls are excellent. Sean Bean puts quite a lot into his performance (admittedly stoic man from South Yorkshire ought to come rather easily by now). The world building foley work and the score are excellent too. If you want any criticism, maybe it might have been made clearer that the fate of Oliver Cromwell isn't entirely accurate, but that really is nitpicking.Even if we hadn't had the year in film that 2020 was Wolfwalkers has to be the front runner for the animated film Oscar."}, {"id": 66, "text": "From the Irish animation studio that brought you The Secret of Kells, Song of the Sea &amp; The Breadwinner comes another rich, textured &amp; geometrically enchanting masterwork of blazing originality, spellbinding animation &amp; heartfelt storytelling that dazzles &amp; delights in equal measure to finish as my favourite film of the year so far, and undeniably the most gorgeous.Directed by Tomm Moore &amp; Ross Stewart, the story howls &amp; harkens back to the medieval era for its tale that takes a leaflet out of Irish culture &amp; is firmly rooted in Celtic myth. The sumptuous care in its construction &amp; an ethereal simplicity in its narration is further elevated by its awe-inspiring narration &amp; expertly scripted characters, thus allowing the picture to deliver the goods on all fronts.The animation is breathtaking to say the least, employing the studio's patented ornamental designs, symmetrical sketches &amp; childlike imperfections which help evoke the desired warmth, wonder, intimacy &amp; innocence in each n every frame. Camerawork &amp; lighting is first-rate, Editing allows the plot to flow like a breeze, and the elegant &amp; resonant music casts its own spell that makes the experience even more alluring &amp; fulfilling.Overall, Wolfwalkers effortlessly blends history, folklore &amp; contemporary themes into a visually striking &amp; emotionally stirring fable that wondrously demonstrates our depleting relationship with nature and our ability to help restore the same, in addition to serving as an arresting coming-of-age story. A magical &amp; mesmerising fantasy-adventure for viewers of all ages, Cartoon Saloon's latest is their best film to date and one of the finest films of the year. Don't miss it."}], "reviews_amount": 67}