{"name": "Life in a Year", "titleId": "tt06598238", "reviews": [{"id": 0, "text": "IMDB uses a weighted average now after heavy industry fake reviews almost crippled it's ratings system. If you check the ratings about half give this 10 stars and the rest is spread out with a bit more 1's, so the score becomes a 5. It makes it obvious that this movie is heavily propped up by fake ratings/reviews and hopefully people catch on soon. Just check the accounts of a random user to see their history, most will be 1 month accounts with 1 review.In any case, this movie is just another vanity project by Will and Jada to help their mizunderstood son. Not much to see here that you won't find out in the trailer, other than Jaden is a bad actor."}, {"id": 1, "text": "There's a scene in The Disaster artist, where Judd Apatow tells Tommy Wiseau, played by James Franco, how hard it is to make it. I wish he would remember that the next time, he and other powerful actors and filmmakers use their substantial clout to have their family cast on a show or in a film. It's a shame that two people like Will and Jada Smith, who made It on merit would take away a role from a deserving actor. Shame on them."}, {"id": 2, "text": "I don't seek out romantic movies but wife got to choose. I had no idea what the movie was about so the cancer reveal got my attention and didn't let go. I knew where the movie was probably heading and there were some little twists along the way. Reading most of the negative comments on here I see a lot of people projecting onto the actors or the Smith/Pinkett family and not actually the merits of the film. It was a good watch with a diverse set of characters mirror the real world - not just some WASP pocket of America."}, {"id": 3, "text": "I've never felt compelled to write a review until I read some of the bad reviews for this movie. This was a well-written and very well-acted film. Yes, there's a teen romance (which shouldn't have surprised anyone who watched the trailer first); but I found it to be a whole lot more than that. I'm 49, and I connected with it instantly. Jaden Smith is so good in this performance that you feel what his character is feeling - best kind of movie. Highly recommend."}, {"id": 4, "text": "I actually enjoyed it. I don't understand all this hate."}, {"id": 5, "text": "The real title to this movie should be,  Not another teen, romantic movie."}, {"id": 6, "text": "I'm amazed at how much hate this movie is getting and it's not because of the film but based on who produced it, which quite frankly is unnecessary. Anyways I watched this movie with my daughter and enjoyed it a lot, we laughed we cried and smiled. The storyline was amazing and the acting was on point. Please give it a chance and judge it for yourself."}, {"id": 7, "text": "Life in a Year is predictable in a way, like most of these movies , but it tried to put its own spin on this story.Jaden Smith is growing on me. You can tell he's talented and will keep growing as a performer. Cara is great like normal.So don't listen to the overly negative reviews on here. That's just 2020 internet troll stuff. Most of these clowns on here just need something to do so they b-tch about everything. If you hate a certain type of movie, don't watch it. That's easier than watching it and then complaining about it. Me? I hate musicals. So I don't watch them and then blame the cast for me hating it. Get a life people."}, {"id": 8, "text": "One of the best movies I ever watched. Seriously. I don't understand why this has such bad ratings. 20 minutes in the movie I cried twice already."}, {"id": 9, "text": "Well although the story of this movie is so repetitive it's still good and touching but the movie fails to portray it well. It's so cheesy, cliched and predictable with many silly and childish scenes. It's full of stupid and annoyingly exaggerated moments as well. The chemistry between Cara and Jaden is bad and Jaden's acting in some scenes is awful. The good thing about this film is Cara Delevingne's acting and character, and the movie has a few emotional moments. Life in a Year is a bad movie with a heartbreaking story."}, {"id": 10, "text": "Although not a new plot idea, I liked it. It was heart warming, funny and it got my emotions going - that's what I'm looking for in a movie."}, {"id": 11, "text": "This was a decent romantic young people movie. I've seen both better and worse. People just hate Jaden for the most ridiculous reasons. It debuted on Prime it's not like you had to buy a ticket. Jaden is okay in his scenes. However, he brings heavy emotion quite well. I wouldn't have bought a ticket for this but I'm okay with it being in the Prime library. The more experienced actors did very well. I do respect the acceptance without making it preachy. If you watch it you'll know. Overall, it's a decent romance movie. Watch appreciate life a bit, respect folks fighting for their lives and folks whose lives were ended too soon."}, {"id": 12, "text": "Cara was the reason why I even bothered to look into this film. The initial premise sounded a lot like Me and Earl and the Dying Girl (2015) - but it was a new take on it. A young couple from different sides of the track get to know each other and make it work; against parents, against odds and also against their own initial doubt.The two develop enough chemistry to come across as a believable, albeit unlikely, couple. The lead actors are fine, the supporting actors were not my favorite. The plot itself plays itself out around half-time and then fizzles out from there.Was it a worthy watch? Since I had nothing else to do on Black Friday, yes. Would I waste valuable time for it instead of doing something else - No."}, {"id": 13, "text": "Stop making stupid people famous. Jaden Smith is nothing but a last name. And to think, you have serious actors working in this. Jeezus. Just don't. And shame on anyone that does."}, {"id": 14, "text": "..If acting wasn't so bad! The story fails to capture you, it tries too hard and the scenes become fake, distant, disconnected. And again, very poor acting!"}, {"id": 15, "text": "Of all the movies with a terminally ill couple, this is by far the worst one I've seen. The acting is bad the dialogue is cringe and it hurt to watch."}, {"id": 16, "text": "They do what society tell them to do . A brunch of boosts actor with no skills."}, {"id": 17, "text": "If you would like it to, the makers of this drama semi comedy romantic teenage flick do have forgotten that, and you feel oversprayed by a wishing well list thats is vast like a glossarybook and the the fulfillment are neither satisfying and very seperfiscial. its not a good fadeaway story, compared to others made in the past few years. if youd like to cry to this, then its because youre having a bad day.the plot runs faster than the a-train, the acting have no sense of real life, and the humour really misses the target cause its all a bunch of copycatting.no originality in other word.so have a look at ''then came you'' instead for a good crying out loud is the message from the grumpy old man."}, {"id": 18, "text": "Not even going to bother with this one. I wish I had done the same for Chemical Hearts."}, {"id": 19, "text": "I didn't go into this movie with high expectations, so I can't really say I'm disappointed. I didn't expect much. After all, it stars Jaden Smith and only because he is Will Smith's son. This movie is just another one of those movies about a sick girl/boy that keeps it a secret until the other person they've tried sooo hard to not get close to confesses their love... just another copycat movie of A Walk To Remember. A Walk to Remember was and is a great movie, which is why there have been so many copycat films since, but they all fail to achieve what A Walk To Remember did - Originality. The chemistry between Cara and Jaden is way off. It's also not very believable that not even chemo could do away with those eyebrows. So what, only the hair on her head reacted to chemo but not her eyebrows? What I also didn't like about this movie is how they demonized people who have a plan/goals and glorified poverty and stealing from gas station mini marts. And what was the transgender's relationship to Cara? They never said, other than that they weren't related. Hollywood has an agenda and doesn't even care to hide it anymore. Movies like this make me sad for actors like Cuba Gooding Jr. Hollywood is no longer producing original and beautiful content like before. Not even the infamous, talented, beloved Cuba could save this film."}, {"id": 20, "text": "I loved the movie and not just bc I love Jaden Smith and Cara, but the movie made me cry and it made me think of people with cancer and how little do they get to live. And made me grateful for the life I have. You should watch this movie and it will remind you how life is short and the only thing that matters is that you find people who will make you happy no matter how much time you have in this world"}, {"id": 21, "text": "Please don't listen to bad reviews. Cara and Jaden did an excellent job I loved this movie!! Made me cry, laugh and I just enjoyed this movie so much. We all know acting is not Jaden nor Cara's main talent. Cara usually doing her modeling and Jaden with his rap but just like in other movies they have done there acting was top notch! There chemistry was undeniable and we all know Cara likes girls lol. Just give this a movie a far chance all I ask."}, {"id": 22, "text": "Pretty good acting from Cara delevigne , and pretty impressive from the son of the Prince of Bell air, solid storyline"}, {"id": 23, "text": "I watched it last night. Its certainly obvious that the young Smith is growing up. He places a smile on many faces with his earnest effort. The performances of the leads are believable but there was very little chemistry between the two. He played a likeable and intelligent character and he pulls it off quite well. Cara also pulled off her role, but the role was just one more smart alec girl who is hard to get to know.And it looks like Jaden is still learning about timing. The other characters were nice, especially his mom."}, {"id": 24, "text": "I liked it!!! Better than what I expected! Different kind of movie for me but it touched me!!"}, {"id": 25, "text": "You can tell this review section is riddled with cynics and just truly sad people. This movie isn't a cinematic Oscar movie but it's emotional, cheerful, and happy. I'm sorry that the reviewers are so sad in life that they must hate movies solely based on the actors ages but this movie was good. It sought out to evoke emotion and it did that."}, {"id": 26, "text": "This is a tear-jerker that features damn good performances from Jaden Smith and Cara Delevigne. Overused tropes and cliches aside I was pleasantly surprised at how much I liked this movie. The first half is kinda silly but hang in there because the second half will break your heart."}, {"id": 27, "text": "It was a good movie...a really good movie.I am not the best film reviewer,it is my first review but this movie made me create an account and write my first ever review.Heard good things about it from my friends and I can agree it is a good movie.It takes you through so many emotions that I can't even explain it.I dont understand the hate this film is getting.Yes,it was sometime predictable and yes,it was a teen romance but you would know it's a teen romance by watching the trailer so I don't think any surprises should've been here.It had an interesting plot with good actors and well made and developed characters.It wasn't a perfect movie but It doesn't deserve to get 1,2 and 3 star ratings."}, {"id": 28, "text": "I have no words to describe how this movie made me feel. Definitely the best thing that happened to me in 2020.... This is a movie I'd recommend to anyone. The cast was amazing, Jaden's performance was better than I anticipated. The movie is just overall good.... 11/10 for me"}, {"id": 29, "text": "This movie was funny, current, relatable, and had great actors. Jaden Smith did an amazing job. Will watch it agan"}, {"id": 30, "text": "I loved it. I laughed, I cried...then I cried some more. It was so well done. Very beautiful."}, {"id": 31, "text": "Not sure what all the hate is about! Yeah it's a story about coming of age teens, struggling with life, learning to be themselves and falling in love. And yes... The storyline has been done before and it's been done better, but who cares! This movie has a lot of important lessons about living your dreams, being your authentic self and not being afraid of what other people think. I found all the characters in this film to have depth and I cared about them and that's what I really like from a movie. I have seen some pretty horrid crap movies in my life and this definitely isn't one of them. Sure, it's no Oscar winner, but it made me feel things and that's all I want from a good film sometimes."}, {"id": 32, "text": "Biracial couple with all odds against them... a great watch and an inspiration to all who question love. Impressive quality in film production with a diverse all-star cast! Grab a tissue box and a loved one for this amazing and genuine love story based on real compassion and life-changing courage we all should learn from."}, {"id": 33, "text": "Cara delegvines performance truly makes this movie, her characters spunky attitude and vibrant wigs are used to cover up the true pain she is going through which is unleashed at the end of the film along with her incredible heart reaching performance. Jaden smith is also rather good in this film and I truly believe his acting has greatly evolved. My face looked like an exploded water balloon by the end of this film, it's unbearably beautiful. Just watch it, if you don't feel anything I would question wether you have a heart."}, {"id": 34, "text": "This is the only movie I have ever cried after watching and this reminds me of my ex and how much I love her and about how we're not together anymore and that I'd do anything to be with her again and that as human beings we should show love and care to the important people in our lives."}, {"id": 35, "text": "Just wanted to say to ignore the bad reviews. The movie was produced a few years ago meaning 1-3 years ago which age fits and scenes/acting fits. Evrerything was done really nice and roles were perfect! We all could have added a few extra things or changed things here if we want to play director here, but that means even the great movies should have changed or added somethings too. This movie was made exceptionally well and there should be no shaming. I applaud the director and cast for the hard work they put into this.Mitja, Congrats man. Honestly a really good movie produced and can't wait to see more from you! Keep on pushing forward and keep producing! Love the diversity in this movie, love the acting and filming. Just dont stop and keep moving forward!"}, {"id": 36, "text": "Like most drama or romantic movies, this is pretty predictable. But it was not a bad movie. I don't understand the bad ratings... to be honest Jaden actually proved he could be normal and act in this movie. You wouldn't even recognize him. Chris D'Elia also had a good character and proved that he could act. I don't personally like Cara, but I could stand her in this movie.People need to relax on hating this just because Jaden is on it and his parents are Executive Producers. It's like hating on every cast and film that Adam Sandlers raleases with Happy Madison. Sometimes people who know each other or are family do projects together, get over it.Long story short, for a drama or chick flick I think this was good. And this is definitely not my favorite genre."}, {"id": 37, "text": "This movie was FANTASTIC. I enjoyed every second of it. Jaden Smith absolutely transforms and excels with Cara Delevingne captivating the audience with such emotion. The pair were so perfect. Amazing story that I'd recommend to any and all for a wholesome heart throb. This one will stay with me a long time."}, {"id": 38, "text": "I enjoyed the movie so much. I laughed and cried while watching. Jaden and cara are great actors and they lived up to the role they were given."}, {"id": 39, "text": "I think the movie not that bad to hate it. It's fun and I enjoy it, and the acting was good."}, {"id": 40, "text": "I don't understand the low rating I am seeing, this movie is clearly worth more, you can't just rate a whole movie low because you don't like the actor and by the way jaden was fantastic in this movie."}, {"id": 41, "text": "Even though you know the end at the beginning... still it will makes you cry. Great acting and pictures. Congratulations to all crew!"}, {"id": 42, "text": "I thought this was a great movie. The characters were well played out. I think both main characters laid the emotional framework needed and felt very believable. I definitely went through the emotions with this one."}, {"id": 43, "text": "Best movie I have ever seen. Any other rating less than a 10, must not understand the power of love and dream and perseverance."}, {"id": 44, "text": "I think it's a pretty fine movie &amp; Jaden turned out to be a great actor! I found him so convincing &amp; natural throughout the entire film, truly touching. Overall it deserves a solid 7 for all the narrative lessons, great acting &amp; thoughtful touches along the way.I guess there will always be people in the world who achieved nothing and only get content by badmouthing those who are better. It's actually sad seeing all those poor hearts here full of hate."}, {"id": 45, "text": "A very well crafted and commitment potrayed all throghout the movie.This movie has given me an open minded mentality to the reality of life and to make life matter while we are still living."}, {"id": 46, "text": "I LOVED it Perhaps even more becuase I had cancer a year ago and I understand how life is different, time is going differently, each moment counts, you don't waste seconds minutes waiting for something. You are suddenly alive and in a hurry to feel alive as long as possible, you notice things, you would. Never notice before and suddenly material world and so called important issues are not important any more All that matters are people around you that you love and that love you, nothing else matters You grow up..... THE MOVIE IS A LOVE STORY CARA IS FENOMENAL Smith finally got a role where he can show, he is not just famous parents kid He is A. Huge talent and I'm looking forward to everything he does next The poetry of light, the humor and great dialogue FINDING love and humor and positive in every moment and don't wasting it Time never comes back One have to live in the moment MITJA Okorn is definately someone who can show warh human heart is Dedinate 10 for me"}, {"id": 47, "text": "I wish there was more from Jaden and Cara. Jaden is one of the best young male leads out there. He can project emotion like no one else. He can speak emotion in his eyes and facial expressions that are so loud. Cara was amazing with the sweet bad girl. She did well as the unbalancedI don't know love  character than I've seen in a long time. The rating on this is for the performances these two brought to the screen. Loved it hope to see more from Jaden."}, {"id": 48, "text": "Pretend that you're watching a good movie, and then you could perhaps enjoy this boring, over-acted, plot hole jumble of a mess that this film sadly turns out to be. Cuba is too much, Nia is just a name, and Jaden is ridiculous. Was truly hoping for better."}, {"id": 49, "text": "Trash movie and trash acting stop making talentless people famous"}, {"id": 50, "text": "Outstanding film. remarkable performance. absolutely a must-watch!"}, {"id": 51, "text": "To Jaden and anyone who worked on this movie that you have created a masterpiece and it really moved me and its a really heartwarming story that shows us how much we have in life and that we should be thankful. I really loved this movie and i wanna congratulated you, this is amazing.Hopefully one day we all find true love and life a full and happy life.Congratulations on everything you will atchiveBest of luck Malek"}, {"id": 52, "text": "Cara delevingne was incredible in this movie and also Jaden Smith"}, {"id": 53, "text": "Movie was good and i would recomend watching it. There was some spots that i would change out but i would say 8/10. I dont admit but i did cry more than 1 time watching this movie. movie was funny and it did get stong feelings out."}, {"id": 54, "text": "This reminds me a lot of crazy/beautiful. It's realistic and well acted. the scene where they were pretending to be British is my fav. Wish their were more scenes like it. I think Jaden and Cara complement each other well."}, {"id": 55, "text": "This movie is definitely a tearjerker. It's a true testament that love is unconditional and a reminder not to take life for granted."}, {"id": 56, "text": "Brilliant Cara and Jaden as well! The movie has energy and gives a deep and dark part of life a message of love and hope! Give it a try and you will say I was right afterwards..."}, {"id": 57, "text": "Mitja made in his home country for a pocket money best ever Slovenian movie, move to Poland, made there a huge success, now he step in big Hollywood shoes. Life in a year. It s real. How much real? Well, how many times did you cry when watchin' it? :) That much."}, {"id": 58, "text": "Yeah the story line was predictable but the emotionL ride that this movie takes you on is something else. Ignore the bad reviews give it a watch and then judge yourself."}, {"id": 59, "text": "I love this movie it made me a bit mad but they are kids so I understand. This movie definitely doesn't deserve hate though"}, {"id": 60, "text": "I get why people didn't like it but i actually really liked it. Maybe i'm a sucker for teen romcoms or it's like almost 5:30am but i thought the acting and the storyline was really well done."}, {"id": 61, "text": "Strong acting, well told story, emotional highs, lows and everything in between. I thoroughly enjoyed this movie and will totally watch again."}, {"id": 62, "text": "I walked into this movie with no expectations really, just a movie I threw on after work because my husband said he was too busy to watch a movie. Needless to say, he ended up watching the whole thing with me. We were both engrossed immediately and the emotions are so raw. Yes it's predictable and has been done before but the acting (Jaden Smith can act) was impressive, you feel the pain. Great movie."}, {"id": 63, "text": "The acting is astrinomical. Its definetly a must watch! I love Jaden and Cara and they both went together really well in the movie. It was defenitely predictable on wat was going to happen at times, and also at some times it was unrealistic from real life. But honestly without that it wouldn't have been as good!"}, {"id": 64, "text": "Amazing movie! Watched it with my wife and tbh we both agreed we had to make an account and rate it. Acting was good on both jaden and cara and the storyline was on point dont really watch movies like this unless I'm with my wife and first time ever rate on here but definitely had to let you guys know worth watching"}, {"id": 65, "text": "It's sad, it's beautiful, and it gives you so many parts. Funny, happy, sad, relatable in a way. Jaden Smith is awesome! Cara Delivgne was amazing."}, {"id": 66, "text": "This movie is a hidden gem apparently, i went in expecting to hate it and was pleasantly surprised!the casting is PERFECT, each character is unique, you love them you hate them you love them again. i was really worried i'd hate Jaden Smith, because he's always come off as an entitled a@@hole irl, but it seems he's growing up. the acting was fantastic, writing too! the base idea of the story is best part, great script, 100% LOVED this movie!!p.s. Chris D'Elia was unforgettably AMAZING! i wish him a speedy return💜"}, {"id": 67, "text": "The movie Live in a Year is simply Outstanding and Beautiful!!! About Loving fully and living fully! The acting was superb. From beginning to the very end it was a full ride of emotions and a rush of hope! This idea of living life to the fullest, of how much the human heart is capable of loving and accomplishing is a breath of fresh air in what has been a dark crazy year! What would life look like if instead of the pain, frustration, fear and trauma experienced this year, we set ourselves on a journey to fully love and to live life to the fullest?"}, {"id": 68, "text": "This movie is so awesome. Jaden Smith and Nia Long as son and mother that's were perfect. I love Jaden and Nia acting in this movie. I also love how they have Jaden use his rap skills in the movie. I love I Got This and Life in a Year by Jaden Smith song from the movie. It's teaching that what you want in your life and not what others.This movie will make you laughing and crying."}, {"id": 69, "text": "I have to say I really liked this movie it made tear up in some parts!"}, {"id": 70, "text": "This film was made for people of all ages to watch, but as the film progresses you can tell the target audience was the troubled teen community. As a 17-year-old myself, it spoke volumes how the film implemented all aspects of the teenage mind. Some kids are forced into living harder lives than most adults. This movie was well produced, well acted, and a real tear-jerker even for someone who refuses to cry from cliche dramatic-romance movies."}, {"id": 71, "text": "Please don't listen to bad reviews. Cara and Jaden did an excellent job I loved this movie!! Made me cry cara u played sooo nice that u make me cry soooo sooo soooo much i loved your act in this move wish u all the best &lt;3"}, {"id": 72, "text": "Just watched it. I was shocked seeing such a low rating at first. Deserves way better in my opinion. I am proud what Okorn did in his career and with this movie. I would disagree with people who say Jaden can't act, he is great. Cara was outstanding in this role and I am happy for her getting this one. I have seen some movies with similar stories but I can tell, this one has its own spirit, there is just something different. Watch it, open your heart, let it touch you!"}, {"id": 73, "text": "Jaden's acting has seriously improved, the plot was fine and smooth, you easily flow with the love... Although wasn't to pleased with how the connection was built between the main characters but it grew beautifully into emotions.Her cancer secret was chipped in beautifully and I wasn't expecting that.Great film great finish... I really wish she didn't have to die but that's just life playing out on us..."}, {"id": 74, "text": "Jaden and cara, come back perfectly on incredible story. And good acting with such a talented people around."}, {"id": 75, "text": "I thought Jaden did a great job in this movie. It seemed effortless, almost like he was playing himself. I did wish his love interest was younger. She seemed much older than him."}, {"id": 76, "text": "Film really showed us, that we need to appreciate the people we're surrounded by. Jaden and Cara both played their part amazingly. Expressing feelings, thoughts on everything, showing social problems... Film made a big majority of people who watched it cry. The film brang us what ot needed to bring, ending wasn't the sweetest, but we knew it was coming from the start. It was perfectly shown and there's nothing bad about it. For me a 10/10."}, {"id": 77, "text": "I liked the movie so much, it wasn't about what will happen at the end, it was about the massages they want you to get which will change your perspective towards certain things in life. For me it was amazing show, well done 👏"}, {"id": 78, "text": "I just watched this movie, and I really liked it. I really dig the story plot, from a high school kid deciding on this future career, to a couple hopelessly in love to get to the tragic inevitable ending, its encapsulated a drastic change in life. It hits a lot of softspots; from teenagers falling in love, to one in denial, and to one in facing a life to its last, all the actors do a good job of portraying the characters. Just give it a watch without the pre-judged eyes.I honestly didn't think there would be that many bad reviews. I really liked it."}, {"id": 79, "text": "This movie was fantastic,captivating and amazing.It was full of emotions and touched many topics.This movie made me cry,laugh,smile and i have to say it's one of my favourite movies now that I have watched it.The actors also convey the emotions so well and this movie will stay with me for a long time."}, {"id": 80, "text": "Cara killed it! I cried my eyes out 😭 It's binge worthy"}, {"id": 81, "text": "Everything about this movie is perfect. Cara did an amazing job."}, {"id": 82, "text": "Such a beautiful picture! Lots of attention to Detail. Beside the main cast, I adored the side characters. I was laughing and crying. Literally. Camera work is fantastic, also I really liked the edit. They put a lot of work in post production!"}, {"id": 83, "text": "Honestly Syres acting was just phenomenal. Like it truly was. I was not only impressed but I was also very proud. I'm usually not the type of person to cry while watching a sad movie but maaannn, this movie had me crying my eyes out each time Syre would start crying. It was his authenticity that separated this movie from all of the rest. Like seriously, job well done guys. I would even say that I enjoyed this movie so much that I would definitely watch it again."}, {"id": 84, "text": "Jaden's acting is actually extremely impressive, especially on the main crying scenes. He really takes after his father ! The storyline is beautiful and very up to date with how the world is now."}, {"id": 85, "text": "I don't understand all this hate??? It's obviously a teen romance movie and you should know that going into it. My guilty pleasure is teen romance movies but I know they're not usually cinematic masterpieces and they're enjoyable for what they are. But this movie was good!! It has a lot of the themes of your typical girl dying from cancer romance movies but again what do you expect. It had a lot of emotion, definitely made me cry in the end, and was overall a beautiful movie. If you're a sucker for a good romance tear jerker, this is an awesome film for that!!"}, {"id": 86, "text": "Loved every minute of this movie, very well acted and written, touching and funny!"}, {"id": 87, "text": "I would watch it again. Nothing more to say. Great Job Mitja!"}, {"id": 88, "text": "This movie is one of the best movies I have ever seen in my life. It's one of the few movies that made me cry. I think it is worth seeing for everyone. it is worth 10/10 if it had 20/20 I would put it."}, {"id": 89, "text": "I loved the film! Jaden's acting has improved with age and he did an amazing job in this film. Plot kept you engaged and wanting to see more. Comedy lines were funny and just the right balance. I enjoyed this film and you will too!"}, {"id": 90, "text": "It was a good movie but I didn't like the main character who had cancer. Jaden's acting was really good. Out of all the teen with cancer movies I've watched this is the only one that didn't made me cry that's how I know it wasn't as good as the others."}, {"id": 91, "text": "Beware, there are several 10 reviews by people who just recently have established their accounts, most likely studio shills to get the rating up. This is becoming more and more routine on the IMDb. You'd best ignore them.My greatest disappointment with this film is casting Jaden Smith as the boyfriend. If you do a search on the terms can't act you might well get a photo of Jaden Smith. He drags the movie down.A few years ago he was featured in After Earth with his dad, on that role I wrote, This is a very plain story, and relies on young Jaden Smith to convince us he can carry an action movie. He showed us he can't. He is not a good actor, and he enunciates so poorly that we often had difficulty even understanding what he said.Other than that it is a decent story, although told many times before, and Cara Delevingne is really good in a challenging role. See the movie if you will, just don't expect too much. It is available FREE on Amazon so you are only out a bit of your time."}, {"id": 92, "text": "Life in a Year is a Drama - Romance movie in which we watch a 17-year-old boy falling in love with the girl of his dreams. He later finds out that her life will end soon and he tries to live with her an entire life in just one year. They face many difficulties through their journey.I have to admit that I did not have high expectations from this movie and I was not disappointed by it. The plot was simple and boring, without any suspense or plot twists that would made it at least interesting. It also reminded a bad copy of the movies A Walk to Remember of 2002 and The Fault in Our Stars of 2014. The interpretations of both Jaden Smith who played as Daryn and Cara Delevingne who played as Isabelle were below average and I believe that they both did not reach their potential. The interpretation of Cuba Gooding Jr. who played as Xavier was good but not enough to save this movie. Finally, I have to say that I read some reviews about it after watching it and I observed something strange. A lot of reviews with rating 10/10 were from users with only one review (Life in a Year) and registration on November or December 2020."}, {"id": 93, "text": "I don't get the whole Hollywood drama thing, or why people don't Like Will Smith, or his kid, or whatever. Apparently there's like a handful of haters out there.For real though...I'm just like an average dude. No bias. This movie was GOOD. I'm rating it 10 stars to try and shift the weighted average, because it does NOT deserve a 5 or 6 or even 7. This movie is a solid 8. Prepare to ugly cry though. I'm 35. I don't care if you're a teenager, or parent of a teenager, this movie is good. I give it an 8 because I feel like the middle of the movie they could have gone more in depth with the characters. I think Cara Delevingne was on point the WHOLE movie, and Jaden did very well too. I would have liked to see a little more depth in his character. I don't chalk it up to his acting though, he was very good. I think it was the writing or producing. It's a great movie. I haven't cried like that in forever. It makes you feel human. It defines what it is to be alive. Wow guys...thank you. Applause (but not in a theater because only lame people do that)."}, {"id": 94, "text": "The majority of the user reviews focuses on bad acting performances and although the acting performances truly are a great component to the integrity of a movie, it still can not be the main reason to judge whether the movie is good or bad. So first of all the acting sure is not this movie's greatest virtue, but neither it's worst one. Let us just stay with saying that the casting is debatable.When you read Life in a year's summary of a plot you know exactly what to expect. You know there is going to be a romance between a boy and a dying girl with a sad ending. You know that. You go with that. You are in a mood for that sort of a movie, or you need some low-brain activity relaxation. Movies like that purely entertain and that is great, we need those kinds of movies.One movie critic once said that romance movies are the hardest to write. Why? Because the audience knows what is going to happen, yet a screenplay writer still has to come up with a script that in some way is going to differ from other romcoms. This movie could not fail more in this aspect. There is nothing wrong with a few cliches in a romantic movie because you expect them. They are comforting, they are relying upon that the audience just excepts them, the audience won't judge them, they just feel them. But if the movie is stringing them up one after the other the outcome is a bad movie.You have a wild and lively parentless girl Isabelle with a terminal disease, you have Daryn, a nerd kid who needs some unruliness in his life, but his strict and controlling father gets in the way. You have a loving mother who loves and supports her son's romance and sees a bigger picture. You have two friends who help Daryn to reach his goal. Now imagine a plot. Write down scene after scene (some of them look like a music video - you know driving on a road 15 km/h so the actress' hair is not flattering in the wind), add a few cringes. Then you watch Life in a year. You probably guessed the majority of the scenes in this movie. This movie is begging writers for some sort of creativity but it gets none."}, {"id": 95, "text": "I began watching this movie expecting to be bored to death but who knew I was not. I have always liked Jaden Smith since he was little. In this movie you can see he has matured as an actor. His screen presence is undeniable I guess he has that Will Smith charm about him.The movie starts out lame and the supporting actors were not a good choice because the chemistry between them was not evident. But then a little further into plot the movie kind of grabs you and Jaden turns in his best performance to date. I always knew he had potential despite his previous bad reviews. Is it an Oscar contender ? of course not. Was it run of the mill not at all.One comment about movies being made today: Why does it seem that in a lot of movies being made today the almost obligatory throw -up scene has to be included. Do movie makers think that audiences actually enjoy seeing people throwing up especially when it is not necessary. Please stop it."}, {"id": 96, "text": "The story isn't original. However I still found it enjoyable. The reason for my fairly low rating is the some of the bad acting. I don't hate to just hate like most of the people leaving good reviews and sticking up for the people leaving comments on some of the actors. Cara is a really good actresses. She's been in a few movies that I've enjoyed and she was good in all of them. Jaden Smith however is not a good actor. Just because I don't think he is doesn't mean that other people can't think that he is. I've just never seen a movie that he's in that would change my mind. Cuba Gooding Jr also wasn't good and I really like him. Boys In The Hood was amazing and of course Jerry Maguire to name two. He hasn't been in a headline movie in a while. I don't know what happened but to me he's not the actor he once was. Nia Long was good. Her part is kinda small but I did enjoy her performance. I do believe that if a different actor played the role that Jaden played this movie would've been a lot better. Jaden was so bad that I kept thinking about how bad he is instead of enjoying the movie! Not everyone has the same taste clearly in actors so maybe you'll enjoy the movie more than I did if you find Jadens acting better than I do."}], "reviews_amount": 97}