{"name": "Occupation", "titleId": "tt06774786", "reviews": [{"id": 0, "text": "Although not boring, it is a piece of majestic crap. The most infantile screenplay ever... embarrassing at times.Can't understand the IMDB high rating.Aliens please take me, the humankind is not an intelligent race."}, {"id": 1, "text": "This had so much potential, big name actors (for Australia), clearly a significant budget but wow what a disaster it was. Bad direction, bad acting, poor continuity. Was really hoping this would be quality as a proud Australian but this movie has set the local industry back years.  Such a shame"}, {"id": 2, "text": "Why was this movie made, why did my girlfriend ask to see it, why.."}, {"id": 3, "text": "Just needed to post a review to make the overall rating a little more honest.I understand people have different tastes and all that, but this movie really deserves barely a 1 star rating overall. There is NO WAY any honest person could give this a 9 or 10 rating. NO WAY.   Borrowed this from another review because is says it so succinctly:Complete waste of time. The acting was mediocre . The plot , story and message, was a total waste. Worst sci-fi movie that I've seen in years.Editing this movie down to 60 minutes or so would have maybe brought it up to a 3 star and wasted an hour less of my life."}, {"id": 4, "text": "I had high hopes for the first ~twenty minutes, then the laughter began.The aliens could only see living things, so it was disclosed that they were invisible by blending into the plants around them - why didn't they wear plant camo?!Why, for the final battle, didn't the humans attack from the surrounding corn fields where they are invisible to alien scanners, instead of out in the open in a suicidal attack?Why didn't the humans wear the alien armour after killing them? Or use more alien guns, even attaching them on Earth aircraft?How did the alien at the end know that an extended hand meant you put your hand in it and shake it in friendship? (Handshaking is a historic gesture to show you had no weapons)WHY did that one idiot at the end think that the aliens could now live in peace among them, ---&gt;&gt;&gt; when aliens demonstrated they had the knowledge to make a virus that could wipe out all human life, so now they could make more in the future in secret while pretending to be peaceful?! &lt;&lt;&lt;---Why didn't the human camp have perimeter guards? Instead the aliens just walked right into camp and opened fire.Why did the producers and director of this show make humans the bad guys in a few of scenes, like while trying to wipe us out by annihilation we're supposed to feel sorry for the female alien with an alien baby hurt by a battle, or an exaggerated display how brutal the human was beating to death the murderous alien, after his wife and son were captured and used as slaves before intending to release the virus to kill all humans?There's lots more wrong with this movie, I look forward to others adding to the list...if you are tricked into watching it despite all the warnings here lol!"}, {"id": 5, "text": "It's clear the 98 reviews are the directors friends giving this terrible film a 7.4 average.  The only reason I gave it 1 star is because I couldn't give it a minus 5. Everything from the plot, script and especially the directing was easily the worst I have ever seen.  The only positive I could give is the costume design for the aliens.  Please don't waste your hard earned money."}, {"id": 6, "text": "Music - one guy with keyboards, plot - worthy of a sequel of a bad movie, acting - below average, stereotypes and clichess - ALL there. Waste of time, unless you are high. I didnt know its australian, by the amount of patriotism it feels like a pure American proud-to-be film. I have just watched Extinction before this - compared to this thats an amazing movie.Oh and the aliens wear capes :)"}, {"id": 7, "text": "I have never critique a movie before on IMDB but I felt so emotional about this that I had to.It's a falling skies rip off even the aliens look like them. Terrible acting, Story continuity everything. I found myself yelling at the screen at the flaws in the story until I realised where I was.I would tell you where it's bad but I would need pages and pages as nearly every minute is BAD.!! I'm ashamed that this was even produced and filmed in Australia, only good thing it employed a lot of australians, but that's it., we have, as still do better than this in this country. Skip it and see Tomorrow, When the War Began (2010). much better occupation movie. People who gave it ten i suspect are paid reviewers and others that gave it more than 5 are extremely generous."}, {"id": 8, "text": "This movie was really bad. The opening was fairly promising. I thought to myself, wow, netflix managed to find another decent, new movie. I was sorely mistaken. It all goes down hill a few minutes after the initial invasion.In reality, this might be a 2 or 2 ½ out of 10 stars flick, but there's a bunch of fraudulent reviews forcing the average over 5 which is insane."}, {"id": 9, "text": "God awful plot and acting. Australian film industry should not promote this piece of garbage. Story line was poor from the start and I'm afraid to say it just.got.worse. So many quotes from other movies that just made this film cheesy and a total waste of resources. There are scenes similar to other movies soit's a bit of a poor man's movie mash up. Could go down as a classic crap flick. Time will tell."}, {"id": 10, "text": "This is my very first review, simply because this movie is bad and on IMDb it is seen as okay with an 6.6 average. The movie is simply not worth that 6.6 if you go deeper into the demographics you can also see huge spikes around the high grades.. It is not fair, do we really need to rely on metacritics because people abuse a system? If you look at their reviews by the way.. All proud to rival hollywood in terms of sci fi because of the budget, does that mean the whole movie diserves a 8/10?  Is the COMPLETE package there?! Or are they just making a statement while people expect an enjoyable film they see this crap? It is not fair to be honest."}, {"id": 11, "text": "I figured it got a 6 so at least it might be mildly entertaining.....Well clearly the reviews are a bunch of BS cause this movie is a complete mess. Don't waste your time with this movie. You would have more fun getting a root canal."}, {"id": 12, "text": "2 hours of my life I will never recover. I can't believe how poor the editing ,acting, storyline, and continuity was. 30 years involvement in the movie industry and I can not remember a worse movie."}, {"id": 13, "text": "If this is the state of the Australian movie industry I'd say someone needs to put it out of it's misery..."}, {"id": 14, "text": "Bad script, bad acting, bad music,bad ! Sorry, try harder!"}, {"id": 15, "text": "I laughed until I cried. Then I remembered they were making a sequel and I just cried."}, {"id": 16, "text": "This is not the kind of film that usually gets made in Australia. We normally get low budget dramas but for once, we were given something to rival Hollywood in terms of sci fi blockbusters"}, {"id": 17, "text": "Sat in the movie staring at my mates like what an earth is this movie. Is there some kind of super satire I don't understand? Throughout the course of the movie I held in laughs constantly at the hamfisted cliche smash that was the entire movie. However I do truly feel sorry for the actors as I truly believe they all were awesome. They did their best with the awful script they were given and I felt bad for them throughout the entire movie. I hope people can see through how awful this movie is and give these actors a better script please."}, {"id": 18, "text": "What the hell do you movie nerds expect? Why give a decent film 1 or 2 out of 10 just for badness. The budget was obviously low and beat the hell out of some movies with 100 x the budget, the acting was decent, felt real, ok could have been a couple of hours longer and turned into a mini series to expand the story out. I guess it felt a little like red dawn, yes I was entertained.Anyway I enjoyed it, 8/10"}, {"id": 19, "text": "THEY MUST HAVE KNOWN IT WOULD NOT BE WATCHABLE FOR MORE THAN A FEW MINUTESPROBABLY DIDNT HAVE ANYTHING ELSE TO DO"}, {"id": 20, "text": "Loved it. Dollar for dollar, this film delivers where bigger budgets and bigger names have failed."}, {"id": 21, "text": "Honestly a must watch Australian film that holds its weight against any US Blockbuster!"}, {"id": 22, "text": "Good Aussie Film well produced for the budget with some great aussie talent. Impressive that they pulled off the level of SFX for the budget"}, {"id": 23, "text": "I came to see Jango fett kill some aliens and I wasn't disappointed!"}, {"id": 24, "text": "I liked it, had a good Aussie feel to it ( did remind me of 'tomorrow when the war begun' ...insert aliens.Obviously not big budget but better than a lot that are, Acting was good, had a story that keeps you interestedLooking forward to bluray"}, {"id": 25, "text": "... and after crossing the vast expanse of space, they land, line up and walk in formation while shooting at tents.The top review right now says We normally get low budget dramas but for once, we were given something to rival Hollywood in terms of sci fi blockbusters.No my friend, no you did not."}, {"id": 26, "text": "The movie was great!. The cinematography, the acting, the costuming, and the whole job was so very well done. Good on you Luke Sparke and team. It'll be interesting to see the Occupation 2 movie."}, {"id": 27, "text": "Complete waste of time. The acting was mediocre . The plot , story and message, was a total waste. Worst sci-fi movie that I've seen in years."}, {"id": 28, "text": "My mum taught me if i dont have anything nice to say, don't say it all.So I'm just going to leave this here. Also, it's true they are in Pre-Production for a second one."}, {"id": 29, "text": "Although this was a good attempt at an invasion film, the choppy story line spread with a huge amount if cheese was to much for me. The predictability if it all, meant that I was bored by halfway through this film."}, {"id": 30, "text": "Red Dawn meets War of the Worlds in Australia. Intermittent chick flick moments with tons of futuristic shoot-em-up scenes. Worth a look."}, {"id": 31, "text": "Best movie that I have seen in a long time! Very engaging, and you get to love all of the characters!"}, {"id": 32, "text": "Refreshing to see an Australian Sci-Fi flick! Production quality surprisingly good for the small budget (a fraction of what Hollywood movies of similar standards usually cost!), great casting and camera.Unfortunately, just as in many Hollywood productions these days, the writers or producers of 'Occupation' tried extremely hard to deliver politically correct messages to the audience: so we are speechlessly witnessing a whining football player in the arms of a strong Asian woman who tells him he 'shouldn't worry'. Later on, the former hamburger cashier lady turns into a military soldier commanding the Australian elite forces around. Over time, while the movie is still somewhat entertaining, the obvious political agenda became so annoying that I turned the sound off, until the final scene, when the same Asian woman had suddenly turned into the chief negotiator of the world, making peace with the aliens. Yet another movie destroyed by outerworldly political messages that turn entertainment into an unasked-for annoyance."}, {"id": 33, "text": "Occupation knows what it wants to be. A character driven sci-fi film. It doesn't pretend to be anything less. It enjoys telling the story, and balances well between character moments and action set pieces. Word of a sequel is exciting, and I look forward to seeing where the world building will go. This could potentially be a very successful franchise. This is definitely a local Director out to compete with the big boys!"}, {"id": 34, "text": "I'm a proud supporter of Aussie film, of all genres. ... but nothing could make me sit in the theatre and watch this film to the end. The actors did a good job, some a very good job, but the premise and dialogue were so appalling, it was ridiculous. I respect the director pushing into a non-Aussie genre, really I do... but the Producers and Director have to take responsibility for the 1 ratings you're getting... the script stunk! Please more money into its development next time. You had everything else in place, it's a crying shame you missed the mark so badly"}, {"id": 35, "text": "Badass, Kickass, Excellent, Awesome, the Bomb... Very raw and to the point... No gimmicks needed... Simply do or die movie... I wish more movies were made like this one was... Highly recommended..."}, {"id": 36, "text": "I loved the movie. It was action packed with legendary characters and solid story line."}, {"id": 37, "text": "Recipe for bad Aussie indie scifi. Throw in a cast of B grade soapie stars and vaguely familiar tv faces. Add a weak script, lots of cliched Australian stereotypes and some bad effects.  Maybe a few of the cast were hoping to get some overseas exposure but this is awful. 1 star for the scenery."}, {"id": 38, "text": "Did the filmmaker's intentionally want to make you feel sorry for the aliens, well, they did. Bad acting, people you could care less about and hoping the aliens would somehow knock them off. Definitely did not spend a whole lot of set design. Read on the reviews that there is going to be a number 2 movie, I hope to God no."}, {"id": 39, "text": "Its the first time australia has made a syfi movie like this and i thaught they did a great job yes it could be better but all in all it was a very good movie well done to all of you involved im sure practice makes perfect cant wait to see number 2"}, {"id": 40, "text": "Typical personification of aliens invading Earth. OMG, aliens will not be in the form of the human race, carrying lazer guns and flying in little tiny space ships. Pure crap."}, {"id": 41, "text": "I have watched a few Australia cinema and most of it is garbage but this wasn't bad had a couple of know actors, there was mistakes but all in all a good watch and I will be watching the sequel"}, {"id": 42, "text": "For what it is, as an Australian blockbuster - I did get through the whole film without being as annoyed as other reviewers seem to be here. It's a bit soapie. The action sequences were decent. All in all...you probably won't go back to watch it again."}, {"id": 43, "text": "Acting was ok but the story was awful. I fast forwarded half way to almost the end. The handshaking with the alien and ask it if it wants to share our world with them was terrible."}, {"id": 44, "text": "Top movie. Great cast. The story is brilliant. The sound is spectacular. The special effects are a must see. One of the best movies I have seen in a very long time. If you like science fiction movies you're going to love this one"}, {"id": 45, "text": "Really enjoyed Red Billabong, but this was Saturday afternoon made for TV type rubbish."}, {"id": 46, "text": "Muhahaha you have to watch this because it's so bad. Jacobson is THEE worst actress ever! omg where did they dig her up from. Someone wrote Home and Away with Aliens, they hit the nail on the head. Such a bad movie with terrible acting. And what the hells up with the Aussie Rules when it's based in NSW, should've been League...doh!"}, {"id": 47, "text": "I rented it based on redbox reviews. Apparenlty the director wrote the review."}, {"id": 48, "text": "Terrible acting. Terrible special effects. Terrible flaws. Terrible movie. I just came here to vote and help move the score to something realistic. Obviously there are a lot of false reviews on here, giving this movie such a high score."}, {"id": 49, "text": "This movie is one of the worst I have ever seen. It seems that It was written by a kid."}, {"id": 50, "text": "Another brilliant Australia movie. Brilliant sci fi . Dunno how the Aussies do it but they're productions excellent"}, {"id": 51, "text": "Can't understand all the bad reviews. Although it's a bit corny and illogical at times, I enjoyed every minute of it. It is just a movie after all, and movies are meant to entertain, which it did. I think some people expect too much in a movie."}, {"id": 52, "text": "It Starts off just another day in a small town in Australia. Than it turns into a really cool Sci-Fi film, about a group of pretty bad ass looking aliens taking over the town. I'm very impress with the visual effects overall, and it feels like the effects team knows how good they are and sometimes gets corny with it, but that's ok, cause the thing is so live. They are trying to do an Independence Day like movie on a minor budget and it's working on me for the most Point. Some of the action sequences are strangely dramatic and a bit surrealistic without trying to be that. Very Ozploitation in it's tone. It's pretty cliche with the theme of everyone uniting over a common threat, But I'm far too impress with the large amount of sci-fi in what looks like a pretty small movie. The visual effects the make up and costumes and the small amount of CGI. It was fantastic to watch."}, {"id": 53, "text": "1. Aliens attack small town without any infrastructure.. 2. They kill some civilians and some got taken away for no reason 3. The mother ship is so big that gravity of ship would change orbit of the earth and killed us all 4. Story line is very cartoonish like. It is sad there is no creativity in it. Sotory is a total ripoff others good alien films. 5. Acting is very bad. Characters change by time scene, like they don't have any backbone. 6. CGI is chip non realistic at all.But what do I know, Im just another film maniac, but after 30 min I stopped watching this crap... Videos of UFO sightings on youtube are better produced than this film and they are produced with no budget....  I got a filling that this film was recorded with a phone. Camera in fights is like some kid was recording and not professional."}, {"id": 54, "text": "This movies tries to pack in so many tropes &amp; cliches in two hours! Pregnant woman? Check. Spunky kid? Check. Ex-con/fugitive/criminal? Check. Badass woman in a tank top? Check. Absolutely nothing new or original here."}, {"id": 55, "text": "Theres no meaning of this film. You couldnt care less about anyone. Special effects costs less than 50 bucks. No story, no direction at all. Just a silly alien attack. You could find more interesting stuff in your nose than in this movie. If you watch this movie you will lose braincells for sure."}, {"id": 56, "text": "... would aliens attack a rugby game? They couldn't find anything of more strategic value. And this is the opening scene. Why keep watching after that? Just bad."}, {"id": 57, "text": "Given the budget, restraints and a few plot holes I was pleasantly surprised to see something as polished as it was. The acting wasn't overdone like many Aussie films, it wasn't exceptionally cheesy, the special effects were much better than I was expecting and once you got past the fact that it wasn't an American remake of Skyline or Independence Day where the Americans were coming to the rescue you could accept them charging into battle under an Australian flag!"}, {"id": 58, "text": "To be honest I love sci fi and I was happily surprised. I was expecting a bad low budget movie. instead, considering de limitations they had, I got a good cast, ok story, decent special effects. I would compare this movie to the TV show  Falling Skies form Executive producer Steven Spielberg. I am hoping they make an Australian T.V. show.  ** make you on opinion but I tink you will enjoy!"}, {"id": 59, "text": "I gave this a go after seeing the 5.8 rating which is about the minimum for a 'decent' flick. Jeez what a misleading score it is! Direction, acting, story, CGI, costumes, everything.... is just terrible! Give this joke of movie a wide birth."}, {"id": 60, "text": "Never heard of this film till saw it on a Walmart shelf. I know a few aussies so thought i would check it out. Obviously made with a lot less money than a hollywood film but A for effort here. A lot of heart."}, {"id": 61, "text": "This was pretty good - it was typical Aussie 'stuff 'em!' attitude and that's not a bad thing. There was NO 'America's going to save the world so the rest of you can sit back!' and that made a nice change. There was no one person there as the 'save the day' hero, nor was there the intrinsically evil character.The acting was pretty good and the story was well done considering it was all really done on a shoestring budget. NOT every film is going to be a hollywood blockbuster, and I'm so grateful for that!"}, {"id": 62, "text": "Enjoyed the relationships between the characters, the level of action, the effects...I couldn't actually find much I didn't like about it..."}, {"id": 63, "text": "I had to write a review, having read some of the inane and unkind comments in these User Reviews.This was very well acted and well paced. Be prepared to suspend your disbelief and you will enjoy the characterisation, storyline and sequences. There are strong messages in this film, above and beyond the shoot 'em up sci-fi flick.It's a low budget film and critical eyes will see things that could have been done better. Could you have done it better, though? No, I didn't think so. It seems some people who believe themselves disenfranchised like to come to these columns to vent their frustration. You have seen science fiction which you preferred/thought was better produced? No reason to give this film a 1 star rating."}, {"id": 64, "text": "The idea was good but the execution was very B-grade. Overacting but the humans, underacting by the Aliens. Overall below average movie BUT I've seen far worse. Still better than Zoolander 2"}, {"id": 65, "text": "Not the greatest movie but it passed quite quickly. Only in Australia could they make an alien global dominatin movie in where they get the aliens at the end to fight for them against the aliens."}, {"id": 66, "text": "Could have been better, jumped the timeline a few times and was confused for a second or two."}, {"id": 67, "text": "I think the movie tried to satisfy everyone, lots of drama stuff, lots of fight/ military stuff, lots of alien interaction, lots of alien empathy stuff, and in the end kind of failed to satisfy any of those lines. For me I would of liked more explanation of the grand strategy of the war. I did not really get the all important key target virus thing, I sort of got it, but more time spent in the military aspect would of done it for me. Less time with all the drama stuff. The baby thing was a little different in how it ends up.A low budget battle for LA type of movie with all the soap opera drama U get with the typical modern sci fi TV series. If U wish this would be better, then definitely watch --Red Dawn (1984)--I did not mind watching it, I like sci fi action movies. But like I said, in the end its kind of flat. nice song for the end credits"}, {"id": 68, "text": "It's an alright action film with some nice action sequences. Temuera Morrison is definitely the stand out and deserves more screen time. Better than any other aussie film i've seen this year."}, {"id": 69, "text": "If you've seen the Tv-series Falling Skies its basically that, but summarised to a film. Not the best but definiately entertaining and good to watch for those of us who like scifi. If this type of film would go high budget instead of low, would be awesome."}, {"id": 70, "text": "I've never reviewed a movie before but this thing was such a complete waste of 2 hours that I felt compelled. The story is ridiculous. Something a prepubescent boy would write after watching his first alien flick. The acting was God awful! I mean just bad. And the costumes were stupid as all hell. The aliens just looked like something you'd see walking around a theme park. Do yourself a favor and skip this. Go spend 2 hours watching paint dry or grass grow. You'll enjoy that more."}, {"id": 71, "text": "As usual with the world being backwards nowadays anytime I see a film that has very conflicting reviews on here it's a sign it should be watched and i wasn't dissappointed. It had a good story line &amp; decent acting. It wasn't cinema worthy and had a cliche here &amp; there yet it was very watchable and makes for a good home movie to watch. Kudos to everyone who did this film, America could learn a thing or two from Australia about film making."}, {"id": 72, "text": "I do not know what others have given this movie bad feedback, compares it with. But I thought it was pretty good. Of course, there are little things to put your finger on, but all in all, it delivered. The effects were good at being a low budget movie. The play was also good, I think.The action was good, with a good story behind it. I've seen worse movies, with famous good act.See it with an open mind, I did after reading many of the bad feedback in here. I was not disappointed"}, {"id": 73, "text": "What was this movie? What were they trying to achieve, plot wise? It's so bad, it's just make u laugh. It started promising and then as someone else pointed out, it goes downhill so fast, it makes you wonder, what happened? It's almost like 50 different people were given task to direct/write this movie and they just slapped all together. The whole plot, acting and screenplay just doesn't make any sense throughout whole movie. Just please avoid this movie at all cost. I am not getting 2 hrs my life back but I can just maybe help you save yours."}, {"id": 74, "text": "About a third of the way through I was thinking it was the second worst movie I had ever seen but half way through I realized that it was by far the worst movie I had ever put myself through. The directing, acting, effects, EVERYTHING was amateurish and was extremely painful to watch. Do yourself a favor and skip this one and spend that 2 hours doing something productive."}, {"id": 75, "text": "Ok let's be honest. It's not a Hollywood block buster film but for an Australian film it's awesome. Great Aussie actors doing there best acting. Really enjoyed it."}, {"id": 76, "text": "Never heard of this film till saw it on a walmart shelf. I know a few aussies so thought i would check it out. Obviously made with a lot less money than a hollywood film but A for effort here. A lot of heart."}, {"id": 77, "text": "Red Dawn meets Independence Day down underNot nearly as good as either of them"}, {"id": 78, "text": "This wont be a gushing review or an instant 1 to try to balance other reviews.  Here you will find an honest review of the film. I rate this a 5/10. ONLY watch this if you are dying for an alien invasion flick or have a lazy afternoon and have watched literally any other big budget alien invasion film. In a vacuum of the Australian film library, as one of their rare big action pieces this would have gotten a higher score, but based on other past and present movies I just cant. If this film had come out 8+ years ago or as a TV movie, I could forgive it, but not as a full release film. The film stars several semi-famous people from the region such as Temuera Morrison (Jango Fett from the prequels) and Stephanie Jacobsen (Kendra Shaw on Battlestar Galactica: Razor) and everyones acting is honestly all over the place. At times its quite good, but there are far too many eye-rolling moments that it completely torpedoes the decent moments of acting. None of the other supporting cast does much to help or really draw you into the movie, which is a shame. The plot itself is similarly to the cast just all over the place. We start out in a small town and at first I was worried that it would be a Signs-esque flick, where we barely see the aliens or their tech (Yes, I know the Signs theories, I mean in relation to how the movies are compared to one another). Fortunately for the audience we dont have to sit back and watch 45m of paper-thin 'character setups' as the alien attack happens quite quickly. Unfortunately we then stick with the characters as they hide out in old buildings, forests, and.... in corn. They hide in a corn field. The aliens are shown to have some kind of 'Predator vision' through their helmets but then half of the aliens arent wearing helmets and their predator vision is garbage. A majority of the film is just alien ground troops with an energy blaster-rifle. Almost no fortifications, heavy weaponry, or vehicles (even when the humans use attack helicopters on the ground troops). Their home base ship is nearly undefended, with a handful of ground troops on the outside and thats it. There are no weapons or defenses on the ship or surrounding their MOST IMPORTANT bit of technology, no cameras, no shields, NOTHING to defend their most important assets but literally just an open door. Also, this is supposedly happening all around the world, not just Australia, yet when we're told that humanity is fighting back, we still see no help from outside, nor do we see reinforcements when the mothership(??) is destroyed. We then end with Random Chick #1 (Stephanie Jacobsen) meeting with Random Alien #1 and making a peace treaty... I guess? Yet soldiers are still shipping out and there is world economic shattering damage done JUST to what we see of Australia at the end. We get a voice over about rogue alien factions and how humanity is working with them, but this *should* have been shown, not JUST told, while we see the aliens that just devastated their entire country on their side! Just smh... Lets just summarize by saying: Dont watch this for the plot. Get popcorn out, turn off your brain, and put on your best laughing pants. The aliens themselves are passingly done, fortunately not looking TOO much like cheap halloween masks, with touches of CGI (?) where appropriate, such as eye blinking. Their weapons and armor seem to change their mind CONSTANTLY as to what theyre able to do; sometimes theyre bullet-proof, other times not, sometimes you can just punch an alien to render it unconscious, other times they're invulnerable. Unfortunately, instead of using drones for ground troops, or providing them with vehicles or buildings, after the first assault using odd car-looking assault vehicles there are ONLY ground troops left. These aliens are supposed to be so technologically advanced yet they are using defensive tactics out of Game of Thrones. Just stick a few guards out front, we'll be fine. The aliens themselves are a bit of a......... very confusing point. They've destroyed their home planet and came to Earth to take it over. It seems that the aliens also have a civilian population with them, but the majority are soldiers and they only know one thing: killing humans gets them a new home. With their level of technology, it doesnt seem that they would need to travel to Earth just to make a new life. SURELY if the aliens have gotten to this point technologically they would have some kind of brains in their skulls but... the writers were more concerned with spectacle over any kind of reality. One of the things that will bother many, I'm sure, is the score. Its bland, generic, and pumped up WAY TOO LOUD frequently. It seems to be trying to emulate a lot of recent Hollywood action films with sweeping orchestral and thumping patriotic music but it comes off more like Battleship than Infinity War. With ALL THAT being said, this isnt a terrible movie. The effects are passing, the acting usually gets a pass (usually), the script and plot were a joke so its hard to tell to what extent this was the writers fault. The director and cinematographer had several decent points though neither was amazing.As stated, this isnt terrible, its all done decently well. This isnt a B flick, maybe somewhere between A- and B+? Honestly, if this movie had someone behind the film to tighten things up like the script and pacing and logic, this could have been a solid movie. The movie looks bigger than it is due to a lot of unpaid extras, which helped add a realistic touch to the film of random people being in your party after a disaster. If you are looking for something thought provoking or mind bending, this is not the place to look. If you want some dumb fun this *could* be a pleasing way to turn off your brain and watch things go pew pew boom.I would say for those who know what theyre getting into, this could be an ok rent for $1-5 bucks, but I wouldnt watch it with commercials and I wouldnt pay more than that to see this."}, {"id": 79, "text": "A thoroughly entertaining and well crafted film with a positive message about tolerance and cooperation. An engaging story, likeable characters, atmospheric cinematography and good action pacing all add up to a very enjoyable film watching experience."}, {"id": 80, "text": "This is not a blockbuster, and the final scene was abominable, and yeah, it wasnt $100m Hollywood box office. But it wasnt sharknado either. Its not too bad and a watchable family film. Fair credit to all involved I guess. Well, except Morrison. They should have saved his salary and avoided that cliche character"}, {"id": 81, "text": "Yes, a B movie, but entertaining. Sort of a Red Dawn meets Power Rangers in how unbelievable a lot of it is. I did like the characters and the sub-stories. Some acting was not too bad. What is cool to see is that since there are over 11,000 ratings on here already, at least 11,000 people have seen the movie.... I didn't waste my time on it, it was entertaining enough that I am glad I watched it. But do not expect much."}, {"id": 82, "text": "Hard to define.. Only accurate description I can give is, it's different. Firstly it doesn't take itself seriously, it doesn't pretend to be the next Star Wars. Pushes Australiana to the extreme &amp; definitely has some funny parts. Best description I can think of, is a movie with Country Australian, Starship Troopers humour x with War of the Worlds and a bit of Terminators' underground rebellion thrown in..Hope that helps. Alien invasion occurs.. Aussie response 'I've got outta worse .. been married 3 times'"}, {"id": 83, "text": "You know, I actually really enjoyed this one casually watching it. The acting I thought wasn't bad despite some others not agreeing. I liked the twist of working with the aliens and humanizing the alien's cause. They just wanted a home. Not bad, really."}, {"id": 84, "text": "Entertaining. While there are no big names that I was familiar with (Michigan here) this was a solid effort that I would be more than proud of if it were mine. Excellent aliens, good plot, great guns, believable motives. Really really good tech. Well worth a watch if you like sci fi."}, {"id": 85, "text": "Honestly, going into this movie I was already a big fan of this genre of film. The plot of this movie is like a few others but that doesn't damper it's majestic glow one bit. I thought it was brilliant to shoot this with an Aussie cast and in Australia because it adds more perspective on a world view and more dynamic to the plot. Plus, let's be real, the Australian accent is just fantastic. I thought the acting was actually fairly decent and even though the effects weren't Hollywood they definitely didn't disappoint. One of the only downsides was that the movie had what we like to call the Stormtrooper effect. Lots of shooting, not many hits but that's okay in this film because it helped draw out the action sequences. All in all, when all was said and done, I would probably watch this movie a second time. Give it a shot!"}, {"id": 86, "text": "Actually closer to 7. Decent film similar to Independence Day. Good acting. Good special effects. Characters developed nicely. Plot and storyline seemed credible. I really liked watching this film. Like an old war movie but the Aliens are the enemy."}, {"id": 87, "text": "This movie had a Red Dawn feel. Small town vs aliens in Australia."}, {"id": 88, "text": "They sold me right at the end with the Aussie flag. Pure awesome and i dont care who knows! Sick of seeing the USA flag in all films. Why dont we more? Well this film did."}, {"id": 89, "text": "Watch the movie and actually feel what happened to the people in it. I had low expectations when I started watching, and was actually moved to post a review for the first time. Yes, it's not a big budget US film. But, I feel that it is one of the best movies of its type that I've seen in a LONG time. Watch it and make up your own mind. Don't let the 'haters' make up your mind for you. It's tough to get past the first 30 min if you're not an Aussie, stick with it. CGI is not the best but it's good. Again, make up your own mind and maybe enjoy a good movie."}, {"id": 90, "text": "Yes there are a few things that could be better, but damn son - those crazy aussie film makers have to be given credit for this film. The birthing scene with the amazing Rhiannon fish is worth the price of the film alone. Intense!!!"}, {"id": 91, "text": "The movie is definitely about aliens trying to find a new home cause of course, living things always screw things up. The story is good though I feel like almost alien movies go like this, the alien...isn't it too 'alien'? I find it exaggerated. I like Amelia character especially, she's fierce and strong. Didn't know this was Australian movie, it's really good."}, {"id": 92, "text": "Big star wars fan here, so to see jango fett fight of Aliens in Australia was awesome! Didn't think much of the Army colonel but the major character had the best line in an aussie film ever. Aussie Aussie Aussie"}, {"id": 93, "text": "Great film, worthy if you are a sci-fi fan. Seriously. I met the cast at a Supanova convention and they are all fantastic people. I can't wait to see more from this universe!"}, {"id": 94, "text": "Entertaining flick. Clearly on a budget but the acting is solid and the cgi is acceptable. Comparable to a high quality straight to TV flick within this genre. Not an A list but not a B Movie either. Somewhere in between."}, {"id": 95, "text": "There were a couple of reasons I went out of my way to see this film, one of them being that it was an Australian sci-fi, and secondly because it was made on a budget of $6 mill. Honestly, I am amazed at how far you can stretch $6 mill these days when it comes to film making, and sometimes I wonder why it is that some of these Hollywood blockbusters blow out in cost the way they do. Then again, big name actors, and marketting, really isn't all that cheap, and one of the problems with this film is that there wasn't all that much in the way of marketing. In fact, I found out about it from some posters stuck on the side of a building in Brisbane.  Now, don't get me wrong, the acting in this film is absolutely appalling. In a way it looked as if the director sacrificed acting in favour of special effects, and the effects, for a low budget film, was pretty impressive. For instance a swarm of apache gunships dog fighting with alien fighters. Now that was cool. Okay, when I saw it on the big screen, it did end up looking like some really bad CGI, and in a way I probably can't forgive the film for that. The thing is that when you have the ability to make a low budget film in the end it can make or break you, and you really need to do it well for it to work. Unfortunately that wasn't the case here.  The thing is that the plot was basically one of those well worn plots. In one sense I would describe it as being Red Dawn with Aliens, though since it has been set in Australia, I suspect that the director is probably more familiar with Tommorrow When the War Began. I can sort of understand where he is coming from though, and having aliens as opposed to an unnamed invading country does work. Except that I've seen the plot before, and there is no real twist in it. As such, as a film, it does end up falling down. Basically the aliens attack, a small group flee to the hills and then become resistance fighters. There really isn't anything all that new here.  Sure, there are some pointed remarks about how the world has changed with the invasion, and that there is no going back to the way it was before. Basically they point out that this was what happened when the British landed in Australia. The problem here is that the people of Earth are actually much more adept at fighting back, and it also appears that the Alien's technology really isn't as great as to hold off not only rebels, but also getting their ships shot down. Then there is also the argument that there is probably no reason whatsoever that an alien race would want to invade the Earth, for multiple reasons. Okay, land is always a factor, but then they also work on the premise that there are many Earthlike planets out there anyway.  Honestly, I don't really want to give this film a bad rating, but unfortunately there isn't all that much to redeem it. Sure, the constant bickering between the rebels is somewhat more realistic that what we see in Red Dawn. For instance, we have a group of people who have never been trained as a military force, have little to no discipline, and are pretty disparate. Okay, we have an army reservist, and we also have a couple of footballers, but that is about it. Also, the animosity between the two footballers means that while they might play on a team, they aren't actually team players. So, while it wasn't a bad film, the acting, and the fact that it has all been done before, really means that in the end it is pretty average."}, {"id": 96, "text": "Dreadful doesn't even start to give it justice. This is really really beyond bad. One might disagree but the numerous 10 reviews are obvious trolls thaht should be outright deleted. 5mio $ ? What a waste!"}, {"id": 97, "text": "The premise of this whole movie is ridiculous. An alien race travels light years to harass a handful of people in a small country in outback Australia...lolBut being an Aussie myself, i thought id give it a go. Its not great. But its not the worst either"}, {"id": 98, "text": "Ok...you can see where the writers/directors have gotten their inspiration from. But you have to forgive them this for the fact that they have also given us an extremely enjoyable movie right here!! The budget they have had to play with is probably 5% of what Hollywood has to use,and yet they have offered us a great character driven sci/fi adventure. The ensemble cast is nothing if not stellar,and you will pick out actors from movies as diverse as Romper Stomper/Once were warriors/Muriels Wedding and many more! I'm not going to give any plot spoilers away,but if you enjoy your scifi you will love this!! And also it was great to get Temuera Morrison back in full on Jake The Muss mode!!!!"}, {"id": 99, "text": "Horrible acting and the special effects, aliens, lines were a joke. I couldn't even finish the movie. Don't waste your time!"}, {"id": 100, "text": "I literally laughed till my tears came out watching this. There has to be a mistake that this movie to be added to sci-fi/action. It is 100% comedy, just watch it and be the judge yourself. Cliche as 'F' and horrible scripts, whatever you do, don't try to be serious with this film.Gonna give this a 10 rating for the entertainment it gave me. Seriously I haven't had a good laugh from any movie for a long while."}, {"id": 101, "text": "As to why this movie has a not so bad rating I mean death race 4 currently has 5 stars and I liked it very much ! I am a very patient man and I never knew there was a movie I actualy cant watch because it is so utterly bad .This movie had introduced me my limit.I am more then this! It is possible that it has something to it which I will never know because I will never watch this movie. Ever.. never ever ever I saw 25 minutes I think...I can still remember how ridiculous it was ....I wonder if thats has something to do with the moview being not so bad after all...nah just kidding go do not believe me watch it"}, {"id": 102, "text": "To watch or rate anything ever again. At least a 6, i gave it an 8. You want to see 1 and 2 rating movies watch some of prime's Gravitas productions. Seriously, some people making movies should be in movie making jail with you 1 and 2 raters."}, {"id": 103, "text": "No, it is not a blockbuster out of hollywood...and it certainly is not another attempt at a 'Road Warrior' saga...but they movie does have some technical merit and a story; that in itself makes Occupation worth watching...I actually found this on Netflix, and while I am not exactly spellbound, the movie does have my attention while I write this. And I have already watched this for a longer time than I watched the super hyped 'Black Panther' or even 'The Avengers; Infinity War' So kindly leave all the ones and twos at the door, and watch it for what it is...a relatively low budget movie that is actually pretty good..."}, {"id": 104, "text": "Not too much, not too little. A good hot crack for an aussie action film. Liked: Stephanie Jacobsen, Rhiannon fish (wanted more of her) and Tem Morrison, Not a huge fan of Dan Ewing or the other guy. Charles measure was funny. Overall, a worthwhile watch!"}, {"id": 105, "text": "Don't be suckered into believing the 8, 9, and 10 star reviews. This movie is not Australia's answer to Independence Day. The acting was mediocre and the script was abhorrent. Total cheese, and not in a good way. I was entertained for around half an hour total, and this is a full two hour movie, so that's not a good thing. I would say it's good for a laugh, but really, it's not even funny. It's not even bad enough to be 'so bad it's good'... In other words, it's just plain bad."}, {"id": 106, "text": "Ignore the plebs who don't like it some r watching the low budget very very low occupatuon and not this one. But it's decent for sat nite. Would have prefered. When the war began no2 but I watch again. Ps. This as temura Morrison in it just in case like some u watched the crap one."}, {"id": 107, "text": "Total corn ball movie with a terrible story and silly, overly dramatic acting and music that ruins any sort of excitement you might feel. I figured with a 5.9 and 1300 votes I was safe, boy was I wrong. Please don't waste your time. I'm so sick of this site and the way A-list movies are scored beyond harsh and low budget foreign/indies are given an easy score. For example the new oceans 8 has a score of 6.4. Was it my favourite movie - no, but to score Occupation within 1.0 of this is insanity. I think realistic non trolls, non industry people need to pick up the reviews and help IMDb make sense again."}, {"id": 108, "text": "Just finished watching Occupation on dvd. Lots of little nitpicks and a few head scratches, but you know what? I really liked it a lot. If you are an aussie you should add this to your must see Aussie films. Pitty they didn't drop the C bomb!"}, {"id": 109, "text": "I've been following the progress of this movie for a while. I knew it would be low budget, (6 million) with few household names in the cast or production crew, so I was cheering them on, but I didn't have huge expectations. I was pleasantly surprised. The story line was a bit 'Tomorrow When the War Began' meets 'Independence Day'. However, don't let that put you off. Plenty of action, and some equipment and technical help from the Australian army helps. The character development is quite adequate and the plot moves along well. Its long at over 2 hours, but that time passes quickly. Recommended for those who like action/sci-fi that is good basic entertainment. (One criticism I will have is I didn't like the ending scene - bit smarmy IMHO). The director cast and crew have crafted a good entertaining flick on a small budget, and leave many much more expensive movies in its wake."}, {"id": 110, "text": "I am a big fan of sf movies, i will gladly suspend my disbelief for a good story. But this is Bad, imagine neighbours in space. Well its worst than that."}, {"id": 111, "text": "It is strange why ever release this kind of bs.Week plot. Week story and I did not even see it to the end."}, {"id": 112, "text": "I see some comments on here about how stupid the Aliens are attacking a football field? Sounds like you've just watched the trailer. We don't see any targets of opportunity because we are following characters in a small town. They don't work for the army. So why would we see it? There's also dialogue later on about government being gone. And also that HUGE ship in the sky..pretty sure that isn't just attacking one town. This is global. I gave it extra points because people are silly on here."}, {"id": 113, "text": "The plot has more holes in it than a block of Swiss cheese."}, {"id": 114, "text": "Do not waste your time, unless you like really badly made movies, awful acting, joke sets and ludicrous dialog. I did rate this 2 but then asked myself why."}, {"id": 115, "text": "There isn't much to say about this film. The story is unoriginal, the script is laughable, the camera work is like a very bad soap opera, and omg the acting... some of the worst acting I've witnessed."}, {"id": 116, "text": "First the Aussies make an Aussie Version of 1984 U.S. Movie Red Dawn as Aussie Movie and then a TV Series Tomorrow When The War Began as Chinese PLAN -AF Invade Australia. To be Politically Correct the Aussies don't day Chinese, but so obvious.Second Aussies make the Aussie Version of 1996 Movie ID4 (Independence Day 4th of July).Hey, Aliens get a clue. You want to take over Earth, Non Nuclear E-Bombs to destroy everything electronic with Electro Magnetic Pulses (EMP) and Electro Magnetic Radiation (EMR), then you wait a few months, Worldwide no Electricity. Imagine what Millennials without their Smartphones will do, no Facebook, Twitter, Social Media, they would have to find survival books made of paper from libraries just to survive day to day as they can no longer Just Google That."}, {"id": 117, "text": "I had read reviews on this page before going to see the movie, which were mostly negative - so I wasn't expecting much. However, this movie is awesome!! Lots of action, great special effects and some good one liners! Thoroughly enjoyed it - cannot wait for the sequel!!"}, {"id": 118, "text": "This movie doesn't take itself too seriously. I can see that some people who are giving it 1s are taking it way too seriously. It's a fun ride beginning to end with some hits and misses along the way but all in all i would watch it again and buy on DVD. I look forward to seeing the sequel. Hopefully the alien heads are a bit better as well"}, {"id": 119, "text": "This movie was so bad I created an account to rate it. I'm an Aussie and I was embarrassed Who ever rates this higher than one star is either related to the cast or crew The only good thing about was it amused my 8 and 9 yr old for an hour n half So so lame"}, {"id": 120, "text": "I wasn't expecting too much from this little gem of a flick, but I was very much impressed with the scope of detail and effort put into the production value. With sci-fi endeavors, the producer would expend all the budget in the last 30-minutes of the final battle. This one, however, had visual effects spread evenly throughout its entirety. The acting was solid. The characters were complicated and true to their strengths and faults. I had two issues with the film. Each individual scene were portrayed well, but the transitions were getting rough to the end. Something seemed off and the scenes were not tying well together. I believe it may be something with the script and not the directorial. The cinematography was spot on. The last issue was the music composition. The music composer was strong, but the music went on going and going and often times had no rest, to the point of hokiness. I give it an A- for effort and have hopes for the sequel. Saban Films made good, and their most recent lineup seems most promising."}, {"id": 121, "text": "Stephanie Jacobsen is the reason I only gave 3 out of 10...film is not that bad at all but her acting OMG!!!@ Somebody even gave her some kind of reward as a newcomer and stuff....and the director...what were you thinking dude???? Were you even there when she was NOT acting? Horrible....just horrible....never want to see her in the movie again...EVER"}, {"id": 122, "text": "I am so sorry for this review i know dont have the monye and the film is low bugdet but next time if the movis have low bugdet just make a filme with 5 actors maybe 20 but somthing good. alot of films have low bugdet but smart ideas. i see all the movie but i dint like is so mutch. so i give a 3 stars for the trye good luck"}, {"id": 123, "text": "Terrible. Definitely the worst movie I have seen in the last 5 years. Storyline bad, acting bad, everything horrible. Can't believe they actually charge money to watch this. They should be paying me to watch."}, {"id": 124, "text": "Yeah.... the title just about sums it up. I am one of those people who watch movies for the sake of watching, usually no matter how bad they get. You can kinda call me addicted to movies, and not just the good ones. There have been a few movies during my lifetime where it was unbearable to watch, and this one is right at the top. It was so bad, I had to fast foward through the bad acting, absolutely dumb story line, and cheesy costumes / graphics. If there is a movie that you really don't need to bother to even think about, well, this is it. I warned you."}, {"id": 125, "text": "My wife and I saw it on Friday 20th July. We enjoyed it got a few good laughs. The actors and crew did a great job with the budget they had. Knew it wasnt Hollywood Blockbuster with 200million to spend. Great to see homegrown product on the big screen. Really liked it."}, {"id": 126, "text": "It's not a masterpiece but it's a good movie. I enjoyed it."}, {"id": 127, "text": "It really isn't that bad. I'm not sure why there are so many one stars."}, {"id": 128, "text": "An Alien invasion film on a low-budget with mediocre special effects, actors most people will never have heard of, aliens that look like actors in cheap Halloween costumes and a fairly unoriginal story. For all that this movie is kind of endearing, well edited and directed, makes you care about the characters, is genuinely exciting, never boring and most of all and most importantly highly entertaining. I've seen Hollywood movies with 100 million dollar budgets that were not this much fun to watch. A movie doesn't have to have a huge budget to entertain and this is a good enjoyable ride from beginning to end. I would watch it again and would love to see a sequel."}, {"id": 129, "text": "I genuinely loved this film. It's about time that Australia produced something actioned packed and exciting!  Most Australian films are so boring, typical and repetitive. I haven't seen anything so actioned packed before. Definitely worth seeing ! Let's support our Aussie films so that we can get bigger budgets to make bigger and better productions in future! It's Australia's time. Give this movie the rating it deserves folks and support our fellow Australians for creating something amazing !"}, {"id": 130, "text": "I registered an account with IMDB because I had to give my opinion on this movie. As an Australian, I like to apologize to the rest of the world for this terrible movie. Don't get me wrong, I'm a proud Australian but this movie was embarrassing. Terrible acting, terrible props and so cliche."}, {"id": 131, "text": "Why? Just . . . Why? Don't waste your time. I have never written a review before but felt compelled to do so because this movie was just that bad. So bad. I watch a lot of terrible movies because they are often still funny. This wasn't even funny. It was just so . . . bad. Save two hours of your life and just walk away. How anyone could rate this more than one star is beyond me."}, {"id": 132, "text": "Okay so apocalyptic, alien, natural disaster end of the world scenario movies or tv shows are my passion. With that being said, the 48 minutes I put into watching this garbage was a waste of my life. I have eternally lost 48 minutes of my life on earth and couldn't fathom donating more time to finishing this abomination of a movie. This movie makes no sense. There are pointless time jumps out of nowhere with no explanation of what led to it. They jump deep into a scene without showing you anything before....it's almost like a scene should have been 6 minutes but instead of showing you all of it, they're like let's just show the audience minutes 4-6. Don't waste your time. This is like my third review in 10 years and this movie was that bad."}, {"id": 133, "text": "First 30 seconds are good, but then it fails quickly. Very difficult to understand what people are saying. Australian version of War Of The Worlds and Independence Day."}, {"id": 134, "text": "I am blown away by the people giving this positive reviews. They must be getting paid or something because anything higher than a 1, maybeeee a 2 (and that's a big maybe), is absolutely ridiculous. Trash x287374839283893 is the best description I can give of this garbage movie"}, {"id": 135, "text": "This started okay but went down hill very very quickly. It is quite a low budget movie from what I hear, and this is very apparent in the effects and soundtrack. Continuity is all over the place with repeated large scale fails. There are some big names for an Aussie film, but I can't help thinking this movie is a mistake. It has no redeeming features. Do yourself a favour, unless you appreciate low budget, cheaply made movies with loose plotlines, awful direction and no attention to continuity details."}, {"id": 136, "text": "If this were a comedy, it would be more believable. somebody actually watched this and said everyone needs to see this. it would surely be sad, except you just have to laugh at the idiocy of the execution."}, {"id": 137, "text": "It's interesting to see all the nitwit comments on both extremes over a movie like this, those who are accused of being paid comments or working on the movie versus those who under-rate the movie to bring the rating back to earth.It wasn't ground-breaking by any means, but it wasn't complete garbage either...it certainly doesn't seem like a good use of anyone's time to over-analyze it. The production was decent, the acting was decent, even the first 20 minutes or so wasn't too bad as far as setup. It got a little silly the rest of the way but it was probably a solid 5 or 6 out of 10 overall. I can see the comparison to Red Dawn, plus maybe a little bit of Falling Skies or something like that. And through all of it my main thought was that it was vastly more believable than Bird Box."}, {"id": 138, "text": "How do I get 120 minutes of my life back? Garbage and trash from start to end. Absolutely terrible acting, terrible plot, terrible waste of my time. The only thrilling thing about this movie is that it ends, poor performance from everyone involved, save your time, stare at the wall instead."}, {"id": 139, "text": "This was a nice little sci-fi movie. For its budget I thought the acting was just fine, the special effects very good, and a pretty good story. I'm always a sucker for sci-fi action movies and this one was very satisfying. I would compare the story and action to Battle of Las Angeles, but this one was better. Sure, the ending seemed a little rushed, with an optimistic feel-good ending, but overall I would certainly recommend this movie."}, {"id": 140, "text": "Skip this one. Had this on fast farward and still was hard endure ."}, {"id": 141, "text": "I think there is an urgent need to find a new way to categorize the sci-fi-wanna be movies, just to alert the audience that they are about to waste some of their time on a nonsensical flow of scenes gathered between two titles. Or at least mark good sci-fi movies with some letter, or a sign or something. Please, have some mercy and find us a good solution for these repeated time-wasting traps for they look like they multiply exponentially.This is not a sci-fi movie in any sense. You can call it The Boring Everything But Not Sci Fi movie.ONE by TENNN."}, {"id": 142, "text": "Aliens try to take over the world but meet the Red Dawn type of resistance in rural Australia. The film gives us some background on a group of individuals who are not compatible but somehow come together to fight the invading aliens, just as Reagan would want. (Seriously they open with a Reagan speech on the advantages of invading aliens.) This is a low budget Aussie Independence Day with a female colonel giving a very poor save the world speech. I didn't think the characters were that great. No Will Smith, Randy Quaid, or Patrick Swayze. Guide: f-word. Brief sex. no nudity."}, {"id": 143, "text": "Wanted to like it, but its garbage with a capital CHEESE, and not in a good MST3K riffable way."}, {"id": 144, "text": "Movies about Aliens attacking Earth: 100 Movies about Earth attacking Aliens: 0It is a good movie but the plot has been done to death! Why can't we get a movie with the nations of Earth showing up at a technologically inferior planet and laying waste to it?"}, {"id": 145, "text": "While you could find fault, what I like about this film is it has a great feel to it and an exciting concept. Not a bad start and I'm sure will only get better with each project."}, {"id": 146, "text": "This movie is set in australia and is a must watch!"}, {"id": 147, "text": "What a great movie. Never seen Dan Ewing act in a movie before and something that wasn't Home and Away. He carried this movie through its dark moments and helped those less fortunate. Great support cast and story also."}, {"id": 148, "text": "I'm surprised by how many negative reviews there are regarding this movie and how boring it is.I don't know what movie they were watching as this movie to me was not boring in anyway at all (insert shoulder shrug)If anybody knows how a movie is written and made there's always a start, middle, something epic happens here and then the ending... If movies were all made the same and in Hollywood how boring would life be..."}, {"id": 149, "text": "This film has a good solid story line and recognisable cast."}, {"id": 150, "text": "I was a skeptic at first as the opening scene was slow, but after 20mins the film improved immensely.I can't help but like this movie with the loveable characters and well developed story line.This movie has potential to be bigger and better round two."}, {"id": 151, "text": "Kick arse film I really like the military touch and that it was only a portion of the film it gave the characters a chance to show what they were made of. I love the female characters they were all so interesting and showed so much heart. I can't wait to see the next instalment. A strong 10/10 from me!"}, {"id": 152, "text": "For a small budget Aussie film, the movie punches well above it's weight.Great casting and characters, interesting storyline that is not full of cliches, and excellent special effects make this movie one I'd recommend having seen it myself for the first time (but not the last time) last night.Yes, it's an aliens invade earth movie, but it is sufficiently different (especially the ending and the characters defending earth) to make it one to see."}, {"id": 153, "text": "One of the funniest movie's I've ever seen. Me and my friend laughed all the way through to the bitter end.Thank you Australia! I see an Oscar coming your way!"}, {"id": 154, "text": "If you look through my IMDB reviews in the past, you'd notice that I've never rated a movie '1', EVER! However, this was so horrible that I had to come in here and write this. I have no idea what the heck I watched. All I know is that the earth was invaded by a large AMD Athlon processor looking object, which again looks like crap. The acting was pathetic beyond words. They tried to make it look real with the CGI but again was at utter failure! This movie is nothing short of a joke which no one could even laugh to!For the love of God, please stop doing things that you're not made to do. Maybe all this money spent on a good thriller of family drama story would've saved you all from this catastrophic embarrassment!"}, {"id": 155, "text": "I have seen some crap movies in 40 + years of cinema watching but seldom have I seen such a complete waste of resources as this pile of nonsense. Right from the opening scene it is full of cliched garbage and bereft of a single once of originality. The cast play stereotypical white country bumpkins, with a handful of token Asians thrown in as a poor salute to multiculturalism. The story line is hackneyed and been told countless times previously. The actions scenes are beyond amateurish and enter the ridiculous almost from the first shot fired. The bunch of misfits who escape the initial attack should be in clown uniforms so bad are their combat scenes. For example - aliens attacking from the air with superior firepower and a Mothership the size of a small moon looking down upon all and yet these idiots drive around and into hiding with their vehicle spotlights on full and we are supposed to believe the bad guys don't notice? And it gets far worse! The Commander of the Australian Army troops is a woman wearing a uniform that is so ill-fitting and nothing like an actual Aus Army uniform and who has all the military bearing of an empty box ... and about as believable, poor casting that even stands out in a movie full of poor casting. Direction is sloppy and lacks originality. Little wonder the Australian movie industry is in dire trouble when they produce crap like this. I gave it a one out of sympathy."}, {"id": 156, "text": "I can't recall an Australian movie that embraces action in the way Occupation has done. But beyond being an action flick, I enjoyed that it breaks the mould.  It showcases some of the most genuine Australian landscapes to the world (who, let's face it, still think Australia is filled with Hoges &amp; Irwin types) and combines excellent cinematography with a clout-filled ensemble cast - each of whom are enjoyable and relatable in their own unique ways. The movie is peppered with good comedy to boot."}, {"id": 157, "text": "Loved it! doing the aussies proud with this one. The action scenes are awesome. the alien concepts were so different and refreshing to see. More please!"}, {"id": 158, "text": "There's no cell service. No conditioner. And not enough time for dating. Super advanced alien technology is stupid anyway. But thank God everyone is pretty. Pretty people rule!"}, {"id": 159, "text": "When I watched this film its rating was 6.0; that seems pretty inflated to me.The premise is OK: aliens arrive on Earth to take over, humans are caught by surprise in a small town in Australia where everyone was watching the teams battle on the football field and certainly didn't expect to be battling for their very lives. Some escape, others get rounded up by the aliens for unknown reasons. The reasons remain unknown, all through the film: if anyone knew why the aliens wanted captives, it'd have been nice to tell us.For me the letdowns started fairly early in the film, as I had trouble understanding the relationships between the main characters &amp; what made them tick. There were a lot of characters to keep track of too; it would have helped if there were fewer main characters, since the focus kept changing as we went from one to another. There wasn't much time in the beginning to get to know anyone, it went into action quickly.The acting wasn't terrible, and the actors seemed competent- what let them down was the script and the direction. The script says, drive away from the battlefield with headlights on, right down the highway; good thing the aliens are too stupid to have expected that, and apparently couldn't see them go. Any number of times people did things which seemed really peculiar for people facing the end of the world; again, the script could've used a lot of improvement. So many plot holes that made me groan could easily have been avoided.The CGI wasn't too bad, for a low budget film it was better than expected; but there were a lot of places I expected to see things but didn't. We saw a nice looking CGI starship, but when one got destroyed all we saw was the actors presumably looking at it being destroyed. There were any number of scenes where suddenly we went from an action film to a daytime soapie, and it wasn't just the women who were emoting all over the place, sometimes for nothing that I could fathom. This film wasn't really bad, it just irritates me that it could have been so very much better with a more polished script and a better director. All I can honestly give it is a four out of 10: 4/10."}, {"id": 160, "text": "Basically feel like parts of a low budget series TV glued together with an overwhelming epic movie soundtrack."}, {"id": 161, "text": "As a kid I would earn a few bob from mum and dad by doing some odd jobs around the place and then Saturday arvo it was a long hike up the track to the local picture theatre. What joy and pure excitement it was to watch a good Aussie matinee with Aussie actors. Very rare that was to become later with Hollywood knocking at our theatres doors. The picture theatre is about entertainment and enjoyment sitting with ya mates sharing a box of popcorn and just relaxin without a care in the world. And with that in mind this aussie picture ' OCCUPATION ' has it all - drama, excitement, bad guys, good guys, fast moving action, and silly stuff to have a bit of a giggle with. It gives just what ya need for a bit of fun entrainment. A great film written directed and produced by beaut people using lots of local Aussie actors and ya know what's best of all !, it's just great fun to watch."}, {"id": 162, "text": "A classic Australian sci-fi film, as good as Mad Max and the Time Guardian. Luke Sparke should be congratulated for such a great film. The cast were a great Aussie / Kiwi cast and the film had me on the edge of my seat until the end of the film (no spoilers but the final part of the film in Sydney was great).I was lucky enough to see the film in Melbourne, where only two cinema's in the whole of Melbourne were showing the film. There should be more done to support the Australian Film Industry, it would great if more main stream cinemas showed Occupation and allow for Australian films to be shown to a mass audience. The great news is that Occupation 2 has been announced, I cannot wait."}, {"id": 163, "text": "I made it through both iterations of Red Dawn, but after fast forwarding through much of the first 3/4s of this film, I found myself unintentionally laughing out loud at things that were supposed to be serious. I couldn't repeat that feat (the Red Dawn thing) with this miserable excuse for an alien occupation film. This movie instantly qualifies as a candidate for Mystery Science Theater. What a train wreck."}, {"id": 164, "text": "24 minutes it s all i could take...do not waste your time watching this...you have been warned"}, {"id": 165, "text": "What a surprising gem! Great cast. Fantastic characters. Script was clever. Loved that it didn't reduce the characters to foul mouthed bogans. Special effects were really good. I would go and see it again for sure. Looking forward to the sequel."}, {"id": 166, "text": "Waste of Time! do you wake up a person in a coma with a bucket of WATER??? Wasted my Saturday night with this Movie!"}, {"id": 167, "text": "Look guys, once you decide to make a movie on $100.000 you have to get the genre right. We have seen some top movies on low budget, but if you decide to have a single explosion on it and waste all the money... well it's a waste of time. DO NOT WATCH BRAIN CELLS WILL DIE!!! all the top rewievs are made by proud Australians."}, {"id": 168, "text": "I slept while watching this movie, and after 5 try I finally completed it. Bad movie, but atleast I get good sleep."}, {"id": 169, "text": "Managed to watch until the end, but O.M.G. it took some willpower. First 20 minutes I thought ok, we'll see where it goes from here. Then ..... A highlights section, an eight month jump, and no discernible plot path. Just a load of slow motion running, and pyrotechnics. If they spent as much money on acting lessons as they did on explosives it may have salvaged a tiny bit of credibility. It honestly felt like it was originally made to be a pilot mini-series, but someone cut it into a 2 hour movie. No character or plot progression, just a jumble of badly edited scenes stuck together. Oh and some of the reviews on here are just stand out. The cast and crew must have spent ages trying to think of positive things to write."}, {"id": 170, "text": "Awful attempt to make an Aussie Red Dawn movie substituting Russians/ Koreans with aliens and American Football with Aussie rules footy. Just terrible all-around."}, {"id": 171, "text": "Occupation (2018) is a sci-fi film replete with every bad B-grade element and trope you could imagine. I found myself frequently alternating between cringing, wincing and laughing hysterically. The film was in no way helped by an inane script. The idiotic narration at the start ought to have been warning enough for what would follow. Being an aussie, I'd just like to say that this film is in no way representative!"}, {"id": 172, "text": "Even if australia gave birth to mad max this movie is questionable. Actors good no shame on them. But it got a certain jenesaisquoi... So bring some good xxxx, company and beers and all be good."}, {"id": 173, "text": "Can't seem to understand all the good reviews. But I am glad to see the rating dropping by people telling the truth about this film. Do yourself a favor and DO NOT WATCH."}, {"id": 174, "text": "Don't waste 2 hours of your life on this movie. Watching paint dry is more satisfying."}, {"id": 175, "text": "Only made it through 20 minutes. Reminded me of those terrible movies you'd occasionally see on the syfi channel."}, {"id": 176, "text": "I thought the story and acting were OK (just OK) but man the alien costumes looked really hokey."}, {"id": 177, "text": "The plot used if twisted a bit could have been fantastic, along with the cinematography.Some of the scenes were so weak that its impossible to digest.Especially the beginning of the story or scene, its pathetic.Actors tried hard but the plot was very weak."}, {"id": 178, "text": "Cheesy Aussy Independence Day, with terrible acting, props, makeup and costumes resembling some cult flicks from the 70's &amp; 80's, I felt so embarrassed watching this when my friend walked in. It's terrible, do not watch. It's just so bad."}, {"id": 179, "text": "Well, where to start. Nice idea, but really poor movie. Bad actors, really bad costumes and sadly bad directing. It has some bright moment but they are spoiled by next nonsence scene. And in the and I know you invade us and try to kill all humanity. But can we be friends and live hapilly togather? Really? come on."}, {"id": 180, "text": "This kind of movie should left to the EXPERTS in Hollywood, I considered this to be a really bad version of a futurist RED DAWN. The acting was only passable. Story line could have been a lot better, maybe George Miller should have written and Directed the movie. All the way through watching the movie I was thinking what a load CRAP, but I kept watching hoping it would et better, but it didn't. Even the ending was absolute B.S. what more can I say???"}, {"id": 181, "text": "On the get go, I thought this could be the Aussie movie that will out shine its predecessors like Mad Max or Priscilla as far as originality is concerned. Where do I start? The minute that pop music hit the screen, it was game over for me. Add to that scenes where the actors clearly do not know what they are doing. like standing around doing nothing in the background. The two stars are for the decent special efx (despite its budget) and some fair editing. For the people who sat through this mess all the way, you are a sucker for punishment."}, {"id": 182, "text": "Very disappointment after 30 minutes from the movie i felt so bad every things is bad truly waste of time"}, {"id": 183, "text": "Trust me, save your 2 hours. don't go by those paid high reviews and ratings"}, {"id": 184, "text": "Save this valuable 2 hrs for something else. I don't even wanna waste time to write more."}, {"id": 185, "text": "A word about how highly it is rated here as well as by the Audience Score on RottenTomatoes: It seems most of those ratings have come from Aussie viewers, and hailing from India I completely empathise with the feeling of relief and even joy when our homegrown film industry actually produces something enjoyable. But, unfortunately, this film simply was NOT!!! It was tired and full of cliches, filled with irritating characters and riddled with gaping holes in the plot, and simply went on for far, far too long. Too many subplots, and hardly any of the various story arcs involving the numerous main characters reaches a satisfactory conclusion. I've seen small filmmakers aspire to much greater on much tighter budgets and create much better fare. Two stars for the effort and, sorry Aussies, but even that is being generous."}, {"id": 186, "text": "While not a bad movie. It does have it's cringe moment's. It carries the story well. Even if it looks like a cross between Independence Day and Fallen Skies( TV Series). Granted that Australia is finding it's feet making movies. Besides. It's good enough to have a sequel in the works. Slated for 2021. So go into it with an open mind and enjoy."}, {"id": 187, "text": "It's light and fun. This movie is exactly what you expect it to be and then some!"}, {"id": 188, "text": "When I first saw the trailer I wasn't 100% as trailers always have a way of making films appear better than what they are (sometimes)...Then when I watched this movie it was an absolute blast. It combines reality with incredible VFX into one big exciting adventure."}, {"id": 189, "text": "It's honestly a great movie with some of the best VFX I've seen. It's perfectly constructed together together from start to finish."}, {"id": 190, "text": "It was a very full on movie and with lots happening. Very in your face, but that's how I like it!"}, {"id": 191, "text": "I wasn't a huge fan of some of the actors in the film as they wouldn't of been my first choice but saying that the rest of the movie was good."}, {"id": 192, "text": "I feel like the VFX in this film and the lens flare need a category of their own for how awesome they are! This movie is on par with some of the more well known Hollywood films. There is hope for the Australian film market yet."}, {"id": 193, "text": "I've always believed we weren't alone and this movie feeds my wild and vivid imagination. I believe one day we will be occupied and that we won't be alone anymore. Only time will tell..."}, {"id": 194, "text": "What an awesome movie! Might be a low budget feature film, but it's highly entertaining and worth every minute of my time"}, {"id": 195, "text": "Great action feature film with exceptional talent. Best two hours of my life!"}, {"id": 196, "text": "Not as good as the movie alien but a close second. The alien costumes don't look fake and horrible like some low budget creature feature films do."}, {"id": 197, "text": "Awesome movie!!! The action scenes are super intense and had me on the edge of my seat the whole time. This is what the Sparke film team is known for and that's action films! They killed it"}, {"id": 198, "text": "A mate at work recommended I watch this movie as they just watched the sequel at the advance screening and said it was awesome.It's a good watch and nothing like you expect. I promise you won't fall asleep, or hate it.Now I'm excited to see what happens next when I get to see the sequel myself end of year as I've heard it's even better than this one..."}, {"id": 199, "text": "This movie is the exception to Australian movies and what they stand for (usually). It's well written, directed and produced. My favourite scene was the pregnancy scene as it was intense and in the moment. Being a mother myself I can only imagine what it would of been like having to give birth in the middle of an alien invasion... Check it out if you haven't already! It's a decent film and one worth writing a review about."}, {"id": 200, "text": "Occupation was a great film. It's the film that has something for everybody. Good acting, great dialogue and plenty of interesting scenery."}, {"id": 201, "text": "This movie gives me strength! Definitely inspiring in the way that you don't have to be a superhero to kick alien butt! Australian movie with an American feel to it. Throughly enjoyed it. Bring on round 2 :)"}, {"id": 202, "text": "Really great film. Makes me wonder what life would be life if we were to get invaded. Maybe it would be something like this film, maybe it won't be. One can only hope that if aliens did exist - that this is what they'd look like otherwise I may never sleep again if it was something extra...Also should mention the epic battle scenes between the two worlds are awesome.The Sparkefilm team really do know how to shoot an action film. Love the gun noise and Camo used well as it helped make the scenes feel more real."}, {"id": 203, "text": "You're my hero in this film. I definitely fan girled over his bad boy character and sex appeal. He's come along since home and away. Good film too and I enjoyed the ending."}, {"id": 204, "text": "To enjoy the full effects of this movie you need to watch it from the start and really pay attention to the smaller details for maximum enjoyment. Where do I start - loved the wardrobe. Also the way it was shot. The Aussie Banter. Composed music. And look forward to seeing what's next."}, {"id": 205, "text": "This movie was included in our movie marathon tonight as our sci-fi feature and I loved it! Wasn't in anyway cheesy, unwatchable, or just straight up terrible! Will definitely be doing a more in depth review on my pod cast tomorrow as our drama feature film is about to start. I look forward to the sequel."}, {"id": 206, "text": "I watched this again tonight after watching the sequel recently and can I first say who reviews a film bad, but randomly says music is fine? Obviously somebody who has beef, or who is jealous of the success of this film given the low budget.This film is a classic and an original.I will say the second one is nothing like you'd expect and next level! I truly have no words other than if you didn't get to attend the advance screening the rain is coming!! The VFX is unreal and the sequel is full of action for all those complaining about lack of it in Occupation 1.Both films are good in their own way and very different. So please don't compare one to the other until like me you've seen both."}, {"id": 207, "text": "This for me is the movie of all movies. And Red Billabong coming in a close second. It's the small things like choosing to use the lens flare to give the film character, the costume design so beautifully mastered, incorporating the Aussie slang, carefully picked choice of characters and stunning locations. Well done!"}, {"id": 208, "text": "I've seen many alien films and this one is definitely one of the better ones. It isn't cheesy, over the top, scary, or a complete waste of time. CGI is really on point too. If you're also an alien fan and everything alien related - this is right up your alley."}, {"id": 209, "text": "A film that knows how to make a statement! Like a smack to the face. Good things come to those that wait and this movie was exceptional. I can't believe I didn't watch it sooner. It re-writes how Australian movies should be made and never got me so excited for wanting to see more."}, {"id": 210, "text": "This movie has assembled quite the cast and is definitely a movie worth talking about. I loved the fun action-packed scenes to the building of relationships between complete strangers who have to work together in order to survive the unknown."}, {"id": 211, "text": "Can't wait to see more in the sequel tomorrow night!!! The quality is out of this world (literally) hahaha."}, {"id": 212, "text": "It is sooooo good! Could possibly be one of the best ever in the Sci-fi Genre in our neck of the woods. Luke Sparke is the man!! He's a fantastic director and writer. I truly love his work. Can't wait to see more :)"}, {"id": 213, "text": "Loved the explosions, fight sequence, star wars element, composed music and can't wait to see the sequel this Friday! #bringtherain"}, {"id": 214, "text": "Occupation is a nice surprise from the dramas I'd usually watch. I'm not really a fan of action movies in general as I find them difficult to watch and keep up with. This movie was easy viewing and a nice change. It's even got some drama in it too. Win/Win for me."}, {"id": 215, "text": "This film makes me proud to see Australian films giving it back to the Hollywood heavy weights. Not all big blockbusters are made in Hollywood and it's good to see people finally acknowledging that and supporting their own.Most Australian films cop so much slack for being terrible and most don't get get watched due to expectations.This film is worth watching as you will enjoy it and it is one of the best Australian films due to its creativity, outstanding costumes, VFX and well picked cast. Also, the directors passion, experience and knowledge of working on many war action films over the years definitely shows in the close combat action scenes, the scene dressing and scene set up.I'm excited for the future of Australian film and can't wait to see what 2021 brings."}, {"id": 216, "text": "First off, I must of been watching a different movie to some people as I watched this movie and FKN loved it!! Secondly, no movie is not 100% perfect just as people and life. Why judge so hard? Thirdly, put your money where your mouth is and if you think you can make a better film than DO IT!!! If you have nothing nice to say than say nothing. As this was the best two hours of my life I've had in a long time."}, {"id": 217, "text": "So many people have written reviews on this movie some good and some bad, but I liked it. I'm not going to go into details about the plot, casting, or acting - I'm merely saying I watched it for the first time last time and enjoyed it. I watched it for what it was like I do with all movies and based my own views rather than being persuaded by other views. You should do the same :)"}, {"id": 218, "text": "Close combat action scenes in small spaces. And if parr's feels like you're in a third person view or a video game. The story line is in the title really, I don't need to say more. If you're also a fan of action films this will be right up your alley."}, {"id": 219, "text": "Huge Dan Ewing fan after watching him in Home and Away! He definitely stepped up and played his part good I thought. Nice change for him after being on a tv show. Good movie. Would watch again."}, {"id": 220, "text": "Really enjoyed watching this movie as it's better than I expected it to be. Proof that you shouldn't judge a book by its cover. Thumbs up from me :)"}, {"id": 221, "text": "The lens flare in this movie remind me of Transformers. The weaponry reminds me of Star Wars. And the motor home reminds me of the Walking Dead. And the aliens look awesome!!! All my favourite things rolled into a movie.."}, {"id": 222, "text": "A movie about aliens and super cute little baby aliens that are just seeking a place to call home. And man kind must decide if they are willing to fight, play neighbours, or run... Check it out for yourself. Oh, and did I mention the super cute baby aliens?"}, {"id": 223, "text": "Watching this movie I really felt I learnt some basic survival skills from the military training at the beginning. Was inspiring and something I can definitely take away from this movie."}, {"id": 224, "text": "Best movie I've seen during covid! Not many movies are currently being released and the new releases are just rubbish - so was pleased to find this on Netflix today. I enjoyed it so much I watched it twice and was even better the second time."}, {"id": 225, "text": "The AFL scene where the alien space craft invades with the intense background music is my favourite scene of the movie.It sets up the story and creates fear. The rest is history after that, haha."}, {"id": 226, "text": "If you watch other sci-fi movies in the same genre it's not as good, but saying that they're made in Hollywood and with a bigger budget. This film isn't as good as some people have made it out to be, but saying that if you're into this genre you should check it out as you'll probably dig it."}, {"id": 227, "text": "Thoroughly enjoyed from start to finish and I don't say that lightly about Australian movies in general. I'm not going to give away any spoilers, but I will say it's worth a watch and you can thank me later :)"}, {"id": 228, "text": "The costumes were exceptional and well designed and thought out for this movie. The costume department definitely shined for me most in this film. From the spectators in the grand stand, to the alien suits and the soldiers. Bloody brilliant!!!"}, {"id": 229, "text": "Some parts were better than others, but that's to be expected being an Australian film and sci-fi movie in general. I overall enjoyed it and thought it was good to watch."}, {"id": 230, "text": "Would have been great if some of the cast had been replaced with better Australian actors, but beggars can't be choosers especially on a low budget action film."}, {"id": 231, "text": "Some of the best alien suits I've seen used in Australian sci-fi films and sci-fi films in general. They don't look terrible and actually like very real life. Well done :)"}, {"id": 232, "text": "I'm finding it extremely hard to find anything about this movie that I don't like. The action is well choreographed, the story line and setup is surprisingly emotional for an action sci-fi film. If you love action, or even just like it - you'll be in for the ride of your life!"}, {"id": 233, "text": "The war scenes in this film are so beautifully shot that I feel as though I am right there beside them fighting, surviving and giving it my all! F-yes!!!"}, {"id": 234, "text": "Finally a breath of fresh air! Something worth watching and making a review about.I wouldn't say you could watch this as a family movie due to the aliens possibly causing nightmares, but you can definitely watch it with friends, popcorn and enjoy.It has something for everybody and gives me faith in the Australian movie industry again."}, {"id": 235, "text": "Watched it tonight and would watch it again. In my Netflix top 10 :)"}, {"id": 236, "text": "It's not bad, but not great either. I don't ge all the 10s and 1s - everything doesn't have to that polarized.It has decent acting, a somewhat typical story and reasonably good effects. It's WAY better than 99% of the crap SciFy channel puts out."}, {"id": 237, "text": "This is a decent film. I went into this film not expecting much, but I was disappointed when the movie was over. This film has opened my eyes to Australian films and what they can be. Highly recommend if you haven't had a chance to view it yourself yet."}, {"id": 238, "text": "Thought this movie was pretty good it definitely compares with some of the other sci fi films out there that were made on a bigger budget.We're definitely starting to see there is a talent pool there for us to continue making our own movies."}, {"id": 239, "text": "Had a good laugh at this film very Australian story and loved the afl being involved - more like this please."}, {"id": 240, "text": "This film gets better with age. Just hang in there and it gets better I promise ;) Bring on the sequel in two weeks."}, {"id": 241, "text": "The weapons in this film are heaps cool. Some of them shoot laser beams just like in Star Wars! And being a HUGE Star Wars fan myself, I bet the director and writers are also. I want my own alien weaponry for keep sakes :)"}, {"id": 242, "text": "Do yourself a favour and watch it for yourself without influence. I did as I heard there's a sequel coming out end of this month and glad I didn't give into the hate train...I appreciated the film for what it was and that was awesome! Yes, it starts off slow, but that's what I call a build up and story telling at its finest. You watch a movie as it's telling a story. If you want to watch a video game than go play one! This movie is exactly what it needs to be and that's a fun action packed Aussie sci-fi. I can't fault it and would watch again."}, {"id": 243, "text": "This action movie should be an essential on your go to movie night! It's Star Wars x alien x home and away (in a good way)!!! Never thought I'd enjoy such a combination of movies made into one. What a day to be alive!"}, {"id": 244, "text": "A world without people that's taken over by aliens. That's what would of happened if these crazy Aussie's didn't try to stop the invasion... How scary would that of been!"}, {"id": 245, "text": "Bloody unreal... I've never seen anything like it before."}, {"id": 246, "text": "A HUGE fan! Enjoyed every moment of this movie. I couldn't fault it at all and look forward to seeing the next one soon."}, {"id": 247, "text": "Fight for your life, or be defeated! The fight to save man kind begins now... Are you in, or out? I know I'm in! The beginning is now (saves in loud scary dominant voice)"}, {"id": 248, "text": "Did anybody mention the weapons in this movie yet and how awesome they are! From the details, design, colours and how some shoot laser beams! Get out of this world... I want more :)"}, {"id": 249, "text": "Sh** gets real! And everybody gets on their phones haha. That's so real life and totally what I'd do too if there were ever an alien invasion."}, {"id": 250, "text": "Felix is the man! His dialogue is very funny and suiting to his character and as a person in general."}, {"id": 251, "text": "Loveeeeee it! Reminds of the transformers movie when I'm watching it."}, {"id": 252, "text": "Finally, an Australian movie that isn't terrible and a complete waste of my time! There's hope for our country yet."}, {"id": 253, "text": "I watched this last night on Netflix and the scene at the football scene when the alien ship comes out over the people and field... The sound at the moment and the reactions of the crowd was intense and only the start of what was about to come.... It's a 10 from me."}, {"id": 254, "text": "Just like most things in life people don't appreciate the small things. This film maybe small compared to some, but it packs a punch."}, {"id": 255, "text": "Lot of fun movie as you don't need to take it too seriously and very easy to watch."}, {"id": 256, "text": "The performances captivated me throughout this movie from the beginning to the end. It's beautifully scripted and one of the better sci-fi films I've seen on Netflix."}, {"id": 257, "text": "It stars all my favourite Aussie actors. The costumes look killer too!"}, {"id": 258, "text": "This film was unreal in many levels. From the script writing, costumes, special effects, scenery and editing."}, {"id": 259, "text": "This movie makes me want to go create a call of duty alien version video game. It's fun and stimulating."}, {"id": 260, "text": "My husband put this on last night as he heard there's a sequel coming out and we were both pleasantly surprised. In the opening act we weren't sure whether to turn it off, or let it play out and I'm glad we did as it was terrific! Now we know why everybody is talking about the sequel."}, {"id": 261, "text": "Sometimes in life you have to make sacrifices in order to survive and this film is exactly that!"}, {"id": 262, "text": "How can you not enjoy this! It's a laugh - the type you can't stop watching as it's highly amusing."}, {"id": 263, "text": "Every now and then I'll scroll Netflix looking for a new film to grab my attention and this was it. It kept my attention and I was very entertained."}, {"id": 264, "text": "I thought the film was overall very well put together. Great storyline and cast performance."}, {"id": 265, "text": "I watched the first two seasons and mostly enjoyed them. Now i am starting the third. Already in the first episode I am confused. Don't make a thriller based on some obscure legal technicality. Seriously the Russians were controlling the country. And now the parliament is charged with treason? It was clear the parliament wasn't in control. Honestly this show is probably better as a study of the Norwegian psyche: imagining itself as stronger and more interesting than it is. I wonder if I have to go back and binge watch the first two seasons to try and justify this story line. The only interesting parts are the stories about the people who cooperated and why. That part is interesting.I wasn't actually shocked to see that this show has a 5 on imdb."}, {"id": 266, "text": "Granted this is not a great movie. I would say a cheesy B movie. I can tell their budget was low to make this movie. I think it is not as bad as some are saying. I do have to state I was entertained. Take a chance, you just might be entertained too."}, {"id": 267, "text": "A thousand shots and people still running? Give me a rifle and each shot would count! petrol tins explosions, Alien weapons, rifle taken from one person in some cane field and where did all the ammo for it come from? I didn't know it was Aussie until I saw the Stop sign. I wish we don't waste our time trying to make these types of movies! It reminded me of several TV shows which had a short span dealing with the same, motorhome, nuclear family, and some ragtags and after 8 months of fighting a superior race they manage to survive till the end? And who gave the Asian woman the authority to make a deal with the Aliens and invite them to share Planet Earth???? We have enough problems with human immigration/integration as it is now! If you want to see how bad we are at making Sci Fi, then watch it and waste your time...."}, {"id": 268, "text": "Corny and grievously long with dragged out scenes developing a B version of the rag-tag- resistance-against-alien-invasion storyline. The armor-wearing E.T.s were of course humanoid with big ships and big guns, and the humans were typically in idiotic disarray which seemed to be the main point of the film as annoying take after take showed otherwise unnecessary over-emoting. The sceenplay itself was often irksome, with slow motion, cheek-shaking close-ups of running into gun fire to show gritty determination, but also good eye make-up for the lead battle chick, who makes a captain Kirk speech to treaty with the invaders' representative who was wearing a three fingered glove along with stock man-from-mars halloween mask. Admittedly, I watched it in only 2 viewings, and never fast-forwarded. It can be an acceptible diversion if you don't pay attention to it too closely and keep it on low volume."}, {"id": 269, "text": "Unnecessary and loud. Scene and plot are not connected. Too much heroic slur. Cringy. I'm cold, sleepy, hungry, and shiver most of the movie which is bad."}, {"id": 270, "text": "As an Australian myself pretty disappointed about this. Was looking forward to seeing an alien high budget film with Australian accents. Instead all those elements fell apart. It was poorly written with bad acting most of the way (with some exceptions such as Temeura)"}, {"id": 271, "text": "Where do I start The cast is amazing the effects are amazing the story is gripping and pulls you in and the special affects and sound are just awesome. Its great to see an Aussie director stepping outside the box and making such a classic takes me back to when movies were not so one dimensional and safe. This is a great movie with great action and a great cast well done to Luke Sparke and all involved."}, {"id": 272, "text": "A must see! Full of action and a great story! Never a dull moment"}, {"id": 273, "text": "Sounds like a rip off of 'Tomorrow when the war began' which coincidently (or not) is also set in Australia."}, {"id": 274, "text": "I have no idea why everyone Hates this movie?? is it the Fact that Hollywood did not make it??????? i for one Loved this Movie and hope they make a second movie. the movie is not Slow it has a great story line. Man people that hate this video Can go Jump off a Cliff. i for one Loved this movie Great Job you Guys I Loved Occupation...."}, {"id": 275, "text": "I really wanted to like this, and as an Australian I know we can really make some great movies.  This is not one of them.  In fact I actually feel the need to apologise publically for this movie and I didn't even have anything to do with its production, distribution or creation. I'm sorry. Please forgive us. Can we just rewind back to Mad Max Fury Road and forget this ever happened? How can anyone actually finish editing this steaming pile and look back and think to themselves Job well done!? My heart started sinking when the football team started throwing chunks of wood at the aliens who were advancing firing their (incredibly poorly aimed) lazers. My wife bailed out when the alien bear hugged the fellow through the house wall. I ground my way through at least another half hour before I too succumbed to the black hole of ennui this film excruciatingly leads towards. Temura, Jacqueline, and that short bald dude who is in every other aussie film, I mourn for you."}, {"id": 276, "text": "I love cheesy movies but wow this one didn't keep me going . The acting was even more horrible then usual. And about the only thing that kept me invested was I felt I had to see if it was going to get worse . The whole only a small town and hmm apparently the rest of the world didn't exist kinda became stupid . Still don't have any idea where the name for this movie came from ."}, {"id": 277, "text": "This is just a very long and slow episode of Home and Away with budget Aliens. Don't waste your time."}, {"id": 278, "text": "Small budget movies can sometimes be hit and miss but this one is very hit. Feels like Red Dawn meets Battlefield LA with a dash of Tomorrow When the war Began. The story is not amazingly original but well cast, well shot and well if somewhat over dramatically acted at times. Special efffects are amazingly good on the budget and hold up to the above mentioned movies for the most part as well.   Would recommend"}, {"id": 279, "text": "This is a wild joyride almost from the word go, with big action sequences and plenty of Sci-fi tropes woven in. The best part however is the character development, which really involves you in the narrative and has you rooting for the ensemble cast by the big end set pieces. There's a welcome gentleness to the familial and romantic ties that offsets the violence of the Alien vs human battles. Well worth a look."}, {"id": 280, "text": "I've been following this production for a long time and finally traveled across town to see it.What an epic. Yes, the film makers didn't have all the money in the world, but what they pulled off is amazing and really made me question what is achievable in this country. Well done to the producers."}, {"id": 281, "text": "I am usually very pedantic about aussie movies especially syfy but this movie is just fun from beginning to end. The characters have great arcs &amp; the story keeps moving. The special effects are awesome considering the supposed budget I read they had. The aliens yes probably the weakest but not bad at all. Anyone who is attacking the Director/Writer in these reviews it's plane to see is just has sour grapes because they can't do what he has done. Australia &amp; it's tall poppy syndrome you wonder why aussie films aren't given a go!Well done to all the cast &amp; crew my family loved it &amp; would travel the hour distance to watch it again. Can't wait for DVD release."}, {"id": 282, "text": "Honestly you would think this was an old B-rated movie. But you would be very mistaken. This is some true Aussie humor at its best. From the over sized costumes to the people running in place. I would have to say if you can take the time and have a laugh it is worth."}, {"id": 283, "text": "I saw the movie in Brisbane with my friend who has a modest part in the movie playing Helen Chambers mother to two of the main characters. Not long into the movie the action starts and it only escalated from when the aliens attack the local charity football match. It doesn't take long before you see the characters tie in together linked in a united resistance. The alien costumes/makeup is excellent the storyline, special effects full of laser fire, explosions, ground fire, aerial combat all tied in together with a few sarcastic comments keeps you on the edge of the seat I am definitely going to see it again and look forward to one day it being turned into a series each one getting better than the last."}, {"id": 284, "text": "My opinion of Occupation it made me cry as this is why not only was the movie fantastic. It is very patriotic to me and you all did a fantastic movie of your making this into a trilogy I would so buy the set thank you so much."}, {"id": 285, "text": "Great characters, actions, visual and sound effects. Much heart and effort into the sci-fi film. A fresh one without the same old stories and plots of Hollywood films nowadays."}, {"id": 286, "text": "A great effort i thoroughly enjoyed this film that i saw it 2 times in 24 hours. The characters were so relatable and interesting.I love Rhiannon Fish so having her instantly made the movie good. The female roles in general were well crafted.You could definitely tell that the Director was really trying to not do a run of the mill film. The action sequences are epic, the escape from town had me on the edge of my seat the whole time. Well done to everyone involved.. i cant wait to see the next installment."}, {"id": 287, "text": "Well who ever it was, it was a total wastenof money. This is maybe among the worst I ever seen. It's not even a B-movie. It's more like a bad joke. Don't waste your time with this so called movie."}, {"id": 288, "text": "This is an Australian movie and I really enjoyed it. Thought it wouldn't be good but was wrong. 5 stars from me."}, {"id": 289, "text": "Usually we make mostly comedies or dramas, but finally we got a sci-fi masterpiece on par with Hollywood's best. I really like this movie and I can't recommend it highly enough. A sequel is currently in production. I can't wait!"}, {"id": 290, "text": "This movie seems to have been made by school teenager students for a school project. It´s that bad. Terrible. Skip it."}, {"id": 291, "text": "Have not laughed so hard in a long time. And this movie is not a comedy. Acting and writing are absolutely terrible. But the music is the only good thing about it."}, {"id": 292, "text": "Just horrible and could not finish it. Ridiculous plot, bad script, laughable special effects. Actually wasted 35 minutes of my life before turning it off. Don't make my mistake and waste even 1 minute on this!"}, {"id": 293, "text": "Meh. At first it was a little bit willing but after like 20 minutes it became just another trash. Very boring,stupid plot film about aliens. And it's almost 2 hours length... why? Just another thing that a little bothers me. Why so many 2018 movies have Chinese actors... It's okay... I'm not saying that they can't act. But still there was a year when there were not enough black people now this year is not enough of Chinese people in films? I hate those quotas."}, {"id": 294, "text": "Please don't waste your time on this... So cheap and lowbuget..."}, {"id": 295, "text": "First of all: This is a total remake of Red Dawn but with aliens instead of russians. Good: Sfx is very good. Actually very good. Bad: Everything else. This movie feels like a 10 episode series rushed down to a two hours movie. You don't get to know the characters so basically you don't care what happens with any of them. I love Australian and New Zealand movies but this is one of the worst I've seen. Sorry, but you're better off watching Red Dawn (the original, not the remake) or the TV-series Tomorrow when the war began."}, {"id": 296, "text": "The movie mostly sucks...and it has a big buget.. The ending is good... But when i heard the army saying they heard about a group of resistance in the woods that got THE F..ING ARMY to keep fighting, moraly , whaaaat...OOOOMMMGGGG. Strugle to see it to the end. Great credits song thaugh."}, {"id": 297, "text": "I really didn't fancy this but with nothing else to watch what else could I do? . It seemed to be a rip off of Independnce Day and Falling Skies. It tried to deliver the alien invasion of Independance Day but failed due to the low budget but really pulled off the down to earth gritty resistance of falling skies. The first 15 minutes seemed to drag and the last 20 minutes were full of cliches but for the main it was a bloody good watch.I definitely wasn't dissapointed."}, {"id": 298, "text": "Just imagine if the cast of home and away just put on rubber masks and pretended to be aliens. This movie is made up of neighbors and home and away actors, and the acting, script and budget is about the same as a standard episode. Don't waste your time"}, {"id": 299, "text": "I watched 1 hour of this movie, and... i couldn't go further; But i feel i have to be fair, the alien costumes was nice. I still had the feeling it was just some crew guys with a costume, but still they looked nice."}, {"id": 300, "text": "It does have a few interesting moments but all in all a bad movie. Aliens in costumes, bad acting, huge plotholes.  B movie material."}, {"id": 301, "text": "I watched this at work, so I got paid to watch it and I still feel like I wasted money on it. Bad acting. Really bad plot and a weak ass ending."}, {"id": 302, "text": "Why did this get a green light? The actors are doing the best they can with the material they are given, so it's not their fault. The script, the story, the cinematography - if this was a high school film project it would barely get a pass.  It has so much potential, so many ways this could have been a top flight franchise, but they somehow managed to pull a fail from what should have been a success."}, {"id": 303, "text": "THRILL RIDE!  That's what your in store for with this Action Film from Visionary Director Luke Sparke. Film gives you Action that you haven't seen in recent years with them been done for real and done with practical affects. Luke's writing really makes you invested in the characters and their journeys and every character has their own unique journey. BRILLAINT ACTION FILM &amp; One of the best films I and you will see all year ! Sci-Fi genre has been reinvented by Australians!  We can do Awesome Films!! Bring On OCCUPATION 2!!!!"}, {"id": 304, "text": "Wow. I laughed everytime I saw a scene from this movie that was almost a direct recut from another much better movie. To name a few....The Postman (slightly better) Patriot Red Dawn Battlefield Earth (still better) PredatorActing wasnt horrible but not good. Special effects were from the 80s. Script as stated.....mix of previously used scripts. Definitely NOT a 5 or 6 star movie bu any means."}, {"id": 305, "text": "The trailer made it seems like this could be pretty good. I even rented it. I am a very forgiving movie fan. I am also a Sci-Fi fan since the 70's. I even liked Return of the Jedi. I had high hopes for this and they were dashed after the first 15 minutes. With over-used tropes from big city girl out of her element, to the Hyper-testosterone Jock's that play pivotal roles in this catastrophe, everyone was a cardboard character. The aliens looked pretty good, and they could have done something with the subplot of a heterogeneous alien culture where even aliens have different motivations including not wanting to invade. Unfortunately, this played out so poorly I was shocked. There is so much blame to go around, I don't know where to start. The writing was aweful, the character's behavior was laughably bizarre. It seemed like a high-school student wrote the dialogue. The directing seemed to be more focused on the settings than the story. Anyways...Don't watch this. Give yourself the gift of time and watch anything else. Well, except for Howard the Duck."}, {"id": 306, "text": "Although undeserved, I'm giving 3 points just because they tried a sci-fi and it is very hard to pull"}, {"id": 307, "text": "2 stars for decent acting and cinematography but zerooo for the story, directing and SFX.Feel bad for the actors"}, {"id": 308, "text": "Cornier than a tourism ad. But almost bad enough to be funny. I'm sad actually because I really want the Australian movie industry to create more films in this genre instead of the usual colonial Australiana flicks"}, {"id": 309, "text": "The story is ok as i like alien movies but this flick broke the spell of aliens for me.... everything about this movie was extremely, disastrously BAD."}, {"id": 310, "text": "Sooooo bad it has cult classic written all over it. This movie will make a great drinking game if you go on every cliche and continuity error. It truly is the train wreck you can't stop watching. Having said that, I can't wait for the follow up, for the same reason! Be one of the first to watch before it gets recognised!!!!!"}, {"id": 311, "text": "I loved Temuera Morrison in this movie. His character took me by surprise after seeing him in Once for Warriors.Great casting overall! It's a thumbs up from me :)"}, {"id": 312, "text": "Who doesn't love aliens, handsome men, guns, adventure and romance! This film has it all!!!"}, {"id": 313, "text": "This film really doesn't get enough appreciation for what it is. Me and my wife throughly enjoyed watching it on Netflix and really appreciate that fact that it's Australian made.I'm tired of watching the same old boring Hollywood blockbusters when sci-fi action packed movies like this are being made in our own backyard!Anybody who has judged this film so poorly - I'd like to see you do better with zero funding from Screen Queensland and critics like yourself always on your back, hahaLearn to support your own and keep Australian jobs by supporting our film industry!"}, {"id": 314, "text": "Can't wait for the sequel to see what happens next. Bring it on!!"}, {"id": 315, "text": "Anybody who compares this to Home and Away is stupid. Dan Ewing is so much hotter in Occupation!Watch the movie and see for yourself!"}, {"id": 316, "text": "Occupation start's off slow as it's telling a story about the characters, their relationships and then the fun really begins... I loved it and especially the action scene midway through the movie!!! It was epic and definitely my favourite scene of the movie.Occupation is an Australian film with attitude and I can't wait to see the sequel in October!"}, {"id": 317, "text": "I'd put this film as the same standard as a show like Falling Skies Aussies fight overwhelming force of occupying bug-eyed aliens who can't shoot straight and don't get the concept of taking cover. Reasonable acting and action. Corny dialogue. Meandering plot. Not awful. If you set your expectations pretty low you might enjoy it."}, {"id": 318, "text": "I like Australia and its people - but this movie is really bad the acting is worse. The movie is messy and feels like the actors knows its going to be bad - so why make an effort? Nice pictures though. Both humans and aliens make war like idiots and like we did in the 1700's??? The plot is useless and aliens are hilarious in their costumes - Four fingers in rubber that bends the wrong way :-D"}, {"id": 319, "text": "I really really wanted to like this movie! I thought Aussies fighting aliens would be amazing, but it is just plain stupid!"}, {"id": 320, "text": "Just awful, acting, plot...horrible and a mandatory baby delivery in the middle of an attack....how do people find money to fund their incompetence..."}, {"id": 321, "text": "Don't pay attention to low IQs giving this jewel 1 star reviews. It is easily one of the best science fiction releases of the past two years. While no Kubrick's Space Odyssey (also at times close!) the film has everything - plot, character development, great story, a plot twist, and of course gorgeous visuals and superb art-direction. Highly recommended!"}, {"id": 322, "text": "Gave this a 5 because despite everything, I did find it entertaining in a wierd way. Don't get me wrong, this is NOT a good movie. The script is rolling in clichés. The visual effects are decent for a movie on the budget it had, but they shouldn't have bothered. The editing is awful and WAY over the top, the music score doesn't fit and the increasing ridiculous story made me laugh out loud multiple times. The 'emotional' parts, when the audience MIGHT ACTUALLY START TO CARE ABOUT THE CHARACTERS are completely ruined by the music, editing and writing. By the end, I found I didn't really care about any of them, even the 'main hero' character because he had literally zero personality. Man, I don't even know how to explain this movie. I'd say you'd have to watch it, but you would be in for a very long 1 hour 59 mins."}, {"id": 323, "text": "Not a terrible movie, but given the big name actors and big budget for this Australian film it didn't really deliver. The Music Director choose soundtracks that sounded almost like the background music that plays on the loading screen of a badly designed game you'll find on iTunes.. average movie at best."}, {"id": 324, "text": "So painful to watch. Blame my wife for this one..."}, {"id": 325, "text": "Big name Australian actors &amp; the acting is not terrible, it's everything else that is dismal.The plot, the story, the sound affects, the set. I will say the aliens &amp; their guns were pretty cool but everything else was garbage. There are so many plot holes &amp; questions unanswered. I just started re-watching Falling Skies &amp; its so much better in comparison I literally had to force myself to finish the movie. I had hopes it would get better so I made myself finish it, now I regret not just cutting it off. Definitely not even remotely close to a lot of other SyFy movies out their. I didn't expect Falling Skies good because I figured the budget was tiny, but I have seen good quality Syfy with small budgets. This is not one of them.The plot does resemble Red Dawn, lol, someone else made that comment &amp; I have to agree. Its just with Aliens vs N. Koreans. I can't believe this was approved for a sequel. :-o"}, {"id": 326, "text": "The only good thing about this movie are the reviews on this page."}, {"id": 327, "text": "Just crap. One of the worst movies if seen in a while. It could have been a decent popcorn flick but is was just terrible."}, {"id": 328, "text": "Turned off after 45 mins. Who ever the military advisor was, they need to give themselves an upper cut!!"}, {"id": 329, "text": "Its just wasting my time! I can't believe that make by Australia!"}, {"id": 330, "text": "This one could have been a lot better with it's very good cast and decent special effects, but the screenwriting and direction were a big let down.I could go into details with spoilers, but anyone who has watched the movie will know exactly what I mean."}, {"id": 331, "text": "How many sins the guys at Everything Wrong With would give this trite film."}, {"id": 332, "text": "I went in not expecting much. Clearly not a massive budget but obviously not tiny either. Some good effects and alien armour and weapons are cool. But in the end it's a bit of a mess continuity wise, some really cheesey cheesey cliche moments.....namely the ending that was so cheese I put on weight watching it. (point off just for that)Basically it's nothing original. It's Red Dawn with aliens but without any real character development.It has a TV movie feel despite the money invested. Mostly down to the acting of some of the characters.Not terrible but a huge missed opportunity none the less."}, {"id": 333, "text": "Can't believe how baaaaaaaad this was!!! Ashamed to say I watched it all. Junior high acting and emotion character. So embarrassing to movies. Not sure if this was an alien invasion movie or a bad musical considering all the background music ALLLLLLLLLLL the way through the movie."}, {"id": 334, "text": "Who? Why? How? So many unanswered questions. Abysmal acting, no direction, dreadful cinematography and editing. How on earth films like this ever get made is one of life's great mysteries. And there's almost two hours of it! I despair."}, {"id": 335, "text": "This was true to my lowest expectation. In the end we find the war was fought over two litres of Fosters held in a clear glass tube, secured by a titanium cage. All that was needed was to hand it over the Australian army to save the world."}, {"id": 336, "text": "Such a cheesey movie it's unreal, couldn't take much more than 48 minutes of this before the threw up in my mouth it was so bad.The acting throughout is not believable, the storyline is unoriginal and poorly executed, and the aliens are either the most incompetent in Sci fi history or this rag tag group of aussies are super soldiers.Awful movie."}, {"id": 337, "text": "Could it be any cheesier !! A total rip from Red Dawn (the original) crossed with war of the worlds....."}, {"id": 338, "text": "If you look at the date of the ratings on here, the vast majority of the 10/10 ratings come at the start. Obviously to anyone that actually watched the film these scores are exaggerated and manipulated. Most, but not all of the positive ratings specifically  big up  the Australian film industry. Now, while I can't comment on all offerings from Australian film and tv, the ones I have seen in the past have been a great deal better than this tripe."}, {"id": 339, "text": "Whoever put this together shouldn't work in the film industry again.Lots of potential but the story line was terrible, the script... Was there a script? The characters were extremely dull.I tried to keep some interest, but geez. Talk about a waste of time."}, {"id": 340, "text": "This best thing about this movie? It's now the worst movie I have ever seen. I watched it with my 12 year old daughter who had aspirations to be an actress. She loved it as much as me. I reminded her this is where most actors end up. She's pledged to become a lawyer now."}, {"id": 341, "text": "I only Joined to rate this Very hard to find anything good to say about it"}, {"id": 342, "text": "Eat your heart out Chris Hemsworth. Best sci fi movie ... outback version. Don't bother. I cant believe this is Australian production. Stick to Queen of the Dessert genre."}, {"id": 343, "text": "What a shocker! Ham acting, non-sensical script, average CGI, cringe worthy dialogue and Aliens with rubber masks and no back story. Mix that in with Australian type-casting at its finest - the tough old farmer, footy captains with issues, analytical asians, bike gang islander and of course ball-breaking females with testosterone overload. If you get get all the way through it without laughing at it, cringing or sitting muttering WTF to yourself you deserve a medal for you resilience"}, {"id": 344, "text": "Wow, how this got the green light is beyond logical thought. It started off kinda good and then gets so so very horrendous that it actually made me giggle... so I gave it an extra star. It actually manages to fail in every aspect of story telling which is kind of impressive."}, {"id": 345, "text": "Had promise for the first 10 minutes, then what a disaster of a script, acting, music ... everything. How did this win a award ? We had to drink alcohol, just too get through it."}, {"id": 346, "text": "....POS!!! The effects are ok, but the writing is something done by 13 yr olds."}, {"id": 347, "text": "Worst movie ever. Review to short? ....Worst movie ever."}, {"id": 348, "text": "It's a very cheap, very poorly made, poorly acted and poorly thought through film. It is really hard to watch because of it's stupidity. I do not recall any film that is more stupid than this. I tried to watch it without sound, I tried to fast forward it - it is excruciating to watch either way."}, {"id": 349, "text": "This is the worst alien invasion movie I've ever seen and that includes super low budget YouTube only type productions. The story is poorly written. It makes no sense. The special effects are tragic. Fireworks from energy beams and costumes with floppy appendages that don't work. The highlight of the film is the love scene between a maybe 18 yr old girl and a hobo in a sewer tunnel in the rain while everyone in camp is not suffering the torrential downpour. A great movie to watch while drinking alcohol with friends."}, {"id": 350, "text": "I'm a fan of this genre and this particular movie was far better than others I have seen on the Netflix roster. The Australian people have a great spirit and it shines through here"}, {"id": 351, "text": "It's one of those films you can tell that it's bad from the beginning but you're going to try to suffer through it. I had to leave the room for a moment so I put said film on pause. When I came back I got engrossed in something else and completely forgot to finish watching the film. It wasn't until an hour later I remembered I was watching a movie that was so bad I completely forgot about it - in the middle of watching it."}, {"id": 352, "text": "So many scenes that mimicked other movies. Parts were downright laughable. It generally just didn't make any sense."}, {"id": 353, "text": "Complete nonsense, no story line, randomly changing scenes, characters are essentially non existent, so bad. I can't imagine how this made it to the market. I kept watching maybe it will get better but gave up at 40m to go. I made a mistake by not checking the rating here first..."}, {"id": 354, "text": "I will be short. Horrible acting, story line and plot. Had potential. Destroyed it faster than they did the aliens... one of the things I hate the most in movies. Aliens come in gins blazing and destroy everything i a couple a shots. And then rebellion starts and all of sudden all the aliens can't aim, aren't bullet proof anymore, and a couple of civialians nobodies with sticks impress the army armed to the teeth to continue fighting. Horrible logic in script."}, {"id": 355, "text": "One of the best visuals I have to say. Horrible scripting and acting. So many plot holes looks like a street in pennsylvania. Just terrible."}, {"id": 356, "text": "Just like it's budget - this film is poor. The Directing, Writing, Editing, Art Direction, Make-Up, Acting, Lighting, Score, Post-Production are all bad. The only shining light in this whole debacle, is the music for the end credits, which I think could be a global hit. Apart from that it's like a cheap 1980's pop video mash-up with Battlefield Earth (You know that really bad aliens attacking Earth film with John Travolta in it from 2000). This shouldn't have got any further than YouTube. It's only slightly better (hence why I gave it a 2 rather than a 1 out 10), than those 'low budget feigning big budget effects, desperately padding it out, in a sad attempt to cover up, how poorly executed and written the story, or lack of actually is' bad movies on the SI-FI daytime channel. All future directors please take note. If the story is good, you'll make a better film, without having to cover it up with effects and slow motion pans. I don't think I've ever sat through a film, where there were so many poorly edited and badly directed shots. So much so that I opened this account to warn everyone just how pants this film really is."}, {"id": 357, "text": "Watching this literally felt like someone wrote out an exhaustive list of every single post apocalypse / alien invasion cliche and trope, then filmed those individually and then attempted to fill in the gaps and make some twisted attempt at a plot.Seriously, the entire first half of this movie felt like one extended clip montage trailer or pitch concept rather than an actual movie.It's shot fairly well but that is about the only decent thing I can say about it."}, {"id": 358, "text": "Red Dawn but with aliens. Group of rebels hide in the woods after aliens invade."}, {"id": 359, "text": "I so enjoy Australian actors. This movie could of been something, but fell miles short of the mark. So many things wrong. I feel so badly for the actors and crew that probably worked hard to make this.... but it came out as just dribble."}, {"id": 360, "text": "I'll not be able to un-see this movie. It was torturous after the first 30 minutes, so I skipped through it. Even the music was unsettling and inappropriate. The last scene was utterly laughable... Don't waste your time!"}, {"id": 361, "text": "Movie was so bad I had to stop it halfway just to give it a bad review."}, {"id": 362, "text": "Literally one of the worst movies I have ever seen. How someone could make this, watch it, and decide it's good enough to release is incredible. Don't waste a second on this. Not even close to even mediocre standards. Pure garbage and I wasted 2 hours I could never get back. It's embarrassing how awful it is"}, {"id": 363, "text": "The concept was there. The effects were there. The plot was not. My husband and I got an hour and 20 min in and had no desire to finish. There was no connection with any of the characters and the editing of the film was so odd. There were segments of the film that had no meaning and seemed like a trailer for the movie; just tiny bits of clips edited together that were supposed to build suspense, but it went no no where. We didn't finish it and once again, I am reminded that the ratings on Netflix are completely arbitrary."}, {"id": 364, "text": "A waste of electrons. And the reviews over 2 stars must be from the cast, crew and their families."}, {"id": 365, "text": "The people giving this movie 10s should be ashamed. Save 2 hours of your life and watch something else."}, {"id": 366, "text": "This movie had me interested for about the 1st 30 min. Sure I could see the Similarities to red dawn, (perhaps that is where Some of the inspiration for this more came from), And I was prepared to look past the ridiculous way in which the aliens technology permitted them to see, However I had to turn off after the movie apparently jumped a couple of months, Band the mango farmer, had suddenly turned military specialist and was training the group in military tactics. The dialouge was just plain awful to the point of making my skin crawl. I gave it 3 as they tried to do something different in Australian film."}, {"id": 367, "text": "Red Dawn (circa 1984) did it better, as someone else has probably pointed out. There were so many things wrong with this movie. No sane person could give this movie a legitimate nine or ten star rating. The military mistakes alone are stunning and numerous. This movie will be part of the choice if we ever are invaded by ET. Watch this movie on a loop or surrender"}, {"id": 368, "text": "I'm a big sci-fi fan. With that said, this was one of the worst movies I've ever seen. Actually, I have seen it before. It was called Red Dawn and it was a much better movie than this. I've never reviewed a movie before but this one was so bad, it motivated me to write this review. First, the characters were poorly acted and mostly unlikable. Second, the overall plot was highly predictable and most of the actions within the movie made the characters look really stupid and unrealistic. Third, the continuity made no sense.I read a review that this is the move that will revitalize the Australian movie industry. I would hope that no industry would be dependent on this disaster except maybe the landfill industry."}, {"id": 369, "text": "Soooo disappointed. The moment i watched the preview i could not wait to see this movie. An Australian big Scifi film, fantastic!Then i watched it and within the first 30 mins hated it. The overall message of the film is the only good part. I honestly do not know how the Director, Producer or Actors reviewed this and thought it was good. Big let down and it could have been amazing."}, {"id": 370, "text": "This was such a bad movie. Poor acting, bad story, but good effects hence the 2 stars. That must be where all of the money went to. Watch only if you're bored or want some background noise..."}, {"id": 371, "text": "I mean, come on guys. I completely get the feeling of patriotism some of you feel with this being an Aussie movie. Your country fighting back, seemingly convincing some grays to join you, with a handshake, in fighting their fellow occupiers. But let's be totally honest with each other here, the movie just wasn't very good. It wasn't. It wasn't original, it wasn't thought provoking, it wasn't convincing, it wasn't emotional, it wasn't necessary. I gave it a shot. I tried to like. I give it 2 stars for effort. If it makes you feel better, I apologize on behalf of America for Independence Day 2. And hey, Australia is still 2nd on my list for countries I want to visit and I know it's an American movie, but I loved Quigley Down Under."}, {"id": 372, "text": "This movie is hilariously bad. The only thing it'll occupy is a spot in one of the most boring and ridiculous movies every."}, {"id": 373, "text": "Acting was ok, not great. But the story and effects fell short in many ways. Just too shallow and predictable....it should have been better"}, {"id": 374, "text": "I'm sorry. That's all I heard. And then the score kept bothering me. I was like that's the wrong music for this scene. And why did the Aliens have to look like they were from Area 51? And how do you wake up from extra damage to your already damaged noggin to find the strength to fight another day?I guess. Man, April can't come soon enough."}, {"id": 375, "text": "First... The sound editing... who added the music had no clue what he was doing and really F-ed up the movie. Or the budget was all gone and they used some prefab soundtrack cd from the 50% off shelve. Camera works, well done, nice tricks to make up for some of the bad acting. The editing is sometimes confusing like some junior editor sneaky added some of his work when the director was doing drugs at night. Ridiculous storyline.. sorry.. like they lost the script during the shooting and just made the rest up. Damn ugly Aliens and those voices..why? A lot of actors tried.. really, thanks for that! They probably had to do some takes with a gun to their head Also wondering.. Why are we doing this again? Now finally... the end of the movie.. can i go to bed now? Please?"}, {"id": 376, "text": "This was by far one of the worse done movies ever!!! So I checked the reviews and most (all but 3 I saw) had only reviewed this one movie. That tells me someone is trying to increase the average rating. Now, why did I come here and took the time to make a profile? I had to respond because I was shocked when I first brought up the page and saw it had 5 out of 10 stars because this movie was THAT BAD!! It took everything I had to finish it."}, {"id": 377, "text": "This movie is like the original Red Dawn, and Independence Day hooked up and had a tragically deformed movie baby. Full of incoherent action, nonsensical characters and idiotic dialog. Not quite bad enough to be cult classic. Not good enough to be a 5.Still, sometimes it's nice to semi - nap while watching a 4."}, {"id": 378, "text": "I started surfing on my phone in the middle, jesus this was so boring like watching paint dry, acting was non existent, the characters beyond bad, the aliens were acting like idiots I can keep going for ages... What a waste of money, CGI was OK and that's about it.Do NOT waste your time watching this like I did."}, {"id": 379, "text": "Very poorly done. Reminds me of lousy Saturday afternoons in the 1970s-80s watching a channel that turned into a Fox News cesspool.  This mess got over a 90% rating on Mr Cranky or whatever?? Must have been stuffing the ballot box!"}, {"id": 380, "text": "It comes across as a low budget sci fi movie, and quickly deteriorates into a cheesy invasion firm. The acting is not bad, but the actors do not have much to work with. The story is boring. No real urgency to invasion. Midway it resembles forest action a la Robinhood and his merry men. I can forgive most of this, but not that it fails to entertain."}, {"id": 381, "text": "Absolutely no story line. Aliens come and start shooting, people try to defend aaaand that's the movie. Acting isn't bad but basically a low B movie. Stay home and play Call of Duty or Halo, it's about the same."}, {"id": 382, "text": "Terrible acting, schizophrenic or one dimensional characters, cliches, contradictions, continuity errors, fight scenes that never end. If you value life, don't waste it on this movie."}, {"id": 383, "text": "I find it surprising that in Australia they get the funds to generate such disastrous production. It's very difficult to find a more trite plot, with more stiff characters and more improbable situations. This type of movies does bad to the genre of science fiction, very badly. I get tired of criticizing films of this type on Netflix, and so I never came across anything as loose as this production. There are times when the shame of others surpassed me, and I found myself screaming at the screen or bursting into laughter.Please, watch this movie just to understand everything that is wrong in action movies. A pity, because I understand many of the actors who worked here are very famous in their country, but it's clear that the direction of actors played a trick on them."}, {"id": 384, "text": "Please when you read this review, don't look back again.. this movie is a complete waste of time, point."}, {"id": 385, "text": "Obvious sci-fi dreck, fair production values, but you will be glad when it's over."}, {"id": 386, "text": "Occupation is a very budget driven TV sci-fi movie that certainly has aspirations for something bigger than it actually is. It's a mash up of various sci-fi movies and has cherry picked certain aspects out of each to formulate this very contrived and trite version that lacks any originality or edge. The acting is competent but not outstanding and the SFX are so-so. Look, the movie is not absolutely terrible but it's certainly not great either. These 10/10 ratings by 1 review wonders are an obvious and deliberate attempt by the film maker's family and friends to fool you into thinking this decidedly sub-par film is some type of hidden gem. Trust me it's not and never will be. At best it's an average TV movie and at worst a dire heavily clichéd homage to numerous other alien invasion movies that have done it infinitely better and on much bigger budgets. All in all it's a 4.5/10 movie that tries hard for the budget and casting restraints but fails mainly due to poor script and no originality."}, {"id": 387, "text": "I rented this movie and it held me captive till the bitter end. I deserve something for my time. Possibly an I survived the Occupation slogan T Shirt. I can't possibly put this review into words just yet Worse than Sharknado."}, {"id": 388, "text": "Ideas taken from so many other films/series - i.e. Independence Day/Fallen Skies but with Ozzie accents. Some truly awful acting. And why most of the time do we have to 'humanise' aliens - oh wait.. they have four fingers, not five - my bad! It's low budget (I'm guessing) so don't expect too much. It did entertain me for a couple of hours - I've seen far worse."}, {"id": 389, "text": "The effort in making this film and all the people involved was a total waste of time. Aliens arrive in a flying saucer of sorts to conquer the world, but the weapons they use are no better than ours. They wear seemingly iron suits but their behavior and fighting is no different from humans.Without spoiling the plot, if you like shoot ups, you may actually enjoy the hieroglyphic firework display and aimless running about, but for other viewers this film is naught. It cannot even be called sci-fi!This Australian production is an embarrassment for aliens and humans alike."}, {"id": 390, "text": "Like I said in the title, I really enjoyed this movie. It was a feel good post apocalyptic movie, lol. It really reminded me a lot of Tomorrow When the War Began, but with aliens. A fun way to pass a few hours."}, {"id": 391, "text": "Look at the world as Australia. After the invasion these people will 'save' us but we will die. All of us. Why?! Because of this very profound limitless stupidity. This 'movie' is that close to reality. And it's getting worse. The individual who wrote the script should be invaded first. Than the director and producers. So, save yourself from watching this piece of crap!"}, {"id": 392, "text": "Stereotypes cliché amateurism humiliating. These words and others come to mind. Why AFL? is the studio based in Melbourne? There is nothing macho about that sport. Snowflakes. Frankly I don't know how the actors could finish the days work and think anything other than 'what the hell is this I'm involved in'? I turned it off at 47 minutes. Now reconsidering my Netflix subscription. And then I'll reconsider my citizenship. It's that bad."}, {"id": 393, "text": "Someone has clearly invested a lot in this, big budget (Australian) cast, effects and idea. However, my God it's bad."}, {"id": 394, "text": "I did not even finish watching it! Half of the movie I did see was terrible."}, {"id": 395, "text": "A ragtag bunch of outback Ozzies are really able to mount a credible defense against alien invaders from another star-system? If I were them with all their technology, and my aim was to rid the Earth of humans, I would do it form orbit, manufacturing the doomsday virus on one of my ships, then releasing it world-wide. Earthly ships are chemically powered meaning after the initial boost into orbit, they basically drift, so it would be easy to pick off any offensive ships.But if for some reason I did want to engage the humans on the Earth, I would probably use an unstoppable insect swarm-like anti-personnel weapon. I would certainly ensure my weapons were bio-locked. Picking off warm-blooded humans from the air would be easy (no hiding under a bedsheet or in a tall field of grass!), I would use a ship which could target 100+ with a single laser shot to the head. I could go on and on but you get the drift.Fighting aliens who seemed to have very bad aim and weak armor plus all of the above spoiled my enjoyment of the film as it made me think the director thought I was unintelligent..."}, {"id": 396, "text": "Just plain bad, bad script , bad acting. A stupid story, if you can call it that. Low budget rubbish that should not be allowed out. BTW if you were an advanced race and you wanted to exterminate the current inhabitants of earth how would you do it? Certainly not by sending a bunch of soldiers down to shoot em ..... doh"}, {"id": 397, "text": "If you have a spare 2 hours to waste time and watch this budget movie then knock yourself out. Tem Mortisin u had your day with once were warriors since then nothing. I expected more form this movie like Tommorrow When the War Starts but no. Second rate acting by second rate actors such a shane really."}, {"id": 398, "text": "The following may contain a FEW 'spoilers' but I think it's a general description of the movie, not spoiling the story of the movie itself. OK, so the plot's basically 'Alien Nation' meets 'Saving Private Ryan!' (if you're not old enough to remember the first, it's basically a bunch of aliens who lose their planet and come down to share ours and the prejudice that causes.) But the pacing's great, I was gripped for all two hours of it, I didn't want it one bit shorter. I loved the seamless transition between small-town life and full-on war movie, that was handled excellently. I loved how the characters were developed so fast without it feeling rushed or implausible - I could really see that situation bringing out those traits in people. And I felt I was getting a close-up of one arena of a whole, vast conflict, not just a 'war' happening in microcosm that should have been easily squashed by groups from outside the area. It felt like it was part of an Earth-wide conflict! But where this movie roared was in the heart and belief everyone put into it. The whole cast were totally behind the director on this one, it's his second movie, the work of all lifted it into something that should have been released internationally. OK, 200 million dollar Hollywood movie it was not, but it had more heart than many of those I've seen. It totally deserved to be out there, to show what this guy can do given a sniff of a chance. Me, if I won several lotteries(!), I'd give him double the budget to take the follow-up Out There, humans and aliens in space together, using alien technology to see other worlds for the first time. See what the other races make of Humans, the new kids on the block, what we learn from them and what, if anything, they learn from us. Most alien invasion movies lead full circle with Earth killing all the aliens and going back to exactly how we always are afterwards. I've a feeling this movie could lead to a franchise/TV series (as did Alien Nation) and show what co-operation between species can achieve. I loved it (And the sound-track, which others gripe about, but then I love New Age music which it basically was!) And I'm looking forwards very much to the next one. Thanks, Luke, for a lovely 2 hours. Chris. (This MAYBE contained spoilers, I'm going to tick 'Yes', you're welcome to change it, moderators!)"}, {"id": 399, "text": "Yep, punched above their weight and got smashed. When working on a low budget, understand that and work with it. The dialogue was atrocious, the characters swing from one end of the spectrum to the other within the same scene for no reason. Full of cliches and unrealistic character interaction. Why on earth did the aliens set up a 1 acre farm with slave labour? Again, another alien flick where apparently the aliens just don't have the idea to develop weapons that are accurate despite their technological superiority. Just so much did not make any sense. Oh look, watch it on a rainy afternoon, have a couple of laughs"}, {"id": 400, "text": "Sorry mate, I tried, I really feel I did. But no. 20 mintes in and I could not try no more. What rubbish. Horrible....."}, {"id": 401, "text": "Bad script! Bad acting! Bad story line!! Why would invading aliens try to take over the planet earth starting by attacking a game of AFL in a backwater country town in the Australian bush"}, {"id": 402, "text": "Realy one of the the worst movies i've ever seen!!!"}, {"id": 403, "text": "Cliche ridden rubbish. Don't bother watching. Try Invasion 2018 for a proper film."}, {"id": 404, "text": "It's nice to see that other countries can make cringe enducing alien invasion movies. This one is so generic it's entirly possible the script was created by some machine. Want to die of alchohol poisoning? Take a drink everytime you spot a alien invasion movie cliche. I sprained an eye muscle from the intense eye rolling caused by the Take care of my baby! line."}, {"id": 405, "text": "Great movie,plot and most cast did a pretty good job except for amelia. Her expressions seems to be forceful and unnatural."}, {"id": 406, "text": "This is my first review, too.This is an awful movie - as Gene Siskel may have put it, if you choose to watch it, it is time that you'll never get back.The screenplay is terrible, the acting is terrible, the music is terrible, the dialog is terrible, the costumes are terrible, the special effects are, terrible, the action scenes are terrible to the point of irony, the storytelling is terrible, the character development is, well there is no character development and there was no story arch let alone any flow from scene to scene.I'm sorry to be writing such a bad review but my gosh. It was bad. So bad.Some bad movies become cult classics because on some level there is irony in the bad, or the degree of bad, or one actor injects something into their performance, maybe a line, maybe even a gesture that gives you an inkling that they're aware of the level of badness. This is not one of those movies.The one thing that I will remember though, and that makes me quite sad, is the pervasive misogyny - this could be 50's America but without the politeness. If the man-splaining, the p-whipped comments, the head patting, the knuckle dragging and the not so subtle mixing of violence and intimacy that I'm trying to forget that I watched, is at all indicative on 2018 Australian culture (I'm sure that it can't be!) then Australia would be easily one if not two generations behind North America - and in the era of Donald Trump, that says a lot."}, {"id": 407, "text": "Surely this must be a kids movie? Great cast but a script written by a 12 year old! The longest 2 hours I've sat through! Incredibly well made, great effects but seriously aimed at the wrong age group! But I know a few 10 year olds who would enjoy it!"}, {"id": 408, "text": "This movie is Australian propaganda, but mostly intended for self-consumption: an echo chamber. Even though we're told that the rest of the world is also affected by this alien invasion, it is entirely excluded from the movie, as if Australia *is* the world. This movie was an attempted counterpoint - albeit a poor one - to the innumerable alien invasion movies wherein heroic ***insert some other nationality here*** save the world.The only value to watching this movie is a part of a larger study of how nationalism - as one form of tribalism - affects human behavior."}, {"id": 409, "text": "Not very much to say. Tin-grade stage props and special effects that take you back to the glorious 80s, you can stomach these if you have a good script in your hands, crafted dialog and some credible acting. None of that here, though. Honest Aussie macho cliches for dialog, holes in the script that could let a mothership through, and as for acting... makes your eyes hurt. A low budget sci-fi indie gem it is not. Just a low-budget soap with some aliens in it. I stopped watching less than half-way through."}, {"id": 410, "text": "Here I would like to make summary:Effects - good  Action - good Acting - not good on some leading characters Story - so predictableThey just wasted some budget for this. Why can't they even create a good story? Worse yet the acting on some lead characters sucks so bad that you wanna throw your TV.Alien movies are so common so just create a unique and good plot is the best foundation to start with. So guys stay away on this film if you don't wanna waste your time though if you have a low taste of entertainment this is good enough for you."}, {"id": 411, "text": "I feel bad for the people who were behind the scenes and who did their jobs... I bet they cringe at the final results. Such a shame, I usually love Aussie movies."}, {"id": 412, "text": "Wish they have a sequel soon. Maybe an uncut 4 hour long version. People will love it."}, {"id": 413, "text": "Extraterrestrials that look like your paint-by-number extraterrestrials, invade a small Australian town. It's up to said townspeople to go military, defeat them, and save the human race. Time to put another burnt shrimp on the barbie and give blokes and sheilas a bad name. That's the gist of Occupation, my latest review. Oh and I almost forgot, what the heck does this flick's title mean anyway? It's balderdash I tell you. Pure balderdash!Anyway, Occupation while never lacking in energy, brute villainy, and a tonally inconsistent musical score, is one of the cheesiest and worst movies of 2018. At a convoluted and overlong 120 minutes, Occupation strives to be Independence Day meets War of the Worlds meets The Walking Dead meets Red Dawn meets Signs meets Arrival (uh talk about copycatting). Instead, director Luke Sparke fashions something in the vein of Battlefield Earth meets Planet 9 from Outer Space meets Saturday the 14th Strikes Back. Sparke as Aussie's version of Ed Wood, shoots Occupation as a jerry-built, show-and-tell project. Like I said, cheesy.Along with cheap special effects, sloppy editing, some laughable slow-motion shots, and the tired adage of documentary-style footage, Occupation's school play acting is pure abomination with its stock characters appearing one-dimensional and childlike. They bicker in cliche as they reside in their prescribed, Army state. As for the parodied aliens involved, well they're no prize either. Do you enjoy E.T.s dressed up in tacky Judge Dredd costumes and spouting off poor man's, Evil Dead jibber-jabber? Neither do I man. Neither do I.All in all, I faithfully deem Occupation as a modern day, drive-in theater turd or the kind of pic that's a legend in its own mind (a sequel to Occupation is in the works and that scares me). Bottom line: Occupation is a bad, cinematic line of work mate. My rating: 1 and a half stars."}, {"id": 414, "text": "WOW WHAT A COMPLETE TURD OF A MOVIE, THEY MUST HAVE BEEN SMASHED ON XXXX OR VB WHEN THEY MADE THIS RUBBISH A COMPLETE DUNNY LICKER OF A MOVIE"}, {"id": 415, "text": "Stir the pot and what have you got? - Not A Lot!Annoying characters, pointless sex scenes, Robin rude in the woods with totally illogical scripting and poor explosive effects from the beginning did not bode well for this - where did the 6 million dollars go?"}, {"id": 416, "text": "I wasted 2 hours of my life that I will never get back! :-( started of okay but as the movie progressed it got dull."}, {"id": 417, "text": "Dont bother watching. It's too silly to be true. Alien invasion gone cheap."}, {"id": 418, "text": "Seriously, how can you get funds for a movie and come up with a complete mess? The characters act with no logic, the cuts don't connect with anything &gt; is not enough to throw on the screen after x months and then continue the action without showing a change. After x months what happened? How is the story flowing? Jesus what a disaster. The directing made the actors look silly, actors that don't seem to care what they are doing. Whatever, this doesn't deserve a review..."}, {"id": 419, "text": "Terrible movie. Bad in all aspects. Tries to copy things from good sci-fi movies but fails. I'm pretty sure the writer tried to make people feel sympathy for refugees, as the aliens cone from a destroyed world. It's like the movie was funded by the Greens Party."}, {"id": 420, "text": "I love this genre of film but this is really bad, I had to double check that it was 'M' rated as I could be more forgiving if was a movie for kids. I believe the announced sequel will never happen, it is a trick to make people think the first is worth seeing. Anyone giving this more than 3 stars has a direct tie to the film somehow and to the people boosting the score with 10/10 scores, come on- you made a dud, just deal with it. It is terrible, terrible film making underpinned by the worst screenwriting you can imagine. My girlfriend actually got annoyed because I kept groaning and randomly laughing at the absurdity of what I was seeing. The film looks like nobody involved was allowed to criticize or question any other person. The aliens look like something from 1990's power rangers and I bet you can't find one represented in any of the official promotion material, the aliens sound even worse. There are way too many leads and few come off well. I am sure some of them are good actors but none can make the material work, the 'Aussie-isms' in the first 5 min were way over the top. Some of the story elements don't finish. For example, the young Asian lad risks his life saving a blond girl and his affection for her is a notable part of the first half of the movie, but she bangs the town bum and that's the end of that, they never speak again. The military element is awful, the tactical choreography and discussion of tactics and war planning is cringeworthy, the Colonel acts like she is playing a role on playschool. Again, it is the writing. The alien soldiers have no soldierly skills at all, think Battle for LA where the invaders actually act like the soldiers they are. There is a scene where a spaceship simply cannot hit an RV going probably 60kph and the 'boss fight' on the farm, just don't get me started. Overall the scope is just too big. If you have $6 million don't try to deliver an epic. They could have had the ship big invade Sydney as a background plot while smaller alien crafts landed in the smaller towns to secure quiet areas to put the women and children aliens. Focusing on one of these smaller crafts would have created a smaller environment in which to tell the story (and would also explain why they were in a small town). It would also provide a better vehicle to drive the final ending. I don't know, I'm not an expert but the scale of the direct invasion of the town is just stupid. Ok, so two positives: There is a funny gag re the bi-pass where the farmer rants for ages about how bad it is then once the aliens attack goes we better use the bypass, it is faster. And a kinda smart bit where one of the characters makes the obligatory reference to Captain Cook but then basically says they are more advanced so let's try to accommodate them and see if we can live, at this moment I knew how it would end but it was an insightful moment, still the way they work towards this outcome (handshake agreement to fight for us, now go kill your own species), is not fleshed out anywhere near enough. To the people involved I don't mean to be nasty but if you do something again for the love of God please get more critical eyes to go over the script and make a smaller, better looking movie. If as much effort is put into the script as manipulating review sites (97% positive audience score on rotten tomatoes- lol), you'll be golden. Simply put, it is the worst film I have seen in a long, long time."}, {"id": 421, "text": "30 min of that hour I spent on FB with my phone. I wouldn´t waste time on this movie. Have a stroll in the woods, it´s more exciting."}, {"id": 422, "text": "Why on earth are these Aliens invading Australia, of all places? Perhaps there was some explanation.. I couldn't watch it to the end."}, {"id": 423, "text": "I started to watch it. 5 minutes later I just lost interest. It run in the background, and I didn't even noticed when the movie was over, lol. What happened? Did we win? Most probably lol. Who cares? Music was fine."}, {"id": 424, "text": "Low budget movie, the aliens and their ships looks like a 1950 movie. The plot is copied unsuccessfully from a lot of the classical scifis. Too bad, since the idea of an united humanity against a threat from outside is really relevant."}, {"id": 425, "text": "This movie blew my hair back! Didn't expect that much awesome in one movie!!!"}, {"id": 426, "text": "I don't need to say much as my title says it all. Bring on Occupation Rainfall :)"}, {"id": 427, "text": "This movie is a little all over the shop in some parts, but in the end it all joins together beautifully."}, {"id": 428, "text": "This movie combines action, adventure, romance, special effects and a good plot. A good way to spend 2hrs and would watch again."}, {"id": 429, "text": "Best Australian movie EVER! Using great Australian actors, good VFX and script."}, {"id": 430, "text": "The dialogue isn't the greatest and could do with some editing, HOWEVER the action is worth watching!"}, {"id": 431, "text": "All I'll say is exceptional! This film and it's sequel will set the bar for upcoming Australian films."}, {"id": 432, "text": "You're simply gorgeous! I've only ever seen her in Home and Away previously. Seeing her step up in this more controversial role, was awesome."}, {"id": 433, "text": "Just because this movie wasn't produced in 'Hollywood' doesn't mean it's not a great film. Some of the worst films are produced in Hollywood as well as some of the best! Don't judge a film so easily without appreciating it's worth and the story it's telling."}, {"id": 434, "text": "Better than ordinary and one of the better alien invasion films I've seen."}, {"id": 435, "text": "Definitely a superior film compared to most other Australian bore feature films."}, {"id": 436, "text": "This movie feeds my imagination, fantasies and dreams. It's out of this world and perfectly scripted."}, {"id": 437, "text": "Never seen a movie like it before. I loved it from the beginning to the end. I can't wait to see the story follow on in Occupation Rainfall."}, {"id": 438, "text": "Highly recommend watching if you have Netflix and are a sci-fi fan like myself."}, {"id": 439, "text": "Excellent VFX and alien suits. Highly enjoyable :)"}, {"id": 440, "text": "Typical Australian film with the quirky dialogue, unique casting and fun."}, {"id": 441, "text": "All the fun begins after the invasion starts. So hang in there when watching this film for the first time as it won't fail to disappoint."}, {"id": 442, "text": "Funny in a good way with Dan Ewing attempting to save the world from aliens. Not a fan of him personally however he was decent in this movie. I hope they don't cast him again though."}, {"id": 443, "text": "Now this is what I'm talking about! Explosions, aliens, gun fight, fun action packed sci-fi!!! My favourite kind of movie."}, {"id": 444, "text": "Didn't know anything about this movie going into it, but was surprised me. There were some signs that it wasn't made on a huge budget, but I feel the movie was very enjoyable for what it is."}, {"id": 445, "text": "What's not to love?Awesome VFX, incredible action scenes, it's fun and most importantly contains humanity! Who doesn't love a story that contains all of the above?!"}, {"id": 446, "text": "Going by all of the other reviews I expected this to be nothing more than appalling, hahaha What a joke! It's nothing more than a masterpiece in my eyes and if people had taken the time to enjoy it for what is it than you'd also see the beauty that I did."}, {"id": 447, "text": "Excellent cast choice, great script, well edited, good length movie and well worth my time."}, {"id": 448, "text": "Didn't expect much being a low budget Australian film, this however was decent and not bad too to watch."}, {"id": 449, "text": "After reading all the negative reviews I started watching this movie with the mindset that I wouldn't enjoy it... Boy, was I wrong! It was great and would highly recommend it to anybody who is into Aussie movies and sci-fi."}, {"id": 450, "text": "This Australian Sci-fi movie is funny, has plenty of good fast paced action scenes, suspense and great cast. I've watched this movie three times now and it gets better every time I watch it."}, {"id": 451, "text": "A film that's not too complicated to understand what's happening and great storyline. Throughly enjoyed it and can't wait to see the sequel at the upcoming Monster Fest!"}, {"id": 452, "text": "Doesn't get enough credit for what it is and that is AWESOME!"}, {"id": 453, "text": "For once an Australian movie worth watching! I didn't fall asleep, or hate the Australian actors like I normally would being an Australian movie. Each cast member has been carefully chosen to suit the characters in the story. And the story starts off slow, but gets intense and I love that. Brilliant. Just absolutely brilliant and I hope there's a follow on movie!"}, {"id": 454, "text": "Fun, different, Australian sci-fi, action packed and enjoyable. I liked the unique cast, the characters they played and how the story was told.So many haters, critics and bad opinions on this film, but I liked it and would watch it again."}, {"id": 455, "text": "I am a HUGE desperate housewives fan and was blown away to see Charles Mesure in this Aussie fun action packed sci-fi! Highly recommend if you want to watch something different."}, {"id": 456, "text": "My friend recommended I watch this as I'm a huge sci-fi fan and today I watched it on my day off and I also recommend it for anybody looking for a decent sci-fi film that won't disappoint."}, {"id": 457, "text": "I loved it! The suspense, surprises, drama, good use of Aussie slag, intense action scenes and the cast choice surprised me, but worked for this film."}, {"id": 458, "text": "Great casting, interesting story line and action scenes are intense, yet awesome!"}, {"id": 459, "text": "This movie contains all of my favourite things, except wish there was less shirts and more action, haha"}, {"id": 460, "text": "I just wish there was even more action scenes! Can't wait for the sequel as the VFX looks killer."}, {"id": 461, "text": "Ok so it wasnt a blockbuster.. and there were moments of cringe .. but it was entertaining.. also great that it wasnt the US saving the world again.. Nice one Auzzie, another please"}, {"id": 462, "text": "For a B-rated movie. If it isn't a B-rated movie.. well it was still okay just could've done better on the aliens' faces and some special effects. Anyway, it wasn't bad and was definitely entertaining.. in an interesting way. The ending was pretty weak though. I mainly watched this since it has the one Asian lady on it from Terminator's Sarah Connor Chronicles series."}, {"id": 463, "text": "Slow to start but it really gets there. The acting and plot seems to improve as it plays out. Lots of actions and explosions. Also a few interesting regulations"}, {"id": 464, "text": "When people sit around and snort some stuff they get this incoherent mess. Some advice would have been to get a few scriptwriters to do some sanity checking and maybe to get a real director to implement. It's bad,very bad"}, {"id": 465, "text": "The only good thing about this film was the beautiful Dan Ewing.The production was good but storyline poor. Stefany Jacobsen's acting was absolutely shocking - painful to watch."}, {"id": 466, "text": "Dreadful acting, dreadful six, just dreadful full stop. I read the reviews n got 20mins into it n realised the reviews were spot on. Aliens fighting humans over a garden fence......absurd! Dreadful!"}, {"id": 467, "text": "Too many contradictions, silly things, ideas ,even quotes it turned to be completely comedy laughing on production and stupidity If you are reading this before you see it dont wast your time , if seen already stand in the line and try to compensate the time lost"}, {"id": 468, "text": "Even I finished this movie, I felt really bad about australian film industry. What a shame on story line and pictured."}, {"id": 469, "text": "The premise of the movie is okay but that's it. The background music is just awful, they play it at the wrong times and the choice of music is just bad, it ruined the movie for me more then the writing."}, {"id": 470, "text": "I managed about 15 minutes until the camera started shaking around all over the place. Shakycam strikes again. There should be a negative star rating available for this sort of rubbish..."}, {"id": 471, "text": "This movie looked so promising with a good cast, budget and strong social media promotion but the actual film itself was horrible. The storyline was a rip off of so many other films (red dawn, battlefield earth, tomorrow when the war began etc) but just done poorly. I will admit that they saved the worst part for last when the group attack the enemy position and one peanut is armed with an Aussie flag. This film should only be watched as a cautionary tale of what clichés need to be avoided when making movies. It will make you want to punch your TV."}, {"id": 472, "text": "I...just...have...no...words...to...describe...how...bad...this...is. The plot is dreadful, the acting in a kindergarden play is better, the aliens are dumb, the humans are dumber, and i am the dumbest of all for wasting my time! Learn from my mistake and don't waste yours."}, {"id": 473, "text": "Ok, I could have turned this film off anytime but I felt invested and thought it might just get better. Unfortunately not. This is an awful film. A cross between 1950s Doctor Who and Home and Away."}, {"id": 474, "text": "Seriously, avoid this movie. The premise is a good one, but they totally blew it. The story, acting, etc is so cringe and not in the funny way. I mean, i did laugh, but i shouldn't have. All i gained from watching this movie on Netflix, was two hours of my life wasted."}, {"id": 475, "text": "A horrible show!!!! I kinda expect something this bad as an after school special show. Below amateur grade directing and....screenplay???? Background music throughout the movie truly adds to the amateur feel this movie gives off. A movie as bad as this deserves to be banned!!!!"}, {"id": 476, "text": "So sorry to all the folk who contributed to making this film, I am sure you meant well but nobody comes out of this with any credit. Just believe you can do better and make it happen - you will laugh about it one day (maybe you are already......)."}, {"id": 477, "text": "This films follows the exact same beats as red dawn to the letter, invasion, light revolt, building the resistance, resistance crumbles, military saves them and so on but the twist is it's Australian wait you say that already exists in a much better film Tommorow when the war began (you should totally watch that it's not bad) ok no the real twist is aliens but it's not done in a looming threat Independence day style it's done in a ground war way so the aliens could easily be substituted for Russians, Koreans or whatever which I'd say would be pretty sick if it wasn't for the fact that every fight just kinda sucks they seem to be able to show cool spectacle and all that but whenever a fight happens it becomes a lot harder to see anything and barely shows any action just people shooting not what they're even shooting at it happens a lot in these alien action movies, I'd also mention that unlike red dawn all the important characters have plot armour in gunfights or are just not memorable enough for me to even notice them dying. There are positives in this film it's got decent action and some spectacle but anything above 3 would be way too much credit for a rip off of a rip off of red dawn a film that's basically been made like 10 times already. My overall for this movie would be if you've got 2 hrs to kill and haven't seen red dawn (that's a crime I'm sure) give it a watch the dialogues pretty cheesy and it's got jango Fett in it but if your a big red dawn fan this is not really a great homage unlike the movie I mentioned earlier."}, {"id": 478, "text": "I get it, its cheap. To keep it cheap they need to minimise the action and CGI and focus more on the drama, but that's only going to work if the drama is good.Really you should root for the humans in these movies, but when they all turn into insufferable gits, it's hard not to just want the aliens to win, or better yet, both sides kill each other and end everyones misery."}, {"id": 479, "text": "I will break it down pretty simple into a few main points with out spending all day with details. 😂Budget used well on effects.Optimistic efforts from a small studio that with enough fan support could produce good films in years to come.The acting was very spotty.Writing poor.cliches coming out the wazoo!Why are aliens always so dumb, and why do they always have such an exploratory weakness..... really they can't see trees! 😒P.C. Message subtle as a brick to the face.I enjoy the watch but I also enjoyed Sharknado, if you know what I mean. 😉"}, {"id": 480, "text": "Could have been so much better but let down by a confused script. Let down by jingoism at the end."}, {"id": 481, "text": "OCCUPATION is another alien invasion flick, this time hailing from Australia. The cast is undistinguished apart from old timer Temuera Morrison, who probably deserves better. A bunch of characters are going about their ordinary (read: mundane) lives when a bunch of armoured humanoid aliens invade and blow everything up and shoot people. The survivors regroup in the woods before engaging in a low rent fight back. The one decent thing here is the calibre of the special effects, better than they have any right to be, but the trite, soap opera-style script really lets it down."}, {"id": 482, "text": "TERRIBLE ..... . . .... .. ... ...... .... . . . ... .... ..... . . ....... . . ..... ... ... ... ... ....!!!"}, {"id": 483, "text": "Fun comedy-drama .. Will Americans always save this damn planet. This time we will save. Join us, alien brothers. Come let the alien brother drink tea. Your cloaks are cool. You look a lot like us, man."}, {"id": 484, "text": "I don't think I have seen so many invasion movie cliches thrown into one movie. This movie was so bad I don't think I have ever cringed so much watching a movie before. The acting was so cheesy, the special effects were made by one dude with after effects, the aliens couldn't look more like men in suits. I reckon a AI in 2018 could come up with a better script than this to be honest it's laughable. I gave it 2 stars because it put me to sleep."}, {"id": 485, "text": "Imagine Tomorrow When The War Began (movie) but with Aliens and a nauseating amount of cringe. Actually if you use the television series of TWTWB with Aliens you're about there. I understand that producers have to start somewhere but Netflix is killing me with this stuff."}, {"id": 486, "text": "Enough said. Oh, wait, apparently I haven't said enough. Ok then, we'll hopefully 'truly awful' gets me over the line."}, {"id": 487, "text": "This is what happens when you have a subpar cinematographer that gets carried away with too many set-ups, and violates the 180 rule so frequently I felt nauseous.The script really made the movie tank, with wasted footage of banter and seeing everyday lives-too much of this!However, at times the shots look cinematic with good lighting. Then.....it happens again--bad dialogue!Less is best. Get a better script writer and watch a Spielberg film for camera set-ups."}, {"id": 488, "text": "Silly movie. Great cinematography. Bad acting. Weak story. All mixed in with preposterous, nonsensical millitary tactics on the part of both the aliens *and* the humans. Yoga teacher chick, anti-social types and skinny teenagers save the world! Such a dopey waste of time. It's amazing that so many poor movies like this actually get produced!"}, {"id": 489, "text": "I'm a big SciFi fan and enjoy Australian productions - when they're good, that is. This one, like so many others have said, is just plain BAD. Just watched this on Netflix and cringed the entire time. I was ready to give up but forced myself to watch the whole thing for a fair review.Incoherent story line, poor screen writing, directing, acting, cliche-laden, over-dramatized in some scenes, under-dramatized in others, and far removed from anything real as it relates to people behaving if we were under alien attack/occupation. Yes, definitely a Falling Skies rip-off - just a very bad one.It's almost gimmicky - they could easily have made this into a satire/comedy with only minor changes.And OMG, I just found out they're doing a sequel... Why oh why do lousy productions get the money while truly great ones don't?"}, {"id": 490, "text": "Bad special effects Bad filming Bad lighting Bad caracters Bad voices Bad storie Time wasting"}, {"id": 491, "text": "Love alien movies but gave up on this one after 20 minutes. I found it laughable."}, {"id": 492, "text": "But this was gut wrenchingly horrible. Bad acting, ridiculous plot lines, etc.. bottom line, I learned the difference between cheesy and crappy. This is the latter."}, {"id": 493, "text": "Just meh, this movie started well but became very predictable. Shouldn't of introduced the military. It was doing fine before that"}, {"id": 494, "text": "I had high hopes, but unfortunately, that didn't pan out. I'm always astounded that an Technologically Advanced Race, travels interstellar distances, and doesn't even have 'modern' Fire Control Systems, or Targeting tech, that we've possessed since the 60's!? Add this to things like the 'Soldiers' firing their M4's, by 'shaking' them, and NO Brass ejecting, the dust covers over the ejection ports, closed, while overdubbing 'pow,pow, pow's'! :-( Just plain silly at times..."}, {"id": 495, "text": "Worst scifi movie ever. The story, the plot, everything.The aliens wearing capes pretty much summaries this masterpiece"}, {"id": 496, "text": "This is as ridiculous as those trash pathetic movies"}, {"id": 497, "text": "I will not sit through anything I rate three stars and below. This just made it. It starts off well with some pretty good evil alien action against a small defenseless town. It soon, however, becomes a Red Dawn rip off with elements of another Aussie occupation film. It has implausible moments and the aliens are both awesome and really stupid. It suffers the PC contagion in which women must be as badass as men if not more so. Tiresome. Overall, it's fun and if you have nothing else to do ...."}, {"id": 498, "text": "A horrible funny movie to watch while being high tbh"}, {"id": 499, "text": "This was was almost unwatchable, sorry Australia I love you but this was awful"}, {"id": 500, "text": "There are production values here. Special effects, sets, acting, and dialog were all acceptable. The story, however, was not. It was, by turns, trite, sappy, and just plain ludicrous. Worse, though, was the soundtrack. Yes, we get the point. It's an epic battle for the survival of humanity. You don't need to constantly beat the audience over the head with the Star Wars-esque orchestral arrangements. It simply never lets up.If you really need to see an alien invasion movie, see Cloverfield or Independence Day or War of the Worlds or Monsters. If you've seen them already, see them again. Better than wasting two hours on this one."}, {"id": 501, "text": "The plot followed a very familiar and predictable path. It was a less impressive Red Dawn. The characters were annoying. I found myself not routing for any of them.What set me off most is the incompetent aliens. It pulled me right out of the movie and had me laughing at the ridiculous nature of many of the scenes. 1) The alien fighter drone strafing runs at the invasion's onset were inline with aircraft from World War I in speed and weaponry. 2) Then those drones are shown going toe to toe with the Aussie Airforce. I'm sure they are first rate and good pilots, but I expect more from a race of people that travel across the galaxy. 3) The alien foot soldiers get on line like the 18th century British army and march slowly towards the running spectators. What was that? 4) They went through the trouble of keeping humans alive so that they could work fields by hand? Didn't they bring any farm equipment in that big ship of theirs? Those scenes resembled Japanese WWII work camps. I think that is what they were trying to go for.I will stop there. They didn't have a clue how to make the battles realistic. It wasn't even close to something that I could believe. I really tried. I love this genre."}, {"id": 502, "text": "I would actually like to give this film a 10 for how amazingly bad it was. So bad it had us in stitches for the whole movie. Power to the resistance!"}, {"id": 503, "text": "Poor continuity, simplistic plot devices, terrible tactics, implausible failure to use obviously superior technology by the aliens. A hodgepodge mash-up of Red Dawn and Independence Day. I watched it to the end, but I'm not sure why. Maybe because I had nothing better to do and it was cold outside. Darn, I could have washed my hair....."}, {"id": 504, "text": "Looks like all the reviews that gave this movie a decent rating are all written by the same person...??They all say the same thing. Something about a budget and being as good as a US blockbuster being that it was Aussie made..Silly. Do a better job at, basically, fake reviews next time."}, {"id": 505, "text": "Only saving grace was the hot actress stephany in the whole thing.Her acting suks as well but she is hot. anyone who voted this higher then a 1 is braindead."}, {"id": 506, "text": "From the casting team that brought us The Walking Dead, it does feel a bit soap opera-like. The moustached character's John Hanna impersonation is spot on. Feels like it should have been a pilot for an uber-mashup War of the Worlds Red Dawn Down Under Walkabout Dead. Advanced species of space warriors whose weapons aren't DNA-locked to their owner?"}, {"id": 507, "text": "How wack, you can clearly see that this movie was based off of a laser tag match. This movie is as bad as after earth..."}, {"id": 508, "text": "Like, Attack of Stupid Alliens. Attack on small town football field as strategic goal of allien invasion is stupid goal. I didn't realize, is it commanding colonel transgender or woman? It is more comedy. I was laughing most of the time."}, {"id": 509, "text": "As a film it's rushed and feels like a 100 trailers stuck together. would have made a good series though and then you could have forgive the rubber masks.shame."}, {"id": 510, "text": "Poor acting, simple story line, aliens speaking English? Come on 🤣🤣🤣. Couldn't stop laughing"}, {"id": 511, "text": "This is one of those movies that is so bad it has to be destined for greatness. I predict that theaters around the globe will have midnight showings where devoted fans will dress and recite bad dialog until the wee hours of the morning.Not me though. I feel less after watching this monstrosity of a film.Ed Wood , eat your heart out."}, {"id": 512, "text": "The start of this movie is a bit slow. It also has a slight comedy touch to it which makes you wonder initially if what you're going to get is going to be more spoof, at least not taking itself seriously, or a proper alien invasion movie (the overall premise). In the end it fluctuates between all three at times, often unintentionally. The lead into the action takes too long for a modern movie, and the delay isn't used to build really strong characters. In the end what you get is close to soap opera level acting, that builds to an invasion scene that doesn't really make any sense. The invasion sees alien craft followed by foot soldiers attack a small town in Australia. We are left to assume the same thing is going on all over the world. This is a common theme in alien movies, it happened in Independence Day and Battle Los Angeles, not to mention the Skyline, Battlefield Earth, and War of the World's movies. However, why would an alien race, one capable of travelling likely millions of miles in craft that would have to be hundreds if not thousands of years ahead of us in technological capability, need to deploy aircraft and ground forces at all? Would not such a race have biological weapons of such lethality that they could be silently and secretly released on to the earth by an advance party, and as a result the whole human population of the earth is dead and gone by the time the alien main force arrives?How about advanced weapons of mass destruction, i mean we have nukes, don't they have serious bombs capable of flattening whole cities to save the trouble of clearing a house room by room like happens in this movie?How about drones, millions and billions of tiny mass manufactured drones, they could do a better job and they're less susceptible to being shot, strangled, or punched. In the end, the path this movies chooses to take is an old, worn, and long past it's time one. What happens next is the movie becomes something of a mash up from Red Dawn (the amazing Patrick Swayze and Charlie Sheen movie - not to mention some of the great 80's brat pack era members) and Falling Skies. The idea of a small band of humans holding out against an advanced alien race is to be frank ridiculous (as noted, technology would see us disposed of quickly). However what undermines this more is that the aliens in this really look like they've been put together using left over costumes from Lord Of The Rings, Most of them are about the size of Orcs, they wear a metallic armour that looks like poorly cast steel or iron, and it lacks any sense of fitness in design. The big issue is the fact that they have the same body construction as a human, two arms, two legs, torso, head - yep, just men in suits. In this day and age, in a time where we can do some really cool stuff with CGI and effects, choosing to put a man in a suit is just beyond lazy. The alien is the central focus of your audience attention, they want something cool, original evolved in a different environment. What we get looks like a rejected Tin Man from the Wizard Of Oz. Follow the lack of alien originality with their weapons seem to be semi automatic laser type weapons. They're large weapons, they show no real advantage over any modern battlefield rifle used today. They certainly have no advanced optics or flexible rate of fire option. I bring this up as again, it is a lack of imagination. It's like the Enterprise showing up and we learn that Captain Kirk and the crew have never heard of a refrigerator and instead keep all of their food in a dark pantry room in an effort to keep it fresh - the technological disconnect would just demand too much suspension of disbelief. All of this points to the lack of originality and imagination on the part of the writers and the effects people (although i suspect it really is the former and budget is the constraint of the latter).Now, despite all of the issues with the above, the cast, crew, do a really valiant job at trying to pull this off. Yes, most of the acting is at Soap Opera level, but they work hard and hold it together, most give reasonable performances. Where they are let down as actors i believe the script is to blame. The script and story direction is pretty awful in places. It moves deep into cheesy territory at times, and at others has quite real dark moments - it's like a script written by committee or by an author over several weeks where their mood changed a lot. What we don't get is a consistent scary alien flick, or a comedy or a thriller, In fact, it comes across more like someone decided to do a pretty decent job of videoing a theatre production. The other let down is the lack of central characters. The survivor group is large, yet few of them are well enough written or acted to really make them believable or sufficiently enticing to root for. IMO Stephanie Jacobsen is probably the most credible. The rest have very much of an air of Australian Soap Opera about them. Because the story is spread thinly across a group you don't really have a strong lead, there is certainly no Will Smith or Jeff Goldblum in this movie. Finally, the movie does jump around a bit in time, skipping ahead to (i assume) progress the story to the main action. However this then introduces more characters and you're still left wondering why the aliens are really here and why they look like Orcs in badly made armour, and why they need to attack earth in some World War 1 style ground invasion. But, the clim progresses to a close, which unusually results in a peace being brought between the victorious rebel humans (I mean as if there were ever going to lose against an advanced alien race capable of designing a craft and then piloting from another universe - the advantage of technology in the discovery of America and Africa come to mind). Well, the aliens lose but hey, some of them form an alliance and battle together. So the ending falls flatly into the cheese zone - especially the awful handshake scene. So that about sums this movie up. The Australian Film and TV industry is really doing a great job growing up. You can't compare this movie to a hollywood blockbuster, but what you can see is that the Aussies are making a valiant effort, they just have further to go (but i'm rooting for you Australia). It's a B movie, it's not got a chance of being a blockbuster, but give them time and maybe a better story and script requiring less action and effects and they really could start producing something to rival hollywood. So all in, this is a hard movie to review and score, as it's a bit like that student in class who has really tried hard despite consistently coming in toward the lower half of the class, and yet keeps making a valiant effort and lands something aspirational even if it lacks genuine polish. You can't help but pat them on the back and congratulate the effort even if the final product left a lot to be desired. This movie is a C+ for a maturity as of yet E level Aussie film industry."}, {"id": 513, "text": "I was pretty excited when I read what the film was about, and even more hopeful when I saw who was in it (I really liked Stephe Jacobsen in BSG Razor &amp; Terminator series). But yea, as many people here say, it was very poorly done. I have to give the production team kudos for the attempt, it must have had a decent budget, but so many of the scenes had me cringing and face-palming. I wish they had made better material to replace a lot of these terrible scenes, it was just filmed so poorly, and edited worse. Like those 2 silly shots of the camera aiming down the gun. They missed! I guess they just didnt know how to do that!  Still, a good try, i hope they will learn from their mistakes and come back with a better film!"}, {"id": 514, "text": "To help get through this movie, I decided to write a review. It is awful. I just passed the part with the drawn out Hollywood Birthing Scene. Fifteen minutes of bloodcurdling screaming and panting. I guess it was that actress' 15 minutes of fame. I know it's only a B movie, but come on. Even for a B movie, it's bad. The screenplay is dumb. The sound effects are terrible.The dialogue is stupid.The plot is a boring mishmash of 1000 alien invasion movies before it -- Aliens invade earth. They fight. Can you guess how it will end?This movie has absolutely no redeeming qualities. There are no interesting moments. If you want to see a bad movie that's actually funny, I recommend Tommy Wazoo's The Room. The Room was even a labor of love.Tommy Oiseau put his heart into, and even though it was amateurish, it was enjoyable.Anyway, avoid Occupation 2018. It looks like some crap some crappy producer slapped together one weekend because he had some time and money to burn."}, {"id": 515, "text": "Atrocious score - seriously unbearable and you could not help but notice it. Had that been better, the film would have shown much better. Terrible screenplay - did anyone re-read this? The concept was interesting but there was just too much unnecessary fluff, plot issues, and pointless scenes. Bad editing - was it even edited? Had it been/done correctly, they could have cut the many dragged out scenes for the ridiculous 120 min length and made this a bearable 80-90 min film.The only redeeming qualities were the fairly decent SFX for a 4M low budget film, the cinematography was good, and the acting not bad for C-B-list actors, although they could have been directed better and would have performed better on a better screenplay. Some of the casting was just wrong - e.g. the 5' skinny blonde female army general(?) that couldn't act smh?I really wanted to like this film but I just couldn't bear the above negative points. I actually had to fast forward past the useless scenes.What's even worse is the once again 10/10 fake reviews these producers feel can sway the viewers. It's clear they are all fake when you click on the user and see it's their only review. Sad film making. A generous 3/10 from me. Don't waste your time with this one. Can't believe they are in production for a part 2."}, {"id": 516, "text": "The first twenty minutes you get a setup with most of the famous actors from down under, so you think this might be good. Then it begins and you see special effects from the 1980's. I don't mind low budget Sci-Fi - there are some real gems out there - but any decent director could use a wide array of tricks to get around that. Alas this was just painful. The actors and the FX team did their best but this movie slides from would be Hollywood, to Doctor Who TV show, to film school project in less than 30 minutes. I tried to enjoy the story but it makes no sense. I highly doubt if the writers have ever read any book about science or warfare. The characters are clichés and you never really care about them. The film's high point scenes are cheesier than Pearl Harbor and The Patriot combined. Nearly 80% of the movie is shot on one location and again the director fails to compensate for it . The list goes on and on. Easily one of the ten worst movies I've ever seen. Normally I would just rate this and move on, but when I read the reviews here I simply had to act. Only way you can enjoy these 2 hours is with a group of friends and a drinking game."}, {"id": 517, "text": "How this has gotten enough positive reviews to get a 6 rating is beyond me. I don't normally bother to do something like write a review and definitely not a bad one, but this warranted it.It is like they transplanted a Australian 1980's B-movie director to the present day and he tried to condense the TV-series Falling Skies(which is a half-way decent series) into a movie using every cliche imaginable with a sprinkling of Red Dawn on top.If I were to sum it up it is like what could have been a good story was re-told by an over 12 year old boy, skipping ahead when there should have been detail and spending a lot of time elaborating poorly on action scenes.Could have been a good movie and the story is actually not that bad but the way this is made is just.. bad."}, {"id": 518, "text": "This film is great! Let me tell you why;Comparing this film with Hollywood blockbusters is difficult, but seeing what the production team have accomplished with just a few percent of what a big budget film would spend ($5M&gt;$100M), and you truly come to appreciate the work put into this film.It is honest. A real portrayal of what the film makers believe would happen during an invasion of this nature. There are no precedents for a situation like this, and they have taken great liberties to create something believable and grounded, while also allowing for a wider scope to let the story grow.The cast are all tremendous with an ensemble cavalcade delivering touching, emotional and at times brutal performances. They take stock of the situations they're in, and are pushed and shaken, during victories and losses. For a number of the cast, this work is some of their best to date.Is the film perfect? No, but what film is. Are the performances perfect? Some, but not all, and again, no film has a completely perfect casting slate. But, this film deserves to be praised, for taking a chance, for pushing the boundaries of what local content can create. To achieve so much, wiht so little, is remarkable. Give this team a Hollywood size budget, then see what they could create.To the audience complaining about this film, and giving unjustified scores... Where's you film? Because I can't wait to review it..."}, {"id": 519, "text": "REVIEW - OCCUPATIONSometimes I do wonder how these people who claim to watch these films come to their ratings, as with a recent film called Hereditary. The press gave it top marks and when I was invited to go and see it, it was literally rubbish.This film however is the opposite with an average of 5 out of 10 I do wonder if these reviewer's even watched this film became I thoroughly enjoyed this, from start to finish.Camera work was exceptionally good using a technique I've not seen used by Hollywood!The story and the way its told was riveting, intact it remanded me of season one of Fallen Skies.Its great to see a country other than Hollywood put out a film that can rival Hollywood and to boot some genuine Australian humour is thrown in for good measure actually adding to the believable characters who act extremely well.Not as good as some films but defiantly better than a lot of other's.Rating 8 out of 10"}, {"id": 520, "text": "Not a good film.Poor camera work and editing, too many light flares, too many swing shots and enough trolley work to make you travel sick.Script is dry, delivery ranges between p*ss poor to not too bad and story extremely predictable, occasionally it does come together with the odd pithy comment, well delivered and well timed so not all is bad.Special effects are on par with a home movie, action sequences too 'acted' although the humanoid aliens outfits look good.On the plus side, all the actors are giving it 100%, even at the cheesiest of moments. And there is a lot of cheese.What I did like was the locale, scenery is great, and whomever the extras are (I assume local folks?) come across as having a really good time.While not the best of movies, it's a slow but solid start to the producer, writer and director. I'd be interested in seeing their next science fiction film."}, {"id": 521, "text": "Aliens invade Australia and interrupt some kind of weird version of rugby with what are the coolest scenes in the movie as the crowd wonder what this firework display is and of course film it on their phones rather than running like Hell. Nobody seems that concerned that aliens are invading the Earth they run but don't act particularly frightened by the turn of events. The acting is some level below bad! After that it's all downhill as the cast act out various scenes from Red Dawn and take the fight to aliens who have a lot of trouble hitting anyone with their superior weaponry. The humans are better shots with these weapons than the aliens.When not in their armour the aliens, for no sensible reason, wear rather nifty cloaks. Possibly to keep their wallets or their glasses in, possibly in some kind of homage to Clint Eastwood. We never find out. We have the usual cliched group of people and they form themselves into The Wolverines and the resistance in the woods that inspire the country's military.  Red Dawn 1984 plays a major part in this movie. Except Red Dawn 1984 was good and this isn't.The film benefits from not having the US Army saving the day and it gets #1 for that but as alien invasions go this has got to be among the worst. Even more laughable than Alienate although without plastic ray guns and silly hats.Honestly BAD does not even begin to get to the nub of this 2hour bore-fest."}, {"id": 522, "text": "There was strong language in this movie, it also had some intense upsetting scenes, with a scene that was inappropriate for young children. there was blood, death and murder which played a big role in this Movie. In one of the scenes there was a crowd of people that was wondering what the thing that was in the sky looked like a firework display but it was spaceships Nobody seems that concerned that aliens were invading the Earth, they started to run but did really act that frightened by the turn of events. Other than that the acting was okay, and I think if they had a little bit more to work with it would have been bester acting. The only thing I found really interesting was when we first saw the aliens but after that There wasn't really any interesting moments. It got a bit boring at times and I think it would have been better if the paste was a bit faster. There was a few scenes that didn't really make any sentence and that was in a scene were aliens was attacking from the sky, looking down at the humans and the main Characters drives around and goes into hiding with their car spotlights on. In this Movie it does skip 8 months which I'm not a fan of. If they really needed to do it I think it would have been better if we were showed a time-lapse. I think I would of liked it more if there was a bit more Character development, I think I would of liked it more if the main Character were my age. I liked the music that was used, and the Movie was funny at times. I liked the use of technology and how it showed us the text messages on the screen. I also liked how this main Character called Bella was a vlogger, I don't really see many vloggers in Movies, I think it made the Movie a little bit more realistic. I liked Jackson Character because he was funny, and Samuel was cute but he didn't have much screen time. I liked the funfair scene, I really like funfair, I like all the lights and rides. And I think in this Movie them scene were shot good. I liked the special effects and make up. I also liked the aliens costumes. I think it was cool how the action scenes were shot it felt like I was there. I think the scenery was really good. I think the ending was good and I want to know what happens next."}, {"id": 523, "text": "Many here are slating this film rather harshly and unjustly.  And from reading some of their comments, I have to say it seems obvious some people are clueless on what consists of an actual BAD sci fi film! And ultimately how crappy some Australian films have been in the past! Australiens was a BAD Australian sci fi film.  Tarnation was a BAD Australian horror film.  Yet I found Occupation to be a fun romp, of a familiar nostalgic 80's vibe. Yes the aliens are somewhat stereotypical once their badass helmets come off. However Luke Sparke has proven in the past with his Aussie thriller Red Billabong, that he grounds his creatures in his features within physical reality.  So yes, naturally the common known rendering of an aliens image is going to be his first choice.  The helmets are very cool. A simple yet stylish, almost warrior like appearance, creates a fearsome image when these beings land and ultimately begin their massacre of humankind.  This is the film's main message. The threat to humanity from others. The need to battle to survive. Sparke does approach this with great class through his ensemble cast and the characters they each portray. Through everyday folks like you and I, who band together as a resistance team to fight back, we see the small take on the large. The weakened defend themselves against the strong. And that is where this story finds its heart. A small community in country Australia filled with everyday working folks trying to battle an intergalactic assault. With a dramatic quality similar to Tomorrow, When the War Began and the action sci fi edge of older films like Red Dawn, Occupation paves it's own path to an intriguing conclusion set to divide viewers.  However I implore you to remember a sequel is already in the works, so much left somewhat up in the air will be extended upon in the next instalment."}, {"id": 524, "text": "I went to this movie with a group last week. Only knowing a little about the film i did not know what to expect. What a pleasant surprise! I really enjoyed the films story, the actors and the character development and inter-play with each other. Mostly, I was impressed by the fact that this was the writer/directors only second full feature film! How is it possible for us to grow our local Australian talent if we A] dont go and support the films and B] If we dont fairly review what they achieve without judgement. Those living in glass houses are always throwing the largest stones! When are we going to stop knocking everything and start supporting and encouraging. I personally enjoyed the film Occupation, as did all of my group.  Yes I have seen better films and yes I have been moved more by actors and story-lines. However they were mostly huge budget films. BUT have i seen a great film like this with the special effects, huge Aussie and international cast members &amp; crew and a NEW Aussie Sci-fi Genre, NO i haven't. Lets encourage our young Australian film makers with support, and help them keep growing and improving as they mature. That way we will keep our directors local AND we will see our Australian film industry improve!"}, {"id": 525, "text": "Occupation tells a story that is cut together across almost a years worth of action and tells the tale from the first invasion to the first major success of the war. I enjoyed it, and a big thumbs up to the Australian film industry. The acting and direction is great. The script covers many months of activity and reveals the personality of characters at quite a pace. The backstories are raced through so you only get a small background about them which needs to carry the characters personlaity behaviour that drives their actions through the movie and you don't quite get to feel immersed into the conflicts of characters as much as could have been the case. I think this story line alone could have been turned into a successful TV series of at least 4 or more seasons. This would allow each character's backstory to grow and allow the audience to be captured by the potential depth of light and dark sides of each character. There is plenty of story line in between everything you see in the movie. As a TV series, I would have certainly watched it. Good movie, that could be a great TV series."}, {"id": 526, "text": "'Occupation' is an Australian indie film, which happens to be a sci-fi invasion film with lots of special effects. It's essentially a cross between 'Tomorrow, When The War Began'/'Red Dawn' and 'Monsters' - and unfortunately isn't as good as any of them. Its not all bad, but you can tell it's a low budget film with not the best actors.Part of the problem is too many characters - 10 main ones. Why not just focus on four or five? The main stars are Matt (Ewing), Peter (Morrison), Amelia (Jacobsen) and Jackson (Terrier). Other major gripes: why would aliens invade Murwillumbah, population 10,000? Why would they be playing Australian Rules and not Rugby League? Why do aliens always have to be humanoid &amp; approximately human-sized? Why do they need to have such large eyes? That being said, it's nice to see Aussie scenery &amp; hear our accent for a change and the filmmakers certainly tried.There's probably a bit too much shaky-cam and gun battles, but the main concern is that a lot of it comes across as too corny and/or earnest. Could've done with a bit more humour/tongue-in-cheekness. Some good explosions and fight scenes, and doesn't take too long to get going."}, {"id": 527, "text": "I see a number of negative reviews on here but yo give a movie a 1 is beyond me. Now granted some of the set pieces do out stay their welcome but that said there is something happening ft or the majority of the 2hr run time..The director here has pushed outside of the standard australian feature thatcwe produce..I.E slow cooking meat and cracking dad jokes for a strictly limited Australian audience. Here he has made positive steps to push into the American market.Now I have seen this multiple occasions and can tell you the second viewing was a much smother viewing. Yes there is some editing issues and also a few to many subplots for its own good. Some solid performances mixed in with some fledging actors just cutting their teeth.A solid entry that will be build upon in the upcoming sequel!"}, {"id": 528, "text": "Perhaps you shouldn't take this review too seriously, why? Because I walked out after about forty minutes, then I walked back in periodically until the last few seconds. In case you are wondering why; I was bored.I don't want to understate the quality of this movie, it was/is a great quality movie, at least in respect of the GCI, sets and lighting, I would include the acting but frankly they weren't allowed to act because the boring (and I mean BORING) story line didn't allow them to. The directing could have been good but if the story directed the director then, it was in the same boat as the actors.It may be a little unfair to pull the story line as the single failure of this movie in my eyes, because it may have been screenwriters that just got carried away who destroyed it, it may be that it has all been done before and there wasn't any deviation from the standard alien arrival movie. But whatever it was, the key phrase is: 'over and over again' throughout this movie.On a side note, didn't Mad Max originate in Oz? All that say about this being a Hollywood blockbuster from Australia, err? The Matrix was filmed in Australia, I believe that was a Hollywood blockbuster and countless other movies have been filmed in Australia, thanks to the Australian Govt. in part. This may be the first that has 95% Australian actors, perhaps that was why it was so bad? Can't be, after all where are Crowe, Kidman, Jackman and so on from.. ALL present in blockbuster movies!In summary; I simply cannot put my finger on what made this movie so bad, it just was."}, {"id": 529, "text": "This isn't a film, it's a two hour public service announcement saying Can't we all just get along?. If you like paying to watch propaganda then this is the film for you.For normal people, who go to the movies to enjoy an exciting adventure and not have political messages shoved down their throat, STAY AWAY for this movie! They should be paying YOU to watch this! And even if they did, you shouldn't accept the offer!It's boring and badly - and I do mean BADLY - written. It's about an hour too long. The makeup effects are laughable; basically straight out of an 80s B movie, and to top it off, they ripped most of it off of Falling Skies. The direction is terrible. The characters are illogical and idiotic. The CGI is lack-luster, like a SyFy original. The cinematography is OK-ish at best. But most of all, it'll make you cringe from embarrassment that you spent two hours of your life to watch Kumbaya from SpaceSTEER CLEAR!"}, {"id": 530, "text": "This is a ZAPFEST in a perfect landscape. It takes you along for a great ride. It is not a documentary about some invasion. It is delightfully tongue in cheek at times.That is the point for those who do not get Australian humour. There are also some great lines which is unusual in sifiland.Some people must be being paid to write bad reviews. This is a great film and up there with the best done in Australia. There are many good ones in all genres but hey, This is Scifi. Guess what kids, It is make believe and on-steroid aliens v celluloid heroes at the footy and in the bush. The characters were developed along with the plot so it was not just a prosaic here is the ex-con/ here is the ballsy army woman running the resistance. Everybody unravels as they do stuff. Personally I find it hard to get into some of the predictable sugar that comes out of Hollywood these days but this was real. Maybe not real but gritty enough.I thought the editing was great. Some scenes are so fast that if you blink you miss it and some details like that take more concentration than some of the naysayers on here have with their goldfish mentalities. Yea it draws on lots of themes done before but strings them together into something new and enervating. If you want special FX that cost zillions per second then watch a pretty tired Star Wars or something. If I want to be entertained then come into this alternative reality and suspend belief in your suspenders.It is not perfect, intellectual, politically correct or any of those boring things; nor is it meant to be. That is the ball-cracking 'gorge on Malteasers' fun of good sifi. I feel like giving it a high score just to counteract the juvenile idiots that panned this great little gem."}, {"id": 531, "text": "Occupation is an Australian sci-fi action film written and directed by Luke Sparke. Starring Temuera Morrison and Felix Williamson, it is a fun character-driven alien invasion film with a unique Aussie twist.After a large group of alien spaceships attack a small Australian country town, an unlikely group of locals, led by Peter Bartlett (Temuera Morrison), band together to try and survive the onslaught. Over time, the group work hard to figure out the aliens' weaknesses and why they are invading Earth in the first place.While not perfect by any means, Occupation delivers the right amount of enjoyment one would expect from a film involving a hostile alien invasion. It's so rare to see an Australian film with such high production values and practical special effects, although there is the occasional scene of cringeworthy CGI. The aliens are smart and don't make stupid decisions, which helps add a sense of danger when the humans are fighting back against them. Also, I was surprised at how much I ended up caring for some of the main human cast, likely due to the fact that each one is given a distinct personality and aren't just boring cannon fodder for the aliens to mow down. However, some of the acting was quite poor in some scenes, with line-delivery on par with that of Neighbours or Home and Away. For the most part, this film feels as though actual effort and care went into making it and isn't merely some throwaway project just to launch an up-and-coming director's career.I rate it 6.5/10"}, {"id": 532, "text": "I love science fiction. However, this low-budget film really sucks. Occupation is incoherent and clumsy with a lot of sub-par acting. The beginning displayed potential. The film and the acting deteriorates fairly quickly after the first encounter.This is a typical, low budget aliens conquering the Earth film. Acting, writing, directing, and editing are pretty bad. For instance, the writers initially play up Stephanie Jacobsen as this tough person you don't want to piss off. They later decide to make her needy. Then change their minds again.The story-line is cheesy to include what the writers decide to use that ultimately makes the pack of rebels invisible to the alien's detection. Then not so much when the writers felt like tossing in an encounter between humans and aliens in a B-movie sort of way. Many scenes were just stupid and made worse due to poor directing, bad-acting and odd timing. For instance, for some reason a couple of rebels are suddenly running through the bush and stumble across a woman sitting in the field. The entire scene seemed odd and out of place. The writing and directing in this scene is also terrible and out of place.The army was also played by a group of low-budget actors who probably did their best. I give them points for effort.The end is as ridiculous and cheesy as the rest of the film. At this point you have pitiful looking aliens (looks more like rubber suits) who resemble rejects from the film The Beast With A Million Eyes (1955)."}, {"id": 533, "text": "I have been sadly disappointed by what has been on offer lately, a bit of an action addict and a dedicated sci-fi fan, most of the latest releases from Hollywood have, to be blunt, sucked balls or gone for cheap laughs, this has been rectified by one seriously impressive Indy movie, Occupation, and the pride in knowing it was filmed just down the road from me is very strong to say the least. I have no criticisms, no disappointments, no flat bits when remembering what I have just seen. On a scale of one to ten, I have no hesitation giving this a ten out of ten. Seeing Australia serve up how an action sci-fi movie should be done is quite remarkable, considering the budget and the cast. While there were plenty of familiar faces, none would be considered Hollywood A Lister's, I feel this movie will rectify that very quickly. I will be purchasing a copy asap, and waiting eagerly for the sequel, which, if this is anything to go by, will be a remarkable piece of sci-fi cinematic history. Kudos to the cast and crew, you have done Oz proud and from one avid sci-fi and action fan, a very genuine you bloody ripper. If you, like me, have been feeling a bit let down by the offerings of late, I have no qualms recommending you invest the money and time to sit back and emerge yourself in this action sci-fi masterpiece."}, {"id": 534, "text": "Gawd! So many problems. 1. The usual aliens come across the Milky Way Galaxy to find a new home because they destroyed theirs, and don't mind taking ours because we're doing the same thing. 2. Aliens for some reason took the long way around from the opposite side of the galaxy when (like instead of going directly from N.Y. to L.A. you go by way of Alaska first). By the way how they found our little planet amongst billions of stars from the opposite side with so much in between - who knows. It's so big even imagination doesn't help. It would have taken millions of years for our light to reach them so they should not have seen humans, and it would take millions of years for them to get here. 3. Aliens have the typical alien designed space craft (they all look the same for some reason). Usual excessive energy sucking heavy metal construction. Propulsion system never seen, but they hover as usual. 4. Alien spacecraft weapon looks suspiciously like exploding large firecrackers. Handheld weapons look like all other alien laser guns seen in movies. They must all go to the same arms dealer. 5. Our grunting aliens, of course, have the same body structure as humans even down to two eyes, nostrils &amp; a mouth, but to be truly alien they have to have larger eyes and reptilian skin. And, they an English handheld translator. 6. To save humanity (and other Earth creatures) a small band of Aussies escape to hand fight the larger aliens; steal their laser guns to use against them and eventually unite to maybe save Earth. Conclusion: Terrible acting, dialogue, effects, and non-creative redundant storyline."}, {"id": 535, "text": "Overall it's a low budget Australian film that tries a bit too hard to imitate big Hollywood and naturally falls short.Writing: There is almost no character development, dialogue is passable, seemingly major plot points are brought up and then dropped without having any effect to the rest of the movie, several characters and scenes/plot points make no sense whatsoever. Generic, predictable and pretty nonsensical ending.Direction: Is mediocre as well, shoddy camera work, overuse of slow mo, things popping in and vanishing from thin air from one scene to the next.Audio: Sounds and effects are ok, music is completely forgettable almost as if it wasn't there in the first place.Overall: It's not a horrible film, there are much worse stuff out there, but it's not good either, it's just mediocre hence the 5/10. It can be watched just fine without expecting too much or if you just want to pass some time."}, {"id": 536, "text": "Occupation was directed and written by Luke Sparke and stars Dan Ewing, Temeura Morrison, Stephany Jacobsen, Rhiannon Fish, Zac Garred, Izzy Stevens, Charles Terrier, Felix Williamson, Jacqueline McKenzie, Aaron Jeffery, and Bruce Spence. It follows the residents of a small town as they struggle to fight back against alien invaders.Plotting here is immensely familiar, essentially being Red Dawn but with aliens. Not a bad idea by itself. The residents of a small Australian town; including Peter (Morrison), his wife Jenny, and children Bella (Stevens) and Samuel, Matt (Ewing), his girlfriend Amelia (Jacobsen), Jackson (Terrier), and his girlfriend Vanessa (Fish) are among the townspeople who are either going to see, or are involved with a charity football game. As the game is being played, aliens assault the field and most of the aforementioned characters, along with Dennis, Arnold, and Seth (Garred, Mesure, and Williamson) with the exception of Samuel and Jenny escape in Peter's RV while the aliens kill and capture whoever stands in their way. After killing a couple of aliens via strength in numbers, the survivors find out that the aliens cannot see them because of the way their visors operate. They devise a plan to fight back and save the captured humans using the enemy's own equipment. The rest of the movie follows the main group as they cultivate a resistance movement, lose it, and regain it via the army and take on the alien leader (Spence) before the aliens can release a virus that wipes out humanity.Characters are plentiful, but that does not mean they are exceptional. Matt is a mediocre leading character with little to set him apart from others in other films of the genre/sub-genre. At some points he gets too invested in the war (at least that is what the film makers want the audience to think, but how can you get too fixated on fighting for survival? Isn't that the point of the resistance?) And he seems to have a pill problem that never comes into play. Amelia is supposed to be his attachment to the world prior, but she never has much of an effect on Matt. Arnold, Seth, and Dennis are all fine supporting members that do not get much to do so they tend to get lost in the shuffle as the movie goes on. Peter and Jackson are the most interesting ones, both having promises to keep as they continue to fight on. Peter is trying to find his wife and son, and Jackson is trying to raise his newborn daughter in the midst of a war, if the character count was slimmed down the focus on these two and their problems would have been much more interesting. Performances are fine, with Morrison, Terrier, and Jacobsen being the only ones to rise beyond passable.Action is decent but suffers from the editing in some scenes. While some of the set pieces in the beginning are excellent (the initial attack on the football game comes to mind) in their ability to create mayhem and confusion in the best of ways, conjuring thrills and spectacle seldom seen in most studio tentpoles, there are times where a less-is-more approach would have served to benefit the movie. Some of the engagements are montaged like Rocky 4, having little in the way of clarity and lots of problems with visibility. Alongside that, clearly Sparke loves style, having unnecessary amounts of slo-mo in situations that do not benefit from it. Some good action does exist, but there is a lot that goes overboard.Technically the movie is very strong. Effects work is fantastic for a movie working with such a low budget, especially compared to something like Independence Day: Resurgence, a movie with a $165 million budget, and effects that are on par with this movie. The design for the alien armor is just plain badass, with scrappy, yet futuristic looking plating and helmets. Length is where the mechanics falter, with such a long runtime the movie fails to justify it. After throwing cliché on top of cliché, and extraneous moments and characters, the movie does lose steam about halfway through. With a few rewrites the script could have been trimmed down by about 20 minutes and lost next to none of the impact. The whole virus plot point is just stupid, the alien invasion was already intimidating enough and there was just no need to add the extra act to the proceedings.Occupation is a serviceable, cliché, and far too long affair that would be trimmed for more enjoyment; but still has the highlights that warrant a single viewing. Maybe two if you've got to pick between this and other alien invasion movies like the 5th Wave or the Men in Black franchise.56/100"}, {"id": 537, "text": "Was this ever in a movie theater? I'm unsure if this was a direct to Netflix flick but here's the gritty review.This isn't an Action Syfy, its a Drama with a metric Ton of exposition and no Science or Science-Fiction and limited Action. This reminds me of a Red Dawn remake with Aliens and way more CGI.As far as the Science goes; Any Alien Race or Culture significantly advanced enough to traverse 65,000Ly or more would wipe out our world with little to No effort having never broken a sweat. Furthermore crossing that distance for a single planet is absurd as it would be far easier to take one of the millions of other Class-M (Earth Like World) in our galaxy that would have been closer to this supposed races Home world.Lastly I lost interest in this movie after maybe 10minutes and found my self fast forwarding skipping to find good bits of actual Science or any small bit of Syfy.On a side note note Not having some kind of massive Armed Forces of Entire World and all the Nations of Earth uniting and rising up to meet this extra terrestrial threat is just a complete wash and discount of Ronald Ragand showing the budget for this movie. Highlighting the lack of exposition and reasoning behind why they are actually here relying solely on dramatic tones and acting to fill almost two full hours of other wise nothing. Perhaps I fast forwarded through the bits of why these Aliens came here to begin with, but I doubt it."}, {"id": 538, "text": "To be honest I have never written a review for a film. However I loved this one and when I saw some very 'troll' worthy scores I had to act, because this film deserves way better than some of the leacherous 1/10s spat out.I was privileged to see a preview of Luke Sparkes Occupation with a great ensemble cast including Temuera Morrision, Dan Ewing, Rhiannon Fish and more great actors. I love Aussie films and their stars and I love good SciFis, this movie though is a sensational SciFi, made by a highly talented crew.I here the Independence Day comparison made repeatedly, to be fair I liked this more than the original Independence Day and it leaves other movies in this 'Alien Invasion' genre for dust.Quick synopsis, sleepy Australian outback town finds itself in the middle of a large Alien military invasion. A familiar yet different team of survivors band together and take the fight back to the invaders. Temuera Morrison is AWESOME, if you haven't seen Once Were Warriors track it down it was his breakout movie. Most of you will recognize him from the Star Wars movies as Jango Fett. He moves so effortlessly from protective father figure to uncompromising and ruthless freedom fighter, he is sublime. The other actors are great as well.I hadn't heard of Luke Sparke before, since seeing this movie I have been tracking down as much of his work as I can. He conveys stories so exceptionally well and his eye for cinematography is excellent.This was a movie of 2 hours that flew by all to quickly, whilst satisfying I really do want more of this film. Any great story makes you fell like this and this is.I can't wait for a sequel and there is already one apparently on the way.So yes a 10/10, was it perfect, not quite, but it deserves more that the trolly 1/10s so instead of a 9 this Aussie Sci Fi Spectacular gets a 10/10.P.S. I solemnly believe this may end up a cult classic like the iconic Mad Max ... time will tell."}, {"id": 539, "text": "Watching Occupation the second time around was even more powerful. More meaningful. Catching those little moments, those bits of dialogue, action, nuances, tones, subtle exchanges, glances, I had missed the first time, made the second viewing so much more rich and meaningful. It is rare these days to see an action packed film that takes the time to develop its characters, and places the focus on their inner turmoil. As viewers, we became intensely invested in their human tragedy and their safety. What a phenomenal movie. It is terrifying. It is electric. It is harrowing. It is relentless. But it is also beautiful, with its deeply moving moments of empathy, love, sacrifice, shattering grief, hope, redemption. Once the action starts - heart stopping, adrenalin pumping, recoil in your seat action - it never lets go. It does not give you a second to breathe. There is absolute chaos and utter terror. For the enemy is truly terrifying and truly brutal. I love the setting of the quiet little Aussie country town on the middle of nowhere. So real. So normal. So uneventful. So commonplace. So right. The scenery is simply breathtaking. Paradisiac and magical. But the real magic of this incredible film are indeed the people! The characters. And the artists who portray them. They are such a likeable bunch. There is an incredible, palpable connection and camaraderie between them all which gives this film a real sense of family. So many well known faces in Occupation, it does feel like watching family. Everyone is spectacular. It would be unjust to compare any role. Each one carries their weight in gold. But within this phenomenal powerhouse cast ensemble, I am truly in awe of the artistic excellence and mastery displayed by Dan Ewing, Stephanie Jacobsen, Zachary Garred, Izzy Stevens, Charles Terrier, Rhiannon Fish, Charles Mesure, Kat Risteska and of course Temuera Morrison, Aaron Jeffery, Jacqueline McKenzie, Erin Connor, and more. Occupation is that kind of movie, with its powerful message and endearing, stellar cast of characters that digs a little alcove in your heart and settles there.  I want to see it again!!!!"}, {"id": 540, "text": "It's 11PM. Netflix told me this movie was 99%. My wife just couldn't. She gave up after one hour.I'm writing this review while watching the last 20 minutes....in order to SAVE humanity of boredom and anger for refusing to give up and watch this Oscar winner to the end.To the Aussies: So you make fun of Americans for making some bad movies, eh? Well, if we're sitting in a bar drunk and you point to He-Man, I'll point to this masterpiece. And I'll win that argument. Case closed. At least Dolph Lungren had a shiny cool sword.Ok. Just now, he movie ended. The last scene was some Aussie carrying the Aussie flag over a hill of rubble with his buddies. *facepalm* So much cheese in this I could make a quesadilla!I'm glad my wife went to sleep. She would not forgive me this Friday night if I'd force her to watch it to the end...she would make me clean the toilets in the house on Saturday morning--missing some football games.Since Netflix gave a 99% recommend rating, I'm cancelling my account tomorrow. The fraudsters CANNOT categorize this movie (based on my high ratings I've given for top shelf stuff) equal to my other all-star favorites like He Man! Now way! No how!And, because of this movie, I'm also taking visiting glorious Australia off my bucket list. The Great Barrier Reef is dead anyways and knowing my luck I'd like get bit in the ass by an Inland Taipan! :=/"}, {"id": 541, "text": "So much hate in here! One of my simple ways of judging a movie is, If I'd gone to the theater, and paid money to watch, would I have gotten my money's worth? And yes, I believe this would have been worth it. It is not a GREAT movie. It has it's shortcomings, for sure. But it IS an entertaining watch. I suppose it depends on one's frame of mind. It reminds me of a very, very good B movie. It rips of many earlier shows. Falling Skies, Red Dawn, and many others. I thought it a bit of a reach that the aliens decide to launch their conquest at a ball game in Australia? And make Sydney their base of operations. But once I got passed that? I enjoyed it. Started it late one night, and watched the whole thing. Acting wasn't terrible; writing was ok. Effects were quite decent. In some ways, it reminded me of Mad Max. Not really a polished product, but entertaining. As I write this, I just finished watching Annihilation. A truly slow paced, big budget, Hollywood production. Utterly boring, over pretentious, and tedious to watch. Occupation is FAR better than that! Don't go in expecting a huge, multi million dollar Hollywood blockbuster... and I think you'll find it worthwhile."}, {"id": 542, "text": "This isn't one of them.Predestination, Triangle, Otherlife. These are some of my all time favourite Sci Fi movies and it just so happens that they are all Australian.So when I saw this little known Aussie Sci Fi flick pop up on my Netflix suggestion list I thought I'd give it a go.What a mistake that was. It wasn't even good in a bad movie kind of way on a par with something by Asylum studios. It wasn't even good accidentally.It was just plain awful in every sense.Don't be fooled by the high 5+ IMDB rating. These ratings are obviously cooked."}, {"id": 543, "text": "Most of the scenes, acting, special effects, dialogue were bad. The rest were just dreadful.There were some heavily-disguised clues that this movie had some cash put behind it, but the production team decided to waste it and make it look and feel like an ultra-low budget high school drama competition entry.Not a single character was believable or remote engaging. If they'd all died, I wouldn't have given a monkey's. In fact, if the entire cast had all been killed off within the first 5mins, I'd probably have rated this film a 10/10 for doing what I wanted to have happen for the remainder of the film.Whenever something truly shocking happened (death, explosions, being spotted by the aliens), the standard response by the actors was to say S&amp;@#! and in a manner that you'd expect to hear if they'd accidentally dropped an egg onto the kitchen floor.Rather than Occupation, they should have called it Dreadful. It would have given a far better indication of what the film actually was.It's an embarrassment, for a reasonable budget production. That's all. Really."}, {"id": 544, "text": "If you like Tomorrow When The War Began or Falling Skies then you will probably like this. Certainly there is never a dull moment. But it cannot be consumed by adults. The script is very ordinary, seen before and full of too often repeated phrases. The soundscape is old-fashioned and cliched, though it does do an admiral job of telling the story as much as anything else. The explosions and gunfire are crackling and terrific, but alas, make little sense, usually too small compared to the artillery, and a little like fireworks. There is way too much over-acting, and irritatingly this goes on throughout. It's as if an Australian movie making outfit is trying to compete with American B-movies from some decades ago. There is buckets of action and no blood, save some blue blood splatter from whacking the aliens. There is at least one scene of terrible violence against a captured alien that would put this piece out of bounds for any child under 16. I'm pleased that Australian film is prepared to put this much budget into a sci-fi movie. The graphics for alien spacecraft, jets, helicopters and 3D holograms was pretty good. The aliens are dress-ups, and that's not good enough for film anymore. Falling Skies got around the problem with robots, which makes sense. We are talking about a culture that has the technology to cross galaxies. Why would they use flesh and blood soldiers? Hopefully this is the last silly sci-fi movie to come from Australia."}, {"id": 545, "text": "I am watchin just right now...Ok i will keep it short. Really there are some nice sweet camera techniques, some shots are also very well lightened... Somehow a story in it, yes and somehow maybe good actors ...But how the movie is directed and cutted on the whole and the dump dialogues and bad bad bad inscenation of the actors...Ai ai aiSo most of somehow good in mind is lost and makes it a bad movie summarized.Do better inscenation and keep an eye on storyline in combination with the moving pictures and when you are not able to film longer good dialogues, shorten it up...On your way to see what comes next if you will have the chance...."}, {"id": 546, "text": "While Australia has produced som e excellent films, this one is far from it. Bad Actingunconvincing charecterspoor cinematicsPlot holesmultiple goofsbad backing music--- I could go onJust don;t bother. I can not believe that any investor would throw dollars into this woeful movie."}, {"id": 547, "text": "This is a perfect movie for people who reviews bad movies on Youtube. Story is full of cliches, predictable events, shallow characters that have no development at all, stupid scenes and reactions. There are as much character development as in 80's Mario game. :)I watched this with a friend and after 20 minutes film was turned into our guessing game on what will happen..but that got boring very fast because we were right 90% of the time.Why so many of non-holiwood productions tries to copy what Hollywood does and only use the bad stuff from them?Story is super-non-original, no relatable characters, editing is a super mess. Visualy is OK and more than enough, but lack of story and anything original makes it just a waste of time.I gave it 4/10 only because it doesn't look bad."}, {"id": 548, "text": "Started off really good for the first first 30mins but then they dropped the ball beyond that. The special effects were adequate, the atmosphere was ok &amp; the acting was sufficient tho character actions didn't make alot of sense in some respects.To use a non spoiler example, one character fled the attack with his daughter, leaving his wife and son behind and tho he said i must go back that was it, he wasn't in distress and almost a year went past before they reivisited the issue.Directing or the script was a good idea but poor implementation, scenes seem to have been cut leaving big gaps in one part they jumped 8 months Aliens that looked clearly fake (think old school 70's &amp; 80s Doctor Who style) with armour looked like really poor imitations of Storm Troopers and , humans and Aliens that couldn't hit each other from 2 feet away, and when they did the explosions always seemed to be off to the side except one scene that was off camera very little blood splatter and wounds too.The guys that should've been editing and checking for continuancy errors were non existant, people with a bandage on had no wound yet in the next scene there was a noticeable gash.Oh and apparently aliens can speak australian and understand human gestures even tho they've only been there less then a year. That could've been explained somewhere. Very stupid ending and overall very poor directing/script.Saying that it wasn't the worst movie i've seen and with a budget of only 6 million he can be forgiven for some things."}, {"id": 549, "text": "There's not really much that can be said other than Occupation is embarrassingly bad. The only reason this film has a rating of more than 1 - 3 is because people tied to the film can't accept it's a dud. Instead, they log on to IMDB and rate it 8/9/10 out of 10. What's sad is that films with similar budgets have excelled. The problem with Occupation is that it tries to be a big Hollywood film, but fails miserably. Why didn't they scale back the story? In fact, why was this ever made in the first place? Just stop. I don't care its Australian made. If it's bad, it's bad.EDIT: I read a review below which, like most, was probably written by someone tied to the film. The ending said: 'To the audience complaining about this film, and giving unjustified scores... Where's you film? Because I can't wait to review it...'REPLY: I don't make films, because I probably wouldn't be any good at it. I accept that. Take a leaf from my book."}, {"id": 550, "text": "In short, your time and money are to precious for this film.Intense overacting, ego domination, tears on demand ruined what could have been a very well told story. There's no problem with tears. Except when they are on and off like a tap with no follow through of the background story. On several occasions Jacobsen presented on demand tears that felt completely out of context two seconds later.However, what really ruins the experience more so than out of context tears. Is the attitude of two lead actors, Morrison and Jacobsen, continually hunting for the limelight as if in some desperate plea to be remembered. While Ewing did his best to water down the impact of Morrison and Jacobsen. The viewer soon starts to feel an affinity for Ewing as he tries to bring balance to the battle of the egos. How soon does it start to become tiresome. About 30min in the movie becomes a chore to watch as your mind deals with the complexities of the toddler like behaviour from Morrison and Jacobsen vying for your attention.Neither of the characters Morrison or Jacobsen played are the type that demanded attention. The viewers attention toward those characters should have been earned. In contrast, Ewing's character, became more endearing to the viewer. Just the rant of an avid movie goer. DYOR etc."}, {"id": 551, "text": "As an Australian film attempting to appeal to a mainstream audience, I desperately wanted to like this film. So badly did I want to like it, I gave it concessions I wouldn't otherwise give a film.But in the end, Occupation (2018) made itself impossible to like, owing mainly to major failing in the writing (Luke Sparke) and editing (David Napier). Before we dig too deep into the details of this films failings, we should explore what there is to like about Occupation.In a pivot of the Australian literary and big screen classic Tomorrow, when the war begins, Occupation tells the story of a dysfunctional group from a rural New South Wales town who set about defending against an invading alien force. Art direction (Ross Wallace), costume design ( Tracey Rose Sparke) and Special FX (Spark FX) use the best of a small budget to drive compelling visuals for an immersive world. Sure, the break away walls are cardboard but most audience members won't notice.Veteran actor Temuera Morrison (Aquaman, Starwars III) does his best with poorly direction, scripting and a mostly Australian soapie cast; Dan Ewing (Home &amp; Away), Rhiannon Fish (Home &amp; Away, Neighbours), Zac Garred (General Hospital), Charles Mesure (Xena: Warrior Princess, Hercules: The Legendary Journey) and Charles Jazz Terrier (Neighbours).There is a certain amount of relatability to some of the visuals, where they could have been shot on the corner of any Australian street. Others are just down right beautiful, showing off the best of Australian cinema. These should have been strengths, building audience attachment through relatable sets and situations, unfortunately their effort is wasted.Characters are poorly written, with little genuine motivation and a distinctly soap opera style of dialogue. These characters don't feel at home in their scenery even before the invasion begins, and their conversations are an endless reminder that these aren't real people.The editing however is perhaps the most egregious failure, suffering from amateurish shot selection, weird cuts, disruptive pauses and a consistent lack of continuity. Montage is overused to rush through key plot points in order to make up time for overly drawn out sequences about ultimately nothing. Do we really need 51 seconds of pregame football shots that add nothing to the plot?At times shots from several minutes earlier are recycled for no discernible reason, throwing continuity off completely. At other times shots featuring camera moves that add nothing to story and actively throw off the mood are used seemingly just because the director thought they looked cool. The disjointed nature of the editing leaves the viewing experience disturbed, as if we are watching an acid trip through someone elses' eyes. That might have been a fun plot twist at the end to tie it all together, but sadly it would seem unintentional.As the writer, director, co-editor &amp; executive producer; the failings of this film can only lie with Luke Sparke. Occupation had at it's core the makings of a solid Australia sci-fi action film, but threw them away due to one mans ego. I have no intention of watching the sequel to Occupation, but one can only hope that Luke Sparke trusts in the ability of others to wear some of these hats, so he can focus on just one function in the film making process.Grossing just $21K worldwide at the box office, Occupation was poorly received on initial release in 2018. After being picked up by Netflix in 2020, it's likely to be seen by many more who will equally see little redeeming about this film. If you have a choice, Occupation is one to avoid. Plenty of better Australian cinema to watch."}, {"id": 552, "text": "I got out of worse situations than this. Been married three times.This must be the stupidest movie ever made about aliens who want to use our planet as a replacement. We already saw it happening in War of the worlds and Independence Day. But those movies overwhelmed us with expensive special effects and immense battles between earthlings and non-earthlings. The most original thing about Occupation is that it doesn't happen on American soil but on the other side of the world. Down-under in Australia in particular. What they did learn from the American versions, is the patriotic waving with a flag. So expect a half-burned Australian flag somewhere near the end.Right now, there's a 15-year-old Swedish girl who comes to the European Union to fight for better environmental measures before we all ruin our planet. Apparently, these alien invaders haven't listened carefully to their local Rise for climate movement and thereby seriously destroyed their planet. The moment the Alien chief announced this, I laughed spontaneously. I don't know if there were any environmental protests in the world when they released this movie, but I thought it was appropriate. But that was the only humorous thing I had to laugh about spontaneously and sincerely. The rest of the film makes you want to cry actually. Except for the first 15 to 20 minutes. I still had hope then. Admittedly, the special effects weren't impressive, but it looked promising. Those 20 minutes were fully utilized to present the entire group of people that formed the basis of the revolution.First, there's Matt Simmons (Dan Ewing) and his wife Amelia (Stephany Jacobsen). He's a recovering Australian Football player who re-enters the field after taking a dose of pills against his headache. Furthermore, we meet Peter (Temuera Once were Warriors Morrison) and his beautiful daughter Bella (Izzy Stevens) who happened to have chosen this small Australian village as a short-term stop during their trip with a mobile home.And then Jackson (Charles Terrier), a teammate of Matt who has taken over his role as the team leader and explicitly shows that, and his girlfriend Vanessa (Rhiannon Fish) is introduced. The moment the power goes out and an apocalyptic, stroboscopic light lightens the sky, it's the beginning of a murderous alien invasion. And this jumble of persons ends up in Peter's mobile home (along with local commentator Seth Grimes played by Felix Williamson). And yes, they know how to get away from this superior breed and end up hiding in a derelict farm.The story Occupation has been told countless times. Nothing new under the sun. Naturally, those randomly gathered individuals become the basis for an uprising against the alien invaders. For that, the very first mutual feuds and misunderstandings must be cleared up, in order to conclude that cooperation and togetherness are a fearsome weapon. Even against creatures that have evolved much further technologically.What really impressed me was how amazing it sometimes looked. Certainly when you realize that the budget was considerably smaller than that of an American blockbusters. The CGI used for the Martians' mothership was certainly not bad. The advancing ground troops certainly had an old-fashioned look and reminded me a bit of Scifi from the 70s. And yes, when they removed the helmets of the aliens, their appearance was kind of cliché with those eyes of a fly. The most realistic thing in this movie was the time period. The shown conflict lasts more than a few days. A few months are being bridged. But the story is so full of unrealistic and ridiculous things that you'll forget about that real soon.A small anthology. Extraterrestrials conquer the planet with their giant spaceships and an army of laser-equipped stormtroopers. What do you do if they infiltrate into your hideout? Indeed, you just crawl behind a mattress or door. Guaranteed safe.And when you conclude that natural surroundings act as a kind of camouflage, why don't you use that to protect yourself all the time? Apparently, they realized this at a certain point in time. When they approached a legion of aliens, they were able to avoid a confrontation by driving into a cornfield. The upcoming troops immediately lost track of our heroes (Stupid aliens, they just turned left) and stayed behind just looking around in a dazed way.Do you remember the troops the Americans gathered to start their attack against the mother ship? Here they save the world by deploying an ultimate attack with roughly 12 people. Even in a Smart, prepared for the upcoming war. And when someone just escaped death and was lying in bed comatose for a long time, you can get him up and running immediately by throwing a bucket of ice-cold water over him. And the final boss fight is just too grotesque for words.But especially the end is totally whacked. Finally, they succeed in overriding the cruel conquerors and then suddenly they get all evangelical. Remember that phrase about turning the other cheek? In short, half the population was disintegrated or became slaves, and then they are going to shake hands and talk about improving the world by working together as a united force? Any spiritual or religious movement could use this as a study material.It's strange they are suddenly so kindhearted when you compare this with the scene where Temuera Morrison takes care of a captured alien. That was pure rage. But there are more of these oddities to discover in this courageous attempt by the Australians to prove that they are also capable of producing Scifi. In any case, I hope that if we ever have to deal with an alien invasion, these Martians will also be as tame and stupid as those you see in this movie."}, {"id": 553, "text": "HAHAHAHAHA!Oh I've never had such a hard laugh watching a movie. This movie is the best Australia has to offer an my how they should of kept it to themselves. This movie makes The Asylum's films look like Academy award winning masterpieces. I can only think of one other movie that is as great as this one and that's The Room. I actually wished they cast Tommy Wasseu in this movie. He would of made a great lead character even his ambiguous foreign accent would have fit in just perfectly.This movie is indeed so bad that it's entertaining. The aliens clearly have on these rubber suits it's so funny to see them bouncing around oh heck I don't want to ruin anything for you. My favorite part about this movie is how it begins and then abruptly just skips to the middle like the directors lost the script or misplaced part of the film or something.For those that are interested in watching the film still I do recommend that as you're watching it to try and imagine that the aliens are hunting down the people responsible for making this film. I find it a much better experience when I imagine that as being the plot to this movie."}, {"id": 554, "text": "01/10/2019 Yes folks, ET is back, no thanks to Steven Spielberg who knew little regarding ET's evil revenge, simply because no one ever cared about his/her gender identification? Stevie thought eta wanted to go home butt when he pointed that light bulb finger, instead, due to a foreign speech impediment, he really said, ET Homo. For that very unsubstantiated reason?, ET and friends came back to Australia to kill/annihilate a whole bunch-o-earthly Aussie beings. This pretend kevin Spacey movie shows what a light bulb finger (not middle) can do to our planet. (Does AlGore Know? After all he invented the internet and had a hard drinking wife named Tipper. This may be a true story butt I suspect it's a bunch-o-bull-lony? Either way, expensive movie to make, even harder to watch without skipping ahead. Dear ET - Go Homo Bon Appetit NOTE: In some of the movie outtakes this group of evil ET's were slaughtering Can-Go-Roos and really big Peter Rabbits all during the film and at night using them as hand puppet shadows with those light bulb fingers. They thought hand shadows were funny and so did I -Who knew? maybe U?"}], "reviews_amount": 555}