{"name": "The Swing of Things", "titleId": "tt06833470", "reviews": [{"id": 0, "text": "Wow. This is a new low in the history of film making. This is a disjointed story that is held together with scotch tape, prayers and good old fashion sex but don't hold your breath guys, not even those scenes are good. This is all bad. It could have been a fun story but whoever wrote this script either stopped paying attention to the plot on the first day of writing and got high, or they were using an online app to randomly string together events. Calling this movie ground breaking makes you wonder if whoever made that comment were paying attention to the movie or plot at all. Seeing Luke Wilson in a film of this caliber, I come to the realization that the current economic climate creates desperation which forces talented actors to accept crazy scripts and odd jobs. No, my advice is to stay away from this movie. You'll have more fun watching your tumble dryer completing a cycle or organizing your sock drawer."}, {"id": 1, "text": "I've never been so critical of movies. This was an absolute disgusting waste of time.... I feel ashamed I wasted money on the premise this was entertainment the director needs to hang up his hat and walk away from this industry with shame. I don't feel the actors are bad, the directing and overall feel of movie is awful..."}, {"id": 2, "text": "I can't believe I watched this even after reading the reviews here. Too bad you can't award zero stars. Story-line weak and little continuity. Even the sprinkling of T&amp;A wasn't worth the time."}, {"id": 3, "text": "This movie is pointless,stupid and horrible. It is filled with Jamaican sterotypes and a million yea mon phrases that are actually an annoying cultural perpetuation. The actors are some known individuals. I am so confused about Luke Wilson being in such a low budget movie with such an idiotic script. I cannot believe persons used money to make something so inferior. The audio was bad,editing was bad,plot and storyline nonexistent. ABSOLUTELY STUPID FILM. WASTE OF TIME,MONEY LOCATION AND ACTORS."}, {"id": 4, "text": "The movie is all over the place, story is 0 points, everything is so random, save yourself from this."}, {"id": 5, "text": "It took 5, yes 5 writers to come up with something this bad. How this was green lit is beyond me. This should never have seen the light of day. Talk about talented actors sinking to a new low. I get it, it was a job but have some dignity when choosing a project. Some of these actors need to turn in their SAG-AFTRA card and call it a day. I was so angry I spent money on this I went to the beach and burned this piece of....! This director should never, ever be allowed behind the camera again."}, {"id": 6, "text": "I feel it has fall upon me as a duty to warn others not to waste time on it. Its such a bad movie. I will never get that 94 minutes back."}, {"id": 7, "text": "Can't believe how Adelaide Kane, Chord Overstreet and the other more seasoned actors (whose names aren't on the top of my head), can be desperate enough to do this movie. I can stand shallow, feel good movies or even American Pie-like humor, but this is not it. Really unfunny."}, {"id": 8, "text": "The big problem is that I will never get that 94 minutes back. Unfunny and crass. A waste of good talent. Could have been much funnier with better writing."}, {"id": 9, "text": "Read @watchandsmile's review. They nailed it. Can't remember ever seeing a movie this bad."}, {"id": 10, "text": "We decided to watch anyway so we could laugh at how bad if a movie this was. It was is bad that we couldn't even laugh at that. It was literally painful to make it through. Choppy and the worst acting I've seen. I bet Luke Wilson is embarrassed."}, {"id": 11, "text": "The plot could have been funny but this felt like it was written in day &amp; filmed in about a week."}, {"id": 12, "text": "This movie is horribleDog fashion show New York Jewish rasta man Terrible edits. Scenes just to fill time... lots of themI can't sit thru the rest of this ...."}, {"id": 13, "text": "I knew this movie would be BAD, but I thought it would at least be entertaining. I don't know why I sacrificed my time for this trash. My husband and I had multiple mojitos and even that couldn't help us hate watch this garbage film.I'm so confused as to why any actors signed up for this-how this got green lit-how someone actually thought this movie was a good idea?Practice self love, skip this movie."}, {"id": 14, "text": "Yeah...my subject line says it all. This movie was awful on so may levels."}, {"id": 15, "text": "This movie gets two thumbs down and an extra long fart noise."}, {"id": 16, "text": "It's not even funny in an ironic so bad its good way. Looks like a bunch of work experience kids made it. Embarrassing."}, {"id": 17, "text": "I don't usually give 1-star reviews, but this was truly horrific. I not only regret watching it, I feel bad for anyone associated with it. Luke Wilson either lost a bet, or was tricked into appearing in this film.I would like to commend whomever cut the trailer, because they did an exceptional job of giving the impression that there is anything coherent, creative or entertaining going on here.This is one-star because that is the lowest possible, and it is a LONG ways from deserving a second star."}, {"id": 18, "text": "Zero continuity in the script. So many stereotypes and fetishizing perpetuated through the movie that could have been tongue-in-cheek amusing, but just weren't."}, {"id": 19, "text": "I've never reviewed a movie on here before. I've never truly hated a movie before. This awful, awful film has inspired me. The first 5or so reviews of this movie that give it a 7-10 are obviously paid or are in the movie. Trust me, believe the last 20 reviews that give this film a 1. I don't even know how to explain this trainwreck."}, {"id": 20, "text": "Definitely a waste of time and money . Not funny at all. My husband felt asleep 😴 😪"}, {"id": 21, "text": "Horrible! Horrible! Horrible acting, horrible plot, horrible story overall. Horrible mixture of great movie all thrown into a horrendous remake!"}, {"id": 22, "text": "This is one of the worst movies I have seen in a long time! Total waste of time. Not funny and terrible plot."}, {"id": 23, "text": "So, I typically give way more than 1-star to a movie as even bad movies a lot of times have something good going in some areas. Before watching this one, I down voted 1-star reviews thinking those people are just stupid with no sense of humor. How WRONG I was... This movie does NOT deserve any more than 1-star. This is a massive flop with an absolutely horrible script and terrible directing. It is not funny. It's badly cut, terrible directing which makes camerawork seems bad and actors who can play way better than what is here, seem like it's their first movie. A high school play is better than this. I don't know what happened. This is so weird, and sucks for the actors to be involved in such massive flop of a production nonsense. Boo for the producer of this thing too to not be able to see it."}, {"id": 24, "text": "That could somehow afford Luke Wilson? I'm utterly confused. I'm literally having flashbacks of film school. The hilarious part was I doubted that this was even the right film after 15 minutes. Save yourself a watch."}, {"id": 25, "text": "It's almost as if the writers and director took anything that would make sense in the movie, threw it out, stitched the rest of the extra scenes together and called it a movie. +1 star cuz Olivia Culpo is hot."}, {"id": 26, "text": "WOW....IN THE WORST WAY POSSIBLE. I really want my money back! I actually really like some of the actors in this movie from other shows and I honestly dont understand how they got them to agree to doing this movie?!?! I seriously don't know what I just witnessed."}, {"id": 27, "text": "This is so bad. Like so so so so SOOOO bad. There are parts where the characters are speaking, camera is looking right at them, BUT THEIR MOUTHS ARENT EVEN MOVING. It's a terrible voice over flaw. And the scenes just change suddenly when you don't expect it. If you watch at the very beginning, you expect to keep watching her trying to catch the dogs running away...but no. It cuts right into her being back at home. It keeps jumping over small things like this that may seem pointless but actually are necessary to keep you as the viewer invested!! I get it. It's suppose to be a comedy. But scenes are cut way too much and in such a weird way, nothing makes any sense. I don't even blame the actors. It felt like they had no earthly idea what was going on either. This was terrible directing and editing. The plot was all over the place. Characters so hard to read. I just. No. Do not recommend at all."}, {"id": 28, "text": "Don't waste your time. Wow.Editing is terrible, score is terrible. It's all terrible. I can't believe some of these actors said yes to this movie.The bloopers during the credits were the best part. Yikes.I'd like 90 min of my life back. I actually signed up for an IMDb account just to warn others."}, {"id": 29, "text": "I gave it 20 minutes before taking a hard pass. Here is my theory... I think a bunch of Hollywood filmmakers wanted a tax write-off for a trip to a swinger's resort in Jamaica. They slapped together a ridiculous plot, filmed it as quickly and cheaply as possible, then used any leftover budget on resorts and drinks and whatever... with any out-of-pocket money they spent deducted on their taxes as a work expense. That's all I can think of - nobody possibly thought this movie was so good it had to be made."}, {"id": 30, "text": "I feel bad for all the actors. At least they got to hang out in Jamaica!"}, {"id": 31, "text": "Who approved this movie? Terrible acting no idea what's going on. Don't waste your time."}, {"id": 32, "text": "This movie is so bad I don't even think the geniuses over at rifftrax could make this funny. I figured John Lovitz and Luke Wilson would do something good. Why would they ever sign up for this garbage. I don't know who the intended audience was but I found zero value in this movie. The only reason this should ever be washed is if you are aroused by torture."}, {"id": 33, "text": "I never rate movies but I didn't even last 10 mins on this"}, {"id": 34, "text": "Where do we begin with such a disjointed, mismatched, meaningless, hodge podge of a movie. It did not flow. The story line made no sense. The dialogue was disjointed. The acting was wooden. Some of the scenes, we can only assume, were added for specific comedic purposes. We are still waiting to laugh ..... Please don't watch this movie. You'll thank me later"}, {"id": 35, "text": "A movie with Luke Wilson, how bad could it be..... the answer is It's the worst movie I've ever seen and my bar is low. There are no words for exactly how bad the movie is. It's raunchy and all over the place story wise and just plain awful. Save yourself from this movie. Do not watch."}, {"id": 36, "text": "I like going into movies not knowing much about them, but that was a mistake with this one, which earns its 1/10 stars by being a terrible story with no cohesiveness. It's not funny and I figured it would be better just by having Jon Lovitz and Luke Wilson in it. Those names are probably why most people watched it at all. My advice would be to not waste your time, but if you're currently watching it and reading these 1 star reviews while it's playing, then you probably also have a partner who figured you may as well just finish it."}, {"id": 37, "text": "Okay, so hear me out.... The reviews are true, this movie IS AWFUL. However..... it is so bad that it is almost entertaining. Truly a train wreck that you can't help but watch. Once you continue you keep laughing at how truly random, horribly written and just overall horrendous it is, you start to just find it funny. The CGI is comparable to the first Harry Potter quiditch match and makes you question why they tried to put it in there in the first place?? There is about 7 minutes worth of content in this movie, every other scene is just shots that look like a middle school youtuber took on their vlog camera. From beginning to end, this movie is flat out BAD (but like... watch it)."}, {"id": 38, "text": "I can't tell if this was a student film by a bunch of kids with massive trust funds to spend or a money-laundering operation for an outlet with an urgent need to quickly hide a bunch of cash.The acting is actually fine, but the movie is...well, there are no words. It's like The Room with pretty people, but without the charm of Tommy Wiseau."}, {"id": 39, "text": "R wasn't a strong enough rating for this filth. Terrible script. Waste if time and money. Not to mention revolting."}, {"id": 40, "text": "All you need to see is the trailer to know how bad it is"}, {"id": 41, "text": "Not only was this movie boring and nonsensical but the acting and pacing of this movie was the most atrocious thing I have ever witnessed in my entire life. I found myself cringing so much to the point where I wanted to call redbox And complain to get my money back. I made it halfway though this film before I couldn't take it anymore. Literally no redeeming qualities about this movie to the acting to the actual plot in itself. Do not wait here this movie unless you want to waste your money and give yourself a Aneurysm"}, {"id": 42, "text": "Don't... come on.... just don't watch this garbage. I rather watch paint dry on growing grass...."}, {"id": 43, "text": "I would call this junk a movie! If no stars was an option id click that instead!"}, {"id": 44, "text": "This film start with a man Tom rushing to his working place with his bicycle, and a woman Laura walking the dogs scene! As turnout, this film is about Tom and Laura having honeymoon at Jamaica alongside with their family, and they eventually get married there! Entire film full of boring conversation, and disgusting overuse scene! Such as, overuse of the playing dumb scene, overuse of the tripping scene, overuse of the weird sound playing at the background scene, overuse of the copulate with only sound scene, overuse of the nude people slow motion running scene, and overuse of the guy with underpants dancing scene! Make the film unwatchable! Barely laughable scene is, Papa and Mama McGursky watching two birds copulate! At the end, Laura reconcile with Tom, after having misunderstanding with him! They eventually get married! Lance saving Lola from a bunch of dolphins! Still have a post credit scene! A series of the film's bloopers scene! That's it! Wasting time to watch!"}, {"id": 45, "text": "Was this a movie or a 93 min commercial for Hedonism II resort? Life is short and wasting 90+ minutes of my precious life on this movie is hard to accept. I have a hard time giving new movies a chance and this movie is exactly why!! It's terrible. The only plus was the stunning Olivia Culpo. Save your precious time and skip this movie"}, {"id": 46, "text": "In the history of movies one movie has to be the single worse movie ever made. If this isn't it, it at least gets a (Dis)Honorable Mention in the competition."}, {"id": 47, "text": "I thought it might have been a senior project that somehow got picked up by Hulu. Like maybe Luke Wilson's 16 year old nephew wanted to make a movie and asked his uncle and he was like, I'll tell you what, let's book an all inclusive in Jamaica, just come up with a story line, my buddy has a camera, I'll bring my friends they can be the actors, you can piece together the footage after, let's go. I didn't know movies could be that bad. It actually makes me like other movies more; like literally a new low, so everything else moves up a bit. There are movies where people are trying to do a good job and it turns out bad and that can be funny. There can be slapstick dumb humor which can be funny. But I honestly feel like it turned out bad enough where they tried to actively make it worse so it can be funny how bad it is, but it just becomes purposefully bad which is just so bad. I'm honestly impressed. I really think they've succeeded in making the worst movie ever made."}, {"id": 48, "text": "I did not laugh but it was entertaining and I liked it. Watch it yourself first."}, {"id": 49, "text": "Dont waste your time to watch this movie regardless there is the brother of owen wilson. I would suggest people to stare at the ceiling for 94minutes rather than watch this movie.Storyline terrible, camera movement like in a documentary film, the acts is insanely bad ( luke wilson as well) why would this producer, writer, or anyone that made this movie hire normal actor instead of using luke wilson that apparently cannot act and waste the money to him instead of making a better movie?"}, {"id": 50, "text": "How the heck was this ever allowed to make it to a screen to waste my time? Not just a dumb movie, but really bad &amp; stupid. I needed a laugh instead fought falling asleep."}, {"id": 51, "text": "How was this movie even made? It has to be as a favor to some producers kid or something. Please someone explain."}, {"id": 52, "text": "I should have looked at the reviews. Horrible acting and the story line was a miss. Olivia Culpo not impressed with. Is acting only facial expressions and not saying lines? Stick to taking selfies. Wasted time and money to try and be relevant. Let's do better 2021."}, {"id": 53, "text": "Entertainmen. Like it. As i like travelling, i think, i should visit Jamaika, it's a beautiful place."}, {"id": 54, "text": "This is the story about the wedding of a young couple. They recently met each other and they decide to marry. The most beautiful aspect of this movie is its amazing locations and scenes in Jamaica. You will see beautiful shots of the beach, sea, jungle and a beautiful resort. I give the acting an average score. I think the acting could be improved. I liked the background music. However, I think the usage of sound effects could be improved. In summary, this is a nice comedy for comedy fans, especially for the adventurous ones."}, {"id": 55, "text": "I watched this film with my family and was surprisingly family friendly ranging from the comedy to the subjects of the film."}, {"id": 56, "text": "I love romantic comedies, so when this movie came out and I saw that it was filmed at my favorite adult vacation site, Hedonism II, I just had to buy it! There were several actors that had small parts who are employees of the resort and it was so good to see these familiar faces while watching! There was even a quick glance at the owner, Harry! I'll admit that I had to watch the movie twice because the first time I was too excited about trying to spot anyone I might know! But overall, the movie was cute and I'm glad I watched it!"}, {"id": 57, "text": "I don't even know where to start ... It's exactly what it says it is ... It's Funny and Raunchy but awesome ... I really needed a pic me up and this movie did the trick ... The women were freakin hysterical ... I loved it. If you're looking for an oscar movie this isn't it but you're looking for a good time it's perfect ... I've stayed at Hedonism ll the resort where it's filmed at least 15 times and this movie is pretty dead on for a Jamaican all inclusive resort !!!"}, {"id": 58, "text": "Yes, some of the scenes are a little campy but we actually enjoyed watching this movie. Plus it's a window into the real world of Hedonism!"}, {"id": 59, "text": "It's a romantic comedy set at a resort in Jamaica. The drone shots were great and captured the resort well. The cast did a good job. I would agree that the sound effects weren't great but that didn't ruin the movie by any means. I would recommend this to a friend!"}, {"id": 60, "text": "I'm trying not to spoil anything but there's this dolphin scene and this other scene with the older ladies signing up for something. Those scenes had me dying. I recommend watching this movie if you like genuine comedy and aren't stuck up about production. I could see this movie being on Comedy Central for sure."}, {"id": 61, "text": "It was one silly comedy, nothing serious, nothing really romantic. Much better than what they make these days, of course it could have been better but it was entertaining enough and definitely it wasn't as bad as other reviewers say."}, {"id": 62, "text": "This movie just confirmed why I will never let my teens and 20's go. As we grow older, so many let go of the youth inside them and The Swing of Things was created to show you don't have to."}, {"id": 63, "text": "That is why I hollywood is so overrated and what is pity. Nowadays it is about fast flipping your movie with limited resource. It is like cooking now: good rated movie, following the recipe, following. There are so many elements around it that can improve and cause it to fail.Good long trackrecord actors, they are a bit off the screen for a bit= cheapclassic story line that work for a wide audience, humor love and drama= high percentage for successGood isolated location=cheap and able to control situation and fasttotally disaster this movie, ugh hate that story line of a nerdy girl and opening up, 1 scene she is like very closed and suddenly she is like all in the open. Also there is not meaning of the whole story. Up and down and no other actors almost."}, {"id": 64, "text": "I'm not sure why there is so many 1 star reviews? It's not that bad. It's no comedic masterpiece or breaking any new ground, but it's watchable.The story is of a young couple about to be married in the Bahamas. They're on the plane with their friends and family when they have to land in Jamaica due to weather conditions. Following the advice of a cab/tour guide the check into a hotel and decide to hae the wedding there.... before they find out its a nudist colony for swingers.The first half of the film is ok, not classic laughs, but enough to chuckle. There's some decent comedy if you can stand the fact your parents are taking sex coaching lessons with your partner to be's parents (yet, not in the same way as Meet The Fockers)The film loses steam after it does the play-it-safe / done-to-death scenario every one of these films does... That's the couple have a fight, weddings off, they make up, weddings on, everyone's happy again and they live happily ever after as everyone smiles and looks in love over some romantic song. Would it kill a writer to keep the comedy going during these things? Then it ends on a dumb note by revisiting the dumbest joke of the movie.Actually, having said that, I guess I can see why people aren't liking this movie. But it's not a 1 star effort. Its more a meh, it's ok, but I'll never watch it again affair.There may be no memorable quotes or scenes, or any replay value, but it's not a movie where you're bored to death from start to finish. It's watchable once. I give a 4.5."}], "reviews_amount": 65}