{"name": "My Brother Jordan", "titleId": "tt06918740", "reviews": [{"id": 0, "text": "There is no way to accurately describe this film, you just have to watch it. It is an experience that takes you through the life of an amazing human being, Jordan Robinson, through the lens of the people whose lives he impacted for the better, especially his younger brother Justin. It serves as the highlight reel of an exceptional life cut far too short, and encompasses the innocent joy of childhood, intense living room boxing matches and driveway basketball games, hilarious homemade movies featuring even more hilarious costumes, the journey from a below average high school basketball player to the star of the team, and the tragic robbery of life at the hands of an infamous affliction. If you watch this film, you probably didn't know Jordan. But after watching it, you feel as if you did. That's the real power of this documentary. It allows you to feel the positive impact of a person you've never even met. After watching this, although it sounds cliché, you will truly appreciate the loved ones around you so much more and live life to the fullest, because that's exactly what Jordan did his entire life."}, {"id": 1, "text": "My Brother Jordan is a deeply moving film that touches on life, death, and the game of basketball. More than anything it is a story of a brother's unending, selfless love. 100% Recommend."}, {"id": 2, "text": "Wide open and raw. A beautiful tribute. This film resonates with anyone who has lost someone special to them."}, {"id": 3, "text": "Cannot say enough about the heartache and brilliance of this film. I laughed, I cried, I reflected, and I hoped. It is a labor of love but also a work of art.It is a filmmaker's job to tell a story well. It is a brother's job to keep a memory alive.The power of the intersection of these two responsibilities in My Brother Jordan is indescribable."}, {"id": 4, "text": "A beautiful and humble reminder of what humanity is truly about. Engaging, well edited, thoughtful."}, {"id": 5, "text": "I accidentally clicked on this documentary, but thought I'd give it a few minutes since I was already there. I watched it not just once, but twice. What a beautifully made tribute to a brother whose impact will remain forever with his family and friends. The interviews were so raw and truthful. May we all be remembered as well as Jordan is. Thanks to Jordan's brother, Justin, for sharing his brother with the world."}, {"id": 6, "text": "This film tore me apart, built me back up and tore me apart again. 100% recommend."}, {"id": 7, "text": "This film was one of the most heartfelt films I've seen in a very long time. Justin Robinson truly poured every ounce of his heart and creative potential into this project and it shows."}, {"id": 8, "text": "To have someone is create but to have them and love them is a blessing. Justin did an excellent job on this documentary. I have never cried so hard on a film or for a stranger. They had such a beautiful relationship. I envy that type of sibling bond. Jordan was well loved and he loved well. Definitely an angel while on earth. Some people are just too good for this world. My heart goes out to the Robinson family and for Coach's family. Honestly, I can't stand documentaries but this was so beautifully crafted. I felt as if I knew Jordan as well."}, {"id": 9, "text": "I never met Jordan. I didn't know who was Jordan before this documentary. Through out the minutes passing I started to realize Jordan was a light, that kind of person that makes us want to live life. We all need Jordan in our lives. I never met Jordan but now I wish I had. Love is for life and this documentary luckily exists to remind us we are alive and loving. An outstanding work by a brother about a brother. You deserve everything Justin and thank you for the courage."}, {"id": 10, "text": "Just watch it. If you have siblings this documentary is for you and if you don't then it's also for you"}, {"id": 11, "text": "This documentary is truly something that everyone needs to see."}, {"id": 12, "text": "I heard about this documentary on YouTube and from the trailer I immediately knew I had to see it. The home movies had me crying within the first few minutes. This story makes you feel like you really knew Jordan. He left a mark on so many people; he was everyone's friend. Towards the end when you saw how many people attended his funeral, who were part of the documentary, who had tattoos of his name, who named their children after him- you could tell he was truly loved. I can't imagine a better way to commemorate such a great man."}, {"id": 13, "text": "What a wonderful tribute to an amazing man by an amazing man. Such a gift to Jordan's legacy. Thank you for this."}, {"id": 14, "text": "I came across this doc by accident on Youtube. I highly recommend it. It is a very emotional, but important. Life is way TOO SHORT.Thank you Justin for letting us in your personal life and for letting us get to know Jordan, and his friends, and your family. He lived his life to the fullest and inspires me to do the same.You are so lucky to have a brother like Jordan. He seemed like such an incredible person.I hope by sharing your story it helps you. You will see each other again one day."}, {"id": 15, "text": "I'm sure Jordan was a great human being but I'm sure he also had flaws, like everyone else... hence the desperation I felt after 25 minutes of hearing how great he was at this and that... What is it exactly that will keep me on my sit? Morbidly waiting for the cause of death?"}, {"id": 16, "text": "Laughing through my tears. Three cheers for Jordan and thank you to Justin for sharing him with us."}, {"id": 17, "text": "Perfect. Painful and raw and charming. This documentary makes you experience how painful it is to lose part of yourself and how much you value your siblings."}, {"id": 18, "text": "I lost my dad to cancer this February, I had no idea what this documentary was about but decided to watch. Well I balled my eyes out, prayers for this truly amazing family of God! I know whatever I personally say will not do it justice, my heart truly goes out to the family. The battle you face head on nobody else witnesses it is truly the hardest most emotional thing I have ever dealt with, I am 36 yrs old and there is no explanation you can come up with that can make anyone understand what a family or person goes through in this terrible battle of a loved one. I just want to say I was a daddy's girl and was just blessed to be able to be with him at the end no matter how hard the road was getting there and I miss him every day. The bond between the brothers in this was truly amazing, there is a reason he looked out and was there (and vice versa) the way he was, that was something to truly be proud of. This was so touching to me personally I don't know how to put it into words. Thank you for doing this, I know it was not easy and I truly know there was much heartache but also joy that came from it, so bless you for enduring everything after the fact. If anyone is trying to understand what a friend or loved one is going through you should watch this to get inside the life of someone who has been first hand through the true heartbreak and heartache of all of it! And FYI I haven't even finished the documentary yet. Bless this sweet God loving family they seem like wonderful parents!! Truly worth the watch!"}, {"id": 19, "text": "It is difficult/impossible to convey the feelings we have when losing a loved one, however this film captures them. I stumbled upon it quite by accident but will be recommending it to everyone."}, {"id": 20, "text": "Not much to say other than a wonderful documentary. I wish the best to Justin, his family, and his friends, and rest in peace Jordan Robinson and Jim Coach Grimes."}, {"id": 21, "text": "My Brother Jordan is the most amazing thing i have ever watched. It is so inspirational and has honestly changed my life for the better. Thank you Justin for making this incredible documentary"}, {"id": 22, "text": "Thank you for sharing your story. This, was really beautiful."}, {"id": 23, "text": "Well, my heart is ripped out and I'll never be the same. Yet somehow, I feel intense gratitude that this film was created. What starts out as kind of an annoying collection of home movies, will leave you with a broken heart and wanting nothing more than to personally know Jordan. Wow."}, {"id": 24, "text": "I don't even know where to begin or what to say. I do know that this is the best documentary I have ever seen. I felt everything like I was sitting in the room with them. The emotions I felt through this was so raw and pure and I don't think I will ever forget this story. To Justin, thank you for being so strong and sharing this amazing story."}, {"id": 25, "text": "Riveting. Raw. Pure. These are just some of the words to describe the emotional documentary. I've watched documentary's in the past, but this one is different. This one has me up at night thinking how fragile and fluctuating life is; it has me reminding myself that life is too short to dwell on minuscule first world problems. It left me feeling as if I knew Jordan and the family; even though I don't. It made me feel joy and made my heart heavy at the same time. I will never fully understand the pain and pride it was to know and be with Jordan, but the director has created such a beautiful invitation to the world, to at least know some of Jordan's life."}, {"id": 26, "text": "Jordan and Justin Robinson shared a brotherly relationship that all brothers wish for. This masterpiece of a documentary takes the viewer through the journey of Jordan's extraordinary, yet amazingly ordinary life. A loving brother, son, friend and so many other things. Justin Robinson pulled through with this Doc. Moving interviews, well shot, a brilliant narrative and a heartbreaking yet moving story. Thank you for letting us see a small window into this lovely person's life."}, {"id": 27, "text": "YouTube randomly recommended the documentary and I was hooked! Justin you did an incredible Tribute to your brother Jordan! I laughed and cried but most importantly I was able to see Jordan through your lens. He was here for a short while but Jordan left his mark in the hearts of those that loved him and now in hearts of the world."}, {"id": 28, "text": "I didn't expect much when I stumbled across this documentary on YouTube. However, 2 minutes in, I could tell I was hooked. The videography creates a feeling of nostalgia which instantly made me feel like I knew Jordan all my life. Justin captured the embodiment of his brother and you can really feel the love and warmth through the screen. Also, capturing the raw emotion of the interviewees and following them with sudden cuts was brilliantly executed. The grief shown throughout the documentary was so overwhelming; I could just feel the lump in my throat for most of the time. Nonetheless, my favorite part about this was the portrayal of Jordan's goofy and carefree side; he was a true free soul."}, {"id": 29, "text": "I am beyond impressed by this beautiful, most touching documentary. Despite its remarkable ability to move the audience through evoking emotion, it was at the same time scripted in an amusing, somewhat comical way - a combination which definitely made it stand out from other documentaries. Footage of a playful childhood, strong family bond and love for basketball are depicted in such a way that the audience lives through the moments. Basketball forms a recurrent motif in the documentary, overall creating a well structured script. Thanks, YouTube algorithm!"}, {"id": 30, "text": "In the kind of world we live in today it is nice to come back to reality and watch a documentary about real life.About how much a brother loved and still loves a brother. Everyone should have a chance to meet Jordan. So incredibly moved by this story."}, {"id": 31, "text": "This story is of Jordan who was portrayed to us through the eyes of everyone who loved him. Within the first 10 minutes I questioned myself how would you fill someones story in an hour. Would it be too repetitive would it be drawn out? Justin, you filmed this perfectly and now I know that I should doubt my doubts before the end of a film. At the end the movie was heart-rending, and I was an emotional train-wreck. Highly recommended (Warning: box of tissues is needed)."}, {"id": 32, "text": "Moved to tears by this movie. i love the bond between these brothers"}, {"id": 33, "text": "I really only review the writing, directing and editing. In the case, it's all the same person. Only going to talk about two of the three. Through the writing and editing I give you a full 10. The writing was tremendous and the editing is truly Making the film. You had me laughing hysterically for a moment then I was nearly a mess in the next 3 minutes due to flawless editing. I've made a film or two in my life (Different name) and I don't think I could've come close to this documentary. Justin, thank you for making this film from not only from your heart, but also sharing it with us. Beautifully done. I tip my hat to you and Jordan. Thank you again!"}, {"id": 34, "text": "Recently saw this on my recommended page on youtube, I must admit, ignored it a few times. I've pretty much rinsed everything on netflix and youtube due to lockdown but sat down and decided to finally give this documentary a go.Also would like to mention for a person with such a short attention span like myself, I could not take my eyes off this documentary. The story telling, music, just the voice of Justin honestly broke my heart, I am still unsure how within an hour of this documentary we know so much of a person and how they lived their life, such a pure genuine soul, gone too soon.Such a powerful documentary, you don't have to be super emotional or have to have a brother to understand the relationship Jordan had with his brother, friends &amp; family. I normally do not relate to videos but this one really has stuck with me, makes me wonder how I should live life now and appreciate everything and everyone around me.I think anyone who appreciates how good this documentary is you will know Jordan was a person who left just enough love, strength and motivation to let Justin complete this documentary and leave a bit of him with each and everyone of us. I believe the world deserved to know the good Jordan had in his life and the impact it had on the people around him really reflects. I also strongly believe there are a few videos and documentaries such as this that really connect with me, I think I will remember Jordan and his legacy for a long time and it summarises those who I have lost around me. If you do decide to watch this, watch it whole heartedly and with full concentration, you will feel it too. Justin is such a strong human for even attempting this because honestly speaking if this was me, I wouldn't know where to begin, I feel as if I have lived my life with their family within just an hour. If I even had the ounce of happiness Justin felt with Jordan I would feel complete. Whoever is reading this I wish you all the best."}, {"id": 35, "text": "I don't watch documentary a lot but this one was my favorite I loved the story the love of this family has , to be honest I almost cry watching this doc I love it , I absolutely recommend to watch it ."}, {"id": 36, "text": "My Brother Jordan weaves honest interviews and precious home movies into a story of a family blitzed by loss.This doc is palpably cathartic. Anyone with a modicum of experience with loss will grieve along with Justin, rejoice in his joyful memories, and understand his process.If the relationship between Jordan and Justin (or Jordan and literally anyone interviewed) teaches anything, it is to love with reckless abandon.When you love big, you hurt big. But Justin tells us that that's OK and the reward far outweighs the risk.Justin's editing is rife with impeccable comic timing and lingering moments, allowing the pain of loss to breathe. A brilliant tribute to a man who, even in death, makes us feel like family."}, {"id": 37, "text": "Ever since I can remember, I have been obsessed with movies. From superhero Marvel movies, to classics such as The Shawshank Redemption, to hidden gems like Warrior, I genuinely love watching movies. However, while I very often rate movies here on IMDb, I have NEVER left a written review because I know that whatever I was going to say will have already been said by hundreds, if not thousands of others. But after watching this documentary, I felt urged to write a review because 1) this movie needs to be seen by EVERYBODY, 2) I don't care if someone has already said the things I'm going to say, this documentary deserves it.I do not watch that many documentaries. In fact, I can probably count on one hand the amount of docs I have seen; so the fact that I watched this was somewhat of a miracle. It was recommended to my YouTube feed three times, so I finally decided to at least click on it to see what it was about. I was hooked instantly.I don't know if it was the raw emotion right out of the gates by Justin, or if it was the editing of the beginning, but I started watching and could not stop. As a senior in college, I have a lot of things on my plate that I am juggling - and spending an hour just sitting and watching a video is not one that typically takes priority. However, after 2 minutes of watching, I forgot about everything else. I was even late to a meeting because I completely lost track of time.I realize I have not really said a single thing about the movie, but honestly that's a good thing because you should just experience it for yourself. My Brother Jordan is an amazing documentation of brothers and family and love. I am so thankful that this documentary was randomly recommended to me, because it reminded me of all the blessings that God has provided me and how I should never take things for granted.Give this a watch. It is only an hour long ... but if you are like me, you will want to watch it more than once. Fantastic documentary."}], "reviews_amount": 38}