{"name": "I See You", "titleId": "tt06079516", "reviews": [{"id": 0, "text": "We've watched tons of thrillers in quarantine and this one was super good. And yes, Helen Hunts face."}, {"id": 1, "text": "If you want a movie that offers some good suspense and one that does a pretty good job with misdirection along with some WTF head scratching moments then you can't go wrong with this film."}, {"id": 2, "text": "Very well directed with eerie feel. I often wonder why more thrillers like this don't utilize the power of sound and musical scores to build tension in a scene. Anyways I was pleasantly surprised by this in a year that hasn't released many good movies. I hope to see more from this director!"}, {"id": 3, "text": "Very well executed mystery thriller that keeps you on the edge the entire time. Well done. Bravo. Thank you!"}, {"id": 4, "text": "The opening scene of 'I see You' is an interesting one. It implies a supernatural element to the film and consequently made me lose interest for a little while. In hindsight it's a really clever and well executed scene that I can appreciate. And that's the thing about this movie. Everything is about hindsight, and I love that. I love a movie that presents something seemingly bizarre and then explains itself. The problem with that is that the audience has to be patient through the first half of the film. It requires trust and in the modern world of terrible films that can be a tough thing to give to a film. However if you do use patience with 'I see You' you will have a great time.It was hard to tell early on just how dark the film was going to be. I knew it had an R rating so there had to be more going on than initially met the eye. The film tends to get darker and darker as it goes along and reveals itself. There's a concept used in this film that I can't reveal because it would be a spoiler, however it is starting to be used more and more in films. It's a really creepy idea because it could happen to anyone and could even be happening to you right now without you knowing. 'I See You' puts its own twist on it and does it a little differently which I liked, but it's just another element to this film that works extremely well.I love it when horror movies gets things right. 'I See You' is a well crafted little film, that is well worth your time and almost demands a second viewing afterwards to fully appreciate it. This is one not to be missed."}, {"id": 5, "text": "Don't believe the genre tag. This is straight up a thriller/mistery, there is absolutely no horror at all and you will be totally and completely dissapointed if you're in for the horror.Said that, if you enjoy thrillers I See You completely delivers. There are a handful of surprises and will make you want to see it at least twice (I didn't really saw it twice but I definitely rewinded to some parts).It has a smart script that keeps you guessing, and while the behaviors of the characters sometimes made my eyes roll, most are explained later. There are only two or three things that they had to force and you have to turn a blind eye to in order to fully enjoy it.I See You will stay with you for a little while and won't give you all the answers. I'm still wondering why he chose -that- song, and what happened in -the trailer-. Leaves it to the imagination and mine went to really dark places. Making the movie EXTREMELY dark."}, {"id": 6, "text": "Fantastic! I almost didn't watch this because of the negative reviews. So glad I did! Keeps you on the edge of your seat the whole way through!!"}, {"id": 7, "text": "The movie is different from usual horror/mystery films - not involving much gore/torture still maintains very good story-line and puzzle1st half of the movie is originating puzzles, complicating the story; while the other half is filling in the gaps to solve that puzzles in a very unique way of back-patching/filling parallel eventsAlso, the sound-effects are very unique and different from usual, heard a bit new thingsAnd, Yes, Passively marketing a few new terminologies and Singers/Songs :)Overall very decent movie to spend good time and deserves to be in Horror/Mystery Category"}, {"id": 8, "text": "I love a good mystery. The problem I have with most though is that I've seen so many I tend to figure them out before the final moments of the film. So when one comes along that catches me completely off guard it becomes one that I want people to know about. I SEE YOU is one of those films.The movie is actually divided into two parts, the second half reflecting on the first. It's fall in a small town and the people are frightened for their children when a young teen goes missing. Det. Greg Harper (Jon Tenney) is the lead detective on the case, a case with few clues. But that's not the only issue Harper is dealing with.There is problems at home as well. Harper's wife Jackie (Helen Hunt) was cheating on him and they're trying to make things work. His son Connor (Judah Lewis) is resentful of his mother's indiscretion and holds her responsible for the falling apart of their family. Every effort she makes to try and correct things he tosses back in her face.The have you seen posters are placed around town and the search for the boy continues. When Harper and his partner Spitzky (Gregory Alan Williams) go back over the crime scene they discover something they missed the first time around. It's a green pocket knife and references a previous crime they worked years ago. Could that same killer have returned?As the case moves forward strange things begin happening in the Harper home. And entire drawer of silverware disappears. Noises are heard. Windows are found open. Then the worst of it all happens when Jackie's lover shows up trying to convince her to run away with him. Leaving him in the garage when she goes to answer the door, someone kills him. Is there something supernatural involved here? Or could it be something else. Time for a spoiler alert if you don't want to know.This is where the movie shifts gears as Connor reads a text screen that asks him if he's ever heard of phrogging. If, like me, you haven't I'm sure your hitting your cell phone now to look it up. Phrogging is when perpetrators, mostly teens, sneak into a home and attempt to live there without the knowledge of the home owner. It's a way to have a place to stay and to get some sort of thrill.Mindy (Libe Barer) and Alec (Owen Teague) are two such teens who have placed themselves in the Harper home, hiding out when they are home and wandering around when they're gone. These are the two responsible for the mysterious goings on. But it gets better. Alec is one to push things to the edge while Mindy plays it safe. Could it be that Alec plans on taking things even further than Mindy expects?This plot twists is mesmerizing and director Adam Randall uses a deft touch to bring it all about. Using up perhaps two thirds of the films short 96 minute running time he crafts the story to fit a certain mold, a horror film if you will involving what are potentially spooks gone wild. And then like Hitchcock did when he altered the story of a secretary stealing money into a serial killer in PSYCHO, the movie changes into something completely different. Quite an accomplishment for only a second film from Randall.Screenwriter Devon Graye is now someone I want to watch. An actor with 53 films under his built this is the first one he's written. He's done a magnificent job for his first time out. The characters are believable and ones we come to care for. We wonder if perhaps Jackie is losing her mind. Or is there something supernatural? Or is it the phroggers? Or could it be something else entirely?Hunt doesn't make that many movies these days and it was a pleasure to see her back in a role she handles with ease. It looks like she's making a return to acting after several years away and that's a good thing to happen. Tenney is an actor who's been overlooked for too long. He too does a great job here. And all of the young actors on hand also turn in performances that are exceptional, something we rarely see from teens on film.To my knowledge this film played in few if any theaters and that's a shame. I've seen bigger budgeted films with more hoopla upon their release that didn't compare to this one. For me I know it's one I can not only recommend heartily but could sit and watch more than once looking for those tiny details I might have missed the first time around. For now I would tell any and all that this film makes a great viewing night and suggest you rent it when you can."}, {"id": 9, "text": "Such a quality thriller... Music especially heightenes the tension.. The thrill and mystery level was surprisingly high!! Don't worry... seat down and press play .... trust me!!"}, {"id": 10, "text": "I was lucky enough to catch I See You at SXSW in Austin and I can't stop thinking about this movie. Greg and Jackie Harper (Jon Tenney and Helen Hunt) are a married couple, he a detective and she a psychiatrist, who are facing some marital difficulties when young boys begin disappearing under unusual circumstances. While Greg investigates strange and unexplainable things begin happening in the Harper house. I don't want to say more but know that this is a movie I want to see again. The story is so well put together that I was surprised with the direction the movie takes and the acting too was top notch."}, {"id": 11, "text": "Now hear me out and hear me good: this one is a blast! It has everything from a wonderful and confusing first situation, to an excellent development, complex characters, great writing and directing and a superb last act.If you hear about a future or present hype about it, trust me, it's true. Everything falls great in place, keeps you guessing, makes you believe you finally cracked the code but most likely in the end you'll find yourself pleasantly surprised.Thus, I See You is a great example of cinema done right, close to no loop holes, just a wonderful puzzle revealing itself in front of your eyes, while you might be scratching your head about it. Highly recommended, kept me guessing at the edge of my seat.Cheers!"}, {"id": 12, "text": "This movie not for people they just started to watch thriller movies and they come here to give Low rating with stupid complaining...i will talk for and give my review for people who enjoys (cinema) what cinema? Okay let's start This movies started like they give us a vibe that this Movie is supernatural second act become thriller invasion house with found footage and third act become serial killer ...imagine these elements in one hour and half... Everything was top notch like acting was great from everyone.. But for me is writing and directing was phenomenal and third is twists and turns in the middle of the movie was good time to give us something to get excited more and more.... And then ending was sad for me and hurts me a lot..the cast they they a fantastic job it's not original but great movie to talk about with friends.. For Many years to come ...if you want action /sex /teens/monster/stupid imagery this is not for you.. But if u like good writing and directing and plot twists with psychological thriller this is for u... So I give 10 because it perfectly"}, {"id": 13, "text": "Novice director Adam Randall did an excellent job behind the camera and in directing his cast. All casting and performances were spot-on, with the exception of Helen Hunt, who seemed spaced-put and truly on all those pills she was popping. The score was perfection, creating the perfect tension and suspense. This film was actor Devon Graye's first screenplay, and he hit it out of the ballpark. Some of the twists were certainly over the top and there were some plot and technical issues, but for an amateur screenwriter, he did better than some recent seasoned writers' films I've seen lately. In comparison, his writing was genius. The 96 min runtime was perfect, but I felt the start was too slow and the ending too fast. I would've liked to have seen more even pacing. Nevertheless, I really enjoyed it and my head is still spinning from the plot twists. I'm definitely going to see it again. A well deserved 9/10 from me"}, {"id": 14, "text": "The movie as a whole was good.. but we found Helen Hunts appearance to be so distracting. Wow.. I really hate to make something like that part of a review.. but it was just disturbing."}, {"id": 15, "text": "A very clever storyline, I'm very fussy with movies but found this one worth a review. Clever twists which brings the first half of the movie into an exciting and clever end half."}, {"id": 16, "text": "I gave this a 9 because I was bored for the first half of this movie and everything seemed disconnected- but I soon came to realize why. The second half of the movie was a complete 180 twist and I was hooked. The ending explained the motive behind the characters' actions. I love a story which connects all the dots and leaves no stones unturned. Totally worth my time."}, {"id": 17, "text": "First off I'm 71 years old. Secondly I have a subscription to Shudder. Third and lastly The Shining has been my favorite movie for 40 years. In with the new!"}, {"id": 18, "text": "We didn't expect events to turn half-way through the movie and the plot twist at the end made it even better. Was a very interesting movie. The horror wasn't overly done and it wasn't focused on big jumpscares. Well blended crime, mystery, drama and horror."}, {"id": 19, "text": "Helen Hunt looks weird now but otherwise this was quality all the way through. Looks great and has atmosphere. A few unexpected twists in the great plot. Totally recommend."}, {"id": 20, "text": "Good mystery/suspense/thriller. I'd give this one a solid 6.5,,,Amidst a trying time where local boys are being abducted,, a husband and wife find their marriage on the rocks,,, and if that were not enough there are a lot of strange things going on in their house.I honestly had to go back and rewatch several scenes to understand what was happening and why. This is one of those movies that leaves clues, and if you're not paying attention you'll miss them.So watch it already!"}, {"id": 21, "text": "There are some okay elements, it's somewhat entertaining but it's predictable and suffers from typical thriller cliches which really bug me. Alec (Owen Teague), whilst meant to be an a unlikeable character is just too annoying. Helen Hunt's plastic surgery abundance is so distracting and no character is very likeable except Spitzky.There are borderline ridiculous moments where the Phroggers would be seen, like on the roof or behind the glass door when Jackie is STARING RIGHT AT ALEC!? Mindy's meant to be a super cautious person, yet before she dies she's yelling on the phone when she knows Greg's around and just wanders into the caravan? The most annoying bit is when Greg is looking for Alec in the house, he's a detective, he knows he's there and he knows the record player was put on as a distraction so what does he do? Stares at it like it's a complex puzzle? No detective would be that stupid. Soon after he hits Alec in the HEAD WITH A METAL FIRE POKER which let's be real would've killed him, yet Alec's up a second later completely fine...It's okay... but the fact that people are giving this movie a 10/10 is simply ridiculous. There's no real build up to the main reveal. It's a plot twist just for the sake of it and its not overly surprising or clever.Overall it just loosely ties plots together, with twists that have zero substance and I guess people think that's worthy of a 10? Are you serious? You must have to be young or seriously simple to think this is worthy of anything more than a 7."}, {"id": 22, "text": "Just saw today at Cleveland international film fest, very glad I got to such a quality thriller. Music especially heightens the tension. Desperate personalities are unraveled when retribution is delivered with calculated and sinister intent. Anxiously awaiting the next twisted mind-bender from Zodiac Productions!"}, {"id": 23, "text": "It's not easy to review this film without giving too much away, as there is a twist in the tale. It is part murder mystery and part family drama with some points teasing at supernatural goings-on. We have a couple trying to get through a recent affair and their teenage son reacting very negatively. This gets overshadowed by some unusual occurrences in the house and a recent spate of missing children, which is being investigated by our poor cheated-on husband. The film shifts entirely halfway through and we start seeing the story from another perspective. Though the twist and the execution are very clever, the second half needs trimming. We are shown things that are somewhat unnecessary and the set-up for this act is a little long. What could have been a great film is just a good one because of the overly long reveals at the end."}, {"id": 24, "text": "I See You starts out with some strange camera angles, a bit overly dramatic score and a creepily-too-thin Helen Hunt. For a few minutes you feel like you're being a bit too manipulated, between sharp cuts and overtly scary music.But then you start trying to guess just what is going on. That goes on for a few minutes.And then you just watch.You will be well rewarded."}, {"id": 25, "text": "You go into a movie with expectations. Trailers, descriptions on streaming services, and reviews all contribute. And a third of the way in you're sure you know what's going on and this film flips to the other side and says no, really I'm This kind of movie. So you settle in thinking you know the score. You don't. It's brilliant. The title says it all."}, {"id": 26, "text": "I'm a huge thriller/mystery fan. But I'm super picky and critical about what I like. First off. Don't let the negative obsession with Helen hunts face reviews get in the way of enjoying this film. So what, she's aging how she chose to. That's not why we're here. This hugely underrated film I've never heard of deserves way more attention and recognition than the likes of parasite. That film is a joke over all the attention it got. However the acting, production, screen writing, creative multi layered plot and right down to the score all check the boxes for me! No wasted time to get the story going either. No stupid side romance plots. Just enough information to throw you off and then guide you into what's really going on. And not overly jumpy to make it more realistic to connect to the true story unfolding. It's been a while since we had a good one. I highly recommend."}, {"id": 27, "text": "This movie might have been interesting if it weren't so absurd. It has it's good points, starting off with an intriguing mystery, nice cinematography and a great soundtrack which adds interest to a story that eventually falls apart. The acting certainly isn't great though and I can only agree with what others have also written, Helen Hunt's obvious plastic surgery is actually distracting. The movie just ends up being annoying and is structured in such a way that any emotion or suspense is sucked right out. I didn't care about any of the characters, in fact each one seemed to have been written as if they were idiots. By the time you understand what's going on , I doubt you'll care, I didn't."}, {"id": 28, "text": "Man listen! This movie had me like what the hell! NO WAY! Honestly worth the watch. I don't know why it has so many negative reviews."}, {"id": 29, "text": "Wasn't sure what to expect from this one. I was surprised but in a good way. Nicely put together thriller.For some reason I had in my head it was a sci fi thriller. In fact, the opening shot seemed to indicate something invisible yanking the child from the bike. Then there were little things that made me question what is happening and when is the monster going to reveal itself.The movie starts off pretty quick getting to the point. You meet the characters and are instantly intrigued by the story.Helen Hunt cheated on her husband. Her son is rightfully pissed as her infidelity has led to a rift in the family. In the meantime, someone has abducted a child, which is actually the second one in a couple week period. That sets the backdrop. The husband is a detective assigned to the case with another one who handled a case years ago with similar patterns. Knowing that he put the guy behind bars, they believe that they're probably dealing with a copycat.The man with whom Helen Hunt had an affair drops by her house. She rebuffs him but not before someone throws a mug from of the roof causing a pretty nasty cut and bump. She takes him to the basement to treat the wound and leaves to take the son to school. While she's away, someone knocks him over the head killing him. When she returns, she sees his dead body and looks to her husband for help. Concerned that the son would be the likely culprit, they proceed to bury the body deep in the woods.While they're away, the son is knocked unconscious by a masked figure creeping up behind. The next scene you see Helen and the husband find him and Helen drives the don to the hospital while husband remains to check the house. While upstairs, a record begins playing and when he starts to turn it off, a figure creeps up behind with a weapon seemingly injuring or killing him.The story takes a flip to two phroggers who move from home to home for a place to stay. But they do so without the people knowing. They are actually filming their antics and it becomes apparent that we are watching a flashback to earlier parts of the film. They've been there the whole time. The guy in the duo becomes increasingly weird wanting to mess with the family. As his behavior becomes bizarre, he drives the girl to want to leave.It is revealed that the guy threw the mug at the dude who hooked up with Helen. When the girl goes to the basement to retrieve her stuff, she sees the guy and dips behind a shelf. As she watches, it is revealed that husband killed the guy in the basement.When she tries to convince the boy to leave, he accidentally knocks her unconscious. He places her in s trunk which is then driven by husband to undisclosed location. It is there that we find the husband is the serial killer the whole time. When the girl tries to save the two boys who were kidnapped, husband suffocates her. Next scene he wakes her up so he can stage her death as self defense. He shoots her. When her buddy sees that she is dead, we learn that he is the one who attacks husband. They have a fight and husband is stabbed then shot by him. The partner enters and shoots the guy. It is revealed to the partner that husband was the killer all this time, even former ones and the guy who was in his house was one of the kids who got away. Helen learns her husband was a serial killer.Good flick."}, {"id": 30, "text": "There's a twist! It's a pretty exciting twist: it was pretty fun, a bit long. Overall a good watch! Thrilling."}, {"id": 31, "text": "Very good thriller. Thought I was watching a certain genre and it completely surprised me by being something completely different to what I was expecting. Cannot believe this did not get a bigger release because it deserves to be seen. Some very good twists."}, {"id": 32, "text": "It is worth watching to the end of the film! Cleverly written into three parts (I watched it twice, again after knowing the ending). Helen Hunt is the only negative for me; for lack of better wording I don't know what she did to her face but it was uncomfortable to look at her on the screen. The other actors were so excellent I won't forget this one for a long time."}, {"id": 33, "text": "First half is compelling and suspenseful, wondering how all the pieces will fit. Then when the new characters are Incorporated for the second portion it becomes disappointing, far-fetched and then predictable. Once we get to the big reveal at the end it's anything but. On a snarky note, Helen Hunt's husband is the producer. Sadly, with what she's done to her face, which by the way is a VERY distracting element of the film, nepotism is the only way she can get work. Love Helen Hunt but damn!"}, {"id": 34, "text": "This movie is terrible. I rarely write reviews. There is more than one plot going on and they tie it together at the end which doesn't even make it more interesting. Casting was awful. Helen hunt looks like a stretched out zombie corpse. The young kids who were phrogging were bad actors and there involvement was way too unbelievable. They had so many outs during the duration of their break-in stay. Nobody's strong character flaws even came into play. Characters were very undeveloped. I would do anything to have picked another movie to watch. I'd spoil it it but it's so dumb I can't even do that"}, {"id": 35, "text": "Being a horror mystery supernatural movie fan and seeing all the amazing 10/10 reviews I had to watch this movie. Three things immediately strike me: 1) over rated fixed reviews 2) How much surgery has helen hunt had done to her expressionless face. She looks like Caitlyn Jenner's twin sister. 3) the over powering music score takes your attention off the movie4 stars at best. Go watch Triangle instead"}, {"id": 36, "text": "A good film to watch. dont bother with the negativecomments, watch it for yourself. I liked it very much."}, {"id": 37, "text": "'I See You' is a superb thriller/horror starring Helen Hunt in one of the leading roles with other well known faces. The film manages to create a pulsating tense atmosphere from the very beginning which seems to suggest a supernatural horror of sorts. You learn very quickly Helen Hunt's character has cheated on her husband of many years and it has created a volatile domestic atmosphere which coincides with seemingly supernatural occurences. This all builds up to twist after twist. The story is excellent and the direction from Adam Randall is masterful. This film is so good it could have benefited from another 40 minutes of running time the story is so good and relatively complex. Highly recommend to all horror and thriller fans alike!"}, {"id": 38, "text": "They almost made the perfect edge-of your seat nail biter thriller, but fell just short. There were like 5 twists which were about 2-3 too many, which brings me down to 9/10 stars. Then I'm taking away 2 stars just for the torturous noise they subjected me to in the background. And then one more star off because that's how much I disliked that industrial grinding/whale song noise that just would not let up."}, {"id": 39, "text": "We complain that Hollywood doesn't make original movies anymore...well...enter I See You.Helen Hunt is fantastic as a confused and slightly creepy mom trying to fix the family she had broken with an infidelity.A dark, atmospheric thriller- set up similar to Hereditary...a family in degradation with other forces at play. The film then jumps from genre to genre making it impossible to guess the ending. So much so that the cheap tricks used to distract you feel a bit insulting in the end.On the other hand, when most films made in the last decade don't even bother putting in the amount of intricate plot mechanics as I See You does...it's definitely worth a watch."}, {"id": 40, "text": "I'm shocked at all the positive and glowing reviews for this movie. I can't put into words how terrible this movie was."}, {"id": 41, "text": "Excellent film, well worth watching. If you like edge of the seat thrillers that keep you guessing then this is for you."}, {"id": 42, "text": "For once the overall ratings where reliable. This movie deserves at least a seven. I gave it a nine, because it is a low budget production that achieved a lot. Indeed, not a horror movie but a very intriguing story that keeps you guessing until the very end. No gratuitous violence or sex scenes that most movies seem to rely on. I can not understand that some reviewers gave it a 1 or 2 rating."}, {"id": 43, "text": "I have been reading more and more about this film on the internet as more and more people watch it. While I didn't take much notice of the reviews at first, the more I see its name mentioned, the more I became curious about it.When the film started, I thought it is going to be one of those mystery films which an unknown entity starts troubling people and you get to find who or what it is towards the end of the film. Well, this film is also like this but with a big, unexpected twist halfway through. And for that, the film gets a positive rating from me. A well-deserved 7/10.Would I watch it again? Probably not. Would I make my friends watch it? Sure."}, {"id": 44, "text": "I was not sure what this movie was really about when I started to watch it with its creepy vibe but it kept me enthralled throughout and loved how just when you thought you sussed it out it twisted and then twisted again right up until the endPut your feet up and enjoy its a great movie"}, {"id": 45, "text": "I feel like anyone who left a negative review didn't watch the whole thing. I'll admit it's one you have to stick with. It doesn't start out bad, just a little slow with an unclear direction. But with this one the payoff is definitely worth it. Nothing beats - jaw on the floor for the final parts of a movie and leaves you a little speechless afterwards. Great thriller. Mind bending."}, {"id": 46, "text": "I have seen a lot of thrillers in my time, and seen most plots, and twists in these, both good and bad. I believe i have a keen eye for spotting the surprises in thrillers, but this one really took me by surprise.It starts of with on premise, where you sit and say: Oh no...not another one of these! and then it flings you in a completely different direction, and just as you go along with the new direction and think you have figured that route out, it does it again! I really liked it, just keep with it, and remember: THIS ONE IS DIFFERENT!"}, {"id": 47, "text": "I don't ever write reviews but felt compelled to after seeing some of the negative reviews for this film. 1. It's not supernatural - I don't consider this a spoiler. It's just a warning to anyone looking for some ghosts because this isn't that movie. This movie is for the open minded. I think it's unfair to give the movie a low rating just because you expected ghosts. 2. It's a story with a twist you will not see coming. It has a steady build up that might make you think you know where it's headed and may seem strange and even silly at times, but coming from someone who is a thriller movie fanatic, I had chills and a jaw drop. It definitely did not go in the typical direction I expected and turned out to be very clever. If you're watching and think it's slow, you're probably not the type to appreciate good and detailed story telling. The pay off in the later half of the movie is totally worth it!!!"}, {"id": 48, "text": "This movie is mediocre at best at anything it attempts to be. It uses the idea of changed perspective but done pretty poorly compared to other movies that use it. It prides itself off being a movie that keeps you guessing. But as soon as the perspective changes (less than halfway through the movie) you instantly realize who the new male character is and also the person behind it all. The only thing that could have given this movie more depth is the reasoning behind the villains motives, which it doesn't give you. So you're stuck with a poor take at a Thriller movie with a lack luster attempt with a changed perspective narrative."}, {"id": 49, "text": "I watched this film at the cleveland international film festival. the huge theater was packed with some folks actually standing in the back. the movie jumped right into the story and was mesmerizing throughout. great cinematography and character development. the lighting was especially well done. riveting. captivating. and spine tingling. loved it!"}, {"id": 50, "text": "I procrastinate to watch this movie and now I know I was wrong! I never imagined it was so good. Good mixed of horror, mystery and the plot twist, I you will not see it coming. Recommended!!!"}, {"id": 51, "text": "If you like mystery movies, then you'll already see the 'twist' coming by the midway point of the movie. Fact of the matter is, without any suspects a movie like this only has two options: either the 'good guy' is the murderer, or the murder is introduced in the final scene via a non-sequitur. I'll let you guess which.There seems to be a trend in a lot of modern films where the concept of an anti-hero is cast not as a chaotic character with a benevolent heart, but as a low-life who's actions drive the plot as oppose to enrich the narrative. If the view finds the hero of the story repugnant, then how can the story work?This bring us to this film's two main weaknesses:1. When the bad guys is the only interesting character, there is not point in resolving the story. I don't care how it ends as the complication in the plot is more enjoyable than the resolution. When the twist is revealed I was genuinely hoping the serial killer would be victorious in this tale.2. When the story is resolved by the actions of what is ostensibly (for the first 70 min of the movie) a low-life creep, why would I care about anything vindicating qualities he/she might possess? You can't tell the audience that a character is a thief, a liar, show them commit an act of sexual assault and violate their child and then expect them to not want to see that character lose in the end.5 stars for being well shot, well acted and well scripted. Minus 1 star for the makeup artist that botched Helen Hunt - her distinct absence of an upper lip was more disturbing than anything else about this story."}, {"id": 52, "text": "This is one of those films that doesn't get the credit it deserves. I found it on Amazon Prime and the trailer looked good so we watched it. It didn't disappoint. If you're looking for a creepy film with some great plot twists this is one to watch."}, {"id": 53, "text": "The characters (especially the cop husband) are morons. How many blatant signs do they need before they catch on that someone is living in their house? If you believe that Helen Hunt's appearance is CAUSED by plastic surgery, then you need to check YOUR closets and under your bed. She's aging horribly and appears to be a heavy smoker, based on all those deep lines around her mouth. Apparently this film is based on some urban legend that has it's own made up descriptive word. The target audience must be those with double digit IQs. No wonder Hunt's career tanked."}, {"id": 54, "text": "First sign of cheap, &amp; used a lot in this movie, are lots of drone type overhead views of streets, houses, country side. Second sign, is the really poor quality audio where the speaking voices seem echoey, and at times out of sync with the actual speaking mouth. Also out of place &amp; almost disconcerting was the background music &amp; sound effects - didn't fit the storyline. Viewer made to think we have a haunting w/the usual electronics turning on/off. Acting was as poor as our home invasion/kidnapping/dysfunctional family disjointed script."}, {"id": 55, "text": "If you want a little something a little fun this is the movie....plenty of WTH moments throughout to keep you thinking!"}, {"id": 56, "text": "Poor Helen Hunt's lipless, skull-like face is one of the scariest parts of the movie. It was honestly distracting to me at times....The movie is incredibly well-shot, especially in the first half, and the score is very intense. Unfortunately there's a major tonal shift about halfway through, followed by some pedestrian twists that almost ruin what had been, until that point, a very tense, engrossing thriller. Despite being left with an unpleasant taste in my mouth, I still enjoyed a lot of it, and I'm very interested to see what else the director and cinematographer have done."}, {"id": 57, "text": "I see there is some young writing talent out here. This script is not the orthodox one and in fact it is written in a layer form. The film starts out and does everything in order up until a certain point in the story with the main characters. Then it restarts the entire story using a different set of characters point of view and shows us viewers what is really happening. The way to enjoy this film is to watch the first part, and try to guess what is really going on. Then expect to be wrong on some parts when you get to the second layer. It is darned entertaining to do it this way.I think it falls short of perfect in 2 places. First- the music theme tries to imitate John Carpenter's Halloween but this new theme is way over done. I think if the music was toned down or even lost it would be a more effective film. Second - spoiler- there is a point where a character named Alec is left alone in a garage for a long time. Logically with everything that has already happened most folks would have not sat there and waited for anyone to return to the house. Logically, they would have gotten the heck out of there and possibly gone to the authorities. That would spoil one dramatic scene, so I guess that is why it's not done.As far as the acting, Helen Hunt is fine though her role is limited in some ways. It is a fairly large cast so I can understand that her role is a lead, but she is not -spoiler- the action lead- so she really only has a handful of scenes. Judah Lewis as her son is the same way, his acting is fine but he has little action so his role, like Hunt's is a bit limited. Jon Tenney as Hunts Detective husband is excellent and he is one of the major roles in the entire film because his role is totally involved.Libe Barer plays Mindy very well and she is heavily involved in the story, though only in the second part of the film. Owen Teague as Alec is more involved in the second half and is very good too. Spoiler - the second half gets into certain clues visually which you see in the first half if your attentive. When watching this movie for the first time, pay attention to the clues, and then see how they turn out. That makes this a solid entertaining film."}, {"id": 58, "text": "I lasted all of 15 mins (if that) into this movie before having to switch it off through utter distraction of Helen Hunt's face! I can't tell you anything about the movie ... sorry! But if you can look past Hunt's face kudos to you! She was once a beautiful woman but now, instead of aging gracefully, she is a frozen walking advert NOT to ever have cosmetic surgery! What a waste - she is a great actress but now her face is too distracting."}, {"id": 59, "text": "I couldnt finish this movie because the face of Helen Hunt. Its grotesque"}, {"id": 60, "text": "I was a bit sceptical at first. But was worth the watch. Unexpected twist."}, {"id": 61, "text": "Stay with it and don't miss out on any of the details. Pay attention to everything. Much that seems random has reason. I found this thoroughly enthralling. It's more complex than convoluted. There were scenes that I needed to watch twice In order to absorb what was happening. The climax brought tears to my eyes. In many ways, this is a beautiful film. Also, the scenery and cinematography are noteworthy."}, {"id": 62, "text": "My wife likes to try to figure out the ending of a movie before the plot unravels. I prefer to sit back and enjoy the story. This was a great story. Different than most other movies. Some might label it too slow and lacking action. I think it had just the right amount of twists and turns while maintaining a fair amount of suspense. The acting was great, director did a great job and the score was just right. I found myself literally on the edge of my seat a few times, leaning toward the TV in anticipation of what was to come."}, {"id": 63, "text": "At first it seemed to me that this movie was rather conventional, not good not bad. So, I expected nothing special. But suddenly, to my surprise, I found myself routing for the wrong team! This happens not very often to me, so in my eyes it is a great thriller and a fresh addition to a genre, that seemed to have lost its edge lately."}, {"id": 64, "text": "The main thing I ask after seeing a movie is Have I already seen this done before or does it bring anything new to the table? This delivers; extremely clever storytelling. I don't buy the reviewers here who said they had it figured out or knew what was coming. The twists were awesome. Watch the movie, you wont regret it."}, {"id": 65, "text": "If you want to watch movie with some creepy feeling, you should watch this and you will never expected the twist of this movie, recommended."}, {"id": 66, "text": "Helen hunt looks like a alien grey that loves crack. She's aged horrible. Now about the movie. Tries to be clever with its, swerves. But it fell flat. Had promise. But crack head hunt ruined it for me. I thought she was going to peel off her skin and jump on board the mother ship"}, {"id": 67, "text": "One of the twistiest stories I've seen for a while. Intriguing shifting waters. The score adds such tension. Well written and executed. Innovative story. Thanks for making this film."}, {"id": 68, "text": "It all starts out pretty trite. Difficult relationship between husband and wife. Difficulty interacting with your own child. Nothing surprises. But then the director starts to raise the suspense with music and plot twists. You do not tear yourself away from the screen until the last seconds. And maybe in some places, the plot seems either predictable or sagging - but overall, the impression is extremely satisfactory. Atmospheric and exciting!"}, {"id": 69, "text": "Helen Hunt, Jon Tenney and a great cast of young stars on the rise you can't go wrong in I See You. This movie delivers thrills, chills and then some. I want to see more from Director Adam Randall after this film with more twists than a roller coaster. Do yourself a favour with this flick that deals with real horror not torture or the supernatural. Shot on a low budget of just 3 million dollars it deserved wide cinema release over so much crap that gets green lit. The opening scene is a beautiful setting complete with Chagrin Falls, Ohio waterfalls, just outside Cleveland...but it gets dark real quick and works in three parts from different perspectives. Strange occurrences plague a small town after the disappearance of a young boy whilst riding his bike in the woods, but things are not as they seem on the surface."}, {"id": 70, "text": "This movie is the best movie I've seen all year. I didn't watch the trailer so I wasn't sure what to expect, but it was a great psychological thriller with some creepiness and crime all thrown in. So many good twists and turns and never a dull moment. Highly recommend."}, {"id": 71, "text": "I was looking for a movie that would keep me guessing as to what was going on and I See You so does that. It starts off as a run of the mill kidnap mystery but very quickly turns very, very dark. A sign for me that I really like a film is when I get the chills when something mysterious happens or when, from shock, I move my hand over my mouth. Both happened several times.If you are looking for a really good mystery thriller with a gut punch in the end, this is it! It will keep you guessing!"}, {"id": 72, "text": "Well let me first start off by saying this movie has awesome sound quality and camera angles.. and when you think you got it figured out... nope.. lol good movie highly recommend it . So what you doing . Do your self a favor and go watch it lol 😆"}, {"id": 73, "text": "It was nice to see Helen Hunt on screen again. Most of the acting in the film was well done. It is true of the plot, things are not what they seem. Although my mind was not blown, I did not predict the outcome. (While there is violence and murder, the film is not gory.)"}, {"id": 74, "text": "I have not sat in awe for minutes after an ending in a long time. This was a roller coaster ride. For the first half hour I was enjoying the movie but was not overly into it. As the movie progressed, it became more and more interesting and intricate. The movie ended with a Shyamalan esque twist that was wonderful. Wow.Edit: After I submitted my review, I went on to read some of the negative reviews. I am left scratching my head as to how some people could feel that way about a movie that genuinely loved."}, {"id": 75, "text": "Holy crap this movie was brutal. Absolutely brutal. Half way through they start the whole thing over and it gets worse and worse. Do not waste your time or money."}, {"id": 76, "text": "I hated this film to begin with. I found it boring, and like some lame c-grade horror flick, with half the scenes barely even making sense. It felt like a Lifetime movie.Then the film shifted dramatically and changed into something completely different. It was like watching two separate films, with a heap of separate stories taking place at once. It did this effectively though, and managed to weave all the strands together quite well. It certainly drew me in and captivated me throughout the second half.I really didn't see some of the twists and turns coming. I'm glad I persisted through what I found to be a tedious first half hour. I See You felt like smart writing by the end, and definitely had a little swagger and style in the way it was made.One of those films that leaves you kind of stunned by the end."}, {"id": 77, "text": "Bit slow to get to the point but if you stick it out, good thriller, straight up horror in the mildest of ways borderline not horror at allGood suspense excellent choice of music which addsto the suspense however some of the scenes were misled by the music, not bad at all considering the rubbish out there these days (referring to a certain streaming service)All in all enjoyable if you're not too picky"}, {"id": 78, "text": "I made a point of not reading any spoilers or watching any trailers and I'm so glad I did . All in all it's a good tale told well a good set of twists"}, {"id": 79, "text": "I watched this without any expectation of a good film. But this is actually solid. The eerie directing makes this a creepy mystery thriller. You should definitely give it a try."}, {"id": 80, "text": "So good. what a twist at the end. it's such a goos movie and scary if you fear break ins and stuff lol. definitely one to show your friends"}, {"id": 81, "text": "I can't believe I never heard of this movie until now! I absolutely loved this move!! Fantastic twist &amp; very suspenseful!! Great movie!!"}, {"id": 82, "text": "The first half is very exciting, in the orhter half of the film you see from a different perspective. thats really interesting, a good plotwist. dont get distracted by the negative reviews. it is really good!!"}, {"id": 83, "text": "This isn't a horror movie. It is a psychological thriller told from two different perspectives! It is a 'pull you feet up, knees to chest, nail biting' thriller. Not one ounce of predictability, and an amazing plot twist!"}, {"id": 84, "text": "The first thing I did after watching this movie was looking for the name of the music composer. because the music and sound desgin is incredible. it creates a very creepy and frightening atmosphere. it is not a typical horror movie, actually its more like a psycho thriller. it is unpredictable with many surpises in the story. don't read too much about it. it would destroy movie experience. it is a great story, and it is realistic - no supernatural or paranormal activity, no ghosts, no monsters. but a lot of high tension."}, {"id": 85, "text": "I was not expecting much going into this movie but wow was I suprised I don't want to spoil anything but I just want to say there are some huge plot twists. I highly recommend that you watch this movie"}, {"id": 86, "text": "Is this a ghost story? Is it a murder mystery? Is it about a failing marriage? You don't know anything until the end. There are some drawn out parts where you just want to say, alright already move on. One long part was filmed in a video camera style. That style is antiquated and boring. I don't watch my own home movies without editing them first. Music was not a great choice and not sure if they knew what they wanted or just compromised. The right music sets the tone without realizing you hear music. When its over you will definitely keep talking about it with whom ever you watch it with, and will analyze over and over again. But, not willing to rewatch to verify any holes. One scene a woman asks Helen Hunt's character about the investigation. Hunt seemed cold. It feels like the director wants you to feel its a small town, but is it really? Don't really know the characters. No depth, no passion, a good anger seen from the son. You really want to love them or hate them so at the end you are either heart broken or happy with the outcome. No matter what, definitely surprised."}, {"id": 87, "text": "This movie is an interesting mystery thriller. Some good twists and overall pretty well done. Good acting and setting. On the other hand some plot holes on the script, and feels like the story is not full developed. A lot of pieces missing. So overall, a good and watchable mistery thriller, but not great."}, {"id": 88, "text": "Wow! What a surprisingly great movie. The twists and turns. Even when you discover what's going on, still more surprises. Very original story and well acted. If you enjoy thrillers, don't pass this one up. Enjoy"}, {"id": 89, "text": "Very boring, bad acting, nothing interesting. The plot is full of nonsense. I cannot recommend that movie."}, {"id": 90, "text": "Nothing better than a thriller that is thoughtfully planned, with excellent acting. Lucky enough to see this at the Cleveland International Film Festival last week and couldn't stop thinking about it. Dynamic music added to the experience."}, {"id": 91, "text": "There are much worse movies out there, but this movie is probably not worth your time unless you're a fan of Helen Hunt I suppose. A five rating is accurate.For those that are bashing Hunt's appearance or found her distracting... Everyone ages and everyone will not look the same forever. Everyone. People making disrespectful remarks are probably fairly young, self absorbed and a bit cruel in nature. Grow up."}, {"id": 92, "text": "I don't know where to begin. One would expect a person to do something stupid occasionally. However, when the husband, who is a seasoned detective as well as a fairly successful serial kidnapper/killer, his wife, their son, the phrogger that has insinuated herself into their lives and her psychopathic cameraman make stupid decisions and mistakes on a nearly hourly basis, you know the writer of this film took the lazy way out, going for cheap scares and spooky atmosphere rather than good writing to move the plot along. Oh well. I guess the actors have bills to pay too."}, {"id": 93, "text": "Wow this was bad in so many levels. Its like two bad storied made into one really bad movie"}, {"id": 94, "text": "Misleading and boring movie. Nothing makes sense, the two intruders are annoying and bad actors. I cannot believe I fell for another movie simply because an actor is nominated for an Oscar and has done a better job in the past. You just keeping wanting to watch hoping for some thrilling excitement. Huge waste of time!"}, {"id": 95, "text": "Such a dark clever film, I started to lose interest in the beginning and worried that it was going to be another supernatural predictable movie but I was pleasantly surprised. Reminded me of the strangers and has left feeling uneasy going to bed"}, {"id": 96, "text": "Well made thriller/horror that uniquely twist and turn the story, just as it twist and turns the perception of movie genre."}, {"id": 97, "text": "Helen Hunt looks really really bad. I didn't even recognize her and kept thinking WHO is this actress? apart from that, I like to story and the concept, I'd given Greg a bit more time to explain to Alec why was he the kidnapper. Also I'd have make Alec flashback a bit longer and to give more information about what happen to him and his buddy (who is now disfigured). 30 mins more would have made a wonderful movie."}, {"id": 98, "text": "Best thing about the movie was the score. Worst thing about the movie... was Helen Hunts face"}, {"id": 99, "text": "There is nothing credible about this movie. A husband of many years being a pedophile and a serial killer all along without his wife or son noticing nothing?? Started good though ..."}, {"id": 100, "text": "Jesus.... what's happened to Helen hunt? She looks like mason verger from Hannibal.... If there's ever a case to put you off Plastic surgery this is it. I couldn't get pass it ....the film was really bad plot less and boring . Frustrating ending ."}, {"id": 101, "text": "Absolute mess with no point. Awful music, awful plot. Just one very bad movie for teen fun"}, {"id": 102, "text": "Wow, so many twist and turns it's hard to talk about without giving anything away... Villains become heroes, and heroes become villains, and by the end you don't know who you should be rooting for. Helen was not fully utilized in this movie, but she did a fantastic job for the short amount of screen time she does have. This movie is very different from any other traditional horror movie. It's definitely more of a psychological thriller with all it's tricky surprises. Halfway through the movie something major is revealed to the audience, and we then relive the beginning of the movie knowing new information from a different point of view. It really works, and I cannot think of another film to do this successfully in a long time. While watching, you can tell it is low budget, but it does not ruin the value. The sound is fantastic and the music is chilling. (Think Get Out meets Annihilation) A modern horror sound, page turning script, edgy cinematography, good acting, and 3 surprising twists = a wonderfully fun thriller execution."}, {"id": 103, "text": "The worst and scary thing in the movie was Helen Hunt's face and her acting. What did she do to her face? I couldn't look her face more than 2 seconds, it was nightmare."}, {"id": 104, "text": "Half way through the film the perspective changes which could have been done well but the actors were really terrible and the male role was unbelievably annoying like it's enough to put you off the movie, just bad acting to it's core. Most scenes from there are written poorly"}, {"id": 105, "text": "I'm amazed with that movie, didn't want it to end...I'm speechless!!!!"}, {"id": 106, "text": "Has one of my fav scenes in it. i love thrillers/crime shows when they excersize the ideology that predators can go die regardless of what excuses they possess.movie had me thinking/judging a certain way for a long time. was super tired but still couldn't stop watching. now i'm paying for it in the morning :P"}, {"id": 107, "text": "Very well played. Nice movie I was thinking that this will be lame spiritual movie about ghosts and etc. but when they've revealed everything wow, nice job, my top 10 best movie of 2019."}, {"id": 108, "text": "Cliche exceptionally intelligent technologically savvy luck of the devil teenagers. Theses are the opposite of the usual group of (ill-prepared misfit) friends on an expedition Not that I am a generation basher nor condone any kind of bashing but I think you know what I mean."}, {"id": 109, "text": "If you have nothing better to do than watch a stupid movie, this is it!"}, {"id": 110, "text": "The movie starts off with making the viewer think there is a malevolent and invisible creature hunting young boys. There is no such creature and the movie disappoints from then on. There are too many illogical twists and turns that try to confuse and involve the viewer, but that doesn't work. There is little character development and the movie quickly becomes not only boring but stupid. A very disappointing movie that wasted 1-1/2 hours of my time."}, {"id": 111, "text": "This film start with a little girl buying an ice-cream, a boy riding a bicycle and ejected from his seat, a woman Jackie cooking and her son Connor talk with her, she went away, and her son talk with her husband Greg scene! As turnout, this film is about a pedophile police officer Greg kidnap a bunch of innocent kids in a caravan, a man who break into his house(Alec) eventually expose his crime! Entire film quite slow and bored! The background music in the film also super annoying! Barely intense scene is at the ending of the film! Alec found out Greg is the kidnapper, and Greg also kill his friend Mindy! Alec kill Greg with his gun! Detective Spitzky arrive and shot at Alec, but Alec survive! This scene a bit bloody! At the end, Alec tell Spitzky all the truth about Greg! The missing kids eventually save by the police, and Alec sent into an ambulance! That's it! Another boring film!"}, {"id": 112, "text": "People are actually calling this flawless. This movie makes no communication that it is a supernatural movie. In fact it goes against that after the big twist which awkwardly changes the whole genre of the movie. But back to the supernatural thing, why is that an issue that it doesnt push to be supernatural? The first scene in the movie shows a kid floatng off of his bike into the air. So I am given a supernatural impression. Apparently everyone else forgot about this part of the movie. So that put me off for the rest of the movie. Good cinematography and fairly original. Also the music mixing and timing and overall choices were horrible and not subtle in the slightest. Watch Funny Games (the remake) if you want an actual fantastic home invasion. And if you want the mystery part of the movie then watch prisoners which also does a much better job. You will like this if you want a twist and dont want to think about the movie as your watching."}, {"id": 113, "text": "The whole idea of this film is brilliant, it's just a shame that the way it played out was slow and abit boring. The entire first act was flat and boring, nothing happened to keep me interested in the characters or what was happening. But when the second act came it managed to pick up the pace of the film making me want more. The idea of the second act should have just been a film on its own, as this entire film is two completely different story's that are pushed together in that's last 5 minutes of the film trying to make them one, this then making it feel rushed and abit pointless. I didn't care for the characters, it was emotionless and dull. Wouldn't really recommend this film unless you wish to waste 90 minutes of your life."}, {"id": 114, "text": "First: it forces the viewer to see this as a mystery movie since the beggining. I mean the first shots, the light, the music...it's like... you don't even see the characters and already know oh..they want us to believe this is a scary or dark flick. it's forcing us to believe that.second: the mystery itself it's not that well explained, because they put all these strange happenings in the house. it's like oh we have a crime case going here, but that doesn't matter, look at all those noises, and the music, and the forks and stuff! i would prefer more a movie mystery honestly.third: the second half. it's a bit of disappointment when you understand what's going on. They spend such a long time explaining all of that, giving an unnecessary perspective about what's really going on... the only thing that can surprise you is to understand who killed helen hunt's lover. from then on you easily guess who that kid is and what type of person is hunt's husband. i think the progging thing it's a lame excuse, because it's unknown to a lot of people. they shouldn't call it frogging, just someone occupying their house.i mean...it's not all bad, the movie progresses well, you're engaged mostly in the first half, the pieces kinda are well together... but when you use a resource to explain most of the happenings that most people are not familiar with, you're using an excuse to mske your film work. you could even have people occupying the house, without calling them phrogging. might be only that guy wanted to terrorize for revenge, and that would be ok.and i wouldn't occupy so much screen time with those two tenagers honestly. the movie would benefit to be more like the first part when it was a pretty watchable thriller. it's no awful but nothing special."}, {"id": 115, "text": "...of crap this crapfest is. I want my 1:38 back. I kept waiting for something interesting to happen....I'm still waiting...."}, {"id": 116, "text": "....this movie was friggin' fantastic. I love physiological thrillers and this one fits the bill. The only reason I didn't give it a 10 was because a couple of the scenes are unreasonable, for example, why schedule a service man come to your home when you aren't going to be there?, why not question said serviceman more when he says a young lady opened the door? It's little things like that which erk me but I got over it. I'm pride myself in figuring out whodunnit before the movie tells us, but this one I didn't know, which totally surprised me. Great job!"}, {"id": 117, "text": "So many twists and turns, I actually sat up in shock like 😱 twice 🤣 Such a good thriller and I was expecting a horror until about half way through but absolutely loved the twist and then the second twist. You end up rooting for the bad guy.Definitely worth a watch!"}, {"id": 118, "text": "The most frightening thing was Helen Hunts new face. What has she done with her old one?!Cinematography was good. The needless ominous music for each scene was tiring in the end. It reminded me of It Follows, until it didn't.That reminds me, watch It Follows."}, {"id": 119, "text": "I found this film over rated. The acting was so bad, especially Helen Hunts, the story in it self would have better if there was a better script and direction, Honestly the acting was so bad and you all got from this movie was over hyped suspense and tense backgroun music. Other than that there was no point to this stupid film. Don't waste your time on it."}, {"id": 120, "text": "I feel like the bad reviews are from people that didn't watch the movie in it's entirety or didn't understand it. It's so good, I've watched it twice now and it's enjoyable the second time round. Things makes more sense and everything connects. Even fine details to what's on the tv connects. The music, the acting the characters, the script is impressive. The story is great bc it's believable. A big house, unhappy marriage and angry teen represented well in the story. Watch it to the end and it's worth it."}, {"id": 121, "text": "Its not a slow burn , its a quirky thriller that has you guessing from start to finish. amazing script, great acting , edgy storyline with top quality casting. baffling at times, jumpy and cringey , but brilliant throughout!!give it a whirl, thriller fans will watch it and watch it again!! enjoy a nice well put together piece of cinema!"}, {"id": 122, "text": "There is only one horror in this movie and that is.....Helen Hunt's face. Yikes!! I See You is just a pretty average mystery film. Thank goodness Hunt isn't seen much in the last half."}, {"id": 123, "text": "If you are into movies with twist and turns, take this ride. It will keep you guessing until the end."}, {"id": 124, "text": "Getting lots of praise and the film was pretty good but more of a mystery than a horror film. Great acting and a lot of fun and good twist but to me just another abduction story."}, {"id": 125, "text": "This just shows that you do not need a multi million dollar budget and what you can do for a meagre 3 million dollars.Although the film builds itself up with clever scenes and sound effects to be a horror the film is actually a cleverly constructed thriller and it succeeds in its modest budget tenfold.First off the acting is decent, photography is well crafted and it is written very cleverly to reveal the story slowly almost with spoilers all the way. Helen Hunt is fantastic as always but oh my what has she done with her latest plastic surgery, I do have to admit that seeing her now it is quite disturbing as she looks like Mason Verger from the movie Hannibal so disastrous is the plastic surgery she had in 2009 that it does actually impinge on her acting now and distracts the viewer every time you see her as she actually looks like she has had horror movie makeup and latex fitted to make her look unworldly - how very sad that such once beautiful and talented actresses such as Hunt have to do this to keep up in Hollywood - what is wrong with growing old gracefully but for me it does distract your attention in almost every close up scene she is in.I digress however, the movie itself is well paced and thought out and the ending is masterful. I wonder how many people got the little scene at the end intimating that Alec was indeed the child who escaped from the serial killer at the beginning of the film and that was his reason for Phrogging the house as he wanted to exact revenge on the Serial killer who had killed his friends. It is little things like this that make this film a better than average thriller, even the scene where the little boy is mysteriously pulled into the air from his bike seemingly by an evil ghost/spirit to draw the viewer in when in fact it was actually just a tripwire - magic!But what elevates this film above the usual is the superlative music and sound effects reminiscent of the recent Stephen King series The Outsider and which lends itself to making the film seem like a horror movie rather than the thriller which it is - my advice on this one is if you have 5.1 surround then turn it up to the max; pure cinematic ingenuity so this one gets very good 7/10 hatchets."}, {"id": 126, "text": "This is a well-told story that slowly unfolds with an unconventional timeline. It may seem a little slow, for some, in the beginning, but stick with it. The pace is purposeful. The bad reviews seem to come from people who are more interested in simple blood and gore horror. This is horror, too... but it is also, suspense, mystery, and thriller. It was obvious from the beginning that the viewer would be exposed to multiple storylines, but the deliberate layering pays off later with a reveal most won't see coming."}, {"id": 127, "text": "An excellent brooding psychological thriller, nice story with enough twists, slow long pans and zoom shots, with a sound score filled with menace and a plethoria of atmospheric drones sets the viewer up for a decent finale. Overall competent decent acting, film reminded me of 'silence of the lambs'."}, {"id": 128, "text": "Every now and then you come across a movie so intriguing and captivating that you feel compelled to write a review. I am a huge fan of thriller/mystery/horror movies but the recent productions have left me utterly disappointed until I watched I SEE YOU.This movie is absolutely fantastic from start to finish. I do not want to go deep into details but the twists in this masterpiece will certainly keep you entertained.Special mention to Owen Teague!"}, {"id": 129, "text": "I was doubtful for the first 30 minutes that I had made a good movie selection. But once it picks up....It. Picks. Up. Great thriller film."}, {"id": 130, "text": "The story itself is genuine and had some great potentials ,, the thrill and mystery level was surprisingly high ,, but it kinda all felt dull and slow by the bad acting !! It's fair to say I'v watched this movie after I watched Marriage Story so maybe that's why I felt here like I was being laughed at !!! you definitely can't compare Adam Driver's act to anyone's here ...Anyway ,, the movie is okay since the thrill been leveled down by the cast ,, but on the other hand, the movie is watchable if you really wanna know who kidnapped the kids .. which in fact what made me go through the movie to the end in the first place.I gave it a generous five stars just to say ,, you guys had something there,, but felt like we shouldn't spend a bit more on a better cast.."}, {"id": 131, "text": "Scary. original. creepy. unexpected. surprising. pretty much all you need. go."}, {"id": 132, "text": "The family drama that went on for about 45 minutes or so was painful. The phrogging part was at least a distraction and made more sense by the end. The psycho killer part was pretty good thriller material and the twisty turny part just made me dizzy. The highlight for me was a pretty darn good score."}, {"id": 133, "text": "Helen looks like a monster. She's more frightening than the movie."}, {"id": 134, "text": "Great movie, kept me on the edge of my seat the whole time!!!"}, {"id": 135, "text": "Very entertaining mystery / drama / horror movie, the plot and storyline are quite original and the execution overall is really well done.The type of movie you start to watch and get sucked in straight away.9/10"}, {"id": 136, "text": "Unconventional, thrilling and well elaborated. The music does a lot to keep you in an alert state."}, {"id": 137, "text": "This film is a classic theme of revenge but delivered to the audience in a way that keeps you on the edge of your seat &amp; guessing to the very last scene!! I saw this at the Cleveland International Film Festival (CIFF) this past weekend. The cinematography showcased our fine city on the shores of Lake Erie to Chagrin Falls. The acting was superb along with the writing &amp; overall production by Matt Waldeck with Zodiac. If you're looking for a movie that keeps you guessing until the end then you need to check out, I See You."}, {"id": 138, "text": "This movie kept me guessing the whole time!! Great movie!"}, {"id": 139, "text": "I was excited to watch Helen hunt after so many years and it was a disappointment. She barely has any screen time or place in the story! The trailer and the poster are misleading."}, {"id": 140, "text": "This movie came out of nowhere. And I really had no expectations. I was a bit apprehensive when I saw Helen Hunt's name in the cast. But honestly, her expressionless face works in selling her part in a very complex story. A story that even if you think you got at the end, I will tell you the movie's even bigger secret up front:It was no accident or coincidence that Alec was in that house. You see, right when the movie turns from what you think is a supernatural thriller into the actual story, Mindy literally tells you that Alec, who is from the town while she is not, picked the house. Why this house? Because he knows who lives there. And the resurgence in the kidnappings has triggered his memories. We know from the end that he was one of the two earlier victims who escaped the man in the house in the trees. We also know that the experience really traumatized the other boy. Watch Greg's reaction during that scene. On the second viewing, it becomes something entirely different. And then we are cleverly led away from the subplot of the two surviving boys which helps set up the ending.Also on a subsequent viewing, you understand Alec's motivation for what he is doing inside the house. We know the initial kidnapping really messed up Tommy so it is not that unbelievable that Alec has become also equally unhinged. And this explains why Alec stalks Greg in the house. He watches him obsessively. He trashes his photos. He literally marks Greg in his bed. Alec is out for revenge by mentally and physically torturing his childhood kidnapper. It is also very likely he is in the house looking for evidence like the pocketknives.During the climax when Greg tries to explain his criminal reasoning, he is so readily dismissed by Alec because Greg and Alec have already been acquainted for 15 years. Alec is there on a mission and has no need to empathize with the monster who ruined his innocence and youth. And then Alec as he lies wounded on the kitchen floor gives us the signal that he knows and remembers the other detective who alone interviewed him and Tommy all those years ago by calling out Det. Spitzky's name.And then the flashback ending that we were teased about and made to forget finally reveals itself. And while we already know that Greg is the villain of this story, we learn ultimately who Alec really is.But what triggered Greg's return to child abduction that in turn triggered Alec's revenge? Well, it is highly likely that Jackie's infidelity leading to Greg's feelings of masculine inadequacy and Connor's rebellion pushed him. He briefly tries to blame some events of his youth before Alec shoots him. Neglect, abuse, divorce, even the enuresis - hallmarks of a serial abductor/killer in training.This movie is so very well-constructed and layered. It really is quite something. Beautifully plotted, shot, acted. It is far deeper than it seems. Well-done indeed."}, {"id": 141, "text": "This movie needs a wide release! I was awesome! So suspenseful, was like a roller coaster ride"}, {"id": 142, "text": "This was rated a 6.7! Really, looks like re-edited because the saw it sucked so bad."}, {"id": 143, "text": "I wanted a spooky movie. Fine, it's not that, I like a good thriller too. Though well directed, the first three quarters of the film are dull. The developments later on are pretty good but I don't think the payoff is worth sitting through the slow pacing."}, {"id": 144, "text": "OK thriller told in flashbacks. The score is not just bad, it makes you want to jump into the movie and kill the composer. Also Helen Hunt looks like she just had all her teeth removed."}, {"id": 145, "text": "For a horror/mystery, this is a great movie! It might start off a little slow, but it has an extremely interesting plot line. I never knew exactly what would happen next. It starts out as a horror, but doesn't quite end that way! I would highly recommend it. The poor reviews come from people who like fast paced movies, I would assume. This genre usually has the worst movies ever made and this is much better, so it may even deserve a 10/10!"}, {"id": 146, "text": "Really scary and thrilling. Worth watching and even more. But seriously: Helen Hunt's face? Why? How? Plastic surgery gone very bad. Maybe even the scariest element in the movie :)"}, {"id": 147, "text": "What a fantastic thriller. The atmosphere it conjures endures the entire film. Stories interweave, characters are three dimensional, the tension is maintained throughout. Such a good Friday night film."}, {"id": 148, "text": "A very enjoyable must see! Not what I was expecting. This is a very good mystery thriller with great twists and lots of atmosphere. A good strong cast, excellent script and great locations. This is the type of movie I like and I haven't seen on the screen for a while."}, {"id": 149, "text": "I went into this movie not expecting much, thinking it would be your typical cliche paranormal horror. But I was far from right.This movie kept me on the edge of my seat for the whole 97 mins. If you're a fan of mystery horrors that keep you guessing until the last scene, then definitely do not give this one a miss!Not only was the story line gripping and excellently put together but the production and camera work was brilliant. The score added a chilling feel that caused the hairs to stand on the back of my neck.Highly highly recommend"}, {"id": 150, "text": "The first half of the film seemed to be a fairly standard murder mystery then it quite cleverly turns everything on its head. Unfortunately some of the characters actions are just too absurd to be believable and it all becomes a bit too silly. The scariest part is how much Helen Hunt has morphed into Odo from Star Trek after too much plastic surgery."}, {"id": 151, "text": "I enjoy watching movies, but sometimes it gets old because I can always figure out the plot, and they become too predictable. This movie was kind of slow in the beginning but man oh man, am I glad I kept watching because it kind of blew my mind. Finally, a movie that surprised me!!!"}, {"id": 152, "text": "Not a bad movie but when ur expecting horror its quite disapointing to see how the plot evolve far from that... Its goes from horror to slow thriller where you just want to get to something juicy. Its one of those movie where the ending makes up from the lack of the scenario thorought the film WHEN you didnt it coming (but we did so it didnt gives us any uplifting emotions...). So when you realise you've been lie by the trailer and you come to the first plot twist you easily can predict whats gonna happen. So we were pretty disapointed by the movie."}, {"id": 153, "text": "It thinks it's better then it is. There's a real sense of arrogance in the director's style here. The acting is mixed Hellen Hunt is good enough considering the poor dialogue. The rest are a bit bad thou. Could be Just be the dialogue though. The score was over the top too."}, {"id": 154, "text": "So many times I thought I knew what was going to happen next or who was the villain. NOPE. I had low expectations but it ended it ended up being thoroughly enjoyable."}, {"id": 155, "text": "Its a really good story at the beginning i didn't know how they're gonna close the whole story but it ended pretty well, very good ending explanation and motive, its that feeling of aaaahhh know I understand why  real nice and good plot twist. I enjoyed it"}, {"id": 156, "text": "I've watched thousands of movies in my days. Long time since I got one that made me go A-HA on two separate occasions, the first one being dead wrong. Anyone who enjoys a good thriller should jump on this. Can't wait to watch it again at a more reasonable hour so I can turn up the volume."}, {"id": 157, "text": "This movie was not what I expected. It actually turned out to be a really decent thriller. Once it kicks into gear, it goes. And it's a fun ride."}, {"id": 158, "text": "I watch a ton of horror/thriller movies and this was a unique one, at least to me. I wish they would have chosen someone besides Helen Hunt as the mother. I can't tell if she's a poor actor, or if her character is supposed to be so weird."}, {"id": 159, "text": "I am a diehard suspense/thriller fan and good movies of this genre are few and far between. I was very pleasantly surprised to feel my heart beating faster and I couldn't take my eyes from the screen. During this time of quarantine, I've been watching a good number of movies and I've not been too picky, so it was a treat to come across a movie that got my blood pumping. I thought it was going to be a paranormal premise and I was a little disappointed about that but then events were explained and it turned out that the cause of everything could be attributed to normal, everyday occurrences and actions by normal, everyday people. I may be naive, but I just like to be entertained. So, when seemingly good people end up being the villain and then the villain is good again- I'm not mad or confused, I'm surprised and entertained! I thought it all meshed well and the ending wrapped things up fairly well but I would've like more explanation about why??? But, there are those viewers who like to be left to fill in the blanks. All in all- you won't be wasting 2 hours of your time :)"}, {"id": 160, "text": "It started out very good, with good acting and story line. But then when they went back in time and filmed it showing how the beginning played out I lost all interest. The phroggers were terrible actors. But the great twist at the end certainly salvaged it."}, {"id": 161, "text": "This movie is a slow build up, but once things come into light, watch out. It kept getting better and better. No gore. Just brilliance. Ignore any negative reviews."}, {"id": 162, "text": "Without ruining anything about the movie I can say it does have a lot of plot twists and I mean A LOT but the fact of the matter is you have to give more background and feel towards these plots and characters. If you have seen 'The Machinist' before; imagine that movie but not telling you who was after him and who he killed in the movie...Pretty lame and waste of my time!"}, {"id": 163, "text": "No explanation or background of why he the killer did it. It's always the director's fault."}, {"id": 164, "text": "If you enjoy thrillers, this is certainly one to add to your list. While it's far from being a perfect movie, it's entertaining, has a good story, and is plenty suspenseful.The story does repeat itself though, albeit through a different set of characters point-of-view, halfway through the film. While this second pass explains the odd things that were happening the first time the story is told, it does start to feel a bit long and repetitive (even though the audience is getting knew information from the different point-of-view).Overall, though, there's plenty of twists that you'll never see coming (mixed in with a few giant cliches that you knew were bound to happen from the beginning). If you're a fan of thrillers, this is a decent enough flick to give it a watch."}, {"id": 165, "text": "What is really happening with Helen Hunt's face ? I mean she's what 57 ? Her face shouldn't look that bad , she looks like the crypt keeper had a real bad face lift ,it's stuck in my head now . Oh and the movie does not make any sense"}, {"id": 166, "text": "I don't make reviews often but this movie, WOW. Just when I thought I had it figured out yet again I was fooled, this is a movie that makes you grit your teeth and PRAY that the end turns out the way we want it to. Just watch it, I'm glad I did."}, {"id": 167, "text": "While a lot of the film used old and modern tension building techniques, this is a story that I never heard before. No gore needed in this thriller/horror. Highly recommended for people who like the genre, want something new, and don't mind a moderate pace. The pacing is actually brilliant and builds the story around specific moments which don't turn out to have the significance that they seemed to have had at first.Also, great acting and writing."}, {"id": 168, "text": "This movie has a good plot but it ultimately suffers from the Get it?! syndrome. It starts well with a good mystery, and from half of the second act it starts treating you like you're legit dumb, expect multiple scenes explaining what was already heavily implied. And if cuts to flashback aren't enough, they'll even visual clues of objects you constantly see in the screen, the only thing missing was the director screaming Hey!!! get it?!"}, {"id": 169, "text": "So many twists and turns!! Just watch it!! So good!!"}, {"id": 170, "text": "Was genuinely engrossed near the end when the film comes together, was not disappointed"}, {"id": 171, "text": "Must watch! Spectacular movie with a twist towards the end. Tense musical score and sound was also perfect and the actors were good too.. Really well made movie!"}, {"id": 172, "text": "The ending of this film is a masterpiece. I didn't see anything like that the last years."}, {"id": 173, "text": "It's not often that I give a movie 5-stars. A top-rating that is in this case 10 Stars. I suggest watching this if you enjoy crime drama suspense. With a pinch of haunted-ness. 😳"}, {"id": 174, "text": "Following the disappearance of a young boy whilst riding his bike, a small town detective needs to act quickly. However, strange things start happening in his home diverting him from the hunt. Who or what is responsible?More mystery than horror, after a chilling first act the film loses its way a little in the middle but then bounces back with a neat twist before the end. Be patient and try not to change channels. Stars Helen Hunt and Jon Tenney."}, {"id": 175, "text": "I'll admit I scored this a little higher than I normally would just to help offset the lower ratings (sorry idk if it even helps but whatever). Because I think this film deserves a higher score. Because this is genuinely was of the more creepy and original thrillers I've seen in recent years. There is some interesting misdirection (I think?) used here that makes for an interesting twist. Owen Teague is amazing in this, and he only shows up halfway through, I took notice of him ever since I saw him in the show Bloodline. Some of the other performances are really good too. Not everything is great, and I wasn't fully into it until almost halfway through, but I think the direction and more importantly the writing is really good. Devin Graye wrote this and I have a feeling he's going to create some really good stuff in the future."}, {"id": 176, "text": "Finally, a good movie! It has you thinking one thing, then another, then it throws you a twist! Don't miss this one!"}, {"id": 177, "text": "This movie made me say what the f-- out loud multiple times while watching it. Alone. That's all I'm gonna say. Just watch it."}, {"id": 178, "text": "For a while I wasn't sure where this film was going and it started off a little slow. But, by the end, I found it to be a really enjoyable watch. I really like how this was done and a lot of unanswered questions and unexplained incidents in the first part of the film were answered emphatically in the second part. A good, original concept and I would urge anyone to give this film time as all will be revealed. Definitely worth a watch."}, {"id": 179, "text": "I don't know why, but I wasn't expecting too much from this. The acting was good and the film was shot well, the music was effective and not too intrusive as with some films of this nature. The main plus point for me was the story, I thought it was quite clever, they hammered some points home a little hard, but yes, good film - well worth a watch on a Friday night. Although I watched it on Monday, which also works!"}, {"id": 180, "text": "You could easily remove the son and mother from this movie and not really lose much, the film as a whole was better than expected."}, {"id": 181, "text": "I didn't expect much from this movie but take a chance on it. It'll take you by surprise and keep you at the edge of your seat throughout the movie! Easily underrated."}, {"id": 182, "text": "Nice little, twisty film. Subject matter has kind of been done before but this had a few little twists to it. Enjoyed it a lot."}, {"id": 183, "text": "In her day Helen Hunt would have been perfect for this role. It's hard to see past how awful she now looks and how unconvincing her character is. I actually didn't want to believe this once beautiful woman is reduced to this. The film could be good but Hunt is not the wife who would have the affair and keep both men"}, {"id": 184, "text": "This is a very entertaining, clever thriller.I would class this as an intelligent piece of writing, somehow it's a thriller within a thriller, it has a jigsaw feel to it, you will watch it and have many questions, how, what and who. Those questions will be answered as the film progresses, the intensity also increases, it is very satisfying.What starts out as a relatively mild thriller soon morphs into something a lot darker, it goes through phases, ending as a very dark, twisted thriller.Nicely acted, Helen Hunt does a good job, but all the cast are good.It's a fine watch. 8/10."}, {"id": 185, "text": "So I can see this movie again. I absolutely loved loved loved the plot, writing, acting, suspense, sound track and such amazing directing and cinematography. If I opt for a psychological thriller with twists and turns leaving me sitting on the edge of my seat, this is it. Highly recommended."}, {"id": 186, "text": "So, the first time I tried to watch this it started off too slowly. Or so I thought. The second time, because my movie app kept flinging it at me as a choice as a match to my normal viewing...I tried again and it was WELL worth my time. I actually can't say too much, because even a little spoils it for others. But, this caught me off guard and has a really fantastic spin. Creeped me out in places but this flick is a good thriller. Well connected once the twist presents itself. Lovely work. And it's not cheesy."}, {"id": 187, "text": "I wasn't sure where the film was going at first. Felt like some paranormal activity spooking this family and somehow it was related to the child abductions? But I could not see a connection to the events in the news and the weird things that happened in the home.Thankfully, the second half of the film uncovers what, we the audience members, did not see behind the scenes. The second half finally begin to light explains and what is happening behind the scenes that we weren't privy to, then things begin to make sense.Film has a couple of good twist ending by the end. Good film to watch"}, {"id": 188, "text": "What a great movie the acting is superb and the twists are amazing.......Will bring a tear to your eye at the end!"}, {"id": 189, "text": "Excellent thriller hat deserves a much wider audience. This was far better than most of the cookie cutter horror movies that get a wide theatrical release. The cast are exceptional especially the teenagers and I loved the fact that this movie actually has some genuine gasp worthy twists that keep the audience on their toes. This movie starts off as one thing and does a complete 180 turn which I never saw coming. Cannot say too much as there are too many spoilers littered throughout the movie. Just make an effort to watch this."}, {"id": 190, "text": "Not at all what I expected from the descriptions and it almost lost me a bit after the intro but man am I glad I watched this movie. It had me on the edge of my seat and unlike some thrillers, I didn't guess the ending at all until right as it was happening. 10/10 would recommend. I wish I could forget all about it and watch it again."}, {"id": 191, "text": "I saw the preview of this movie and wanted to give it a try. I'm so glad I did. This was a good movie with subtle twists along the way. It felt more like a mystery/thriller that you had to try to put the pieces together like a puzzle. Good acting from Helen Hunt &amp; other lead characters. I wish there were a little more character development in the beginning about the husband and wife, but some does come out. Considering some of the crap the studios churn out nowadays, I'm so glad this movie was better. If it seems a little slow in some spots STAY WITH IT. Don't look up spoilers before you watch it. Enjoy!"}, {"id": 192, "text": "Better than I expected. It Kept me all the way until the end. I recommend anyone who likes mystery crime thriller."}, {"id": 193, "text": "Greetings from Lithuania.I See You (2019) had a pretty original story which is rare these days. I did not see any trailers nor i read synopsis before watching it, so this movies plot was a really pleasant surprise for me. Its a good thriller with no winners and i will leave it at there. The only downside for me was Helen Hunt - the Oscar winning actress i actually like very much - she was amazing in anything she done in 90's - Twister (still a good guilty pleasure), the amazing As Good as It Gets - i like this actress but in this movie she was very stiff and wooden - whether she was miscast or it was a disappointing performance.Overall, I See You is a good mystery thriller with an original plot. The less you know about this movie the better it will be for you."}, {"id": 194, "text": "Like others, I thought this was going to be a horror movie. It isn't. It's full on creepy though! It's one of those movies where a tiny bit of patience pays a huge dividend. It's a real treat of a movie!"}, {"id": 195, "text": "Very well done. Pretty original too. Lots of twisting and turning. Great cast. Well acted. The filming and the sound was spot on. If you like tension and a good twist, this right up your alley."}, {"id": 196, "text": "What will always amaze me is how a writer can visualize all these sub plots and bring them together to tell an extremely comprehensive story beautifully. Every time I thought what the this makes no sense it did. Living proof that the story is what makes the movie not the special effect."}, {"id": 197, "text": "Bro, what happened to Helen Hunt's face? I haven't seen someone look that withered and wrinkled since Jessie and Mr. White were stranded in the desert. Time for a, The Mummy, re-boot staring her face! Bring back Tales From The Crypt with Ms. Hunt playing the Crypt Keeper. Jesus! She's unbearable to look at!"}, {"id": 198, "text": "I See You is one of those film that sets you up for Friday 13th but is really so badly written the plot becomes as bad as Helen Hunt's face job...It's a shame Hunt, an Oscar winner for one of best performances ever, has come down to doing this junk.Let me just say the plot is absurd and the dramatic resolution incomplete."}, {"id": 199, "text": "This movie was a real surprise! The premise is quite original, with a very intelligent story and direction. There are some major plot-shifts, the first one tilts the whole previous story like 180 degrees and the movie then repeats all the previous scenes but now from the perspective of this new knowledge, which produces some surprising new insights. A second plot-shift pushes you off your feet again, and in the very end there's yet another, that more or less ties the remaining loose ends together. So you don't end up frustrated with some open ending (like in so many other movies) but get a real satisfying closure.The acting is over-all fine, with trusted forces Helen Hunt and Jon Tenney as the central characters. My only reservation concerns Helen Hunt's looks, there seems something weird amiss with her face, I guess her character is supposed to be like 40 something, but she looks here like she's seventy, which doesn't make it very probable that her character is supposed to have had a stormy love-affair with a good-looking guy of about 40. In spite of her spotless acting, it did distract me at times from the story.Anyway, a very clever and original thriller, highly recommended."}, {"id": 200, "text": "The impression they give you is that this was going to be a good supernatural thriller,the movie started out looking like it was going to be a good supernatural thriller, then all of a sudden it switched to a home invasion type movie which I have 0 interest in.So for me it was a huge let down.If I had known I wouldn't have put it on in the first place."}, {"id": 201, "text": "This movie had me interested, then I was uninterested, and then it got me interested again, and then I was uninterested again.This review's gonna be a long one, where I pretty much explain the entire movie and then point out the parts of it that don't make any sense. Skip to the end if that's all you want to see.The summary of this movie claims that a small town detective is investigating the kidnapping of a child. We soon learn that this crime may be connected to a series of past child-murders through the discovery of a green pocket knife. Apparently the killer has a bunch of green pocket knives and he buries all of his victims with them.There's drama in the detective's house. His wife (Jackie) has cheated on him and his son (Connor) is angry. Strange things happen in this house, as if there were an intruder. At one point, the the wife's lover shows up and gets hit in the head with a mug. We are to assume this was the angry son. The lover is brought into the basement where he is killed my someone. Possibly the Connor (as the Jackie assumes) or more likely an intruder attempting to frame the son.At this point we're given a parallel story about a couple of young adults, one of whom is an avid home invader (yet the two of them take this crime quite lightly...). One of these two (Mindy) witnesses the death of Jackie's lover at the hands of the detective himself (Greg). Is this a simple revenge plot?Barer and her partner in crime (Alec) want to escape, but Alec has been playing pranks on the family (including throwing the mug at Jackie's lover) and for whatever reason, decides tranquilize and hogtie Connor and place him in the bathtub. While doing this, Alec places a green pocket knife in a bar of soap... Is he the child murderer?Alec and Mindy get into an argument and Alec pushes her down some stairs. Mindy loses consciousness, so Alec decides to put her in the trunk of Greg's car... Greg and Jackie find their son tied up and panic. Jackie takes Connor to the hospital, while Greg drives into the woods, gets out of the car, and disappears for a moment. In this moment, Mindy wakes up and finds a camper with some kidnapped children tied up inside. Greg (the detective) comes up behind her and knocks her out.Greg returns home and now decides to search his house for the intruder who tied up his son. Greg also kills Mindy, placing a gun that he had for some reason into her hand, making it look like she was trying to kill him. Alec confronts Greg. He knows that he is the murderer, and is also responsible for the series of child murders years before. Alec was one of the children that Greg tried to kill, hence why he had the green pocket knife. Alec kills Greg, Greg's partner shoots Alec, but Alec survives and exposes Greg.So, why did Alec decide to tie up Connor? That goes quite a bit beyond his usual pranks like turning the TV on randomly... Why did Alec stab a knife into the bar of soap? Was is just so we'd see that it was the same green knife from before? Why did Greg drive into the woods and just disappear for no reason, right after his son was tied up by a home invader? He wasn't in his camper, so where was he? Where did Greg get this second gun? If it's his gun, the police will be able to trace the gun back to him... Also, why did Greg's partner shoot Alec on sight? Was he also involved in the child abductions? You can't just shoot a guy on sight like that, but whatever.All in all this movie was entertaining at parts but there were just too many instances of sloppy writing for me to give this anything higher than a score of 'slightly above average.' Otherwise it's fairly well made, the acting is fine, and the music is actually quite disturbing."}, {"id": 202, "text": "At last an original thriller full of twists i did not see coming .A great ending and a riviting watch from start to finish .Very well directed and acted,great to see Helen Hunt back on top form.If you enjoy a mystery / thriller you will have a great ride.Nothing gratuitous ,no nudity ,just a very clever story.Watch this film."}, {"id": 203, "text": "When i watched the trailer i got excited because it sounded intriguing and i like helen hunt But...yeah there is a big sad but this movie tourned out to be weak and empty Basic story and the plot twist was meh And helen were like a guest"}, {"id": 204, "text": "For me I wated my time wathing this kind or drama movie it is not horror any way."}, {"id": 205, "text": "The most frightening part of I See You was the notion that people would not walk out during the middle section of the movie. It short-circuited pretty much everything that came before it. How they s could have highly rated better anyone eludes me."}, {"id": 206, "text": "I wanted to like it. I've always liked Helen Hunt and Jon Tenney. Seemed interesting by the description. I turned it off after about 30 minutes. I really couldn't get past the fact that Helen's face had either had too much plastic surgery, or they used CGI to smooth out every conture of her face. I read later what the movie is about. It's not what you think. I appreciate movies with twists and turns but this was a dud."}, {"id": 207, "text": "Well done on twists and turns. Finally a decent movie in a looooong time. I see you is a must see... Wakka wakka wakka lol Restored my faith in movies again."}, {"id": 208, "text": "And then turned to trash. I enjoy psycho-thriller but this only set-up to be that and went a different direction. Killer who purposely murders one person and thinks he murdered a second has a conscious about another killer having kidnapped some kids after he drugs the other killer's son for no reason except that he's a freakin' pyschopath. It makes no sense."}, {"id": 209, "text": "You will NOT like this movie! The trailer suggested this movie was a supernatural horror movie. It IS not! Murder mystery maybe, but the mystery is who is abducting and killing young, preteen boys? YUCK!"}, {"id": 210, "text": "Im honestly baffled they even cast her because it really is bothersome. Im not being picky or shallow. I always liked the actress and appreciated her work ever since Mad about You, but this... If there is any emotion on her face you definitely cannot tell, its just a bizzare stretched smooth and alien looking shapeless surface with no upper lip. Other than that, I did not find the movie very interesting. The twist was kind of silly/forced and seems extremely impractical and unlikely. Its not one of those man, that was a good mindbender twist where the twist all of a sudden changes your perspective. It just felt like a bit of a let down and the whole movie is more or less a cycle of Helen Hunt's constant sobbing, the kid being angsty and father angry. The horror theme often takes second place. Also at times the music was too obtrusive and brought you out of focus. It just didnt vibe with what was happening on screen which is extremely rarely I notice that. It was too tryhard spooky and took over scenes instead of complimenting them, distracting you from whats happening. All in all, the kind of movie you say meh.... at the end and forget about it."}, {"id": 211, "text": "Thrilling puzzle movie, with excellent cinematography and sound"}, {"id": 212, "text": "I wa very disappointed. I had it figured out in the first 15 minutes. OF course watched to the end in hopes I was wrong. No, I was right. It would be ok for people who have difficulty figuring out the end would keep them in suspense, but if you are like me and can quickly figure out who and why, this movie is not fo you."}, {"id": 213, "text": "Well....I wasn't expecting that! Very good film that keeps you guessing all the way. Music is very strange..in a good way.. in the first part of movie. All in all best film I've seen for a couple of years...give it a go..It won't disappoint."}, {"id": 214, "text": "This movie tried to be different and it did add a couple of good plot twists but they failed on the delivery. The whole phrogging story should've been there from the beginning of the movie instead of adding that element halfway through and basically going through the whole movie again. The ending was actually decent with the plot twist but other than that the movie was horrible."}, {"id": 215, "text": "This film would've been better as a supernatural thriller than the mess it devolves into. Halfway through the film it just completely shifts perspectives that disengages the viewer. Also, after the perspective change it becomes very predictable as to who the bad guy is. It's so obvious it can only be one person. I just wish the why was explained a bit more. Not a terrible film but still barely passable. One final note: Helen Hunt has obviously had some surgery and her face was actually very distracting. She actually reminded of rocky from the 1985 film Mask. Yikes."}, {"id": 216, "text": "Best movie I've seen in a long time. Very well put together, great soundtrack and fits perfect with the amazing twists and turns. It is on the same level as Usual Suspects, The Sixth Sense, and much better than the recent Get Out. I can't wait to watch this movie again to see if I missed any little secrets or details and pay attention with a more observant eye. A must watch."}, {"id": 217, "text": "If i wanted to see NCIS i will see something with the right tag, not click on 'horror movie' and end up here.Very good and smart, was going for an 8 but i didnt like the happy ending. Too happy isnt good."}, {"id": 218, "text": "I can't get over Helen Hunt, what has she done to herself. She looked like Snoke. I wish people would just grow old gracefully, instead of ruining how they look.The movie itself was forgettable."}, {"id": 219, "text": "A few things didn't all the way add up to me but it was still a clever movie. It was cool how they showed what happened then what happened from a different perspective. We were on edge the whole movie so it accomplished that at the very least."}, {"id": 220, "text": "Helen Hunt has not aged well. It barely looks like her. She also is not so good a dramatic actress. Not good at all.The soundtrack of this film really brings the movie down. The excruciatingly slow directing is hard to deal with.It's not a particularly good pic."}, {"id": 221, "text": "I like the execution... how they patch the story from the start to the end. at first i thought it was sort of alien things lol, you need to see how it ends."}, {"id": 222, "text": "That's right folks, it's movie night with my wife and I, perusing through the new movies to rent on the Play station network when we came across this little jewel of a movie! Congrats to Adam Randall for a magnificent job directing this movie! Frankly, never heard of it. Never saw a trailer for it at the movies, not a mention of it on IMDB. Really guys? I'm on your site quite regularly. Anyway...don't even try to guess at this multi-layered movie. I mean, you can try, but at one point in the movie, you're going to see the WTF moment. trust me, you'll know when you see it. It's at that point in the movie that your mind will be blown! I mean head exploding, re-seeing the movie from a whole new point of view. Incredible movie, folks. I demand you get in front of your TV, computer or whatever. This is a MUST SEE! Peace."}, {"id": 223, "text": "The necessity of telling a story backwards is confusing and unwarranted, especially with this film; it adds nothing to the drama. If the timeline of the story had been told appropriately, this thriller may have made the grade."}, {"id": 224, "text": "Personally I think this should have made it into the theaters over many others"}, {"id": 225, "text": "Finally, a truly satisfying psychological thriller after seeing so many duds lately! Excellent. Highly recommend."}, {"id": 226, "text": "I had to stop watching after about 20 minutes because of Helen Hunt's creepy face. How can she think that plastic surgery looks good. It's rendered her completely incapable of acting."}, {"id": 227, "text": "Nothing like keeping your audience engaged by playing the same movie twice. Absolutely painful going each stupid little prank step by step from a second perspective. We get it. Phroggers.The plot twist was absurd and unbelievable as well. We have no reason to believe the young phrog man, Alec, would need to take revenge into his own hands. Why weren't the kids able to ID the small town cop, Greg, who tried unsuccessfully to kidnap them? What was the deal with their mysterious sounding interviews? Sure, Greg could have planted evidence on a third party but it completely ignores the fact that there were two key witnesses who could have easily identified him. None of this was explained.Only solid aspect in this dumpster fire of a film was the camera work."}, {"id": 228, "text": "Helen Hunt's face is the real horror here 😱 Actually the film is okay, nothing special."}, {"id": 229, "text": "I found this movie hard to get into at the start. It was dragging on and it felt like there was to many stories being told at the same time. The second half of the movie was OK with twists but I wouldn't say it was extremely good. OK movie if nothing else"}, {"id": 230, "text": "I thought it was a decent thriller but too many things happen that defy logic. In the end, many questions remain unanswered. The so-called twist is revealed halfway into the story and after that nothing becomes really exciting."}, {"id": 231, "text": "What an amazing movie. From beginning right till the end. Slowly everything unravels, plots and twists. OMG!!! I don't know what's wrong with all the people who didn't like it, I suspect they weren't intelligent enough to understand the movie or just wanna be critics who think they know and can do better. This movie is a must see. Keeps you guessing till the end. The story was epic as was the acting. Enough said!!! Do yourself a favour and watch it. THAT IS ALL."}, {"id": 232, "text": "A movie should not leave you with that many questions after watching it. The script was unrealistic that didnt question occurrences when everyone would, the dramatic music was unnecessary in non dramatic scenes and yes Helen's face was/is distracting. Could've done more than what was delivered"}, {"id": 233, "text": "Pretty average film throughout. I do like how it was structured telling one story then the next with a culmination conclusion. Is what it is. An average movie."}, {"id": 234, "text": "The first hour of the movie was so ridiculous, I'd rather watch paint dry. The last 30 minutes saved it. Never hitting the watch again option on Prime but it definitely kept me guessing."}, {"id": 235, "text": "The movie itself I enjoyed but its hard to watch helen hunt now. that's all."}, {"id": 236, "text": "This film was surprising good... very good, in fact. I started to watch the film without knowing anything about it. I thought it was this genre, that genre, but wrong each time! The acting of all involved was excellent and the plot was super duper!Thoroughly recommend this film and unusually surprising is the fact that there were no 'naughty bits', there were some expletives and what 'scenes' that did occur were acceptable for all types of audiences (IMO).There was twist followed by twist followed by an OMG, no way! and from beginning to end, it was edge-of-the-seat watching (for me and the family, I might add).More films like this are needed. I gave this a 9 by the way."}, {"id": 237, "text": "This is a really good movie! The acting is well done and it has a real twist that keeps you guessing throughout the movie. For those who love suspense movies this is a must watch! Only complaint would be I hoped for a little more closure at the end. End was closed but just felt I needed more! Otherwise, great movie!"}, {"id": 238, "text": "Creative direction by Adam Randall, a creepy and atmospheric soundtrack by William Arcane, and Devon Graye's twisty script combine to re-energize what is quickly becoming a worn out didn't-see-that-coming genre. It would be hard to beat the first half of the movie in overall creepiness, but, as the tone shifts in the second half, you adjust and enjoy the ride. I love this kind of thing when it's done well so I thoroughly enjoyed this film."}, {"id": 239, "text": "Great cinematography choices and the writing is bonkers. The only thing I didn't like was the bike scene. Over the top and unrealistic to the point of Stranger Things but not as good because we already know what happened and it feels like the movie is trying to cover it up from the beginning."}, {"id": 240, "text": "Don't know why this was rated so low. This is a really good thriller. Takes a while to build up but honestly worth the watch. You won't be disappointed."}, {"id": 241, "text": "I actually really liked this movie! I feel like so many horror movies coming out now are so predictable and I really appreciated the uniqueness of this film. I also think that the supernatural hauntings are getting overdone so it's nice to see something fresh on the screen. Would have liked a little more detail on motives and etc. but overall a great horror!"}, {"id": 242, "text": "Great movie, it's more of a thriller than a horror, but altogether it was excellent."}, {"id": 243, "text": "A pretty good thriller with interesting twists. Acting was good and I was pleasantly surprised with how much I enjoyed it."}, {"id": 244, "text": "I actually enjoy this movie I did not expect it to go the way it did. It was really unpredictable and I love that. must watch"}, {"id": 245, "text": "It rarely reaches the tension and the suspense it needs but it's still an interesting, entertaining little film that managed to be quite original despite the saturated genre."}, {"id": 246, "text": "I went to bed thinking woah, and still figuring out the plot. This was extremely well written, and the reviews were right! Impossible to predict! Couldn't agree more. The soundtrack was incredibly creepy, with unsettling wind instruments that sound utterly wrong and eerie. This went so well with Theo's of this movie, and the acting that was really well done! Great movie and I went and recommended it to all my friends straight after watching!"}, {"id": 247, "text": "I am unsure why this film received just a 6.8 rating. It is an excellent thriller, fast paced and tightly directed. The storylines and their treatment were exemplary and most of the cast stellar with the exception being Hunt. She was just awful; wooden, slurring words and honestly appeared as though she couldn't be bothered. Despite her performance, this film is fantastic and definitely worth a watch, and deserves a far better overall rating. The fact that Hunt's performance couldn't detract from this film speaks of it's quality."}, {"id": 248, "text": "Slow start, but a great twist-on-twist-on-twist finale buildup. Quite the generic horror to start, but delivers a great second and third act whilst turning into an amazing thriller."}, {"id": 249, "text": "Amazing writing with a great and powerful plot twist, you can't see coming. You'll question all the characters and their sanity. The acting was great, the camera and sound group did amazing. I'm a bit disappointed with the ending not bringing up more details, but this is a gem of a thriller movie!"}, {"id": 250, "text": "Nice twist, you're will never no what is happening till the end.At the last moment your imagination gets cleared."}, {"id": 251, "text": "Amazing. So many plot twists. It keeps you at the edge of your seat. Definitely worth a watch. The only reason I'm not rating it 10 stars is because Helen Hunt (as much as I love her) looks old enough to be Conor's grandmother and not young enough to be his mom. Also, did Mindy survive the gunshot? They found the boys, but how? She lost service when she called the police and then was driven back to the home. Did they track her cellphone and place her at both locations? That part left me feeling confused.Edit: I wanted to add a bit more now that I'm watching it for the second time. I caught something I didn't catch the first time I watched it. Alec is a teen, but he was interviewed 15 years ago by Spitz when he was at least 9, which would make him at least 24 - not a teen. Major plot hole. Anyway, still a really good movie. Just wish they would've been less careless about the timeline."}, {"id": 252, "text": "At first the movie seems a bit dull, maybe too slow or boring, but when the story unfold itself it starts making sense. The ending and explanation is really good. You won't be left with questions about how and what actually happened. Everything is clear at the end. It is creative and surprising. Definitely worth watching."}, {"id": 253, "text": "If you like Alfred Hitchcock you will love this movie. One of the best movies I have ever seen. Full of unpredictable twists."}, {"id": 254, "text": "What a fantastic movie. Huge Helen Hunt fan, she felt a bit one dimensional in this film. The overall writing, cast, and scenery was great. Plenty of jump scares, and a plot that holds up really well."}, {"id": 255, "text": "They don't make them like this anymore. If you like a good thriller (not horror) with multiple twists that would keep you on edge, look no further"}, {"id": 256, "text": "Good film with a lot of mystery and a twist in the end."}, {"id": 257, "text": "Totally not how I thought this movie would play out...give it a chance and it's quite a decent,clever film!"}, {"id": 258, "text": "A weird slow beginning, that feels completely disjointed. Choppy dialogue, emotionless acting from Helen Hunt, just odd. But stick with it. Very well done and a very rewarding payoff. Worth it"}, {"id": 259, "text": "Not an actual horror movie but the twists are built well in the story n keeps you hooked. The twists dont seem thrusted."}, {"id": 260, "text": "Didn't think I would like the movie as much as I did."}, {"id": 261, "text": "Cant say much more than the other well put reviews apart from its an absolute well worth must see. Its incredible mysterious guess work dark refreshing storyline , great acting from the son ( the naughty one. Actor never seen before hope to see again). As a mass. Horror/thriller fan it took me by suprise and exceeded my harsh expextations. Brilliant directing. Take my word for it get settled cosy for the night or (whenever) as did i and you wont be dissapointed."}, {"id": 262, "text": "What a brilliant film lots of unexpected twists and turns throughout, great acting"}, {"id": 263, "text": "I watched this with my friends on Halloween... and we all enjoyed it a lot. The first half of the movie is like a puzzle where you're trying to piece everything together. And then the second half completely changes and all your predictions about the film are thrown out the window. Really enjoyable and not too long. If you want a good quick thriller movie, this is a great option! Kind of reminded me of the outsider and gone baby gone!"}, {"id": 264, "text": "Loved this mystery/suspense film starring Helen Hunt. Great script, direction, music, production values, photography, and fabulous script. I was glued to the screen the whole time. Just happened on this movie because Amazon Prime recommended it as a movie I might like -- probably because I tend to like smart mystery series.This is one of the best movies I've seen this year and I recommend that you try it -- I think you'll like it despite the fact that it hasn't received the publicity and promotion that it deserved."}, {"id": 265, "text": "Clever ,suspenseful, artistic,unusual,captivating,creepy. All the qualities I love and respect in a good psychological thriller! Not the very best,but very good indeed."}, {"id": 266, "text": "This film is a good suspense film with a really good twist highly recommended"}, {"id": 267, "text": "A lot of fun. Satisfying ending for a thriller/ horror. Don't spoil it and read too many of these reviews.. Just gotta watch it amd see for yourself."}, {"id": 268, "text": "I admit, i was sceptical. but the trailer peeked my curiosity when it said: impossible to predict. so i gave it a shot. to my surprise it was okay. it was good."}, {"id": 269, "text": "This movie has some really great and unpredictable plot twists. The acting is top notch. The suspense is great. The story is totally plausible. All this makes for a great movie. The one thing I don't get is why the preview almost bills this as a supernatural movie.....it's not at all that!"}, {"id": 270, "text": "Great suspenseful movie. I love a good thriller. Soundtrack was amazing and acting was great. Had me guessing the whole time!"}, {"id": 271, "text": "I love horror movies, so I decided to give it a try. I love how it is a mystery to, so you don't know what is going to happen next. And there are a few jump scares. Then if you are confused, it kind of explains everything at the end. So overall, it is one of my favorite movies!"}, {"id": 272, "text": "Anything more would spoil this gem. I wish so much that I could forget it and re-watch it again to re-live the weird, amazing, and surprising experience this movie was."}, {"id": 273, "text": "...this is a must watch imo and it will most likely surprise u in al the right places.If u are a horror addict (and I most def am... seen almost 1500 if u can believe it xD), u might be able to put a lot together very soon and this movie will not be very exciting. I could, but it still was a nice ride and I liked the ending they went for, THAT was sth. I didnt excpect becuz most horror goes forspoiler alerta bad one."}, {"id": 274, "text": "Ok so the preview looked really good wasn't sure what to expect genre wise...beginning was really good weird stuff happening had me super interested..second act I'm like wtf is going on THATS what's causing all this crap? Super disappointed and annoyed BUT I stuck it out and I'm really glad I did because ended was good, nice twist and everything came together..just watch it till the end."}, {"id": 275, "text": "If you're a suspense/thriller fan you'll love this film. You think it's going one way and it twists and turns. Unexpectedly good."}, {"id": 276, "text": "Can only say. My tourettes have never been trick this way. The Hunts have picked a perfect screenwriter and the plot is epic."}, {"id": 277, "text": "We've just watched this and I thought it was really creepy! There were some good twists I didn't see coming and it was a very twisted film. My only criticism would be why Helen Hunt has had so much surgery! She looks a good 20 years older than she is because of it and it's so distracting watching her!"}, {"id": 278, "text": "The movie was engaging. Suspenseful, interesting twists, enough of the unknown to keep watcher interested. But...Helen Hunt's face is enough to make the watcher nauseous. Botox top half and meted lower half. Like a plastic surgery trial gone wrong. I hope Helen made the appointment to match both halves after shooting. It is disturbing enough to distract from full enjoyment."}, {"id": 279, "text": "This had plenty of twists and a different format but I'm sorry to say I found Helen Hunt's face totally distracting. She looks twenty years older than her age and they'd clearly used tech to de-age her in some scenes, making her look like Odo from Deep Space Nine. I'm all for growing old gracefully but she was totally and woefully miscast. Are we really expected to believe sexy Sam from True Blood was having an affair with her? Very odd. I can only assume she funded the film on the insistence she play a lead role. Other than that it was good."}, {"id": 280, "text": "Very rare to find a movie that is as clever as this one. All the twists were woven in expertly! Actors were sublime and the story worked perfectly!"}, {"id": 281, "text": "Great film not what I expected at all and it's one I recommend. However can someone tell Netflix to pull the trailer which gives some of the twist away. The Helen hunt trailer is excellent and really does set you up for a very nice twist."}, {"id": 282, "text": "I've seen this film a couple of times. A very clever thriller. You'll ask questions about why that happened, this happened and you might guess certain things which take place. However, it all comes together, but you need to watch it a couple of times, to see the clever way the story is intertwined and how you were given clues, but didn't realise they significant the first time. It twists your head as to who the real hero is."}, {"id": 283, "text": "Very good thriller from start to finish. And not just because of Helen Hunt's botched face lift! Unexpected plot twist and I found myself almost rooting for the villain. Almost... :-)"}, {"id": 284, "text": "This movie is full of twists and turns, it is very cleverly written, acted and directed. As a viewer you have no idea what is happening or what is going to happen. It mixes the concepts of several different types of horror/thriller movies.The characters aren't particularly likeable or memorable but the ending is! The last part of the film comes together and has a very satisfying ending."}, {"id": 285, "text": "I just want to say.....i can't understand how people love and praise the first and second IT. About this movie just one word in my opinion; EXCELENT"}, {"id": 286, "text": "I watched this movie on Amazon Prime. I have been interested in Psychological Thrillers lately and this one showed up second on my search screen. I kept passing it up not thinking it would be good. Not a big fan of Helen Hunt so star power hadn't drawn me either. While the second half of the movie dragged a little bit I really enjoyed it and was fairly surprised at the ending."}, {"id": 287, "text": "Slow to begin with but it developed well and is worth watching.... Helen Hunts plastic sx needs a redo as she looked like she has schlormaderma... which I hope she hasn't.....I read it was a botched plastic sx work...."}, {"id": 288, "text": "What a great movie! Had me from beginning to end, kept me guessing the whole time. Great acting all around, not overdone. Wow, I haven't said this about a movie in a long time!"}, {"id": 289, "text": "Just watch it try not find spoilers or look into the plot or watch trailers. Watching without knowing anything will make this film twice as good. If you know some things about it, it still is a top film."}, {"id": 290, "text": "This film is definitely not what you'd expect from 2019 thriller it's totally opposite - it shine amongst other thriller dramas of the year. Very well it flows from something what could feel like mystical thriller to very intence criminal drama. Well worth watching, + Great soundtrack"}, {"id": 291, "text": "For all its flaws this is a really good thriller. Yes you will be scratching your head at the end wondering why certain pieces of the story didn't make sense but you'll enjoy the ride as it won't detract from the entertainment. I see you is a Stephen King type thriller which keeps you watching, it grips and twists to the end. Great soundtrack too. Watch and enjoy....."}, {"id": 292, "text": "The film takes a while to get going, but kinda worth it in the end. Good use of music and direction. You could do a lot worse than watch this, better than most Netflix movies."}, {"id": 293, "text": "But clever when it does and well worth watching. Slow start and the music is a bit over the top to begin with but good plot."}, {"id": 294, "text": "Great... up until about 3/4 of the way through the movie, when everything got ridiculously stupid for a moment. But then, it got back on track and I almost forgot about the aforementioned faux pas. However, due to that regrettably lazy writing instance, this movie's potential for greatness was unfortunately cut down prematurely."}, {"id": 295, "text": "It turns from one type of scary movie into another. Well acted and with several plot twists. The music is appropriate too.Not a lot more I can say without revealing too much. I'm glad I did not read the reviews here - far too many people have revealed parts of the plot without the spoiler warning, thus wrecking it if you haven't seen the film."}, {"id": 296, "text": "I was thinking this will be just another scary movie, with a few jumps, and I'd come away thinking, that was okay to watch at home on the sofa. I was really surprised though. Not what I was expecting at all. I won't say anything about the plot, because I think it's best to watch this film knowing as little as possible about it."}, {"id": 297, "text": "This movie is a bit slow to get started but there's a good twist, something quite different. Definitely worth watching."}, {"id": 298, "text": "I was bored when I put this on rolled my eyes and then 15 minutes later I was hooked!Without giving to much away this is not what you'll expect and amazing thriller that makes you put your phone down!"}, {"id": 299, "text": "Amidst the background of a hunt for missing boys, a detective and his family are plagued by strange events at their house.Beautifully and imaginatively photographed, it is difficult to determine until the end of the film quite whether this is a thriller or a horror film. It certainly features elements of both, but continues to twist, turn and generally sidestep the audience. It got to a stage where I was content that I'd 'got it' and 20 minutes later I realised I hadn't - in fact the twists keep coming until practically the final frame. I think perhaps some of the performances needed a bit more work to bring out the mystery further, but this is a small quibble in what was a very pleasant surprise - worth catching."}, {"id": 300, "text": "I will split this movie into two parts.Part one the beginning very boring and slow didnt know what was going on tbh.Part two (middle/end) just blown away by the story part one now makes sense.I recommend this movie as it's like nothing I've seen before stick with it even though you might be tempted to turn the film off you wont be disappointed.Wife and I both scored this a seven."}, {"id": 301, "text": "Very nice achievement by Adam Randall, an excellent movie with a particularly well put together script with a thrilling plot, taking attention to the end. In short, - I See You - is a good movie that will surprise more. Extra of its kind."}, {"id": 302, "text": "I See You: A film of mixed tropes - child abduction, domestic disharmony and intruders living secretly in a house. A detective (Jon Tenney) is investigating the disappearance of a boy which may be linked to old cases. His wife (Helen Hunt) is having an affair and her paramour becomes involved in strange events which occur in the house. Throw in a surly son (Judah Lewis) and you have a natural suspect for the oddities. But this movie is even stranger as twist after twist occurs and we see the same events unfold from several different perspectives. Nothing is quite as it seems. Some shocking and violent scenes but the tension is mostly maintained through the use of psychological horror. Maybe the film has one plot turn too many for it's own good but I See You is well worth watching. Directed by Adam Randall from a screenplay by Devon Graye. On Netflix. 7/10."}, {"id": 303, "text": "Players all did well but dear God what has happened to Helen Hunts face?She reminds me of Odo from Deep Space 9!!!I feel for her because it now looks so unnatural after her obvious plastic surgery"}, {"id": 304, "text": "This movies shining star is it's soundtrack and how it was used throughout the concept and story etc was good with a few twists but that soundtrack was so good added a whole new dimension on top of the many already added. Watch it it's worth your time."}, {"id": 305, "text": "Really enjoyed this movie. Keeps you guessing with some major twists and turns , definitely recommend this thriller to everyone. Very well done."}, {"id": 306, "text": "Went into this film with no exceptions, left with a real sense of enjoyment, the first part of the film is a little slow, but stick with it, the viewer reaps the reward paying attention to detail to the events in order, and it comes together perfectly with some big shocks along the way, the second half of the film I was like wow they've really thought this out to a tea something with thrillers as of the past few years is a rarity. It gets more tense as the film draws on with twists that will shock you as it did me, a very well written thriller that's definitely worth the watch."}, {"id": 307, "text": "This is the best (most underrated) movie I have seen for quite a while, it leads you up the garden path and has a number of genuine WTF? moments that you can't possibly see coming, but they are amazing and totally believable. Kudos to the writers, they've come up with a unique and gripping story that will put you on the edge of your seat. Clear your head and watch this movie! NOW!!!!"}, {"id": 308, "text": "Honestly such a good movie, it doesn't make you wait all the way to the end for the drama and thrill to happen. You sit at the end of your seat the whole way through. Had such thought out twists. Highly recommend"}, {"id": 309, "text": "Not what was expected in terms of storyline - was expecting a creepy horror but pleasantly surprised to watch a genre change halfway through but oh boy not a whiff of effort went into even attempting any character development - would have been a much better film if some back story had been included. Ending also let it down and what on earth has happened to Helen Hunt - she used to be such a good actress !! This film is a good advert for not having plastic surgery - watch and see ...."}, {"id": 310, "text": "Well worth your time. Starts weird and you wonder if it is going to be another chaotic flop, but boy was I wrong. This movie delivers a good plot, some twists and all in all leaves you satisfied. Wish Netflix gives us more good movies like this. Well done 👍"}, {"id": 311, "text": "Its a difficult film to talk about, without spoiling anything. Its a bit slow to begin with, but i never found myself bored. Certainly took me in a direction i wasn't expecting, id certainly recommend this movie."}, {"id": 312, "text": "The movie shows different perspectives, which was the main thing going for it.However the storyline is somewhat absurd, and essentially generic at heart.Still the suspenseful music manages to keep you interest."}, {"id": 313, "text": "Thank God I could never afford a house that big.. Interesting film builds up really good"}, {"id": 314, "text": "Had no idea about this movie glad I just caught it on Prime. Great story with a surprising ending. It's almost like two movies in one. Worth a watch for sure!"}, {"id": 315, "text": "Definitely worth watching. Most movies now a days are predictable, however this movie contains twists that are not expected. Great acting with a great story."}, {"id": 316, "text": "Should have known Helen Hunt wouldn't just sign up to a typical haunted house thriller.Weird things are happening to the Harpers. Greg (Jon Tenney), a detective, is hunting the disappearance of a child, but as his investigation deepens, his house becomes increasingly unsafe.At the halfway point, when you're as confused as Jackie (Helen Hunt), the film flips. Inconsequential moments become enormous tells and the truth behind suspicious/threatening scenes is brought to light.An excellent police procedural with a spooky home invasion twist, I'd recommend I See You."}, {"id": 317, "text": "Revenge is revengeful in a revengefull way in this flick. its tension from start to finish. its good acting, good pacing, good story,knit together with a heartstinging kinda score,and the grumpy old man felt like running up that hill of houses x 10, and are still amazed by the aftershocks of what ive seen. its a good film, compact as well as good at portioning out the revealing of secrets.youll never know what hides around the next corner, and if you dare to check it out, well youll be stunned.recommended"}, {"id": 318, "text": "Wet well executed! Keeps you on your seat! Satisfying ending! I highly recommend!!"}, {"id": 319, "text": "I seldom write reviews. A movie has to be really bad, really good, or a lot better than expected. This was the latter. Not sure about how the timelines line up, but it's entertaining....and at the end of the day, that's all I care about."}, {"id": 320, "text": "Super creepy. It almost lost me at one point when it got a bit mundane but just continue watching it. Trust me. So good. Wow!!"}, {"id": 321, "text": "First off, I want to say that I am sick about all the people bashing Helen Hunt's appearance. I thought this was the age of anti-internet bullying. Just because someone has had work done, does not give any of us the license to be cruel about their appearance. If you know her personally, are in her line of work, or are a qualified doctor, contact her or her agent and have a conversation. Or, if you're someone who, if you were in her position, would enjoy having the same kinds of things said about you, criticize on.Now, about the movie. It started out like a paranormal thriller, and paranormal things make me giggle. I was giggling the first 20 minutes. Then everything switched, and it became a different genre all together, and I was into it. The ending of any story will make or break it. The ending of this story made it. After watching and thinking about it, all I can say it is a tight, clever story. Well worth the watch."}, {"id": 322, "text": "It's been a while since I've utterly misjudged a movie and wasted nearly 2 hours of my life in the process. This movie has 3 twists, the 1st of which is revealed less than 30min into the movie and thus should be part of the synopsis. What starts off as an intriguing mystery/suspense with great eerie music and buildup turns out to be about phroggers/squatters. One of them is crazy. If I'd known this I'd never have clicked play. Oh and the husband is the killer; expected about halfway through. The final twist, which any remotely intelligent person could see from a miiiile away, is that the crazy phrogger is one of the two boys from the beginning. Lame revenge plot! Yawn alert. After the first twist, the movie drags on like a snail on downers, playing scenes you've basically already seen but just from another perspective. Hard pass; unfortunately, I sat through it."}, {"id": 323, "text": "The story wins the 10 star rating from me. If only the cast was better it would have been a blockbuster!"}, {"id": 324, "text": "Amazing twists and excellent cast. Just when you think the film is over and you've got it figured out, it turns. Fun to watch and keeps you on the edge of your seat."}, {"id": 325, "text": "From flashy to messy: shares weirdly something with one of the best movies of 2019 - Parasite - but not consistency and quality. Survival horror camera work in the first half, too easy messy thrills in the second. Not too bad tho."}, {"id": 326, "text": "Wow! This had me squirming in my seat! Just saw it at CIFF today. (3/30). Twists and turns! A rollercoaster!"}, {"id": 327, "text": "This movie was one of the creepiest movies that I have seen. During the movie I kept thinking ''What the hell is going on''. The movie kept you on your toes. Thriller, little bit of action, drama, mystery, scary and creepy are words I would describe this movie as. The ending though. I did not expect that ending. It is not exactly a Oscar worthy movie, but if you are bored and have nothing to do, then this movie will entertain you. Also another thing. What is going on with Helen Hunts face? She looked very strange in this movie. I don¨t know what she has done to her face. Go and watch the movie and you will see what I mean. Anyhow worth a watch though!"}, {"id": 328, "text": "Touted as suspenseful film the story morphs into a basically unbelievable horror movie that even the likes of. Helen Hunt cannot salvage."}, {"id": 329, "text": "I really liked this movie and its in my top thriller's movie list for sure. It's a different type of movie that I enjoyed watching. I wasn't expecting a twist like this, it keeped me in suspense throughout the whole movie. And Helen Hunt definitely didn't need to do whatever she did to her face."}, {"id": 330, "text": "I've seen many reviews that state holes in the story line, but I genuinely liked this movie. The score sets the theme for this film which I would more less consider a thriller than horror. The first half of the movie lines up all the questions, who, what, and why and as is it transitions in to the second act it puts the pieces together. As a writers debut I was impressed, it left me trying to put the pieces together and figure out the characters. It pieces all together perfectly and entertained me throughout. Definitely recommend checking this out!"}, {"id": 331, "text": "Film is suspenseful and twists are jawdropping, can be a bit predictable but it's fine .. definitely not horror but Mystery/Thriller . Not boring in any way , don't expect it to be an oscar movie, but a good thriller . Helen hunt is onscreen for 15 mins probably and they used her name only to advertise the movie . She looks like a burn victim imo also hahaha ."}, {"id": 332, "text": "All I will say about this movie is it kept me and my wife engrossed throughout, no slow section to nod off to, just a good quality mystery through till the end. Enjoy"}, {"id": 333, "text": "Couldn't get into this movie. It started off alright. Helen Hunt really has a terrible face to look at with all her plastic surgery. Takes me out of the movie, which wasn't even that good at all.Skip3 stars"}, {"id": 334, "text": "This film starts off great , Intrigue levels are high, things that go bump in the night peak your interest. Then half way through it takes a turn, a sorry turn. This film had such promise and then becomes somewhat lazy in its direction it's almost like the writer got bored and couldn't wait for it to be over. A very unfulfilling experience filled with plot holes. Such a shame , it had potential but then it just fizzled out."}, {"id": 335, "text": "Not except this movie will be this great,full of with twist &amp; tuned,great acting,creeepy but Awesome music,story different not typical ghost ,Slasher movie dont listen r care about negative reviwer those type losers even tell diamond ,silver"}, {"id": 336, "text": "Acting good. Man! Helen Hunt has not aged well. Anyway it's definitely a psychological thriller. First had me thinking there was some supernatural forces at hand. Some people have stated they liked the music and the eerie feel it gave the movie, but for me it was total overkill and annoyed me. I did not quite understand the ending with the pez Dispenser in the little boys pocket?"}, {"id": 337, "text": "Enjoyable with a good story. As for me the story was a little bit on the short and felt a little but rushed."}, {"id": 338, "text": "Wasn't terribly interested in this movie but as it turns out it was well worth the time."}, {"id": 339, "text": "Helen Hunt is barely in the film. Movie is okay, nothing special; supposed twist was easy to figure out after process of elimination, but it is a satisfying closure."}, {"id": 340, "text": "I could not get through it. The music was so annoying and the direction so obvious it distracted from the story."}, {"id": 341, "text": "In this over-saturated horror cinema, new films should focus on creative stories and ideas and I See You exactly does that. From a certain point in a thus far rather typical horror/mystery film, the story takes a direction that you would never expect. This film is best seen with zero informations beforehand so make sure to read as little as you can before watching it.On the minus side, the acting is very bad by almost all of the cast. Helen Hunt's face and facial expressions look like those of robert De Niro in The Irishman and is a mojar flaw as one of the main characters."}, {"id": 342, "text": "Yess. This is great. Presented as a supernatural horror, just remember, there is nothing scarier than a person whose motives are indiscernible. The tension in this flick comes not only from the scariness with indiscernible intentions but also from the imperfect lives of the family in question. We're in a town that is experiencing missing children, and they're going missing exactly with the m.o. of a series of crimes from awhile ago and the perp is already convicted. On top of that is all kinds of truly strange within the lives and home of the family. It's engrossing, beautifully presented and acted."}, {"id": 343, "text": "Great suspense movie with good twists! I was expecting a predictable movie but this one had me guessing."}, {"id": 344, "text": "A little slow moving, but generally I don't mind that. Good acting.Not only is it not predictable, the writer/director go out of their way to specifically make you think even the most common twists were about to happen, but didn't. Something completely else did.I was almost annoyed kid movie how it seemed repedatove for a bit, but after the ending...it makes a lot of sense why they did it that way.Also the ending wraps up every story line in a nice bow.Great concept. Good movie, a little drawn out, so it gets a 7, but I'd give it a 7.5 if I could..."}, {"id": 345, "text": "Nice slow pacin without becoming boring.this is more mystery thriler dont expect horror.i think it was a good watch."}, {"id": 346, "text": "This film clearly has a budget. It is beautifully filmed and has excellent quality sound and lighting. The basic plot is a decent, no frills basic semi-horror/mystery. It is in the details that this film loses all credibility as well as all direction. There are so many logical error and unnatural mannerisms that it becomes a distraction. If you dislike seeing the dumbest choices possible in any given situation, avoid this film at any cost. The acting and dialogue is so embarrasingly forced it makes the film unwatchable. I want my 97 minutes back."}, {"id": 347, "text": "Enjoy when.....Strange occurrences plague a small town detective and his family as he investigates the disappearance of a young boy....................Absolute Unpredictable Thriller......................."}, {"id": 348, "text": "Must watch for thriller suspense lover,,,,,good job by director"}, {"id": 349, "text": "Pretty enjoyable mystery flick. Didn't really expect much from this film. It actually turned out to be pretty solid. One thing I didn't understand is how the kid fly's off the bike in the opening scene? They trick you into thinking some supernatural force is behind the kidnapping. Turns out that's not the case. Still thought the movie was pretty good either way. Couple cool surprises here and there. Give it a shot."}, {"id": 350, "text": "The scariest part of this film was Helen Hunt's immobilised face. It was a waste of my time and money. The acting was bad and I thought it was going to be a thriller however more like a slash film in parts. It was a real mix up. The sound track was so bad, I guess in an attempt to create suspense. All it did was irritate me and I found I was turning the volume right down to stop the monotone sound. So many other great films out there, I watched it because it rated quite well on IMDB, how wrong was that."}, {"id": 351, "text": "Started off promising with some creepy direction. Then the whole story went haywire because of over the top screenplay. Silly last scenes."}, {"id": 352, "text": "What makes a movie good or bad? The discussion is open. I wasn't expecting too much of this one, since a sligh tone of amateurism goes through it from start to finish. But who cares. You cannot turn it off, there's something about it that grabs you. 80 minutes that feel like 20. Give it a try"}, {"id": 353, "text": "I found this movie to be all over the place. First I thought, is their child the killer of the missing children? Or is it a movie about a poltergeist? Is it about intruders? It's packed with so much that it takes away from one idea, and making it great. Helen hunt isn't the greatest actress at the best of times, but when I watched this, I wondered if she agreed to make the movie because she needed the money to pay bills. The acting was on par with a c list made for tv movie. The teen son's acting was a little better, which stopped me from giving this movie a 2 star rating. I'm normally not one to judge a person's appearance, but I'm afraid that I also found Helen Hunt's new face extremely distracting. It has been filled and pulled so tight that she can't seem to make any facial expressions, and can barely open her mouth. I only ended up watching 3/4 of the movie. That was enough for me. There's much better movies on Netflix, so don't waste your time with this mess."}, {"id": 354, "text": "Good movie but with one big flaw. Why did he take home the girl to kill her after she nearly was strangled in the woods. He could have dumped her there like he did with his wife's lover. Its the small things who destroys most. The plot is amazing. You can't predict what happens next. Just perfect movie. The Father, He hide those kids in the woods. There are progress in the house. one of the progress was a victim when he was a kid. He took revenge. Completely loved it genius film making. Movies like this. Totally unexpected. I find it funny how the kid hated his mom for cheating but his dad was a psychotic killer and kidnapper!! if you questioning How did the cops find out about the RV? They traced the GPS location from when the girl called 911."}, {"id": 355, "text": "Dont get me wrong. It starts out with a bit of mystery but as the 2nd act begins it is very obvious what the outcome will be. Many clues.6.1"}, {"id": 356, "text": "At first at thought it was one of those haunted house movies, but i'm glad it wasn't. Instead, it was creepy and kept you in suspence the whole time, exactly what I like in a good thriller movie."}, {"id": 357, "text": "For the first half hour or so of this movie, I was not enjoying it at all. It was kinda boring and derivative (just a basic murder mystery/home invasion horror plot) and I was really close to just shutting it off. However, after that first 30 minutes or so, something happens that completely changes the whole movie that I don't dare spoil. It made me so glad that I stuck with it. I still feel like I've seen stuff like it before, there are elements of Don't Breathe, Summer of 84, The Perfection and even The Simpsons, but I still enjoyed it in the end. That's all I can say without spoiling anything. Check it out if you're a horror fan."}, {"id": 358, "text": "I See You was a moderately suspenseful, but deeply flawed film. The combination of the realistic portrayal of (a) a dysfunctional family, (b) a standard crime drama, and (c) a bizarre home invasion narrative, did not add up to a cohesive whole.The most interesting of the three strands of the film was the domestic situation with a family that is disintegrating due to an affair on the part of the wife, Jackie Harper. Her husband Jack is sleeping on the coach, and the son Connor is hardly on speaking terms with his mother. The problem with this strand is that the adultery question and the character of Jackie drops out of the final third of the film.The disappearance of young Justin Whitter, which begins the film never develops within the film. The filmmakers return to it only at the end with an all-too-brief wrap-up. The film's most stunning revelation was the clever way in which the perpetrator was revealed. But the portrayal of the cops and the investigation was routine and uneventful.The most disappointing part of the film was the invasion of the Phroggers, the amateur home invaders, Mindy and Alec. The long midsection of the film was tedious and never-ending because it repeated a lengthy section of the film from the perspective of the Phroggers.The cat-and-mouse game of Mindy and Alec paid some dividends in the home stretch of the film. But it wasn't enough to allow the film to rise above an average thriller/horror flic."}, {"id": 359, "text": "I See You, categorized in the Crime/Drama/Horror genre, I would add the Mystery genre to that as the strength of this movie is definitely the surprise factor, the very clever twists and turns make this thriller more than enjoyable to watch. It's one of those movies you think you will figure it out to be completely surprised by the end. Very good job from writer Devon Graye. As for the directing Adam Randall maybe should have used creepier sound effects to make it even better but overall it's a good job. The cast was good as well, Helen Hunt can still act but what a transformation after all those years of absence, she didn't age very well but that doesn't effect her acting skills so it doesn't really matter. I See You is a pleasant surprise for this genre, better than expected. I would just ignore the negative reviews, they clearly don't have a clue when it's about a movie with suspense and clever story development. Definitely a movie I could watch again in the future."}, {"id": 360, "text": "This was well done, well acted. It's a slow draw but worth it. Beautiful shots, good characters. Best if all, plot twists. Fully enjoyed it!!"}, {"id": 361, "text": "A brilliant, very tightly plotted thriller. Great soundtrack too."}, {"id": 362, "text": "Loved it, lots of unexpected twists, bit of a ow burn to start"}, {"id": 363, "text": "Brilliant film that I wasn't expecting. And a totally different experience the second time around."}, {"id": 364, "text": "Perfect choice Helen hunt she is so scarry. Too much botox 😱. Good movie"}, {"id": 365, "text": "You must have been watching a different movie from me because the music was as creepy as you can get. Really good movie, well put together and the acting was good. I think Helen Hunt must have had a pull back though, as she didn't look too great."}, {"id": 366, "text": "Not good. The second half repeats the first half you feel like your watching a boring film twice. The detective dad is a terrible character, very interesting. The teenagers look like dopey stoners. Helen hunt? What happened? This film thinks it's something clever it's not it's just irritating and not interesting."}, {"id": 367, "text": "First of all, whoever is responsible for the music used in this film did a great job. It is very creepy and intense, adding to the generally uneasy feel of the events that take place.I was genuinely scared a few times. Even when, after a while, a major plot reveal changes the whole perspective of what you've seen, the tension is still racked up.It was good to see something different in a scary thriller and this certainly delivered for me.Only thing I found upsetting was the way Helen Hunt now looks almost unrecognisable due to whatever work she's had done."}, {"id": 368, "text": "I rented this movie on Amazon Prime, thinking this was going to be something supernatural. It isn't. It's a cracking good thriller with all my preconceived expectations of plot and characters all turned on their head. Good film - recommended!"}, {"id": 369, "text": "Pretty good plot twists! That's a amazing movie, good surprise for 2019/2020."}, {"id": 370, "text": "With a satisfying ending. Well written and well acted. Recommended."}, {"id": 371, "text": "I really don't understand the extremely high ratings here. I enjoyed the movie and the first part was original, but there are so many things that annoyed me. First of all there's the music. It's so overwhelming when it's not necessary at all. But there are also some very weird decisions of the protagonists. I mean... if you're a girl and (you think) you are being kidnapped, you run away as far as you can as soon as you get the chance. But this girl calls the police, gets scared, doesn't finish the call, but then suddenly decides to take a peek at a caravan where something strange seems to be going on. I only gave this an 8 because so many people gave this a 1, a 2 or a 3. That's just not fair."}, {"id": 372, "text": "I See You was a suspenseful and enjoyable watch. Helen Hunt's appearance jarred me at first, but she did a good job keeping the movie together. Other actors/characters were not as good/well developed, but still above typical thriller movie standards of barely two dimensional characters and wooden acting."}, {"id": 373, "text": "Dissatisfied with movies in recent times, it was a good distraction a Reset button with this one. Lots of twists to keep you guessing in the later stages of the movie. Great soundtrack which at the beginning you would assume you were going to be watching a horror movie. Spoiler: a male is the bad guy in this one also, even though the woman is the unfaithful family destroyer, somehow someway she ends up the victim...... anyway, good movie. Watch it!"}, {"id": 374, "text": "A slow burn horror/ Thriller .. Great acting unique plot Helen Hunt hasn't aged well tho very distracting"}, {"id": 375, "text": "What an unexpected surprise! I thought this was damn good"}, {"id": 376, "text": "When think about the mysterious part of supernatural, it's just too powerful those spirits can do. It links me up to many ghost stories ever watched. When things turn to be interesting, you found the real fact for the happenings in behind. It's start from non sense to logical mostly all in a sudden. 2 hours are well spent."}, {"id": 377, "text": "Psychological thrillers are my weak spot so when a friend advises I see one, I jump at the opportunity. I See You had me especially excited after the first 10 minutes because of the work and detail put into the cinematography that made what would have been a mundane character/situation intro much more watchable. The reason it didn't take off for me is that it never really had that shock factor that I expect from the genre. Sure there were plot twists that I didn't see coming, but I just didn't care about them."}, {"id": 378, "text": "The first half is mediocre, and stereotyped thinking will make you mistakenly think that this is a haunted movie of general quality, but, don't rush to close the screen, the middle part of the DV is about to rewrite the tone of the whole film: The dual-view narrative makes all the dull details before interesting. It seems to be careless. In fact, there are burdens everywhere. Some people say that the second half is too long and verbose. In fact, it is not. The fun of the details corresponds to the appreciation of the kings."}, {"id": 379, "text": "How have I not heard of this? This is my favourite thriller/mystery since Zodiac... I did not see the twist coming... Best part was the twists are over 40 mins long... Beautifully shot, great directing and a real little gem... Please spread the word, this film should not just go by without major notice"}, {"id": 380, "text": "Can Someone please explain to me why movies like black Christmas, the grudge, underwater and fantasy island are hitting the big screen, getting the trailer promotion and profit they really don't deserve but movies like 'I see you' are hidden in the mess of crappy amazon/Netflix thrillers? For 'smart businesses' you sure do make a lot of dumb decisions..All I'm going to say is stop reading the reviews and go watch this movie! I wasn't expecting much going into it, but this movie blew me away!"}, {"id": 381, "text": "Totally underrated gem, very very good work, these films belong to local cinemas, you will be greatly entertained"}, {"id": 382, "text": "This engrossing film begins like a Supernatural, with thoroughly creepy things happening to a family that's having quite enough problems already. A couple of young boys have been killed, reminding me of HBO's Steven King story, The Outsider. This is a brilliant story and screenplay, with great acting and direction. Helen Hunt (Mad About You) and John Tenney play the parents, and they and the 4 young actors are great. Highly recommended."}, {"id": 383, "text": "In I SEE YOU, Dr. Jackie Harper (Helen Hunt) is in the midst of family upheaval caused by an affair. Her bitter husband, Greg (Jon Tenney) is a cop who seems incapable of forgiving her, spending most of his time sulking. He's also investigating child abductions that may be related to a past series of murders.Meanwhile, something very strange is going on in the Harper's home, involving inexplicable events. Viewers are left wondering what's actually happening. At times it seems almost supernatural. Could their son (Judah Lewis) be responsible? All of this is connected together in an original and satisfying way. Packed with wicked twists and unexpected turns, this is one of the best thrillers to come along in a while..."}, {"id": 384, "text": "We start with the impression of a low budget horror film an d it is uphill from there. It turns out to be anything but a horror film, just a well executed and edited mystery. Don't turn it off, just keep watching as the plot twists an turns and the suspense builds. It keeps you guessing and trying to piece it together all the way to the end. Get out the popcorn, turn down the lights and enjoy."}, {"id": 385, "text": "Had fun with the cheesie music leading up to a jump scene. Single camera filming reminds me of the b movies from old drive-in days. Only watched because of Helen Hunt."}, {"id": 386, "text": "Sorta slow at start. Fairly silly behavior....so just sat and watched till the end to see what was really going on. Didn't really enjoy it much. Oh well."}, {"id": 387, "text": "The story is riddled with incongruities and characters and plot developments that make no sense. Motives are implausible or aren't explained. Many elements are introduced which leaves no time to really explore any of them sufficiently. And again we have this tired trope of the outwardly idyllic upper middle class family that has all kinds of messed up problems and disturbing secrets. Sure, every family has its problems and quirks, but if you believe these Israeli Hollywood products, the (white) family is the most messed up thing on the planet. Lame and stupid."}, {"id": 388, "text": "Some kidinapping, some parasite teenagers, some family problems. This what the movie is about. Is is thrilling? Well in first half hour you think of some supernatural force which kidnaps children and steals pictures, but then reality comes back and you end up in plot twist, which is not very thrilling, because the guy hiding in their house is somehow a psychopath but the dad is too. But both are not that much psychopath that the come together of them is very thrilling. Furthermore there is no explanation of why the dad kidnaps Young boys or why the guy likes to confuse people. So why are they doing that? The plot had a great chance of getting a very good movie and I think the actors had the potential to make it interesting, but in fact this movie is more the sort of a good family drama more than horror or thriller, which it suggests in the first half hour. So it leaves me a bit disappointed, but one can still enjoy it."}, {"id": 389, "text": "I didnt get the connection between the blonde homeless kid and both cops."}, {"id": 390, "text": "This is a boring movie. I didn't care about the characters, because the writing isn't that good."}, {"id": 391, "text": "This was a terrible movie. I can see how some viewers were enamored by the plot twist which was mildly interesting but the pacing was bad, the score was loud and used in inappropriate places, the acting was weird, Helen Hunt looked weird, the plot was super messy and convoluted...I can go on and on. It had the makings of a solid film but the execution was so very bad."}, {"id": 392, "text": "Just ignore the bad reviews and watch it without any hesitation.I bet this will not disappoint you at all! You can't guess anything till the last scene,The best plot ever! And the good thing is that trailer misleads you!"}, {"id": 393, "text": "I wanted to see it right from watching the trailer. Was feeling a bit disappointed when I thought the movie was following a  Same old same old  direction. Then it went scattershot in all kinds of F'd up. Not usually left feeling like I saw something new but this time is different."}, {"id": 394, "text": "Had little idea of what to expect going in. Eerie moody slow start which i don't mind. Didn't set up every fact in first 30 seconds which I also liked. Unexpected turns for a change. I highly recommend as an emersive thriller that I couldn't predict at any point. That's unfortunately very rare so thank you to all involved."}, {"id": 395, "text": "Excellent suspense thriller! Right thru to the end! Highly recommend"}, {"id": 396, "text": "I rarely write reviews for movies but I really felt compelled to for this one. I'm a huge fan of psychological-thrillers and this checks off every box for me when it comes to a movie I like. The entire movie is eerie and the musical scores perfectly compliment the directing. Take an hour and a half and watch this movie, seriously -- you won't regret it. The acting is great, the storyline is great, and when the climax hits it hits like a train coming at you 100 mph. I was absolutely engulfed the entire time. If you're a fan of eerie psych-thrillers with insane twists and turns then this is the movie for you."}, {"id": 397, "text": "Watch this. Deff a new concept. Liked it a lot. Watch it and pay attention."}, {"id": 398, "text": "I am happy to see that I can still be genuinely surprised while watching a thriller. This movie manages this very well, in addition to outstanding acting performances of the two leading actors. It is one of the best thriller &amp; mystery movies I have seen in the last 4-5 years. It is a good movie regardless of the genre."}, {"id": 399, "text": "I thought this was a great movie! Definitely kept me glued to the T.V. I thought the acting was pretty good. I would recommend this movie."}, {"id": 400, "text": "Could've been a good film. Director gave everything away. Acting is really bad and the plot is very disconnected in the second act. But, if you're going to watch it, watch till the end. The direction just through it off..."}, {"id": 401, "text": "Story started off good but then deteriorated to a bad ending. And what's with Helen Hunt's face?"}, {"id": 402, "text": "Nothing special. Mindy was one of the most self conscious ghrogger (?). Why do it if you know its illegal AND dangerous! I expected more of Helen Hunt and watched primarily for her but she had little role to play. Disappointed."}, {"id": 403, "text": "If you can overcome how Helen Hunt is looking (Botox is my guess without researching it), the movie has a lot to offer. And just because she looks bloated, there is still some acting behind it all. But what really is the driving force behind the movie is the story and structure/edit of it all.You may be weirded out when certain things get shown again (from a slightly different perspective), but you will see (no pun intended), that it does make sense! It's well told and acted and it has a few surprises along the way that really elevate the movie quite a lot."}, {"id": 404, "text": "Another kid has gone missing in a sleepy bedroom community. Police detective Greg Harper (Jon Tenney) investigates. His psychiatrist wife Jackie (Helen Hunt) starts sensing strange happenings. Their teenage son is angered by her infidelity.I like the spooky mood which fits nicely with the icy coldness within the family. The phrogging is an intriguing reveal. I'm good with the second point of view. Then the reveals keep happening and it probably goes one too far. There is no need to bring in the missing boys. The last reveal has no foundation. Also Mindy has to be the last to confront the husband. Alec could come upon them and he's the one to get shot while she escapes. It would maintain the danger since she's the one who witnesses everything. Once she's dead, the man has no reason to believe that there is another person. Alec only knows that he killed Mindy. The movie is a terrific Hitchcockian thriller for the first two thirds. The ending has a few minor issues."}, {"id": 405, "text": "9/10 for the film, slow start but nice build up1/10 for Helen hunts face"}, {"id": 406, "text": "The movie has everything, the kidnapper, the twist and the ending. But it doesnt has the climax.And the way the movie was presented, the pace, the visual was very cheap.It wish it was as dark as the Spanish movie The Invisible Guest or any other serial / kidnaper.I think the ending could be, present more dramatically."}, {"id": 407, "text": "But this was just as good! Totally unexpected storyline when I was ready for ghosts and demons. Very good twists and kept you guessing until the very end!"}, {"id": 408, "text": "It's good thriller. Firstly, the plot is interesting, I like the idea of film. At one moment I thought that some supernatural powers terrorised the family, but it's not truth, solution is more intriguing. It has a lot of twisted moments, and the end can shock you. The feeling of suspense is increased with every munite. Secondly, the cast is good, my favourite is actor who plays the frog. So, it's good mystery film."}, {"id": 409, "text": "The first half of the mediocre routine, stereotyped thinking will make you mistakenly think that this is the quality of the haunted film, but, must not rush to close the picture, the middle section of DV is about to rewrite the tone of the film: double-view narrative makes all the mundane details of the past interesting. It seems that there is no intention, in fact, there is baggage everywhere, some people say that the second half is too wordy and long, in fact, the fun brought by the details is worth your appreciation and taste."}, {"id": 410, "text": "Great movie. In the first two minutes I thought it was going to be one of those silly supernatural thrillers and boy was I mistaken. There's nothing supernatural about it. This film is a white knuckle edge of your seat thriller and you have no idea where it's going until it's fantastic and rather twisted and disturbing conclusion. That's all I'll say as I don't want to give anything away. Excellent and catch it on Prime while you can"}, {"id": 411, "text": "As a big time fan of horrors and thrillers, I can say that the movie's depth in story was above average and pleasantly surprising twists! Must watch :)"}, {"id": 412, "text": "Just could not imagine in the beginning as to what was about to unfold, to be followed by insane events that totally rock the viewer. On top of which the pulsating soundtrack wants you to believe it could be a horror flick, which it is....NOT! Amazingly! The movie leads you to believe one thing to lead you into something totally different. Intelligent, quality thriller. Loved every minute!"}, {"id": 413, "text": "M night type twist at end. Too elaborate a plan to gain revenge on a tormentor from 10 or 15 years ago. Idea ok, writing eh, and acting is fine except Helen hunt which just seems uncomfortable."}, {"id": 414, "text": "The factual matrix is inherently improbable. If you get passed that, it's an entertaining movie. The series of events as told sequentially from the different characters explain the seemingly impossible."}, {"id": 415, "text": "At i thought it was a ghost.. and bham! double plotwist *clapping* what a great movie, worht to watch"}, {"id": 416, "text": "For a brief moment I thought this would be a bad movie, but it turned out to be a pretty good movie with a nice plot twist and an original story."}, {"id": 417, "text": "Ignore the negative reviews. This is one of the best thrillers I've seen in a long time. Loads of twists that I didn't see coming. Highly recommend!"}, {"id": 418, "text": "But the girl phrogging couldn't be stupider. I can't stand stupidity. Her and her boyfriend. And Helen Hunt is aging badly. It was very slow and I ended up fast forwarding through parts."}, {"id": 419, "text": "From the Intense use of unusual music to the well-framed and deliberate cinematography, from the non-chronological juxtaposition of timeframe to the cleverly complete screenplay, this film gets the idea of MYSTERY right, without losing an ounce of credibility. The performances are mostly top-notch as well, especially Helen Hunt, who overcomes her sadly reconstructed plastic surgery face to remind us that it's what's inside that counts most.It's a disturbing, scary and thrilling movie that's worth your time. Keep an eye on the screenwriter and director going forward."}, {"id": 420, "text": "I really recommend if you like thriller, mystery movies. This movie is definitely not a horror but a great, great suspense movie."}, {"id": 421, "text": "Very solid plot the suspense keeps going throughout the movie. It comes together well at the end, by far one of the best suspense thrillers I've ever seen."}, {"id": 422, "text": "Like the spawn of Parasite and any of a dozen utterly interchangeable and forgettable kidnapped kid detective stories, this movie is badly written, thinly plotted, woodenly acted and, worst of all, juggles points of view like a drunk in a big top. In fact it is at least three different stories and styles of story awkwardly tied together and staggering along a lonely forest track. That is the scariest thing about it.Actually the 'base' story of a couple driven apart by infidelity, and their teenage son's rising anger, is not bad, but it's abandoned for a much flashier story the director (and the scriptwriter) have no idea whatsoever how to manage or give dramatic life to.As Samuel Johnson said of a rival's book manuscript:'It is both hood and original, but the parts that are good are not original and the parts that are original are not hood.'"}, {"id": 423, "text": ".. Such a talented actress, a very beautiful woman. Yet turned into a plastic toilet seat made for fatties who weight too much for a soft-rubbery kind. Yuck. Interesting film though, a little predictable if you're familiar with the formula but still fun."}, {"id": 424, "text": "No ghost. No good Man I started watching this because I thought it was a ghost movie but very disappointed, what's the stupid boy doing in the end"}, {"id": 425, "text": "Not at all a horror movie. Wow Helen hunt has aged - with Botox.You know, I really liked the twists in this movie! But one thing though - the girl was so stupid? She did everything wrong - hey, a hut right next to the place where the man left the car, let's go in. Idiot."}, {"id": 426, "text": "This 2019 thriller/murder/entities mystery staring Helen Hunt as an adulterer trying to get her teenage son &amp; cop husband to forgive her recent dalliance....then child murders &amp;/or perhaps only just disappearances begin to haunt this well to do small town yet again, but the old conviction of pedophilia bad guy is still in jail for those horrendous earlier crimes... I See You is a 10 + in my book of thrillers/entities/murder mysteries. In writing the above....I now get it even better....which is why it is a 10 +🎶"}, {"id": 427, "text": "Who is the killer? Psychological thriller. We watched with the family."}, {"id": 428, "text": "Gr8 plot and unexpected turns super show to get wrapped up in"}, {"id": 429, "text": "As it stands, this is a well put together thriller. However, the lack of a supernatural element is a missed chance in many ways. First of all, the high quality camera work and atmospheric audio create a perfect framework for it. Second of all, once you realize that there is no horror element, the story immediately becomes far too transparent for my taste. All the twists were more or less obvious if you know about film. That being said, this a movie that is technically top notch, that has decent acting and an okay story."}, {"id": 430, "text": "Watch it. Get into it. Let it happen. Damn this was good."}, {"id": 431, "text": "Starts out eerie. Red herrings galore. Then a WTF? Clever flashback with interweaving plot. Then it gets uncomfortably absurd. But then the ending ties everything up and it all makes perfect sense, kinda. Be sure to notice the teeth on the young boy on railroad track that escapes the killer."}, {"id": 432, "text": "It's Surprisingly Good. Good acting. It most certainly keeps you entertained. Add to your watchlist"}, {"id": 433, "text": "The story with a perfect twist good movie to watch keep you guessing"}, {"id": 434, "text": "I enjoyed the movie but I didn't realize who the leading lady was and then it hit me Helen Hunt! She was so beautiful before she still is a beautiful person but I was sure if they had her look like that on purpose until I looked her up online and yes sure enough under going the knife is not always the best thing years later or heck hours later. I feel so bad because I'm sure I wasn't the only one puzzled about her appearance. As some one else said great movie but very much distracted for sure!"}, {"id": 435, "text": "I have to admit a couple jumps got me and I don't jump easily. If you read all the positive reviews, it's the same thing I would tell you here. The only thing I will add is that it will make you question a lot of things. It's definitely worth a watch, maybe 2."}, {"id": 436, "text": "First of all, just ignore how Helen looks, just watch the movie. This is a creepy, twisting crime thriller that keeps me on guessing and wow at the a new terms: phrogging. I would be goddamn scared if someone phrog inside my house, and even more if I phrog inside a serial killer house. This movie is quite smart, keeps me heading at the wrong direction the whole time until the last curtain is revealed.Just watch it!"}, {"id": 437, "text": "At first it seemed like the regular paranormal movie, but the twist towards the end, brought this movie back to life. Did not expect it. Great ending."}, {"id": 438, "text": "I wont put some spoilers in, just watch it haha, it had me bamboozled with the movie description"}, {"id": 439, "text": "This movie is much better than what's been expected. It's definitely not just another scary movie but has its own novel aspects to keep you in the edge of seat. Worth a watch!"}, {"id": 440, "text": "This is not a movie you can passively watch. The writing is excellent. I have not been this entertained with a storyline, as well as how it's put together, in quite sometime. The director and writer remind me of a budding M. Night or Tarantino."}, {"id": 441, "text": "Thought this movie was a great ride. I thought both the acting and story was good. That twist at the end I did not see coming. Worth a watch!"}, {"id": 442, "text": "This is a must watch. The second half was double good not having to look at Helen Hunt's face. I'm sorry but she looks awful. What happened? Anyways, very good. Terrific way to end it also."}, {"id": 443, "text": "Loved this movie! So many twists and turns I didn't see coming. It would have made a better book, to be honest. At least that way, you're not distracted by Helen Hunt's monster face. 😂"}, {"id": 444, "text": "For a imressive thriller but fals flat because there are the obvious drifts of intrigue. first, you may think it s a paranormal thing or mind cucu. then, the intruders plot that delivers the truth in the end. predictable, i knew who did it. wants to be impresdive but it doesn t succede. you can watch it, its not that bad."}, {"id": 445, "text": "It doesn't always take a good singer to present a good song. If the song is great a mediocre singer can wing it to prominence. Not the same with scripts and the actors who bring them to life. Hurray for everyone involved in this production... Awesome writing displayed by equally great acting... Pay close attention to this one. A true gem for the budget."}, {"id": 446, "text": "This movie is for sure not a 10, but it is enjoyable. It's basically a mystery disguised as a thriller. Saying too much will spoil it, but it has a late twist that changes the direction of the whole movie. I watched it with my wife one night and we both liked it. It does have a few inconsistencies, but in the end it comes out as a pretty good flick."}, {"id": 447, "text": "I would have given this movie a 7 if it wasn't for Helen's terrible botched plastic surgery"}, {"id": 448, "text": "This director is one we'll never watch again...the music he used in this film is completely obnoxious and out of sync. Wow, didn't he have someone to be the voice of reason here? Storyline was annoying as well....guess we didn't like it much. Adam Randall needs to find a different profession"}, {"id": 449, "text": "Hated the unnecessary ominous music. Hated the teen son who needed to mind his own business and STFU. Hated that we had to watch the movie twice due to the plot twist. Wasn't surprised in the slightest at the big reveal."}, {"id": 450, "text": "If you can ignore Helen Hunts face, this is a pretty good film. Slow at times, but picks up at the end."}, {"id": 451, "text": "I love suspense films and this films keeps you guessing til the end. Jon tenney is amazing and helen hunt is awesome as always! I love how this film is not as it seems and that is a good thing that it uses to hoist the suspense and happily just not get used as a detriment to the film. So if you want to enjoy a scary unnerving film from beginning to end look no further!"}, {"id": 452, "text": "I was disappointed. Watched this till the end and no horror. Please don't categorize it as such. And did Alec choose the house?? I skipped all the repeats cause I got bored."}, {"id": 453, "text": "After watching it the first time, I just had to rewatch it. How is this movie not talked about? I was on the edge of my seat the whole time. Thriller movies are my favorite genre and this movie is up there as one of my favorites. I really don't want to say much more. Going into it not knowing much is probably the best way to enjoy it."}, {"id": 454, "text": "Did not expect this movie to be so captivating and unpredictable. The sequence of events were cleverly shown through brief visualization and dialogue as well as perfectly synchronized past events to present events continuity. Loved this film."}, {"id": 455, "text": "Just twist after twist. My type of movie... A must watch, need more thrillers like this."}, {"id": 456, "text": "This film is very similar in structure with Spanish film The Hidden Face. It deceives the audience pretty well and also has some unpredictable twists which make it an enjoyable thriller."}, {"id": 457, "text": "Great mystery, plot twists. On the edge of your seat the whole movie."}, {"id": 458, "text": "It's pretty good. Keeps you guessing all the way through. Very well written twisty script. Lots of surprises. The first half was decent, but the second half of the film really steps up. If you're in a mood for a very dark thriller you've come to the right place. Cudos to all the filmmakers on this one. Good job!"}, {"id": 459, "text": "You won't know why the title fits the movie so well until well into it, and that speaks of how well written and made this movie is. That in 2019 there can be a horror/thriller movie made that's so original and unexpected is really something. Watch this movie. It's good in every way. It holds your interest all through it, and is never predicable, while not using either silly ways to surprise."}, {"id": 460, "text": "It is not often that I go into a movie were I expect very little and am shockingly and pleasantly surprised. This was one such movie. IMDB describes this as Crime, Drama, Horror, Mystery, and Thriller. If this movie stuck to any one of these, it would have been a well-acted, but so-so film. But the twists and turns moving from one genre to the next when you don't expect it was amazing. I feel like I have to watch it again to see how everything meshes together and what clues I missed along the way. This was not a so-so movie, but rather brilliant! Great writing! One of the best plots I've seen in a while. Absolutely watch this movie if you like to be misdirected!"}, {"id": 461, "text": "I did read the reviews before I watched and I have to say that this movie was freaking crazy, suspenseful, tons of twists. Not sure why it didn't receive a higher rating. I am a movie and tv addict not sure how this one didn't fall in my radar. Saying that, there are 2 things that made me have some questions: 1. Why did HH not have her lips done to match the rest of her face. Couldn't quit looking at them. Age is age but you can't do a couple of tweaks and not make your face as even as possible. Otherwise, she was great as always. 2. What is the back story of the killer, would have loved to know more about the past and what drove this person to do what they did. THIS IS A MOVIE TO WATCH IF YOU LIKE SUSPENSE/DRAMA."}, {"id": 462, "text": "Loved the movie! But what in the hell happened to Helen Hunts face? I kept thinking she looks like Catelyn Jenner."}, {"id": 463, "text": "The preview may lead you to think you're in for a supernatural thriller or a horror flick. It isn't. It is, however a thriller with several twists that will keep you watching. A solid 7.5 or 8."}, {"id": 464, "text": "I really enjoyed the two perspectives one from the family's point of view and the other from the Phroggers. I hope this doesn't set a trend for people to do this type of thing."}, {"id": 465, "text": "I regret not watching this sooner. IGNORE THE NEGATIVE REVIEWS. Watch it. Deal with the slow-ish (not really) start and enjoy the reward of your patience. Twists, double turns, and a beautiful yet creepy score/videography keeps you entertained right till the last shot."}, {"id": 466, "text": "If you are expecting a horror/gory movie, than this is definitely not for you, but if you want an edge of the seat, suspenseful thriller, makes you bite your nails, than this is a MUST WATCH for you !! I won't say anything else about it, but give this gem a try!"}, {"id": 467, "text": "So creepy, unexpected thrill!, the best for 2019.."}, {"id": 468, "text": "A friend recommended that I see this and told me no way I could guess the ending. While I did have a main plot figured out by the end, some things I did not expect. The worse thing about this movie is how awful of an actress helen hunt was. Before you jump my throat, I loved her in many movies before this one but for real I think alot if it might have to do with the fact her face is haunting. You can't have that many face lifts and botox and play a character who seems from the story line was in her young and prime before getting pregnant with a now high school aged kid and that caused her to marry and settle down....helen you would be better embracing the wrinkles then that lifeless, sunken in face you have now."}, {"id": 469, "text": "Don't let the reviews on this film deter you from seeing it. It was very twisty and very turning. At one point I knew what was going on and then I second-guessed myself only to find out that I was possibly right in the end. It's a very entertaining slow burn thriller. I am surprised that this did not get wide spread theatrical release.Enjoy this film and have a beautiful day!"}, {"id": 470, "text": "Yes,a lot of viewers will skip this movie cause of bad ratings...genre is totally wrong-this is not a horror movie but rather thriller with sooo many plot twist. I liked the story,didn't like the way it was presented to us. All those plot twists are kinda good...you never know what to expect after 45min into movie. And music throughout movie is sooooo good"}, {"id": 471, "text": "About the time you have this one figured out.....Though a bit slow in the beginning it has enough suspense and twists to keep your attention and keep you guessing. Acting was very good."}, {"id": 472, "text": "I went into this blind only knowing it was deemed a thriller/drama/crime/horror. Although it's creepy, I wouldn't call it a horror. It was quite well done and the story ended up going a way I wasn't expecting - what more can you ask for in a thriller?!"}, {"id": 473, "text": "A must see thrill ride!! Suspenseful!! Well made!!"}, {"id": 474, "text": "Creepy movie that basically has three phases. Kids are going missing over the years. Husband and wife and son are estranged because the wife cheated.They live in a gorgeous huge house on a cop salary, but the wife comes from money and is a doctor.She's cheated on the husband and son and husband are angry with her. She seems strange, staring off into space, avoiding the news and avoiding kids.So, at first production values and sound seemed cheap, uh-oh almost turned it off. Glad I didn't.This movie is creepy with great music that keeps the creepiness going. And does the wife know what's going on? Is it the son? Why does the husband ignore pictures going missing. Who took the silver and what's that under the bed?Because we don't know what happening and the movie is great at suggesting several possibilities and keeps you guessing.There are bread crumbs along the way. You have to pay attention."}, {"id": 475, "text": "Loved the way this was filmed. Minimal dialogue added to the suspense. Fantastic thriller!"}, {"id": 476, "text": "Great movie to watch with your teenage kids. Unpredictable at all times, it moves between time frames in a way that gradually enlightens you as to what has happened. You are never lulled into loving any one character which keeps it interesting and less predictable. No Sensational violence, thrilling but not terrifying, quality acting, worth watching."}, {"id": 477, "text": "Buckle in, because I See You is one of the wildest rides I've been on in years. For once, a film's trailer and marketing hasn't spoiled every exciting aspect of a film!Helen Hunt stars as a counselor going through a rocky marriage after having an affair. Her husband (Jon Tenney) is too busy wrapped up in trying to solve a case involving several abducted boys in the area and her son resents her for causing a rift in their family. Even stranger, all three of them begin to experience seemingly supernatural events in their home. They hear noises, silverware disappears, and they have the sheets pulled away from them as they sleep. Could there be a ghost haunting their home?Every time you think you know where I See You is going, it spins in another direction and it ends up being one of the most suspenseful and engaging thrillers in recent memory. The less you know about it going in, the better. Just watch it it!"}, {"id": 478, "text": "The thumps up: The movie has its creepy moments and a good twist and i thoroughly enjoyed the storytelling.The thumps down: Helen hunt looks 70-year old. Poor casting there."}, {"id": 479, "text": "As someone who loves psychological thrillers (both books and movies), this is one of the best ones I've seen in a while. There were several twists that I didn't expect and I can't recommend it enough!"}, {"id": 480, "text": "If you appreciate different thriller ideas this is enjoyable."}, {"id": 481, "text": "Thought it was a horror film, but was surprised when it took a great turn. It's an original movie with a well written story. Definitely worth a watch if you have 90 minutes to kill. I did find it a little predictable. No, I didn't know where the story was going; but I saw the antagonist from a mile away once I realized what was going on. It's always the person you least except. There's only so many ways to tell a story and I'm not knocking on it. I dig it and I give 7/10 imaginary internet points. On to the next."}, {"id": 482, "text": "They call I See You horror principally for the way the events play themselves out, but in all actuality, it's a crime thriller with horror elements. Yeah, there are many reviews that say Helen Hunt now looks like Caitlyn Jenner complete with a face so tight you can bounce a volleyball off it. Personally, I just think she gave all her hard earned cash to the wrong plastic surgeon and perhaps should've seen the ones responsible for Michael Jackson's transfiguration. Looks aside, I See You is actually worth your time because of its wholly original way of telling a story. I won't say how because that'd be spoiling all your fun. Nevertheless, it's a good way to spend 90 minutes of your time. You can thank me later."}, {"id": 483, "text": "Started off good. I swear when I see stuff like this, that has it's moments, I swear it's out of Canada. I'm sorry but you Canadians have a way with movies. Head scratching moments my behind, too many head scratching moments. Interesting though, very suspenseful, and I think worth watching."}, {"id": 484, "text": "The first 2 thirds of the movie aren't as boring as people say they are,I personally wasn't bored for one bit but that's probably because I watched this with friends. The acting is good.It's nothing amazing but it does not interfere with your enjoyment of the movie. The last 30 minutes are good and i dont think anyone saw that twist coming. Speaking of the twist it was good but definitely relied on shock value. it rewrote the character of greg which is not something good twists do. The second twist was better though since it was did not just come out of nowhere like the first twist and explains some stuff. Overall enjoyable just watch it with friends"}, {"id": 485, "text": "That's all I could say! Great movie though!!!! Love how they tied everything together"}, {"id": 486, "text": "This movie is great for insomniacs as it will certainly reduce your dependence on sleeping pills. Not good for people with a heart condition as it is annoyingly irritating. The movie is an island as it fails to make any connection with the viewer or realty. Seasoned cop just makes irrational decisions. Doesn't even know how to plant evidence. It would be attractive to Americans under the Guano Act. Who would have thought a mum's itchy yearnings could cause so much havoc. The music- it's like watching a documentary on the communication nuances of the humpback whales."}, {"id": 487, "text": "Boring. Overly dramatic music injected into every scene without reason. It could have turned into something interesting, but half way through the director said, hey, let's just throw one mischievous b&amp;e teen and one rape survivor into the mix and call it a day."}, {"id": 488, "text": "Frog boy, apparently his first time phrogging. Did he target the house specifically or was it random...the green pocket knives...some odd coincidences peppered through the flick"}, {"id": 489, "text": "Great story although you'll be left with a lot of questions like why did the detective do that what's the reason?"}, {"id": 490, "text": "In this Movie you always think you know but you don't! Please watch till the end! Great!"}, {"id": 491, "text": "I really enjoyed this! Expect the unexpected. Helen Hunt is a gem. Looking forward to more like this in 2021."}, {"id": 492, "text": "I don't watch thrillers really but I am into the paranormal so when I saw the trailer to this I was quite excited.... However about half way through I realised this is not a haunted house movie at all it's a crime thriller... So I was pretty gutted as the trailer was misleading... But it actually turned out to be not too bad..I think I would have enjoyed it more if I knew what kind of film it was from the start"}, {"id": 493, "text": "This one is a bit of a snoozer, never really scary and overly long with few characters (if any) worth caring about. I could see it appealing to people who are easily frightened and don't require much to entertain them."}, {"id": 494, "text": "The first 3rd of the film keeps your attention, not going to lie I was very close to turning the film off at around 50 min in. Once the first secret is revealed and the filming style changes you think you know everything and feel a bit cheated. If you can get through this part of the film you will be really glad you stuck with it. So many open mouth moments and things you didn't see coming at all. Brilliant ending and I am so glad I persevered"}, {"id": 495, "text": "It seemed a bit confusing and haphazard during the first half hour, but comes together and ends up being a decently interesting storyline. I was distracted quite a bit, though, by the sad reality of the overuse, and sometimes tragic results, of cosmetic surgery. I just wish people could be happy in their natural skin."}, {"id": 496, "text": "It unfolds slowly and its worth hanging in there...well done."}, {"id": 497, "text": "Led you one way and then another. Great movie for October watching!"}, {"id": 498, "text": "Probably u think, u have seen it all. Think twice. I see you definitely adds something new to the genre! The movie is not horror (at all) it starts as mystery -maybe through the great camera work it even gets some sort of a supernatural vibe- and keeps u on this (wrong) track for quite a while before it shifts completely and moves into a super strong thriller. Nothing is what it seams and this is done so effortlessly. No odd dream sequences which sometimes are used as cheap tricks to confuse the audience. I see you stays throughout on track in developing a clever, frightening and most importantly, human story with twists I never anticipated. Let me also mention the score, it helps so much to build and keep the creepiness &amp; tension."}, {"id": 499, "text": "I don't want to overstate the obvious. This is a paltry film with a bare, hollow core. The actors are competent and I admire them for making the most of this horrible, horrible material. The camera work is almost admirable, and whoever is in charge of the overall style did a great job. But the dark, sick atmosphere ultimately leads nowhere.By all means, watch this film. But don't expect anything but sick thrills from this paranoid, schizoid ordeal."}, {"id": 500, "text": "Really enjoyed this movie, grab some popcorn turn down the lights!"}, {"id": 501, "text": "I'm not getting how this is being considered a good, suspenseful thriller. It could have been great, had the twist not been completely lost in unnecessary plot.The mother and the son might as well not have been there, they just wasted screen time (which they take a lot of) that would have been better served elsewhere and the affair plot line was pointless too. I understand these elements are to keep the audience guessing and throw us off course, it was just poorly executed to the point it was boring. The mediocre acting didn't help either.I didn't feel the suspense, the build up or get the pay off from the twist, it all ended in a big meh."}, {"id": 502, "text": "This would be 10/10 if not for Helen Hunt's face. She's had that much work done she can't convey emotion!Other than that, watch this film!"}, {"id": 503, "text": "My first ever review as I can't believe this only has 6.8 and I think it deserves a lot more.Watch it, you won't be disappointed."}, {"id": 504, "text": "A strained house due to a wife's affair and the husband being a detective to child abductions is made worse with some strange goings on in the home. A lot of twists which I like but not these ones. This could have been a creepy masterpiece but instead was a disappointment. Not wholly disappointing as the acting was good and the story was ok I'm just hung up on the fact it could have been brilliant."}, {"id": 505, "text": "This film is a good watch and it does start to add up but it did annoy me that you never found out why he kidnapped young boys. That part made no sense. Plus Helen hunts acting was pretty bad!"}, {"id": 506, "text": "The thriller was pretty average. The first act was ok, the second act was laboured because we already knew the events that had happened and therefore the reasons for them happening, once we got the idea, could have been condensed much more tightly. The third act was ok, but if you are a thriller fan then you would have suspected the husband cop was something to do with it all along. So as I say, average but not awful.The elephant in the room was Helen Hunt. She is a great actress and could have aged gracefully but what the hell has happened to her face! Well, even though there is no confirmation, we kind of know don't we? But the result is probably a lawsuit of some kind against a cosmetic surgeon since she looks like one of those make up jobs in the original Star Trek when an alien beauty suddenly becomes a lipless, gaunt, ghoul which makes Captain Kirk step back in pitiful horror. I'm seriously not getting at her, she is very talented and I actually feel sorry, because with natural ageing her face would have been so gracefully embracing of old age and for that reason, attractive, and consequently the parts she was offered so much better than this. There is not a director of photography around who wouldn't be looking at the rushes and thinking....ok, let's see what we can do in the edit."}, {"id": 507, "text": "10/10 on music choices for this flick. I enjoyed this movie except for some big errors. Clearly no experts in policing weighed in in this movie. Even i, a regular citizen, is wondering what the hell with some stuff here with the Dad/Detective. Do you really keep so perfectly organized bags of evidence in police bags no less, against yourself? Even i, a non murderer, know that less than a foot to bury someone is ridiculous. If it weren't for things like this I would have been 100% behind this movie but come on!I will give super props for how the movie was laid out in how they presented all the characters. That worked really well. It was like a 20/20 mystery where your opinion flips around the more you know."}, {"id": 508, "text": "This movie is just a kidnap murder thriller. It has a not bad intertwined story but it doesnt fit with the beginning of the film which sees a abducted boy lifted sky high into the air by some invisible force. Making it so that it could only be a phenomenal or supernatural abduction but then this just isnt the case which leaves unexplained why or how that could even happen by a normal human abductor . They either shouldve added something supernatural into the already intertwined story thriller or not done that at the beginning"}, {"id": 509, "text": "The first half of the film is good, it builds a bit of tension along the way. Is thioe ocurrances supernatural or are they going to be easily explained? The acting is decent, though is let down badly by Hunt, whom has never been a very good actor. Then we hit the second act, where its explained to us blatantly what's been going on the whole time, which ok, wasn't the worst idea in the world but i feel it coud've been handled in a more subtle way, certain character just seem to do stupid things for no reason and really, that whole trope is tiring now. Of course the stupid actions lead to them getting into danger needlessly. The film then swings again into the third act and playes through to a conclusion from the perspective of the father. Overall i just felt it lost its way into the second act."}, {"id": 510, "text": "It's a really good thriller. By the way, the soundtrack is definitely very well chosen."}, {"id": 511, "text": "I've started the movie expecting a creepy thriller but unfortunately was disappointed. The movie directly starts with a creepy vibe music and it keeps going like that throughout the whole thing. Sometimes less is more and this is a perfect example. At the parts when it should have been creepy, it wasn't any more, as the music has already drilled our ears to death. The acting of the mother was weird and the whole thing with the family not forgiving her was a bit over the top from acting point of view. The end twist was interesting but the part from the second perspective (of the kids in the house) was dragged out for too long.Overall, considering above mentioned points and all the classic horror movie stupid moments, movie was a bit of a disappointment. You can still watch it but nothing to remember after a week."}, {"id": 512, "text": "I find the strange occurrences not very scary. The fact that half the film is spent explaining the occurrences is a little strange too. I didn't enjoy it as much as I expected."}, {"id": 513, "text": "This had me fooled up to a certain point towards the end; I had never expected that twist and it made a lot of sense, and I love a movie that can fool me. I also think I was fooled because I was kind of annoyed and stopped paying attention. But!..This film is totally disjointed as if it was done by two different directors; jump cuts all over the place in the beginning and then when the vlogging phrogging starts, the movie settles into a much better directed and edited flow and stays there.That however, as narratively good as it finally gets, can't save the rest of the film from itself. Some really godawful shots of Helen Hunt looking like The Mummy, (like, be kind to your one big star, guys!! ) the aforementioned editing and directing style in the beginning of the film and a couple or three huge plot holes that could easily have been filled in but weren't - what stands out to me is why and how and what did the phrogger do to the son?, or was that supposed to be dad also? But!...It's worth a watch, and maybe even a second watch so you can see how it all finally comes together, and how a bit more editing and story choices could have worked to make this a great film rather than just an entertaining time waster."}, {"id": 514, "text": "Cannot believe this movie was not marketed better, and that I have not seen it before. It is much better than some of the currently better publicized more popular high-budget 'thrillers' recently in theaters. If you enjoy a good mystery/thriller with suspense and twists, it is DEFINITELY worth your time. You won't regret taking the time to watch it. Just make sure you pay close attention to the details, and don't make up your mind too quickly about what you think is unfolding before your eyes."}, {"id": 515, "text": "I too found something a little odd about Helen Hunt. Just not well acted or just unusual? Overall it has a tried and true storyline but some really good twists. Music really helped it along the climactic scenes."}, {"id": 516, "text": "I would not be a fan of Helen hunt but this is like two different movies and she is hard to watch when she is in any scene, her acting is awful as well. However it is well shot with a great storyline and has a few surprises that work extremely well here, but it could have been better cast with a more believable leading actress. The two younger actors made this movie realistic with a smart direction too."}, {"id": 517, "text": "This is a great thriller and throws up plenty twists and turns along the way. The creepy soundtrack help keep the ominous feel throughout."}, {"id": 518, "text": "It's slow going, but so much happens that it keeps you intrigued. The ending is crazy."}, {"id": 519, "text": "Very strong writing and a story line that keeps you guessing until the final climax. Take Vantage Point pair it with Poltergeist and marry it to Kiss the Girls. Ignore the negative reviews and watch this one."}, {"id": 520, "text": "It's all about the plot. The music is at times irritating and tries to set an atmosphere at the wrong time."}, {"id": 521, "text": "This was such a good crime movie. There's was a lot of twists and being a true crime fan I never no where the fiction films twist. I highly recommend it to anyone who likes crime."}, {"id": 522, "text": "Great film was so shell shocked after it kept me guessing and getting confused ,it will come all together but you just got to watch it to the end bravo 👏"}, {"id": 523, "text": "You've got to watch this. You will not be disappointed."}, {"id": 524, "text": "Give this movie a chance! Great thriller mystery. No clue where it was headed, but glad I kept with it."}, {"id": 525, "text": "Was one of the more engaging films I've seen lately. Very creepy and some nice plot twists, including a few that make your hair stand on end. Makes you wonder what's going on in your house when you're asleep."}, {"id": 526, "text": "This is my first review ever and I'm a die hard user of IMDB. This film is so interesting in it's execution. One half you'll think one way, then you'll think, where the F is this going? Then the last half you be completely side-swiped. It's such a mind bender in the best, yet craziest way. The execution of all the story lines is pretty great. They were able to tell a few different story lines and point of views without leaving a bunch of questions at the end. I don't believe this is horror genre, though. It's more mystery/thriller. If you're a true crime freak like me, you'll really enjoy this. I would honestly recommend it to anyone who likes true crime."}, {"id": 527, "text": "I was just expecting a decent movie due to the rating being 6 point something stars, but this is actually really great! There's a few shocking moments, lots of creepiness too. You'll be rewinding over things as the last scene plays out. It makes you think about the way you judge or perceive actions and people based on a multitude of things. I haven't watched a movie like this in a long time! I wasn't able to predict what would happen next at all. It kept me on the edge of my seat. Highly recommend!"}, {"id": 528, "text": "Just when you think you have it figured out, you don't. I love movies like this! Very interesting way to weave the and characters all together. And the end - whaaaaat?! I'm still spinning over it. Great film!"}, {"id": 529, "text": "It's not a horror movie at all so walk in knowing that, it's a thriller/ suspense. It started slow yet intriguing, the build up was a bit of a slow burn but the ending and twists were great. Very well written and executed. I expected a lifetime type of movie but was pleasantly surprised. The acting is really good if you can overlook Helen hunt's bad skeletor face job. I'm a horror and thriller buff so I can usually spot the twists a mile away; however, these ones were pretty well hidden and not really foreshadowed to the point of being blatantly obvious."}, {"id": 530, "text": "This was a really great movie. You think it's a horror movie but it's a thriller. Good cast and great directing. Music is eerie too. I love finding movies like this"}, {"id": 531, "text": "I knew nothing about this film before watching it. After watching the movie and then reading some of the reviews, I read that the listed genre was horror, which it is not. It is definitely a thriller and one well worth watching. However, I do wish actors would stop with the plastic surgery and age gracefully...it's very distracting to see."}, {"id": 532, "text": "Still enjoyable thriller that has a twist midway through, and then another toward the end. These were excellent. But, the overall storytelling was lacking. I don't want to be spoon fed material, but at the same time, this movie leaves a few details vague and that ultimately detracts from the overall impact of the film. Oh, and so does Helen Hunt's appearance. She reminded me of Eric Stoltz from Mask. She looked so strange with whatever cosmetic interventions she has had that she drew me out of the film."}, {"id": 533, "text": "Very very strange bizarre movie, but compelling and it seems very disconnected until halfway through anyway. Helen Hunt looks like a cadaver with her face work, like a corpse, she has no lips, is she smiled more she look better. I feel bad for her that she ruined her face, and that takes away from the movie or maybe adds character to it if she was the bad person. Symmetrically setup and the music tones it. This movie made me laugh at times, it seemed so ludicrous. Very disjointed but definitely gets the point across. You have to watch this movie to the very end for it to make sense. Many surprises."}, {"id": 534, "text": "8/10Plot: Jackie Harper is trying to fix her marriage after her affair with her high school sweetheart but her husband and son is not making it easy. To make things worse there is a creepy presence in the house.The poster seemed cool and I thought it would be cool horror film. It is actually a mystery/thriller film, not a horror film.There are three phases in the film. First phase revolves around the Harper family and the little strange occurrences that happens around the house. As the film progresses those strange events become increasingly creepy. There is also the drama centering the unfaithfulness of the wife. First phase takes almost 60 percent of the run time. I loved this phase, I had no idea what was going on, lots of questions were running around in my head. Then comes the second phase which takes a totally different turn in terms of cinematography and the tone of the film. Some hand held shots were used which distracted me from the ambience created by the first phase. This is the weakest phase of the film. Thank god it was the shortest phase as well.The last phase shows lots of details and tries to tie the story lines. I liked most part of this phase as well. The tone of the film shifts here as well.The acting was good by all the actors and music was nice as well. The frog mask is creepy. There were some solid twists which surprised me.As the film has distinct phases and goes from mystery to thriller to action the overall experience diminishes a little. The production value is low and sometimes feels like a low budget TV-movie. There are some inconsistencies in the story.I enjoyed the film. It is a clever film with some genuine surprises in the story. I liked the creepy ambience of the film and also the little dramas between the characters. Short run time also works in the favor of the film."}, {"id": 535, "text": "I wanted a HORROR movie - as it's listed in Amazon Prime; instead, I got a mystery that, for the first 30 minutes, seemed like a ho-hum; so, to keep myself busy, I started a game of Scrabble on my phone.Wow, was I surprised. After the first 30 minutes, the plot quickened and got more interesting. Then the pace just kept getting faster and the tension rose until finally - by the last 30 minutes of the movie - I started getting heart palpitations. Truthfully, I've not been this scared watching a horror movie since The Exorcist - high gives away how long I've watched horror movies! This film damn near scared me TO DEATH! It was very, very good. Helen Hunt was FABULOUS, and the other actors were very good too. There's nothing wrong with Helen Hunt's face, by the way - except just one thing: it's called AGING, folks. Some of us age more than others, and actresses tend to age fast due to hours, booze and less sleep! And I applaud her for not going under the knife like most! Go watch this movie - it's a scary, suspenseful, knuckle-gnawer, and you'll never take for granted that garage door opener again!!!"}, {"id": 536, "text": "Once again it was the trailer that got me all excited for I See You (poster's also cool), somehow I was anticipating a horror movie that'd feel like a hybrid of Blumhouse and A24 (to clarify, the movie's produced by an entirely different studio) - I could smell the potential in the air. Now I've seen it &amp; I'm mostly impressed in unexpected ways, but the more I dwell on it, the more critical thinking starts to point things out.I was wrong though, I See You feels much more like Blumhouse than A24. I See You is particularly interesting and feels fresher because of two reasons, its twisty script structure &amp; the eerie atmosphere, driven by creative cinematography and an original score that does indeed remind me of the horror movies from A24. It'd be hard to speak of the plot, harder than usual, because the story is shaped by two or (arguably) three major twists. Before we get to that, I also want to compliment all the actors for doing a terrific job, although I didn't like one of the key characters/performances much - Alec, portrayed by Owen Teague. I don't know why, it was oddly hard to accept him. As I previously mentioned, major props to the cinematographer, as well as to the composer - top notch design on all levels, both are important driving forces of I See You. Back to the script - it's admirably constructed, highly effortful story with twists that shift the plot greatly. While that seems to be this flicks secret weapon, I also deem it a flaw in the process. The turns, while getting set up, explained and shifted again, take time and pacing suffers a bit at times. That's the least of it though. It feels as if I See You is multiple movies in one and the consequence is that it never finds its real ground. The tricks are effective, but drawn out and helped greatly by movies technical factors and overall tone, basically, some of the tricks in use are cheap in disguise.I See You is more than just enjoyable horror movie with nice touches of crime and family drama genre elements, it's technically and aesthetically amazingly done &amp; is awfully ambitious, playing out lots of elements - a third of them work, a third of them feel questionable and another third of them could've been excluded. My rating: 7/10."}, {"id": 537, "text": "Worth watching, but definitely not a 10 by any stretch of the imagination. I could go as high as a 7 as it depends on one's mood at the time they watch this film. Some may view this as a 3 4 or 5.The writing and direction reminds me of one of the M. Night Shyamalan films. There are some subplots that are not flushed out well. A couple of people pop-up out of nowhere with bit-parts as though the wind blew them on the screen and then they are gone with little to no follow-up. The family dynamic was a bit odd and not flushed out well even when taking the special circumstances associated with the mother into account. I think they would have been better off if they did not include that issue in the family dynamic, which was not written well and was more of a distraction. In doing so they could have focused more on character development and added more substance to the overall plot.Instead, the film seems like a patchwork of people and circumstances as they toss scenes in for a few minutes then jump somewhere else a little too soon for my taste making the audience fill in the gaps. The closest description that comes to mind is Jack of all trades but master of none.The twists and the climax were very cool. I give them points for that. Other than that this is a mediocre film. Gets better in the last 15 minutes. The build up is too disjointed and slow in my opinion. Still, it is worth watching. I may have thought better of this film had it been made for TV, versus a rental. I expect more from movies that charge box-office prices to watch. That said, I have seen much worse films than this.I recommend watching it with the knowledge you have gained in this and other similar reviews. Do not go in thinking you are about to watch an epic film that will make you jump out of your seat. Think of it as a made-for-TV movie with a moderate budget and suburbia setting. The twists make it worth watching."}, {"id": 538, "text": "The acting is atrocious. The mom especially it's horrendousThe story is all over the placeThey put suspence music where there should be none... why would we need some BOM BOMMMM BOMMM BOMMM SUSPENSEEEE music when a simple garage door is opening in an non scary pointless scene. It makes no freaking sense. I swear every scene had some heavy suspense scary music but it's the most pointless things happening.It looks like a TV movie nothing in this screams professional screenplay. The editing as well makes no sense. Dad is at a crime scene in the woods 3 seconds later he's in the garage in his house.People make dumb nonsensical decisions.The villain mask is laughable how non scary it is.Can't believe this get's over a 4/10. What a garbage movie."}, {"id": 539, "text": "Strange occurrences plague small town detective Greg Harper and his family as he investigates the disappearance of a young boy. 'I See You' keeps twisting its story to keep you on the edge, until the shocking ending reveals the Harper family's secrets and a decade old unsolved mystery that will make your jaw drop to the floor.What seems like a peaceful small town at first, actually hides a dark secret of missing children. When a boy goes missing in the woods, detective Harper (Jon Tenney - True Detective) and his partner Spitzky (Gregory Alan Williams - Greenleaf) get put on the case, they discover connections to a similar missing person's report from a decade ago. At home, Harper's family is dealing with their own setbacks, with wife Jackie's (Helen Hunt - Mad About You) infidelity being the main cause of this seemingly perfect family's tribulations. Son Connor (Judah Lewis - The Christmas Chronicles) isn't handling the news very well, and strange things start happening all around the house.More than once we get to see the house as if we're flying over it, or when we slide through the halls of this lavish seaside mansion. Philipp Blaubach's (Gunpowder) stylish cinematography is so smooth, using every location to its full potential, with some interesting angles in the second half of the film. Photos and mugs go missing, the television switches on at random times and duvets get pulled from unaware sleeping inhabitants. With an eerie score, composed by William Arcane, the mood goes from dark to pitch black in nano-seconds to drive up the tension even more.What really works in Adam Randall's (iBoy) newest film is the element of surprise. The film starts of a mystery-suspense thriller hinting at the supernatural, but dives deeper when it flips the film upside down halfway through. First time screenwriter Devon Graye has come up with a clever and well constructed script that leaves breadcrumbs from the very start to hint at events later on in the film. Is Jackie losing her mind? And is the family really in danger?! This doesn't just make 'I See You's mystery fun for the viewer in guessing what exactly causes these bizarre occurrences, but Graye also succeeds by turning the story into some sort of whodunnit, which isn't an easy thing to pull off.As far as acting goes, Hunt is surprisingly under utilized in the film, but is the biggest name to attract an audience into seeing the film. Her character is nuanced, but it definitely would've been nice to explore the guilt that visibly devours her from the inside. Lewis, who plays Hunt's son in the film, is growing into a versatile talented young actor who's getting ready for a huge breakthrough in mainstream media.Nothing is what it seems, but one thing is for sure - 'I See You' is best experienced when you don't know too much about its premise."}, {"id": 540, "text": "It's clear to me that the people who gave this flick high scores either worked on the film or know someone who did. Or, they got paid to leave good reviews.I have loved Helen Hunt's work since childhood when she used to play mean, snobby, little jerks, through all of her adult roles, so I was terribly disappointed to feel like I'd been betrayed by a lifelong friend. I know it's not altogether her fault, if at all. I just found all of the acting to feel detached, uninhabited. Actors acting. Not once did I feel swept up in the story, except perhaps when Libe Barer was in the scene. She was exquisitely believable as a teenage girl thrilled by phrogging. There was no depth to any of the other characters. Is that the actors' faults, or the director's?The only even barely redeeming quality to the movie was a plot twist about halfway through when it was made clear that the character you assumed did the bad thing was revealed to not have done it, when you learn who did. But that is it. All the other potentially interesting story lines were so watered down as to make it a film of barely-there stories, each one separated from the other, brought together in a mishmash concoction that had no grip to it. I was grateful when it was finally over.The long slow shots had me hitting the fast forward button more than once, partly due to the sound design which seemed overwhelmingly creepy on shots that otherwise would just be a suburban house or living room.I'll refrain from expounding very greatly on my disappointment at seeing that Ms Hunt has fallen into the celebrity trap of plastic surgery. There IS beauty in the natural order of things, and I hope one day soon our society will accept women over 40, 50 &amp; up for the exquisite grace that comes with years. Think Katherine Hepburn, Charlotte Rampling, Vanessa Redgrave. It makes me grateful to be of modest means so as to avoid the temptation."}, {"id": 541, "text": "8.8/10 Surprising films like this are exactly why I give lesser known under the radar titles a fair shot. This was released as a VOD not in most theatre's and it's the best thriller of 2019 imo. Judging by the decent trailer I was expecting a watchable thriller/horror and what I got was something completely different in the best way.The film sets up with an intriguing bizarre intro that pulls you in from the start with mystery, filled with crisp camerawork and a fantastic ominous soundtrack that never lets up. You're introduced to the characters and their problems and as things unravel you think you know whats happening until it's the exact opposite with an utterly creative take midway through. As insane events start blending chaotically from every direction, this quickly becomes an absolutely intense and well woven tale of the creepiest and most twisted nature that will hit viewers out of nowhere.Many films try their hand at non linear stories and only few work with such meticulous effectiveness like this film does in such a smooth style. It makes you want to restart the film right after its over and that is a quality that only truly great films posses. This will stick with people for quite some time. Overall it's one of my favorite films of the year and caught me completely off guard. If you enjoy mysterious uncanny thrillers this is a must see. Remember just because it's not a major theatrical release, doesn't mean it doesn't have potential."}, {"id": 542, "text": "This movie had great potential. But, alas, weak character development and plot holes.Positives:+ Very twisty story + Excellent intertwining of two plot lines + Good atmospherics + Great setting, beautiful home on a cliff overlooking Lake Erie + Music that heightens the tension w/o being overbearingNegatives:--What motivates the serial killer? We know almost nothing about this person's motives, psychological state, background. --The marriage itself looks implausible -- major class differences -- despite the explanation. --Incidents within the marriage need more background. Again, WHY? --What's the connection from events of 15 years earlier to the latest missing people? Never explained. --A few plot holes.I rarely say this, but this is one movie that should've been longer by 30 minutes."}, {"id": 543, "text": "Easy watch no frills movieWatch early evening so that you still have time to watch a better movie before bedI was distracted by Helen Hunts terrible face lift. Her face looks really weird like she is in a state of continuous alarmHad to revise this as had only watched 20 minutesIt's now ended all I have to add is that I've.lowered my rating.Awful acting astupid ending. Mask face still walking around like her face has been overstretched, policeman arrives at the house and shoots the first person he sees without announmcent or apprehension, the husband's a child abductor for which you don't really care as you know nothing about him.Rubbish"}, {"id": 544, "text": "First off, I did not watch the trailer for this. I feel trailers give away too much of the movie. I felt for seeing something a bit scary this Sunday night. Me and my buddy opened a bag of Cheese Doodles, a cold Fanta and turned off all the lights.Not knowing what this was about ,I pretty fast felt I figured it all out. And I asked my friend if we should turn it off and watch another movie. But my friend reminded me off the 15-20 minute rule. So we gave it 20 minutes. And I am very glad we did. It got me slowly sucked in, with it's scary music and mystic behavior. It had the element of surprise. A small budget, even smaller than Get Out, witch was fantastic!! So bravo to the production for making so much out of so little. It felt more expensive.After watching it, I felt pleased it was such a good movie. A lot better than I thought at first. It made me surprised and got me thinking. I will recommend this to my friends. It's a little exciting pearl. 7.5/10 from me (Rated it 8 because I feel it deserved that, rather than a 7)"}, {"id": 545, "text": "I See You is a Crime - Drama movie in which we watch a detective trying to find a missing young boy while he and his family starting experiencing some strange events at their house.I liked this movie because it had a simple but very interesting plot with some plot twists that I did not expect and made it even more interesting. The direction which was made by Adam Randall was good and he did an excellent job without using any unnecessary jump scares that could lower the quality of his movie. I also have to admit that I was surprised with the very good interpretation of Helen Hunt who played as Jackie Harper and she was simply amazing. Some other interpretations that have to be mentioned were Owen Teague's who played as Alec, Jon Tenney's who played as Greg Harper and Libe Barer's who played as Mindy. Finally, I have to say that I See You is a nice crime movie and not a horror movie so, if you want to watch a classic horror movie then you should watch another movie and not this one. I recommend this movie because it feels very real and I am sure that you will feel it too, after watching it."}, {"id": 546, "text": "Incredibly unique, thrilling, and with some truly twisted and original storytelling- I See You is certainly an unexpected scary delight that I am glad I had the chance to see (no pun intended). The acting in it is actually very good for a horror film, and though I wouldn't explicitly call it a horror film (more of a thriller), it does have its genuinely frightening moments. Helen Hunt, Owen Teague, and Jon Tenney give some fantastic performances throughout the film, as well as the rest of the supporting cast also giving it their all. The film may seem to completely change about halfway through, as a large majority of that second half can seem very different from the first half, but surprisingly, I See You is not only able to tie its loose ends together, but also brilliantly weave two very different plot lines into one story. Its direction is surprisingly solid, and its script quite brilliant and unique. I have never quite seen a film like I See You or at the very least, a film told the way it was like I See You and I am honestly very impressed at the fact they were able to pull off such a frightening, suspenseful, and interesting thriller with it being so simple. In the end, I See You is definitely an underappreciated indie flick that I encourage anyone to see. It may feel uneven at times, but more often than not, it is a quite interesting, and very well crafted flick that I wouldn't mind watching again. My Rating: 9.5/10"}, {"id": 547, "text": "I See You has a few interlocking narratives throughout. It's as though several subplots connect the film into a whole. While watching the film, I felt some frustration and disappointment because I wanted to see at least one story play out in detail. However, it was satisfying at the end when I understood this was the films intention.The camera work was effective. The music was effective. The acting was solid. Everything that makes a movie a movie was done well and professionally.So that leaves my impression. There was one scene with Helen Hunt at work, which was very short. I wasn't sure it was necessary for the film, except to give her character a bit of depth. In order to do this, I think there needed to be another scene of her at work. Perhaps it was to demonstrate her ambien dependency (if it is a dependency). This storyline here doesn't have much relevance either. There was relational drama between the characters which felt short and abrupt. I wanted this to be explored more.When the film made a dramatic shift in storyline and cinematography about two thirds through the film, I felt a little disappointed because I had to get familiar with new key players. That being said, it was this shift that explained much of the mystery in the first half of the film.Throughout the film, I didn't know who's side I was on. The protagonist and antagonist in this film is not consistent, which is the point. It may have been difficult when writing the script and editing the film to avoid plot holes. Fortunately, I didn't identify any, but there were probably minor discrepancies.I'd say the characters were underdeveloped but the suspense and overall production of this film is well done. Interesting twists. By the end, I definitely wanted more from the film. I wanted more reaction from the characters when all is revealed to everyone. The credits role instead. Bum."}, {"id": 548, "text": "A very moody and gripping thriller that hooks from the get-go and rattles your nerves with a gritty, unnerving score. A young boy goes missing, and the detective assigned the case must deal with it, as well as problems at home. This is a very subtle piece. We're not too sure what is going on at home, but know that the wife (Helen Hunt) has committed a betrayal of some sort. The son hates her, and the father/detective just sneaks about the house and sleeps on the couch. To add to this stress, weird things are happening in the house. Stuff is going missing, amongst other strange occurrences. Is it supernatural? Is it somehow linked to the missing boy? Then we get to the halfway point and the sudden revelation makes things very interesting, and I was reminded of 2017's sleeper-hit horror Hangman (If you've seen that, you may guess what is going on here). Then there is another sudden twist and revelation and things are fired up nicely... but then there is another, at the end, and it just completely sinks the film. Overall, excellent, brooding score, good performances and a strong, uncomfortable atmosphere, which makes this review from me all the more negative because the film ultimately becomes entangled it itself and strikes for a cliched, overdone and predictable pay-off at the end. Unsatisfying."}, {"id": 549, "text": "It starts out great, with an opening plot about young boys being abducted and killed which is reminiscent of The Outsider on HBO. There's also an unrevealed back story that Helen Hunt's character had done something to damage their small family which was creating unbearable tension in the household.The house itself is also sort of a character, with a lot of very Kubrick-esque shots of it's sometimes ominous-looking rooms. So far so good. Then some weird things start happening and you begin to wonder if the house is, yes, haunted.Then it detours into a found-footage second act which at first seems to disrupt the entire flow (it is indeed too long for what it's needed to do) but eventually appears to establish a new villain that would explain a subsequent murder that occurs onscreen and the highly improbable coverup that occurs.It's here when the film then pulls a neat reversal of perspective where you get to rewatch much of what just happened from a different character's perspective, which reveals a huge plot point.It gets an above-average rating for this cool twist and the ultimate reveal of who the villain was, along with the reveal of somebody you thought was a villain but was in fact a victim. The third act salvaged what appeared to be at first a weird insertion of found-footage into act II.So, worth seeing, if not a horror classic. Stay for the ending though. If you bail midway (as I contemplated doing), you'll miss what redeemed the film."}, {"id": 550, "text": "I have just seen the movie, so these are the immediate impressions.Good points: the sound effects and music are really really well done, it hooks you from the start and do not dissapoint throughout the movie;well made story overall;decent ending;no silly/unnecessary jump scares;it does leave you creeped out for a bit (again, credit to the sound producer and crew)Bad points: I feel like they picked Helen Miren mostly because her name adds some weight to the movie, but her character and lines fall flat. In this role you can't see any difference between her and any other lesser known decent actress, there is pretty much no development or relevant back story to her character;The teen actors (except one, and if you watch the movie, you'll know who I'm talking about) aren't bad, yet again flat characters;Close to the end some decisions don't make much sense and feel forced and a bit rushed, also due those decisions the plot twist is given away to easily;the dragged out shoting/fighting scene (way to overused adds nothing thrillery wise;the movie ends a bit abruptly, I sort off see why, but they could have added just 2-3 more scenes with the aftermath.Overall not a bad movie, it sets itself for more expectations then it delivers but it remains decent. Would have been a 5/6 without the soundtrack which adds so much to an otherwise okish script."}, {"id": 551, "text": "A film is lost for me when the following happens: 1. someone says you don't have to do this before he is shot. 2. a woman comes home and the first grip goes to the wine bottle 3. children with asthma. 4. the handle to the pillboxI see you has 3 of these 4 things to offer, starts as a horror movie and develops after about 30 minutes into a revenge thriller. Mindy and Alec are two teenagers phrogging and settling into the Harpers' house. What we learn only at the end is that Alec has a plan, but is initially presented to us as a disturbed young man. What makes the story here completely illogical is that Mindy is the one who lures Alec into this house, but Alec apparently knows where she is leading him. There are some not very plausible situations in this movie, which might make it exciting and surprising for newcomers to the thriller genre. For me it all seemed rather contrived and it also took me quite a while to get used to the mask-like face of Helen Hunt. I may be ill-informed, but did she have a stroke or too many cosmetic procedures?"}, {"id": 552, "text": "I'll be honest, I watched this because it was filmed where I live - you see beautiful Chagrin Falls, Ohio in all the opening shots - and because I love Helen Hunt. It was described in local papers as a horror film during production, but it really isn't a horror movie.I would best describe it as: What is really going on here? Ghosts? Murderer? Serial Killer?Very interesting first half of the movie that involves the manhunt for a missing boy, possibly related to previous cases, and a family in crisis over infidelity. I was beginning to wonder if someone in the family was trying to gaslight another member of the family. But this film does NOT go where you expect. There are a couple of jarring moments that took me a minute to get used to, but they way they tied things up was very good. For once, I really didn't know WHAT was coming next.Not a horror movie. But definitely creepy and weird."}, {"id": 553, "text": "I See You is a solid suspenseful thriller that keeps you engaged from the beginning thanks to its unsettling mood, committed performances, and multiple story threads that keep you engaged with the mystery behind what's going on.The film follows the Harper family consisting of counselor Jackie(Helen Hunt) Detective Greg (Jon Tenney) and son Connor (Judah Lewis) who are dealing with their own personal inner turmoil following Jackie's extramarital affair. Connor is openly angry while Greg is more aloof and this creates engaging and downright uncomfortable interactions that brings adds to the already present tension. Adding to the conflicts is the investigation of a child abductor that Greg is investigating that has eerie similarities to a case from the past. Meanwhile strange occurrences happen within the Harper household that test the already strained family unit.One can't discuss anything beyond the set up because this movie is very much built upon its twists and for the most part they do work. However there are elements that do strain credibility in just how perfectly aligned certain story elements need to be in order for events later in the movie to transpire as they do. Without giving too much away the direction we're shown in the opening is revealed to have been a misdirection and we're instead taken down another direction, and then another, and then another one in the last 15 minutes. Its usage of twists and misdirection do work in the moment, but they do not hold up to much scrutiny after the movie ends.I See You is an effective thriller with an engaging mystery, haunting mood and atmosphere, and committed performances, but it stumbles later in the story due to building itself upon a few too many twists. But because it does keep you engaged I do recommend it."}, {"id": 554, "text": "This movie lives by its many plot twists and by abruptly cutting away from moments that would give too much away. This leaves some of the characters' actions appearing to be a bit dumb in the moment, although they make much more sense when the final plot twist is revealed. It's an original and largely successful bit of storytelling. And if you like a taut and twisty story, it's worth sticking with until the end.The thing this movie most lacks is a character that I was really rooting for. I suppose that the most sympathetic character is the mother, played by Helen Hunt. Unfortunately, she isn't much of a force in the story for most of the the film, and is nowhere to be seen in the climax. She's really more of a viewpoint than a full character.The father, Greg, seems like the world's least suspecting police detective. His wife tells him that all of the silverware has disappeared from their house, he notices that pictures have gone missing from their frames, he's locked in a closet by. . . someone. . . and he's also told that a repairman who came to the house has reported being let in by a well-behaved young woman (when there is no such person living in their household) and his only reaction seems to be, Huh. I guess stuff happens sometimes.As a detective, he did not come across as a credible character. But then, as it turns out, he's got a lot of other things on his mind.I know that a lot of obvious stuff that goes unsaid between our main characters is supposed to be because it's a dysfunctional family where everyone is angry with everyone else, but there's a limit to how far you can push this. These people let an awful lot of very strange stuff just slide.One last, small complaint: Enough with the drone shots, already. I know that it's a great way to make a low-budget movie look like a million bucks, but I'll be glad when the infatuation with this new technology dies down a little."}, {"id": 555, "text": "During an investigation of the disappearance of a local boy, the detective on the case finds disturbances in his home life getting in the way.Interesting movie, but kinda heavy handed. The opening brings us to small town America, and I was just settling in, checking the sound, the camera work, the location, when ... Whoa! What was that? A very odd introduction to a mysterious world that from thereon drips with tension and menace.The music especially is unsettling, even using timpani drums to give a sense of occult malevolence. And then ... a great big switcheroo! The pace had been a bit of a drag up to that point, but the plot puts its skates on to get us to the climax through clever story telling. Is it contrived? I guess, but it is worth piecing the whole thing together in the end.The acting is good, but there is one odd feature others have remarked on: what's happened to Helen Hunt? Her face really does have as much expression as a burn victim, and there's one shot where the cinematographer fully exploits its dead fleshiness while she's sitting in a car. Don't ask me.Overall: heavy thriller, a bit overcomplex."}, {"id": 556, "text": "The script by Devon Graye, whom I knew from his portrayal of the teenage version of serial killing antihero Dexter on the Showtime series, is a Master Class in plot twists and red herrings. When I see a story this good, on a budget of only $3,000,000, it pains me to think of what might have been with a larger budget and yet what they were able to accomplish with the money they had was pretty spectacular.It's not the low rent thriller knock off that it may seem but you have to get through the first act's genre ambiguity (is it a family drama, a thriller or a supernatural horror?) to get the well-worth-the-wait payoff. You might be tempted to give up on it 10 minutes in, given its straight to video feel, but you shouldn't. The Premise: A boy goes missing. He may be the victim of a serial killer who was already captured, a copycat killer, or something more supernatural. As the Lead detective investigates, family drama unfolds inside his homeThe performances, ranging somewhere between acceptable and above satisfactory, contribute to the first half's generic feel and yet, ironically or planned, they give the finale all the more impact. I wouldn't blame the actors though... there's no snappy dialogue, no breakout character scenes, no Oscar worthy monologues; this one is all about the story, the atmosphere, well crafted segments and a script that turns genre cliche's into the best part of the movie.Normally I give separate ratings for script, acting, cinematography, score, etc. but it would be difficult to do that without giving away the inventiveness of this film. So for giggles I'm adding a new category...budget deserved.Script: 9 Budget: 3 (shame on whoever thought this wasn't worth spending some real money) Overall 7.5"}, {"id": 557, "text": "Another week, and hopefully one step closer to a cure but until that day... STREAM TO BIG SCREEN will have to do. Thanks for coming back to get your daily or weekly dose of movie reviews. This week, we are reviewing a psychological crime thriller, I See You. This movie stars the acting veterans Helen Hunt and Jon Tenney as some strange occurrences are popping up in their lives personally, professionally, and physically. We get a look into their lives during an intense few days. So let's get to what there is to watch about I See You.Definitely going into this movie with zero expectations created streaming gold. Now, my wife and I love a good psychological thriller or horror movie, and this only slightly disappointed. By slightly, I mean, this movie takes a little too long to get going and also somehow takes too long to end, even though it's only about 90 minutes. It was a strange fit. I felt myself saying hurry up and get to it; and, then once we were in the meat of it, I found myself saying hurry up and resolve this thing. One could take that as a positive sign. There was a constant state of anxiety in this movie. If that's what Adam Randall was going for, then he succeeded. If this wasn't intentional, then you lucked out, buddy!It was luck in the sense that the storyline is very similar to a lot of movies or even Law &amp; Order: SVU episodes. However, the movie has a pretty good twist that I wish I could say I saw coming but in reality I didn't. I think I must have been distracted by wanting the movie to getting going, and then being engrossed in the thick of the movie, and then, finally, wanting the movie to resolve. In fact, that's the sign of a very good movie. You think you know what's coming and BLAM-O the movie crosses you up like A.I. did Jordan (watch The Last Dance documentary, if you all get a chance).The only unfortunate part of this movie is the forgettable acting. Helen Hunt doesn't shine, and here, she can be quite annoying. Fitz, or Jon Tenney, is just normal - literally nothing to write home about. The only standout performances were probably from Libe Barer and Owen Teague, but, they were also too minimally in the movie and/or a bit annoying during their scenes. Libe was too whiny and cautious for the actions she takes in the movie and Owen, while appropriate in hindsight, seemed too weird for the characters mindset.Nevertheless, I See You is solid addition to the Prime streaming service. The movie provides needed entertainment even with forgettable performances from the cast. The movie presents a familiar storyline with an intense and unique concept twist that keeps the viewer on their toes and full of anxiety. The thriller/suspense fans out there will be pleasantly surprised with this streaming feature. Grab that big box of popcorn and enjoy."}, {"id": 558, "text": "Things are not going well for psychologist Dr. Jackie Harper ( Helen Hunt) and her police detective husband Gary( Jon Tenney) due to the former's marital indiscretion. Jackie is attempting to make amends but is getting nowhere, especially with her angst riddled teenage son Conner(Judah Lewis) who blames her for the current family dynamic. When a local boy goes missing, Detective Harper is assigned lead on the case, adding to his already stressful domestic situation. He and his partner, Detective Spitzky( Gregory Alan Williams) soon realize that this case resembles a child abduction case from fifteen years ago. A case where Spitzky was the arresting officer and is positive they got the right guy. Simultaneously, strange things begin occurring at the Harper residence. Items go missing, televisions and record players turn on by themselves, and other seemingly unexplainable things happen. Each member of the household is aware of the strange goings on but since no one is speaking to the other, the mystery remains unsolved. Are the unusual occurrences at home somehow connected to the missing child case? That is the question, and one I cannot answer without spoiling the movie. The tension is ratcheted up by director Adam Randall by using a creepy minimalist score as well as overhead and point-of-view shots giving the viewer the feeling that the characters are being watched by someone or something. As with any good thriller there are some plot twists and turns along the way. Unfortunately, when the twists are revealed, they raise as many new questions as they answer. The performances by the leads are, at best, fair. Hunt spends most of the movie walking around with her mouth agape in a constant stunned/surprised/horrified expression. Tenney's performance is restrained and may have been better handled by someone with better chops( for some reason Mark Ruffalo comes to mind). The supporting cast, however, is actually quite good and their performances carry the second half of the movie. Overall, it is a solid effort despite several plot holes but would likely be enjoyed by anyone who is a fan of the genre and probably a few who are not."}, {"id": 559, "text": "I See You is a new mystery thriller movie directed by Adam Randall, the director of iBoy and Level Up.In the film, a 10-year-old boy goes missing without a trace. Detective Greg Harper (Jon Tenney) is busy investigating what happened to the missing boy. The only link he knows to make is that this case looks a lot like an equal, unsolved missing case from ten years ago. Greg is too busy with the case, so he has little rest. He didn't get much rest after discovering that his wife Jackie (Helen Hunt) was having a secret affair. For example, there has been a restless atmosphere in their household for some time. Jackie also claims to hear strange noises when she is alone in the house and often loses things. For example, Greg begins to wonder if there is a link between the strange things that are happening in his house and the missing boy, or if Jackie is starting to lose her mind.This movie is promoted a bit wrong with the trailers of the movie, so you expect that there is a more supernatural something behind the story of the movie. The same problem also happened with the film The Village by director M. Night Shyamalan. Another problem with this movie is the script written by Devon Graye. This is only the first film script he has written in which he tries to put all his twists side by side, but he has forgotten to pay close attention to the details of his own script. For example, the revelations of the film happen a bit too precisely at the end, so that they ultimately do not seem really credible anymore.The acting is done well by most of the cast, but due to the somewhat messy script, they do not all come out equally well. This movie is not her best acting for Helen Hunt. Her character also looks a bit confused, so as a viewer you can not always follow what she is doing. The best acting in this movie comes from Gregory Alan Williams, who plays Jon Tenney his police partner. Unfortunately, he only has a small part in this film."}, {"id": 560, "text": "Sheriff Greg Harper is plunged back into a nightmare he hoped had ended for good. The child kidnapper that he had seemingly caught many years ago had returned with a vengeance. But the strangest things happen at home, where he cannot get rid of the feeling that he and his family are being watched. Is there a stranger in the house? And how is it connected to the case he is working on?Sometimes an interesting concept is enough to make a movie stand out. I SEE YOU definitely has an original take on a thriller plot structure, making us wonder what the heck is going on, but the surprises regarding the murder mystery or the identity of the kidnapper are easy to predict. Nevertheless it's a tense little thriller and while it's hard to care for any of the characters, it is an enjoyable ride.On the negative side, Helen Hunt is terribly miscast as the protagonist's wife, and only there to raise the stakes. She doesn't really do anything apart from looking scared, helpless and occasionally bemused.Director Adam Randell (you might have enjoyed his Netflix superhero flick I-Boy) does well when it comes to original ideas, but I SEE YOU is a mixed bag, as it makes too many u-turns and while none of the twists feel out of place, changing direction doesn't help caring for the characters the way we should.Dark, mysterious and devoid of any gratuitous violence I SEE YOU is rather a mystery than a horror movie. It is definitely trying to do something new with a tired serial killer formula and deserves high praise for the effort."}, {"id": 561, "text": "This have bring me to the edge of the seat, my eyes popped out and my hairs where all raising up. The storyline is so good and so eerie that i give you my promise that you can not tell beforehand how it ends.a family ones in happiness until one of the family members make a mistake. Strange things happen in the house, but what are you watching? Is this a ghost story where is the plot going to.The background music will mess up your clear thinking.Helen Hunt plays here roll so good that you don't know anymore if you feel sorry for her or love her.The answer of all this, what have happen in the beginning will be revealed in the very last second. And because of that this movie will never bore you because you think you know what is going on? Really ? well guas again en step in a ride of psychological brain twisters"}, {"id": 562, "text": "This weirdly reminds me of Full Metal Jacket. Not in a sense of quality so much as that one half of the movie is substantially better than the other.The latter portion of this movie is actually per fascinating and I would've loved a movie that actually followed through and maintained that level of intrigue from beginning to end.Unfortunately, the first two thirds of this is an absolute nightmare of disjointed events, underwhelming performances and sloppy technique. Everything is such nonsense at first and it takes to long to really explain anything. By the time the movie actually kicks into gear I'm so annoyed and bored that it's just not good enough.For as much as I didn't enjoy this, I could see some people not having the issues I did. If the beginning doesn't drag you down as fast then the ending doesn't have as much ground to make up. I still wouldn't recommend going out of your way for it, but if you wanna check it out, be prepared for a very slow start."}, {"id": 563, "text": "I'm surprised by the amount of overwhelmingly positive reviews. First let me clarify this : it is not a horror movie at all. It is a thriller/detective movie. If you expect anything Supernatural or horror elements, you will be very disappointed.The writing had some very good ideas. The cast could have been really good. Unfortunately Hunt's face looks quite distracting. It looks like she had a lot of plastic surgery or some Botox injections. It looks so distracting that at some point in the movie it looks like she as some CGI face.Now when it comes to the execution overall there are so many coincidences and times where are the villains should have been caught. But it was just complete plot conveniences. Also the Love Story between Hunt and her lover it brings nothing to the plot at all.I felt there should have been more focus on the father's character or maybe the black cop character and less on Helen."}, {"id": 564, "text": "Ok, so I love a good thriller so when I saw this trending on Netflix I thought I had to give it a go. And as the title suggests it's not bad at all. But the issues I'll illustrate below is what stops it being a 7/10 or higher, real solid movie.Characters were underdeveloped massively. The mother and son in this story served little to no purpose throughout and you forget they even exist after the midway point. The villain aka the person who you find out has been kidnapping these kids, doesn't give you a reason as to why. And yeah, none of the characters are likeable due to the lack of depth on them all.So I think the story is told pretty well on the whole, it's done different and it works. You watch this story unfold from one point of view, then the other. It also has 2 storylines to follow. My only issue with this is that, after the 45 min mark, it basically bins off one of storylines and then comes back to it with 10 mins left. This leaves the ending a little anti-climatic for me. Same for that huge twist. It was just too anti-climatic and lost that emotion.I know I've just slated the film, but on the whole it's well worth watching. I just think the above let's it down from being a really really good thriller."}, {"id": 565, "text": "I was fortunate enough to be brought up on great movies. Well made, well acted. Movies with award-winning photography, acting and stories.But having read some of the glowing review for I see You, I realise there is a generation of movie goers who do not have the same standards as me and others.What is wrong with I see You? Well the fact it only cost $3 million tells you something. Tells you a lot. Tells you they couldn't be bothered to make a decent movie. They went for the hand held shaky camera option which I have to say I hate. I hate it in horror movies and I hate it in thrillers. It's lazy, boring and very irritating.Someone said I had to see I See You, 'it's great'. Oh no it's awful. Badly acted, a boring story but worst of all is there are no proper scenes. We're meant to believe people spend their lives walking around with a camcorder recording everything. You know why they did that, because the director couldn't be bothered to set up the scenes properly. Couldn't be bothered with the lighting, camera angles, etc. Nothing. In fact the lighting in this movie is terrible.I also couldn't finish the movie. It got me so annoyed I stopped watching 45 minutes in.Garbage from start to finish. Cheap and lazy. 1/10."}, {"id": 566, "text": "All-in-all it would have made a better 3-4 part tv series. In that medium, some of the pacing, the resets, and the gaps would've been more acceptable, and it would have left room for more (any) back story on the 'why' of multiple threads that otherwise lead to blunt-impact fact bombs. It did have some twists and reveals that worked, but there was a lot to get through before they happened.So, it starts out right away with a surly, hostile teen. What fun? And, apparently, there is no fury like a husband and son 'scorned.'It only took half the movie to get to the 'intruders' part. The concept seems dumb, i.e., risky and pointless. And who'd bring a restless, sh!t-stirring headcase along, anyway? Is it at all believable that a person who thoroughly disrespects and drugs someone would have any kind feelings for them? Anyway, it didn't seem difficult to guess what the very last reveal was going to be.The reviews for this title are too frequently coming from the cultural cesspool that is prejudice against those who have managed to age, as well as who happen to be female. They even cross into judging her lifestyle, career choices, acting, etc. - all because of her appearance. (How low brow, childish, and pathetic.) If a movie contains bias and prejudice, that's one thing to speak about, but who comes here to hear about other peoples internal mental garbage of that nature? Those Comments Have Zero Value. If anyone looked like worse-for-wear, it was Jon Tenney, and you know how much it matters? IT DOESN'T!!"}, {"id": 567, "text": "Author Devon Graye and Director Adam Randall, have challenged the imagination of movie viewers with this Masterpiece. Authors like Edgar Allen Poe, Steve King, and M. Knight should watch out for this combination, I don't think you can get any more creative than this. I SEE U, is a game-changer. The background of this movie is perfect, in middle America, there is a family of three, a mother, which is a doctor, played by Helen Hunt, whos been out of the movie scene for what seems like a lifetime, but she's back with a VENGEANCE, her husband, Detective Harper, play by Joh Tenney and son Judah Lewis who is a high school student. This family has problems like the average American, like the mother having an affair and begging her husband forgiveness, which changed their family dynamic, causing them to fall apart and lose trust in one another, which sets the stage for one of the most creative films I've seen in a dog's ages. Detective Harper is working on a case in which he believes it's copycat murder/kidnapping from one of detective Spitzky's old cases, played by Gregory Alan Williams, for which the suspect was captured and sent to prison. If you're a Crime, Drama or Thiller fantastic, then I challenge you, to figure out the ending to this film before it ends. I believe this to be the Crime film of the DECADE. With this All-Star cast, I would put this up against any Steve King or M. Knight film. It's a wonder why it didn't make it into the Theaters. I See U, is a must-see, film for everyone that's into these genres. They labeled it as a horror also, but I do understand why they could put it in the horror genre, but I don't do spoilers. This film has more twists and turns then Michael Jacksons' performance at the 1984 Grammy music award show Writer Devon Graye and Director Adam Randall collaborated to make a MASTERPIECE. If you can't rate this movie higher then an eight, then you need to watch it again. I believe this may be the being of something beyond our imagination. I can't wait to see more of there work together, which out M, Knight. This film only won one award, at the Paris International Fantastic Film Festival, and nominated for one at the Cleveland International Film Festival."}], "reviews_amount": 568}