{"name": "Wild Mountain Thyme", "titleId": "tt06842770", "reviews": [{"id": 0, "text": "I really enjoyed this. Maybe it was good timing. Unique dialogue that leaves you following closely. Antoni may have been the main character but Rosemary is our protagonist and she is wonderful. A great love story with great supporting characters."}, {"id": 1, "text": "This movie is just weird. In order to enjoy it just don't take it seriously because it doesn't even take itself seriously. The story is ridiculous and cheesy but enjoyable because weirdly the ridiculousness of it is what makes it fun and entertaining. Emily Blunt is awesome and Jamie Dornan is very good. The cinematography is stunning with amazing sceneries of the Irish landscapes, it made me fall in love with the country. Wild Mountain Thyme is a cute funny stupid movie, if you're in the mood for such films then don't miss it out."}, {"id": 2, "text": "Beautiful scenery/story which crams a lot into this love story. It moves too quickly though scenes. Watching it a second time I have a greater appreciation of these talented actors."}, {"id": 3, "text": "What an extraordinary movie. But probably I say that because I was raised on a farm and people look strange at me when I talk to animals.Great performance not only by the two lead actors, also by daddy, Christopher Walken, he was really good.Gotta see that, blokes, trust me!"}, {"id": 4, "text": "Near miss. Beautiful scenery, interesting story line and great actors... they all gave committed performances despite the fact they would have done better with Irish leads for Walker or Blunt's characters. Writing just took a wrong turn somewhere towards the weird and too-bizarre. Just didn't hit it for me unfortunately, could have been excellent."}, {"id": 5, "text": "A heartwarming romantic comedy that takes place in beautiful Ireland. This movie is star studded with some great actors (Christopher Walken, Jon Hamm, Emily Blunt, and Jamie Dornan). Little dose of meddling parents with a very headstrong hero and heroine and this is romantic gold in my opinion. Several scenes had me chuckling out loud and others had my almost yelling at the hero to get his act together. Over all a great film."}, {"id": 6, "text": "The director said 'this movie isn't for Irish people' and I can see why. Cultural appropriation at it's finest. The accents are the least of the problems. Irish people are often portrayed as backwards, violent, idiots but this really takes the biscuit. Terrible movie, terrible representation of Irish people and disrespectful to the highest level. People wouldn't stand for it if it was any other culture."}, {"id": 7, "text": "Apart from the incredibly awful accents, even from Dornan, and he's Irish...., it's poorly paced and awkwardly directed."}, {"id": 8, "text": "Imagine making this and doing this to the culture of any other colonized country. They shouldnt be allowed get away with this"}, {"id": 9, "text": "Oh my god!!! How the hell did they think Christopher Walkin was a suitable actor to play an Irishman. Don't get me wrong, Christopher Walkin is a brilliant actor but by God what were they thinking with the accent! As a proud Irish person,it puzzles me why they couldn't just pick some of the great Irish actors or at least actors who can do the accent! Plus the fact that it literally makes the biggest stereotypes of Ireland that I have ever seen in a movie, I do NOT recommend this!"}, {"id": 10, "text": "Feels like a fumbled mess, not a good awkward. It was painful to watch such good actors in a dull excruciating film. I was so hopeful, what a disappointment."}, {"id": 11, "text": "In a while the shamrock hits hard and out comes a green emerald looking romantic irish movie, that will, if you have some grace of god and some common sense, will make you laugh and cry either you will or not. its the story about the farmgirl that wants a husband, and the eextremely shy neighbour farmboy who really wants a wife, but thinks he is a honeybee, and asks the donkey if it wants to marry him, because he wont inherit the farm from his dad if he aint getting married..the acting in this film are so romantic, the musical score so soft and like brainglue afterwards, and fills at least me with emphaty, for both of them, the two main caraters are acted so well, and the environment really smell like sheep, horse, and cow... and heather and green grass, and wet stormy lightening weather merely all the time. and christopher walken as the daddydad does some of his finest lines and moves that hes ever done on the silverscreen ,so...this is a must see film if your depressed or lonely or just simply a romantic, cause this will feed your sole with love and honey. its a big recommend from the grumpy old man."}, {"id": 12, "text": "One of the worst movies I've ever watched. I was surprised because some of the actors are fantastic, but it fell flat. Just very odd. Couldn't decide if it was a very odd comedy or just really bad lol."}, {"id": 13, "text": "Such a rare example of a true love. He thinks he is not worthy of that beautiful girl. So keep his distance in order to not to get deeply hurt.Her father supported her by saying how beautiful and unique she is just like a white swan and therefore she will get what ever she wants. That's why she never give up. But his father never supported him in anyway. So he grow in this huge insecurity. Feeling unworthy next to her. Very good script and good acting but more important than that forgetten reality of true love gave this film so touching, heart warming sense. Don't miss it."}, {"id": 14, "text": "Ms. Blunt made this a halfway decent movie because Mr Dornan was terrible in this role. I don't get the deal with him because he is pretty much your every day model looking guy that had one good performance (the fall) but people want to put him in a higher tier. He is not and Emily Blunt did them a favor by being in this movie, Jon Hamm and Emily Blunt had the only chemistry and it was funny at times. Still trying to figure out why Ms. Blunt would take this role when she is top notch. Don't get it so I am guessing Blunt wanted something easy and fun."}, {"id": 15, "text": "We were so excited to see this movie on our date night, and were left perplexed. Most good films have scenes that mean something to the overall plot, but being based on a play there are scenes written in that serve no purpose. Besides the Irish clichés that abound, the main characters behave in ways unlike any person you've ever met- and that's not a good thing. And even though it's plot is being stretched out in order to make it into a full-length film, there are holes in the plot that make you wonder what was left on the cutting room floor. Quirky, uneven, and just bizarre."}, {"id": 16, "text": "The movie is OK and rather beautiful, but that final confrontation between the romantic leads is one of the weirdest things I've ever seen. And not even good weird or cute weird, just really really weird and unbelievable."}, {"id": 17, "text": "This is not a depiction of modern Irish life...was it supposed to be? Who knows! I have no idea what decade this was set in. Where did Emily Blunt get the Irish accent from? It's insulting to Irish women. We have amazing Irish actors...not sure why they couldn't have been used for this movie. The whole movie is just confusing, ridiculously weird and insulting."}, {"id": 18, "text": "Like most plays turned into a movie that I have watched, this was one long, boring movie. Characters with no depth, poorly acted, with just enough of the country side thrown in to make you think it could have a chance. It doesn't. Just say no to this one, move on to something else."}, {"id": 19, "text": "The story was slow but enjoyable. A quiet movie that draws you in with quirky humor and likable characters. We didn't really get hung up on accents but rather enjoyed the beautiful scenery, quirky reluctant suitor and fiery aggressive heroine."}, {"id": 20, "text": "Loved the movie very much!!! Movie is way better than the trailer i must say. Watched it thrice, and will watch again. Can't get my mind off of the main song, humming it all around my house!!!!!!! I don't know what the world of critics in Hollywood were expecting, they are writing like it's a horrible movie but it is not!!! I will suggest watch it first then make your own review:))"}, {"id": 21, "text": "I really wanted to like this movie, but the storyline just didn't flow. The characters didn't have any chemistry and the atmosphere of it didn't feel Irish. There was one touching scene between Walken and Dornan but that was it."}, {"id": 22, "text": "I just finished watching this on Amazon prime and wow. This is definitely one of the best movies of the year. Jon Hamm steals the show as he did in Mad Men. The plot is a little weak but the acting and emotions are top tier. The film will make you laugh and cry. I got choked up a few times because it can be emotionally draining but satisfying. I watched it with my wife and I had to leave the room just to wipe the tears so she wouldn't see me cry. She wasn't a fan of the film because of the accents and pacing. If you're looking for a film that's going to tug your heartstrings and take you on an emotional rollercoaster, this is your film. Please don't let the negative reviews change your mind about watching this beautiful film."}, {"id": 23, "text": "The scenery is good, Emily Blunt is beautiful, and this movie is a romance. It is slow moving - the second half has several nice romantic scenes and the last 5 minutes are delightful. Many dragging moments and boring Irish-stuff.... It passes the time and no one is murdered. You need to like romances to really enjoy it."}, {"id": 24, "text": "Emily Blunt's character is covered in dirt and wearing a wardrobe that looks like it's set during the famine for most of the film. It's an absolute embarrassment to Ireland and a stereotype fueled dumpster fire. Funding an old writers mediocre work because he had a few hits a generation ago is insulting to all up and coming artists, especially to talented Irish writers. The director should issue an apology and resign from the craft."}, {"id": 25, "text": "I may be easy to please but, I watch A LOT of movies and I am really shocked at all the nasty poor reviews this movie got!! It's an absolutely beautiful told love story that will make you laugh and cry! It does require patience but, all good and beautiful things are always worth the wait!"}, {"id": 26, "text": "I don't get the bad reviews. This movie is one of very few movies that made me laugh and chuckle out loud. It's not your typical rom-com movie, it's quirky, and strange in an adorable way. Although at first I thought this movie could have used younger actors, Blunt and Dornan made it work. The Irish scenery is just spectacular, it's in my bucket list of places to see. Just don't overthink this movie, just enjoy the silliness and quirkiness of the ride. You might want to have closed caption on though (I do with all British movies, or those with Irish, Scottish accents). It's a feel good movie, nuff said. We could all use some these days."}, {"id": 27, "text": "The different reviews I have read encouraged me to add my two cents. I found this movie charming. Were the accents accurate? I couldn't tell you. I am not Irish but am aware that there are lots of different accents within the country depending on the area the people come from. I know the scenery was beautiful and made me want to go there on vacation. The people appeared charming not backwards like one reviewer stated. I saw a love story between two people whose beliefs and thought processes are different from mine. Everyone has some crazies. The trick is to find someone who can accept them and if you are lucky learn to love them because they love you. That's what this movie showed me. I admit to having to see it twice which helped my understanding of the gist of some of the conversations because of my being unfamiliar with some of the dialect and or slang. The actors performances to me were very good, believable, and charming."}, {"id": 28, "text": "It's unfortunate to read so many negative reviews from jaded and snobbish people. I felt I had to set the record straight. This was a lighthearted and fun love story set in beautiful, amazing Ireland. All of the main characters are quirky and nuanced, so different from the usual cookie-cutter characters, and simply delightful to watch. All of the actors did an excellent job. My boyfriend and I both enjoyed it completely and gave it a 10. I could watch this movie again and again (and will)!"}, {"id": 29, "text": "The scenery is beautiful, and the leads are really beautiful too. The plot is slightly mystifying though. The dialog is a little strange, as the characters proclaim that 'men should stink' and 'I'm a honey bee'. Overall, I didn't really get into the film."}, {"id": 30, "text": "Well... The title says it all. Most of the Irish hate it because they feel offended by the ridiculous accents of the actors, by the audacity of the director/writer to portray a farmer living in Ireland (because you know in Ireland they're already in the 5th dimension and live in nano-carbon-houses inside a simulation run by a quantum computer on Mars.) Anyway for the normal (non-Irish) viewers the movie will be a gem. It's a beautiful romantic comedy about accepting one's faults and weirdness, about opening up to others, about family, heritage and love. Magnificent soundtrack and score add up the overall picture and cement the title as a must-watch for any self-respecting rom-com addict."}, {"id": 31, "text": "The stupid male lead is such a mess. He builds the stress on viewers/audiance . A story which could have finished on the first scene itself but it has been dragged for one and half hours. I would not recommend this movie at all. A man who couldn't tell the love is been convinced by the woman he loves. Such a stupid male lead. I am becoming angry when I think of the male lead."}, {"id": 32, "text": "I know it's very stupid to write this but Emily accent is what I feel weird. The movie is ok but the British accent is too hard to accept on Emily. Speak the way she used to say is better."}, {"id": 33, "text": "I wasn't expecting to like this film so much but it's just so sweet. Not to mention getting to look at Jamie Dornan for 1.5 hours is pure heaven."}, {"id": 34, "text": "I am shocked in this day and age where cultural sensitivity is a prominent topic that this movie was ever allowed to be made. I see comments here defending it and saying they don't see the problem and in the same breath that they are not Irish. Listen to us; we see the problem, it's big. If you make a story about people and they tell you they find it insulting and your response is only 'it's not for you' (the director) or 'it's just a fairytale' somethings wrong. The cultural appropriation we're talking about is using parts of our culture (the music ect) and play into the stereotypes, have a laugh and then say - I know you're not going to like this movie. It's not for you. We like your culture but we are going to represent it in the way we want. You don't get to tell us how to feel about how our culture is handled in media.We have a sense of humour and love romance - look at our literature and songs. They had great actors to work with. This could have been beautiful. I showed this movie to 90 year old grandmother who live through the Troubles. Her response? - Americans love making eejits (idiots) out of us. I guarantee you; we're not easily offended.On the bright side, there are calls for more money to go into our film industry so people who have respect for our us and our culture can make movies about it."}, {"id": 35, "text": "This movie is an oddly hilariously funny and beautifully odd romcom. It takes comedy, romance and the peculiarities of the specific geographical, cultural and societal ethnocentricities of County Mayo in Northern Ireland and magically transforms them into this beautiful, anxiously mad, romantic story and it works! The performances by Jamie Dornan as the odd and unfortunately misunderstood gentle loving broken soul, Emily Blunt as the wonderfully obsessed, and just as odd, lovelorn female, Christopher Walken as the harshly critical but loving father and Jon Hamm as the practical American that doesn't get the Irish. What a fantastic ride this movie has been!!! Much like Moonstruck, it takes loving someone to a frantically different level and when the characters are finally coupled it produces a sigh on the soul of utter satisfaction and wonder. I totally and wholeheartedly recommend it. My hopes for you are that you will definitely laugh out loud so hard that your belly aches, cry softly and lovingly when expected and at the end you experience a full feeling of satisfaction as I did. This movie was Álainn!(beautiful) And I would be remiss not to say Is tir álainn í Éire! (Ireland is beautiful) So here's to you, Slánche!(Health/Cheers)"}, {"id": 36, "text": "(I've never felt compelled to write a review before, but since I'm from where this is supposedly set, I thought I'd share my take.) Even though we are rolling our eyes at the terrible accents; most people agree that and Irish accent is hard. It's grand - they tried their best.I LOVE a laugh, even if it's self deprecating and am rarely, if ever insulted; the same with the rest of my family. But to be honest; we didn't laugh once during this movie. When we finished watching, the only thing we really felt was disgust and embarrassment. We have done so much to try and get rid of the stereotypes of the idiotic Irish, but movies like this show that Hollywood seem not to care and will go for the cheap joke at the expensive of another culture and people. What was worse is the fact that people who aren't even Irish are telling us that we aren't to be offended. Sorry lads, but you don't get to do that. The director using his Irish ancestry as an excuse, leaves a bad taste in our mouth. Anyway: waste of time, disappointing movie that leans into stereotypes we've tried so long to get rid of. Definitely put a damper on our evening."}, {"id": 37, "text": "Wild Mountain Thyme makes little logistical or temporal sense is not unique or even imperiling for a romantic comedy. It's not just charmless. It is genuinely confounding, a movie constantly working against itself to make its characters and their dilemma comprehensible. Blunt deftly modulates the fiery Irish lass thing with a stirring underpinning of sadness and regret; Dornan surprises with his loopy, awkward vulnerability . Shanley, who won a best screenplay Oscar for Moonstruck, and a Pulitzer and Tony for his 2004 play Doubt: A Parable, has penned a confusingly shallow script that brings the play's emotional thinness and anachronisms into distracting, confounding focus. However, cinematography on location in County Mayo is liable to evoke the nostalgia and parochial familiarity the film strains to create. In other words, it's certainly watchable, even pleasant - if you've an appetite for old-fashioned romantic blarney, the verdant fields of rural Ireland and heaping helpings of contrived quaintness and get past whatever nonsense the characters are saying. They might find something worth their time here. But those eager for entertainment with any kind of edge or cultural authenticity should look elsewhere."}, {"id": 38, "text": "Wild Mountain Thyme (2020 release from Ireland; 102 min.) brings the story of Anthony and Rosemary. As the movie opens, we are introduced to two Irish farming families that live next to each other in County Mayo, with a young boy Anthony in the one family, and a young girl Rosemary in the other family. After a clever montage, young Rosemary morphs into today's Emily Blunt. As it happens, they have just buried Rosemary's father. But there is trouble in the other family too, as Anthony's dad is planning on gifting the farm to an American nephew, given Anthony's supposed dislike for farming. Meanwhile Rosemary is hoping to turn the lifelong friendship with Anthony into more... What's holding Anthony up? At this point we are 10 min. into the movie but to tell you more of the plot would spoil your viewing experience, you'll just have to see for yourself how it all plays out.Couple of comments: this is the latest from writer-director John Patrick Shanley (Doubt, Joe Versus the Volcano), adapting hiw own stageplay for the big screen. On paper, it all looks like a smash in the making: the stars seemd to be alligned perfectly. But in reality this turned out to be a snoozefest of mega-proportions. IMDb bills this as a drama, romance. Let me tell you right now that there isn't one iota of drama in this film, none whatsoever, yes there is some romance, and some lame attempts at comedy. Then you look at the all-star cast: Emily Blunt tries the best with the weak material she's given (and confirms once again what a fabulous singer she is, as she also showed in Mary Poppins Returns), Christopher Walken is horribly miscast as Anthony's dad (where in the world did he find that non-Irish accent?), Jon Hamm fares better as the American nephew, but in the end one can only surmise as to the collossal waste of talent in this movie, starting at the very top and all the way down. From a visual perspective, the film's photography almost feels like a commercial for Come Visit Ireland. In fact the very first words spoken in the movie are Welcome to Ireland! (by a character's voice-over). That, and of course watching Emily Blunt do her thing, are the minor saving graces for the film, but that's it.Wild Mountain Thyme opened in select theaters one week ago. The early Friday evening screening where I saw this at today turned out to be a private screening: I was literally the only person in the theater, and the theater complex as a whole resembled a ghost town. I honestly don't know how movie theaters can operate profitably under the current circimstances (a raging COVID-19 pandemic, and very few worthwhile new movies playing). Meanwhile, if you have any interest in Ireland or are simply a fan of Emily Blunt, I'd suggest you check this out, be it in the theater, on VOD, or eventually on DVD/Blu-ray, and draw your own conclusion."}, {"id": 39, "text": "Greetings again from the darkness. While I have Irish ancestors, the uproar of the Irish press over the accents in the film is a bit puzzling to me. Any frequent movie watcher can tell you that cinema history is filled with actors giving difficult accents their best shot - and the results have ranged from 'spot' on to 'not even close', and everything in between. As a Texan, I can vouch for the sometimes cringe-inducing 'not close' efforts, but I've never judged a film by such trivial matters. Why do I start with this? Only to get it out of the way in order to have a more meaningful discussion of the latest film from writer-director John Patrick Shanley (DOUBT, 2008, and an Oscar winner for the MOONSTRUCK screenplay, 1987). It's based on his 2014 Broadway play, Outside Mullingar.After the breathtaking shots of the Irish countryside over the opening credits, we learn of two neighboring farms belong to the Muldoons and the Reillys. Rosemary Muldoon (Emily Blunt) and Anthony Reilly (Jamie Dornan) have known each other their entire lives, and it's been assumed by locals that they would someday marry each other. Their elderly parents are dying off, yet what prevents the relationship from deepening beyond Good morning to ya' is Anthony's bizarrely awkward social skills compounded by his constant bickering with his father (Christopher Walken), and his belief in a family curse. The two men still mourn the passing of Anthony's mother, and Rosemary has her own sadness to deal with ... while growing a bit antsy waiting for Anthony to come around.Anthony's father is concerned that the family name is in danger of ending, due to his reticence to marry. Because of this, dad decides to give the family farm to another relative. The fun kicks off when Adam (Jon Hamm) arrives. Adam is the stereotypical Yank - arrogant and showy, with only a romantic notion of what being an Irish farmer means. If that's not bad enough news for Anthony, Adam also sets his sights on Rosemary and convinces her to visit him. He can't imagine how the excitement of New York City contrasted with daily life in Ireland won't win her over.We don't actually see any real farming in the movie, and Anthony's sullen act gets a bit tiresome, but the message is conveyed well by Ms. Blunt and Mr. Dornan. Filmmaker Shanley has delivered more of a romantic drama than romantic comedy, but there are humorous moments included, not the least of which being Anthony's practice proposal to a donkey. Ms. Blunt proves again what a fine actor she is, and her sequence inside her home in the final act is terrific. As for the accents, Mr. Dornan's holds up the best, while Mr. Walken's downright comical, but the story and characters are what we remember when this one ends ... unless, of course, you are part of the Irish media. In theaters and On Demand November 11, 2020"}], "reviews_amount": 40}