{"name": "The Personal History of David Copperfield", "titleId": "tt06439020", "reviews": [{"id": 0, "text": "I'm sure the all-star cast had a fabulous time making this, and Ben Whishaw was outstanding as Uriah Heep, but overall the film was just tedious. At no stage were you emotionally engaged with a single one of the characters, and many of the attempted jokes fell flat. It came across as a self-indulgent (but beautifully shot) film where all the fun was had by the cast in the making and the end result was dull and self-congratulatory."}, {"id": 1, "text": "I am not quite sure how he managed to do it, but Director Armando Iannucci has succeeded in turning a classic story, with an excellent cast, into an incredibly dull movie.Save your hard earned money and see something else."}, {"id": 2, "text": "So have never read this book, saw the movie with an open mind, remember movies will never be as good as the book, is a fact. That said, go see it, give it a try, modern casting and all.Did notice the casting right away, but I just let it be, and I like it. Patel is a really good actor, like him in this. The acting is good, and did get the point the director was trying to make and do, something modern with a classic story.Don't get the people that are offended, there are plenty of adaptations of this book, so is a good thing to see something fresh, and different.It actually made me laugh, yes the story has bad moments, but is told in a different manner.And as of late, with everything that is going on, we are watching more and more movies, and in the sea of bad movies (talking to you netflix), this one for me, is good."}, {"id": 3, "text": "Weird, ridiculous. I didn't recognise the Dickens' story apart from the inclusion of some of the characters. Three stars for the actors and their characterisations; none for the script or story. It's supposed to be a comedy but there was no laughter in the cinema in fact some people walked out half way through. I was tempted but thought it must get better; it didn't!"}, {"id": 4, "text": "I watched this with 200+ other people. I was looking forward to it immensely. I stayed to the end though, only because I was blocked in by my neighbours... honestly this film is pointless. Little story progression, pantomime acting, sub- Month Python comedy characters and voices. If you want to pay £10 to watch Horrible Histories do The Fast Show, with cardboard cut out backdrops - you will adore this. No spoiler but - Please somebody explain why shouting 'no donkeys' to passers by is funny, worst film I have seen and biggest disappointment for a long long time"}, {"id": 5, "text": "There's a lot of negative reviews about this movie - mainly due to casting of NON-white (black, Asian, Indian) actors in critical roles. If you check the review data though, you'll see that about 75% of total reviews are between 6 and 10 stars. I loved the movie, could have been a little shorter, but that's more about me liking short movies. Wonderful character acting, whimsical story telling. Don't miss this movie!"}, {"id": 6, "text": "So. Try and say something positive. Brilliant costumes. Great acting. That is it. What a dull boring film. A real waste of time going to see this."}, {"id": 7, "text": "I don't know why so many people have been so negative about this film. I set up this account specifically to give my two pence to this vibrant rendition!Giving such a dark story humour was admittedly a controversial move, but it paid off in my opinion. Every role in the film resonates with character, and the eccentricity balances the drama well.My favourite part was the passionate, progressive score by Christopher Willis. Go listen to The Pages Must Show. Now!"}, {"id": 8, "text": "The set up for this film appears, on the face of it, quite promising. However, there is too much 'wrong' in the execution of it that the final product fails on all fronts. Is it a spoof? A comedy? Historical reconstruction? Ten minutes in and you won't care, you just know you're in for some dull stuff that isn't bad enough for you to walk out. Besides, you want to see what your rated actors are going to do with this lemon. Not a lot as it turns out. If only this enterprise had been taken the next step, that is, turned into a proper pantomime, then we would have laughed, appreciated the pratfalls, slapstick and other tricks that fall flat in straight film making. TV trash. Nothing more."}, {"id": 9, "text": "One of Dickens greatest comedy-dramas cheapened into a ridiculous slapstic comedy with an unrealistic PC cast that makes no sense in Victorian England. Barely any dialogue or reference to the book. Only serves to make the 1999 TV version even more loved. Almost as bad as last year's Christmas Carol travesty shown on the BBC. Will Dickens ever get respect deserved again on the big screen? Hopefully won't be too long until this story is told properly."}, {"id": 10, "text": "This is a fun and enjoyable movie. The weird comments by people who can't comprehend a non-white cast are baffling. If you can't enjoy a film because of the colour of actor's skin, that's your problem, not the film's."}, {"id": 11, "text": "I'm not Armando Iannucci's biggest fan so saw this at the Opening Gala of the London Film Festival with some trepidation. Unfortunately, I wasn't pleasantly surprised. Dev Patel does bring some charm to the proceedings, but the attempts at comedy in this retelling of Dickens' classic just don't work for me at all. Ben Whishaw and Tilda Swinton appear to be fish out of water and whilst it is good to see Hugh Laurie back on the big screen it all comes across as a bit of a hotch-potch of ideas and aspirations. The book's original questioning of Victorian values around child exploitation and of more general social attitudes seem to have been largely sidelined, robbing the story of much of it's heart and soul. It is also quite unnecessarily lengthy at just shy of two hours. As you'd expect, it is a good film to look at, featuring some very picturesque East Anglian villages that probably haven't changed anything like as much as this story from the days of Charles Dickens himself."}, {"id": 12, "text": "In book David is sent away to school by his stepfather at 8. His mother dies when he is 9 and he is sent to work in a bottle factory.This version 30 year old Dev Patel is supposed to be playing child David at bottle factory. And child David fleeing bottle factory to find his great aunt.And teen David at new school.SHEESH.They couldn't afford to pay an older child actor and teen?What was really absurd was other actors really were children and teens.Dev looked like their dad."}, {"id": 13, "text": "As an avid Dickens reader, and watcher of both film, and TV adaptations going back almost 60 years, I have a strong familiarity with, and affinity for, his works. I am aware that opinions vary and taste is very much an individual thing. Leaving the cinema today, a couple I spoke to were of mixed opinions and felt it was too long. They liked 1917, I did not - opinion is very personal. I loved it, found it extremely funny at points and got the essence of the book in a most accessible way. I must also admit to loving Dickensian, and  A Christmas Carol more recently and this felt to be very much in the same vein. More like this please."}, {"id": 14, "text": "This film is really engaging, has a lot of memorable characters and is just a lot of fun from beginning to end."}, {"id": 15, "text": "It made my heart full. I found David Copperfield (Dev Patel) to be incredibly moving and I love the way every character is treated with some measure of compassion. It was also brilliant to see Peter Capaldi and Hugh Laurie on a screen again. It made me want to read the book."}, {"id": 16, "text": "Despite the negative reviews I found this a really wonderful retelling of Dickens novel. Having listened to fantastic audiobook version by Martin Jarvis I was looking forward to this but worried about the poor reviews. In fact the movie captures the wonderful characters and emotions of Dickens novel. Obviously some things are omitted but overall this is a satisfying and engaging and artful rendition of a wonderful novel."}, {"id": 17, "text": "A travesty of Dickens. The darker side was edited out. Why? Did it have to be sanitised for the sensibilities of the modern audience? Or was it done to get the PG rating to make more money at the box office? Scenes jumped about without much context or explanation. The reason for the casting was lost on me. Peter Cipaldi played it like a poor man's Bob Hoskins. In fact I believe he was trying to impersonate him. Overall a boring film."}, {"id": 18, "text": "This is a very frivolous film lacking any depth of characters and story lines. Dickens was amazing who really understood people but what we have here is two hours of boring frivolous film. I was so looking forward to it, having just watched the amazing Dickensian series on Netflix. I was so disappointed and I think Dickens would be too."}, {"id": 19, "text": "It's rare to find a film that my 16 year old son and husband and I all enjoy. I enjoyed it greatly, my husband and son watched to the end, which is always a good sign. Quirky, comic and colourful. The end is a tad twee but feel good!"}, {"id": 20, "text": "Caught this at TIFF. One had a managed set of expectations beforehand given the schmaltz in Dicken's feel-good novel with black and white morality in its characters. There are fun lines, but the loud music at all times is a bit too much. Half way through the movie you start wishing it'll get to its crowd-pleasing end. It takes another hour to get there. Characters are predictable platitudes. Hugh Laurie looks genuinely bored in his underused waste of time. Watch the 1999 show with Maggie Smith instead."}, {"id": 21, "text": "Dev Patel is Funny, Dickens is brilliant but they just don't go together, ridiculous concept."}, {"id": 22, "text": "Very confusing cast and unfunny. Waste of talent. The only modern take this movie boasted was the 50% black actors in mixed marriages and in position of power. It was very distracting and pointless since it was presented as a period peace."}, {"id": 23, "text": "When watching this movie I became painfully aware of how woke they tried to make the characters and cast ... if your going to make a period piece at least try to make the casting authentic ... the wokeness is just slammed in your face from the get go!!! I don't mind Dev Patel being lead but why you have to make all the main cast filled with minorities... it's like Hamilton without the cheer and rap... it's painful and pulls me out of the Victorian London setting every minute! Also the whole cast seems to be on crack - characters blurt our lines, characters are intense and absurd and everyone seems to be quite mad... was that Victorian England?! I felt like I watched a school production"}, {"id": 24, "text": "An excellent funny romp, especially if you don't get too hung up on changes from the original novel. What is very disappointing are the complaints about the casting and that they are somehow incongruous to the 19th Century. This seems an increasing trend with complaints about 1917 getting a lot of coverage as well. People who are unable to accept that this is not meant to be a documentary on child exploitation in Victorian England and are offended by seeing non-white faces in movies frankly don't deserve to have a good time."}, {"id": 25, "text": "Love Dickens. Love Dev Patel. Like most of the actors, and actresses in the movie. This.... However was an... Utter waist of source material. / Miss casting. / (Comedy... really?) And talent / money, that should have been poured into a project. That would have reaped the rewards, and accolades, it could have earned.."}, {"id": 26, "text": "You can't recreate a story about Africa with white actors and you can't tell a Dickens tale with an Asian lead.He's a talented actor but it just doesn't work; has no believability.Yes I'm from a minority ethnic background (not that it should make a difference)."}, {"id": 27, "text": "Nothing worse than turning a classic of English literature into cheap comedy..."}, {"id": 28, "text": "Really enjoyable Sunday night viewing. The film felt dreamy and this worked well with the narrator recounting the memories of his life whilst writing and showing us how life itself the sole source for writing. The whole thing had a bit of a Wes Anderson feel but this may have been because Tilda Swinton was in the film and the characters were very eccentric! Definitely give it a go!"}, {"id": 29, "text": "This is just awful. There are no positives. Don't waste your time."}, {"id": 30, "text": "This was a whistle stop tour of the story of David Copperfield however , its a great cast , despite those reviews which seem agast at the casting choices, the fact remains that good actors can be cast in any role regardless. Its got heart this movie and leaves you feeling in a good place. No it wont win oscars , not its not perfect , but since theres no such thing enjoy it for what it is"}, {"id": 31, "text": "An utter triumph from Armando Ianucci and this wonderful cast. So many laugh-out-loud moments and brilliantly portrayed characters. This was for me a heart-warming and absolutely delightful film; I have a feeling I will be singing its praises for weeks."}, {"id": 32, "text": "A very dynamic film, David Copperfield lures you into his intriguing life stories. Unfortunately I haven't read the original but could still appreciate the flair and narrative of the film. This would have been a treat for those who are familiar with Dickens's work. This eventful and fluid manner of story telling nicely transitions into this film. Some decent performances by Dev Patel and the rest of the cast. It was also a pleasantly diverse film that modernised this classic novel. This may not appeal to a large mainstream audience as some cultural sensitivity is needed to see something in this film. I'm glad I went and enjoyed this modern spin on a classic tale."}, {"id": 33, "text": "Some profoundly eccentric characters but the performances seemed a little forced and the connection you need to carry them over the line was missing for the most part."}, {"id": 34, "text": "Really disappointed with this. Not sure what the theme was here, but definitely had no relevance to the novel.Don't know why people try to misrepresent what is a classic, well loved story already."}, {"id": 35, "text": "The Personal History of David Copperfield is an incredibly unique period drama that's well paced, consistently funny and stylish. Dev Patel gives an incredible lead performance. Ben Whishaw, Tilda Swinton, Hugh Laurie, Benedict Wong and Peter Capaldi are all great in their supporting roles. Armando Iannucci's direction is excellent resulting in plenty of visually inventive moments throughout. The music by Christopher Willis is amazing. However, it's not as emotional as it could have been in certain places but it still comes to an extremely satisfying conclusion."}, {"id": 36, "text": "The Personal History of David Copperfield is the brand new film by Armando Iannucci. It is superb! I expected it to be a not-so-good comedy, with poor acting and a storyline which doesn't quite work, when in reality it is a brilliant film. There is once scene of bloood, in which blood is spread around a man's body. All we can really see is stains, but you can see it for a mere 4 minutes. Swearing is not a problem if that is what you are worried about, as childish insults are used instead of full blown swearing, the very opposite of Armando Iannucci's The Thick of It. In one scene, it is implied that a man has beat a boy. This is very shocking. 9/10."}, {"id": 37, "text": "Outstanding acting, brilliant casting. Dev Patel is fantastic as are the rest of the cast. The characters leapt off the pages of the book into life for this film. It was an entertaining and thoughtful adaptation of the book. Something for everyone in this. Ignore the 1star reviews from thos who are so bothered by the colour of an actor's skin that they could not enjoy a beautiful film."}, {"id": 38, "text": "What an excellent idea. Cast actors you feel are right for the part. Difficult to condense such a large story into a couple of hours so some ideas and storylines have to fall by the wayside. Use this as a springboard to go and read the book!"}, {"id": 39, "text": "Moving the story into fantasyland did not work for me. Sorry."}, {"id": 40, "text": "Dickens can be painful to watch as directors ramp up the darker aspects. This felt like it wasn't directed so much as conducted like a major English symphony.I thought it was a terrific, open, expansive and utterly beautiful film. Some shots were living paintings.Great casting and great deal of humour yet still showing the dark side of Dickens.My teens were highly entertained by it too, which is no mean feat for a Dickens film."}, {"id": 41, "text": "What a simply beautiful film. Amazing acting and casting. Lovely way of telling the story. Funny. Moving. I think it's a must see. Thank goodness for rainy Saturday afternoons And quirky cinemas, otherwise I might have missed this gorgeous piece of cinema."}, {"id": 42, "text": "This is such a beautifully written film I can honestly find no fault. A definite must see!"}, {"id": 43, "text": "I need to say this film has been inundated with extremely low scores considering the quality of this film. Most of the complaints make mention to terrible casting - which is to say a lot of people are unhappy an ethnically diverse cast are playing characters that shouldn't technically be ethnically diverse. From my experience watching the film, the casting was great and the colour of peoples skin didn't have any impact on the film. It is not at all meant to be a historically accurate film, everything about it is hyper-real, cartoonish or turned up to 11. All I would say is ignore the haters, if you are a fan of Armando Iannucci you will probably enjoy it."}, {"id": 44, "text": "A great cast puts a wonderful spin on David Copperifeld I found Hugh Laurie especially wonderful in his role but the film was wonderfully heartwarming somehow without having any specific memorable wow moments. Overall an enjoyable film."}, {"id": 45, "text": "My wife urged me to go with her to see this but I wasn't keen as I've never really liked traditional Dickens dramas. What a great surprise to find this was not traditional Dickens, but a supremely well written reimagining of the story. Tremendous acting from all involved, very funny and very moving at times. I thoroughly enjoyed.it. I don't get the poor reviews, those reviewers must have little sense of imagination or fun. Try it, I think you will be a pleasantly surprised as I was."}, {"id": 46, "text": "I sat through the whole film with a huge grin on my face.The director really has chosen the perfect cast for this film but extra special mention to Dev Patel (I could listen to his voice forever) and Hugh Laurie.Just so funny and so imaginative. I've never seen a period film like it and I can't wait to watch it again.Do not be put off by the low user reviews. They have issues, not this film. It's utterly joyous!"}, {"id": 47, "text": "What a funny, lovely wicked movie. A dream off a cast and a joy of acting. I think they had a lot of fun at the set, you see it it in every frame of the movie. The set, the stage wonderful setup a a camera who catch it all. A pur romantic score frame perfectly the movie. Overall the crew and the cast present a fin and entertaining movie.But it is interesting to read the comment on IMDB that many of the English have a problem wit the main actor. Why? He is not blond, blue eye and white. But the Charakter are perfect cast. As young boy and adult. Personally I like his acting since I saw him in Newroom. Pev Patel."}, {"id": 48, "text": "In a world of CGI and special effects it's nice to see a book brought to life in such a fashion. The cast is superb, the acting perfect and it flows like dickens would have wanted. It's a must watch."}, {"id": 49, "text": "Simply put, its hard to see how anyone could spend two hours without a mile wide grin on their face here. Full of whimsy but with real heart and soul, Dev Patel is fantastic."}, {"id": 50, "text": "I hadn't read the book, which probably helped. I liked the quirky way the story was told."}, {"id": 51, "text": "Looked like this was going to be great however it is simply awful, the line up of actors would have led you to believe that this would be awesome... sadly that was not the case, as others had said this was supposed to be a comedy, I can tell you there were very few laughs in the cinema we visited. As for the story, do not expect it to run along the same lines as the original. it is a million miles away from the original... sadly it was a total waste of money, ours and the production companies.. :("}, {"id": 52, "text": "I love dev patel as an actor and I love Dickens, however, when I watch a movie, I like to feel as though I can believe what I see on the screen and I just find it absolutely ridiculous to cast actors who quite blatantly would not have looked that way at the time. I walked out of teh showing as it makes no sense for a period piece set in the early 2th century in london and especially as Dickens wrote David Copperfiled as a semi-autobiographical work. The BBC do this all the time and it really ruins the enjoyment for me."}, {"id": 53, "text": "Great ensemble cast; I mean with Hugh Laurie and Tilda Swinton you really can't go wrong. Dev Patel embodies the title character with genuine yearning and determination. It's incredibly funny, filled with wit and charm. An entirely different version than the dark foreboding England we're used to seeing in Dickensian tales. The only people who wouldn't fancy this production would most likely be reacting to its multiethnic casting. Instead of the same old status quo, we get a multitude of actors who know their craft well to our benefit. There's bravery in that."}, {"id": 54, "text": "Stunning! A Visual and Literal Masterpiece! I MUST view this on the bluray DVD and I never buy dvds anymore."}, {"id": 55, "text": "Really enjoyed it. Great performance from the actors with good casting. Staging, costume and scenery excellent. Very funny.The production is a bit unusual; I think the idea was to follow Copperfield's life as he (as the author) is writing it; with some of his edits included. Felt like it was made for the theatre and then transferred to the cinema with the scene changing instructions left in. There's even one instance where a character is moved to a different scene by a giant hand; for a moment I thought the story had broken into Gulliver's Travels. This doesn't break the story thread but it did break some of my emotional involvement with the characters.I liked, 'I don't fit. Write me out.'"}, {"id": 56, "text": "Comedy drama based on classic Charles Dickens's characters.Narrated by the adult version of David Copperfield, follows his life from birth, we see how he's taken from his mother at a young age, later put into child labour, eventually educated, finding work, and consequently finding wealth, and further wealth as a writer.A great cast, but many black actors take traditionally white roles incl. David Copperfield himself, although I found myself quickly forgetting about this anomaly. He meets a variety of remarkable characters along his life journey, he takes brief notes and later writes his novels about them famously.This movie could so easily transfer to a very successful stage play."}, {"id": 57, "text": "They might have a heart-attack at seeing a Black Romeo with White parents or an Asian Dr. Frankenstein.Honestly, do people really not grasp the concept of Blind Casting? Can they really not appreciate a film if Victorian England in a FILM doesn't have an all White cast? Seriously people, broaden your horizons just a little bit.Coming to the film, I adored it. The cast are having so much fun and play their roles superbly. Special mentions for Tilda Swinton, Hugh Laurie, Ben Wishaw and, of course, Dev Patel. I will admit, I'm no Dickens fan so I really can't comment on the film's loyalty to the novel, but as a Drama/Comedy film it was fantastic."}, {"id": 58, "text": "TPHODC is a delightful film and much better than I thought it would be. If you can get past the not accurate to the book, there is seriously a lot to like here.Everyone is really good here. Dev Patel delivers his best performance. Capaldi, Laurie and Swinton are really great here however the whimsical style of the performances and of the film don't always work.Like all the works of Iannucci, the comedy is hit or miss. Sometimes the comedy is funny. Other times it feels more awkward. It is a seriously entertaining film with a lot of charm. Dev Patel was a great choice for Copperfield. The film is also unnecessarily too long. About 20 minutes to long. The film struggles at times because of that in terms of pacing. It is worth checking this film out. It isn't always perfect and the film similar to The Death of Stalin, has a style which doesn't always work for the kind of film it is."}, {"id": 59, "text": "I loved this film! The pace was whip fast as there is so much to fit in from the source material but they chose wisely and edited which kept the pace fast but still with enough characterisation to get you caring about the characters.I loved the colours, camera angles, music and slightly dreamlike direction. It reminded me at times of Terry Gilliam films. There was that richness and abundance of detail.The acting was astonishing across the board but Dev Patel stood out and he has me spellbound. He so perfectly captured the emotionally bruised and deeply romantic nature of Copperfield. Wishaw was also perfectly cast and was the ultimate Heep.It's not a perfect film but it made my heart soar and I forgot about he present world we live in as I stepped into the fairytale rendition of David Copperfield."}, {"id": 60, "text": "A massive and brilliant cast bring a lively script to the big screen with great humour, cinematography and top notch performances. Great to see veteran Irish actress Rosaleen in a wonderful cameo. Great supporting turns from among others Peter Capaldi and Bronagh Gallagher but it's Hugh Laurie who steals the show. If you want a movie to brighten up these winter days and evenings, this is it. Guaranteed to leave the cinema with a smile on your face."}, {"id": 61, "text": "And a triumph of Political Correctness over Historical Correctness. Which would be OK if only it wasn't so tedious.Stay away."}, {"id": 62, "text": "Saw this recently at a screening. Not sure if it's the final film that will be screened in May but too late now to change the casting of Dev Patel. I'm sure the filmmakers cast him purposely. He is an okay actor but he's not David Copperfield. David Copperfield was white as with his parents. The makers have obviously looked at the book again and seen there was an Indian connection with David's aunt Betsy, in that her husband who was much younger than her, had visited India and rode an elephant there. Had he visited China I'm sure there would've had a Chinese David Copperfield. The comedy is farcical and stupid."}, {"id": 63, "text": "I've never read the book (or indeed any of Dickens' works) and enjoyed this movie. It moves along well for a story with so many characters. Slightly jarring to see such a colourful cast in 19th Century England, and the comedy is a bit hit and miss, but all the actors do a good job. Definitely worth seeing."}, {"id": 64, "text": "I won't do a long review as there's enough of those already. Instead I'll just say that it utterly filler me with joy. Just watch and let the fantastical whimsical world flow over you."}, {"id": 65, "text": "Many people may have been expecting a movie which follows a familiar formula and therefore do not understand the success this movie had in representing dickens' writing and this story. Brilliantly casted and great combination of humour and drama"}, {"id": 66, "text": "A delight to watch from start to finish. This is an inventive, joyous film that breathes newness and freshness into what could have been another staid costume drama. The costumes and set colours are brilliant and the both the lush outdoor scenes and and the squalor of the cities give a great sense of the wildness of life that is at the heart of Dickens' storytelling. It's a really new way of Telling this kind of story in British film and I'm really sad I didn't get to see it on the big screen, where I'm sure it was amazing. The script is great - and the inclusion and reverence ofDickens' language is very well done. My favourite scene is the kite scene with David and Mr Dick - beautifully written and shot, accompanied by a beautiful score. I watched it with a smile from start to finish. Highly recommended."}, {"id": 67, "text": "Enjoyable romp. Likeable characters delivered by great actors. Nice pace. A bit of a Wes Anderson feel."}, {"id": 68, "text": "The Personal History of David Copperfield is a delightful retelling of the Charles Dicken's story of the riches to rags and back again of one of Dickens most enduring characters. Armando Ianucci (Death of Stalin, The Thick of It) has written and directed and there are wonderful performances from a stellar cast. Dev Patel is charming as David and Ben Wishaw is sickenly obsequious as Uriah Heep with Hugh Laurie and Peter Capaldi also really good. I could keep naming people in what can only be described as a gorgeously colour blind cast."}, {"id": 69, "text": "The Personal History Of David Copperfield is a joyous celebration of life filled with both funny moments and touching ones. . In this comedy-drama based on Charles Dickens' classic semi-autobiographical novel, a young orphan named David Copperfield, navigates a chaotic world to find his elusive place within it. . A great film overall that really reminded me of the adventure films I grew up with. Dev Patel (of Slumdog Millionaire fame) delivers a charismatic and uplifting performance, while Hugh Laurie ultimately steals every scene he's in. Writer/director Armando Ianucci has put aside his political views to create a new vision of a classic novel - and it works! Never boring and always fun, The Personal History Of David Copperfield is sure to keep your spirits high throughout. . Follow @snobmedia for all reviews!"}, {"id": 70, "text": "I've not read the Dickens novel, and had no idea about the plot and zero expectations watching this movie.Pleasantly surprised, though it's not for everyone. The humour may not work for all but I found it quirky and had several laugh out loud moments. Each character you meet gets stranger and stranger!The casting was very good, Ben Whishaw stood out for me among Tilda Swinton; and Dev Patel and the young version of him were also great.Give it a go, it may suprise you."}, {"id": 71, "text": "Adaptations always have changes. Colourblind casting was one of the changes this adaptation had. Some people didn't like it. They didn't watch it colourblind. I really enjoyed it, because every character had their quirks and collectively brought joy to the screen. It was aesthetically beautiful and just the sort of easy watch one wants. I thought the casting was spot on accurate. Especially Dev Patel and Hugh Laurie. Would totally recommend as a children's intro for Dickens."}, {"id": 72, "text": "The film indeed has unusual casting, from the sense of black mother's bearing white children for example, but I feel that this is done as an example of what if picking an actor that can best represent a character based on their mannerisms and acting skills rather than best racial fit. Of course things were different in the late 19th Century, people of colour did not hold such positions. This film challenges us to look past such things and I feel that it works.The film itself is good if you can look past the obvious diversions from reality, after all it is a book and a movie and can be interpreted as anyone wishes, the plot is, well a rags to riches and that of hardship faced by the lower classes, with all focus on that of the class system rather than that of race. This again works for showing what maybe the biggest inequality facing modern society. There is some treachery and some laughs. Their are interesting uses of the projection of images as characters discuss prior events that lead them to be where they are and it is visually pleasing. The acting is strong throughout, with a great leading cast of actors / actress.Although I did find the film to be long, I wasn't as bored as lost as I have been watching a film of that length in the past. You can imagine how I am in a three hour film, I have to take a four hour break.All in all, it's worth the watch and I feel that the negative reviews focus a lot more on the casting and maybe a lack of understanding in this decision. I don't know why it was cast as such, I am merely speculating, I rarely ever leave a written review, but for some reason felt that it was my time to chip in. Grab some crisps, dip and a drink and give it a watch."}, {"id": 73, "text": "I'm not a Dickens devotee so quite happy to see a retelling of this tale which was lively and funny but without losing the awfulness of Victorian poverty. Some wonderful and subtle performances from Ben Wishaw, Tilda Swinton and Hugh Laurie in particular. Lovely to look at too. Worth seeing at the cinema as will lose something on smaller screen"}, {"id": 74, "text": "I haven't been so angry after a cinema experience since i saw The Hottie ans The Nottie, and that was better than this utter piece af movie shambles. If you love the original story or any of Charles Dickens stories, do yourself a favor an avoid this at all costs. Imagine a Dickens story, half costume drama where the only thing left in the story to remind you of the original is the names David Copperfield and Uriah Heep filmed with shaky cam, filled with humorless bad jokes. What's even worse is pathetic actor instructions and the fact that the story is as dull as dishwater. What an awful movie, and a disgrace to the memory of the great Charles Dickens."}, {"id": 75, "text": "Too many liberties taken with the original dickens. A pretty awful pantomime version of a great story."}, {"id": 76, "text": "I like writing reviews of films but all I can say about this is........oh dear! So much effort for so little outcome."}, {"id": 77, "text": "Have to say I'm not impressed with this version very badly acted poor casting have to this has ruined a brilliant story"}, {"id": 78, "text": "I found this version of David Copperfield a bit silly, disjointed, and pretentious. Wish I had saved my money and waited to watch after out on Nextflix. Save your ticket money."}, {"id": 79, "text": "I've not read any Dickens since school but maybe that's a good thing since must of those frothing (like badgers?) about this movie seem upset about the movie's straying from the original book. But that's like moaning about West Side Story because it's not faithful to Shakey's original, no?There's plenty to enjoy here and we certainly did so ignore the naysayers and dive in.Oh, and anyone who questions the casting needs a kick in the nads"}, {"id": 80, "text": "What a load of total total total rubbish Bad acting Bad writing Bad bad Worst movie I've seen in YEARS"}, {"id": 81, "text": "I have read most of the reviews... and yes might be true that you can not engage into each of the characters, due to lack of character development. However, I need to say that overall the movie was delightful. The costumes, accents, acting, scenography, and those beautiful shots; of HE dreaming about the past and how the future is tangling with the PAST, ist just beautifulThose are the areas of the movie that made me feel amuse, sad, happy, intrigue. But why do I call it ... very FUTURISTIC&gt;.. well mainly because the cast portraits what I believe futuristic movies will be about... An exceptional storytelling, acting and scenography... so...again about what cinema means.. Like back in the 20s ... black and white... where nobody knew what race, religion, backstories.. etc.. the actors and directors were. I do not say it is historically accurate.. or that all movies should follow this example, but I would say, .... it does bring a new breeze to the cinema."}, {"id": 82, "text": "Funny, beautiful, heartwarming, clever. I logged into IMDb to create this review. I've not done for any other film.This film will make you more intelligent, more loving and more happy."}, {"id": 83, "text": "I loved this film. It was effervescent, lively and uplifting. Why some people are complaining about it is beyond me. The acting was inspired, it being an ensemble cast it is difficult to pick any one person out, but Dev Patel was just perfect for the role. He has the right amount of pathos and humour for the part. The sets were great, colour abounding! What a great change for a Dickensian vibe. I get so damnably bored with the so-called gritty filming we often get these days. Colour has been around for centuries. I loved that so many characters were woven into the script, I'm not a huge Dickens fan, but even I picked up on them. Talking about that, the script was imaginatively brought to life. Please, let Iannucci do loads more of these adaptations. I loved it, loved it, loved it!"}, {"id": 84, "text": "Brilliant cast and really funny movie. Watch it, it is great"}, {"id": 85, "text": "Dev Patel stars in the ultimate riches to rags to riches to rags to riches tale with any singing and dancing. The tale is slightly altered and made multiracial. The heaviness of the Dickens' critique of society gives way to a lighter story as the characters jump off the page and come to life with wonderful performances."}, {"id": 86, "text": "I'm not sure what all the haters are about.. this is a modern version of this story and it still retains its charm! Acting is excellent... charming and funny. Really fantastic film.."}, {"id": 87, "text": "That's what I like to hear....nothingDelightfully quirky and gorgeously shot, The Personal History of David Copperfield puts a fresh spin on the age-old classic with its blistering script and phenomenal ensemble. It's impressive how Iannucci has managed to elegantly condense this sprawling masterpiece into a charming two-hour package. Dickens would be proud."}, {"id": 88, "text": "I've noticed some bad reviews of this film, which caused me to register and help balance things up. This was a great film, one of the best I have ever seen at the cinema. A great evening to remember. Some great scenes and very well made. I especially liked the globe of the world scene involving Mr. Wickfield played by Benedict Wong, very funny. The film takes you through an incredible journey of his life involving many twists and turns, up and downs, determination through strife and hardship. Definitely worth seeing."}, {"id": 89, "text": "There are quite a few very low scores for this version of David Copperfield on here, many of them by people who have probably never seen the film. However the haters are wrong on this one, and the colour blind casting, which seems to have led to so many of these reviews, was incredibly refreshing. Great source material of course, but told in a new way, which I thoroughly enjoyed."}, {"id": 90, "text": "I went to see this film in the basis of a positive review. Unfortunately, what I discovered was a movie that had no relevance to the scenario is was claiming to depict. Most of the actors and actresses were miscast and the storyline was a shambles. All in all it looked like someone had initiated a brain fart interpretation of something that didn't seem to understand. Very disappointing I'm afraaid."}, {"id": 91, "text": "Very enjoyable take on Charles Dickens' classic novel. Clever direction, great performances (especially from Dev Patel &amp; Hugh Laurie) &amp; a very funny script, as you'd expect from an Armando Iannucci film. At the time of writing this film currently has 5.8 on IMDB. Totally unfair. Most of the negative reviews seem to be for entirely the wrong reasons &amp; that's a real shame. Like it wouldn't matter how good the film, the direction &amp; acting was, it would never win those haters over because minds were probably made up as soon as they'd decided that the casting didn't match their very strange ideas of who should play who &amp; why. Nothing lower than a 7 is a fair rating for this film."}, {"id": 92, "text": "David CopperfieldCharles Dickens would be twisting in his grave at this homunculus of an interpretation of his great masterpiece. It is quite unfathomable, what we're they thinking, seemingly, the script written by a team of snowflake millennial metropolitan liberal bourgeois and aimed at the same narrow audience.The story was butchered the characters unrecognisable the acting had more ham than Sainsbury's, I really struggle to find anything to commend in this movie.I don't propose to address the racial rinsing that is colourblind casting as this is a political element left for others to judge and just ticks another metropolitan anxiety. What next a black man playing Queen Victoria, yes that works...lol"}, {"id": 93, "text": "Superb interpretation. So many enjoyable performances - Dev Patel, Peter Capaldi, Ben Wishaw, Tilda Swinton but the whole cast delivers. Has prompted me to go back and read the book!"}, {"id": 94, "text": "The only reason it even gets 2 stars is the quality of the acting, the story however is dreadful, it's not funny and was a huge disappointment"}, {"id": 95, "text": "A mostly straightforward telling of Dicken's story but with a multicultural cast. Although the story of rags to riches to rags to riches is quite remarkable, this presentation wasn't really anything special, although the reproduction of Dickensian London was well done. Good acting and emphasizing the eccentricities of each of the characters brought some humour to the film, but it didn't really stand out."}, {"id": 96, "text": "The writing is dpot on, perfect timing for the comedy snd for the tragedy. From the opening scene to the end. The cast ell play their parts so well, drawing you into the story and making you feel part of what's going on. The movie is shot so well, giving you a glimpse of victorian splendour and deprivation."}, {"id": 97, "text": "Don't waste your time with this one because beneath the deliberate woke provocation to get you talking about the movie there is actually no style or substance to it. It's an awful depiction of one of Dickens most autobiographical pieces of work it lacks any sense of the intrigue of the original work and is instead a slapstick parody of what it could have been. The woke masses will pop up and praise this as stunning and brave of course but not because it's actually a good movie."}, {"id": 98, "text": "A very jolly meta romp, with all manner of fourth wall breaking, wordplay and silliness - which hides the brutality and hardship of much that flies by."}, {"id": 99, "text": "The film begins with plenty of quips and old fashioned British humour. Slightly reminded me of The Grand Budapest Hotel in its manner and humour. This film does not deserve anything near what some of the reviews are giving. Clearly many turned up expecting it to be a raucous, laugh out loud comedy which was never promised. What it does do is stick to Dickensian values and humour throughout. My main gripe is that the balance of the film seems a little off. The beginning and middle parts cross over nicely, however there is a good 30 minutes of rather dull dialogue without the stories moving along very much. The ending then all comes at once, whilst entertaining it compromises the storytelling values from the beginning of the film, perhaps to cram it into the two hour window. Overall I predominantly enjoyed the script and the performances from the small ensemble of fine actors who were clearly enjoying their whacky roles."}, {"id": 100, "text": "Let's start with the good bits....visually superb. Everything else was just poor. Don't bother!"}, {"id": 101, "text": "Pandering at its worst in trying to be woke, only serves the self-righteous. Good acting all around can't save this stinker."}, {"id": 102, "text": "There is a time and a place for casting people for parts, it's seems to have got out of control just to please people rather than stick to the historical truth incase that offends. It's getting beyond silly now"}, {"id": 103, "text": "Comedically and dramatically inert and hampered by a PG certificate, Armando Ianucci's '...David Copperfield' is a baffling misfire from a man responsible for some of the funniest comedy in recent times.Ironically, it is also his most visually inventive movie to date, but the subject matter is completely at odds with the choices made. At some points the movie reminded me of Roger Avary's 'Killing Zoe' and it's use of (at the time, new and original) tilt lenses.Acting wise there are few highlights but Nikki Amuka-Bird, Ben Wishaw and Benedict Wong shine in what little time they're given.Add to that MDF set design and what you're left with is a dull mess.."}, {"id": 104, "text": "As many have mentioned, this film is marked by crazy casting with people of colour having Anglo children, and in fact making up around twenty percent of people in Dickensian England. This is never explained or remarked upon on the film.Aside from this, the film is overly long and dreadfully boring."}, {"id": 105, "text": "I watched Mark Kermode giving his verdict on this movie on BBC News The Film Review last night, he and news presenter Jane Hill agreed to was wonderful, I was really looking forward to it, based on the book by Charles Dickens, directed by Armando Iannucci (I'm Alan Partridge, The Thick of It, In the Loop, Veep, The Death of Stalin). Basically, the story follows the life of David Copperfield (Dev Patel) from childhood to maturity. David was born in Blunderstone, Suffolk, England, six months after the death of his father. David had a relatively happy childhood, then called Davy, with his loving, childish mother and their kindly housekeeper, Clara Peggotty (This Country's Daisy May Cooper). When he is seven years old his mother marries Edward Murdstone (Darren Boyd). To get him out of the way, David is sent to lodge with Peggotty's family in Yarmouth. Her brother, fisherman Mr Peggotty (Paul Whitehouse), lives in a house built in an upturned boat on the beach, with his adopted relatives Emily (Aimée Kelly) and Ham (Anthony Welsh), and an elderly widow, Mrs Gummidge (Rosaleen Linehan). They call him Master Copperfield. David returns home, but dislike his stepfather, who is highly strict, and has similar feelings toward Murdstone's sister Jane (Game of Thrones' Gwendoline Christie), who moves into the house. The lives of David and his poor mother are made miserable. David is forced to be sent to Salem House, a boarding school, under the ruthless headmaster Mr Creakle (Victor McGuire). David falls behind on his studies, Murdstone attempts to discipline him, to which David bites his hand. Following this, he is sent away to work for a wine merchant in London, owned by Murdstone. Whilst there, he makes the acquaintance of Mr. Micawber (Peter Capaldi), a sneaky but good-hearted man who does everything he can to get away from debt collectors and bailiffs. David is initially shunned by his fellow workers, but his good nature grows on them as he grows up during his time at the merchant. Then David is told that his mother, who was pregnant and gave birth to a baby boy, has died, as well as the baby. With no-one to look after him, he runs away and travels to find his only known remaining relative, his eccentric and kind-hearted great-aunt Betsey Trotwood (Tilda Swinton). She had come to Blunderstone at his birth but departed in annoyance upon learning that he was not a girl. However, she takes pity on him and agrees to raise him, despite Murdstone's attempt to regain custody of David. David's great-aunt renames him Trotwood Copperfield and addresses him as Trot, one of several names David is called. David's aunt sends him to a better school than the last he attended. Whilst there, David forms a friendship with equally eccentric Mr. Dick (Hugh Laurie), who obsesses about the beheading of Charles I. David helps Mr. Dick help his obsession to float away by attaching all his papers to the tail of a kite. During term, David lodges with the lawyer Mr Wickfield (Benedict Wong), and his daughter Agnes (Rosalind Eleazar), who becomes David's friend and confidante. Wickfield's clerk, the devious Uriah Heep (Ben Whishaw), also lives at the house. David meets the beautiful and silly Dora Spenlow (Morfydd Clark), who has a habit of speaking to her pet dog. Heep gains complete ascendancy over the alcoholic Wickfield and manipulating David along the way. But the fraudulent behaviour of Heep, aided by Micawber, who has been as a secretary, is revealed. David later marries Dora, but tragedy strikes later when she dies following a miscarriage. After Dora's death, Agnes encourages David to return to normal life and his profession of writing. As everything concludes, and he reunites with many of the characters from previous encounters, David chronicles his life in a personal history novel. Also starring Aneurin Barnard as James Steerforth, Sophie McShera as Mrs. Crupp, Bronagh Gallagher as Mrs. Micawber and Anna Maxwell Martin as Mrs. Strong. This is a colour-blind version, casting actors (regardless of race) who are perfect for the roles. Patel gives a splendid performance as the thoroughly loveable and resilient protagonist, and there are fantastic supporting performances, especially Laurie, Swinton, Capaldi and many others. This Victorian era movie is way away from Iannucci's usual cynical or political stuff, the period detail and colourful costumes are splendid, it is an interesting and quirky journey, and the ensemble cast really do create loveable characters, one of the best Dickensian adaptations, a charming, feel-good and wonderful period comedy-drama. It is nominated the BAFTA for Best Casting. Very good!"}, {"id": 106, "text": "What a dreadful movie, well at least the half that I saw. I honestly can't think of any redeeming features. Some people have said the acting, but I honestly thought there was a serious amount of over-acting going on, and then there was some just plain weird acting. The cinematography was good, but even that didn't suck you in a transport you into the movie. I just ended up watching it to try and figure out what wasn't right, and in the end there was just so much that I left. It is honestly, one of the worst movies I have ever seen in a movie theatre. Yes, I've had worse DVDs and Netflix movies, but this one cost me £12.50 - what a waste."}, {"id": 107, "text": "This movie is so bad we left in the middle of it. The director is trying to force nonsensical casting choices to push a goofy PC agenda and it's a huge distraction which ruins the story. They've butchered a classic work of literature. Yuck."}, {"id": 108, "text": "No offence to Dev Patel, but why are audiences asked to be colour blind with casting now? Whilst it makes sense in contemporary work, to have the best person for the job, It makes no sense in well known, classic period pieces. Was annoying to watch"}, {"id": 109, "text": "I really wanted to like this but it just doesn't make it easy. Let's start with the good bits. 1. It has some excellent actors in it.Now on to the bad bits. 1. It's just so far removed from the novel , it's hard to see the logic of the rewrite. 2. You may be surprised as I was that the 1850's was just so multi cultural that it just ruins anything that is historic and removes the credibility. 3. It's just not as funny as it wants to be, it tries to be quirky and funny but is completely unsuccessful at both. There are at least 16 million better things to watch or if you really want to experience Dickens , pick one of the classic Dickens productions Like Great Expectations."}, {"id": 110, "text": "The story is all over the place. The historically inaccurate casting confuses me, and I don't understand who is who. I don't understand it at all."}, {"id": 111, "text": "Golly, this movie is hard to watch. I love Dev Patel but he seems sooo uncomfortable it's painful. I recall David Copperfield as being thoroughly engrossing. This movie was not that. As a side note, I applaud all the diversity in the casting but it honestly got confusing trying to understand who was related to whom. Like England was some great melting pot in 1840. Tilda Swinton was fun to watch."}, {"id": 112, "text": "A watchable retelling with a good cast. However, the vast majority of the film's highlights were in the (oft repeated) trailer. Worth a watch but not one of the year's best, unfortunately."}, {"id": 113, "text": "Firstly, I have never read the book so have no idea if this is a faithful adaptation or not. Let's deal with the drunken elephant in the room - the colour free casting is only a distraction in the fact that it's historically inaccurate but this is a fiction so that's not at all important and to leave 1 star reviews just for that reason is ridiculous. I judge this only a a movie and it was watchable with some nice comedy moments but was generally disjointed and seemed to rush to a conclusion. There are some great actors on display but barring Dev Patel and Hugh Laurie they are either under played or too cartoonish. It seems that woke, PC reviewers leave 9 and 10 star reviews just because of the diverse casting and this is as myopic as the 1 star haters. It's a 5 or 6 star movie at best. I am a big fan of The Death of Stalin which is much more dark and also funnier and I think Copperfield would have been a better movie if Armando Iannuci had written it in a similar way. Overall a bit underwhelming but it passed a couple of hours on a Tuesday night"}, {"id": 114, "text": "I personally thought the movie was very good, the visuals were stunning and I had a fun time watching the story unravel. I had never heard of the David Copperfield story before so maybe that enhanced my experience. The only criticism I have of this movie is that the cast is obviously trying too hard to be racially inclusive, but it's minor in the grand scheme of things."}, {"id": 115, "text": "The year is still short of a month old and already I personally have seen two 'classics' tampered with. The first, Little Women merely played with time jumping back and forth at will but doing no real harm for those who knew the linear story. David Copperfield is something else; as in the case of Little Women I had not read the book but I was eventually able to make sense of it and at least the principal cast - the four March sisters were portrayed as Alcott wrote them, white anglo saxon Protestants rather than Innuit fruit farmers or Clydeside shipbuilders in a misguided effort to be 'woke' or whatever. Had Mr. Dickens written his novel at anytime during the last fifty years then it would indeed rightly reflect the multi-cultural/ethnic society in which we live but the novel dates from the 1800s and it's yet another example of a 'creator' deluding himself that he is a better writer than the original author (this is more common than you might suppose; see the recent remake of Terence Rattigan's The Deep Blue Sea, a risible rewrite by a writer not fit to change Rattigan's typewriter ribbon). As I mentioned I have not read the original novel and thus had no idea where it was set - early scenes had characters in what appeared to be endless countryside one minute and then obviously at the seaside before moving to London. On the other hand some viewers appear to have enjoyed it."}, {"id": 116, "text": "Bizzare and confusing. It was a struggle to get through this. Lost interest has a dozen times and started checking Facebook on my phone. I have no idea what this movie was about. I only liked how it ended..."}, {"id": 117, "text": "The saddest thing about this film is that some of the characters that could have been funny and loveable came across as tedious and a bit annoying. It was very hard to get any empathy towards any of them.The film tried to be something different and, although ok in places, it was mostly tiresome and just missed the target on a few levels.It is ok and maybe some people will enjoy it but it just wasn't for me and I was a let down given the great story and the excellent cast."}, {"id": 118, "text": "I really liked this film and I was especially impressed with Dev Patel, he made a wonderful lead, and the supporting cast was uniformly good. Unfortunately, I did read David Copperfield years ago and I think there was more dramatic bite in the tale, this adaptation focused more on the eccentric characters and their interplay. That would perhaps be its major flaw, unless they set out to be more upbeat; if that is the case they succeeded, but then you would have to judge it as being somewhat lightweight. The actors clearly had a blast with this movie. I really loved Peter Capaldi and Naomie Harris, they lent some gravitas to the proceedings. I think Patel has a big future, he looks multi talented."}, {"id": 119, "text": "Let's take a movie set in 1800s India, replace the main Indian characters with white people and black people and tell me how it goes over."}, {"id": 120, "text": "My wife and I were looking forward to watching this. We were both highly disappointed. Instead of using the classic story they attempt to produce a circus show. No time spent on development of the characters which is a key part of any Dickens. So much was bad but to highlight the worst, David was portrayed as an idiot, Mr Micawber was a lousy attempt at a cockney accent with his famous quotation left out or lost in an abuse of extraneous sound. Not worth writing any more it is so bad."}, {"id": 121, "text": "This is an abominable movie that wasted talent and money on a piece of PC crap. I don't understand how this movie got a 6.5 on IMDB, as most commentators where less then impressed. This has nothing to do with the original Copperfield and Charles DIckens would turn around in his grave having seen his work destroyed and mutilated this way."}, {"id": 122, "text": "Truncated, disjointed, yet somehow boring, screenplay. I struggled with ignoring reality (the color blind casting) because the actors are so accomplished but then, what a contradiction at the end! (Spoiler) David and Agnes' children were cast racially-appropriate so the audience would be sure to know whose children they were! Eyeroll."}, {"id": 123, "text": "Chose to watch this after finding the trailer amusing. Once I got used to the colourblind casting appreciated the characterisations, especially Dev Patel and Hugh Laurie. Colourful, whimsical adaptation of a classic story to enjoy at least once."}, {"id": 124, "text": "Oh boy boy!!! Be realistic this remake is full of nonsense... yet extremely, uniquely and extraordinarily boring piece of 1hour and 59 minutes."}, {"id": 125, "text": "It looks amazing. Big names in the cast. How do I manage to hate them all? It's as if the film makers took all the government money had a jolly old time making it and then taking it around the festival circuit. And then we the public had to sit through it. I loved the book as a child. I usually love all the actors in this film but not in this. This is trash. Posh preachy rubbish that I'd be willing to look past the social justice message if it was any good. But it isn't."}, {"id": 126, "text": "When I went in I thought it would be run-of-the-mill, but i now understand all the things the movie wants to show us are just beyond joyous. The film indeed gave me a very different feeling. Hope is a dangerous thing and is the root of mental distress, but David never gave up trying despite the universe working against him seemingly. Hugh Laurie is a great actor and the script does not have too many throw-away lines. The story could be 200 years old and the film is still fresh. Watch it."}, {"id": 127, "text": "I found the movie to be entertaining to watch! I found myself laughing out loud and wanting to know what happened next. It did feel rushed at times, but still a good movie. The actors were wonderful! I just got so lost with the characters. Maybe adoption was a big thing back then? The casting was just very confusing to me. You could not keep up with who was related to who. Yes, it's a movie, but come on, let's keep it believable. That's what completely lost me."}, {"id": 128, "text": "Funny, feel-good movie with great cast and brilliant script."}, {"id": 129, "text": "A feel good story that everyone needs right now. Loved every minute of it."}, {"id": 130, "text": "If you are looking for a fun, escapist romp which marries wit, absurdity and heart you could do a lot worse than this."}, {"id": 131, "text": "Rather agreeable more Sunday afternoon than Friday night but all the same."}, {"id": 132, "text": "Fun and interesting re-imagining of DC. Quite enjoyable. Don't get hung up on the fact it's not a traditional, straightforward rendering of the book."}, {"id": 133, "text": "I loved this version of David Copperfield. It pays homage to Dicken's use of over exaggerated characterization and the questioning of societal roles and boundaries. I am of mixed race and generally view movies through a habitual lens inscribed in my mind since childhood. This movie made me question that lens of perception. It made me believe through the lens of compassion and empathy that all is entirely possible and even rather fun."}, {"id": 134, "text": "Dev Patel as David Copperfield in a new adaptation of the Classic Charles Dickens Novel. Remember AUTHORS Playing Card game ? Made me think of, This is a really Flashy Film. Lots of action and characters. Patel narrates his life as Copperfield based on Dickens real life experiences. I wish I had done a little research about the Story before I saw the Movie, so gonna watch again now that I have refreshed my memory. Benedict Wong from (The Martian) plays Mr Wickford who always finds the Vino 🍷 You'll also get a Kick of Hugh Laurie from (House) as Mr Dick. Sadly, I was only person in the theatre."}, {"id": 135, "text": "Great actors like tilda swinton peter capaldi hugh laurie couldnt save this piece a crap.the script and dialogue are terrible and the casting ugh! makes it all the more unbelievable.woke color blind casting has absolutely no business messing with a 19th century classic.save your money dont support this historically inaccurate garbage!"}, {"id": 136, "text": "We walked out! Only the second time in 50 years of film going t do this. It was just abysmal. Not funny, not always well acted, not evocative of the novel. In fact it ...what...???I've just had a double whisky so feeling a bit better, no wonder Mr Wickfield drank!"}, {"id": 137, "text": "So all this is actually doing is trying to make money based on it has some link to the brilliant author Charles Dickens, well dickens did write David Copperfield. End of link. So some characters dont exist at all, one of which is hugely important and if you are a fan will make no sense whatsoever. Then of course is the casting, pathetic woke culture/diversity etc, when will the production companies understand this is merely bowing to a minority and alienating the majority. And if some say this is the way forward then when will we see an all white or diverse cast of the novels such as The Color Purple or Roots, it wont happen. If it was a standalone picture it would probably get 5 stars but as it is trying to gain profit based on Dickens work it should be marked accordingly. Stop messing with classics or write something original. Box office doesnt lie."}, {"id": 138, "text": "The trailer is edited to appear a laugh a minute film. The trailer contains all the best bits edited in a far nicer way. Some of the cast have good performances however the direction and writing is lacking."}, {"id": 139, "text": "They used blind casting which makes it impossible to make sense of any scenes. Black lady with Asian husband with sparkling white preppy son. Makes no sense no matter how you approach it. The whole thing is messy. Takes you away from the story as most of the time you are trying to figure out who is who and why. Ridiculous. Exhausting to watch. Not worth it."}, {"id": 140, "text": "Made a shallow comic book farce of one of my favourite novels and why the BAME cast; what were they trying to prove?"}, {"id": 141, "text": "This is a disgusting film. I tried to watch it, but it is so dull and stupid that eventually, after about 20 minutes, I decided not to suffer through it. I checked some parts in the middle and closer to the end of the film - it is just as blunt. There is not a single thing in this film, that could justify spending your time on watching it."}, {"id": 142, "text": "I'm a big David Copperfield fan but this movie is awful and I very nearly walked out. Terrible casting, unless you're woke of course."}, {"id": 143, "text": "Whether you like this new version of David Copperfield could depend on your view of colour-blind casting. Some (possibly white) purists would object to the casting of non-white actors in white roles. Others (like me) welcome it, since it helps me deal with a welter of characters - both Copperfields are copper-coloured, and the Black girl is the daughter of the Asian lawyer, etc.To keep the film relatively short, some plot lines and characters from the original novel were removed, and some characters were combined. There were certain missing spots in the story that I did not like. David went from age 4-7 to Dev Patel working in the bottle factory, and how did David earned a living in the days after his aunt's bankruptcy - being an unknown writer doesn't cut it.Maybe I am movie-starved after the pandemic lockdown, but I did enjoy this film."}, {"id": 144, "text": "Armando Iannucci's own take on the Dickens epic rags to riches to rags to riches story sees Dev Patel wander through his fraught life, saved by a wild cornucopia of eccentric characters at every turn.A considerable change of style for Iannucci after Into the Loop and The Death of Stalin with a much gentler, heart warming, but often very funny life story held together by a spot on performance from Dev Patel - what star quality and presence this guy has developed. He is supported throughout by many wonderful actors often hilariously bringing Dickens' characters to life - notably Swinton, Capaldi and a wonderful Laurian turn from Hugh Laurie himself.Possibly a little rushed in places, where Iannucci flies on to the next set when a pause may occasionally have helped certain moving scenes sink in a bit more, but overall a triumph."}, {"id": 145, "text": "The epic tale of David Copperfield written by Charles Dickens has been sullied by this peculiar travesty of a 'tribute'. These outstanding actors were pick due to their ethnicity rather than their suitability for the parts they played. The director gave no thought to the story but merely looked for plaudits based on political correctness and inclusion. Watch the original and marvel at the writers brilliance - watch this tripe and you will feel like you're in a parallel universe."}, {"id": 146, "text": "I can cope with the fact that they have slaughtered a Charles Dickens novel, I can even cope with the fact that it's as boring as watching paint dry but one thing I cannot live with is the colour blind casting. Yes, there should be more people of colour in film, yes there should be more gender diversity but when you make a Dickensian film based in the period then at least try to make it sympathetic to the times it was based. Is it too much too ask for members of the same family to be from the same ethnic group?It's PC for the sake of being PC and as such the acting talent, of which was considerable, was wasted to the point of being comical."}, {"id": 147, "text": "Not sure what the point of the movie is. Couldn't even finish it, that's how bad it is. I assume the good reviews are bots or paid writers because it is a total bomb and should not of been ever released.."}, {"id": 148, "text": "Gives you a headache don't even bother trying to watch."}, {"id": 149, "text": "A lovely quirky blend of comedy and drama mixed by Armando Iannucci, who has made it clear he's a force to be reckoned with in Hollywood. He's easily the funniest person working in the business right now. With Death of Stalin and Avenue 5 under his belt, he just keeps building up and building up. David Copperfield is his latest magnum opus, one of the best adaptations of Charles Dickens to date. With such great sets and costumes, a stellar cast and lots of British humor and wit, he's got all cylinders firing. Armando is one of the few people in Hollywood capable of being on his constant A game, always making something unique and interesting. Dev Patel is magic and so is the rest of the cast, including a charming Hugh Laurie, Peter Capaldi and Tilda Swinton. The whole thing blends a wonderful production of theater and cinema, blending the two into a classy spectacle, making it wholly charming, classy, and quirky. Definitely something not to be missed."}, {"id": 150, "text": "Such a struggle to sit through this. I felt like I was watching a free movie on the Pluto free TV app. But I know Hollywood has been quarentined so most movies this year will probably be like this since they don't have anything else to show."}, {"id": 151, "text": "I found very distracting the way people were cast into their roles. It came to my mind what if Hollywood does a movie about some important African American personality and cast a white actor for that role? See what I mean? Scripting is also poor, I didn't find any connection to any of the characters."}, {"id": 152, "text": "Another politically correct movie which flopped. It seems that this colour blind casting is making historical movies ridiculous."}, {"id": 153, "text": "Why would you even make a movie like this??? I dont even have a comeback. It is sad and badly done, but the actors and esses, are beautiful. sad sad day for me."}, {"id": 154, "text": "This film was a perfect reflection of the times we are living in, i.e. safe to enjoy without being labelled politically incorrect. I quite liked the idea of a multi racial cast, it made for an interesting mix of period piece and modern day familiarity. Unfortunately overall it wasn't very well executed. Ben Whishaw steals the show as Uriah Heep but for the most part the cast are all a little too jolly and this makes the film seem shallow. I thought the Death of Stalin was brilliant. This was only mildly entertaining and fundamentally rather silly."}, {"id": 155, "text": "From the get go the over-acting is painful. It thinks it's full of colour and character but it is empty and pointless. The only question I am left with is why was this considered a good idea?"}, {"id": 156, "text": "Unfortunately it is not about the legendary magician David Copperfield. It is a story about an indian boy that went to London."}, {"id": 157, "text": "This is the Hollywood Version of David Copperfield. We are let down by screen writers and a production team who believed they could improve upon writings of Dickens by corrupting the story in so many ways. Dickens was failed by Hollywood. So were we."}, {"id": 158, "text": "As a fan of Dickens this is a dislocated version of one of the greatest stories he ever wrote. This is billed as a comedy drama but there is nothing of either. It just looks like the producers were trying to include as many different ethnic actors as possible without bothering about the quality of the story line."}, {"id": 159, "text": "I am a long time fan of this story having been inspired to read it as a child by watching a spectacular 1974 BBC production. I was excited to see what Iannucci had done with the story. The casting of people with various ethnicities was a conceit which worked fine as the performances by a great cast is the only reason this film scores 4 stars from me. I could also accept that some characters must be sacrificed when compressing a story of great length into a film. What I could not forgive was the way the essence of characters was changed so radically. The wonderful Peter Capaldi was given little to do as Micawber who was written as uncouth and ill-educated. If he was either of those things he would never have been employed by Mr Wickfield, in the film a one dimensional caricature whose rampant alcoholism all but ensures Uriah Heep's succession rather than making it more about Heep's weaselish ways. All of the characters are used by DC simple as a way to boost his writing and his popularity instead of being real people with whom he forms genuine caring connections."}, {"id": 160, "text": "The costumes and scenery were beautiful to be sure. I'm probably a little slower than the average bear but I had a little trouble understanding the English accents and therefore following the story. I felt like we were just following these people around watching their day to day interactions. Disappointing"}, {"id": 161, "text": "So let me start off and say that concerning actors, costumes, and settings this film is great! But it was, as I would say, a very 'busy' film. A lot happens, and it isn't always very clear what's going on and why. There were a lot of lovely elements in there but also a lot that I did not really know what to think about. I was pretty exhausted after the film, just by watching it."}, {"id": 162, "text": "The Personal History of David Copperfield: A film that was ultimately too boring at points for me to care about the characters. All the performances here are good but I really enjoyed the performances from Peter Capaldi and Tilda Swinton. Maybe I'm biased because I love them both but their presence on screen always brought a smile to my face. Other than them, I was really disinterested in everybody else including the main character. I've only seen one of this Director's other films and he made the characters in the that film (The Death of Stalin) much more interesting so I don't know what happened here. Maybe this Dickens story just isn't interesting enough for the big screen. That's not to say there weren't other elements I enjoyed though. I thought the production design, costumes, and cinematography were all excellent and the writing wasn't half bad. That's what I will remember this film. Not the story. The score was fine but it felt too over dramatic at points. Check this film out if you like the original story or this Director (Armando Iannucci) or actors."}, {"id": 163, "text": "The politically correct director's miserable choice does not pay homage to Charles Dickens but prey on easy jokes. The film is admirable for its historical reconstruction except for the color forcing. It is humiliating that BLM so capriciously influences every area of culture, and historical revisionism is not for me. Said so, Peter Capaldi's Mad Hatter look is wonderful, but Patel was overacting and he is an overrated artist."}, {"id": 164, "text": "A Cast with great promise, The script with some hope.... &amp; Direction with Lack of it, &amp; nothing worth remembering after the credits start to roll. When one says wait for the DVD/online release is a understatement, just wait for the Public TV release &amp; hope there's something better on, on the other channel."}, {"id": 165, "text": "Iannucci has always clothed himself in cynicism, so this surprised in being joyous, vibrant fun.This isn't really a Dickens adaptation, but more a jaunt straight into a writer's brain. It's brimming with ideas and characters, as it spins around richly coloured Victorian sitting rooms.The film's diverse approach to casting will inevitably annoy some, but good in my opinion. A triumph for the Covid ages."}, {"id": 166, "text": "Don't know what shall I say here. Maybe just one thing don't really can say much about that movie,empty"}, {"id": 167, "text": "Who are they trying to impress? Do they think by making the characters in mid 1800 would appeal to the masses? I wanted to see an old English story written by Thomas Hardy but what I got was a movie possibly made by the likes of Spike Lee. Pardon me but I couldnt see it through half way."}, {"id": 168, "text": "Messy, chaotic and mostly odd. This is not per see a bad movie, but it is not a meaningful one either.Seeing as lip service to Dickens as a monument to literature is seemingly a given, I can't do anything but to conclude that either Dickens wasn't all that much or that the respect he had under contemporary minds is highly exaggerated.For me personally, I did not enjoy the fantasy historical demographic as these are an affront to minorities in these periods."}, {"id": 169, "text": "I thought this was going to be a movie about the world famous magician and his life story. What I got was a life story, but not of the famed magician, but instead a man out of place in an aristocratic Victorian England society. Entertaining in some parts but mostly boring"}, {"id": 170, "text": "I have no issue with the casting, nor have I any issue with the ethnicity of the cast. I do have issue with the fact that this wonderful story has been butchered in to something which is almost unrecognizable. I shall go back to the version from the year 2000 and try to forget this experience."}, {"id": 171, "text": "Noticed lots of reviews noting that they didn't like the colourblind casting. This honestly didn't affect my experience of the movie at all, I found the direction and the editing brilliantly immersive and original. I honestly liked that it moved away from the somewhat stale established format for period dramas. I also found the humour perfectly Dickensian and the actors really brought the heart of the book alive. My one criticism is that it was somewhat lacking in depth, David Copperfield is definitely not a tragedy but the comedy is routed in pain and I felt some points slightly lacked this. It led to some confusion in my friends who hadn't read the books but if you had you'll probably see what Iannucci is trying to do and I can respect that to fit this into a feature length film is probably slightly unreasonable."}, {"id": 172, "text": "This movie is a mockery. This crap don't deserve even 1. Dumb. Don't waste your time, you will be disappointed."}, {"id": 173, "text": "First time, it's looked promising But if you just curious or something like that, yeah it's okay to watch this"}, {"id": 174, "text": "Although they are right as far as its quite confusing having members of the same family being from different races. the film itself is great! I have rated it 8/10 due to this as my husband and I talked through it quite a bit to work out the connections which obviously then caused us to miss bits and have to rewind. So pay attention! You soon work out what is going on and the connections.Each actor does a fantastic job portraying the characters and bringing Dickens story to life."}, {"id": 175, "text": "I have literally created a profile for the soul purpose of leaving a review because I am so bewildered as to why this doesn't have a higher rating!It is the most utterly wonderful film. Fantastic cast and acting with some exceptional scripts and dialogue. Utterly beautiful and totally poignant. I cannot get enough of this movie, it had in me in tears of absolute joy.Madness. Watch this film. It is beautiful."}, {"id": 176, "text": "I have not watched any Dickens films (apart from films about a Christmas Carol) nor read his books so came into this kind of fresh. I am surprised that some people are surprised at the cast were not all white and sticking religiously to the original story as I have seen the film poster with Dev Patel, so was prepared. The trailer also shows a range of well known British actors. AND the film is not called the usual title. More clues about the adaptation. The acting is good, nothing too strenuous, the subplots are fairly superficially covered (poverty, debtors jail, child labour) and I liked everyone's energy. I really liked the blind colour casting, and it didn't detract from the story telling. Watch on a lazy Sunday afternoon with the kids"}, {"id": 177, "text": "This film start with a man David having speech with the audience, and flashback of he been born scene! As turnout, this film is about David telling his own life story to the audience on his own point of view! Entire film quite rushy, and messy! The overuse of the flying kite, and playing dumb scene, also make the film unwatchable! Barely laughable scene is, aunt of David Betsey using the salad dressing instead of medicine to revive David! At the end, David celebrate his newborn baby! He imagine talking to his younger self! That's it! Another disappointed film!"}, {"id": 178, "text": "Act 1 - 7.0Act 2 - 6.9Act 3 - 7.6 Very quickly filmAn easy light inoffensive comedy styleCharacters feel fully realizedFeel the fun on screenEnd feels rushed as all characters come together for a swift but enjoyable endingStory of perseverance and resilience and acceptanceDev Patel is good as the lead and very easy to get behindJairaj Varsani is also very good as young David, a sweet and innocent kidSupporting cast is stacked with talent and they all get to display it on screen with rich charactersSet design is great along with the costumesArmando Iannucci who also wrote and directed Death of Stalin did the same for this filmDoes a great job with dialogue and characters and lets them come to life on screenOnly complaint is the rushed ending but still hits the emotional beat wellA strong film that I'd recommend to most Based off the Charles Dickens book set in the 1840'sFirst hand telling of his own storyDavid lost his father at a young ageDavid is sent to live with a rag tag group with his maid as his mom is starting to date a new manDavid is happy staying with these good and kind people but misses his momDavid returns home see his mom married to Mr Murdstone, unnecessarily rude and mean and his rude sister comes to live there tooMurdstone starts to beat David and mom and Peggy feel helplessMurdstone sends David away to London to work in Murdstones child factoryTreated poorly there by all for being smarter than the othersDavid meets his new caretaker Mr Micawber and his wife, poor but seem niceDavid starts to learn the improper way of talking in the city and drops some of his polished EnglishDavid is now a young adult teaching others in the factoryMicawber family sent to debters prison and David has to sleep in the factory, now has nobodyMurdstone comes to tell David his mom is dead and they already had her funeral without him being able to attend, terrible peopleDavid wrecks some bottles and leaves the factoryDavid now only has a box in his possession and goes to Trotwood for help, his auntThe box contains some of his memorable notesMr Dick lives there too and is a writer of sorts too, share their worksTrotwood starts calling David TrotwoodDavid helps Mr Dick clear his mind freeing himDavid is treated very well by Trotwood and Mr DickMeet Agnes who is very enjoyableDavid goes to board at a school with other gentlemen, they seem rude, mean to the help and a David fits inPeople keep changing his name on himSteerforth is now David's closest friend, I dont like himBad influence on David, acts rude to the help to gain favor with classmatesMicawber makes a return to teach one of his classes, probably scammed his way inStreeforth gets Micawber kicked out and David is upsetUriah try's to blackmail David with exposing his past to get him a job with Mr WickfieldDavid graduates and likes his future employers daughter Dora aspen lowAll the while Agnes is in love with DavidDavid trains to be a proctor with Spenlow in London, an attorney of sortsPursues Dora who is pretty dumb, Agnes is better for himRunning joke continues to change his nameDora is so annoying and frustratingTrotwood and Mr Dick have lost everything and arrive in London at David's homeDavid is still being funded by Trotwood and fears going back to being very poorUriah is now a partner with Wickfield and is ruining DavidDavid takes Steerforth to meet the people that took him in on the boatSteerforth gets along well with themSteerforth has wooed Emily and plans to marry her away from the boat house, they left with only a note behindDavid and Dora get engaged even in his current poor stateDavid runs into Micawber on the street with his familyDora now living with David and Mr Dick and TrotwoodThe Micawber family now staying in David's home tooDavid starts writing his stories, this is what he is meant to doGets to recount the people and experiences that made him the man he is todayAgnes exposes Heap for what he has done, stole money from Trotwood and forged signaturesHeap finally snapsDora wants to be written out of David's stories, she knows she doesn't fitFind Emily who was abandoned by SteerforthHam tries to save Steerforth but he didn't want to be saved and diesAgnes and David end up togetherSee David telling his story in front of an audience and loved onesDavid and Agnes have a child and are surrounded with loved ones, happy ending ."}, {"id": 179, "text": "Crap Could have been worse , apologies it was crap or worse than crap , just confused which word is most important in this conjunction is it crap or worse than crap anyway enjoy the movie please make a payment to watch it on digital or dvd , will make me feel better that I'm not the only to waste my time or money , oh crap"}, {"id": 180, "text": "I was looking forward to see this despite the negative reviews. This movie was dull, confusing, and not at all funny. Only Tilda Swinton, Ben Wishaw and of course Dev Patel were worth watching. What a shame."}, {"id": 181, "text": "I thought this was good, but I watched it yesterday it wasn't good at all. I surely expected more... really disappointing... 😕"}, {"id": 182, "text": "Dev Patel's acting is just incredible, but not enough for me to rate this film more than 6"}, {"id": 183, "text": "This was simply great interpretation of the story. I studied Dickens at A lev and have loved his work ever since. The book is effectively a series of extended character studies;the amusing, the tragic and the grotesque. OK, this version emphasises the Black Adder elements of the book, but it's warm take on the story. They should have made a mini series. Please ignore the Brexit style comments it's PC hone mad, the cast choices gave it a wonderful tonal feel"}, {"id": 184, "text": "As you'll see here on IMDb, lots of contradictory views, and lots of wonder at how one person finds a film to be dull while another inspiring. Welcome to the joy of being a human. I loved this film. I have loved and still love, the book by Charles Dickens, and this film is both a very warm and compliment to that book, while also managing to be its own creation. All of the performances are sheer joy to experience. I've rewatched this film at least half a dozen times, primarily for the joy and humour that each actor brings but also for the richness of the visuals and creative direction. I don't wish to single out anyone or anything as I'm struck by how much the success of this film is due to the combined talents of all involved, beginning with Mr Dickens himself. Open your mind and hearts and enjoy this beautiful film."}, {"id": 185, "text": "This failed for us on many levels, not least the bizarre, almost surreal, mixed race casting. The style is amateurish, content is not entertaining, a few good moments but generally just dull."}, {"id": 186, "text": "I love the works of Dickens and this story is a particular favourite. I like to get lost in a good film or book. The PC casting of this film destroys any chance of that. Dev Patel is a great actor and there are many great Indian actors who could have played his mother why use a caucasian blonde? Benedict Wong as Mr Wickfield is brilliant as ever but Rosalind Eleazar, though brilliant in the role, is not believable as his daughter. Woke audiences will pretend to love this but only through fear of appearing unwoke."}, {"id": 187, "text": "I'm sorry I didn't like it and not even the actor who plays David Copperfield. I'm not saying bad acting, not at all, just the actor is not likeable enough. People don't listen to me, watch the movie, maybe you'll like it, this is only my opinion."}, {"id": 188, "text": "Every so often it's good to be reminded how much I dislike Dickens. I was hoping this film would make Dickens tolerable but, sadly, it doesn't. There are some nice little vignettes but, on the whole, it's just silly. Slightly Pythonesque, maybe?"}, {"id": 189, "text": "This movie!!! Is so joyful!!! And sweet!!! And funny!!! And beautiful!!!So like if you hate any of those aforementioned qualities, super duper bigtime do NOT watch this movie. Idk what to tell u!The directing is fresh and FUN. The casting is excellent. Dev plays the part beautifully. Anyone who has a problem with the colorblind casting in this movie can eat my farts! This is literally a work of fiction. It is a work of art! Who is anyone to say how this can and cannot be adapted! Especially when the adaptation is THIS good with a literal all-star cast?!Charles Dickens isn't here, so sadly we cannot ask him how he liked it, but considering how this movie is his legacy, I think he'd be pretty stoked."}, {"id": 190, "text": "I loved this movie. There was great acting, filming and props. But it was also hilarious and quirky."}, {"id": 191, "text": "Has the spirit of the novel, with layers of modern twists, made me laugh out loud"}, {"id": 192, "text": "The depth of Dickens characters is such that it would require a multiple series to do them justice in unwrapping their souls. A heroic attempt here to illustrate them as briefly as possible, with great acting and fascination that requires a liberated mind to accept gender swap and colour blindness of characters. The entire cast is absolutely awe-inspiring, as to have the likes of Tilda Swinton, Peter Capaldi, High Laurie, Paul Whitehouse in the same scenes and young Dev Patel leading/learning from these masterful giants; it's a marvel to watch such splendid satirical portrayal of dense dark literature in light-hearted storytelling. The composition of music and cinematography is so wonderful, going hand in hand with the dark &amp; light moments in the story, keeping the viewer bewitched &amp; tied to the kite as it leads in unexpected directions with the wind. A thoroughly enjoyable piece of cinema, a great credit to the director and all those involved in bringing this joyful tale to life. Bravo!"}, {"id": 193, "text": "The movie was so boring with some weird story progression. It was a waste of time. I wanted to leave the cinema with 1 hour left. I also wonder if David Coperfield had Indian origins, because how they presented him, he was looking like pure Indian with good English accent? Costumes and screenplay were very nice, acting was alright, but it was very boring with no emotion and no strong point at the end."}, {"id": 194, "text": "Fun adaptation, one of the most entertaining renditions of the story I've seen, though not the most faithful. Great way to bring to new audiences."}, {"id": 195, "text": "I think an adaptation instead of a retelling would've made more sense and could've been far more creative. The diverse cast would've made more sense too. As it adds even more silliness to this.I saw a Sci-Fi adaption of Monte Christo once. It's doable.This on the other hand seems lazy in comparison."}, {"id": 196, "text": "The Personal History of David Copperfield is one emotional drama that's a journey of change showing that life is tough with ups and downs. Set in the 1840's it's a personal account of one orphan(played well by Dev Patel). As from birth on his life is pillow to post with different schools, jobs, parents, and friends. However he beats the odds and becomes a gifted writer and storyteller while finding love. Well done story that may not be everyone's cup of tea still it's entertaining."}, {"id": 197, "text": "I'm going to be short with this one. The Personal History Of David Copperfield is a weirdly charming movie. It has the pace of a sherlock holmes movie and the setting of little women. Combined they make up for a sometimes hilarious but mostly confusing ride. Luckily the acting in this movie is rock solid so that's what saved it from becoming a mess probably. Overall a solid 6, just one hint: take a nap before you go and see it."}, {"id": 198, "text": "To be fair I wasn't sure if I was going to enjoy this version of the classic Dickens story, needn't have worried, loved every minute of it, all the cast including young David were excellent. The story moved along at a pace, it looked wonderful, Dev Patel was excellent as David. It was at times funny and at times very sad, a very clever and enjoyable film"}, {"id": 199, "text": "With a lot of intriguing characters The Personal History of David Copperfield give us the key for a true amazing adventure. The story is compose with a lot ups and downs that captures our attention throughout the movie. The core of the movie, wich was the perfect move from the director and the writer (and obviously charles dickens) was the fact that they treat every character with some character flaws but with a special that in the way that makes the audience having that very good feeling of something was accomplish and a special care about everyone in the movie. The acting is very competent and off course Dev Patel makes a fantastic job as David Copperfield giving a true and genuine performance and the rest of the characters are competent and really give some life to the movie."}, {"id": 200, "text": "This and all films from our friends across the pond, and in particular period pieces, whose tones rely heavily upon the rich diversity of British dialects, require subtitles."}, {"id": 201, "text": "After seeing the trailer I just couldn't wait to see this one. It looked like it was going to be hilarious. Seems like I was misled. Definitely humorous in places but not the laugh-fest I was expecting. PC run amok yet again? Or was it just a deliberate zany fantastical reimagining of David Copperfield's life where fact and fiction collide. I'll lean toward the latter but I'm not sure it worked. Love all the actors and actresses involved but, again, not sure it worked. And how does a movie that feels so rushed still just come shy of two hours? Maybe that's a good thing. At least it was clean; one for the whole family. My wife enjoyed it."}, {"id": 202, "text": "A multiracial cast attempts to recreate the Shakespearean comedy/farce. Populated with acting veterans in the ensemble company, the film alternates between lunacy and exhilaration.Generally interesting, it does touch on the worst of Dicken's England. The poverty and debtor's prison. The lack of a welfare net for the unfortunate.That said, IMO the film was way too long. A runtime of 90 minutes would have been more tolerable.High production value and impressive settings."}, {"id": 203, "text": "So the movie was great and entertaining, though nothing unforgettable, but it was really good except for one detail.And that detail makes me wonder for future movies if let's say Barrack Obama will be personified by a chinese actor, with a latin Michelle, having maori and white children."}, {"id": 204, "text": "This is not a straight forward movie experience. It combines elements of live theater with classic farce, woven together with an obvious love for the source material.Cinematography, editing, score, and set and costuming attention to detail conjure a believably pre-industrial London. We see the world first through the eyes of a boy ingenu, which lends to the slightly fantastic.It smoothly transitions through 'highlights' of the book, without being too thin or fleeting. The creators have consciously chosen to lean into the comedic aspects of events, while still giving weight where appropriate.Performances are perfectly tuned to the array of idiosyncratic characters. None of the actors outshine the others - a true ensemble. And it is an extra pleasure to see Hugh Laurie and Peter Capaldi in scenes together.It evolves through episodes which tie together beautifully in the conclusion, especially with the final line.The end credits retain the style and are a pleasing conclusion.Now, one of my favorite films."}, {"id": 205, "text": "The lead actor, the gentleman (Dev Patel) acting skills is thoroughly impressive! 🙂🥇His supporting cast is likewise impressive.So why might one give this film only 4/10?For me movies are about: Believability and EscapismThe movie utterly fails on this regard with the over colourised casting of ethnic minority members #replacing what originally should've been a European White cast, being in the mid 1800s the story is set in.I and my Mom wanted and expected to see a majority/overwhelmingly authenticity to Charles Dickens original story (and historical) settings...sadly this is not the correct adaptation for such hopes.(N.B. I'm a coloured person as is my Mom).For example: I loved the Indian epic: Panipat, a beautiful Bollywood production that was fully immersive and with the correct casting of the ethnicity of its cast (i.e. all being middle Eastern/Indian subcontinent cast).I also loved IpMan4 which was very accurate to its timeline and historical context of what the USA was like, in many ways then (and naturally, most of the cast was Oriental as accurately portraying the story context).I don't understand why European and Hollywood seems to like to actively trash their ancestral heritage and stories, by artificially colourising them up, that it becomes like a modern multicultural city in the West instead #Facepalm.It spoils the temperament - story context and ultimately for my family trip to see this, the believable-escapism of what this movie was meant to do, that is:*To take the audience onto a really immersive journey of escapism and authentic appreciation of what-it-was-like for Charles Dickens protagonist, in mid 19th Century Britain.Such a disappointment, of intersectionalist ideology corruption into, what would otherwise have been a 6 or 7 out of 10 movie, had the story been true, to its original Western European roots.A disappointed viewer from China &amp; Hong Kong."}, {"id": 206, "text": "Scottish director Armando Iannucci isn't the first name that springs to mind when one thinks of a director of Charles Dickens novels but the famed comedic filmmaker makes for a refreshing behind camera master of this more modern take on Dicken's semi-autobiographical tale.Renowned for some of the modern era's greatest politically astute comedies in the form of In the Loop and The Death of Stalin, as well as extensive work on hit TV show Veep, Iannucci dials things back quite a bit here without ever losing sight of the oddball humor that has made his career so enjoyable, as we follow Dev Patel's kind hearted David Copperfield across a multi-year journey of trials and tribulations as he tries to find his way in a world that seems intent on knocking him down.Not following any particular one plot thread, the film takes on board Copperfield's experience's being raised by Peter Capaldi's money waster Mr Micawber, his teenage years education and most importantly his life-defining relationship with Tilda Swinton's oddball aunt Betsey Trotwood and her mentally unhinged friend Mr. Dick, played wonderfully by Hugh Laurie.There's a lot to cram into History's two hour run-time, one that Iannucci at times struggles to balance out, with the films later stages in particular feeling as though they could've had more time to breath but overall the film remains an entertaining and enthusiastic rendition of a story that has stood the test of time.Front and centre throughout are some fantastic production values to this independent film, duly noted in the films large collection of nominations at last years British Independent Film Awards and another great lead performance from Dev Patel, who much like his fellow Skins graduate Nicholas Hoult has proven time and time again that his one of the most assured performers working today.Patel's infectiously enjoyable performance is a genuine example of a film that is having a lot of fun with its narrative and one were the cast and crew clearly had a ball bringing it to life, while its likely to divide die-hard Dicken's fans, its great to see a director of Iannucci's skill-set tackle such a task.Final Say -It may not be quite up to the high-standards of the best Dicken's features but The Personal History of David Copperfield is a joyous little film with a lot of heart and a killer on-song cast to boot.3 1/2 heavy cakes out of 5"}, {"id": 207, "text": "Dev Patel carries the role of David Copperfield gracefully and naturally. He meets many characters along the way that vividly come to life on screen in ways that make you feel as though you are reading the descriptions as they unfolded on the page. They are almost caricatures in a very whimsical and delightful way. The rollercoaster that takes David from being the only son of a widow to the discarded baggage of a new marriage also makes him the guest in an overwhelmingly loving (yet constantly indebted) family. The ride continues as he becomes a young man on the run and on his fresh start as a gentleman with a past and then finally landing as a man in love with a girl who is out of place in his story.Though we are introduced to a wonderful array of supporting characters who help David on his long and winding journey, we do not get to spend enough time getting to know them because of the fast pace of the film. We feel his connection to them based on all of the great performances, however, it is tough to stay connected to them on the other side of the lens as the pace through situations races ahead. The third act of the film is where it is felt the most. As all of the characters come together for a very satisfying ending, it would have been nice to have more time with the characters as they enjoy the spoils of ride they took together.In the end, this is a redemption story about a very interesting character and his extraordinarily interesting life. David and his engaging journey have every element needed to go from whimsical to scary to revenge filled and eventually a satisfying conclusion. I would definitely recommend it. There are brilliant performances all around and the film is a welcome escape from the current lack of whimsy in the world."}, {"id": 208, "text": "Based upon Charles Dickens novel David Copperfield (1850), this latest adaptation starring Dev Patel as the titular lead chronicles Copperfield's erratic life from rags to riches. Set during Victorian-era England, The Personal History of David Copperfield commences with his idyllic childhood living on a beach in an overturned boat through to early adulthood after a somewhat turbulent string of events. Being a fan of Dicken's works (as well as having written and starred in the 2012 TV film Armando's Tale Of Charles Dickens), Iannucci appeared to be an appropriate choice to adapt Dicken's 600+ page behemoth for the screen. Along with co-writer and regular collaborator Simon Blackwell, Iannucci found himself drawn towards the comedy featured within the novel. Dev Patel shines as David Copperfield, and he's joined by a magnificent ensemble cast comprised of some of Britain's finest. Peter Capaldi (a previous collaborator of Iannucci's, most notably known for his work on The Thick Of It) features as the scheming Mr. Micawber, and Hugh Laurie delivers a wonderfully mad performance as Mr. Dick; a frantic, paranoid man plagued with what seems to be a loose form of schizophrenia. Tilda Swinton is another fantastic addition as Betsy Trotwood, and Ben Whishaw's performance as the seedy Uriah Heep lends a slightly more antagonistic presence to a storyline largely lacking such a component. It is evident both Iannucci and Blackwell are fans of the source material they're adapting, as The Personal History of David Copperfield is a vibrant, charming piece of work that is irresistibly fun. Driven by a wonderful cast and a fast-paced storyline spanning many years, it is a film made with affection that is an absolute joy to watch."}, {"id": 209, "text": "Eccentric in every sense of the word, director Armando Iannucci offers up a delightful oddity in the form of his offbeat adaptation of Charles Dickens' classic novel. It's funny, charming and heartfelt all the way through, and while it may lack the biting satire and charisma of Iannucci's best works, there's no denying how enjoyably strange this film is.First things first, this film isn't a straight adaptation of The Personal History Of David Copperfield, but nor does it intend to be. It follows the original story as closely as it can, providing an engrossing coming-of-age tale of rags to riches that soars with the inspiring drama of Dickens' story, but the film stands on its own two legs with its delightfully offbeat persona.Because, rather than simply recounting the classic tale as a costume drama for the umpteenth time, this film tries to do something a little different, still paying homage to the original story but having some fun with tongue-in-cheek humour and modern sensibilities all the way through.In that, the movie is wonderfully fast-paced, zipping and zapping with zany energy to and fro as it flies through David Copperfield's upbringing and chaotic ups and downs between nobility and poverty. Furthered by energetic directing and performances, as well as editing that features the slightest hints of breaking the fourth wall, the film establishes itself right from the start as a feverishly eccentric watch.And that's where the real joy of watching The Personal History Of David Copperfield comes from. It's not just another costume drama (although the costumes and sets look gorgeous), but a rapid-fire comedy of errors that will have you rolling around in your chair laughing right the way through.Admittedly, not every joke lands perfectly, but the film is so jam-packed with laughter and energy that you'll find yourself consistently entertained, only bolstered by those tongue-in-cheek winks and nods such as the fourth wall breaks and colour-blind casting that only add to the brilliant eccentricity of it all.But even with so much zany energy at play, the film manages to spend time to develop its drama in a heartfelt and engaging manner. Brilliantly linking up the story's more inspiring emotional themes with the charming nature of the comedy, The Personal History Of David Copperfield is an effortlessly lovable watch, both in its laughs as well as its soaring heart of gold.From a genuinely wonderful lead performance by Dev Patel to standout supporting turns from Tilda Swinton, Hugh Laurie, Peter Capaldi, Daisy May Cooper, Benedict Wong and Ben Whishaw, the film uses its A-list cast to fantastic effect, all brought together under the roof of delightful hilarity by director Armando Iannucci, who keeps a potentially chaotic comedy of errors running smoothly all the way through.The one caveat of the film is that it doesn't quite match up to Iannucci's best works of the past simply because it lacks a more biting satire. Of course, there's perhaps less political and social mockery to play with in a Charles Dickens adaptation compared to In The Loop and The Death Of Stalin, but it feels like this film tries to bring some in with its assessment on the class divide and the plight of poverty, albeit never quite hitting the mark.Saying that, however, The Personal History Of David Copperfield is an utter delight. It's wonderfully strange, complete with rapid-fire and zany energy that complements an eccentric atmosphere and a charismatic cast, only furthered by an engaging and heartfelt story that's brought to life by hilarious comedy all the way through."}, {"id": 210, "text": "I've loved the book since I was about ten years old. I've seen several adaptations. This is the worst. Not only does it omit some of the key sequences, sub-plots and characters but it misses what makes David into David.In the color-blind casting Ianucci seems to want to challenge the audience - Come on, criticise if you dare - it'll only prove you're racist. Certainly - that strategy certainly played well to the woke reviewers. Okay - if that was one of his main aims, he should have said so but did he get the best people for the parts? Dev Patel is much too old for David. When he walks to Dover, he's supposed to be about 13! He looks more like 34. The casting is distracting.Hugh Laurie is brilliant. He steals the show. Capaldi and Swinton are also very good and the actress who plays Steerforth's mother is stunning. But as for the rest - meh! It's a shame for some of them because they weren't allowed to shine, their characters having been given little time to develop.Re. the ending, it's a complete hotch potch and a cop-out. It feels as if they set out to make a two-part movie but got bored and collapsed the entire second part into a ten-minute sequence that's quite far removed from Dickens ' concept.Read the book. It's great!"}, {"id": 211, "text": "'The Personal History Of David Copperfield (2019)' feels, quite significantly, like a clip-show, closer to a series of interconnected skits than a traditionally cinematic narrative. This isn't necessarily a bad thing, though. It gives the piece - which does, of course, have an overarching story - a unique feel. It's also an apt way to condense a lifetime into two hours, featuring only the most significant moments of its eponymous character's life. It all seems a little surreal, especially when it begins to visualise its narration in the middle of select scenes. The experience starts off a little slow but it soon picks up the pace, moving towards its low-key finale with a fair bit of momentum. Most of it is presented rather farcically, its eccentric characters flailing their arms or speaking in eloquent metaphor. There are a fair few moments that provoke a chuckle or two, but the flick still retains some resonance. It isn't all overtly comedic; some of its more sobering stuff does, indeed, sting. It comes so close to having something to say about class, but this aspect remains distinctly subtextual and always comes second to the more straightforward story. This isn't a huge issue, though. Perhaps the movie's biggest asset is its ensemble cast. Patel, who perfectly portrays the adult version of the whimsical protagonist, is a real stand-out. As are Capaldi and Laurie, who play eccentric but endearing middle-aged men. Each and every cast member is decidedly good, though, doing exactly what they need to with apparent joy. Overall, the film is entertaining and well-made. It's fun, energetic and, in general, just a good time. 7/10"}, {"id": 212, "text": "Not many films make me want to visit Britain, especially Victorian Britain, but this charming little number did.Armando Ianucci's foray into magical realism-lite sparkles with his usual wit but without the usual cynicism or cruelty.The conclusion is also far better set up than Veep or Death of Stalin (also recommended Ianucci works).Did it do justice to the source material (all 600 pages of it)? Maybe not. But we get it by now: 19th century Britain was an unpleasant place to be. A by-the-book, Lord-of-the-Rings sized suffering orphan epic would not be giving modern audiences anything new.The Personal History of David Copperfield on the other hand takes risks in casting, pacing, and cinematography. To me, that makes it the hero of its own story."}, {"id": 213, "text": "There is much to like about this film. The cast is excellent (Hugh Laurie was born to play Mr Dick) and give it their all, the cinematography is superb, and Armando Iannucci's mastery of comedy was much to the fore. I would have loved to see the same cast and crew produce an eight- or ten-part TV adaption of the novel Dickens called his Favourite Child.Unfortunately, that's not what we get here. This is an attempt to cram an 883-page novel into a 119 minute film, and it Just. Doesn't. Work. I don't expect an utterly faithful scene-by-scene homage - but the breakneck pace of this film simply doesn't give the story room to breathe. Ben Whishaw does his best with Uriah Heep, but doesn't get the space to do much with the role; Paul Whitehouse's Mr Peggotty is shorn of all pathos; Benedict Wong's Wickfield is confined to a recurring joke (which is absent from the novel); Nikki Amuka-Bird is asked to play Mrs Steerforth whilst incorporating Rosa Dartle; Rosaleen Linehan as Mrs Gummidge is treated little better - and the total omission of Mr Barkis, Tommy Traddles, Martha Endell, Littimer - and even Mrs Mowcher - damages the whole. Peter Capaldi is good comic value as Mr Micawber, though some of his best scenes are omitted (and a spurious one incomprehensibly invented). As for the dramatic unmasking of Heep - it shows all the signs of being crammed into the two minutes of running time that was still available for it.Dickens wrote some great comedy in David Copperfield. Some of it is in the film.Dickcens wrote some great pathos in David Copperfield. Almost none of it is in the film.Don't see this film if you enjoyed the book."}, {"id": 214, "text": "One of the constant ongoing mysteries of modern cinema is how Armando Iannucci manages to attract top quality actors to appear in his rubbish films and television programmes. I have to admit straight away that I was never a fan of the profanities of The Thick of It,fell asleep during The Death of Stalin and am an ardent fan of the works of Dickens. So I was never going to give Iannucci an easy ride on his take of David Copperfield but surely I cannot be the only one to see this film and think it ma travesty of the original source. David Copperfield was never meant to be a funny book. It was meant to be a clear depiction of life amongst the lower classes during the time that Dickens wrote. The characters were not caricatures but real people. Iannucci has come along and divided the characters quite clearly on racial lines - the bad and the mad are white and the good are not. Spurious justification that this was how it really was is laughable. Do not go and see this film if like Dickens. Do not go and see this film if you are expecting a comedy. Do go and see this film if you are a blinkered supporter of political correctness at ll costs. You'll be the only ones in the cinema laughing."}, {"id": 215, "text": "I saw this film at the HOME arts centre in Manchester on 26th January. I would first like to say to all the reviewers who have a problem with the multi ethnic casting - lighten up and catch up. It might not be too common yet in period films but this kind of colour blind casting is hardly unheard of on 21st century TV, and as the director pointed out in an interview on the Today programme this morning (Radio 4, 28th January) it has been used in theatre for the past 10-15 years. The director explained his choice of actors as, he had always thought Dev Patel would be ideal for the role of David Copperfield because he portrays the right combination of naivety, strength and intelligence for the character. Following that he wanted to cast the significant roles in the film equally well and to give it a slightly modern feel, and that meant looking at actors of all ethnic backgrounds. The BAME actors who play the significant supporting roles of Ham, Markham, Mrs Steerforth, Dr Chillip, Mr Wickfield and Agnes Wickfield are exactly right for those roles and I found nothing jarring in it their presence at all. Likewise the Caucasian actors (let's not forget them) who play Dora, Mr Dick, Mr and Mrs Micawber, Aunt Betsy Trotwood, are perfectly cast. It is inevitable that a film adaptation is going to miss out some of what is in the original novel. Film is a different medium and isn't going to have space for all the subplots or all of the characters. But this adaptation is faithful to Dickens's main characters and plot developments, and it brings out all the comic elements in both. To take a familiar example, there is something hilariously absurd in Betsy Trotwood's obsession with keeping people from riding donkeys over her lawn. This makes the film a delight to watch, and if it skates over the more tragic elements of the story, this isn't a fault. It is also visually enjoyable due to the imaginative direction. This draws the audience in from the start. The opening scene has David Copperfield starting to read his own story on stage in front of an audience, and soon after he begins, he turns and walks through the backdrop into the real Norfolk countryside and walks the viewer to the house where he is being born. There are several such surreal scene changes throughout, which are both unexpected and pleasing to watch. This isn't a classic film but it is a respectful adaptation, very funny and entertaining, and well worth watching."}, {"id": 216, "text": "This is a really unusual film. Armando Iannucci has taken the brave decision to not just cast some black and Asian actors in major roles that at first glance seem to be a strange fit, but the way the story is presented is also unusual for a period piece. Yet for the most part it works mixing Charles Dickens social commentary of one mans personal journey through life with it's up and downs alongside some amusing dialogue and a satisfying conclusion.Firstly Dev Patel puts in a great solid performance as the titular david Copperfield. The fact that here is a British Indian actor playing a role traditionally played by a white actor was jarring for a short while , but after a few minutes you do start to believe in him and it quickly fades from being an issue. In fact the only thing that seemed strange was that Patel , at 29, looked a fraction too old to be playing the character during his formative years. However that really was my only gripe.The supporting cast are all excellent. The superb and reliable Tilda Swinton has never put in a bad performance in any film and is at home in a period piece like this as she is in a Coen brothers film or assisting Bruce Banner in Avengers Endgame. Hugh Laurie seems to be a good fit in most period pieces too (think of his Prince George in Blackadder or Bertie Wooster) and does so again plus Ben Whishaw makes a suitably creepy and slimy Uriah Heep. However my personal favourite of the supporting cast is Benedict Wong who makes for a fantastically likeable, amusing and blustering Mr Wickfield. Peter Capaldi is also charming and sympathetic as Mr Micawber (although his London accent does seem a little strained at times) and special mention to Rosalind Eleazar who turns in a nicely balanced and very human performance as Agnes Wickfield.The use of authentic East Anglian location filming works well enough and the time the photography is gorgeous. I did have reservations were with the slightly unusual way the story is told, with David Copperfield sometimes dropping in on scenes from his own life and the way it occasionally jumps around in the editing. It is a little odd to see this in a film of this nature. It doesn't make a huge difference to the way it is told but aesthetically it feels strange in a film that is old fashioned at heart but told in a modern way. Also i'm sure purists will not be happy about the way some scenes are glossed over, compacted or missed completely but to be fair Ianucci does a decent job at stopping the story from becoming boring and to keep it to a running time of two hours (and remember the novel is 624 pages long) so in a sense it is a compromise to keep the spirit of Dickens story there without it being 100% faithful. So whilst it is unlikely to become compulsory viewing for future GCSE students due to its abridged style, as a modern take on the story it still works pretty well at introducing the non book reader to a literary classic. There are more accurate film and television adaptations out there but I don't think that was ever the directors intention and if entertainment was his end goal then he has succeeded here."}, {"id": 217, "text": "Greetings again from the darkness. One need not be a Dickens expert to enjoy this re-imagining of his The Personal History, Adventures, Experience and Observation of David Copperfield the Younger of Blunderstone Rookery (Which He Never Meant to Publish on Any Account). Yes, that's the novel's actual title, so there is little wonder it's typically referred to by only the main character's name.The film opens with David Copperfield (Dev Patel, SLUMDOG MILLIONAIRE) reading his autobiography to a mesmerized audience in a beautiful theatre. Yes, we hear the iconic opening line, Whether I shall turn out to be the hero of my own life ..., and then Copperfield turns and walks into the backdrop which comes alive as he, in fact, steps into his own life. The film is episodic in structure as we are presented with segments of Copperfield's life that shaped his writing - from his birth at The Rookery, to his inquisitive nature as a young boy, through his cruel banishment to factory work, on to his life living with his eccentric aunt and his time at boarding school, and finally, with his time as a proctor, courting Dora, and focusing on writing. It's a fascinating life, with many elements pulled (or enhanced) from Dickens' own.Director Armando Iannucci (IN THE LOOP, creator of Veep) and co-writer Simon Blackwell are frequent collaborators renowned for their expertise in satire. Iannucci is an admitted fan and student of Dickens, and he's assembled quite a sterling cast for his take on the classic story. In addition to Patel as the older Copperfield, we have Jairaj Varsani in his first film as young David, rising star Morfydd Clark (PRIDE AND PREJUDICE AND ZOMBIES, 2015) in dual roles including the enchanting Dora Spenlow, Hugh Laurie as the King Charles (and his head) obsessed Mr. Dick, Aneurin Barnard (DUNKIRK) as David's friend Steerforth, Darren Boyd and Gwendoline Christie as the wicked Murdstones, Peter Capaldi (Doctor Who) as the dodgy Mr. Micawber, Daisy May Cooper as trusted handmaid Peggotty, Nikki Amuka-Bird as the concerned Mrs. Steerforth, Benedict Wong as the sherry-loving Mr. Wickfield, and Ben Whishaw is a standout as conniving Uriah Heep. And if somehow that's not enough, the brilliant and eclectic Tilda Swinton shines as Aunt Betsey Trotwood.Each of the segments brings something different to the party - some of it bleak, and some of it cheery. Of course the dialogue has dashes of humor, but much of the comedy comes courtesy of the talented cast. It's been said of writers that they should write what they know, and David Copperfield literally writes what he lives ... through piles of scraps of paper, each holding a moment of life or the essence of a character. Watching this is a bit like camping out in a writer's head and twisting through their thoughts ... Mr. Dickens would be proud."}, {"id": 218, "text": "The Personal History of David Copperfield: A wonderful comic romp through the Dickens classic. The Fourth Wall vanishes in the film's opening scenes as Copperfield (Dev Patel) effectively becomes Dickens as he performs a public reading of David Copperfield, a bit like Little Women. The elder Copperfield then attends his own birth and is an observer/commentator of and on his young boyhood. The Fourth Wall continues to vanish as characters gain agency, rewrite their roles and even demand that they be dropped from the plot. The comedy has an edge though as the horrors of Victorian life as exposed by Dickens is vividly illustrated through child labour and people living in the streets. The eviction of Mr Micawber (Peter Capaldi being Mad Hatterish) is comically portrayed but the laughter dies in your throat as Micawber ends up in the debtors prison and his family in the workhouse. Tilda Swinton is wonderful as the eccentric donkey-phobic Aunt Betsey with Hugh Laurie as the kite flying (on several levels) Mr Dick. Ben Whishaw makes Uriah Heep's demanour criminal as well as creepy from the outset, but a criminal nature more appreciated by the audience than his victims.. His takeover of Wickfield's business and embezzling of Aunt Betsey's fortune is eerily reminiscent of the antics of the con-artist family in Parasite. Beautifully filmed in pastel colours by cinematographer Zac Nicholson with Victorian England gloriously recreated by Cristina Casall, Nick Dent, Charlotte Drickx and Suzie Harman in Production Design/Art/Set Decoration/Costumes. A masterpiece adaptation by writer/director Armando Ianucci. 9/10."}, {"id": 219, "text": "If you thought Greta Gerwig's version of Little Women was radical wait until you see Armando Iannuci's The Personal History of David Copperfield which isn't so much an adaptation of Dickens' novel as a complete reworking and overhaul of it. This is Dickens as you've never seen him before with Dev Patel cast as David and a whole host of black and Asian actors cast in subsidiary roles with no obvious logic in the casting and it works magnificently. This is racial diversity at its most sublime; I wonder why no-one thought of it before.Of course, that's only half of it. Iannuci's triumph is in his tinkering with the work in ways that are both highly cinematic and theatrical. It opens with an adult David addressing an audience in a theatre before moving through the backdrop into the story proper much in the same way Olivier did in his Henry V. He attends his own birth; he's a boy David, (played by Jairaj Varsani), before becoming an adult before his time. Iannuci introduces the characters in David's life in a pell-mell fashion and leaves out others. If the film has a fault it's that Iannuci simply flies through it. No-one pauses for breath but I just didn't want it to stop.The casting is sublime. Patel is Oscar-worthy as David. Iannuci even has the audacity to make him vaguely unsympathetic and even dislikeable at times. Was he like this in the book, I kept asking myself. Then there's the best supporting cast you are likely to see this year; Peter Capaldi and Derry's own Bronagh Gallagher as the wonderful Micawbers, Tilda Swinton as the most lovable Betsey Trotwood imaginable with Hugh Laurie, the wisest of all Mr Dick's, Rosalind Eleazar as a gorgeous Agnes and best of all, Ben Wishaw as the most unctuous of Uriah Heep's. Just give them all one big Oscar and be done with it. Of course, purists will hate it; a few people actually walked out of the screening I was at. As for me, it's probably not the best Dickens' adaptation I've ever seen but I'm sure it's the most enjoyable."}, {"id": 220, "text": "Charles Dickens is one of the greatest writers in the English language, but his story lines are not watertight. One could site his contemporary, Wilkie Collins as a more proficient story writer. Dickens' greatness stems from his ability to record social conditions, to write descriptive passages that are a delight to recite in public and characterisation that is best seen as caricature. This film perfectly depicts the Dickensian knack of observing details in a person's speech and actions in minute detail and accentuating those traits in the same way cartoonists magnify the idiosyncrasies of the visage. The aspect of colour blindness in the film is irrelevant. Dickens' colourful characters were portrayed superbly throughout by a host of supporting actors and the direction. Dev Patel provided the right balance of humour, intelligence and naivety. The major scenes of the original story were portrayed with sensitive detail. For those who like their Dickens unadulterated, I suggest, as with any novel, that they stop watching all book adaptations and stick to the printed word. In my view this, along with David Lean's Great Expectations, ranks among the better efforts to reduce a thousand or so pages into two hours of viewing."}, {"id": 221, "text": "If you enjoy reading my Spoiler-Free reviews, please follow my blog :)Based on Charles Dickens' novel, The Personal History of David Copperfield is the first Armando Ianucci's film I ever watched. I didn't really know much about this movie besides its stellar cast. I'm not the biggest fan of biographical works. Usually, I find them too constricted to the genre's formulas, and if I don't think the protagonist's life is remotely entertaining, then the whole film crumbles. Fortunately, it's not the case of this Ianucci's adaptation. It's one of the most pleasant surprises of the year, I finished it with a massive smile on my face.David Copperfield's life is portrayed in such a captivating, entertaining, genuine, heartfelt manner, but always maintaining this sort of lightness. There's always something positive coming out of even the worst of situations. Actually, I think that's the best message transmitted to the viewer: it doesn't matter how horrible your life might be at a particular moment, it will only get better if you don't give up, and if you surround yourself with true friends and family. Throughout the runtime, David shares his life with different families and friends, working and living in the poorest and wealthiest places.His lifestyle changes drastically after each new significant development in his journey to become a writer, and it's such a joy to watch him grow up. From working like a slave in a factory and being homeless to living in a boathouse and eventually in a mansion like a true gentleman, David goes through all of the obstacles life throws at him, learning from them to become a better person. A really nice touch is the distinct names that people call him throughout his life, depending on where he lives/works and who's he talking to: Davy, Doady, Daisy, Trotwood... These might be merely different nicknames for David, but they mean much more. They're a tiny yet efficient detail that remarkably distinguishes his unique lifestyles.Ianucci and Simon Blackwell do a terrific job with the screenplay, by offering Dev Patel an exceptional platform to shine. The whole cast delivers outstanding performances that elevate the movie in an invaluable way. Patel is an excellent protagonist, and I don't want to diminish his extraordinary display, but he's only as great as his counterparts. Tilda Swinton (Betsey Trotwood) and Hugh Laurie (Mr Dick) form a hilarious couple, deeply important to help David rise from the ground. Peter Capaldi brilliantly portrays Mr Micawber, a family man with immense debts, who teaches young David (impressively represented by Jairaj Varsani) how London works by escaping his creditors.Darren Boyd and Gwendoline Christie use their physical attributes to interpret the evil Murdstone brothers, who employ extreme, violent measures to educate David. Everyone involved in bringing the Peggotty family to life is as essential as the family's importance to the protagonist. Benedict Wong (Mr Wickfield) shows his funny side once again, as Morfydd Clark is charming enough as Dora Spenlow and Clara Copperfield. Aneurin Barnard (James Steerforth) becomes David's best friend, but his final arc doesn't quite fit the film, in my opinion, prolonging the latter for a few unnecessary extra minutes.So, as you might have figured, every cast member has a vital role to play in some shape or form. All are incredibly fun to watch, making this two-hour flick flow tremendously well. Technically, the production and costume design are award-worthy. The XIX century streets, houses, and clothes are really immersive, creating a realistic environment, elevated even more by the subtle yet powerful score (Christopher Willis). Seamless editing (Mick Audsley, Peter Lambert) and impeccable cinematography (Zac Nicholson) also help the movie's pacing and even contribute for a few transition jokes.All in all, The Personal History of David Copperfield is one of the most entertaining biographical works I've ever seen, as well as one of the most pleasant surprises of 2020. It's one of those films that leaves you with a huge smile, from ear to ear. As the viewer, watching David Copperfield's journey to becoming a writer is so captivating and fun, not only due to the humorous screenplay, but mainly because it's such an honest, emotional, genuine story. Only a few minutes in, and I already wanted him to succeed in life. My emotional attachment to the protagonist was so strong that I couldn't help myself drop a couple of tears by the end. I don't have enough words to describe how wonderful every cast member is and how important each role has in David's life. Dev Patel is an impressive lead, but his performance is elevated by the work of his counterparts. It's technically flawless, but the story and its characters make this movie an absolute delight to watch.Definitely, one of the best films of the year, so don't you dare miss it!Rating: A-"}, {"id": 222, "text": "As I sat down at the World Premiere of The Personal History of David Copperfield, my first TIFF film ever, as well as my first premiere, one of the most important tools on my side, was honesty. Rearranging the policy of my cinematic ethics and morals, no matter how excited, nervous or ecstatic I was, being plunged into this world of wonder, art and amazement, honesty was my policy, no matter how my levels or adornment were managed. For a first time festival critic, I had many, preordained rituals I have gotten used to while reviewing films before festival season. For example; leading up to the screening, no trailer had been released. Trailers usually give me a compass, of sorts, to see where we are going, something I have become very accustomed to. As well, I had never read the classic Dickens novel in which the film is based on, and I have never watched an Armando Ianucci film, despite what my co-workers have advised me to see The Death of Stalin. As the lights dimmed, the actors came on stage with the curators as well as the cast and crew, I sat myself in my seat, soaked up all and everything about my first festival experience, and realized how unique this experience was going to be for me.How right I was going to be, remains to be an irony in my life. Copperfield is set in the 1800's, a period piece as it were. The film is immersive with it's brilliantly curated cast. Ianucci conducts a film that feels, in no way, like an atypical revision of a Dickens text. On the contrary, the film feels wonderfully ripe with modernity. The Personal History of David Copperfield is a fantastical take on an old and cemented classic, without question.The picture opens with Dev Patel (Slummdog Millionaire) standing on stage as he begins to narrate his life story. He dictates his birth all the while appearing in his birthplace peering over his infant self. It becomes quite clear early on in the picture that Ianucci crosses reality with pure fantasia throughout the film. Mixing in a blend of quirk and intrigue, the film works best thanks to its fantastical actors, including Patel, as the lead.While Copperfield is a goldmine for Patel to shine, the film is also a stage for so many newer faces and established actors as well, including Daisy May Cooper, who plays David's nanny Peggotty. May is a triumph of comedic brilliance. Adding to the whirlwind of talent in the film is Darren Boyd, who plays David's mother's lover, Mr.Murdstone, a stern and tough industrial wine factory owner. Taking chunks out of David's fantastical imagination, ambitions as well as dreams and desires, the relationship between David and Mr. Murdstone takes David's story to London.While, first and foremost, before anything, Copperfield is a very straightforward coming of age, character-driven fantasia character study, it's also a journey of the highest order. Let's just say that, the less you know going into the film, the more wondered and amazed you will be. Yes, David faces a slew of troubles and tribulations, feeling as if, the world is against our young protagonist and the roads to success seem impossible, but Copperfield is a stylist period piece take on the journey we are all taking together, and that's life.With its fair share of glimmers for hope, especially with characters like Peter Capaldi's Mr. Micawber, Iannucci's 1800s London is a bleak and grey world filled with constant sunshine and hope. The champion of this hope is none other played by the animated and lively Hugh Laurie. Laurie, who plays Mr. Dick, a misunderstood character with the film's heart and soul.While Iannucci's main focus in Copperfield is the story telling technique, there are small hints of Buster-Keaton-esque beats, which allows the film to joyfully trot forward without many hiccups or complaints.While Copperfield seemed like the play thats a film that I never thought I'd need, or think that I would see at TIFF, its claustrophobic style, tone and added to the illusion of madness, fantasy as well as reality and fiction. As a period piece, Copperfield is a winner in the wardrobe and set design categories, transporting audiences to a colour palette very different from a Pedro Almodovar film.The Personal History of David Copperfield is a fresh, uproarious take on classic literature that teleports viewers back to the 1800's, all the while manages to tell a classic story in a modern way. Copperfield may look and feel like a period piece, but it doesn't possess the unconvincing theatricality of what a period piece usually represents, and in my books, that's a huge win."}, {"id": 223, "text": "What a glorious, funny, mad, slightly surreal, break-neck paced film this is!Great performances from all with stand-outs Dev Patel, Tilda Swinton and Hugh Lawrie giving it everything to make a terrific script zing. And it really does, as the film flies along at a furious pace. If you are expecting navel-gazing and 'woe is me', look elsewhere!Beatiful production, every scene looks lovingly created and wonderfully shot.Is it a faithful adaption of Dickens' novel? No.Is the casting period-correct? No.Is it great fun? YES!!Go into it with your mind and heart open and you will be rewarded with a joyous experience."}, {"id": 224, "text": "This is a comedy, drama based on the 1850 Victorian era novel David Copperfield, written by Charles Dickens. This movie shows the life events that David Copperfield (played by Dev Patel) has endured from the time of his birth, through to where he is now, the one reading his own personal history to an auditorium full of people. David's life is chaotic, hilarious and tragic, but he stays full of life. Along the way we get to meet a lot of characters played by well known actors and actresses. Daisy May Cooper plays Nanny Peggotty, Hugh Laurie plays Mr. Dick, Tilda Swinton plays his Aunt, Betsy Trotwood, Darren Boyd plays his Step-Father Edward Murdstone, Gwendoline Christie plays Edward's Sister Jane Murdstone and Peter Capaldi plays the eccentric Mr. Micawber. I thought the movie is a good realisation of the good and bad that we all endure during our lives, full of the ups and downs of a roller-coaster. Now not having read the novel, I can't say how close it is to Dickens' work, but i did enjoy it. It is funny at times, as well as sad in those difficult moments. I think that Dev Patel was excellent and with the added humour of Hugh Laurie and Peter Capaldi, it is certainly a movie to brighten up your day. The action on the screen is none stop, almost as though David is running through the whole of his life, although this doesn't in any way mean that its rushed, its actually really clever. Armando Iannucci has made a modern day non modern day of a classic novel, by that i mean it is fresh, crisp but has the Victorian backdrop. The movie has already won an array of awards, as well as a lot of nominations too. The movie was released in the UK in January, but has been delayed for viewing in America until August."}, {"id": 225, "text": "This breezy revisionist telling of a Dickens favourite by writers Armando Iannucci and Simon Blackwell has evidently ruffled some feathers. Excellent. Realism is death to storytelling, something which theatre, in the UK at least, grasped quite a while ago. Dickens wrote fiction. Roles are separate from the actors that play them. Dev Patel has as much right to play David Copperfield as Ian McKellan had in the 1966 TV dramatisation that enthralled me when I was 12 years old.Iannucci and Blackwell's telling is, thankfully, totally unsentimental, which is more than can be said for the book. True, it does make some surprising changes (Barkis, for example, is not included, and Mr Creakle is not where he usually is) but those whose opine that it trivialises the story or plays down the seriousness of the original are, in my view, wrong. Two lives are unexpectedly saved, but it's clear to see why: their inclusion would weaken the storytelling in exactly the ways in which they weaken the novel.However, there are some problems with the adaptation. While there may be justification for paralleling David's life with Dickens' own, it doesn't help an already-crowded narrative to use this as a structural device. On the other hand, some of the we don't need that omissions are misjudged: I think we do need someone to suggest to David that he traces his one remaining relative after breaking with the Murdstones.On the whole, though, I loved the energy and sweep of it all, its wit and bravura. Dev Patel, as always, wears his vulnerability on his sleeve, which mostly works for him here, though his rage when he leaves the blacking factory was not perhaps as raging as it might have been. As for his objects of his affections, Rosalind Eleazar as Agnes Wickfield, and Morfydd Clark as Dora, are absolutely perfect. Ms Clark is cleverly cast in another role that again shows that the adapters are not as superficial as some commentators suggest.All in all, a well-made exercise in shaking us out of our complacency, to be applauded and supported. More please."}, {"id": 226, "text": "The Personal History of David Copperfield (2019 release from the UK; 119 min.) is the latest big screen adaptation of the 1850 Charles Dickens novel. As the film opens, Copperfield addresses a theater crowd and then we go back in time as we (and today's David Copperfield) watch the arrival of David as a baby at the Rookery house, where his mum lives. Years later, his mum is now a widow and young (7-8 yr. old) David is doing great. Alas, his mum decides to remarry and his stepdad is outright mean and miserable. It's not long before his stepdad send young David to go work in a factory in London, corking bottles... At this point we are 15 min. into the movie.Couple of comments: this is the latest from Scottish director Armando Iannucci, whoser previous film was the delightful satire The Death of Stalin. Here he brings us the umpteenth big screen adaptation of the Charles Dickens classic. The tale is well known, and so the issue is whether this adaptation brings it in a fresh perspective. Well, for starters, Copperfield is played by Dev Patel (of course another actor portrays young David Copperfield), and there are a number of other Indian-British performers in the film. I read that when asked why Patel plays Copperfield, the director said he's the perfect guy for the role, and that was that. The film sprinkles the humor left and right, but because it is of course also very British, I couldn't tell at times whether it was meant to be comedy or satire. The production set is fabulous looking from start to finish. And yet, and yet, I can't quite put my finer on it, as I fail to understand the many rave reviews that this film has been gathering internationally (it also is rated a 93% Certified Fresh on Rotten Tomatoes).The Personal History of David Copperfield premiered at the 2019 Toronto International Film Festival, yes almost a year ago. It opened in the UK in January. It was supposed to be released in the US this Spring, and then a little thing called COVID-19 happened. Here we are 6 months later, and the big theater chains like AMC and Cinemark are slowly starting to reopen. The Personal History of David Copperfield opened this weekend and the Friday early evening screening where I saw this at here in Cincinnati was attended dismally (4 people, including myself). As mentioned, this latest retake of the David Copperfield saga is not quite my cup of tea. But don't take my word for it! Please check it you for yourself, be it in the theater, on VOD, or eventually on DVD/Blu-ray, and draw your own conclusion."}, {"id": 227, "text": "We are now very used to modern interpretations of Shakespeare where the casting is let me say inventive and innovative and here we have a version of Dickens which takes the same refreshing approach .In 2020 it shouldn't matter who plays who , acting is a skill not defined by colour , race or creed so I commend the choice of each character - your vision of Dickens Victorian Britain will be redefined .Anyone who has listened to or seen Mark Evans interpretation of Dickens in The bleak old shop of stuff or Bleak expectations will be in for a treatArmando Iannucci has produced another masterpiece after The Death of Stalin . Superb interpretation, script , acting , plot , locations , make up , costume and lighting .Stand out acting by Aneurin Barnard playing Steerforth , an actor who hasn't reached his full potential yet - could easily see him playing Marc Bolan in the inevitable musical biopic , closely followed by Ben Wishaw as Uriah Heep. But all of the cast were brilliant too.A thoroughly enjoyable film you'll laugh from start to finish and enjoy the genius of Dickens with his pastiche of Victorian live for Rick and poor rags to riches and riches to ragsGo see itPad.A 9/10"}, {"id": 228, "text": "The driving forces behind this movie are the performances and the characters. Each character has at least one oddity about them, from talking through her dog to a hatred of donkeys. Dev Patel as the titular Mr. Copperfield has great chemistry with the whole cast which helps to ensure that the jokes don't fall flat, and Armando Iannucci and Simon Blackwell's script is full of those.The stand out performance of the film is, in my opinion, Hugh Laurie as Mr. Dick. He owns every scene he is in and many of the funniest moments of the film involve him. This is a film that depends entirely on its characters and, as well as Hugh Laurie, includes great performances from the likes of Tilda Swinton and Ben Whishaw. It's their individual quirks that lead to the best parts of the film. The costume and production design is also great, replicating the era and highlighting the difference in conditions poor people and rich people lived in.Overall, this movie can simply be described as a good time."}, {"id": 229, "text": "Parody is ... a seemingly absurd or contradictory statement or proposition which when investigated may prove to be well founded or true. There is little that is a parody or of anynsubstance in this weak confused deconstruction of Dickens sublime intelligent novel.It brings shame on otherwise talented actors/actresses that have sold their thespian soles to the devil with this weak retake. I urge film lovers to watch the original BBC drama from 1999,. rich in dialogue that showcases Dickens and the excellent roles played by the actors in early walker out of this one, very poor effort that puts political statements about colour blind acting before quality production, before quality script or acting.Sadly those actors will only be remembered now for all the wrong reasons in this immensely forgettable production.Find something better to do with your time."}, {"id": 230, "text": "Dev Patel stars in The Personal History of David Copperfield, a multicultural riches to rags, and back to riches dramatisation of the Charles Dickens classic tale. I let director Armando Iannucci lead as I didn't know the story, and he took us on a merry dance through Victorian England. The story gets going with adult David a fly on the wall as we watch his birth, with Aunt Betsey Trotwood arriving to see the girl being born. Tilda Swinton is very disappointed when she is a boy! But David's childhood is filled with his loving mother and nursemaid played by Morfydd Clark and Daisy May Cooper. What a scream she was. But sent away from those idyllic times, as most Dickens children must be, by his harsh new stepfather and equally harsh sister.David is to lodge in London with Peter Capaldi's Mr Micawber and his wife played by Bronagh Gallagher. His first night dinner is a meal of riches for the family who are just about in front of the debt collectors, although they literally are at the door. As we watch the baby is being pulled hilariously along on a rug that's on it's way under the door. Fortunately Armando is good at the comedy as David's bottling factory job is particularly Dickensian! With fabulous production design by Cristina Casali of the grim side of London. With gorgeous cinematography by Zac Nicholson.After a family tragedy and the debt collectors finally catching up with the Micawbers, David makes his barefoot way to his wealthy Aunt Trotwoods's country home. Her lodger Mr Dick played by the affable Hugh Laurie, with a fascination for Charles I, he thinks when Charles was beheaded all of his thoughts flew into his own. High as a kite, but with his head rightly fixed on when it's needed. And the two of them make a lovely, if chaotic, new home for David. Donkey riding is not on the playlist. We are introduced to Aunt Trotwood's lawyer, the genial, but ever thirsty Mr Wickfield, played by Benedict Wong, with Rosalind Eleazar his sharp daughter Agnes.But when school beckons David again leaves those he loves, to board at The Strong's school near the Wickfords. With Anna Maxwell Martin as the inappropriate, but funnily lascivious Mrs Strong, and Ben Whishaw playing what must surely be one of the most awful Dickens characters ever, Uriah Heap. Weasling his way into peoples lives with his mother and her heavy cakes. Well done to Ben for playing such an odious toad with such relish.Amando gives us a whistle stop tour through David Copperfield with a top class cast and bite size scenes that tell us everything we need to know. The scenes are set with the colourful characters as they weave through David's life and times, just the way Dickens intended, while fashioning his career around the writings jotted down over the many fruitful years. Maybe not quite as Dickens himself lived, but he would have found the whole spectacle a hoot. Like a wander through Wonderland. Characters appear onto the set quite by accident, not quite sure why they are there, and David doesn't always quite fit in the rooms. But when Aunt Betsey and Mr Dick find themselves in reduced circumstances they pack themselves into a room the size of a cupboard, and there's still room for more. And the Micawbers sad tale is always told with a spring in their step, homelessness is but an alfresco picnic, and if they're always short of a pound or two themselves, they marvel that writing a 'Personal History' can bring such riches. With David happily sharing his life with those who helped create it.And surely now there may be donkey rides after all."}, {"id": 231, "text": "Let me begin with saying that I think the casting of this film is genius. I've admired Dev Patel ever since I saw him in Slumdog Millionaire and he hasn't disappointed since.I also love the whole style of the film, jumping into the film with David narrating his life for an audience and then walking into a screen, entering his life and walking through his childhood as an adult, followed later by him writing out his own life, very creative and fun to look at. It's also a very colorful film, while other adaptations of Dickens novels usually look grey and dull in colors, this film really stood out with a sea of colors, Betsey Trotwood's house, all those interiors was just wonderful to look at. One could frame any screenshot of this film and hang on the walls.It should be a film I love, yet there is something important that drags it all down for me - The narration. David Copperfield is a very big book by Charles Dickens, and according to goodreads, the book got 882 pages, so it's obvious that there's a lot of story going on for David. And while this films tells the whole history of David, it feels like snippets from each chapter got cut away from this tale, the jumping from events in this film went too quickly and I had difficulties following along many times as the film rushed through important events of David's life like a train not staying at any station.Usually for a film based on a big book like this, they usually cut off big parts that might not be important enough, or they make it into more than one film (this might not be the right one to split into two films). This film however wanted to both have its cake and eat it as well. It should've been done into a series, or at least a mini-series so it could tell all of what it wanted to tell, flesh out the characters more, they all deserve it, because now you end up not really caring of many of them, because they just didn't get enough time to show us why we should care.I might revisit the film again in a couple of years to see if my rating was a bit too harsh this time, but I know that even in the future, I will still love the colors of this film."}, {"id": 232, "text": "Armando Ianucci offers a Monty Python take on this much-loved (and much-filmed) Dickens novel, emphasizing the comic elements more than the romantic drama that is usually highlighted. The director's other big innovation is colour-blind casting, with several black and Asian actors, including Dev Patel in the title role. Hopefully it's a sign that we are maturing as cinema-goers, but this casting 'anomaly' within minutes seems completely natural and completely 'right'.Apart from Patel and Ben Whishaw (as a harder tougher Uriah Heep), the most outstanding performances come from actors with longer career histories. Hugh Laurie hits a new high as Mr Dick, David's delusional distant cousin. Peter Capaldi's Mr Micawber is a pantomime take on his Dr Who and Tilda Swinton gives a rich fruity version of Aunt Betsey Trotwood.There are some clever camera tricks, such as the location peeling back like an onion skin. For my taste the humour was sometimes too manic, but at its heart the film offers vivid insights into the creative process, which was very much central to the novel in 1850. The Monty Python comparisons kept coming back: after The LIFE OF BRIAN we have a clever and irreverent LIFE OF DICKENS."}, {"id": 233, "text": "This new film adaptation of Charles Dickens's original story David Copperfield is one that nobody should miss! The costumes and sets are superbly designed to take you all the way back to the 1800s. The acting performances and storyline just add to the strengths of The Personal History of David Copperfield. The only weakness is that the plot is somewhat confusing and a bit hard to follow. But otherwise, this film is definitely a must-see.David Copperfield (Dev Patel) is an orphan whose mother marries an evil man. David is forced to work in a bottle factory and live with poor Mr. Micawber (Peter Capaldi). The plot follows him as he grows up, makes friends, and goes through hard times.My favorite parts of The Personal History of David Copperfield are the costumes and sets. Every costume that appears fits the time period, character, and suits the storyline. Even the hair styles, hats and shoes are spot on. Dora's (Morfydd Clark) hair style, in particular, matches her personality. A lot of scenes throughout the film take place in England, in locations such as London, Bury St. Edmunds and King's Lynn. The locations and sets also help make the time period clear, and express the general mood of the movie. Another thing that stands out is the acting performances. Tilda Swinton (as Betsey Trotwood) delivers my favorite acting performance, but the film is well-cast and most of the actors are strong in their roles.One weakness that stands out to me is that the plot is a bit confusing. The storyline has a lot to give if only it could be more clear about what is going on. At times, I am not sure if what is being shown is his imagination, a memory, or if it is actually happening. Younger kids might not understand what is happening and might miss important elements of the story.The message is to not judge someone by the amount of money they have. For parents to know, there is a little bit of physical fighting but not much. There are also a couple scenes and a bit of the storyline based around alcoholism and being drunk.I give this comedy- and drama-filled film 4.5 out of 5 stars. I recommend it for ages 11 to 18 and adults. Reviewed by Kyla C., KIDS FIRST!"}, {"id": 234, "text": "This is a likeable film, with some comic touches handled with Armando Iannucci's characteristic skill. Dev Patel plays David with his customary charm, and it's not all played for laughs.It brings out the themes of family life, financial insecurity, friendship and deception, and - especially - child abuse, which David suffers shockingly at the hands of the Murdstones (Darren Boyd and Gwendoline Christie) and in factory labour.Its period details are vivid, especially in bustling City of London scenes (even if the lighting makes Victorian England look too sunny). The character of James Steerforth (Aneurin Barnard) develops subtly, from something like an upper-class twit to a nasty piece of work. It was a clever idea to have the same actress (Morfydd Clark) playing David's mother Clara and first wife Dora. In one scene there's a nice, and pointed, touch of topical relevance to rough sleeping.Ben Whishaw makes Uriah Heep look truly odious and brings out his sinister cunning, though I think Nicholas Lyndhurst was even better as Heep in the 1999 TV adaptation.The film obviously takes some liberties with the novel. Heep and Steerforth know each other though I don't think they ever meet in the novel, some characters are missing, especially Tommy Traddles (a loyal friend of David and foil for Steerforth), perhaps Mr Dick (Hugh Laurie) is a bit too prominent, Agnes (Rosalind Eleazar) seems more forward than I remember in the novel and Micawber (Peter Capaldi) rather slyer. The intimate relationships between David and Dora and between Steerforth and Little Emily are shown but not developed. However, the climactic scene relating to the latter couple is extremely powerful and true to the novel.There's some un-Victorian language when Betsey Trotwood, well played by Tilda Swinton, exclaims on her lawn This is a donkey-free zone.Dickens's novel really deserves a double film, like that of Little Dorrit by Christine Edzard (1987). This would do justice to the ways in which David learns from his varied experience. Maybe too expensive to make nowadays?"}, {"id": 235, "text": "Classic story, one of the best casts any movie has ever had, but one of the worst movies I have ever seen.First of all the casting doesn't make any sense at all. I understand involving diversity even at the cost of throwing out historic accuracy but this just didn't make any sense at all and was weird and confusing on top of which it destroyed the point they were trying to make.The story was if you could believe it uninteresting, the presentation in the form of weird effects did not work at all.The only positive thing I could say was the acting since it had amazing people in it but that all got lost in the horrible movie itself.When will they learn if you are making a movie just keep some resemblance of logic and don't try to jam every modern active issue into it, this never works."}, {"id": 236, "text": "If you've never read any Charles Dickens, his fictionalised autobiography David Copperfield is probably not the best place to start, and if you watch this, it will put you off. If you have read it, you won't recognise it here.This version is exactly the sentimental, bourgeois, super clean, received pronunciation, overacted thespian realisation of Dickens that I loathe. Zero atmosphere, over lit, gross liberties taken with the narrative, and that's in the first three minutes.Sentimental, antisemitic, tricky husband, Dickens at his best was a novelist who got into the minds of dozens of different characters (and his own), as well as devising killer plots with social campaigning on top; he got better as he went on, dying at 58 when he was hitting his modern stride.This film is a kind of Disneyfied caricature of his work. When Dickens is done in this cheerful, earnest, Jane Austen with workhouses way, it's dreadful. The darkness, the thing that makes him great, is here only skin deep."}, {"id": 237, "text": "Directed by Armando Iannucci who co-wrote the screenplay with Simon Blackwell, The Personal History of David Copperfield was never likely to resemble a BBC Sunday tea time serial that some of us remember from childhood days.Messrs Iannucci and Blackwell have previously collaborated on such satirical comedic work as The Thick of It, The Loop and Time Trumpet - Armando Iannucci also wrote and directed The Death of Stalin, a superb piece of satire, in 2017.So hopes for this first film adaptation of Dickens' classic in over 50 years were exceptionally high. They were met in full.From the little I've read of Dickens (Great Expectations, A Christmas Carol) I'm aware that he enjoys creating ridiculously comic characters with bizarre behaviours and physical oddities. And in this tale of the little loved, little wanted boy maturing into a young gentleman, the ensemble cast is given free rein to indulgently over-act to their hearts' content; it works brilliantly. There's not a weak link, every actor seems to be thoroughly enjoying themselves and this fun emanates from the screen. This is complimented by set, production and costume design all of which is flawless and adds to the sense of enjoyment. Cinematography from Zac Nicholson is also to be commended.The script is sharp and there are many laugh out loud scenes, with jokes both visual and verbal, especially in the film's first half. Social commentary is almost entirely visual. And it's moving; when the older David Copperfield speaks to his younger self at the film's end, I'm sure I wasn't the only one to well up.Mr Iannucci directs with energy and has a few tricks up his sleeve to keep the audience engaged.My only question is why Mr Micawber is not given his famous line: 'Annual income twenty pounds, annual expenditure nineteen nineteen and six, result happiness. Annual income twenty pounds, annual expenditure twenty pounds ought and six, result misery.' I can only guess the filmmakers are exponents of Modern Monetary Theory so decided to give this principle a swerve.The Personal History of David Copperfield is an unfettered delight from start to finish. I think this is going to become an annual Christmas treat for me."}, {"id": 238, "text": "I have enjoyed reading and re-reading various Dickens novels over the years; perspectives change as you grow older and there are often new things to discover. Likewise, I try to watch new adaptations of his works and find it interesting to see how well - or badly - each writer and director fares as well as how each actor approaches their character. UK TV has generally shown itself to be a fertile ground for good adaptations; cinema less so. There's a necessary tendency in films to go for shorthand depictions of character and plot - not to mention excisions of plot points and character development - for the sake of brevity in order to meet reasonable running times. I had high hopes for this particular film, given Armando Iannucci's talents as a director and writer but, sadly, it misses the mark repeatedly and doesn't benefit very much from his arch sense of humour. While a more casual viewer who just wants two hours of entertainment in the cinema or with a DVD in front of the tv might be well served by this film, it feels rushed, incomplete and occasionally badly edited to someone who has a more than casual acquaintance with other adaptations of Dickens' work. Maybe it's just not marketed at me (though I'm happy with its more ethnically diverse cast which more accurately reflects the reality of the times) but I've seen a fair few poor adaptations of this novel and this shares the same desire to rein in his appreciation for how the minutiae and milieu of Victorian England informs his work to the detriment of the finished product. The constant exuberance of speech is downright irritating at times and it is altogether too colorful and facile; it's a cinematic confection rather than a good film."}, {"id": 239, "text": "The Personal History of David Copperfield is based on the novel of the same name, by Charles Dickens. It's a fresh take on the inspirational story of David Copperfield, an orphan who goes through many trials &amp; tribulations in life.The Personal History of David Copperfield is a good movie. Director Armando Iannucci has given us an adaptation that is very novel when it comes to the casting process. The actors' race &amp; color weren't taken into consideration, when casting all the various iconic characters from the source material. This is commendable. The performances &amp; the dry humor are the standouts of the film. One flaw is that, the film drags on a tad bit &amp; the duration could have been about ten to fifteen minutes lesser. Dev Patel is spectacular as David Copperfield. Hugh Laurie is outstanding as Mr. Dick. Tilda Swinton is unforgettable as Betsey Trotwood. Peter Capaldi is amazing as Mr. Micawber. Jairaj Varsani is adorable as Young David. Ben Whishaw is fantastic as Uriah Heep. Benedict Wong is excellent as Mr. Wickfield. The Personal History of David Copperfield is worth a watch. You're left with a warm &amp; happy feeling, after watching it."}, {"id": 240, "text": "I wondered how Patel's casting would be explained by the story. It wasn't and sets the tone for all the jarringly juxtaposed choices. It goes without comment in an alternative Victorian universe. To a younger viewer, it would present a bizarre vision of history. With Hollywood's new diversity quota system, if a film is to be Oscar-worthy, this may be the only way for period films to survive.In fairness, the film is presented as a kind of theatrical fantasy but I found the unsubtle humour cringeworthy and the acting pantomimesque. Cliched characters were more caricature than ever, with the exception of Patel, who was excellent. There was a contemporary version to be made but this wasn't it.Nicely shot with a good score, it just about holds your attention for the (overly long) duration but it felt like a BBC TV film. In summary, a surreal, oddly cast, slightly smug, Carry On Dickens, mostly played for laughs with little emotional engagement."}, {"id": 241, "text": "The Personal History of David Copperfield has, on paper, stellar ensemble cast, while producers (in spirit of today political correctness) employed colorblind casting. But, too many great actors never really getting a chance to make an impact, notwithstanding movie struggles to make an impact. Also, no mater that the trailer promised so much more, for me the end result was mostly boring experience, while the film felt a lot longer then its 119m runtime. With so many sub-plots and characters weaved in and out, I found myself becoming irritated with the film. The movie, at the end, leaves you with a slightly unsatisfying taste in the mouth and I'm not so sure that Dickens himself would have approved this version of his 600/800 pages long book, because there is an undeniable sense of lacking something to give it more depth. Sadly, I don't think I would recommend to anybody seeing it.Rating: 5"}, {"id": 242, "text": "Whenever someone suggests the boring old tropes of woke film making (the leather clad obvious woman you're meant to think is a man on a motorcycle who beats up baddies lots then pulls her helmet off to shake out long hair, the only brown woman doctor-scientist-commander-president who knows everything and saves everyone world leader, the let's give the main character a male name but cast them as a blasian woman, the - well, the list goes on and on and on and bloody on!) producers should close their wallets as fast as we consumers do.I didn't watch this at the movies as I had low expectations and didn't want to financially reward the wokerati - so I watched it on popcorn time. And I am regretful I wasted my bandwidth on it. It was woeful. WOEFUL! It wasn't even Dickens anymore it was just wokerati garbage.I am SO thankful I didn't pay to watch this I'd be so mad otherwise! But good job proving white erasure isn't just a meme, especially with all the other light skinned actors being from a specific ethnic tribe from the middle east and not western European as the story setting dictates. If you want to marginalize our people don't expect our financial contributions to continue."}, {"id": 243, "text": "It was a very pretty film, the cinematography, sets and costumes are all very delightful.But I didn't feel like I was watching a story from Dickens, the story really fails to grasp any actual Dickens feel, and the plot tends to meander away from time to time. For an uplifting comedy of sorts, I didn't really find it that funny, it came across as a bit cringe.Now of course, the main reason for my low score is the god awful double standards in the casting. I felt throughout the entire film that maybe so n so would have played this role betterRead into it what you will, but it feels less like a film and more of a pandering to the politically correct woke nazi protest groups.Shame really, I was really looking forward to a good film"}, {"id": 244, "text": "I really wanted to stop watching it but, because the actual Dickens' story is so good, I stayed with it to the end.Left me with a mixture of feelings.Unquestionably different presentation.Excellent visual locations and scenery.Good acting and, in the main, some interesting characters.Strange casting though and not a lot of humour.Waited in vain to hear  Barkis is willin' .It portrayed enough of Dickens' story to work for me but not in a format that I would watch again."}, {"id": 245, "text": "This expensively made film is too long, boring, bloated, self-conscious, unfunny and indulgent. And I am sorry to say I found it quite unrecognisable as a production based on a novel by Charles Dickens.The book was written in 1849 and yet key characters are played by the following actors:Fisayo Akinade - Nikki Amuka-Bird - Tuwaine Barrett - Faisal Dacosta - Ranveer Jaiswal - Divian Ladwa - Phaldut Sharma - Peter Singh - Jairaj Varsani - Benedict Wong - Neilesh Ambu - Antoniya Gerimpapazi - Arun Kapur - Lamissah La-Shontae - Kwok Ng and of course, Dev Patel as David Copperfield.The casting doesn't seem very faithful to the book. In fact, it seems to be an exercise in heavy-handed, woke point scoring. Can an Asian actor play David Copperfield? Only if you accept that Benny Hill can play a Chinese man. And we all know that Benny Hill will never be seen, mentioned or heard of ever again. Why? Because what he did is now deemed TOTALLY UNACCEPTABLE.I smell double standards! White man plays black or Asian character = Unacceptable!! Black or Asian man plays white character = Great. Can no one else see the comparison?Like I say the film is not that great, but what jars most of all is the false, unrealistic, frankly laughable, placing of actors who in no way resemble the characters they are there to portray.Progress or a return to the 70s with the roles reversed? You decide...Oh, nearly forgot: The character Mr Micawber is described as a stoutish, middle-aged person. Here he is portrayed by the tall and wiry Peter Capalbi. Need I say more?"}, {"id": 246, "text": "My Review- The Personal History of David Copperfield My first COVID 19 Cinema reopening movie My Rating. 6/10 I was really looking forward to this movie for many reasons mainly Dev Patel as David Copperfield and he certainly is worth seeing its one of his performances. He is faultless in his role and at times Chaplinesque in his comedy and enthusiasm in the title role of David Copperfield . I'm reviewing the performances first because most of them are impressive but in my opinion the film itself fails and is a disappointment. Stand out performances from Tilda Swindon as Betsey Trotwood David's eccentric aunt and benefactress ,Hugh Laurie as her slightly dotty but intuitive cousin Mr Dick and Ben Whishaw as the slimy obsequious Uriah Heep. Charlotte Dirickx set decoration is beautiful to watch and is another plus in a film with so many minuses Zac Nicholson the Cinematographer has done a wonderful job as has Cristina Casalsi the Production Designer the film looks and sounds impressive . Costume designers Suzi Harman and Robert Worley are also excellent so I hear you say what's the problem ? Why only a 6/10 I blame Director Armando Iannucci who also shared script writing with Simon Blackwell in attempting to adapt a 624 page classic novel into a 1h 59m film to say it's romps along at a hectic pace is an understatement it's Dickens on speed. Iannucci is a very good writer I loved his film comedy The Death of Stalin 2017 I didn't like his series Veep but thought his In the Loop 2009  very good . Any writer who tries to rewrite Charles Dickens or William Shakespeare better have a good reason or something new to say and what happens in this movie to my mind is a dumbing down of a classic and an attempt prove that a colour blind cast can work in a movie. I thought the choice of Dev Patel was inspired so I'm not at all against the best person regardless of ethnicity should get the role. I found the use of a colour blind cast in The Personal History of David Copperfield at times just silly and distracting and used to obvious excess . Scenes like young Steerforth who's obviously Caucasian introducing his mother Mrs Steerforth played by a wonderful actress Niki Amuka -Bird who obviously is Black skinned and couldn't possibly be his mother see just ridiculous and unbelievable. Of course the best actor should get the role but some of the choices of roles in this film like Benedict Wong as Mr Wickfield I'm sure have just been chosen as tokens to colour blindness he's not very good at all in the role. In summary it's a film worth a look for the performances I think Charles Dickens would be horrified and judging from the general critical response to this film I hope we don't see more experiments like this."}, {"id": 247, "text": "The casting was weird and occasionally took me out of the movie. This movie is supposed to be a period movie set in the English past, but half of the cast is Indian, black, or asian. My others problem with the movie, was that, the cast constantly talks to each other like it is set in present day.Normally I love and enjoy British humour. But, in this movie, they say and do a lot of things that are supposed to be wacky and funny, but they are not.Sadly, it feels like every other bad BBC tv or movie production right now. It is filled from start to finish with the appropriately predictable politically correct casting, and a lot of stereotypical bad white people ruining the lives of black, Indian and asian people, and the same stereotypical bad white fathers."}, {"id": 248, "text": "Whether I turn out to be the hero of my own story or whether that station will be held by anybody else these moments must show. David Copperfield (Dev Patel)Speaking in front of an audience in Charles Dickens' 1850 classic autobiographical novel and now in the entertaining 2020 dramedy based on it, The Personal History of David Copperfield is a work worthy of the master, whose life, like David's, was not dull.With acclaimed director Armando Iannucci, talented co-writer Simon Blackwell, and gifted actor Dev Patel, this farce has an enviable pedigree that pays off within minutes.Actually, it has been paying off 14 times for the last 110 years with six miniseries and eight movies. It continues to reward with a colorful, character-laden romance that may have too many episodes and characters but the probable approval of Dickens, who never created a character he couldn't love.It seems the filmmakers want to rescue Copperfield from the staid 19th century and place it firmly in our far more ironic, open-for-laughs 21st. If they tried to catch the richness of Dickens' characters, they succeeded: Mr. Dick (Hugh Laurie) is typically out there somewhere, Tilda Swinton is every bit as stiff as Aunt Betsy, and Peter Capaldi's Mr. Micawber, as ditzy and indebted as Dickens could make him, is worth the price.Add more seriously Ben Whishaw as David's constant rival, Uriah Heep, and you still have more eccentric characters than I have time to include. Just know that like the original novel, the film is rich with detail, both visual and cultural.Step back in time, the endlessly grimy London of Dickens to be exact, and know that you don't have to deal with the filth and poverty that David saw and worked like his creator to his glorious storytelling advantage. I wish Covid could provide such richness.As long as you're careful, go to a protocol-responsible cinema to see this luxuriously photographed tapestry of another time-big screen, big sound-that's what movies do. Besides, it's not streaming yet so what choice do you have other than staying home, a decidedly more comfortable place than David/Charles had but never as interesting?Don't worry. You'll make it through. And you'll have quite the ride on the way. David"}, {"id": 249, "text": "There's no reason a quirky, modern-sensibility, color-blind-cast version of David Copperfield couldn't work...if it had a coherent vision, and wasn't those things just for the sake of it. But--well, you guessed where I'm heading with this. I've liked his prior political satires, but I have no idea what this director thought he was doing with the material. There's a lot of cutesy, wink-wink distancing tactics, lame comedy improv riffing and theatrical artificiality, alongside more realistic period details. The combination never makes sense as any kind of deliberate commentary or even parody--it's just empty, failed cleverness. The performances are often gratingly over-the-top (ouch, Tilda Swinton), as opposed to enjoyably so. As others have noted, Ben Whishaw is probably the standout here, and that is because he is just about the only actor who plays his role straight, as if he were in...er, David Copperfield.I wouldn't even have minded the overall comedic tilt if the film were actually funny. But instead it's just a mess of half-baked tonal and design ideas that never coalesce, always call attention to themselves, and are idiosyncratic without actually being amusing or pointed. It practically does to Dickens what Tim Burton has done with various (mostly Disney) classics in recent years--given them a garishly loud new coat of paint, crank up the performances to caricature, ramp up the pacing for short attention spans, and seem to be vaguely parodying the source material while still expecting you to find it heartwarming. I'm sure somebody thought this would all turn out a fresh take on a familiar story, but it winds up feeling like it trashes that story without coming up with anything truly new beyond shallow gimmickry. What a disappointment."}, {"id": 250, "text": "I'm sadly lacking when it comes to an appreciation of Dicken's David Copperfield story. I've heard of the characters, but I've never read it and I think that this is the first adaptation of the story that I've seen. It's one that l liked a lot, though I would have preferred a little less of its funnier moments to have been in the trailer.David Copperfield (Ranveer Jaiswal and then Dev Patel) recounts his life story of alternating poverty and plenty, as he attempts to manoeuvre through his youth whilst maintaining his moral character. He meets a cast of personalities; some rich, some poor, some moral, some not, but all leave a mark on young David as he struggles to find his place in a world that he doesn't quite fit into.Armando Iannucci and Simon Blackwell have put together a really impressive cast for this adaptation, with a lot of UK comedy's most gifted comic actors, to reflect the comedic lens that they are pushing the original novel through. Peter Capaldi, Gwendoline Christie, Morfydd Clark, Huge Laurie, Tilda Swinton, Paul Whitehouse, Ben Whishaw and Benedict Wong to name a few. Everyone is note perfect. . . none more so than Dev Patel who carries the bulk of the film on his capable shoulders. With everyone else allowed to play up the eccentricities of their characters, he is the grounded force at the centre. There are some lovely dreamscape-esque moments too, as stage becomes set as the walls fall away.Unfortunately, the quality of the performances doesn't quite match up in the overall quality of the film. With the comedy turned up, the more dramatic parts of the story seem slight, the Micawber family out on the streets and the outcome of the sea journey near the end, for example. Unfortunately, I'd see the trailer for the film a few times before I saw it too, and a lot of the better comedic moments featured in that. (I'm not totally sure I can hold that against the filmmakers directly, but it did impact my enjoyment).Overall, I'd say that this is a fine adaptation and is worth watching, though if I'm honest I think I'd recommend waiting for the streaming services/TV showings, rather than heading to the cinema."}, {"id": 251, "text": "This film has a pretty star studded cast so I went to see The Personal History Of David Copperfield and this is my review for the film. The premise of the film goes through the life of David Copperfield as it shows him meeting plenty of eccentric characters that will steer his life in many different directions. Main Character Dev Patel plays David Copperfield in this film and I feel like he does an okay job in this film, he has a mixed performance for me. In some scenes he does a great job, with some really powerful scenes and some really good dramatic acting in the film, but he does what pretty much everybody does in this film and that is overact. This character just comes across as a bit of a mean guy and a bit wacky without much explanation, there is also a part of the film that makes him seem quite creepy which doesn't help for the character. I actually felt more sympathy for the character in his early years as a child then I did when he grew up to be Patel. Supporting Characters As seen in the poster this film has a vast cast but I will just talk about the main characters that support Patel in the film. Tilda Swinton plays his aunt in the film and she does a good job in the film, she fits into this film well and is fun to watch her perform in the role that she clearly enjoys. Hugh Laurie plays a big role in the film and he does a good job too, his character is probably the weirdest in the film and at times it just feels too weird but Laurie manages to add enough charm to the performance to make you like him in the end. Ben Wishaw does a really good job as a slimy, creepy character in the film and you really will not like him which is the point of his character so a good job by the actor. The only performance I didn't really care for was Peter Capaldi's his accent was all over the place and his character just wasn't particularly likeable in my opinion, the film tries to make you care but I just didn't really care about him or his family in the film. Story Now I will admit that it is interesting seeing the journey of David Copperfield in the film, he goes many different places and encounters many different places which provides many different interesting social situations. However, it is also a problem with this film, it tries to cram so many different stories in the film that unsuprisingly some are more interesting then others and this takes away from the overall quality of the film. Also the ending of the film leaves some characters fates unrevealed which hurts there stories through the film. Script The dialogue has a mix of some decent dramatic dialogue and some chuckle worthy humor for sure, but nothing ever really stands out. It is all okay which from a cast like this I would be hoping for some great dialogue and memorable lines but it is just pretty forgettable. Style This film looks great, it fits the time period that it is set in and you do feel like you are following Copperfield all around the country. But as alluded to earlier the pacing of the film is a big issue, it feels like this might have even been better suited as a mini series then a film due to the amount of content they try and fit into this short amount of time. Also there are just some headscratching castings which just don't really make any sense, I get the director was trying to be very inclusive but at times it just makes absolutley no sense which takes you out of the film and the experience. Overall It seems most days, performances in films can drag average films to higher levels and this film is no different, some good performances in this film drag it to an above average level but I would only recommend this film if you are a real fan of British Cinema or of Charles Dickens as this might be a better experience for you."}, {"id": 252, "text": "When it comes to Armando Iannucci, I'm more used to catching my breath from the sharp impact of the writing than I am anything else, but in the case of 'Personal History etc' it was a much lighter affair than I would associate with him. I'm not any great associate of the source material, which meant I came to the film without any great expectations (deliberate, and I do not apologise for it) and was able to see what it does on its own merits. From the very start it has an enjoyable fleetness to it, one that has an upbeat energy to it, even if it doesn't have a huge amount underneath.It works surprisingly well though - even though two hours is a bit of a stretch for a film with this approach. The story has an enjoyably absurd and fantastical edge to it, that does the opposite of grounding it - it gives it wings to be silly but yet still engaging as a story. Perhaps as a result, it has no great roots or substance and this does limit it, but it does make for an enjoyably light and slick film - it has plenty of laughs and silliness, and the way they rely on the moment doesn't really matter when the next moment is just around the corner. Indeed it is the quality of delivery in the moment that makes the film work, because it is enjoyable there and then. The production values are a big part of this; costumes, sets, locations, production design, make-up etc all work together to produce a detailed sense of place but yet have a slickness that fits the tone. The cast do the same - they are never really engrained, even when it matters, but they all produce the goods in a moment or a line; Laurie steals the film, but they all do solid work throughout.Overall, it is a whimsy. An enjoyable film that didn't really leave a lasting mark on me despite me having positive things to say about it."}, {"id": 253, "text": "Coming to review this, I find myself in two minds. I love Dickens and I liked the story of David Copperfield, so I was not surprised to find that fans of Dickens and David Copperfield did not like it or were annoyed by the handling of story. If the director and writer were trying to make a faithful retelling, then they failed, miserably. The thing is I am fairly certain this is quite deliberately NOT a retelling of David Copperfield. I don't think it was even meant as an adapatation (at least I hope not.) What you need to know is that, for Charles Dickens, David Copperfield was not only one of his favourite stories, it was also semi-autobiographical. In telling the story of Copperfield, he wound in many elements and characters from his own life. When Dickens became a success, he toured the country giving very popular readings of his books, which is where this film opens. The story of David Copperfield is also, to some extent, telling the story of Charles Dickens, and that is what I think this film is doing. It is BOTH Dickens telling the story of David Copperfield but it is also about how his story (David Copperfield) tells us about Dickens. You really need to know both these facts for the film to make any sense at all. In a nutshell, what I think the film REALLY is, is the director telling the story of Charles Dickens telling the story of David Copperfield telling the story of Charles Dickens. If you have read the novel and are expecting a faithful screen version, you will be immensely disappointed, many of the nuances of the characters and their relationship to Copperfield, which is the heart of the book (the heart of any Dickens novel, in fact) are completely lost. If you have not read it and know nothing about Dickens, it is going to seem shallow, rushed and a little weird. If you are fascinated by Dickens and are able to view this NOT as the story of David Copperfield, but as a film about Dickens and his journey to being an author, which so happens to have that name, you might find it interesting, entertaining, and at times, fun."}, {"id": 254, "text": "Let's get this out of the way.I am truly appalled at the repeated hateful reviews expressing their ridiculous disappointment that certain roles have been cast with non-white actors.People that complain about people getting offended seem to be getting very offended.The film on the other hand was very enjoyable.I was a little worried in the first 20 mins, as it felt a little scattered and nothing seemed to flow well.Thankfully, things quickly improved and the relationship with the characters develops.I also loved the visual style they used to transition the actors from one scene to another. It worked really well.Don't expect 'classic Dickens'. This is a modern reimagining and doesn't pretend not to be. Ater a shaky start, it delivers the story in a witty heartfelt package."}, {"id": 255, "text": "'The Personal History of David Copperfield', the 2019 version of Dickens' famous novel, directed by Armando Iannucci, will baffle a lot of people, and is likely to be equally criticised by those who should praise it and praised by those who do not expect to like it. What is already clear is that we are dealing with the most original film version of this story that has ever been made. Hard Dickens fans who believe that historical fiction should be as close as possible to the times and that fidelity to the letter of the book is important will probably be outraged. Fans of Dev Patel, Tilda Swinton and other great actors who are part of the cast will be happy to see them on screen in roles that they obviously played with pleasure, but may object in the end that the talent of their favorites was wasted for colourful but superficial roles. Those who have a good chance of liking the film are the spectators who are looking for original ideas, no matter how crazy, and there are enough of these in this unusual adaptation of Dickens, from the vaudeville atmosphere to the multi-ethnic cast which seems to have been built up to meet the recent Academy requirements for the Best Movie award (valid from 2024), although the distribution and execution of the film were completed before 2019. The result is a fun and chaotic film, which is likely to be disliked by some, to become cult film for others, or simply to bore the blasé. The story is well known, at least to those who have read the novel. The more than 600 pages of the book that tell the melodramatic story of the orphaned child who is sent by his stepfather to the severe schools and then to the exploitative factories of mid-19th century England, followed by the coming of age and confrontation of young David Copperfield (Dev Patel) with a destiny full of ups and downs, are concentrated in less than two hours of screening using the pretext of a conference combined with a theatrical performance. The memories of the grown up David are transformed with the versatility of a magic wand of the illusionist who borrowed the name of Dickens' hero in a version of comic theater, in which the stage convention is combined with the effects of cinematography, an art that would be invented only half century later. However, the stage-screen convention allows the smooth absorption of the eccentric casting proposed by Armando Iannucci. A stage director has much more freedom than a film director in proposing his own vision of the world and of the literary work he adapts, the versions for the stage not having to obey the rules of visual that apply to movies. The resulting comic effect consists of the permanent comparison that the spectator familiar with the book makes between the characters as we know them and their incarnations on the screen. Especially true for the supporting roles. Tilda Swinton, Hugh Laurie, Peter Capaldi, Ben Whishaw play their respective roles with visible pleasure and add nice versions (but no more) to the on-screen character galleries that preceded them (on a movie blog I saw a list of 21 screen adaptations before this one). Dev Patel is a charismatic actor that one can't help but sympathise with, but he didn't seem to resonate in this film with any of the young women Dickens said he was in love with. What I found less successful in this screening was the narrative flow: events follow one another at an accelerated pace but something in the passage of cinematic time does not work. The result is that we do not have enough time to grieve for the blows of fate, nor to rejoice when the wheel of fortune turns in favor of the heroes. In addition, the costumes, colourful and fancy look good on the screen, but do not always reflect the psychological and economic condition of the heroes (an example - Mr. Micawber and family to be clean and polished even when they end up living on the street). The message of social critique of the expanding English capitalism in Dickens's novel is almost completely lost, its place is taken by the picturesque and character comedy. I think that this film will especially please those who have read the book in case that they are not outraged by the lack of adherence to the text, and the many admirers of the good actors in the cast, but for those unfamiliar with the story watching will be quite confusing. It is the most original screenplay of 'David Copperfield', but one that can excite or disappoint. Future spectators should consider themselves warned."}, {"id": 256, "text": "I've never read the book of David Copperfield, so can't speak as to the trueness of the adaptation, but then again who cares. The book is the book, the film is the film, and I thought the film was pretty fun!As with any Dickens, we are treated to a plethora of weird, fantastical, bizarre and engaging characters, who are all so well defined, with distinct personalities and purposes. All of them inject something unique into the story, and add value whenever they are on screen. A large part of this is due to the cast who were picked to perfection. All of them triumphantly brought to life the vibrancy of their characters, with Tilda Swinton and Peter Capaldi being my standouts from the supporting cast. Ben Whishaw as the skulduggerous Uriah Heep was another standout, they were all so watchable and engaging. Of course, Dev Patel as the eponymous Copperfield was charming, bringing a great energy and exuberance to his role.The story will feel familiar to fans of Dickens' works. Essentially a young boy navigating his way through London and his troubled upbringing and adolescent years. Very enjoyable as it goes, with lots of different elements. At times it felt a little rushed and jumpy, but on the whole I thought it moved through time pretty smoothly and inventively.I also loved the direction and the script, which were both very slick. The score, the camera work etc, all the technical aspects of the film were great, and really contributed to a well rounded film! Iannucci had a clear mission and really stuck to it, nailing the tone it was after.Despite never being amazing or jaw dropping, The Personal History of David Copperfield is a perfectly solid way to spend two hours. Any lovers of period films or light hearted comedy dramas will most probably find lots of enjoyment here!"}, {"id": 257, "text": "This is a somewhat broad rendition of Dickens' novel which already has so many broad/arch characters and situations, but it's very enjoyable overall. Towards the end, I realized: hey, the skin colour/ethnicity of the actors really does NOT matter. If they are good actors, you can have a fairly wide array of people one doesn't traditionally think of as native English people playing these very English roles. It works.I hope Hollywood is watching and this film has an impact on breaking casting stereotypes in America. After the film I was recommending to my companion, as one of the best cop TV series I ever watched, the series Homicide: Life on the Street. That had an African American actor, Yaphet Kotto, cast as a policeman named Giardello. It's 23 years later and yet it's hard to think of other films or TV I've seen with casting against physical or racial type.I've already download the Dickens novel from Project Gutenberg and I expect to re-read the novel I last read when I was in grade school and look into it a little. I'm interested in the degree to which there were autobiographical features in the novel, as I believe Dickens himself worked in a factory with child labour similar to that in Copperfield. One of the most popular things about Dickens, that has made him continue to be read (and filmed versions of his be produced) is his recurring theme of empathy for the poor, for the disregarded and for those with less power, who are often being dominated and abused by those who have power over them.It's perhaps, then, a particularly good place to start, casting visible minority actors in a filmed version of a Dickens novel. But no need to stop there. This art form is all pretence and making things up--let the art be more diverse and the treatments more creative."}, {"id": 258, "text": "David Copperfield, ey? Well not exactly, Charles Dickens more likely. Which as has been stated (and why shouldn't I believe it), this is more an autobiographical story about Dickens himself than anybody else. Especially not a magician, but a storyteller, that is for sure. Now I reckon many will know this even before reading this or watching the movie. I admit, I had no idea what I was letting myself see (not just because it was in a Sneak preview), but because I generally do not read anything about the movies I'm about to watch beforehand.Having said that, the movie can be quite entertaining. But the emphasis is on can be - why is that? Because some people will not like how the humor works in this or how it is being told. If you don't mind and like the mixture between comedy and drama ... this is for you. I know people who were annoyed by it. It's a shame because they miss out on the fun this can be. But different tastes and all - still performance wise this is top notch. Logic is out of the way ... sort of! Enjoy if you can, avoid if the trailer does not speak to you"}], "reviews_amount": 259}