{"name": "A Bad Moms Christmas", "titleId": "tt06359956", "reviews": [{"id": 0, "text": "So here's the deal, this is definitely not a good movie, it isn't exactly well written, the jokes are old hat.... but, it is a Christmas movie, and if you're wrapping your presents, eaching a box of chocolates, and on your third glass of prosecco you'll probably enjoy it.It's the usual format, the no good parent goes on a journey, they have bad times, a moment of anger, and a reconciliation where everything turns out wonderful, and they all set off on the yellow brick road. It is genuinely no deeper then that.It does have a certain charm, and nice message, that Christmas is about family, not decorations.I watch too much Family Guy, so when I blink or look away, I swear Meg's in the movie. Christine Baranski was the star of the show for me, great timing. 7/10"}, {"id": 1, "text": "I don't get the 1 star reviews. What exactly did you think you were going see? This was funny - lol at several points. If you don't like this kind of humor then why did you bother to even watch? I mean, damn, Kenny G!!"}, {"id": 2, "text": "I don't care what anyone else says, this movie is super funny!! It cracked me up! It was silly, over the top, and still honest. Plus it made me laugh so much and so loud. My husband loved it too!!"}, {"id": 3, "text": "It pains me to say it with it cast, but it's rubbish - it is fun though. If you just take it for what it is, it's worth a couple of cheap laughs. If you're going to pick it apart, avoid it. Good one for quite night in or an easy watch with friends."}, {"id": 4, "text": "Ok, I don't understand why people are giving this movie so many bad reviews. If they saw the first one then they should know what to expect. If you don't like these types of movies, don't watch. It's a simple as that. Was it a realistic version of what happens during Christmas, no but it's a freaking movie. I'd definitely watch it again. I actually thought it was funnier than the first one. Forget all the bad reviews and give it a chance !"}, {"id": 5, "text": "... Oh, because it isn't there!People are rating this a 1 when the Sharknado series exists? I'm putting the bah-humbug reviews down to holiday depression and humorlessness compliments of stressful family dynamics. C'mon, people, cheer up. I'm not even a fan of comedies, and I enjoyed it.PS- It doesn't set women back even a minute. If anything, it underscores how much pressure we put women under on holidays and how brilliantly they handle it compared to how men would."}, {"id": 6, "text": "I couldn't help myself I laughed all the way through this movie, even though it was really bad. Unrealistic, raunchy, and overly done. Still, I laughed all the way through this movie. It's not Oscar winning material, but great for a few laughs."}, {"id": 7, "text": "A Bad Moms Christmas is such a hilarious, loving, &amp; FANTASTIC movie. The original cast members came back to reprise their roles. The overall cast made the movie even better!!! A great storyline as well!!!"}, {"id": 8, "text": "Fun, enjoyable. Not amazing, made me laugh. Doesn't have to be too clever. Great film to watch while drinking at Christmas"}, {"id": 9, "text": "Ok right off the rift I am gonna point out I absolutely love inappropriate comedies although this one is low and mediocre. It's cool though fun for a free movie on Showtime! I really like the cast and how colorful the set designs are. There's some scenes with pure stupidity that's for sure but still pretty funny and I think the amount of foul language is a great delight! The wildly destructive parts are great, and Kathryn Hahn, Mila Kunis, and Kristen Bell are fun to watch being fools!"}, {"id": 10, "text": "This movie consists of a boring story line with an unnecessary Christmas theme. While some of the actors gave me hope of this movie being watchable, you will only feel dread as it drags on and on without any memorable scenes and a bronze lining of generic nonsensical comedy. Nothing but a seasonal money grab, huge waste of time."}, {"id": 11, "text": "This movie was trashy with mediocre writing... Yet I have no regrets watching it. I loved watching the cast engage in stupid debauchery. I laughed. I shed a tear. I got warm fuzzies. All in all it was a good time. It was more fun than your standard Hallmark Christmas movie."}, {"id": 12, "text": "A Bad Moms Christmas (2017)  This is a Christmas comedy film. A sequel to the 2016 film Bad Moms, it follows the three moms from the first film, dealing with their own mothers visiting during the Christmas holiday. It stars Mila Kunis, Kristen Bell, and Kathryn Hahn as the daughters, with Christine Baranski, Cheryl Hines, and Susan Sarandon as the visiting Moms. It received mixed reviews and did decently at the box office. It's an OK film for what it's supposed to be. Doubt you'll be clamoring to catch it a second time, but decent enough to watch the whole thing."}, {"id": 13, "text": "10/10 - hysterical and very relatable (not to mention a cast of some phenomenal female talent)"}, {"id": 14, "text": "As a huge fan of comedies that bring some laughs and escape to this world, and as a huge fan of well-known stars letting their hair down and having goofy fun in an R-rated, raunchy romp, I couldn't wait to see this sequel to Bad Moms, which I mostly loved and have now watched multiple times. Adding Christine Baranski, Susan Sarandon, and Cheryl Hines to the original cast seemed like a perfect match--how could it go wrong? In my mind just letting this group of talented actors improvise on the same set would guarantee big laughs, especially with Kathryn Hahn sparking the mix. I went to a paid advance screening a week before it opened to the public, plunking down my bucks without any fear of first checking reviews--I was that sure it would be at the very least filled with some laugh-out-loud moments, and plenty of amusing ones, well worth my time and money. Imagine my surprise, and disappointment, to find that the film is loaded with tired clichés of mother-daughter relationship problems, with nothing fresh or funny to offer, old jokes and sitcom situations you've seen done (much) better dozens of times on most any TV family sitcom, and that the script is so poorly-written it truly would've been better to just give the actors an overview of what the film was about and let them improv the whole thing. Finally it ends, and you're left with an almost embarrassing dance/romp during the closing credits that is supposed to be a celebration of the joy of the film and its production and cast, with the actors having a bit of an on-screen dance party as the credits roll. Instead of feeling that (forced) joy, I left the theater depressed and saddened at the waste of money and talent, and the waste of my time and money as well. Easily, for me, one of the worst comedies I've ever seen--and I've seen hundreds over the decades and my lifetime."}, {"id": 15, "text": "I don't care what anyone else says, this movie is super funny!! It cracked me up! It was silly, over the top, and still honest. Plus it made me laugh so much and so loud."}, {"id": 16, "text": "A Bad Moms Christmas may have fell into that comedy sequel flaw were the first movie was pure laughs and fun. And this sequel may have some moments were it can be funny, but overall it fell a little boring compared to the first movie. I enjoyed the first with Mila Kunis, Kristen Bell, and Kathryn Hahn playing mothers who are so overworked and unappreciated. They decide to take control of their own lives to have a little fun. Sure, there are some hilarious moments in this film. But it was not enough to carry the rest of the movie. Amy (Mila Kunis), Kiki (Kristen Bell), and Carla (Kathryn Hahn) are under appreciated and overworked trying to get ready for Christmas. They all get surprised by their mothers visiting them for the holidays. Then, there comes the drama with Amy's mother being the high maintenance snob, Kiki's mother being too clingy and attached to her daughter still, and Carla's mother who is a dead beat and only sees the daughter when she needs something. Straight to the point, Bad Moms Christmas had some fun laughable moments. A scene were Amy, Kiki, and Carla get a little drunk before they do some shopping at the mall. Kind of a familiar concept like the first movie, were they were trashing a grocery store. Also, a scene were they are at skyzone and playing dodgeball with their kids and their mothers also participated was also a lot of fun. But the movie does fail with having a plot. It is all about mothers struggling through the holidays, and there mothers show up to either wreck there peaceful holiday or give them a little meaningful message about how to handle there own personal life. There was a lot of moments were there was not many jokes or laughs happening. Especially, in the more dramatic moments when Amy and there mother part ways after a party that turned for a disaster in her house. And her mother and the other two mothers chat away about how they all mistreated their daughters. Overall, Bad Moms Christmas is a bad film. It has some brief jokes and laughs. But not as good as the first film. Mila Kunis, Kristen Bell, and Kathryn Hahn were great but the script was lacking in a more fun plot and humor. I rate the film 2.5 out of 5 stars. I recommend the film as a rental."}, {"id": 17, "text": "Loved the original, paid to see it three times at a theater. This is (for me) the WORST film of the year. The characters, particularly Hahn and Sarandons are repugnant, repellent and even I am embarrassed for them. What a waste of a terrific cast! I laughed ONCE (a joke about Sarandon's characters name) and that was it. I was really looking forward to this, but sadly, it seems as if the first film was a fluke or just dumb luck that it turned out as well as it did. I love raunchy R rated comedy but this Bad Mom is one BAD MOTHAH! 1/10."}, {"id": 18, "text": "This was unquestionably the absolute worst movie I have ever spent my heard earned money on, and I have never wished for a refund so much in all my movie-going years. While I wanted to walk out after the first 15 minutes, I instead chose to continue to wait, thinking that at some point soon the movie would get better and be worthy of some words of praise or at least one commendation. However, by mid- movie it was clear that this movie was only spiraling from bad to worse, and I would have walked out had I not been accompanied by the friend who chose for us to see it. It was ridiculous from start to finish, and not the least bit funny. I was just beyond embarrassed for these otherwise noteworthy actors. Truly, it was so awful that I kept waiting for the movie theater people to jump out from behind the screen and say Gotcha, and then start the real movie, but sadly, it was not to be. SPOILER: The only redeeming moments in the movie were toward the end when the father explains the psychological forces driving the mother's controlling behavior and the touching apologies that ensued between mother and daughter in the church. The only funny line was at the end with Baranski calling the boyfriend Jesus. Do not waste your money on this disgusting movie from it's scripted, blasphemous lines out of the mouth of a sweet young child (OMFG) to the truly vile salon male waxing scene, to the raunchy dance at the end that no child should ever be made to sit through. Just. Plain. Awful."}, {"id": 19, "text": "I love this movie. I hope they come out with bad grandmas. You must ha e a sense of humor to get this movie."}, {"id": 20, "text": "I remember this not doing so well in theaters but just watched it with a group tonight. We will definitely not watch a movie if we're bored but we loved this movie. There are some sweet story lines, some quirky humor, and some great raunchy humor. We loved it. Had to rewatch some scenes (the spa scene with Justin and Kathryn is hilarious...and, dare we say, classic). So, go into this with an open mind and be ready to laugh."}, {"id": 21, "text": "Do not waste your time! I am not writing often- usually when I have something nice to say but this time I have to! Film was ridiculous!It is not a comedy! It is not a family movie! It is hardly the drama! WHAT WAS THAT REALLY!!!!????? I went with my best friend to see this movie yesterday to get into Christmas spirit! OHH.....If only I could turn back time....such a waste- all of the great actors...I do not have idea why or why Susan Sarandon even wanted to be part of that sham!!??? One word- OK two- HUGE Disappointment!!!! Avoid!"}, {"id": 22, "text": "Grade: FRating: R, 1 hour 44 minutes of tortureIn a Nutshell: It's bad. There are moms. And it's Christmas.I'm a mom, but CLEARLY I'm not the target audience for this trashy attempt at a comedy.Christmas is, by far, the most stressful time of year for moms, explains Mila Kunis' character. Yep. While that's very true, that's no excuse for the horrible behavior these irresponsible, obnoxious, rude moms engage in. Yes, extreme absurdity has long been a formula for comedy, but 80% of the jokes in this sequel are super raunchy, and the other 10% are simply not funny.There's no talk about the true meaning of Christmas. None of the women in this film seem to even know anything about Christ or what kind of behavior He expects from His followers.Uplifting theme: Mother/Daughter relationships Family is most important.Things I liked: Kenny G! Christine Baranski is such a critical, evil mother. She's great in all of her movies and even sings a little in this one. Surprise cameoThings I didn't like: The writing is terrible. None of the characters are capable of uttering a sentence without some kind of profanity in it. Lots of fighting. Why is that funny? Kristen Bell is so talented. Why would she ever want to be in such an awful movie? Oh yeah\u0085.money. Kathryn Hahn's character is so foul. Her role was the stand-out in the first Bad Moms movie, so they really went over-the-top with her in this one. Everyone is so critical of everyone else. I hate listening to kids scream and cry in movies. Lots of slow-motion musical montages. These moms sure have a lot of spare time to hang out with each other and get drunk a lot. Instead of the feel good song at the end, a dirty Santa does a strip tease in front of the entire family. Mila Kunis manages to push out a tear in what is supposed to be the big emotional scene of the movie, but the dialogue was uninspired and droll.Interesting Lines: It's like a giant stress ball from Christmas to New Years. – Amy (Mila Kunis) Trust me. Some day she will thank me in an inspirational speech in some large, public venue. – Amy's mother (Christine Baranski) I laughed out loud at that line, because I think every mother secretly has the same wish. Tips for parents: About 45,362 F-bombs. Even an adorable little girl uses it. Other profanity and extremely crude language. LOTS and LOTS of talk of sex, as well as imitating sex with clothes on. Moms smoke marijuana. Women kissing women. The moms commit various crimes. A bunch of Santa Clauses strip on a stage. Nude man on a waxing table (private parts hidden). MOVIE REVIEW MOM@trinaboice"}, {"id": 23, "text": "It really is such a shame that the world is full of humorless offendable snowflakes these days. Why so much negativity?This movie is funny. The characters are very likeable. The fantastic cast do a great job. And it's all about Christmas. What's not to like.If you're so wrapped up in life's misery and reality TV and PC nonsense that you've forgotten how to chill out and enjoy some simple but well presented comedy then I advise you pass this one by. Otherwise, sit back, shrug off the stress, and have a laugh. I did.10 out of 10 for making me laugh out loud and even cry a little after a stressful day dealing with snowflakes."}, {"id": 24, "text": "First of all I have read numerous comments criticizing this movie... anyone expected a master piece? Please, it's a perfect Sunday afernoon movie, I laughed my ass off... watch it you do not regret it"}, {"id": 25, "text": "Aside from the gross profanity and coarseness, vulgarity, obscenity, impropriety, etc., it leaves no message, no moral, no lesson, the acting was bad, the plot was bad, and to top it off, it wasn't even funny. The girl who uses God's name in vain just goes to show that anyone is willing to let their kid take an acting role even if that means he has to blaspheme and use God's name with utter disrespect. This is by far the worst movie I have ever gone to. I would give it zero stars if it allowed me to."}, {"id": 26, "text": "1- The trailer sums up all the funny bits in the movie, rest is epic crap 2- Horrendous acting 3- Brain numbing dialogue 4- Outlandish (like crazy ass outlandish not inspiring outlandish) incidents 5- Stuck up its own ass writing 6- A diarrhoea of events with no specific relation or logic OK if that's too general for you, Carla (a very mediocre- looking middle aged woman with no education, career, wits, or any prospects of any nature) falls in love at first sight while staring at the massive penis of her fire-fighter stripper handsome heart-of-gold hunk who has a six pack, and obviously some sort or testicular condition because he does not flinch or even grimace as she waxed his balls. And he loves her back at first sight too because she treated him like a human being not just a penis (she didn't). Oh zo zweet! Does this part of the story go anywhere? No, why would it if the entire movie isn't going anywhere with any sort of story at all? If you're OK with this kind of bullshit, go watch it. Every ten minutes, I wanted to shout come on! Stupid women, silly women, thirsty women, desperate women, crazy women. Chauvinism has no bounds! I must add that I didn't pay to see this movie. I have an Odeon Card. I was one of three people in the cinema on a Friday night and one of them fell asleep mid- way. Enough said."}, {"id": 27, "text": "The prototypical example of what happens when female characters are written and directed by clueless men. With six supremely talented female actors leading this movie, it nevertheless ends up being a shallow and even embarrassing caricature of females in general and mother-and-daughter relationships in particular. Too many of the setups and resolutions between the women in this movie undermine everything female actors have been begging for in the way of good film roles for women. I was just depressed after enduring this unfunny holiday tale. And I'm a male. So there."}, {"id": 28, "text": "This movie was such fun! Even though my friend and I were both blessed with fabulous mothers, she and I have both known far too many girlfriends who have quite contentious relationships with moms who don't have a clue. This movie rang so true for us! Three modern-day moms are trying to do the best they can, with two being single moms. Their mothers all decide to come for the holidays - after all, who can deny family at that time of year? And, being good daughters, the young women try to be hospitable while their moms trample all over their daughters' plans. Hilarious fun for a girls' night out!"}, {"id": 29, "text": "Seriously my soul has partly died from watching this shallow, materialistic garbage. None of these women have real problems (they're all part of affluent society), yet the theme of this film is how difficult their lives have become because of an appearance over Christmas from their mothers. It's completely unrealistic, basic and not heart-warming in the slightest. I feel no connection to any of the characters. Don't waste your breath!"}, {"id": 30, "text": "I never thought I would leave a comment for any movie on Imdb, but it happened... Will not write a lot...I will just leave an advice: If it just crosses your mind to watch it, please don't...whatever in this world you decide to do for two hours, will be better than wasting time watching this movie..."}, {"id": 31, "text": "Comedy (though that's being extremely generous) Bad Moms Christmas follows the Moms from the original film preparing for Christmas, however in this film the moms have their own moms stay with them for the few days preceding Christmas day with chaotic moments (None of the female characters are likable).I'm not the target audience, demonstrated by the fact that I was in my local busy cinema attended by only 5 blokes (incl. me). There is soooo much wrong with this film, where do I start?! Badly written, rubbish acting, revolting dialogue! Hardly starts being funny and you quickly stop caring what happens next! Child actors using the F-word (of which there was plenty) is never funny! Racist in places There's every type of lazy humour including overdone sex and clichéd jokes! If your idea of funny is frequent and unnecessary F-Bombs then this film is definitely for you. It seemed like every scene contained the 'F' word, after a while this wears thin and then you begin to realise it was being used instead of clever humour. Santa number2 is the only thing awarding this a 1 star. See this if you really must, but when you're drunk and the incoherent plot won't matter! No out-takes either – oh c'mon there must have been loads! In summary, this film is utter garbage, it'll make you want to poke your eyes out with hot pins. Awful, stay away."}, {"id": 32, "text": "F bombs from the adults and the kids. Full of Despicable people. Just awful."}, {"id": 33, "text": "My wife and I loved this movie! We laughed all the way through it! It's not meant to be a historically great or meaningful movie! It's just meant to be a hilarious, enjoyable, and even heart warming movie on a Friday night after a long week! It delivers! It definitely reminds you of how crazy life can be around Christmas - especially with family around! Just watch and enjoy!"}, {"id": 34, "text": "Nothing can be said to be certain, except death and taxes. Well you can add Donald Trump tweets and inferior movie sequels to what Benjamin Franklin preached about back in 1879.A Bad Moms Christmas is in fact, a sequel. It is my latest review and yeah, it's pretty darn inferior. Christmas, which I don't think was screened for critics, is a half-baked continuation of last year's Bad Moms. Heck, it doesn't even feel like it has much of a connection to the first film.A Bad Moms Christmas is like a cash grab for the holidays, a vehicle that is more akin to a raunchy version of Love the Coopers (or National Lampoon's Christmas Vacation) than to being a legitimate, Bad Moms part deuce.It annoyed me that Christmas is yet another holiday film that takes place in Chicago (even though it was shot in Atlanta). It also annoyed me that A Bad Moms Christmas is another holiday flick in which chaos ensues when overbearing parents arrive on the scene. I am aware that the similar-themed, Daddy's Home 2 is coming out next week. In truth, I think I'll now avoid that movie like the plague.Anyway, with Christmas the main characters (played by Kathryn Hahn, Mila Kunis, and Kristen Bell) are not that bad this time around. Yeah they get drunk at a mall, grind on Santa, and steal a Christmas tree from Lady Foot Locker. But hey, that's only about seven minutes of screen time. Their actions just aren't as rebellious, wayward, or unladylike as in the first outing.Most of the script in A Bad Moms Christmas feels lazy. The screenwriter's idea of generating laughs is to add potty-mouthed F-bombs and a sequence where male genitalia is being waxed (ha-ha what a knee slapper). The production of Christmas feels rushed and slapdash as well. The snow outside looks fake, the sets try hard to appear like a poster child for a JCPenney Xmas catalog, and directors Jon Lucas and Scott Moore (yes there are two of them) have a real hard-on for slow motion shots with some tired, R&amp;B music in the background.All in all, A Bad Moms Christmas does offer a few heartfelt moments between the focal moms and their own, weirdo moms (played by Susan Sarandon, Christine Baranski, and Cheryl Hines). Unfortunately, Christmas also has a stupid cameo by Kenny G along with a shaming dance montage at the closing credits (Kenny G is in that too and he dry humps his saxophone, how cute).During the first half hour of Christmas, Kathryn Hahn's Carla quips, let's put the ass back in Christmas. Well A Bad Moms Christmas definitely achieves that notion. Rating: 1 and a half stars."}, {"id": 35, "text": "Imagine a movie where fathers and husbands got drunk, abused people, were rude and obnoxious and assaulted women. There is no way it would be considered a comedy. Well this movie is all those things but the characters are mother and wives. Somehow people think that this behaviour coming from women is funny. It's not and it's hypocrisy to believe it is. Just plain crude rubbish."}, {"id": 36, "text": "A Bad Moms Christmas is a lot edgier than the original, so if you had a lot of fun with Bad Moms, then this holiday-themed sequel is sure to make you laugh from beginning to end."}, {"id": 37, "text": "It's a fun christmas movie, it's christmas so a bit over the top, but you'll have a laugh :D Get your girlfriends, some snacks and what ever you like to drink and have a fun movie moment :D"}, {"id": 38, "text": "The first installment had charm and was funny. This one is unspeakably dumb, unfunny, charmless, unpleasant, badly written, badly acted, to the point where you are embarrassed for the actors (Susan Sarandon? Kristen Bell? Peter Gallagher?). Do not subsidize this monstrosity with your time and/or money."}, {"id": 39, "text": "Many movies sequel doesn't make a good impression for the audience or at the box office , especially the comedy genre , always the first one stayed on mind , but this one not, I am really surprised for the good humor they delivered in this movie , it was hilarious and it was a great . I never felt any boring moment while watching it. really a good film to see , recommend for all 7/10"}, {"id": 40, "text": "It's another repetitious movie with boring storyline and whole movie is pointless , even its not funny  The previous part was acceptable but not this on I suggest you not waste your time and watch another movie instade"}, {"id": 41, "text": "I just can't understand how some people could write a script like this and other people would say: Oh yeah, that sounds like a great story, let's go on an do this movie! How? Just how? And why are so many good actresses wasting theirselves for such a crap movie like that? It has no story, it has no intelligent dialogue, it only contains slow motion of three moms who get drunk and sexualize everything while playing awful music and pretending they are having the time of their lives! Nobody is really believing that, at least i hope so. Maybe there could have been done a good movie about how it is to be a mother in Christmas time, about the stress and pressure and everything - but this is just a joke. And unfortunately not even a funny one."}, {"id": 42, "text": "I went to see this movie with a friend. I wish I could have walked out after the 10th f-bomb. This movie apparently was written by someone who hated their mom and still exists in his/her juvenile state of mind. It reminded me of the 13 year old children at the pool during the summer, practicing their f-bombs. Don't waste your money."}, {"id": 43, "text": "I don't understand the bad reviews on this. I'm not sure what people expect from this type of movie, but for me it delivered everything I expected and more. There were plenty of ruptures of laughter in the cinema I was watching it at last night, so generally I would say most of the people in there enjoyed it too. It's basically a laugh a minute. Like the first movie 'Bad Moms' you get a something different from each of the female leads, but they are all funny in their own way. It was the best comedy I've seen this year, the right blend of silly and serious with a lovely family Christmas message. I'd recommend you don't listen to the the hard to please people on here, and you go see it and make up your own mind. I can't wait to watch it again over Christmas. Great fun."}, {"id": 44, "text": "If it wasn't on while I was at a friend's house I would've lived a happy life without seeing this trash. But since it was, here I am."}, {"id": 45, "text": "Sooooooo bad!!! Most boring, empty, nothing movie i've ever paid money to see in my entire life. I know you get some bad movies every now and again but there is always something good about it that makes the 2 hours o.k. This is an absolute dismal effort in film making and feels like it was written and filmed in 1 week. I want everyone involved in this movie to go to prison for how bad it is. I've been robbed of my hard earned $5 and want them to be accountable for stealing my money like this.I prefer to go to Alcatraz in 'the hole' for 2 hours than watch this, both are boring 2 hours of your life.Save your money and go and sit in the corner of your house and watch the wall for 2 hours instead... Save 5 bucks!"}, {"id": 46, "text": "This movie was about bad moms getting together with their families and wreaking havoc during the week before Christmas. Oh, what an abomination this was! I hated every single minute of it except one line by Christine Baranski. Seriously, it was terrible. There was not a sympathetic character in the bunch. I thought Amy's father had dementia, turns out, his wife said he had the brain the size of a walnut. That was not the funny line I was referring to by Christine Baranski. She was playing Leonard's mother from Big Bang Theory. Exactly the same character. These actresses can be very good given the right material. This awful thing was not that material. When I found out my daughter brought this home from Redbox, I physically cringed. I hated the first one too. Funny thing is, she hated it too. I can't imagine why she would want to rent it. Well, it's my turn to pick the movie next time. I'm picking Alice Doesn't Live Here Anymore. Not a comedy, not about Christmas, but has some of the best writing and acting I've ever seen. It's one of my all-time favorites."}, {"id": 47, "text": "I'm 54 Years old. I've watched and made it through hundreds if not thousands of movies. It has been rare, maybe 5 or 6 times that I have walked out on a movie that I have paid to see in a theatre. I paid $10 to see this movie. I enjoyed the first one and there wasn't much else playing so I thought why not. What you will immediately notice about this movie is how every joke in every scene falls Flat. And I mean Flat. The saddest part of this disaster is a total waste of a very talented cast. If the writing Sucks the movie Sucks. Did the movie get any better after the first 15 minutes? I'll never know..."}, {"id": 48, "text": "I went to see this and I got to say this really jingled my Christmas bells I had a few laughs really felt a Christmas spirit and just had a fun time I really only went for the women at first but then I wound up having a really nice time if your looking for the perfect thing to get you in the holiday spirit this movie would be it ignore the bad reviews and go see it for yourself you wont be disappointed"}, {"id": 49, "text": "Hollywood makes another vulgar,crass disturbing movie about Christmas...obviously everyone involved should be ashamed of themselves! I'm not religious but found it completely offensive,disturbing,creepy and sad...comedy?"}, {"id": 50, "text": "Spoiler alert. It sucked.Watched this wife the wife. Even she had to fast forward through a lot of it.Who writes this crap?"}, {"id": 51, "text": "This is one of the best movies this year!!!!!! It was soooo dead on with the stress of Christmas &amp; family!!!!! An so hilariously funny I was literally in tears!!!!! The cast was so phenomenal!!!!!!! I absolutely loved this movie an will likely see 20 times more!!!!!!!!"}, {"id": 52, "text": "This movie was amazing, start to finish. it was funny, emotional, and just plain amazing. i love the comedy in it (although its dirty), its very funny and it kept me entertained and on board the whole way through. the only reason people are not liking it is because its dirty, thats why everyone is like oh my gosh, its so bad like no it really isnt. i would definitely recommend you watch this movie, it will keep you entertained, there are fights, emotional scenes and it was just great. 10/10 hands down"}, {"id": 53, "text": "I went into this expecting it to be a dumb movie with enough laughs to make it enjoyable. I was surprised to find that it was actually a decent plot for an off-the-wall, raunchy comedy. The characters were all 3-dimensional, and completely different. The grandmothers all had extreme personalities, but in completely different ways. The acting was excellent, and the jokes were hilarious.Once I got past the fact that Christine Baranski and Peter Gallagher couldn't possibly be Mila Kunis's biological parents, I enjoyed every moment. I'm in shock that people are rating this low and saying it is unwatchable. It's hilarious, and it has a cohesive plot. There's really nothing to hate so much, unless you can't take the raunchy humour."}, {"id": 54, "text": "Most likely your lady picked this one. It's pathetic. It attempts to be edgy, but that's just how people talk in real life. However, nothing in. real life is the way they attempted to portray it. It's a lazy story with totally expected jokes. I'd be embarrassed if my name was attached to this typical, standard, basic waste of 2 hours. I don't write reviews ever but this was so bad and boring that I had to. Ugh it's scary that this is what passes in Hollywood for entertainment. Everyone who had some say so in this should be blushing and have trouble sleeping for signing off on it. In real life, having this on a resume would automatically rule you out of future projects. Unfortunately it made money and is therefore considered a success in Hollywood. All we can expect is more awfulness from all the people involved. They're probably already working on a sequel. It's a goddam shame"}, {"id": 55, "text": "Nothing like the first. So bad I was embarrassed for them."}, {"id": 56, "text": "Another comedy void of laughs. Rather than using humor, the movie instead replaces it with foul language. This movie is basically that guy at work/school who tells a joke and laughs at himself, while everyone else gives awkward looks to each other. They also dive to new lows with having children constantly using the F word."}, {"id": 57, "text": "This movie is a hot steaming pile of garbage. Please don't watch it, because we cannot keep encouraging studios to put out crap like that."}, {"id": 58, "text": "The first movie was witty, funny, clever and engaging. The second chapter was woeful.A mess of a movie that was full of fill in montage moments.Peculiar that such a great cast of actors would be complicit to such rubbish."}, {"id": 59, "text": "I've heard the movie was good so I ignored the current ratings and gave it a chance, and it proved to be such a good idea. It's a comedy worth seeing this Christmas, especially by moms, always fighting with the need to have the have the perfect holidays celebrations, but not only. My boyfriend's rating would also by close to mines, and as I said before I heard only good opinions about it before seeing it. Not sure what's going on with IMDb ratings lately. Mother which was terribly bad has an excellent rating, while this perfectly good comedy is rated so low.. Go see it for yourself, and Merry Christmas!"}, {"id": 60, "text": "Pretty much the worst christmas movie i've ever seen"}, {"id": 61, "text": "This movie is absolutely amazing!!! And so hilarious. The part when the mother throws the Christmas party after she promised her daughter she wouldn't in her house! I don't think the daughter went overboard at all she got completely fed up with her mother and stood up for herself for the first time. What would you do if your mother showed up and starting taking over everything! I would lose my stuff on her too!"}, {"id": 62, "text": "I went into this movie expecting nothing because of the rotten reviews, but I laughed consistently throughout. Why would anyone expect some uplifting Christmas cheer from bad moms?! Obviously it's going to have crass humor and unrealistic situations. If you watch it for what it is, you will enjoy the amazing talent on screen delivering well timed and clever jokes. It even has a beautifully tender (slightly cheesy) loving moment between mother and daughter. Give it a watch and enjoy it."}, {"id": 63, "text": "This movie is definitely NOT for children. I gave it 9 out 10, because the little girl in the movie uses the F word with no consequences, and the stealing groceries out of the cart was pathetic. The plot is about three good friends who are tired moms who now have to face pulling off another wonderful Christmas. To top it off, each woman has her own mother (aka grandma) show up unexpectedly with her demands. One grandma spends tons of money on decorations both inside and outside. One grandma is a pot smoking, drinking, gambler who wants money. The last grandma is a lonely widow and who thinks her life should now be shoulder-to-shoulder with her daughter. When I saw the cast, I knew I had to see the movie. My husband sat with me all the way through the movie. We laughed quite often. If you never have had these moments, you probably won't like it."}, {"id": 64, "text": "This movie is rauchy but it had me laughing so hard. I especially laughed at Kathryn Hahn and Christine Baranski(sp). It was crude so I am glad that I was watching it with my husband and not my son or brothers."}, {"id": 65, "text": "I think it's because the new moms they made the sequel funnier and more enjoyable specially Amy's mom she made a really good empact on the film and all the jokes in this movie are funny even though the jokes are frequent but still it was awesome"}, {"id": 66, "text": "This film gave me emotions that's a combination of happiness and sadness. It showed me the true meaning of Christmas. You can celebrate it in a simple way. The two most important things during this time are; you are loving one another and your family is complete."}, {"id": 67, "text": "Under-appreciated and overburdened moms Amy, Kiki and Carla rebel against the challenges and expectations of the Super Bowl for moms: Christmas. As if creating the perfect holiday for their families isn't hard enough, they'll have to do it while hosting and entertaining their own respective mothers when they come to visit."}, {"id": 68, "text": "***This review may contain spoilers***A Bad Moms Christmas is a hilarious, mischievous, raunchy tale with stacks of heart and camaraderie between this lovable group of moms. The sequel is wilder and than the original and the introduction of the perfectly cast grand moms (Sarandon, Baranski and Hines) makes for plenty of very relatable mother-daughter moments that make one want to both cover her face in horrified agreement and call her mom to tell her she loves her all at the same time. The friendship between the three equally talented and charismatic leads; moms Amy (Kunis), Carla (Hahn) and Kiki (Bell) is fun, at ease and feels incredibly organic and their sincere and very human devotion to their kids in their own unique ways combined with that unapologetic, playful rebel streak make this new journey of the moms entertaining, engaging and realistic. Christine Baranski's immaculate comedic timing and portrayal of the overbearing, snobby but somewhat endearing Ruth is ridiculously on point and Carla's (Kathryn Hahn's) scenes with Ty (Justin Hartley) had the entire cinema in hysterics. A counseling session with (Wanda Syke's) Dr. Karl will make you - as a daughter (or son) cry big, ugly tears and the doting, charming (Peter Gallagher) as Hank stepping in to try to calm the waters are two of the moments that I think really anchor this film as not just a lively, festive, raunchy comedy, but as something many will relate to, especially at Christmas."}, {"id": 69, "text": "Merry is relative. this sequel the the surprise hit of 2016 mila kunis Kristen bell and kathran hann reprise their roles as the good time girls or moms Amy Carla andkiki who is dumb this time around they're juggling motherhood and their own mothers baranski Cheryl and Susan sarandon character called isis lots of jokes about that a doped up mother who arrived for Christmas to spend time this film is made in Chicago as we follow the Bad Moms Christmas follows our three under-appreciated and over-burdened women as they rebel against the challenges and expectations of the Super Bowl for moms: ChristmasThis movie is fun and hilarious and has a heart there is some fun jokes a 12 days of Christmas played out with decorations by Amy's o so serious mam Ruth played. and then Amy mother wants to go the nutcracker instead go to indoor dodge-ball this part is nearly the highlight of the movie its rib tickling by Christine Baranski ,who is having a riot— gratuitous in its R- rated language and sexual content, and fully boasts its awesome cast in several outrageous ways. After feeling out our moms (Mila Kunis, Kristen Bell, Kathryn Hahn) in the first film, I really now see and understand how the unique characters bring out the most in one another, The 104-minute run time felt perfect from the waxing to robbing foot lockers Christmas trees to Ruth spoiling her grandchildren and then there kiki dumb but fun there Santa's stripper's very fun there a lot of Christmas heart and a donkey in a house The Christmas theme is integrated right into the plot and is a fresh way to pitch the sequel, and the grand moms help induce the struggling relationships that one could find in a hard-hitting melodrama: one whose mom has unrealistic expectations for her daughter's motherhood, one who wants separative space between herself and her mom, and one who wants more closeness to her mom. It sounds very general, but when within the right framework (when not clouded by the film's foolishness) it hits as very real when it tries to. While the first film really felt to be for moms in that there is a general message that will make them feel important walking out of the theater, this sequel tries to deliver a similar thing with the grandmothers to a lesser effect. Now that there are two comedy sequels releasing about parents' parents coming home for the Christmas holidays, the similarities stop there and audiences have a choicebetween seeing: men/women, naughty/nice, or crude/slapstick. I'd say for the appropriate age, A Bad Moms Christmas delivers on more fronts , prepare to turn off the suspension of disbelief switch and prepare for a decent abs workout. but they also aren't a complete waste of time and money for how over the top they are but the film makers are expanding the bad moms universe will it be bad grandmas 10 out of 10"}, {"id": 70, "text": "I saw A Bad Moms Christmas, starring Mila Kunis-Jupiter Ascending, The Book of Eli; Kristen Bell-How To Be a Latin Lover, Scream 4; Kathryn Hahn-Captain Fantastic, Step Brothers; Christine Baranski-The Big Bang Theory_tv, The Bounty Hunter; Cheryl Hines-Son of Zorn_tv, RV and Susan Sarandon-Tammy_2014, Mr. Woodcock. This is a sequel to the 2016 minor hit, Bad Moms. It seemed like the producers were in a rush to get this movie out-it has barely been a year since the first one-because even though there are some laughs, it's pretty predictable. Mila, Kristen and Kathryn are still besties and they are all getting ready for Christmas and all the pressures that go along with the season-planning parties, shopping for gifts, decorating....well, you know the drill. That is when all three of their mothers decide to visit, at the same time-can you believe it? Christine is Mila's disapproving mom-nothing Mila does is good enough. Cheryl is Kristen's overly clingy mom-she spends all of her time with Kristen and even wants to move in next door to her. Susan is Kathryn's free-spirited absentee mom-she gambles, smokes marijuana and doesn't come around for years at a time. The best thing about the movie is the cast-great casting. The worst thing is the recycled material-unless you think little kids using the 'F' word or someone calling a person by a different name every time she sees them is funny. As the end credits start, there is a scene with the entire cast dancing. It's rated R for language, drug use and sexual content-partial nudity-and has a running time of 1 hour &amp; 44 minutes. It's not one that I would buy on DVD but it would be alright as a rental, if you liked the first one."}, {"id": 71, "text": "I am speechless. I actually don't know what to say. This film has some amazing actors, but what on earth was that about? Absolutely terrible film, no story and very creepy!"}, {"id": 72, "text": "Worst movie I've seen in a long time. It was vulgar for vulgar sake. The actors did not seem into it and it was no wonder that I fell asleep watching this bad creative meltdown."}, {"id": 73, "text": "I really liked the movie, it was the best sequel to make. Not mentioning the cast which was awesome and hilarious. Love the messages and the advice they yield through the movie❤️ Being a mom is hard and choosing to be yourself while caring for your family and your children is the best!"}, {"id": 74, "text": "This is honestly one of the funniest movies I have ever seen. I used review movies for my college newspaper and I have seen many, many comedies (as well as other genres) but this was fantastic. Very rarely movies make me laugh out loud but this one had me and the audience as a whole laughing the entire time. People on here complaining about this movie were probably going into expecting something different, but it is not meant to have a thick plot. There is quite a bit of character development but honestly it is just a really fun movie. I wouldn't really recommend bringing your kids as it is not kid appropriate but if you're an adult and especially if you have children I really think you will appreciate this movie. Do yourself a favor and go see it!"}, {"id": 75, "text": "OK I went to see this movie and let me tell you did I laugh and have a good time I laughed out loud several times and the ladies are beautiful and the Christmas spirit here is on the ball here you need to see this brilliant and hilarious movie yes I get that the movie isn't getting good reviews and I adore the fact that people cant even enjoy a good Christmas movie without starting negativaty this is a perfect adult Christmas movie just please no kids its definitely not meant for them nor should they see it unless you want your kids using profanity and asking why santa is dancing so dirty with the mommies"}, {"id": 76, "text": "This has to be the worst movie in history. Worst storyline, everyone's over acting, the characters are totally unrelatable and over the top."}, {"id": 77, "text": "I don't get why there has to be a sequel it was fine with one movie. I didn't really find humour liked the first movie had. It was good for a one time watch. Kathryn Hahn was hilarious as ever. I thought some parts were overdramatize."}, {"id": 78, "text": "Mostly preposterous and stupid. But it had several laugh out loud moments. And a few touching moments, if you don't think about the absurd things that brought it that point.It doesn't deserve 1s or 2s. Those are lazy scores."}, {"id": 79, "text": "For festive fun, A Bad Moms Christmas is right up there and is able to act as a good sequel to a successful comedy thanks to the charisma of the actresses. They got a little confused with the basis for the Bad Moms idea, but the characters are likable and there are still funny. Unfortunately the movie is highly predictable and it takes the easiest route by adding even more mums to the mix or any comic commentary about the women. The truth is the Bad Moms Christmas is not an absolutely terrible movie, but it's just very uninspired, clearly aiming to cash. It'll entertain you but it will never rank among the Christmas classics."}, {"id": 80, "text": "I preferred the first one but as a Christmas movie this one still worked. Some decent jokes, tho a bit more innocent compared to part 1. The acting of the ladies was good enough. Again Kathryn Hahn was the best of the bunch, but also she had more spice in the original part. Mila Kunis was fine and I really liked Kristen Bell. From the new additions Christine Baranski was the best although it was her now typecast character she already played in The Big Band Theory . I expected a bit more from Susan Sarandon tho she had some good moments. Cheryl Hines was hilarious however her gimmick went a bit too far after some time. The film is good enough to get you into Christmas mood but it is very chliched in terms of story characterization and humor, Nice soundtrack, a few good laughs and generally good entertainment. Some missed opportunities but decent enough."}, {"id": 81, "text": "This movie was funny! There were so many times that I was laughing out loud I almost peed myself. I haven't read the reviews from the haters but it's a comedy and each character is like a friend you know or even yourself and so if your not looking for an Oscar deep meaning movie then this is your gem. If you can relate because you have kids, this is your movie and even the scene in the church between Amy and her mom made me all misty eyed because seriously that's how it is with moms. Oh and even if you just watch the stripping scene and the tree stealing part, it's worth it for the laughs."}, {"id": 82, "text": "Its just a sappy rom com but really well done, laughed a lot 👌👌"}, {"id": 83, "text": "Wouldn't actually give it a 10, I just think it's hilariously wack that some people would give this obviously stupid movie so much crap.Did you go into it thinking it would be on par with Avengers or The Dark Knight or something? Why on earth would you be so overly critical of a movie staring Mila Kunis and Kristen Bell and Christine Baranski?Learn how to laugh at ridiculousness and stop being downers y'all"}, {"id": 84, "text": "I absolutely loved this movie. A heart all gal comedy. An uplifting Christmas movie too.I really live the Grandma's. Great casting. I hope you make more.Loved, loved, loved this."}, {"id": 85, "text": "This is a great holiday feel good movie. So many scenes make you laugh out loud."}, {"id": 86, "text": "This show would have been just as funny without all of the foul language."}, {"id": 87, "text": "I love these ladies! The Footlocker tree cracked me up. I can relate to these women. That's what makes this movie so much fun."}, {"id": 88, "text": "My favourite movie, you must watch this movie. A lot of funny scenes."}, {"id": 89, "text": "I really enjoyed this, of course I wasn't going into it expecting to take it seriously. It's cheesy, funny, and even a little heart warming!"}, {"id": 90, "text": "The movie had its moments, though, most of the time, it was a classical cliche over the top american movie that doesn't take things seriously. The performances were good and the grandmothers were funny, overall."}, {"id": 91, "text": "This review just needs 4 words/letters, Kenny G end-credits.That's it, when you see him, the entire movie becomes worth it, and then some.... LOL."}, {"id": 92, "text": "I knew going in that it wasn't going to be an Oscar contender, but then again I saw it to laugh and zone out for a couple of hours. I think some of the people on the message boards are taking this film way too seriously. It was funny but I think it missed a lot of the humor the first one had. All and all enjoyable for what it was."}, {"id": 93, "text": "I had low expectations but was surprisingly amused. Kathryn Hahn is outrageously funny and seeing Susan Sarandon as such a free spirit was worth the time spent. The relationship between Cheryl Hines and Kristen Bell was strange (friendship over mother/daughter) and subtly funny. A virtual cameo by Wanda Sykes asva family counselor was funny. Christine Baranski as Mika Kunis' mother was over the top (controlling) but occasionally funny (Dodge Ball). All the relationships were dysfunctional at different levels. Ultimately, the film had limited lasting value but had enough incredible situations that often felt so real that it makes the movie entertaining. The ending was a little too predictable in attempting to resolve differences which distracted to some degree from the over all value of the film."}, {"id": 94, "text": "I was so looking forward to seeing this movie. I really enjoyed Bad Moms. I thought it was hilarious. It was also really relatable for many Moms out there who have ever felt the pressure of being a good parent.Unfortunately, this movie just didn't live up to the first movie. It defiantly had the same heart-warming message to reassure all the Moms out there that they are doing a good job but there was not as many laughs as there was in last film. That being said there was a few scenes that made me chuckle. I especially loved the scene when they Take back Christmas at the mall and get drunk. It made meeting Santa fun. The sexy Santa competition and the fight between Kunis and Baranski was also pretty funny.  I think the relationships between the Moms and their Moms are great. I'm pretty sure most of us would be able to relate to one of them.The cast did really well with what they had to work with in terms of script. Hahn is hilarious in the delivery of her lines. She cracked me up with most of what she said. Kunis, Bell, Baranski, Sarandon and Hines are all brilliant and all play opposite each other amazingly. The chemistry between them really carries the films. I just don't think the script was a good as them.Overall its worth a watch. It's a good Christmas movie that you can just sit back and enjoy, but don't expect it to blow you away."}, {"id": 95, "text": "BAD MOMS 2 - 63% Bad moms 2 has a funny cast, and very funny jokes. I would have loved it even more if it was a bit shorter. The structure was good, and I love the vibe bad moms gives after a very well written climax.  Story wise and execution: 29.5/35 Acting: 19.5/25 Camera work: 2.3/20 Sound: 11.5/20"}, {"id": 96, "text": "OK let's start with the horrible ratings that A bad moms Christmas got. Those people do not know good movies. A bad moms Christmas is an excellent movie way better than I thought. I am not a huge fan of the first Bad Moms, but let me tell you I am a fan of the second one. A bad moms Christmas is an awesome and funny movie, the difference with the second movie is the new characters of the girls parents. Christine Baransky steals the show, her character is sooo funny and Katherine Hahn is amazing and funny too! A bad moms Christmas really captured Christmas, for filming it 6 months ago in the summer it really looked like Christmas time, the cinematography in the film is outstanding too. Just go see this movie, you will not be disappointed."}, {"id": 97, "text": "Not sure if this would be considered a spoiler, but it shouldn't be. Awful Movie! The language was so inappropriate and overkill that I left within 20 minutes. Asked the theater manager to go into another movie and he obliged. I love funny movies and thought this looked great. I should have researched more. Sad thing is it could have been very funny without all the F bombs and other nastiness. From what I saw, not good at all!!"}, {"id": 98, "text": "No Way this movie rates 5.5! Its much better than that. It's funny and cleaver. The writing and production are very well done. Acting is top notch. The only reason I give it less than 10 is cursing: a little much for tastes. Watch it. It's a really good one."}, {"id": 99, "text": "How awful was that... Hells bells Santa Claus yells. Only decent redeeming part was Kathryn Hahn. The rest cant act for beans. Sarandan and Christine B were cringeworthy. Just horrible."}, {"id": 100, "text": "In the first of 2017's crop of Christmas movies, Amy, Kiki and Carla are back. It is the run-up to Christmas, and all three are invaded by their awful mothers: Carla's chronic gambling Mom has arrived in order to borrow money and take off again, Kiki's mother is trying to be Kiki's Siamese twin, and Amy's mother is staging a social climbing Christmas event despite Amy's horrified resistance.If you saw the first Bad Moms, what you have is more of the same, only at Christmas and with bad Grandmas. The events are quite funny if unbelievable, the changes of heart at the and (sorry, belated spoiler alert) are every bit as unconvincing as the PTA boss in the previous film, and the whole thing is quite likeable.It's full of wall-to-wall bad language including a spectacular F-bomb from one of the kids which is clearly intended to be hilarious, but which left me feeling very uncomfortable. Carla gets some smutty material to have fun with.But the cinema (full of women, mostly mature) laughed all the through, as did I, and the message is a good one, even if it is delivered with all the subtlety of an elephant tap dancing."}, {"id": 101, "text": "I will be honest the only reason I went to see this in the beginning was for eye candy and I can honestly say that I got so much more than that I laughed out loud several times the Christmas spirit is really present here you can feel it I totally recommend that you see this just please leave the kids at home the movie is filthy but it's hilarious and heartwarming a good Christmas movie for sure take th a date or go alone just see this movie and you will have such a nice time"}, {"id": 102, "text": "Worst movie ever im serious dont spend your time for it"}, {"id": 103, "text": "No story line, bad artificial jokes, not funny, insulting, not worth spending time writing something about it"}, {"id": 104, "text": "This movie supposed to be a Christmas comedy movie.  most of the movie was about sex and bad jokes.  lots of nudity and strip dancing.  even they presented santa dancing with sexy women like a punk.  what a disgrace for a supposed Christmas movie.  avoid this insult at all costs.  Christmas is about the birth of the son of god savior of humanity.  it's not about nudity....sex...drugs and rock'n roll."}, {"id": 105, "text": "It's so bad it made me cringe at the jokes and grab my phone for comfort. Seriously... I love the cast of actors, but who wrote and edited this movie? At least the first one was good."}, {"id": 106, "text": "What I find amazing is that some reviewers thought the first Bad Moms was better. I couldn't disagree more. The first one was a piece of garbage. This one is not much better, just slightly. I laughed about five times and that's why I gave it a five star rating. One star per laugh, and I'm being overly generous here. The five times I laughed where with Kathryn Hahn, she's obviously the funniest of the lot. It's not I don't like the other actresses, it's just that the script isn't good, at least not good enough to make it a good comedy. Mila Kunis is like always a candy for the eye, too bad her lines were not funny. At the end I even vomited a bit in my mouth, that's how cheesy it got. Please don't make a third one, because I seriously doubt I will watch it this time."}, {"id": 107, "text": "I was going to write a review of this movie, but it look's like everybody thought the same as I did of this trash.There are so many inconsistencies I could go on forever. So no sense hashing about the same old trash. I agree with the other reviewers, please save your money skip this pitiful picture."}, {"id": 108, "text": "This film was silly, completely over-the-top, and there were some cringe-worthy moments. But I loved it. It's simply a fun film. I'm under Covid lockdown, on Christmas Eve, and this is just what I needed to get my mind off this pandemic.Will this become one of those Christmas movies that I watch year after year? No. But I'm really glad that I watched it this year."}, {"id": 109, "text": "A charming, frequently funny female-dominated Christmas movie that has enough gags, heart, and funny performances to recommend it. It's not the most thought provoking or profound movie, but it knows what it wants to be and runs with it. I was definitely never bored."}, {"id": 110, "text": "So bad, not one funny joke which makes it unwatchable. Similar type of movie to daddy's home but daddy's home was amazing and this is rubbish."}, {"id": 111, "text": "One of my favorite Christmas movies. This is so much fun. Just lay down take a drink some chips and enjoy"}, {"id": 112, "text": "OK, I could watch Christine Baranski read take out menus, and find it entertaining.It's a shallow, obvious, idiotic piece of holiday fluff....but a fantastic cast. I'm sure they had a blast filming it! And any movie in which Justin Hartley gets naked can't be all bad.Have a couple drinks, lower your expectations to zero, sit back and enjoy."}, {"id": 113, "text": "Despite what everyone else said this movie is awesome. The one liners are great, the cast is awesome, the story was cool."}, {"id": 114, "text": "That don't really deliver. Mildly Amusing with no LOL. Throw in a few lewd moments that ruin the Christmas spirit with beautiful sets."}, {"id": 115, "text": "Had a couple of Bloody Mary and laughed all the way through."}, {"id": 116, "text": "This movie got a few chuckles out of me. Other than that, it's just a sloppy mess of seemingly unscripted antics, dragging out jokes too long, and so many montage sequences. Seriously. This is the movie you put on when you need something on in the background and aren't planning on paying too much attention."}, {"id": 117, "text": "This was a great Christmas story however there is some strong language in it had some nudity. Kristen Bell and Susan Sarandon Were super actually in this picture as were others."}, {"id": 118, "text": "Most fun Christmas movie ever - and definitely not a Hallmark one! Enjoy responsibly!"}, {"id": 119, "text": "I loved the first movie. This one had some really funny and also heart melting scenes. But there was also too many cringy scenes where I could almost not bare to watch, and a couple of times I said NO out loud. Photo scene with Santa in the mall was such a scene that they should just have erased from the script. It just felt fake and acted. The love story, I don't want to spoil any details, is kind of cute though."}, {"id": 120, "text": "I did not hope it was good, but I have managed to go beyond the limits of good patience. Bad."}, {"id": 121, "text": "I was stunned. Slack-jawed. And gave it an extra point for the lovely montage rolling with the closing credits. It's a love story disguised as insanity. There are probably two occasions to watch this movie: Thanksgiving with your parentsApril 20th"}, {"id": 122, "text": "This is by far the works Christmas movie I've ever seen. The mothers of the moms couldn't be more cliched or terrible and their daughters are pathetic doormats with the grand kids being spoiled a-holes. It is 2 hours I will never get back. Do not waste your time!!"}, {"id": 123, "text": "I just don't think I can bring myself to watch any film with Susan Sarandon. I guess it's just a principal thing, rather than the actual content of anything she's in - I just don't feel like I can trust her or her decisions. Sorry that it might reflect on anyone else in the film."}, {"id": 124, "text": "I couldn't even finish watching. Just bad and unfunny."}, {"id": 125, "text": "I didn't even get one good laugh in this movie, trashy talks, trashy focus on cursing, strippers..."}, {"id": 126, "text": "I hated bad moms.. tried this garbage on showtime. I made it 30 minutes til i turned it off.Mila.. how do you keep getting work??"}, {"id": 127, "text": "This was a sad attempt as a christmas comedy, or a comedy in general. I am still surprised when actors agree to do movies that drop the value of their name. Do yourself a favor and steer clear of this train wreck."}, {"id": 128, "text": "It hasn't been that long since the original Bad Moms so it is not likely you don't know what to expect from a sequel. More bad language, drinking, drugs, and suggestive sex. Actually it is an entertaining no brainier. Some things are taken to the extreme and feel forced. The waxing scene drags with its one long joke.The cast does a good job with the material. Susan Sarandon makes the others look like they may grow up to be actors.There are just enough laughs to make it through the short run time. It's a Christmas movie that won't still be in theaters at Christmas. If you want to get into the bad holiday spirit see it soon in a theater as it will feel dated when it hits home platforms very soon."}, {"id": 129, "text": "Sums up the intelligence of Americans and it should never have left the states. Bob Hope once said if you have to swear to get a laugh you aren't funny Utter crap film. Rules mean it has to get a star rating but I would not have given it any. The president trump will probably love it and their are no big words for him to worry about."}, {"id": 130, "text": "It may as well have had Amy Schumer in it as it was that smutty instead of funny!!!!!!!!!!"}, {"id": 131, "text": "Wasted 30 min of my life ..So bad dont watch it.so dull and ordinary"}, {"id": 132, "text": "That's what the title should be. My god there are so many cringey montages. They're basically identical to the ones in the first movie too. I didn't expect much from this unnecessary sequel and I didn't get much. Hahn and Baranski are legitimately funny, but can't keep this trite comedy afloat."}, {"id": 133, "text": "Such a misuse of an excellent cast. Badly written script with no sense of character consistency or ways of engaging emotionally the audience. The entertainment value is there but so low and drowned in the general vulgarity and coarseness.I should have checked: why two guys who normally write crass male comedy would be able to pull through a film about the connection between mothers and daughters? I guess I believe in miracles but this was one too far."}, {"id": 134, "text": "This film is so wrong, these people do not change for the better, these people destroy the lives of their children, grand children, and good people who see this film keep on hoping in vain for a miracle which will never happen. You promote narcisism! Thanks a lot!!!!"}, {"id": 135, "text": "Just terrible cheesy and a bad bad trying too hard to be a comedy and family christmas movie. Ugh its one of those bad movies you can find a full upload of on youtube. I don't even know why people make movies like this."}, {"id": 136, "text": "Wow a lot of big actors in this movie who desperately needed some cash. This is the worst movie I have ever seen."}, {"id": 137, "text": "At the end, there was one joke when I laughed for 3 seconds so it gets 2 stars."}, {"id": 138, "text": "Even worse than first 5 mins of original film. I really thought this would be better and that they would stop bringing ridiculous actors into top casts. Amy's mom is dire actor and even more dire character......the 3 Bad Moms rock but the side stories are an insults to the intelligence."}, {"id": 139, "text": "IS IT ANY GOOD? Maybe it's the beer and shots talking, or maybe the Christmas lights are casting a twinkly holiday glow, but this outing is a little bit sweeter than -- if just as filthy as -- the original. (Hines' hilariously co-dependent Sandy is a close second). So the mom-daughter Special Moments never get too schmoopy; sensitive viewers may even find themselves shedding a tear or two."}, {"id": 140, "text": "I enjoyed the first movie a lot, but this sequel is lousy. I decided to stop watching after 5 minutes. It has a lot of cheap jokes, lots of unnecessary cursing, including a untasteful, loud, repeated cursing by a little girl(so far I can't understand why people mix cursing with the word God (omfg), it's so disrespectful and so tacky). Mila's character is so different in this movie, mostly in a bad way, cursing a lot now. The bad cliché about the visiting parents and the overacting by the parents (except Baranski's acting). The first one had great songs which is a big part that is missing on the sequel.Don't waste your time."}, {"id": 141, "text": "Not a good movie, I didn't expect to see Christine Baranski reprising her role of Dr. Beverly Hofstadter from The Big Bang Theory."}, {"id": 142, "text": "Take my word for it, watch another movie.. my 7 year old have written better stories than this... This movie sucks big time.. i was very close to turn it off, but i was hoping that the movie would pick it up at the end, but it went further and further down the drain.. I rather watch paint dry or grass grow than watch this world record attempt try in most use of f..k in a movie.. PATHETIC"}, {"id": 143, "text": "A Bad Moms Christmas is the sequel to surprise hit Bad Moms released in 2016. Now with the same cast coming back only a year later, and added in with several more characters. This film seemed to have been a cash-grab sequel. Now setting at Christmas time, would be a sure way for the film to make good profit at the box office (which it good, though less than the original of course).A Bad Moms Christmas simply isn't funny as it tries to hard for jokes and comes off as a wasted comedic attempt. The original was quite refreshing and although not as funny as some felt, the original was still a decent and fun watch. However this sequel as some moments but overall, the comedy just is not there.The main problems are the mothers of the original three of Mila Kunis, Kristen Bell, and Kathryn Hahn. There mothers aren't funny or interesting and as the film tenders on, become quite more annoying. Hearing a child use the F-bomb may seem funny and unexpected at first, but hearing it about 3 more times isn't funny. Another scene featuring the moms parading at a Santa Claus in the mom with a musical montage was also not funny in the least and beyond forced. A funny scene included the mothers and their families playing at a Skyzone stadium. Also as expected, the film is predictable as we all know where its heading.Overall this film wasn't it in terms of comedy and felt rushed and forced. Quite obvious a cash grab sequel due to the unexpected success of the original. Perhaps had they planned out a more thoughtful film, this film would have been a lot better."}, {"id": 144, "text": "What happened? I LOVED the original Bad Moms. This one fell flat though, as sequels often - but not always - do. Because the friendships among the women have been formed already and the relationship between Mila Kunis and Jay Hernandez is solid, the filmmakers needed to find new tension to infuse into the story. Enter the crazy moms of our three bad moms. Fine actresses, including Susan Sarandon! But the writing just falls short. The jokes aren't as good and the heart of the movie isn't as strong as the original."}, {"id": 145, "text": "The first hour of the movie was pretty good. I was giving the movie a 6/10 at that point. Good jokes and relationships between the friends and their mothers. However, the last 40 minutes was painfully bad. Just awful. A load of mom-daughter nonsense and oversentimental crap. Lots of melodrama nonsense. Awful. Absolutely awful. Unwatchable level bad. They should have just ended the movie at the hour. Anyway ... avoid this one. Not worth wasting your time on."}, {"id": 146, "text": "I love Christmas movies and this one is really funny! Not as great as the first one but the grandmas are a fantastic addition to the cast!!"}, {"id": 147, "text": ". . . BAD MOMS CHR!STMAS? One assumes that such deplorable Americans as John Wilkes Booth, Lee Harvey Oswald, John Wayne Gacy, Don Juan Rump, Robert E. Lee, and Devin Patrick Kelley ALL had bad moms, but does anyone know for sure? Sometimes babies are found floating through swamps in baskets. At other times, when you dig up the caskets of the alleged maternal parent of a particular problem tyke such as the grave of Damien's birth mom in THE OMEN, you find the bones of a jackal. A BAD MOMS CHRI$TMA$ is full of other sour notes. One of the deplorable mothers tells her lover during the first few minutes of this story that You've definitely getting the GOLD STAR treatment tonight. After current White House occupant Rump made such a stink about Gold Star families last summer, EVERY American knows that the Gold Star Treatment involves a 21-gun salute and a triangular-folded U.S. Flag being presented to a crying lady dressed in black! Similarly, A BAD MOMS CHR!STMAS ends with the three superannuated chicks flying to Las Vegas to see some musician from the 1900s before he dies. It's really in quite poor taste to suggest that other millionaires and billionaires from the Steve Bannon\\Steve Paddock Red Commie KGB Sister Party, Rump's Infamous KKK Repug Machine-Gunners Bunch (aka, The Goopers) are likely to gun down EVERY stale musical act by this New Year's Eve. Doubtless some of these Cathy's Clowns will hunker down in the Fall-Out Shelter Bunkers built during the Cuban Missile Crisis before the Bump Stock Boys can wipe out all of them!"}, {"id": 148, "text": "This film tells the story of three women who try to have an unconventional Christmas.After ten minutes of watching this film, I already knew it was bad. It did not get better at any point. The lines are bad, the story is bad and the jokes are bad. The characters are not likable and act silly a lot of times. The story revolves around Christmas, but does not feel festive. Perhaps it is because there is too much bickering and fighting among the characters."}, {"id": 149, "text": "Thought it would be silly funny but it was not. It was a senseless movie with 4 letter words interspersed and lacked true humor. I do not see how 75% liked it. Do not waste your money."}, {"id": 150, "text": "Movie was hilarious and off to a great start. However, near the end there was a massive downer and then they try to add in jokes to make it funny again. Why can't a comedy just be funny till the end anymore? The first movie was very funny and even though I am not a parent I could laugh at the movie. Had high expectations for the movie but oh well."}, {"id": 151, "text": "I was excited to see this as a follow up to the first one (which I truly liked) but this was NOT very funny and the story line with the older moms was a bit depressing. And where was more Christina Applegate? Why just a quick cameo? The scene at the mall could have been funnier, had it been a touch more realistic. Who drinks beer in a food court? They could have gone to a cheesy restaurant int the mall. Stealing a tree from Lady Foot Locker? Really???? Was that an advertising plea? I did enjoy Sexy Santa guy from This is Us. He was great. The scene at SkyZone was OK. But overall this was corny and just not funny enough. I couldn't wait for it to end. Sorry Not Sorry."}, {"id": 152, "text": "Disappointing. My baby cried through the whole movie! Ha, ha. Seriously, Great cast, bad script."}, {"id": 153, "text": "I was trapped at thanksgiving and couldn't change the channel. This was the absolute worst movie I've seen in a very long time. So unbelievably stupid. Some beefs I have: that one mom who won't let her mother live in the same state as her even though she's a widow and has no other family. What a cold b*tch. Also, the mother was able to close on a house and relist it all in two days time. The whole dance scene at Christmas dinner was so cringy, it might just be the worst scene ever made. What an embarrassment for the actor. Why was Susan Sarandon even in this toilet of a movie?"}, {"id": 154, "text": "Had potential. Turned it off after 30 min. Too much montage fast stuff and bad jokes."}, {"id": 155, "text": "The first movie was for sure geared for a female audience no doubt and this one doubles down on that. The movie can be entertaining but...My problem lies with how these over the top mothers are allowed to carry on and no one says anything! Granted the idea is that the movie is set up towards the mothers and daughters to ironing out their problems, but any normal person would've called out these old women for the way they act. A hint of realism could help...A side note that has nothing to do with the quality of the movie but one has to wonder what would happen if the gender roles were reversed..."}, {"id": 156, "text": "This is just an ok movie. There are funny, not laugh out loud, moments, but it is not as good as the first one. It's like a crude and trashy version of Stepdad 2. Look, my mom can be super overwhelming; however, I have no problem telling her no. These women gotta man up. And what is up with Justin Hartley from This is Us? No, just no. You cannot unsee that! I would only suggest watching this movie if you have absolutely nothing else to watch."}, {"id": 157, "text": "One ofThe most ridiculous movie I have been see in my life"}, {"id": 158, "text": "This movie is just a headache. I wouldn't say it's bad or stupid. It has entertainment value, but just a headache. That's all I could say.Skip it if you don't want a headache4 stars"}, {"id": 159, "text": "Superb acting by all the stars. Great cast. the funny bits are okay but the story/script makes me cringe and for most of the movie , I felt the movie depicts disrespect to mothers.Mothers should be able to get away with almost anything with their kids!"}, {"id": 160, "text": "Such a waste of the actresses' talent.Every single of one is so great. But the script... oh my"}, {"id": 161, "text": "Kiki wanting her mom to live far away from her felt wrong at so many levels!"}, {"id": 162, "text": "Very disappointed. This film starts out just as good as the first left off and after the grandma's show up everything including the story and the jokes just fall flat."}, {"id": 163, "text": "Puff weird movie , not exactly a Christmas movie I would say. Didn't like it."}, {"id": 164, "text": "I'm only 20 minutes in, and without having read anything about this at all, I was thinking that this is just a lame attempt at a women's Hangover. Turns out it's by the same people... Yeah. They shouldn't have tried that. Do not recommend."}, {"id": 165, "text": "Lacking in any form of a story, a decent script, anything considered comedy and even from a good cast there's little good acting there too.A struggle from start to finish."}, {"id": 166, "text": "This really is a waste of time and (normally) good actors. The characters are way beyond cooky and silly - they're just unbelievable characatures of hackneyed stereotypes. It's a Lifetime movie with a big dick and some swears. Both the characters and the film makers are a tour-de-force of wasted money and meaningless excess."}, {"id": 167, "text": "A Bad Moms Christmas is the follow up to the surprisingly funny Bad Moms. In this holiday sequel, Mila Kunis, Kristen Bell, and Kathryn Han returns as Christmas is upon us all. The festivities - and hopes of chill ones - are however disrupted as each and every bad moms' own mothers show up with their individual bad sides. A Bad Moms Christmas has some fun moments, although they often feel like remakes from scenes from the first movie, but about 20 minutes in, these are overshadowed by the very familiar formula it follows. That's perhaps no surprise, it's hard to find Christmas movies that are even remotely original, but the fact that the comedy is unoriginal in the most underwhelming of ways does not help. Three mothers getting drunk at a mall, dirty dancing with Santa Claus, or just visiting a strip club is really not that interesting. Baraski and Sarandon do lift the scenes in which they appear but it isn't quite enough. A Bad Moms Christmas is a film that you can easily leave out on in the hectic weeks leading to the grand holiday."}, {"id": 168, "text": "Had a bunch of really funny parts and generally made me laugh a lot. but really heavy on the drama and emotional stuff, significantly more than the previous movie. and it just wasn't as well made. overuse of montages, some really lame scenes. and they went completely overboard in some parts, really unrealistic things happen, the movie becomes kind of a joke, which is fine if it's that kind of movie, but it isn't. and please please stop using the lame opening scene from a later time and then go back to the start. if it doesn't serve a purpose, don't do it. they just try to get your attention. it should be used to enhance the story or make things a surprise, but so often like in this movie, all it does it tell you what will happen later, which is idiotic (1 viewing)"}, {"id": 169, "text": "It should be called A bad Christmas movie. Great actors with a horrible plot that never seems to climax. Do not waste your time and money on this poor excuse of a film."}, {"id": 170, "text": "Will kenny ever be apart of this, taking of Michael Richards roll?"}, {"id": 171, "text": "Over the top funny. We all can relate to most of these characters. My first Bad Mom movie. I grabbed the first movie and watched it. Funny series."}, {"id": 172, "text": "Ok. First let's remind everyone that we're talking about Bad Moms Christmas here, a holiday themed sequel to an already ridiculously over the top chick flick. For those of you expecting Oscar caliber performances and storylines, you will be sorely disappointed. However, if you go into it expecting some laughs, raunchy jokes and maybe even a couple tears (love you mom) then I think you may enjoy it. Christine Baranski plays Mila Kunis' especially overbearing perfectionist of a mother perfectly, and I loved Kristen Bell's meltdown over her helicopter mom! Kiki!!! And who didn't love Kenny G thrusting with his trusty sax during the credits? I definitely giggled throughout the entire film! Grab a bottle of wine, remove the stick from you know where, and just relax and have a few laughs. It's just a movie."}, {"id": 173, "text": "While it may not be an Oscar winner, I haven't laughed so hard since the episode of Friends with Ross and the leather pants. God, this was funny! So stupidly, unbelievably funny."}, {"id": 174, "text": "The first one was really really funny. I wonder what happened here. Lines are boring and the plot isnt something exciting.But in its own right, movie is a good past time"}, {"id": 175, "text": "I didn't think it was awful. It WAS funny just didn't live up to the original. It's interesting that the kids dad completely disappeared after the divorce."}, {"id": 176, "text": "Instant classic!! It is a movie we will watch several times during the year! One of the funniest xmas movies ever!"}, {"id": 177, "text": "I know this is a film but I can relate to Amy, Kiki, and Carla as not my mum but my Nan is just like their mums as she expects my mum and I to be perfect and demands it and other things and if we're not who she wants us to be she'll either stop talking to us or start an argument, oh and Amy's kids are selfish brats in this film, they are never happy and they don't understand what kind of grandmothers they are to their own kids. But I did enjoy this film, they were the only problems I had with it."}, {"id": 178, "text": "More wacky &amp; zany antics from the Bad Moms except this time with their own moms in tow and a whole lot of Mommy issues!Justin Hartley makes this movie worth watching. He is sexy santa #2 and dances for all he's worth.Worth a rental!"}, {"id": 179, "text": "Wow, some people have no sense of humor. I just rented this on RedBox and laughed a lot! It is raunchy and there is a lot of foul language but that's what you expect after the first one. Each one of these ladies and their mothers were fantastic."}, {"id": 180, "text": "The first movie was funny , sometimes hilarious and this one continues the trend , what it lacks is a linear story , present in the first one . the veterans have lifted the movie on their shoulders and the moms from the first movie are just supporting ."}, {"id": 181, "text": "I usually do not write reviews, but I have to for this movie.. It is a laugh riot from start to end.. With some great actresses and some of the best laugh lines I have ever heard. This is my opinion and all the nay sayers, well are wrong. You have got to rent this movie , you will not regret it."}, {"id": 182, "text": "Christine Baranski is perfect (as per usual). Susan Sarandon and Cheryl Hines were amazing in their roles. The acting of the supporting cast was great. Christmas can be such a stressful time of the year for many people. You got a glimpse of Ruth's (Christine Baranski) upbringing which really helped to understand her behavior towards Amy. Not a fan of he Isis (Susan Sarandon) character but it helped us to see why Carla is the way she is. As for Kiki, the relationship between her and her mom (Cheryl Hines) was the least toxic or so you thought.All in all a very funny movie. Any movie that has the legend Wanda Sykes in it, I am going to love. She makes me laugh."}, {"id": 183, "text": "The good thing about this movie is that it isn't a rehash of the first one. There are some genuinely funny scenes and lines and it isn't too crude compared with what some comedies these days have to resort to. Another good thing is Mila Kristen and Kathryn don't dominate this story. They let the Grandmas shine and they all steal the show. Susan Sarandon as wild grandma looks very young. Cheryl Hines has some really funny scenes as the grandma with boundary issues with her daughter. Christine Baranski really shines as the overbearing perfectionist mother. Peter Gallagher is a welcome father of Mila Kunis' character and Justin Hartley is funny as Santa. Worth a watch. One of the better Christmas comedies for some time."}, {"id": 184, "text": "It was really good to meet again the bad moms. Mila Kunis is amazing, and I was not a big fan of her. Her mom in the movie plays very good. My favorite from the first movie, Carla is such a funny character like usual and her mom is played by Susan Sarandon! It was a nice surprise to see the doctor (Jess boyfriend) from the TV Show Mistresses to play a handsome stripper."}, {"id": 185, "text": "I actually really liked this movie. Even more so than the first movie. It's not a movie for you if you want something truly deep and spiritual, but it's a really sweet and charming movie about family, friendship and last but not least Christmas. And I even liked it more than i expected. And I actually had quite high hopes for this movie. So this highly recommended for those of you who liked the first movie, or just want to see a great movie for Christmas."}, {"id": 186, "text": "I won't lie I was not a fan of the first Bad Moms(2016), which I felt was one big joke that just stopped being funny half way through. And going into this I had very little expectations, but surprisingly I really enjoyed it, at least here it didn't feel like a one joke premise, this time I enjoyed Mila Kunis more here then I did in the first one, Kristen Bell also shines more, and so does the underrated Kathryn Hahn.Susan Sarandon, Cheryl Hines, and Christine Baranski really come alive has the bad moms moms. Jay Hernandez who was just a minor character in the first one, really shines more here, not by much. Is this a masterpiece, no way. But entertaining enjoyment. If you like a good raunchy Christmas comedy then A Bad Moms Christmas is that movie for you. And the way this movie ends I feel like there will be Bad Moms go to Vegas."}, {"id": 187, "text": "A BAD MOMS Christmas (2017) **1/2 Mila Kunis, Kristen Bell, Kathryn Hahn, Christine Baranski, Susan Sarandon, Cheryl Hines, Jay Hernandez, Justin Hartley, Peter Gallagher, Oona Laurence, Emjay Anthony, Lyle Brocato, Wanda Sykes, Christina Applegate, (Cameo: Kenny G as himself) Frequently funny sequel to the budding franchise with mom buds Kunis, Bell &amp; Hahn facing the horrors of the holiday season - to wit: their mothers from hell - perfectionist bitch-on-wheels Baranski, dead-beat stoner Sarandon and creepily smothering sweetie Hines - unexpectedly arriving for the festivities. While filmmaking team Jon Lucas and Scott Moore have the heady mix of bawdy comedy and sweet heart laced in the film overall is rather predictable yet there is undeniable chemistry between the ladies and that is worth the price of admission all itself."}, {"id": 188, "text": "Everything about it seems to scream doing it for the money. It does not have the same focus or gusto that the original movie had. Bad Moms was about something while Bad Moms Christmas was all fluff. You would think adding a new set of moms to it would create some a new depth of problems that need to be resolved with another don't give a crap revolution processing because of it, but that's not what happen. The revolution of moms taking back Christmas was weak and that's where the laughs come from in the Bad Moms franchise. Bad moms Christmas has a few laughs but not enough to rush out and see it.It's too bad, because I really like what Bad Moms was doing and I wanted to see that continue in Bad Moms Christmas but it fall flat of being anything worth wild.http://cinemagardens.com"}, {"id": 189, "text": "Nice acting, decent story, it just didn't make me laugh out loud. I snickered a little, but I wanted it to be really funny. I guess if you find kids dropping the F bomb funny, then you might enjoy it more than me. I like all the actresses, it just wasn't very funny. Maybe if I was a mom who was tormented by my mother it would have had me rolling in the aisles, but I don't think so. Safe to wait for it on Netflix."}, {"id": 190, "text": "This is another Hollywood formula comedy with raunchy humor and a feel good ending. Three bad mom have their bad moms visit them at Christmas and create havoc. The film had some good fresh scenes especially with Wanda Sykes. The A list did their typical good job with some decent editing made the film enjoyable. The actresses were able to deliver on their line in a less than stellar plot.Guide: F-words with sexual humor. Sex. near male nudity."}, {"id": 191, "text": "Bad Moms came out last year and was not very original but was really good,it was basically Mean Girls but if it takes place years later,now,A Bad Moms Christmas has finally came out and I was very excited to see it although I never really got to pay attention to it or even see the trailer,from what I heard,the film received pretty negative reviews from when it came out two weeks ago,but I loved it! Bad Moms Christmas is actually nothing like the first film,in the first film,it had a mean parent group at school and in this film,its a group of posh and annoying moms,which I really liked. The film dose have some bads though,the film has a really long pace and then when the ending hits,it was not really even that good,at least in the ending of Bad Moms,it was a bit exciting,this was just..ya know,pretty unoriginal. But otherwise,Bad Moms Xmas is a really good sequel to a really good comedy"}, {"id": 192, "text": "The bad moms mothers are coming to visit for the holidays. Mila Kunis is horrified at the prospect. With Christine Baranski as her mom who can blame her. I have been a fan of Baranski since the days of the Cybil TV show. Shes very funny in this movie. Giving her grandchildren the most extravagant gifts. Insisting the family has to see the real five hour long nutcracker not the Disney version. How the most go caroling to all three hundred homes in the area. If they are going to win the caroling prize.Don't worry she hired back up singers. Decorating the outside of the house that goes way over the top From the bad moms Mila Kunis is easily the most likable. The rest of the actors are OK. Its rude,crude and pretty funny I was smiling a lot through the whole movie."}, {"id": 193, "text": "This is a film that suffers from sloppy or possibly the absence of a script. There are several funny moments in this train wreck tied together with a lot of WTF script. It's mildly raunchy- we watched it with kids ranging from 10 to 17 and hadn't expected that based on Bad Mom's the original. A lot of the humour is adolescent and the kids thought it was funny. I laughed at several scenes. This movie is watchable but don't expect a great movie. This film is better than the worst reviews. Yes it's a sequel of a less funny but better scripted movie. I mentioned that there are several moments in this movie that were funny- laugh out loud funny- I don't recall laughing out loud during the original- which had mildly amusing moments but with a script that actually was more coherent.While I'd not likely ever watch either Bad Mom's or Bad Mom's 2 again, I would watch 2 over the original."}, {"id": 194, "text": "BECAUSE PEOPLE WOULD TEAR THIS APART! I went to see this yesterday for some Christmas cheer and I got this piece of crap excuse for a holiday movie. This film was written by the two men behind The Hangover series. It revolves around Mila Kunis, Kristen Bell, and Kathryn Hahn and the arrival of their mothers Susan Sarandon, Cheryl Hines and Christine Baranski. ALL ACTRESS WHOM I ADORE! But the script was just stupid stupid stupid. NOT funny and the characters downright unlikable. I absolutely love the actress Kathryn Hahn but having her and her mom (Susan Sarandon) out in front of a store with a basket that says Canned goods donations where they proceed to aggressively STEAL GROCERIES from the bags of people who exit the store, open a bottle of wine and drink it in the parking lot makes them not only UNLIKEABLE but not funny and pathetic. Why in the HELL would I root for these characters? And when Mila Kunis' character tears down the X-mas tree her mother put up with ornaments from the Titanic and destroys everything her mother did? The only thing I was thinking was Wow what an A**hole. HATED THIS MOVIE and I'm sure the actresses who probably just needed a paycheck did too.3 stars for the cast and the pretty set decorations."}, {"id": 195, "text": "This movie is stupid and ludicrous, but a riot—gratuitous in its R-rated language and sexual content, and fully boasts its awesome cast in several outrageous ways. After feeling out our moms (Mila Kunis, Kristen Bell, Kathryn Hahn) in the first film, I really now see and understand how the unique characters bring out the most in one another, and it felt more organic as a result. The 104-minute run time felt just fine to me and not overlong, but there was one subplot of this film I still could have done without and did not add much to the story, and removing it would have brought it down to a tight 90 minutes.The Christmas theme is integrated right into the plot and is a fresh way to pitch the sequel, and the grandmoms help induce the struggling relationships that one could find in a hard-hitting melodrama: one whose mom has unrealistic expectations for her daughter's motherhood, one who wants separative space between herself and her mom, and one who wants more closeness to her mom. It sounds very general, but when within the right framework (when not clouded by the film's foolishness) it hits as very real when it tries to. While the first film really felt to be for moms in that there is a general message that will make them feel important walking out of the theater, this sequel tries to deliver a similar thing with the grandmothers to a lesser effect.Now that there are two comedy sequels releasing about parents' parents coming home for the Christmas holidays, the similarities stop there and audiences have a choice between seeing: men/women, naughty/nice, or crude/slapstick. I'd say for the appropriate age, A Bad Moms Christmas delivers on more fronts than Daddy's Home 2 (which I also saw a pre- screening for, by the way); regardless, prepare to turn off the suspension of disbelief switch and prepare for a decent abs workout. Neither the first film nor the sequel are anything special, but they also aren't a complete waste of time and money for how absurd they are."}, {"id": 196, "text": "As I purchased the tickets​ for this one, I said,  Bad Mom's Christmas, although I'll probably regret it  Some girl standing in the line next to me said,  You won't regret it. Go for it.  I wish I had run into her again, after the movie, just so I could tell her how much I regret it after all. I was really, really annoyed by this movie, because we get this exact same movie every year. You know the routine: dysfunctional, extended family reunites for the holidays, personalities clash, hilarity ensues, they must put aside their differences, more hilarity ensues because PLOT. Regardless of what happens, we know there will be a dance routine in the penultimate​ scene, rounded up with a contrived, seemingly contractually obligated happy ending, again, because PLOT. I didn't see the first film, and went to see this only because it was Thanksgiving, and I was on a binge watch at the cinema all day, catching up on recent releases I've missed ( this movie, followed by Daddy's Home 2, and The Man Who Invented Christmas, concluding with a rewatch of The Shining ) , and because Mila Kunis is still very attractive, and I'll admit, I was a bit unclear of the characters' names until about 30 minutes in. I was also unsure why hasn't 32 years old Mila stood up to her mother yet, rather than acting like a scared, timid child, every time her mother calls her fat, or undermines her in front of her family? that subplot is depressing and grating, while the clingy mom subplot was creepy as hell ( she has her grown daughter's face emblazoned on her sweaters, watches her having sex with her husband, tells her she has a variety of fatal diseases just for sympathy, and even * buys * the house next door to her, just to be near her! Boundaries, bitch! That's not funny, that's stalker material, but Merry Christmas. ) Random  celebrity  cameo: Kenny G., who has​ one funny line, after Mila Kunis tells him to take his flute and leave her home, he responds,  It's not a flute, bitch ... !  There's a huge, on-going argument between Mila and her mother's character, who wants to lavishly decorate her home for Christmas, while Mila wants a modest Christmas. Who cares? If the bitch wants to decorate her home lavishly, and AT HER OEN EXPENSE, who cares? Let Mila quietly tell her kids  We'll have​ a quite Christmas next year, but for now, let's just let her decorate, she's paying for everything One of the bad ( grand ) moms is named Isis, like the terrorist organisation. Seriously. That's the joke, and it's funny because movie. They get drunk in a mall, at lunchtime, and take naughty photos with an elderly Santa, and again, it's funny because movie. I face palmed so much when, in the penultimate scene, the Sexy Santa announced he was going to  express his feelings through dance . Random and disjointed, it's a series of barely connected vignettes, linked together only by cast, and quite frankly, this looks like it was only the first draft of the script, fleshed out with ad- libs, and dance routines. If you absolutely * must * watch this, see if you can figure why the first two thirds of the story are told through flashback?"}, {"id": 197, "text": "I wanted to read the reviews after seeing only 5.5 stars.Here are my thoughts...1) Parts of this movie is wildly inapproproate and creepy. If you don't find crude humor amusing... Do NOT watch this movie. Typically, I do not find it funny. However, there were parts that had me giggling. I found the last scene to be a bit much. Humping infront of children?2) Walking in to treat the client as a sex object is defintley going to rub some of us that support the Me too movement the wrong way. Also, wildly inappropriate. Screams sexual harassment. And, made me uncomfortable.3) Kenny G. calling Mila a B? Not a fan. I thought that really torched his character for me.If you can get through all that, the movie is extremely overstretched in every way. But, humorous. Cliche' mom and daughter relationships? Sure. But, was able to make me laugh about my difficult relationship with my mother. I love both bad moms because it feels like what we all WANT to do sometimes. Day drink, act like children at a trampoline park, not be slaves to the holiday season."}, {"id": 198, "text": "I looked at the cast for this film and I am a fan of the mothers so I thought I would relax on a rainy afternoon and enjoy some laughs, and I like holiday films in general.First disappointment was having youngsters using fowl language. This is a film with children yet with the R rating children can't see it, and they shouldn't. Children swearing in films is never a good idea, it's not creative and it's just a bad thing to do.This film was way over the top making every aspect of the film far from realistic, too heavy handed. Twenty minutes into the film I knew I could not sit still so I went to customer service and said I needed to leave, I felt nauseated, so they cheerfully gave me a voucher to see another film when I am feeling better. I must take better care in choosing films. I won't even bother with this film when it comes to Netflix~"}, {"id": 199, "text": "Those who saw the original Bad Moms should have been aware that they were in for a silly, nonsensical, quirky, and fun type of film. These stories are not driven by an intricate plot, which many other reviews pen as a downfall of the film.A Bad Moms Christmas follows up on the friendship of Amy, Kiki, and Carla while introducing several new characters in order to tell a Christmas story. It does not contain a deep story which will make you rethink life or experience an extreme emotional reaction. The movie is silly as it was intended to be.Unlike Bad Moms, it retains the same pace throughout the film and does have some extremely hilarious moments; which are again, silly.If you know what you're getting the movie is entertaining.True Score: 6.6"}, {"id": 200, "text": "A Bad Moms Christmas is a sequel to Bad Moms(2016). Amy(Mila Kunis), Kiki(Kristen Bell) &amp; Carla(Kathryn Hahn) are stressing out about Christmas. As mothers, all the expectations are on them to make sure that their families have the perfect Christmas. To add to the pressure, their mothers decide to drop by for a surprise visit. A Bad Moms Christmas is a hilarious film. Directors Jon Lucas &amp; Scott Moore make sure that, the protagonists repeat all their shenanigans that made Bad Moms(2016) a surprise hit. The viewer is guffawing throughout. However, the humor felt a little bit more fresh, in the original. The performances are what make this movie, so hysterical. Mila Kunis is spectacular as Amy. Kristen Bell is outstanding as Kiki. Kathryn Hahn is mind blowing as Carla. Christine Baranski is brilliant as Ruth. Susan Sarandon is fantastic as Isis. Cheryl Hines is awesome as Sandy. Jay Hernandez, Justin Hartley, Peter Gallagher, Oona Lawrence, Emjay Anthony, Lyle Brocato &amp; Cade Mansfield Cooksey are amazing as Jessie, Ty Swindel, Hank, Jane, Dylan, Kent &amp; Jaxon, respectively. The supporting cast is great. A Bad Moms Christmas is a must watch for fans of Bad Moms(2016). Go &amp; be a little naughty this Christmas!"}, {"id": 201, "text": "If you have a bottle of something that helps you through holidays with family, then use it liberally after seeing A Bad Moms Christmas because this film will only add to your blues. Not only is it not funny; it is also boring as it trades mercilessly on stereotypical mother/daughter rivalry and takes amusing moments stretching them out to seeming infinity.For the three principal young moms, Amy (Mila Kunis), Kiki (Kristen Bell), and Carla (Kathryn Hahn), their mothers in different ways present the ugly side of cheer. In each case the mother domineers by not appreciating her daughter, competing with her, or so misunderstanding her as to make familial love impossible.As for Amy's kids, helicoptering by Grandma Ruth (Christine Baranski) is the mode of loving, never a good thing and one of the few satirical nuggets in an otherwise sloppy script. Not that grandma is devoid of good lines, e.g., Its December 19th — even the Jews have Christmas trees by now. Most egregious are the lengthy sequences with a male stripper, Ty (Justin Hartley), which have him dancing too much with those gestures supposed to be erotic but end up being lame, even if he is better than Magic Mike. At least the directors/writers, Jon Lucas and Scott Moore, have the wit to place him romantically with the cheesiest of the three ladies, Carla.The coda is arguably the best part when it philosophizes about the fraught relationships between most daughters and mothers. But that's too little too late. The Grinch rightfully owns this movie, so move on to find real laughs somewhere this season—good luck with that."}, {"id": 202, "text": "If you've seen Bad Moms, you'll remember it to be a mediocre effort with a few laughs here and there. Well that film not only gets a sequel, but one that is more festive themed. The film came quick and a little out of nowhere, though I was interested how the film would fare with its holiday theme. I like raunchy holiday films, they can be a lot of fun. Or completely terrible. A Bad Moms Christmas kind of falls in between the two. Its not really an improvement over the first but does enough to be a time killer with a few laughs.Our three lead moms are back but this time its almost time for Christmas and the moms of the moms all drop by. There are character flaws in all of the mothers. Whether it be abandonment, too much attachment, or a resounding coldness the moms and their daughters do not see eye to eye. A bit of chaos ensues as the character try to find a way to co-exist and come together for the holidays. That plot summary must have sounded confusing as hell. Its a rather simple plot though, not overly original but sufficient for what the film offers.The film has crude sexual references but fewer than that of its predecessor. For an R-rated holiday film its surprisingly tame. The laughs don't always come but I do remember laughing at loud twice. The introduction of characters played by Susan Sarandon, Christine Baranski, and Cheryl Hines is a good touch because they provide the audience engagement and do provide the laughs. The film does not avoid cookie cutter plot resolutions and doesn't really remain creative but its fine.The film isn't going to rank anywhere on the best holiday movies of all time. You won't remember it in a few days after watching it. It's not really worth a watch, but if you are a movie pass crusader like me who watches everything you'll find that the film is somewhat decent and provides for mild entertainment. I do hope the series rests here because I can see a supposed third film run out of steam fast.6/10"}, {"id": 203, "text": "If you really enjoyed the original Bad Moms it should be no surprise that this one was not as good. With most comedy sequels we tend to watch them because we really liked the characters not because there's any type of story that needs to be continued. I mean if you look at The Hangover movies more than one wasn't really necessary but the characters were so likable they knew they could continue with them. Bad Moms is pretty much the same. I felt the characters were just as likable this time around though not as naturally funny. At times the comedy was forced and was basically a rehash of the first one with Christmas thrown in. However I did like adding their moms to the mix. Susan Sarandon as Kathryn Hahn's mom in particular was one of the more funny ones because they were so similar. It was also a pretty enjoyable Christmas movie and kind of got me in the Christmas spirit even though Halloween literally just ended. Obviously it's not an It's a Wonderful Life classic but a good Christmas comedy. Overall I like the theme of a film being called Bad Moms when they're all trying pretty hard to be good moms that just realize they can never be perfect. I like that most moms can relate to at least one of the characters. And yes if they made a third called Bad Grandmas which they pretty much made it look like they would, or at least could, I would see it."}, {"id": 204, "text": "A Bad Moms Christmas (2017 release; 104 min.) brings more from the original bad moms. As the movie opens, we once again hear Amy introduce the story. I am Amy Mitchell and I just ruined this year's Christmas she tells us, amidst what appears to be a war zone in her house (and a camel walking by!). We then go back in time to 6 Days Before Christmas, where the story begins as Amy gets ready for Christmas and things start going wrong when her parents, and in particular her domineering mom, show up. In parallel stories, Kiki and Carla also get visited by their moms. At this point we are 10 min. into the movie, but to tell you more would spoil your viewing experience, you'll just have to see for yourself how it all plays out.Couple of comments: last year's Bad Moms was an unexpected success, and I found it to be somewhat of a delightful little move, in particular with Mila Kunis and Kristen Bell playing against character as the moms gone wild in the funniest of ways. So when a sequel was announced, I was all in. Once again co-written and co-directed by Scott Moore and Jon Lucas, nothing could go wrong, right? Sadly, I must report that this sequel is nowhere close to the original, and nowhere near as funny. Why? While in and of itself it seemed like a good idea to add the three mothers of the original bad moms to to plot, it actually resulted in this being a movie more about the mothers of the bad moms, than it is about the bad moms themselves. In particular, this is mostly about Amy and her domineering (and thoroughly unlikable) mother, although of course the other two bad moms and their mothers get plenty of screen time too. The weird thing is that, contrary to the original movie, the bad moms are no longer bad at all in any respect, in fact trying like crazy to win their mothers' approval and love and pleasing their respective loved ones as best they can. Yes, there is one scene early in the movie where the moms go crazy during a shopping mall spree, but that's about it. And then there are the male strippers scenes (yes plural), which got a lot of hollering and hooting from the theater crowd (mostly female, of course). There was no such reaction when the young girl (daughter of Amy's boyfriend, maybe 6 or so?) dropped the F bomb, not once, not twice, but multiple time. The bottom line is that Kristen Bell, Mila Kunis and Kathryn Hahn are sadly overshadowed by their mothers, played by Cheryl Hines, Christine Baranski, and Susan Sarandon, respectively.A Bad Moms Christmas opened wide on Wednesday. The Friday evening screening where I saw this at here in Cincinnati was attended just okay (not even half full in a small theater), quite surprising for a movie's opening weekend. I'd say this does not bode well for the long term success of this movie. Surely this will not generate strong word of mouth. I had high hopes for this movie, but sadly the film makers deviated way too much from the original premise, and this should've been called The bad moms' mothers screwed-up Christmas. I encourage you to check this out, be it in the theater, on VOD or eventually on DVD/Blu-ray, and draw tour own conclusion."}, {"id": 205, "text": "A BadMoms Christmas directed by Jon Lucas and Scott Moore is wilder than movie Bad moms. This movie is about bad but fun mom and grand moms. Mila Kunis as Amy is hardworking, overworked mom with lots of love for her kids and always on edge around her stylish, rich, loving mom Ruth ( love Christine Baranski ... Mama Mia/Big Bang Theory). Kathryn Hahn as Carla is foul mouthed but does not care about pretensions and maybe genetically inherited her personality from her mom Isis ( wild Susan Sarandon, enjoyed her acting in movie Meddler). Kristen bell as sweet Kiki under the tutelage of Amy and Carla is not very nice to her mom Sandy ( Cheryl Hines). My favorite scenes are the counseling sessions by Dr Karl( Wanda Sykes) for Kiki and Sandy. Every daughter should hear what Dr Karl says. Justin Hartley ( from NBC show This is Us) as Ty ,a strip dancer,is alright as Carla's passionate , instant boyfriend. Peter Gallagher as Amy's dad Hank does a good job at bringing peace between mom and daughter. Christmas can be quiet and without any expression of love by not giving or receiving gifts but Christmas is great when joy is expressed in decoration, food, giving and receiving gifts. I am glad i saw the movie. Christmas is special and not like any other day. Ruth's love for Christmas and expression of love and affection for Christmas is contagious. nicely done."}, {"id": 206, "text": "If you've seen 2016's Bad Moms, then you'll know what sort of humor to expect in A Bad Moms Christmas. The protagonists (Mila Kunis, Kristen Bell and Kathryn Hahn) from the original are at wit's end from having to make Christmas perfect...and then their moms show up. One's (Christine Baranski) a perfectionist, one's (Cheryl Hines) clingy, and one's (Susan Sarandon) a stoner. Sure enough, the personalities start clashing.Much like how the original looked at the excessive tendency to organize our lives in the 21st century, this one looks at the stress that dominates our lives during the holidays. It's easy to understand why Amy, Kiki and Carla do what they do in the mall (Carla's crassness abets it, of course). And the moms have their own issues to deal with.Obviously, it's not any sort of high-brow cinema, but it's not supposed to be. The point is to be raunchy, and the waxing scene makes clear that the movie's not going to resist doing whatever it wants. Baranski's character is basically her role as Leonard's mom on The Big Bang Theory (her no-nonsense physiognomy makes her perfect for these roles).Basically, it's a fun movie. Keep an open mind and you'll enjoy it."}, {"id": 207, "text": "The bad moms are back! This time they're out to reclaim the most stressful time of year on behalf of moms everywhere by letting loose and liberating themselves from the oppression of mandatory holiday cheer. Amy (Kunis), Kiki (Bell) and Carla (Hahn) team up yet again and support each other during the holiday season all while all three of their mothers come to town for an unexpected Christmas visit. Will our three diverse personalities of middle class white women escape Christmas unscathed? Or will they be overwhelmed by the towering expectations of their dysfunctional mothers.Everything bad that can be said about Bad Moms Christmas can also be said about the original Bad Moms; tired jokes, broad characterizations, unimaginative staging, an over-reliance on improv that assumes the editor will be able to just find the movie in post etc. So then given all its faults, why am I still smiling? Why is this hastily assembled follow up to a mediocre R-rated comedy arguably better than the original? Well part of the reason may just be this movie doesn't have that far to fall. The first film posed as an invigorating subversion of gender expectations instead of drawing attention to what it really was – a trash movie. This one basically takes the shoddily propped up premise that we're already familiar with and merely staples tinsel to it. Yet because there's a lived-in quality to it, because we're already familiar with these characters, all we need to catch up is for the girls to dunk rum into the mall's Teavana samples and say f**k a lot.With no faux mission statement sprucing up the inappropriateness like protesters in a Kylie Jenner Pepsi ad, the measure of success is now whether Bad Moms Christmas can get you to laugh. And it does – not often enough to endorse strongly, but Bad Moms Christmas does have a few zingers worth repeating at the next neighborhood Tupperware party. Kunis, Bell and especially Hahn get a few good quips here and there and for once look comfortable just being in each others' presence.If however you wanted to know the primary reason why A Bad Moms Christmas is better than its prequel, one needn't look further than the rib-tickling performances of Susan Sarandon, Cheryl Hines and Christine Baranski. Baranski especially, who has had a long career playing ice queens, is downright superb as Amy's formal, acid-tongued, high society mother. Honestly this movie is bumped up a letter grade simply because between Baranski and Hines's clingy best friend mom, not a single opportunity for a laugh was lost.Susan Sarandon is also tremendous though much like the kids in the first film (or in this one for that matter), she's sadly underutilized. What's worse is her relationship with her daughter Carla offers the most narrative opportunities for growth, but this being a broad American comedy means any real human moments are quickly swept under the rug.Swept under the rug along with any meaningful insight on motherhood – the second time this series has managed the same thematic swing and a miss. Oh well, at least the jokes and gags reach new levels of raunchiness that border on the absurd. There's a memorable scene with Justin Hartley involving a few strips of hot wax that's sure to delight. And if not, there's always the old standby of listening to young children say the darnest things again and again. If you're not laughing at least once during this movie, then you're probably just not in the spirit."}, {"id": 208, "text": "Review Date 2/10/2018PLEASE BEWARE OF SOME REVIEWERS THAT ONLY HAVE ONLY ONE REVIEW. I HAVE OVER 400 REVIEWS OF CHRISTMAS RELATED FILMS &amp; SPECIALS WHEN ITS A POSITIVE THERE IS A GOOD CHANCE THEY WERE INVOLVED WITH THE PRODUCTION. NOW I HAVE NO AGENDA! I REVIEW MOVIES &amp; SPECIALS AS A WAY TO KEEP TRACK OF WHAT I HAVE SEEN! I HAVE DISCOVERED MANY GEMS IN MY QUEST TO SEE AS MANY  C H R I S T M A S  MOVIES AS I CAN.Now Someone keeps reporting my reviews. I guess they are jealous because I do tell the truth. I want to point out that I never make snide remarks about actors weight or real life sexual orientation. If there acting is terrible or limited I talk about that. If a story is bad I will mention that So why am I being picked on? IMDB? When one of my reviews gets deleted IMDB will not even tell me what someone found offensive. Well on to this review.Entertaining sequel that moves at a quick pace. A Bad Moms Christmas follows our three under-appreciated and over-burdened women as they rebel against the challenges and expectations of the Super Bowl for moms: Christmas. And if creating a more perfect holiday for their families wasn't hard enough, they have to do all of that while hosting and entertaining their own mothers.I think the film would have been better served if The Moms went out and sabotaged other people's Christmas's. That would have been more fun. However we got the film that they delivered and it worth watching. It is lots of fun."}, {"id": 209, "text": "Now let me first clarify that I am clearly not a member of the movie's target demographic--that is, I am not a wine-drinking middle-aged woman.This movie is not funny. This movie does not have good characters. This movie is not well-written. This movie is not well-directed. This movie is not charming in any way. This movie was an obvious cash-grab by the studio who made the first movie in the franchise just one year earlier. This movie has no re-watch value.That might only take the movie down to three stars. But that is not all. Indeed, about an hour into this godforsaken film, it takes a turn for the emotional side. The movie becomes a commentary on the fragility of relationships between the mother and the daughter. All three of the main characters get into seemingly irreconcilable conflicts with their mothers. And then everything gets resolved in 10 minutes and everyone lives happily ever after. It felt like another movie was stitched on in the most sloppy, myopic manner possible.There are enough good Christmas movies for you to never have to bother with this one. I'd even say there are enough bad Christmas movies for you to never have to bother with this one. Do not bother with this pure garbage, lowbrow, indecent cinema.I would give this movie a 0/10, but it seems I cannot do that.1/10"}, {"id": 210, "text": "Oh yes, the old and tired comedy formula is ever so apparent here. Character introductions, drink and party, make a load of bad decisions, regret those decisions and then live happily ever after. Highly uninspired, yet somehow still watchable. In this chapter of the mothering saga, our three leading ladies are exhausted from trying to make the whole family happy at Christmas time, so they decide to take back Christmas and do it their own way. But wait, who's that knocking on the door? It's none other than the damn Grandmom's coming to wreck the holiday season even further. Enter Susan Sarandon, Cheryl Hines and the abominable Christine Baranski. These three women steal every scene and definitely inject some much needed comedy into a lacklustre story. This is the first time where I felt Mila Kunis was not the lead star, the over abundance of Kathryn Hahn made her the applicable candidate for lead star. Why? Because she's way funnier than Kunis. That's for sure. Kristen Bell...well, she's just there. Baranski's comedic timing that we all too familiar with in the likes of the never ending The Big Bang Theory is just gold. Just her mannerisms make me smile with glee, I mean not many people can sing We Wish You A Merry Christmas and make me laugh. Then we get to the jokes. Aside from a waxing scene (which was hilarious) and Baranski's character failing to remember her own daughter's boyfriend...it just fell flat. Some of the jokes were predictable (Isis being one of them) and one scene went way too far and dark (regarding Cancer). It's a case of poor writing and not enough subtle humour. It's constantly in your face and I grew tiresome rather rapidly. The third act arrives and the sentimentality is so forced that even Isaac Newton would've made a new law of motion. What even was that!? It's called Bad Mom's not God damn Regretful Mom's. Suck it up and lighten up, not every comedy needs to have values for Christ's sake."}, {"id": 211, "text": "This movie had me in TEARS. Look, if you want a real head-scratcher, obviously this is not the movie you want. This movie provided my husband and I with something invaluable right now: ~2 hours in which we got to forget about everything else and Just. Laugh. I don't understand the people that went to see this movie with any other expectation--did these same schmucks give 10-star ratings to The Hangover or what? Regardless, if you're looking for something that helps you forget about all the crap going on in the world right now, go ahead and go see this movie--it was great. If you want to be morally and emotionally challenged, look for a movie poster where the lead actor looks constipated in the movie poster. And hurry up and get this movie available on iTunes for pre-order. Some of us want it as an option to watch whenever we're feeling down."}, {"id": 212, "text": "With a star studded cast such as Mila Kunis, Kristen Bell, Katheryn Hahn, Susan Sarandon and Christina Baranski, 'Bad moms Christmas' was an enjoyable sequel with even more laughs than the first movie!The gags were better and the cringey-awkward family moments were plentiful! The story was simple but effective with genuine heartfelt moments mixed in with WTF moments and romance.My only criticism would be that there were some quite long drawn out melancholy moments near the end of the film which were maybe to calm people down after being made to laugh till they cried!Stand out performer in this one would have to be either Christina Baranski or Cheryl Hines who gave very honest and very different portrayals of nightmare moms! Christina Baranski was the typical mom who pushes their daughter to be the best whilst Cheryl Hines played the mom who was a little too needy and obsessed with her grown up daughter. Both nailed their characters and gave the most laughs!If you like comedy, this is a great movie for you! Viewer discretion is advised for younger viewers as there is a bit of language and sex references so maybe wait until you are 12 to go and see it!"}, {"id": 213, "text": "I loved the original 'Bad Moms' movie so much that I was actually quite excited to see the sequel 'A Bad Moms Christmas'. The original was a surprise hit for me and a breathe of fresh air into the all-female comedy movies that are becoming more and more common. It had great characters, a fun story and was just an entertaining thing to watch for the entire run time. The sequel sadly has none of that going for it. I actually struggle to believe that the same people who wrote the original and also the original 'The Hangover' movie could write something this incredibly lazy and unfunny.The film basically has no plot. Three women's mothers show up and there is slight tension in each case. That is about the extent that the storyline reaches, I kid you not. This screenplay could've been (and probably was) written in a day. It relies almost entirely on funny one-liners to get any laughs at all out of the audience, but we are so bored by everything else going on that it's almost impossible to muster the energy. There is no situational humour in the movie at all. Each scene just passes by. If you didn't know better you could actually mistake this movie for a drama.Needless to say I did not have a good time with 'A Bad Moms Christmas'. Not only was it dreadful in every way, it also managed to run an extra 10 minutes than it was required to, almost as if it thought it had so much story to fit in. Don't hesitate to give this one a miss, it is a complete misfire."}, {"id": 214, "text": "The reason to check out the original Bad Moms was the chemistry between Mila Kunis, Kristen Bell and Kathryn Hahn. They had funny material to work with but without their individual performances, the movie would have been a decent yet forgettable film. The directors Jon Lucas and Scott Moore know this and rely on the cast to carry them through the sequel (to the point where the movie suffers for it). The funniest and strongest part of this movie is that the 3 leads refused to phone it in. They carry this movie through some of the bumpier sections of the plot and keep you interested in where they will go next. Hahn is still the funniest of the original trio but Bell and Kunis still left me giggling. A Bad Moms Christmas brings in Christine Baranski, Susan Sarandon and Cheryl Hines as Ruth, Isis and Sandy respectively as the moms of the 3 lead actresses. They're all amusing for short moments and they all manage to be decent despite some iffy material (I got tired of Ruth being racist towards Jessie but that's as offensive as it got). Jay Hernandez was given almost nothing to do except to be a prop and Peter Gallagher is a background character until the last 10 minutes.If this movie wasn't written by the same writer/director team, I would claim that they just ripped the first movie off. But it is the same team so all I can say is that this is a lazy script. The worst part of this movie is how the plot is so recycled from the first movie. They did add the 3 grandmas but other than that, they just did the same thing with an Xmas theme. The families are ungrateful, the moms are burned out and they throw tradition to the wind and cut loose to decidedly mixed results. I'm not saying Bad Moms was the deepest comedy on the market but they did a much better job making the characters feel realistic and their dilemmas were familiar and believable. This movie is sorely lacking those qualities and although the problems aren't unrealistic (the Hahn/Sarandon conflict and kernels of Kunis and Baranski's could happen) they're resolved in a rushed and simple manner just like any sitcom.Although they bring in some new characters, if you're hoping to see supporting characters return from the last movie you might be disappointed. As I said before, Jessie is a non-character in this movie and other than some insulting comments from Ruth, there's no conflict with his character. Amy's kids completely forgot the lessons that they learned in the last one, they go back to being self-centred and bratty (they do give a reason but their complete inability to step up for Amy was annoying). They bring back one of the more underrated characters from Bad Moms for a cameo and I thought she nailed it but her appearance in the sequel amounts to just a couple of minutes of screen time.The last and most important question is was the movie funny? Despite the fact that the plot and the character development was lacking I have to say yes. The movie goes long stretches of repeating the same jokes from the original (the montage of the moms going crazy in a public place) or they run jokes that were initially funny into the ground (pretty much any bit with Justin Hartley goes on way too long). But I did get some good laughs in and while I wasn't 100% entertained, I never had to wait too long before a throwaway line would at least make me chuckle. Most of my favourite scenes were just Amy, Kiki and Carla shooting the breeze about how tough being a mom is and sharing their horror stories about it.This was a hard movie to grade. I liked the performances and I did laugh but they rehashed the plot and the emotional beats of the movie feel forced. If they intend to keep treating this as a franchise, my advice would to be to meditate on the next one a little longer instead of pushing it out so fast. I saw this with a friend and her criticism was how this seemed like an enormous cash grab. I still think the original is a solid raunchy comedy for both sexes and while this one still is funny, it falls short of Bad Moms. I'll split the difference and give it a 6/10."}, {"id": 215, "text": "I know, I can't believe I watched the first one, didn't particularly care for it, and STILL watched the sequel. What can I say, I love Kristen Bell and I'm a sucker. At least in the first one, despite the terrible script, the ladies improving was funny, which is all Bad Moms had going for it. With Susan Sarandon and the other moms whose name I can't remember, but think they're great, I thought mayyyybe this one would be better than the last and I would at least get a few laughs. It was all over the place and the jokes just didn't land. And Susan Sarandon and the other moms stole the show...what there was left of it to steal.The writers barely tried in Bad Moms and didn't try at all in this film, so all that was left was a bunch of dumb humor only guys would think is funny but coming out of women's mouths.Just save yourself and watch something else."}, {"id": 216, "text": "Three overburdened young moms try to meet and then rebel against the challenges of Super Bowl for moms - a perfect Christmas.It's a sequel to Bad Moms released in 2016 summer which turned out to be quite a breakout hit, earning over 180 million cinema dollars against the 20 mil budget.Ah, the grrl power comedies, the cute but mostly unfunny younger sister of American mainstream comedies which were kickstarted by 2011's hit Bridesmaid, and Hollywood's eager wish to prove that women can be funny too.Well anybody can funny, of course, but you can't really create a noteworthy all-female comedy without decent script and performances, and/or actresses' ability to improvise, and this is where the new grrl power comedies fall short usually.A Bad Moms Christmas is a good example of this. Like many mainstream comedies, it has enough of everything to get the ball rolling, but the result feels so humorless and lacking that you will probably start checking your watch/phone before it reaches midpoint, at latest.One problem is the generic screenplay, the other is the fact that despite all the talent involved, the story centers on three leading ladies, two of which are not good enough performers to carry this movie.Mila Kunis and Kristen Bell are always decent supporters but they lack the acting range and presence to justify carrying a comedy. I am not even sure that they have enough star power to justify lead parts in a budding comedy franchise.So it's up to third lead Kathryn Hahn to do most of the the heavy lifting, and she's solid as usual, being able to entertain, display some acting chops and create emotional connection with the audience.All the other players are relegated to the sidelines, and have little screen time or almost nothing interesting to do. But they do it well, so I am gonna name them all:* Christine Baranski, Susan Sarandon, and Cherly Hines as the bad moms of the bad moms visiting for Christmas - all veteran actresses, all giving much better performances than Bell and Kunis;* Jay Hernandez, Peter Gallagher, Justin Hartley, Lyle Brocato - various love interests of bad moms, mostly there for decoration. Hartley is surprisingly memorable as male stripper with golden heart.The introduction of his character, an affectionate conversation during balls and anus waxing, is probably the best part of the whole movie, both warm and funny. I was as surprised as you probably are reading this.* Wanda Sykes, Christina Applegate, Cade Mansfield Cooksey - quick comedy reliefs, little screen time but a great value to the whole movie. If Bad Moms 2 will make you laugh at all, then it would probably happen thanks to them.I've seen some good modern christmas comedies, such as Elf and The Bad Santa, but this is not one of them. A Bad Moms Christmas is just never funny.The first hour is watchable but unremarkable, the remaining 45 minutes are just too cliche-y and frankly boring to care.Also, I was surprised to find that Bad Moms 2 is rated R in the U.S. cinemas - for crude sexual content and language throughout, and some drug use. Because compared to possibly every other modern raunchy comedy I have seen, it sure feels meek and mild. They even manage to make the promising end-credits dance number as unsexy as possible.So... Avoid it, till it reaches Netflix or something, or when you desperately need some comedy you haven't seen yet.By the way, Jon Lucas and Scott Moore, the writing-directing team behind the franchise, are already planning the spin-off Bad Dads.Probably gonna be as hollow and sackless as, say, Horrible Bosses. I am surprised if they will not try to bring in Jason Sudeikis or Jason Bateman, the charming crownprinces of sackless modern comedy movies."}, {"id": 217, "text": "2 out of 5 stars (has some good moments, but is overall bad)Watching A Bad Mom's Christmas is like reuniting with old college friends after a few years apart and realizing that you were better off moving on from them. The original Bad Moms was a solid mixture of wild raunch and unexpectedly effective sentiment that made me appreciate all the pain my mom must have gone through raising me. The sequel ups the heart of its predecessor but makes the fatal mistake of turning down the party elements (despite those elements comprising much of the film's marketing materials), leaving the feel of a Hallmark Channel movie if it was written by a college freshman. While some of A Bad Mom's Christmas is quite funny, those funny bits are drowned out by forced mama drama and undercooked holiday messages. This movie should make me want to go out and party, not contemplate the stability of my relationship with my parents.The film again follows our 3 heroines, Amy (Mila Kunis), Kiki (Kristen Bell), and Carla (Kathryn Hahn) during the Christmas season, the Super bowl for moms. Each is at the top of their respective worlds, with Amy enjoying a good relationship with her boyfriend (Jay Hernandez), Kiki finally getting her husband to contribute around the house, and Carla having a successful Brazilian wax emporium. With lives this good, it's only a matter of time before those lives shatter into supposed hilarity.And that happens when their three cartoonishly exaggerated moms appear out of the blue: Amy's judgmental matriarch Ruth (Christine Baranski), Kiki's uncomfortably clingy mom Sandy (Cheryl Hines), and Carla's absentee party mom Isis (Susan Sarandon getting the most laughs). The three ladies attempt to have the best Christmas possible despite their moms' presence, something that proves much harder than anticipated.I did not have high hopes for this movie. A majority of comedy sequels attempt to rehash the formula of their predecessor, which I honestly wouldn't have minded here. The film's ambitions far outreach its grasp, wanting to combine raunchy jokes and emotional drama despite having advertised a turn-your-brain-off party film. Much of the comedy on display is predictable sex humor, a routine which gets old quickly. While the original was certainly raunchy, it also had a decent amount of witty writing and effective shock value to balance it out. Ironically, these raunchy sequences are much more preferable than those in which the film attempts to make us cry. This is A Bad Mom's Christmas, not Marley &amp; Me. Give me crazy booze and madcap antics, not fully-grown adults breaking down over issues that should have been resolved years ago.A Bad Mom's Christmas has good intentions and a few solid laughs, but can't get the perfect balance of hilarity and heart amassed by its predecessor. Its attempt to expand on the characters drowns out the fun vibe that made the first one stand out, replacing it with forced emotion that perplexed me to no end. While it's certainly not the worst sequel I've ever seen, this is one Christmas you're better off skipping.Rated R for Crude Sexual Content And Language Throughout, And Some Drug UsePS: There is a sequel-beg with their mothers at the end: I can only imagine the awkwardness that might be Bad Grandmas."}, {"id": 218, "text": "A Bad Moms ChristmasMotherhood is the only career in which your co-workers can piddle on you and not be fired.That must be why the moms in this comedy have so much pent up anger.Unconventional moms Amy (Mila Kunis), Kiki (Kristen Bell) and Carla (Kathryn Hahn) have the holiday's cut out for them when their mothers (Christine Baranski, Cheryl Hines, Susan Sarandon) show up for Christmas.Now Amy and her band of bad moms must put the opinionated grandparents in their place and regain their matriarchal dominance over Christmas.The superfluous follow-up to the dismal original, this seasonal sequel is every bit as wretched as its predecessor, and then some. With a script penned by males, the all-female cast stumbles on the juvenile dialogue and lewd situations they're one-dimensional characters are thrust into. Furthermore, any mother who doesn't buy their child exactly what they want for Christmas is a textbook bad mom. Red Lightvidiotreviews.blogspot.ca"}, {"id": 219, "text": "So hardly a year after the surprisingly good first installment, the Bad Moms are at it again. The first time was fun because it was refreshing,. Moms have been shown as the epitome of hard work, but here we had 3 moms who were just tired of all the stuff they were expected to do. But in this case the newness of the concept just isn't there. Now we have a 3 generations thing because the mothers of all the three are visiting town. So our moms have the dual task of pleasing their families and doing it right by the Christmas, and at the same time also getting the approval of their moms. People not getting along with their parents is a very common thing and that makes it very cliched.1. The story line is absolutely predictable. Plus the directors choose to show the movie in flashback, which kills even the remote chance that there might have been some interest built up.2. The 3 lead characters of Amy (Mila Kunis), Kiki (Kristen Bell) and Carla (Kathryn Hahn) are just as fantastic as they were before. In a lot of scenes they are literally the ones driving the movie.3. Direction seems to be directionless. There are a few scenes of slo-mo where the girls are dancing around a Santa, or playing in Skyzone. But they don't add anything to the story. The girls keep going back and forth on their resolve about wanting to have it their way or go according to their moms. The movie was supposed to be about the problems of juggling with the demands of the families and aspirations of the moms, but the entire plot gets very blurry.Overall not a great movie to watch even during the holidays."}, {"id": 220, "text": "After watching the first Bad Moms movie and thinking how utterly terrible it was, I don't know what possessed me to watch this one. Probably the 2 days into a chest infection boredom and a Netflix subscription, plus its nearly Christmas.Anyways, with a cast including Christine Barinski and Susan Sarandon I was expecting this festive sequel to be much better than the first one. Oh dear. I must lower my expectations of comedies.Full of frankly sexist, racist and vulgar 'jokes' that are not remotely funny, and pushing back gender equality and perpetuating stereotypes from 70 years ago, honestly the best part of the film is the set design. The script is mediocre at best, it would have been far better to let Kristen Bell and Katherine Hahn improv the whole thing, they are both talented actresses, I can only assume they have signed contracts obliging them to stick with these ghastly movies.Meh, at least the lack of laughs didn't induce a coughing fit."}, {"id": 221, "text": "A Bad Moms Christmas is a Comedy movie and the sequel of Bad Moms in which we watch our three under-appreciated mothers trying their best for their families during Christmas time. Everything becomes more difficult when their own mothers drop in unexpectedly and now they have even more work to do in order for everyone to be happy and enjoy Christmas since it's the most important family holiday of the year.Since I had already watched the first movie I was expecting something better than that. Unfortunately, I was disappointed by this movie because of the poor plot and I couldn't find a reason why they made a sequel to this movie. The direction which was made by Jon Lucas and Scott Moore as in the first movie was very poor and worse than the first one with many plot holes which they tried to cover in the last ten minutes of the movie and of course it didn't work at all. For one more time, the interpretation of Mila Kunis who played as Amy was very good but not enough to save this movie. Other interpretations that I liked and have to be mentioned were Kristen Bell's who played as Kiki and she was simply hilarious, Cheryl Hines who played as Sandy the mother of Kiki and Susan Sarandon's who played as Isis.Finally, I have to say that A Bad Moms Christmas is a poor movie with some good interpretations made by its cast that aren't enough. I admit that I had higher expectations for this movie since I had watched also the first but the result was a bit disappointing in my opinion. There are better Christmas comedy movies to watch and there is no need to waste your time watching this movie."}, {"id": 222, "text": "While A Bad Moms Christmas is not quite as funny as its predecessor, it was still fun enough to be entertaining.It should be said that it was actually the grandmothers that stole the attention all throughout the entire movie. It was was quite interesting especially because the characters were so hillarious and outrageous. And it helped that they had gotten some very talented actresses to perform these roles Christine Baranski, Susan Sarandon and Cheryl Hines were perfect for the characters.Mila Kunis, Kristen Bell and Kathryn Hahn sort of had to take a step back as they were definitely outclassed and outmatched by Baranski, Sarandon and Hines.There are lots of wonderful moments throughout the course of this movie and you will definitely be laughing. I must admit that I was genuinely entertained by this sequel.A Bad Moms Christmas is an adequate sequel for what it turned out to be, but it just lacked that special something from the first movie to make it truly outstanding."}, {"id": 223, "text": "The three Bad Moms are facing a stressful Christmas. Amy (Mila Kunis) stops trying to be perfect and then her passive-aggressively perfect mom (Christine Baranski) and submissive dad (Peter Gallagher) surprise her with a visit. Kiki (Kristen Bell) has her way-too-close mom (Cheryl Hines). Carla (Kathryn Hahn) has her wildly outrageous absent mom (Susan Sarandon). Carla is lonely and until male stripper Ty Swindel (Justin Hartley) comes looking for a wax.The first movie was a surprise success and I liked it. I like the chemistry between the three ladies and it's fun whenever they're together. This sequel takes the rule of sequel to heart. They double up by adding the moms of the moms. In so doing, the comedy gets thinner. The three ladies don't have as much time together. The movie is forced to concentrate on each individual mother daughter relationship. There is still good comedy but less of it here. The trio is still good. The grandmothers are fine. It's just too many characters and each one gets less time. All of it adds up to a lesser continuation and a promising franchise failing."}, {"id": 224, "text": "People that are reviewing this with a low score because it wasn't suitable for their youngsters need to learn how the ratings system works. This is a Rated R movie. Yes, it has a Christmas theme but it is most definitely NOT a family-friendly Christmas movie. Put the kids to bed before you watch this one, folks. Having said that, this film doesn't pretend to be anything that it's not. It's an over-the-top bat-ess crazy caricature of the life of imperfect mommies who do their best to make things work in the most imperfect ways. If you enjoyed the first film, you'll really enjoy this one. Kirsten Bell, Mila Kunis, and the amazing Kathryn Hahn (my guilty pleasure) nailed it again. While the first film focused more on their kids, this one took the story to the Mommies themselves and their dysfunctional relationships with their own Moms played by Cheryl Hines (Bell's overly obsessive-compulsive psycho-mommy),Christine Baranksi (Kunis' über prim and proper ice cold mommy obsessed with grand illusions of perfection), and Susan Sarandon (Hahn's bar-hoppng gambling potty-mouthed rock chic mom).The pairing of these moms and THEIR moms makes for some great comedy interspersed with some heartfelt touching moments about the ever important relationship between a daughter and her mother....which get interrupted with more foul-mouthed comedy. Overall, it's a great fun romp....FOR THE ADULTS. As long as you don't come in with super high exceptions and just enjoy it for what it is, you'll have a great time with this one. Just put the kids to bed first."}, {"id": 225, "text": "It's not a movie to be taken seriously, it's that simple.When I saw Christine Baranski and Susan Sarandon in the cast I already had a sense of what to expect. The grandmas appear and steal the scene, they actually steal.The duo Sarandon and Hahn were impeccable, the best jokes came from them, together to this Baranski who was in his comfort zone playing a cold character also can get laughs (in addition to dazzled Mila Kunis).Like I said, it's not a movie to be taken seriously, just as it's not worth going to the movies to watch! They are predictable and repetitive jokes, but it can not be said that it is a bland movie.Watch at home, at a time when you really do not know what to do and it sure will be a fun time. The mistake of this movie, for those who watch, may be to create too much expectation, so do not do it, go with an open mind, because I guarantee it is not a low-level comedy like Adam Sandler's."}, {"id": 226, "text": "This is something that needs to be said when reviewing pretty much every comedy out there, but the comedy genre is subjective and many people don't really like when a movie is raunchy just to be funny. That being said, A Bad Moms Christmas is a sequel that improves on the original in my opinion. That doesn't seem to be a very popular thing to say about this movie, but I'm always honest about how I feel about a movie, never letting other critics decide how I should feel about a film. I truly believe that A Bad Moms Christmas is a much funnier, more heartfelt, and more genuine film than the original. Yes, the premise itself is as stale as they come and the conclusion of the movie is as predictable as ever, but if you enjoyed the raunchiness of the first movie, I just have to call it like I see it and say that I had a much better time with the sequel, and I thought the first was fine. Here's why you should check out this movie if this is your type of comedy.The first movie revolved around a group of women who rebelled against the school system, becoming cool moms for their kids and having a blast outside and even sometimes inside of school. Cursing and getting into hilarious antics is really what made the first movie work so well, so all I was hoping for was more of the same, but done with a little more care. Being a holiday film, this sequel deals with having each of their moms over for the holidays and once again having arguments, getting into silly antics, and yes, a lot of cursing ensues. Quite honestly, this movie delivers for fans of the first and actually had a final act that felt a little too familiar, but it was done well and didn't really feel all that contrived to me.There is a much more emotional turn than I was expecting here. Yes, it's a holiday film and it's going to give you life lessons about family and its importance, but I was genuinely touched by a few lines of dialogue, mainly because I enjoy watching these three women on-screen together. I know there's nothing too special about a movie like this, but there have been far worse comedies in recent memory. This year has been pretty poor in terms of delivering a solid yuck-fest, so I believe this ranks among the few good ones of 2017.Mila Kunis and Kristen Bell are great players throughout these two films, but Kathryn Hahn is once again the show-stealer here. Delivering hilarious one-liners and being the raunchiest of the group, she really does earn a lot of laughs from audiences. Once again, this is a very raunchy movie and sometimes jokes are overused a little too much, but that's why I recommend this movie to a very specific audience that enjoys the raunchier type of humor or those who aren't offended very easily. If you can forgive the mean nature of many of the jokes here, I think you'll have a good time at the movies.In the end, A Bad Moms Christmas does literally nothing new for the genre, but its raunchy nature, along with a great trio of lead actresses, really makes it a harmlessly enjoyable flick at the cinema. Joined by newcomers Susan Sarandon, Christine Baranski, and Cheryl Hines, A Bad Moms Christmas makes itself out to be the unlikely holiday treat that I don't think anyone was expecting. Yes, there are many arguments that can be made in terms of how this has a very lackluster premise, but in the end, this film exists to bank off the original film and try to get some laughs out of its audience, and I laughed the entire way through. If you just want to escape for a few laughs at the theatre, A Bad Moms Christmas may just be your ticket."}, {"id": 227, "text": "'A BAD MOMS Christmas': Three and a Half Stars (Out of Five) The sequel to the 2016 comedy hit 'BAD MOMS' is a Christmas family comedy flick. It reunites Mila Kunis, Kristen Bell and Kathryn Hahn, in their overworked mother roles. This time they have to deal with their own overwhelming mothers, who are visiting for the holidays, while also trying to put on the perfect family Christmas. It costars Susan Sarandon, Christine Baranski and Cheryl Hines, as the three older moms, while Jay Hernandez also reprises his role from the first movie. It was once again written and directed by Jon Lucas and Scott Moore, and it's gotten mostly negative reviews from critics (unlike the first film). It is another hit at the Box Office though. I enjoyed it slightly more than the original.Amy (Kunis), Kiki (Bell) and Carla (Hahn) are still overworked, and stressed out, especially because it's nearing Christmas time. They become even more overburdened when all of their mothers show up for the holidays; Ruth (Baranski), Sandy (Hines) and Isis (Sarandon). Each of their moms is overwhelming, in different ways, which causes excessive chaos once again for the three young mothers. More bonding, of course, also occurs as a result of their new problems.The film is a pretty routine Christmas comedy flick. The humor is definitely hit and miss (for me at least) as well, but it is more consistently funny than the original (in my opinion). I think largely due to the addition of the three older mother characters, and all of the three veteran actresses give good performances in their roles too (Baranski is especially domineering in her domineering mother role). I also think Bell, Kunis and Hahn are more settled into their roles this time around as well. So overall I'd say this sequel definitely surpasses the original, at least by a little."}], "reviews_amount": 228}