{"name": "The Clovehitch Killer", "titleId": "tt06269368", "reviews": [{"id": 0, "text": "This movie would have been a solid 8, but what was up with the ending?None of the victims' families got any closure and he's now regarded as a wonderful citizen for eternity?!Horrible ending, to an otherwise good film."}, {"id": 1, "text": "I'm really struggling with this film! I enjoyed the suspense, thought the acting was decent, but one thing has left me really bamboozled....What happened to the grocery woman who was attacked? Three people playing out the final scenes in her bedroom whilst she sat on on the floor. Did she turn a blind eye to the whole incident? Why didn't she call the police? Did they drag his dad out of the house and wave her goodbye whilst she went back to the shopping channel? How has nobody mentioned this? So confused. It's ruined what was a pretty good suspense film for me."}, {"id": 2, "text": "People should have to state their age group when posting comments here. I'm in the 50+ group and loved the slow burning tension of this movie. Most teenagers will post things like ''Boooooooring'' and I understand. No gunfights, no blood and gore, no supernatural mumbo jumbo, no superheroes. Just a glimpse inside the minds of ordinary people living extraordinary events.Really more of a psychological suspense than a killer-thriller.Excellent cast, some additional intensity would've been good here and there, but I respect the director's vision of this story.So many bad movies out there... this is not one of them."}, {"id": 3, "text": "I really enjoyed this movie.Something I haven't seen being discussed is the role of uncle Rudy.Could it be that he found out about his brother and suffered the consequences?"}, {"id": 4, "text": "I quite liked this film...the two young leads seem like good actors.good story.only real criticism is the ending.....could have been better"}, {"id": 5, "text": "We have all seen many 'is my neighbor a serial killer' films. This one brings the issue to the family forefront i.e. is my dad a serial killer. The cookie cutter, white bread, merit badge driven, church devoted father and son were way fun to watch. Does scout leader dad have a secret serial killer merit badge? The 'clue' fun starts very early on, its exact meaning unclear, and never lets up. Roles played to the 'T' by son Tyler/Charles Plummer a sweet innocent, church going scout, who meets perversion head. From there, things spiral in some beautiful non-predictable directions. Dad Don/ Dylan McDermott is a super savvy macho man, loving dad who might just a serial killer. Introduce the charming Madison Beaty playing Kassi who adds a needed level of mystery to the tale as she also spices up Tyler's life.I am not big on flashbacks but here they work incredibly well. Just when we think we've missed seeing things.... a flashback appears to fill in the gaps.One of the most interesting and satisfying end scenes I've seen in this type of film. Kudos to the screenplay writer.This film is totally entertaining sans blood, guts and gore. Yet, evil lurks at every turn. Must see fun flick."}, {"id": 6, "text": "This was a good movie with excellent acting. Dylan McDermott (unrecognizable in looks, voice and mannerisms) played the complicated role of Don beautifully."}, {"id": 7, "text": "Did she just say 'that's life ' and never report what happened? Major plot hole in an otherwise decent film."}, {"id": 8, "text": "I enjoyed this film, but I wouldn't recommend it for someone looking for an edge-of-your-seat thriller. I found the acting to be very good, especially Beaty and Plummer."}, {"id": 9, "text": "I am glad I'm not the only one who wondered what happened with the grocery lady clearly that was not thought out very well .... that whole missed scenario just lost it a few stars"}, {"id": 10, "text": "I have just finished watching this movie, and I must say that I would have loved it despite it not being an intense thriller or gore-filled horror. That's not what the makers were going for anyway. The movie is meant to be emotional, perhaps slightly brooding and dreamy, which makes for a different kind of attempt at telling a serial killer story. This will not suit everyone, and those viewers expecting something violent or frightening will be disappointed. I personally wasn't expecting anything at all and, because I immediately cared about the protagonists, enjoyed watching it almost from the outset. But why, oh why did they botch the ending like that???On the plus side, there are a few things to mention. First of all, the fact that the family in question is a Christian one makes all the more believable. Statistically, whenever serial killers do not come from a violent and traumatizing environment, they tend to grow up in loving homes where everything is just too perfect and (from their perspective) bland. They have desires and needs that those around them do not and could not understand. And they learn to keep their violent inner (and outer) life a secret from their loved ones. In time, this becomes an art and they lead a double life: a normal family life for the world to see, and a secret one that only they know about. In their innocence, their family members could never suspect anything. And neither does the son in this movie, and when he does become suspicious and begins to realize that his own dad might well be the clovehitch killer, it is something that he isn't prepared for, simply because neither his upbringing/environment nor his own identity (as a Christian, etc.) could ever enable him to digest such a realization. This brings me to the second positive, namely the performances. The dazed, almost spaced-out expression one sees on the son's face is entirely intentional, because that's the look one would expect to see when faced with an innocent Christian teenage boy. Definitely well-acted. And the chemistry between the two young leads is, in my view, quite palpable, which adds to the intended emotional experience and makes you care about the characters. Once the son finds all that evidence and his father blames someone else (won't spoil this bit), most of us will say: I would not have bought my father's story if he had told me such a thing. None of us, however, are as innocent-minded as the main protagonist, and seeing things from his perspective, it makes perfect sense that he was both gullible enough and so very eager to believe his dad, as such abhorrent behavior wasn't something he was willing to connect to his own family, and if so, not to his immediate one, including his father.As I have already written more than I originally planned, I'll be as precise and concise as I can about why I dislike the ending. Supposing that I were ready to accept the fact that the son was immensely selfish, only cared about his own kin and decided that closure for the victims' families did not matter at all. This would still not resolve the plot holes and illogicality. The first issue is that the girl, Kassi, would have dialed 911 BEFORE joining Tyler (the son), who already held his father in check and at gunpoint. In the event that she had chosen not to do so for some obscure reason, she would not have allowed Tyler to stop her once his dad was knocked out. After all, her own mother was among the victims and she would never have gone against her own character (in both meanings of the word) and accepted a lack of punishment and closure! Secondly, if I put myself in Tyler's shoes, how is the shame of having a serial killer dad behind bars or sentenced to death worse than killing him yourself and having your mother, sister etc. suffer as a result? Not to mention the fact that instead of being seen for what he really was, the father would be remembered as a good, kind and loving husband, parent, neighbor and member of the community. However, the thing that bothers me most about the ending is the intended final victim: I know that the movie states she had not seen the perpetrator's face, but seriously, she would have reported the events to the police! Or are we to believe that Tyler and Kassi left her tied up there so that she would have no idea who the people in her house were? Tyler even calls his father dad in front of her, so she would really have to be in the dark about all of them, wouldn't she. Last but not least, did Tyler's dad also strike himself in the head twice before shooting himself? I mean, he was bleeding from a wound to the head caused by those two blows. How could the police miss that? And don't even get me started on the forensics issue!In short, the movie could have been great for what it set out to be, but the ending is completely preposterous. This is no longer a matter of suspending your disbelief, but one of suspending any thinking and analysis."}, {"id": 11, "text": "I enjoyed this thriller movie. Pretty good acting and kept me interested until the end. What more can you ask for!"}, {"id": 12, "text": "What's sad is that there must be hundreds of such psychos living in America under the guise of normalcy. It turned out to be a brilliant movie, I was skeptical since I don't particularly prefer serial killer films as they often choose to glorify the nurcase as some unique specimen. The pacing doesn't look forced and acting is spot on, especially the young actors. The cinematography is phenomenal and one will have no trouble suspending disbelief."}, {"id": 13, "text": "At times extremely effective, deeply disturbing &amp; uncomfortable to watch, The Clovehitch Killer is a relatively satisfying &amp; well made film that's worth a watch - but it's also a classic example of a movie that doesn't know when to end - dragging out the resolution until you're willing the credits to start rolling; every scene feels like it's setting up the conclusion until it's followed by yet another &amp; you're left impatiently waiting for the crescendo, which is tedious, frustrating &amp; disappointing. However, the performances sell the entire film &amp; there's palpable tension between characters in emotionally charged scenes so the conflict is incredibly well done &amp; regardless of its faults, it's still a good film - despite being unnecessarily long &amp; drawn out."}, {"id": 14, "text": "This was a good movie, but not an easy watch. To avoid any spoiler I am just going to point out the fact that this movie puts you deeply in questioning, in a kind of disturbing way. And that's good. It's not your typical serial killer story here, really it's more like  how would you sort out this high level of sickness... because even as a watcher, well you witnessed it and have to live with it !. This is slow paced, just enough to build this uneasy tension. Thumbs up to the camera work, we get some real artistic framing and lightning here. And also, most importantly, let applause the fantastic acting of the father and son characters. You'll find yourself diving in this with them after just a few minutes. A solid 8 for me. Warning : You may need a drink after this."}, {"id": 15, "text": "Many positive reviews &amp; ratings convinced me that I have to see this. Here's my thoughts: First of all, I wouldn't call this a horror exactly, it does not justify the genre for it doesn't use enough genre-defining elements - there's no gore or scares (I don't mean only jump-scares, duh) &amp; the level of creepiness and suspense in the atmosphere falls short to be called horror. My point is, I was a little disappointed, because, reasonably so, I was expecting a horror movie. The story here brought up memories of the recent Summer of '84 which was similar regarding the plot, but was served in a drastically different style. The story is the most effective weapon that The Clovehitch killer possesses, 2nd most effective being the performances - Dylan really nailed the role of the most dad-ish dad who's secretly a perverted serial killer. As the story progresses, it... does not progress fast enough. There's a thin line between burning slow and dragging, this film went both over and under that line. The on-point cinematography very well accompanied the main story &amp; committed to the creepy small-town-full-of-weirdoes atmosphere. The visual style &amp; vibe really reminded me of the The Strangers - grounded and realistic, yet scary at the same time. The 2nd part of the movie picks up a bit, shows more of the weird stuff you've been expecting for the last 50 minutes, ultimately making it worth for you to hang around. If you like them eerie slow-burns, pick it up and have a blast, but if you are not familiar with them, be careful - you might be disappointed. My rating: 6/10."}, {"id": 16, "text": "I did watch this all the way through, so it merits at least a 4, possibly 5 rating. The concept was intriguing, but the execution was clumsy in that the main character, young Tyler, did not behave in a way that I felt was credible. For instance, he took unnecessary risks snooping around when he might be discovered instead of waiting until there was no possibility of being found out - who would do that? Also, for someone clever enough to figure out who the Clovehitch Killer was, he made some incredibly dumb decisions, but I'll refrain from saying more to avoid any spoilers. There were just too many instances of no people don't behave that way, for me to really recommend this film.On a final note - those of you rating films like this a 10 - think about what that means. A 10 suggests this could be a candidate for an Academy Award. IMDB needs to provide some rating guidance - the only award this movie deserves is a Razzie."}, {"id": 17, "text": "The movie was as good till the end. I honestly don't believe that that girl would not call the police lol ice and let him be tried, humiliated, and properly punsihed. Tjere is no way the lady at the end being tortured ddidnt report or make a serious stink. Forensic science is is too good to not show that angle and distance would not be practical for suicide or gun cleaning accident."}, {"id": 18, "text": "SPOILERS AHEAD!I gave this a go after being recommended it by a friend and after watching 'Extremely Wicked...' and 'My Friend Dahmer' the night before, it seemed fitting to round off the weekend with one more serial killer film.The premise of the monster in plain sight is hardly a new one but what The Clovehitch Killer gets right is the sheer normality of the monster in question here. Don is a normal, loving, God-fearing, Scout leader Dad who hides a despicable side to his psyche; one that manifests itself through his propensity for murder but one that has always remained hidden to the world. In this respect, the film gets it right; here is a man to be trusted by all who know him but who is anything but trustworthy.What it gets slightly wrong is that when Don finally reveals his true, horrendous colours (long suspected by his son) via his actions, the evil of his character isn't quite realised. Even in the very act of murder, the monster that the film promised isn't fully delivered. This guy is pure evil, sure, but I didn't celebrate his downfall the way I should have. Ultimately, I didn't care enough about him getting caught and I wasn't suitably moved by his son's act of redemption to feel like the film had done its job.The Clovehitch Killer is well scripted and written, thoughtfully portrayed and realistically acted. All the required pieces seem to be there to make a fine film but somehow, it falls short. This is a good movie and it's worth a watch but something is missing. Something needs to tie the film together and it isn't there. Maybe a clovehitch knot would do the trick."}, {"id": 19, "text": "I thought this film was well done. It is a slow-burn thriller with excellent acting, especially that of an almost unrecognizable Dylan McDermott.There are a few understated creepy scenes that will stick in your memory."}, {"id": 20, "text": "Very predictable but it doesn't pretend like it is not so I give it credit for that. Acting was good but not amazing. ending kind of threw me for a loop.overall 6.1"}, {"id": 21, "text": "As serial killer movies go, story line aside, this isn't played out as a disturbing, dark, edge-of-your-seat thriller.More serial killer 'lite' - though it's not trying to be anything else. Having said that, it is tense enough to keep you gripped and it works very well.Very good acting and ending.If you're expecting deep and disturbing, you might be a little disappointed. Think mildly tense and entertaining and you'll have a great time."}, {"id": 22, "text": "Alfred Hitchcock once said I bring murder back in the living room, where it belongs. Yes, I'm 56 and I've have seen many may thrillers and horror movies in my life. Believe me when I say The Clovehitch Killer does justice to the great thrillers Hitchcock made long ago. This is not a cheap slasher but a slow burner, where we as the public, know something the killer doesn't know. This provides the movie a very tense and claustrophobic feeling from the very beginning on. This production is based on a well thought through script that works like a cat and mouse game. Some scenes have this wonderful dark violin music, very elegiac, lamenting over dark and unknown stories. Please see it, everything is just perfect in this clever made movie, its very worth while."}, {"id": 23, "text": "Dylan McDermott provides a phenomenal performance but that is the best part of the movie. The story moves slowly though the storyline feels original. The ending is unsatisfying too. Different editing could have made a more concise film and possibly heightened the only somewhat tense moments. The upside was the fact that, unfortunately, this may be a fairly accurate portrayal of the life of a killer."}, {"id": 24, "text": "This was a great movie that portrayed what a serial killer would be like living a life of normalcy. It reminded me a lot of the BTK killer (who lived not too far from me) in that the Clovehitch killer was a family man who ran the scout club and was loved by the entire community, seemingly making this an incredibly weird and creepy film for me. The kids were great at playing their parts, especially the boy and had me feeling all sorts of emotions with him. The whole film was tense and left me on the edge of my seat. The ending was great as well, and I loved the part when they showed the scenes again leading up to his son showing up to his dad's last kill, except showing it from the kids' view. It was a bit on the slow side and not entirely action packed as one would hope, but it was one that seemed to get into your head a bit. Overall it was a great one to watch."}, {"id": 25, "text": "This film is pretty straight forward. All the evidence is laid out for the viewer. Now my main issue with this film are the two teens. The believability of their actions is just downright ridiculous, more so for the girl. I could see the son being tricked by his father but when the girl goes along with him it's just pretty ridiculous not believable. You'll see what I mean during the climax.And the ending. Oh God the ending made me lose any connection or sympathy for the characters. It's selfish and disgusting. Yes they deal with the problem but to leave a huge crime like that unsolved, continue to portray the father as a pillar of the community, and leave literally a dozen families with zero closure? What were the filmmakers thinking here? Also, those actions go completely against what the girl in movie was all about. She completely abandons everything she's done in the film with contradictory actions. I found the film completely frustrating and lacking any sense of realism."}, {"id": 26, "text": "This might sound weird, but this was a refreshing take on the serial killer genre. The momentum throughout was calm, sometimes a little slow but always engaging. I kept scratching my head trying to work out how this film was going to pan out and I was pleasantly surprised, a slight twist at the end gave it an air of credibility and brought the story to a satisfying finale. Very good film with excellent acting, thoroughly enjoyable."}, {"id": 27, "text": "Half decent film, terrible ending. Massively based on the BTK strangler. Check out a documentary on the real thing, it's far creepier"}, {"id": 28, "text": "I really like the story dynamic of this movie. Some plot are predictable, but overall great acting part of the actors make the difference. If you are into suburban mystery movies then this is definitely a must watch."}, {"id": 29, "text": "I've been a fan of Charlie Plummer since I saw him in King Jack and hw doesnt disappoint here either, another good performance.I feel like this movie could have been so much more, it started well and seemed interesting but then kinda fizzled out a little. Some of the acting (not Plummer) was a bit suspect, and the build in tension was mediocre at best for a so called thriller.Nonetheless a different take on a serial killer story that is worthy of a watch if you have nothing better on your watch list. I can see now why there wasn't a whole lot of hype for this movie.6/10"}, {"id": 30, "text": "This movie has much going for it. Everything feels very calculated. Every shot and every move had much thought put into it and it shows. The cinematography is simply great, the characters and their performers and very entertaining and both the concept and it's execution are fascinating."}, {"id": 31, "text": "If you're familiar with the BTK/Dennis Rader case then you will undoubtedly have noticed the obvious parallels: Devout churchgoer, doting father and husband, boy scout leader with an unusual expertise in knot tying, depraved serial killer. I found this to be an overall suspenseful movie, that is, at least for the first 50 minutes. The rest seemed a bit unnecessarily drawn out and I found myself fast forwarding several scenes. Dylan McDermott is as brilliant as ever and his co-stars, even the younger and less experienced ones, are surprisingly able to keep up. There's one sub plot that bothered me a bit in that it wasn't ever fully addressed or resolved: I wondered whether the wheelchair-bound, brain damaged uncle possibly found out about his brother's extracurricular activities and threatened to expose him? Did Don then decide to kill his brother just as he had no qualms to attempt killing his son in the final scenes of the movie? Personally I would have also liked to see a flashback. How did this start for Don? Why did he choose this particular MO? Why did he start killing again after such a long time although he's harming himself more than anything by it? (This is of course insinuated but never confirmed.)"}, {"id": 32, "text": "Not a Mystery or Horror as this movie has been billed on IMDB. It is really at most a predictable thriller with shallow outcome, nevertheless good to talk through out with my girlfriend as story does not need much concentration!"}, {"id": 33, "text": "The Plot was good and also very suspenseful. The Thriller was very decent i enjoyed it all the way through wanting to know more &amp; more"}, {"id": 34, "text": "I don't normally write reviews for 'okay' films, and this wasn't a bad movie. Not great, not terrible. I'm writing this review because I'm getting worn out by the new Hollywood trend where every villain needs a huge sign over his head that says This bad guy is a Christian! See! Christians are evil! It's to the point, where if any character identifies himself/herself as a Christian at the start of a movie, it is guaranteed that character will be evil. It used to be Muslims were always the bad guys, now it's Christians are always the bad guys. Enough with the religious propaganda. We get it. You don't like Muslims and Christians. Now can you get back to telling an entertaining story? Or is that not important any more?"}, {"id": 35, "text": "The first half of the movie was great and I would definitely recommend to watch it. However towards the end when the dad tortures the woman it start getting questionable, silly and extremely disappointing. They show past events after the main one for no good reason, the way the teens hide from the father is sometimes pretty dump and the worst part is the ending. How would exposing your father hurt your family more then killing him and saying it was an accident. Also they had no reason to be religious.........It's just there"}, {"id": 36, "text": "I'm surprised to see the relatively low rating (6.5 at the moment I write this review). In my opinion this is an interesting and strong movie, especially taken into account the slightly worn-out theme of discovering that someone in your near (family) circle is in reality a serial killer (it reminded me for instance very much of Stephen Kings short novel A good marriage that was made into a movie in 2014). The theme is handled here with much skill and intelligence, due to an inventive narrative approach, that helps to keep the suspense up, in spite of the fact that we early in the movie already learn who the killer is. The acting of all the major characters is top notch, especially Dylan McDermott and Charlie Plummer are very convincing: McDermott as the self-righteous and condescending father who intimidates but also in a sleek way beguiles his son, and Plummer as the naive, gullible son who has to cope with the conflicting loyalties to either the church and his father, or to the truth and justice.I do not agree with some of the reviewers who felt that in this movie religion was (yet again) made into the source of hypocrisy and mental disorders (up until psychopathic and murderous behavior). The acts of this father were in my opinion purely based on his individual character and had nothing to do with religion (or with opposition against it). The religious believes of the son and the mother were dealt with in a very respectful way and it was poignant to see how the young son in the last scene of the movie has apparently found a way to keep up being true to his faith and his fathers public and personal legacy, whatever we may think of the decisions that he has made.I also don't agree with the many reviewers who criticize the ending of the movie, i.e. the definitive way in which Tyler and Kassi choose to deal with the father, as if this was a too unrealistic or too easy solution by the director. I guess every other solution, for instance (probably the most correct one) handing him over to the police or letting him walk, would have seemed just as easy or unrealistic. The one that was used here at least gave us much to think about afterwards, which is not at all a bad thing in a movie."}, {"id": 37, "text": "This film is utterly atrocious. Bad writing, bad characters, bad pacing. I couldn't tell what era this film was set in, because of the oddly religious almost 1950s characters, the flip phones that characters have, and so much more. This film didn't have to be Zodiac, but there is no effort whatsoever to craft anything interesting or worthwhile here. These are some of the worst characters I've ever seen on screen. The main characters of this film makes bad decision after bad decision. I was hoping he would die by the end of the film. There are so many positive reviews for this film and I am dumbfounded. I would almost recommend watching this film purely because it's so bad it's funny. This might be The Room of serial killer films."}, {"id": 38, "text": "SUCKS! He let his father control and manipulate him the whole movie long, he couldn't think for himself at all. This film speaks of society and why there is division. Don't like the consequences of your choices, do whatever you can to get out of them."}, {"id": 39, "text": "It had an OK premise with an equal execution but it stretched itself for too long in order to fill the run time. If it was 15 minutes shorter I think it would have looked even better.The Clovehitch Killer has some gaps, we still have unanswered questions even the making of the movie gets you to wonder why did it presented itself so obvious from the very start, but I guess it was the intention all along in order to complete the circle. Again, I must add that it is very predictable, yet not dull nor slow, it moves accordingly to its genre and it goes out limping sadly.Room for more? You bet yeah! Guess if you consider its budget we can say its a fair end result. Still I feel a little let down in all honesty.Cheers!"}, {"id": 40, "text": "This is a very different kind of thriller. The pace is slow. Slow doesn't mean boring. It's thorough in showing everything necessary to the plot.A boy suspects his father of being a serial killer who has killed some women in their neighbourhood. Together with a girl who is interested in the crimes they investigate. Things unfold in a plausible and logical manner. Not like a cheap thriller. The father son dynamic is quite well handled. The going back in time in the last third is effective.Dylan McDermott looks quite different from his usual self. He acts well as does Charlie Plummer who plays the boy."}, {"id": 41, "text": "If you are looking for a crazy twist or a puzzle to be solved, look else where as there's none to be found. This is straight up psychological thriller that lay everything bare right in front of you. It's up to you to accept it or not, and that's exactly what this movie intended to show you: the obvious decisions that only made hard because we don't want to face the truth. But there are definitely some bizarre choices in the script that ended up leaving some blemish in this otherwise solid little gem. Especially the combination lock that is too easy to be cracked and a unnecessary map that was too conveniently placed with entrance marked. These details seem to be at odds with the crafty and cunning nature of the killer. If you are willing to overlook the flaws, you will thoroughly enjoy this quietly disturbing case study of serial killer's mind, that's probably more realistic than you would expect."}, {"id": 42, "text": "The acting is good &amp; the storyline is intriguing! The ending was great &amp; unexpected. Overall, solid, psychological thriller"}, {"id": 43, "text": "This is a truly weird movie.. It reminds me of that Randy Quaid movie Parents. The strange hold over the son, the bizarre sequences, the understated sickness of this dad, all make make for repugnant compulsiveness."}, {"id": 44, "text": "You really have to pay attention to this movie. Yeah it's a slow burn kind of movie, but I really enjoyed it. I've seen many dislikes on this movie, maybe it's just for mature minds."}, {"id": 45, "text": "Dont trust the ratings and dont trust the reviews . bad boring stupid movie . acting is very poor . no suspense what so ever . dull charcters"}, {"id": 46, "text": "I was expecting a lot more after reading some reviews. It's boring, the killer is laughable and not creepy at all. Summer of 84 does this a lot better."}, {"id": 47, "text": "Legit moves at a snails pace. Lots of corny and cliche scenes. Acting was ok. Lots of eye rolling.Zzzz"}, {"id": 48, "text": "We really enjoyed it. Kinda scary. It's thrilling, you'll like it."}, {"id": 49, "text": "I could write about the first hour or so, which was ok. But, a plot hole the size of Saturn left me shouting  at the tv screen.AVOID."}, {"id": 50, "text": "Don Burnside (Dylan McDermott) is a scout leader in Clarksville, Kentucky. This was the home of the Clovehitch Killer, known for his scout perfect clove hitch knot. 10 women were killed by him and then 10 years ago the killings suddenly stopped. Uncle Rudy (Mark A. Nash) had a car wreck 10 years ago and has been confined to a wheelchair. Don's son Tyler (Charlie Plummer) finds incriminating evidence and asks Kassi (Madisen Beaty) an outcast who is obsessed with the murders, for help.The film is slow moving but engaging. It builds slowly with the two suspects. There is a rewind near the end. I wasn't sure that they needed to do that."}, {"id": 51, "text": "Warning: Spoilers Ahead: I read nothing about 'The Clovehitch Killer' before watching it. No trailers, no synopsis, no cast members, no nothing. All I knew was the title of the film, so naturally I assumed there was going to be a killer (likely a serial) somewhere in the mix. Then the opening shot of the film was a man leading a Boy Scout class and I thought to myself that man has killer written all over him, but surely the opening shot isn't going to be of the killer? That's way too obvious. What it was though was the beginning of one of the best performances I have ever seen in a regulation thriller. Dylan McDermott made this movie everything that it is.His performance was gripping from the start and it never let you loose. We the audience don't know the answer to the mystery for most of the movie. We are as in the dark as the characters and so we get to make our own conclusions and assumptions. McDermott's performance gives a lot more clues than people will realise on first viewing. Just the little things like when he is trying to tell his son that his uncle is the killer, he is looking up and to the left (a telltale sign that someone is lying). The movie is riddled with little details and hints like this and that is what makes this such a great film.I also loved the non-linear story telling method. It added another layer to the film in the final thirty minutes that was just the icing on the cake for an already great film. The film takes a very sudden turn at around the 3/4 mark and I haven't been as stunned watching a movie in a long time as I was in that moment. I was literally staring at the screen with my mouth agape. It hit me and it hit me hard. A truly brilliant scene. I can't say enough good things about 'The Clovehitch Killer'. If you haven't already, please see it."}, {"id": 52, "text": "Got potential but after talking in the woods scene and what follows this movie starting to crumbling"}, {"id": 53, "text": "Going into this I wasn't expecting much, but ended up enjoying the experience. IMDB has this labelled as a horror, which couldn't be further from the truth, as it is more of a thriller/drama with fairly good acting throughout.Tyler is a typical American small town boy who's world is turned upside down by a fateful discovery showing that not everything is always as it seems.Standout performances from Dylan McDermott, and if this performance is any indication, an up and comer, Charlie Plummer."}, {"id": 54, "text": "What a great movie- yes, it's a slow burn, but well worth it. I have a feeling the low rating is from people that wanted an action thriller, where this is filled with suspense. I am so glad I did not let the bad reviews dissuade me from watching- I love finding hidden gems."}, {"id": 55, "text": "This movie was incredibly well done for what it was, especially knowing it was the dad (Dylan McDermot) from the beginning. Everyone is asking what about the grocery store woman? when the red headed girl, Kassi, I believe says near the end that she was passed out and never saw the dads face. That's it, that's what happened to her. Clovehitch knocked her out and tried to suffocate her with a bag until Kassi removed the bag, making it completely plausible the woman was entirely knocked out while Tyler and Kassi were there and Clovehitch did conceal his face until she was already out. I found this movie to be entirely captivating and well done from start to finish, my only qualm with it is that they didn't turn him in and instead faked his suicide. While it may have helped the Burnside family to not be forever scorned because of the father, only Kassi ever got some sort of slight justification for her family and her loss. What about the families of the other 12 women? Don't the deserve to know who took their loved one and that he was finally gone?"}, {"id": 56, "text": "Not groundbreaking, not gonna take home any Oscars - but a solid, well made, thriller. Acting was very good, story was good, and delivery was better than most. Really enjoyed it."}, {"id": 57, "text": "This was a pretty good thriller. It's a bit cliché at times. But I liked the atmosphere. I mean... this is what it could be really like. Serial killers don't act like serial killers. So, when you're watching a movie about someone close to a serial killer, you will see the every day life of an american teenager. So, some might say: I miss suspense. But there's some psychological suspense.Of course the movie isn't perfect. The ending leaves some questions. And most characters are a bit flat. But the acting is good, the story is good, the music is good, the suspense is good.I've enjoyed this one a lot. Sorry about my english. I'm from the Netherlands."}, {"id": 58, "text": "In 10 mins you know it is 1 of 2. The remaining 60-70 mins goes out in ruling out one of them. So it is no big a mystery or thriller. And dramatically also weak, as neither of the 2 suspects intrigue you much.The final 20 mins (if you get there) helps the movie recover to a mediocre 6. Which is sad. As the actors are all honest and do a good job."}, {"id": 59, "text": "An interesting storyline that makes a change from the usual 'serial killer' kind of horror that is so common.All the characters are brilliantly portrayed by the cast and really make the film believable - yes it could happen in your community!"}, {"id": 60, "text": "Heavily inspired by BTK (bind torture kill) real life murderer.Spoilers. The film interestingly seen through victims not considered, the family of the said serial killer as well as the child of a unconfirmed victim.I don't agree with the plot hole aspect as the woman would have no way of identifying or knowing who attacked her. With respects to the failure to provide closure for the other victims. Quite simply he gave her closure at the expense of losing his own father. I think it's possible they would have agreed to protect his mom and sister, despite the sad fact it would deny justice to many others.If only he had taken the id's... if you enjoyed this film. Watch drama series mindhunter on Netflix if you haven't. It will blow your mind. It contains some out of context background scenes that may appear very familiar to this film."}, {"id": 61, "text": "I didn't think this story line held much promise but the acting and sensitive handling made it a worthwhile movie to watch. The mundane normality of a killer in the community was credible.Spend a good night in and watch this."}, {"id": 62, "text": "Enjoyed it. Deserves a higher score I think but as a true crime fan I enjoyed it.."}, {"id": 63, "text": "I would say that there is not much suspense in this when it comes to the guessing game. The acting is rock solid overall though and it is an interesting slow burn drama. Which is a better description and a better way of what to expect in this, rather than an edge of your seat thriller as some might think or even have been led to believe.The twist at the end may be a bit too much for some, if you even can call it that. Some dialog makes it at least bearable and understandable to a degree, even if you don't agree like me. Because a solution is best when many have a piece of mind ... that helps them overcome things they experienced."}, {"id": 64, "text": "I love twisted and dark films and this is one of them.Although I cannot rate it any higher than a 6, simply because it just doesn't make too much sense.There are many times in this film were a simply phone call to the police would have saved everyone the trouble, yet that would spoil all the fun of course!The acting is surprisingly good, especially from someone I'm unfamiliar with, Charlie Blummer, but the star of the show here is really Dylan McDermott.Worth a watch if you're a fan of the genre, but other than that I'd give it a miss."}, {"id": 65, "text": "The most unpleasant situation one could imagine. The movie held my attention but it was an uncomfortable hour and three quarters. Production and cast warrant a good score, the subject matter left me a cold. Dark."}, {"id": 66, "text": "Not cool movie and boring too much the acting is the worst. This movie was really bad! Awkward how the movie is kinda late 80s90s style but they have iPhones in the movie? i hate this movie because i waste time on it for nothing, dont trust the reviews who telling you this movie is good no way it is the worst"}, {"id": 67, "text": "A mystery with no mystery, a thriller with no thrills, a suspense film with no suspense. Just boredom and religious buffoonery and a teen who makes the stupidest decisions you could imagine. And a ridiculous, WTF ending that makes you wish this whole useless, pathetic town full of dumbasses would be obliterated by a meteor or something."}, {"id": 68, "text": "If you went out hard drinking on Saturday night and you wake up Sunday morning hungover and depressed about having to go work on Monday, then you should just be lazy all day on your couch and give this movie a watch. It's entertaining and it's not that bad."}, {"id": 69, "text": "A family secret that is so incredibly horrifying. This is not your typical serial killer movie. The story unfolds at a great pace and always has a surprise around the corner. Just sit back and enjoy something different and special."}, {"id": 70, "text": "You often read reviews and wonder what they were watching, this was good from the offset and built up well and not at all drawn out. I agree with the references to BTK as there were similarities. The acting and casting were bang on. Well worth a watch if you like murder and suspense."}, {"id": 71, "text": "I enjoyed the entire movie. It slowly unveils everything piece by piece in a suspenseful way. Even the ending was not disappointing.My only critique is that there really isn't a twist or reveal. You know what's going to happen the whole time, but it does a good job of presenting the story."}, {"id": 72, "text": "Interesting enough for me to not look at my phone but the main character was annoying"}, {"id": 73, "text": "Excellent acting, interesting untill the end. I enjoyed watching this movie."}, {"id": 74, "text": "Simple and dramatic thriller, I think everyone should give it a whirl...the pacing,acting and character moments are superb...it was a fun watch :)"}, {"id": 75, "text": "Movies about a serial killer, it's nothing new. It's all been done alot before, some real gems and alot of stinkers. The Clovehitch Killer isn't a gem but it's much better than the average serial killer movie. Even if it's pretty clear who the serial killer is you still get that suspense of him being caught or not. Maybe it would have been a better move to keep the identity of the killer a bit longer secret, but still there are plenty moments where the tension is palpable. A better ending, in my opinion, would have scored this movie also a bit more. The acting is right on the money, as the whole cast did a good job giving this movie the necessary thrills and suspense. Dylan McDermott, Charlie Plummer and Madisen Beaty were perfect as their characters. If you like movies about serial killers this one won't disappoint you. Just keep an open mind knowing it's not going to be a Silence Of The Lambs or Seven, but still worth watching."}, {"id": 76, "text": "If you're a true crime fan with patience and a taste for good storytelling, you're going to love this film. It's clear to me this is based on BTK as well as some other well-known serial killers, however, this isn't some lazy retelling of those crimes. This is fresh, new, imaginative, and creepy. So many subtle things were used to make this as close-to-home and freaky as it could possibly be. Artistic and wonderful! Definitely give this movie a shot! It did not disappoint."}, {"id": 77, "text": "I dont write reviews, but felt I had to make it public on how good I thought this movie was. Dylan McDerott shows that he actually is an actor, so much so that you wonder if that's really who he is in real life. The story is fantastic, full of well thought out editing that answers your questions right when you ask them. If you like thrillers you'll love this movie."}, {"id": 78, "text": "I loved this movie! The acting was truly great and the storyline was original. Loved everything about it."}, {"id": 79, "text": "This movie deserves a higher rating. We went to see this movie without knowing what it was about and were pleasantly surprised by the acting and the time that was taken to let the story unfold.This is not a standard over the top blockbuster thriller movie, but a very well thought out story. The christian lifestyle of the community and the family adds a lot to the story. They don't care about fashion and technology. Instead they are more about community service.The children have been brought up that way, and the father has a big influence on the children. That is why the son does not want to believe his dad could be a serial killer, but he consists in being curious and persistent in his search for the truth. You could feel the suspense between the father and son whenever they were together. Just try to imagine that you found out that your dad is a serial killer. What would you have done? Pick up a gun and shoot him in the face?Also the part where the movie switches focus on the dad when he is by himself, getting dressed up like one of his victims but eventually gets frustrated because it does not satisfy him. Clearly he is struggling with his urges.By the end when the dad breaks into this woman's house is very real and scary. This is how easy someone could break into somebody's house and manipulate that person into believing anything he say's.There are parts in the movie where there is no music, which adds to the realism. In real life there is no music when someone is torturing somebody. There are only the sounds of struggle which I found very unsettlingPeople who give this movie a low rating for being slow or not suspenseful enough have been spoiled with cheap scare badly written blockbuster thrillersI'd give this movie a score of 9+"}, {"id": 80, "text": "The idea for the plot is a good one: teen boy in a small town wonders if father is involved in murders from years ago. Boy meets interesting girl and they bond over the mystery. Good acting. However, without giving spoilers, there were pieces at the end that I couldn't make sense of and it put a big damper in this movie for me."}, {"id": 81, "text": "It was fun to watch at saturday evening, but still has some bug holes in plot. I mean why did he stop killing for 10 years, and now when his son find out and suspect about him he is planning to murder another woman? What would he tell to his son when he get back, or he was planning to kill him to? I know he is sick and he was even trying to kill his own son, but why then he stops for such a long period, maybe he did something to his brother when he finds out and was sorry for doing that, but anyway doesnt make much sense to me"}, {"id": 82, "text": "Acting was great. Unspectacular cinematography, which added to the sense of twisted normality. Everything was going swimmingly. If you thought the movie, The Call, with Halle Berry, was 90% excellent but spoiled by the ending, this will mirror that experience and some. It was an untidy end too. You'll be saying,But surely! What about...?A shame. This could have been a defining moment for the genre."}, {"id": 83, "text": "I found this film to be a little gem , story line and acting was very good ,loved the way it switched back to show how the story unfolded ,well worth a watch."}, {"id": 84, "text": "Immediately took it's deserved spot at my all time 10 movies... but i can't understand why it's rating is rather soo low, i think it's one of the most underestimated movies ever!"}, {"id": 85, "text": "You suspect the dad is the killer the entire show. It's the end you don't expect. I does make you think, What would you do?"}, {"id": 86, "text": "What a great movie with a killer twist. Was not expecting that to happen. I liked this movie so much I went home and watched it again with my wife. I'm all about finding a movie with a good plot that's not so Hollywood. This hit the nail on the head. If your flipping through movies like I often do debating on watching or not then I vote Yes on watching this one."}, {"id": 87, "text": "This was a very very good film, now if you are in for the blood and gore of a horror film then turn away as this really is not it....this film is the story about a Serial Killer who has since given up on it for a while but all is about to come to the fore once again and at the hands of a amateur Sleuth and his very own son. discoveries are made and the was it him was it not him gets switched on and off as does the hunt. It's very clever in this and the story is both feasible and well written with some great acting and although its an hour and 50 minutes long it is in no way too long nor too short. The story has the odd twist and kept me entertained throughout. a fab film and not too complicated."}, {"id": 88, "text": "Acting is solid and the lead up to the ending was pretty decent.SPOILER ALERT:However, on what planet do people walk in on a possible killer with an unloaded weapon or at least without back-up. I understand not wanting to disclose who the killer actually was for the sake of the family and the whole stupid community thing. But ultimately it did not make any sense. I don't recommend this at all it's just going to make you angry at how poorly the ending was written and directed as opposed to the build up to it. Disappointing to be honest."}, {"id": 89, "text": "Its explained by his girlfriend the women didn't see their faces and the police didn't link it to the clovehitch killer cause she didn't get killed"}, {"id": 90, "text": "This film is one great big blatant reference to the BTK killer (Dennis Rader) and is pretty good. It's only really let down by the ending, which stretches belief beyond breaking point in order to come up with a reasonably happy outcome. Other than that I'd highly recommend it, even if you know about the BTK crimes."}, {"id": 91, "text": "I'm finding the confusion about the grocery store lady confusing. They made it clear that she never saw his face, and was unconscious throughout the struggle. Therefore all she knew is that she was assaulted, then woke up in an empty house. Kassi said they'd never connect it to Clovehitch. I did find the ending a bit of a let down though. All a bit slow. No real climax. A frustrating end to an otherwise good film!"}, {"id": 92, "text": "This was a decent movie with what I thought was some really good tension. The ending is quite strange and somewhat unbelievable. The main characters are written well but the side characters are stereotypical good Christian kids. When in reality most are the same as secular kids. I don't think the writers ever knew any kids like that. McDermott was really good in this role, no tour de force or anything but good."}, {"id": 93, "text": "Why go through the trouble of driving the dad/killer out to the woods and dragging his body deeper into the woods to kill him for a staged suicide when you could've just called the cops in the first place or drove the killer to the cops??? There is no legit reason to protect his memory and reputation which is what I guess the son was trying to do by just killing him off. Also are we supposed to believe a couple of minor really got away with all that without being seen or questioned or anything??? There plans were laughably silly, I was letting it go until the cover up part at the end, but that finally just broke me.Also what about the lady from the grocery store? I thought she was dead but according to what the girl says at the end she's not. The girl say she didn't see the killers face so she can't ID him, but that doesn't stop her from coming forward with all the sh*t she heard and did see, she wasn't deaf!!! Plus if they were trying to cover up the situation how did they let the woman go or get her to help without her seeing them in the first place?This ending was just really sloppy and messed up a movie that I was actually really enjoying. I just don't buy that innocent teenagers decided to be cold blooded murders when they had other options. Plus they don't explain what happened to the victim at the end well at all. Everything besides the disappointing ending was actually really good. Could've been a 7 or 8/10."}, {"id": 94, "text": "Dylan played the role convincingly almost didn't recognise him he was that good. It's a slow burn but still managed to keep me on the edge of my seat. Not your typical serial killer story. I enjoyed it right upto the ending. Imagine listening to your mum and sister talk highly of the dad over the next 10 years, wouldn't that be hard considering same said dad tried to strangle son and not to mention all those he killed. It Would drive me crazy to the point I would just reveal all in order to shut them up. No closure for the victims family. Made no sense he would want To protect the man who tried to kill him. As for the girl can't believe she agreed to it."}, {"id": 95, "text": "Several ask: What happened to the grocery woman who was attacked? I think she's dead. When a nylon bag is pulled over someone's head, it usually drowns. Or, she faints at least (if taken off in time)."}, {"id": 96, "text": "Very engaging movie and very well done until the ending which does not make any sense and is in no way believable. There is no logic to the ending."}, {"id": 97, "text": "The movie is very boring, it seems that the directors today dont distinguish slowburn from overdragging.The end is completely unbelievalble.Plus goes for the actors.Good story, poor execution."}, {"id": 98, "text": "Very good movie with an excellent script and great acting....tense and enjoyable....shame about how carelessly the the grocery store woman part at the end was handled as it's central to the outcome....would have given it a 9 otherwise."}, {"id": 99, "text": "A very recent watch and one that I will revisit. A serial killer film with very little violence, but one that asks a number of interesting questions before dropping an unexpected, almost touching ending.Also contains, at least for me, a suprisingly good perfomance from Dylan McDermott."}, {"id": 100, "text": "The person who wrote the Closure For Whom? review said exactly what I was thinking. I was all prepared to give this an 8 until the ending... then knocked it down to a 7. Not that you must always get whatever ending you would prefer, but I was just so unhappy with it and also it was especially unfair to a particular character in it and that character didn't seem to care... Just being vague where I don't have to mark as spoilers.Either way, I consider a 7 a great movie and I thought the acting was great, the story was great, etc..."}, {"id": 101, "text": "Let me first just quickly recap the events of the film...for the first 40-50 minutes nothing happens, 2 minutes of something interesting, followed by another 40 minutes of total boredom.. And at the end... well, nothing really happens at the end either.Film's plot relevant to the storyline consisted of 10 or maybe 15 minutes tops. All the rest of the film was excessively overstretched and to the story entirely irrelevant content.By far, the worst movie I've seen in years."}, {"id": 102, "text": "Seriously, WHO are all of these people reviewing this? Friends of the director?This is an inept film, on so many levels. The usual - stupid people doing stupid things.UGH."}, {"id": 103, "text": "More like a psychological thriller / drama than a horror movie. Interesting, suspenseful, and much better than the majority of recent horror movies."}, {"id": 104, "text": "The viewers should not make the mistake of expecting your average serial killer movie or even focus on slow building suspense. And those are my favorite kinds of movies! Hannibal the series did a great job of watching a carefully placed mask start to reveal itself. Often these thrillers place focus on a nemesis and a detective elected to find him or her and face off. This story is told from the perspective of a child who loves their father. And was raised by someone who wore a mask. And feels conflicted. And that's what sets this movie apart. You see him struggle with curiosity that soon gets the best of him. I think people were too hyped up for a gun battle or an explosive takedown. This is not that because the protagonist is a Christian high school boy scout. Not a jitsu trained CIA profiler, FBI agent, or PI."}, {"id": 105, "text": "Interesting concept but it didn't Deliver unfortunately. One time watch! 4/10"}, {"id": 106, "text": "A super boring movie and obviously overrated.No suspense no drama no mystery nothing psychological (mostly slow burners have that) ,you will know who the killer is after 10 minutes into the movie,its just a lame writing and there's nothing . very weak story writing,acting is okay (just ok) though or would have given 1 star."}, {"id": 107, "text": "Not a bad movie, and although it is about a serial killer, you will not see any blood, real action or shooting. The son is manipulated by his father and this one tries to pretend to be the good house father for his family. Suspense building could be done much better."}, {"id": 108, "text": "I must say the concept of this movie is very cool and if executed properly it could be placed among the great serial killer movies but unfortunately it was not. the boy character's acting is very weird and out of place, exp a normal human being wouldn't act like that in such situations, in general the writing is bad especially for the dad character which every time he opened his mouth i would cringe. All in all skip this movie it doesn't worth your time."}, {"id": 109, "text": "This movie's characters we're so underwhelming. The people who have the power and you're supposed to be rooting for the entire, painfully long, way through the movie make senseless, unbelievable decisions every step of the way, to the point where you're screaming at the tv. After the big ending, but with 12 minutes left in the movie, I wanted to turn off my tv and watch anything else, but I stayed in hopes that the characters would somehow redeem their senseless actions, NOPE. I believe this was written by a 14 year old whose first introduction to horror and suspense was an awful 80s B movie. The movie felt like it both took three hours to get through while also feeling like nothing was happening at all. Boring, a waste of time, and not at all worth the time of thriller lovers."}, {"id": 110, "text": "7/10 This started so well, the modus operandi of a serial killer is depicted very well, its a pity they had to introduce Buffy the vampire killer into the plot."}, {"id": 111, "text": "Successful thriller. creator's unique story gift &amp; director's good enough camera skill is not bad."}, {"id": 112, "text": "This movie has been done before a hundred times. Many times better.It's slower than molasses and not a good slow burn.There are no twists. You ALWAYS know who the killer is and where the movie is going.His victims are horrible actors .It's simply not worth sitting for nearly two hours. Torture."}, {"id": 113, "text": "Idea was done better,or at least more entertaining before, way too long.way boring.One use movie for a nothing to do evening"}, {"id": 114, "text": "I honestly don't know the actual story of the BTK Killer aka Clovehitch, but this movie is bleep. I really liked the movie until about 30 minutes left. The son is an idiot. I don't care if your family is a religious group of Jesus freaks (I'm not knocking any religion, I'm a Christian) but this dude is just plain dumb. Instead of turning his dad, who he KNOWS is the killer, into the police, he takes him out into the middle of the woods, shoots him, and then HONORS him at the end of the movie!!!!!! What. The. Bleep. Stupidest ending to a movie I've seen in a while. Very disappointed. P. S. I had to say bleep because they wouldn't let you say cuss words."}, {"id": 115, "text": "Its so disengaging that you loose interest. I wouldn't waste time on this. There are many loose ends. Direction in my opinion is worst and it's misleading."}, {"id": 116, "text": "The acting was so subdued that nothing was believable. The script and story were poorly thought out.The murder scene was so underwhelming that it was beyond disappointing.Everything about this movie was just underwhelming and toned down as boarder on pointless.Don't watch if your a seasoned murder mystery fan.5 out of 10 because, like everything about this movie, it was tragically average."}, {"id": 117, "text": "In this town no cop has an idea to find this mysterious killer except of two teenagers, which even have the ability to fake a suicide. Well they must be very intelligent and clever... I liked the movie but it's quite linear, obvious from the beginning, but still has the ability to put you in an interesting new situation. The relations between the person were somehow flat, but the story is original and they created a good movie so far."}, {"id": 118, "text": "Better than most of same type I've watched but giving only 4 because of the over-rated cut and paste same language high marks reviews here."}, {"id": 119, "text": "If you are able to get past the dreadful characters, it's just OK. The performances themselves are not bad at all, but the characters they portray are so utterly unlikeable it's truly difficult to root for anyone here. The decisions that the main character makes are baffling at times and make you wonder how a person that can figure out all these clues could be so prone to such knuckle dragging choices. The writing in this film is very spotty at times. It feels like at certain points the writers rushed or just plain forgot aspects of the story they're trying to tell. Once the ending rolls around, you don't really feel anything but a sense of disbelief (Not in a good way). So many things go by the wayside that really should be answered or hinted at one way or another. The Clovehitch Killer is a slow burn thriller that fails to capitalize on its interesting premise and acting chops of its cast. There's some good scenes and tense moments, but there's far better choices for your Friday night if you're looking for something in this genre."}, {"id": 120, "text": "It was enjoyable seeing as low burner serial killer flick after a long time , plenty of good acting and good pacing , with a satisfying conclusion made this a good watch , the pace was decent for its budget I liked the movie"}, {"id": 121, "text": "This would be a great flick for Mystery Science Theater 3000 to lampoon. Encyclopedia Brown resolution. 80s-TV-movie-quality story-telling and production values. Slow, plodding pace. Somehow the serial killer character comes off as mundane, and not menacing, despite being a serial killer."}, {"id": 122, "text": "Good but lacking details and character development , otherwise pretty good movie"}, {"id": 123, "text": "This movie was actualy not the kind of movie i was looking for. I was looking for a nice horror, creepy , gory movie. If that is what you are looking for, look further. However the story and the acting made me stay. Ofcourse there were some cliches but it didn't ruïn the movie for me. I can imagine that alot of people see this as a boring and slow movie considering there is no violence whatsoever, but if you just like a movie with a decent story and suspence you might like this one."}, {"id": 124, "text": "I like it! The thrill of the film did not appear until the end. The actors are not known maybe only the father but their representation is excellent. I gave him a rating of 5 out of 10 but I loved the movie despite the coolness in the drama."}, {"id": 125, "text": "I did not find this film slow at all. The pace was good. There were some edge of your seat tense moments in this film. It is not a horror but a very good thriller. Acting was excellent. Over all i would recommend this film if you enjoy this genre"}, {"id": 126, "text": "The fact that this movie was make to feel really warmth because of family sense that make it sends chills down your spine. behind it warmth hide somethig really dark and the movie tell it really good.beside the plot, the set and the way their telling stories are really good. their constantly make you doubt about what happened and bring it back to the fact. and it was fun to followed."}, {"id": 127, "text": "This is a fantastic, fictional take on a real story. The film is filled with similarities to a true-crime-legend. The story is told from the point of view of a young boy who wants to believe in his faith, as well as his strong family bond; yet he is confronted with the harsh realities of evil. Starting off as a slow burn, leaving me to consider it to be mainly a drama, containing horror elements. 8 stars for excellent acting, solid execution, factual references, and lingering after-effects."}, {"id": 128, "text": "I was surprised by the acting of this movie the actors playing the father and the son both gave great performances and the story was a different take on the serial killer horror genre.Although it looks like the killer was entirely based on Dennis Rader the real BTK killer and the ending could have been a lot better.Also I don't think that the girls character was needed."}, {"id": 129, "text": "I thought this would be another movie of this kind, so as not to spoil. But it took the basic premise and went into a more intriguing film. I thoroughly enjoyed the emotional aspects, and how much a parent has influence over their children."}, {"id": 130, "text": "*mild spoilers* First of, this is in no way a horror movie, and thats coming from someone, who's avoids horror movies like the plague. Barely even any blood at that.As much as I'd love to give this movie a 8-9 out of 10 it lacked certain key elements that would make this an actual thrilling movie. My main issue is the main villain, the serial killer, as well acted in moments, severely lacking to give that ''something's not right'' vibe.There is a great twist in the movie that I found fantastic and resulting in this grade, but the serial killer left me disappointed in the end. That said, the kid, and the choice he makes at the end, is great, and leave a lot up for thought.All in all, it's a fine movie, but not something I'd hate to miss."}, {"id": 131, "text": "You just know someone like that is going to end up doing terrible things."}, {"id": 132, "text": "Very well thought out movie but the ending was horrendous. Just so many times my head hurt because it's so stupid"}, {"id": 133, "text": "This movie was really good until the ending. What happened to the grocery story woman? She clearly heard the the father and son talking and him referring to him as dad. They briefly mention that she never saw the fathers face and won't connect it to the serial killer but wouldn't she still tell the police everything she heard? Really bad ending. Not sure how the editors missed this!!"}, {"id": 134, "text": "I'm not mad....im just disappointed. (An innocent dad)"}, {"id": 135, "text": "I walked in to this expecting it to be a bit tacky, and not all that great. Dylan McDermott is always great, but the plot sounds like something that is very easy to mess up. But, it was actually pretty awesome. I spend too much time watching crime &amp; serial killer shows and movies, and I've seen my fair share of really weak plots with lame twists, this wasn't that. The suspense built throughout the film, there wasn't a crazy, nonsensical plot twist. It was just solid throughout. The plot had consistency, the story was emotional and interesting &amp; the whole main cast was great."}, {"id": 136, "text": "One you must see. Great casting! And very well written story. Very tense at moments and goood acting of the young boy and girl. Nice plot and interesting story ."}, {"id": 137, "text": "Must watch for crime thriller movie goers. Good acting by the son. This movie was a surprise! Interesting and unique"}, {"id": 138, "text": "This was obviously inspired by American serial killer Dennis Rader and Canadian Russell Williams. As a Kentuckian, I was put off by yet another movie filmed here whose theme involved religion and/or hillbillies. As an avowed atheist, I found the constant barrage of religion irritating and unnecessary. I watched this on Hulu, so your experience possibly didn't include a blue border around the picture, which was off putting."}, {"id": 139, "text": "Not your typical horror film with smart dialog and creepy atmosphere and tone."}, {"id": 140, "text": "Really enjoyed this film, very well made and worth a watch"}, {"id": 141, "text": "The movie kept me watching. Even though I knew his father killed those woman, it was still suspenseful.Ending, not so much. No closure for the victims and a serial killer is honored and leaves the world with everyone's belief that he was a great man.Huge plot hole (unless I missed it) - what happened with the last victim? Last I saw she was still alive. Did she not report any of this to the police?"}, {"id": 142, "text": "Of course Christians are depicted as being as ignorant and creepy as possible. I've never seen a Hollywood film in my life where Christians were not depicted in a negative way. Besides that, the choices the characters make are not logical. He should have gone to the police so many times in the film."}, {"id": 143, "text": "I've always been a Dylan McDermott fan but in Cloverhitch he does his best work, maybe ever. McDermott mixes his suave, everyman persona with a subtle darkness that feels so real it becomes a slow-burn creepfest.The writing, directing and acting uniformly lean toward less is more. And less is more as the end result successfully blends thriller, mystery and family drama into one. I loved this movie for all of these not-so-easily blended elements.For those who ask what happened to the final victim and how did she not reveal her assailant? Well, to you critics I say you weren't paying attention. While there are some minor leaps in logic required to make the final narrative work, in the end the story is tight enough not to fall apart under its own weight of pathology and consequences.The performances of all were consistently strong but the standouts were the sweet-creepy and odd boy scout dad, McDermott and the mysterious girl-next-door loner turned girlfriend, Madisen Beaty. But again, the entire cast was solid if not excellent. Honorable mention goes to Samantha Mathis, who in a minor role as Mr. Burnside's (McDermott) wife, allowed us to see spousal codependent behavior at its worst with almost no exposition.Overall this was a great ride in the slow-burn thriller genre. I want to give it a 10 out of 10 but nines and tens are reserved for special films like The Departed. Still, I hope this IFC original reaches a large audience. It's so good it certainly deserves to."}, {"id": 144, "text": "I wasn't disappointed. As a fact I was pretty much in to it. No gore but you will do a lot of putting the pieces together. I did enjoy the talents of the three main characters. Give it a go you won't be disappointed"}, {"id": 145, "text": "Definitely a show burn, but intensity never stops building. The last 30 minutes, omg. I looooooove Dylan M., but he is so scary in this film (not knowing the real outcome), insane. I loved it! But I don't want the image of him in a dress ever again!!! Awesome!"}, {"id": 146, "text": "I cannot believe this movie gets a 6,5 at the time of this writing. Although the father almost carried the movie in a somewhat Breaking Bad style, the remaining characters (and lack of) prove to be a disappointment. The boy was like a statie from start to finish, even at times where he could have really shine. The storyline is predictable at many times, including the ending. Mid-movie it looks like the editor quit and the intern took over, hoping to pull of an original reverse storyline... but failed doing so. Also, there are times when you must wonder how they really managed to track down the father and in addition, manage to get his body out. So many holes and questions, you could think of this movie as a potentially nice knot, but a poor job of tying it up as such."}, {"id": 147, "text": "Nice movie, why is called clovehitch wtf? They give no explanation but for the rest nice move, 1 star"}, {"id": 148, "text": "Love this movie!!! It's like the new version of the BTK killer."}, {"id": 149, "text": "Great story and tension until the last 15 minutes or so. Then the dumbest ending I've seen in a while. The kid had every chance to do the right thing. The woman attacked doesn't report anything? No closure for any of the families? A dumb suicide/accident that even the slightest investigation would prove wrong? All for a kid to selfishly save face for his family. Awful ending."}, {"id": 150, "text": "The film had tension and a very creepy family ( perfectly godly and homely in that good old USA way ) most of the world shudders type !! No slashers or violent nutters . Just a lad who couldn't make the truth add up but new !! My only spoiler to what was a mostly enjoyable film is a question , why did the saved lady not say something? !!"}, {"id": 151, "text": "This film is definitely worth the watch - don't think that just because you've seen the trailer that you've 'seen it all'. This story was so cleverly written and keeps you wondering what new clue will be unturned or covered up. The flashback segments that explain the crazy twists in the plot will have you going I can't believe... I would say that similar films to this that come to mind are Summer of 84' or Disturbia."}, {"id": 152, "text": "Very interesting film from the start until the last 5 or so minutes as they seem to me totally off. The leading roles were great, but the ending is just not it and that is kinda disappointing. Anyway, maybe that is just my preference. All in all, interesting and keeps you interested all the way. 8 from me."}, {"id": 153, "text": "For those of you who dont know, this film is essentially a SLIGHTLY fictionalized re-telling of real-life serial killer Dennis Rader's (aka BTK) life. A devoted father, respected community member, and Boy Scout Leader, Dennis Rader evaded capture for decades, raising a family while murdering on the side. The names of the characters in this film are all changed (The director said he wanted to avoid giving any attention to Rader, as he feeds off of it) but all the events are basically the same to their real life counter-parts. Dylan McDermott turns in a chilling performance, and is almost unrecognizable with a gut and glasses. There are some truly disturbing moments strewn throughout the film, but some of the pacing is mired with scenes that drag more than they should. I would still recommend this film to any fans of serial-killer character studies - just dont expect it to blow your mind."}, {"id": 154, "text": "Excellent movie! You need to start the movie by expecting a Psychological Thriller, not a Slasher flick. By doing that, you will be able to really appreciate the film. To describe the movie, I'd say it is an original idea in the aspect of showing the point of view from the son's eyes. But also has aspects of Disturbia, Rear Window, Bone Collector, Secrets In Their Eyes, and Criminal Minds tv show. It might be a little slow-paced, but that helps you develop sympathy for each character (which I appreciate). Each character has true depth and the actors are phenomenal. The only thing that makes me knock off a star is the ending. Don't get me wrong, the ending is satisfying in regards to the outcome of the perpetrator, but I think it would have been better if they staged the death with a confession note (that way the case could be closed and the victims' families can have proper closure). That's the only thing that was off, but besides that, it was a great film! Would totally watch again. Oh... and I see a lot of people writing that they are confused about the grocery woman's outcome. They actually DID mention her later towards the end that she survived and wouldn't be able to identify the perpetrator. Someone must have discovered her after they dragged the perpetrator out of the house to stage the death. Hope that helps!"}, {"id": 155, "text": "The Clovehitch Killer is an interesting and more grounded take on a serial killer genre. All the important characters get enough screen and storytime, the decisions they make are justified and they don't come easy. As other reviewers have already mentioned - this film is not really suspenseful but rather believable if you know your serial killer stuff. They really took their time to build the killer based on real serial killer stories and their motivations, and I enjoyed that. It's all there, you just have to look. I also loved the setting of the film and the look of it, the soundtrack though was forgettable, I wish it was a little more distinguishable and memorable.It's a little slow, but I'd still recommend this film. It's not strictly a thriller, but still an interesting experience."}, {"id": 156, "text": "Even though we knew who the serial killer was from very early on in the film (or at least had suspicion) I was still engaged and kept questioning what was to happen next. I enjoyed this film and do not regret watching it, it would have been cool to see the more sadistic side of the dad, I think if he was to strike again causing uproar in the community the suspense would have been through the roof. After reading the reviews I do agree with what some people have said such as feeling annoyed at how it ended, a serial killer being praised as a hero does not go down well in my books. Not does the fact at leaving an open door with half the audience questioning what happened to the victim he nearly killed at the end of the film, it's almost as if she disappeared off the face of the earth?Regardless of all that I enjoyed the film and would recommend to others"}, {"id": 157, "text": "So story was good and the suspense build up great.. but the ending was dumb."}, {"id": 158, "text": "Really great film. Towards the beginning I was getting mega Stephen King A Good Marriage vibes but it took a better turn than that. The ending = straight trash. They did a fabulous job making Dylan McDermott into the perfect antagonist. I HATED this man by the end of the film. And what I really wanted was for the entire town to know how horrible and manipulating this man was. And the fact that they just hide that he was a serial killer was crazy frustrating! He will forever be regarded as a good citizen like what the heck?!? No closure for anybody."}, {"id": 159, "text": "This movie has one of the best stories out of all the thriller movies I have watched, and the great acting was the icing on the cake. However, the movie has some unexplained points, which is very disappointing to see in such a good story. The cinematography was also not very good, the shots couldn't make the viewer focus on the thing the movie tried to make them focus on."}, {"id": 160, "text": "I really liked this one. Its geniune plot and the moral dilemma not only the protagonist but also the viewer is put on makes the movie an outstanding way to spend your free evening. I won't go through details about the plot because it may ruin it for people who want to watch it, but I shall write that anyone willing to watch it should be prepared for suprises. Morality and family are the central points the movie is trying to reach and and everyone can make his/her own conclusions. I believe that the final question that rises after watching this is what would YOU do in that case? What's higher priority in your world? Morality or family?"}, {"id": 161, "text": "This movie is underrated. I loved the slow pacing of it, the acting was really good (especially Dylan's) and the concept and the development were intersting. It's a slow movie, but i just wanted to keep going."}, {"id": 162, "text": "I don't want to give anything away, so I'll make this short. Well worth a watch. You never know what anyone is really like."}, {"id": 163, "text": "*CONTAINS LOOSE SPOILER*This film was not really marketed a huge amount, therefore I kind of stumbled upon it. I thought it was going to be a somewhat real low budget and although it probably didn't cost a lot to make, they've captured the picture really well.I'm very intrigued with crime stories and real life serial killers and events, with that in mind, it seems that this film has a lot of links to the real life events of that of Dennis 'BTK' Rader, who although he wasn't like a huge amount, he was the silent neighbourhood serial killer. Clearly this film tails off in a separate direction with his son on his back and with him discovering his father is a serial killer. I would say the film is well thought and the trail of events are tied together nicely. Definitely worth a watch!"}, {"id": 164, "text": "I liked this movie a lot. Moves at a languid pace. Allows you to get to know the characters. Starts like many movies with typical teenage angst The story unfolds revealing depths and layers that are unexpected. It's all done with a light touch. No blood, no car chases. The violence is muted and perhaps more macabre because of that. Both father and son are acted beautifully. It's a great cast. There is plenty of tension. The end a surprise. So not brilliant but a stolid offering."}, {"id": 165, "text": "Read this after seeing the movie: This movie starts off slow. Showing us the life of our main protagonist. His life is mundane with a very religious family but with a close connection to his parents. When one night he sneaks off and in the process discovers something that he shouldn't have. The unfortunate misunderstanding that nights gets him ridiculed and with no one close to turn to he turns to an outcast girl and slowly the story becomes more tense and disturbing.It's an interesting idea and handles its story very realistically. What if one of your closed ones had a secret you wish you didn't know about? Would you seek justice for the victims you know nothing about? Would you seek for an explanation or even believe the evidence someone is feeding you and trust them over the words of your close one?The story is about that confusion, the shattered reality of everything the protagonist knew about his close ones. We may not understand his viewpoint or his thoughts, which is precisely why the outcast girl is there for us. She isn't just in for the thrill or for bringing the killer in for justice. She's out there for revenge. It's a lot easier for us to step into her shoes. We want to see the killer being brought down. Her question at the end This is what you wanted right? we can see the doubt and regret on our protagonist's face.In the end, he could have done it differently and exposed the killer, but that would have harmed his family more than he wanted. So no, this isn't what he wanted, but it's what the best possible outcome for his family."}, {"id": 166, "text": "Nothing new.....same old weak movie that will be a waste of your time"}, {"id": 167, "text": "Without spoiling anything, all I can say is; You'll be happy you watched it"}, {"id": 168, "text": "In the end there are some mistakes, dna, fibres, what did that lady report to the police? They only said that she didn't see his face, but what about what happened to her? Wasn't that in the news around the same time Don had gone missing? Yes these things could be better and it feels like there are some parts missing in the end. So why still a 9? The pace of the movie is very good. The story and how the son listens to his father and does everything he says is gripping. I think it does work like that in some families. The end is just brilliant. No, there is no justice in the end. He indeed should have payed for what he has done and it is dissapointing he didn't and never will. But the way the two kids get rid of him is very clever and very understandable. Their lives as a family would've be hell if they had called the police and everyone would've known his father is the Clovehitch killer. So I get it and the end is very well thought out. Loved this movie."}, {"id": 169, "text": "Great movie. I see a lot of people here asking about the grocery lady. There is a scene at the end of the movie where Tyler and Kassie are sitting outside of one of the victim's houses and talking and he asks so what should we do now and Kassie says Nothing. Police won't connect it to Clovehitch. She never saw his face. This is in direct reference to the grocery woman who was attacked. She had a blindfold on and never saw his face. They probably just left her like that.I didn't mind the ending at all. I can kind of understand why they did what they did. The father and Tyler burned all the evidence and I am assuming Tyler thought this would just ruin his mom and sisters (and his) lives in such a small religious community. They did what they did for his familiys sakes. I don't know if I like the way they ended it... But I can at least see the screenwriter's thought point and I can appreciate it.Other than that, I found the slow burn of the movie very well done. It was tense and it really made me wonder what I would feel like in Tyler's position. It really drove the point home that a psycho could be anyone, even your Jesus loving, community and family man next door neighbor. In fact, it's much more likely to be him than someone who doesn't have their life together. It's a scary thought."}, {"id": 170, "text": "And yes that's a good thing. People giving bad reviews because they didn't see what happened to the grocery lady....it's not that complicated but you get to think of some scenarios for yourself, isn't that a good thing? Movies without solid closure always get bad reviews....why not appreciate the fact that you get to come up with some endings yourself?I really liked this movie, it's slow and unsettling and the whole all American Christian family where the dad is actually a psychopath is a fun new perspective...no complicated storylines but good acting and I loved how the scenes were colorful, like you are watching a family film. It gives everything an unsettling and very chilling vibe."}, {"id": 171, "text": "This movie just leaves you gutted. Hard to watch in the 3rd part"}, {"id": 172, "text": "Excellent movie, great storyline and shows how close to home these weirdos can live. Thoroughly recommend this movie. There are some creepy scenes and Dylan McDermott plays the role of the serial killer superbly well. The only poor thing in the movie was knowing what happened to the last woman he attacked, did she live or die? If this is your type of movie watch it sure you will enjoy"}, {"id": 173, "text": "Full disclosure: i love dylan mcdermott in these creepy, hidden subversive roles. it started with the first season of american horror story, to a very lighthearted slant for the short-lived tv program la to vegas, and to this movie. he plays the straight shooter with a dark side character very well. arguably an easy role in the clovehitch killer, as its a wide gap between laughably christian and serial killer(or is it?). he plays it to the 9s, the few main characters work well alongside, and even the supporting ensemble are mostly believable. it skips some details, and runs a bit long at 109 minutes, so its not exactly taut(rope joke!!!). overall, i might stumble across this movie again, and not turn it off because ive seen it before. no regrets"}, {"id": 174, "text": "I normally don't take the time &amp; effort to write a review, but this movie had me sitting on the edge of my seat from start to finish. This is NOT Hollywood's typical &amp; cheap (tho hundreds of millions wasted on extravagance) formula for making a quick buck! There are no gory, sick blood &amp; guts, no disappointments, no let down at the end, no ridiculous script, no predictable stupid acts that a normal, reasonable person wouldn't do. I felt this movie in my heart. Why has Hollyweird overlooked this excellent film? Jealousy or, Why didn't I do a film like THAT?!"}, {"id": 175, "text": "If you have an interest in this genre compulsive viewing and also an insight into the mind of a serial killer. Not a monster a but monster with a human face."}, {"id": 176, "text": "Movies usually either ask us to fear or celebrate killers, but rarely see them as people who could be our friends and family members. the Clovehitch Killer is disquieting because it asks us to do exactly that - to visualize that the man across the pew from us at church, our scoutmaster and even our father could be a monster.Tyler Burnside (Charlie Plummer) lives with his devoutly Christian family in Kentucky, in a small town whose residents have been haunted for a decade by the murders of the Clovehitch Killer. Our protagonist claims that he never really thought all that much of those crimes, other than being part of the ceremonies to celebrate the victims. One night, while attempting to sneak out and kiss a girl in his father's truck, he discovers a torn up piece of bondage photography. This isn't a Playboy thrown into the woods. It's so upsetting that the girl cuts off their dalliance and starts rumors in school that the photo was his.This discovery leads him to explore the places that his father - all-around family man Don Burnside (an incredible Dylan McDermott) - has kept hidden. This isn't rooting around in your parent's room looking for their copy of The Joy of Sex or a copy of Behind the Green Door (I'm dating myself and also presupposing that your parents had great taste in adult film). What he finds are explicit bondage-heavy magazines that look like Richard Kern shot them. And worse, a Polaroid of a woman. Her name leads him to hunt through Google, a late night search that leads his mother (Samantha Mathis) to believe he's merely masturbating. If only things were that simple.Tyler's church and scout friends have kept him at arm's length since the rumors of him being into BDSM started. He finds a friend in Kassi (Madisen Beaty, who was in The Master and will show up in Tarantino's upcoming Once Upon a Time In Hollywood), who is absolutely obsessed with the Clovehitch murders - for a reason that pushes the film toward its harrowing conclusion. That said, if you're living in a boring small town, I absolutely endorse hanging out with redheads obsessed with murder. I married one, after all.On a camping trip, father confronts son about what he has found and claims that the real killer was Rudy, who up until now we've only known as a vegetative man in a wheelchair. The guilt of the murders caused him to try to kill himself by wrecking his car. Again - if it were only so simple.There's a narrative jump right after this scene that's completely jarring. In fact, it's so out there that we considered just turning the film off, as we've become used to the moments where modern thrillers inexplicably lose steam and go off the rails. This feels like that and I don't want to spoil it, other than to say you'll know it when you see it.I'm pleased to report that we stuck with it and this becomes a movie with no easy answers or resolution. That's pretty much how real life is, with no clean endings, just moving past things and hoping to survive until the next day.Obviously, this film is inspired by Dennis Rader, the BTK Killer, who also created collages of sexualized images, was a scout leader and seemed to be a normal family man. Writer Christopher Ford (Clown, Spider-Man: Homecoming) and director Duncan Skiles (who directed Ford's The Felt series, as well as the stand-up specials of Reggie Watts) have taken that real-life story and created something that feels just as real.This movie pretty much escaped notice when it was released last year, but I'd recommend it, particularly if you love true crime stories."}, {"id": 177, "text": "Definitely heart riveting. An absolute lazy Sunday scare."}, {"id": 178, "text": "I have read numerous books on serial killers, seen many films also. This film for me gave a good insight into what i would imagine would be a 'true to life' life of a killer. Can tell its based on loosely the BTK killer Denis Rader. Im not going to go too deeply into it but i enjoyed it, could have been a better ending but a very good film. I also enjoyed Mr.Brooks so if you enjoy this watch that also."}, {"id": 179, "text": "Enjoyable enough movie, well acted, decent plot. I'm not a prude but watching with my wife (even had it been 'solo') found the length that the action dwelled upon the assault etc on the woman from the supermarket - quite gratuitous and spoiled our experience. It was unnecessary"}, {"id": 180, "text": "The movie starts with a memorial event about victims who got killed by The Clovehitch Killer, a voice of narrator started to tell us about the story but then it disappeared for the rest of the movie.The events follow to discover the life of a family who lives peacefully, then the son discovers a clue that leads him to investigate the crimes of The Clovehitch Killer.The main suspense arises from knowing the killer in first hour of the movie, and then the suspense continues to know how our main characters will deal with the real killer.Everything in this movie is discreet, even the killer, you may get the feeling that he already did horrible crimes but you see none, this can be a good thing for people who hate bloody wild movies.The events are slow and can be boring in some parts, even in the most crucial situations, you will not be motionally involved, as the rhythm is really steady without real excitement.The characters are well written, background to everyone is enough, and most of their reactions were suitable to the theme of the movie.The plot is good, everything is explained in a good way. The music is not really felt and it didn't have special identity.Finally, it's an average drama thriller, very comparable to The Stepfather, but much less tense than it. You can feel bored easily if you are not excited enough to know the fate of the killer."}, {"id": 181, "text": "I wasn't sure what to expect with the mixed bag of reviews on here and the fact that it is currently streaming on Shudder, which isn't always the most reliable curator of good films.It was surprisingly good. The acting is top-notch. The teens were especially compelling and Durmot Mulroney showed wonderful depth.I think the problem with the reviews here is that this movie is being classified as a horror flick and it is definitely not that. It's not even really a thriller, although it has its taught moments. It's a psychological drama.The adolescent boys who are hoping for naked co-eds being slaughtered in a shower are going to be understandably angry and run here to tell us all how boooooring it is. I suppose if you're a child, it IS boring, in the same way it's boring to be forced to go on a stoopid vacation with your parents. Like, totally lame.I assure the grownups, though, this is not a boring film, and it's well worth a watch."}, {"id": 182, "text": "Tyler (Charlie Plummer) is a teen living in a quiet conservative town. His father Don (Dylan McDermott) is the leader of his boy scout troop. He has his stay at home mother Cindy (Samantha Mathis) and his younger sister Susie. The town is still traumatized by serial killer Clovehitch who for some reason stopped 10 years earlier. Tyler uncovers disturbing evidence suggesting his father as the serial killer. He befriends outsider Kassi (Madisen Beaty) who is obsessed with the killings.The premise is cool. The atmosphere has a good amount of dread but it's a bit too quiet and slow. The irrefutable evidence arrives way too early. I want to marinate in the mysterious uncertainty a lot more. The last half does a two Rashomon POV structure. It needs to end the first one a bit shorter so the second one has more to reveal. There are also questions with the viability of the ending. It's more reasonable for Kassi to call 911 before the confrontation. Overall, I like the start and the actors. The movie goes to interesting places but I question some of the choices."}, {"id": 183, "text": "For heaven's sakes...if you're going to try and write a false review to seem like you're unbiased then don't go for a 7-10 star rating with words in the review such as excellent or great. Smart IMDB'ers have gotten wise to your antics.This is a very slow and laughable movie. Thank goodness I didn't pay to see this silliness. McDermott is not good. Nor Harris. Not anyone. Even the squeal like a hog chick on the floor was bad. I mean really. The chick is hog tied, so I guess the director told her to squeal like a hog. Go figure.There's nothing redeemable or watchable here. My regret is I watched it from start to finish. Don't make the same mistake. And nope I'm not pre-pubescent (as one goofy reviewer alluded to why persons wouldn't like this flick)...way way way far from it. I'm of the genre that used to be able to watch a good flick every now and then from the wizards of Hollyweird. Guess all those wizards are long dead and gone. Never to be heard from again meaning none of us can look forward to anything worth a hoot coming from the west coast ever again At all."}, {"id": 184, "text": "I'm a fan of crime fiction film, especially if it's about serial killer, and I'm surprised I've never heard of this film before. The Clovehitch Killer was quite unexpected in a good way.I supposed comparing to other films featuring serial killer, this film could be consider quite boring for others, since the story is slow-paced. However, I didn't find it to be boring at all, and I actually enjoyed it. People seem to miss the point of this film. In my opinion, this film isn't really about finding the killers, instead, it's a coming-of-age story of a boy who has to learn to accept a harsh and horrible truth.The story is believable and the violence seem very real. The angsts and suspenses are always there. Some may consider the actions of the protagonist to be foolish, but it's actually understandable. Trying to picture yourself in their shoes, and you'll see that is also how you will react. I'd have to praise the character of the son, Tyler. The character is very well written. His actions are all so real and is that of a confused boy, full of disbelief. He never speak up about his feelings, but his emotions are very well conveyed, through the way the filmmakers captured his face and the way the actor acted out the character.Many people have mix feelings about the ending, but I believe the film ended exactly how it should. It's not a happy ending and that's how real life is. Sometimes things are better left unknown because truth hurts. This film is definitely not the kind of film that will become everyone's favorite, but it's the kind of film that will keep you thinking about it for days."}, {"id": 185, "text": "For those that don't want to read a long review just know that this film does everything right and the headline says it all. It's a very enjoyable film with great writing, and performances that tells a good story about a serial killer. Nothing new but it was done flawlessly. Don't expect to be amazed but you I'd be shocked to find someone who would regret seeing this film.It is very rare that I don't find flaws in a film and this is one I couldn't come up with any. While this film doesn't break new ground in cinema, it is a perfect film on a technical level. The acting was perfect even down to the child actors which is so rare for me to not be completely annoyed by a child actors performance.Every actor made their characters believable and there wasn't any scene chewing. This was a methodical suspense mystery film and not a fast paced thriller, but it never becomes dull. The dialogue was all realistic with no stereotypical portrayals, and Madisen Beaty Kassi was one of the best female characters I have seen in a long time. She is a breath of fresh air to me.I appreciated that the film leaves certain things left to speculate on but ties up every major plot point nicely so not to feel like anything is unanswered. Also my girlfriend and I both were happy to see a film about a killer that targets women not do it distastefully or get rapey for shock value. So for those who want to know, there shouldn't really be any trigger scenes like in a lot of movies that touch on these subjects.The story is nothing original but it hits every note with perfect pitch. *********Possible Spoiler below here**********I really felt like this was a fictionalized telling of BTK and if so, they did a fantastic job portraying a serial killer that not many films really attempt."}, {"id": 186, "text": "I wanted to like The Clovehitch Killer more than I did. Many ingredients are there for an interesting movie. I think the direction is the key flaw here. It doesn't take its premise as far as it should have, to really make you feel something. It seems to approach some fairly uncomfortable viewing, but never make good on it.Dylan McDermott, the centre of the movie, is really its best part. His performance is chilling and confounding. The character of his son and his snooty gal pal don't really do enough. The investigate the titular killer, but you don't see enough of how they really think and feel. Nor is there enough of a look in from the mother character, who, doubtless, would have a lot of pain.Family, in most cases, is a web of secrets and lies. This movie could have been about more than a killer who's also a family man. It could have been painfully relatable. It just isn't."}, {"id": 187, "text": "I found this movie to be uneven and oddly paced, although it does feature some fine performances by the two male leads. Tyler (Charlie Plummer) is a Boy Scout and part of a fine, upstanding, church-going family. But he's slowly come to believe that his dad Don (Dylan McDermott) might be the infamous Clovehitch Killer, a man who terrorized the town ten years ago. Don is a Scout leader and a pillar of his community, so surely he's not a deviant and a murderer, right? The evidence might suggest otherwise. It's really a lot of fun to watch Dylan reconcile what he's discovered with his necessarily conservative, suppressed worldview. I mean, it'd be one thing if someone a little more wiser in the ways of the world were to find this stuff out, and it's a whole other thing for someone like Dylan, whose community is very straitlaced. Helping Dylan reconcile these two opposites is the town pariah, Kassi (Madisen Beaty), your standard girl from the wrong side of the tracks who's long followed and researched the Clovehitch Killer. But is the killer (named for his preferred type of knot) dormant, or is he planning to kill again? The answer won't surprise you. I did have some issues with the movie. First, it felt like the characters came off as mildly irritating, whether it was the joking, just kidding mentality of Kassi or the super-religious, overbearing stance of Tyler's mother (played very well by Samantha Mathis). Second, the final act of the movie just lost me, as the plot took a sharp turn into the land of unforeseeable but implausible - so although the ending wasn't very predictable, it also wasn't satisfying and left me cold. There was, I'll point out, a neat little narrative trick in the second act or so that is very well done (by director Duncan Skiles and writer Christopher Ford) and more than held my interest, only to jettison said interest a few scenes later as the denouement approached. Still, a high-quality performance from McDermott key role as Tyler's All-American Dad."}, {"id": 188, "text": "This was on my watchlist for a while; and I'm mad at myself I didn't take the opportunity to watch it sooner.Incredibly engaging, more so than expected. The little nuances and attention to detail in the character building, the cinematography, the script, and the score are outstanding. The little references towards Dennis Rader (the BTK killer) were perfect.The first and second act do an incredible job at building the tension, and slowly unveiling the plot. I was worried the third act would fall short - as is the case with most modern horror/thrillers - but the third act of this film is arguably one of the best of the decade. The way the story is wrapped up, and the film completed leaves no need for a sequel; a bold but very welcome move.I'd love to see more from this director in the future. In the meantime; I'm sure this film will see many re-watches from myself. One of the better movies I've seen this year."}, {"id": 189, "text": "The Clovehitch Killer is a new mystery thriller directed by Duncan Skiles, the director of The Last of the Great Romantics and Our Robocop Remake.Tyler (Charlie Plummer) and his father Don (Dylan McDermott) form a neat family, respected by the rest of the village of Kentucky. Both are, for example, members of the local boy scout association and they help and visit the local church every week. Their village only has a bad history, because ten years ago a serial killer brutally tortured ten women and eventually killed them. The identity of this serial killer has still not been traced in these ten years. When traces reappear that match the traces of the unknown serial killer, Tyler decides to investigate with his new girlfriend Kassi (Madisen Beaty). During this investigation, Tyler learns the truth about the identity of the serial killer. This discovery turns his whole world upside down, so Tyler no longer knows who he can trust.This film is very simple and cheap. This is because the director and most of the cast are more unknown or beginning people in the film world. The film looks like it was made by film students who first put together a film. In addition to being simple, the film also comes across as faint and long-winded, which means that the tension quickly diminishes.The scenes where the serial killer goes, for example, are very unclear in the picture or his actions take place behind any object such as a bed or cupboard so that the viewer cannot see what he is doing to his victims. This is probably only done to get rid of the scenes in a simple and cheap way or because people were unable to portray this in a more credible way. The promotion of the film actually also gives away the identity of the serial killer. This is fortunately not very disturbing, because it is actually easy to guess who this serial killer actually is. The film also contains many horror clichés, which have appeared earlier and better in other horror films and especially slashers. Scenes where the serial killer, for example, sneaks through a room of his next victim, look a lot like scenes from the slasher film the Strangers.It also seems as if the film is set at the end of the 1980s or just at the beginning of the 1990s due to the clothing and lifestyle of the characters, but despite these things, the characters use smartphones a bit against the rest of them the film enters.Apart from Dylan McDermott and Samantha Mathis, the rest of the cast consists mainly of unknown and starting actors, which unfortunately can be traced back to the level at which they act in the film. Because of this lesser acting, the film is also difficult to take seriously."}, {"id": 190, "text": "Serial killers don't stop, that's what a small town in the united states believed when a notorious serial killer, known as the cloverhitch killer, stopped killing for a decade. Ten young women brutally lost their lives and a stereotypical American family is about to have their lives changed forever. The bond between a father and son is sacred, but how would you react if your father was a possibly related to the Cloverhitch Killer that sent terror through young women a decade ago? Tyler is a son of a well-known family in the local community, they go to church frequently and Tyler is following in the footsteps of his father, Don, to become a troop leader. Upon stealing his father's truck to have a romantic date with a love interest, he stumbles across an incriminating kinky picture. Disturbed, he later checks his father's secret shed and finds even more incriminating evidence. After befriending Kassi, a local girl obsessed with the case, they team up to uncover the real truth behind the cloverhitch killer and put an end once and for all. If you are looking for an edge of the seat thriller or endless gore, this isn't the one for you. The plot is cleverly written, and the acting is strong, the film takes a while to build up but with all the twists and turns, it's worth the wait."}, {"id": 191, "text": "The movie is good, and might have been better with a more focussed end, but it didn't ruin the film as some of the 'dramatic' reviews suggest.The movie does a great job keeping you on the edge of your seat. Is he the Clovehitch Killer? Is his son going to stay loyal, or do the right thing? Is his son's girlfriend in danger? and so on...The acting is great from allIt feels very true to life. Those who doubt this, look up real serial killer cases, there some very evil people aroundThe film builds up the suspense for a good finaleHowever, the finale is a slight let down and might have been better served with more focus on the lady who wasn't tied up. Did she survive? Did she help them out? Was she grateful? Sadly, we don't know.I saw the film over a year ago, and had completely forgotten about it until I started watching it again. So, despite it being a good film, it clearly wasn't memorable for me and I suspect this review will be the only reminder I saw it."}, {"id": 192, "text": "This story is very loosely based on BTK using that case just a basis for his general M.O. and some of the trappings surrounding that real life serial killer but of course, this story is purely fictional, tho doing this very much grounds it in some solid reality territory as it's used as a character and somewhat of a setting and timeline framework here...This movie is all about character and slow reveals and twist you obviously see coming but doesn't really matter as it's more about the tone and character interplay than being genre standard fare.. most scenes are understated, which is very much appreciated to the normal hyperbolic ticking time clock manufactured suspense.. the thing that shines here isn't really Is he, isn't he.. it's more character study than true suspense thriller... and went places I did not quite expect with the plot, so not so much by the numbers.. it was so understated that I did not expect some of the reveals at the climax of the plot.. but looking back, I should have picked up on it.. it played with cliches without being showy about it.. which I very much appreciated.. so expect to just more get to know the characters, learn about then and have the plot unfold and have maybe a few surprises but not shoved in your face, it's not a gimmicky sort of movie.. it's really more about the characters and learning their story and being with them, than trappings of genre cliches..and well acted, I mean I usually have an unexplainable and irrational but healthy in my opinion dislike for Dylan McDermott's acting and face... heh. but I really enjoyed him in this.. no real scenery chewing, well, maybe a little, heh, but for me just added to the movie actually as it kind of fit and did not seem out of place. all of the cast, especially the young cast, performed to top notch levels for this level of filmmaking..I dunno, I went it thinking it was going to be one kind of hyperbolic genre cliche and was very pleasantly surprised that it was a decently acted and understatedly directed character piece.. it's not an earth shatterer by any stretch, but a solid engaging watch that makes you think a little bit, about the situation..I would say having a background or interest in serial killers and how they operate might help in the enjoyment of the film, as they do get a decent score, since they drew from a real source as a frame work. but don't expect flashy and I would not describe it as taut by any stretch..some will find it boring I am sure, but the concept and the interplay and how it was executed was what drew me in.. aside from the ending, much of what happened in the movie, has happened in real life actually and has basis in reality. much more than in most serial killer based films.not perfect by any stretch but I'd recommend it as a strong, nothing else to watch pick for sure.. which is how I came to watch it.. I expected to roll my eyes and surprisingly did a whole lot less than I thought I would, tho of course, did a little, hehe. solid watch for fun and interesting premise.. slightly different than the normal run of the mill, in a good way."}, {"id": 193, "text": "So I saw the new independent horror film The Clovehitch Killer at the theater. I really didn't know much about the movie going in, but the early reviews were strong. Overall is was a meticulously a well-crafted slow burn of a psychological murder mystery. I enjoyed it!The initial premise of the movie is fairly straightforward. A teenage boy begins to suspect his father is not all that he seems as the son begins to investigate the history of a string of murders that occurred in their small town. Along the way the film perfectly plays with the viewers expectations and provides ample elements of suspense and drama with a few twists thrown in for good measure. The film turned out to be quite smarty written and really had a number of very tense moments based completely character interactions.The film is very light on gore but makes up for this with a thick and atmospheric plot that relies heavily on suspense. Half way through film the movie becomes almost a character study into the mind of a serial killer. Similar to Henry Portrait of a Serial Killer the movie really pulls back the curtain and shows you the inner workings into the mind of a serial killer and the dual lives they must live. Despite a low body count the movie still managed to make a very unnerving and realistic depiction of a sociopath.I was very impressed with the director all around. While the plot may have seemed simple at first, the film really did a good job misdirecting its audience. There were a number of scenes where I was on the edge of my seat wondering what would happen next while others were so thick with tension. Also the acting in the movie was all around very well done. The two main leads of the film really sold their performances.The movie relied heavily on atmosphere to craft a realistic and stark picture of a serial killer. The movie was certainly not action-packed and had a very slow burn pace that required quite a bit of patience and dedication. This is not the kind of horror film for someone expecting a slasher or a traditional serial killer film. This was very much a psychological horror film that may be a turn off in our modern hyper violent horror culture. A 8.25 out of 10."}, {"id": 194, "text": "In a refreshing take on the serial killer subgenre and in particular, a very loose interpretation of real life serial killer Dennis Lynn Rader, commonly known as the BTK Killer (Bind, Torture, Kill), director Duncan Skiles is at his best as he invites us to view a slice of Americana without exploiting the issues he depicts.When Tyler Burnside's (Charlie Plummer) life is rattled after finding evidence leading to the discovery that his father; the outgoing, community leader Don (Dylan McDermott), may be the notorious Clovehitch killer (named after the telltale knot which he leaves at the location of each victim), he and his outcast friend Kassi (Madisen Beaty) begin a search that may unravel young Tyler's life to its core.The plot glides over the small Kentucky town both eerily and quickly. As a drama and suspenseful mystery, The Clovehitch Killer remains consistent until its second act where the POV shifts and the movie becomes a true nightmare.Without the use of gratuitous blood, Skiles relies on the story's built-in-suspense to create the mood. In the same mode that Summer of '84, perpetuates a feeling of terror as adolescence and innocence is lost, The Clovehitch Killer, at its core is a story about Tyler more than it is about a killer. Strong acting by Plummer, McDermott and cast carries the film more than its actual script.In choosing to inform us rather than dwell on the facts, Skiles tactfully holds back on sharing his own opinion regarding the tight-knit, Baptist community his characters live in. The Burnside family is devout, somewhat trapped in the 50's and display a slight awkwardness toward each other, however they are also a loving and outgoing family that possesses a lighthearted side, which shines through.If you are a person who finds it hard to suspend your disbelief, the middle and end of The Clovehitch Killer may become a little more than you bargained for, especially after its strong first act. But if you can go with the flow, you will find a clever film that is satisfying to the most hardened horror fan. I'm quite frankly surprised this film didn't get a stronger release."}, {"id": 195, "text": "The Clovehitch Killer Directed by Duncan Skiles and written by Christopher FordThis was a recommendation from my friend Mike Smith and from the Red Letter Media guys of which I am a big fan. I'm a big fan of both Red Letter Media and my friend Smitty. This was a really solid movie. It takes turns that you're not really expecting. You think you have everything figured out from the beginning. But nope we switch point of views and then switch them back.This is a somber film that lives in the banality of the suburbs. It gives you time to get acquainted with this Christian family. They go to church and they play games on family fun night. They are Christian to an obnoxious level. The main character's supposed best friend is a d-bag of the highest order and when they finally have a fist fight over the outcast girl obsessed with murders in particular the Clovehitch Killer, I was so happy.The outcast girl and the main character are under the belief that the dad is a serial killer. But how can that be? It is a procedural where the outcast and the boy are looking for clues where they might find out the truth. Then it switches to the routine of the clovehitch killer. You're turned for a loop for a minute. You're still hooked into that damaged mind. You find the answer the girl and the boy were looking for. They answer the mystery rather early in the proceedings and then it puts you in the shoes of the killer. There's a saying about the banality of evil. How ordinary these depraved things can become. This movie revels in that. It also plays with reputation. How the neighbors perceive you is just as important as the truth in this particular community.I enjoyed this movie quite a bit. It takes a premise that could have been tired and worn out and turned it into a compelling story. It has excellent performances all around from everyone and it really digs into your skin and the skin of the characters. I give this movie a B."}], "reviews_amount": 196}