{"name": "Iron Mask", "titleId": "tt06218010", "reviews": [{"id": 0, "text": "The Iron Mask Before I give you my opinion, ask yourself, Do I like Kung Fu Theater and often non-sensical Russian fantasy stories?If you answered yes to both of those like I did, you'll love this. Added bonus, Jackie Chan, Schwarzenegger, and Rutger Hauer cameos"}, {"id": 1, "text": "This film doesn't star Jackie Chan &amp; Arnie, they have cameo roles in what I would call an afternoon b movie"}, {"id": 2, "text": "What can you expect from a Jackie Chan movie? Too much, too little, too late, yes? Throw in Arnold Schwarzenegger, a few European retro stars and lots of Russian vodka lime twist with Eastern and western mythical creatures thrown into the mix and viola, 2 hours of silly whack. The acting of all the actresses are blatantly cliche and nubile so prepare to dumb down. I gave a 6 for costumes, good enough special effects, scenery and enthusiastic over acting by all the extras. It's not everyday so many get to make some coin and see Jackie and Arnold buddy up."}, {"id": 3, "text": "Costumes are bad. Very predictable story line. I like Arnold and Jackie part but they don't get that much screen time. At least make the characters has some language barriers. The dubbing is very bad. Quite bad CG and there are a lot of them in the movie. Apart of Jackie's fight scenes, the rest or quite mediocre."}, {"id": 4, "text": "This is advertised as a movie starring Jackie Chan and Arnold Schwarzenegger but this is complete FRAUD. These 2 actors play side-line characters, which can't even be considered supporting roles, and appear for a minuscule amount of screen time.The story is a nonsensical mess and the opposite of entertaining. The actual main actors are terrible and, I am not sure if they are to blame or the dumpster fire script, but calling them B-Movie actors would be a massive insult to B-Movie actors so I don't have the words to describe how bad the acting is.This movie is not worth going into a more detailed review on, it is just complete garbage and someone should sue the producers for false advertising. Message me here if you want a plaintiff for that lawsuit, as I was unable to get my money back since I live in a terrible country for consumers."}, {"id": 5, "text": "Some times I just want a movie to take me some place completely new, and this movie did it. You can just sit back and let the flick take you on a nice dreamy adventure. I love the fantasy worlds it takes you to and the special effects were well done. It is a movie that keeps moving and has lots of eye candy. The acting was so so, but it was all done in good spirit."}, {"id": 6, "text": "Like most Chinese movies, there is a lot of pointless awful-looking CGI and the plot is a complete mess used to tie thing together, instead of the other way around..There wasn't really anything memorable, and the few actions scenes weren't that impressive. Even the cast of heroes and villains are forgettable.. no good lines either. Nothing! This movie has no love and nothing going for it."}, {"id": 7, "text": "Should have known by the intro with nine different productions companies having to produce it. The dubbing is quite frankly poor. Seriously the worst time ever. I can't believe Jackie Chan put his name to it."}, {"id": 8, "text": "Another disappointing movie from Jackie Chan. His last 3 movies are so poor that he isn't the Jackie Chan we used to know . In this movie, the worst is Dubbing .... all English guys and ladies talking Chinese? Come on ! Why would you dub this ? Poor....."}, {"id": 9, "text": "It's a mishmash of everything, 19th century London, Russians, fantasy creatures, and Chinese sorcerers and princesses. While the scenario is chaotic and some visuals are not so good, this is an entertaining fantasy-action movie, especially for children. Some scenes look beautiful, some fights are also cool. In conclusion, better than I expected. It goes well with nachos."}, {"id": 10, "text": "Apart from the undeniable charm of silly wigtacular duel of Jackie Chan and Arnold Schwarzenegger, 'The Mystery of the Dragon Seal' has not much to offer. Still, it is competently made and there is something captivating about the nuttiness of it all."}, {"id": 11, "text": "Had really high expectations from this movie and was highly disappointed after watching it. It is terrible on every level. I dont know how actors like Jackie Chan and Arnold can opt to be partnof such a terrible movie. Being in lock down, in UK watches it as a family on virgin media, paid £6 for it... I can say that was money and time both wasted. 100% horrible"}, {"id": 12, "text": "Terrific movie. Keeps in the same breath, the original story and funny jokes. Jackie Chan and Arnold Schwarzenegger are the bomb. I got a lot of positive emotions!"}, {"id": 13, "text": "This is the worst film u can expect from hm. Poor plot, scenes, kindy acting etc. stop wasting your money on this crap."}, {"id": 14, "text": "It is disgusting. China and Russia should ban this movie from showing to the public. No screenplay. Nothing. Only stamps and ideas from Pirates of Caribean... Not 6+ rating. alcohol, mutants... If we will not take into account Arnold, Jackie and Rutger - nothing to see."}, {"id": 15, "text": "I really enjoyed this. I knew Arnold and Jackie are only guests here so I was surprised by how long they actually stayed. This is fast moving, fun, colourful not ingenious but not silly either, mix of eastern and european legends-cultures-famous actors with really bad dubbing, it's true. I only wish I'd seen it with my kids."}, {"id": 16, "text": "Jackie Chan and Arnold Schwarzenegger you should see this in a cinema, and most importantly IMAX, then you will understand where each cent was spent. A gorgeous picture and one of the most exciting stories. You immerse yourself in the movie and empathize with the heroes."}, {"id": 17, "text": "No idea were to begin, but it is 2 hours i will NEVER get back... bad acting, bad script, bad dialogue, bad story, bad direction, bad sound, bad effects, bad voice overs... the best thing is i know i will NEVER EVER watch it again..."}, {"id": 18, "text": "Felt a half-hour too long but overall a fun ride. Chinese movie with Jackie Chan and Arnold. I liked it!"}, {"id": 19, "text": "If you like a light, fun movie -- this is an 8 star show. If you are a literary gas bag, then you will choke on your toxic gas."}, {"id": 20, "text": "After the initial distraction of the look and movement of the film, the obvious overdubbing made me realize what I was watching was more a traditional Kung Fu/Russian fantasy creation. This adjustment in my expectation of an American made Jackie Chan/Arnold movie helped me to enjoy it like an old Bruce Lee movie...with CGI. And always fun to catch Marty Klebba in a film. Don't watch this unless your a fan of old King Fu films and don't let things like bad dubbing, tangential story lines and predictable endings keep you from enjoying it."}, {"id": 21, "text": "The movie is good not oscar worthy by any means. Just a fun movie jackie and arnold have a good fight scene but are not the stars. If you go in expecting an a rated movie you will be disappointed."}, {"id": 22, "text": "It says that Oleg is one of the leading feature film directors in Russia. Sorry, not leading, not even know who he is, nobody knows him in Russia and I wish he hadn't made this movie. With such a cast making this was almost impossible but he did it, bravo, awful movie. Long, as stupid as only an ignorant can make it. Depictions of Russia, China and London are probably taken from Soviet poster caricatures. I think Arnold and Jackie will be ashamed of this movie, I cannot believe it stars Pavel Volya, an excellent stand up comedian.BAD BAD BAD, please Oleg, don't make any more movies..........."}, {"id": 23, "text": "Good things: Pleasing graphics/animations/VFX, 'fiction + old era' looked afresh An average racy action entertainerBad/Improvable things: Jackie Chan &amp; Arnold wasted to the core, they're shown only for 5% of the running time. At the end of the film, as the audience, we feel cheated. Not so good action sequences Childish plot with a message aka not for adults Jackie chan == Dragon? Huggghhh..."}, {"id": 24, "text": "My recommendation to you who consider watching this movie, don't. Please don't. I haven't stopped watching a movie in years, but this was just unbearable to sit through. So I turned it off, and glad for it.* Bad Acting * Incoherent nonsensical plot * Dubbed and horrendous dialog"}, {"id": 25, "text": "An unexpected change from the norm. Lightweight funny, but fun for the whole family."}, {"id": 26, "text": "While the title revolves around one person the real story is elsewhere. It's an imaginative telling of a familiar story with lots of surprises. The sets are wonderful. This is not a serious film. It's all about fun and whimsy so the acting is not so important as enjoying the fantasy. I enjoyed it. In fact, I'd see it again. It's like many Chinese films of this genre with fabulous sets, epic scale, and really if you take this movie seriously you're missing the whole point of it. It's full blown entertainment for the sake of entertainment. It would be great if they made more of these."}, {"id": 27, "text": "You have never seen a movie this incoherent or this bad... ever!Quite possibly the worst movie ever made."}, {"id": 28, "text": "I think some reviewers must have watched a different movie. Arnie and Jackie were in it plenty,and the movie, though clumsy in places, was fun and visually sumptuous. A good family watch."}, {"id": 29, "text": "This is one of those movies where the reviews are so wrong and it's so underrated.Watch it if you like Avengers kind of movies and the prestige."}, {"id": 30, "text": "Seems like another China/Western collaboration that totally misses the mark :-( It does have some pretty cool visuals though :-)"}, {"id": 31, "text": "Enjoyable movie. It's a Jackie Chan Movie. He take you out of reality and into the imaginary world."}, {"id": 32, "text": "I have to say I really enjoyed this one and thought the actors were very good. I also enjoyed the comedy in it. Yes I recommend it. James Welch Henderson, Arkansas 12/16/2020"}, {"id": 33, "text": "The plot is explained in the first 3 minutes of the film so pay attention. The eyelashes of a dragon can be made into a healing tea. The Master (Jackie Chan) and his daughter the Princess (Xingtong Yao) control the dragon with the dragon seal. The witch (Li Ma) and black wizards have captured the two and imprisoned them. One in London and another in Moscow. The witch has allowed the eyelashes of the dragon to grow, get heavy and put the dragon to sleep. The Master still has the seal.This is where the fantasy adventure starts. In spite of the harsh criticisms I liked the film. Arnold Schwarzenegger and Jackie Chan had smaller roles than expected. I watched the film as titled The Mystery of the Dragon Seal which is better than Iron Mask which gives one a false impression. And yes, Peter the Great had an annual beard tax."}, {"id": 34, "text": "Viewers need to understand this is an exemplary joint Chinese / Russian film. The English voice overs are pathetic &amp; laughable. Worst thing I've ever seen Arnold &amp; Jackie Chan ever do."}, {"id": 35, "text": "This movie's script might somewhat look like an old way of the past. However this movie is tru;y mezmerizing. There are plenty of unpredictable events in this movie which makes it great. Perectly performed by Jacky Chan and Arnold Schwarzenegger but also the other cast members. im just so sorry it has received such a low score and i believe this is due to the fact that it wasn't directed in USA. That alone can't determine whether a movie is good or not. I saw it and it is plenty of action, scenes and sories mixing up together to make up a great movie like this one. It is really a must. I watched at home. Wished i had watched it at the cinema though. Much more fun."}, {"id": 36, "text": "Oh how long have i wished for a tron 2 and a viy 2. At least one of my wishes has come true in this lifetime. Amazing movie, amazing. You have to watch it to believe it, or much better you watch the movie called viy first and i can guarantee you will be heading to watch this one afterwards."}, {"id": 37, "text": "So bad. What I'd expect from Arnold but not Jackie. Almost as bad as that Australian movie Occupation. It didn't even have that signature fight scene outtakes."}, {"id": 38, "text": "I'm not gonna disrespect Jackie chan at all, of course he doesn't make the same kind of films he did back in the 80's &amp; 90's, he couldn't possibly do that now, but I actually enjoyed this film. JC doesn't get a hell of a lot of screen time, his appearances are still worthwhile though, it's a case of the old mish mash of fantasy, spinning swordsmen, folk dressed up like rayden, kind of reminded me a little of 'big trouble in little China' so I can't argue with that, I didn't mind the CG effects, I've seen a lot worse, and big Arnie's character made me smile. Watch it alone or watch it with your kids, either way, enjoy"}, {"id": 39, "text": "...then they make a movie. No matter if they can direct, write a script or even produce they still make a movie. Spend it on talented people instead!"}, {"id": 40, "text": "Let's not waste more time and get to the point. Worst than a B movie. I truly feel like to enjoy this movie and get it, you should eat a bunch of shrooms before you watch or be a kid. Jackie and Arnold play small roles. The audio is good and punchy except voices that's another deal. The voice audio was way off definitely a dubbed movie. Made it hard to watch. The acting went along with B movie status. Another reviewer said it perfectly WTF. In the end though my kid liked it so a long as he likes it I guess it's okay."}, {"id": 41, "text": "I genuinely went into this film with an open mind, and the film ended with my whole family and I feeling scammed. Including my 12 year old sister who apologized for making us watch this film, no joke. Jackie Chan and Arnold, both whom I like and respect, are in this film for 10 seconds. Clearly just a cash grab. Their fight scene was boring, and 99% of the film is focused on bland characters with bad english dubbing. Don't waste your time. Watch a youtube clip if you wanna see Arnold and Jackie fight"}, {"id": 42, "text": "So I run across this trailer and see my boys Jackie and Arnold in what appeared to be a non-typical movie; I'm Game! or so I thought.Found it in a Red Box, took it home and knew in a matter of moments that the movie was going to suck simply due to the bad voice-over dubbing. 20 minutes into the movie and I realize that Jackie and Arnold, who were the center of attention in the trailer, were only supporting actors.I know movies are going to suffer through the lack of filming during a COVID year but this is ridiculous. I paid 2 bucks for the Red Box, I feel like I should get $1.50 change back..."}, {"id": 43, "text": "So first of all, did not realize this was a sequel, so the beginning was very confusing. So there is ongoing original plot from Viy and this Chinese based plot. The Chinese based plot was actually intriguing and had a lot of potential if that was the sole focus. The only other good thing was the scenery and the costume design.Besides that it's definitely one of the worst movies I have ever seen. The acting was worsened by the horrible english language overlay. The story moved way too fast and was not well presented, I was confused through almost the entirety of the film. It was comical how bad it was most of the time.I do hope someone takes the Chinese based plot line and makes it into a separate solo film!"}, {"id": 44, "text": "Three stories in one. It would've been a decent TV show but was a horrible movie. The dubbing was bad, acting, script, all of it. Cool concept, bad execution. The CGI, costumes, and scenery was the only good thing that came out of the movie."}, {"id": 45, "text": "Unmatched video and audio is not a feature of Asian films. It's just poor work, and this was full of it. Audio throughout was awful. Story lacked originality, was very predictable and the only amusing parts were the cameo appearances by Arnold and Jackie. Wish I could have my time back."}, {"id": 46, "text": "I hate dubbed movies but the story was good. Special effects were fairly good. Arnold and Jackie were not in it enough."}, {"id": 47, "text": "You're going to spend the movie saying ,who's this? , and the answer won't come in the next scenes. Seriously WTF"}, {"id": 48, "text": "A China/Russia financed fantasy movie. Imagine 'The Adventures of Baron Munchausen' - on steroids, or 'Around The World In 80 Days. You get the idea.Don't bother trying to make sense - you won't be able to, just kick back and let the madness unfold as you are taken in to a make believe world with over the top performances by Ahnold and Jackie. Good looking female lead as Ms. Dudley (who is actually a real born in Russia actress, who speaks fluent English.)Pretty good entertainment for all the family. Watch on a wet and stormy day."}, {"id": 49, "text": "This is dumb even for a fairy tale / adventure movie targeting kids.When i saw Jackie Chen, I thought there will be funny combat scenes. When I saw Arnold, I thought of cheezy one liners. I got both, but well, it's not enough to carry the whole movie.I will not say that the production was bad despite the budget, I will not say that the cast did not do well, I will not say that the script could be better. I will say just one thing.It was boring"}, {"id": 50, "text": "Well finally I've seen the worst piece of cinematography in my life. I'm 41 and have seen all kinds of bad movies, but this one is definitely the worst of the worst. Still I can not comprehend how bad it is. Avoid at all costs. My stomach hurts while writing this because I'm still thinking about it. I would give it a negative 10 if it's possible."}, {"id": 51, "text": "Too many specials effects, too long, too predictible. If you are a Scharzy or Jacky Chan fan it could be a little intersting but for all the others: don't waste your time, nothing to see here"}, {"id": 52, "text": "Aside from a couple of decent, fight scenes, this movie is pretty paint by numbers. You'd think a fight scene with Jackie Chan and Arnold Schwarzenegger would be more epic, but it really isn't. Even though they have top billing, they are only in a handful of scenes which is more than a little disappointing. Unnecessary plot threads to pad everything out and, presumably, set up a third movie start to clog things up. Otherwise, its a harmless straight to streaming affair and will kill an hour. But nit really much more than that."}, {"id": 53, "text": "Great actors Arnie chan it reminds of Harrison Ford flim R OF THE LOST ARK immi good flim"}, {"id": 54, "text": "THe movie is really great, even if Arnold Schwarzenegger and Jackie Chan get minor roles.But the problem is in the tittle's occidental translation. The iron mask is not a mystery, it's quite the opposite. We know from the beggining who is in the iron mask, and he himself tells it and everybody believe him just because he saved these everybody... The chinese subtitle is the Mystery of the Dragon Seal. And it's way more better and logical than the iron mask ^_^Enjoy, it's still a great movie :)"}, {"id": 55, "text": "1 and 10 reviews mostly. curious.. curious The movie is great. It's way better than all of the Jackie Chan's movies from the last decade. This is the kid's version of Raiders of the Lost Ark"}, {"id": 56, "text": "I'd rather watch this than twilight's sparkly vampires. at least Arnold's and Jackie Chan's scene is quite funny."}, {"id": 57, "text": "Never seen a movie as bad as this one. The only parts that was ok was the Asian parts of the movie. The Russian parts was worst. Bad green screens. Bad acting. The worst actor was Arnold, of course. He should be quiet. This movie could be a good one if it was total Asian and a Asian director. The Russian director have no clue how to make a movie."}, {"id": 58, "text": "The story itself is weird and about a dragon's eyelashes growing some healing plants, though they don't really show much of that. It's about an impostor princess taking control of that and the real princess trying to get the kingdom back or something. It's kind of tough to understand.There are some big names in this, but the acting is terrible. The dubbing is terrible, too. Even if it wasn't, it feels like there are a lot of lines of dialogue missing. The movie jumps very quickly from one thing to the next and moments that should be dramatic end suddenly with a Yes, I believe you now. or Do it immediately. The CGI is lacking as well. I don't know why so many big names jumped on this.I've seen low budget live action remakes of animes that work better."}, {"id": 59, "text": "It's a truly bizarre mix of interesting sets, terrible dubbing and bad cgi . It's melodramatic full of story book cheese a princess a dragon and positive messages. But in the end it was kind of fun. Very dumb fun watch with children alcohol required."}, {"id": 60, "text": "I wish this movie was full in English it would've been a very good movie and I would've watched it very dissatisfied with it not being in English I watched part of it and it looked very good"}, {"id": 61, "text": "Oh wow! This was a horrible movie. So much was bad, but the worst of all were the sounds and music. I don't think I've ever heard worse.A huge waste of money."}, {"id": 62, "text": "It would be a great film if there was no China, very unpleasant, like a Hong Kong action movie with Europeans. I was looking forward to a European film. The beginning was excellent, the sequel was terrible. Too little Schwarzenegger. We expected Arnie to star in the film, but he was placed in a minor role. We expected Arnie to star in the film, but he was placed in a minor role."}, {"id": 63, "text": "I absolutely love old kung fu movies. But this is a mess with little charm and horribly dubbed russian and chinese actors (usually funny, but not here). Also: bad CGI, and the action scenes are nothing to get excited about unfortunately.What a waste. Cringe."}, {"id": 64, "text": "Poor editing and acting. I really can't believe it. This could have been a lot better. Amazing cast but everything else is really bad"}, {"id": 65, "text": "Everything about this film (except the odd cheap-looking CGI) screams big budget epic movie, but The Iron Mask is a narratively incoherent bloated mess. The acting performances leave a lot to be desired, while it has the loosest skeleton of a story-line held together with the barest minimum of dialogue. Actually, the plot of this film is hardly worth any form of scrutiny, while much of the dialogue seems (badly) dubbed. It's also a frequently silly and occasionally very dull experience, but for all its faults, for young kids it will be hard to dislike this fantasy mess. If you are of age 14 and above, this is a quite bad $50 million budget film and you can skip it because it's a forgettable affair.Rating: 4+"}, {"id": 66, "text": "Like most Chinese/Western productions the story is a horrible mess with really cheesy acting.The actors speak like little children just mind numbing narrativeJackie Chan and Arnie only appear for 10-15 mins of the movie ...The movie music director needs to be fired - music way over the top on scenes - ridiculous!China just stop making movies for western audiences please - it's pathetic!"}, {"id": 67, "text": "Really wanted to enjoy this. Voices mostly out of sync. Almost shocking acting. To be fair I can't leave a full review as I had to switch this off after 25 minutes. If you've exhausted all of Prime/ Netflix/ Disney/ Sky etc then it's well worth a watch if you've run out of wet paint to watch."}, {"id": 68, "text": "An unlikely encounter between different culturesIt includes: the Russian iron mask, martial arts experts, pirates, monsters, characters from Mortal Kombat, a dwarf, old Chinese sages, tea leaves, people who fly very high, kosacks who do not speak, enemy brothers, supporting roles which are sometimes there for 15 seconds, a final scene worthy of a Marvel of the fox, very bad villains, very cowardly cowards, dragons and a lot of WTF :)The script is a bit messy, and feels like you've seen it before. Some main characters have no explanations , and the Deus ex machina are numerous ... Do not watch this film for the screenplay, or to discover something ... No, it's pure entertainment.And I have seen worse, much worse. If you have a childish soul, and you miss the epic adventure films, with an Asian tendency, this film could please you.It's really a shame that the English dubbing ruins everything.To watch on a Sunday evening to have a good time."}, {"id": 69, "text": "I just watched The Iron MaskOh Arnold Schwarzenegger. This drivel is on par with Killing Gunther. I noticed the credits said 'With the special participation of Jackie Chan' I didn't notice Arnold's name outside of listing him as an Executive Producer.Arnold and Jackie Chan arrive early on, then disappear around the 40 minute mark, and turn back up at the end. His screen time is about 15 minutes if I'm being generous. It could be as low as 10 as he is in a few scenes, but he is not actually on camera. So I'm not sure why Randy was so thrilled with his  substantially bigger roll he shares most of his scenes on screen with Chan. As for his love of Arnold's hand to hand fighting, I'm amazed if he does not realise that was done with a stuntman/stand in.I knew what to expect going in, but I was still surprised at 1 minute 22 of 8 studio logos, then we get the opening credits which doesn't feature cast names, but a list of producers, executive producers, co executive producers and co distributors!!Awful ADR, poor acting, woeful attempts at humour and some poorly executed fight choreography really drag this drown. It does look pretty though."}, {"id": 70, "text": "I don't really know where to start, but I must assume that I love this movie, and no critics will change my mind about that. But this movie is badly done that is for sure. Okay so this movie is the equivalent of an American blockbuster in terms of production, an insane amount of people worked on this movie. But it's Bad. It's badly filmed, the action is confused, the camera angle are rarely motivated and barely understandable. And the special effects, which the movie is full of, are dated, they look like pre-2010 CGI, and it came out last year ! The story telling is confused, and pretty clumsy. And the dialog are... Out of this world most of the time. And there are more flaws to this movie it's for sure. But still I love it. Why ? Because it's fun ! This movie doesn't take itself seriously in the first place, it's not here to revolutionize cinema, or transcend it's public. It's a relaxed adventure movie like we don't do anymore ! There are jokes all the time. It's a movie that makes you feel good. And once you've accepted that your not watching the latest Nolan, and that you're here to have fun, you suddenly jump into the movie. And quite frankly even though a lot of the VFX are badly done, a lot of them are really interesting. And the costumes, the sets are really interesting to. For me this movie is a modern B series. It's not a nanar, because as I said, it's not serious, so you laugh with the movie, not at the movie. And it reminds me a lot about these movies from the 80's, where they didn't take themselves to seriously, with jokes and a lot of good vibes (we have a French expression for this I can't get the English one), and a distance from their story. So despite all it's flaw, I love this movie, because it's fun, and it invites you to have fun with him in a huge universe of myth and legends. And it's refreshing. It's refreshing to see a movie like this, in contrast to all the dark movies that Hollywood is producing now, and that really can't be bothered with just putting some distance with their stories."}, {"id": 71, "text": "The Pros: Consensus is that the iron mask prisoner in the UK was Louis XIV twin brother, but Peter the Great was touring Europe 1690-1710 time frame &amp; these parts of Russia &amp; China were in conflict over rule so it's not a hell no premise. The film has excellent pacing and you actually find yourself invested in the film's love triangle.The Cons: Does Peter the Great in this look 6'8? As a viewer you don't get that feeling. The film offers very little in exposition on the villians. The film goes from a they at the intro to a her at the end &amp; doesn't really explain why.Overall: If you think of this film along the lines of Around the World in 80 Days it's an enjoyable ride where you feel it ends to soon. If you liked Mulan even a little I think you'll like this more. I mean the 2020 Mulan and not the animated classic. They are very diffierent films. There is no Mushu in 2020 Mulan. The chemistry between Mulan and Mushu is what made that animated film a classic."}, {"id": 72, "text": "If you enjoyed movies like detective dee, the food the bad and the weird , the forbidden kingdom, yellow beard &amp; journey to the west you will probably enjoy this movie too! this movie is in my opinion in a category of B movies but had more of an Asian theme? I personally absolutely love these type of movies you could even think of the classic kung fu hustle to be in this kinda category! Maybe even big trouble in little China too ? I've watched a lot of these style of movies and would say it's not for everyone but if you like this style it's definitely something you could enjoy :) it's got martial arts style fighting reminds me a lot of the wu-tang dubbed collection type movies but more modern! if you have no love for B movies you probably won't enjoy this one ... their is definitely a lot going on in the plot but I still think it's something I understood easily and although Arnold and Jackie were not main characters I still very much enjoyed the movie! I have personally watched a bunch of movies in my life not just B movies a bunch of different Genre and I am always excited to see one with what I would say is a unique story! I hope you can enjoy this movie too !"}, {"id": 73, "text": "I didn't expect quite terribly from this based on the reviews, but it even got a little surprisingly positive. But perhaps the worst misconception in advertising is the big cameo role of the two big stars. Not this movie can be recommended to Jackie Chan fans in principle because of one fight. The rest of the main stars are quite unknown, at least to me, although it doesn't necessarily make a bad movie.The staging and visual side are basically in order. At times, the effects are quite faint looking, like a cgi city from the air or otherwise strongly in the background involved. It lacks something ... sharpness, or is it intentional. In some respects, on the other hand, it is very functional and beautiful to be seen as a class b film, or one can get a picture of it as a whole.After all, this is an overall entertaining adventure and I could imagine a physical recording of this movie could be challenging to get in the future. But not just for Jackie Chan or Arnold Schwarzenegger fans, because of the small side roles."}, {"id": 74, "text": "Ahhh... This movie was awesome, one of the more funny ones I've seen in quite some time. Starts with laughing a lot, especially when then arnie comes along as *spoiler prevented* :'D :'D I mean if I look at other commentaries, they simply have no sense of humor or expected something already, because that's what I think is needed here to enjoy this piece, sense of humor and a blank slate^^ I didn't expect nothing as I had no clue what it's going to be about or who the actors are. So i got positively surprised by this movie. As said, first you'll laugh and then you're actually in a small adventure. Yes it's predictable if you need to predict it and can't just let yourself go with the flow. CG is definitely not terrible AT ALL. I've seen terrible, and this even in higher end productions (no clue what this movie did cost but it surely wasn't a cheap one!) and the dragon is gorgeous and well animated!!!! And the little flying monster thingy was also sweet. When I had a moment during the movie where I actually noticed the wardrobes and settings I was totally satisfied. For me that was fairly enough authenticity. It's a fantasy movie with a great comedian touch after all, hello? Yes here and there you could improve maybe a little, but the CG is really really better than just OK! Too many whiners and cry babies here, this movie was so cool, something else, and definitely recommended =) Sorry for everyone who didn't enjoy it, but I think that's actually up to you and your silly expectations just because you saw some names and then as they didn't meet your expectations they could have done whatever job and you'd still be like that^^! Movie is great, smoke one up front and it's even better :'D Why does arnie or jackie need to have main roles? What logic is that? Just think about that once, I actually enjoyed them in the side roles as the actors were not bad at all, most of them are also well known, not only jacky and arnie but nearly everyone I knew from somewhere. Also the fights are great. No idea at all what you people are all flaming about^^"}, {"id": 75, "text": "Viy was mainly a Russian movie, with a few English actors thrown in to get Western audiences. This film is the sequel and it is as much Russian as it is Chinese, if not less so. But the actors are still thrown in to trick audiences rather than provide value to the film. I mean, one of the best scenes is Arnold Schwarzenegger fighting Jackie Chan. Yes, you get that! Only it is a tiny little scene and then none of the two actors bring anything else to the film.I have to say that this was much more fun and entertaining than the first. The budget is way bigger, too. Yet it still brought that lost in translation feeling when Chinese and Russian sensibilities are being poorly translated to an Anglo-saxon culture. The result is a fairy-tale like movie, with a lot of cinematic value and decent acting, with a lot of action scenes, but that feels disjointed, like someone tried to edit together three different films, then dubbed the result poorly.Bottom line: a much better film and I want them to continue with this kind of production, but I wish they would finally turn from the business of making audience traps to creating entertaining movies."}, {"id": 76, "text": "I somewhat like and i'm somewhat disturbed by the chosen Plotenpoints, humor, action, and production design of russian Boxoffice-Movies. This one was even stranger with Jackie Chan an Arnold Schwarzenegger in it.What i enjoyed to see and hear point of view and storytelling is alway newCrazy/unseen over and under the top decisions What i didn't liked Studio recordings with bad lightingsclearly visible and distracting CGIJackie Chan an Arnold Schwarzenegger are only here for audience fishingThe action between Jackie Chan and Arnold Schwarzenegger could have been good but was clearly not usedI watched it in english an the sound was sometimes all over the place = vaguesomeday the most logical shots are not there, like i missed something,"}, {"id": 77, "text": "As a fan of Jackie and Arnie in the 80s, this film is supremely droll and disappointing. I am perfectly fine with a movie that is light on plot, as long as the action is well put together and exciting. Unfortunately, this movie just felt like a lot of noise and movement pieced together.An action movie doesn't need monsters and expert fights to be exciting. It only needs tension and risk. The best action movies are ones where the stakes and risks are high, and the chances of the heroes winning are low. That's it. It could be a movie about ice skating or a football game - it will be exciting if it has those elements. This movie instead is just movement strung together with zero tension, and the audience feels like they don't really care.This is so disappointing, because there is a lot of action in this movie, and it just doesn't need so many. It just needs good action scenes, and good action scenes can be short. Just look at the fight between Thanos and Iron Man, Cap and Thor - it was actually very short, but very exciting because the heroes were outmatched. Rather, this is like watching 2 hours of an NBA team vs an elementary school basketball team: 2 hours of non-stop but boring action."}, {"id": 78, "text": "We should have seen it... the 9 producing companies at start. I even joked about it saying oh, none of the usual people wanted this. Then the mysterious special participation of Jackie Chan - wait what? Wasn't he THE actor with Schwarzie? And by the way, where is Schwarzie? Oh, there he is. As an executive producer. We let the move start. A very weird feeling like... there is something wrong... and then we saw it: we made it a game to see when it was dubbed and when it wasn't. And then there were so many painful oh please coming out that we just decided to fast forward. Maybe, just MAYBE there would be some cool fighting scenes? Nah. Everything was ugly. The acting was ugly. The script was ugly. The voice over was ugly. The special effects are not even remotely special, and hardly deserve the word effects either. When what's-her-name's eyes look half a meter away from the flying hairball, when she's supposed to look at it, I admit I cried out a little. So for the first time ever... we quit. And wondered why on earth did we RENT (yes because we RENTED IT) the movie before reading the reviews?! Hitting a toe in a rock is less painful than this piece of dung."}], "reviews_amount": 79}