{"name": "Monster Hunter", "titleId": "tt06475714", "reviews": [{"id": 0, "text": "This is what ruined it for me. It reminded me of the last Resident Evil movie with how many cuts there were in the action scenes, which Mila Jovovich also starred in. I don't see how they didn't learn their lesson from that. Within a 10 second period there are 8 to 10 cuts which make the action scenes hard to watch, and most importantly enjoy. With this being an action film I can't recommend spending money to watch since the action scenes are ruined by the amount of mind numbing cuts in them."}, {"id": 1, "text": "This movie isn't ment to be taken serious. It's just a fun action movie that makes for a good time when you need something to watch. If you put to much thought into it, your gonna be disappointed. I mean it's based off a game. Does this movie hold true to the game??? I have no clue. Never played it. But it is fun just to watch some crazy monsters an stuff blow up."}, {"id": 2, "text": "After being locked up since March and waiting for this movie I was expecting an adventure. Something epic and fun. All we got was a badly made stretched out episode of a tv show. This film would have been an incredible tv show as a format. The film ends at a big cliffhanger and it doesnt even resolve the plot to begin with. The acting was horrendous, the pacing too. The first half of the movie could have ended in about 20 minutes instead it stretches for about an hour and 10 minutes. Such a shame. I say kill the sequel and turn it into a tv show. Honestly would be a much better fit."}, {"id": 3, "text": "It's a movie about monsters and if that is what you are looking for then it's worth your time. This movie has some tone issues and some strange cuts but the action is fun and Milla Jovovich still brings that same Resident Evil swagger."}, {"id": 4, "text": "How can any director/producer be ok with that ending?It gave me The Turning and The Devil Inside vibes...The pacing is atrocious. There's no third act. Characters get introduced in the last 15 minutes and then forgotten. What happened to the rest of her team? Why did they get teleported? How will they return? What's the point of portals?Nothing gets explained. It's hilarious. The movie just ends when that part should have been the second act. No real plot. The movie is lifeless. That final monster came from nowhere. There's no setting up, no building, nothing. It just happens.I won't give an F because I liked Tony Jaa and the CGI for the monsters and some of the action.D+"}, {"id": 5, "text": "The only redeeming quality are the monsters . Everything else is just so cringe and doesn't fit at all. From Explosions and Loud music to the corny dialogues : So what. Are we like Guardians of the Galaxy now?, This is officially above my pay grade and not to mention the protagonist used fire against Diablos and Rathalos and survived a plain crash Really ???? that's soo laughably bad .they should have made a story that stays in the MH world. The generic U.S. Army coming from the real world was disreputable . and if you are fan of RE franchise you may enjoy this otherwise don't waste your time."}, {"id": 6, "text": "It took TREMORS and DUNE and HOBBIT and mashed them up with the hottest from RESIDENT EVIL. Fun stuff"}, {"id": 7, "text": "No need for a long review, this is a popcorn movie good fun, good monsters and the beautiful Milla Jovovich!"}, {"id": 8, "text": "Didn't read any reviews before seeing the movie, but trinaboice's was the first listed when I looked afterwards and she is spot on. No long buildup before the action starts, the movie jumps right in. The monsters are big, mean, loud, and very realistic CGI, nothing like the ones you see on Comet channel or the other cheesy Sci-Fi TV channels.Story is minimal, but that not why you'll see this movie, even without much of one it was still fun to see, and finally see on a big movie theater screen with the appropriate surround sound system.You'll have to ignore some of the physics impossibilities, the first big monster swims thru the sand like the scorpion in the first Transformers movie. And apparently the old sail ships can move thru the sand too. And the Hummer mounted big machine guns don't seem to bother the monster much, but big!! knives do.And trinaboice's comment about the Chi-knees joke in the movie, getting thousands of bashing comments, really?? Hardly an insult, people are just way too wimpy these days. People are looking for things to be offended by these days. Toughen up, it's a joke, get over it.Enjoy the monsters and the movie!!!"}, {"id": 9, "text": "No plot, logic, acting, story, nothing to be seen in this movie even the CGI is below average and dark."}, {"id": 10, "text": "Honestly, I was really excited for this movie, but how bad it was..The acting was bad, the plot was bad (didnt make ANY sense at all), the CGI was normal to okay and the editing???? No idea what happened there.Trust me, save your money and see something else."}, {"id": 11, "text": "The visuals of monster hunter were amazing, great monsters and vivid cinematography. There were quite a few jarring action scenes, but it worked well. The storyline itself left something to be desired, but the acting was decent and good fight choreography. If they made a sequel... I'd probably go see it."}, {"id": 12, "text": "Can Hollywood stop letting Paul Anderson direct his wife in EVERY bad game to film adaptation?"}, {"id": 13, "text": "Not the best movie by far but these days if you need an escape for 2020 and your local theater is open, its worth it. It's an easy 1.5 hour escape from the real monsters shown to us daily with higher body counts. I enjoy the movie going experience and this movie will do just fine for me."}, {"id": 14, "text": "I'd rather a video game movie blow through the storyline and get to the action instead of trying to explain every detail and every character. Some things only make sense in a video game. This gave me the goods. Intense monster battles, hand to hand combat, explosions and even a cat pirate! Plus Mila Jovovich, Tony Jaa &amp; Ron Pearlman. Give me the sequel!"}, {"id": 15, "text": "We all know video game movies are terrible in its story and direction. Some will say the video game is better. This movie was poorly directed and has made so many changes with the characters and story. It's portrays it mediocre. The Ranger squad are introduced and sadly they have been permanently removed, taking away what was good. Their is our world and the new world. The dark tower controls a portal by some evil deity. Mila is the only survivor, she meets with the Hunter who doesn't speak English and is horrible at how he treats women. They both hate each other. Only chocolate is what brings them together.The hunter is basically a pirate, and their ship rides on sand. Their is only three monsters who introduced Diablo the sand creature, that spider monster which intentionally kills Mila's Squad, and the Dragon. We have a huge desert, spiders hate sunlight, Diablo patrolling the desert, and the goal is get to the tower. Other than that, we see Hunter's crew, they are great. They only have a few screen time. The final act seems to be choppy. You will see she is either in the new world or the real world, both trying to entertain us, but fails in execution wise. Action is great. Just don't expect it to be a job well done."}, {"id": 16, "text": "The movie is fun. Full of action. The plot is interesting, but not fully developed or resolved which could make people upset. But I just dont think there is a way, with the story line in the movie.I think acting wa fine. My girlfriend never heard of monster hunter and never plays video games, she like the movie.The main issue i can see is if you played the game and come to watch the movie with some sort of expectation"}, {"id": 17, "text": "The movie starts out fast with great action and doesn't let up. The CGI throughout looked absolutely stunning and the fact that the majority of the fight sequences involving monsters happened in broad daylight only speaks to how incredible the action and effects were. The action was fast-paced, the special effects excellent, and the story line was interesting. Certainly not a ton of depth to the characters and definitely not a deep plot, but this isn't the type of movie you see for the writing and awards it's going to receive. You see it because you're hoping to see some awesome action and great monster effects that are on par with Kong Skull Island or Godzilla King of the Monsters. And this movie definitely delivered! Can't wait to buy it on 4K Blu-ray when it comes out!"}, {"id": 18, "text": "Not worth your time!35 min in to the movie I was asking myself why am I watching this sh** Better install the game, play for an hour and uninstall it, than watching this.The producers and writers of this movie must of been drunk or something during the entire movie creation process."}, {"id": 19, "text": "I don't know what certain people expect - this is not the first movie Paul W.S. Anderson and Milla Jovovich made/produced together. Everybody who watched some of their work (Resident Evil franchise) knows what to expect - a pop-corn action explosion without too much care for story or plot or what people call character development. If you like that kind of movies, Monster Hunter will deliver, if you don't like that kind, just don't watch a movie that Anderson and Jovovich are involved with."}, {"id": 20, "text": "Dear Paul......WHY did you let doobie white ruin yet another video game movie, with his AWFUL AWFUL editing....if anyone in Hollywood reads this, DO NOT EMPLOY THIS EXCUSE OF AN EDITOR!!Kind regardsEVERYONE"}, {"id": 21, "text": "I saw Monster Hunter, starring Milla Jovovich-the Resident Evil movies, Dazed and Confused; Tony Jaa-Furious 7, the Ong Bak movies; Meagan Good-Prodigal Son_tv, Saw v and Ron Perlman-Fantastic Beasts and Where to Find Them, the Hellboy movies. This movie is based on the Capcom video game and is written &amp; directed by Paul W.S. Anderson-he is known for doing the Resident Evil movies and Mortal Kombat, among a few others. He didn't stray far from the plot formula of the Resident Evil movies, using Milla Jovovich fighting monsters-instead of zombies-in a movie that is based on a video game. Having said that, it is still a good and entertaining formula. Milla is the leader of a group of soldiers-Alpha team-that is looking for her missing Bravo teammates. It seems that Bravo just disappeared and Milla soon learns where they went, after Alpha travels through a wormhole that leads to another planet inhabited by giant monsters. Meagan is a fellow soldier in Alpha team. Tony is one of the first humans Milla runs into on the new planet and Ron shows up later. The CGI looks pretty good and the ending is a set up for at least one sequel-depending on how well this one does-so if you enjoyed the Resident Evil movies, you should like this one, too. After the end credits start, there is a scene involving a hooded figure and a cat. It's rated PG-13 for creature action and violence and has a running time of 1 hour &amp; 39 minutes. I enjoyed it enough that I would buy it on DVD."}, {"id": 22, "text": "'nough said. Just as most of other video game based movies."}, {"id": 23, "text": "CGI V.GOOD = 8 Story = 2 Characters build = 4 Main Arc = 3 Actors = 6 Music = 6 Script = 5 Monster Fight scenes = 5"}, {"id": 24, "text": "Not that bad!, kept my attention. Milla is still amazing in this genre of movies!!!!"}, {"id": 25, "text": "This movie was far more than i have ever expected! CGI was fantastic!! Monsters looked really good and the actors where really good. You can see alot of effort went in the visual part of the movie. The only thing that was really missing was a backstory to explain things. But I watched this in 4D and im still in shock of how good it was! This is a must see for CGI fans!"}, {"id": 26, "text": "If you like Fun Action Movies then you should go see this. If you are looking for riveting dialogue and conceptual depth of context, I am not sure why you would even go see any Monster movie. I mean there are very, very few, if any other King Kong 2005 3 hour movies. I know nothing of the video game, so I don't have that comparison or expectation roaming through my head and couldn't be disappointed on that side. You go to a movie like this for spectacular, impossible stunts, explosions and hopefully some decent CGI. It delivered on those items. The worse thing is that the very beginning dialogue seemed uninspiring, but picked up after that. This is definitely an origin movie, which aren't always the most riveting. I think that are totally think sequel, because they did eventually put together a team of Hunters that could be absolutely spectacular."}, {"id": 27, "text": "First of all the beginning was very promising. But later on it Just wasn't fun. The part with the spider things was not enjoyable and disgusting. The cgi was actually really good."}, {"id": 28, "text": "Monster Hunter is yet another weak and bland video game based film from a factory of crapy films made by Paul W,S. Anderson and of course that this film has a lot of bad staff in it.Action was very ugly looking and shaky cam was present here in some scenes which just ruined this film even more.Characters are empty and just so plain badly written and without any sign of arcs or development or even sign that they are actually humans cause based on acting i thought they were emotionless robots.Monster Hunter is another bad film and i hope that this crapy director stops making films cause he is awful in doing them"}, {"id": 29, "text": "Let's be realistic there are no movies in cinemas. Blockbusters have been delayed for months and the only one out TENET is in my opinion an expensive failure. Paul W.S. Anderson (the guy behind the Resident Evil movies) decides to release his new video game adaptation on MONSTER HUNTER. I am not a gaming fan but I really enjoyed the Resident Evil movies; specially the Final Chapter; one of the (or perhaps THE) best in the series.If you expecting gore and terror here you will be disappointed; this is big scale FX movie with some very well made and really terrifying monsters. Some scenes; specially the ones with the arachnids are really scary. Others like the DIABLO are quite good. The Dragon is fine but resembles to much to Games of Thrones.There is not much story to tell; a group of United Nations force got lost under a storm and transported to another dimensions inhabited but very hungry and very big monsters.The only survivor Milla Jovovich helps the very charismatic Tony Jaa to kill the monsters and escape. By the third act Ron Perlman also shows off and with Jaa still the movie.Milla is not bad (she is the directors other half), but her character is too two dimension. She displays as always her physicals fighting abilities but never get the charisma of Jaa or Perlman. In term of images; the movie is outstanding (nothing surprising considering what Anderson did with Resident Evil).The as always is open for a follow up which I expect to come.In brief lots of entertainment to relax your mind"}, {"id": 30, "text": "I played the game and it really resembles the game, I appreciate the looks of the weapons and their armors it very looks like in the game but in realistic way. The cgi is pretty good. There are tons of action in this film just what monster movies should have."}, {"id": 31, "text": "Screenplay leaves something to be desired but in general Monster Hunter is a good film for those who love fantasy. Great cast but it's amazing how Milla Jovovich manages to make really good action scenes. Congratulations"}, {"id": 32, "text": "I went and watched this with no knowledge about Monster Hunter. The beginning looked very promising. But then it got a bit worse, for example: I got introduced with a couple of American soldiers working for the U.N. They did not have proper introductions what so ever, even the main protagonist did not have one. All I knew was what their names were and that they went through the storm and after that got stuck into a world wanting to go home, eventually seeing them being killed shortly after they entered the world.I felt the story was a little bit all over the place. I found it hard to understand some parts since they were explained very little. The only thing I got was that Captain Artemis needed to get back home. The pacing wasn't really right as well. Some moments were really dragged out so long that it felt unneccesary. Like the fight with The Hunter. And then the interesting bits like destroying the tower at the end, got ended abruptly.But on the more positive side: the fighting scenes were really enjoyable and the CGI wasn't really that bad at all. I did feel wanting to see more of the world, but maybe that's for a sequel. Because the majority of this movie takes place in a desert environment."}, {"id": 33, "text": "Okay so lets start by saying this isnt the best movie but as action movie for the holidays its pretty good more of a summer film but this is a movie worth going to see its fun its fast its enjoyable and i recommend seeing it myself"}, {"id": 34, "text": "It knows what it is and doesn't try to be more than that. I can only assume the one stars are trolls review bombing another movie due to some woke twitter controversy. That, or there really are people who go to see a movie titled Monster Hunter expecting more than simple popcorn kino."}, {"id": 35, "text": "The movie delivers what we can expect it from. More monsters, Good CGIs. Good movie for monster lovers."}, {"id": 36, "text": "Action packed movie with a simple story progress. Easy to follow for any viewer, so sit back and enjoy the colorful flames, flying arrows, and ferocious monsters. The step-by-step method of telling the story actually made the movie feel like the Monster Hunter videogame; the roots of this movie. The characters had to perform tasks that allowed them to move on to the next challenge, building up towards battling the - in videogame language - final boss. The open ending (after credit scene!) hints to a sequel."}, {"id": 37, "text": "All i can say is best video game movie ever. thanks."}, {"id": 38, "text": "If your annoyed we haven't seen Godzilla vs kong or black widow yet this is the film for you. Action and cgi is a must see for monster fans but I also recommend this for people looking for a quality fun Hollywood ride that will definitely entertain you the whole way through!"}, {"id": 39, "text": "Many dislikes this movie becauce of that one dialogue knees... But it is good, CGI is good and tons of action every monster lovers should watch this. Some jokes are not hitting and they should move away from that jokes."}, {"id": 40, "text": "The movie is so good, cause my favorite actor is here (tonyy jaa) i love is, please make a sekuel/univers"}, {"id": 41, "text": "The worst intro no good back story. The story line is probably not important , because they don't focus on it. Good csgi and actors."}, {"id": 42, "text": "I think I had an epileptic shock watching this frantic for no reason editing. Stop editing films like this. The last few resident evils were bad enough. It's not effective only headache inducing. Stop it!!!!"}, {"id": 43, "text": "I am a huge fan of the franchise and have played the games with my husband and son on the DS and the Xbox! This to me made the video game so real and I was amazed by the movie! It was on point!"}, {"id": 44, "text": "Thank you Milla and Anderson for yet another fun and entertaining movie. My popcorn's all gobbled up. Movie's are baaack ya'll."}, {"id": 45, "text": "Don't expect a good story or something but it's fun to watch story bad acting bad some CGi are ok some are bad maybe MHW fans will like it way more than people who are not familiar with MH"}, {"id": 46, "text": "People are so uptight nowadays. The slightest thing offends them. Which ruins things like movies because it affects the casting AND the dialog/script. I won't say more just in case I offend someone's delicate racial being."}, {"id": 47, "text": "The best fantasy film of the year. I was afraid of what the script would be like, but I was surprised. Milla Jovovich as always looks magnificent especially in her action scenes. It was faithful to the original game and has everything to be a great franchise just like Resident Evil was. CGI is very well done. Note 9"}, {"id": 48, "text": "It is very hilarious for the director to choose a naive joke to entertain the public. Though the film is not that bad, but some metaphor is horrifying.The US soldier give the poor native asian-faces some chocolate as gift, this may insinuate that US soldier gave chocalate to Japanese after WWII, considering the MH is a Japanese game in the beginnning.Else, the 'kness' joke has a double satire, Chinese people and George Floyd. What a silly talented screenwriter....-what kind of knees are these? -I can't brea...theeee..."}, {"id": 49, "text": "This is totally a blaspheme to capcom games Milla ruined resident evil for years and now this franchise too Dear lord leave video games alone dont you ever try any movie based on them"}, {"id": 50, "text": "Movies adapted from video games never turn out good. However, this film is much different. Everyone plays their roles astoundingly well. T.I. stands out among all of them as being one of the best actors in the film. The film is a non-stop thrill ride that stays true to the video game. I wish a live action film was made much sooner but if this is the product of patiently waiting, I'm satisfied. I'm glad The Rock isn't in the film. This is a film he'd gladly take the lead in. Now, some of the CGI is a bit weak but the action is always in your face. I will definitely be watching this movie again. My brother and I are big fans of the video game so we're going to catch up this weekend and binge watch it. I don't expect this film to win several awards but I do hope it gets nominated. We are definitely ending 2020 on a high note."}, {"id": 51, "text": "Please don't destroy the image of the best game in our hearts. Please the director carefully consider shooting monster-themed movies. Don't always adapt other people's scripts. You may be able to get out of your own sky. Although the heroine is the director's wife, don't destroy the image of the goddess in our minds."}, {"id": 52, "text": "I love monster hunter games. well i enjoyed the movie too, the plot is decent, and the over all movie was amazing too, acting and cgi was good too."}, {"id": 53, "text": "Where to begin! Acting awful is the main thing that annoyed me. The music wasn't fitting and was cheesy! Dialog awful and characters were just flat/wooden!Far too much slow motion and Tony Jaa doesn't need slow-mo. Have they not seen what he can do? Yet again America can't do fight scenes. Leave martial arts to Indonesia or get Gareth Evans to direct it lol"}, {"id": 54, "text": "Monster Hunter-What else would you want out of a movie called Monster Hunter. it was a solid, action-packed movie with a straightforward plot that delivers exactly what was promised.My boyfriend, his roommate, and I thoroughly enjoyed the movie and it has us on the edge of our seats the whole time. It was a 7/10 movie but I'm giving it a 10 to balance out the rest of the bad reviews.Also, monsters were cool. The CGI wasn't bad."}, {"id": 55, "text": "This movie was really bad, the FX where good but a part from this and that military singing was dreadful.No giving this a 2 i played the game a few time, but the movie has nothing to do with the game at all."}, {"id": 56, "text": "How this garbage came to be is beyond me. They spend the entire budget on the monsters it seems and none on the surroundings and actors. Choise of actors and the acting itself was way sub par. Don't bother paying for it."}, {"id": 57, "text": "Whole story is poorly written and with no logic.review from a monster hunter series player"}, {"id": 58, "text": "I knew what I was in for watching the trailer. It's schlocky, has a paper-thin plot and mediocre acting at best. Going into it with these expectations, I can honestly say I had a good time?Yes, it's a terrible video game movie. You can't convince me anyone asked for this. Yes, Paul W. Anderson makes this to show off how pretty his wife is (I don't super blame him, Milla Jovovich is hella fit). Yes, I can imagine how people who like the game are going to be upset.Personally, I'm not super attached to the franchise. I'm also a fan of hating on terrible action movies like this. So yes, I had a good time. Don't pay to go see it in theatres, wait for it to wind up on a streaming platform or get it on Blu-Ray or something. It's /fine/ for a dumb movie with explosives.NOW. Spoiler territory:This movie feels like someone had three different movie ideas they kind of try to fit together. It starts as kind of a horror movie with the military, where all of them are picked off by the Diablos (big angry sand swimming horn monster) and Nerscylla (Scorpion/spider pricks that will haunt my nightmares), with some hints of body horror (said scorpion/spider pricks laying eggs inside people). Then it transitions to kind of a buddy cop thing where Artemis and the Hunter get to know each other and bond, and finally it becomes kind of a fantasy adventure when Ron Perlman swoops in. It's disjointed, but at least it keeps going. It didn't feel like it dragged... for the most part.I did not care for the fact they kept going back to the Nerscylla. Not only because I am very jumpy and every second with them on screen is spending time in jumpscare-central, mind you. At some point it felt very drawn out and kind of annoying to have to keep coming back to it. I get it. They're terrible gross monsters and we hate them and they're gross. Could we not instead have spent more time hunting other monsters?Downside number 2: there's only like... three monsters. Diablos, Nerscylla, and Rathalos. Now, I'm not super into Monster Hunter, but when I went into this I expected more monster hunting. It didn't really feel like that at all. The fights we get are nice and action packed, sure. I'm also of the opinion the monsters all look pretty good. No complaints on the CGI here. I just... kind of felt disappointed there wasn't more of them, and that we instead spent so much time with the Nerscylla.I don't want to spend too much time on the controversy. I'm sorry this was offensive to many, and I understand what was insensitive about it. I'm also sorry for the people who made the games for getting bashed for this though? Bash the movie, please! It's not very good and if you feel triggered or upset by it for whatever reason, voice that opinion! I just don't understand why an unrelated piece of media also needs to suffer just because it shares a name.Anyway, that's my two cents. It's a dumb movie; if you're aware of that going in, you'll be fine."}, {"id": 59, "text": "Remember the old Mortal Kombat movie? Yeah, that had more of a plot than this."}, {"id": 60, "text": "The movie have potential + mila killed it she is so amazing , some of the Scenes it was like WTF !!!"}, {"id": 61, "text": "Separate from the games, of which you defiantly need to play, this movie is just sad. Everything about it makes me sad. This is not a good movie. Do not watch it. Just play the game, or just watch someone play the game. This movie is sad, and has made me sad."}, {"id": 62, "text": "Jis Joy - #AsifAli again joining for a new movie after the success of #VijaySuperumPournamiyum... Script - Sanjay Bobby... Shoot from - 2021 Jan Last Release Plans - July 2021 theatre release... Distribution - Central Pictures..."}, {"id": 63, "text": "If you love fast and furious or the transformer movies, you will love Monster Hunter. No plot, but tons of mindless fun actions with huge monsters. It's really like going to theme park, you're in for that roller coaster ride."}, {"id": 64, "text": "It's Mila jovic job the ruin video games movie everytime ,my advice stay home and play monster hunter on your console"}, {"id": 65, "text": "Possibly the worst film of 2020. This film is so bad I considered walking out, but I stuck it out to the end...and the ending was the lamest part of the film! A poorly written script with very weak attempts at levity, plot holes and missing background storylines that could have made this more tolerable. It reminds me of a bad 80's film. A really, really, really bad 80's film."}, {"id": 66, "text": "Recism for Chinese. So it is a very worst movie.I really can't imagine blatant racism in this movie."}, {"id": 67, "text": "Out of any video game series that you could adapt for film, why would you choose Monster Hunter. There really isn't a story in monster hunter, I love the games but it boils down to, let's beat this T-Rex to death with a giant sword. Then I can make outfits for my cat slave. There is no way this is gonna be good. Paul WS Anderson is not a good director at all."}, {"id": 68, "text": "So this is actually the worst piece of garbage I've ever seen, and the worst part to me is there are still monster hunter fans legitimately defending it.So first off you never really even get a good look at the monster cause the editing is so jumpy and erratic and even when a shot lingers it's super zoomed in so you can't see the monster., so even people who are just going to see the monsters are gonna be disappointed.Second all the weapons are way to small except for maybe the bugstaff like the admiral has a switch axe and it's like the same height as him. Also he keeps doing this move with switchaxe that looks like the elemental discharge for charge blade where he slams the ground and a huge shockwave goes out. And every weapon just has the inexplicable ability to light itself on fire for no reason.Third every monster save for rathalos is essentially killed in one blow and even rathalos kinda. No cool fight choreography with the hunter dodging around the monster nothingthe proportions for monster are everywhere like we knew the main monsters were gonna be too big but they couldn't even get the scale on small monsters like cephalos right.Fourth they kill rathalos in the most generic kill a dragon way possible. You know that thing where dragons like have gas in there bodies so someone can just through like a firecracker in its mouth and the dragon explodes which is exactly what Artemis does.Miia jovovich's character is the biggest Mary Sue I've ever seen. I swear to god she trains for 1 maybe 2 days and ends up kicking way more monster butt than any of the actual hunter characters in the movie. None of the monster hunter universe characters really add anything to the story they are literally just there to pad runtime they could not be their and the movie would be essentially the same. Tony jaa just speaks jibberish the whole time and occasionally has a martial arts duel with Artemis so she can look cool. The handler does literally nothing, and the admiral just shows up punches Artemis in the face and takes em to the tower. The meowscular chef is also in the movie for like maybe 30 secs. There's no other palicoes either so enjoy him while he's there.And finally and this tics me off to no end gore magala is barely and I mean BARELY in the movie at the very end for one final scene where Artemis, Tony jaa, and the admiral all charge at it and the movie just cuts to the credits.Like wow it's one thing for a trailer to be misleading but the trailers for this movie were intentionally manipulative, and made to try and bait people into seeing this with false promises.Please for the love of god don't waste your money I sure glad I didn't."}, {"id": 69, "text": "Thats all i have to say ... u can scroll down now and read a well and more detailed review about this cash grab film atleast the monsters look like monsters."}, {"id": 70, "text": "As a monster hunter fan I'm disappointed but not surprised. The movie started out ok but killing off the squad so quickly and then dragging on for almost a good hour before getting to rathalos. Basically 3 monsters one that I didn't recognize but you also have diablos and 'greater' rathalos. Of course you have gore magala but they only show them for a good 30's that's it. The action in the movie seemed very short. Not great writing, acting wasn't all to good either. If you plan on going to see it just wait till it's on dvd to be honest or on a 3rd party website it's not worth your money."}, {"id": 71, "text": "Quite possibly the dumbest filth that has ever graced the screen. Paul Anderson should be ashamed of himself."}, {"id": 72, "text": "These movies are a total farce and a waste of time.."}, {"id": 73, "text": "Just when I thought it couldn't be more ridiculus, the next scene proved me wrong. Mother Nature was calling so fortunately it was my excuse to leave."}, {"id": 74, "text": "With the director and his film history, and the cast what did everyone expect lol trailer looks awful"}, {"id": 75, "text": "This movie is horrid as an adaptation of the games. The movie makes the world to be a survival of the fittest, no fun allowed setting when that's not Monster Hunter. The hunters don't kill to survive, they do it because it's fun and because they need to occasionally. Sure, there is the occasional threat of an elder dragon but it's still light hearted up until the climax. The movie.. is not that. It lacks the charm the games and even books have.Spoilers: At the end they bring in Gore Magala, one of my favorite monsters from the series. But only as a cliff hanger and no build up. In Monster Hunter 4, he's the main antagonist with what feels like a rivalry with the player. But in this, there's no build up, no fun, and no mention of the Frenzy Virus, GORE'S STAPLE. This film lacks humor, charm, and tries to tell a story that's Monster Hunter only in name."}, {"id": 76, "text": "Despite the monsters looking fantastic, the story is all over the place. Half the movie is milia fighting the captain for absolutely no reason. The story made no sense with going between worlds. They should have just done the Handlers story because her getting the hunter into trouble makes for a better movie than this."}, {"id": 77, "text": "Trailers always show the best of what a movie has to offer. Definitely the case with this one. The opening sequence set the tone for me. After that it was a disappointment. Not that the acting was bad though. It was entertaining with lots of action sequences, but the movie failed to answer a lot of who, what, why's. I wasn't familiar with the video game but it was at least a Friday night away from the house, even if for only a couple hours."}, {"id": 78, "text": "First movie in my 36 years I left before the end. 45 mins in. Literally the worst movie I have ever seen. I could write a long review on why it was this bad but I wont waste my time."}, {"id": 79, "text": "I would give 2/10 for the movie but 10000/10 for the company!"}, {"id": 80, "text": "I don't even need to see this to review it's horrendousness, this is ridiculous, get it together Hollywood!!! We're all quarantined and in this bs, it's your job to entertain us, and you're failing miserably."}, {"id": 81, "text": "Short and sweet, this movie was both a disappointment from the perspective of a fan to the Monster Hunter series and from the perspective of a brain-numbing popcorn flick. First off, it's as generic as you can get in any monster of sci-fi movie, except every sound effect and film shoot felt cheaper than usual. Aside from the CGI of the monsters, the movie looked almost stop-motion in how it constantly switched between shots and panned out between every scene. The effects with the lights were seizure inducing while every punch surprisingly had the generic bone crunching sound bite added to it. Unfortunately the backdrops and costumes looked poor and were shot in a sandbox for 90% of the movie, which was specially sad since the series is known for it's colorful and interesting armour/weapon designs. From a fan's perspective the intro was surprise culture shock to players and promised a different movie until it cut to the title scene and replaced with army soldiers. From that point on it was as by-the-book as you could get. (SPOILERS FURTHER ON) All the unique culture and world building from the games were ignored as the focus was put onto the director's wife surviving with a Hunter who is treated like a savage and insulted with blatant advertisement from Hersey's in a scene that uses the classic foreigner eats American food trope. All but one soldier is slaughtered in the first 20 minutes and any other characters from the game world aren't introduced until the last 20 minutes with no development. Only 3 momsters make their debut with some classic fauna shown in a few second scene later. The ending trashes the lore of a popular flagship monster Gore Magula and used as an obvious setup that begs film studios for a sequel. At the end of it, it was sad seeing another Capcom IP be poorly adapted and represented at its one shot in Hollywood. The film was so poor one can't even enjoy it as a summer monster movie without seeing through its paper-thin production quality sadly. There are better monster movies out there to watch."}, {"id": 82, "text": "Anyone that actually likes/appreciate the source material will literally vomit after seeing this movie. Forget the corny jokes, and how unnecessary the present day military angle is. The action scenes jump around far too much to be worth watching, and since there's really no story the action is all this movie could have had going for it. Instead we get a lore ignoring romp made for nothing less than to give Milla work.I feel that this whole movie was a truly wasted opportunity. This could have really been something special."}, {"id": 83, "text": "The movie glitched out in the theatre about 20 minutes in. Thank God it did because I was 21 minutes away from walking out. Very sad I spent money on this. Even sadder that it was made the way it was.Horrid dialogue and weird editing/directing clipped the wings of what could have been a great film.Oh well!"}, {"id": 84, "text": "IN A NUTSHELL: This action-adventure movie is based on the video game by Capcom. One of the cast members, T.I., said that it was his youngest son that convinced him to be in the movie because he is such a fan of the Capcom video games. I was curious to hear from real gamers what they thought about the movie and they all agreed the monsters looked awesome. They said the movie is pretty faithful to the original game with some fun fan-service, so that's a good endorsement!As far as the actual movie goes, the fantasy flick was written for the screen and directed by Paul W. S. Anderson. That's where the reviews start to head south. The plot is extremely thin, so if you want to just watch an action movie with lots of monsters and screaming, this one's for you. Movies based on video games have been notoriously terrible for some reason. This one will have big fans and haters.There's a joke early in the movie that has gotten this production into serious trouble with its release in China, resulting in its being banned. One of the characters says, What are my knees? What kind of knees are these? Chi-knees. Chinese audiences started posting terrible reviews on multiple platforms to damage the box office sales, accusing the movie of hurtful racism. Pushing their outrage further, the game Monster Hunter: World (2018) received thousands of negative reviews as well within 48 hours. Constantin Film later apologized for that scene, although it is still in the movie.Tip: Eat chocolate while you watch this movie. Just do it.TIPS FOR PARENTS: Lots of profanity People and monsters in perilous situations High body count with bloody, brutal deaths Tons of violenceTHEMES: All of us have our own unique weaknesses. Persistence Hope Teamwork Resourcefulness Self-relianceTHINGS I LIKED: The movie starts out with a bang...and a crash...and screams. In other words, there is no waiting around for something to happen. Lots of humor. I've always loved Milla Jovovich for her unique look and fierce action sequences. I was a little bit disappointed though because she mostly just yells in this movie. Don't get me wrong...she's full-on action. There just isn't very much dialogue. Really good CGI. The monsters look super scary. Some cool weapons. I hear that there are some accurate game mechanics that will please the video game fans. I heard that the director actually went to the game designers to see what they thought of the film and they gave him the thumbs up. If you're going to watch this movie, see it on the largest screen possible.THINGS I DIDN'T LIKE: The big plot? To survive. Seriously, that's it. Superfast, over-the-top action scenes that make it hard to see what's going on. Within a 10 second period, there are quite a few cuts which is super annoying. The movie mostly consists of fighting sound effects and screaming. Oh....and monsters. The singing...not that great. I would love to have seen more of Ron Pearlman. A bunch of characters emerge out of nowhere but we aren't told much about them, nor get to know any of them. The ending definitely hints at a sequel. Do we want that?You can see the rest of my review on my Movie Review Mom YouTube and website!"}, {"id": 85, "text": "Yeah, this movie is really dumb. But good lord, I can't recommend it enough. It is really unapologetically edgy at times, yet it does kinda capture the nature of the games to a certain degree. I found the modern setting to be lacking, since machine guns were not part of the style of Monster Hunter. From a subjective perspective, it's pretty good and it's a solid popcorn film for Monster Hunter fans.There is nothing good about the writing. The writing in this movie is so bad, that it moves literally all over the place and lots of stuff are introduced and you won't even know why they bothered. All the characters in this movie are likable, but they do the stupidest things and bring their team down to a laughable degree. Milla Jovovich's character switches personalities for some reason. She isn't afraid of gigantic monsters, yet she is literal plot armor when it comes to saving her crew. From a narrative perspective, it's hilariously bad.To sum it all up, Monster Hunter is a dumb movie with a lot of things to like from the games and plenty of action for fans of the games to enjoy. If that's all you really came for... well, this is the movie for you."}, {"id": 86, "text": "I was expecting this to be a run of the mill awful action film with one note performances, but surprisingly I was entertained, although I'd say not a great film, but in some ways it kind of knows that. The effects are pretty enjoyable, like almost similar to Jurassic Park. Mila Jovovich and Tony Jaa do play off each other quite well, and both are really at action. Ron Perlman is also good in his supporting role. I never played the game in which this is based, but i'm sure it's every bit has entertaining."}, {"id": 87, "text": "Monster Hunter is a new fantasy action film directed, written, and produced in part by Paul W.S. Anderson, the director of Resident Evil and Event Horizon.In the film, Captain Artemis (Milla Jovovich) and her military unit are transported to another world thanks to a strange storm. In this world they are attacked by dangerous, gigantic monsters, which they find difficult to stop with their military weapons. When Artemis meets the mysterious Hunter, she learns that every monster can be defeated in some way. Artemis decides to team up with Hunter to defeat the monsters and hopefully find a way back to her own world.Paul W.S. Anderson closed the film adaptations of the Resident Evil video game series in 2016. With this film he seems to have started a new video game series filming. Most video game adaptations turn out badly and are often more entertaining for those familiar with the video game the movie is based on. Unfortunately, this is also the case for this film, because the film lacks a real story and clear explanation of what exactly happened in the film. People familiar with the video game or playing it themselves can probably understand this movie a little better.Paul W.S. Anderson has put this film together with editor Doobie White in a messy way, just like he did with his last Resident Evil film. The film jumps from short, moving action scene to the next. This only makes the movie more difficult to follow and because the movie is in 3D this can lead to headaches for some people. They also use a lot of unnecessary slow motion effects, to convey the movie more exciting, but unfortunately the slow motion only makes the movie unnecessarily long-winded. The monsters in the film look good, but you can see that they were placed in the film with CGI, so they do not all come across as credible.The acting is not very prominent either, because no character gets a clear background story, structure or further development in the film. When a monster attacks the group and there are victims, you don't know exactly who they were."}, {"id": 88, "text": "Monster Hunter (2020)Sometimes I wonder, do the people responsible for making certain movies actually watch the final product before releasing it. In a year where good movies are getting delayed left and right, this abomination somehow made it to the big screen.Video Game adaptations have always been a struggle and this one brings back the memories of Mortal Kombat Annihilation, when people's brains melted from the amount of onscreen nonsense. I do understand that things don't have to be perfectly logic and we just got to accept the events as if it is a game. Unfortunately, this Garbagio doesn't have any common sense, flow or even sensible dialogue.As a matter of fact, you can recreate the movie yourself. Take half bucket of sand, throw in some rocks and aluminum cans, shake it violently while shouting and spinning in a circle, add some water and repeat the procedure. I made a mistake of thinking that at least the action might be good in the cinema but instead, I got two hours of grunts, nonsense and nauseating camera work. Please, don't make the same mistake.Movies.shmovies on Instagram"}, {"id": 89, "text": "____________________________________________________A -{ Mini }- Review . ____________________________________________________First and foremost : if you're someone who's -{ NOT }- into this kind of genre { Namely : 'Full Throttle action-films borne -( Entirely )- of pure fantasy type video games' } ...'at all'... then ( kindly ) move right along. Nothing. To. See. Here. PERIOD ⛔ . Conversely, if, ( like me ), you ~{ Aren't }~ too picky when it comes to the whole genre thing, 👉In-The-First-Place👈, and can kick back &amp; enjoy a ( Truly ) exciting film... ~{  As long it transports you to Another-Dimension 😉 for a little while  , or even just helps you get away from life's 'PETTY-LITTLE-PERPLEXITIES' for a little while, ( &amp; come away  Enthralled And Beaming 🔥  ) }~ ...then this review is  Especially  for you. Jump. Right. IN❗.Ok, so ~{ Even }~ in this unprecedented age of  Prolific Digital Super-realism  in -both- CGI ( computer generated imagery ), -as well as- SPFX ( special effects creation ) 'right across the modern cinematic board', so to speak..... to the point where it is most certainly starting to at least -( Seem )- as though we now, ( Very Sadly 😢 ), often find ourselves taking these two ~{  HUUUGELY❕ }~ labour intensive aspects of film production ~  Almost For Granted  ~ .....the veritable plethora of monsters featured in Monster Hunter have been brought to life by the filmmakers ( and, of course, their collective little ' Army ' of Animatronic Modellers, Digital Artists &amp; Effects Specialists ), with sheerly ~  STUNNING 🌠  ~ prowess. My heart well &amp; truly goes out to ~{ Every Single One }~ of you die hard fantasy -slash- monster flick aficionados, that is genuinely  Aching  to watch this picture on the  Big  screen ; but will more than likely be unable to do so, -( Completely )- on account of the Covid-19 Pandemic situation in your particular country -slash- region .In as much as the 'Mirth And Hilarity' Department is concerned, I can -unequivocally- assure you that this film not only has its 'fair share' of Laughs, but that they tend to show up in the most ~{ Unexpected }~ of places, &amp; often in the most ~{ Charming 😅 }~ of ways. And I say this....  Knowing as we -Now- do, ( for-a-fact ), that the bedrock of practically -Any- successful, fun, typical, big budget action-drenched blockbuster these days, lies in the said film's ability to -artfully- ( &amp; of course -tastefully- ), weave a hefty dose of that much needed thing known as ~{ HUMOUR ✅ }~ into the eager fabric of its otherwise ( almost -inevitably- ) 'relentless and frenetic' narrative arc  . And speaking ~{ Of }~ 'the funnies'... if you were to put a gun to my head &amp; said that I simply ~{ Had To }~ point out a 'glaring' weakness in Monster Hunter ; it would most certainly be the utterly ~{ Baffoonish 🤡 }~ look of the ( normally ) robust, often even  Majestic❕ looking Ron Perlman ( 'Admiral' ), who of course played the lead character in the very well received -( original )- Hellboy duology. Other than that I honestly cannot say that I had any really ~{  Serious  }~ qualms with the movie .Summary : The Fabulous Milla Jovovich 🌠 ~{ And }~ The ( Equally ) Fabulous Thai Martial-Arts Veteran Tony Jaa have truly performed their parts to perfection. But then again, I would've given this genuinely superb production a Solid score on the merits of its ( visually )  mind-numbing  Technical Success, ~{ ALONE }~ . 9.50 Glorious Marks out of 10 🚀 🔥❗."}, {"id": 90, "text": "I'll first start off by saying that I'm a big monster hunter fan. Monster hunter is directed by Paul W.S Anderson and stars Milla Jovovich as the leading role. Comparing this movie to his previous films it's clear that it's actually miles better.(which isn't a hard thing to do considering how bad his previous movies have been) Yes, he still can't hold a shot for more than 2 seconds and overuses shaky cam. But it's a big improvement over his previous movie: Resident Evil: the final chapter.(which I couldn't even finish watching because of the way it was edited) Overall this movie is alright, really it's nothing special. But as a Monster Hunter fan I loved it. This is due to the nature of the games and story, which the game doesn't really have. So it's quite interesting to see how he manages to fill in the story of which is sparsely shown in the monster hunter games. What I loved is the amount of fan service the movie had which I do not want to spoil. From re-creating shots from cutscenes of the games to having a couple of well know things that are in the game, it brought a smile to my face. Now let's discuss the elephant in the room: the US military. I feel like this part of the movie is not even that bad, and it doesn't take long before they get rid of the military aspect of the movie and go full on monster hunter. I did feel like the movie really grazed over any development of any characters which makes them really disposable. The rest of the movie has some alright action scenes with many great visuals. (considering the 60 Million budget) I was really surprised by the visuals and locations. They actually look real and are by far the best part of it. Also the creatures are really accurate to the games and move and sound just like them! My biggest gripe with this movie is the climax, or lack of one. The movie doesn't really feel like it can stand on it's own and is my biggest gripe with it.SPOILERS WILL FOLLOW!So after they defeat Rathalos in the movie, a Gore Magala shows up and they start a big battle.(which is built up as a finale) But then the movie just ends!? I am absolutely mind boggled to why they would make a choice like that. The movie lacks any closure or any final feeling act. I can't imagine that any director would be satisfied with an ending like this.So please go into the movie knowing that the Rathalos fight is the finale and set your expectations to that. Anyway....So if you just want to see some awesome creature designs and some decent fights. this movie is for you!As a normal movie i would rate this a 4/10 But as a monster hunter fan i would rate it a 7/10 Which is why i am rating it a 6/10,because for me it was above average.(And a masterpiece for Paul W.S Anderson standards) Thank you for reading, and Happy Hunting!"}, {"id": 91, "text": "Big movie versions of popular games remain a difficult genre, given that it is still impossible to interactively draw the audience into a story in ways that a game can, but it hasn't stopped Hollywood from trying. Despite a relatively consistent lack of artistic recognition, the prospect of game fans forming a large paying audience for the movie adaptation is simply to hard to resist.I guess you could call Paul W. Anderson somewhat of an expert in the field, since he was the one to bring Mortal Kombat, Resident Evil and Alien vs Predator to the big screen. Yes, I know, AvP was more of a movie franchise crossover (but in all fairness, it was a game franchise long before it became a movie). And yes, there was and still is a lot of hate for what Anderson has done, even though some of his adaptations are about the only ones that have been financially successful (and thus must have their fair share of fans).I'm in two minds about his work: I can enjoy Mortal Kombat as an amusing special-effect-camp B-movie, and for the same reasons, I appreciate especially some of his later Resident Evil movies (the first two remain bad in my opinion); I was okay with the forgettable Soldier, Death Race, The Three Musketeers and Pompeii. Event Horizon and AvP really got panned by critics and audiences alike at the time, even though I really liked them, but both currently enjoy a surprising amount of cult success. Nevertheless, I recognize the weaknesses in Anderson's movies: he can film some decent action scenes, but he isn't the best writer of stories or dialogues. Nor does he have a nose for acting talent: the casting and direction of his (usually cheap and mediocre) actors often provides ample targets for ridicule (yes, that's you, Kiefer Sutherland ridiculously trying to emulate Jeremy Irons in Pompeii).So I went into Monster Hunter with the expectation of another forgettable creature feature with some amusing action sequences at best. But to my pleasant surprise, this is one of his best efforts at writing and filming, because for once he doesn't waste a lot of time with nonsensical plot developments, contrived character depth and forced laughs. In fact, he keeps the plot pleasantly basic, with a team being dragged into a parallel world full of dangers, and not much else in the form of unnecessary plot embellishments.Some find the story seriously lacking but I wasn't bothered by it at all, since it basically unfolds automatically as Milla Jovovich (aka Mrs Anderson) takes us on an adventurous journey of exploration of this strange world, where the danger can come from both monsters and its human inhabitants. No endless clunky expository dialogue, no scenery-chewing villains who are endlessly monologuing; just show, don't tell: we get dropped into the action and have to learn the rules as we go. Sure, it's still a basic pulp novella (or game script) where stock characters are as easily introduced as they are dispatched as moster bait, most of the characters chase MacGuffins that get a minimum of explanation, and the ending has more sequel hooks than your average super hero or slasher franchise, but I wasn't bored for a second. The cinematography of the locations also looks breathtaking, making me often wonder where such places can be found on Earth.What little plot there is forms enough scaffolding for a lot of action that looks surprisingly convincing, given the amount of CGI that was undoubtedly necessary to bring the huge monsters to life (and appropriately yucky, considering that it received the highest rating in many countries). Don't put too much faith in reviews that say that the effects look fake, and that the action scenes are blurry due to a lot of shaky cam and choppy editing. There is a lot of kinetic action, big monster brawls as well as some martial arts (no surprise with Tony Jaa in the cast), but in all of them, I had a reasonable overview of what happened. There is not a lot of dialogue, so the cast doesn't have to rely on clunky lines. Jovovich impresses with a lot of stunt work that (I assume) must have left her bruised and battered, and gives a decent performance for a change (but she is like a female Schwarzenegger for me; I'm never really bothered by her lack of acting skills).This all results in a movie that is spectacular and even tense at times, with some well-planned action scenes and even some black humor rather than the cringeworthy comic relief from some of Anderson's previous movies. For those who like big-budget sci-fi pulp such as Stargate and John Carter, I can highly recommend watching this on the big screen. Especially with 4DX."}, {"id": 92, "text": "REVIEW - MONSTER HUNTEREXCLUSIVE!Release date sometime 2021!Based on a video game but the only problem with this is that recently a few films have been made based on video games and these have turned out to be quite bad.Is this as bad?Imagine Starship Troopers, Tremmors and Jurrasic Park on steroids with constant none stop action and you may come close to this.As with many films the release date was put back and has (even before release) has caused controversy because of a Chi Knees joke at the start but....A troop of United Nations soldiers get pulled through a portal onto a distant would ruled by really big monsters, after the troop is killed early in the film a lone surviver with the help of (no spoilers) start to fight back in an attempt to return back through the portal home.Monster movie fans will love this, don't expect a complicated story or deep meaningful dialogue just simply see this for the sheer action from start to finish.Rating 10 out of 10"}, {"id": 93, "text": "5 out of 5 stars.Monster Hunter is an awesome action monster film and a video game adaptation brought to the big screen. I barely played the game series. But know a little about it. Sure, the game to movie adaptation may have some differences and similarities. Like a character named Artemis (Milla Jovovich) who tries to build her weaponry and armory to fight back against the monsters in that world. Also there are some pretty awesome monsters brought from the games. And a few characters like another group of hunters travelling on a ship. And a fun one thats cat like thats in it for a brief moment.The plot is simple and great for an adaptation. Artemis and her military team mysteriously disappear when they run into a storm that set nearby rune markers. That tranported them to a monstrous world. Where they get hunted. Artemis comes across another hunter (Tony Jaa). Which they bond and become a fighting duo. Trying to cross a desert landscape. Trying to reach a tower which may be a portal back to Artemis world. While she comes across new characters and a couple of deadly monsters.The cast ensemble did great. Milla Jovovich is an awesome actress. And action star. Tony Jaa did a great job as well. Ron Perlman did a good job as another character on that planet.It is an awesome action film. Don't expect a development. Just sit back and enjoy the non stop loud and big action sequences. Director/writer Paul W. S. Anderson did a great job in delivering another video game franchise into a movie. He sure can set up an intense action sequences and never stop. The visual effects and creature design is awesome. The music score by Paul Haslinger did a great job. Making it a fun adventure. I loved Paul Andersons films and his Resident Evil films. He can create an exciting action packed film. Monster Hunter is another step up. It is big, action packed throughout, and does have a cliffhanger ending for a sequel while opening up the doors with the story to where it can go. There is a brief mid credit scene that hints on what is to come."}, {"id": 94, "text": "Well this is a surprise! I went to the cinema not sure what to expect and I left it truly amazed. Don't listen to the negative reviews .. they are the same bots who go around complaining about every movie on this platform.I would divide this movie into 4 chapters; the weakest had to be the second one, where there is a certain fighting scene that drags on forever and for no apparent reason. The first chapter impressed me in terms of visuals, the nest design specifically was unique and gave me the creeps. The 3rd chapter was interesting and it introduced a character that was there for the comedy factor of it, leading to the 4th that hinted majorly to a sequel.Monsters design was good and the acting as well, the movie kept me interested and invested from start to end and above all I was super happy to see Milla back on screen! Action movies fit her perfectly."}, {"id": 95, "text": "This is a niche movie that fails to appeal to the mainstream audience and monster hunter players alike. The story would still be just as good/bad if random scenes in the movie were swapped around. There lacked any continuity and impact between basically anything. Cgi and monsters were decent, but that's probably about it. For hardcore monster hunter fans the weapons and combat were god awful as if they maybe watched a trailer for the game at most without really understanding what the combat is like. There were multiple attacks that straight up don't exist in the games but would have been very simple to substitute with ones that did, it just felt lazy. Overall no redeeming qualities other than well animated monsters, but even then there weren't very many. Also one of the monsters in the trailer showed up for like 5 seconds and they were clearly just baiting us but too lazy to give it a proper scene. Casting was decent except for the admiral, he wasn't very admiral like. Unfortunately a lot of the cast didn't get much screen time at all.The two short quests added to the game as promo for this movie had a better story in its few minutes than this entire movie did in a couple hours. My expectations were extremely low but somehow were still not even close to met."}, {"id": 96, "text": "This is probably Mila's worst movie. She cant happen to find one decent script no matter what she does. First of: The logic: Marines shoot first and ask later. They act like dump lunatics. Nothing they do make sense, its like watching a horror movie and one guy says he is checking the basement and you are like Oh god, ok he is dead next!. They are in no threat but as soon as some stranger appears on the top of a cliff, they start yelling ENEMY! and start shooting! Like why? What is wrong with you? Mila has to yell ceasefire multiple time until those lunatics stop shooting for no reason.Dialog: They are talking out what you as spectator are thinking, which is utterly annoying and lets you think they make everything as if even a 10 year old needs to understand what is going on right now. She is asking:What is this thing? Obviously nobody knowing an answer to that. Someone saying out loud:What happened to them? Nobody obviously knowing an answer to that.Camera cuts: You know they had to fake action scenes when there are a lot of cuts and this movie has thousand of cuts. They do that when the actors dont have the physical ability to perform in the action scenes believable. So they do a lot of cuts so they can cut out the parts where you see their performance is not meeting the performance a soldier or marine should have in that situation. Its a mess and it hurts your eye. You cant follow propery. You feel like being in a club with an stroboscope. Timeline: 30minutes in the movie and the plot can be written down on one page A6 letter. Nothing, no story, no plot really, just brainless action, like a splatter movie where the victim runs from a to bo to c just to escape the killer and you have no idea why and whats going on."}, {"id": 97, "text": "Slipping in between the streaming lineup is a small number of films hoping to get a glimpse of some attention to the theaters. Whether these movies stand a chance or are merely scraps being thrown into the fray, one can never tell in this day and age. Nevertheless, a friend of mine and I dived into the theaters in hopes of finding some magic with tonight's feature in hopes of some glimmer of entertainment, and even more surprise. What did we see in this latest video game series turned movie? Well as always read on to find out as I review:Movie: Monster Hunter (2020)Director: Paul W.S. Anderson Writers: Paul W.S. Anderson, Kaname Fujioka (video game series) Stars: Milla Jovovich, Tony Jaa, T.I. LIKES:Fast Pace The Monsters Are Brought To Life Some Movie Reference Nods Some well time humor A few Fight Scenes were impressive The CatDISLIKES:No Character Development Don't Be An Extra Monsters Need More Variety No Story Skips Much Of the Impressive Setting they Could have Built No need For Big Names Action Scenes a Bit Boring and Lacking Cohesion The Ending for potential sequelSUMMARY:Like a video game in the hands of the modern day audience seldom want little introduction or slow paced stages to open up with. Fortunately, this movie jumps right into the action, taking little time to really introduce anything before the big bad monsters rear their ugly faces. Upon their appearance, the creatures look like a decent match to the video game counterparts, only with a little more coif to their looks thanks to a bigger budget and screen. The Diablos is big, bulky, and daunting in its task to hunt, while the creepy bugs hiding below hold nightmarish creep levels that those with a phobia may be squirming in their seats. Though not the most realistic looking beasts to ever appear on screen, the movie does a nice job of using movie techniques to help amplify the scenes, with nods to Alien, Jaws, Tremors, and some Japanese samurai movies for film lovers to appreciate in their new uses (like I did). Amidst all this movie magic and creature development, the movie manages to find some breaks to allow humor, often in the form of trying to bridge language gaps, some funny insults, and even some unintentional funny moments that made it into the final cut. The famous cat cook warriors are part of the awesome factor in this movie, and are done well as they cook, intimidate, and show off their teeth at the adventures to come. I had wished for more of their appearance, but hey they have to leave something for the potential next movie. As for the action that was promised some of the fights are fitting of the promise though take that with a grain of salt. Beast vs. man fights had some shining moments, but were often one sided bouts with little atmosphere other than destructive carnage. However, a few fights between humans had the choreography that I absolutely loved to watch and was hoping would be superimposed with the rest of the fights, but again they may be working on that in the near future.Unfortunately the spectacles are pretty much the meat of the movie and even that is being generous. Monster Hunter, much like the games, has little in terms of plot and development of characters, with even Jovovich (the main character) having little in terms of background info, goals, or depth to her action packed role. Tony jaa's signature hunter look has the spirit of the game, but his interactions and tragic past are summed up in one line, but at least better than much of the included cast in the movie. I can say that if you were a secondary character or extra, you did not get much screen time in this movie, for big names Like T.I, Ron Perlman, and several other well-known actors did little in this movie and were almost pointless to be included. The story is pretty absent as well, with little in the way of significant goals, details, or even lore set up to put a point to the chaotic action that is about to unfold for nearly two hours. As for the fight scenes, while some of them work and have some excitement to it, much of these big budget bloated battles have little in the way of pizazz or suspense, at least for me and my buddy. Quick displays of one sided destruction, often end with a quick fix that ironically moves in slow motion that would make Zack Snyder proud. They lack cohesion, and without any explanation are humorous at how useless modern technology is, but archaic weapons that should be hard to swing can deal more damage. In addition, though the creatures are impressive and certainly feel like the imposing behemoths they are supposed to be, but the variety of the creatures we've seen in the games could have been put out in more style in this New World. The exotic sea dragons, the giant bird and snake like creatures, or even more variety of dragon like monsters were all possible choices that could have roared, torn, and challenged our team in new ways, or you know at least made a good ecosystem. The world of Monster Hunter is a living organism in the games, just as deadly as the creatures that inhabit it, but the director's cut corners on this and led to a small montage of passing overheads and simplistic settings to get the job done. All in all, the movie just really did not put its best foot forward to make the world of Monster Hunter come to life, but rather make a cost saving hybrid that lacked the cohesiveness I was hoping for.Overall, Monster Hunter may not be a game with the deepest story or the most unique flavor of style, but the games certainly have a lot more pizazz than this iteration shows. Movie wise there was some potential in this fast paced feature, with creatures showing potential to be truly marvelous beasts, some nods to classic cinema, and a few good references and jokes. Yet, all the splendor of the monster slaying world is lost in the cuts made for this movie. No impressive environments and ecological systems that feel alive, but static pieces that though deadly are devoid of the same energy the game had. Action scenes are a mixed bag of tricks with little suspense, creativity, or similarities to the fights of the games which is just sad given the mess they made. As for the worst part, it's the story and character usage that is awful, with most being not worth the trouble of including in this movie. From my experience, this movie is best meant for home despite the spectacle that they have created. My scores for this film are:Action/Adventure/Fantasy: 4.0 Movie Overall: 3.0"}, {"id": 98, "text": "This movie had so much potential and it was completely wasted. To land such a talent like Tony Jaa and Milla Jovovich and completely squander them on a half baked story is utterly disappointing.Coming from the stand point of a Monster Hunter fan who has been playing the series for about 10 years now, this is not the movie the series deserved. It should have been set in the Monster Hunter world to begin with, and stayed there. This whole, our world comes into their world and visa versa is not necessary. All the elements for making a good Monster Hunter movie were right there, they just weren't utilized.The CGI in the movie was pretty good and the monsters looked great, but that doesn't save the movie.Hopefully if we do get a sequel they will approve on some things and make it a little more palatable for fans and newcomers alike."}], "reviews_amount": 99}