{"name": "House of the Witch", "titleId": "tt06988208", "reviews": [{"id": 0, "text": "Christ almighty this was terrible. Unoriginal plot, cringe-worthy acting (I can usually tolerate mediocre acting but this was real bad), typical idiot stereotypical teenagers making idiotic choices.I watched it all the way through just to be thorough but god do I regret that.Whoever voted this a 10/10 I want to know what you're smoking."}, {"id": 1, "text": "With a title like this, I hoped it would be another Blair Witch. It was not. The script is banal, the actors likable but characters dumb. Just another teen fright-fest that could've been so much better. Not scary at all. The CGI effects are cheap, which gives the entire film a cheap look. The house they used is not creepy at all. They certainly could have picked an older house. The first boy to disappear is never found or explained, so I was disappointed. There are a few other things at the end that weren't explained. No EMTs even though they found a couple of bodies? We've seen it all done better. Why doesn't Syfy spend a little more money on a script, a better director and go for decent acting at least."}, {"id": 2, "text": "Horror buff here. In a relative sense, a score of 5.2 with over 1400 votes would suggest horror gold. This movie is not horror gold. It is not a diamond in the rough. It is terrible. Not scary - at all. Terrible acting. Terrible F/X. I am not sure how this title garnered a respectable score here. Don't waste your time with this movie unless you are a cognitively challenged 13 year old girl. Believe me, this is coming from someone who judges horror on a completely separate metric, and in general I'm usually much more forgiving, score wise (any intriguing horror movie that keeps my attention and spooks me out deserves at least a 6 or 7, baseline). This movie is barely a 3.If you want under-recognized (but NOT underrated critically) horror gold watch the remake of the crazies. What a flick!!"}, {"id": 3, "text": "I saw the title of this film and kind of got my hopes up especially since I was watching it on Halloween 🎃. When I saw it was a Sy-fy Channel production I probably should have known better. No offense towards them but they aren't really known for their Oscar winning horror movies 🎥. The plot starts off simple enough with a kid named Charlie being dared to remove the address numbers off an old, supposedly haunted house by a girl. When he tries to do so he ends up being sucked up inside the doorway 🚪 and lost forever (Never mind the girl knew where he was, what he was doing and his bike was still there a year later!). Like I said a year later on Halloween a group of teenagers decides to spend the night in the old house because it's supposed to be haunted by a witch. Well slowly chaos ensues and the idiotic teenagers get picked off one by one by a very poor CGI ghost 👻 of the witch in very ridiculous manners. You've seen it all before in cheesy B-rated movies. The inept police finally find one body of the teenagers (who's been underwater for hours) and somehow magically (remember magically) revive her with CPR. They then send her home with a deputy. Soon they recover another body and discover it's the same girl with her heart ripped out! Uh-Oh!, they think. Switch scenes to the deputy's car where we find him dead 💀 and the back door to his police car 🚔 open. We see the newly possessed teenage girl (by the witch) covering herself in a gray blanket now walking down the road. And that's how this genius of a movie ends. I can't believe I watched the whole thing on Halloween 👹when there are so many better scary movies out there."}, {"id": 4, "text": "This film was so predictable, it was like I wrote the script. Very slow, very boring and an absolute yawn-fest. Save yourself an hour and a half and go for a walk, instead."}, {"id": 5, "text": "There's no way this has a collective 5.2 rating. Horrible plot, dull acting and no scares. Hard pass."}, {"id": 6, "text": "Got through the first 35 minutes of the movie. It was so bad that I was literally rooting for the witch to just kill off all of the cast members. I'm almost positive the directors had a plot going and then gave up and started winging it."}, {"id": 7, "text": "Terrible movie. Bad acting, boring predictable plot. Decent CGI. Definitely not scary. Save yourself some time and avoid this movie"}, {"id": 8, "text": "My friends and I wasted an hour and 30 minutes watching this trash of a movie. It was dumb from the beginning, all the way to the end. The actors were terrible, and the effects couldn't even fool a child. If I could give it a 0 I would. You're better off watching CareBears, it's wayyyyy scarier than this."}, {"id": 9, "text": "I'm generally not very critical of these types of horror movies. I'll forgive overacting and predictable plot-lines so long as its entertaining, but I kept spacing out while watching this one. The basic premise of the movie is kinda cool imo but the writing just kinda sucked, the dialogue was cheesy, and that last scene seemed to drag on forever."}, {"id": 10, "text": "There's nothing coherent going on in this movie. Some teens sneak into an old house, and then for some reason an evil witch spends an hour scaring them with a bunch of random cliches pulled out of other horror movies before killing them one by one. There's a spider-walk sequence straight out of the famous deleted scene from the Exorcist, an escape scene copied from the end of the Descent, and a scene with a bunch of tree tentacles pulled from the Evil Dead. And all of it is directed so poorly that none of the scares land for even a second.Especially egregious was the final scene where they chose to play audio clips of clues the characters gave throughout the movie over and over again, I guess to be sure they beat it into our heads what exactly happened. The clips were blatantly obvious, and I don't think most people would have needed help to figure out the ending, which was yet again another cliche.I like horror movies, and this was easily the most pointless, random and poorly made one that I've seen in quite a while."}, {"id": 11, "text": "The acting, dialogue, and special effects are absolutely atrocious. The character, Taylor, might be about the most annoying character in any show, and her one-liners make me cringe. The story is dumb and makes no sense. I'm pretty sure the ending was nearly impossible. But for some strange reason I kinda liked it. It was one of those so bad it's good kind of films. I'd probably never watch it again, but it was kind of fun while it lasted. But don't go into this expecting any sort of quality."}, {"id": 12, "text": "Had hopes for this movie but sadly the stupidity factor stepped in. Why is it that all horror writers believe that everyone is an idiot? If just one horror movie could have an intelligent person in the story I would enjoy it (and rate higher)."}, {"id": 13, "text": "It's a bunch of teens but there's no story... They go to a house. The dialogue is terrible. Skip this and watch something with a story. Special effects were like early 2000s PowerPoint level technology aka worse than bad."}, {"id": 14, "text": "Stupid and unrealistic movie for teenagers. Kids walking around with their cell phones for flashlights?I don't know who was more unprepared for this adventure to Disney World. The kids or me fast forwarding thru the film to ease the pain."}, {"id": 15, "text": "A group of teens/near teens go party in the local haunted house at Halloween time. Lana (Emily Bader) and Shane (Darren Mann) are the only characters introduced which sets them up as last to go. They get trapped in the house, even with the door hinges on the inside. Here we get the back story, such as it was, of the witch. There are a number of cliche things that happen, such as eerie photos, old phonograph playing by itself etc. They really didn't develop anything that well into the tale...i.e. script written in haste. 616 was the house number and was the older number for the beast in Revelation. It also adds up to 13. This is a made for TV tale with near swearing. The quality of the film was good, the plot was basic. This is a decent horror film for kids/teens. Seasoned horror viewers might want to look elsewhere."}, {"id": 16, "text": "I have no idea how this has the rating it has. This movie is awful. The acting is abysmal. I couldn't contain my laughter during the scary parts. I've seen Disney Halloween specials scarier than this."}, {"id": 17, "text": "I mean like what?? At least find a house to film in where there aren't windows, that aren't boarded up, above the front doors! Lazy scouting..."}, {"id": 18, "text": "The movie in general was pretty creepy, the effects worked fairly well, and I definitely jumped a few times. But all of this is greatly eclipsed by the complete and utter idiocy of these people. They split up on multiple occasions and are then confused as to why they can't find people, spend the whole movie wandering around the house with no clue what to do, ask people to makes phone calls after the tenth declaration that's there's no service, and in general are just stupid. The script is terrible. The storyline has no point and no flow. Just a bad movie all around."}, {"id": 19, "text": "Please dont watch this movie. The script copy and pasted lines and characters who were feet apart acted like they were blind and always confused about what the character next to them was doing. I heard what did you do like 4 times, and every time it was unnecessary. I love cheesy horror. This was awful. Scored 2 because it was technically a movie and also had characters. The script writer needs to take a class, please."}, {"id": 20, "text": "Bad acting, bad effects, got distracted and stopped watching several times...no real plot.But it is filled with Halloween and some scary parts.Worth watching once, on Halloween."}, {"id": 21, "text": "Who'd they pay to get it to say 5/10 stars on the main page? imdb, or reviewers... there's NO way that's real. after watching it and reading the other reviews on here, the studio did that somehow... no way honest reviews would lead to anything more than a 2."}, {"id": 22, "text": "This one was pretty bad. Don't let the artwork for this movie fool you like it did my wife and I. We love scary movies but this was a waste of time honestly."}, {"id": 23, "text": "Can't have too high of expectations when dealing with a Marvista Production who is the main producer for Lifetime original movies. But this movie was entertaining enough. The last 10 minutes, the editing team did a great job. I was very impressed. Overall....it was worth a watch one time."}, {"id": 24, "text": "Looking for a place to party, a group of friends in a small-town searching for a Halloween party in an abandoned house finds the house occupied by a bloodthirsty witch intent on preying upon them for trespassing in her home and forcing them to find a way to escape.This here wasn't that bad of an effort. One of the finer points here is the fact that this one takes advantage of the house which really looks quite eerie throughout here. The abandoned house is run through pretty much the entire list of clichés needed for a creepy, abandoned house and yet it still works here with the elaborate architecture, twisted design and generally playing around with reality that sets this one up for an extremely enjoyable first half. This does allow plenty of really enjoyable scenes here of the group wandering through the house with plenty of events not supposed to be happening occurring, from the photographs switching into more demonic visages, the growing facial disfigurement that one character experiences and all the different wandering around the house that causes them to come into contact with the witch in the different rooms. Once the action picks up with the ghost out tormenting the group, the action and intensity pick up to a considerable degree and the ferocity of the attacks makes for a great time overall with the finger gag in the mirror, the attack in the kitchen with the leftover food and the stand-out scenes down in the basement where her captives are being tortured and the exploits to free them give this some gruesome sequences. Likewise, the conditions she leaves her victims in, with boils on their face or wrinkled skin to the point of ripping upon contact give this an incredibly brutal edge which is quite surprising in the type of context shown here where it's all about the context of the release since this one is a rather gruesome tone that's really appreciated here. Coupled with some great revelations to be had in the finale for the witch's history and a creepy look for the central witch, this one really has a lot to like overall. It does have a few minor flaws here, which mostly comes from the CGI look to witch moving through the house that goes against the practical work featured elsewhere here. This is troubling since the practical work was a ton of fun and really sold the gruesomeness of this one, so to move it out for the lame CGI is a little troubling. The other issue is the somewhat troublesome inclusion of the hunt for the kids that gets employed in the final half which slows down the film at the wrong moment and doesn't really add much to the film interrupting it like it does. It does lower this one somewhat, but not enough to really hurt this one.Rated Unrated/R: Graphic Violence, Language and some sexual antics."}, {"id": 25, "text": "It's really upsetting to read the reviews of this movie because I really don't understand why they are saying such things, I just took some time for myself at last to watch a movie this afternoon and I chose this one I am so glad I did, it was gripping from the second it started and I can't believe how fast the movie flew I was enjoying it that much, it was intense and creepy and the acting was excellent. I hope the cast do not read any of these because honestly they did an absolutely outstanding job and I had a wonderful afternoon thanks to them. What a clever brillaint story.....maybe the issue is you need to have a open mind to enjoy stuff these days? Loved it thank you."}, {"id": 26, "text": "I have seen some baaaad movies in my time but this takes pathetic to a new level. It isn't even so bad that it ends up being good e.g. Motel Hell. The acting, plot, special effects, cinematography are a joke. If I could have rated it at zero stars I would have. Do not waste your time."}, {"id": 27, "text": "This movie had a spotty plot throughout, making split decisions out of nowhere that don't really seem to line up with context. On the other hand, some lines were beyond expected, which really ruined the suspense that they could've built up. The directors used every excuse while writing a movie about a Witch to use every type of special effects makeup on the actors. Everything. Horrible aged makeup, sores on another, finger nails being ripped from fake hands. The 'ominous' mist throughout reminded me of Twitches, which isn't a compliment. This movie was cheesier than anticipated, thus the worst of classic horror movies would look better than this."}, {"id": 28, "text": "It is a teen horror movie, you expect predictable! It is what they do with that predictably that counts. This one uses some imagination in the story, gives you a few good scares, tight direction and pretty decent acting from a young cast. If you start one of these and complain about it being predictable you shouldn't start it it in the first place and you have nothing to gripe about. Overall it was way ahead of 70% of those in this genre and that alone is worth a 7 in my book."}, {"id": 29, "text": "This is a TV movie that other TV movies would make fun of. They're high school kids, or college kids? They grew up together , yet the main girl hasn't lived there since she was 6? There's a seemingly pointless opening scene with 3 kids which has nothing to do with the film, and the actors could not have been more awful. The special effects are certainly NOT special. The most horrifying thing about this film is that someone thought it was a good idea to make it. And who tf is Carl? Don't watch, don't watch, don't watch!!! You will hate yourself and curse your eyes! Save your time and go pick your nose in the mirror, it will certainly be more entertaining!"}, {"id": 30, "text": "Usual plot and scare methods. Seen it all before but it's an ok watch to fill time."}, {"id": 31, "text": "Only watch this if you're doing research on horror cliches, or if, for some other reason, you need an example of why it's so easy to mock and parody the genre."}, {"id": 32, "text": "Wow this is bad. I am a big horror fan/ movie fan in general and even if a film is bad ill watch all the through and I also I dont like reviewing films if havnt given it a chanceBut... this was so uninteresting from the start, crap characters/personalities, terrible affects, typical cliche cheesy stupid teens who make dumb jokes and have acting skills similar to burnt toast and I just could not make it past 30 mins without yawns. So I looked up what the reviews are and went oooh that makes sense, it's not just me. let's not torture myself any longer. Highly wouldn't reccomend, even if its on Netflix for free."}, {"id": 33, "text": "Nothing new we haven't seen too many times already."}, {"id": 34, "text": "The usual plot of teens going to the local haunted house, even though their parents have warned them to stay away. It all goes belly up, they get knocked off one by one in the usual grisly fashion............................etc etc...........Unoriginal story, unexceptional acting. Don't waste your time with this one."}, {"id": 35, "text": "Terrible story, badly written a d the acting wasn't much better either. I'm all for horror films being so bad they're good (I'm looking at you 47 meters down) but this was just laughably awful. Boring, pedestrian plot that has been done a thousand times before, with no twists or good writing to to make it worthwhile."}, {"id": 36, "text": "Spoiler: there is no plot, no suspense, no point.The story is non-existent, the acting is terrible, the scares are filmsy.Save your time, watch something else."}, {"id": 37, "text": "It's a Sunday you don't have anything to watch, just give it a go for jump scares or to pass the time with a good ish movie. It's not terrible. I forwarded the first 15 mins. Once they're IN the house then the good stuff starts. It's a 'might as well' movie. Id say 5.5/10"}, {"id": 38, "text": "I thought this was rather good, as far as haunted house movies go. It does well with the tension and unsettling scenes, and there is a little gore but nothing over the top. The standard-issue teens behave reasonably sensibly - trying not to split up, running away rather than seeing what is under the sheet etc.. The worst thing about the movie is that it has that flat TV-show look rather than the cinematic depth of a real movie, and this lessens the atmosphere. If I were being super picky I would also fault it for a fairly random string of set pieces, most of which are taken from other films, that have only a tenuous link to a witchcraft theme; however, it's all done rather well and no-one was probably expecting originality here."}, {"id": 39, "text": "If I could give this movie 0 stars I would. The acting was terrible and it seemed like the movie would never end. Very predictable. A child could make a movie better than this CGI crap."}, {"id": 40, "text": "Please stop making movie that ruin the horror genre the part where the girl open the door and it closed the dumb Asian girl says it's the Wind And the Signal when did ghosts control the phone Service and the mirror part she lost a finger worst scream Now they're trying to find clues at the office theres no good acting here please for everything that is good in this world stay away from the horror genre I love horror movies this ruined date night and you can totally tell that's a fake hand in the pot bro waste of time filming this and waste of money you should have donated the money to a charity or give it to someone that know what they're doing"}, {"id": 41, "text": "OK, it's not great, in fact it's quite poor, but if you're in need of something with a ghost story, this will keep you mildly entertained, until you find something good.Every cliché you could imagine, think of a poor man's version of The Blair Witch. They've tried to capture a horror tone, but it doesn't quite work.The special effects aren't particularly good, but I did quite like some of the sets, the room with all of the Witch's equipment looked rather good.The woman in the coffee shop needed to be in it more.Poor, 4/10."}, {"id": 42, "text": "Just awful in every way. The other bad reviews do not lie."}, {"id": 43, "text": "Entertaining, not a self confessed wannabe horror director... But still..."}, {"id": 44, "text": "Starts of ok until a group of college student types enter. They literally state the obvious. They think they are stuck but dont investigate the house. At first when they try to escape the door slams shut so you can tell that it pulls to open, it's obvious, but then all the actors slam themselves against it as if to bust the door outwards when it opens inwards. They had been in a room where there were old fashioned black and white family photos, making it seem like the last people that lived there were from the 1920s or something, but then they walk into a kitchen that's blatantly modern. They go into a library room and someone says ooh it keeps getting creepier yet it's just some books and cobwebs?! The characters keep making stupid observations and comments. The apparent jump scares arent scary. The windows are meant to be boarded up but theres windows in other rooms or over the front door that are not. Someone gets hurt on the shoulder blade but then starts developing boils on his head. A girl has her finger cut but doesnt get boils. Her accident was icky and probably painful but she has to then be supported and almost carrier by 2 people right after the incident which to me makes no sense. Lots of stuff makes no sense all through, but it made me laugh and continue watching it to see where it went. It's a real shame it wasnt scary, its worth a watch for giggles though. It's full of horror cliches and doesnt seem to know what it wants. Haha."}, {"id": 45, "text": "Don't waste your time please! It is an absolute waste of anyone's time. No plot, acting totally sux and it's totally predictable as a movie. I figured it would be at least likable as a movie, but completely feel beyond way short, so don't waste your time!"}, {"id": 46, "text": "My favorite part was when Shane started breaking a supernatural being's belongings in order to lure her into a 2v1 battle.My second favorite part was the successful CPR on someone who was underwater for hours.My third favorite part was the mirror superstition emphasis that didn't amount to anything, as they never tried to cover the mirrors again.The last ten seconds were worth all 5 stars, though."}, {"id": 47, "text": "Such a great location. that house was so creepy just looking at it. and the beginning -- where it was more psychological (in the style of Room 1408) than gore -- had me ready to be scared but nope. nothing but yawns. bad acting too. it's a disney movie with gore."}, {"id": 48, "text": "I really enjoyed this movie. From start to finish the amount of scary moments are staggering. Don't remember any other movie lately where scary scenes are follow each other up so rapidly. It contains a lot gore which I do not prefer in a horror movie, but it is within my comfort area lol. Also the ending did it to me. If you love a simple story with many scary moments then this movie is for you. The acting wasn't bad either. Probs to the makers, great job! I enjoyed this creation lol."}, {"id": 49, "text": "This 2017 horror film features a group of teens going to an old, abandoned house on Halloween where a witch's spirit haunts them. I just seen this on TV and it's creepy. Some of the acting is bad, but there's gruesome and chilling effects. Horror or Halloween fans should give this one a try at least once."}, {"id": 50, "text": "RELEASED TO TV IN 2017 and directed by Alex Merkin, House of the Witch (aka The Wiccan) chronicles events in small town Kentucky when high school teens set out to play a Halloween prank at the local haunted dilapidated mansion, but things go awry when the kids find themselves trapped inside in a life-or-death situation.Despite the TV-budget and no-name cast, this is a competent, austere haunted house flick with, believe it or not, moments of nigh greatness. The basic plot has been around forever, as illustrated in those cheap 50's horror comics. Unlike the low-key (and thoroughly overrated) The Blair Witch Project (1999), the ghostly witch is blatantly shown on several occasions and she's quite formidable (although the cartoony smoke effects of her traveling thru the house are rather lame). Her seemingly malevolent motivations aren't revealed until the climax.The film scores well on the female front, beginning with cat-eared Grace Balbo in the prologue, followed by Emily Bader as the main protagonist. Michelle Randolph is also on hand.I would have given this a solid grade even though it's just another haunted house flick, but the superb climax compels me to up my grade. The final 10 minutes show artistic ingenuity with the hauntingly beautiful cinematography and the story revelations, along with the affecting score (reminiscent of Unkle's poignant When things explode with Ian Astbury). It's comparable to the moving close of 2009's underrated Wind Chill, although they're decidedly different in theme.Forget haunted house junk like 2007's Return to House on Haunted Hill, House of the Witch is the real deal in ghostly mansion films. It shows how a quality little horror flick can be made on a low-budget.THE MOVIE RUNS about 89 minutes was shot in Lexington, Kentucky, mostly at Meadowcrest Mansion. WRITER: Neil Elman. GRADE: B+/A-"}, {"id": 51, "text": "I caught this on Syfy last year and surprisingly, I enjoyed it. It has a pretty simple yet familiar plot; it's Halloween and six friends decide to go check out a house that's supposedly haunted by a witch. Soon after going in, the doors close and there's no escape. There are no windows, the door is shut tight and the house itself becomes a maze. The witch decides to have some fun with her guests and slowly starts tormenting and killing them one by one. I would definitely recommend HOUSE OF THE WITCH!!!"}, {"id": 52, "text": "Amazing film! had me gripped from start to end! Just wish there was a 2nd"}, {"id": 53, "text": "I thought this film was going to a fun midnight film given the tired premise and TV production values. Much to my chagrin the film ended up being just competent enough in the acting and direction departments to be a bit of an atmospheric horror film. It still is not good as the writing is rote and cliche. But nonetheless this is worth the 90 mins if you are drunk and need some moving images to distract you from life's pain."}, {"id": 54, "text": "Nice settings, not bad acting but a worthless movie..."}, {"id": 55, "text": "I caught this on Syfy and surprisingly, I really enjoyed it. It has a pretty simple yet familiar plot; it's Halloween and six friends decide to go check out a house that's supposedly haunted by a witch. Soon after going in, the doors close and there's no escape. There are no windows, the door is shut tight and the house itself becomes a maze. The witch decides to have some fun with her guests and slowly starts tormenting and killing them one by one. I would definitely recommend HOUSE OF THE WITCH!!!"}, {"id": 56, "text": "Not only did the movie make me jump a little bit but it was just different from the typical horror films out now a days. For one being trapped in that home when the windows boarded up would have been enough for me. And I like the fact that no one got out alive."}, {"id": 57, "text": "A well done realistic scary movie for teens. All the actors really impressed me I felt like we're really scared creeped out and living in the moment. I don't normally watch scary movies. You won't lose sleep over this type of fear in the movie."}, {"id": 58, "text": "As cheesy and unbelievable as it's straight up ridiculous. Nothing that happens makes an ounce of sense and, nothing that characters do is justifiable in any way. I get that not all movies have an Allstar casts or have millions of dollars to work with, but at least make it somewhat believable. This movie was just embarrassing to watch."}, {"id": 59, "text": "The House Of The witch: Teens decide to spend Halloween night at a haunted house but get more than they bargained for. The ghost of a witch torments them. A mirror becomes permeable and a girl loses a finger. Smoke turns into solid arms, drags someone into a pond. Another girl is possessed by the witch, bites chunks out of a boy. This is one angry ghost. Some good effects and scares, figures distorting in mirrors and old photos. But there's nothing really new here and yet again it feels overlong even at 85 minutes. Would have been better as an episode of an anthology series. Directed by Alex Merkin, written by Neil Elman. On Netflix. 6/10."}, {"id": 60, "text": "It's not that bad if you didn't actually spend money on it. There are some moments....simple haunted house, lower budget masterpiece. If you're bored, give it a shot."}, {"id": 61, "text": "2 for effort. may have given it 3 stars if there was a shower scene........"}, {"id": 62, "text": "It's an ok film if you don't mind watching them run around the house being chased by what looks to be the same girl from  The Ring clearly savings were to be made"}, {"id": 63, "text": "If I could tell this movie anything... I'd say Bye!"}, {"id": 64, "text": "Found this on Netflix and gave it a try....the characters are paper thin, and honestly unlikeable. I was hoping for the Witch to kill as many as possible through the movie. Ruined my enjoyment"}, {"id": 65, "text": "Very amateur. Effects were bad. Plasticky and syrupy. Acting very mediocre to naff. Full of clichés and generally quite boring. Wasn't scary. Lost the will to live very early on and resorted to looking online for a new toy for my dog. Eventually my husband said the film was rubbish and he was off to bed, so we switched it off."}, {"id": 66, "text": "The people just wanted sex and were dumb asf and had no care, bad acting and horrible plot- good idea, horrible execution"}, {"id": 67, "text": "Could be a great drinking game. Have a drink whenever they say what is that? what's happening? and who is that?. I don't think this had a script."}, {"id": 68, "text": "I wish I hadn't bothered. Terrible storyline; the house was far too modern for a witch to have lived there, it was far too predictable, terrible acting and the dialogue was painful: what happened? Her finger came off! I can see that. And I need to know who's idea it was to have a camera pan around an empty room and end on a ceiling, after all the characters had left the room? I'm baffled by that part. It's not like there was anything stalking them in the room either, it was just empty. The whole movie was a waste of time."}, {"id": 69, "text": "Acting is mediocre, effects are mediocre and plot is yet again mediocre. Some of the ideas are original yet poorly carried out. I like the fingernail scene. If you're planning a scary film marathon and need something bland but with the 'vibe' go for this; otherwise avoid at all costs. :)"}, {"id": 70, "text": "I didn't expect a masterpiece going in and it didn't exceed any expectations that I have of the horror genre. It's formulaic and repetitive of previous movies like it. There was nothing fresh or original that could have been added to set it different from other films. The cast is okay. Nothing special. You have the same idiotic macho college guys and the screaming annoying girls who make the same cliche mistakes. Add in the a little sexual deeds and voila you have House Of the Witch.I am not sure what producers and film makers are thinking nowawdays. There haven't been many decent horror films in the last decade. It seems to be another full addition to a genre that is steadily going downhill. Bring back decent horror films!"}, {"id": 71, "text": "It's not great, you've seen it all before if you're even half of a horror fan. The acting is pretty poor, characters are hard to care about and there isn't much plot. Why hasn't anyone pointed out the goofs. There's only one on imdb. As soon as they're trapped in the house they're pushing and flinging themselves up against a door that just opened in the way. If only someone had tried pulling it instead. Plus, it's the most well furnished derilict mansion I've ever seen. Pictures on the walls, couches, beds, a full kitchen of stuff. Still, I've seen much worse horror films."}, {"id": 72, "text": "I concur with the other reviews of this film. It's an absolute shambles from start to minute 36 when i turned it off. I've always been a massive Horror fan but it's getting harder to to pick a good one to watch. I'm struggling to remember the last good Horror i did watch actually. It's definitely at least 3 years ago and with the fare on offer in recent years it could well be quite a while before i watch another good one."}, {"id": 73, "text": "What a waste, this could have been so much better. There weren't even any cheap jump scares or tense moments, just bad special effects around a group of kids with no chemistry. Here's some advice for the next movie you make, it's what you don't see that is truly scary."}, {"id": 74, "text": "Straight to the point, acting by most was painful, script terrible/predictable and for a horror movie - it was lacking the horror."}, {"id": 75, "text": "Predictable at every turn with a cliche cast. Teenagers want to scare each other on Halloween so they go to an alleged haunted house where, surprise, they encounter the vengeful spirit of an accused witch. They try to escape, and, shocking absolutely no horror fan, the doors are all stuck and the windows boarded up.Slowly they each end up attacked until they eventually figure out what's going on. We get down to our cliche final girl and it seems like she's made it! She's outside the house, the police are present, she's going to get away! Except the smoke that represents the witch shows up and... cut to daybreak? The cops bring poor survival girl to a squad car to sit.The walk from the house to the car is agonizingly long and shot in slow-mo. The camera angles make it clear that it's not our survivor girl, but is the alleged witch finally freed from the house. This sequence did not have to take as long as it did to play out.I'd give it less than two stars, but I've actually seen worse. Don't waste your time on this movie."}, {"id": 76, "text": "Bad script, inept direction, awful acting, etc. This was obviously written around the location, in the hometown of the producer. The house isn't frightening, in the least - just a decades-old Federal styled mansion, next to a freeway. (The property is apparently being converted into a business, housing, and retirement complex? I found a few old articles on Google, but didn't explore further.)How this kind of stuff makes it onto a major streaming entity, is puzzling. It was aired on a cable channel originally.I read an interview with the producer, and it is cringe-worthy.By the final fifteen minutes, I was laughing, and not in a Plan 9 kind of way.Skip it, by all means."}, {"id": 77, "text": "While trying to find something to listen to on Netflix while working, I came across this movie and decided to give it a try. I definitely regret that decision. Even though only part of my attention was on the movie, the horrible acting was enough to make me laugh when it probably shouldn't have. Add to that, the fact the characters were shallow and also kind of ridiculous, I wasn't sure I would be able to finish the movie and I was right. I got about 40 minutes into it and turned it off. First of all, how the characters discovered things or got themselves into situations was wholly unbelievable. I have never seen anyone walk backwards, in shock, across the entire width of a large room and just happen to lightly bump into something to turn it on. I'm sorry but if you don't know the room, it's highly unlikely you will just lightly bump into something while backing up. And then, one of the guys finds an obviously fake hand in a pot on the stove and backs away from it, then decides to go out into the hallway while gagging as his friends are asking him what happened. Again, if you don't know where you are and already weird crap is happening in a house that is rumored to be haunted, why would someone leave their friends in a different room so they can gag over something in private? Wouldn't it have been enough to just walk away from the stove considering the kitchen was big enough to do so? Then, this same guy goes into a room by himself and sees his buddy's girlfriend who is crying and starts comforting her. They then end up making out and he mentions to her they should probably close the door. Really??? He's making out with his friend's girlfriend in this house and he worries about closing the door? I'm not sorry to say I was happy when the guy ended up being killed. There were so many things wrong with this movie but irredeemable characters that I am happy to see die will make me want to shut off a movie every time! Don't even bother wasting your time on this movie...unless you need a good laugh."}, {"id": 78, "text": "If people have the budget and time to shoot a film, they should spend some of it on the screenwriting. Cliches and redundant dialogues make the acting look bad. Just a horror movie that made me wonder about having my money back from my monthly subscription. I should've been paid to watch this.That slow motion reveal took forever. It felt so painful to watch."}, {"id": 79, "text": "I made an account just so I could make a review. This movie is flat out horrible. It's boring and the jump scares are cheap. It wasn't even scary, my little sister sat through the whole movie acting like it was a comedy. The gore in unnecessary and stupid. The plot and acting is bad. Especially at the end where she is drowning and the police are literally 12 feet away and it takes them ten minuets to get to her."}, {"id": 80, "text": "Lower budget scary haunt. Poor witch effects but some great gore. No idea why people are negative about it. It lived up to what I thought it should have been. I dare say I will buy it if I ever see it for sale, though I did watch it for Halloween month for free on Netflix. The characters do seem like freshmen. Naive and slow, like kids are. Decently acted, by a few. A few not so well, which is every movie."}, {"id": 81, "text": "All you are going to see it 7 kids die in a witch house. It has violent content: blood, killing, almost committing suicide, drowning. Would not recommend for kids..."}, {"id": 82, "text": "Gore is too much to be TV-14 or PG-13. Not appropriate for teenagersInteresting plot, mediocre acting, got the chills a few times. I like a good scary movie but not a fan of gore. The ending puts it all together but all the stuff leading to it is poor evidence of her motives."}, {"id": 83, "text": "Right, well initially I had very little expectations to this, being a SyFy movie and all. But still, I am an avid horror fan and I liked the movie's cover/poster, as it seemed interesting.It turned out that House of the Witch was actually one of the better SyFy movies that I have seen in quite some time. Not only did they up their production game, which had a tremendous effect on the end result of the movie, but they also managed to put together a movie with a proper storyline and one that had good effects.Granted, this is not the most original of stories. In fact, everything here has been seen elsewhere in other movies. So don't get your hopes up on originality. But still, it worked out well enough, because writer Neil Elman and director Alex Merkin individually managed to create something that had a good flow and harmony to it.The characters in the movie were fairly average, albeit a bit on the generic side, in terms of how characters tend to be in movies such as these. Hardly memorable characters by any means, but the actors and actresses did good jobs with what they had to work with.House of the Witch does have its moments in terms of being creepy and scary. However, it is not a movie that will scare the living daylights out of you. It is worth sitting down to watch it once, if you have the time and chance."}, {"id": 84, "text": "Saw 'House of the Witch' because the concept was an interesting one and the cover/poster and advertising were cool. Also have a general appreciation for horror. Despite being intrigued, part of me was rather apprehensive watching 'House of the Witch' as well.Especially when the rating was quite low, which from personal experience recently has not been a good sign. Most of my recent low-budget viewings with low rating and mediocre to terrible reviews have been as bad and in some cases even worse. But went with my gut instinct and saw 'House of the Witch' anyway because it did seem like it would be one of my better recent low-budget viewings. And it actually was, far from perfect and the potential is not completely lived up to but in no way is it completely wasted.Starting with the good things, Vernon Wells is great and generally the main performers were better than average. The music is both quirky and ominous and the direction when the film gets going is assured. 'House of the Witch' had unsettling parts, didn't take itself too seriously while being fun without being too cheesy. The characters were not as annoying as feared and don't make as many frustrating and illogical decision making like some films seen recently did (this is always also including bigger budget films that were box office successes if variable critically). Parts are creepy and there is are a few fun set pieces. The threat actually has personality and generated creepiness.Low budget however does show, the film did need a grander and more elaborate setting while the photography can be too claustrophobic and the effects ropy at best. The dialogue has a lot of cheese and awkwardness and the secondary cast are wooden and some of the chemistry bland.As said, 'House of the Witch' can drag. Some of the second half is silly and on the wrong side of strange with some weird inclusions.Overall, better than expected though very flawed still. 5/10 Bethany Cox"}, {"id": 85, "text": "I decided to give this a watch after reading the reviews on here, with some being very positive others very negative. I am a massive horror fan so I tend to be a bit more favourable with my reviews as most horror films tend to be a little underwhelming. Let's start by saying this isn't the worse film by a long shot that I've watched. But don't watch it with high expectations either it's some what average. There is zero originality to the film. your basic standard horror ingredients are all here. a bunch of dumb teenagers Decide that it would be a good idea to break into the towns old abandoned hunted house on Halloween (zero originality) then strange things start happening and of course there trapped in the house and start getting picked off. The acting is what you would expect from low budget horror flick (not great) I thought the effects and CGI were decent enough. It's somewhat gory and graphic in places but nothing to sicking. The plot/story is probably its biggest downfall there isn't much of one. So big question would I say watch the film. Yes if your a horror fan and your struggling to find something to watch. Just don't set the bar to high."}, {"id": 86, "text": "Here is the story: Six high-school students visit a house for Halloween, only to find themselves trapped inside under the wrath or spell of a witch. The acting, the script, the storyline (or lack of one) are all morbidly poor.There is zero exposition about the house set in place before the action as a means of giving the viewers an idea of why the witch resides there and why she preys on anyone that enters her abode. The house itself is not creepy whatsoever (more on that later), and there is absolutely no character development given about any of the cast members' roles that I wonder(ed) why I should care if any of them dies. I did not relate to any of them, and I found myself not rooting for any of them either.And now ... onto the worst quality of the film: the acting. All six teens' acting is so wooden that an experienced woodpecker would fail to chuck wood off their performances. For instance, a teenage girl gets one of her fingers completely chopped off, only to talk normally literally a few minutes later. Really? Another girl sees in full sight a ghost or phantom on a seat, but, again, a few minutes later, she acts like it is just an everyday experience. Yes, yes, very believable. A boy finds a large part of his forehead is suddenly scarred, as if maggots are eating him from the inside out. His reaction? He looks at his reflection and then just sighs.The dialogue also has so many cliched lines - most of which break the fundamental rule of literary and visual arts of 'show, don't tell' - which makes the script look like it had been written in about 25 minutes tops (okay, maybe 30 minutes). Here are some of the lines the actors say throughout the film:It's so dark. (Telling.)It's so creepy in here. (Too telling, as the writer and director probably hadn't known how to stage a creepy setting, so they have to tell the viewers 'Hey, this house is scary.')You're such a jerk!Get a room.This place just keeps getting creepier. (Telling, just in case the viewers hadn't noticed the pace is creepy in the first place.)The only horrifying aspect of this film is that it is horrifyingly bad. If you are a masochist or have nothing else to do, watch the film, even though I am sure hearing yourself breathe is far more entertaining than seeing this hogwash."}, {"id": 87, "text": "It got one extra star because some of the special effects aren't terrible.It's not an enjoyable low budget horror, it's just lazy. The abandoned-decades-ago dilapidated Witch's house looks like a new build in some shots, it's bizarre. The only genuine 'horror' aspect of the film is that I wasted the time forcing myself to sit through it.The film is predictable and boring. The characters are uninteresting, moronic and frustrating. There's no character development. There's no surprises, no tension, and no real scares. The dialogue is awful and repetitive.The whinging and screaming was so annoying that I wanted the characters (even the actors) to be killed as soon as possible so I didn't have to listen to them anymore.There's no good reason to watch this."}], "reviews_amount": 88}