{"name": "Monsters of Man", "titleId": "tt06456326", "reviews": [{"id": 0, "text": "At over 2 hours in length, it is clear the director, writer and producer (same fellow) felt every moment of footage needed to be kept. The movie could have easily been 1.5 hours, or a bit less and been a lot better for it. As a result it is highly repetitive with the same scenes playing out multiple times.The effects are good. The acting is ok, although I don't think there is any character to identify with. The action was ok. The concept isn't new, but what is anymore. It just dragged on and on and on. Eventually you begin hoping the robots will hurry up and kill everyone so the credits can roll."}, {"id": 1, "text": "So as of writing this film is at 4.3/10. More than a little unfair imo. Look it's not high-brow entertainment, and premise is pretty dumb. The notion that the US would do a field test on AII killer robots in Cambodia and have them massacre (mostly innocent) villagers (including kids) and a group of young US doctors doing humanitarian work is indeed pretty sketchy - even if you think the US Military Industrial Complex is a heartless killing machine. But the execution of this goofy premise I think was pretty well done. Of the four killer AI bots that are supposed to be semi-controlled by operators (who inexplicably weren't aware of what the military was planning), one of the bots goes rogue and becomes self-aware. So we have multiple moving parts here, the doctors and villagers fighting for survival, the robot operators trying to figure out the morality of their orders, and a rogue AI bot trying to come to terms with sentience. The pacing is mostly fine, despite a very long (for this type of film) 2 hr 11 run time (tbh 15 mins could have been trimmed), the action and robot effects are well done, and the characters generally behave in a believable manner. So an eclectic combination of 80's action movies - think Predator, Commando, and especially Terminator blended together in a semi-high-brow action movie."}, {"id": 2, "text": "Every single character in this movie was so annoying and unrelatable that I was actually rooting for the killer robots."}, {"id": 3, "text": "After 10 minutes you know it is going to be a bad movie, it is impossible to connect to any of the actors, they all act like morons. After 20 minutes I set the player to 1½ times speed and still the pace was slow. The only good actors are the robots, the dialogs I think are written by a 14 year old put that together with the bad acting and amateur casting, this movie sucks. Honestly I was applauding every time someone died in the movie, could not happen fast enough."}, {"id": 4, "text": "I watched this without really knowing much about it, three things drew me to it, robots, Neal McDonough and the length. Normally in my reckoning movies over 90 minutes tend to be OK. This one met this condition, but it was a bit too long and could have easily been 20-30 minutes shorter and lose none of the story line. The acting wasn't brillant, but the actors did a good job. The CGI was good and didn't make the movie look cheap. Parts of the movie were a bit repetitive and the storyline has been done to death, but if you have a few hours to kill you could do worse than watch this.5.5/10 would be my honest rating, it would score higher if it was a bit shorter."}, {"id": 5, "text": "Yeah, I agree with some of these reviews about the acting/length/averageness, but c'mon, it's more than watchable... no one watches a 4, this one's definitely at least a 6, and I actually did enjoy it quite a bit as a thriller, so 7.5 from me."}, {"id": 6, "text": "I am mainly writing this because in one scene a robot gets stuck and they ha dthe prime opatunity to take it's weapon and disarm it mean all they had to do was outpace it but no they we stupid and didn't pick up the gun"}, {"id": 7, "text": "Actually not too bad for an action movie. Sure, you'll have to suspend your disbelief a few times, and live with quite a lot of cringe (I couldn't save them! style), but other than that... Premise is fresh - autonomous weapons on the battlefield. Here we have a pack of killer robots sent to Cambodian jungle for a navigation-turned-more test. Robots fortunately (for the movie) encounter some resistance, and it is decided that they have to eliminate all witnesses. Rampage starts. Some very good FX, robots move properly unnaturally (or - naturally for a robot), they're actually quite scary, you know you would never want to meet them in combat. Human cast isn't so good, unfortunately. Overall, a nice break from the whole pandemic."}, {"id": 8, "text": "Messy disappointment. Some may think that if they have the money they have the best ideas right ? Wrong!!! Then definitely know how to write a good script right ? Wrong!!! Maybe know how to direct right ? Wrong!!! Good CGI, good FX, nice outdoors, but at what end ? More close ups than a Indian soap opera, people acting angry for no reason, people tripping and stumbling around worse than in an Irish pub, acting childish, directing atrocious. Quote of the day: In a cave - We can stay here in the open ??? 10 steps in the same cave ok we should sleep here  ???!!! And other gems like that, shh be quiet next thing some random actor yells something completely idiotic. A robot gets stuck and drops its gun, they all pass by it, no one picks it up, a top notch high capacity gun, saying hurry up before it gets unstuck ... bullets don't affect robots but the stock does... And the cherry of the top, EMP can destroy everything electric but not the will of a robot. The amount of intelligence put in this script is below zero. Someone said he was hoping the robots will kill everyone in the first 20 minutes, I feel you bro! Is my second time writing this review, lately bad reviews tend to be forgotten I do not recommend this movie."}, {"id": 9, "text": "Least likeable cast ever. Robots were easier to empathize with than the shrill whiny American kids."}, {"id": 10, "text": "Acting on the whole was pretty good, particularly the little boy. Effects were also good.Annoying parts were characters far too whiny. Constantly giving their location away by crying and screaming. I forwarded those bits and saved about 20 mins off the film.But the film really lost me when the hard-as-nails Navy Seal decided to do no harm to the lethal robot that was hunting them when it got stuck in some rocks. Could have tried to kill it using it's own high powered gun that it couldn't reach, or cave its head in with some rocks, but no. Leave it be, along with its gun so it can get out and continue hunting us.By this point, I was siding with the robots."}, {"id": 11, "text": "Also, good acting considering there are a lot of unknown actors. I like the plot, the surroundings and how it's made. There are a few bad moments, but all in all an ok movie, well made."}, {"id": 12, "text": "It's a little too long but I found it really enjoyable. The graphics and acting was top notch from some of these unknown actors and some top ones as well. I recommend it"}, {"id": 13, "text": "I don't understand the bad reviews about this movie. It is a nice action flick with very good special effects. Good actors and a very believable story (considering is sci-fi)Give it a chance!"}, {"id": 14, "text": "Yes, it was a bit long, but the whole story was well thought through and Neal McDonough and Brett Tutor were doing a good job, though the lead roles were kind of shared with the other actors. There was some not so professional acting too, but it was not killing the whole movie like it sometimes happens. There were no obvious logic holes in this movie which is nice for a movie so close to our current reality. What? Don't you think so? The movie was a bit bloody, but seriously, I guess it's a warning for reality. If the producers did not intent to send this message, well, you hear it from me. Robots and AI does not fit, but hey, I don't want a flat screen in my car either, just dials for rpm and speed. I hope they get away from the idea to stear the world with computers. Yes, I am a pure luddite that works with computers the whole day, that's why I am saying this movie is a look into our possible future. Ok, enough of my scary future predictions. Just don't be one of the three innocents we got in this movie."}, {"id": 15, "text": "What you get when you mix Chappie Short Circuit I, Robot with utter lack of ideas? Over two hours boring, predictable, complete waste of time.called Monsters of Man.Nice scenery of Cambodia and good animation does not save poor acting and pulp script."}, {"id": 16, "text": "Like a lot of bad movies, there might be a germ of a good idea buried in there somewhere. But the acting is so awful, the script-writing so cringeworthy at every turn, and the action sequences so lifeless and repetitive, you will wish you'd read a book instead. If I think really hard of a positive, the scenes of Phnom Penh and the Cambodian countryside were pretty cool."}, {"id": 17, "text": "Again stupid screaming people when they just should be quiet , otherwise very nicely done. And the Bad guys are good especially The one with the teck people."}, {"id": 18, "text": "Loved this movie, the story was good, the acting was mostly good even though it possibly ran a bit long. But mostly because of the beautiful sites in Cambodia. It is nice they went to lesser known locations I can't wait for travel to open up to go there again one day soon. If you ask me, I think the actors did a fantastic job, as some of characters annoyed me so much I wanted the robots to shoot them. The sign of well played characters that they can illicit an audience response - even if it is dislike. The robots were good even if the CG was a bit sticky in places. The movie isn't just a cool sci-fi, they high light a couple of real problems in Cambodia; poverty and landmines. If you ever get to Cambodia, look up the Apoppo Hero Rats, these amazing creatures sniff out landmines faster and safer than dogs. They even sniff out diseases in people too. #HeroRats"}, {"id": 19, "text": "Oh my - that was really bad. Do yourself a favor and stay away from this garbage at all cost. I just don't get what was the whole point, it just sucks so hard that I can't believe this has been done intentionally - surely something went horribly wrong somewhere, there has to be some excuse for the lack of any intelligence. No words can describe what a piece of poo this is. The unbelievable content aside, the production/post production quality is beyond horrendous. Story - abominable. Acting - laughable. Concept - WHAT THE F....???"}, {"id": 20, "text": "Was probably 20 minutes too long...apart from that, I really enjoyed it."}, {"id": 21, "text": "But it's scary to think that given how fast it happened with drones, weaponizing robots is probably the next step. And we should also be more careful about toying around with a tremendous power like A.I. Smart people like Stephen Hawking, Elon Musk, etc... already warned humanity. I am become death, the destroyer of worlds; unfortunately we don't seem to learn that well from our darkest History."}, {"id": 22, "text": "Not my cup of tea at all. Can't understand the 10's other reviewers have given. What an insult to movies that are actually good. Feels like a parody on some movie that could have been a great movie. But probably isn't. Acting is on level with a high-school-play. The story-arc is cliché; young people go lost in jungle and finds a village of a few children and women+ an ex US-navy deserter and a bunch of heavy armed hostile natives who grow drugs for living. People get killed, children get killed, young people are scared, US-navy-dude tries to rescue them from evil robots where's one of the robot goes rouge and start and gets an existential crisis, somewhere about there I turned off this somewhat intellectually offensive garbage."}, {"id": 23, "text": "There will always be haters but this movie was really fun to watch. Okay, maybe not Golden Globe material but we surely had fun for over 2 hours. Graphics are super though."}, {"id": 24, "text": "The director could have used a tighter screenplay with characters that actually provoked our interest and sympathy. Too long for what it was -- content was similar to a 50m Black Mirror episode. The special effects were good."}, {"id": 25, "text": "If you are a Fan of Robots, AI, and well done CGI ( as i am ) - give this a Try.Short Version: CGI: 9 out of 10 Rest: 5 out of 10A Little More: A Group of advanced Robots is inserted into a South East Asian Country as a Field Test. Observed by the Manufacturer and the Government aswell as supported by a local Team of Programmers things quickly get out of Hand.Interesting Take on Weaponized Robots, Artificial Intelligence, 'Evil' Government and Defense Contractors and finally even a little Philosophy on what it means to be 'Man or Machine'.Shout Out to Boston Dynamics !"}, {"id": 26, "text": "This Movie is One of The Best Action Movies of 2020 Please Give us Part II or a tv Series thoroughly enjoyed every bit of it !!!!!! More Please"}, {"id": 27, "text": "If a Navy Seal and a group of intelligent and educated Doctors make so many wrong decisions throughout the movie. Then you should seriously consider leaving the world in hands of Robots.."}, {"id": 28, "text": "I really liked this movie. But seemed 20 minutes too long. There were some great moments throughout the movie. I don't think it deserves this much low rating. Action plus sci-fi movie fans will love this."}, {"id": 29, "text": "Monsters Of Man is a nice budget action sci-fi that delivers a non-preachy commentary about the war industry in this catch me if you can movie. With time spent on the civilian war trauma angle along with those caught in the cogs of politics and big tech with no way out. It is movie of our time (2020) where there are bad guys, big money, dirty polices, victims. 'bystanders' and small victories. A well shot, directed, scripted and acted movie in 2020 by a dedicated crew."}, {"id": 30, "text": "I enjoyed this movie not sure why the reviews are bad.the cast, director, and special fxs team did a really good job.the child actor almost got me teared up with his emotional acting during a particular scene.great quarantine movie."}, {"id": 31, "text": "Monsters of Man is jampacked with action and suspense. The robots are terrifying and will certainly keep you engaged. The graphics and sounds are off the charts making scenes all the more terrifying. Plenty of drama with a touch of comedy to give you a brief moment to relax.This film is a must see and hopefully will have a sequel."}, {"id": 32, "text": "This film had it all for me.. It had action, blood, gore, love, philosophy, some funny bits, scenery and lots more.The filming was superb, the location was amazing, the CGI were super duper, the script, the plot, the baddie 'albino guy' who is always good in films, in fact, nearly every one of the actors was brilliant except for the wimp. You'll know who I mean...Highly recommend this film.High praise goes to the Toia 'couple' (I think???) for a great film."}, {"id": 33, "text": "I wasn't expecting much from the movie, but the CG is actually fairly decent, locations are chosen perfectly, story ain't that bad but the script is laughable at best. a bunch of doctors-gonnabe act like kindergarten kids wandering in a foreign jungle with zero local support? and try to be smart ass while pointed by hostile locals with AK47s? characters constantly yelling out loud while being hunted by machines through out the entire movie? 1 of the 3 genius got disappeared in a foreign country and the other 2 seems perfectly fine with it. being a doctor, you will start yelling to your recently deafen friend really loud right next to his damaged ear. All that makes the story that much more believable"}, {"id": 34, "text": "OMFG. Where to start. Spoiler Alert!Great premise, horrible execution. Let me preface this by saying I love action movies, sci fi, and killer robots. But this one???I'm giving it a 2 because, well, I did watch to the end. The DP was also the director... that's ALWAYS a huge mistake. The film WAS shot well, but there was literally NO direction. Action scenes, followed by ridiculous emotional drama, and people doing stupid stuff repeatedly that should have gotten them killed far earlier in the film.This one had every $%^#ing cliche in the book. The evil bad guy government/military types. Our unknowning tech guys who built the robots, and an innocent group of people who just happen to be in the 'test zone along with an ext military guy...Now I could forgive the cliches if they actually had decent dialogue, and what they did made any sense.The dialogue was atrocious. First they call Our hero a Navy Seal. Then someone else refers to him as Special Forces (That's Army guys, not Navy.) then the actor himself calls himself a Navy Special Forces guy. Really? The writers couldn't look that up? The Navy has Seals, the Army has Special Forces. Why didn't you jut call him a Marine Recon Seal Special Forces Delta Guy and cover all the bases?Not once does our Navy Special Forces guy try to trap, ensnare, etc the robots. On multiple occasions, they have the opportunity to do some damage, and instead, they elect to run.Every Single Time...Even when the damn thing is trapped in some rocks, they manage to get past it, but don't try to disable it. Freaking DUMB.A bunch of doctors who freak out and scream at the first sign of stress, and repeatedly, when being chased by killer robots, they feel the need to scream at the top of their lungs for their friends... how did any of these people pass medical school making judgement calls like that?The best part of this movie was the little kid. Great little actor.If you're going to write a movie, get millions to shoot it, then Jesus, do some research... and spend the time writing dialogue that isn't freaking atrocious.Of course, our ending sets it up for a sequel, which frankly, I'd be amazed if it ever happened because this was just So bad. .Again, SOOOOO much potential , just wasted."}, {"id": 35, "text": "Totally captivated from start to finish watching this!!"}, {"id": 36, "text": "I wasn't too sure about this movie but man I loved it. The robots were extremely well done, the plot was pretty decent and the cast i think did a very good job. Would be nice to have a 2nd movie."}, {"id": 37, "text": "If johnny 5 was channeling jack the ripper and arnolds t101, one notable scene about 40 mins in, is about as gory as it gets, otherwise it's a bunch of idiotic missonaries doing what idiotic self righteous missionaries do.throw in a token ex navy seal on some kind of self imposed exile, throw in a token drug runner, throw in the idiotic teens, throw in mercenary meat head, dark cia op and gullible naive tech suport akin to die hard 4.0 tech team in olyphants lorry.movie takes 30 mins to get to the point and even then stil drags it's feet.even neal mcd feels a bit wasted."}, {"id": 38, "text": "Not sure why this has so many scathing reviews. I was expecting a cheap B movie thrash. High production, acting and story is ok."}, {"id": 39, "text": "The CGI was decent, the acting was average, a bit stale at times and the script could have done with a bit more polish, but overall it was a decent flick"}, {"id": 40, "text": "In many ways this is the kind of movie I like &amp; given that this is precisely what we might be facing in a ten or twenty years (or sooner if you live in some war torn country) it's highly relevant in many ways.After all, how can you go wrong with killer robots? Well, the film holds together pretty well, but there is a lot that does go wrong, or rather doesn't go sufficiently right. Firstly the script &amp; the characterization is somewhat weak. Although there is arguably a hero / main character, the narrative suffers because POV the focus on the characters generally is somewhat confusing. This seems in part to be deliberate. The writers seem keen for us to be aware that these killer robots could at any moment take out any of the characters &amp; towards that end there are a few attempts to shock us. The most obvious example here is the beginning flashback scene, where we see one of the girls in the movie horribly imperilled beneath the foot of a robot. Well, half-way through the movie we re-encounter that scene only to have the robot (off-screen) stomp on the girl. Does this make for a better movie or more thrilling movie? I'd have to say it doesn't really work that well, &amp; rather comes across more as a deliberate &amp; unnecessary violation of narrative convention. Narrative wise the scene serves no purpose. Letting us know that 'anything could happen' isn't a good enough reason.That's just one example of poor judgement that marrs an otherwise good film. There are many points when characters die or are about to die, or have some 'moment' with each other, that just serves to remind us that we don't really care about them that much, and those moments, sometimes accompanied by platoon like music, just makes the story drag out unnecessarily. Some tighter writing &amp; better editing could in this respect have made this a far better film.The antagonists are variable. As stated the robots are pretty good, although barring one, they are simply personality-less machines. The military guy villain is good, as is the pentagon guy, but a few of the other actors simply aren't that good &amp; deliver sub-par performances.There are also a few annoyances. For example one character being hunted down by a bad guy pulls a knife out of her leg, then despite it being the one possibility she might have of evening the tables, just leaves it there, the better to die helplessly at his leisure. Same occurs later on with another enemy weapon.Over all, it's an ambitious and generally successful movie that could have achieve a 6 or a 7 if it had just had some tighter writing, a bit better acting and a lot better editing. I'd give this a 5.5. which I'll round up to 6 in a spirit of generosityOh, and the whole AI becomes self-aware was beyond cliche, but if the above points had been addressed it wouldn't really have mattered."}, {"id": 41, "text": "I was confused with the 4 robots. BR1 vs BR2 vs BR3 vs BR4. Would be good if they are color coded."}, {"id": 42, "text": "So many moments in this movie just works, but the problem that it ran into several of times is extending every scenes way longer than possible, even the dramatic scenes felt like an eternity despite little interaction or introduction between characters. The effects were good and the plot premise really worked. Overall it's a movie that Is worth a watch for what it is but It has way too many things working against it.5/10"}, {"id": 43, "text": "Pretty much every character interaction feels forced, and overacted. The CG is decent though. I actually like the way the bots behave. No unnecessary movements. But clearly this entire project was a test run, and the director will likely never get a chance to direct anything again."}, {"id": 44, "text": "I don't know why they spend so much on a movie with a great idea and then they cheap out on the actors. Could have been a 8 or 9 out of 10 movie if they acting was good."}, {"id": 45, "text": "A company looking for a CIA contract tests its killer AI robots in SE Asia. A group of American that happen into the area need to be eliminated as witnesses. One AI Robot has gone rogue.Two hours of humans playing hide 'n' seek from robots with guns. They tried to add some story but it didn't help.Guide: F-word. No sex or nudity."}, {"id": 46, "text": "What do you do if there is a robot who is impervious to bullets, but notices sound... keep on trying to shoot it apparently.Usual army/military Hollywood tropes here with dumb aggressive army types. Stereotypical people all over the place in this movie.There is one scene where there is a child crying for like 2 full minutes with heartstring music playing, awful screenwriting.Basically: Military is bad, AI is bad, corporates are bad, people are really dumb, and apparently in movies even robots can't shoot straight."}, {"id": 47, "text": "The idea looked good in the beginning 30min. But then the horrible acting by the women (incl Jordy something, the worst fake) started. The last 90 minutes were a real cry fest with the constant whaling and whining. You start hoping the robots would find them and finish them off. Painful to watch the end."}, {"id": 48, "text": "I made it 15 minutes in and bailed. The only Good acting was done by the children. CIA operatives over the top and copy cat of early Dolph Lundgren. Actually Dolph was better. Cinematography was good. Acting was horrible and wooden. The Robots did a better job. The tech actors of this film give computer techs a bad name. This even gives Millennial's a bad name. DO NOT SPEND MONEY ON THIS UNLESS YOU'RE DRUNK OR ON ROOFIES. It's simply not worth remembering. The directing was ... uh, what's below sub par? I gave it 2 stars, 1 for the cinematography, 1 for the kid. if there was music I don't remember it. maybe it make the Golden Raspberry Awards."}, {"id": 49, "text": "Like others write, in a situation they could terminate and get rid of one of the machines and take the weapon, they simply ignore and run away from it, and later it continue to hunt them.What was the goal of this movie, to show how bad a script can be written, with navy seals not being very intelligent over all . Or just how superior US can be and how stupid all the other people are?Bad movie in general with all the wrong decisions made."}, {"id": 50, "text": "It won't win any originality awards. But it's well acted, realistic FX and doesn't shy away from blowing a few kids away. Ha ha Far too sentimental in places and some of the pacing felt like it dragged. Couple of annoying characters needed 'ending' yet was left wanting. Overall a fun Predator/Terminator style scifi film with good FX and above average acting. Although some scenes needed cutting and were overly dramatic and trying to win and oscar or something. Ha ha I didnt really care enough to be moved by any of the characters so those scenes were wasted. Cut 15mins from it and be better."}, {"id": 51, "text": "Fantastic film, action, great fx, like a mixture of Elysium and chappie..Have no idea how people rated it 2/3 stars.. absurd.Film did not look cheap, acting was great and the FX on the robots etc.. wow.Definately worth a watch!"}, {"id": 52, "text": "Monsters of Man has a decent premise, plot and conclusion, but still disappoints.We are likely suppose to connect with the group of doctors, but they're pretty damn infuriating. The programmers and those in charge of the operation are well acted and the lifeblood of the film. The problem is we spend too much time with the doctors and co running around whinging and whatnot, instead of the film potentially having more scope for what is a fairly long run-time."}, {"id": 53, "text": "Nothing like military robots that can't shoot straight when hunting's bunch of whiny gen-z doctors. Oh, and a Navy seal that has lost his soul? Swiss cheese has less holes than this thing. My favorite part was the evil government types, oh they're just blood thirsty aren't they!A huge disappointment. BTY, anybody else notice that the men where strong and the women weren't? Sexist too..."}, {"id": 54, "text": "This movie was fun, but it could have been awesome. All the drama and negative tech-people is a bit too much. More violence and less drama would work out better. Acting, production and cgi is A+. They should only have spent a little more time on the plot"}, {"id": 55, "text": "This is an enjoyable film that is a blend between robotic predator &amp; I, Robot set under cover of military black operation.It isn't a classic like terminator. It has very human characters and the clichéd evil military presence. A group of doctors go traveling in a forest for a break but it turns out to be a holiday that they will never forget. They are entangled in a secret government's operation to test the next generation of A.I military robots. However, there is a man that is ex Mia navy seal that may give them a fighting chance to escape...."}, {"id": 56, "text": "Without spoilers, a group of lgbtq activists go to Cambodia to organize a Pride Parade, and a stolen valor guy with fake tattoos helps them avoid angry robots.They cry and hug each other while they sneak through a gorgeous jungle to avoid the angry robots"}, {"id": 57, "text": "It's an okay movie. At least 30 minutes too long. Didn't really care about any main character and just wanted the robots to get on with it and get rid of their targets quicker cause the movie lasts way too long.One of those films you'll only see once and never think about it again in your life, but it is a decent time waster if you need such a thing."}, {"id": 58, "text": "Pls avoid this movie and you will bless me for this. Absolute junk. Avoidable at all costs. A school student will tell you a better story than this mindless junk. Anyone reviewing this with higher ranking ..take pains to go and downgrade all the reviews made by that person, because you know he is a paid reviewer. Take that extra effort to discourage people from giving fake reviews."}, {"id": 59, "text": "From the outset, this Sci-Fi thriller sets itself up as a fairly serious and well thought out tale of shadowey government actors and robotics gone rogue. And while it's not all completely convincing, it does a great job of telling an exciting and gripping story with a heart and plenty of good morals.Best of all, the story really did not go the way I expected, and the millenial protagonists turn out to be great characters on a compelling adventure.The scenery of Cambodia is great!Well worth a watch, and far far better than I expected. Check it out! :-)"}, {"id": 60, "text": "The film is epic! The concept is very REALISTIC! The British Military just released a memo recently saying they are planning on having half of their soldiers replaced with AI Robot soldiers in the next two decades! What people do not realize is the machines the US military and other 1st world nations have is TOP SECRET so what we think they have is nothing compared to what they really have. I wouldn't be surprised if they already have robots that operate like the one they had in this film. But the concept of the film is very realistic!What I do not get is why they chose the Golden Circle in South East Asia? Why did they want to experiment there as opposed to somewhere in the Middle East etc? But that's irrelevant. I guess the location made for a better story.The idea of AI and robots are going to be a very real reality in the next decade and most people do not realize their jobs are soon going to be threatened by AI and robotics. They are already having robots perform surgeries, and these robots are performing better than the best surgeons out there, so surgeons will be out of work in the next 2 decades for sure! Laugh at my comment all you want, but it is a reality! Another example, they have been using AI robots to work in science labs and these AI Robots have already made huge scientific discoveries because they think far quicker and more efficiently that humans, and they can work 24 hours a day doing tests in the lab. I saw a news report just a few weeks ago about how robots were making discoveries having to do with the human genome and this is just the tip of the iceberg. With AI, we are at the equivalent of AOL days when comparing it to the internet. Another example is Tesla where they use so many robots to manufacture the cars that they won't need a huge workforce and same with Amazon because they just use robots to do what humans can do but at a far slower and inefficient speed.People really need to wake up to the reality of what the future holds with regard to AI and robotics. All of our jobs are at risk, and if they start to use robots as a form of policing the population, then we will be in a slavery 2.0 situation, and mankind will be in a lot of trouble.But in regard to the film... I think the filming, acting, and everything about the film was great! I could definitely watch this over and over again because this well done with some good humor in it at parts!What I loved most was the realism of the film. This is what the real world is like whether you want to believe it or NOT!"}, {"id": 61, "text": "Yes, you can watch this movie and think it's bad because the character are very shallow and story is redundant, but you're seeing it wrong. This movie should be watch as if the robots are the main characters and they must kill all the bad actors. Suddenly, it's a tragedy, the robots might not make it after all :cry:"}, {"id": 62, "text": "Forget the negatives here ! We can all dissect and pick a movie apart but holistically this a greatly entertaining movie. I was transported into the world of government military experimenting and the brutal collateral damage . Fast, action packed suspense with no punches pulled. Do yourself a favour, grab some pop corn, a few beers and get ready for some anxious nail biting Si-fi"}, {"id": 63, "text": "Exactly what I expected. The film delivers. All these bad reviews must be planted to lower the score. A totally enjoyable thrill ride! Human's reap what they sew. The visuals, SFX were also awesome. As with many films of this type, a few of the humans deserved their deaths due to pure stupidity. Many found their demise in very awesome ways. Overall recommended. Don't get were all the low score or negative reviews are coming from. Watch this one for your self and discover this high octane thrill ride. Also, I want one of those robots for xmas!"}, {"id": 64, "text": "Too many screamy people when they needed to keep silent, so it gets pathetic at times. It didn't really end and left too many loose ends. The robots and the kid were the best actors, but it was a watchable movie with plenty of action. You would expect a special forces guy to be much more creative and competent though. He was no Rambo or Terminator thats for sure."}, {"id": 65, "text": "What a film! Grity keeps you on the edge of your seat. Hope to see more."}, {"id": 66, "text": "I'm usually not one to give reviews on imdb, but this movie is massively undervalued and has a really bad rating (hence the 10 stars).I think this is one of the best Sci fi movies of the year. Great plot, great visual effects, excellent direction and great acting. It stays true to it's genre and gives a gripping reality check about the implications of self conscious AI and how it has potential to be used for good or bad.I strongly urge everyone to watch this."}, {"id": 67, "text": "Fantastic movie. Very entertaining with a few surprises. Loved every minute of it!"}, {"id": 68, "text": "A Very Good Action and story Development you will get hookup with this movie lil bit of CGI thing but other then that you are goin to have fun ."}, {"id": 69, "text": "The movie is great. If you dont like it, you don't see it for the genre it is. Everyone compares against oscar movies. Its not, its just a fun robot movie with some gruesome scenes. I did wish the AI robot was more involved though. The self-awareness was a bit kept in the background but would've been a great lead to the plot."}, {"id": 70, "text": "Relatively predictable, and although I don't find all the characters the most endearing, the genuine attempts at sorrow, shock and loss as events unfolded demonstrated some very good acting. For a sci-fi action, slaughter story, this is a unusually better and I thought very well done."}, {"id": 71, "text": "Not the best movie i've ever seen, but it is entertaining and made me wonder about technological progress. The actors belong in a B-movie, but this is not that. CGI is awesome and storyline is ok. Although it underlines the average 'all military projects are stupid and fail' assumption. Not a complete waste of time, but could be a lot shorter. please take out the terrible-acting-boy-crying-too-long scenes!"}, {"id": 72, "text": "Stopped watching the movie, after the second time of robots shooting children I had enough. This is Hollywood at its worse. Hopefully the only movie Mark Toia will ever make.I think I speak for the majority of adult parents that we don't tolerate such stupid, senseless violence against children. And to Mark I will never watch any movie you ever make again, if you ever even make another one, and will encourage everyone I know not to watch any as well.The film from what I watched is a complete failure and not worth the time let alone the money.The acting is bad, the millennial characters are bad, and the list goes on."}, {"id": 73, "text": "I thought this movie was very entertaining. The plot was well done and interesting and the acting was great. The cinematography and special effects were awesome too!"}, {"id": 74, "text": "It was the best part of the movie I can't get my stupid Shazam to find it :("}, {"id": 75, "text": "Hopeless Acting, Plot &amp; Dumb.It's basically like a PC Game and they are playing in an Internet Cafe, only problem is you can cut the power in an Internet Cafe not in this movie but sadly it's not even funny.Nice rip off of Johnny 5"}, {"id": 76, "text": "The only thing I loved was the opening shot of the thick jungle and that's pretty much it..! Gets boring as hell as it drags on. Unnecessarily lengthy. It's a low budget good scenery CRAP drag along kind of movie. I mean I wouldn't enjoy it even if I had nothing else to watch or do. DISAPPOINTMENT..!"}, {"id": 77, "text": "This is a prime example of an interesting concept and plot, poorly written and even poorly executed. It definitely has the stamp of someone so close to their ideas and project that they couldn't see the forest for the trees and a lack of self editing. Sometimes when you are so close to a project it's hard to put yourself in the audience's shoes... That being said, there are some cool sequences. The setting is cool. The camerawork is relatively sophisticated and well done. The acting is extremely uneven and overall not great. The sound design is decent. The music is all over the place, but mostly tells you how to feel and calls attention to itself. There's not much in the way of themes here just ambient cue after ambient cue that is far too common these days. Unfortunately, the film is largely tone deaf and didn't work for me. There's not much in the way of work towards suspension of disbelief and for sci fi there are some implausibilities and dumb stuff that just doesn't work especially for how largely serious the film takes itself-- but it's tonally all over the place. There's awkwardly inserted exposition and very little character development so consequentially it's hard to care about any of the characters. As an audience you can emapathize, but that's not enough, especially with all the bad acting. The gore feels unearned, especially the onscreen murder of children. Huge turn off and again goes along with the tone deaf nature of the directing here. The plot itself is very ambling and honestly considering how simple it is, a little hard to follow at times. It's so inconsistent. The fx however are pretty intense and will please fans of the violent gore genre. The CG is actually pretty decent considering and the mocap/compositing feels fairly natural. The editing could have used a few more passes and might have been able to turn this film into something better than the 2+ hr version, it gets repetitive and feels unfocused. For example restructuring and would be more effective with 25-40 minutes cut. This could be a 5 or maybe even 6 star but it just missed the mark. It's like made for cable tv level content with a better budget and production management."}, {"id": 78, "text": "Yes, there are plots holes you could hide a bus in, but I found it entertaining. The Boller character is way too over the top. His jawline far too square too. His cheesy one liners are the worst. The actors playing the geeks did a good job I reckon. I wonder why they had to actually be in Cambodia though when drone tech, being what it is, means they could have done it remotely, perhaps?! And I think a foreign woman looking scared and frantically running round that town would somehow have been noticed by the locals..... Great graphics though!"}, {"id": 79, "text": "Watch the first thirty minutes, leave for an hour or so, watch the end. Beyond repetitive. One good scene repeated ad nauseam for over two hours."}, {"id": 80, "text": "After reading the reviews, my expectations were pretty low. To my surprise, I enjoyed watching this! Yes, it's a longer movie but I enjoyed the aspect of surviving for days in a jungle while being chased by robots. Acting won't win any awards. The special effects and cool jungle scenery makes up for this. Don't think too much, just watch and enjoy. It's entertaining, at the very least, especially if you are running out of things to watch!"}, {"id": 81, "text": "Don't waste your time, Very poorly told story I can't even be bothered to write how terrible this is."}, {"id": 82, "text": "I remember the days movies were produced this long and it disappeared for years that suited my perspective as I enjoyed watching it.Got easily attached to some relationships, I am hoping there will be a second one that will continue on the storyline."}, {"id": 83, "text": "Even with a cliche ex-Special Ops guy in the wrong place at the wrong time, a variety of story holes, and an over 2-hour runtime, this flick is still surprisingly thrilling :-)"}, {"id": 84, "text": "Enjoyable way to kill two hours. After reading the reviews I was expecting a flop of movie but actually enjoyed it"}, {"id": 85, "text": "Its worth 7 but I gave 10 because it's really nicely done, of course there are some flaws..."}, {"id": 86, "text": "We enjoyed the movie but it is just a bit too long. The future of military AI robots seem so real and frightening. All can go wrong with those robots if they become too smart than human beings."}, {"id": 87, "text": "The movie is actually good. The future of infantry warfare. Worth a part II."}, {"id": 88, "text": "Considering that the movie clocks in almost 2 hours and 20 minutes and the end titles still have some interesting scenes; yes, the movie is too long and about 15 minutes less would have improved the pace. However, there are no many other failures in the movie. Considering is obvious a low budget one, is able to be quite believable in all its story. In fact the movie is more Science than Fiction.Since Kubrick's' 2001 (and perhaps even before Artificial Intelligence) has been treated as the Demon who will destroy humanity. I am a tech person and believe me we are very far from that; however the events portrayed here are quite real for a fiction movie.A group of five weaponized robots are drop in the Golden Triangle; a place famous for the Asia drug dealing, in order to be tested. One of the robots parachute fail to open and a piece is missing so the robot with AI in it goes rogue.Three programmers are also taken to a city nearby to conduct the experiments guarded by a Black Ops and in continuous conferences with an Army representative and the private weapons company management.Unexpectedly, a rogue Navy Seal and a group of Doctors without borders get mixed with the locals and attacked by the robots too.Obviously Army no Private sector want witness so robots are set to massacre everybody; plus the tech programmers had to deal with the rogue robot that is getting conscious of the environment and trying to reconnect with the main server to acquire information.Places within the jungle with people living like tribes, had been used from many years back; to test lots of things including medicines and weapons because nobody (much less local government) cared about those people there. Artificial Intelligence first requirement is to collect information and establish relations between data. The second step is basically statistics.To be more clear; based on the data what are the probabilities certain events to occur.In this movie, weaponized robots are controlled by people. The concept that one rogue robot try to make decisions for itself (collecting information from the environment) is basically a failsafe that most devices have and is quite logical in sophisticated systems designed to be autonomous if necessary.Characters (particularly the people being attacked ) act realistically. The Navy Seal try to save everybody but when thinks get ugly he takes of doing nothing and letting people being killed, in order to avoid worse things.People are really afraid and act based on their stress; not always right but with a logic.Sadly there are some melodramatic long scenes that should have been edited or changed. Those scenes slow down the pace and are somewhat unnecessary.The end even in my opinion too melodramatic, follows a logic; nobody will create a machine that powerful without a safety rule of protecting human life (Asimov).I can only say that Director and Screenwriter Mark Toia has made an incredible job in what appears to be his first and only film. I can only hope he gets more opportunities because his talent is undoubtable."}, {"id": 89, "text": "Thoroughly entertaining. Lots of suspense and brutally confronting scenes. Stark reminder of where the world is headed. Great cinematography, great editing, soundtrack, acting, and the robots were plain nasty! Great work all round."}, {"id": 90, "text": "It was an ok movie just ruined by the kid actor with his huge overacting. Good thing is he made the acting of the rest look better. For the rest of the movie, cool robots, nice scenery and action. A bit too long, half an hour shorter would have made it more polished."}, {"id": 91, "text": "Killer robots, hard core special forces soldiers and nerdy programmers - what is not to like? Only rating 9/10 because the movie is about 20 minutes too long."}, {"id": 92, "text": "Some weird choises, written in by the writers, like screaming out loud while you're being followed by robots, or calling out for your friends, But besides that, pretty okay movie. And again. The robots look really good. Even real sometimes. Didn't understand why nobody took pictures or made video with their phones though. But I will watch again."}, {"id": 93, "text": "Ok...the action? Decent. The acting? Eh. Annoyingly unrelatable. The concept, fairly realistic. Length? Too long. The robots? They were cool. The plot? Kinda lacking but predictable. The ending leaves you wanting more and disappointed."}, {"id": 94, "text": "The only thing good about this movie is the CGI of the robots. The acting was atrocious with a couple of exceptions.I don't think the people who played the doctors have acted even once beyond sitting around in a circle in classroom practicing lines"}, {"id": 95, "text": "I think this movie delivers the message pretty well. The money collected by taxpayers are spent into technology and weapons by governments into creating 'monsters' to cause terror in far away countries. We've already seen this in real life recently; like the US military using depleted uranium weapons on the battlefield in Iraq and Syria, or the Iranian scientist remotely assassinated by satellite controlled machine gun, 500,000 child-death in bombings for Iraqi sanctions... People who vote and pay taxes are all responsible for the actions taken by their government."}, {"id": 96, "text": "Obtain at first it quickly becomes redundant. Not bad but don't expect much."}, {"id": 97, "text": "Nobody stopped and said no? Ridiculous plot, terrible script, dialogue and acting. The only thing this movie has got going for it is visual aesthetics and decent CGI."}, {"id": 98, "text": "Bottom line:Not terrible, not wonderful.Good:Effects (not saying much as most effects these days are believable)Best actor in the film was the little Cambodian kid. He had a couple of scenes which genuinely pulled at my heartstrings.Bad:Whiny, strident, screeching, 2-dimensional characters played by actors who think that hyperventilating is the best way to convey fear, excitement, and nearly every other emotion.I didn't care if anyone of them died. In fact, I was rooting for the robot to clean house and just blow them away.Some of the acting felt really forced and try-hard, like a 9-year-old was trying to impress their parents with a dramatic reenactment of what they saw an amateur do on TV.I've noticed this trend in recent movies - this forced kind of acting, even in huge budget movies like the most recent Star Wars installments. Take note of how many times the actors hyperventilate when they are afraid, excited or just trying to talk to someone. Forced and one-note.If you want examples of fear expressed wonderfully, watch Ripley in Aliens when she first discovers the queen, or the scene when Tom Cruise pulls off his mask in the middle of a gigantic room full of menacing masked onlookers in Eyes Wide Shut. These are great examples of believable fear emoted without having a damned asthma attack.I feel like writers and actors of today don't understand nuance or subtlety. It's all over-the-top popcorn variety schlock. Just fill the screen with screaming meat targets and that should be enough to make the audience to feel sorry for them when they die.They think the way to invoke tension is by directing actors to shriek and shout at everything when things get a little tense. They don't know how to balance it out with some humor or downtime.Millennial writers and actors could learn a lot from old school classics to learn how to better their craft and make characters relatable and even likeable.Movie wasn't terrible, but this trend of mediocre acting doesn't help the its rating."}, {"id": 99, "text": "I went into this movie not having even seen a trailer and honestly with the current situation new releases are few and far between I have been watching movies recently that I never would have under normal circumstances.Although fairly simplistic in it's plot, Monsters of Man was very good for what it intended to be with a good story, good practical effects, those robots looked good, and fairly good acting. A good action movie with shocking violence, including against women and children, which is almost unheard of, and makes those scenes a bit difficult to watch.I didn't recognize any of the actors except for Neal McDonough, but I can't say that any of the actors did a bad job. My only complaint is that there is one scene where you can't tell the robots apart, I won't spoil anything, but not being able to tell them apart takes away from that scene.Mark Toia had no credits for anything before this, but kudos, I was presently surprised, though it seems he is somewhat a narcissist, placing his name in the credits as Executive Producer twice and as Producer all before crediting the actors, so you basically see his name 5 or so times before the acting credits, all in the opening credits.Recommended"}, {"id": 100, "text": "Not a terrible movie, just not very original, and no single plot thread really stood out as the overarching story. A little bit existential AI crisis, a little bit shadow government baddies, a little bit innocent bystanders trying to survive. I would definitely give another star if the story were simply tightened up.The acting is a little lackluster, sometimes kind of hammy, but it wasn't terrible.Cambodia was beautiful, but the static bad guys on the phone with each other in separate rooms was boring.Even with action sequences, this movie took forever. I was a little bored at times.But it's not bad. Just has nothing new to add. (Granted, I watch and read a lot, so I've got a large base to draw from.) It's okay, yet I can't say it's actually worth watching."}, {"id": 101, "text": "...and very impressively so, that this was an amateur filmmakers first ever dabble with filmmaking! Sure this film had its flaws, but considering Mark Toia has never been a cinematographer, never written, produced, or directed anything in his life before, I say mad respect and serious props to you sir!So to those wannabe critics who gave this film 1's and 2's, give your heads a shake and learn to respect the work of an amateur filmmaker trying to make his mark in the industry. They all have to start somewhere, right? And I have to point out, that I've seen much worse films put together by seasoned filmmakers. So for Toia to wear these many hats and pull this off, this film should not be rated anything less than a 6/10.Now my main disappointment that could've so easily been avoided, was Toia's writing. Aside from some of the plot and technical issues (e.g. when you're caught between a rock and a hard place, always take the weapon!), the length of his screenplay's final cut runtime of 131 mins was absurdly long. There were far too many long, dragged out and unnecessary scenes. E.g. when kid's gangster dad dies, the ongoing crying, group hugs and whines was utterly and annoyingly ridiculous. And there were many of those scenes. So when I said could've so easily been avoided, Toia either needed an experienced editor and/or seasoned writer to look over his script, and cut out at least 20-30 mins. His pacing was actually quite good, that a 90-100 min runtime could've made this film great, instead of just good.Aside from Neal McDonough and Jose Rosete being the only recognizable and experienced actors, the remaining unknown and unexperienced cast performed impressively well. Sure, some where a little over the top and borderline annoying, but keep in mind they were being guided by an inexperienced director.The film's location settings were beautiful. The score was actually not bad and fitting, especially considering almost every B film's score is usually unfitting, overbearingly loud and annoying. The S/VFX were on point... I'm mean those robots were Chappie quality viewing.Toia is certainly an upcoming filmmaker to keep an eye out for. Thus with more positives against a few understandably amateur negative mistakes, Toia's Monsters of Man gets a very deserving 8/10 from me. I sure hope with his ending, a Part 2 will get made. To see my review and rating system, or more of my 1000+ reviews, click on my username."}, {"id": 102, "text": "REVIEW - MONSTERS OF MANa few years ago iRobot was released about robots which were programmed to be evil but one developed its own consciousness and spread this through other robots, previous to the if you're as old as me then you will remember Short Circuit.Ok imagine these 2 films but without the comedy set today in a jungle where there military killer robots are under going testing.Of course something goes wrong and with reference to what I have written you can possibly guess what.In parts this film also reminded me of Chappie which for me personally is by far the best film of this genre.Twists and turns in the story do keep you interested, some of the acting can be forgiven because of one very simple fact, the entire film was crowd funded, yes no big studio paying millions of dollars but ordinary people donating and because of this, the robots, the story I simply must give this a good score.Not the best but certainly not the worst by far!Rating 7 out of 10"}, {"id": 103, "text": "This is a slam bang, action-packed, thrilling, roller coaster ride of a movie!Believe it or not, this movie did not come out of a major US motion picture studio. It was crowdfunded! It's actually an Australian film. I believe the majority was filmed in Cambodia. And I also believe that their website says something about it being filmed in 4 countries.I'm really not quite sure what the budget was. The film's website does not specifically state what the budget was. What it does say is that so many people donated so much money each. And it says that twice with different numbers, so it's kind of confusing. I may be wrong but it appears that it cost approximately fifteen million dollars. I may be doing the math wrong, and I may be way, way off. And if so I apologize. So to be honest, I guess I should probably say that I do not really know how much it cost to make.What their website does say though, is that the film was produced for only a very small fraction of the amount that it would have cost a major motion picture studio to make.I have seen movies from major motion picture studios that cost $150,000,000 that were not as well done or entertaining!I would have to think long and hard to think of another movie that had entertained me so well! Don't get me wrong, there are lots of other movies that I have seen that were very entertaining and well done also. But that's not the point. The point is that this is an excellent film.From the very beginning the action starts and it never ever really lets up! Every single aspect of the film was excellently done.You won't want to step away for a second. The acting was excellent. The music was excellent. The Special effects were excellent. And the scenery was excellent and beautiful.The whole movie was top-notch. I could not find fault with a single aspect of the movie. Well, there is one little tiny little nitpicking detail at the end that I could complain about. But to do that would require telling too much. And I don't want to do that. And to be truthful, it's not really something that was wrong about the movie, it's just that I think that I would've preferred something different to happen. But that's just my opinion.Anyway. I could go on and on and on. But suffice to say, that it was the best 2+ hours I've spent for a long long time.It never dragged, and the movie kept my attention the entire time.Kudos to all who were involved in the making of this film. I have seen many, many films come out of major motion picture studios that were much lower quality compared to this film!In fact, I will even go so far as to say, that it was one of the best movies that I have seen in a long, long time!Do yourself a favor and do not miss this movie! You will not regret it. The ratings here do not allow half stars. But I think it deserves at least 7 1/2 out of ten! Go see this movie. You WILL enjoy it."}, {"id": 104, "text": "Mark Toia(and Carolyn Totia) created a pretty brilliant bit film making here by utilizing something more than just a 'Hollywood formula'. The innovations were very subtle in how the script was both allowed to flourish, and also flounder in areas. (probably executives in expensive suits holding him back when it DID flounder a bit) The slight faults really don't outweigh the overall brilliance of the production as a whole. He got this done in a very solid and satisfying way. My ONLY peeve with most movies is that they tend to over dramatize the grief moments, or hugging each other when they should be running for their damn lives. Cutting those moments by 2/3rds would be ideal. If I was a multi-millionaire, I would back his sequel to this film balls-to-the wall with ZERO 'Hollywood' influence and interference. It's very hard to keep a movie like this on-path with so many production people(and princesses) wanting to have a hand in the outcome. Despite all that, he succeeded, I believe. It's a film that has extreme subtleties that are missed by most viewers. There was a great amount of suspense in this film, albeit short-lived, but palpable and effective.Most scifi indi-flicks fail because of ego, a lack of ingenuity, laziness, bad writing and acting, but barely ever a lack of funding. That brilliance is usually always manifest, regardless of funding by appropriate script writing, casting, attention to proper editing, and especially believable acting. I can see some Hollywood executives wanting this film to disappear from the public's attention because it's premise is absolute gold! As is a sequel more than worthy of expectation. Seems like like Mark did indeed see that as how the ending resolved itself. I rarely stand in awe of such attempts unless a certain dedication of integrity to consistent story telling shows itself. I should also add that most reviewers of films on IMDB should be allocated to small islands in the most remote of places on earth with a few bananas and zero internet access. As a writer, I would work for free on Mark's next production because I solidly believe in the dream he has created. I wish him and his family the greatest success and future promise of building this franchise to greater heights, if only to finally set a new standard for what it is, and what it could eventually be. (And NO, I am not affiliated with any damn blah-blah of the cast and crew.) See it. Don't be a 'critical princess'. Just enjoy it!"}, {"id": 105, "text": "The film would deffo be interesting to some Sci-fi buffs, However it is one of them films where there is wayyyyy too much crying from people on it? Almost every time you see the group there are one or more people crying or screaming rather than being quiet and trying to figure out how to get away from where they are? I mean I would say that around 85% of the time you see the group someone is crying and it gets a bit boring after a while...Ths CGI is a comfortable 8/10, the plot is a 6/10 a kinda Seen it all before type of story, The acting is really good thou! the only weakness I found was with Boller's realism (Jose Rosete) as he seemed to be giving out an aggressive attitude that didn't fit the character,The two IT guys acted great and realistic who took most of the pressure in the film as they where the main two people if you ask me.Overall I did skip a lot of parts of the 2:11 minute film more so where the camera was on the group of people and yet again someone was crying...I think if they reduced the volume of crying it would cut the film down to about an hour an half, Honestly there really is more crying on this than any other film I have seen and it really ruined it for me.I would NOT give the film a low score because a good deal of effort was clearly put into it but thats not without weaknesses and plot holes, So a generous 6/10 for me! it lost 3 points due to the Crying Tsunami and lost another point for the plot which could of been slightly changed and made a lot of difference.It is worth the watch IF you can handle the crying..."}, {"id": 106, "text": "The concept of the movie had promise. The CGI of the robots was first rate. Their design and motion look very realistic. Whom ever did the motion capture did a superb job. I'm sure the robots would have been extremely likeable if they were good robots.But the movie have many flaws:1. The movie is tad long - not a problem if the movie was engaging - but this does not always deliver in that department. 2. Mediocre acting - some overacting and many wooden acting 3. Very hard to like the main characters - what's with keep quiet don't they understand?But most of all what the movie needed most, is great direction. It needed a better director to lead actors and control the pace of the movie.Conclusion: If you have nothing else to watch, go ahead. Just have something else handy to do for the boring parts.A mediocre rating for a mediocre movie."}, {"id": 107, "text": "Nice things to say about this movie: Interesting core plot concept, good cinematography, cool bot design, and decent effects.Unfortunately, those aren't enough to carry this film through its awful script. The characters and dialogue are often clunky and downright unpleasant and there's a severe lack of editing on display. There are sooooooo many absolutely unnecessary scenes and scenes that just drag on repeating the same thing over and over.There's no reason whatsoever for a movie like this, where it's just a group of people being chased through the jungle by robots, to be over 2 hours long. This movie said everything it had to say in the first hour and should have started wrapping up after that point, but it just keeps going and going and going, despite the fact that it never explores its concept beyond ROBOTS BAD (a tone it sets immediately with the opening text crawl describing how there are over 200 companies in the world designing robots and AI and they're ALL chasing big military contracts, which is a weirdly ignorant claim).Go check out Kill Command if you want to see basically the same story, but done much, much better."}, {"id": 108, "text": "I was shocked by how good this movie turned out and how much I enjoyed it. I gave it a go after being impressed by the trailer. I was expecting trash but for a low budget indie movie I thought it was surprisingly good and looked really professional. And I'm a sucker for cool looking robots.The movie was really well filmed. I'm not sure what it was filmed on but it didn't have that cheap 'filmed on a phone' look, which I appreciated.The robot designs were great. They had a very realistic Boston Dynamics look to them and the CGI was for the most part excellent.The cast and the characters they played were decent too. The acting was solid over all and the one really annoying character (the blonde bearded dude) actually grew some balls, started making smart choices and had me routing for him by the end of the movie.My only complaint was the running time was a little too long. It got a little repetitive towards the end. At 131 minutes I was waiting for it to wrap up with around 15 minutes or so left to go.I recommend giving this a watch. It's well worth your time. Well done Mr Toia. I'll be keeping an eye out for your next project."}, {"id": 109, "text": "The young doctors are naive, fearful, screechy and annoying, but at least they are nice people, unlike the Drug Gang, and the CIA types. I was wishing for the doctors to shut up and get their emotions under control so they could survive. It takes about 10 minutes to learn this when deer stalking. Crying and yelling and pleading and whimpering and limping. Hurry up! Oh it took 2 days to figure out that they were tracking them by GPS in the stolen device---dumb for a Navy Seal. I liked the Terminator type robot. And I liked the Navy Seal and his Cambodian girlfriend. Noticeable how the amazing killer robots missed so many easy shots. Also, they were invulnerable to bullets.I would have expected dents and cracked camera lenses. I sort of felt for the civilian programmers caught up in this sordid affair and obliged to keep connecting and programming. They annoyed me too tho, very excitable and angry. I real terms there were not enough assets on the ground for the scope of this job. And as too the reality of these things. yes they will be monsters unleashed if they ever happen, and the real evil is in the people who see them as a necessity and use them. I note that the people who pilot drones over Iraq and Afganistan often suffer PTSD from the remote killing that they do, just like snipers do."}, {"id": 110, "text": "Monsters of Man is full of technical flaws and silly inconsistencies, but the robots look great, and the performances were believable, plot progression was fast enough to keep me interested the whole time.First the robots looked great, they are humanoid terminator/chappie style, they look menacing and are effective as you would expect them to be. Though like all super vilians, they are super quick dead shots when shooting at extras, but miss too often when shooing at named characters--I give this a pass since that's every action movie. The AI/learning/upgrade element of the robots had parallels to the Venom movie, which I found nostalgically predictable, but still fun. Quirky bugs in the robots make them certainly less effective than a terminator but help to balance out a lopsided match-up.The human characters do a decent job and I quite liked how the bad guys were portrayed, Jose Rosette turned in a solid tough bad guy performance, but on the good guy front most of the characters were not that compelling, but certainly passable.For a movie that's over 2 hours I was entertained start to finish, I can think of probably dozens of movies this drew inspiration from and it was blended into a stylish modern good looking sci-fi action flick, with plenty of nostalgia, go into it less seriously and I think anyone can find something to like."}, {"id": 111, "text": "Some parts of the film had real potential: the drama of the tech guys stuck between their job, their passion and their principles or the semi conscious robot, but they went nowhere. Also, the other parts of the film were pretty bad. Overall I would say that it was a good effort, but way too long for its valuable content and ultimately boring. Wasted opportunity, this film was. I mean, it wasn't that far apart from District 9 in terms of acting and effects, but the story and plot were vastly inferior.There were easy fixes, too. For example instead of a bunch of random Americans in the jungle, the main character could have just saved a bunch of the locals. The whiny young people that wasted most of their screen time brought absolutely nothing to the story and they probably got paid quite a lot for their mediocre efforts. And there is a scene in the trailer that makes you believe this could be something else, but it's the end credits scene, which is a dick move.Bottom line: mediocre film in which the most sympathetic character was a mute robot."}, {"id": 112, "text": "My wife was amused as I was screaming away at the storylines. But not complaining the story. It's one of those movies that has characters that are believably real. Plots happens coz it could and are logic. We see nerds tripping over rocks and stairs while running coz they don't run often. So they fall. We see frustrations when things go wrong. Real frustrations. Frustrations that make them do the exact same thing when they are stressed even though they know it has consequences for themselves. But it's their character. We see people who can cope well with stress coping well (they are the higher ups). Actual medical students attitudes are almost real. I've trekked through jungles before and being a doctor, I can relate to them. There's always the high strung one, the wannabe-cool one, the panicky one.The robots are good. Design and animation flawless for me. There's robot vs robot action. Man vs man action. Some robot vs man action and they do not drag on. It's short coz logically in real world normal people, even trained people in normal situations get tired. Anyone who has fought in competitions would not that 2 minutes is a long time.It does become draggy a bit in the middle. There are some plot holes. Overall good. Might have been better if they get a well known actor but then if it's an action-hero, it's gonna focus on that; the fighting action. This movie is kinda like Predator + Short Circuit + Hard Target + Halloween (maybe).Hope there's a sequel!"}, {"id": 113, "text": "Rapid paced dialogue with a gaggle of unlikable idiots who are apparently controlling a squad of killer robots in some outback craphole. I mean, what?What is the plot of this movie? It seems the morons make the robots more violent, then they are surprised they are killing civilians. Somehow the plot keeps dragging on and they get another robot to attack the other robots? I don't know, why can they command this one and not the other one... because of reasons.The entire wafer thin story is stuck together by spit and bubblegum that is technobabble and unrealistic unfounded sci-fi nonsense bordering on magic. Please do some research on programming, AI, robotics and anything else related to this topic before writing an over 2 hour long movie.The film was dragging at 15 minutes in, and got worse. By half way my brain felt like it was oozing out of my ears. There are no characters for you to get behind or two like and enjoy. There is no character development, none.If you wanted an annoying and illogical robot movie there are tons to pick from that are at least watchable like 'Robocop' or even better go watch the entire 'Terminator' franchise. Yes the later movies are crap but they are at least better than this.4/10 below average sci-fi with annoying idiots for characters and little plot."}, {"id": 114, "text": "In 1973 a groundbreaking science fiction movie was released entitled Westworld, written and directed by Michael Crichton. If the Monsters of Man script had been slightly revised, the title could have been SouthEastworld, written and directed by Mark Toia, featuring a bunch of college students on spring break visiting a sci-fi theme park in a Florida swamp, and getting way more excitement than they paid for.If nothing else, this movie serves as a warning to new writer/directors, even those who feel they are at Crichton's level, to confer with straight-talking critics, and do so often. Some of Monster's many problems might be avoided, including an overlong run time, dialog appropriate for potty-mouthed adolescents rather than adults, and the vomit scene that appears to be obligatory in all action movies these days.Ending on a positive note, the lead actors did fine considering the script they had to work with; e.g., some of them sitting at desks for half the movie looking really stressed, and others looking even more stressed as they try to escape trigger-happy robots."}], "reviews_amount": 115}