{"name": "Tora Tora", "titleId": "tt06656262", "reviews": [{"id": 0, "text": "We have seen time travel movies but not like this one. They are supposed to be confusing but this movie explains it all at the end and makes everything better.very Entertaining."}, {"id": 1, "text": "This is very nice and amazing . I like it very much because it is very cool."}, {"id": 2, "text": "I like this movie very much.A real entertaining movie.The plot keeps the interest level of viewer at a higher level throughout its runtime."}, {"id": 3, "text": "The movie narrates the time travel concept very well. The screenplay is taken care well with no loop holes till the end and entertaining throughout. Liked the background music and end credits song.This movie stands apart the normal films being released with the different concept. Need to encourage this kind of movie in kannada film industry"}, {"id": 4, "text": "I like this movie very much.A real entertaining movie.The plot keeps the interest level of viewer at a higher level throughout its runtime."}, {"id": 5, "text": "The movie was very good. The students get the Time Machine and used it to change their past."}, {"id": 6, "text": "The concept in the movie is very good . the students gets the Time Machine and and use it to change their past."}, {"id": 7, "text": "A wonderful movie with lots of wonder and challenges , Thrill and very nice concept based. Really Enjoyable"}, {"id": 8, "text": "IT's Really Exiting movie like it's name Tora Tora I remember the Tora Tora ride"}, {"id": 9, "text": "This movie begins with a normal opening but as the story moves forward, the blasts, punches, twists... full on entertainment is great Great and unique attempt to present a story like this on a screen."}, {"id": 10, "text": "Must recommend movie guys I really enjoyed superb quality and dialogue delivery"}, {"id": 11, "text": "Very thrilling movie edge of the seat experience in the climax scenes worth the time you have spend"}, {"id": 12, "text": "Wonderful movie all should watch very fun in the movie"}, {"id": 13, "text": "Wonderful movie all should watch there was lot of fun in the movie"}, {"id": 14, "text": "Super duper hit cinema i like this cinema.Willing to see as many times as I see"}, {"id": 15, "text": "I'm not a fluent Kannada speaker but I can understand the language. The casting and the characters and introduced nicely. The plot had a few corrections though.The story of the film is like a jigsaw puzzle, which is later pieced together once the time machine comes into place. While this could have been an enjoyable journey and activity, it is dampened by the fact that every single twist or turn is explained in great detail, which takes away the joy of watching. The film ends up having way too many dialogues, which seems to weigh down the screenplay at different points.Tora Tora has a talented young cast of newcomers, but they seem to have been briefed to over react to situations. Overall its okeh for a one time watch."}, {"id": 16, "text": "Nice family entertainer full length family entertainer"}, {"id": 17, "text": "Just finished watching. Its every bit amazing. Quite entertaining. Mind twisting."}, {"id": 18, "text": "A complete paisa wasool pot-boiler....fully engaging and entertaining"}, {"id": 19, "text": "A time machine and the whole drama surrounding it would make up a cool movie plot for sure. However, Indian cinema has been keeping a distance from this topic until Tora Tora. Harsh Gowda crafted a humorous entertainer using this and I enjoyed every bit of it. The plot keeps the interest level of viewer at a higher level throughout its runtime."}, {"id": 20, "text": "This movie stands apart the normal films being released with the different concept. Need to encourage this kind of movie in Kannada film industry"}, {"id": 21, "text": "Extraordinary movie...you must watch. in this moive you not bore at any moment. extremely very good movie."}, {"id": 22, "text": "Tora Tora is a skillfully made (writing, cinematography, editing, sound), well acted, cohesive and internally consistent story that has the ability to elicit emotion, set mood and guide a reaction.Highly recommended to all."}, {"id": 23, "text": "Mujhe to bahut hi achaa laga , comedy movie he i am give thanks to him , who make this movie"}, {"id": 24, "text": "New concept. This time in Kannada with time travel. Enjoyed every bit. 😇"}, {"id": 25, "text": "Tora Tora is well directed clean family movie with all pinch of comedy. A real entertaining movie which kept alive the interest of watchers throughout the film.I like this cool movie very much."}, {"id": 26, "text": "This movie stands apart the normal films being released with the different concept.i like it very much.and enjoy it.recomended it.thank you so much."}, {"id": 27, "text": "Good movie to watch for all ages. Nicely performed by the cast and crew. Personally I liked the DOP more. Kudos to the team. keep going."}, {"id": 28, "text": "Waw........great movie that I ever seen...based on time travell"}, {"id": 29, "text": "It is really one of the best sci-fi comedy film. The real family entertainer .All characters are funny and acting is also good. Bole to paisa wasool movie."}, {"id": 30, "text": "Really a good movie I have ever watched. Don't miss any scene,every scene is inter-related to some other scene. Story gets more curious while watching, gets confused also. But really a good movie in sandalwood. Bhuddhivantharige Mathura😉"}, {"id": 31, "text": "Very nice movie and entertainment movie.i like it..my family's favorite movie.thank you"}, {"id": 32, "text": "One of the best south Indian Science fiction movie i watch"}, {"id": 33, "text": "In a time travel movie. The sci-fi sub-genre has been explored so frequently that reinterpreting the rules of traveling through time is often more trouble than it's worth."}, {"id": 34, "text": "Tora Tora movie very nice movie this movie concept time travel concept and movie makers and actress and acter very good work this movie very nice movie good job makers"}, {"id": 35, "text": "Time travel concept very well. The screenplay is taken care well with no loop holes till the end and entertaining throughout. Liked the background music and very nice movie good work"}, {"id": 36, "text": "I must say it's a nice movie.. i've seen this movie many times.. this one of my favourite movie.. every moment of this movie will make you excited.. i request everyone to watch this movie once."}, {"id": 37, "text": "A very cool attempt at time travel, everything is done pretty well and The movie is so underrated right now. The story keeps you wanting more and more and doenst let you lose interest . Overall Great Movie!."}, {"id": 38, "text": "This is an amzing movie which everyone can watch with family. No over drama. each character played the role very nicely. Time travel concept is presented in a craetive way. It entertains the viewer from start to end. Highly recommended to watch."}, {"id": 39, "text": "Have lot of fun . Great work . Tora Tora😍. I watched this whole film with a smile in my face"}, {"id": 40, "text": "I like this movie very much.A real entertaining movie.The plot keeps the interest level of viewer at a higher level throughout its runtime."}, {"id": 41, "text": "Good movie nice comedy of the movie. Most game playing movie"}, {"id": 42, "text": "The movie narrates the time travel concept very well. The screenplay is taken care well with no loop holes till the end and entertaining throughout. Liked the background music and end credits song.This movie stands apart the normal films being released with the different concept. Need to encourage this kind of movie in kannada film industry"}, {"id": 43, "text": "Plot is amazing and movie is excellent.the movie is based on time travel one must watch this sci-fi movie A time machine and the whole drama surrounding it would make up a cool movie plot for sure."}, {"id": 44, "text": "Wonderful movie all should watch there was lot of fun in the movie"}, {"id": 45, "text": "Never seen a time travel concept movie in kannada language before,I would say its worth a try.You have to appreciate this concept and you have to give a try."}, {"id": 46, "text": "Exellent movie great..and this story is very good and his direction is soo good"}, {"id": 47, "text": "The movie narrates the time travel concept very well.The screenply is taken very well i enjoy the movie"}, {"id": 48, "text": "This the best comedy video i ever seen, also family video.The casting and the characters and introduced nicely.Tora Tora has a talented young cast of newcomers, but they seem to have been briefed to over react to situations. Overall its okeh for a one time watch"}, {"id": 49, "text": "Nice Movie &amp; Used Time travel Efficiently very nice to watch"}, {"id": 50, "text": "This is an family movie and good movie were steaming with your friends and family."}, {"id": 51, "text": "Everybody should give it a try, It's sensational. Watch it and you will love the work."}, {"id": 52, "text": "What a making and direction.... u should watch ...... fun and thrilling"}, {"id": 53, "text": "Perfect entertaining movie through out the end. Needed to be encouraged this movie."}, {"id": 54, "text": "Nice movie. About friends. Recollection of past memory."}, {"id": 55, "text": "Very Interesting Movie &amp; wonderful full Movie Very Funny &amp; actress Very telented Work This Movie I am All Movie Watching &amp; Enjoy This movie"}, {"id": 56, "text": "The movie is fun and it narrate the story properly with no loop holes. I just love the music is superb."}, {"id": 57, "text": "Just finished watching this amazing movie! its really beautiful...must watched!! those characters are really touching.. i never imagine a movie could be this perfect!"}, {"id": 58, "text": "Very thrilling movie edge of the seat experience in the climax scenes worth the time you have spend"}, {"id": 59, "text": "Awesome and amazing movie ,, i like this movie,, i wanna be part 2 ,, i wanna watch more n more"}, {"id": 60, "text": "This is a well written and well performed original film. With a lot of repetitive cinema these day i felt this was something new. I felt connected and engaged with the character throughout the film. There are several well directed tense moments throughout the film. A popular topic of class struggled well portrayed."}, {"id": 61, "text": "Nice trailor, it is very twist.I respect this trailor"}, {"id": 62, "text": "One time watchable .Could have been better. People expect much while watching a time travel. The movie got pace at some moments. Some people might find it interesting."}, {"id": 63, "text": "It was wonderful movie. the time machine concept was old but it was entertaining , thye was some lack in vfx but the acting and storyline was cool and easy to understand. so it is overall nice move you can watch this single time ."}, {"id": 64, "text": "I like this movie very much.A real entertaining movie.The plot keeps the interest level of viewer at a higher level throughout its runtime."}, {"id": 65, "text": "Nice and fentastic. 🤗🙄😋 Best movie. And good actors"}, {"id": 66, "text": "Very enterining and funny movie . u can watch this movie with your family . very interesting don't missed it ."}, {"id": 67, "text": "Its a veriety consent movie. I am satisfied with this movie , because it's have fun as well as twist."}, {"id": 68, "text": "This is a best movie for fun category Let's enjoy your free time with tora tora"}, {"id": 69, "text": "Good movie has few trilling and guessing moments though a definite watch grab some popcorn and enjoy you wont be"}, {"id": 70, "text": "If I talk about my childhood and again returning to that but it's not genuinely possible! But Tora Tora made it possible to go back in my past. It's the really best and thrilling as well as suspensive movie I ever seen. I loved it."}, {"id": 71, "text": "I like this movie.Really entertainment movie.i will suggest for everyone for loving time travellers."}, {"id": 72, "text": "A must watch entertainment for sure watch it now on amazon prime movie has suspense throughout"}, {"id": 73, "text": "Film takes after a riddle game, plot has a pleasing outing every single bend or turn is explained in uncommon detail, which evacuates the joy of survey. The film having an exorbitant number of talked, which seems to trouble the screenplay."}, {"id": 74, "text": "I like this movie very much.A real entertaining movie.The plot keeps the interest level of viewer at a higher level throughout its runtime."}, {"id": 75, "text": "The movie narrates the time travel concept very well. The screenplay is taken care well with no loop holes till the end and entertaining throughout. Liked the background music and end credits song.This movie stands apart the normal films being released with the different concept. Need to encourage this kind of movie in kannada film industry"}, {"id": 76, "text": "The story of the film is like a jigsaw puzzle, which is later pieced together once the time machine comes into place. While this could have been an enjoyable journey and activity, it is dampened by the fact that every single twist or turn is explained in great detail, which takes away the joy of watching. The film ends up having way too many dialogues, which seems to weigh down the screenplay at different points."}, {"id": 77, "text": "I like this movie very much.A real entertaining movie."}, {"id": 78, "text": "Good concept ,i enjoyed the concept of being time travel and consequence of altering time."}, {"id": 79, "text": "Tora tora is a science fiction movie. some bunch of college students accidently have a time machine and the movie revolves all around this . because of college life ,it have some comedy and drama."}, {"id": 80, "text": "One of the best travel movie in Kannada language...!!"}, {"id": 81, "text": "Great movie...but as you know there is no chance for good movies at present...all we need is some hyped movies...with no logic!!!!"}, {"id": 82, "text": "Nice enjoyable movie with lots of joy etc etc etc good story line"}, {"id": 83, "text": "Very nice movie, you ll not get bored at any point. full of excitement and surprises in every moment. MUST WATCH!!"}, {"id": 84, "text": "This a newe age kannada film with the new actors.This film is a good entertainer,has a peaceful comedy.A new age film a time travel concept.Worth watching the film"}, {"id": 85, "text": "Must watch Indian film for everyone. So entertaining sci-fi movie."}, {"id": 86, "text": "The concept in the movie is very good . the students gets the Time Machine and and use it to change their past."}, {"id": 87, "text": "I like this movie very much.A real entertaining movie.The plot keeps the interest level of viewer at a higher level throughout its runtime. very good."}, {"id": 88, "text": "Very nice movie I enjoyed lot I am requesting every body should see the movie"}, {"id": 89, "text": "This movie is really amazing. It is full of fun and interesting. I like it. Thank you"}, {"id": 90, "text": "It was a amazing graphics and story line was also amazing.I enjoyed alot and strongly recommend this movie"}, {"id": 91, "text": "It's a very good movie with a very entertaining plot. But the dialogue delivery of the actors could have been better."}, {"id": 92, "text": "The film might have been a trendsetter if the execution was fine. Harsha, who designed the script well didn't concentrate well on the screenplay.Siddhu Moolimani has performed naturally in the given role. the time machine film that has the fresh star cast is a onetime watch."}, {"id": 93, "text": "The movie narrates the time travel concept very well. The screenplay is taken care well with no loop holes till the end and entertaining throughout. Liked the background music"}, {"id": 94, "text": "Got no words to say about it ,This movie is truly a masterpiece that requires some attention."}, {"id": 95, "text": "When I started watching this movie I was little bit confused about the story but after sometime I understood. But, the concept of this movie is fabulous and I like this."}, {"id": 96, "text": "New type of story to kannada audience.A new concept in kannada. Good movie but the movie is not hyped compared to other movies if the movie is properly hyped during pre release the movie will be a hit."}, {"id": 97, "text": "It's look like real Tora Tora in fun world. It's enjoyable for all genre."}, {"id": 98, "text": "The concept of the movie is based on Time Machine. The students get the time machine and use it to travel in the past just in the hope he could change his present by going back to the past. The characters have been narrated very well. Indeed a must watch movie."}, {"id": 99, "text": "I like this movie very much best entertainment movie . Family movie good time passing movie . Actors are amaze"}, {"id": 100, "text": "The movie is pretty awesome i had already watched it before and i has found it pretty interesting as i am a big scifi fan all the people who will watch this movie would not feel cheated a must watch"}, {"id": 101, "text": "I like this movie very much.The plot keeps the interest level of viewer at a higher level throughout its runtime. And It a entertaining to me because of the time travel... I like these types of movie."}, {"id": 102, "text": "There aren't too many films that deal with time travel in Kannada, which surely set Tora Tora apart from the regular films,The story of the film is like a jigsaw puzzle but overall good to watch ."}, {"id": 103, "text": "Concept of the movie is good and the portion where the students uses time Machine is well captured."}, {"id": 104, "text": "Found the movie quite dragging in the first half, then it gets on to you , liked the way screenplay was written , concept is not unique but i appreciate how the makers took the pain to make it interesting and funny at the same time."}, {"id": 105, "text": "The cinematography, the acting of each and every actor, the concept everything looks very good."}, {"id": 106, "text": "I sow this movie in amazon prime. It was very entertaining and suspended movie. Everyone have to watch this movie at least one time. thanks."}, {"id": 107, "text": "This is very Nice and amazing. Cool family time spread type"}, {"id": 108, "text": "Very good movie. Time travel concept. Must watch. I like the movie very much. Family movie."}, {"id": 109, "text": "This is very nice and amazing . I like it very much because it is very cool."}, {"id": 110, "text": "Good movie, you can see with family. Very nice story line. Interesting adventurous"}, {"id": 111, "text": "Tora Tora movie very nice movie and this movie very interesting movie time travel movie and collage students Life very nice"}, {"id": 112, "text": "Nice family movie plus comedy watc this on amzon prime video"}, {"id": 113, "text": "I don't want give a spoiler, I recommend to watch it."}, {"id": 114, "text": "Tora Tora good movie to watch. It is full of comedy and.priceworthy. Charlie dog good character. Character played by Sidhu , Natrajan , pooja, gagan, manju, anirudha are sensible and incredible. Pls watch movie and spread happiness"}, {"id": 115, "text": "I'm not a fluent Kannada speaker but I can understand the language. The casting and the characters and introduced nicely. The plot had a few corrections though.The story of the film is like a jigsaw puzzle, which is later pieced together once the time machine comes into place."}, {"id": 116, "text": "Great picture.. Nice screenplay.. Actor's performance was amezing.. And also a family masterpiece.."}, {"id": 117, "text": "This movie is osm riyali good movie. Movie script is osm and auction and acting wonderfulWatch the movie"}, {"id": 118, "text": "I really like this movie while fully family entertainer"}, {"id": 119, "text": "I really like this movie and it's a fully entertainer movie"}, {"id": 120, "text": "Entire cast and story is very good. Veeery gooooooood movie."}, {"id": 121, "text": "Wonderful movie very good movie and it was nice movie and it will take"}, {"id": 122, "text": "I liked the movie when i saw the trailer itself.It comprises of a gang of students and they get atime machine.they engaged in spending on it to see the past."}, {"id": 123, "text": "Its about people exploring a time machine a group people and that's what the story revolves around. and then what all happens all the thrilling events of their life."}, {"id": 124, "text": "This movie changed into one of my favorite movies. Extraordinary movie. Everyone must watch it"}, {"id": 125, "text": "I liked this movie very much. It is a comedy entertainer. I really enjoyed the humor. It is a different subject."}, {"id": 126, "text": "Liked the movie very much as it was a family entertainer. Its a comedy movie for light hearted person."}, {"id": 127, "text": "I like this movie very much.A real entertaining movie. The students get the Time Machine and used it to change their past. In the climax scenes worth the time you have spend."}, {"id": 128, "text": "Tora Tara full entertainment move on prime video prime video beat watching move platform this platform come latest movie I will watch new movie only primevideo"}, {"id": 129, "text": "I really like this movie it was fun to watch. greate time i had"}, {"id": 130, "text": "Nice movie. Collection of old memories with friends. I loved it."}, {"id": 131, "text": "It's a very amazing and interesting movie. I like it very much."}, {"id": 132, "text": "This is an amzing movie which everyone can watch with family. No over drama. each character played the role very nicely. Time travel concept is presented in a craetive way. It entertains the viewer from start to end. Highly recommended to watch.Tora Tora is a skillfully made (writing, cinematography, editing, sound), well acted, cohesive and internally consistent story that has the ability to elicit emotion, set mood and guide a reaction.Highly recommended to all."}, {"id": 133, "text": "This is a wonderful video. I like it very much. Recommend to everyone. Thank you so much for this video."}, {"id": 134, "text": "I like it very much this video. Very enjoyable. Recommend to everyone. Thank you so much for this video."}, {"id": 135, "text": "Amazing movie. Would recommend to watch... Superb authentic great cast movie portrayal of Pearl Harbour attack. Musical score great. Powerful ending... Tora Tora is a classic war movie!!!"}, {"id": 136, "text": "Have lot of fun . Great work . Tora Tora😍. I watched this whole film with a smile in my face"}, {"id": 137, "text": "A complete package of entertainment filled with lots of fun humour suspence"}, {"id": 138, "text": "The Movie is a complete package. from the casting, screening, story, screenplay ,script ,are on point. very good to watch with family. I felt the dialogue delivery could have been better .and also a movie this good should have been promoted on a large scale. the time machine is the icing on the cake part."}, {"id": 139, "text": "Good Movie with comedy, family oriented the Cinematography is good BGM is very thrilling."}, {"id": 140, "text": "This is an amazing movie which everyone can watch with family. No over drama. each character played the role very nicely."}, {"id": 141, "text": "Just finished watching. Its every bit amazing. Quite entertaining. Mind twisting"}, {"id": 142, "text": "A gang of seven college students accidentally come across a time machine and decide to use it to change their past. A great watch!"}, {"id": 143, "text": "Full entertainment movie and best movie ever seen in my entire life. Comedy, entertainment and love awosome"}, {"id": 144, "text": "This is such a nice family movie.Entertainment, family movie, happy, sad, angry, all emotions are included in this movie. It also named as a such weekend movies."}, {"id": 145, "text": "Great movie...but as you know there is no chance for good movies at present...all we need is some hyped movies...with no logic!!!!"}, {"id": 146, "text": "Nice movie and worthable.Must watch at least one time."}, {"id": 147, "text": "The plot keeps the interest level of viewer at a higher level throughout its runtime.I like this movie very much.A real entertaining movie."}, {"id": 148, "text": "I am interested in the movies. And very nice. The movie narrates the time travel concept very well. The screenplay is taken care well with no loop holes till the end and entertaining throughout. Liked the background music and end credits song."}, {"id": 149, "text": "It is an awesome movie. I love the concept of the movie.and all the characters have done an amazing work. I suggest everybody that go and watch this movie. Full on masti"}, {"id": 150, "text": "With its bold, brave new storytelling style, this is a new chapter in Telugu films. Hardly a scene is out of place. It's unusual to come across a film so intense and honest."}, {"id": 151, "text": "With its bold, brave new storytelling style, this is a new chapter in Telugu films. Hardly a scene is out of place. It's unusual to come across a film so intense and honest."}, {"id": 152, "text": "Do watch all every can enjoy alot from this movie and inspiring to all."}, {"id": 153, "text": "I like this movie very much and inspiring to all and do watch all"}, {"id": 154, "text": "Very thrilling movie and Have lot of fun . Great work . Tora Tora😍. I watched this whole film and was awesome."}, {"id": 155, "text": "Wonderful movie all should watch very fun in the movie"}, {"id": 156, "text": "I like the film very much. One of the best movie, must watch movie.."}, {"id": 157, "text": "This movie is so good fuuny and i love comedy movie."}, {"id": 158, "text": "Awesome story, great acting. Very fun to watch with friends and family."}, {"id": 159, "text": "Awesome movie all should watch there was lot of fun in the movie"}, {"id": 160, "text": "I like this Movie. Because it is very entertaining and family movie. Thank you"}, {"id": 161, "text": "It is an amazing movie. I liked the consept of time machine. And it is very thrilling movie. A must watch film. It is worth for money."}, {"id": 162, "text": "It is an amazing movie. I liked the consept of time machine. And it is very thrilling movie."}, {"id": 163, "text": "I like this movie very much. Iam very liked to experience a time travel if possible. I like role of puja raju"}, {"id": 164, "text": "I'm not kannada but i understand the language. the chracters are good and well shown in the movie.the plot need few corrections.the story is little puzzlie but after words it connects every part with each other when time machine comes .Tora Tora has a talented cast which shows our new coming generation. and overall the story or movie is good. like it ."}, {"id": 165, "text": "I this movie ,A gang of seven college students accidentally come across a time machine and they decide to use it, to change their past. However, later they find out that changing the past could cause total chaos and annihilation It's good one"}, {"id": 166, "text": "GUD MOVIE EVERY1 SHOULD WATCH DZ WORTHWHILE BEST IN PRESENT GENERATION."}, {"id": 167, "text": "It's a good movie one time watch full time pass it's time travel concept deferent then others"}, {"id": 168, "text": "Fantasting movie. Very interesting. I watch this movie 4 times."}, {"id": 169, "text": "The movie was very good. The students get the Time Machine and used it to change their past. 3 out of"}, {"id": 170, "text": "The movie was very good. The students get the Time Machine and used it to change their past."}, {"id": 171, "text": "The movie was very good. The students get the Time Machine and used it to change their past."}, {"id": 172, "text": "Its a family entertaining movie. And i must recommend all the viewers to watch the movie and chill up. AMAZING ONE."}, {"id": 173, "text": "A full entertaining and engaging movie indeed, really loved watching it &lt;3"}, {"id": 174, "text": "Nice family entertainer full length family entertainer"}, {"id": 175, "text": "Wonderfull movie , i watched two times ,the movie narrates the time travel concept very well"}, {"id": 176, "text": "This movie was very Nice. A group of 7 friends accidentally found a time travelling machine and used it to change their pasts. Comedy Movie. It was bit slow in first half, but picked up in second."}, {"id": 177, "text": "I realy like the movie I entertenment thise movie,thise is move is all family entertenment and entertenment only"}, {"id": 178, "text": "The movie was very good. The students get the Time Machine and used it to change their past."}, {"id": 179, "text": "Loved the movie. I wish I had time machine with me. Siddu Moolimani, loved your acting. Thanks to director for this new innovative script. keep doing this awesome work."}, {"id": 180, "text": "Good entertainer, one of the rare attempts in Kannada industry."}, {"id": 181, "text": "Loved this movie. I wish i had the time machine with me. Siddu Moolimani, lover your acting. Thanks to director for this new innovative script. keep doing this awesome work"}, {"id": 182, "text": "First I like movie theme, that we have to get a chance to change oue past.. Wow such it's amazing. All cast play a very good role in movie.. Really I love.i like this movie very much... Thank u"}, {"id": 183, "text": "Ndian cinema has been keeping a distance from this topic until Tora Tora. Harsh Gowda crafted a humorous entertainer using this and I enjoyed every bit of it. The plot keeps the interest level of viewer at a higher level throughout its runtime."}, {"id": 184, "text": "I like this movie very much.A real entertaining movie.The plot keeps the interest level of viewer at a higher level throughout its runtime."}, {"id": 185, "text": "This movie is science fiction movie which is based on a time machine and maximum cast play the role of college student and they all are best friends doing so much enjoyment.It is a wonderful movie and you will never feel bor after watching this movie ."}, {"id": 186, "text": "Great movie. Very innovative and scientifically well balanced movie . This story is very awe-thrilling and the time travelling sequences are amazing .The film might have been a trendsetter if the execution was fine. Harsha, who designed the script well didn't concentrate well on the screenplay. However, the artists compensate it with their funny yet impressive performances."}, {"id": 187, "text": "The concept in the movie is very good . the students gets the Time Machine and and use it to change their past. Thanks"}, {"id": 188, "text": "Movie is great but it is only for those who have interest in sci-fi movies. It is a time travel movie which is interesting for me."}, {"id": 189, "text": "Movie is nice and good to watch a good entertainment film idea by the directer is so cool so happy to watch this film the collage gang made by direct are very efficient usefull time for movie"}, {"id": 190, "text": "This movie is very nice any one can also watch it it you interest in past and future life they are very nice movie any one can watch it nice story"}, {"id": 191, "text": "Hi Guys, really enjoy the movie, also waiting for hindi dubbing."}, {"id": 192, "text": "Nice movie it was one of the best movie i have enjoyed a lot"}, {"id": 193, "text": "Top class video looking so beautiful and this site is very useful"}, {"id": 194, "text": "Seven college students accidentally come across a time machine and they decide to use it, to change their past.Nice characterization"}, {"id": 195, "text": "Great movie...but as you know there is no chance for good movies at present...all we need is some hyped movies...with no logic!!!!"}, {"id": 196, "text": "Good movie and family movie clean family and comdey"}, {"id": 197, "text": "Good movie and nice family movie clean family movie"}, {"id": 198, "text": "The movie narrates the time travel concept very well. The screenplay is taken care well with no loop holes till the end and entertaining throughout. Liked the background music and end credits song.This movie stands apart the normal films being released with the different concept. Need to encourage this kind of movie in kannada film industry"}, {"id": 199, "text": "Movie revolves around few college students who were in the vacation there in their college and they found time machine, movie was okay to watch, more precisely a college time fun was there in the movie not a complete sci-fi if you are thinking from that prospect a big no but yes a fun to watch.... the chaos the students handle and the time machine fun they had with typically college going students point of view.. where students are more concerned about fun,"}, {"id": 200, "text": "One of the best movie I watch till now. Everyone must watch this move once. Because you will really enjoy it."}, {"id": 201, "text": "Super movie very nice story and acting I like this movie I refer my friend watch this movie"}, {"id": 202, "text": "I like this movie very much.A real entertaining movie.The plot keeps the interest level of viewer at a higher level throughout its runtime."}, {"id": 203, "text": "I like this movie the storyline is awesome eveyone have this type of thoughts ...overall movie is awesome"}, {"id": 204, "text": "Good movie.......Best for teenagers Having a story based is a good one. Need more ideas needed for this movie."}, {"id": 205, "text": "THIS IS REALY GOOD AND INSPIRATIONAL MOVIE.THANK YOU."}, {"id": 206, "text": "Great movie to watch A complete entertainment package I suggest this for everyone"}, {"id": 207, "text": "Great moviw during this lockdown period enjoy it. stay at home and be safe"}, {"id": 208, "text": "Feel good movie with amazing screenplay,must watch movie."}, {"id": 209, "text": "DescriptionAs the relations between the US and Japan are strained due to the ban on raw materials, the top officers from Japan decide to start a war against the US."}, {"id": 210, "text": "There aren't too many films that deal with time travel in Kannada, which surely set Tora Tora apart from the regular films. The film is akin to the likes of Back To The Future. It deals with a bunch of students and a time machine and the comedy of errors that follows it. While it could have been a clever trendsetter, it ends up being a pale effort, which promises more than it actually delivers."}, {"id": 211, "text": "What a movie...! The story is amazing and the characters in the movie are amazing."}, {"id": 212, "text": "So nice movie tora tora i can watch this movie and i like the movie this type of thriller movie i like amazing awesome.The movie narrates the time travel concept very well. The screenplay is taken care well with no loop holes till the end and entertaining throughout. Liked the background music and end credits song amazing.This movie stands apart the normal films being released with the different concept. Need to encourage this kind of movie in kannada film industry"}, {"id": 213, "text": "I loved this film due to its ideology as it broadens our horizon by showing what can be done with time machine also the characters are fully energetic! Loved this film alot!"}, {"id": 214, "text": "The screenplay and story is good, but the acting could have been better! 6/10"}, {"id": 215, "text": "This a movie guaranted you to enjoy watch this movie for many times best movie forever good editing and good story ."}, {"id": 216, "text": "One of the best movie. The acting is very good of leading actor."}, {"id": 217, "text": "The movie narrates the time travel concept very well. The screenplay is taken care well with no loop holes till the end and entertaining throughout. Liked the background music and end credits song.This movie stands apart the normal films being released with the different concept. Need to encourage this kind of movie in kannada film industry"}, {"id": 218, "text": "Its good and beautiful video and it more twisted one and interest to watch families and younger it heavy one thank you so much great creation and hard work congratulated to team member to one best one i wish to will best one"}, {"id": 219, "text": "Once watchable movie , although the crew is new they have done a good work . Movie becomes a bit confusing in between but just rewind a few minutes and then it brings out the logic ."}, {"id": 220, "text": "As a first Kannada time travel movie, it did a good job. The movie is light, fun with subtle humor. I enjoyed myself more so during this quarantine as it is quite a jovial movie."}, {"id": 221, "text": "As a first Kannada time travel movie, it did a good job. There is scope to be the best but overall it is a light movie with subtle humor."}, {"id": 222, "text": "Very good movie watch once have lot of fun complete money &amp; Time value."}, {"id": 223, "text": "Its very good movie Its very good movie Its very good movie Its very good movie"}, {"id": 224, "text": "I was wondering what if this movie is a hit...and it is a hit"}, {"id": 225, "text": "The theme of the movie is good and i liked it . the graphics need some improvement in it"}, {"id": 226, "text": "I like this movie. Kind of adventures and also you can watch with family."}, {"id": 227, "text": "It is very amezing movie and very very comedy show dreama romantic and fighting you also seen this movie plz see this movie for fun"}, {"id": 228, "text": "We have seen few movies on time travel, only in Hollywood but not in India. This movie is first of its kind in India, and original concept in Kannada (Sandalwood ) industry.To come out with an advanced concept like this in Kannada, that too in the race of commercial film making, is a serious and sincere effort to revolutionize the kannada film industry.For concept- full points. Screenplay- full points Music- It was good but could have been betterA must watch."}, {"id": 229, "text": "I like this movie very much.This is the first kannoda time travelling film .I it is very interesting.it is a very very good film."}, {"id": 230, "text": "I really appropriate Harsh Gowda, direction, I really enjoyed the movie, it is good for the young generation. All the best."}, {"id": 231, "text": "Nice Movie I recommend.must watch Nice Movie"}, {"id": 232, "text": "I see this trailor as funfully, if this film released on time i will see at on theatre"}, {"id": 233, "text": "Trailor is nice, i will defetly see on theatre, i see this vidieo as funny"}, {"id": 234, "text": "This cinmatography is about time macchine and time travelling after watching the trailer i found out."}, {"id": 235, "text": "I guess this is the first Tamil time travel movie which is quite different from regular movie which came out every year.The newcomer are very talented. Love the movie."}, {"id": 236, "text": "Great movie .in this movie there is a lot of fun such a nice movie . I like this move."}, {"id": 237, "text": "Recommended by a friend and found the movie very pretty interesting."}, {"id": 238, "text": "I am waiting for this movie..dont be wait the fans best of luck..also i think it breaks all records as new movies.. So best of luck team and Siddu ji"}, {"id": 239, "text": "Honestly I didn't understand the language but the story line was OSM. FX and transitions were done well. This movies increased my interest more into these kind of stories."}, {"id": 240, "text": "The movie was too good the best movie i have seen in my life"}, {"id": 241, "text": "Extraordinary movie. you must watch. in this moive you not bore at any moment. extremely very good movie and excelente"}, {"id": 242, "text": "Its very good movie. All star cast performed good jobs."}, {"id": 243, "text": "The movie is good science fiction movie trying neater the story of seven college who come across time and try to change the past"}, {"id": 244, "text": "Good entertaining movie acting is nice direction allso well"}, {"id": 245, "text": "The movie was great ...the college life was amazing which was seen in movie... loved it"}, {"id": 246, "text": "This movie has a full dose of entertainment and its concept of time travel is so much entertaining. I suggest you to definitely watch this movie."}, {"id": 247, "text": "Story of 4 people who meets to change their life. And strongly suggest you to watch it now . Its fantastic"}, {"id": 248, "text": "This movie is a interesting movie very much comedy entertaining"}, {"id": 249, "text": "This is very nice movie . I like it very much because it is very good movie."}, {"id": 250, "text": "One of the best sci-fi movies which is a good family entertainer"}, {"id": 251, "text": "Very good movie,the movie was full on entertainment and comedy"}, {"id": 252, "text": "Tora! is scrupulously accurate and lays out of the tragedy of Pearl Harbor with intricate detail, but the film's clinical approach to the ... Critic Reviews for Tora!"}, {"id": 253, "text": "This is very nice movie and amzing movie. it is very cool. its should to see on amzon prime."}, {"id": 254, "text": "Tora Tora(2017) is an ably made (composing, cinematography, altering, sound), all around acted, firm and inside steady story that can inspire feeling, set state of mind and guide a reaction.Highly prescribed to all."}, {"id": 255, "text": "Great videos and excellent videos I like to Tora Tora trailer video super great."}, {"id": 256, "text": "Seven college students bump into a time machine and decide to time travel using it to change their past. It is best movie kannadaa."}, {"id": 257, "text": "I just watched this movie and I want to told you that movie is just amazing."}, {"id": 258, "text": "Very nice movie and great movie and watch movie for everywere"}, {"id": 259, "text": "The movie narrates the time travel concept very well. This movie teach use various thinks about time travel"}, {"id": 260, "text": "SUPER movie...you must watch. in this moive you not bore at any moment. extremely very good movie and enjoy all friends"}, {"id": 261, "text": "Extraordinary movie...you must watch. in this moive you not bore at any moment. extremely very good movie and like all youngers."}, {"id": 262, "text": "I love this film because especially how it shows what could happen if we should go back in time but also it shows us how the world was so different without technology and how people had to fight for themselves."}, {"id": 263, "text": ".Real hopeless. Pathetic acting. Bad screenplay. No effort to make a solid story. Really bad. It made me cry. Kannada industry will become a laughing stock. Please be serious when you make movies. Do enough ground work. I think the actors and crew themselves voted ten stars no other way this movie could cross 2 stars. Time travel is such a great concept. You gave a very bad start to time travel movies in Kannada."}, {"id": 264, "text": "Real hopeless. Pathetic acting. Bad screenplay. No effort to make a solid story. Really bad. It made me cry. Kannada industry will become a laughing stock. Please be serious when you make movies. Do enough ground work. I think the actors and crew themselves voted ten stars no other way this movie could cross 2 stars. Time travel is such a great concept. You gave a very bad start to time travel movies in Kannada."}, {"id": 265, "text": "It is a classic war movie. The makers of this movie have stuck to facts as much as possible . The attack on pearl harbour is so realistic"}, {"id": 266, "text": "It was pathetic and one of the worst movies I have ever watched . I feel story and screenplay was not up to the mark and could much better . Time travel is such a nice concept and the movie just ruined it . Some ground work should be done before making sci-fi movies like this."}, {"id": 267, "text": "The movie narrates the time travel concept very well. The screenplay is taken care well with no loop holes till the end and entertaining throughout. Liked the background music and end credits song.This movie stands apart the normal films being released with the different concept. Need to encourage this kind of movie in kannada film industry"}, {"id": 268, "text": "Superb kannada scifi movie🔥🔥,. Best ever seen movie fantastic fabulous amazing"}, {"id": 269, "text": "Movie must be more interesting. The plot is nice but the screenplay should have been more interesting."}, {"id": 270, "text": "Only looking for people who can watch the movie completely before reviewing it, thanks!"}, {"id": 271, "text": "It is a classic war movie.the attack on pearl Harbour is so realistic."}], "reviews_amount": 272}