{"name": "The Loss Adjuster", "titleId": "tt06841828", "reviews": [{"id": 0, "text": "Just a really odd film. It feels like you're watching a school drama class. Some scenes feel like they are about to build into a comedy farce but just fade away, other scenes drag on and just as you expect the camera to cut away, it stays and the script muddles along for too long leaving you getting frustrated and bored. The directing is messy as is the script. It constantly feels like you're seeing the first rehearsal and not the finished article. Some elements and characters aren't needed; it's overly complicated and then the ending seems rushed for no reason. Sorry, wanted to give it a chance but it really was poor."}, {"id": 1, "text": "A total waste of time.Don't expect feel good, don't expect musical numbers despite the cast's background, and don't even expect much Christmas.Expect arguing, confusion, a dead rat, bad scipt, terrrible acting (and even worse accents), and some terrible photoshop images over the end credits.The only slight positives were some nice shots of London and Beverley Knight singing over the closing credits.Rewatch amything else rather than watching this."}, {"id": 2, "text": "Having seen the trailers thought this was going to be a feel good Christmas movie. It was not! In fact I'm not sure what sort of movie this was besides a badly acted one with a story that jumped around and was confusing. Luke Goss was so wooden, yet we know he can act maybe the Rom com is not the right genre for him. As for all the other characters in the film we didn't really get to know them and how they were relevant to Martin. Such as shame this film had such potential."}, {"id": 3, "text": "Honestly one of the worst films I've ever seen. It was quite painstaking to watch despite such a high profile cast. The only plus side was it was so bad it became entertaining . Most of the acting was terrible and as for the Aussie accent. Surely they have Australian actors in the Uk? Hilariously bad film but strangely captivating in its horror. Lovely to see London looking beautiful and of course incredible to see the stunning Joan Collins looking as striking as always. I apologise to the few actors that could act and to be fair given a better script maybe it wouldn't have been so hard to pull off for the rest of them"}, {"id": 4, "text": "Many familiar faces here, Great actors all working to the best that was on offer.Unfortunately, it looks like the budget was spent on the cast and little else. The script was a little flat and one level, no real highs or lows and lacking humour.The soundtrack, same problem, like being stuck in an elevator and the production, scenes, camera work, had that kind of amateur feel. You know, the awkward camera angles and echo in the room.You know what the film wanted to achieve, but was ultimately let down by dreary script, dreary soundtrack and production that had a somewhat amateur feel."}, {"id": 5, "text": "The opening shots of this movie forewarn the audience as to the horrors of cinematography they are about to view, it seems that the cinematography appears to of been undertaken by a complete novice DOP, either that or he, she was making this film blindfolded as a experiment. The story staggers along at a painful pace, but the acting is pretty fair throughout, notably Luke Goss's performance. In my view this movie is totally let down by the diabolical directing, coupled with some dreadful cinematography that wouldn't look out of place in a school 6th form media class full of kids who really can't be asked. I hope Luke Goss in future finds himself some better film projects to be part of."}, {"id": 6, "text": "Don't really know what this was trying to achieve but it failed. Awful script, turgid story arc, terrible acting, 2 dimensional characters, predictable scenes. Lost interest after ten minutes and didn't get it back."}, {"id": 7, "text": "What a shame to see a British film with a reasonable cast fail so badly. I have rarely seen a film with a plot that is so slow, weak and nonsensical. The film lacked any punch whatsoever.The acting in the film is truly awful. The main character is so over acted it's painful and the rest of the cast give little feeling for any empathy.Some of the scenes tried to be dramatic and poignant but failed miserably, as did the point of the whole story. Even the twist at the end was so obvious it was telegraphed."}, {"id": 8, "text": "What a disappointing film this is. Terrible acting and just dull. This storyline could have made such a better film with the right cast. What a waste of money to rent . I was expecting much better after all the hype. Just don't bother watching it ."}, {"id": 9, "text": "There are reviews giving this 9 or 10 stars. They are lying."}, {"id": 10, "text": "This film is not as Christmassy as the cover depicts but that aside it is still a watchable film. A few well known British faces including pop royalty Martin kemp and former bros heartthrob and hear say singer. It's about a down on his luck insurance loss adjuster who's wife is at the end of her tether and leaves him at Christmas. A brief cameo by Joan Collins who plays one of his clients. Overall the film is ok but wouldn't watch again."}, {"id": 11, "text": "This film is probably one of the worst films i have sat through, terrible acting, awful accents (really who cast the Australian)? If you were expecting alove actually feel good Christmas film prepare to be disappointed. Everyone who has given this a 9 or 10 must be related to the cast."}, {"id": 12, "text": "Different and i know london and locations worked well. and wow Luke like you've never seen before!"}, {"id": 13, "text": "Went to see this in the cinema to get into the Christmas Spirit and I was not disappointed. A light hearted, well acted and written film to be enjoyed by everyone. Goss and Collins were excellent and the soundtrack was the icing on the Christmas cake! Will be rewatching next year and for years to come."}, {"id": 14, "text": "Loved it, everyone needs to watch this film - very funny and very heart warming. A Christmas movie a lot can relate to and cannot get the song out of my head! 10/10"}, {"id": 15, "text": "Really enjoyed this film. Was good to see luke goss in a completely different kind of role to his usual characters. Was a very touching story."}, {"id": 16, "text": "This would not normally be the type of film that I would watch but I watched the film with my mother and we both really enjoyed it. I am sure many people will be able to relate to Martin (LUKE GOSS) and the world we live in today and was pleasantly surprised to discover how good Luke Goss was with the rest of the ensemble cast who were all great.Would highly recommend the film."}, {"id": 17, "text": "Brilliant fun! Kym Marsh was the breakout star and Joan Collins is a class act. Would fully recommend to chase the 2020 blues.I saw it with my partner (also a fan) but I could easily see this being for the family.This is one I think we'll come back to every year."}, {"id": 18, "text": "This is a low budget masterpiece. Thoroughly enjoyed this film. It is not what I expected but its subtle humour and deft direction achieved a cinematic experience that worked on a number of levels. It generated a warmth that growed from the screen."}, {"id": 19, "text": "Yep experienced some of the s...t we get in life and nice to see it shown in a movie and come out the other side head held high."}, {"id": 20, "text": "Really really enjoyed this Movie. Great script and love the fact it appears to be almost exclusively filmed in.North London! Would definitely recommend 💗"}, {"id": 21, "text": "Absolutely loved it. Great film from start to finish where the humour needs to be. If your after a enjoyable Christmas family film this year please give this a watch.Great acting from Luke along side Kim Marsh, Joan Collins and Guy Siner. Each actor was superb bringing their characters to life with great direction. The Director did a great job in great story telling.Beautifully shot and lit very well. Along side great sound track to being it all together a must see Christmas film for this year. I shall be putting this on in the Christmas Season because we all need a couple of laughs this Christmas after the year we've all been though."}, {"id": 22, "text": "As odd as it is an enjoyable little film. Picked it up off the shelf in Asda, and feel I got more than my money's worth of laughs. Good acting, good direction, would definitely recommend. Particularly enjoyed the scene on the tube!"}, {"id": 23, "text": "Such a lovely movie. Great cast. Really beautiful message. No matter what life throws at you stand tall, you never know what's around the corner."}, {"id": 24, "text": "Lovely film with a feel good storyline. Some great characters acted by some well known faces. If you are looking for an easy watch with a nice plot then you should watch it. Will watch again."}, {"id": 25, "text": "I never write reviews. I'm apathetic and preoccupied. HOWEVER. I feel compelled to encourage everyone to give this beautiful, alternative movie a watch. It is not typical. It is not perfect. It is, however, something not to be missed. Luke Goss was OUTSTANDING. The blink of his eye, the tilt of his chin. All perfectly conveying the character you follow, support and completely believe in. I loved the journey. I'm glad I made it. Very glad."}, {"id": 26, "text": "Thoroughly enjoyed from start to end, great cast, great script. Will watch again."}, {"id": 27, "text": "Loved it luke was amazing so where the rest of the cast 👍"}, {"id": 28, "text": "What a lovely surprise this was! A story that twists and turns - completely original with tears and humour. I truly felt for Luke Goss. I've watched it twice now. This is one for the family. An alternative Christmas delight"}, {"id": 29, "text": "This is a lovely heart warming and at the same time heart wrenching British movie! It will make you cry and make you laugh too! You will develop a huge soft spot for Luke Goss's lead character Martin. You will watch him suffer one disaster after another but will admire him for not giving up or losing hope! This is a curl up with a blanket, Christmas lights twinkling, cup of hot mulled wine in hand movie. So sit back, relax and enjoy!"}, {"id": 30, "text": "Lovely to see Luke Goss in a different role, poor Martin. Just what we need to get us in the Christmas spirit. A great cast; I laughed &amp; cried in equal measure. Highly recommend &amp; wait news of a sequel."}, {"id": 31, "text": "Being a North Londoner it was refreshing to see many familiar places as well as being a unique and fascinating story with some light hearted moments...congratulations to the director on making an original and independent film which is certainly a must see for fans of Joan Collins, Luke Goss and Martin Kemp!"}, {"id": 32, "text": "I really enjoyed this film. The performances from everyone were great. Loved the chemistry between Luke Goss and Joan Collins What a great Christmas treat. I will be watching this film over and over"}, {"id": 33, "text": "Such a Lovely Christmas movie and amazing to see on the big screen!"}, {"id": 34, "text": "I thoroughly enjoyed this film. Luke Goss really amazed me with his performance. I laughed and cried. Really good little British alternative Christmas film."}, {"id": 35, "text": "Loved it, it's a really feel good movie, could be Christmas or at anytime. About what matters and what doesn't. Luke is brilliant!"}, {"id": 36, "text": "I really enjoyed this film, very interesting and emotional. Luke Goss is exceptional in his role as Martin a downtrodden guy who is destroyed by his wife. Joan Collins is amazing in her role as a sexy cougar, interesting film full of hope, a touch of Brilliance!"}, {"id": 37, "text": "I do agree I was expecting a more Christmas theme. Irrespective of this I just had to watch to the end. The movie was captivating, the love story got me and the happy ending brought me to tears. LOVED IT! Defo a must watch."}, {"id": 38, "text": "Cute and excellent film. Congratulations to all who took part in it."}, {"id": 39, "text": "This film is not to be missed, absolutely incredible such a heartwarming film which makes you laugh and cry, Luke Goss played Martin with so much love and passion you just wanted to give him the biggest hug ever, well done to all involved for making this fantastic film, I have seen this 6 times now I just love this film"}, {"id": 40, "text": "Loved this movie. Luke Goss is amazing as are all the cast. It was great to see such a quality cast and a lovely story with a positive ending. A real feel good Xmas movie"}, {"id": 41, "text": "The character that Luke plays is totally different to what we're used to, but i still really enjoyed it &amp; he's more than proved he can take any character &amp; make it his own xx"}, {"id": 42, "text": "Congratulations to anyone that is humming the theme ! It makes me smile ! If you have ever been dumbed around the holidays you need this film! A New Christmas classic !"}, {"id": 43, "text": "Thoroughly enjoyed the film, got me in the Christmas spirit"}, {"id": 44, "text": "About time we had a nice, funny English made film; good for the festive season in these hard times of COVID"}, {"id": 45, "text": "Really enjoyed the film. A light hearted and cute."}, {"id": 46, "text": "Great cast... wonderful settings.. The film has a feeling of the old pinewood studio days about it ..."}, {"id": 47, "text": "The whole world has been turned upside down this year due to Covid , so it was great to finish off the year with a movie that is both nostalgic , fun and thought provoking , with a little bit of Christmas magic thrown in for good measure. It was great to see London looking so beautiful with all the Christmas lights and with so many scenes shot in Highgate, it was a movie I felt connected with."}, {"id": 48, "text": "Saw this film in the cinema and really enjoyed watching Luke Goss (aka Bros) emotionally unwind while his world is falling to pieces. Feel good emotional journey with appearances from Joan Collins and Martin Kemp."}, {"id": 49, "text": "The narrative structure of The Loss Adjustor has all the integrity of the Columbia space shuttle coming into land, and much like the ill-fated craft, finds itself staffed by many otherwise great talents with no escape and falling fast.And that won't be the only laboured aviation metaphor you're in for if you make the mistake of watching this thing.However, if you are going to watch this, (and I suggest you find something better to do with 100 minutes of your precious, finite time on Earth), at the very least don't buy it with money.After all, as Abi Branning, (freed from the shackles of EastEnders yet apparently condemned to an eternal cycle of locking up a North London florists), says to the titular Loss Adjustor, there is no dress rehearsal in life. And honestly, when it comes to this production, you assume that to be true in more ways than one."}, {"id": 50, "text": "A great UK Indie black comedy film! I think we can all identify with the character of Martin in one way or another...I was really rooting forward him and luckily there was that silver cloud at the end of his run of back luck! A lovely touching message about digging deep, being yourself and knowing you are enough...and the right people will stick around, love and appreciate you. Luke Goss does an outstanding job as Martin - his body language, voice and visual appearance all transformed dramatically for the role. It is such a refreshing treat to see him in a completely different type of role than his usual tough guy action characters. I hope this film opens up many more opportunities for varied roles as he has so much acting talent to show. I particularly enjoyed the chemistry between him and the following cast members- Guy Siner, Joan Collins and David Byrne. It is also great to watch movies that are filmed in places I am familiar with...and London is just the best backdrop, gritty and beautiful in equal measure. So get your mulled wine and mince pie ready and snuggle up all cosy on the sofa...you won't be disappointed! Congratulations to all cast and crew involved...I am sure this film will end up being a Christmas tradition. Perhaps a sequel...to see how Martin is getting on... :))"}, {"id": 51, "text": "I watched this film with my sister, mother and older brother. He at first was not into it as he is used to seeing Luke Goss in action films and a gun but 10 minutes in he really got into the film.We all enjoyed the film and was what we need on a cold Christmas evening in with the family.Our mum loved and we enjoyed the film.We are all going to watch it again next week with friends.Enjoyed it very much.Worth a Watch."}, {"id": 52, "text": "I watched this film because my girlfriend bought it. Not usually my type of film. However we really enjoyed it.Could very much release to Martin and was very much mike Leigh esque.Don't understand some people on their reviews.It's a good film and was please rly surprised to see that Luke Goss as Martin has depth and delivered a good believable performance NOT what you would usual expect to find him in.We would highly recommend to others and is a film you will either like or not like.WE LOVED IT."}], "reviews_amount": 53}