{"name": "Moon Rock for Monday", "titleId": "tt06685476", "reviews": [{"id": 0, "text": "I loved this film. Funny, charming and the ending was the perfect way to end the film. I was in labour and still stayed. Cast were fabulous, and made each character come to life."}, {"id": 1, "text": "Great little film, a blend of 'The tree of life' and 'little miss sunshine.' A story about how we fit within our world and the legacy we leave. Moonrock is about what it means to have quality of life, we're here for such a short period and it's only until most of us become elderly that the thoughts about mortality and time really come into play. Tyler and Monday are wicks that burn bright but way too quickly. Monday struggles with the tight rein her father has on her for fear of losing her after the death of his wife. Tyler lives in the shadow of his mothers death and his longing to reconnect and make sense of his loss. Tyler has had to provide for himself and answer to no one. Monday lives in a cotton ball that slowly suffocates her. As a father, how do you respond to the thought that you could lose your child to an illness or accident? What does it mean to be alive and to live life, Monday is in her fathers prison, Tyler is headed for prison. Both will search for answers to their future, need each other not to survive but to live and learn."}, {"id": 2, "text": "A thoughtful investigation of the power of being 'present'"}, {"id": 3, "text": "I loved this film. Felt a little like the film Perfect World with Kevin Costner. Great acting by the little girl and teen boy. The story kept me engaged. It was unique and interesting. This little Indie film is worth watching and you till leave you reflecting upon its themes for a few days. It certainly moved me."}, {"id": 4, "text": "Loved this quirky story, the characters bounced off each other to tell a captivating story with some picturesque Australian landscapes"}, {"id": 5, "text": "Australian films to often are hit and miss. Moon Rock for Monday hits all the marks and more. I sat through this film, laughed and cried. It is a very heartwarming story that I will see again. Great casting, Incredible cinematography showing you a wide view of Australia. The Director Kurt Martin, all the Producers, crew and all the cast should be very proud of this classic gem they have created. 10/10 Wayne Donald."}, {"id": 6, "text": "Beautifully shot and directed with a charismatic cast and heart warming tale. I loved seeing the breadth of the Australian landscape, captured beautifully on screen. Well worth the price of admission !"}, {"id": 7, "text": "Moving film with beautiful scenery of outback Australia. A soul searching journey met by laughter as well as tears."}, {"id": 8, "text": "Great movie, it made me laugh and cry at the same time. I could relate to the main characters and loved the outback scenes. Will definitely watch it again."}, {"id": 9, "text": "The two main actors are amazing. The music really adds to the film, very unique. The ending is gut wrenching. Wish there was more films out there like this."}, {"id": 10, "text": "A lovely film. A lot of reviews are giving it 10, maybe for the films heart. It took me on a journey and really showcased Australian landscape. Definitely need more films like this at the moment."}, {"id": 11, "text": "A friend invited me to a special screening of the film so I had no expectations. Look, the film is obviously not perfect and clearly low budget.... but the story is very beautiful and I was thoroughly engaged for the entire film. Also the two actors who play the leads are phenomenal. So for an Indie film it punches well above it's weight and it left me with a provocative thought - what is life really about. Not without flaws but I highly recommend people see this film as it has a very powerful theme that resonates."}, {"id": 12, "text": "Finally a refreshing Australian feel good film. I saw it at the Adelaide film festival and was gripped by it. The storyline is refreshingly feel good and teaches the audience the importance of life and how we need each other in this world. Would recommend that everyone see this film."}, {"id": 13, "text": "Such a heartwarming and heartbreaking rollercoaster of emotions of a film!"}, {"id": 14, "text": "This movie takes you on a journey. Right from the very start, every scene gives you goosebumps and you feel invested in each of the characters. I thoroughly enjoyed it, would recommend it to kids and adults alike. Excellent cinematography and the ending leaves you just wanting more! Such a great showcase of our wonderful landscape too. A job well done! Will watch many many more times!"}, {"id": 15, "text": "I love an Australian Movie and this one is right up there with my favourites. A wonderful cast - Ashlynn is a breath of fresh air and destined for greatness. The movie will keep you thinking about it days after you have seen it. Well done to all involved"}, {"id": 16, "text": "A soul-searching journey that takes the audience on this magical ride through the Australian outback. Highly recommend this film for anyone in need of both laughter and tears!The underlying theme of replacement had us gripped and the rabbit was an absolute star- the glue for the storyline!"}, {"id": 17, "text": "This lovely film will make you weep, despite the upbeat optimism of the lead characters. Weeks after seeing it, I still cry on cue, when I think of the final line of the film, written across the screen. In fact, I'm crying just writing this review and no other film makes me feel this way. Beautiful sweeping views of the Australian landscape, the minor characters all add to the good natured humour of the movie, despite the sense of impending doom. George and Ashlyn have real on screen presence and I also liked the performances of the deeply flawed policeman played by Alan Dukes and the brief appearances by the lovely Bonnie Ferguson and sinister Dean Kyrwood"}, {"id": 18, "text": "What a lovely heartwarming film. A simple story beautifully told, with fantastic Aussie talent on screen and off. Recommended for the whole family!"}, {"id": 19, "text": "Such an enjoyable Australian film. I fell in love with the main characters and enjoyed watching their relationship build."}, {"id": 20, "text": "Loved this nostalgic road trip tale across the Australian outback. Excellent performances and well directed, the dynamic between the two leads was authentic and heartfelt. Go see it."}, {"id": 21, "text": "Such a sweet movie. Full of laughs and tears. Great to see some new talent. The lead characters, George and Ashlyn definitely share something special that resonates on screen. I definitely want to see more of these guys!"}, {"id": 22, "text": "You will laugh, you will cry. The chemistry between the two leads is superb and the film is unpredictable. A brilliant Australian Indie film. A must see!"}, {"id": 23, "text": "Absolutely A Cinema Quality Film! I would watch it again"}, {"id": 24, "text": "Kurt Martin (Writer &amp; Director) you are brilliant! The movie is amazing and the story is so well told. Beautiful cinematography and some great locations. Lots of laughs and lots of tears. Ashlyn and George are an amazing duo with so much natural talent - no doubt both have bright futures ahead. A fantastic Australian film!"}, {"id": 25, "text": "Best aussie film I've seen in the longest film! The on screen chemistry between George and Ashlyn is very special. Unpredictable, heart warming, and a showcase of our beautiful homeland! This is a film that really takes you on an adventure! I laughed and cried and all the feels between. A must see film! Kimberley"}, {"id": 26, "text": "This was an absolute pleasure. It was a story that truly took you on a journey and hit all the right spots. Some of the messages and moments in this film are what we all need right now. Aussie filmmaking at its finest."}, {"id": 27, "text": "Loved this, warm, heart warming. A really sweet Aussie film and some moments that left a big smile on my face. Looking forward to seeing what's next for all involved. Steller Aussie cast"}, {"id": 28, "text": "A story of growing up and the importance of seeing the world and meeting people from various walks of life. So much appreciation shown for the beauty of Australia. A moving and thoroughly enjoyable independent film that was a joy to watch."}, {"id": 29, "text": "Loved the story. So refreshing. I was totally hooked after first five minutes and the film held me engaged until the credits. I refused to leave the cinema even though half way though I needed to go to the bathroom! It made me smile. The acting from the leads and the quirky characters is sublime. Only negative is I think the supper role of the father could have been stronger. Other than that the film was well worth my twenty dollars!"}, {"id": 30, "text": "I saw this film at the Byron Bay film festival and I was honestly blown away. Emotionally. It's rare that a film is so powerful with its themes that I reflect on them for days, or in this case weeks, after. However seeing that it still bothers me, in a good way I felt compelled to urge others to see it. Similar films with powerful inspiring like Dead Poets Society inspired me - this film inspires and teaches us valuable lessons of life that transcend ages are eternal truths. Watch and be inspired to live your life to the fullest!"}, {"id": 31, "text": "Saw the Sydney screening. Cool filmmakers just trying to make stuff, pretty interesting. The story kept me hooked the whole time. Well done to all involved!!"}, {"id": 32, "text": "I saw this in Adelaide. Was a cool film, it has its flaws but got a lot of heart."}, {"id": 33, "text": "A film that takes you on a journey, with lots of fun characters along the way. Highly recommend!"}, {"id": 34, "text": "Well written &amp; captivating. Really drew me in. Acting is awesome too"}, {"id": 35, "text": "A rare gem in the Australian Indie Films with a great cast! The shots really showed the beauty of Australia mixed with some brilliant dialogues bringing laughters and tears. I definitely recommend watching it!"}, {"id": 36, "text": "Love the cast! Love the characters they meet. Felt the lows and highs. Worth checking out, will make you cry."}, {"id": 37, "text": "As my teen years were in the 90s I loved this film. It had a warm sense of nostalgia and I love a good road trip movie. If you want to check out a cool Aussie flick this one has some great cinematic moments and personally I think the girl and boy have huge careers ahead of them. The first part was a little slow but as the film picks up pace it goes from strength to strength and by the end I was completely immersed in this fantasy world - seeing it through rainbow coloured glass of a girl called Monday. Give it a watch I think the storyline is pretty clever."}, {"id": 38, "text": "Captivated me from beginning to end... no falling asleep on this one. No wonder Kurt Martin won the German Film Festival. A great visionary. Director and Producer, an excellent combo, so looking forward to their next film. jjh"}, {"id": 39, "text": "Moon Rock for Monday was original from start to finish. Here is why:1. The context of the characters is established within several scenesThe context of each character is shown through separate shots that reveal the depth of their individual suffering. Martin's direction of the camera to capture the small details of these large problems is achieved by taking characters off-screen, using sound effects to establish actions, and display character behaviour that reveals their utmost desires.2. Themes and ongoing motifs are layered, feeding back in to the overall narrativeThere are major motifs that occur in this film. And then there are smaller instances of these motifs that repeatedly appear, patterned throughout the storyline. The pace of the film helps these moments become increasingly relevant as our own understanding of the characters progress. Those scenes that initially set up fundamental desires such as health, wealth, safety and freedom are deepened to take on new meaning. The tangible occurrence of stones, theft, cars, and the Australian land shift those desires to take on new meanings of happiness, replacement, comfort, and journey.3. The dialogue deepens our understanding and empathy for each characterEach line of dialogue had been carefully thought out to consider the context of the scene, the progress of each character, and the pace of the film. There is not one single line of dialogue that could have been cut or removed. No emotion is revealed too early. No expositions cheat us of the story we're in for. Each word is distinct to the character who speaks it, and the dialogue itself is distinct to the movie.4. Each character always wants something, no matter how big or smallThere is no instances in this movie that a character is not motivated by something they want or need. Every day tasks that we have to complete in order to function and live have been used here to create adversity between characters in the plot and drive the pace of the story.5. A real endingThe ending is a balance of tragedy and happiness. The plot proceeds in a way that removes us from consequence of action, and by the time we have developed enough empathy for the characters we are confronted with harsh realities as they occur in real life. While the overtone is fundamentally tragic, there are much stronger under currents of what happiness means as our perspectives change and we take on responsibility as an adult."}], "reviews_amount": 40}