{"name": "7500", "titleId": "tt06436726", "reviews": [{"id": 0, "text": "I fly the A319/320/321. Whoever consulted on the film did a good job, and incorporated realism to how the airplane is flown. That constant beating on the door is also accurate. It won't open unless someone lets you in."}, {"id": 1, "text": "This is a real anti-hollywood movie. A gritty movie that is thrilling and suspensful without the glitz and shine, the need to embelish real life and have super happy endings. Just solid performances and what could actually happen. They clearly had pilots, pschologists and police advise them. There may be holes, but they were inaccurancies above my level of knowledge. Had me enthalled, better than its reviews, but not for everyone, if you like your movies realistic and/or like planes this one is for you."}, {"id": 2, "text": "This movie gives an amazingly realistic look at the interplay that exist in actual hijacking scenarios. It is slower in pace and grittier in appearance and direction than what many expect from a Hollywood movie of this type and could be seen as more of a fictional documentary which I expect is the reason for the shockingly low reviews seen. However in my opinion the acting and direction of this movie make it one of the best in its genre and well worth watching."}, {"id": 3, "text": "This somber film isn't very expansive with about 15 characters in total and the entire film takes place in the pilot's cockpit. But where this film becomes robust is through intensity from a terrifying scenario. What I enjoyed about the 🎞 is it didn't try and create any false narratives or stupid ideas that most movies insert into scripts for cheesy entertainment value. No the lead character although under immense pressure followed suit with what most people put in that situation would do. Yes I would reccomend this movie it's not a bang bang thriller to fly through on a Sunday afternoon what have you but it's definitely a late-night dramatic flick that moves the needle provoking solemn reflection by it's end."}, {"id": 4, "text": "Overall a very solid movie. Very simple in some ways but nicely executed. Also, the accuracy of the aircraft elements is very good for a movie."}, {"id": 5, "text": "Such a horribly gripping film that pictures what a minority have potentially been through. Superb acting throughout and leaves a tingle down your spine. Due to the pre ratings I expected nothing really and so was pleasantly surprised. JGL is becoming an actor well ahead of his times and quite rightly so. Well done sir."}, {"id": 6, "text": "This is one of those movies you turn on with no expectations, and then sit stunned when the credits roll. I don't know who this director is, but I'd like to shake his hand."}, {"id": 7, "text": "I have always felt that less is more is a key part of what makes a good film. Hollywood truly doesn't understand that these days. This film is a realistic view into this situation and was executed very well. Hollywood please take note of how this film succeeded where you fail so many times before."}, {"id": 8, "text": "Hijacking before 9/11 and hijacking after 9/11 mean two very different things. Condoleezza RiceAnyone aware of the possible mishaps of air travel knows from 9/11 that hijacking is about the worst possible scenario. New director and co-writer Senad Halilbasic have crafted 7500, which depicts in painful realism the overtaking of a German shuttle between Berlin and Paris. With 85 passengers, the plane has a heavy human load.The safety checks for takeoff by young first officer, Tobias (Joseph Gordon-Levitt), are mundane but nonetheless ominous because we know what the film is about. Adding to the forthcoming anguish, a flight attendant, Gokce (Aylin Tezel), is Tobias's fiancé, with whom he shares a child. It's not difficult to guess the role she will play in the vicious negotiations to open the cockpit door.In a lack of creative casting, the Islamic terrorists are mostly Arab with the vague notion of using the flight as retribution for Western sins. Much more imaginative is Vollrath setting the majority of the action in the cockpit, creating a claustrophobic dread as if we were witnessing the opening of a casket.The camera is almost always on Tobias as he flies the plane (the captain is dead) and struggles physically and mentally with the terrorists. Levitt is dexterous and sympathetic as a character given the moral choices inherent in losing lives to save lives. Also, he must stop the terrorists and save the plane. Because they want to crash into a populous area, Tobias has even more heavy lifting.Although the action is limited to the cockpit, it's a thriller that relies on the built-in tensions of flight after 9/11. No minute is dull because humanity's safety is at stake. Just don't show this thriller to someone who has never flown, or better, has no notion about the evil men do.While streaming this tense thriller from the comfort of your home, be aware that when you fly, all comfort, physical and psychological, may not arrive with your baggage."}, {"id": 9, "text": "This film kept popping up in my browser so decided to watch it. Glad I did. Had me glued to the screen all the way through. Filmed entirely in a planes cockpit which in itself was different. Simple and somewhat a predictable terrorists on a plane plot but plenty of excitement. Well filmed I thought. Think you will enjoy it. Nothing not to like"}, {"id": 10, "text": "I'm not good in english, and usually lazy to writes anything down, but I want to help people who loves to read review first before watching anything (like me).. Recently, I find nothing goods to watch anymore, I have seen thousand of hijacking movies, series,..and agreed that this one belongs to one of them.. This is just a small B movie with few actors involved, a good pace and thrilling moments, Joseph Gordon Levitt alone which I admired could easily handle this standalone movie. But the other cast are not dissapointing at all. People are complaining they seen this kinda movies thousand times before and yes that's correct. The story are similar to any other movies, but why don't we just try to give this a chance and sit back , enjoy the thrilling rides. I'm giving this 10/10 cause I enjoy this small films franchise, and this one does not dissappoint me at all. Overall it is worth it."}, {"id": 11, "text": "Loved this. Unexpected but gritty and compelling. Ending threw me a little bit still loved it. Enjoy."}, {"id": 12, "text": "The beginning of the film is very immersive, makes you feel like you are in the plane, this is what a movie that's entirely in one place should do. Simple things like visions of the cameras of the airport and plane, the pilot and the co-pilot talking to the people who work in the airport and the flight attendants, some peoples would find that boring, but that's what makes you fell like you are the environment of the movie.When the kidnapping of the plane begins, the film is still immersive, but when the characters start to became stupid and some characterizations who are supposed to be something, like the wife of the main character, all end on basically nothing, then the movie become boring and empty.All that said, Joseph Gordon-Levitt gives a good performance."}, {"id": 13, "text": "7500 develops anticipation and builds tension from the opening frames, simulating authentic security camera footage of terrorists getting through airport security, and onto a German airline passenger jet headed to Paris. Once aboard the plane, Vollrath uses a real-time scene structure (similar to Mendes' 1917) from the viewpoint of the cockpit and the American co-pilot played with understated perfection by Gorden-Levitt. The film takes hold of the viewer and doesn't let go - the entire film plays like a reenactment of actual events (this is fictional story). A fantastic 1st film effort by German Screenwriter/Director Patrick Vollrath."}, {"id": 14, "text": "... once they realised the extremist recruiters had not read 'Hijacking for Dummies' the authorities were able to play their patronise the terrorist card with aplomb."}, {"id": 15, "text": "The tension that this film creates is palpable and it does this without resorting to the usual Hollywood cliches such as over the top musical cues for anything vaguely dramatic, claustrophobic and carefully restrained cinematography (no CGI plane shots from every angle) and without dumbing things down for the audience. This is also by far the most realistic depiction of an airliner cockpit in any movie that I've seen and they clearly did their research when making sure they get things as accurate as possible for this film. Even the sound of the engines on takeoff is exceptionally realistic without the usual almost rocket launch sound effects while the plane is heading down the runway, followed by absolute silence while the plane is cruising. It's quite obvious that this is a real A320 (or variant) cockpit and it shows. So as someone that is sick of Hollywood dumbing down aviation scenes in movies, this really stands out and the amount of work and research that must have gone into this is incredible. All in all an excellent film."}, {"id": 16, "text": "You know that if Gordon-Levitt is going to assume a role, it just has to involve a great script and first-class production. This does not disappoint.If you think there is little new that anyone can bring to a plane/terrorist/hijack story -- you are dead wrong. Gut-wretchingly tense and terrifying from the start and doesn't let up."}, {"id": 17, "text": "As others have said, this movie was practically a one-man play. I'll say off the bat, this movie is not my usual taste in movies. There was enough jargon and enough numbers to make my head spin. Much of it was subtitled and I'm not a fan of foreign films. I'm a horror buff and this movie showed, instead, the banal cruelty of humans over humanity. While I am not one that requires a film to have a happy ending, all wrapped up in a bow, this movie had a bleak, abrupt ending leaving the viewer aware that no character would have a happy ending if the film were extended to show their lives.Despite all that, I was blown away by the intensity of the film. At no time was I left with more than a second to catch my breath before the next thing happened. Even when the probability of an event was telegraphed to the viewer (such as when the plane is about to crash), the tension is high and the viewer is all but begging for something, anything, to happen to end the suspense. Even when an event reaches an inevitable conclusion, the viewer is never let down--the tension just increases until everything comes to an end and only one sound remains, in the darkness.I'm certain that there are many flaws. I've never given a 10, because there is no such thing as a perfect film. I am giving it a 9 because one character came skirting close to being a stereotype in an otherwise wonderfully character-driven plot. One thing that made this movie sing for me was that there was no super character. The captain was an older man who bravely sought to keep his first officer and passengers calm. The first officer was an ordinary man who was easily injured and who often fought from a position of physical and mental weakness. The hijackers were just average people, caught up in zealotry. The one we see the most was just a boy who was too afraid to die.This movie is not a shoot-em-up movie. It's not a traditional action film, because it takes place in the confines of the cockpit. It's got a body count for the type of person who wants one, but most of the killings are off-screen and those that are on screen are swift and brutal with a minimum of blood. This movie is not for the person who wants loud explosions or chase scenes. What it is, is a fantastic examination of characters experiencing fear. Fear, after a certain point, contaminates every action and leads to the inevitable conclusion.Wow.See it. If you like character-driven movies, you won't be disappointed."}, {"id": 18, "text": "I've not seen anything this good since Das Boot. 7500 is outstanding, Gordon-Levitt blew me away, I'm still stunned and I'm not sure I will sleep tonight."}, {"id": 19, "text": "I really enjoyed this movie. Interesting that it was shot entirely in the cabin. I'm not about to review but I want to say to the critic who suggested duty free is handed over when boarding the plane, I suggest you do your research and I assume you haven't travelled outside of the US. It's common practice in most of the world for Duty Free purchased to be given over straight away."}, {"id": 20, "text": "Watched this after Mark Kermode of BBC Radio film reviews recommended it ..Good acting and believable story .."}, {"id": 21, "text": "I can't think of a more intense and claustrophobic movie that I've seen. I spent much of the movie standing up in front of the TV screen because it was too intense for me to sit down. Incredibly well acted by JGL."}, {"id": 22, "text": "Like really high ... as in in the air high. Jokes aside, the movie is more than serious and really tries to portray happenings as close to reality as they can get. The acting is great and while some things are heightened for effect, you can see things going down the way they did.This is not easy to watch (it is not meant to be), but if you are into thrillers taken from real life and drama unfolding in front of your eyes, this is a movie to remember and watch of course. There might be decisions being made that you would not have taken, but don't forget we are talking about humans and everyone is wired differently. Also we are meant to feel strange and not entirely sure about some of the people involved. Humans are complex - even the evil ones"}, {"id": 23, "text": "It's been about 20 years since I've been riveted watching a movie. I didn't get distracted once and was thoroughly captivated the whole time.7500 has made me realise how many other movies rely on SFX and music to carry them through. This movie was a masterpiece in a way because the acting and the story were more than enough to make this an exceptional movie.I wish movies like this were the norm rather than the exception."}, {"id": 24, "text": "I can't believe the negative ratings for the film. It is such an intense thriller! Loved every bit of the movie. Keep up the good work, JGL!"}, {"id": 25, "text": "This story is told very well from one point of view rather than outside and all around the story. The realism of sounds, lack of music and intense scenes made this a surprise diamond in the rough. A nice break from your typical Hollywood action movie. In some ways it had a bit of a Hitchcock-type of filming reminiscent of The Rope."}, {"id": 26, "text": "I really don't understand some of the really negative reviews on here. Does someone have a grudge?I thought the atmosphere created by the film was excellent and it didn't turn into a politically correct wokefest which I was expecting it too as most movies these days are PC.The acting was decent as was the direction. Quite brutal in places but not over the top.Like some others I watched it later at night and it added to the drama.I'd have scored it higher if it wasn't for a few silly mistakes. Flight time from Berlin to Paris is 1hr 45min so the time in the air is probably 1hr 15 min max. There are a ton of airfields that could be landed at in an emergency. Also, there would be no special requests from the passengers to attend too as the most you'd get is a quick snack and one drink.All the same. Really enjoyed it. Couldn't sleep easy after it either."}, {"id": 27, "text": "Guy's don't believe the low stars reviews. This film got me at the edge of my seat. It's smart, well acted, levitt is amazing! And all the other actors as well. Very real and breathtaking. Dont miss it."}, {"id": 28, "text": "Dude, this movie is intense! I chewed off all of my fingernails, and most of my toenails! I wouldn't think that a movie that basically takes place entirely in the cockpit of a plane would work, but this movie totally does! And that ringing at the end? Perfect! Bravo!!!"}, {"id": 29, "text": "Very underrated gritty, tense drama with excellent performances by all especially JGL, a man of talents in front of and behind the camera. The attention to detail is apparent in the cockpit preflight checks and friendly but professional banter. I doubt any commercial pilot would have any problem with the technical dialogue. No Hollywood script writers, or big ego directors. fingerprints were on this one. Messy, bloody, agonizing, terrifying are just a few emotions displayed in a raw unfiltered view of a hijacking that goes sideways when one of them is conflicted and JGL has to deal with a no win situation. There are no happy endings here,"}, {"id": 30, "text": "Joseph was so believable as a pilot it felt almost like a super real documentary on hostage situations. The relationship he has with the flight attendant makes it more real and hit close to home being a mom myself. I also work with my man too. I yelled at the tv so many times! Throw the plane in a dive Stab him! Oh how I love flicks that get me to yell! So damn good guys!"}, {"id": 31, "text": "Wow! Gripped from beginning to end. Claustrophobic and human. The acting was superb. Intelligent storytelling. The lack of subtitles for German conversation is conducive to the atmosphere from the pilot's point of view, as a non~German speaker and does not detract from the value of this film whatsoever"}, {"id": 32, "text": "It deserved more except for the piss poor second half that has the viewer go through about 25 repetitive minutes (&amp; 100+ separate shots) of the teenaged hijacker in dilemma/distress. The build up is phenomenal, till Gordon Lewitt's fiance (&amp; mother of his child) is taken hostage. We are treated to something inexplicable next, and it's too much to digest. Far too many wtf scenes in this one, which will have have you laugh and cringe and throw your arms about. The final screams of 'doctor (for the terrorist) by JGL is absolutely hilarious considering his lady lies lifeless not even 2 feet away with her throat slashed. Very poor mood interpretation/projections although it features surprisingly great pacing if you look past the glaring oddities. A confusing film!"}, {"id": 33, "text": "A brilliantly researched and believable story. The whole movie had me on edge from beginning to end."}, {"id": 34, "text": "All of the reviewers who gave low ratings have apparently never flown a commercial plane. FLIP THE PLANE OVER?!?! Do you understand how dumb you sound? THIS is what would happen if the pilot follows protocol during a hijacking. If you want heroics and gunplay, go watch a ridiculous Liam Neeson movie!"}, {"id": 35, "text": "The story is pretty intense and engaging, especially given the fact that it is a single location film. 99% of the film happens in the cockpit."}, {"id": 36, "text": "The Participation Trophy Generation has truly ruined intelligent dialogue on virtually every platform. The reviews of this film proves it. Ignore all the negative reviews. If you have a brain of higher value than comic books, you'll enjoy this thriller."}, {"id": 37, "text": "While the direction was great and movie was very realistic Gordon-Levitts character is just dumb. Gets his own girlfriend killed by announcing all his plans to land the plane over the intercom, then doesn't open the door and keeps a hijacker alive who then regains control of the plane, and then has more remorse and sadness over his attackers death than his own pilot or lover. Very odd character development and probably my least favorite character in any movie ever. He's crying and trying to save the dead terrorist at the end of the movie but walks by his dead lover on the floor like it's nothing."}, {"id": 38, "text": "Seriously:1) Pull 3G, flip the plane, rock it 'til they throw up from vertigo, movie's over2) Hog tie someone properly or kill him - whatever3) Stop bleating at the terrorists, for heaven's sake4) Ground, don't you care how many souls (not passengers) are on board?5) Ground, 2-7-right, not R6) Ground, why are you obsessing about the damn runway in the middle of a hijacking nowhere near landing?7) Yeah, I'm pretty sure you can shoot down the plane once it's dive bombing an urban area. The fighter jets aren't there for decoration.8) Yes, you have tactical advantage when he's urinating.9) No, you don't care about him just because he gets a phone call from Mum.10) Sniper, is there any good reason for taking so long to take the shot? You weren't lining it up before he started waving the knife around?🙄🙄🙄🙄🙄🙄"}, {"id": 39, "text": "Joseph Gordon Levitt is an excellent actor and the reason I wanted to watch this although I went in knowing little. While he is his usual excellent self, he can not save this wholly unrealistic movie. With a wimpy terrorist on board that we are asked to ultimately feel sorry for and some actions that seem highly improbable, I couldn't wait for this to end. I expected excitement and all I got was JGL in the cockpit, in fact viewers should know going in that the camera doesn't leave the cockpit for the entire movie. Years ago the master, Hitchcock, created a minimalist classic with Lifeboat. This is no classic, it's just contrived and predictable. Unless you need to see JGL and terrorists stuck in a cockpit, this is one to skip. 4 stars only for the acting."}, {"id": 40, "text": "This is by no means a terrible movie, there are plenty of good elements this movie offers. The actors did great with what they were given. I like the chemistry between the pilots, however I wish the movie could have shown us beyond the cockpit. Almost the entire film takes place inside the cockpit of this plane being hijacked, not once are we shown the hijacking unfold from the passengers perspective. That is my main issue with this movie, it felt claustrophobic. Otherwise it's a slightly above average thriller that kept me engaged the entire time. Joseph Gordan Levitt carries this entire film, his character is very likable and by the end he was best element in this movie."}, {"id": 41, "text": "I really enjoyed watching dan drill my experience cinematic i never before , its totally about psychological mindset when we watch this turn off your light romm .dont excpectation the movie like non stop or united 93.this movie is like captain phillips tom hanks! JGL as tobias totally shy guy with strong heart!!!"}, {"id": 42, "text": "So there was no airfield for 20 minutes in Germany ? Nonsense ! And the pilot would have got that plane down sooner than all the nonsense that went on in the cabin ."}, {"id": 43, "text": "The film lacks an interesting plot, unrealistic behaviour, and the characters are difficult to relate to. Waste of time to watch this, the incel terrorist was the worst."}, {"id": 44, "text": "A movie that shows the reality of what a pilot can feel when his plane is hijacked. Suspense, tension, nervousness, impotence. From the moment the hijackers attack to the end, you feel like you want to help the pilot, you feel like yelling at him: pay no attention to anything and just follow through on your plans."}, {"id": 45, "text": "I normally can watch any film I haven't seen before even if the film has it's plot holes and bad acting but I couldn't finish this film. Joseph Lovitt is the only reason I decided to watch this horrible thing they call a movie. It starts out well enough putting things together and building a nice little picture but that's about as far as this movie gets. The plot is a joke and beyond retarded and I understand they're going for a realistic scenario but that attempt is just laughable. In what realistic scenario does Joseph the pilot get overpowered and knocked out by a guy with his hands tied behind his back!?!? I mean WHAT??? That scene made me so mad I had to stop watching. Anyone who can watch that scene and say to themselves, yea you know what I can see that happening. Doesn't live on the same planet I do. Another plot point I thought was absolutely ridiculous was how they managed to force and subdue everyone to the back of the plane with just tiny pieces of glass. Watch this film if you want a good laugh but otherwise turn left."}, {"id": 46, "text": "This film is without doubt worthy of a far higher review score than it currently has.Yes, it's a bit different, it's gritty and realistic and doesn't have that glossy Hollywood feel with a hero riding to the rescue and saving the day so that all can enjoy a happy ending.... and maybe that's why some people don't like it.In many ways, it does feel a lot more like a documentary and can feel a bit slow at times but I was hooked from the first minute and couldn't take my eyes off it.Well worth watching."}, {"id": 47, "text": "This movie is great. Don't let the bad reviews steer you away. Edge of your seat the entire time. There's not many movies that keep your focus as well as this one did. Watch it!"}, {"id": 48, "text": "Amazing Movie. You are very close to the characters. And the acting from Joseph Gordon-Levitt and Omid Memar is superb. Just watch it!"}, {"id": 49, "text": "I didn't even blink ...we were glued to our couch with our eyes peeled and not breathing.. It is an incredible movie.. I'm going to recommend it to everyone I know... Best movie of the year!!!"}, {"id": 50, "text": "This movie is very slow, straight forward and predictable. It's not bad but it's not great either, It's weird to say this but despite the acting being good for the most part, especially from the main lead actor or the use of slow suspense, somehow it feels like this movie is missing elements, but i guess they wanted to go for realism, what i mean by that is that this movie is very realistic in its approach of Airplane hijacking so fans of that kind of genre are in for a surprise i guess.Overall i thought the movie was okay at best, I'll leave it at 5."}, {"id": 51, "text": "Was looking for a good movie for the night. This started off good but halfway in got really boring, just lost the plot and dragged on with a predictable ending.Definitely not a thriller 🙄👎"}, {"id": 52, "text": "The pilot be like, Hey hijackers, we are going to emergency land in 12 minutes. Now you can start killing the passengers!. One star because there is no negative star option."}, {"id": 53, "text": "I'm a pilot, and I'm usually prepared to roll my eyes and laugh at the stupid and unrealistic things - like having a drunk pilot fly a jet inverted in order to save it - that movies do.This isn't that kind of movie. The dialog and action are realistic. That makes it all the more terrifying.The terrorists are a bit cliched, and that knocks off a point for me, but the rest is so very good that I'm glad I saw it.I think the bad reviews are looking for a shoot-em-up Hollywood Air Force One type of movie. This isn't that. It's about a man trying to stay alive."}, {"id": 54, "text": "Who wrote this movie? Flip the damn plane and let the terrorists hit their head on the damn fuselage. Quit talking to hijackers. Shaking my head."}, {"id": 55, "text": "We seen hundreds of movies like this. Doesn't add anything special to the hijack genre. Slow, simple, boring and pretty much predictable. If you have absolutely nothing better to watch have fun with it, but if you skip this you didn't miss much."}, {"id": 56, "text": "ABSOLUTELY TERRIBLE FILM ! 2 HOURS OF SOME IDIOTS BANGING ON A DOOR !"}, {"id": 57, "text": "During the viewing, I did find myself yelling to both lead characters to Man Up and Deal With Their Consequences! Of course, I've never been through the ordeal they have, so it's just speculation on my part. I thought Joseph Gordon Levitt was fine but the young terrorist guy had NO expression except I'm actually in a movie? The real-time idea was a nice touch; I wasn't expecting that in today's element of film making. Still, I recommend it in relation to how a story can be told in real time."}, {"id": 58, "text": "Just wanted to watch a movie before I go to sleep. Well, I'm not going to sleep that soon as I wanted. I have adrenaline in the circle. the movie keeps you in suspense until the end. and I found myself shouting against the screen to give suggestions on what to do to the magnificent Joseph. What a Surprising movie!"}, {"id": 59, "text": "Cheap and bad movie.You'll find yourself yelling at the screen from all of the stupid things Levitt does, then you'll skip forward to see if it was worth watching.It wasn't."}, {"id": 60, "text": "Started out ok. Then just a bunch of screaming and drivel. Then.......The ending. Absolutely one of the worst I've seen in at least a couple of years. Move along........There's nothing to see here."}, {"id": 61, "text": "Wasted 2 hours of my life... Worst movie ever watched 😡😡"}, {"id": 62, "text": "Great tension throughout. I just want to refute a few of the criticism that others have of this film, because the same criticisms come up over and over. First, a lot of people keep saying the movie is 90 minutes of someone knocking on the door. Not quite. They are POUNDING on the door, showing their desperation to get in. They pound while killing hostages. They pound while threatening others. They pound and try everything to break in. It never got tedious, because it was realistic. Second, some people hated the ending where you feel sorry for the terrorists. Not at all. One terrorist ended up helping JGL and literally SAVED is life. If someone helps your hero, then it's cool to feel for them The film is not set up to sympathize with the bad guys...just one of them who ended up a hero himself. The other 3 got what they deserved. Third, people hate the way JGL piloted and things he should have done, etc. He seemed to be following the book. You can't get anymore by the book than letting your fiance die rather than give in to the terrorists. I would have made the passenger announcement sooner: Attention all passengers. The bad guys only have glass weapons. Gang up on them now! So yeah, he was slow on that. But that is a character flaw that he didn't think sooner, not a plot hole as some called it."}, {"id": 63, "text": "The film starts off really well, but then it loses interest, what was the point. Very low budget movie. The whole movie could've been done in 10 minutes. Failed. People who giving good reviews must've seen some terrible movies."}, {"id": 64, "text": "It's a complete waste of time. In a way it is even childish trying to hijack the plane with a broken wine bottle. Casting is a total disaster, you can't find a Turkish actor to play Vedat?! Oh come on!"}, {"id": 65, "text": "Joseph's performance was not bad, but the making of the film was horrible. The film was boring as it lacked a captivating plot."}, {"id": 66, "text": "I love planes, tense thrillers, and off Hollywood productions. So a German movie about a hijacking of a plane cought my interest, for the first ten minutes. I suffered through the entire movie so you don't have to. Entire movie shot inside the cockpit but the movie never manages to build up a psychological tension like Das Boot.The cockpit is stormed, Plausible20 minutes to closest airport, FailPilot informs passengers AND hijackers of landing in 20 minutes; FailPilot ties up overmanned unconscious hijacker in cockpit after he killed the captain; FailHijackers killing passengers one by one in order to pursuade the pilot to open the door; PlausibleThe passengers charges the hijackers and overman one of them; plausible (like Flight 93)This is neither an action nor a thriller, maybe a documentary at best, but I give it three stars for some good acting And for the try."}, {"id": 67, "text": "Another waste of my time. This is really bad, there is no story, nothing. :("}, {"id": 68, "text": "Good until half way through the movie when an unrealistic event occurred. Destroyed the movie."}, {"id": 69, "text": "Pure garbage! In a cliche horror movie, it's okay to make the main characters as stupid and absent minded as possible. However, in a movie that features a pilot(s) you cannot do the same! Pilots are some smartest and most calm in the professional world. For some reason, that logic didn't transfer to this movie.Zero sense of urgency in this head scratcher of a film. After the initial attack in the cockpit, there was no effort to quickly descend and land at any suitable airfield. The communication with ATC was laughable and staggered for long minutes at a time. A hijacker that already attacked and murdered the captain was allowed to sit in the flight deck unconscious instead of having his head bashed in numerous times by the fire extinguisher. The first officer spent more time looking at the cabin video monitor and trying to negotiate with terrorists instead of just flying the darn plane and landing it anywhere, ASAP.The passengers were useless too. After 9/11, no one would sit idly by and allow this to happen while only 2 terrorists were in the cabin with small glass shards.This is more of a slow burn, mindless movie with bad guys banging on the flight deck door for more than an hour. Enjoy at your own risk."}, {"id": 70, "text": "I had the worst experience in movies EVER!By far the worst movie by Joseph Gordon-Levitt All the cast, the weird terrorists. There is NO creation in the story.2/10 is too much for this movie."}, {"id": 71, "text": "It's a good performance and tense. And cleverly shot. Well worth a watch."}, {"id": 72, "text": "I am getting sick and tired of movies being made where our main character makes every possible wrong decision you could make in a hostile situation. I know our world is severely lacking common sense right now but come on! Thats what movies are for, entertain us with some actual common sense decision making. This movie was awful, so awful in fact after 40 minutes of very poor decision making my whole family walked out. Im the poor sap that finished this God awful film because I wanted to write a review on how awful this movie was. AVOID THIS MOVIE AT ALL COST IF YOU VALUE YOUR PATIENCE. Because of the poor decision making, the events which unfolded due to these poor decisions, and very poor, ridiculous even, dialog this movie was a complete joke. It could have been great, but it was just so very bad me and my family will never watch this film again. This will be promptly deleted from our history. Yet again another hr and 30mins wasted on an awful poorly portrayed piece of Hollywood garbage."}, {"id": 73, "text": "The use of airline procedures was very good, for example the communications with air traffic control. However the descent to flight level 150 took way too long, almost 30 minutes! In real life at approximately 2000 feet per minute this should take around 8 minutes. The use of A4 IFR plates in a plastic wallet was also a false representation of how pilots operate. I would have liked to see a proper ending too, what happened to the pilot and hijacker? To conclude- just another aviation movie with no research gone into it. Such a shame"}, {"id": 74, "text": "Whilst the movie is well shot and the acting is good, the plot makes no sense. In an extreme situation anyone facing difficult decisions would have to do what it takes to keep anyone safe. Unfortunately the key character keeps on making poor decisions that lead to more problems. Pass."}, {"id": 75, "text": "All components in the movie are just right. All, except the ending. What you get from this movie is a simple and brutal slice of life (and death). There is no redemption. Just a bitter end. I mean, this is not a waste of time, but the only think you get from this movie is a slight, short lasting discomfort."}, {"id": 76, "text": "After what happened on 911 I find it hard to believe that that 84 passengers could not or would not overpower 4 hijackers who didn't have weapons."}, {"id": 77, "text": "Boring and annoying. There would be a protocol to follow no matter what. Said they would be landing in Hanover in twenty minutes, well that was a long flight path!"}, {"id": 78, "text": "Your telling me captive terrorist couldn't defend against a tighted up terrorist thats been beaten. Joseph Gordon went from decent actor to amateur hour at the Apolo, the narrative to the story was crap!!💩💩the directing was below mediocre I didn't like nothing about this movie, having these people rate this a 5 out of 10 is beyond me... obviously they can't tell from a horrible movie to a decent flick.. worst performance in Gordon ive seen since 50/50 can we say stinklerrrr👃"}, {"id": 79, "text": "There's no point in refueling the plane if you kill the pilot... can no one speak up and say this to the poor kid?You killed the only hijacker that was a pilot. You're going nowhere if you kill the only pilot left.And by the way. The living pilot only have one arm. Is it possible to do a lift off with the hijacker as copilot. Probably easier to land that way..."}, {"id": 80, "text": "Dumb and Boring. I was glad I only wasted and hour and a half but I had wished it finished when they landed."}, {"id": 81, "text": "I don't understand the poor reviews, this is everything I expected, so simple and brilliant. The only critics: is actually weird that passengers don't fight back and that 3 glass knifes were undetectable?? I've heard that security in Europe it's less strict than in here, but I've only been once to Europe. Other than that, it's the closest thing to reality that I have watched in this kind of movies. Amazing!"}, {"id": 82, "text": "I appreciate the acting skills required in this one but the plot had zero surprises. Every cliche for a hostage on a plane movie played out. I hate the main character for his poor choices failing to appreciate their clear and predictable ramifications. For the first time in years, I found myself yelling at the screen and the actors for being so stupid and me for being more so by continuing to watch."}, {"id": 83, "text": "The only reason I've watched this film is because of Joseph Gordon Lewitt. The pacing of the film is horrible and is by far predictable and expected. It's by far the worst plane hijack film there is. It's got no storyline nor even any music to go along with the film. Seriously if you're taken your time to read my review please do sit this one out"}, {"id": 84, "text": "I watched this movie without subtitles . Almost half of the talking is in German so when the terrorist took control of the plane and starting speaking to control tower in German, I didn't understand a word but i as waiting for him to finally say Allah Akbar- to know that one of these movies where Muslims are the bad guys.this is getting too Cliche and it has got to stop somewhere. other than , that it's still lousy boring movie that is not worth your time."}, {"id": 85, "text": "Tense and realistic for the first part, then once in the air things get too far fetched and the plot makes no sense. I really wanted to like this film. But by the time it's over I'm confused as to the characters motivations, which don't make any sense.Just a poorly written script that was done without background checking with any pilots beforehand. I'm sure that anyone in the industry will roll their eyes while watching this and vote the same. Ending is annoying but at least it's over."}, {"id": 86, "text": "Loved the insight into the cabin, excellent direction. A genuine thriller in every sense. Felt breathless! Excellent acting from all."}, {"id": 87, "text": "Truly, do not bother watching this movie. I love Joseph Gordon-Levite's acting, but his talent was completely wasted in this low, low, low budget movie."}, {"id": 88, "text": "Movie is bad depressing and boring don't watch it!!!!!! Please"}, {"id": 89, "text": "Lacking punch in its character interactions and a huge amount of momentum in the second half, the strong performances from Joseph Gordon-Levitt and some nerve-racking tension early on help propel this single location film to entertaining enough heights."}, {"id": 90, "text": "Brilliant, actually. I freely admit that I watch a lot of dreck. This film, otoh, is the kind of movie that I hope to find, when I'm browsing through Netflix (or other streaming services). It's a movie, so it's more than a realistic portrayal of a hijacking. That's where the brilliance comes in. There is not an ounce of fat on it. It's tight, lean, extremely well-acted, by all the actors in it. Most of the action takes place in a very small space, and most of the action is among only a few actors. Even the voices of the police are off-screen. For this all to work requires wonderful acting, wonderful directing, a really great script, and a stellar understanding of human behaviour/thinking - both of the characters and the audience. I'd also like to note that it was a good idea to cast an American actor in this film. *I* would have watched it if it were a German movie with subtitles, but a lot of people would not. So this gem of a movie has gotten a wider audience in English-speaking countries than it might otherwise. Well done, all together."}, {"id": 91, "text": "Not sure what some expected and how much some pay attention before they review, but it is not his wife, and if you find the lack of characterization a problem then I think you aren't paying attention. OK, with that said, this movie is a tight, well done bit of tension. We don't need a lot of back ground. The first 20-25 minutes set that up, how the bad guys are going to do the dirty deed (pay attention to the duty free shop and the bathroom exit) and the conversation between the pilot and co-pilot (and his brief conversation over child care with one of the attendants). That is the set up. That is all you need. Then it start with a crash, a big crash! We start a ride of tension that takes place in a cramped cockpit with only the darkness outside the windows to give us any sense of distance and pounding on the cockpit door that is like some drummer channeling a drug addled beat only he understands. 7500 is code for our plane has been hijacked. The pilot is dead, one hijacker is unconscious in the cockpit, Joseph Gordon-Levitt, as the co-pilot, owns this role and shows himself as one of our best actors. The other doesn't really come into the picture until the last third, Omid Memar as Vedat shows himself as a strong young actor pushing the tension on a roller coaster as Gordon-Levitt tries to bring the calm. This is a 90 minute tense ride that 1st time feature director, Patrick Vollrath controls like a master. His co-written script waste nothing and yet gives us all we need for a wild ride."}, {"id": 92, "text": "Long time I wrote a review! But I decided to write one now.I truly enjoyed this one thoroughly. No Hollywood nonsense nor babes, just real emotions. Raw and gritty.Acting is superb. Pace is spot on, which adds to the realism.One of my best movie experiences of the year.This is REAL cinema!"}, {"id": 93, "text": "I thought this was a very accurate thriller because I learned quite a lot about what pilots go through and it was actually quite educational, because there are a lot of things pilots can and cannot do when terrorists attack on an airplane. It was very realistic and I appreciate that no one added any exaggerated or false information for entertainment. Also, I love watching movies about airplanes because it gives me unwanted anxiety. Seriously. My heart was beating so fast and I felt so scared the entire time. I don't even get this scared when I watch horror movies. Airplanes are so much scarier."}, {"id": 94, "text": "Movie is boring and unrealistic that passengers and pilot would behave this was. Terrorist with make shift knives come on. Turn the plane upside down. Just bad."}, {"id": 95, "text": "I work in the field of aviation. The movie started with a good potential but the drama and plot didn't make any sense. The boy kidnapper was too hesitant and scared, he even killed his own leader and brother out of fear of death! What the hell was he thinking doing a suicide attack then!!??? The only good thing is the accurate aviation details. but other than that .. it's pretty much a waste of time."}, {"id": 96, "text": "Great cinematography and acting, but even for the decent 92 min runtime, with the slow pacing it felt like a 3 hour long film. There was too much filler for the little substance. Writer and director Patrick Vollrath has only made short films, and this one should've been one as well. It needed more drama or action to comfortably fill in the 92 minutes, say some MF snakes on the MF plane. The view from the cockpit was cool though. It's a 6/10 from me"}, {"id": 97, "text": "I completely agree with the review by Jonathan Christian: Joseph Gordon-Levitt Shines In A Tense, Claustrophobic Thriller That Proves Less Is More.In fact the movie takes place almost entirely inside the pilots' cabin of an airplane and yet it's very tense and engaging. The way it is filmed reminds me of the 2018 movie: Den skyldige - The Guilty, one of the perfect example when less is more.7+/10"}, {"id": 98, "text": "Does this film want to tell that Muslims are terrorists ?"}, {"id": 99, "text": "I don't like aviation movies, they never get more than two things in a row right. This movie hits home somewhat as I'm a pilot (though on a Boeing) and as such it could happen to me, so I was curious as to how bad another aviation movie on this topic could be.This movie... I was stunned and amazed, I had a genuinely elevated heart rate all throughout watching it. You really feel the lack of movement and placement scripting in the absolute freedom and improvisation of the filming, it is so inconceivably unpredictable and realistic. All the procedures and actions are technically correct too, which can feel superfluous for the people that don't know and care, but is a level of authenticity in movies that I've never seen.I am advising all my colleagues to see this."}, {"id": 100, "text": "So we have a would've been excellent movie with limited camera space, smart moves and scenario within the plane cockpit but ofcorse who should be evil, you guessed it, ofcorse Muslims and they want to do a suicide crash of the plan over a city. It's really enough with this theme. The pilot Tobias as a character is also very ill developed with strange reactions towards his colleague Pilot and his girlfriend."}, {"id": 101, "text": "Another movie to feed the hate between people. What are you trying to achieve framing a group of passengers? Why do you insist to accuse certain people? I.hope this movies fails to zero...all with others like that. Please stop and spread love not hate."}, {"id": 102, "text": "Decent acting, technical details solid (I'm a frequent flyer and have spent some time in a cockpit) - but the story is not enough for more than a very short movie, definitely not enough for an hour and a half. This could have been a decent hi-jacking scene in a movie that actually had a plot."}, {"id": 103, "text": "We just watched the movie holding out breath. At one point my husband looked at me and laughed because I was at the edge of my seat. As a frequent overseas flyer, the sounds, atmosphere, feeling is so spot on, you feel like you are on a plane. Joseph Gordon-Levitt is exceptional in this role, you live all the emotions and desperation with him. Movie is so raw and real, not like an unrealistic hero movie. I really enjoyed this movie and recommend highly."}, {"id": 104, "text": "This seems like what would happen in a airplane takeover vs. the Hollywood version. The pilot seems to have a huge conscience and completely against killing which makes it really interesting or the movie would have been over halfway though. But, that literally defines us as individuals so it was interesting to watch."}, {"id": 105, "text": "It's not hijack,it's crash. Awesome performance of everyone, really appreciate the direction, adorable acting joseph gordon-levitt and omid memar, don't believe low rating, worthy watch."}, {"id": 106, "text": "Pretty enjoyable and tense movie. Better than the vast majority of amazon or Netflix originals. Worth a watch."}, {"id": 107, "text": "Having seen the trailer on this movie I decided to watch it while not expecting much. I was really surprised. The movie was very well written and portrayed. I definitely recommend it."}, {"id": 108, "text": "After the movie ended i felt that it can't finish, it is not finished properly. The best thing in the movie is Joseph gordon levitt's acting skills which made the movie so much better"}, {"id": 109, "text": "All most the entire movie was shot in cockpit. Acting looked realistic.Entire movie looked so realistic.Well done."}, {"id": 110, "text": "If not for JGL (the pilot) , this would be 4 stars. Starts slow, continues slow, gets exciting, get slow then exciting, then slow and then over. Thats the movie"}, {"id": 111, "text": "The premise is not realistic because the Muslim terrorists purchase duty-free bottles of liquor and take them into the airport bathroom to turn into glass shard weapons to bring onto the plane. The reality is, purchases at Duty-Free shops are given to passengers at the gate as you board. Either the writer didn't do his research, or he knew but figured not enough people would realize this. That killed it right there for me."}, {"id": 112, "text": "Never reached a high point of excitement or a decent thriller. Tried to be cerebral, but failed due to a poor script. What could have been good film with better writing was a made-for-TV mediocre movie."}, {"id": 113, "text": "Some educational material for the kids. Oh i enjoyed it SO much, down to the last moment Stockholm syndrome. You can try basting a problem with butter and sugar instead of solving it. Or you can just see things for what they are and be at peace. Enjoy your knowledge and abstain from even being close to untidy things. Let alone get involved. Loved it. 8/10"}, {"id": 114, "text": "95% of the movie plays in the cabin of the plane. A story boring not even realistic. Probably was cost not more than my annual salary and I'm not a banker. Con Air 1997 with Nicolas Cage is still much better to watch after so many times, if you want a normal hostage movie. This one very far from the reality, people with the 5 start above reviews are delusional."}, {"id": 115, "text": "The entire movie is filmed from within the cockpit of the aircraft, which creates tension and adds to the claustrophobia (apart from the final scene of the movie when the camera is for the first time outside of the cockpit as the first officer exits the aircraft). Gordon-Levitt gives a strong and believable performance throughout and makes the movie.I dropped a star as two problematic parts of the movie (which are needed to carry it forward) had me screaming at the screen as stupid errors on the part of the pilot. Number 1 was even making contact with the hijackers through the cabin announcement in the first place and telling everyone they're about to land, and number 2 was not killing outright the hijacker in the cockpit instead waiting for him to wake up and start attacking people again. Perhaps if we saw that Tobias had slit his throat with the glass it would have been a more convincing assumption that the hijacker was out for good, only to start twitching and wake up later in the movie.I can overlook what I consider to be silly mistakes for the fact that there wouldn't have been much else of a movie if the Tobias had just shut off the screen and landed the plane.Technically it dealt with the riggers of piloting an aircraft accurately and genuinely, although I was about to assume they had forgotten to lower the flaps as the pilot should have explained that before final approach, rather than 2 seconds before the plane was about to stall.There's no over dramatic score, no hyped up visual effects other than what can loosely be seen through the cockpit window, and it feels as though we are seeing everything from the first officers perspective. It manages to make the cockpit feel cramped and realistic.Overall I would recommend to anyone who enjoys psychological thrillers, and congratulate Joseph Gordon-Levitt for another great performance in a very compelling and unique take on the classic aircraft hijacking scenario, based entirely from within the cockpit. If the pilot can't see what's going on in the rest of the plane, then we don't see it either.There are no stupid plot twists or the kind of nonsense you would expect from an action movie designed for people with short attention spans. It's a straight up realistic first person hijacking scenario from start to finish, where good people die needlessly and few come out unscathed.Highly recommended."}, {"id": 116, "text": "This film start with a video footage of a bunch of passenger at the Berlin airport, and the introduction of a co-pilot Tobias scene! As turnout, this film is about Tobias need to prevent a bunch of terrorist, who try to crash the plane he fly from Berlin to Paris! Entire film full of boring conversation! The director not showing outside view of the plane, make the film unwatchable! How can we know the plane is flying, even entire film did not portray the plane shaking! The terrorist don't even have a gun, also make the film ridiculous to watch! The stabbing, and shooting scene not even show in detail! Barely intense scene is, Tobias take down one of the terrorist Kenan in the cockpit! At the end, another terrorist Vedat stab Kenan to death! Tobias landing the plane, and Vedat kill by the police! That's it! Wasting time to watch!"}, {"id": 117, "text": "Thought something exciting on the plane but it's too long for the whole situation. Almost can't finish the movie. Foreign language is also problem. Storyline is nothing special of a hijack situation, i feeling the captain speaking his experience with the hijacker on other side and the scene come out, totally a documentary just without the captain talking. Budget is low but worst is toooooo boring."}, {"id": 118, "text": "If you just didnt talk to them and look at the camera and kill the one in the cockpit yall are safe"}, {"id": 119, "text": "Well the concept is not new but the use of the camera is interesting being based totally in the cockpit.Terrorists want to hijack plane ... first half is interesting the last half was A boring sequence of a terrorist second guessing himself (probably meant to be emotional) WAAAAYYYY TOO LONG"}, {"id": 120, "text": "It started promising, there was good build up, but after a while you just wish Robin would of just stabbed him and cut the movie short as it seemed to drag on towards the end."}, {"id": 121, "text": "Turned it off after the scumbag in the cockpit didn't get his head caved in by Livitt. Never, Never keep a hostile within reach unless totally incapacitated, sever Achilles and elbow tendons, cut off fingers if needed. An bad guy can usually only hurt you with his hands. The cockpit is the only bastion of safety on an airplane. Never loose control at any cost."}, {"id": 122, "text": "Intense, gritty, claustrophobic, detailed and realistic. It's the kind of movie I like and rarely see. Not a big budget hijack movie with bright lights and non-stop action - I suspect that may be the reason for low reviews. A realistic and brutal feel of what a hijacking would be like from a flight deck. All of the actors were great."}, {"id": 123, "text": "Do you want the first 20 minutes of a thriller to bore the fool out of you? Do you hate surprises and twists and turns? Do you like your villain to be whiny, unbelievably annoying and not at all menacing?If you answered yes to all three, this pic's for you."}, {"id": 124, "text": "Way too predictable, very cheap budget. Entire movie takes place in cockpit of plane. Horrible."}, {"id": 125, "text": "Terrorist in any form is frightening, but when there is a plane and innocent lives involved it's a trifecta of pure fear. The writing, acting, directing and POV of basically filming the cockpit was brilliant.May I suggest a PART II and only have POV of the passengers and crew? It would be an interesting and thought provoking sequel."}, {"id": 126, "text": "I never write reviews, but I found the acting was nuanced and superb, the script excellent, and the action true to life. It is damn hard to fly a plane and even harder to land it for those who think the co pilot was incompetent. Far from it."}, {"id": 127, "text": "In some ways this film reminds me of the claustrophobic atmosphere found in such films as Das Boot, in which almost all the action is inside a very tiny cramped space. And action, there is plenty of. But the action takes a backseat to the mental stress endured by both sides of the battle over control of the plane. The best part of this film is the understated, yet intense acting by one of our best, Joseph Gordon Levitt. This is one of those action thrillers that is well worth watching. My only quibble, and it's a small one, is how abruptly the film ends. It somehow felt like something was left unsaid."}, {"id": 128, "text": "A surprisingly good movie; the cockpit realism and real claustrophobic feeling makes the viewer feel one is trapped inside right along with the copilot and terrorist. Only one flaw in the plot, The terrorists stormed the cockpit only 3-4 minutes after takeoff, why not just turn around and land rather than flying off to an alternate airport? That made no sense, that flight could have ended in 3 minutes.The writers should have waited until the flight was at cruising altitude. That would have made more sense. Regardless, don't skip it."}, {"id": 129, "text": "There are too much technical details, such as preparing or driving the plane. There is no wider plot about hijackers and their whole plan after hijack. Movie is justa docu too real. almost like a documentary movie."}, {"id": 130, "text": "I was going to play Canasta while I watched this inexpensively made airplane drama and about 10 minutes into the film I found myself glued to my seat. I haven't seen a JGL film in quite a while and was wondering just the other day what ever happened to him and then I found myself saying, gee, the co-pilot looks awfully familiar and then I said, it's the kid from 3rd Rock From the Sun which is how we used to refer to him. My God!! What teeth you have, son. What a performance he turned in on this film. If I had my way and anybody cared, I'd have put his name up for an Oscar. It may be a little film but 7500 had a great performance in it. You don't see that many really great stars who have that kind of talent these days. Usually, it's because of their pecs and 6 packs not for their acting chops and JGL certainly has them. Also, it helped that he had some decent backup in the supporting cast and some really good writing. All in all. I enjoyed my quarantine evening perfectly well."}, {"id": 131, "text": "From an airline pilots view like me. It's been very well and accurately made."}, {"id": 132, "text": "I suspect the bad reviews are from people who have never watched a black and white film or a film that didn't have explosions. Perhaps they should avoid psychological thrillers in the future as well as films with subtitles."}, {"id": 133, "text": "Tight and gripping. Dips 3/4th in. Very human and a great attempt at creating something very real. The atmosphere is very dense in the sense that there's only the sound of the engines on the background and the set is only lit by the interior lights and any kind of moonlight/city lights. It's bleak and serene and I found the attemps to keep it as simple as possible commendable. If it wasn't for Joseph Gordon-Levitt's excellent perfomance (and some great sound design), it would not come in as strongly as it does. In my opinion, it's one of those little gems of cinema that try something else, succeed, but will never have a big audience. For me, it could have done with less chaotic camera movements, less cuts, longer takes to really drive home the situation."}, {"id": 134, "text": "Terrorists are Muslim and one American hero save the world same underrated movies.."}, {"id": 135, "text": "I kept waiting for this movie to go somewhere, but like a plane that never gets off the ground, it sputtered. They attempted to tell the tired old skyjacking story from the point of view of the cockpit and, though that's unique, the whole movie is single-camera and takes place inside that cramped little space. That's it.The pilots get settled and the flight attendants begin boarding. They take off and one of them opens the cockpit door. A Muslim terrorist rushes the cockpit and the rest of the movie is a conflict between the hijackers and the surviving pilot over opening the door or not. In real life, the door is not opened after passengers board, so the whole movie is based on a device that is divorced from reality."}, {"id": 136, "text": "Had I recently not seen Hunt to Kill this would have been the worst movie I have seen this year. It would be a close contest between the two of them for worst, and I'm not sure I could honestly say which one was worse."}, {"id": 137, "text": "Very boarding, the is no story or idea. Total of 1.5 hours lost."}, {"id": 138, "text": "No twists, no turns. Highly predictable. No heart, no brain. No story. I barely cared what happened to any of the characters as there was no character development. With good editing it would be a nice commercial for Lufthansa."}, {"id": 139, "text": "If you are reading this review before making your decision - lucky you. Watch something else. Anything. Else, told you it was a horrible waste of time."}, {"id": 140, "text": "Well. One of the best highjack stories out there. Real, tense and dark. And no happy endings."}, {"id": 141, "text": "This must have been made to satisfy some sort of tax deduction as there could not be any other reason. My guess is that the actors were paid for the number of words they spoke, lines they had. Since there were very few, that cost would have been very cheap. The script is childish and the dialog appears to have been heavily improvised and made up as the film progressed. There's a lot of shouting, head banging and crying which, after a while, becomes very tiresome. Amazon certainly invests in some real duds....and this film is a prime example of that!"}, {"id": 142, "text": "How, as a movie maker, can you not check facts and be a bit more realistic? Besides the annoying 1 hour long knocking on the door, this movie is full of stuff which just won't ever happen. Of course, its a movie, so it doesn't have to, but when you are trying to portray a realistic setting with an actor like JGL, you should step up your game when it comes to story and execution. This was just not good enough. By far not good enough."}, {"id": 143, "text": "The film treats terrorists as good people at a bad time. the pilot is a hysterical and crying man who believes in dialogue with murderers. ridiculous"}, {"id": 144, "text": "Really there are no words to describe how stupid this movie is, characters doing unrealistic actions. I mean how many times do writers use the same old good guy defeats the bad guy only to have the bad guy wake up and overpower the good guy? Honestly, don't watch this , you'll be yelling at the TV at how unrealistic it is."}, {"id": 145, "text": "I thought this was going to be something to enjoy on Friday night. It turns out to be a real pain watching it. The plot is simply horrible. You will feel annoyed after watching this. Most of the time, you hear stomping on the cockpit door while the story was going nowhere. Really cheap movie."}, {"id": 146, "text": "It have a good start and well done flow, sadly it move to extremely bizarre behaviors making it almost unwatchable.It feels like all decisions and actions where forcefully made so the movie can have continuity. Trying to perform an accurate perspective of a hostage scenario contrasts with all the dumb decisions the characters make. I won't recommend it."}, {"id": 147, "text": "7500 (2 out of 5 stars).A boring thriller that focuses on Joseph Gordon Levitts character being a pilot and a few terrorists are trying to hijack the plane. While Joseph is trying to remain locked in the cockpit trying to land the plane.It was a boring movie. It spends the perspective in the cockpit. The performances were good with Joseph but the plot and thrills sit in the very back seat with this movie."}, {"id": 148, "text": "Joseph Gordon Levitt gives a reasonably good performance as the co-pilot, however the pace of the film is slow and at times boring. The story is predictable of course."}, {"id": 149, "text": "It's just like the Buried movie where one character is in a closed space. The thrill was good. Don't really recommend this but watch this for the thrills"}, {"id": 150, "text": "Nothing new, same as 90's storyline of plane hijacking. Totally waste of time"}, {"id": 151, "text": "A plane is hijacked by muslim terrorists. The film takes place only in the cockpit, which I liked. But there is a big but : They could have chosen something different : a rock star completely stoned on drugs who attacks people on the plane, a man who has a panic attack... But no, they had to chose muslim terrorists ! And stupid ones at that ! One is a murderer one who hopes to open the cockpit door striking it whith his foot, one is a suicidal one who wants to avenge his brothers and sisters (whatever that means), and the last one is a crybaby who doesn't want to die and is completely incoherent. Well executed but the bad guys are ridiculous. !"}, {"id": 152, "text": "Everything about this movie felt real. From the fast confident acquaintance that develops between the pilot and co-pilot, flying together for the first time, to the steadily increasing pressure from the hostage negotiator puts on the young terrorist. I pray to God never to be in a situation like this but in my worst nightmares this is what I dream being held hostage at 30 thousand feet moving 250 mph feels like. It's been written and I agree the director and cast must have worked with professionals to capture the casual formality of a professional flight crew on a routine flight to the taunt life and death horror of their rapidly changing reality. My panic attack started ten minutes in."}, {"id": 153, "text": "Well done and actors were amazing but the end was terrible. I mean okay movies with bad end but please you can't leave the end like this. It was horrible. The only feeling I felt throughout the whole movie was anxiety for the characters. Could we at least see the son who sees again the father? Why ending a movie with the dead legs of the woman. Really the worst end a movie can have. It was so disappointing!"}, {"id": 154, "text": "Suspense was very intense but some rookie plots and foolish act in story and mainly by writer was unbelievably nonsense! the movie from beginning up to first highjack was perfect but after that totally disappointing. I think writer had good time to structure the story up to that and then passed the written to another one to have a nonsense ending... it was a police reaction?! drop the knife! hey what are you doing ! don't do that! hey! please rewrite the story I believe that after hijacking you can tell a meaningful story"}, {"id": 155, "text": "Joseph Gordon Levitt is an incredible actor! Very gripping suspense thriller, I didn't expect it to have some German in it when I saw the trailer. I think it's excellent real planes were used for the the filming! Definitely seems underrated but I kinda understand the negativity I think 7500 is very enjoyable."}, {"id": 156, "text": "Firstly, let me start off by saying Joseph Gordon-Levitt is great. He delivers a fabulous performance filled with emotion. And for a feature length debut, the film is quite good. The premise and motivations are simple, but extremely effective and stimulating.The movie starts strong, getting in to the action right away and keeps the tension high for the first half of the film. While the second half of the film isn't bad by any stretch, it is a lot lower energy than the first half leaving the film with a strange sense of pacing which detached me from the ending.If you are into a low-action/thriller with a great character study, then I would recommend. I would say if you are interested, then it is worth a watch.SPOILERS: The first 55 minutes is the plane getting hijacked, which is amazing and invigorating. But following the betrayal in the cockpit, the movie begins to slow in pace drastically. While there is still tension between Tobias (JGL) and the young terrorist, it feels like the climax has already occurred, which made my engagement go down.Tobias regains control of the plane 53 minutes in, right after the younger terrorist kills the older one. After this, and especially after Tobias lands the plane, it felt like the action had ceased and the stakes where way down, which made the last 20 minutes of the movie feel like it could have been 5.All in all it's impressive that the whole film takes place in the cockpit, which allows you to really be in JGL's shoes, and his performance is amazing. But the ending really soured the after taste. Personally, if you shaved 15 minutes off the end and added that time into the middle and beginning the movie would have been a more effective use of the hour and a half. It feels like a 50 minute short film that they turned into a 80 minute film.But beyond all that, the movie is still an impressive debut with a strong leading role that is worth at least one watch."}, {"id": 157, "text": "Just know going in, that this is a small film. Pretty much a short story in 90 minutes. It's a hijacking. The whole thing takes place in the cockpit (actually a studio cockpit with CGI for the exteriors. So don't expect a lot of film art or message, or film theory analysis here. It's not bad. It's not wasted time. You won't feel ripped off. I could have easily been produced as a play. (maybe it was?)"}, {"id": 158, "text": "Realism is very important to me. As a hobbyist pilot, I had to watch it. Right from a cold-cockpit startup, to takeoff briefing, climb and emergency calls, I told my wife oh yeah, they got good technical advisers. The story and execution are also fantastic."}, {"id": 159, "text": "Wow! This was a great movie. I was on the edge of my seat the whole time. My husband and I both liked it a lot."}, {"id": 160, "text": "I can't believe a single set, low budget movie was as nicely executed as this is! The more you watch the better it gets! Everything happens inside the cockpit the performances are great and it has you glued to the screen the whole 95 minutes."}, {"id": 161, "text": "This tried really hard, and got me fired up. Too many holes in the story. I did not like the ending. Totally knew they were going to kill the kid. Wish there was a voice on the other end of the call. All around good try, but it could have been better."}, {"id": 162, "text": "Such an underrated movie, its picturized to well just from the cockpit during the entire film They pulled it of so well"}, {"id": 163, "text": "The moment you feel their pain and fear is the moment you know this can happen to anyone. The way this Film was made was so raw and emotional and gut wrenching from the seat of the pilot and how he dealt with this really horrible situation.Amazing film making and performances in a grip of few camera angles. The way the hijacker was scared was so raw too. I will never understand the delusions of these hijackers but 1 hijacker did not want to do this.This film is only on amazon prime and a must see The acting is phenemonalA well deserved 9/10"}, {"id": 164, "text": "Let's do a quick round-up of what was impressive and what wasn't:(+) A solid performance from Joseph Gordon Levitt; he literally carries the entire film on his shoulders. (+) The single/cockpit setting. One really gets the feel of sitting in a commercial flight cockpit, especially in the first 30 minutes. (+) Some well-placed thrills.(-) The by-the-numbers storyline. There's nothing here that sticks out from a storytelling perspective. (-) The staggeringly slow-paced final act didn't exactly work for me. It took away the wind in my sails, to be honest. (-) The attempt to detail the character arc of one of the antagonists did not pan out as great as I'd expected.Overall, it's fine for one-time viewing."}, {"id": 165, "text": "Brilliant movie about a plane hijack. I defenitely recommend it. The story is well crafted, everything is told in real time. 19 years after 9/11 we come close to what it actually meant emotionally for the pilots and crew in those planes which ended so tragically."}, {"id": 166, "text": "I enjoyed this movie from start to finish. It's a realistic recreation of whay might happen in a plane hijack. No Hollywood special effects, explosions, gunfire or unneded dialogue.One user reviewed this with a 1, I went to see his profile and he reviews 90 percent of the movies he watches with either a 1 or a 10, I saw a couple with a 4-5, so please don't trust reviews that give such low scores because they only want to express that they didn't like the film. I guess the same is for people easily giving a 10 to a good movie."}, {"id": 167, "text": "Good acting, nice suspense and probably quite realistic (can you really buy Glas bottles at duty free? Can't remember anymore...)"}, {"id": 168, "text": "Not intense but a good watch. Certainly our 'hero' is the centrepiece of the movie and it seemed realistic but who knows in these scenarios.Ending ... hmmm. Typical I guess"}, {"id": 169, "text": "Very realistic and an emotional roller coaster. No Hollywood heroes, no Hollywood bad guys. I was absolutely riveted to the screen throughout. Joseph Gordon-Levitt and Omid Memar are both brilliant."}, {"id": 170, "text": "First 40-50 minutes are very interesting, however after that movie is hard to watch. Endless conversations, which are messing the characters, low intensity and murder of several characters i felt with(which had to cause much feelings, but didn't) - makes all boring.closed the film 5 mins prior to its end."}, {"id": 171, "text": "I've never been in a hijacking but I would imagine this is how it would go down. Just a super suspenseful and at times nerve wracking movie from start to finish. Joseph Gordon-Levitt is such an incredible actor. Always plays such a believable role. The ending had you guessing too!"}, {"id": 172, "text": "All those things above, BUT I felt something off about the directing and this feeling had grown when the movie was in his 40/30 minutes to end. However, this movie has a strong message and keeps you thinking and anxious that this things happen, it's not a mainstream action movie fiction... Its developed to make you think and acknowledge that this wasn't made for entertainment, but for awareness."}, {"id": 173, "text": "The movie feels very realistic. It might not be your typical Hollywood action thriller but it gives a sense of what a real life hijacking looks like. The acting is good and so is the writing and direction. I think it's unfairly underrated."}, {"id": 174, "text": "Prefect the movie shows all point of views from the copilot as what he would of seen and what he could and couldn't do. Although the story line could of been a little bet better with other characters in the story. Acting was great with Joseph Gordon-Levitt and Omid Memar."}, {"id": 175, "text": "This almost felt like a found footage movie with better shots, very realistic. Interesting to see what goes on in the cockpit. The tension is real, so much so that watching this movie feels monotonous in some way. Very good film and I'm not sorry I watched it, but I won't watch it again."}, {"id": 176, "text": "I thought the acting was very good but the purpose of the hijacking seems shallow. The realism was spot on. But why is it that airplane movies always include a relationship between a member of the flight deck and a flight attendant and of course a child involved? (Airport) I am into aviation generally so I was interested to watch this. I sped through some of the no-action dialogue between Gordon and the young terrorist in the last third of the movie, but up until then I was glued to the action."}, {"id": 177, "text": "This is a tight suspenseful little movie It is very realistic and yet artfully done."}, {"id": 178, "text": "This film had me gripped all the way through. Great acting and really moving. Shame the ending didn't really tie anything up."}, {"id": 179, "text": "Everybody is talking about Joseph Gordon-Levitt, how amazing he is. Well, yes, he is really amazing. He did very good job. He is actually quite experienced actor. But why nobody has yet acknowledged the other actor Omid Memar. I've never seen him before, and as far as I understand he is very young, but he also did a great job considering that this movie required a lot emotional acting from all of the actors. This movie gives you an aftertaste, but I can't differentiate wether it's good or bad. Probably a little bit of both. Despite the main character was alive at the end, there's still no happy ending for him. He couldn't save the captain, he couldn't save his wife, he couldn't save some of the passengers. And who knows will he be able to fly a plane again.."}, {"id": 180, "text": "A really big film was made here with very little resources. The camera is always very close to the action, which only takes place in the cockpit of an airplane. It is spectacular to see how much tension can arise in so few meters. Tension in the smallest of spaces. Absolutely worth seeing."}, {"id": 181, "text": "Made you feel like you were in the cockpit, the real cockpit. From preflight checklist, to emergency landing, and finishing it up with the extraction. Give it a shot you won't be disappointed!"}, {"id": 182, "text": "GOOD. I consider the initial objective of the film to be met, which is to cause suspense in the audience and to work on the 'action' factor. Looking only at this aspect, ok. As far as I know, it is not based on real events. Thus, it is possible to perceive several logical flaws in the events. For example, the co-pilot's attitudes during the narrative are absurd and not compatible with a real situation. It is even comical to watch the actor dramatize an issue that should only be dealt with from a technical point of view, according to the existing global air safety requirements. In any case, it counts as entertainment, which is what matters. So I give it a high grade. You will have fun. I RECOMMEND!"}, {"id": 183, "text": "This film is good. The acting is good and really realistic. The story is simple and clear. Almost all the story is going in the cockpit, and the conversation between all characters made the atomosphere really real. This film really worth watching once."}, {"id": 184, "text": "Probably one of my favourite movies of 2019.....from the beginning i wasn't expecting much, but soon got hooked into just how realistic and well written the script was.. no Bruce Willis to the rescue, no Gerrard Butler air marshall...just the reality of how modern day terrorism works....and the hard decisions ordinary people have to make to save others..."}, {"id": 185, "text": "I did not expect such a powerful thriller here, in this film that at first sight looked like another common aboard a plane terrorist and hostages scheme. You may prefer NON STOP, I would not blame you, but this one, though being a small budget flick, is very interesting thanks to the character study, especially the young terrorist role, very ambivalent, who hesitates between helping the hero and proceeding the mission of his terrorists sidekicks. I like this, but I guess many viewers won't share my enthusiasm. That's after all a simple matter of taste and sensibility."}, {"id": 186, "text": "I haven't seen anyone mention this so here goes, the film successfully created suspense without any soundtrack. The only sounds were what the character would have heard and our emotions were created solely from the situation and story, not through dramatic scoring.And while some people thing that the antagonists were a bit cliché, it seemed purposeful in order to juxtapose the differing facet of identity and culture with that of the flight attendant.Bravo to JGL, this movie hung on his performance. And for pulling off the risky style of movie-making, I give it a 9."}, {"id": 187, "text": "I almost hate to slam 7500, because there are some very commendable aspects. It may surprise you to find that in a review carrying a 7.0 rating, I plan to slam the movie, but that's where I'm headed. I hate what it seems to advocate. I like many things about how it was put together.Joseph Gordon-Levitt is very convincing throughout. I have nothing but good to say about his work here. Also, if you enjoyed Locke, with the technical challenge of staging an entire movie in a vehicle moving down the highway, you're likely to enjoy the accomplishment here, of staging almost an entire movie in the cockpit of an airliner. It's very convincing and well done. (I do recall one odd exception. They continually refer to a runway at 2-7-R. In every conversation I ever had from a cockpit, runways were rendered using international alphabet, which would make this one 2-7-Romeo. Have things change?)Other than JGL and the handling of the cockpit setting, I don't have much good to say about it. It's certainly not about doing the smart things once you have attackers get busy on your airplane. It might be a very effective presentation on why no one in the cockpit should ever have been disarmed on any aircraft.I saw a lot of grumbling and 1-star reviews, and I think that a lot of it came from folks not realizing why they felt so cheated at the end. Some acknowledge the technical correctness of a lot of the cabin business. Some found it good for roughly the first hour, but then found it annoying or silly or depressing or several other things, but I think they missed the most important reason for all of that. I'll get to that.I rated the movie based on how well it's made, not on my opinion of what it tries to do. If you like its message, you'll experience it as a good movie. If you think the message is naive and risky at best, and perhaps downright irresponsible and deadly, as I do, then you will not agree with the rest of what I have to say.To start with, you can't fault a movie because it's characters don't make what you think are the right choices in rough circumstances on the fly. So, I groan at some of the actions taken, but they are believable and even likely. Sometimes you make a movie about bad choices to make people think hard about what the good choices would be. That's legitimate. That's not this movie, although it certainly can serve that purpose, even if unintentionally.My strongest complaint is that they are trying to get me to be sympathetic towards a young man who, in my scheme of things, has thrown himself far past any possibility of deserving more than proforma sympathy. I'm sorry, a bit, that he got himself into the situation, as I would be sorry for any young person who didn't have the judgment to do smarter things. He chose to do deadly, awful things, so my sympathy is limited to that formal regret, and not one drop more. Let's review briefly what we see him do.He's not really much more than a kid, but we would call him a young man, I think. We see him acquire the materials for deadly weapons. (It's quite clever, and one of the best points of the film, and it should serve as a warning to airlines.) We see him participate in rushing the cabin. He stands by while his accomplices in the main cabin brutally murder more than one person on the plane. He later enters the cabin with his own deadly weapons.We do see him a bit distressed by the murders. After he sees the plan falling apart, after being upset by watching murdered persons die, he finally seems to regret that he took part in the whole thing, especially that part about him having to die as part of the plan. He calls mom - no joke - and cries that he just wants it all to end and he wants to come home. Mind you, he calls while holding the surviving pilot hostage in the cabin of the airliner he helped to hijack and for which he helped supply the weapons used to commit the murders. Somehow, even with all that, we are supposed to have some sort of sympathy for the guy and hope that maybe he lives to surrender.I make no apology for preferring a very different outcome.When the attacker who first made it into the cabin was subdued - only after fatally stabbing the captain multiple times - he should not have been simply restrained and left to regain consciousness. He should have been dealt a final and fatal blow to ensure that he could not possibly be any further threat. As I said, that's a different movie, and they weren't wrong in any sense to write that their character did something else.This is, however, my review, and I will use the point - not killing the lead attacker, even after he brutally stabs the pilot - to underline that sparing him leaves the remaining pilot at risk again, and leaves him at the mercy of the young man when he eventually gains entry into the cockpit. What should have happened was that the surviving pilot (JGL), after killing the lead attacker (my version of the story), as he allowed the young man to enter, he should have positioned himself at the ready to use the same fire extinguisher to bash that skull and eliminate that threat.It is movie illogic to leave that primary attacker alive, period, and then worse to leave the young one alive as well. However, both had to be done, since this story needs the primary attacker to stick around and terrify the young one by working hard to carry out the plan to crash. It also had to be done in order to have the young one stick around and show us, after everything he had done or helped to do, that he was, I guess, not really a bad person.Apparently, we are supposed to accept that he is very agitated and afraid now, and so we should care about his life now. (JGL, by the way, does a genuinely nice job of being the character who would try to warn the young man as the police gather outside the plane and the young man holds a blade to JGL's throat. I hate that they want us to care in that way, but I have only respect for JGL and his approach through the film. Here, his attempt to calm his attacker, to keep from provoking him, but also to prevent him from making a threatening gesture sure to be seen by the police - JGL's attempt to juggle all that is a lovely piece of work.)I think it's a terrible message (oh, he feels so bad now, we should hope he survives) and very likely to be far more deadly in the real world what we saw in the movie, where several folks die.If you think the message is just fine, you'll surely enjoy the movie. If you think it's dangerous at the very least, then, like me, you may cheer when finally, at long last, someone outside the aircraft, trained and ready, does what I think was the right and necessary thing and eliminates the young man's ability to harm anyone ever again. I was so frustrated by the time we got there, that I really did, I admit, cheer that the right thing finally got done."}, {"id": 188, "text": "I liked the movie since I like all movies related to aviation or space. In fact loved the nice opening 15 minute sequence that focussed just on crew ops.Very realistic action.Just ending was a bit abrupt. But if you really think, what can you really expect at the end of a botched up hijacking. Goods guys go home and rest. Bad boys gomto jail"}, {"id": 189, "text": "What did I miss? What happened to the hijacker that killed the passenger and flight attendant? I'm not going to watch it again to see if I missed something, too intense. He was banging on the door until the plane landed and then he stopped...well someone was banging."}, {"id": 190, "text": "Overall, the movie was great considering it took place in a small, confined area. I honestly don't know what people really expected from a hijacking movie. There were a few scenes that were predictable though."}, {"id": 191, "text": "First you cannot, in any way, guess, what's going to happen next after every scene. The entire movie till the end keeps you on the edge. Best thriller I've seen in last few months."}, {"id": 192, "text": "This well done thriller has you on the seat of your pants. The trailer does it no justice - i thought it was going to be another gory airplane movie. Boy was I wrong! You can't tear your eyes away and it's just enough subtitles to make you look everywhere!"}, {"id": 193, "text": "7500 2020 15 Director: Patrick Vollrath Starring:joseph Gordan Levitt, Omid Memar, Aylin Tezel, Carlo Kitzlinger etcOverall rating 68/1007500 is about a normal plain flight that unexpectedly gets hijacked by terrorists and it's down to Tobias Ellis (Joseph Gordon Levitt) to prevent this from happening and save everyone on the planes lives. I had a good time with 7500, it was definitely flawed and simple in some ways, but it had some very unique and interesting elements, so let's talk about it.First of all the cinematography and use of sound was great, with the film also having a unique perspective for the main character. The film's simplicity with it's cinematography actually worked really well for this type of movie, the use of camera footage for the people on the plain and within the airport was really interesting and set the mood and tone well for the movie. The film also had a very unique perspective for the main character which was really interesting, Almost the entire movie was sit in the cockpit of the plane, this was really interesting as it felt very claustrophobic and uncomfortable to watch knowing that the main character is trapped inside one tiny room, so this really made the audience connect with the main character and see the movie through his eyes. The use of sound was also great, the consistent banging on the door and use of shouting in the other rooms on the plane did a really good job at making you on edge, not knowing what was going on outside the cockpit or if the Hijackers will get through the door was cleverly done and always made you on edge, the film itself because of this managed to achieve a really good uncomfortable tone, and as the stakes were raised and the noise got louder the slow building of tension was executed very well.However, my first two negatives would be the slow pacing at the beginning and the odd creative decisions with the villains. The beginning of the film was fairly slow and until the twist of the Hijacking can be considered fairly boring, it was a lot of sitting around and just talking, which for me effected the consistency of the pacing and the narrative leading into the inciting incident. I also found that the film had an odd creative decision with the villains, they revealed who the main villains were before they were even on the plane, which I personally found slightly odd and I would of set that up differently within the script to make it more shocking to the audience when the twist happened.My next few positives would be the character background, likeable main character, and the main performance from Joseph Gordan Levitt. I thought the character background for Tobias, was good and made the audience understand his character more and raise the stakes. When you learned about his family he has the relationship with the mother of the child, it made you want the character to make it to the end, they did a good job with making you feel something for the character and even with the dialogue with Vedat (Omid Memar) made you understand the characters a lot more and what their lives were like outside of the plane. The main character of Tobias was also very likeable, he had a charm to him that made you take a shine to him when he was on screen, he was also clever and made good decisions that protected everyone on board the plane which made you respect him as a person as well. The main performance from Joseph Gordon Levitt was also great. His performance felt very natural and organic considering the situation his character was put in, you believed every emotion, and the slow decline of his mental health throughout was very believable.My final two negatives that lost the film a fair few marks for me, would be the film's lack of depth to the plot or characters, and the inconsistent and unclear character intentions. The film despite having interesting and unique components creatively was very simple and lacked any form of depth to it's plot or the characters, this was due to the actual lack of characters and to much focus on getting the visual and technical creativity down instead of balancing it out with a strong narrative and script. Finally there was some very inconsistent and unclear character intentions with the character of Vedat. He must of switched between playing an antagonist and protagonist at least 10 times. One minute he was helping and negotiating with Tobias, and the next he is trying to kill him. This irritated me as I really didn't know what to think about that particular character.My final two positives would be the unexpected plot twist and the villains linking to today's issues. The film spent such a long time going through the procedures of the how to run the plane and focusing on the main character, that when the terrorist Hijacking started to happen it took me by surprise, so despite the characters not being a shock the actual event was executed well, the Villains were also good in terms of the links to issues in today's society. They seemed to be a part of a terrorist group, and the dialogue that they mentioned about Muslims an people of colour being killed and mistreated almost made you understand why they were doing what they were doing despite it obviously being wrong, but due to the current political climate this was a nice touch to the movie.Overall, 7500 is a good enough time and an easy watch. With a great lead performance and unique visual creativity. But sadly, it's visual and technical creativity weren't enough to distract from the film's simple plot and characters and lack of balance between a good plot and script and good visuals."}, {"id": 194, "text": "Yes, it might be an accurate depiction of what happens during a plane hijack but, this was just awful! What did the hijackers wanted? I just watched it because of Joseph Gordon Levit as he mostly does some good movies. This was plain awful!!"}, {"id": 195, "text": "This movie is very good.Please Hollywood/American do not make a remake of this. I prefure a Korea remake.Sorry."}, {"id": 196, "text": "Within the limited space and time, they really pulled off thrilling scenes. Also, a good warning to those countries which have accepted Muslim"}, {"id": 197, "text": "I wanted to like this movie. I tried. But it was horrible. Not to mention, it was completely unrealistic."}, {"id": 198, "text": "This is a movie for you if you like fantastic acting from 2 or 3 main characters, but no ending (it just stops), a sub plot in German (at least I hope it was a sub plot, I dunno because it was in German!), no translation (the subs are of the languages used by characters - Turkish, and did I already say German?), hijackers that are thugs without a plan, and apart from the main character, pretty much everyone else important to the plot dies. That's 3 hrs of my life that I'm not going to get back (ok it's not 3 hrs, but it felt like it because half the movie was in German without translation). Needless to say I didn't like it and I would have not watched it if I'd known this beforehand."}, {"id": 199, "text": "Joseph Gordon-Lewitt fighting pkk kurdish terrorists in a plane. There was no point making this movie, badly directed and written."}, {"id": 200, "text": "The best part during the movie are the insights of the cockpit cabin.The story and acting was lower average.I would not recommend the movie."}, {"id": 201, "text": "Few weeks ago I watched the movie Looper with Joseph Gordon-Levitt. Today I watched 7500. It is like day and night. Why Joseph Gordon-Levitt agreed to do this movie, no one knows. I am baffled that he agreed to do this movie. This isn't even a movie, looks more like a documentary. A very bad, boring and a cheap documentary. How can someone go from doing Looper to this? It seems their budget was 10USD. I am not joking. The movie was very boring. No thrill. No fun. No drama. I love the movies that Joseph Gordon-Levitt do. I am a huge fan. I wish this one didn't exist. I am angry that I wasted 1h and 30min on this. I am just shocked that Joseph Gordon-Levitt can go from doing movies similar to Looper and then do movies like this. OK, sorry for the rant here. I do not recommend anyone to watch this.Don¨t waste your time. Watch the trailer and that would be like watching the movie. Watch the trailer instead of wasting your time watching the movie. The end!"}, {"id": 202, "text": "I give you three words ;Plane,muslim and Hijacking... Now you fill the 90 minutes with every cliche regarding these 3 words and you have your movie!Waste of time,no story,no background story,no cause&amp;effect,no explanation...Completely dull"}, {"id": 203, "text": "Everything is drawn out at the start like its a dramatization of a real event, mundane boring, and then its hijack and then there's not much more because the main character is stupid for the sake of the plot. Like a horror flick where they let a monster live and run away so it can catch them again the captain doesn't just stomp the threat when he has the chance. He doesn't rock the plane around to disrupt, just straight and level to make things easy for his threats, and it only ends because one flips on the others, not much of a story, just a few sequences of violence and stupidity."}, {"id": 204, "text": "I see what they were going for. It was an interesting concept and semi-engaging, but it could've been a 20 min. short film."}, {"id": 205, "text": "Being in the aviation business, this is one of the best dramas I've seen. Probably thanks to the European makers. Not the usual unrealistic Hollywood drivel. On the edge of your seat movie."}, {"id": 206, "text": "Overly long, drawn out scenes, the lack of a musical score is replaced with the underlying background noise of the terrorIt's pounding on the cockpit door for at least half the running length of the film which became maddening and thus distracting from the very little interesting story unfolding on the screen. Watched it because I like JGL and think he's a great actor but feel this film didn't deserve or utilize him."}, {"id": 207, "text": "Movies like these are exactly why I've lost all faith in new releases. Movie direction seems to have hit its peak in the early 2000's and has been going down a very steep slope ever since. This movie could have easily been written by a 6-year-old monkey. There was no clever turn of events and everything was just too predictable (and bland!) We've all seen a few good airplane thrillers (Red Eye, Flight Plan, etc.) and despite being the latest one, 7500 somehow ended up being the most uninspired. Poor Joseph, the brilliant actor he is, was probably trying to catch another big break and took the first thing that came his way."}, {"id": 208, "text": "Such a waste of time . It looks like the producers went out on a limb to save money . They avoided to show any significant scenes . Don't be fooled like me by the 6.3 ratings."}, {"id": 209, "text": "Threatened to have potential early on, but seriously let down by unrealistic and implausible character decisions. A few scenes were compelling, with some understated and atypical scenarios giving it a sense of realism. Nonetheless, we're still left with the feeling that the film could have been so much more."}, {"id": 210, "text": "A lot of low review scores on this that I don't get. I'm a very picky person and I found this film to be excellent. I couldn't look away during its 90 minute runtime which was PERFECT for this type of film.The entire movie is set in the cockpit of a commercial airliner during a hijacking and despite that the performances and writing manage to grip you exceptionally well. You really feel like you are right there with these characters in real time experiencing a harrowing event.If you have Prime there is no reason to skip this film. Give it a watch. You won't be disappointed."}, {"id": 211, "text": "This Movie is a snooze fest. I expected lot from this filim and Oh Boy Disappointed is an understatement. The script is so weak and there is nothing in it. Same old story from Hollywood.They should have made this Subject as a 30 mins Short film Rather than a 90 mins movie."}, {"id": 212, "text": "I've ever seen in a movie...Only 45 minutes into the movie....I was rooting for the terrorist..."}, {"id": 213, "text": "Very boring and unrealistic movie. placed it on my watchlist because of joseph levitt, but we shut it down after 20minutes, it just wasnt worth watching."}, {"id": 214, "text": "Good beginning that's it post 9/11 unrealistic scenarios especially after they kill the pilot baby mama"}, {"id": 215, "text": "This film really has no purpose other than wasting a little over an hour of the viewer's life."}, {"id": 216, "text": "Lowe budget low thrill film. What a waste of a watch"}, {"id": 217, "text": "First - I thought that this was a flight from USA to Berlin. Then when i learned it was from Berlin to Paris i was even more SHOCKED because ITS NOT EVEN THAT FAR and you mean to tell me that soo many hours went pass. Second - I'm a bit mad because HIS FIRST PRIORITY AS A PILOT IS TO LAND THE AIRPLANE. He could have just turned off the camera at the back and not look at it every 5 minutes. That does not help him at all. If he opened the door HE WOULD HAVE DIED which results in A CRASHED PLANE. Therefore he should just detach and land the plane! Third- How the fudge can people be so stupid? All the banging and all the shouting- incoherent shouting all the time at the end. Fourth - HE HAD SO MANY CHANCES TO WOUND HIM! Even that scene where he was peeing! He could have stabbed him so many times.If you are looking for a small dose of anxiety and a huge dose of screaming/talking at your screen then give it a try :)"}, {"id": 218, "text": "Such a horrible film with a poor extremely cliche storyline that was unrealistic. A waste of 1:32:00minutes!!!!"}, {"id": 219, "text": "I'm no expert movie critic, but that movie was a waste of my time. Terrible, predictable, and too long for what happened."}, {"id": 220, "text": "Never watched such an unsubstantiated movie. You couldn't even call the communication between the protagonists a dialogue. The banging against the cockpit door half of the movie was annoying and didn't even make sense for the Hostage makers. Seemed like non of the protagonists had courage or at least some intelligence to cope with the situation. The pilot was such a wimp and so was the hostage taker baby. it was so heard to keep watching the whole movie."}, {"id": 221, "text": "There are literally hundreds of airports between Berlin and Paris. The plane could be down on the ground on minutes. And just kill the hijacker in the cockpit. I hated every frustrating unrealistic moment."}, {"id": 222, "text": "All this movie consisted of was yelling and banging on the cockpit door. I turned it off with about 15 minutes left. I thought it was unentertaining and predictable. Don't bother watching this. 👎👎"}, {"id": 223, "text": "The worst movie I have ever seen! Don't waste your time , what a disappointment!!"}, {"id": 224, "text": "I do not feel this movie did anything it shouldn't have. The character development was on point for what it was meant to do and that is show you the raw hollowness about a senseless act beyond most peoples comprehension. Many feel like they are owed something outside what we are shown, like how this ends but the fact is it shows us nothing really ends, we are just shown a story about how it begins. If this movie continued and we looked into the deeper aspects of what happened beyond it would have taken away so much more then it gave and that is the thought of what if I was there. I cannot stop thinking about it so this movie may not be for everyone but 100% did its job and is hands down one of the most effective films I have watched in many years"}, {"id": 225, "text": "If you like this kind of movie It's pretty good but not great I would say it's just OK 95% of the movie is shot in the cockpit. The whole plot of the movie is just not very exciting they could've done a way better job. I gave at six stars out of 10 because I really like this kind of movie but not this particular one as much."}, {"id": 226, "text": "As the title says, I was totally immersed into the movie, you truly feel part of the airplane passengers at a certain point, I was totally shocked, amazed, worried, angry and a lot of more feelings all of them at the same time, this movie is excellent, the atmosphere is totally impressive, I consider thia movie as a hidden gem, plus makes you think about how this problem of war affects both socities. Pretty deep."}, {"id": 227, "text": "Mr Levitt is like always fantastic so is the rest of cast . Mr Memar really does a great job portraying a complex character. Director Wollrath really shows us that he is a name to remember . Looking forward to see his next project . The story is very simple but really puts us in the nightmare of a hijacking situation."}, {"id": 228, "text": "I have watched this movie after reading the pretty good reviews. Overall I expected something better. First, the movie itself is pretty predictable and lack of real tension. Second, acting looks a bit amateurish except from Joseph that does a great job. Last, the second half of the movie was extremely slow and boring. First half was great. That's why I have mixed feelings. So, overall, a wasted opportunity."}, {"id": 229, "text": "I found out 7500 is the standard code for a pilot to alert authorities that a hijacking is in progress. My son probably already knew this, he is a commercial pilot.My wife and I watched this via Amazon streaming through our Roku. It is a curious project because essentially all the action takes place inside the cockpit, first as the pilot and copilot begin the flight very routinely, then the chaos when the hijackers gain access to the cockpit. Not everyone survives.Although this is a fictional story great care was taken to research actual hijackings over the decades, as such it comes off very realistically. Very tense most of the time, it isn't entertaining but more eye-opening.(Not to be confused with the 2014 horror movie Flight 7500.)"}, {"id": 230, "text": "As a former captain of an airlines...I have never seen a dramatic and more realistic movie representing this genre. Not ever! I applaud every aspect of the film and every actor and technician involved in its production. Moreover, it's the most realistic and singular adaptation of a script I have ever seen. Sine qua non. PS To see this movie will verify all of the above and provide other details I am not willing to share. You just have to see this graphic and true to life film for yourself."}, {"id": 231, "text": "The movie seemed realistic about what's usually done if a hijacking attack occurred in midair. Decent thriller"}, {"id": 232, "text": "This movie was damn realistic. I have no ideas about the fact of flying a plane however it seemed exactly low how a similar situation in real life would have panned out. The movie was all the more interesting given the fact that the entire movie is shot completely inside the cockpit. The camera does not exit the space until the very end.Surprised by the low reviews because this is a no nonsense thriller and Joseph Gordon's performance as a pilot is brilliant."}, {"id": 233, "text": "It is a good movie, but you know what's gonna happen. It's the kind of situation that has two endings and takes the obvious one."}, {"id": 234, "text": "7500 was a solid directorial debut and good return to acting from Joseph Gordon Lewitt,he did a good job here and he showed that even after some years of vacation he still has that magic touch in him,direction and story progress were also solid but nothing spectacular,mostly because cause we saw the same theme being shown in a better film,the most famous one being United 93 but still this was a film that can be watched and that in end you dont hate yourself for spending your time on it,other actors were solid and they sold some good tension and drama moments,7500 was a solid film,nothing special or awesome but it can be watched if you are interested in subject"}, {"id": 235, "text": "As a lifelong member of the aviation sector this is the best and most accurate movie I've seen, so much better than the fake Hollywood efforts to date. It has an excellent cast and is compelling to watch, thoroughly recommended!"}, {"id": 236, "text": "I ignored the low rating because ... It's THE squawk. Refreshing to see that there was no false bravado no Hollywood BS. I reckon this movie won't do well in the box office precisely because of this.However, people who know, will give this a 9 or 10. This is THE most realistic hostage taking I have ever seen. Just superb acting."}, {"id": 237, "text": "The film started out good, with realistic interactions between the pilots and crews. The film started to get interesting when the hijacking started, but then just became hard to watch. The film just makes you watch innocent people get butchered, and there is nothing to redeem the film later on. You just watch Joseph Gordon-Levitt make dumb decisions and have unreasonable sympathy for a hijacker just because he was naive and has a mother. Total waste of time and a film that accomplishes nothing and has no message."}, {"id": 238, "text": "..movie for what it is, stunning and gripping performance, highly realistic in all the details..But I feel like it's a missed opportunity to show the audience how to deal with the aftermath of such traumatic events. The ending is too abrupt and we leave the pilot as the hero of the story but that's not realistic, show us how he breaks down when it's over, show us how he's impacted and how his life will never be the same again.. A teachable moment about ptsd ..missed."}, {"id": 239, "text": "It's weird to think how much Joseph Gordon-Levitt's career was rising after 500 Days, Inception, and TDKR, only to almost disappear from Hollywood films following 2015's Snowden for 3 years. Aside from starting his own family and running hitrecordjoe, we didn't know much about his whereabouts those few years. Luckily, 7500 sees the return of JGL, and in excellent fashion. He stars in a harrowing tale about a pilot attempting to save the lives of his passengers amidst a terrorist attack. Well rounded, deep, at times very heavy, and brilliant direction make way for one of the best thrillers of the year. Let's hope this is the start of a new phase to JGL's promising career.7.6/10"}, {"id": 240, "text": "This movie shows you what can be done with a good script, decent actors, and NOT a big budget.. It moves along well, with the bulk of the story being carried on one pilot and a young terrorist. I enjoyed it for the quality and craft they put into it, and yes, it could have been more exciting, with a bunch CGI, over the top dialogue action.. This concise drama held it's own."}, {"id": 241, "text": "I thought it was great, really well done. As a pilot wife, I was on edge the whole time. My husband usually can't help but nitpick every movie scene with an airplane, but he was pleasantly surprised by how accurate the movie was (most of the time). It was a combination of This is what would really happen plus But we gotta make it dramatic and interesting to keep you interested for an hour and a half. I thought it was pretty good in both respects!"}, {"id": 242, "text": "Your classic should have killed the bad guys when he had numerous chances and the situation wouldn't have gotten as bad. The American co pilot really ticked me off and was a coward in this movie even considering what happened to his girlfriend/wife. Why tell the passengers your landing in 20min to let the hijackers know it's time to start killing hostages baffled me. The acting was actually pretty good and for being filmed in the cockpit the whole time kept me somewhat entertained but upset at the same time. Was a little long and slow paced. If you watch this movie be prepared to hate the American co pilot. Trust me us Americans aren't cowardly like that. That definitely isn't the way it would go down."}, {"id": 243, "text": "Average movie, mostly directed by one actor, which I also do not like that the action of the movie revolves around an actor defending himself from a group of terrorists, and at the end of the movie it turns out that they are overpowered by passengers, who in general we did not even see them in the movie."}, {"id": 244, "text": "This is a fantastic film. The realism is beyond many other hijack-themed films. The writers traded the traditional Hollywood over-the-top action sequences and heroics to bring alive the raw, gritty, conflict and tension without trying to appeal to a 'feel-good' resolution to these tensions. By filming more or less the entire movie from the perspective of the cockpit, the audience gets a window into the claustrophobic pressure of life and death decisions as well as the difficult commitment to duty and protocols that a pilot in such a circumstance can face.The performances by Gordon-Levitt and Memar were gripping.It's an underrated film but I highly recommend it."}, {"id": 245, "text": "I really enjoyed this movie. As an AV geek I appreciate the attention to detail of the realism of the aviation portion of the film. While I noticed one or two minor things that are off (and one big detail) the majority of aviation related material is spot on. I always notice when aviation things are askew in movies so once again I appreciate the attention to detail of the aircraft.The story was good, a little predictable, but overall a good movie, good story line and I enjoyed the camerawork. It really added to the thrill of the movie, and for me it definitely was a thriller and I would highly recommend it. I would probably watch this again as well, which is something I don't usually do."}, {"id": 246, "text": "I really enjoyed the first half of this movie. I felt like I was in the cockpit with the pilots; the film does a great job of making you feel immersed. Joseph Gordon Levitt is great. The action really grips you, and I felt all the emotional beats. With all that said, the second half is not nearly as powerful and drags quite a bit. Even though the film is fairly short, you feel every single second as you're waiting for something to happen. Overall, I definitely enjoyed myself, but I don't think it has too much too far besides gut-wrenching action. I enojyed, however, so I give it a thumbs-up."}, {"id": 247, "text": "The movie plays in real time without any cut scenes. 2 pilots and the cabin-crew enter the airplane , followed by the passengers. after the final boarding procedure and all checklists are done the plane rolls out to the runaway. the viewer gets the realistic impression of sitting right inside the cockpit of the airbus, watching the pilots doing their job. this is, what makes this movie so special and stunning. also the great playing of Joseph Gordon Levit as the pilot. 7500 shows the stupidty and sadness of violence and murdering people. it shows the consequences for the victims and also for the hijacker. there is nothing cool about it. absolutely not."}, {"id": 248, "text": "Kept me on the edge of my seat. Drama in the tiny space of a cockpit, with one of my favorite actors: Joseph Gordon-Levitt. Left me relieved but sad for the characters. The other actors where good too and believable . Spanned."}, {"id": 249, "text": "I didn't have a lot of expectations going in but this movie was a nail biter. Kept my interest from beginning to end. I highly recommend it!"}, {"id": 250, "text": "Everything about the movie nails all the details. It's accurately written, what's it like to be a pilot in the face of terrorism. An action thriller movie within a cockpit. I was at the edge of my seat throughout the movie. The protocols of a pilot, and how naturally they react in the face of adversities are well portrayed."}, {"id": 251, "text": "Pleasantly surprised. I saw some trailers, and actually forgot about this movie. Only to run into a trailer of it again, a couple of days ago. So I gave it a go. Many reviewers describe it as 'gritty', and I agree. Don't expect a Disney happy movie. Neither is it depressing. The lack of any music, makes it almost a documentary, sort of 'what if ...'. You get into the main characters pretty quick. The whole atmosphere in the cockpit, where the complete movie plays, is eerie accurate. The sounds, the cockpit, the procedures of the pilots. It matches. The sound of the non-stop banging on the door gave me the goosebumps. I think this movie give a good representation of what could happen, fortunately without all the Hollywood bombastic. Even the bad guys, though little stereotype, feel real enough. We all want bad guys to be bad, really bad. But deep inside, we always want that there is a little bit of goodness in them. At least I do, else they would just be animals, and the truth never is that black and white. Yeah, recommended, and leaves you with some things to think about."}, {"id": 252, "text": "I was gripped, I was sweaty at the end as I was feeling nervous about the outcome, the hostage deaths seemed so bloody curdingly realistic."}, {"id": 253, "text": "The inexplicable number of one and two star reviews is becoming all too commonplace on review sites. These reviews are intended to purposly distort a fair rating. There is no way this movie deserves its current low 6.1 rating. I would give it an honest 7.5, but I'm rounding up because of the moron factor, which is unusually high among those giving this decent-=to-good movie an ultra-low rating.."}, {"id": 254, "text": "Ending as expected. However, to me, the lack of weaponry by hijackers doesn't square with how much they were able to accomplish. Second, with window open the snipers should have popped last hijacker sooner. All in all, good flick."}, {"id": 255, "text": "It's a simple plot, but a gripping film. Decent watch. Didn't blow my mind, but thoroughly enjoyed. An overall good film."}, {"id": 256, "text": "The movie is only story of high jacking a plane and we can this drama only at pilot's cockpit till the end. and nothing. Start at there and ends there. Wow studio no needs for outdoor shooting even any other set. This makes movie boring. However acting by Josef Gordon Levitt is good. Another plus point is that you can definitely will be familiar with pilots conditions and various parts of his cabins. Also you can learn about how to contact a pilot to ground and vice versa. You can watch this movie only for this point as there is no thrill or suspense round the 1.30 hours."}, {"id": 257, "text": "So slow, boring, and pointless. Bad beginning, middle and end."}, {"id": 258, "text": "I do that JGL did an okay job acting in this thriller, there was absolutely nothing new with this movie. It was your typical Airplane hijacking film. Nothing is different or too special with the story. Not too attached to the characters and very little back story. I was looking forward to this movie when I saw the preview but now I'm disappointed. Same ole same, skip it unless you like predictably."}, {"id": 259, "text": "I felt like JGL was over-acting. Maybe that's the Director's fault....who knows?! I got bored watching it. Only the cockpit are the filming location of the movie. But it does not look well directed. They keep using the same angle of the cockpit. I was falling asleep watching this movie, the plot is bad and you literally don't give any interest about the movie after the first 30 minutes because they essentially kill off the only character you are rooting for. Do yourself a favor and DON'T WATCH this waste of time."}, {"id": 260, "text": "Seriously one the most stupid boring moveis i have watched recently WARNING stay away from this movie."}, {"id": 261, "text": "One of the worst movies i have watched in the past years"}, {"id": 262, "text": "This movie seems to be very old like a 2011 movie, and makes no sense. and the movie is very long, they could make it 30 mins instead of 1 hour 30 mins. the movie said that the moral of it is An eye for an eye leaves the whole world blind well this has do nothing with the movie."}, {"id": 263, "text": "HAM on rye, with a side of gam and a ham milk shake.Unquestionanly in my bottom 5 of the year. Lots of whining, screeching, horrible overacting. Someone should have told the actors that screaming a line 5 times in a row does little for us poor beleaguered viewers. 6.3? You have to be kidding! My guess is, the German speaking fans kicked in the bulk of the ratings over 3 or 4.Sadly no drama, as every single plot development is exactly what you would guess. Not a single surprise."}, {"id": 264, "text": "I was not able to finish it and left it in middle. There are many scene which will not make sense such as the plot itself how the can couple of guys take control or entire plan with just glass pieces. Clearly this movie is not for me someone who needs logical explanation."}, {"id": 265, "text": "For the people who gave this very low scores I can only think they prefer lots of cgi and back stories to make a film. This does not have that, it's simple and goes through a normal flight boarding where it reminds you of all the times you got on a plane the same. Then it all goes wrong. I know when it's a good film when I'm shouting at the screen (in a good way) don't let them in and at the end I was shouting open the door Great film."}, {"id": 266, "text": "This is a well made movie that keeps you engaged and anxious until the end. The movie throughout has real background sounds and noise, making it realistic."}, {"id": 267, "text": "7500 is about a plane hijacking from the point of view of pilot Tobias Ellis and without the action ever leaving the cock pit. Once the plane takes off the movie barely lets up until the plane touches the ground.Shortly after takeoff our pilots are ambushed in the cockpit with terrorists attempting to seize control of the plane. Tobias is put in the impossible position of trying to fend off the men while also flying the plane to save his passengers.This is Joseph Gordon-Levitt's first film in four years and it's great to see him in a new movie. He said for his first movie back he wanted something to challenge him and I could see why this is a challenging role. I also feel in his mini comeback he wouldn't have done just any movie. So I think he obviously saw something here that he wanted to get on board with. He gave a great performance.Getting a little bit into spoiler territory, I will say my only gripe was that once the plane landed in Hannover and the rest played out like a hostage negotiation, it dragged a little bit from that point. Just wasn't as thrilling as when the plane was still in the air. Felt like one of those moments when you think a movie is almost over but there's still a lot more left."}, {"id": 268, "text": "Patrick Vollrath's feature film debut does not have anything substantial and/or insightful to say but '7500' has some edge-of-the-seat moments and a nicely understated performance from Joseph Gordon-Levitt to keep its audience engaged."}, {"id": 269, "text": "I enjoyed this movie quite a bit. JGL is one hell of an actor and I loved the whole movie being in the cockpit. The only issue I had was the 18 year old terrorist. I know all about fight or flight but I'd like to believe in the same situation I'd take one look at this scrawny, whiny runt and beat his a$$ repeatedly. He was crying and wasn't intimidating at all. Every time he screamed commands I wanted to punch him. I couldn't understand why JGL's character had any sympathy for the kid and I don't think many would in the same situation.Overall this is a quick, enjoyable watch. Enjoy."}, {"id": 270, "text": "The movie sets the mood perfectly right from the beginning. Joseph Gordon-Levitt held the movie together till the end. The experience of understanding the situation from a single perspective is impressive. Though the movie had lot of loose ends which is the main area where it fails to stand. But over all a movie worth watching just for the sake of easy entertainment."}, {"id": 271, "text": "7500 isn't original nor is it easy to watch but, Jospeh Gordon-Levitt and co-star Omid Memar make this terror trip worth your time. . In this thriller, a flight from Berlin to Paris is hijacked by terrorists. . Film studios haven't touched on this subject many years and frankly, it's still hard to watch a film about terrorists hijacking a plane. 7500 (which is the aviation code for a hijacking) never does anything to wow the viewers but, director Patrick Vollrath does manage to keep you pinned to your seat. I would've loved a new take on the whole hijacking a plane scenario but really how many alternative storylines can you make? Not many. Gordon-Levitt seriously soars in his performance, and he's what kept me wanting to watch - he takes control of the film. A surprise to me was his co-star, Omid Memar as the conflicted terrorist. Memar manages to infuriate you but also gives you a sense of sympathy. It's a decent film but, ultimately offers nothing new to a genre that has been kept under wraps for some time now. . Follow @snobmedia for all reviews!"}, {"id": 272, "text": "A very slow movie and abrupt ending. Don't waste your time."}, {"id": 273, "text": "No story.......why was the plane being hijacked? Where did the hijackers want to go? And why? Only a fictional airline would hire such dumb pilots as were onboard this aircraft. God! And it has got a 6.3 on IMDB and 58 on Metacritic? What is the world coming to?"}, {"id": 274, "text": "Watched it because it has got around 6+ rating in imdb.. Found out it to be a very dull and boring movie.."}, {"id": 275, "text": "Were is the acting? Usually like this kind of movies but no, not worth the time."}, {"id": 276, "text": "Smart and well performed. These two things are not often found in a movie lately. When this type of filming is done properly, such as this one, it leaves you with a sense of amazement looking back to see the amount of creativity that was sculpted with so little material. Well done!"}, {"id": 277, "text": "Another plane hijacking, well planned and carried out. Artful acting by Joseph Gordon-Levittown and Omid Memad."}, {"id": 278, "text": "Spoilers because you're not missing anything - I'm struggling to process what I just watched. This has got to be one of the worst movies I've ever watched, by far since lockdown started in March 2020. There is no motive to the stereotypical evil Muslim (seriously Netflix?) high jackers. The co-captain is a complete idiot (bro, why tf did you open the cabin)... and after the plane lands they sit on the runway for a good 30 minutes with NOTHING happening! The high jacker even took a pee. Honestly, I was praying that they would crash the plane halfway through this movie, it's that bad. I give it 1 star - Do not recommend."}, {"id": 279, "text": "Please respect the audience!! The movie missed the realistic . I never recommend it."}, {"id": 280, "text": "5 stars for the first half of the film, which was absolutely fantastic and had me on the edge of my seat. Also loved the realism of the pilots preparing etc which made it feel all the more realistic. But the last half of the film was very poor and boring. The ending left me highly unsatisfied with no feeling of closure. What a shame."}, {"id": 281, "text": "An old theme reduced to the intimate space of an A319 cockpit. It felt like being there. You will be kept on the edge of your seat for 90 minutes. Solid hijacking thriller. Excellent entertainment."}, {"id": 282, "text": "Phenomenal performance by Joseph Gordon-Levitt in this superb real time film. Fantastic story telling and build up Simply cant understand the mediocre ratings given the really strong positive reviews of so many and the obvious brilliance of the film concept and delivery...."}, {"id": 283, "text": "Very well executed movie which captivates from beginning till end.Not the Rambo or Chuck Norris kind of movie obviously. This maybe explains the negative reviews.The movie is intended for a mature and educated crowd.If this is you, you will really enjoy the movie. The plot, the suspense, the simple yet effective filmography.If you are looking for a Wesley Snipes 'passenger 57, better stay away."}, {"id": 284, "text": "I watched this film and very realistic, good acting, good story. Tobias is very good character. I am a Turkish and I didn't wish to see half Turkish terrorists on any movie... Violence or terrorist attacks not a solution, we can see that in this movie again. Worth watching."}, {"id": 285, "text": "Great idea with excellent cinematography. The movie captures the tension well.However, despite being a short movie at approx. 1 hour and 40 minutes, the movie loses the viewer somewhere. It drags tediously. Nothing much happens and then it ends!Good idea but mediocre film."}, {"id": 286, "text": "Great little small location film.Great natural acting too.Tense and very disturbing at times.But.... Very unsatisfying outcome. You really wanted JGL to do more at the end. Get a bit back!!Then it rolls arrogant silence over the end credits."}, {"id": 287, "text": "Looking for a suspenseful, realistic, airplane hijacker movie-this is right up your alley. JGL's performance Is highly enjoyable &amp; the movie provides a speck of realism in a category that tends to be over exaggerated for audience effect."}, {"id": 288, "text": "Director and screenplay writer Patrick Vollrath does a neat job in reeling viewers into the highly stressed cockpit environment where lunatics have hijacked the plane. The film performs considerably in carrying suspense and thrilling us given the limited confinements of an airplane setting. Actually, if one exhausts any prior ideas about the film, it plays to the rolling credits without disappointment when viewed in absence of expectations. Joseph Gordan-Levitt's role pretty much carries the movie forward as the plot abruptly thickens and his initial calm demeanor we're introduced to is tested. There are definite frustrating moments in the film where we wish our star was more Brad Pitt and less Matt Damon in handling terrorists, nonetheless he is convincing along with Omid Memar, whom both hit their mark respectively, in drawing on our emotions as audience members. The film leaves you feeling appreciative and thinking of your flights and admiring all whom work in the airlines industry. For that, it is worth the butter on your popcorn."}, {"id": 289, "text": "The movie creates a lot of unnecessary drama. In real life, the pilot would simply climb to a suitable altitude and disable the pressurization... If you don't stay in your seat with your oxygen mask on, you pass out."}, {"id": 290, "text": "I liked the style and the feel of this film. The negative reviews are not deserved."}, {"id": 291, "text": "I felt compelled to rate this movie. It was raw, tense and just so brilliantly acted. Well done."}, {"id": 292, "text": "Call me old school....But I was kept on the edge of my seat from the beginning of the hijacking to end of the movie.....Great acting, especially Joe and Omid....Great story line and directing....."}, {"id": 293, "text": "99% set in an airplane cockpit and 30% of the dialog in German. No subtitles, so didn't have a clue what they were saying. That said, it didn't take a scientist to work out what was happening. Quite boring really and that's a shame because this could have been good. Never 10 out of 10 like some people have scored."}, {"id": 294, "text": "The movie just ends and you don't know when 1hr 20 minutes passed!"}, {"id": 295, "text": "The story starts with such strong expetations, but it faceplant from the middle to the end.The movie makes the protagonist and flight attendents stupid just to make the plot go on, or else it would BE A 20 MINUTES MOVIE.Guys, dont waste your time in this, unless you want to see how bad writting looks like.And about those scores of 10 and 9, its so unreal to grade it as a superb movie and such, that there is no other explanation than getting paid to please the studio and deceive people.Its just a BAD movie."}, {"id": 296, "text": "This means career has been nothing short of amazing, but this movie really highlights his acting chops. It's mainly him throughout the movie. And you can feel every heart breaking decision he has to make. Role of a lifetime for him!!!"}, {"id": 297, "text": "After the first 15min of the usual 'get to know the characters' bit, just an intense rollercoaster ride.... very well done movie"}, {"id": 298, "text": "Great movie and well worth a look. Gripping story line greatly executed(pardon the pun) and certainly had me fixated from take off till landing"}, {"id": 299, "text": "Not the best JGL movie. Bad acting on everyone else's part. Just another ' Muslim terrorist' movie with nothing worthy. This movie and its end left me angry and frustrated. Stupid."}, {"id": 300, "text": "This movie is slower and intriguing, but if you put yourself in the captain's shoes, you yearn for the slow moments; Anticipating the next adrenaline rush. 7500 keeps you on the edge of your seat."}, {"id": 301, "text": "Good film, but too smooth in the end. The characters are OK, but you could have gotten a lot more out of them. Still exciting, but the last kick is missing."}, {"id": 302, "text": "Edge of your seat suspense. Keeps U guessing on the outcome."}, {"id": 303, "text": "This is a movie about a plane hijacking. I always watched this unfortunate plane hijacks on the news. But, I never thought about what happens in the cockpit while hijacking. The story was nice. There were different bonds between the characters in the movie. Most of the movie is happening in the plane cockpit. However, the plane windshield view changes in different scenes. I experienced the elements of thriller in this movie. I saw nice acting from Joseph Gordon-Levitt who plays Tobias Ellis character. In my opinion, the ending could be improved and become more exciting. I hope we only see plane hijacking in the movies and it never happens in real life. In summary, I recommend this movie to action and thriller fans."}, {"id": 304, "text": "Great movie! Kudos to the aviation advisors and the director for listening to the advisors. With very rare exception, that's exactly what would happen in the cockpit of a hijacked aircraft. Everything from normal procedures, crew responsibilities, intra-cockpit and external communications, and emergency response was what you would see and hear in any first world airline cockpit. This was eerily familiar to an incident in my airline many years ago; all three pilots (DC-10) severely injured by a suicidal employee with numerous weapons, intent on crashing the aircraft. He was eventually overpowered, and one pilot was able to land the aircraft. None of the three pilots were medically qualified to fly commercial again."}, {"id": 305, "text": "You will not waste your downtime watching this. Well made and acted."}, {"id": 306, "text": "Tried to give 7500 a chance, but it is horrible. Horrible acting, horrible plot."}, {"id": 307, "text": "Worst movie ever. Bad story, bad acting, nothing positive about it. Id rather have hameroids then to see this movie again. Everybody that says otherwise is a sad pretentious liar. Especially the guy that says it is accurate, really a low life. Director should apoligise and delete this movie. What a shame. I have seen spongebob movies with a better story line, and more realistic. Really frustates me, the director can never give us back our time. Shame on everybody involved with this movie. Earning any money with this is unethical."}, {"id": 308, "text": "It was a promissing start but in the end Insufficiently developed film plot and poor acting got me dissapointed.The whole scene of the hijacking was too cliché ... Terrorists as usual Muslims, but the director did not bother to show that scene passionately enough... No reactions from passengers, plane staff... Simply unrealistic, without any tension... Very poor ending"}, {"id": 309, "text": "So this one starts out with a plane getting ready to take off. The flight attendants doing their usual flirting with the pilots. Apparently the co pilot, played by Levitt is involved with one of the flight attendants.So the plane takes off, and shortly into the flight some guys rush the cockpit when one of the flight attendants opens the door. The Captain is stabbed, but Levitt manages to force guy # 2 out of the cockpit and lock it, and grabs a fire extingusher and bashes guy #1 in the head. Captain is still alive but bleeding. 1st officer Levitt levels out the plane and reports the emergency.There's at least one more guy outside trying to break into the cockpit. Levitt secures guy #1 pretty tightly it appears.+1 Star for the cockpit fight and securing.+1 Star for Levitts wife telling him not to open the DOOR. And For Levitt not opening the cockpit door. He did what he had to do.Oh nice, the passengers rush the door. But Guy #1 wakes up and escapes and knocks Levitt out. So Guy #1 lets in Guy #4, but guy #3 gets taken out by the passengers. Now the passengers are trying to break into the cockpit. Once the #1 Guy is back in charge tho he's definitely the #1 guy. He has the prepared speech he reads about how they will crash the plane. But Daniel, Guy #4....he freaks out. He doesn't want to die. So he stabs guy #1 with one of the glass knives they've been using. He kills guy #1 , and frees Levitt. Levitt levels the plane in time to keep it from crashing.And then after the landing and the passengers get out, then it becomes a 1 on 1 with Guy 4 and Levitt. And guy 4 wants a tanker to refuel the plane so it can leave. Of course it ends the only way it can, they shoot guy #4 . The police come in and lead Levitt out past his dead wife.And that's the end. They don't say if Guy4 lives or dies. Pretty Decent flick. Guy 4 of course was just a stupid kid. And the Captain, he was a brave guy, but stupid for letting himself bleed out. Altho I'm not sure he could have been saved anyhow. A lot of ripoff here from United93. But all in all, 7/10"}, {"id": 310, "text": "I really liked this one. At 90mins the journey isn't long but it draws you into the moment with its intensity and simplicity, sure there are some minor frustrations with story evolution but definitely worth the watch."}, {"id": 311, "text": "Superbly done! Very realistic and intense. Great acting from all actors involved."}, {"id": 312, "text": "It is hard to do a low budget film and I salute 7500 for that. Straight forward simple narrative film that kept me watching till the end. Gordon Levitt as always a superb actor. Ho cares about its flaws and authenticity. It is a film and it is fiction."}, {"id": 313, "text": "The movie starts off okay but shortly after hijackers appear, it becomes a really silly movie after the co-pilot, played by Joseph Gordon-Levitt, makes the bone-headed decision to communicate with the passengers (which also includes the hijackers). If this is standard protocol, then I guess, there's nothing like keeping the enemy informed of what's going on!After that reassurance from the co-pilot to the passengers, the movie seemed too ridiculous and contrived. I couldn't suspend my disbelief enough to continue watching a co-pilot with no brains."}, {"id": 314, "text": "Promising start, but becomes boring after the hijacking. Although the scene where the passengers rises against the hijackers are good. Some minor stuff: The distance between Berlin and Hannover is 240km, how is it possible to stretch this flight to 1,5 hours. And 20 mins for theEurofighter to reach the plane in this part europa...realistic?"}, {"id": 315, "text": "I really don't get the negative reviews. This is a tense engrossing film (I didn't have the urge to check my phone once while watching this - always a good sign lol) Joseph Gordon-Levitt and the rest of the cast are very good and capture the emotional and mental anguish perfectly. This a really good film not to be missed."}, {"id": 316, "text": "The movie gets off to a promising start and does built up perfectly but some where along the way slows down . The movie held a promise of much more but never really took off ."}, {"id": 317, "text": "Nothing much interesting. Very Boring.Nothing much interesting. Very Boring.Eoutine flight Hijacking"}, {"id": 318, "text": "Absolutely loved the first 30 minutes of this movie! As an airline pilot myself I felt super nostalgic watching the interaction between the pilots, cabin crew and ground staff, they really nailed that a long with the departure from Berlin and the initial flying!After the hijacking it seemed to drag on and I found myself saying quite a few times that nobody is flying the plane and that I would have landed by now, but hey it's a movie and they need to make it 90 minutes not 30 minutes...So overall, enjoyable, but seemed to drag on and fill time in certain parts!"}, {"id": 319, "text": "The radio calls and all the procedures in the cockpit is right on spot! Everything is hyper realistic and the VFX outside is stunning! I really could not tell it was green screened before i googled it. The performance of the actors... just wow! JGL and Omid Memar really did an outstanding performance. The small fact this movie did not have any music except for the end credits was mind blowing. They did all the suspense using engine sound and airplane ambiences. This alone makes this a movie which very well could be a classic in the future. All i can say is: WOW. I cant wait to see this again!"}, {"id": 320, "text": "Congratulations to the writers. It has to be extremely hard to come up with a unique but credible hijack movie these days.To do it in real time, with no music, yet still keep the pace moving along is a remarkable feat.To those scoring this movie low, please stick to watching Transformers or Avengers.This movie smacks of real life with some Hitchcockian like suspense scenes along the way.The ending did lose a bit of pace - I would have expected a sniper shot as soon as they had the opportunity, and the pilot door being blown off its hinges, but apart from that, this is a great movie."}, {"id": 321, "text": "This could have been good, Joseph did a good with his part. But unless the average viewer speaks 4 languages, then it is unwatchable!I I speak, English, French, Italian, Arabic, Russian and Armenian, BUT NOT Turkish or German! The movie is noisy, whatever is spoken is done under duress which makes it even hard to understand the English parts! So, unless one can find subs for this, or speaks all the languages, then just forget it!"}, {"id": 322, "text": "I enjoyed it. Movie is good. The reason I'm writing this review though... Is the Summary.When terrorists try to seize control of a Berlin-Paris flight, a soft-spoken young American co-pilot struggles to save the lives of the passengers and crew while forging a surprising connection with one of the hijackers..forging a surprising connection with one of the hijackers. Did you get that from the movie? I didn't. He tried to make the connection to try to sway the guy. It wasn't surprising. Whoever in Hollywood wrote that needs to be sacked. I can't believe that was what they went with. One can only suspect they added that to the end for some sort of higher word-count? Because their relationship has very little to do with the overall movie."}, {"id": 323, "text": "The - Terrorists take over the Cockpit - scenario has been overly done and is nothing new or exciting. Making such movie in 2019 and making use of overly used clichés was very underwhelming."}, {"id": 324, "text": "My god, they receive training for situations like this. How the hell can he tell the hijackers oh by the way, we're landing in 20 minutes and give that away. It was a given they would start ....acting on the hostages. There were so many mistakes that anyone with training would have avoided. It was the worst. Not to mention the useless ending."}, {"id": 325, "text": "I didn't realize it was a foreign film so the acting was very skeptical halfway through the movie I was wondering why did I waste my time watching this piece of crap"}, {"id": 326, "text": "Total waste. I can not imagine dumbest pilot like him. Feeling anger after watching this."}, {"id": 327, "text": "The acting was ok but who would believe the captain wouldn't be able to land the plane at a random airstrip in Germany. Instead of over a half hour in the air in reality they could have landed in a few minutes. It's not as if there's a nearby airport only every 30 minutes. How stupid do they think we are!"}, {"id": 328, "text": "Not recommended absolutely the worst time watching it!!!"}, {"id": 329, "text": "Who gave this big note ? the cops from the movie and the passengers ? most idiotic movie"}, {"id": 330, "text": "Common sense. Don't give the bad guys a timer for their idiot plans. 20 minutes to landing over the intercom? 20 minutes of mayhem ensues. Bad guys murder first hostage? Pilot Pete ignores his plight. Murder Pilot's baby mama; exhort passengers into a frenzy to overpower and annihilate bad guys! Pilot Pete, the autobahn has some straight and smooth sections for an emergency landing...maybe show some desperation regarding landing asap."}, {"id": 331, "text": "Why are Muslims always shown bad not every Muslim is a terrorist. Where is people then there is Muslim exist in the western society, I really loved the movie starting but I wish the producers of the movie had a broad mind"}, {"id": 332, "text": "Seems to me they have nothing to talk about in this low-budget movie (other than the obvious bad people, whom must be of specific group as everybody knows). I wasted time watching the cabinet of an airplane. Joseph performed his worst acting ever."}, {"id": 333, "text": "(11/24/20 revision). Ok, I watched this a second time with my dad and found some flaws in the storytelling. However from an entertainment perspective it's still worth seeing. Just watch the first 20 mins and you'll want to finish the movie. Still great acting, but not as realistic as I initially thought."}, {"id": 334, "text": "Really relays the feeling of typical flight crew and cockpit activity during a hijacking. Totally absorbing. Best movie I've seen in months."}, {"id": 335, "text": "This is one of those really, really stupid movies that has any sensible person shouting at the screen. I cannot believe that so many reviewers apparently couldn't see this for the crap that it is.I would agree with many others that it started well but, I guess at about the 25 minute point, it truly lost its way and quickly became quite unbelievable and utterly nonsensical.The problems with it:1 NEVER EVER EVER EVER open the door into the cockpit when there's a hijacking going on. Even more importantly, if you have a hijacker who's already on the flight deck, make very sure that he's put out of action permanently, not just unconscious. If you kill him to stop him regaining consciousness and posing a further threat, there isn't a court in the civilized world that would convict you. So, if you can kill a hijacker, grow some gonads and just do it2 conversations between aircraft and air traffic control are ALWAYS, and I mean ABSOLUTELY ALWAYS, in English. All over the world. Full stop. No question here. There is absolutely no way that ATC would communicate in a language other than English with air grew or with hijackers, especially as in this case where the co-pilot has told ATC that he speaks only English and doesn't understand German. At various times in this movie, ATC was speaking to the co-pilot (Levitt) and also to the wimpy hijacker in German. This would just not happen. ATC and security services would definitely have wanted the co-pilot to know what was happening3 where did all the passengers go?? When the co-pilot announced to the passengers that there were two hijackers that were still a danger and that they were armed only with glass, what the Hell did the 80 odd passengers do? I assume they sat there being wimps and watching movies. Sure, there may have been more than two hijackers at that time, possibly three left but please, don't try telling me that the passengers couldn't have rushed the hijackers and overpowered them. End of hijacking. We never heard a sound of passengers trying to defend themselves as they did on Flight 93 on 9/114 I agree with what others have said that it's inconceivable that a flight from Berlin to Paris could not have landed either back at Berlin or at any number of other airports in Germany very soon after the first sign of the hijacking. Frankfurt would have been no more than 100 km away by that time and then there would have been Potsdam, Magdeburg and Wolfsburg also only a short distance away and I'm sure with airstrips suitable for this aircraft's landing. The fact is that our outstandingly stupid friend the co-pilot could easily have landed the aircraft safely long before the fat terrorist regained consciousness, again ignoring the possibility of putting fat terrorist out of action permanently if the co-pilot had had some guts.I understand that if co-pilot had done any number of things that were clearly necessary, the movie might have run 35 minutes and that all the stupidity really only served to lengthen this dumb movie to 92 minutes, thankfully including end credits.I am reminded here of a TV mini-series called Into The Night which is showing on Netflix. That one also started well but it quickly descended into perhaps even greater improbability. Ultimately, it was even worse than 7500 since it ran for four hours. Even 92 minutes of 7500 was way too much for me.Here's to hoping that airlines not only teach air crew how to fly safely and responsibly but also have something in the selection process requiring air crew to show some courage in a hijack situation and not act like wimps.It's just as well that I only spent the equivalent of $US2 for the DVD of this load of old rubbish. It's a movie that I'll lay down and avoid from now on.JMV"}, {"id": 336, "text": "Was very disappointed from the movie, it was pointless. And as usual they show the muslims as terrorists 👎🏻 ENOUGH !!!!!! When will everybody learn that terrorists are not actually considered muslims because of what they do to innocent people. Muslims do not kill any innocent people regardless what their religion is. WAKE UP GUYS !!!!!"}, {"id": 337, "text": "Yet another Islamophobic B-movie.. JGL must have actually been held hostage to agree to act in this movie.."}, {"id": 338, "text": "It is absolutely disrespectfull against Turkish people. No terrorist with turkish roots have ever committed such crimes and this is absolutely horrifying. Such movies only creates more hatred in world where people are already fighting each other for little things. Also, they had to be Muslims right, the old Joe that gets repeated again and again by writers, milking it no stop. Finally, why do actors still play in such movies, it doesn't make any sense anymore, are they that desperate that the content of the movie doesn't matter for them! Horrifying.."}, {"id": 339, "text": "Why were there no subtitles for all the german conversations..........JGl said he didn't speak german but never once asked what anyone was saying....how???? i feel like i missed a lot not knowing what they wanted or said."}, {"id": 340, "text": "As in most European productions: good idea, bad execution. Rated 4 because it gives the creeps. You should give it a try anyway."}, {"id": 341, "text": "Definitely better than i was expecting--filmed in a cockpit the entire movie. i feel like it was realistic coming from the pilots side of things and the high jacking. definitely kept me on my toes; i didn't like how it ended and it dropped off i guess but it makes it a little more realistic. overall pretty okay"}, {"id": 342, "text": "Actually quite a good effort on a minute budget. Runs on a little too long and there are some plot holes (yet again plot requires otherwise smart people to act really stupid or the film might be very short for example I am fairly sure that if a terrorist had killed my pilot I would make sure that that terrorist would not be a threat again - just tying him up especially with just one arm was really dumb, try using the fire extinguisher again). Having said all that the film does draw you in and the ing was good. Quite engaging and dramatic and worth a watch."}, {"id": 343, "text": "Was on the edge of my seat throughout the entire movie, absolutely brilliant. Highly recommended."}, {"id": 344, "text": "Career best performance by joseph gordon levitt makes this hijack drama realistic stic and intense to the hilt. There is not one dull moment right from start to end. Thoroughly enjoyed it."}, {"id": 345, "text": "'7500 (2020)' tells the story of a plane hijacking at 30,000 feet, told almost entirely from the cockpit and focused on providing as, for want of a better word, realistic an experience as possible. It really is a taut, claustrophobic thriller that keeps you on the edge of your seat, its insular story pushing forwards at a pulse-pounding rate. It's also incredibly grounded, filmed using a special 'long take' technique that ekes the most out of its cast (which includes an especially on form Gordon-Levitt) by putting them in a situation that closely resembles the one their character is in - minus the actual danger, of course. The movie is highly compelling throughout, gripping you right from the moment its focal hijacking starts. It's exciting, distressing and intense. It does rely on some unfortunate and outdated stereotyping, but it also tries to inject some nuance into its narrative, especially as it approaches its somewhat unexpected finale. Though it isn't all that memorable or deep, it's a highly enjoyable and engaging in-the-moment experience. 7/10"}, {"id": 346, "text": "I really liked this movie. I thought the story was interesting and the acting was good. One or two plot points didn't make sense to me, but were probably just meant to create drama and keep the story going. My biggest problem was that there was a lot of foreign language dialogue and there were no subtitles. At the end when I was exiting out of the movie on my Amazon app, I noticed the button for closed-captioning subtitles. I turned that on and rewatched the scenes that had a lot of foreign language. The cc translated it all, and it made a big difference in understanding character motivation in those scenes. So I would suggest to anyone reading this review before you watch the movie, watch it with closed-captioning subtitles turned on."}, {"id": 347, "text": "7500 has a simple plot that executes itself fairly well, with its realism and acting. It's obvious that 7500 strives for the intensity and realism; it doesn't try to entertain, but to show what it could be like in one of these scenarios. I've seen other movies like 7500, where they portray terrorist hijackings on a plane, but 7500 is the best one I've seen so far.At some parts in the film, it drags for a little too long, especially in the last scene. And for me, the intensity was lacking in that final scene, as it's pretty clear with what's going to happen next. But in other instances in the film where a scene is just as long, if not longer, the pacing is perfectly fine, because the intensity is at its highest.I think what makes 7500 so intense was how realistic it really is. The dialogue, the violence, and the reactions of the characters are all down to earth. I also like how the film is told through the perspective of a pilot. I mostly see movies like these being told through a group of survivors, so seeing it being told in a completely different lens definitely freshens things up.The acting was great too. Joseph Gordon-Levitt's performance in 7500 really shows off his talents as an actor. I would put 7500 in the top 3 of his performances, because it's really that impressive. What I love so much about the overall performances, was how everyone else's performance was equal to Joseph Gordon-Levitt's. The cast is no means A-list, but they definitely gave performances that match that talent.Overall, 7500 is a very simple plot that perfects everything that needs to be perfected. It doesn't have an insanely intelligent plot, but it makes up for that with the acting, intensity, and realism. And with its runtime being 1.5 hours long, it makes sense to watch this hidden gem of a film."}, {"id": 348, "text": "Riveting. Realistic. Well acted and great script. Dont expect a block buster drama action movie this is way more intelligent than that."}, {"id": 349, "text": "This is a stellar drama written and directed well. The director previously won the Academy award for best short film. I'm assuming that Joseph Gordon Levitt and he met in admiration for each other's work. It's all about the stakes. And the stakes are raised again and again in this film.Great work by everybody!"}, {"id": 350, "text": "Pilots who watched the movie told me that absolutely everything happening there is realistic. Original, intense, highly entertaining... It will keep you glued to your screen during 90 minutes. Very good."}, {"id": 351, "text": "Bad reaction from Gordon's character after he stepped out of the cockpit &amp; saw his wife. Especially considering the way he broke down in the cockpit."}, {"id": 352, "text": "I thought this movie was a great start to a suspenseful hijacking airline film with a few nuances like the pilot and stewardess and having a relationship, but I got to say that I fast forwarded through the entire last third of the movie because it was nothing but Long drawn out scenes with no action. Am I the only one that wanted to see the captain kill that terrorist for about 35 minutes? I like the idea and I think the production was well done, but the lack of real suspense at the end just didn't do it for me"}, {"id": 353, "text": "Could be better.... I really didn't like the end..."}, {"id": 354, "text": "Started interesting enough, then all nothing but a downward decent. Some real basic and fundamental flaws. 1. Absolutely no way that 2 guys with some sharp glass should be able/allowed to take control of the passenger area, and start killing people. They'd have no chance at all against at all against groups of charging, attacking male passengers. Eventually that happens - after 2 people killed - but what the eff were they waiting for? Was a good movie showing that they wanted to finish? And co-pilot should have called the passengers to attack immediately, instead of just meekly pleading with the terrorist to not kill people. 2. Oh wow, who could have possibly guessed that the terrorist, who killed the pilot, and who you chose to keep alive there and tie up, would escape and take over the plane? Just criminal neglect in not permanently subduing him, as he'd kill the hundreds on the plane, and maybe more on the ground by crashing into a building"}, {"id": 355, "text": "Terrorists attempt to hijack the airplane and crash it in a show of revenge. It's taught thriller in which co-pilot Joseph Gordon Levitt becomes the key figure in the story. His captain is murdered and he has to watch as the terrorists get hostages to kill in front of his monitor to let them in the cockpit. JGL carries this film brilliantly with his emotions spilling out to touch even the coldest of hearts. It's a thriller right up to the end. Anyone other JGL and this could have been a complete flop but he carries it superbly."}, {"id": 356, "text": "The movie is much, much better and more realistic than usual American movies which, with this idea of plane hijack, would probably be an insult for intelligence. But the part when one of the hijackers (one in the cockpit, tide with his hands behind back) gets free is typical American plot which is so unbelievable. That part, plus the first officer and stewardess having a baby, ruined the movie. Main actor was very good."}, {"id": 357, "text": "I needed a change of underwear and I suspect I had at least 1 heart attack watching this film. I have no idea as to why this film got such a low rating on this site. It's perhaps the best hijacking film (if that is a genre) I have ever seen. United 93 was pretty damn good but this just blew me away. Knife-edge stuff."}, {"id": 358, "text": "It's pretty short but definitely worth a watch if you love airplanes (just like me)."}, {"id": 359, "text": "Such a waste of time... Nothing is deep enough. We cant understand the characters, we cant understand their motivations..( you killed our sisters and brothers and we will get revenge wow!) You are advertising the movie by saying the the pilot and hijacker is developing a relationship; HOW? And btw if you really want to show turks as muslim terrorists at least find some real turkish speakers instead of giving an arabic actor a role being a turkish. And of course our hero is american .. disgusting."}, {"id": 360, "text": "Great job. Innovative piece of work. This film had to cost, i don't know, less than 100,000 dollars. I say it's low budget because we were confined to 1 room only. The actors did a great job. Very realistic. The lead actor was in the film PROJECT POWER. He's a good actor."}, {"id": 361, "text": "So it's not the best hijacking movie, but not the worst either. Action was throughout the entire film which I love and the suspense was great. However I didn't enjoy that everything took place on the cockpit. Granted it is focusing on the pilots in this scenario, but adding the rest of the aircraft with passengers and their reactions etc would have been better.All in all, a great film for those who love the skies."}, {"id": 362, "text": "This is a rare and superb bit of film making. It proves you don't need big budget stars or big budget sets (yes, I know they bought the plane) when you have great performances, great attention to detail and a refreshing approach to a subject that has been covered many times before.It's riveting from start to finish. It's cruel, tense, and incredibly claustrophobic. Forget Hollywood hijack films, this is the new benchmark."}, {"id": 363, "text": "The fiance's got killed, his boss the captain's killed. it's a struggle."}, {"id": 364, "text": "This is a technically competent movie, but whatever motivated its creation seems to have eluded me. Everything works well, but pointlessly.It is conceivable that the story meant to lampshade that terrorists are ultimately not too different from everyday people. Is that some sort of insight? I feel like I knew that already. I hoped for some sort of exploration of the motivations and personality of the characters, but other than the pilot there seems to be no interest in building some depth beyond the obvious message that terrorists are not a breed apart.This could be a good movie. But it does not want to make the attempt."}, {"id": 365, "text": "This film takes the airplane hijacking genre and portrays it from an original perspective - strictly that from the cockpit and JGL. I really wanted to enjoy this film a lot more than I did because I think Joseph Gordon-Levitt (who I feel was in hiatus for a while) is absolutely brilliant and, as expected, he is fantastic as the main protagonist on flight 7500. However, despite its ambitious approach to tell a generic, formulaic story with a slightly different spin, the script is far too predictable and the film very quickly loses steam towards the end of the the second act to its conclusion. 7500 hits the ground running but can't sustain the pace for the entirety of the film (disappointingly). I can't necessarily recommend this one unfortunately despite a short runtime but I was really rooting for it to be better (and some of you may actually find it exceptionally better than I did)."}, {"id": 366, "text": "The film was very procedural and had lots of unnecessary scenes and unimportant dialogue. I'm sure this was made not only to pad the run time but also to make it feel more realistic. I was fine with that mostly, it also did feel like many moments were improvised, and that's alright as well.The problem was that we don't really know a whole lot about our main lead and about the kid. There's very little information about the kid and Levitt does not interact with his girlfriend a whole lot. Instead, we got lots of technical scenes (which were interesting in a way if you fly a lot), and some repetitive scenes of Levitt trying to risk it and attack the hijacker kid but still not doing this.I've seen similar scenes handled better in a cheap series (with the same amount of realism). Literally, a frightened kid with an AK takes hostages in a store and a cop is talking him out of it using everything he's got (even lying and deceiving) before getting the kid (who was innocent but got into a bad situation) finally breaks down and cries dropping the gun and going completely unresponsive.I'd love this film much more if the ending would've been more ambiguous and our main lead would've stayed more in character. The ending they have chosen is just lame and bland. Why not do something crazier, why not let Levitt kill the kid bloodily in an act of revenge out of pure misery and hate and then come to realize what he has done when the boy got the call. Or let the boy kill him and get shot, how about such a realistic and dark ending? And why would he try to save the boy anyway? He must be devastated because a lot was taken from him, why is he trying to save the life of a boy who almost killed him a couple of times? What a weird anti-violence message.Overall, while the realistic approach was interesting, I'd still love this more if they would have more emotional fatigue and a better ending. A good Korean director would've made this such a tearjerker."}, {"id": 367, "text": "Would have been a canny film if it wasn't for the banging of the door every other second"}, {"id": 368, "text": "First half, good lord what a gripping movie. Twice I stood up with anxiety. Then the tone shifts and the movie gets slow and unrealistic. Would have made a perfect movie if it had ended halfway through"}, {"id": 369, "text": "So many things could have been done differently...But... Then the movie would have ended after like 30-40 minutes. One thing that makes NO sense in the glass. I saw the one guy buy the 4 bottles of whiskey. How did that not 1. Raise suspicion by the store clerk. 2. How were they allowed to get them on the plane. Every international flight I have been on, Passengers were told that if they bought any bottles of liquor in the gift shop, it had to be under a certain about one order to stay in the cabin. If I had bought a regular/full size bottle instead of the novelty sized 'Nip', I would have had to hand it over and have it stored belowdeck. The size bottles he bought were definitely big, too big for carryons. I'm also curious about where they actually broke the bottles and didn't attract attention. Also, 85 passengers is a lot of ppl to fight back, especially when he radios the cabin to tell them their major advantage over the loser wanna be hijackers. They definitely are at a disadvantage going in there with 4 guys (one who is young, scared and not in the same mindset as the losers he is with) &amp; shards of glass (any children, elderly, or people with health issues, but they definitely had plenty of ppl to fight back against that COWARDS!How many others who watched this have a whole list of what you would have done differently if you were to Pilot or his girlfriend... me (raised hand emoji)I would have rated it higher, but I found some of the scenes to be really annoying with how they played out. I was yelling at the screen most of the time. Part of me is glad I watched it alone, but I also wish I had watched it with someone so we could have yelled at it together"}, {"id": 370, "text": "I didn't know what to expect coming into this movie, so I was shocked to find a gripping thriller shot. Joseph Gordon-Levitt was, as expected, absolutely fantastic, and I was blown away by the performance given by Omid Memar. The story itself gives a different perspective to those that are brainwashed and forced into doing terribly horrific things - which makes me confused on how I feel about Omid Memar's character because on one hand he is a manipulated 18 year old, but on the other hand, he is a terrorist. That dynamism makes for a very entertaining and deep character. I was sort of disappointed that they made the terrorists Muslim, as is in most movies sadly, but they forced this old trope through a different lens, and to me that made it fantastic."}, {"id": 371, "text": "A Raw, Captivating Nailbiter! I couldn't take my eyes off the screen. I loved learning from a cockpit view what goes into flying one of these aircraft."}, {"id": 372, "text": "It's so much better than the reviews suggest. Joseph is incredible throughout the entire movie. In parts I felt like I was holding my breath! It's gut wrenching but also incredible to see scenes like this played out on screen. This is what so many people have experienced and we usually only see it from a passenger point of view. But this is entirely from cockpit point of view. It's not overly long but long enough and full of detail. Loved every minute of it."}, {"id": 373, "text": "I'm sure this movie although seem simple and with a low budget, will leave a lot of people haunted for a while. I see a lot of people praising it to be accurate, I just think it feels real even for someone who doesn't know how everything works on the plane. Not every movie there's a hero who stops all the terrorists, and not everyone lives.The only issue I have is the small cabin that could make some people claustrophobic, as after the first few minutes you hardly see any shots of the passenger cabin or exterior of the plane anymore."}, {"id": 374, "text": "Great concept. But should've been better written. -So you take over a plane with only 4 HIJACKERS &amp; NO GUNS? -A hijacker has his hands bound, but still over takes the co pilot?The bottom line is that this was filmed POST 9/11. -There should've been a gun in the cockpit There should've been an Air Marshal on board."}, {"id": 375, "text": "Can't expect more from this movie. Keeps you engaged the moment movie begins!"}, {"id": 376, "text": "This is a great flick that really shows off the inhumanity of islamic terrorism. HINT: Skip over the graphic parts, where they REALLY act like good muslims."}, {"id": 377, "text": "I wanted to love this movie. I love action adventures, but this wasn't what the movie is. It seemed more like a psychological thriller. Joseph Gordon-Levitt stars as an American pilot living in Germany with his girlfriend and his son. His girlfriend is a flight attendant on the flight. He is co-pilot on a flight from Germany to Paris.The movie starts with a lot of technical information about planes. Then the movie moves quickly to terrorists trying to take over the flight. One gets into the cockpit and kills the pilot. At this point, it is pretty basic....the other terrorists try to enter the cockpit...banging on the door over and over and over. They kill passengers including his girlfriend.The real standout of this movie is Omid Memar who stars as Vedat (one of the terrorists). But we learn he is only 18 and conflicted about the behavior of the other terrorists. He makes a connection with Levitt's character. The last third of this movie is just the 2 of them and Vedat is seen as just a kid. Levitt's character ends up caring about him in the end.The problem with this movie is that for a 90 minute movie, it feels like it is twice as long. There are long periods where nothing is happening. I don't understand Levitt's appeal as an actor, it was only at the end where I actually felt something for his character. It's not a bad movie, in fact I would recommend it, but it as it ended, I didn't really feel anything."}, {"id": 378, "text": "Love anything Joseph Gordon Levitt does. He was great in this roll. Very intense but very well made."}, {"id": 379, "text": "Since this is an Amazon Original movie, I'm guessing all the poor reviews were planted by trump and barr. (Intentionally not capitalized.)"}, {"id": 380, "text": "I ha to consciously relax my muscles while the credits began to run. Wow"}, {"id": 381, "text": "... who think that a movie can't be made in one location in order to be interesting. You are wrong. 7500 is a great example of a movie that keeps you on the edge of your seat in a claustrophobic thrilling drama. A wonderful movie. Very realistic with high levels of suspense."}, {"id": 382, "text": "So many films now have to be full of stars, glamour, special effects etc. This is so much better than that. Well written, well acted and full of emersive suspense. A really enjoyable, intense watch if you get through the first incredibly slow first 12 minutes. Ok, a predictable ending but that's ok, better than the usual happy ending for all. Reality I suspect is that the fighters would have blown the plane out of the sky as soon as it fell into the hands of the terrorists and was aimed to crash into a city?"}, {"id": 383, "text": "Different, exciting, no unnecessary frills and definitely worth a watch. I loved it."}, {"id": 384, "text": "Despite the young hijacker change his mind, this is one fantastic movie!!"}, {"id": 385, "text": "7500 Is a Movie which is About Hijacked Plane &amp; How the pilot got out of the situation. The Movie is Not at All boring. THE whole Movie is shown in the Cockpit of the plane . The Movie create a Tension and suspense Of what is going to happen. Yeh the ending is predictable , But it Does not ruins the movie. Great movie atlast From Amazon studios."}, {"id": 386, "text": "It's a film that really gives you the feel of being on a plane and inside the cockpit with it's shots. The terrorists on the plane plot is kinda predicable but that doesn't defy the fact that this film continuously keeps you glued to your screen."}, {"id": 387, "text": "Went into this thinking it's your typical hijack movie. Was not that. Was so much better. More feeling. More weight to it than a normal suspense movie. Superb performance by JGL. And the kid who played the hijacker was amazing as well. Give it 10 stars. Was very very good."}, {"id": 388, "text": "7500 is a Thriller - Drama movie in which we watch a flight from Berlin to Paris being interrupted by terrorists. The pilot and co-pilot have to do everything they can in order for the terrorists not to take control of the airplane.I liked this movie because it had a nice and simple plot, with plenty of suspense and many emotional moments. I also believe that the interpretation of Joseph Gordon-Levitt who played as Tobias Ellis was simply amazing. Regarding the direction which was made by Patrick Vollrath was good but it could be better if he added more information about the story of the main characters. I recommend you to watch it because it is not a long movie, it has a nice plot and an amazing interpretation of Joseph Gordon-Levitt."}, {"id": 389, "text": "I enjoyed this thriller very much. I must first give credit to the casting director(s). The lead protagonist, Tobias Ellis is played superbly by Joseph Gordon-Levitt. He brought complete authenticity to this complex role. Afterwards, I was left believing he could fly an airliner, and much more. I must also give credit to the youngest antagonist, Vedat played by Omid Memar. He is brilliant in his portrayal of a very young and frightened hijacker. Although an unfamiliar face, I am sure this will lead to much success in his future. It should be noted about 90% of the film is contained in the airliner cockpit. This fact compounds everyone's fear; it becomes more palpable. I was reminded of the big budget film Apollo 13 (1995). Although the plots are very different, the claustrophobic atmosphere is quite similar. Overall, I highly recommend seeing this film. It allowed Mr. Levitt to display his full range of talent. I have always liked him. Of course, Inception (2010) comes to mind. However, I particularly enjoyed him in smaller budget films like Premium Rush (2012) and Looper (2012). 7500 is a must-see film."}, {"id": 390, "text": "We watched it last night as we're both frequent fliers and found it nailbiting. Very good acting, scenes reminiscent of some great horror movies for suspense"}, {"id": 391, "text": "I haven't been glued to a movie in a long while. It started slow but it got intense... it's really good.."}, {"id": 392, "text": "This film has an intensity and a realism that is absolutely incredible. It is also patient; the director lets the moment play out in what feels like real time. I used the word moment intentionally and not a word like action. Because this film plays like a real moment in time. The suspense is unbelievable. it can be extremely difficult to watch, but the performances and the direction are top notch. This film is not for everyone, and not for the sensitive. The year listed for the film is 2019, which means its award season eligibility has passed; How this film was not recognized during award season, I do not know or understand."}, {"id": 393, "text": "This film surprised me, it was so good. So intense that I had to watch portions of it with the sound OFF (left subtitles on). If you suffer from anxiety, this film might not be for you. I liked it very much, myself."}, {"id": 394, "text": "Right from the start 7500 does not feel like your watching a movie at all. Its potrayal of the story is so real that it feels your in that plane with all the drama unfolding. Joseph Gordon-Levitt delivers a stunning performance. The screenplay is superb. The run time of the movie is perfect. Hats off to the director the movie Patrick Vollrath for pulling this one off. Definitely a must watch."}, {"id": 395, "text": "You may want to take a chill-pill ahead of watching this thriller otherwise you'll be perma-tense once the hijacking begins. The film excels in its low-budget cinema vérité style, as if you're a witness to actual events. It doesn't speak well of the 85 passengers when they don't rush/engage the three terrorists armed only with makeshift knives. My biggest issue with the film is the lack of epilogue, it would've really stuck the landing showing Tobias arrive home, traumatized and having to face his now motherless kid."}, {"id": 396, "text": "Shows what can be done on such a small set with good writing, acting, direction, sound editing and the rest of the film making arts. Gripping and different. Much from the perspective of one character. The world outside the set is well crafted, even though we get to see little of it. Impressive."}, {"id": 397, "text": "Great illustration of mentally ill religious fanatics. The erroneous idea that they are somehow serving God by killing innocents, even if they see it as revenge, is chilling. The film plays out this chilling scenario effectively."}, {"id": 398, "text": "Joseph really shine from the film with little stuffs he can deal with. Glad to see him back to acting with this film since Snowden. The last 30 minutes of the film was overstretched and didn't know how to end the film itself. I just know for a fact that without JGL the movie would fall flat."}, {"id": 399, "text": "Starts with a high note and ends with a down curve. Could have made lot better, but they decided to settle for less."}, {"id": 400, "text": "To begin with, I really like movies that are NOT CGI and 1 second clips that make you dizzy. A movie with good characters and great plot are very entertaining. I'm just not sure what the point of this movie was. Aside from it being a pretty realistic point of view from the pilot, what were we supposed to take away from this film? The co-pilot endures some pretty profound loss and the bad guys die. What was the pilot supposed to learn besides life really stinks sometimes? Or was this just a PSA for hijackers? Someone pointed out that this would have been a good short. I agree. It was pretty long winded and I feel there was nothing to take away from it. It had good acting but left me feeling blah....."}, {"id": 401, "text": "I enjoyed most of the movie.... right up until the credits started rolling .. then i felt a little ripped off. Most of the acting was good and the story line kept me intrigued. There was much sadness but after it's completion I just felt like it could have spent another 5 minutes dealing with the aftermath.6.1"}, {"id": 402, "text": "I'm reviewing this film based on what I believe the filmmakers wanted to achieve by making it, a gritty claustrophobic real-life account of the brutal hijacking of a commercial airline. And that is exactly what I saw, this is not a Hollywood film nor does it have a big budget but that's exactly why it works. One has to look at this film for what it is and not what you may be expecting it to be. If you look at this film solely from the point of view of the co-piolet which is what the film is about then you'll understand that it's not trying to tell a political story or give you insight to why people hijack planes. The runtime is 90 minutes and I was never bored during this entire time. I felt every emotion the protagonist felt and I was totally involved in his plight. No film is perfect and this film is no exception but it made a favourable impression on me that I felt the need to leave a review. This is a little gem of a film and definitely worth 90 minutes of your life if you like these small gritty intense sorts of films. Most of the negative reviews are based on opinions that have nothing to do with storytelling. I would bet that nearly all of the negative reviews came from people who didn't actually watch the film."}, {"id": 403, "text": "Make no mistake, this is a very bold approach. It takes a whole lot of creativity to pull off such a concept and maintain the type of tension that is evident throughout the entire film.Plane hijacking films have been done before, none better than Paul Greengrass's United 93. Being based on a horrific true event made it all the more powerful. That film can't be topped. So what's a filmmaker to do? Change the approach.Full credit to the director and the backers who took a risk to bring us this scenariio in a totally new and disturbing way. What we can't see is more horrific than what we can. Some of the best horror films used this approach. Alien being one. The horror was mostly off-camera. We never really saw the thing until the end.Those who dislike this fall into two camps. Those who don't like to see any Middle Eastern type figures as bad guys in films and those with such review titles as OMG! and oh lord, what just happened? How the quality of film reviews have dropped ever since phones became the review tool of choice. These people are not of discerning sensibilities and clearly don't understand human behaviors such as fear and stress. The stakes are as high as they can get. The tension is incredibly taut. Great performances by all the cast.7500 is obviously not a mainstream thriller so those who are wanting their action served up with cliche's, don't waste your time, and ours with misleading ratings.This is in the same tradition as Hitchcock's Lifeboat, except this space is a lot more claustrophobic. One of the most suspenseful films I've seen for a long time, part of it being because it's all too possible."}, {"id": 404, "text": "It's interesting that the reviews are split so much on this. SO MANY people hated it and I just don't get why. I have an idea - they're used to watching big blockbusters with unnecessary violence and b.s. scenarios that are made up to elicit certain emotions. This film was quite realistic but nobody seems to actually want to experience real life. I do understand that some people watch movies for escapism and that's fine but if you read the synopsis it's clearly not that type of movie.JGL did very well in my opinion. Great even considering the tight space the movie was shot in. He made smart decisions, used his training, tried to keep calm. But that's not good enough for idiots who just want constant action and for the good guy to kill the bad guy like so many pointless movies out there.Maybe the haters don't like that one of the hijackers is given basic human emotions and clearly isn't just a mindless monster/soldier for the enemy. Does it bother you that even people doing terrible things can still have a conscience and experience fear and doubt and regret? That's real life."}, {"id": 405, "text": "I hate spoilers, so there are none here! I have not seen such a good Thriller in a long time, a very long time!The tension doesn't take long to build up, and it doesn't let go until the very end.A word of warning though: while this movie is not for those who like big explosions, non-stop action and over-the-top theatrics.. it is NOT for the faint of heart, as the events portrayed feel extremely realistic. The violence may not be very graphic, but the feelings are violent, sharp and heavy. This is NOT a movie like Air Force One' with Harrison Ford!Ok, on to my thoughts.I will try and keep this somewhat short, but please forgive my lack of structure; I do not review movies very often, but I found this one that good that it really compelled me to come and talk about it.I'm strong on Psychological Horror/Thrillers and high intensity movies (dramatic and realistic). I care very little for action and explosions and movies like the modern Star Wars and Hollywood stuff. I really enjoy stories, acting and a realistic approach to emotions and natural interaction between people. Quirky one-liners belong in comedies, which this has none of.This movie hit all the right buttons!The setting, location &amp; the way the people interact together felt like this was a real event. This movies has a kind of approach that reminds so much of the Norwegian movie 'Nokas' in its almost biographical approach.When looking over the movie' synopsis; I almost skipped it because it sounded like it was about an American saving the day (I have NOTHING against Americans, I'm just tired of Hollywood stories that are unrealistically heroic); and I was extremely surprised by the outcome. Joseph Gordon-Levitt does an amazing job here, never did I feel like the emotions he was portraying were out of place or unrealistic.I felt immersed from the start until the end. It felt like the camera rolled literally for 1 1/2 hours without any cuts. The editing was extremely tight and realistic. I felt like I was in the cockpit the entire time.I don't want to give too much away... but if you are into realism and intense stories with lots of drama, this may just be what you need!"}, {"id": 406, "text": "I can only assume that the negative reviews being given by some for '7500' were from people that maybe prefer their danger-in-the-sky movies to have more action and special fx. This movie isn't Harrison Ford in Air Force One, rather it takes the opposite view, the perspective of the surviving co-pilot stuck in the cockpit dealing with the situation as it might realistically happen. For me, that's gold. Bravo!Most air-hijacking films go for summer spectacular status with thrills and spills and vast heroism (re: the previously mentioned 'Air Force One', as example). 7500 takes the rarely taken path -- what would it be like to be the surviving co-pilot in that situation where you simply must not 'open the cockpit door' but be aware of the carnage happening in the passenger area?Maybe the negative reviewers prefer their heroes more like Harrison Ford, and find Gordon-Levitt too subtle. Not me, I thought the performance was solid *because* of the 'average man' nature of the character.Again, bravo."}, {"id": 407, "text": "What I liked about this movie most is trying to figure out just what it is. With the claustrophobic intensity of Talk Radio, the scope of Airport, and quiet intensity of The Fugitive, this film is what seems like a good first effort.We need good disaster films. They take us away from the troubles we are facing. Back in the day, you could've seen the three films Earthquake, Network, and Airport all at the same theatre depending on your mood and company for the night (of course these were not all out at exactly the same time, but you know what I mean).Now it's so hard to find anything new, anything that really grabs you. This is NOT a great movie. The story loses steam near the end, and lacks the twist I was expecting.Also, without hurling any personal insults at Joseph Gordon Levitt, let's just say he, and Keanu Reeves may have been switched at birth.If you are a Joseph Gordon Levitt fan, you might hate this film, and that is just fine. No great effects, time travel, or any other customary JGL fare here.Do I think Harrison Ford could've done better? Yes. Do I think Al Pacino could have done better? Yes. But those are high bars, and Joseph Gordon Levitt is far from terrible.Having said that, however, the script and direction seemed worthy of either of those two stars, and that's saying a lot.The film does an excellent job of explaining the mechanics of the action. It really does keep you on the edge of your seat, at least for the first hour.The last half hour, well, that left me scratching my head. Not dissatisfied, mind you, just a little confused.Regardless of my personal opinion of this feature, I can say that I hope this young director makes more films like this. It's something entirely different in a sea of sameness."}, {"id": 408, "text": "About a decade ago I was in the airline industry and I can confirm this film rang very true. The way the pilots and flight attendants interacted was very natural and realistic and all of the flight crew work shown before the terrorist attack was extremely well acted. Once the terror attack begins the film becomes extremely tense and never relents. It's the type of movie where your eyes are glued to the screen and you need to know what is going to happen next. The runtime absolutely flies by.Before watching '7500' I thought the title was in reference to the flight number of the aircraft featured in the movie. I thought this was strange because there was another movie called 'Flight 7500' back in 2014 which I thought this movie was doing a disservice to by choosing the same name. Apparently however, the 7500 refers to the transponder code used to indicate a hijacking, which at least means they didn't just steal the exact same flight number out of the thousands that were available, but does still leave the fact they trampled on that film's title a little only 5 years on. I never felt like any character was safe in this movie and I love that in a film. Even Joseph Gordon-Levitt's character didn't feel safe to me. It was a film I could easily have seen taking a very dark ending and whether it actually did or not doesn't matter because at least that feeling was with me the entire film. I had a really good time with '7500' and would highly recommend people check it out."}, {"id": 409, "text": "The pilots of a passenger aircraft prepares for take-off on a short haul flight between Berlin and Paris. Tobias Ellis (Joseph Gordon-Levitt) is the American co-pilot working for the German airline and his wife (Aylin Tezel) is a member of the cabin crew. Shortly after take-off four Islamic terrorists attempt to attack the cockpit. One gains entry, but is not knocked unconscious, while the pilot (Carlo Kitzlinger) is mortally injured. Tobias maintains control as the terrorists try to gain entry and control of the aircraft and threaten to kill passengers and crew.Filmed entirely within the cockpit of the aircraft, the film is gripping from beginning until the end with Gordon-Levitt providing an outstanding performance in the lead. The tension is maintained throughout and is a perfect example of how drama can be sustained in a confined space. This is a German-Austrian-US production that deserves greater recognition."}, {"id": 410, "text": "I kept seeing this appear in my Amazon recommended and as I like Joseph Gordon Levitt I thought I would give it a go. It's somewhat unusual as aside from the intro segment of the film which is filmed from a CCTV perspective, the entire film is shot in the cockpit of an airliner.Joseph Gordon Levitt is a completely believable as the co-pilot of the plane and the situation he finds himself in. The film is done in such a way that it seems more like a reconstruction of a real-life event, rather than a flashy Hollywood blockbuster with dramatic music and a have a go hero saving the day. I think this adds to the tension as you find yourself thinking, would this be what a real hijacking is actually like for those affected or involved? (Sadly since the events of 9/11 we have known the outcome of events like this which have ended tragically) Come to think of it, this film reminded me a little of United 93 in its tone.All in all, worth a watch and JGL produces an excellent performance as Tobias Ellis."}, {"id": 411, "text": "So to clarify I'm not confused about the movie, I'm confused with the positive reviews and comments. So I guess it's different where no soundtrack and supposedly the realism of how to fly that plane but that does not make this a good movie or a must see.I felt very disjointed with the characters and it was never really that intense and gripping. Maybe I do need the soundtrack for that. I also agree with some comments where some things just didn't make sense in key moments.I don't know but I must be missing something here cause I don't get the 8/10 or the 10/10 reviews. Or the must see best thriller this year stuff. Makes me question like are there fake pumping up reviews.I gave it 3 cause yes the acting was good but that's about it, plot suspense was pretty non existent for me."}, {"id": 412, "text": "Pros:The main positive of the film for me was JGL performance. He was essentially the reason I decided to watch the film and I thought he gave a good performanceThe halfway point was the best section of the film for me, tense and fast paced which kept me intriguedOmid Memar deserves credit for his performance too. An unknown actor to the public and he did himself proud alongside JGLCons:The final act of the film (the last 40-30 minutes) was poor for me. Very slow and I felt I was wanting the film to finishThe film overall was nothing special in my opinion. I appreciated the effort (as I do in every film) but it didn't wow me at any pointApart from JGL's character, I never felt emotionally attached to any of the other characters, which I was expecting too.I definitely felt the film could've been shorter reallyParts of the film were predictableOverall, '7500' was an ok film. The performance for JGL was the standout for me. I wouldn't say he gave a spectacular performance, but he carried the film for me and was involved in the film's best scenes. However, like I mentioned, towards the climax the film was far too slow, I thought parts of the film became too predictable therefore I wasn't as invested, emotionally, into the narrative. I wouldn't highly recommended watching this, but it was just ok for me.Quote - You're in Control - Tobias EllisScore - 2/5"}, {"id": 413, "text": "It's ridiculous to me that 7500 should have anything below an 8 on this site.A brilliant, accurate film about terrorists attempting to take over a plane. Joseph Gordon-Levitt is absolutely amazing. Omid Memar, as a young, scared hijacker gives an excellent performance. In fact, all the performances are good.This film starts out in the most innocuous way - white noise, people going through security, boarding the plane, the flight attendants preparing. And then WHAM - it becomes the tensest thing you've ever seen, total edge of your seat. It comes as a huge shock after the quiet beginning.You really have to ask yourself what you would do in Tobias' (Gordon-Levitt) situation. It's unbearable.According to pilots and tech people, this is a very accurate film in all aspects.Highly recommended. Decide for yourselves and don't believe the low-numbered reviews."}, {"id": 414, "text": "* There is no end credit scene *Patrick Vollrath in his directional feature-length film debut and crew brought a unique intense thriller. The story is about a pilot maintaining control while terrorists hijacked the aircraft. There have been many movies with the same topic, but this one was so freshly told. The perspective was brilliant and very realistic, one gets used to having the viewpoint from the passengers but this film was angled at the cockpit. The suspense was incredible, especially the curtain scene, despite knowing what was bound to happen it was still hair rising. The decisions the pilot had to make for the safety of the passengers were hard to endure and the tension escalates each time he has to make one. This was not an action film, there was no hero, what this film gave was a feeling of a true scenario of a man struggling with protocols and emotions.This movie didn't have any music and as much as I love the scores, this time it didn't need one. By not having any music the performances had to be at its peak and it definitely was thanks to the lead actor.The cast was great, and no matter how small the role they all did magnificently. The lead actor, Joseph Gordon-Levitt had the weight of the movie on his shoulders and his performance was mainly projecting being on pressure and it was done superbly to its core."}, {"id": 415, "text": "Greetings again from the darkness. The first airplane hijacking movie I remember seeing was AIRPORT (1970, with Burt Lancaster and Dean Martin). Since then, it's been a recurring, relatively common cinematic topic blending our natural fears (flying and terrorism) with our love and admiration of heroic people, as seen in such films as EXECUTIVE DECISION (1996) and AIR FORCE ONE (1997). Writer-Director Patrick Vollrath (first feature length film, Oscar nominated for his excellent 2015 Live Action Short EVERYTHING WILL BE OK/ Alles Wird Gut) and co-w Sanad Halibasic use some of the familiar tropes we've come to expect, but do so with a unique twist ... the camera never leaves the cockpit (at least until the very end).Joseph Gordon-Levitt stars as Tobias Ellis, the co-pilot to Captain Michael Lutzman (Carlo Kitzlinger) on this scheduled short flight from Berlin to Paris. Tobias is an American based in Berlin, living with his Turkish girlfriend Gokce (Aylin Tezel) and their young son. Gokce is also a flight attendant on the flight, and the two have attempted to keep their relationship a secret from their co-workers and employer.The film opens with a quote usually attributed to Gandhi, An eye for an eye leaves the whole world blind. We then get a couple minutes of Berlin Airport security footage as passengers and their carry-ons proceed through security lines. We hear no dialogue or sound. The first actual scene puts us inside the cockpit as the flight crew arrives.Not long after a smooth takeoff, the terrorists rush the cockpit when the flight attendant is delivering water to the pilots. A fight ensues resulting in injuries, including to both pilots. The crisis quickly escalates as Tobias has to take over flying the plane, while dealing with the pressure of a life-altering dilemma: does he follow protocol and keep the door shut, or does he hopefully save passenger lives by opening the door? The tension mounts as Tobias (and us) views the actions of the terrorist through the small cockpit monitor.The film's title is derived from the pilot's Squawk code of 7500, which notifies the Air Traffic Controller of a hijacking-in-progress. As we learn, these aren't the usual hijackers. These are extremists who are avenging the deaths of Muslims. These terrorists prove they aren't afraid to kill, and proclaim they are not afraid to die. Well, all except one of them. Nineteen year old Vedat (Omid Memar) is the terrorists' translator, and he's left frantically trying to make the best of a bad situation, despite no real plan. His clouded-thinking exacerbates the situation as he tries to deal with the police negotiator.What gives the film appeal is the 'camera in the cockpit' trick and the tension of the moment. The space is cramped and claustrophobic. Showing the crew going through the pre-flight checks allows us to get our bearings in an unfamiliar setting. To this non-pilot, the sequence delivers a very authentic look and feel. Spending the entire time in a confined space recalls such films as BURIED (2010), LOCKE (2013), and Hitchcock's LIFEBOAT (1944). Joseph Gordon-Levitt carries most of the film with his performance, as he's rarely off camera. His temperament during chaos is fun to watch, but the final act is just a bit overwrought, and some of the good from the first two acts unravels a bit. Still, the close-quarters of a cockpit makes a unique viewing experience, and one that has us asking how we would react in this situation."}, {"id": 416, "text": "Every now and then a film comes along which doesn't put a foot wrong. This is one of those films. Absolutely nothing irritates. There are no scripting contrivances, missteps in the direction, unrealistic setups or dud performances.What this film provides is a relentless exercise in realism - it asks the question How might a hijacking play out from the point of view of the pilots? and then sticks committedly to honouring that perspective with a detached, cold eye. In this respect, Patrick Vollrath's direction is superb - in allowing the performances to lead the tempo, the tone and the framing, Vollrath produces something that feels almost real, such is the refreshing absence of aimless flash.Central to the film's success is an excellent performance from Joseph Gordon-Levitt, who does so much with fairly minimal dialogue and a tiny set in which to operate. Every thought, decision and emotion is there on his face, every acting choice spot on. The rest of the cast are all very good indeed, and are well used, even if they don't have much screen time.7500 packs a hell of a punch, and it will stay with you long after the credits have rolled."}, {"id": 417, "text": "I understand why people are rating this so low... they're used to big budget, ridiculous Hollywood films, which fall well short of the realism bar. This one is different.It's not a film for the masses; I'd say it's more of a purist film. If you're an av geek, or interested in aviation, you'll probably like this. It's a compelling edge of your seat thriller which is, in parts, scarily accurate. In terms of realism, it's pretty decent! Just a few actual inaccuracies and questionable timescales.Procedure would be just to turn off the cockpit video and land, and whatever happens, happens. But, if he did that, the film would be 30 mins long - and where's the excitement in that?JGL shows his weight in gold in this film. While it won't win him an Oscar, it really does show that he's a fantastic one-man-band of an actor; convincing throughout and relatable. You can really feel his frustration and anguish.My only frustration was the lack of ending. However, it's worth a watch... so long as you don't have any flights booked anytime soon!"}, {"id": 418, "text": "Tobias Ellis ( Joseph Gordon-Levitt) is the co-pilot on what should be a routine flight, but when the plane is overtaken by hijackers the fight for survival ensues.7500 has a routine premise that has served as the basis for many thrillers an action films, but 7500 takes that familiar premise and goes a different direction with it. Anchored primarily by Joseph Gordon-Levitt's central performance as Ellis, the movie has nearly all of its scenes confined to the cockpit of the hijacked aircraft. Much like Locke, Wheelman, or Phone Booth, the movie travels familiar territory but views it from a different angle to give it a unique perspective. From the boarding process, to the hijacking, to the proceedings that follow, we the audience along with Ellis never leave the cockpit and only have a partial picture of what's going on at any given moment. The movie is the directorial debut of German filmmaker Patrick Vollrath who was nominated for an Oscar for his short film Everything Will be Okay. Vollrath makes good use of his cramped space of the cockpit, and while I wasn't especially engaged by the story or by individual sections, I felt that Vollrath was able to capture the feeling of isolation and powerlessness that one would feel while in the driver's seat of a hijacked aircraft.7500's strengths lie in its central performance and its craft. While the story follows many of the beats one has seen in various hijacking thrillers, the movie is well paced and maintains a tense atmosphere that makes it worth a recommendation."}, {"id": 419, "text": "What worked: the movie was pleasantly good since I had not expected much from the movie. It's a well executed movie with a good balance of thriller and drama. It is not over the top movie. What worked really good is the nature of the movie, the lively rather than theatrical set, mood and tone. The situation is tense, the climate is set beautifully and the set of events are natural and convincing. The team worked great, great mixing, screenplay and direction. The narrative as a whole worked good especially because of the simplicity and authenticity of the overall storytelling.What did not work: although the movie has very few scenes or situations that can be argued and disputed, which is a good thing. But one thing that stood as dramatic is the character of the teen age boy which ends up in the cockpit. I would have been happier if that character was written differently or maybe excluded or any other scenarios leading to the finale. I mean it's a well calculated plan and one of them deceiving and pulling back is a bit theatrical considering the amazing screenplay it was overall. Again, it's little thing that stayed with me, besides this it's a very well made movie.Final verdict: recommended, even better if you don't watch the trailer or come with no expectations"}, {"id": 420, "text": "7500 was directed and written by Patrick Vollrath, co-written by Senad Halilbasic, and stars Joseph Gordon-Levitt, Omid Memar, Murathan Muslu, Paul Wollin, Aylin Tezel, and Carlo Kitzlinger. It is about a co-pilot having to save the passengers and crew when his plane is attacked by terrorists.Plotting is as thin as you can possibly get, although that makes the goal of creating a compelling journey much more difficult. Pilot Michael, co-pilot Tobias, and flight attendant Gokce (Kitzlinger, Gordon-Levitt, and Tezel) are taking off on a flight from Berlin to Paris; when in the air terrorists Vedat, Kenan, Daniel (Memar, Muslu, and Wollin) rush the cockpit and stab Michael. Michael dies and Kenan is knocked out and tied up in the cockpit while the others try all methods to get into the cockpit. Tobias maintains a connection with the hijackers by speaking to Vedat.Characters are all pretty thin, but 7500 relies more on performances in the here-and-now than background about what came before. Tobias is young, yet very experienced in flying. He likes what he does, loves his son and tries to keep his personal life to himself, but his girlfriend and flight attendant Gokce makes that difficult sometimes. Vedat is the only other remotely fleshed out character, being caught up in a plot that he wants nothing to do with. During the events his allegiances waver and he forms a shaky bond with Tobias. Performances are strong, with everyone being solid in their roles; but Joseph Gordon-Levitt is truly electric in the movie. Tobias's efforts to be less sociable during work are weak, as he talks to his pilot, ramp agent, and girlfriend. Gordon-Levitt's emotions run rampant as he has to deal with a seemingly impossible situation. He gives a truly fantastic performance.A thriller's pacing and logic are its greatest asset, and 7500 both, but in uneven distributions. The first 15 to 17 minutes are deliberately slower than what comes after, and the instantaneous shift from a normal day-in-the-life for the co-pilot to complete nightmare works well, although some of the first few minutes could have easily been cut down to help add to the suspense and take away from unnecessary length. From around 17 minutes in to 45, the movie excels in serving white-knuckle suspense. After the power dynamic makes a major shift, the movie fails to stick the landing. The logic is sound for the most part but there is an attempt made to generate sympathy for Vedat that just does not work at all. It is a major misstep that does a huge blow to a movie that by this point has fallen into a slump.Technically the movie is solid, the single set being indistinguishable from a real life cockpit of a plane; to a ground animal like myself anyway. Sound design is a large part of 7500's authenticity, bringing the sounds of terror and machinery to life with ease. A couple of fight scenes exist in the movie, with almost all of the time spent watching one also being spent deciphering the action, with close-ups and cuts galore. The setting does limit the view of the action, but there are definitely ways around the obstacles (like the second half of the script) that the movie does not tackle.Vollrath's feature length debut is well directed and elevated by Joseph Gordon-Levitt's great acting and a fantastic 30-ish minutes partway in, but a first act that lingers too long, a misplaced bid on sympathy, and a weaker second half, 7500 misses the mark.58/100"}, {"id": 421, "text": "GRADE: B-THIS FILM IS RECOMMENDED.IN BRIEF: Despite a strong performance by Joseph Gordon-Levitt, this seriously minded movie becomes a standard hijacking tale without the action hero heroics.JIM'S REVIEW: 7500 is the code word for unlawful interference and this new action thriller starts off very promisingly as an authentic by-the-number treatment of a plane hi-jacking and its consequences. However, the film peters out long before it lands.After a three-year self-imposed hiatus from acting, Joseph Gordon-Levitt is literally in the driver's seat and it's good to have this versatile actor back. He convincingly plays Tobias Ellis, a co-pilot on a flight from Berlin to Paris that does not go too smoothly. After a short lift-off, the plane is seized by terrorists and Tobias is left in this closed cockpit to take charge of the situation.Tensions mount quickly and first time director Patrick Vollrath creates a claustrophobic thriller devoid of typical heroics and ramped-up conflicts. His film is suspenseful without being overly melodramatic. This is not your standard action hero flick as the director strives for realism and authenticity in his narrative. Unfortunately, his screenplay adds little to enthrall with its sparse dialog and underdeveloped characters. This all leads to a rather anti-climactic denouncement as the story idles along about the midway mark. One expects more intrigue and Hitchcockian twists which never arrive.Still, Mr. Gordon-Hewitt is quite good in his reactionary role and Omid Memar avoids the cliches as a stereotypical Muslim terrorist character. There is much to admire in this realistic take on the action genre, but the film just doesn't reach the heights it could have achieved. If only 7500 would have considered a few necessary rewrites before beginning its descent to moviegoers everywhere...now that would have been an interference worth waiting for!"}, {"id": 422, "text": "This was an Amazon Original movie and I usually like to watch the streaming services films. When I watched the trailer at first I was overly excited because the movie looked engaging. While I enjoyed the acting and some of the thrills. I was less then pleased overall with the entire film.This movie can be compared to Buried with Ryan Reynold or other movies similiar. It features main actor Gordon-Levitt who everything runs through and is filmed entirely in the cockpit. There are no other scenes anywhere else and that itself was my first problem with this it got clausterphobic too quick. My other issue with the film is gets extremely draggy the last 25 or so minutes. Its literally like watching paint dry and it was filled with useless banter. It was almost as if they were trying to use filler to put the movie at the alotted hour and 30 minutes.I also hated the ending completely I thought maybe after all that happened. They could put something a little emotional or along those lines. Instead the movie literally ends extremely abruptly. I personally wouldn't recommend this film but maybe I'm just someone hard to please."}, {"id": 423, "text": "STAR RATING: ***** Saturday Night **** Friday Night *** Friday Morning ** Sunday Night * Monday MorningOn a flight from Berlin to Paris, thirty one year old Tobias Ellis (Joseph Gordon-Levitt) is serving as the co pilot, whilst being seen over by senior pilot Michael Lutzmann (Carlo Kitzlinger.) It all seems like a pretty standard flight, until the aircraft is unexpectedly seized by a group of fanatical terrorists, who Ellis seals off by closing the doors to the cockpit. However, when they force entry and both sides take casualties, Ellis finds himself in a tense battle of wills with eighteen year old terrorist Vedat (Omid Memar.)Films have changed dramatically over the last twenty or so years, and so have the means by which they are accessed. While Hollywood was the only go to place for big, mainstream features not so long ago, today online streaming services pose just as big a competition. And so to has the style. While 90s Hollywood was known for it's big, theatrical outlandishness, today a bigger dose of relatable realism is expected. While back then, 7500 might be used as a thrilling description of how many feet a plane might be up in the air, today's more down to Earth (not the most fitting description, I know) audience get to know it's the emergency code for a hijack situation.At just over an hour and a half, debut feature length director Patrick Vollrath has a very constrained timeframe in which to create a genuinely unsettling, claustrophobic atmosphere, with engaging characters you can feel for, and it's no small feat that he's managed to do this on top of forging such a realistic scenario. Despite being best known for teen dramas, lead star Gordon-Levitt delivers a revelatory performance here, displaying a remarkably human reaction to getting caught up in such an unpleasant, unexpected situation, complimented by much lesser co star Memar, who manages to make the young hijacker strangely sympathetic as the two have to see it out to the end.It all has an independent, anti Hollywood feel to it, and it's all the better the more it feels this way. A highly worthwhile, pleasant surprise, that will restore your faith in creating genuine tension and emotion. ****"}, {"id": 424, "text": "Last seen on the big screen in 2016's so-so Oliver Stone picture Snowden, its been quite some time since we've last seen the ever likable Joseph Gordon-Levitt on screen.One of the most consistent and relatable actors working today, Levitt is always a solid presence, whether his front and centre or part of an ensemble, so any chance we get to see the actor ply his trade in a leading role is a good occasion for cinema fans.Returning to the film world after spending some time away with family, Levitt has given debut feature director Patrick Vollrath a solid foundation on which to build his airplane cockpit set thriller in, but this tension building exercise never gets off the runway as we instead rely solely on Levitt to help get us through.Playing 30 year old co-pilot Tobias Ellis, Levitt is given little backstory or material to work with as Ellis finds himself battling a group of violent terrorists who have stormed his plane and thrown his seemingly care-free route into disarray as the terrorists try to fight their way into the planes control room and enact out their devious deeds.A unique set-piece if not a unique set-up, 7500 fails to wrangle the tension or energetic direction needed to make such an isolated and confined story work as Ellis battles the various terrorists operating in his aircraft and try's to defuse the situation whilst managing to still fly the plane.Films such as Buried, The Guilty or Phone Booth, which all share similar DNA to Vollrath's Amazon distributed thriller all manage to use their small-scale locales or situations to build white knuckle tension or deliver shocking twists and turns but 7500 never does that, it plays a relatively straight bat and never deviates from a fairly predictable course that it sets out upon from very early on.It's a shame, as Levitt's solid work alongside a gripping script and unpredictable directing could've made 7500 a thrilling delight thousands of feet up in the air, but it remains grounded throughout, unable to take to the skies.Final Say -Joseph Gordon-Levitt tries his hardest with the little he has to work with but 7500 is a mostly thrill-free affair that is about as exciting as an airplane dinner.2 pieces of glass out of 5"}, {"id": 425, "text": "I hope all planes have a cockpit door that's as entry-proof as the one in this movie...the bad guys tried everything but a bazooka to get in there, but all to no avail. The only suggestion I have is for the airlines to consider adding an additional security feature or two: like a trap door that drops the would-be cockpit breachers straight through the bottom of the plane and into the atmosphere...and if that's not feasible (I guess the other passengers might object to being sucked out of the plane along WITH the bad guys), then how about some Indiana Jones/Raiders of the Lost Ark type of deterrents, that the pilots or outside crew can trigger, that shoot poison darts or taser-type electrical barbs into the high jackers? And while we're spitballing here, how about just cutting to the chase and making it standard airline policy to issue each passenger a fully-charged taser as they board? That, along with keeping an ample supply of handcuffs onboard, should put a quick end to anyone misguided enough to attempt to harm a plane full of innocent people! And as a side benefit, passengers would now have a proper, measured response to fellow travelers who irritate them by hogging armrests, reclining their seats to obnoxious degrees, or (personal pet peeve, here) ordering smelly fish during mealtimes...viola, problem solved!Oh, and the movie was pretty darn good, too.MFF/Hawaii 6-26-20"}, {"id": 426, "text": "This film hit Amazon last week and has a big star in Joseph Gordon-Levitt in it so I was interested, I have now watched 7500 and here is my review for the film. The premise of the film sees an American pilot forced to attempt to save his passengers lives when his plane is taken over by hijackers. Main Character As mentioned above Joseph Gordon-Levitt plays the lead character and he is just fabulous here, this is easily one of the best performances I have seen all year. The guy is just a movie star and he just nails it here, you feel so much sympathy for him and he manages to make you care about him in literally every scene that he is in. He delivers a very powerful performance and he carries this movie and drags every little bit out of every scene that is possible. Supporting Characters There is one of the terrorists that Levitt has to connect with and for a young foreign actor I thought he did a decent job. He does shout a bit much, but the film does a good job with his character as you see he maybe isn't into the terrorism as his older partners and that makes it an interesting scenario. I mean there aren't too many other supporting characters here but they all do good jobs and add to the emotion for Levitt which means they manage to do their job well. Story The story is really thrilling for me, the fact that the film takes place in just a cockpit of a plane adds to the intrigue as it makes you feel very clostraphobic and like you are stuck in with Levitt. This feels like a very real scenario compared to something like the Liam Neeson film Non-Stop which has a similar premise which is absurd. It takes it's time and puts you in the shoes of Levitt and makes it a character piece in a really intense film. But I felt like this film could have done a bit better with the terrorists motivations as it isn't explored at all. Also the ending is quite abrupt, I get why it is like it but I could have maybe done one or two more scenes with Levitt to truly finish his story. Script The script is great, there is so much fantastic drama and intense scenes that will leave you on the edge of your seat. I also love the fact that when some characters are speaking German there are no subtitles so we don't understand them just like Gordon-Levitt, it puts you in his role and makes you as confused by certain aspects which was a fantastic choice. Also when the humour is used at the beginiing of the film it does a good job in building the rapport between Levitt and his colleagues. Style This is one of the reasons I feel like this film has been criticised, it is methodical and a slower pace. Do not expect this high octaine action film, expect a slower intense character study that will grip you. But this film is 90 mins long and honsestly I could have done with an extra 10 mins which could have fleshed it out a bit more and raising the overall quality. Overall Overall, this might be the sleeper hit of 2020 for me, other people might not enjoy this film but I was gripped throughout. If you are looking for an intense slighlty slower thriller then 7500 is a must watch."}, {"id": 427, "text": "I suspect that like most frequent flyers, I approached this with more than a little trepidation... Unfortunately, it is too far-fetched pretty much from the outset, and I soon stopped worrying about onboard security and started wondering if Joseph Gordon-Levitt was auditioning for the Samaritans! The plot revolves around some would-be hijackers who attempt to storm the cockpit of a flight bound for Paris. After a bit of a battle we find ourselves in a bit of a Mexican stand-off with JGL trying to do what he can to land his plane and stop the terrorists from killing the passengers. Luckily, one of their number isn't quite so keen on a dying just yet, and so there is a glimmer of hope should our heroic pilot manage to talk him round... The whole thing looks like it was filmed in a flight simulator; and though the star does try to hold it together, neither he nor the dialogue are particularly convincing - especially towards the latter parts of the film, where there just doesn't feel like there is any real sense of suspense. To be fair, I am not sure that too much more could have been done with this - the story was almost as boxed-in as the pilot, and I thought it struggled to make it to 90 minutes."}, {"id": 428, "text": "'7500' is a movie that gathers all necessary elements that are vital to the scenario, adds breathtaking performances by all the cast, especially Joseph Gordon-Lewitt, confines viewers' imagination to the claustrophobic space of the cockpit, dreadful emotions choking passengers and pilots alike while their guts are being turned upside down under the heavy stress of the situation.It's a movie that depicts the sadness and hopelessness of a hijacking in its raw emotional form without the need of a big budget and flashy screenplay.It's a movie that rely on realism from take off to emergency landing, awesomely developing and providing first hand accounts of the protagonists and antagonists involved.It's a movie that shows the painful yet vital task of the police force and SWAT team, needing to work hand in hand, be synchronized, all the while relying on psychological factors in maintaining the so hard negotiations. A very underestimated yet very important part of a negotiator's job, who often puts all the power of persuasion that he's got on the table. That's shown professionally and in a right way in the movie.'7500' is a harrowing tale of events, told simply yet effectively, which hopefully will never take place again. It plays with viewers' minds on their fears of planes at one of its lowest psychological levels.Worth watching every minute of it. Well done and well performed."}, {"id": 429, "text": "Very intense (And you just never get a break!)No seriously; you NEVER get a break.This movie is clever in the way it utilizes stress-factors to get the viewer into the drama. It's completely relentless and will pound on you over and over and over until the movie ends.Having never been on a hijacked aircraft I can't speak of what it feels like, but my guess is it could be a lot like the tension in this film.That part works beautifully and is mastered close to perfection here.For the aviation-geeks; yes there are a few moments where you need to just go with the flow. But those moments are few and for the most part this is kept within sanity and reason.The actor-performances are all-around great and believable.The visuals are very good. Making flight-movies that look like actually flying is not easy, but this film pulls it off. No 'crappy' CGI is used and I'm guessing the director opted to avoid scenes that would be too difficult to get to look realistic (The; 'less is more' option) So no 'smart' outside scenes of flying aircraft or anything like that. For the entire movie we are 'along for the ride', onboard this hijacked aircraft, and get to experience the whole thing from 'within'.That raises the level of suspense really. Enhances the drama and makes the whole thing feel that much more 'in your face'.This movie is worth watching.Final note; had I been the pilot I would have dumped cabin-pressure and just let the hijackers pass out... and of course lost all the passengers at the same time too. I don't think I'm giving away any spoilers by saying that they don't actually do that in this movie :)"}, {"id": 430, "text": "Gotta be honest, I had absolutely no idea what this film was. Never heard of it or anything, which I think worked well in my favour, because it's pretty good.What's great is the accuracy of the story, I'm sat watching it fully imagining that this could happen. The performance from JGL was fantastic as expected as well, played the pilot really well. Clearly put in a lot of researchWhen I realised that the whole film is based from the pilots perspective I had mixed feelings, as it's great to see the hijacking side of things from behind the cockpit doors only, but I was concerned that there would be a lack of action due to the camera essentially being in the same room. But I think on the whole it worked out really well, kept me in suspense and was just a good story to watch. My only issue (not a major one) was that the ending was a little underwhelming. Obviously we all know the plane will land, but I dunno. Expected another 5 minutes or so after.But it's very good, a hidden gem that's sat on Amazon Prime definitely! Give it a watch."}, {"id": 431, "text": "If you enjoy reading my Spoiler-Free reviews, please follow my blog :)I'm a hardcore fan of one-location, claustrophobic thrillers. If the atmosphere is suspenseful and tense enough, it can elevate the film in unimaginable ways. I'm also easily entertained by movies set on a plane like Non-Stop or the classic Snakes on a Plane. 7500 spends pretty much its entire runtime inside the cockpit of a hijacked plane, going for a more realistic depiction of the point of view of the pilots. It combines two aspects that I deeply appreciate in film, making it a really captivating subgenre. However, is it any good?Story-wise, it doesn't truly create anything extraordinarily unique. Although I appreciate that it doesn't follow the over-the-top, absolutely crazy action sometimes displayed in this type of movies, which can be way too exaggerated, defying all laws of physics and reality. In this case, the viewer gets to see how things develop solely through the eyes of Tobias as well as his cockpit screen and audio. So, don't expect an action-packed flight because 7500 is far from that. It's a technically unusual take on a story told several times in many different ways.The best aspect of the film is the one I was looking forward to the most: the atmosphere. Patrick Vollrath, debutant writer-director, can generate enough tension and suspense to grab viewers for the first hour. Tobias finds himself with extremely challenging moral dilemmas, where there's no right answer, and all have severe consequences. Watching this part of the screenplay play out is the most exciting component of the movie, which is elevated by the fact that all occurs inside the claustrophobic cockpit.Joseph Gordon-Levitt, who has been away from the central spotlight since 2013's Don Jon, delivers one of the best performances I've ever seen from him. He keeps the film flying by continuously acting the hell out of his script. Without his emotionally convincing display, 7500 would crash into a thousand pieces. Omid Memar is also really good as Vedat, even though I find him a bit over-the-top during a few dialogues. Everyone else is kind of dispensable, having in mind this is a protagonist-centered piece.Technically, as I wrote above, it's different from the ordinary hijacking flicks. Besides the exclusive cockpit POV, it plays out very close to real-time, meaning that even though the movie has the common editing cuts, it feels like the ninety minutes are indeed ninety minutes. There aren't any long takes that I noticed, but the editing (Hansjörg Weißbrich) is so seamless that it creates a real-time environment, which helps to give the film a quite realistic vibe. Despite all of these qualities, 7500 struggles to stay above ground.The pilot's POV isn't captivating enough for a feature movie, at least not in the way 7500 tries to do. For a film focused mainly on the titular character, the latter lacks depth. Tobias's backstory is as generic as it could be, which doesn't help me care that much about him. The narrative follows a formulaic, predictable path that packs a couple of supposedly shocking moments, but these are so foreseen from the get-go that they lose some of the impact. It's a premise that allows for some nerve-wracking suspense, but overall the screenplay lacks a more profound exploration.In addition to this, the Islamic terrorists stereotype deeply hurts Patrick Vollrath's intent. It's been 19 years since 9/11. There's no need to make the hijackers constantly yell Allahu Akbar. The biggest sin of 7500 isn't the lack of character development, but their superficial, stereotypical representation (not only the hijackers). Hopefully, it won't get online backlash because it's far from being a bad movie...All in all, 7500 needs an impressive Joseph Gordon-Levitt to keep its cruising altitude, but it still goes through too much turbulence. Debutant writer-director Patrick Vollrath delivers an unusual take on the subgenre, by depicting the hijack of a plane exclusively through the pilot's POV. The claustrophobic, suspenseful, tense atmosphere of the cockpit allows for some genuinely nail-biting scenes, but its lack of character depth diminishes the otherwise emotionally compelling moral dilemmas the protagonist has to deal with. Despite the excellent technical effort, the narrative still falls into a predictable path, possessing the conventional plot points, which reduce the level of interest. The Islamic terrorists stereotype deeply hurts the film since there's no need to make the hijackers belong to that religion for the hundredth time. I might recommend it to anyone who's looking for an airplane thriller. Just don't expect a brilliant execution.Rating: C"}, {"id": 432, "text": "I went into 7500 with low expectations as an experienced airline pilot with over 15 years flying the particular aircraft featured in this film. I find most aviation movies are over sensationalized or somehow miss the mark. Even Sully, which is by all accounts a good film, doesn't replicate the flying experience despite its technical accuracies. 7500, however, is able to reproduce the atmosphere of the working environment of an airline crew. From the dialogue with ground staff to the perfectly engineered sound effects, the setting almost made me able to smell and feel the airbus 320. Furthermore, in the lead up to the drama, the director somehow was able to capture the pace of the day and portray life as an operating Pilot.Once the drama unfolds, I can't attest to the realism. But it does play out harrowing questions I've asked myself when I allow my thoughts to ponder terrible hypotheticals from time to time.Through the film, despite being set in my native setting ,I was reminded of the claustrophobic tension I only felt while watching Buried. The combination of these two factors meant this film left me profoundly impacted and thinking about it for days.Perhaps the drama plays out too long and the realism does loosen slightly as the pilot prepares to land, but don't let this detract from the masterful portrayal of modern civil aviation. This is a must watch for aspiring pilots."}, {"id": 433, "text": "7500, without a doubt, offers an action-packed story which will leave you tensed without disappointment. Throughout the film, Joseph Gordon-Levitt gives a stunning performance and illustrates the character of airline pilot Tobias Ellis exceptionally well. Furthermore, the performance of Omid Memar who performed as Vedat executed an influential role of a troubled boy who demonstrated strong emotions and unquestionably kept the mind wondering throughout the film.Moreover, the framework of the film was fantastically set out and even still with it set just in an aircraft, it supplied a chilling atmosphere which left you suspecting what happens next. Additionally, the story itself is well formulated, though in some scenes it drags along too much, yet, more action could have been implemented where possible.Overall, the film was great and had well-built up scenes throughout. Yet, the ending was frustrating and could have provided a more in-depth understanding of what happened afterwards. Nevertheless, I would still recommend this film to anyone because it is positively a surpassing film."}, {"id": 434, "text": "I have a soft spot for films which are set in mostly one location, as well as films which put the characters in a dangerous situations. 7500 blends both of these elements together, and managed to create a hyper-realistic film.Joseph Gordon-Levitt is one of the most underrated actors of this generation, and he was terrific in this film. He managed to pull of all of the emotional scenes, and we believed the terror that the character was in because of how phenomenal Levitt's performance was.7500 was an extremely tense film, and, like I said, extremely realistic. It takes the same premise as a film like Non-Stop, and portrays it in a way which we could actually believe would happen. Whilst I appreciated this about the film, it also meant that the narrative wasn't as entertaining as it could have been.I also liked the fact that it all took place in the cockpit of the plane, because it really gave the film a claustrophobic feel. There are some moral questions which Levitt's character has to answer, and I enjoyed the way it was presented because it's asking the audience what they would do in his situation.It sounds like I am praising 7500 too much for the score I am going to give it, but it's just not as entertaining as I would have liked. The film is exceptionally well made, with tense scenes, slick direction, and a few emotional moments which worked, but it's also a film I will probably never rewatch.I like films of this genre to have a bit more entertainment value, but I appreciate the craft that went into it. Overall, 7500 was a decent one-time watch, and a recommendation from me.SCORE: 68%"}, {"id": 435, "text": "I'm not sure if there is an IQ table of Hollywood stars, but I would reckon if there is then Joseph Gordon-Levitt would rate pretty highly. Whenever I see him interviewed he comes across as a highly articulate and intelligent bloke. And that intelligence filters through into his choices of movie role. If you look back at his filmography on IMDB the first thing you notice is that his output is pretty sparse and selective, and the next is that the projects he's done mostly deliver a pretty strong hit rate: 500 Days of Summer; Inception, Looper, The Dark Knight Rises; Don Jon.... the list is impressive.Here he stars (and really stars) in a small German film. It only had a $5 million budget and in some ways it shows: the speaking cast totals about a dozen; the single location used is the cockpit (an Airbus A320 simulator somewhere? Or a set? The production design is so good, it's difficult to tell) ; and the score is so minimalistic (a solo piano piece over the end titles) that it doesn't even merit an IMDB music credit!But in many ways this is a case of 'small is beautiful'. For this is an extremely tense and claustrophobic action picture.The Plot: German Captain Michael Lutzmann (Carlo Kitzlinger) and American Co-pilot Tobias Ellis (Joseph Gordon-Levitt) are about to pilot an Airbus A320 on a routine flight from Berlin to Paris. By coincidence, also on the flight is Tobias's partner and mother of his son, stewardess Gökce (Aylin Tezel). Shortly into the flight, three terrorists - Kenan (Murathan Muslu), Daniel (Paul Wollin) and youngster Vedat (Omid Memar) - take over the aircraft. Tobias issues a 7500 (hijack in progress) code. All that is protecting the injured pilots and the security of the 80 people on the flight is the cockpit door.The film starts slowly, building atmosphere through the pre-flight chit-chat between the pilots and a leisurely take-off. I loved this development of character by Oscar-nominated shorts director Patrick Vollrath. But when the action starts, it starts with a bang and continues in truly tense and visceral style. There's a sense of creeping dread when you realise the terrorist's use of hostages to get the door open, and of who the hostages might be.I note that one of the thanks for the film was director Paul Greengrass, who of course made the outstanding 9/11-themed United 93 back in 2006. It would be fascinating to understand whether this was a thank-you for the inspiration the classic film gave Vollrath, or if there was some practical consultancy undertaken there.Star of the show here is Joseph Gordon-Levitt who delivers a peerless performance as the pilot under extreme stress. Veering cyclically through terror, emotional breakdown and calm 'training-kicking-in' modes, it's a performance that is almost Oscar nomination-worthy in my book. He's on screen for virtually every shot of the film, and really earned his fee here. He makes for a very believable pilot.I've read other comment that says the terrorists are rather 2-dimensional in their attempts to do a 9/11. And to a degree I agree. A nice angle though is the relationship that develops between Tobias and young Vedat in the second half of the movie. There's a 'Stockholm Syndrome' vibe going on here, but this never quite gets resolved satisfactorily.As such, unfortunately this 'back 9' never really quite lived up to the promise of the first 45 minutes for me. And as a single-location story that had nowhere else to go, the abrupt ending will not be to the liking of some I'm sure.Not to be confused with the 2014 horror Flight 7500, this is for once a B-movie that's real nail-biter. The movie doesn't pull its punches, and although there is little of the more graphic violence actually shown, the mind can fill in the gaps effectively which makes for some upsetting moments. Although it never quite lives up to its early promise at only 93 minutes it is strongly deserving of your attention. The movie is available for viewing via Amazon-Prime.(For the full graphical review please check out One Mann's Movies on the web or Facebook. Thanks.)"}, {"id": 436, "text": "7500 was recently released on Amazon Prime. I watched it. Here are my thoughts.7500 is a thriller about a plane flying from Berlin to Paris that gets hijacked by some Islamist terrorists. If you haven't rolled your eyes already, then you should be good watching this.Joseph Gordon-Levitt stars as the young co-pilot on the flight who has to fight the hijackers and get the passengers to safety. The film is directed by Patrick Vollrath who co-wrote the script with Senad Halilbasic. As you can tell by the short synopsis, the script isn't very important. This film is all mood and tension. It does that really well. When characters are actually talking, it is more cliched and less successful. Gordon-Levitt acts out panic well and he summons that adrenaline-fueled bravery that is needed in this situation. Since he spends most of the screen time alone, his ability to convey a sense of dread is important. It is impossible not to feel that.This setting in 7500 helps keep the tension high. The majority of the film takes place in the cockpit. Gordon-Levitt's character can only see what's happening in the rest of the plane from the security camera in the cockpit. The helplessness adds to that sense of dread. The good editing and the runtime of 7500 being less than 90 minutes makes it feel even more urgent. Realistically though, why was this movie about Islamist terrorists hijacking a plane being made and released now? It feels like it is 10 years or so late, and the story of the hijacker and the hijacked has not evolved any sense even those same movies from the 1990's. 7500 doesn't bring anything new to this story.If you have less than 90 minutes to spend, 7500 isn't a bad way to spend it. It is very tense and it flies by in a clip. There is nothing new about the story, but Joseph Gordon-Levitt give a good performance. A handful of popcorn will do."}, {"id": 437, "text": "7500 Review For the first half I was sitting on the edge of my seat; a great thriller. Joseph Gordon-Levitt was great as the co-pilot as was the age 18 terrorist (Omid Memar). I was so caught up in its anxiety, at times I had to walk away and not watch the screen while listening. Like all good thrillers, I found myself screaming at the characters on the screen, Don't open the door, Don't talk to them, Turn off the camera, Stop crying, Pay attention to the other guy! as the action ensued. As things became totally out-of-hand for the co-pilot, I was beginning to feel like C-3PO; doomed. There came the time, however, that I started screaming at the terrorist, Don't do it, don't do it! as the obvious ending approached. Instead of looking at this as a script weakness, I found that the director did an excellent job making the audience feel that they were actually in the cockpit and taking on the lives of the two antagonistic characters. I don't think any adult, much less young adult, would exercise common sense when under that kind of internal, external, religious, and family pressure. The script did call for the co-pilot to calm the terrorist through some personal sharing but stopped short of helping him see there was another way out. You have to pay close attention but this movie showed us all we needed to see, despite the sudden but expected ending."}], "reviews_amount": 438}