{"name": "Summerland", "titleId": "tt06841122", "reviews": [{"id": 0, "text": "An endearing and easy going tale of a cantankerous lass who gradually comes to terms with the cards she's been dealt when a wartime evacuee lands at her shore. Perfect Sunday afternoon family fare."}, {"id": 1, "text": "I rarely write reviews, but was alarmed to see this film have such a low rating. This film has amazing acting; everyone truly is their character. Gemma is Alice! It is a sweet story among an unsweet time, and beautiful scenery will take your breathe away. I truly loved it!"}, {"id": 2, "text": "From the word go this movie is highly captivating. it engulfs and is a full-onFull emotional rollercoaster going from anxious across to happiness. Seriously well made movie."}, {"id": 3, "text": "This movie was a heart-warming tale of how love can find its way back. The main characters were so very well portrayed. I so needed this break from the cruelties of reality. The young man who played Frank was exceptional. It was a very clean and wholesome film, and anyone who finds issue with the content has to be a close-minded individual."}, {"id": 4, "text": "Summerland is simply the most beautiful movie I've seen in ages. It's stunning. The story, the characters and the happy ending. IT'S EVERYTHING I'VE EVER WANTED!!! So so beautiful! I legit can't stop crying, but they are happy tears. My heart feels all warm and cozy and happy after watching this movie! I'm ready to rewatch it over and over again."}, {"id": 5, "text": "Everybody in this film was just great. Gemma Arterton, as always delivers. To me - it's a 10."}, {"id": 6, "text": "I watched this for one reason alone: Gemma Arterton. However instead of enjoying looking at her,m I was transfixed by her character. She reminded me very strongly of a character in a Diney Costeloe movie. The dialogue is a bit weak in patches and the direction is lacking in a big way. This would be a blockbuster movie had direction and dialogue been better. However, the cast, mainly Arterton, floated this story right through my emotions and from a quick look at a beautiful lady, it turned out to be an immersion in a beautiful tale. Bring out your happy, watch this film."}, {"id": 7, "text": "Just what the world needs right now, Summerland is the perfect tonic to post lock down life! Go and lose yourself in this charming world."}, {"id": 8, "text": "I'm Writing this review in response to another review that gave this film a one star quoiting Dreadful That was without a doubt one of the worst films I've seen in a long time Firstly it's a film not films.Spoilers This is a heart warming story of a woman that takes in a child during the evacuations of world war 2.without her wanting to, as she would rather be left alone to continue her work.However a bond appears between them and a understanding of each other As she was in a love with a woman she ask frank what he thinks about that and he gives her acceptance stating he is OK with it which surprises Alice because at that time it was frowned upon to love the same sex.That's all I'm saying about the storyAs for poor production and costume I'm guessing this individual has never seen 1939 1945 rural style before maybe because its a war film they were expecting soldier uniforms, bullets, planes and bombs?It's a rural part of England it's not like they had designer clothes shops around the corner.This story is about civil life that some civilians that lived in remote countryside areas had to endure during those horrific times. Including accepting responsibility of children from London and other cities the luftwaffe were bombing. Its a story of love, compassion, acceptance and discovery.If you want action watch another film. if you want a clean story with a bit of drama/romance this is for you and If you have an open mind then I think you will enjoy this movieIv'e obviously missed a lot of the plot out for your benefit but I will say the casting and acting is on point"}, {"id": 9, "text": "This is a beautifully shot film with some of southern England's prettiest scenery using some skilled cinematography. The acting is pretty good too, and it holds the entire thing together. But the anachronisms and historical inaccuracies (evacuation starts 1st Sep 1939, war declared 3rd Sep 1939, blitz starts 7th Sep 1940, and that's just the beginning) are ignorant and laughable, detract immensely from the story for me, and left me wishing I didn't have such a clear knowledge of WW2 chronology and history."}, {"id": 10, "text": "'Summerland' has some of the most beautiful filmed scenery you could imagine. This lulls you into a sense that this is going to be one of those 'nice' films with little substance. Well the 'cutaway' scenes that begin recurring in the first half of the film might tell that this is not the case, and the second half of 'Summerland' is much faster paced with one almighty twist to the story.Stay with it, it's well worth it."}, {"id": 11, "text": "At first I had trouble relating to the character and their dialogs, both unbelievable but I loved the cinematography and the splendid images. However i found this too cheesy to be aired at my favourite repertoire cinema. This rivals with the hallmark network."}, {"id": 12, "text": "A sweet, good-spirited film to be sure but predictable (for the most part). The bookend pro- and epilogue, besides being cliched, add so little to the main story as to be superfluous. Better more time had been spent on developing a more nuanced protagonist, here simplistically drawn with broad strokes. And far better we understand that character because the flashbacks were also more developed as well. Love Ms. M-Raw and developing their love and the deeper issues that tear them apart, would have added much greater resonance to the main story. Not surprised it was an original screenplay and not based on a novel -- which might have given greater depth and reality to the story."}, {"id": 13, "text": "Most of the story here is during the 1940s England, WW2 was raging and British cities were being bombed. To help preserve the children many were sent to live with families in rural areas less prone to the warfare. But the story also includes flashbacks to the 1920s and finally ends in the 1970s.The single lady, an author, is surprised when she is brought a young boy, perhaps 12 or so, to live with her. She was irate and unwelcoming, she was sure there was a mistake. But slowly the boy wins her heart and only near the end of the movie does she fully realize why she was chosen, as the only one the mother back in London trusted would take care of him.It is a good movie, well-filmed and well-acted. My wife and I watched it at home on DVD from our public library. The title is a reference to a fictitious place that is sort of a pagan version of where you go when you die."}, {"id": 14, "text": "If you are going to do a LGBT film, and want to turn a profit, this is the way to do it. I, certainly was tricked.Good acting. Good, pretty much all around."}, {"id": 15, "text": "Amazing, beautiful movie with an unexpected ending. Beautiful filmmusic too. Deserves an Oscar according to me."}, {"id": 16, "text": "I was prepared to love this film because I really like Gemma Arterton and I love English films, in particular ones related to WWII and that time period. But alas, it wasn't to be. A couple of things got in the way of it being really great, the first of which was the relationship between Alice and Vera. Shown in flashback snippets, they seemed to me artificial, contrived, and unbelievable. Perhaps it should have been done differently? For example, without flashbacks but chronologically. Then when Alice learned that David's mother was Vera: another thing that to me was unbelievable. And, finally, the use of different actors to play Alice and Vera when they were older. This didn't work at all for me. In fact, it seemed ridiculous. Why didn't the director, or whoever decides these things, have Gemma and GuGu be made up to look older? That would have worked so much better.I did give it a 7 indicating there were good things about Summerland. It's a sweet or bittersweet story. The relationship between Alice and David is touching - and believable, and both of these actors were excellent. There are beautiful shots of the coastline and the rolling hills in the English countryside. And, I enjoyed the character of Alice: a rebellious individualist and writer. Overall, I'd say it's worth seeing."}, {"id": 17, "text": "This story is beautiful in every way. From the scenery, to the cinematography, to the selfless act of taking in children from London, and to the forbidden love that transcends time. I love every bit of this film!"}, {"id": 18, "text": "That was without a doubt one of the worst films I've seen in a long time. Poor production values, More than a bending of the knee to PC, poor costume and sets, and lets not get into poor Franks hair!!!!!!! continuity should be sacked,perhaps they were?? and using the woolly hats didn't hide anything. The whole cast and crew, wrap report, should read, must try harder."}, {"id": 19, "text": "I was trying so hard not to be like this, and it was just like that, especially in the end, the honey was awkward, but Alice and Frank were very comfortable with each other, and I really liked it."}, {"id": 20, "text": "This is only the second time I've reviewed a movie but felt compelled to do so. Beautifully shot, well acted and a thoroughly enjoyable if not easy watch. The scenery is gorgeous. If you want to watch an easy going feel good movie then this comes highly recommended."}, {"id": 21, "text": "Watching this movie was such an amazing and beautiful experience. The story gripped me from the start and I didn't get bored at any moment. The music and scenes blend so well that it totally feels like I was absorbed into a world of artistic bliss. The cinematography was moving. All actors are amazing, especially Gemma Arterton. She gave a fabulous performance. Will totally recommend it to anyone who's looking for a sentimental and beautifully written story."}, {"id": 22, "text": "Gemma attracted my eyeball all the time in this movie. From anger, joy, loving, frustration, to sadness, she just nail every emotions. She have a neighbor girl looks but just excellent the way she acted. Awesome !"}, {"id": 23, "text": "Absolutely Loved this movie! The atmosphere, cinematography and soundtrack were so beautiful. And I'm so  happy they got to grow old together &amp; have a happy ending.it reminded me of carol, being a sapphic period movie -Also the kid who plays Frank is so talented."}, {"id": 24, "text": "Watching this film online (my monthly freebie from my bank) provided a pleasant escape from the harsh realities of the Second National Lockdown, but it was spoiled by the inevitable intrusion of 2020 woke values in a film supposedly set in a quite different era. Not only was the love of the central character's life rather unrealistically a woman of evidently mixed race, but near the beginning this particular pc lily was gilded by the equally unnecessary casting of an Indian woman and her child for their brief appearance as customers in a village shop in deepest east Kent. And in the early years of WW2 would a well-grown boy of 11 or 12 have been automatically consigned to the back of the car when the front passenger seat was unoccupied? (It was difficult to work out how old he was in fact supposed to be; the one piece of class instruction we saw was more appropriate for children of 7 or 8.)"}, {"id": 25, "text": "Just returned from my little local independent theatre after seeing this. Firstly, it wasn't what I expected at all from my interpretation of the synopsis, but I'm very glad I didn't let this one slip by.The script has not fat - every character contributes to the telling of the story and the lead actors deliver their characters in an understated but highly engaging way.If you want to see a good uplifting story told well, then don't let this pass you by."}, {"id": 26, "text": "Dissapointing. Felt like a total waste of watching time. Didn't like any of the characters. Shame."}, {"id": 27, "text": "At the beginning of Words War II London was heavily bombed by German planes and the children were evacuated to the country where local families took safely care of them. Frank (Lucas Bond) as one of those little boys who was sent to Alice's (Gemma Arterton) home without her consent which makes their relationship a bit uncongenial and disagreeable in the beginning but the nice bhaviour of the boy finishes by conquer her friendship and love later on. A tragic incident occurs meanwhile when the boy's father who is a war pilot is killed in combat and Alice fails to tell it to Frank which provokes a strong reaction from him when he knows it from someone else. He runs away to London and Alice runs after h im there and manages to bring him back home, The movie has something like a happy end when the boy's mother appears to them and she was Alice's lover since Alice is gay. Alice didn't know that her lover was the boy's mother though it was she who sent the boy to her care although confidentially. This puts the three together on a nice relationship. Not being a masterpiece this is a good movie anyhow due the excellent performing of all performer namely Lucas Bond in the role of Frank."}, {"id": 28, "text": "My wife and I saw this in early August at one of our independent theaters, coming out of covid-19 lockdown. We joined a couple of dozen other viewers, socially distanced and masked up. I can't help wondering how the theaters are going to be able to turn a profit with this new normal.This lovely film is a great starring vehicle for Gemma Arterton, who's become one of my favorites. Still in her mid-30's she's moved on from playing young attractive add-ons in fantasy films (Clash of the Titans, Prince of Persia, or the crazy splashy fun of Hansel and Gretel: Witch Hunters) and has built a growing and varied record in films playing lead roles in smaller-scale personal dramas like Tamara Drewe, Gemma Bovary, Vita and Virginia, Their Finest, a great Saint Joan at the London National Theatre, and more. Can't wait to see her in the upcoming King's Man.In Summerland she plays Alice Lamb, a prickly and reclusive writer who (during WWII) is researching the mirage-like atmospheric phenomenon called the Fata Morgana. To her surprise and much against her will she is saddled with looking after young schoolboy Frank (Lucas Bond) who, like many other wartime children, has been sent out of London to the provinces to stay safely out of the Blitz. Frank is a basically good-natured kid who's not put off by this apparently crusty old lady, and the main arch of the plot follows their developing relationship into one of mutual love. Flashbacks to Alice's pre-war association with friend (and more than friend) Vera (Gugu Mbatha-Raw) are shown that fill in much of what we need to know about Alice. In the meantime, Frank strikes up a close friendship with a classmate Edie (Dixie Egerickx) as they follow their natural kids' imperatives to explore everywhere around their little town and seaside.Those are just the basics, but the last third of the film goes beyond what I just said into more unexpected territory. Two or three major twists are coming, at least one of which is sort of predictable but at least one of which is certainly a surprise. But viewed from the end of the film looking backward, it makes sense. There's no cheating and nothing arbitrary. It's a much more complex story that it at first appears, it's well structured, and (especially) it's nicely paced. The scenery (the white cliffs and windswept meadows of Dover) has a role to play too, but it doesn't intrude on the story. No spoilers -- just go and see it to experience what I mean!The two kids (Frank, Edie) are great: they're more than just placeholders filling in the gaps between the adult interactions in the story. Tom Courtenay makes a supporting appearance as an endearing, kindly schoolmaster. But this is Gemma Arterton's movie, make no mistake. She's grown into a masterful actress who (like all her recent parts) disappears so totally into her role that you're not even aware that she's acting. She has Oscar-level skill. But without getting involved in big-budget big-publicity roles I'm not sure she will ever get one. Nevertheless, what she's giving us is art at a high level all the same. The Brits seem so expert at crafting these types of movies -- warm, low-key, compelling personal stories with great casts and a sense of history. We could do a lot worse than get more of them."}, {"id": 29, "text": "This Directorial debut by Jessica Swale offers the viewer some main takeaways-Very strong acting from lead Gemma Arterton. A real powerhouse of an actor that one can see welcoming an Oscar into her home sometime in the next coming years. Arterton manages to captivate the character Alice smoothly for the entire length of the film not once losing the viewers interest to learn more about what makes her tick. Also, Swale offers a cast of adults and children that work together very well with chemistry and comedic timing. Lucas Bond and Dixie Egerickx have a strong future in film and stage ahead of them for sure! Plus, a production team that makes a visual impact using set designs, scenery and colours to hold the greatest cinephiles attention to even the smallest of details like the red push pins Alice uses on her boards. The story is one of magic, family, love and loss with possibility threading it all together. Where it missed being a 10 out of 10 for me was the relationship aspect with Gugu Mbatha-Raw for I would have like to have seen her acting abilities a bit heightened instead of simply radiating beauty. At the climax of the film, her acting tended to be a bit rehearsed and the lines flowed without expression yet Arterton surely makes up for anything that might be out of sorts. The cinematography is beautiful. I highly recommend and am just being picky yet I really respect this film and am so glad it was made. Well done."}, {"id": 30, "text": "After giving up on finding decent films in 2020, I came across the trailer for Summerland on Youtube and it pricked my attention as I find both Gemma Arterton and Gugu Mbatha-Raw both very engaging actors.I'm so glad that i ended up buying Summerland as it's a film filled with emotion, tenderness, strength and vulnerability. As yes the film has a plot of Lesbianism, but it's so well written that it is never the main focus of the film, (as with a lot very woke films) because the story is about love, tenderness and eternal hope.Gemma Arterton really switches it up her role as Alice and one why you can see why she is a leading lady, her ability to convey so much emotions in her eyes and expressions are that of someone that really knows their craft.Gugu Mbatha-Raw, even though isn't in the film much, (like with most of her roles) but when in a scene she really does shine and radiates.If you want to get away from all the craziness of 2020 and watch a film that engages you, fills you with emotions and gets right back to humanity, I can't recommend Summerland highly enough."}, {"id": 31, "text": "Greetings again from the darkness. We get our first glimpse of Alice Lamb as an older woman in 1975 pounding away on her Royal typewriter before abruptly and rudely shooing neighborhood kids away from her door. We then flashback thirty-something years to World War II, and find a younger version of Alice still clacking away on the same Royal and still chasing off the local youngsters. Segments with the older Alice bookend the film, but most of our time is spent with the younger Alice in the first feature film from writer-director Jessica Swale, a renowned playwright.Gemma Arterton (QUANTUM OF SOLACE, 2008) plays younger Alice, a writer and researcher based in the countryside of Kent. She's not just a reclusive writer, but we learn she's holding a grudge against the world ever since she was denied true love while at University. The townspeople view her as antisocial, while the local kids refer to as a witch. When the local school Headmaster (Tom Courtenay) refers to her stories, she quickly corrects him to Academic Thesis. It's no wonder she's earned the label, Beast on the Beach.During the German Blitz, many London families sent their kids to live with families in the much safer countryside. One day an official brings young Frank (Lucas Bond) to Alice's home for temporary guardianship, and she responds I don't want him ... yes, in front of the boy. Frank's father is fighting during the war, while his mother is working with the ministry. Of course, we know that Alice's iceberg of a heart will eventually thaw, and it begins when Frank expresses an interest in the legends and folklore at the center of Alice's research. Of particular interest to Frank is Summerland, the pagan term for afterlife, and the corresponding images.As an evacuee, Frank is a bit of an outsider at school, but he makes friends with Edie (Dixie Egerickx, THE LITTLE STRANGER, 2018), a spirited young lady who, like most kids, doesn't much trust Alice. It's interesting to watch as Frank and Alice reluctantly grow closer, but this is war time, and joy is sometimes difficult to come by. However, this odd couple seem good for a life lessons to the other.Penelope Wilton plays the older Alice and Gugu Mbatha-Raw lights up the screen in only a few scenes, and it's Ms. Arterton's best work since TAMARA DREWE (2010). Young Alice experiences visions and memories of a past life not meant to be. The twist is quite obvious, yet no less effective. Ms. Swale's film is sentimental and melodramatic, and probably employs a few too many clichés. Yet, although predictable, it does offer hope; and given the times we are in, a hopeful message is quite welcome - as is the reminder that stories have to come from somewhere."}, {"id": 32, "text": "Summerland is a beautiful story told beautifully. Interesting and funny characters; gorgeous backdrop setting; and a sentimental heartfelt story. I couldn't help to notice how much the actor, Lucas Bond, has a strong resemblance to another UK actress Millie Bobby Brown. I kept thinking throughout the film if this was Millie Brown playing a boy earlier in her career or was Lucas Bond a younger sibling of hers. The resemblance is uncanny.As an American, I find the rural country and coastal landscapes of England so very pretty. I prefer British movies like this more so than films with a London setting. Perhaps because I am a New Yorker, London resembles too much of New York for my taste as I now live near the Rhode Island shore. This film just felt like fresh ocean air on a sunny day. Very relaxing.I loved Gemma Arterton character. She had me laughing at how much of her personality is much like mine in real life. As a New Yorker, I can be brutally honest whether someone likes it or not and I never been one to care about the opinions of others. I don't go around hurting other's feelings. But sometimes can inadvertently blurt out my absent minded opinions. Foot in the mouth syndrome I guess. Alice felt like the female version of me. More focus on my work and hobbies than to live my life based on other's opinion which has gotten me into trouble over the years. I honestly think it is exhausting to think any other way and not sure why people trap themselves in such mental prisons. But I survived the repercussions even if I did get some scars as a result.Frank on the other hand is another breath of fresh air for me. When I was a child myself, children were expected to be as respectful to adults like Frank was and I admired that in him. Considering what he was going through, the trauma of being upheaval from his home into the custody of a stranger that doesn't particularly care to have him around. The difficulty of wondering about the safety of his parents during the war. Not to mention the news he receives later in the film. My heart bleed for this child. I really loved the dynamics at play between the characters and how it evolves. How Frank softens Alice's heart is very beautiful.The only thing I wasn't crazy about was the relationship between Alice and Vera. I don't think it was necessary to add this to the story. But it is 2020 and it seems every film has an obligatory same sex relationship (aka PC virtual signaling). But at least it was done discretely and tastefully, not overblown with a Hollywood style sex scene. The film director kept it tasteful so it didn't harm the film. She directed the film demonstrating good aesthetic judgment instead of graphical shock value.All in all, I really liked the film and I would recommend it. I did love the twist at the end of who Frank's parents really were. That was absolutely lovely and unexpected."}, {"id": 33, "text": "Summerland is a new war drama directed and written by Jessica Swale. This is the first major film she has directed and written, as she has only directed short films before.The film is set during the Second World War. To work on her writing, Alice (Gemma Arterton) retreats to the seaside cliffs in Dover in southern England. In her solitude, she tries to work on important books about the scientific proof that myths and magic don't exist. When she opens the door one day, she is asked to take care of the runaway boy Frank (Lucas Bond). Alice tries to take care of Frank, but prefers that he go to another hiding place as soon as possible, so that she can continue working on her books. Despite the fact that she tries to be aloof towards Frank, a bond between the two develops thanks to his innocence and curiosity. In this way she is confronted with her past and she learns that she may have to experience her life in a different wayThis film has a beautiful and emotional story about how people try to hide their emotions and feelings in difficult times. Without this really helping them. Despite the fact that at a time the film seems obvious, it still keeps a beautiful and inspiring story. Jessica Swale has beautifully juxtaposed the scenes of the main character where the film jumps from the now to the past.Director Jessica Swale and photography director Laurie Rose, have also portrayed many scenes and places of the film in a nice and fitting way. The sea cliff of Dover comes across as a summer location where you can forget your problems for a moment.The acting is also done well by the cast. Gemma Arterton comes across as the Oscar-winning role that Jack Nicholson played in the 1997 film As Good As It Gets in this role. Together with Lucas Bond, she has a good chemistry that changes her character throughout the film. In the Flashback scenes, Gemma Arterton also has a good chemistry with the character of Gugu Mbatha-Raw who plays an old friend of hers in the movie. Dixie Egerickx also comes out well in this film as a friend of Lucas Bond's character. She shows with this role that she can be a good young actress if she has a good script to work with. In the same weekend she was also seen in the movie The Secret Garden where she came across as too negative because of a less script."}, {"id": 34, "text": "Ordinarily a formulaic melodrama like Summerland would be chock- full of sentimental claptrap, and it is. However, you'll enjoy the sentiment and the real human values so much that you'll forget the formula and remember li as a warm treatise on love, womanhood, and sacrifice. It's that good despite its predictability, and maybe because of it, given the tears I secretly shed.Alice (Gemma Arterton), a writer living alone during the blitz phase of WWII in the Dover, East Sussex, Kent coast of England, has a young London evacuee Frank (Lucas Bond) thrust upon her under the spirit of We all have to do our part. Although it's hard not to know exactly where this is going to go (Frank's not going anywhere), Arterton is so convincing as an introverted writer who actually needs his distraction that we accept her transformation without rolling eyes. It's just good old heart-endearing storytelling.First-time director Jessica Swale does an expert job of bringing in Alice and Frank's baggage by flashback, especially Alice's former love Vera (Gugu Mbatha-Raw). Alice still loves Vera despite her abandoning Alice to have a baby. While this past seriously impinges on the present, Swale never lets us forget the natural goodness of where they live and the war that must be won.The love that binds, right down to Frank's friend Edie (Dixie Egerickx), is everywhere despite the dark cloud of war not far from the coast. Cinematographer Laurie Rose captures the stark, lonely beauty of the coast without letting it become the centerpiece. Rose's ability to make the landscape both forbidding and romantic reflects the ambivalences in Alice's rich, complex character.Although Alice makes mistakes such as treating Frank badly as an annoyance while she's writing academic treatises no one will read or refusing to tell Frank about a parent's death, her capacity to love steals out from her to make her a charming, sympathetic character, not a witch as the locals figure her to be. Summerland, an allusion to a mythical world attractive to Frank and any other pre-teen, is a lovely romance that comes at a time for us when life demands sacrifice, patience, and unconditional love. As Alice reminds Frank, Life is not kind; anguish is inevitable."}, {"id": 35, "text": "Summerland - 2020 - 9.0/10 - A-minus - This is a tender airy beautiful very light but sweet story like a Hallmark movie and it's exactly what I needed right now. It had the worst possible luck getting released right now but man it's a damn good thing this was made. Very nostalgic and it reminds me of a feeling like a memory or a dream I once had but can't quite remember anymore. Couple of small quibbles with a couple of shot choices like the angle of the only brief kiss in the film was a bit off and some of the story beats maybe I would've done differently but I can't really complain because, aside from hindsight being 20/20 and being an armchair general is easy, this is for the most part a beautifully shot film set in the English countryside during WWII far away from the Blitz in 1940's London and I'm reminded that these people are going through something somewhat similar to what we're going through now in that whatever is happening it's civilization defining and the world will never be the same. There's also a faint sense of your own mortality hanging in the balance and a feeling that you shouldn't be wasting your life and you should be living it. Well done for a 90 minute PG rated family movie I mean wow 😂👌🇺🇸🇬🇧. Gemma Arterton carries almost the entire film and she plays a woman named Alice who's a writer that the whole town thinks is an unfriendly weird witch lady but underneath the prickly exterior she holds back the pain of having lost her one true love in life Vera back in the 1920's played by Gugu Mbatha-Raw who delivers her best performance since the legendary San Junipero episode of Black Mirror. Alice gets drafted and stuck with having to host a boy who is an evacuee from the Blitz named Frank played by Lucas Bond who is pitch perfect for this as is his precocious friend Edie played by Dixie Egerickx. She goes from trying to reject him outright to falling in love with being a mother. I don't want to give away the rest but expect a Hallmark movie vibe and some tear jerking and happy endings. The director is Jessica Swale and this is her first film which is remarkable given the level of quality so bravo to her she definitely has a future doing this. She captures the cliffs of Dover with loving attention to detail using this wide panoramic shots and makes very good use of aerial drone photography when needed but she knows how to frame intimate closeups. This is exactly the kind of movie I really needed right now given the state of the world and I'm sure I'm not alone in this. It's also a family movie that you can easily watch with your parents and while a lesbian film like Portrait of a Lady on Fire might be a god tier cinematic experience which I absolutely recommend people to watch at least once before they die it might be uncomfortable to watch it with your folks because of the sex scenes. This film won't be I mean it's rated PG so feel free to enjoy it with the whole family."}, {"id": 36, "text": "Oh dear. This was our first venture back into the cinema since the easing of the lockdown and perhaps we were too eager to see something - anything - and should have been a little more discerning in our choice.Like much of the film industry this movie now reflects a PC wokeness that precludes accurate historical referencing. Sadly, it holes a film below the waterline as the viewer can feel preached to. The character of the 10 year old girl, Edie, is so 21st century post-modern feminist that the message incoming alarm gong goes off more than once with the words that no child of that age or that period would ever come out with.I can't really elaborate on the plot holes without revealing spoilers but one has to question how Alice drive around the countryside and up to London on what would have been very limited petrol supply. Chasing a train in a car from the Sussex coast up to London and then supposedly arriving at Victoria station at the same time? Give me strength.The surprise ending was flagged up way before I was enmeshed in the sentimental mush that was washing up on the shores of this offering. Gemma Arterton portrays a character that, despite everything, remains unsympathetic. Tom Courtenay who is making a specialisation in late life bumbling sweet characters also stars."}, {"id": 37, "text": "SummerlandWell where to start with this movie, the acting was good and the cinematography was ravishing but there were fundamental problems with the clunky script from the start. If you could suspend any analysis you could vaguely enjoy it.The problems:-Alice hated the world and held it responsible for her fate, she was vicious from the start. Her main tool was brutal honesty and rhetoric and yet when she had to break some bad news the script decided she would wimp out, directly in contradiction to her personality. I felt used and manipulated by the this silly ruse.To end a relationship with the love of your life because you want motherhood is a quite ridiculous reason even in the 1940's. To then enter then into a loveless marriage with a man infers being gay is a lifestyle choice, a little fact that 50 years of gay activism has tried to contradict. Not to mention the duplicitous action of entering a vow of marriage knowing there is impediment.To then dump you child on you ex lover ten years after ditching her is madness.To then turn up after the script contrives the death of the said husband and then live happily ever after is beyond absurd. A second place relationship dependent on the accidental death of another.My last criticism is the sanitising and dumbing down of a wholesome lesbian relationship, the director should be ashamed of the disservice this movie does to the gay community as as it introduces gayness on heterosexual terms."}], "reviews_amount": 38}