{"name": "Ana", "titleId": "tt06865630", "reviews": [{"id": 0, "text": "Lots of greenery, beautiful houses n the fascinating blowhole. The film is about a salesman n a young kid n how the kid helps the man n teaches him to hustle. The film is listed as a comedy but there is no humor. The end scene of the blowhole is a bit far fetched."}, {"id": 1, "text": "Just like another user reviewed, it's a joy to see Andy Garcia and Dafne Keen acting, so, yeah, ignore the low score and watch it if you want to have a laugh. Some reviewers got a problem with humor here, but I am grateful another review made me watch this movie and I liked it a lot."}, {"id": 2, "text": "Dafne Keen and Andy Garcia absolutely killed it in their performances, and I don't mean acting-wise, yes they acted well, but most importantly they were so funny on it, Dafne Keen is hilarious in this. The movie did not work that well on a emotional level to me, but it is a great comedy. Really weird seeing such low rating for such good comedy, especially with all the crap out there getting high ratings. This movie is not about the plot but the interaction and delivery of the actors. So yeah ignore the low score and watch it if you want to laugh."}, {"id": 3, "text": "Pay no attention to the detractors of this visual dose of morality in a world that destroys not elevates good humans. This gem of a film will share its world and humanity like no other I've seen in a long time. Andy Garcia portrays a disillusioned car dealer and Ana comes into his life like an escaped angel from heaven's realms...but she's no angel...at least not the two dimensional type. In fact all the characters are complex creatures formed by an unforgiving environment. Here's what you'll enjoy: the real Puerto Rico and its warm tough down and out inhabitants surviving corruption drugs and hurricanes...along with the fakes who have given up on humanity; amazing performances led by by Garcia and Keen; an exploration of the psyche of a child scared of adults but eternally willing to live and help. See this pearl of a film. It's a movie to talk about afterward."}, {"id": 4, "text": "Light, fast and surprisingly beautiful. Ana does not worry about being a masterpiece with twists and a complex plot, but by serendipity, it manages to create and give everything a film needs. Careful and simply (less is more) direction by Charles McDougall, excellent characterization / interpretation of the characters with an excellent chemistry between Garcia and Keen that keep you glued to the chair. What else should be added? Great job!"}, {"id": 5, "text": "This is a nice film. Great act, great chemistry between Rafa and Ana. And we can see beautiful scenery of Puerto Rico. Maybe the 'Comedy' genre is little bit misleading. I found some laugh here and there though, but the writing dynamic was obviously toward drama. The ending was also delightful and warm my heart. SHOW ME SOME HUSTLE! 😆"}, {"id": 6, "text": "It is a predictable, mostly dull, small road trip movie with the occasional warm fuzzy in which you pretty much know where it's going to end up. But, with its Puerto Rico scenography, little bits of social &amp; political commentary (against the church) and two relatively solid main characters with nice chemistry (Andy Garcia &amp; Dafne Keen) movie is watchable. Garcia as character for me is pretty undeveloped, while the script needs some more ... punch. The second half speeds up a little bit, but introduces a weird subplot, trades realism for quirky (pit scene) and feels less meaningful. That is why at the end of film there was no real emotional resonance. Basically, movie started with the promise of more, but ended with an identity crisis while the execution made it like weekend TV afternoon movie vibe all over it.Rating: 5+/6-"}, {"id": 7, "text": "I was a bit disappointed in this movie as I expected more comedy and less drama. Nonetheless I stayed until the end.The story is set in Puerto Rico shortly after Hurricane Maria devastated the island. A down on his luck used car dealer reluctantly finds himself babysitting for his 11year old neighbor girl whose mother is incarcerated and whose father denies her.The adventures and mishaps ensue as they travel the island. The contrast of people standing on breadlines for food and water while others play golf in their country club homes dramatized the class separation that existed in Puerto Rico and was clearly exasperated by the disaster.Most of the film's characters are criminals, from the corrupt Pastor Helen who uses the child to bilk cash from empathic patrons, to the car thief, the deadbeat dad, the moonshiners, the armed robbers and even the 11-year-old con artist, do not give a flattering or accurate representation of inhabitants of Puerto Rico. It gives the viewer the impression everyone in Puerto Rico is a crook of some kind.Perhaps the point was to draw attention to the unscrupulous people who took advantage of the disaster to separate people from their money when they are at their worst, however, I suspect it was more just an attack on the integrity of people living on the island, even to the showing of a cockfight, which was especially distasteful.The only pluses I can find in the flick were the cinematography (Puerto Rico is a beautiful island visually) and most of the acting was above par.In any event, there was very little (if any) comedy in the film and I left saddened and disappointed."}, {"id": 8, "text": "Other people have described the story enough if you decide to watch it. It'll be more enoyable if you know less about it. I'll just say this: there are a few minor plots hole, and some of the scenes aren't that well thought out, but overall it's a fun film, very intellegent and enjoyable. And it's well made and acted. I think I'll watch it again at the weekend when my girlfriend is around."}, {"id": 9, "text": "Just wondering how it gets so low rating. I expect it to be sitting around 7 and 8. I've enjoyed every bit of it."}, {"id": 10, "text": "This movie is being overlooked. It's a phenomenal human story that everyone needs to see. I'm sure due to low budget or little promotions done It had me captivated from beginning to end Andy Garcia and Dafne Keen, yes two people that had me believe in them as true characters. Would give it a higher rating but 10 is the highest. A must see!!!!!!"}, {"id": 11, "text": "Completely unbelievable, goofy tongue in cheek parody of Relgion and Puero RICO. Not much here!"}, {"id": 12, "text": "In 2020's Ana (my latest review), Ana the persona is not an assassin mind you (that's Anna). She is an earnest yet annoying, teenage hustler played by Dafne Keen. Ana is also a semi-abandoned youngster who is on the verge of being relegated to social services.So yeah, Ana is a road trip movie, a downtrodden farce, and a grave comedy/drama (with very little comedy). The film feels like something you don't see much of anymore, a kind of undo characterization from the 1980s (which I've lived through).Ana has veteran TV director Charles McDougall using Puerto Rico as his focal, unequivocal ode. Shot completely on the Caribbean island, you view the culture, you get the unrest, and you take in the breezy locales via every frame. Heck, it almost appears like the camera is longing as it literally peeks in.The highlight of Ana is the turn of Cuban-American native Andy Garcia. Not being in anything lately that's headlining, Garcia's role as sad sack, car salesmen Rafael Rodriquez is sort of tailor-made for him. It's a sympathetic performance and one that proves Andrew still has some ripe acting chops.As Ana barrels along with its overextended running time of 105 minutes (when 90 would've sufficed), Garcia's Rodriquez takes care of Ana because her mother is in jail and she has no where else to go. They travel to the other side of the island to see Ana's estranged father. They also try to find a way to make money in order to pay off Rafael's life-threatening gambling debt.All in all, Ana suffers from being a little draggy, a little exasperating, and rather sloppily edited. However, the happy, turn-the-tables ending and Garcia's character's painful plight make the flick worthwhile viewing (at least for the first hour). Ana banana."}, {"id": 13, "text": "I love the story, what an amazing movie. I'm giving it 5- stars. Dafne Keen did an amazing job playing Ana. What a cute hustler. Also, the Puerto Rican / Spanish accent 🇵🇷 added a big value to the movie."}, {"id": 14, "text": "Definitely a very underrated movie. Amazing storyline and natural acting. Actors did very well. Some awesome humorous comedy scenes and filming locations were also great. Overall a must watch refreshing movie."}, {"id": 15, "text": "My wife and I enjoyed this smaller movie, we watched it at home on DVD from our public library. Garcia is in fine form as the used car salesman and young Keen is just perfect as the 11-yr-old whose mom can stay out of jail.Jeanne Tripplehorn comes in more towards the latter stages, as Pastor Helen who is glad to use the young girl's healing to run a money-raising scam to illegally finance the election of a local politician.The movie is a fun watch, they get into some interesting situations. This is much different from the bigger blockbuster movies and that is a welcome change of pace."}, {"id": 16, "text": "Hand down, a movie that is being ignored in the box office. Incredible performances and a touching wonderful story!"}, {"id": 17, "text": "The Movie Was Awesome I loved it a lot It has Dafne Keen in it the girl form Logan witch I loved that movie too and was the only movie that I seen her in so I was really excited to watch this movie I loved everything about the movie the actors and the storyline and the movie is just beautiful too. I know this isn't much detail but it's my first review there's are some senses in the movie that are just favorites and the girl is so adorable and smart,cute Thorough out the movie I just loved it. Ok bye"}, {"id": 18, "text": "Beautiful story and so natural for the acting of the little girl and killer charming god father. An hour and 45 minutes but enjoy every minute."}, {"id": 19, "text": "Be realistic. We all have different taste in flicks. This film has no nudity, blood and guts, f bombs, infidelity. No, its not Hallmark, but I don't like them. It has some honest/dishonest features. Its just a fictional story thats was entertaining and easy to enjoy the characters personalities. The fact that a stranger actually cared about the well being of a young girl made the movie heartwarming and sparked curiosity how it will end. I loved how Ana's eyes spoke more than her words!"}, {"id": 20, "text": "Not a good reference to God and it was trying to teach this young girl morality,NOT."}, {"id": 21, "text": "If you're after a fun film, without the OTT action or dumb slapstick profane comedy which blights much of Hollywood's recent output, then this is worthy of consideration.Good chemistry between the leads, and interesting to see that it's the street smart Ana that comes up with most of the money-making activities/attempts the pair embark on.Some of the negative reviews seem to stem from the films portrayal of the church organisation the pair encounter, but it makes clear that the activities are those of the individuals involved who see faith as a business above anything else.Better than the ratings imply"}, {"id": 22, "text": "We picked it b/c my wife loves Andy Garcia, I just remember him as the guy who yelled ME VAZ A DECIR MENTIRAS A MÍ!. This one is a nice family movie and well acted. Usually, used car salesmen are sleazy but this guy is alright."}, {"id": 23, "text": "It's easy to watch straightforward, and quite realistic as well."}, {"id": 24, "text": "Ok this is not a really good movie but still worthy to watch, some camera work are weird, some scene are kind a weird too, for the acting kinda in the middle sometimes good sometimes bad, now the story is very very out of concept , the ending for me is like outta nowhere, they just use the alternative story that very unexpected, like in the beginning the movie tell that they have to work hard to get this money but in the end they just put a simple ending, kinda disappointed but still fun to watch"}, {"id": 25, "text": "One of the best things I've seen Andy Garcia do and it proves how versatile an actor he is. A great story about two people - one older and out of luck on many levels, and the other young and smarter than her years but alone and desperate for human contact. Each at odds with their circumstances, they come together thanks to the fearless young girl, and they bounce off each other like oil and vinegar. Ana (Dafne Keen) who's inexperienced view of life flips from one crazy notion to another makes you want to hug her and slap her in equal proportions. Rafa (Andy Garcia) suffering from bouts of Angina, does his best but his health is an issue and he keeps getting bested by the girl's erratic and irrepressible moods and actions. At times exasperating, her off the wall spontaneity throws him frequent curves. He goes from one sharp intake of breath to another as he tries to cope with her behaviour. He owes his bookie a deal of cash which puts extra stress on his dodgy heart adding pressure he can well do without! Sooner of later the issue must be faced with an outcome which could affect them both. There is an uneasy bond between them but for Rafa time is running out and his desperation to avoid his loan shark's threats is somewhat hopeless....."}, {"id": 26, "text": "I do not usually write reviews. I just see a movie, like it, hate it, keep it, trash it and move on. I do share recommendations with close family and friends,But this one made me to login here just so I could share the feelings.It's a heartwarming film of an unlikely but so very well suited adventure of Ana (Dafne) and Rafael (Andy). If you like films about a common man trying to make the odds meet and earn a decent living while babysitting a street smart sweet kid who's trying their best to pitch in and help but with results that are completely opposite and funny, then this one is for you.I have always liked Dafne since I saw her in Logan and acting comes naturally to her, so it wasn't surprising to see her deliver a perfectly enacted role. Andy of course is one of the legends and his portrayal of a man struggling to get by was absolutely on the mark.Anywho, if you are looking for a movie with an ok plot, great acting, and well timed comedy with a touch of poignant moments and totally totally heartwarming, then it will be time well spent.Oh, and Dafne Keen is on her way to stardom :)"}, {"id": 27, "text": "What an odd movie. Had no idea what I was getting myself in for here but it had some recognisable names attached so we gave it a go. Like the characters the movie portrays, it seemed a bit aimless.Travelogue of Puerto Rico? Perhaps, but it didn't leave me with any desire to go there. Quite the opposite. It showed a country in economic and moral collapse. Comedy? Nothing funny here. Yet it wasn't gritty enough to make it compelling drama either. Showed the underbelly of society and finishes off with an expose of crooked religion and corrupt politicians but then wrapped it up in a mismatched buddy road movie.I'm never one to say that was two hours of my life I won't get back, but it may have dragged on a little long. Some scenes and character's actions were inexplicable and only seemed to be thrown in to carry the movie along. For instance, in one scene the girl runs away from the car. She is chased by her carer who almost gets beat up by a gang after they misinterpret his actions. He returns to the car to find it's been stolen and now in a chop shop. The girl had returned to the car and was still in it when it was carjacked. Why did she run away in the first place?!Funnily, the end of the movie explains that the bad guys got their comeuppance and the good guys did alright, as if we had just watched a true story. I think the director was trying to imitate Hitchcock who always felt it was his moral duty to explain that crime doesn't pay. Made it all feel sort of feel good but it didn't really sit right.Basically, it's not the worst movie you'll ever see, and it's sure not the best. If there's nothing else to watch, fine."}, {"id": 28, "text": "There are some very bad movies out there and Ana or The Guardian is not one of them. The story is slight and the running time feels about 20 minutes over. It's not quite a comedy. The humour is spare and dark, playing more like drama for the most part with elements of South American magical realism.Dafne Keen and Andy Garcia are cast perfectly, with an on-screen chemistry and individual performances that's are a real joy to watch. Garcia is perfectly sad, understated and beaten, while Keen is a chaotic bundle of innocence and guile. The movie rollicks along when the two of them are together in the same space (and begins to drag a little when they are not). The cinematography and shots of Puerto Rico are beautiful, from the broken slums to the lush jungle. There are several strands competing but this is, at heart, a road movie of sorts. At its best, it reminded me of Paper Moon.This is so much more than a 5."}, {"id": 29, "text": "Rafa Rodriguez (Andy Garcia) runs a struggling used car lot in post-storm Puerto Rico. He finds Ana (Dafne Keen) had broken into one of his cars. With her mother in prison, Ana is alone. His cars get repo and he makes a bad bet. He needs to pay in 5 days. As he grows frustrated, he tries to leave Ana with Pastor Helen (Jeanne Tripplehorn).I love the two leads and I love the locations. I'm eager to go on a road trip with them. I'm going with this movie until the car gets stolen. It would have been fun for them to steal it back. That's the best move. Then there is the church. I like her wheeling down the aisle. That's a fun scene but the repeated showings don't make sense. Wouldn't some parishioners keep coming back? And wouldn't those repeat customers notice that it's the same girl every time? There is always a performative aspect to the proceedings but one would expect that such trickery would be called out eventually. The money part is too muddled morally and the movie wraps it all up too neatly with a bow in the closing text. It's unsatisfying. I still like the chemistry between Garcia and the girl. I like the church much less."}, {"id": 30, "text": "(maybe for showing the opposite rich-poor, which is not Hollywood PC, I dunno)which made me think, it must be really bad - but I was wrong.First the movie deserves really a 6.3 - 6.6, but a 7+ for family/light entertainment, feel-good and overall being very watchable, not demanding. It is nice, sweet, funny in a subtle way, which can't be said of so many movies nowadays. It's in the tradition of buddy movies with 2 very different characters, like 'The Green Book' or 'The Intouchables' (but certainly hasn't the originality or production values).Andy Garcia seems not feel like playing anymore gangsters or bad guys, while the girl from 'His Dark Materials' almost steals the show, she may have quite a career ahead.This film is not special, no superheroes, action or tricks here, but it has its own charm and I liked it.Your Experienced Movie Watcher"}], "reviews_amount": 31}