{"name": "The Doorman", "titleId": "tt06222118", "reviews": [{"id": 0, "text": "Jean Reno might be beyond his prime these days, but moviegoers remember the time when he was a top actor of French cinema. His name is the only selling point of this ultra-low budget action flick. Not that his presence saves the movie. Everything about it is cheap and ridiculously bad: the fight coreography, the script, the acting and the cliché characters. It's just sad to see Jean Reno ruining his legacy for a few coins. Don't bother to watch this, you'll have more fun watching paint dry."}, {"id": 1, "text": "I saw this only cos of the the director. I have enjoyed most of his films, Midnight Meat Train, Downrange, No One Lives, Versus n even the segment from Nightmare Cinema. Most of his films r very violent but this one is lame without any noteworthy action sequence. Ruby Rose aint convincing as the bad ass fighter. Jean Reno looked puffy n tired. The fight choreography aint done well n the film lacked the thrill factor. The screenplay is very similar to the recent Mel Gibson disaster Force of Nature."}, {"id": 2, "text": "What is up with Hollywood and The use of this terrible actor. She has 1 emotion. Thats it. Could Be a decent action movie. But that lead star - Damm she is so so overrated."}, {"id": 3, "text": "Bad acting and dull. Another B movie I wouldnt recommend."}, {"id": 4, "text": "People could call this a cheap movie (by hollywood standards).. I'd say it has more of an indie-feel.. With sloppy camera work that makes a mess of action scenes, and boring interactions and dialogue. This is one of those that isn't worth watching for any reason. You won't learn anything, isn't fun to criticize, and will be forgotten the next day. The plot is as simple as it could be summarized in one line of text, and none of the characters are decent or memorable (not even the little girl who you are supposed to like).. with the exception of Jean Reno, maybe, who poses as a smart and calculating villain. He does a fine job, but for his resume, it is rather lacking.I wouldn't recommend it, not even for the action. It's too average in every department."}, {"id": 5, "text": "The Doorman starring Ruby Rose as Ali in the titular role is about an ex-marine who faces off against a bunch of criminals lead by Victor Dubois (Jean Reno) attempting an art heist in an almost empty apartment building which is undergoing renovations during the easter holidays. What they didn't count on was a family being in the apartment and an ex-marine with PTSD who is related to them.The problem is that this is just another in a long line of pale Die Hard imitations where a hero faces of against criminals while trying to save people before the criminals break into a safe and do not need hostages any longer. In fact this movie has a scene where Ali kills a criminal on one of the floors undergoing renovations just like John Mclane did in Die Hard. She also tries to signal for help by setting off the fire alarms just like John Mclane did. Even when the criminals are seen disabling the alarm system one is shown as trying to do it carefully whilst the other takes a hammer and breaks everything up. In Die Hard one robber tries to be careful and the other uses a circular saw to cut the wires.There are also way too many convenient things that happen in order for the hero to be successful. There are hidden passages all over the building and her nephew knows them all for example. There is apparently an old speak easy where they hide. The teenager shouts and the 2 robbers chasing them hear him. Which makes you wonder what kind of hidden room this was if everyone could hear the noise coming from it. The robbers also make many illogical decisions. This and other inconsistencies and plot holes make this a less then stellar attempt. The acting was nothing special although the movie has good actors in it so at best it is ok for what the movie is. A 4.5/10"}, {"id": 6, "text": "This movie is basically Die Hard if the writers, director, and editor were all drunk. And I don't care how low budget your movie is, you should still sport for a military consultant/choreographer in your action film about a ex-military hero."}, {"id": 7, "text": "No. Just don't. Heroine is awful, flat. Characters are unlikeable, including her. Completely predictable plot. Don't waste your time. Watch anything else by Jean. Cold Blood is a good option."}, {"id": 8, "text": "So sad to see great actors doing such a terrible job in a terrible movie. Jean Reno does not do a lot of bad movies so this was really dissapointing. sure hope he does not end up like Bruce Willis. It is very clear that neither the actors or writers have ever used a drill that needs water to cool. Here a big part of the story is to get water for the drill. But the drill does not use water or have a connection for water.. Its a standard magnetic drill where you can cool down the drillbit with a can of sprayable oil... This was really boring and i regret spending time on it"}, {"id": 9, "text": "The Doorman (2020) is fairly typical of low-budget direct-to-video made-in-Eastern-Europe fare. Production values are better than average for similar films. The actors do as well as can be expected with the material they're provided. But the screenplay is uninspired, with far too many coincidences, contrivances, and familiar tropes. The movie seems very similar to Force of Nature (2020), starring Mel Gibson, which also suffered from far too many coincidences.Ruby Rose handles her fight scenes fairly well, but could have been replaced by a department store mannequin in some of the other scenes. Jean Reno delivers an effortless performance as the villain, which is nevertheless interesting to watch. Aksel Hennie, Rupert Evans, and Philip Whitchurch deliver credible performances. Some scenes drag; many are predictable. It's what might be termed a multi-tasking video, one that can be watched while doing something else without missing much."}, {"id": 10, "text": "The movie starts decent enough and seemed to be interesting at first. As it goes on though, it starts to fall apart.A lot of totally constructed scenes, stupid decisions of protagonists that usually only happen in horror movies, plus some really bad acting let the whole thing down. Jean Reno does a good enough job, but with a little care and much better writing it all could have been much more enjoyable.Think Die Hard, but badly made."}, {"id": 11, "text": "Normally I'm a very forgiving person when it comes to movie like The Doorman and just Die Hard rip off movies in general but when you got a pretty stacked cast and Ryuhei fricking Kitamura as the director and the result is just another bargain bin action flick then what are you even doing here? I mean Ruby Rose as a lead action heroine is not a bad choice when she can pull out some believable action scenes but beside her everyone from Dan Southworth, Louis Mandylor, and Jean Reno they all acting like they don't even want to be in this movie, to be honest. There not a glimpse of Ryuhei's over the top filming style up until the final act and even it can't even save the whole goddamn movie from itself. I hope this movie is just a quick warm-up for Ryuhei Kitamura before he goes on and directs that Versus remake cause I'm definitely not buying this one."}, {"id": 12, "text": "There is not a single thing in this movie worth commenting on. It is as bad as it looks in the trailer. I am absolutely stunned at how Ruby Rose lands these action roles. Someone mentioned in the comments that this is a wannabe die hard movie but that is far far away from the truth. Its not worth comparing it and its not even near to a fake cheesy/sloppy/bad die hard copy. ******* Nothing to spoil"}, {"id": 13, "text": "A 90 minutes of my life i cant take back.Worthless."}, {"id": 14, "text": "Everything was so poorly written and choreographed. If I had watched a preview first I never would have paid for it."}, {"id": 15, "text": "This has got to be the worst movie I've seen this year, it's terribly done on all levels. You don't see any of the punches! The camera just moves and with the fast cutting making you think there's action, but even then you can't feel it. The acting is so bad, the main girl clearly isn't cut out for this role. And Reno is a disappointment, he doesn't do a thing in the movie."}, {"id": 16, "text": "I saw The Doorman, starring Ruby Rose-Batwoman_tv, The Meg; Rupert Evans-The Man in the High Castle_tv, Hellboy_2004; Aksel Hennie-The Cloverfield Paradox, The Martian and Jean Reno-Alex Cross, Godzilla_1998. This is a low budget-but entertaining-female version of Die Hard. It was filmed in Bucharest, Romania. Ruby plays a Marine veteran serving on a protection detail overseas that goes badly. After being discharged, she returns to New York looking for a job. Her uncle gets her one as a doorman-actually, she should be called a doorwoman-at the hotel he works at. Rupert plays her brother in law that just happens to live in the same hotel-what a coincidence! His wife-Ruby's sister-was killed in a car accident, so Rupert is a single father to 2 kids. The hotel is being renovated so it is mostly empty-only a few couples are still in the building, including Rupert and his kids-and Jean comes looking for something that just happens to be hidden in one of the hotel's rooms. Jean brings henchmen along to help with the hunt and Aksel is in charge of them. Ruby has to take the thieves out one by one and protect her relatives in the hotel, all while looking capable of fighting men twice her size and beating them. It does stretch believability just a tad, but it is entertaining. It's rated R for violence, language and drug use and has a running time of 1 hour &amp; 37 minutes. I enjoyed it enough that I would buy it on DVD."}, {"id": 17, "text": "If you have absolutely free time or if you are having difficulty with sleep initiation, you can watch it. Totally not worth your free time. Rated 4 because I've seen much worse than this. 4 is fair for this movie. You close your eyes for 10 minutes and can still catch on to the story. Immature plot and story line. Sometimes the acting is just lame. Luckily the antagonist character played by Jean Reno and Aksel Hennie save the movie from crap to mediocre. 3 types of movie for me. A. Must Watch before you Die B. You Can enjoy it C. Don't Waste your money and time this movie is C type."}, {"id": 18, "text": "The acting and the story are not convincing. You see a lot of fighting which doesn't even ruin the makeup of the hero! After all, I think it's my fault I was one of the first to see the movie and didn't wait some other IMDB reviews to decide watching another movie instead!"}, {"id": 19, "text": "I was surprised, I was prepared to not like it. But Ruby Rose, Jean Reno and cast make it palatable. It's not a blockbuster movie, but there is still enough action to keep it interesting. And yes you might have to suspend your disbelief."}, {"id": 20, "text": "Can't believe i'm saying this, but the acting is unbelivable bad... Or, the script is so bad it makes the acting feel that way..."}, {"id": 21, "text": "Not a good movie to watch. Very slow and very unrealistic.Go watch some other movie."}, {"id": 22, "text": "Ruby rose is a decent action star an gene reno is great but this movie totally flops from all the idiotic decisions made like if she is so bad ass why does she waste every opportunity to kill the bad guys an just run away an dont get me started on the kids i dont want to be mean to kids but damn go take more acting classes cause your performance was terrible.so if ya want a female driven action movie where the lead has questionable morals an is sleeping with her sisters partner go watch AVA 2020 in my opinion its way better."}, {"id": 23, "text": "But the most ridiculous thing in this stupid movie is the leading actor changed her costumes. She wore some floral blouse, high-heel shoes to 10C, then miraculously changed into tailored jacket, fashioned jeans and boots after she encountered those thieves and started her private war against them. Then again, a grenade miraculously appeared in her hand and bombed the hell out of that guy.Hey, you morons who directed and made this lousy movie, DO NOT TREAT US like you, okay?! You think we'd be blind enough not saw these stupid arrangements?"}, {"id": 24, "text": "Jean Reno is the best part of this film and he hardly delivers. The rest is what could be an interesting heist film but isn't. Headliner Ruby Rose has all the charisma and acting chops of a cardboard box and the villains are utterly disposable. Sadly predictable. Some have compared to Die Hard but the only thing in common is the letter D."}, {"id": 25, "text": "La película es entretenida, buena idea aunque bastante común el tema, el problema principal son las actuaciones demasiado malas. Very very very bad actings"}, {"id": 26, "text": "Not good. Amateur acting, she has a relaxed tone in her voice throughout the movie, bad choreographies and action set pieces. This isn't a good movie."}, {"id": 27, "text": "The story line follows closely to Die Hard where the main character is trapped in an empty building with hostages, and the bad guys have locked down the building to find hidden secrets. Except, instead of an off duty male cop (Bruce Willis) as the main character, it is a woman as a retired marine (Ruby Rose as Ali). It is passable as an action movie, but nothing special.*** spoiler alert ***There are quite a few gratuitous politically correctness moments. For example, at the start of the movie, only Ali saw the terrorists, and her male superior quickly dismissed her concerns. All the male guards got shot fairly quickly, and she single handedly took out close to 6-7 bad guys, and was only stopped by an RPG blast. Then when the teenage boy max had a gun to the bad cop's head, and he couldn't pull the trigger (which put everyone in more danger), but Ali was proud of him.Some scenes are not logical, for example, Ali kicked 3 bad guys to the ground in the lobby, and Max grabbed their guns. But instead of just shooting the bad guys right there on the ground, Ali decided to run away, which led to hand-to-hand combat with multiple guys stronger than her later, and they almost killed her. I think real Marines will be sad to see this strategy."}, {"id": 28, "text": "I find the film enjoyable. It's good to see invincible female characters. The plot is OK and the action keeps on coming."}, {"id": 29, "text": "Just not thought through at all. Pretty dumb B movie action with a boring plot. I watched it because of Jean Reno ... but that was a mistake."}, {"id": 30, "text": "Poorly made re-hash of classic action plots with ridiculous situations, weak acting, and non-thrilling action scenes."}, {"id": 31, "text": "Bad writing, bad acting, bad action.It could have been fun to re-imagine Die Hard with a female protagonist and a French guy as the token German villain.But alas - the writing is horrible, and the production value is sub par."}, {"id": 32, "text": "Gave this one star because I almost forgot to pay attention to the movie while watching it, and after I simply didn't care what it was about in the first place. This is as bland as it comes. Predictable and boring. Ruby Rose simply doesn't have the acting talent to carry a movie on her own. She is a supporting actor at best."}, {"id": 33, "text": "I have not counted, but that movie is probably the 1066 th DIE HARD rip-off in the movie history. But this one is more obvious than most of them same scheme, same twists in the story development. Jean Reno plays here the local Alan - Gruber - Rickman's character. And I don't remember any DH rip-off with a female against the evil ones. And Jean Reno as the heavy, I had not seen this since ARMORED, back in 2010. Sorry I forgot last Spike Lee's movie, about Nam Black vets. Frenchmen are often the bad guys in American movies. DOORMAN is not a bad movie at all for this kind of cute and agreeable crap. In UNDER SIEGE, another DH rip-off, Steven Seagal was an ex Special Forces member who was a cook, here the former decorated Marines female lead character is a doorman. Very smart indeed !!! In another rip-off, the hero will be a gardener or a garbage truck driver. ha ha ha. The only good scene is at the end, during the last fight between the lady hero and the lead henchman, when the latest AT LAST kicks her, lying on the floor. All long the film, she always beat them all. This was very boring for the audience."}, {"id": 34, "text": "If you don't mind action scenes that don't make much sense, the kind of plot that is full of bad decision making then The Doorman might be enjoyable for you. The fighting scenes were not bad, the plot was so so. As for the acting well let just say it wasn't Jean Renos best performance. For once he's the bad guy, but his character was rather annoying than enjoyable to watch. As for Ruby Rose I guess she can do fight scenes. I wonder what people find attractive about her though, I wouldn't touch her with a ten foot barge pool, but that's only my opinion. The Doorman is just good enough if you want some mindless action entertainment but that's about the only good thing about it."}, {"id": 35, "text": "I mean plot was nice but the little girl was not the best for the role seemed forced. She needed more practice, not enough experience"}, {"id": 36, "text": "I am disappointed by this movie because actors are too amateurs. They look like some kids exercising how to act or acting for the first time. Everything looks setup, fake, and with weak acts. Not the worst movie because of good presence of reality and different people and environments, but still far from good. Waste of time. The whole topic is more interesting than movie."}, {"id": 37, "text": "I saw this film 2 weeks ago and was stuck with the story and action its a popcorn flix nothing else and yes it has a woman kicking ass an normally im not for it but this was really good and kept me on my seat for the hole movie even had a great ending something I have not seen before also i like how jean reno had more of a role then i thought he might have and the lead actress i think i remember from xxx 2017 cause she look for miler anyway just watch it for what is is and nothing else have fun and don't listen to the bad reviews"}, {"id": 38, "text": "I just watched this because Jean Reno. His best acting days are gone, but I still believe he can do something decent. Here he is probably the best thing by far, but his character is ruined because of the pretty bland script. The movie is weak, unbelievable and unoriginal. Why Hollywood still try to put a woman as a Terminator or a Mercenary? Can you imagine Rambo, original Predator or Apocalypse now with a woman as the main character?"}, {"id": 39, "text": "Good for action movie lover. Lot of happening. Not boring any second. Story also little bit interesting. Don't care about low ratings just enjoy. anyway Ava is better than this"}, {"id": 40, "text": "More bad acting by Ruby Rose not believable as an action star. She's 120 pounds fighting grown ass men and winning not believable at all. Don't know why she keeps getting these roles she's not that good as a main character."}, {"id": 41, "text": "Although it is not a masterpiece but good entertainment....full of suspence anf thrill.goid to watch...."}, {"id": 42, "text": "Bad movie even worst than a 90s B class film, un gran sorete una perdida even that i have to say the new action fights scenes are good"}, {"id": 43, "text": "This is a Die Hard type of film with Ruby Rose is the title role. As a Gunnery Sergeant guarding our ambassador in Romania she manages to shoot and kill everyone except the guy with the bazooka. Back in NYC she works as a doorman, a job her uncle got her. At 20 minutes into the film after all the good guy introductions things take a turn and then Jean Reno shows up. Ruby has to fight to stay alive and keep the remnants of her family alive.It is a very predictable film. While Ruby Rose is a trained boxer, we really don't see those skills. I thought it was a fun no thinking action film.Guide: Didn't catch any F words. Brief male butt nudity."}, {"id": 44, "text": "Jean The French Bruce Willis Reno is in this movie just so that fans of his earlier movies would be fooled to expect something similar. They got me, I was fooled.Do not watch this movie. Jean Reno's role is stiff and uninspiring, and his performance is still best in the movie. The script is full of cliches. None of the characters are in any way interesting. There's nothing worth seeing in this movie. It's mediocre in every way.The setup was pretty interesting, and I did enjoy the beginning of the movie somewhat, but it just fell flat right after the robbers arrived.I hope the movie loses a crap ton of money on this so that people involved in making this crap never make anything similar ever again."}, {"id": 45, "text": "A waste of my time and the production teams time. The plot horrible, acting horrible, nothing exiting."}, {"id": 46, "text": "It is an OK action movie but I have seen too many of these and it was boring. after the first half an hour. It is refreshing to see a woman action hero. Good to have Jean Reno inside otherwise it would have been too many random faces. The plot is the same as always."}, {"id": 47, "text": "This is the story of a surgent who came back to New York City and works as a doorman. There is a heist in the building. The criminals try to rob some artworks. The doorman is the only guard of her relatives who live in the building. The story is nice. I liked the action scenes especially the fighting scenes. The background music and sound effects are awesome. I liked the acting crew. I enjoyed watching the legend Jean Reno. He is one of the few actors who can play incredibly in different genres. For example, he was the star of the action movie 'Leon: The Professional 1994'. Also, he was the star of the comedy movie 'The Visitors 1993'. In summary, I recommend this movie to action genre fans and Jean Reno fans."}, {"id": 48, "text": "The message in Versus director Ryûhei Kitamura's contemporary crime thriller The Doorman is never judge a heroine by her looks or allure. The homicidal henchmen in this derivative rehash of the vintage Bruce Willis actioneer Die Hard (1988) learn this lethal lesson about stereotyping the hard way. When they tangle with our heroine, they're surprised she can counter their every move with guns, knives, fists, wits, and improvised explosive devices. Australian actress Ruby Rose makes you believe she could wield all these weapons, too. This multi-talented starlet has been turning heads for some time in Hollywood. Recently, she toplined the first season of the WB cable series Batwoman (2019-2020). Rose made her career debut in the short film Boys Like You (2011) and hasn't looked back. Since then, she has co-starred in the Netflix TV series about prison women Orange Is the New Black (2015) and then fielded roles opposite Milla Jovovich in Resident Evil: The Final Chapter (2016), Keanu Reeves in John Wick, Chapter Two (2017), Vin Diesel in xXx: Return of Xander Cage (2017), and Jason Statham in The Meg (2018). Rose can play good girls as well as bad girls, and she is carving herself out a promising career.In The Doorman, Rose plays a gatekeeper at a towering, luxurious, ten-story, Manhattan apartment building. Some residents are surprised to see her negotiate the gender gap as a doorman in her long uniform coat and visored cap. Eventually, she tangles with villainous French criminal mastermind Victor Dubois (Jean Reno of La Femme Nikita) and his equally ruthless second-in-command Borz Blasick (Aksel Hennie of Last Knights), who has some surprises for both her heroine as well as Dubois' villain. Director Kitamura and his two Sky Raiders scenarists Lior Chefetz and Joe Swanson, adapting a Greg Williams and Matt McAllester story, prefer to foreshadow various events with random expository dialogue which only vigilant spectators will file away for future reference. Meantime, The Doorman shares a plot similar to the Mel Gibson melodrama Force of Nature (2020) about a murderous search for stolen Old World masterpiece paintings that vanished without a trace during World War II. The Doorman opens with a slam-bang start at the American Embassy in Bucharest, Romania. The U.S. Ambassador (Andreea Vasile of Why Me?) and her daughter Nira (newcomer Andreea Androne) leave her office and travel in an armed convoy of dark sedans to a rendezvous. The Ambassador invites U.S. Marine Gunnery Sergeant Ali Gorsky (Ruby Rose) to accompany her daughter in a separate car. As the motorcade enters a stretch of two-lane highway through a deeply wooded forest, the gimlet-eyed Gorsky spots black-clad figures scrambling stealthily alongside the road through the dappled shadows of foliage. Gorsky reports her sighting. The security escort chief doesn't spot these dastards and clears the convoy to maintain its course. Suddenly, out of nowhere, one of those phantom assailants materializes on the road with a bazooka. He sends a projectile streaking into the lead car. No sooner do the occupants see the deadly rocket soaring their way than a fireball explosion engulfs their vehicle. Chaos reigns as drivers and bodyguards alike take evasive action. More black-clad warriors emerge from the forest. Armed with assault rifles, these gunmen riddle the bodyguards with fusillades of gunfire.The camo clad Gorsky advises Nira to stay low. Gorsky exits the car, brandishes her automatic pistol like Wild Bill Hickok and takes down several assailants in their tracks with unerring accuracy. Methodically, to conserve ammo, Gorsky eliminates each terrorist with one bullet per man. She wounds another when she shoots under a car. Her slug shatters the gunman's ankles, and he crumples in pain. Meanwhile, the Ambassador dashes through a barrage of gunfire to join Nira in the rear car. No sooner has she cradled her daughter in the safety of her arms than another terrorist launches a bazooka shell. Sergeant Gorsky doesn't see this projectile as it screams overhead and obliterates the car, atomizing both the ambassador and her daughter. The impact of the explosion catapults Gorsky backward, hurling her into the woods. As soon as she slams into the dirt, Gorsky awakens from this flashback in her peaceful New York City apartment. Apparently, the sole survivor of this tragic skirmish, Gorsky has returned to America and hung up her dog tags. Mind you, she hasn't forgotten any of her ingrained gunnery sergeant skills, but she contends with PTSD as a result of this violent opening episode.Happily, Kitamura stages an exciting, slam-bang, high-octane, shoot'em up prologue which establishes Gorsky's lethal proficiency with firearms. Gorsky lands a job at The Carrington after a kind relative, Uncle Pat (Philip Whitchurch of Blue Ice), notifies her about an opening. He advises her not to mention that they are related. The Carrington's chief caretaker, snobbish Borz Blasevic, hires her on the spot while harassing her in a unisex locker room scene. He warns her the building will be closed during the Easter Holiday, so she'll have some time off. Little does Gorsky know her late sister's husband, author Jon Stanton (Rupert Evans of Tank 432) and his two children, Max (newcomer Julian Feder) and Lily (newcomer Lord Cassidy), reside on the tenth floor. Later, the Stantons invite Ali to their Easter lunch. Reluctantly, Gorsky promises to attend. While Ali is socializing with them, the evil Dubois with his gang of ruffians invades The Carrington. Dubois has come to liberate some priceless paintings one of his former colleagues had hidden within the walls. Meantime, Gorsky torpedoes Dubois' best-laid plans when they occupy the Stantons' apartment. Borz and she wade into each other kicking and screaming. Ruby Rose acquits herself athletically as a butt-kicking heroine who can take it and dish it out. Kitamura and his writers never let the pace slacken in this robust, R-rated actioneer. Altogether, The Doorman qualifies as a sizzling saga."}, {"id": 49, "text": "The doorman share the same basic elements of those old action movies.There are some fantastic fights scenes and action scenes Ruby Rose is great.The original The doorman movie are all those famous old action movies when bad becomes good all fun action movies to intertain people.Jean Reno is also great in the movie as Victor Dubois is a fun bad guy as Krieger in mission impossible and Petrovich in rollerball the audience is introduced to the hero and bad guy character with the absolute minimum on their background so it,s cool. The rest of the movie is action and fights scenes.Great VOD movie it,s a low budget movie but still very interstaining"}, {"id": 50, "text": "Interesting movie but needed more good actors. Ruby was amazing but better supporting actors could have helped"}, {"id": 51, "text": "Only good part of the movie is Ruby Rose. They could have made it with more action. The best part of the movie is the beginning."}, {"id": 52, "text": "Event he brilliant talent of Jean Reno isn't enough to save this travesty of a movie.Most of the rest of the acting is atrocious - especially the brat playing the girl, who must have been dragged out of some stage school musical. Ruby Rose's performance has more in common with a tree and seems completely unable to have more than one expression throughout the entire movie.Right from the start the story is ridiculous and totally unbelievable, and it doesn't get any better. The stunts were obviously done by stunt performers and the choreography for the fight scenes was so bad it is like watching a performance in steps.Really not worth the time."}, {"id": 53, "text": "The story, the acting, the direction, the fight scenes, the script, the music, the cinematography and Ruby Rose all sucks. I couldn't believe that this movie is from the same director of The Midnight Meat Train (2008), but I remembered it's from the same director of Downrange (2017). My stomach got really hurts after this one."}, {"id": 54, "text": "Jean Reno what on earth were you thinking! this film is absolutely atrocious - Ruby Rose is especially bad, she even outshines Pinocchio in the wooden stakes and I can honestly say there is not a single redeeming feature and the script is so bad the writer should immediately start looking for a new line of work. A total crime against cinema. AVOID AT ALL COSTS!"}, {"id": 55, "text": "There are many women who are great Action Stars and Ruby Rose is not one of those. The combination of the horrible acting and unbelievable fight scenes, it just shows you can't just put someone in a role because they became popular on Twitter for bit roles."}, {"id": 56, "text": "Skip it. Talking about a movie that was a major let down. Don't expect the doorman to be that great. Seriously lacking in plot and acting."}, {"id": 57, "text": "They tryied to make a female JOHN Wick, except, Tere is no real story other than an ex-military stuck in a building with a bunch of criminals and tying to save her family. TYPICAL IN EVERY WAY."}, {"id": 58, "text": "Throughly enjoyed this movie being a fan of both Ruby Rose and Jean Reno, a good amount of action and story line, given that there are not many movies being released due to Covid 19. worth a watch"}, {"id": 59, "text": "This film start with a woman Ali escorting a little girl, and a bunch of people attack them with bazooka scene! As turnout, this film is about Ali need to survive in a apartment with a bunch of criminal searching to possess the valuable painting, leading by their boss Victor! Entire film full of boring conversation, and annoying overuse scene! Such as, overuse of the yelling scene, overuse of the suffering memory trauma scene, and overuse of the dining scene! Make the film unwatchable! All the shooting scene in the film have blood at certain point, but quite messy, and portray by sideways! The martial art fighting scene also quite slow, and messy! Make the film quite frustrated to watch! The only intensity of the film is the explosion scene! Pathetic! At the end, Borz kill Victor after possess the painting! Borz kill by the grenade Ali put on the ground! This scene really ridiculous! Why Borz don't kick the grenade away, or try to jump away! That's it! Another disappointed film!"}, {"id": 60, "text": "With few good new releases, The Doorman stands out as an enjoyable average action film. Not without flaws, but nevertheless a refreshing thriller to watch."}, {"id": 61, "text": "Everything about this movie is bad. From the plot to the acting. I had to force myself to watch it through. There's a scene where she takes out five cops armed and immediately afterwards, struggles with one man. After watching, I left feeling like a little kid wrote the script. Jean Reno's worst movie by far."}, {"id": 62, "text": "This movie was a stinker. No wonder any katie holmes dropped out. Several issues with many things too long to start. No one on the crew said anything to make this better? Wonder how long the pre production meeting was, a week? I would be making bank doing consulting work for the movie business. And Ruby would have gotten shot the first 2 minutes of this movie. Agree with other that Jean Reno Should reconsider taking on roles that's not fleshed out. Would like to see the outline and what the rehearsals(wait what rehearsals, hah).. Lame. Skip it."}, {"id": 63, "text": "The opening sequence felt like it was based on White House Down, and then the comparison stopped. Some of the acting was below average. Some scenes were sub-par too. Overall, watchable, just."}, {"id": 64, "text": "This movie looked promising. Ruby Rose and especially Jean Reno have some good acting in their past. Jean Reno in particular with some really memorable roles in movies. And seeing Ruby Rose in the cast list, really set my expectations due to her performance in Orange Is The New Black and her stunning charisma. Unfortunately...all of this is ruined in The Doorman. Terrible plot, bad fighting choreography and most likely a bad screenplay combined with what can only be awful directing. Only way to explain the bad acting in actors that usually does not disappoint. In this case though it does. Spare yourself for a waste of time, and let's hope that Ruby and Jean are casted for better movies in the future."}, {"id": 65, "text": "I was hanging out today and thought, what the heck, 4..4 is close enough to 5 stars to watch. I'll give it 3 stars.Sorry, Ruby might have the Hollywood action moves, but there is no way she at 128 lbs is going to take out 5-6 bad guys who weigh 180-200 lbs. Simply watch some UFC fights, and you will see. There is a reason they have weight classes and a 130 lb man will not take out a 180 lb man.... so how can she???Also, she is a pretty girl, but she really screwed up with all those stupid tattoos. They look terrible.... and will only get worse over time."}, {"id": 66, "text": "Ruby rose and others ators in movie nice and Activated Users Can"}, {"id": 67, "text": "You can tell the first reviews were written by the PR department. Anything over 4 stars can't be taken seriously. The premise of the movie is good, however, we are treated like idiots all the way through. There are hidden passages in the building but are never used to effect. She has many opportunities to take the bad guys out but keeps running away from them. She is supposed to be skilled with guns but can't hit someone 8 feet in front of her. But she can take out 8 cops with guns drawn (and many pointing at the back of the head of the cop in front of them), and make them all unconscious. But she struggles with a single cop on the roof.It's just a lot of stupidity that ends with a fan with a spike on it. Really, who puts a 2 foot pointed spike on the center of an 8 foot ventilation fan? Just bad scenes followed by more bad scenes. I'm sorry Jean Reno has fallen on hard times, or else why would he appear in this?"}, {"id": 68, "text": "Gave an extra star for ruby... love her acting and the theme but direction could have been better...nevertheless its a one time watch for ruby and jean fans.."}, {"id": 69, "text": "Well, if you can tolerate some gender reversals in this film, (I can), this is really a good film. The young woman main character is good, but her martial arts skills might be a bit over-the-top for some. The plot is good with a few twists and turns and, trust me, not too much in terms of things happening in alternate time lines -- which is great, I think. Jean Reno is so polite to everyone in this film -- such a drastic departure from his first memorable role -- where he could barely speak! Reno does great job, but I'd rather see his character with some good qualities -- here he seems to have none. I liked it because, at least, the good guys (may?? --watch the film!) win."}, {"id": 70, "text": "Someone on here gave it a ten- white coats are coming fella. This genre has been done to death, but never before with the acting skills of the Hollyoaks cast. Wow, this is bad! If you got to the end and enjoyed it, I thoroughly recommend The Haunting of Bly Manor... you'll love it."}, {"id": 71, "text": "Nothing special here with a weak script and some inconsistent acting from everyone but Jean Reno is OK on the screen and Ray is actually not that bad as the heroine. I'd put it up there with her role in John Wick 2. At least she shows some semblance of knowing what to do in a fight. Chastain in Ava is very mediocre when you compare the 2."}, {"id": 72, "text": "I watched this movie to just have a nice evening, not have to think about issues, just enjoy a film. It was a fun film!. I liked the characters, liked the action and I'm not even a big action movie fan. Just enjoy it and don't criticize so much. Jean Reno is super cool too!"}, {"id": 73, "text": "1 hour 30 minutes of well paced silly fun. Shoot-outs, explosions, bad guys, kids that need saving - the list goes on and on. Obviously there is a boss fight with the most amazing end. Ouch!Ruby Rose is not yet at Bruce Willis-level of snappy comebackedness. That said, she does a good job. And this is superior to most of the 'Die Hard' sequels.I am just glad that they still make movies like this. For when you want to relax on the couch and not need to stay up too late."}, {"id": 74, "text": "This stinkathon made Batwoman look good. As cringeworthy as Batwoman was, this steamer will have you clawing at you eyes to make it stop."}, {"id": 75, "text": "Or something like that. I mean, the parallels are almost there... And the acting pretty much bore it out as well. Could have done so much more or other with this one than was actually done. I mean, pretty much had RR character down to a science, even down to her morally questionable relationships, to her shadowy presence. The only thing RR was missing was the body suite and flaming red hair piece. I mean, seriously, that much of a carbon copy. Meh, the action was halfway decent, even passable. Not terrible, but I wouldn't be spendy about it, wait for a weekend sale."}, {"id": 76, "text": "Kristen stewart, ruby rose, J-Lo .... rose failed in Batwoman where she was a little girl beating up SWAT dudes. this is the same, terribly unbelievable. put pee wee herman on a SWAT team -- same, same. I was hoping for a Jean Reno action flick tied into The Professional. I got Mr. Bean as a tough guy"}, {"id": 77, "text": "So let me be clear this is not a cinematic masterpiece BUT I don't think it was written to be. It has decent fight scenes, keeps you guessing and is a ok use of time for an action movie, it definitely does not deserve the hate it's getting. I wouldn't pay new release money to watch it but for a small rent fee it was worth it..especially during Covid boredom and a rash of terrible terrible movies."}, {"id": 78, "text": "It's Die Hard alright, except Reno lacks the panache of Hans Gruber. It was watchable.....I guess. All I kept seeing was Kate Kane and it scared me. The baddies weren't intimidating and the action wasn't all that great but I've seen worse. I know this is trivial but the way they wore those doorman caps over their ears bugged the crap out of me and those uniforms, straight out of some 1930's movie. That told me right then and there how this movie was going to be. I'm not here to tell anyone not to watch it but be warned, go in with low expectations and you'll be fine."}, {"id": 79, "text": "Automatic rifle fire in a New York downtown building not drawing cops in? Sure.Shotgun blasts down a 6' by 6' tunnel missing people? Sure.Worst safecracking scene ever? Sure.Worst terrorist attack thwarted by a single handgun wielding hero? Sure. (P.S. writers - watch Die Hard to make this scene right)Chance of watching it twice - ZERO."}, {"id": 80, "text": "I got exited when I saw Jean Reno, However the main character played by Ruby Rose was not good. I'm sure her acting was good but she shouldn't had been casted for this film. Was out too out there and made the film unenjoyable"}, {"id": 81, "text": "Yes it's been done many times before. Sure maybe it's like Die Hard. But if you're into this genre, don't expect anything extravagantly new... just sit back and enjoy the ride.Directing by Ryuhei Kitamura was spot on, although the choreography needed more work and less choppiness. Now the writing... 4 writers - 2 nebs and 2 amateurs, and we got nothing spectacular but a bunch of cliches and a predictable story. BUT, it was still an enjoyable watch, especially with the slim-pickings available these days. The cinematography was good. The score was very fitting, and not obnoxious which is typical in B-grade films. The acting was actually good, even for the Kristen Stewart expressionless Ruby Rose. Compared to Megan Fox in Rogue, Rose actually worked for it. It was also refreshing to see the always smiling Louis Mandylor and his hilarious demeanor.I feel the critics went too hard on this one. And to those that gave it a 1/10 on here, give your heads a shake and learn how to properly rate a film (read my bio). It's not just a 1 or 10 rating, there's many numbers in between, and the production value and directing alone starts at a 4 for this one. It's a well deserving 7/10 from me."}, {"id": 82, "text": "I think Ruby Rose is a beautiful lady and I really want her to succeed in the world of movies and tv. Okay, she is no Meryl Streep but she at least has great presence. Her first project after her leaving Batwoman is this Die Hard-like action movie The Doorman. Ruby can do action flicks - that's clear. Her fighting skills are convincing. But for the rest The Doorman is a film that runs out of fresh ideas fast and suffers from a bad script.The problem with The Doorman is that it starts out rather well. Ali (Rose) is a soldier who has to protect an important ambassador's family in a foreign country and can get along fine with the young daughter. But tragedy strikes: during a routine trip the convoy with the family is attacked and everybody dies except Ali. Desillusioned and bitter she quits the army and goes back to New York where she accepts an easy job as a doorman. Too bad she picked the wrong weekend to start, because a group of thugs take control of the almost empty building. She's the only one that can take them down. That's where it all goes downhill, though. When the film is over you realize that you again were tricked into watching a bad and forgettable movie.Having seen many Die Hard inspired action films it's a good thing that we finally see a woman battling against the bad guys. Too bad the story is filled with so many illogical behaviours that as a viewer you can't take the film seriously. For instance there is a scene where Ali manages to stunn her opponents by using a fire extinguisher. She even succeeds in grabbing one of their rifles. But what happens next? Instead of taking this opportunity to shoot them to bits she just runs away.Most of the fight scenes look like Streetfighter or Tekken-like videogames: although you punch the hell out of your opponent they won't go down. That's pretty irritating. The end result of The Doorman is never in doubt. The Doorman also hasn't got the best dialogues either. There's a strange subplot as well where it is explained that Ali once had an affair with the husband of her deceased sister. Ruby Rose is so openly gay though, that for us viewers that dramatic element is hard to believe.The Doorman proves that Ruby Rose can handle action movies and can certainly handle being the lead in a film. But for her and her many fans I hope her next project will have a much better script and a much better director. Because if she's given a good script and a great director Ruby Rose can turn into a big moviestar.5/10"}, {"id": 83, "text": "Where Die Hard was funny, The Doorman is cringeworthy. Where Die Hard was visceral, The Doorman is pathetic. Where Die Hard has action, The Doorman has quick viewpoint change scenes to hide how ridiculous they are. Where Die Hard had an intelligent, pompous and scary villain, The Doorman has a stupid old Frenchman. Die Hard had a budget, The Doorman had an unused building. The acting is terrible, the plot is ridiculous, the characters are cardboard and still they couldn't get them right. How can anyone fail this much?For crying out loud, there are five Die Hard movies there and the one you are trying to copy from was made in '88. You had 32 years to do it right! Ruby Rose was two years old when that movie came out! What more do you need?!Bottom line: If at least they would have gender swapped it and copied the rest this would have been a good movie. No, they had to completely mess it up. Avoid this boring unsuccessful attempt at a movie."}, {"id": 84, "text": "This action drama is a solid bet for fans of the Die Hard series, and its numerous imitators. Ruby Rose is perfectly cast as Ali - an ex-special forces soldier with PTSD that limits her career options and ability to relate to others. She settles for the best job she can find - a doorman for a high-rise New York condo. The gig quickly becomes far more complicated than most doormen will ever encounter, as it must for there to be a movie for us to savor.During a weekend when almost all the residents are out of the building for repairs and renovations, a crew of well-armed, highly-trained evildoers takes over. They're looking for something highly valuable that one of the owners is supposed to have stashed there. When the objects of their quest prove elusive, the violence begins. Ruby's Ali becomes the wild card factor, ala Bruce Willis' John McClane and a slew of others, pitted against superior forces and heavy odds. Jean Reno plays the stone-cold head of the thieves with a chilling calm worthy of any James Bond villain.The action is intense and well-paced by director Ryuhei Kitamura, who has a long resume of action flicks - particularly in sci-fi and horror. The bodies pile up in a satisfying variety of methods, including some cleverly fresh tactics. The R rating is solely for violence - and well-deserved. Rose is as attractive as other women who have taken such roles, and also looks more like she might actually have the protagonist's lethal skill set than others. Without naming names, many of those choices were made for box-office appeal rather than for appearing to have the character's toughness. Rose's cat-and-mouse course of attacks, chipping away at the enemy forces, will keep viewers' adrenaline pumping on the how of things, even though everyone knows where the story will take them."}, {"id": 85, "text": "IN A NUTSHELL: Doorman (2020) is an action thriller starring the gorgeous Ruby Rose, not to be confused with the 2018 film The Doorman. It's currently in theaters in a limited release, but is ALSO already on video-on-demand! Yay! No waiting! If you're looking for something new to watch and are interested in action, you just might like this one, although it's not really that great. It's not necessarily anything we haven't already seen before, but it'll give you some of the same vibes you get from a Bruce Willis Die Hard movie, peppered with female empowerment.TIPS FOR PARENTS: A little girl swears a couple of times, including an F-bomb. Her dad hears the first bit of profanity and says, How many times do I have to tell you: Words! Profanity in Spanish. (I speak Spanish, so no subtitles were given or needed.) A lot of shooting and fighting Blood splatters with violence Talk of the death of a mother High body count, gruesome deaths Some subtitles when French is spoken. Talk of an affairTHEMES: PTSD Family Single parenting Believe in yourself Caring for others CourageTHINGS I LIKED: I really like Ruby Rose. Long before I ever knew about her, I created a video game character to look just like her! ha ha True story! Did you know she can sing too? I think I first saw her in the movie Pitch Perfect 3 where she was the sexy leader of a girl band. In this movie, she's not dolled up and looks more boyed up, like a the soldier she is. There were rumors that Katie Holmes was going to be the leading lady in The Doorman, but I've never seen her do the heavy action that this role demanded. Ruby Rose, on the other hand, was believable. I never saw her in the CW's Batwoman: The Complete First Season (DVD), although she announced she's not returning for Season 2. Batwoman made TV history as the first scripted live-action series to feature a lesbian superhero. Jean Reno plays the villain, something he's great at in many movies he does. The movie starts off with a big action scene. No sense waiting around! The movie has almost non-stop action. Some cool scene transitions. There's an interesting moment when Morse Code is used. So few people know how to communicate that way nowadays. I started learning Morse Code when I got my Ham Radio Technician's license. I found a YouTube video that teaches ham operators how to learn Morse code that you might want to check out. It's designed like a course with short lessons in each video. I'm still working on it!THINGS I DIDN'T LIKE: Some of the acting isn't that great. The dialogue needed a lot more work. It's all super cliched and predictable, so just relax and enjoy the ride.You can watch my full review on my Movie Review Mom YouTube channel. Thanks for subscribing!"}, {"id": 86, "text": "Even though former Marine Gunnery Sgt Ali Gorsky (Ruby Rose) felt guilt not being able to protect an Ambassador and his family in Romania, she takes a job as Doorman at an elite Hotel, The Carrington, which is undergoing renovation. Victor Dubois (Jean Reno) knows that a former German Officer now lives in the Hotel and took rare paintings with him after WW II and Victor and his men want those valuable paintings.Ali comes to know that her brother-in-law Jon Stanton (Rupert Evans) is now living in the Hotel and he is a college Professor and writer of sorts, and who married Ali's sister now deceased from a car accident. And, of course, he still has eyes for Ali, who wants nothing to do with him.Victor and his guys learn where the paintings are and yes, they are in Stanton's apartment. Of course, they are. They find the safe and start drilling to open it.Ali must find a way to protect her family and get rid of Victor and his men. She is given a second chance because it is now her family that is involved. This starts cat and mouse scenarios and these take up the rest of the movie.Notables: Aksel Hennie plays Boris and he is the other Doorman and Victor's right-hand man; Phillip Whitchurch is Ali's uncle, Pat Gorsky, who is in charge of the renovation and gets Ali the Doorman job; Julian Feder as Max, Ali's nephew (Jon Stanton's son) and Ali uses him to navigate the hotel as he knows the hotel layout; Kila Lord Cassidy as Lily, Ali's niece (Jon Stanton's daughter).Just so you know: you should never bypass a movie with Jean Reno in it as he is an exceptional actor and it doesn't matter if he plays a good guy or a bad guy like he does in here.And now for a pretty Ruby Rose, who you might know, or not, that she played Batwoman in the recent Batwoman TV series and then she quits that job and we are all the better for it. She is very good. I just hope those Tats behind her neck and on her left hand are washable, but she can fight. I am sure we will see more of her and yes, keep an eye on her neck and left hand just to be sure. Ha! (7/10)Violence: Yes. Sex: No. Nudity: No. Humor: No. Language: Very brief in the beginning. Rating: B"}, {"id": 87, "text": "Would still look like she's wearing her big brother's hand-me-down clothes. Ruby darling... If you want to continue playing believable action roles, either stick to the gunplay, or pack another 20 lbs onto that 5' 7 frame of yours... Don't get me wrong, you are easy on the eyes, but there's only so much suspension-of-disbelief one man can muster. I did enjoy your acting though, warm and sincere when needed and tough enough when required, to be almost believable... I said almost. Mr. Aksel walked a tight line between the acting and the action, and as always Mr. Reno doesn't disappoint. It's almost a shame Jean Reno did Leon: The Professional, because ever since it's all anyone can compare his performances to... It's as if we forget that his most animated scene in that movie was an awful impersonation of John Wayne. The rest of the cast pulled their weight and I was happy not to suffer through blubbering/hysterical hostages... Yes this movie has been done before, but haven't they all? This movie will pass the time without hurting your head, and if you look carefully, you might catch an homage to Reno's earlier masterclass.Watch this with your feminist significant other, and root for the good guy (er... girl... woman... female)"}, {"id": 88, "text": "The Doorman is exactly what it looks like. It's your basic cliche ex-cop/military with a troubled past in the wrong place during the wrong time redeeming herself. From the beginning to the end the film is 99% predicable, the 1% only happens when writers take a really weird step or jump over a big stretch. This happens sometimes because the elite mercs in this film are all Marv and Harry from Home Alone, and their actions rarely make any sense. They are extremely incompetent but they seem to enjoy themselves, so I guess it's fine. The film has a couple of ok action scenes and lots of bad ones. It looks like the film was salvaged from different parts and shots since some of the scenes feel very disconnected, there are some clear post-production CGI inserts and more. Since the script is all over the place, nobody besides probably Aksel Hennie is trying to act at all. I kinda felt bad seeing Jean Reno so tired and uninvested, I mean, why even bother trying to play Die Hard Alan Rickman if nobody cares. Ruby Rose looks and acts like a robot, with no real investment or emotions. So it goes. The only thing that could've saved this film was funny inventive trashy death scenes, but there's only like 1 or 2 of those, so, bad luck on this one as well. Overall, it's not interesting, funny, inventive, or intense, but it is quite harmless. If it was a bit more good bad, it would've been much more enjoyable, but in its current state - it's just 'meh'."}], "reviews_amount": 89}