{"name": "Clouds", "titleId": "tt06473066", "reviews": [{"id": 0, "text": "An avid film buff and am slightly amazed that this is the first review I am writing. Remember back when it was okay to like a movie that inspired you? Before everything got gritty cause it's soo edgy and artsy that way? Back before everyone was overly critical? Remember when we had movies like Radio, Remember the Titans and Forrest Gump? Movies that just made you feel good about life? That is this movie! I'm here to tell you it's the perfect way to end the negative year that is 2020. Look...I appreciate a good gritty film as much as the next guy, but when that's what everything becomes it's not original anymore, it just gets old. This is simply the film we need right now. So do yourself a favor, ignore the negative critics, don't let them take that from us again! Just enjoy this truly moving and powerful true story with your family. A story that will give you a positive outlook on your life upon its completion. Bring the Kleenex. #makeitcooltobehappyagain"}, {"id": 1, "text": "It's just not a movie to go around saying it's so good, it made me cry, it'll make you cry too. Really it's best to use as an example of the real world of terminal cancer victims and their families. The movie was done well because it wasn't one of those sell out movies where they run scenes that have sad music, acting, tears, to make you cry. It's the raw fact that emotions were held back because it was difficult enough to handle not being able to do a thing about the cancer situation. It had no scenes that were like reminder: this is a movie, let's make it funny, let's pop it up, let's throw in a corny plot twist. None of that here. Beautiful writing. The actors complimented the writing down to the timing. What killed me most was not knowing it was a true story until the end. I was watching the movie thinking, yeah this happens in real life but it isn't likely. Then the ending showed the real people involved in the actual story. I was hitting stuff in my car and crying. Again, great writing because of the fact sometimes a character was difficult to understand until they spoke their feelings out with a few lines instead of the writing laying it out for us, making the actors look clumsy and stuck to being instant on their emotions. Movies should really go in this direction."}, {"id": 2, "text": "Omg do not watch without tissues! This was so freakin good and sad. Love the music, story and characters. So touching."}, {"id": 3, "text": "Clouds is a 2020 drama starring Fin Argus,Sabrina Carpenter, Tom Elverly Scott and Neve Campbell. Based on Zac Sobreich's life the story is about a terminally Ill teenager named Zac Soberich (Argus) who only has a couple of months left to live due to his bone cancer. As Zac is enjoying the time he has left in this world,he falls for a girl named Amy(Madison Iseman),releases a song called Clouds which becomes a phenomenon success on YouTube and hopes he can make it to the prom.The story is heartwarming,the acting is good and if you like The Fault In Our Stars then you will love this film. You may need Hankies for this one.Available now on Disney +Stay tuned to the ending credits as there is a post credits scene and the real Zac Soberich and his family appear in archive footage"}, {"id": 4, "text": "'Clouds' is one emotional biographical film that will steal the hearts of millions.The story is about a young musician who has been diagnosed with cancer, but he will follow his dreams to continue his music hobby.The casting is very talented; the plot is very good; the cinematography is great; the music is very soothing; and the setting is very magnificent!If you love dramas with a main character with disorders, 'Clouds' is the one movie you won't want to miss!"}, {"id": 5, "text": "Well prepared ton of tissue because this movie is gonna be really emotional, god this movie is amazing, how they build the climax scene it's was really amazing, the acting is no doubt they're are a perfect cast, it's more sad that we know this is a true story, this movie is inspiring, when I first see the duration of the movie is 2 hours in my head is like this is gonna be long and maybe boring, but it's not, 2 hours is a perfect duration for this movie, overall it's very recommend movie"}, {"id": 6, "text": "Stop please. Stop making me cry :'(((((( I extremely cry ugly while watching this movie.Great performance by everyone. Inspirational song and story. I haven't found out about this song yet but i'll stream this starting today.WELL DONE FOR MAKING ME CRY!"}, {"id": 7, "text": "Zach's story is absolutely inspiring. I'm glad that this movie does him justice. Great performances and great music. I recommend it."}, {"id": 8, "text": "What a beautiful effort directed by Justin Baldoni, based on the real life of a young teenager taken to soon. It's wholesome and uplifting despite being an ultimately tragic story. You know when reading the synopsis - a teenager with cancer, theres bound to be pulls on the heart strings. And this delivers. I had fear it would go down the same old path we've seen before, but this is done so well and you cant beat things inspired by true stories. I was pleasantly surprised. Disney always winning my heart ...even into my thirties..."}, {"id": 9, "text": "I'm from Europe and didn't know the real story, but this is one of few movies that really got to me. I cried pretty hard and that doesn't often happen to me.obviously based on a true events but the way the caracters grab you,make you feel the same as they do is a gift."}, {"id": 10, "text": "I thought I was dead inside but this film is so moving it made me cry throughout. I cried more during this movie than I have ever cried and that includes my nan's funeral (God rest her soul). This film leaves you motivated to make the most of every moment you have in this life and very dehydrated."}, {"id": 11, "text": "Such a beautiful movie about this incredible story, I cried and laughed but also felt very inspired. Justin Baldoni did an amazing job honoring Zach's story, and also he couldn't have picked a better cast. Fin Argus, Sabrina Carpenter and everyone involved they were absolutely incredible."}, {"id": 12, "text": "This movie was amazing. My dad introduced me to the song clouds many years ago and I still have this song in my playlist to this day. I was so excited to watch this movie when I saw Disney released a movie about him. I enjoyed watching his journey and it was a real tear jerker. It is however a long movie but it is worth the watch. Screw the haters saying that all the good reviews are bought to make the movie look good. It irritates me to see people got nothing better to do then write crappy reviews over such a heartwarming story about a talented young man!"}, {"id": 13, "text": "Everyone is different, so someone wont like this film ,but if you,re a real and loving type, you'll love this movie.Just watch it love."}, {"id": 14, "text": "Well written and sympathetic telling of a young mans final fight with cancer... romantic tension, excellent music and great acting bring the true story to lifeBit of a weepy ... in a good way"}, {"id": 15, "text": "This movie hit hard from the start and just kept coming. Cried through out the whole movie and was on a constant feeling rollercoaster. Best movie I have seen in a long time. Can't say more than a big thank your bravery. I'm in love."}, {"id": 16, "text": "Ahitbrhwknfbueiwndbriwoa whaidnwhqiajs auaisjdhrhe."}, {"id": 17, "text": "As a parent that has had 2 kids graduate from Stillwater High School &amp; 2 currently there, I am very aware of Zach's story and I thought Disney did an exceptional job telling it. This was an incredible movie and one I would highly recommend. Just make sure you have tissues ready!!"}, {"id": 18, "text": "Wow this movie was amazing. I couldn't hold my tears, especially at the end. It's sad how a lot of movies like these aren't as popular as before but this movie definetly deserves love. It was very touching and now I see how Zach Zobiech left a mark in the world."}, {"id": 19, "text": "As i teen i can say this teen movie was personali too cringy too me. So many life quotes lite it's really old school. Romance part was really bad in my opinion. It was too rushed like they just get to know each other and suddenly they can't live without each other. The best caracter in my opinion Sammy. But she didn't get much of a story. I was also pissed after they made a song and everyone was talking about Zach being on radio and HIS song going viral. Idk this movie was overhyped to me. Still it has a beautiful story that ust wasn't made too good"}, {"id": 20, "text": "This movie had me from the start. Really beautiful and so well done , excellent cast. I wish give it more then 10 stars if I could. A must watch/."}, {"id": 21, "text": "Director Justin Baldoni has captured magic in a bottle with this charming drama about the true life story of Zach Sobiech, a young man dying of cancer who wanted to make his mark in the music world."}, {"id": 22, "text": "I'm writing this at 2am sobbing, I can't even find the words to explain how truly beautiful this movie is. Best movie I've seen in awhile with an inspiring message. Stop reading reviews and watch it!!"}, {"id": 23, "text": "This is going to be a very personal review. I knew this movie would be hard to watch, as I had an uncle who passed away of leukemia in 2013. I knew this movie would tug at my heratstrings. I was able to make it through the film without crying...until the last 10 minutes or so. When Zach starts being unable to finish his performance at his prom, and the audience of his friends, family, and complete strangers finish the song for him....that was the moment I started bawling. Absolutely beautiful. I cried even harder when I learned Zach passed away around a month before my uncle. My uncle was in his mid 20s when he passed, so they were around the same age. I volunteered in a cancer ward at my local hospital for 2 years as part of my mission for the Church of Jesus Christ of Latter-Day Saints, (the Mormons.) I have a few medical conditions myself. Heart murmer, COPD, skeletal issues and a few learning disabilities that make me look and act younger than I am. I love stories of people with similar struggles, and this was one of them. I'm taking a star off for an unnecessary sex scene. There is NEVER a reason to have a sex scene in ANY movie. Grade: A- 9/10 4/5"}, {"id": 24, "text": "Justin Baldoni back at it again making me ball my eyes out. First it was Five Feet Apart and now Clouds. It was absolutely amazing!!!"}, {"id": 25, "text": "It's a predictable ending but a beautiful journey..Really nicely done for this type of story, doesn't dwell and get over dramatic on the tragic elements, just tells it's familiar story well, with a reminder of what's important in life..Great characters, notable are the principal, Mum and his female best friend.Beautiful portrayal of his mother by Neve Campbell, a subtle supporting role that hit the mark."}, {"id": 26, "text": "This one is flipping funny. Cars, boats, cleves, and larger than regular views of saturn from the earth. They fill the air in Ben weves room with something. We see him outside at night under saturn. Earlier, a malubal corner of a target air conditioner had formed into a whip. This is a life movie where someone is given 38+ months to attain good faith (based on ruth's romance chronicles 'the broken crows'). The person in this adapts by blending their food into a drinkable liquid. Target sells copies of a show called 'shane."}, {"id": 27, "text": "This movie was absolutely incredible. From the acting, to the story, to the songs, everything was perfect. I can count the number of times I have cried watching a movie on one hand and Clouds has been added to that list. It was truly an inspiring story.Also, to know that Zach's actual possessions were a part of the film makes it even more special."}, {"id": 28, "text": "Clouds impeccably manages to take you on an emotional rollercoaster. You feel so good to be a part of Zach's Journey. The music and the background score perfectly synchronises with the overall tone of the movie. It's happy, it's sad and even humorous at times. It ends with a bang that is sure to leave even the strongest of you in tears. Coupled with an engaging plot and a stellar performance by the cast, especially Fin, Clouds easily manages to be one of the best films in its genre. Inspired by a true story, Justin Baldoni gives a proper tribute to the real life Zach, his friends and his family."}, {"id": 29, "text": "I wasn't really expect this movie to be this touching! Honestly I love everything in it.the music.the friendship.the warming. Found out it was a true story .. I was really amazed ! Disney got my tears..."}, {"id": 30, "text": "It so meaningfull.. Please enjoy your life, how if when you face cancer diagnostic? This film teach alot to us for better life thank you Disney please make a lot more like this"}, {"id": 31, "text": "A very good movie, it is very beautiful and I recommend it. I gave it a grade of 10 for the wonderful story and for the courage to fight this disease. I hope you raise a lot of funds!"}, {"id": 32, "text": "Clouds 2020 12A Director: Justin Baldoni Starring: Fin Argus, Neve Campbell, Madison Iseman, Sabrina Carpenter, Tom Everett Scott, Lil Rel Howery etcOverall rating 100/100Clouds is a true story based on Zach Sobiech where his cancer becomes terminal, so he enjoys and achieves as much as he can with what little time he has left, with an aspiring music career and his relationships being the most important to him he learns to live life to the full. Wow what a powerful movie Clouds it was by far one of the most beautiful and inspiring movies I have seen so let's get started.First of all there was great cinematography, likeable characters, great themes and relationships. I loved the visual aspects of the movie, the visual metaphors linked to the title of the main song and movie was very powerful and had a lot of emotional impact that worked really, the movie just looked very slick and had great set pieces. The whole cast was extremely likeable, Fin Argus playing Zach was great, he had such a likeable charm to him, he kept a smile and to his face and his same humour and charm no matter how ill he got which was truly powerful and heart-warming to see even in the darkest of times a positive outlook can still be achieved. The themes this movie conveyed were truly inspiring, the themes of living life to the full no matter the limit, and the deep themes of the emotional impacts it can have on someone's relationship were explored very well throughout and truly made you appreciate life. The relationships within this movie were also excellent and relatable. The friendship between Zach and Sabrina Carpenters character was truly charming and well thought out, and reminded me of how close I am with my best friend, and the family dynamic and how close everyone was really touched and related to me with how close I am with my family, and the movies deep and realistic portrayal of these relationships reflected well on what people go through with a cancer diagnosis.My next few positives would be the charming tone, soundtrack and performances. The movie had such a charm, the real life in depth look at a family coming together to cope with their brother/son getting weaker and weaker everyday was handled so well, this charm never went away and made you connect to the characters even more making you genuinely care for everyone and taking the journey with everyone, the soundtrack was also great, it had very touching and heartfelt songs that added depth to the characters and instantly made you want to get the soundtrack which I did. The performances all around were phenomenal, everyone managed to achieve deep, versatile and organic performances that truly bought the characters to life, but the key standouts for me were Madison Iseman and Fin Argus were just phenomenal and heart-breaking.My final few positives for the movie would be the character depth, emotional weight and the final act. The movies attention to detail with its character depth was truly fantastic, every single character had a role to play or had some form of arc with how they accepted Zach's fate and their relationship with him, you understood how each and everyone of the characters was feeling, this was also partially down to the fantastic script as well, with some powerful and thoughtful dialogue, but you understood the characters on such a deep level that you formed a deep connection with them all, the movie also had a huge amount of emotional weight and depth, wow this movie is a tearjerker, it was sometimes hard to watch, they didn't hold back with showing the effects of cancer which despite not being nice to watch was needed for what this movie was going for, and the diverse and different reactions from each person in Zach's life was truly powerful and heartbreaking. The final act was also perfect, the final performance and death of Zach was handled with care and perfection, the sense of love for him as everyone sang his song was truly for me powerful filmmaking that hit me hard and ended the movie in a sensitive and deeply moving way.Overall Clouds is my favourite movie of the year, the movie was powerful, heartbreaking and inspiring and really makes you stop and appreciate the life that you have."}, {"id": 33, "text": "I love this story tissues needed RIP Zach Sobiech."}, {"id": 34, "text": "Very touching true story about the last few months in the life of a young man dying from metastatic osteosarcoma. Very moving; I cried a lot."}, {"id": 35, "text": "Beautiful story and told with incredible detail and heart."}, {"id": 36, "text": "Don't waste your time! While the movie covers a some aspects of his life, the movie is not a good depiction of Zach Sobiech. Fin Argus does not accurately portray Zach. Most of the details about relationships are fiction. This story has drama on its own, it didn't need Hollywood twisting things around. Watch the Soul Pancake video on YouTube and you will get a better idea of who Zach Sobiech was. I fell in love with this story years ago, but this movie just seemed to portray everyone as jerks."}, {"id": 37, "text": "After the euphoria with this movie ended, I decided to watch this movie. I can say that it is not a special film, like all other films about diseases. the only thing i like about this movie is that the very nice songs on itunes are beautiful. I like hearing the right voice from him and her. listen to the songs, they are very beautiful."}, {"id": 38, "text": "The movie itself isn't bad. It's well acted, touching story about a teenager suffering from cancer and some of his final accomplishments.My biggest issue with it is these types of movies are largely the same. Sure they're based on true stories but Hollywood picks the feel good (well as best you can in these scenarios) stories. Person meets love, person accomplishes goal, miracle cure is found/happens etc. They tend to very lightly gloss over the person's suffering, their family/friends' suffering, just to make a heartwarming story.Enough have been done that you can pin the general outcome and they become depressing."}, {"id": 39, "text": "First hats-off for bringing this story in to a movie. This movie took control of my thoughts for the whole 2 hours and I can name this as best emotional story I ever watched. Amazing work no words actually. The cast is perfect! production is perfect! Great Work!!!"}, {"id": 40, "text": "When I saw this film is really love him singing his song. It so good i love this film. i think this film when he sings his song they are good. It think about his songs. When he had cancer it feel so sad. They film so good i really love this film. It raise my heart so high. I really love the cast of this film."}, {"id": 41, "text": "When I said I cried 14 times, I cried 14 times. And an additional waterfall at the end. This is the best movie you'll ever watch, but also the saddest. Definitely recommend."}, {"id": 42, "text": "Cried like a baby throughout this film, extremely sad but Zach has left his legacy. Beautifully made movie &amp; great acting from all the cast. Zach's family should be very proud of him."}, {"id": 43, "text": "I watched this movie with my 8 year old daughter, we started crying 15 minutes into the movie and cried throughout the rest of the movie. I loved the main character, his energy and the relationship he had with his family and friends. I didn't know this movie was based on a true story until the end of the movie, the fact that it's based on a true story made me love the movie even more."}, {"id": 44, "text": "The story tells about even if you are dying or not you should grab and live a life without fear. Like Zach, he was dying from untreatable cancer he went out there giving out his music, I have heard the song clouds before and I liked it, but I never knew the story behind it until today, finding out it was a true story only brought more tears to my eyes."}, {"id": 45, "text": "It made me freaking cry at the end. I hate this movie. It's cheesy, but also really good."}, {"id": 46, "text": "So it took me a second to find the movie because I couldn't watch it on Disney+. The site had many ads on that evening so it was quite hard to watch it at first and very frustrating so the beginning wasn't that sad for me. As I watch the film I feel a lot of emotions and thoughts... It was just amazing! And the fact that it is based on a true story it's just... I don't know how to describe it. It gave me a lot of motivation to do some things and make realisations about my life. So overall I would say go watch it! In my opinion you are not gonna regret it!"}, {"id": 47, "text": "It is a complete inspiration, the story is sad and lovely, what a human being great performaces, lovely movie, just watch it and please love oyur life and others, the song Clouds is beautiful"}, {"id": 48, "text": "One of the best movies of 2020 want to see more movies like this...and also there is lots of great music and good characters"}, {"id": 49, "text": "One of the saddest movies I've watched. Seeing how cancer affected everyone in his family and school, makes you realize it's a batlle for everyone included. Told in a beautiful way, switching from heart breaking to funny and sarcastic, his humor making this easier on everyone. Makes you think..."}, {"id": 50, "text": "I love it so much and i cried alot from the start of the film to the end"}, {"id": 51, "text": "This film start with the main character Zach talking about Superman, and he is a fighter scene! As turnout, this film is about a high school student Zach diagnose with osteosarcoma cancer, writing his sensational song Clouds to inspire people! Entire film full of touching scene, and quite connecting to audience's song scene! Make the film quite watchable! Touching scene! Such as, parents of Zach taking good care of him! Best friend of Zach Sammy, and his lover Amy loving Zach, even knowing he will die soon! The audience helping Zach sing the Clouds song at the Metro, after he cannot continue because of his illness! The song sing at Jason Mraz's concert I'm Yours, and the song sing by Zach and his father in the car Sum 41's In Too Deep, also quite connect to the audience! The quote of Zach in the film You don't have to find out you are dying, to start living also quite inspiring! At the end, an article indicate Zach die on May 20 2013! Sammy and Amy watching a photo with Z at the very end! Still have a series of the real Zach and his portrayal footage scene along with the end credit! That's it! A must watch film!"}, {"id": 52, "text": "This is a very good movie. I'm not one for Disney's lighthearted stories, but this was really relatable. I appreciated this movie a lot"}, {"id": 53, "text": "Another crowd pleaser by Baldoni It was a beautiful sob story with balance between humour and sad moments, and had an inspiring feel-good touch to it to chase your dreams. The fact that it's a biopic intensified the emotions attached to it. Although, there was more scope for expressing the sadness better, it wasn't as watery as it could have been with a 2hr runtime, and a somewhat predictable plot. It did not live up to the expectations set by the similarities with five feet apart. Overall, enjoyable, heart-warming story with a befitting soundtrack :)"}, {"id": 54, "text": "Clouds was a very sweet and sentimental film about a person that lived its life and end days to a fullest and showed to us how even disease cant stop us in delivering staff that we want.Story was very emotional at some points and it will effect many people in a lot sorts of ways.To me it suceeded in that mission and even if i didnt heard about this person before watching this film,i was still able to understand him and to feel sorry towards him in end.Perhaps this film is little on the nose with such sentimental things but to me it served its purpose and it give me a sweet and caring story about a life of young person"}, {"id": 55, "text": "This is so, so very long and nothing ever happens. I love you. I love you more. No I love you more. Blah blah blah. One of the most boring film I ever watched. Kids do not act this way in the real world Disney."}, {"id": 56, "text": "Zach Sobiech is an American hero and this movie is the greatest injustice ever brought upon him.If you watch this movie you're a bad person - shame on you. Nobody should contribute to the viewership of such pure and utter garbage. The 10 star reviews are obviously bought. This is the worst movie I have ever seen. The great pioneers of cinema would be rolling in their graves at the sight of such a movie.Show some respect for the Sobiech family and do not watch it."}, {"id": 57, "text": "We have had cancer as a big part of our family, my grandmother, uncle and my mother died from it, and I have been through 7 surgeries and 28 rounds of radioation. So my children have grown up with cancer being a big part of their life. So I decided to see Clouds with my 9 year old son.The story is beautiful told, I might wish that we have seen more behind in the mental strain, and I could understand (and know) that cancer patients faces. But overall the story is well told. And leave you both sad, emotional but also inspired."}, {"id": 58, "text": "There will be at least one point that hits you straight in the feels. I toughed the majority of the movie out with just a few misty moments and deep breaths before finally getting slammed a bit at the end. I would equate the sadness factor of this movie to the first 20 minutes of John Wick repeated over an entire 2 hour movie. Wipe your cheeks, blow your nose, and soldier on.At first, I didn't like it. It felt like the whole movie was going to be a heaping pile of sadness with random inspirational parts coming from his love of music and fulfilling his musical dream before he died. But, at some point while watching, I realized that the music didn't really matter. The cliché storyline that I thought was unfolding was simply not. The music was just his way of saying goodbye. Putting his final thoughts into words. It wasn't about the music."}, {"id": 59, "text": "This movie was great. Good humor. Good morals and message. Touching story and good acting because the emotions looked very natural and authentic."}, {"id": 60, "text": "Could have been a great story, but it just does not escape Disney's penchant for exploiting the real people. Probably the same applies for BMI and other media organization involved. While Disney did mention family's religion, it defanged it.For real emotion, watch I Can Only Imagine instead."}, {"id": 61, "text": "...they affect every single one of us differently. I loved this one so much that I had to rewind the movie a couple of seconds from time to time just to make sure I didn't miss any of the spoken words, heck, even facial expressions. I havn't cried in years, up until now. This story is very special. I just felt I needed to get this of my chest, because this movie made me look back at my life and I needed that apparently 👍."}, {"id": 62, "text": "I felt every minute of this movie in my heart. I'm in tears I can't stop crying. My dad have bone cancer and he's really in pain right now But he's fighting. Zack I love you so much and you will be remembered forever. We'll go up up up fly a little higher Neve Campbell you remind me of my mom. I'm sure your role wasn't easy at all but wow you gave it 100% I love you you're amazing great beautiful and talented actress human being."}, {"id": 63, "text": "Nice movie, i would give it 7.5/10 ... ..... ......."}, {"id": 64, "text": "Justin Baldino did a great job in bringing this movie to life and light.Based on a true story, made it especially inspiring. No cliches in this one, just straight smiles and laughs.Great work cast and crew."}, {"id": 65, "text": "I had high expectations for this and was let down. It felt very disjointed and rushed. I didn't feel like I was given enough background on the characters to care about them-such as Amy. The movie started out almost in the middle of their story, yet also the beginning of it, but it felt forced and rushed. The scene between Sammy and Zach was just kind of glossed over. Something was missing. Timing and pacing was weird. The scene when they leave for the trip and Amy comes over seemed rushed and out of nowhere. And other similar scenes. The acting was fine, dialogue was fine, story behind it was touching, but I needed more. More depth, just more.I love Five Feet Apart and that is fiction, but I felt like I knew the characters at least. I was hoping this would be similar."}, {"id": 66, "text": "Sometimes familiar stories and films with imperfections can even break through the mould and impress you. Recently released to stream on Disney+, Clouds is one of the most emotional films I've seen all year. Being based on a true story helped it in that regard, but the subject matter alone is what makes this film work so well as a cohesive film. Due to the nature of how this film was released, there probably won't be any awards consideration, and that's okay because I believe that if you stripped away the emotional core from this film, you'd have a pretty standard drama that you've seen a million times. With that said, here's why Clouds stands out as a very well-done true story.Based on the true story of Zach Sobiech (Fin Argus), Clouds follows him as he grapples with the fact that he only has a few months left to live. With this limited time, he chooses to make light of every scenario that he can, all while continuing to write and perform music in order to leave behind a legacy. With his best friend Sammy Brown (Sabrina Carpenter) by his side every step of the way and his new girlfriend Amy Adamle (Madison Iseman) doing the best she can to be there for him, every bit of this film is littered with emotional moments. Whether it be a new revelation about his condition or something his family did for him, I found myself in tears on multiple occasions. These aspects are both the strongest and weakest parts of the film as a whole though.Yes, I cried throughout the majority of this film, due to the great performance by Fin Argus and the fact that the screenplay by Kara Holden hit all the right chords for me. This is also where I have to make my one big complaint though. Yes, this entire film is tastefully done in every way, but the heartstrings of the film are pulled on nearly every five to ten minutes and even though it usually works, it just felt like a lot. Due to how strong the real-life story was, this film hinged on that alone, making for both a sad and repetitive watch. With that said, while watching the film, I did not feel this at all. I only thought the emotion was focussed on too much upon reflection, so I can't see that being a complaint for many viewers.Director Justin Baldoni also has a huge knack for directing films that are driven by a very heavy, emotional narrative. Although I really haven't seen much of his television work, I really enjoyed his feature film debut with 2019s Five Feet Apart. That film, much like this one, uses the emotional core of the story a little too heavily, but I found that it worked really well as an experience. Baldoni is a director that likes to let scenes drag on a bit and let the emotion linger, which I really appreciated about this film in particular. It can feel long at times, but that also felt like a reflection of how cancer speeds things up in a sense. I really enjoyed watching this film due to his direction.Overall, Clouds is a far better film than I was expecting it to be. Quite honestly, upon first viewing of the trailer, I had no prior knowledge of this true story or the music that made him famous in real life. For that reason alone, I think I appreciated the film even more. Never once did I feel the film dive into cliched territory because it all felt authentic and true. If for nothing else, Clouds is absolutely worth watching if you like a good cry when watching a film. It absolutely tugged at my heartstrings and I feel that many viewers will have that same experience. Clouds is now streaming on Disney+."}, {"id": 67, "text": "That makes people look like theyve been binging emotions inside a bunker , sniffing and snorting teargas, just to be able to still feel alive after viewing a film like this, because its a sad true story with extreme high and lows, and extremely disney guttsey, and remember toothpaste wont releve the pain so dont smear that into your eyes.its a cancer in youth film plus music talent on the plot, with swirling talents of the acts, and a cosy musical content that that lures you into the abyss of deathg and despair. its clever but genericly made, even though based on a true cloud(story)so if youre babysitting tonight with your love one, balm yourself in handkerchiefs, youll need them, i will for sure evade and evacuate miself from the premises when my better half through an awful lot of years will be introduced to this sadeyed megamonster deathromcom flick, the mourning usually lasts 3 days and three nights after an event like this( and i will never forget the titanic days)so im grumpy and old and not easy to frail, but it took me over the edge , so have a look at my recommends"}, {"id": 68, "text": "The words to define what Justin Baldoni is doing are fighting and making dreams come true, ever since I discovered his life after being Rafael in JTV my whole perception changed, he's an amazing actor and even bigger director, but also an amazing husband and father and in general, an amazing man. I love how he has gotten his wife a role in both of his movies, and he even appeared for a tiny second in this one.He has an extraordinary gift to keep your eyes on the screen even if you are crying and sobbing, in a world of movies with no special meaning, no learning and no faith in humanity and such in a tough year for everyone, this movie is literally a ray of sunshine in our lives.Every single second if worth it, every single second shows truth, pain, dreams, strength and finally love, family and relationships fill out lives with meaning, even if we only have a few months to live.Enjoy every day, love with everything you have."}, {"id": 69, "text": "Clouds is an inspirational story that helps the viewers to realize the value of our time. Not only is the message beautiful, but the cinematography is beautiful, as well. It is a powerful film that will make you reach for tissues.The film is based around the true life story of Zach Sobeich. Zach was a high schooler diagnosed with osteosarcoma, a type of cancer, and told that he had less than a year to live. Instead of giving up on the rest of his life, he decided to make the most of it. He started to write music and set up the band A Firm Handshake. He wrote the song Clouds, which was a viral hit on song charts in countries around the world. Zach Sobiech inspires others to do the same as he: make the most of life. In the film, Zach Sobiech (Fin Argus) tells viewers that you don't have to be told you are dying in order to start living.Zach Sobiech's best friend Sammy, is played by Sabrina Carpenter, an exceptional actress who draws the audience into the emotional scenes. The family members of Zack Sobiech, such as the mother Laura Sobiech (Neve Campbell), the father Rob Sobiech (Tom Everett Scott) and the sisters Alli and Grace (Vivien Douglass and Summer Howell), are all exceptional actors as well. You can see how much they care for Zach Sobiech, how much they love him, and how badly they want him to live. The intense emotions they are able to convey is what brings the audience to tears.The strategic cinematography by Ben Kutchins also brings the audience into the scenes and makes them feel as if they are right there, in the moment, with the characters. The strong performances of the actors combined with the excellent cinematography helps to deliver the message of the story right into the viewer's hearts. My favorite scene is when the story comes full circle while Zach is performing for his audience. They sing his own song back to him, just like he dreamed. At that moment, I felt really proud of him, and I felt his happiness.The message of this film is to start going after your dreams now. Zach said that teens mistakenly feel invincible, and we always say that we'll start working towards our dreams tomorrow. Zach's story proves that life is a gift, and we have the power in our hands to make the most of it. With time, we can do anything we want, achieve anything we want, and be anything we want. We just need to take advantage of that power.I rate Clouds 5 out of 5 stars. I really loved it, and I think that everyone else will too, even adults. I recommend it for ages 13 to 18. You should definitely go watch it now! Clouds is streaming on Disney+!Reviewed by Jolleen M., KIDS FIRST!"}, {"id": 70, "text": "4 out of 5 stars.Clouds is a musical drama film about a high school teen Zach (Fin Argus) who is suffering from a terminal illness. After years of treatments and nothing stopped the illness. Zach decides that he cant stop living and decides to follow his dreams. And sing with his best friend Sammy (Sabrina Carpenter). Which there duo sparked a high rating on youtube. Which gets the attention of radio stations.It is an emotional and powerful plot. Tough to watch someone going through an illness. While feeling lost and short on time. Zach never stopped fighting. Fighting to live his life still. Fighting to do what he wants. Trying to make others happy. Trying to be there for his girlfriend Amy (Madison Iseman). Trying to be there for his best friend Sammy. And being there for his family. Its a good inspirational and sad movie about a message of struggling and living life.The cast ensemble did good. Fin Argus did a fantastic job playing a character that is struggling. Sabrina Carpenter, Madison Iseman, Neve Campbell, and Tom Everett Scott all did good. Lil Rel Howery did good playing Zachs inspirational teacher.It is a feel good. Emotional and strong film. Which the climax and final moments of the movie was very hard to watch."}, {"id": 71, "text": "I have to admit, I am somewhat positively biased towards films and TV shows that deal with serious illnesses like cancer. Even more so when the plot is based on a true story. Still, it always remains to be seen whether or not the adaptation is respectful to the real life tale and the people within it. I'm happy to say that I think that 'Clouds' does Zach Sobiech's incredible story justice.First and foremost, this film made me bawl my eyes out, which was obviously its intended purpose. Zach, played by Fin Argus, is such a kind and spirited person, and it is both heartwarming and heartbreaking to see how cancer can so abruptly impact someone's life like it did in the film. We follow Zach as he deals with being terminally ill, and how his subsequent decision to start making music inspired thousands of people worldwide.The film leans heavily on making its viewers as sad as possible, taking every opportunity to implement a scene that tugs at the heartstrings and can cause anyone to spontaneously burst into tears. It's a tad melodramatic at times, which kind of takes away from the stark realism in the rest of the movie, but that's only to be expected from an adaptation like this.We get some interesting character development between Zach and those people close to him, who all deal with Zach's illness in different ways. Everyone in the cast delivers solid performances, with Lil Rel Howery being the standout amongst the supporting roles in my opinion.Aside from the story, this movie's true star is of course the music. The songs that were actually written and performed by the real Zach Sobiech are absolutely gorgeous, touching, tragic, beautiful and all the things... It's no surprise that the movie's titular song topped the iTunes song chart for the second time after this film's release.All in all, this is just a great film. If you need a good cry, I highly recommend it."}, {"id": 72, "text": "What a beautiful movie! I read a little about the movie and the director's personal experience with Zach before watching and it's incredibly apparent how much this young man touched the directors heart. There was definitely something real and personal about the movie.I'd never heard of this talented and brave young man's life before this movie, despite being heartbreaking in so many ways for so many people in his life, it's also at the same time incredibly inspirational.There were so many layers to this story that included different people in Zach's life, Zach's personal journey with cancer, how those close to him were dealing with his diagnosis and the music.Truly emotional throughout I cried many times for many reasons.I look forward to seeing more movies from Justin Baldoni as he's proven that he has great talent in making movies with so much love and heart."}, {"id": 73, "text": "I know you might not know what this film is but Clouds is a 2020 Disney Plus film that came out in October. I found out about it because I got Disney Plus to watch The Mandalorian again. I ended up enjoying this film more than I thought I would.Clouds is about a boy named Zach Sobiech (Fin Argus) who has cancer and only has a few months to live. Knowing this, he does everything he can with his girlfriend, Amy (Madison Iseman) and his best friend, Sammy (Sabrina Carpenter) to make them feel happy.Disney Plus has offered a mix of films. They have offered distinguished films like Togo, mediocre films like Lady And The Tramp, and hard to watch films like Noelle. So I didn't really know what to expect from this film. I think Clouds falls into the mediocre category. I was in a good mood after Clouds. That might have not been the films goal because many people have said that they were sobbing like a baby but I wasn't. I am not some machine that doesn't cry for any movie. Believe me, I have, but this film just didn't really feel like a dagger in the heart as it did for many people. I found that to be a problem. It just felt awkward because the film took sort of a crying break after a sad moment but I wasn't really tearing up. The director is Justin Baldoni. He also did Five Feet Apart and that film also had some awkward crying breaks. Besides that though, the story was fine. It wasn't anything special. There were some funny moments but also the dialogue came off really, really basic. There were just many lines that you have heard so many times before. For example they said I just act that way sometimes. That was a major one that got me furious. There were just so many lines that did that. There was a love story that was going on in the film too. At the start I thought it was going to be like the John Hughes film, Some Kind Of Wonderful but then morphed into something different which was refreshing because of how basic the rest of the plot is.The acting in the picture was what I expected from a movie like this. The leading actor, Fin Argus, did fine. His performance was nothing Oscar worthy but it was just fine. Neve Campbell playing his mom in the picture and was mediocre in it. Her best performance is still the Scream films. Lil Rel Howrey was also a teacher in this film. He was a fantastic character that did add to the story. I have only seen him playing a comedic character before like in Uncle Drew. In this film he still had the comedic attitude but was also very caring and compassionate to the main character. Sabrina Carpenter played Zach's best friend, Sammy. She has been in a Disney media before. In any of the Disney Plus originals there is always a Disney Channel star unless they moved the film off of their release schedule for theaters. She was okay in the film though. Madison Iseman played Zach's girlfriend. This has been her biggest role yet. She has been in Jumanji but not much besides that. She played her role well but it was nothing special. Overall, the acting was just mediocre.The score might have been the best thing of the whole picture but it was nothing I would listen to outside of the film. It was mainly piano or a stringed instrument which it typical for a sad film. It did its best to try to add emotion to many scenes in the film but ended up just being the star of the scene because of how sloppy the plot ended up being.Clouds had potential to be an emotional ride but ended up feeling like a sloppy film that had exceptional acting. I would recommend this film to anybody who has Disney Plus already."}, {"id": 74, "text": "I was looking forward to seeing this movie ever since I saw the announcement. I've known Zach's Story for quite a while and I love the song Clouds.But this was way too sappy, so many quotes that nobody in real life says, it felt too fake. You know when a movie tries so hard to be emotional? this one did.It also felt quite rushed, especially when they travel, everything happens too fast, I also feel there wasn't enough Zach and his insight of things. It's like he's just there.It's a shame because his story is very moving but the film failed to capture that, songs were nice tho.If you like this type of film, I recommend Now is Good and 50/50, they're far better in my opinion."}], "reviews_amount": 75}