{"name": "Radioactive", "titleId": "tt06017756", "reviews": [{"id": 0, "text": "Although the movie title is 'Radioactive' I though it was the story about Marie Curie and I'm disappointed that so much included was not related to the research / achievements of Pierre and Marie Curie e.g. the atomic bomb dropped on Hiroshima and the Chernobyl disaster - neither of which are related to Polonium or Radium (which were discoveries of Marie Curie) The only thing they have in common is that they are 'Radioactive'."}, {"id": 1, "text": "It's not clear what message they are attempting to send in this film. Are they trying to convey that Marie Curie was a genius, or an idiot? At one point in the film, people are already making claims that radiation is causing health issues. Long after that concern is expressed, Marie is still sleeping with, and apparently (at least sometimes) carrying around, a bottle full of radium (almost like it is a talisman). And yet she then tells her daughter that should doesn't won't her working in any radioactivity-related research, because radioactivity could endanger her health. Having not read any biographies about Marie, I just can't help but wonder if any of this is based upon factual evidence, or is it all just embellishment for dramatic effect?And then, the film is interleaved with numerous future events, in the midst of telling Marie's story. Each of these segments depicts mostly horrific events related to future uses of radioactive-based inventions, e.g. nuclear weapons, a nuclear reactor meltdown, etc. What does any of that have to do with Marie Curie? She didn't INVENT radiation. Radioactive material simply exists, and she just happened to discover some of its elements. Showing all of those future events sure seems to send a mixed message, seeming to imply Marie Curie's culpability in those events (which is, of course, ridiculous). Each of those future insertions just seemed completely unrelated to telling her life story, and they were (in my opinion) simply a waste of time, and a useless distraction.The film has some excellent actors in its cast, but I just felt like they were misused, giving you only a shallow and confusing look at the life of this important scientific pioneer. I don't mean to imply that it is unwatchable, but as someone else has already said, it seems more like a soap opera than a legitimate biographical account."}, {"id": 2, "text": "... but it still wouldn't shield you from some pretty poor editing and a story condensed into 100 minutes about a great woman who deserves so much more but seems to get the blame for Hiroshima, Chernobyl as well as errant husbands."}, {"id": 3, "text": "The movie is ok. Actors are great and the science part of the story, though they don't show much. BUT for some reason it cuts to the future (multiple times) to the a bomb drop and Chernobyl but it fails to show the governments and companies involved, so sort of implies Madame Curie is reasonable for those events. Which is ridiculous. It's like saying Newton is responsible for all plane crashes because he discovered Gravity!"}, {"id": 4, "text": "This attempt to tell the complex story of Marie Curie was nothing more than a directorial vanity piece. Worse yet, its combined focused on her sex life and the terrors-to-come of radiation made it feel as if she was/is solely responsible for millions of deaths from nuclear bombs, disasters and accidents.I did not like this story line. We needed to see far more about HER life, e.g. the circumstances that brought her to France from Poland, or more insight into her struggles, as a woman, to actually conduct her science.The film itself was atmospheric but so much of it was wasted on NOT advancing her story.Sad effort. Just sad."}, {"id": 5, "text": "Marie Curie became more prominent after her death especially around the early years this century, so a film about her life and achievements was a welcome view. There are a few changes in the facts, probably to make this move more dramatic, but perhaps the book from which this film derives, was written like that. The tough days in Marie Curie's life when she arrived in Paris is hardly touched, which undoubtedly lead to her stubborn attitude which is over characterized in this film. In real life she was not such a hard and difficult person."}, {"id": 6, "text": "This movies takes a heavy duty subject, interesting mostly only for those who care about science and scientific leap-of -progress and attempts to turn it into something fit for public consumption,... oh and of course pressed into 110 minutes. Valiant effort, but it fails at mostly everything except some decent visuals, the science gets butchered (starting with omitting the co-Noblist Jacques Becquerel entirely) , scientific history gets butchered massively - possibly offending scientifically minded audiences - , the story stays utterly tepid and lukewarm, loving clicheed imagery of France and grows utterly trite when the movie tries to depict Pierre Curie as stealing Marie's thunder at the Noble price after fighting valiantly to get her included in the honour in the first place and flat-out lying about the whole procedure and Marie's presence ..... and even Rosamunde Pike struggles with what the director requires of her to carry especially with some of the most forsaken dialog possible. One clearly notices the director visualized this as facts-poor graphic novel.The flash-backs and flash-forwards do stray in the realm of the overly melodramatic, driving home some binary, un-nuanced and utterly stereotypical assumptions (there is a short flash forward episode showing Chernobyl which given last years NF series feels utterly silly ) , and looses what energy it had extremely quickly after Pierre Curie passes out of the storyThis bows too much to current Zeitgeist and ignores realities and established facts about real events, loosing the outstanding contributions Marie Curie made to science in the process .That would have made a spectacular movie. This ? This I would not recommend it even as a hagiographic biopic"}, {"id": 7, "text": "Marie Curie was born as Maria Sklodowska in Poland (actually in Russia, because Poland didn't exist until 50 years later, but who cares for those details...), went to Paris to study, married Pierre Curie, discovered two elements, gave birth to two daughters, won two Nobel Prizes and had an affair with a younger colleague whose wife made a huge scandal. You knew all that already? Then you'll learn no new facts about Marie Curie by watching this movie. Should you watch it anyway? I made a checklist to help you decide.Do you like: dialogues that sound like they were written by talented junior high school students?actors that always look like they're 32, no matter what age the character they play is?today's viewpoint projected on the person and her life rather than the historic character in her time?images of what early 20th century Paris would have looked like if it had been not in France, but in a Hollywood studio?erratic jumps in time?inserts that are totally uncorellated to the story except for the fact that they have a connection to the title (radioactive)?Then go for it. But if you want to learn something about Marie Curie and her achievements, stay away, because you will be disappointed.They say nobody lies on their deathbed wishing they had spent more time in the office. This film made me wonder if that is true. For the first time in my life, I wished I had worked overtime instead of going to the cinema."}, {"id": 8, "text": "Fine to watch once but for some reason skips to future (hiroshima and chernobyl)? Why it does this is just plain ignorance or just weird.Not sure what message the writers are trying to send here but seems to be a mixed message."}, {"id": 9, "text": "This movie gave me a headach. Such lazy writing &amp; badly written screenplay. Not recommended at all... One of the greatest minds of 20th century definitely deserves a better biography."}, {"id": 10, "text": "The real story of Maria Curry isn't told, especially the scientific story. It should be a thriller, with the theory, the skepticism, and finally the triumph. Instead this is a movie about relationships. The actors aren't at fault. The scrip-writing is good, but the storyline isn't. I'm not sure who is responsible for the problem. Is the director responsible for the story? Did they take this from a book and cut out so much that it lost meaning?Even if we make this a story of her struggle against misogyny, it is a swing and a miss. We don't see her struggle significantly. She doesn't clearly triumph. No one, but her, acknowledges her brilliance. She got a professorship, but we don't know why - was it in deference to her deceased husband? We don't even see her teaching.I quit watching after seeing her in bed with her brother-in-law (her husband recently died). It isn't that I'm a prude, it is rather that the story failed to make a case for me to like and respect the character. Why else would I be interested in a story?They complicate this by going on about the atomic bomb in the fifties and sixties. I don't see the connection. They discovered the nature of the atom, but they aren't responsible for the atomic bomb. Of much more importance is the radioactivity of the substance they discovered. How many people died because they painted it on their teach? How many contracted cancer from watches with it painted on dials. Marie Curie died from it, when did she become aware of the health hazards? This is a matter of interest. The starvation of scientific detail is SO disappointing.Marie Curie is a giant in science. The story wasn't of this, instead it was about her idiosyncrasies. They got a home run pitch and choked."}, {"id": 11, "text": "Was hoping for so much more from this Biog of a real life science hero. Nothing positive to say about it. Plot badly written. Historically inaccurate throughout - some of it obvious - some brought to light on googling the real story. Confusing style and there was something cartoonish about the whole presentation. Somebody please make another film about Marie Curie - it could be great. Summary - emotional woke tosh with neither historical accuracy nor quality plot to retain the viewers interest to the end. Bailed out 40 minutes before the end"}, {"id": 12, "text": "I was waiting impatiently for the premiere of this movie. Having Rosemund as main role, semmed to be the guarantee of a great movie, but tens of millions of dollars have been spent showing the downsides of radioactivity, as they were all Curie's fault, and a couple of dollars in ending titles to show their benefits. I am really upset with this movie. It has sunk, a great actress and her path to the Oscar, and at same time one of the greatest female scientists in history."}, {"id": 13, "text": "It's a mess. I love biographies and this is one of the worst I have seen. Just avoid it."}, {"id": 14, "text": "Firstly, it is not accurate to depict Chernobyl and bombing in Hiroshima in parallel to the movie of her life. Her and Pierre's work should be separated from such misconceptions. Although, they found the elements, they did not have the formula/mathematical proof to create the necessary conditions for war or nuclear plants. The formula came from Einstein years later. So the movie tags their work with a misconception. Secondly, there is a huge hole about how she raised Irene. The movie should have focused on that instead of her connection with Paul Langevin. Marie never let Irene fall short of her potential by raising her alone and so ultimately the message doesn't come across as positive like it is actually. This movie screws the reality and skips through a lot."}, {"id": 15, "text": "If someone watched this film and didn't know about radium and polonium they would thing that Marie and Pierre Curie we're monsters for discovering these elements. The discovery of these elements has saved more lives than they have killed. There was no need for the clumsy, sometimes fantastical story line that has no basis in truth, and poor confusing direction of the awful things that man did with these elements. We are not stupid! Hopefully one day we will get a well directed thoughtful story of the life of Marie Curie but this isn't it."}, {"id": 16, "text": "There are two fatal flaws with this movie. First it's made to appear that she discovered these new elements very quickly when it took her years and under very difficult conditions. It also gloss over the difficulty she had getting any recognition for her work and makes her appear hysterical and demanding. The second flaw is the flash forwards (which are odd) implies that her work led to the atom bomb and Chernobyl which is mindboggling as she had nothing to do with either. As a side note the clearly British accents are annoying considering she was Polish and she's living in France."}, {"id": 17, "text": "Rather boring. No chemistry between Marie and Pierre yet supposed to be passionate about each other. Film with Ingrid Bergman playing Marie Curie far superior. Flash backs and jumps to the future somewhat confusing."}, {"id": 18, "text": "Thought this was going to be an enlightening movie about Curie and the hard work and difficult life she and her partner led in discovery of the elements. Instead, it was a drab poorly edited story implying the discoveries were used primarily for destruction. IF one wishes to watch an engrossing COMPELLING account... suggest Madame Curie with Greer Garson and Walter Pidgeon (1946) to get the feel of the periodcandvthe intensity of Curie's devotion to her work. This production was poorly edited moving all over eras without allowing you to relate or understand a scientists true vocation."}, {"id": 19, "text": "I was so excited for this and then so let down that I didn't even finish the film. I'm not sure what the point Or direction of this film was. It doesn't truly dive into Marie's scientific work or her husband's, but instead scratches the surface while sort of portraying an awkward love story but never really making it believable. For such extraordinary people who made life-changing discoveries, this portrayal is pathetic and severely lacking in every respect."}, {"id": 20, "text": "Juvenile direction and storyline. A waste of good actors and an excellent story."}, {"id": 21, "text": "Mostly a soap! So much has no historical validation and so out of sync with the values of the time and unlkel"}, {"id": 22, "text": "For anyone who might not know, the 2018 movie Entebbe is supposed to be about Israeli special forces rescuing the passengers of a hijacked airliner. The actual raid, the supposed topic of the movie, is only depicted for about 5 total minutes in the film. Even worse, scenes of the raid are interspersed with some scenes of a completely unrelated musical-art stage production. What the ....? Radioactive has the same pointless artsy angle. Instead of simply depicting Curie's tumultuous life, the film mixes in scenes of a completely unrelated dancer on a stage and other pointless bits. Radioactive is a postmodern biopic that doesn't focus on telling the story of its subject's life, like a comedy special with no jokes."}, {"id": 23, "text": "Hohum till Nobel prize speech and something about radioactivity falling into criminal hands. ...next scene the EnolaGay dropping a bomb on Hiroshima (ending WWII and saving a million lives). sneaky inaccurate misrepresentation of a complex bit of history"}, {"id": 24, "text": "It's just awful. I feel bad for the cast, they don't deserve this."}, {"id": 25, "text": "What's with all of the sex and nudity? Yes, we know a husband and wife have sex. It's over the top. Thought I was watching the psychedelic Across the Universe for a minute."}, {"id": 26, "text": "Madame Curie was a brilliantly complex woman. Her work was so essential to life as we know it. I think it would be difficult for any movie to completely capture who she was, let alone her incredible work. I think picture did a fine job of it. It's important to understand her accomplishments in terms of the chemistry in order to grasp the movie as a whole. Her diligence to the work and her extreme intelligence was so profound."}, {"id": 27, "text": "Let me know if the book is good, but that film is certainly average. It mixes choppy links between Hiroshima, Chernobyl, and Marie Curie's work with the story of her life. Marie Curie's romance with Pierre Curie is cringe and cliché and their characters are flat. All of those elements are explained with pretentious hallucinated sequences of pseudo-philosophy. I also had to make a special dishonorable mention to the hairstylists. Radioactive is clearly not a worthy homage to Marie Curie and her family."}, {"id": 28, "text": "Beautifully filmed and well acted, it's such a shame that the screen writer seemed to have read the wiki page on Marie Curie then forgot most of it and muddled up the rest. The story presented is close to the truth, while getting almost nothing factually correct and missing out some of the most amazing parts of her life and career. This is then interspersed with random scenes of Chernobyl and atomic bombs, which have about as much to do with her research as the machine gun has to the discovery of iron ore. This film is lazy and demeaning to a great women. It's a real shame because there was so much potential for a classic film about a great figure."}, {"id": 29, "text": "Our main problem upon watching this movie? is that despite a great effort from the cast it never found its way nor decides what it wants to be. Is it a documentary? No, it's not, those flashes moving way forward in the future made no sense, especially in the middle of the drama. Marie Curie's life was super exciting, not only because she was a woman back then doing what she did but her achievements alone, despite her sex, entitles her to a great movie that is yet to be filmed. The ending was one of this WTF moments that I couldn't pass, me and my boyfriend were silent for a while with: is that really end?Well, it was."}, {"id": 30, "text": "Great acting belies the political agenda undercurrent To play on emotions by showing an idyllic setting in Japan being destroyed by the Hiroshima bombing is offensive to the Americans who died at Pearl Harbor and WWII as well as the millions of people who died at the hands of Japanese forces.Had the bombing been shown with the true context, the movie would not have the inherent bias and obvious political message portraying Americans as evil. War is hell, all the bombings and deaths are tragic. Just remember that as horrendous as the bombings were, it ended the war. Radiation has saved more lives than it has hurt and that is only brought out briefly at the end.Meanwhile, the tobacco industry keeps killing more people every day than radiation ever did but Hollywood is beholden to its money and showcases cigarettes in every movie."}, {"id": 31, "text": "Stopped watching when they suggested criminals dropped bomb on Hiroshima. More anti-military/US I have come to expect. By their logic, The Curies are the criminals for discovering it."}, {"id": 32, "text": "Rosamund Pikes performance was phenomenal! The way the future use/ abuse of radioactivity was interwoven with the story very intriguing. I enjoyed this movie tremendously!"}, {"id": 33, "text": "I thought it was bad BEFORE the Curies talked about ensuring that radioactivity needed to be kept from criminals immediately after which they cut to the Enola Gay dropping the bomb on an idyllic, peaceful scene in Hiroshima.It got worse from there"}, {"id": 34, "text": "How can such an amazing and captivating subject like the live o Cutie can be made in such a boring movie? You never nothing for the loveless characters in a bland script."}, {"id": 35, "text": "I will never fund these peoples career again. I enjoyed the advertisments more, the cinema was empty. I actually did get up and leave. My issue was a bibliography recount, starting at the end, where she gets sick and falls over, with a poor music production. The effort to recreate and show historical detail seemed very realistic. The effort to create drama was disgusting. I beleive the film should have been fun and lighthearted. It got ruined."}, {"id": 36, "text": "I'm reading about her life and it seems to me that it's missing so many details that I think they could be important to someone understand how strong and powerful this woman was in her time. She grownup in a time and a world that was built by men's and for men's, despite of that she never gived up and she worked very hard. The references to atomic bomb and Chernobyl I think that is to make us think that everything in live has two sides. Although something was discovered for the good of science someone else, unfortunately, can use it to destroy."}, {"id": 37, "text": "Actores were good (that's why the 2 stars) but the movie is just bad. Disrespectful for science to make such a bad movie about a great scientist such as Marie Currie. Also the romantic part with the second guy was just ridiculous and only to make it a bit of a show. This should be about her achievements and greatness. If you want to do a movie about Marie Currie do not try to make it a romantic one, it's just embarrassing!"}, {"id": 38, "text": "Any reason to include skinny dipping? Shabbily made movie"}, {"id": 39, "text": "The first half hour or so is a pretty good historical drama. Then, it takes a hard LEFT turn, devolves onto a series of slow, disconnected and incongruous scenes. Like in one of the fast-forwards, a billboard advertises See the bomb, 50c. Yeah, we sold tickets to our nuclear tests. Evil Americans. Occasionally, as during her Nobel speech, the soundtrack is some electro-synth stuff right out of the 80s. Lastly, for some reason, almost every scene has some blazing white light source. This affectation adds nothing."}, {"id": 40, "text": "The film portrays Marie as the lead in the radium and studies on radioactivity. It commits the same sexism it wants to portray in men. It really diminishes the teamwork. Pierre Curie fought for his wife to be recognized for her equal contribution. Acting is brilliant"}, {"id": 41, "text": "30 mins in and the entire script is focused on her needing validation both academically and romantically - have we not gotten past these tropes yet?"}, {"id": 42, "text": "Deserve a A+. I'm not cool like all the dudes who gave it a 2 or 3 but I do enjoy a well made movie that educates me, which is exactly what Radioactive did. Thank you Prime. Keep up the good work. You are giving all the cool people something to turn up their noses at and entertaining Neanderthals like me at the same time. This is something to be proud of."}, {"id": 43, "text": "This movie could have been so much more. I was so excited for this to come out. It's such a waste. This movie should of and could have been epic and worthy of the work the woman did in her time and advancements she made at a cost Shame on who made this."}, {"id": 44, "text": "Being a student of Chemistry Marie Curie has always been an inspiration for me being especially being a woman in science when only very few women even tries to enter sciences. Her contributions to physics &amp; chemistry are phenomenal to say the least. A great mind, a genius, she was ahead of her time. Cant even imagine the looks &amp; gossips that went through behind her back. But this movie even though less than 2 hrs still very lukewarm compared to her persona &amp; contributions. Overall worth 1time watch but if u read or watch her biography on youtube that's more interesting than this movie. Rosamund pike was good the rest of the cast average mainly bcoz they had nothing much to do."}, {"id": 45, "text": "Radioactive is a solid movie with some interesting screenplay decisions and directing. Overall it's effective at getting MME Curie's motivations, ambitions, and accomplisments across. Thorne and Satrapi provided an interesting take with mixing modern applications related to radioactive decay and uses both for good and war.I thought Rosamund's performance was excellent and Riley's as Pierre was also good.As a bonus, teachers have access to a guide that goes into her work and chemistry more on the movie page seperate from the movie."}, {"id": 46, "text": "Agreed this movie could have been much better. But by no means it is below per. Kudos to the production house for making this movie in spite of knowing that the target audience will be limited to those having science background. Full marks for a great effort towards bringing the life of a scientist onscreen. Highly recommended watch."}, {"id": 47, "text": "It started out as such a promising and historical piece of cinema. Until it got about 45 minutes into the film and started to talk about how radiation and radioactivity is a great thing unless it's in the hands of evil criminals and that's when it cut to a scene of WW2 with the US military in an airplane flying over Hiroshima about to drop the bombs. That for me made me turn the movie off right then and there. I don't need to waste my time on movies that are being played in America but calling my ancestors, my grandfather who fought in World War Two, evil and a criminal. So yes, if I could lower my rating, I would."}, {"id": 48, "text": "It is good to see a biographical film of Marie Curie. However, Hiroshima and Chernobyl are just not relevant to her life, and I'm puzzled by the addition of these events in this film."}, {"id": 49, "text": "To be seen despite its faults. She was a great woman who should be more than a snapshot in our cultural memory.Some liberties taken with fact were just unnecessary and unwanted. For example, It was a male Swedish mathematician that ensured her inclusion in the 1903 Nobel Prize, not husband Pierre. And her husband did NOT go to the ceremony and leave her behind. Neither went.The melodramatic cutaways to future events depicting the legacy of radioactivity seem shoe-horned in.But at least Marie is not made to sing a pop tune in the finale - as Almereyda makes Tesla do in Tesla (2020)."}, {"id": 50, "text": "When people think of famous FEMALE scientists, Marie Curie comes to most people's minds. She was Polish but moved to France and, with the collaboration of her husband Pierre, discovered two new elements, Radium and Polonium, and established the new science of radioactivity, a term they coined. She also stands out for being the first woman to receive the Nobel Prize for Physics and is the only person to have won two Nobel Prizes in different categories (the other in Chemistry) All this in an age when Science was the chief domain of men, and as a result, she had to fight some discrimination to get her science heard.Radioactivity(2019), directed by Marjane Satrapi is a movie that looks at the life of Marie Curie, played by Rosamund Pike. Based on the graphic novel by Lauren Redness, the story is told in partly a flashback fashion. The movie opens with her collapse in 1934 and her being rushed to the hospital. We are then taken to various stages of her life, in chronological order.it explores her life after her arrival in Paris in 1891 (the movie starts in 1893), her scientific work, her life with her husband Pierre whom she married in 1895 , the collaboration she had with her husband in discovering the two new elements, up until his untimely death in 1906, the scandal that involved her extramarital affair and finally her humanitarian work during World War One.I'm resisting a full synopsis of the movie. Her life is very well chronicled, and worth researching and for the most part the movie is faithful to her storyThere are a number of key themes that run through the movie.First is the strong determination that Marie Curie possessed, and this is well brought out by Rosamund Pike. At times it borders on arrogance and in fact her husband (played by Sam Riley ) says as much. This is not surprising since this allowed her to achieve what she did. As well as this, the movie champions Marie Curie as a female role model, who is independently minded and a few key scenes bear that out. I do see this as a strength of the movie.Another key theme is the impact that their work on radioactivity had on the future. At a number of stages we get fast forward to future events that involve radioactivity, some positive, some negative. It seems that the director wishes to remind the audience that Curie's work had an impact on our modern world. I'm not sure if they were necessary, but I will let other viewers make up their own mind The issue here is that the intent seems to suggest that the Curies' discoveries are responsible for these events. This is a long bow to draw. Not only was Radium and Polonium not involved in some of the 'consequences' later shown, There are many more other discoveries that were needed for those 'consequences' to occur.Finally, is the point that there was a growing awareness of the dangers of radioactivity, with the slowly declining health of not only Marie herself, but her husband as well.As a science communicator I wanted to watch the film to get a better appreciation of Marie Curie as a person, in the midst of her scientific work. I had hoped for some more detail on her scientific work, but the movie is more about her as a person than her scientific work. So although we get a good insight on her process of extracting the new elements from pitchblende, and the resulting discovery of Radium and Polonium, it does not take prominence over the story arcs of her relationship with Pierre and her later life after his death.Overall the science process is accurate, though not fully detailed. This includes the extraction of unknown elements form the pitchblende and then the used of chemical means to isolate and crystalise the elements. I jarred a bit by the use of animations to demonstrate the atoms. At one point Bohr models were shown to show Radium and Polonium, when they weren't in use until much later. Similarly a nucleus is shown with protons and neutrons and that structure wasn't established until the 1930's. However, I understand the director's choice here, as they are the models more familiar to the general public than the Thomson model which was the model at the time.So is the movie worth watching? If you want to get an understanding of the life of Curie during the time of her discoveries, it's fair. It is slow in parts, with some smaller themes not really necessary, such as Pierre's interest in spiritualism. I wish they also touched on her later life post war.I found the ending a bit weird, involving her death scene. I won't elaborate on the details but they suggested Marie had some regret in her discoveries, with Pierre saying you cast a stone in the pond, but you cannot control the ripplesThis is probably my main gripe. To somehow suggest Curie was responsible for future events and that she somehow know this. The use of cut scenes in the future were used to make this point and they really impinged on the flow of the movie, and as stated earlier, really don't connect well to the work of the CuriesGo and watch it but I think you will get a deeper understanding of the amazing and complex life of Marie Curie from a good biography."}, {"id": 51, "text": "Great source material, excellent cast, but pedestrian script and production relegate it to the maybe worth watching if you don't have anything better to do category. Overly-melodramatic and basically a series of tableaus rather than a real story about real people. The Curies deserve better - they had amazing lives."}, {"id": 52, "text": "It's hard to say why this didn't work, but I've settled on poor direction and poor casting. The director simply didn't get enough from the quality actors at their disposal. The quality actors were the wrong ones for the part, especially Marie, who was so unlike the real Curie as to be constantly unconvincing. This combination made for a dull, largely shallow biopic. And Marie's death walk through people she'd affected in the future was just shocking over-dramatisation."}, {"id": 53, "text": "Great summary Of Marie Curie's life and achievement"}, {"id": 54, "text": "The script was trash, but i thought the surreal effects were what kept it from being more boring than it otherwise could have been. it's not a great film, but i can always appreciate strange creative choices.... i think it would have been better if it had been more surreal throughout... maybe like a time travelling dream."}, {"id": 55, "text": "Rich material and great central performances completely spoilt by the bizarre flash-forwards and moralising about things Curie could never have known. it becomes an absurdist diatribe against all things nuclear. The most egregious was a scene of the bombing of Hiroshima narrated as a criminal act of agression against a peaceful sunlit population. Hiroshima was horrific, but its intent and impact was to end an unending war and minimise loss of life. Indeed it was hopefully spoken of as the weapon to end all wars. The 21st century politics of the writer and director corrupts what could have been a exploration of the excitement of the modern scientifc era and a deeper look at the experience of Curie. In the end, it does not adaquately honor the world's greatest female scientist, the history of her discoveries or the true leagacy of them."}, {"id": 56, "text": "So the protagonist is a super-strong personality. Get over it. Reminded me of my sisters. I thought they did a great job portraying her. I don't know whether it was historically accurate, but in a very strong personality portrayal."}, {"id": 57, "text": "This Movie would Lose some of it's so called Dullness if you saw it on the Big Screen at a theatre. After all how exciting can the discovery of Radium be,unless you are the Scientist ? That said, minus a few dream sequences and Hollywood bells and whistles I loved this Docu Drama. Rosamund Pike really picks great characters that have to overcome alot and here see Shines again as Marie Curie. An Amazon Prime original. Recommend viewing with some Hot Tea and Snacks. Trippy Soundtrack"}, {"id": 58, "text": "Very interesting. Some artistic license with presenting personal thoughts but a great overview of Marie Curie and her husband's work."}, {"id": 59, "text": "Go in expecting an in depth character study of one of history's most remarkable scientists and you'll be disappointed. While we follow Marie Curie's actions throughout this is more a film about science, the discovery of radioactivity and some of its consequences. It acknowledges but does not make any statements about atomic energy, feminism and politics and neither should it. This film has no agenda and is all the better for it."}, {"id": 60, "text": "Rosamund Pike is excellent in this, does an absolutely brilliant job. I think overall the film did a great job honoring Marie Curie for her determination and her contributions. From my limited knowledge of her, it was pretty historically accurate. My only complaint is that the movie felt disjointed. I felt like I was watching two separate movies. Maybe it would have worked better as a miniseries? I also didn't particularly enjoy the artsy weird scenes that they occasionally interjected - they felt out of place. I did appreciate that the filmmakers made a connection between the importance of the science in both helping and unintentionally harming."}, {"id": 61, "text": "Well done historical film about Mafame Curie. What a great role and great performance in the role. Hand the Oscar to her now academy. She's that good."}, {"id": 62, "text": "Unfair portrayal of only the downside of Marie and Pierre Curies great discovery! Nuclear power is safe. The weapons were a down side. But the bomb was the right decision and saved millions of lives and cured cancer in most cases.Totally unfair smear."}, {"id": 63, "text": "Filmed in the dark, poor script, actors who cannot act, poor editing. The best part of this movie? The very last 2 seconds. You should FF to that and save 1:49.43 seconds of your life."}, {"id": 64, "text": "This movie misses the mark on so many levels; the irritating narration telling us what we're seeing on the screen; the lack of a well-defined obstacle (women in science?) the strange animosity displayed by Curie over her husband attempting to get Nobel interest in their work, the lack of Science in the entire movie?The leads are ok, however they don't appear to be the right ages in many of the flashbacks, or the implied causality fast forwards, blaming the Curie's discoveries of Radium and Polonium as the reason for Hiroshima and nuclear weapons.The screenplay is a mess, the dialogue poorly written, and the seriously irritating narration of every single scene highly unnecessary and ridiculous. We aren't that stupid. You don't need to tell us what we're seeing."}, {"id": 65, "text": "Good historic film about Marie Sklodowska-Curie and her Nobel Prize-winning work that changed the world. Although some historical events have been altered for dramatic effect, the film certainly provides a very good insight about Marie's discovery of Radium and Polonium - and also about the ambiguity and undetected dangers of radioactivity. Interesting to note, that before it was discovered that Radium had serious adverse health effects, it was actually used in France (and other countries) as an additive in products such as toothpaste, hair creams - and even lady's underwear :) And also in food items due to its supposed curative powers. So the myth of radioactivity already captured humanity's imagination when it was first discovered. Regrettably though, humanity still has not learned yet to renounce and detach from the really extremely dangerous and destructive radioactive stuff - namely nuclear weapons - which still need to be finally banned and abolished in the International Community."}, {"id": 66, "text": "I'm not too sure what the critics were expecting, but yes, this film requires careful attention to detail (the cinematography and set designs are stellar) and yes, it does require a bit of science because, well, this is a movie about *science*! I no longer pay much attention to what critics have to say, and simply assume an inverse relationship between critics' ratings and quality.If you're looking for a movie that explains science at a kid's level, this movie isn't for you. If you have trouble with movies that aren't completely linear (and require little thought), this movie isn't for you.If you want a thoughtful biopic about one of the greatest scientific minds to have graced our existence, by all means enjoy!"}, {"id": 67, "text": "I will keep it short. Great actors with a poor script or poor editing of a great woman in history. The movie tried to tie her to nuclear war and radioactive charletans thereby undermining her importance. IMHO the final movie may as well have been written and directed by the people who made sham-wow commercials. Though I think even they may have made a less poorly correlated Madame Curie discovered radioactive 'stuff' and it is mostly bad, story."}, {"id": 68, "text": "The film is really an indictment of Madam Curie, not a celebration of her life and remarkable accomplishments. Is she solely responsible for the nuclear ills of the world? Yes, and no. Was she a strong woman or the shrew as portrayed in Radioactive? How much did she really lean on Pierre? Given the number of historical inaccuracies throughout the film, one has to wonder about the true value of this piece. It's entertaining, but how can we think it's anything more than that?"}, {"id": 69, "text": "I enjoyed this movie, one I will keep for my daughter, Marie Curie was certainly a brave, strong woman, an Inspirational figurehead for all children especially girls."}, {"id": 70, "text": "With one cliché after another, endless irrelevances and downright inaccuracies, this mess of a film adds up to less than the sum of its parts. Not worth your time."}, {"id": 71, "text": "To be honest, when I read reviews I didnt expect much and movie it self isn't masterpiece, but it will definitely won't leave you without any thoughts.Overall beautiful movie with interesting and lite storyline about complex woman and her contribution to society!"}, {"id": 72, "text": "To attempt to cover such an extraordinary life from childhood to death in an hour and 49 minutes is foolish. It was like they were acting out a bulleted list of her life (Meet Pierre - check! Have baby #1 - check! ...) without going into detail on any if it. They would've been better off focusing on one period or aspect of her life and skipping the rest or putting it in an introductory and/or ending statement. To cover all they attempted to cover should've been done in a 3 or 4 part mini-series. Very disappointing."}, {"id": 73, "text": "I really thought that this movie would actually focus on the scientific achievements &amp; how they came about. But that wasn't the case. While it was good to know the Curies' as people and how brilliant, dedicated and in love they were I feel the movie missed its mark on script front.This almost felt as if the key moments (that are easily viewable online) in their lives were simply stitched together &amp; the end too seemed quite abrupt.Still on the whole a decent and a feel good movie that had so much more potential"}, {"id": 74, "text": "Great storytelling, great cinography, music - and above all: Rosamund Pike. She's done great work all along in her carriere, and tops it by this preformance. I have no idea why there are so many bad reviews on here, we must not have seen the same film. Just see iit and judge for yourself. It is more than worth your time."}, {"id": 75, "text": "....Cos he would never have seen his daughter (my mother). WW2 ended with the nuclear bomb. Evil as it was, there's no disputing that it saved many more lives.But predictably this film takes the PC viewpoint and entertaining personal life of Marie - sex life anti-men modern view shoved down our throats (directed by a woman).Watched most of the movie but by the end the negative view of Nuclear accomplishments just made it predicable and boring."}, {"id": 76, "text": "Radioactive is the story of the adult life of Marie Curie, the world's most famous female scientist and winner of 2 Nobel prizes. Rosamund Pike was a great choice for the lead role, she is always good at playing headstrong characters. This is a well made biography, showing her incredible career, as well as some of the benefits to humanity. Good movie for kids who are starting to learn the sciences."}, {"id": 77, "text": "I greatly enjoyed this move, the cast, and the content. Very good movie."}, {"id": 78, "text": "Touched upon so many points, women struggle in science and to affirm themselves in a world of man in general. How humanity have a tendency to use science for good but also for destruction. Very well thought through."}, {"id": 79, "text": "Marie Curie's life was complicated and complex. I don't know how any single film could contain it. I think this one did fine. It had me reading and researching and learning more. That's my favorite kind of movie! I disagree with the criticism of this movie. I loved it."}, {"id": 80, "text": "Amazing to see how every new scientific discovery has two sides and how they can be used both for good and bad motives. As Radioactive unfolds, there's an interesting approach related to main 20th century events where we see just that taking place. Besides that, I found very interesting all details about Pierre and Marie Curie characters of whom I only knew they had discovered radio. Rosamund Pike does it perfect!"}, {"id": 81, "text": "It was full of emotions as a human being , and suffering because of knowledge"}, {"id": 82, "text": "This film start with Marie Curie pass out, and she been sent to the hospital scene! As turnout, this film is about Marie Curie discover the radioactive, and won the Nobel Prize! Entire film full of boring conversation, and annoying overuse scene! Such as, overuse of the flashbacks scene, overuse of the hallucinate scene, and overuse of the staring scene! Make the film unwatchable! Barely intense scene is, husband of Marie Curie Pierre Curie hit by the carriage and die! At the end, an article indicate Marie Curie die in the year 1934, and bury alongside her husband! That's it! Another disappointed film!"}, {"id": 83, "text": "Totally refreshing and delightful to watch a movie on this rainy Saturday night That utterly captivated me and filled my brain with wonder. It was a pleasure to see a great scientific mind portrayed with passion and love instead of always being robotic or cold. Beautiful story and phenomenal acting!"}, {"id": 84, "text": "I don't know why viewers aren't giving this movie a better review... the movie is different than your standard period biopic In that it shows the good and bad that came from form her discovery, even though it was beyond her lifetime. I personally thought the acting was terrific and the themes relevant.... too bad more viewers don't feel that way..."}, {"id": 85, "text": "The story hit all the point you expect it to but does them in very interesting ways because of the Amazing Directing. Everything is dream like. Chemical like. Surreal.It has interesting but predicable themes of science Ethics, Love and Women's empowerment.It moves very fast so it's never boring. It moves from one conflict to the next conflict of her life. And then Sums up her life nicely in the end."}, {"id": 86, "text": "I just watched this movie, and it was excellent. It never ceases to amaze and annoy me when such a wonderful biopic gets a low rating rather than a high one. What do people want?! Does every movie have to be full of action and chase scenes?! This one is a mind-walk of important impacts on science and humankind good and bad. It should be appreciated much more."}, {"id": 87, "text": "Beautiful cinematography. Very well acted. A compelling story. The script did not live up to all of this potential. It was difficult to connect to the storyline and characters."}, {"id": 88, "text": "A pretty underwhelming biopic for such fascinating subject: painfully bland, stale, and lacking any insightful emotional depth. Its screenplay is poor throughout - the material even drives Rosamund Pike to behave like a more amateurish actress than she's proven herself to be. Even stranger is the way the film throws in bizarre vignettes from the future to illustrate how the Curies' discoveries were used for both healing and destruction. It's Marjane Satrapi's quirky vision to flip the standard biopic formula that, unfortunately, never quite comes together."}, {"id": 89, "text": "If you have any interest in science or history this is a must see. Rosamund Pike is excellent as Marie Curie and the film gives a great overview of her life and trials. The flash forwards to later times and the consequences of her work are just right and I defy anyone seeing this movie not to come out of it in a thoughtful frame of mind."}, {"id": 90, "text": "The life of Marie Curie is brought on screen vividly and her scientific work is made understandable even to us, non-scientists. Liked references to future to show what is based on her and her husband's discoveries. Excellent work, Rosamund Pike!"}, {"id": 91, "text": "The politics were off, the nuclear power plants and weapons were a great result of this work. didn't know her daughter followed her into science and a NOBEL prize. pretty good movie, the trippy scenes were a bit outta place. could have shown all the good her work did"}, {"id": 92, "text": "An intriguing look at Curie, her family and her discoveries. Presented in a way which shows the horrors of what came to be juxtaposed with the successes of the moment, Pike as Curie is both disarming and standoffish. Her distrust of the rest of the scientific community is vaguely conveyed while her love for her husband and research is very apparent."}, {"id": 93, "text": "I found it to be an interesting film about the Curies and their discoveries . Rosamund Pike conveyed well the fact that Marie Curie was a strongminded woman . Sam Riley has her husband was excellent . Sometimes the scenes from the future did not come across well and spoilt the main plot of the film . It might have been better to put all that together at the end of the film with Pierre 's word about good and bad coming from their work ."}, {"id": 94, "text": "Based off of the graphic novel Radioactive: Marie &amp; Pierre Curie: A Tale of Love and Fallout by Lauren Redniss, Radioactive tries it's hardest to bring to life the struggles and accomplishments of two of the greatest scientists that ever lived. Billed as a true story, Radioactive rises above and falls short of portraying Marie Curie for the woman she truly was. A pioneer, rebel, and scientific genius, Marie Curie, along with husband Pierre, did, in fact, change the world. Unfortunately the film languishes with needless drama and misses many highlights worth noting. Still the story itself is worth knowing and the woman herself is worth celebrating. See the movie and judge for yourself. Then go out and buy the book and know for sure."}, {"id": 95, "text": "Radioactive is far better, far pacier and insightful than people are making out. I also do not feel that the film is making any sort of judgement on Marie and Pierre's discoveries; it is merely pointing out consequences. It firmly leaves it up to you to decide, and it clearly points out oas many benefits to their work as issues.It's never going to be a take your brain out, fast-paced thriller, it's a biopic about two scientists, about how one struggles because even through she's brilliant.Sure it's not perfect, but it was engaging, Pike does a fine job as does support cast and the time passed quickly. By the end you knew a lot more about her life and you have to remember this is a biopic, not a documentary, so there will be some liberties taken for dramatic effect."}, {"id": 96, "text": "I got irritated by the flow of events being violated by chunks of significant later events.Showing them at the end was OK, and maybe more there, but none in the body of the film.No viewer is likely to be unaware of the costs and benefits.It is still worth watching for the main story."}, {"id": 97, "text": "Rosamand Pike was good, but the movie fell apart in the end."}, {"id": 98, "text": "Really well done, lots of stuff I didn't know, one of the few good montages of all time.Because I sorta hate the typical biopic. Any long-term lifetime is badly told through film, but this got as close as I have ever seen.I didn't like the cutaways to various other, good and bad, uses of radiation. Not just the interruption, but they were poorly done (or massively historically inaccurate for no good reason).I DID like a lot near the end when she walks the wards and ends up in others, like Chernobyl. Removing all the cutaways to other times, and having that happen all at once would have been hugely more effective. Maybe they'll fix it sometime."}, {"id": 99, "text": "Great movie - only issue was that I CANT UNDERSTAND the main actress - she mumbles when she speaks with the low tone of her voice or the mic is too far from her lips. Everyone else speaks clearly - A lot of rewinding to hear what she said!!! Excellent director! Beautiful editing and fast forward scenes of the effects of radiation and uranium both good and bad. Madame Currie was one pretty smart progressive woman, way ahead of her time."}, {"id": 100, "text": "Radioactive was a film that has a act and acting that is far superior to the rest of a film,Rosamund Pike was unregonisable here and to me here she give one of her best performances,it is shame that such acting was put inside such a weak film instead some award worthy one,story was in beginning still very good and when story focused on her early carrere,movie was still watchable and interesting look inside Marie Curie mind and her own personal life,but then we starting to get way to many time jumps which were messy and honestly not so interesting,also parts with nuclear and Chernobyl were completly without a point, cause she didnt have nothing with such staff,Radioactive was a dissapointment in end and a waste of great actress"}, {"id": 101, "text": "I'll take Greer Garson and Walter Pidgeon over this any day."}, {"id": 102, "text": "Historical stuff. Great performances. Interesting. Dropping the atomic bomb on Japan saved a million lives, according to historians."}, {"id": 103, "text": "The story of the life of Marie Curie focussing on the passionate importance of science to her, her beloved husband and the impacts of radiation, both directly and in a wider context eg Chernobyl, Hiroshima etc.The film presents a solid enough picture of Curie's life and is made all the more compelling by yet another powerful performance by Rosamund Pike. The sections focussing on the consequences of radiation are interesting and well told but don't sit neatly enough into the narrative which works better when it concentrates on the challenges in Curie's work and private life."}, {"id": 104, "text": "I have the greatest respect for Rosamund Pike, and she does a masterful job here with a script which is not too strong. This is a very important story to tell, but the flash forward segments on Hiroshima and Chernobyl were editorial extrapolations and certainly not the fault of Madame Curie."}, {"id": 105, "text": "7/10 - an intriguing look at an astounding scientist makes for good cinema"}, {"id": 106, "text": "This movie is a pale and shallow effort to represent an extraordinary person with a remarkable life. Marie Curie is an absolute icon one of the most important scientists that ever existed and for sure the most important female scientist. Madamme Curie had a life full of challenges and she fought bravely to overcome barriers in the name of science. Her passion, her brilliance and her character changed the world in more than one way. She opened the way for women in science. She was the first female professor in the University of Paris. She was a poor immigrant, who had to work her way to the top. She was open about love, she was brave and humble and honest. She donated most of her Nobel money. Did we get that in the movie? Maybe 1% of it. The vision of the director about one of the greatest minds of all time is Sheldon Cooper in a dress. There was some effort to suggest how her discoveries changed the world, but it did not succeed to present the scope and the greatest importance of her work.This is not a bad movie, actually it is perfectly watchable. Actors are great and the love story between Marie and Pier is adorable. But given the fact that they had such an amazing life, I think the movie is a missed chance.Still better love story than Twilight though"}, {"id": 107, "text": "For a historical figure with an impact as significant as Marie Curie, this is a really underwhelming biopic. Stale, rushed and lacking any insightful emotional depth, Radioactive is a dull watch throughout, failing in its attempt to capture both the significance of Curie's discoveries and her own personal struggles.It's so strange how poor this film is, given the immense talent behind it. On screen, Rosamund Pike and Sam Riley star, while Persepolis director Marjane Satrapi helms the film. Yet despite that talent, Radioactive feels almost amateurish at its worst.Its screenplay is poor throughout, from its lack of dramatic insight to its consistently terrible dialogue. The early moments of the film are insufferable, chronicling Marie's meeting with future husband Pierre through scenes of awkward and forced scientific flirting.Later on, Radioactive tries to grab your attention with its assessment of the standing of women in the scientific community, but does little to make that theme really get under your skin. In fact, the most memorable part of that theme is Curie's repeated assertions that it was not her gender that stood most in her way as a scientist at the time, but her background and funds.And with relatively little focus on her background, there isn't much of an inspiring, uplifting arc for Curie here. Instead, there are a few eureka moments interspersed by long, dry and dull periods with barely any memorable drama to show.Even stranger is the way in which the film tries to represent the long-term, controversial effects of Curie's discovery of radioactivity. Almost randomly, the film throws in bizarre vignettes from the future showing the uses of the discovery for good and bad, including the bombing of Hiroshima and the development of nuclear weapons.That all but ruins any narrative flow in the film, only reinforcing the fact that Radioactive really is a bit of an amateurish work. Marjane Satrapi's generally unappealing style and drab direction do little to keep you engaged, while even leads like Sam Riley and to an extent Rosamund Pike are below their best.It's a real shame, because it's clear that Marie Curie's is a great story, and with so much talent working in this film, you would expect a whole lot more from Radioactive. But, as a painfully dull, stale and even amateurish biopic, there's little positive to say about it."}, {"id": 108, "text": "The most accurate thing I can say about this movie is that I watched it... then went searching for the real story. This excessive dramatization I am sure does little to present the true story.Unlike many here I did not mind the reference to Hiroshima and Chernobyl. Although these happened long after Curie died and had no effect on her career, they were reminders of an important fact: science can be used in a beneficial manner, or in a questionable and disastrous manner. These things had nothing to do with Curie herself, but were cautionary references that I found pertinent to the concept that discovery always bears consequence.As for Curie herself, at the end of this flick I felt I knew no more about her than when I started watching. The story dramatizes her personal life and excessively focuses on personal relationships while leaving out far too much of her science and actual career accomplishments. That is certainly no credit to the production and earns it a mediocre 5 stars."}, {"id": 109, "text": "I had good expectations before starting this film when I read Rosamund Pike and Anya Taylor-Joy were in it. All of the actors were good, including the children. My problem with this film were with the choices the film director and writers made. Some choices were good as the settings and locations were well done, but others were a total mess of unnecessary CGI that honestly felt amateurish.Like a new photographer who discovers Photoshop and over edits his or her's pictures making them gaudy, there are many scenes with over-saturated colors and fake CGI bokeh that really are distracting. I lost it when the closeup of Marie's last kiss to her deceased husband was CGI. Why?The dialog and acting is so wooden, dry and stiff that I could not stand Marie Curie's character. Aren't we suppose to love the main character? Was the real Marie Curie this stiff and unlikable? I hope not. Why are we consistently reminded she is a first female scientist? Stop with the WAman dialog. I choose to watch the film because I knew who she was from textbooks. No need to scrap her gender across my face like low grit sandpaper. Why not just leave the gender adjective out and call her a great scientist, period? I found Pierre Curie, her husband, to me a far more likable character who help make a great couple great..Then there are the abrupt cuts and flashbacks. Some of the flashback scenes are not even related to Marie Curie's work. Geeze, stick to telling the woman's story clearly so that non-scientist can understand the significance of who she was without the annoying harsh film cuts. Again, as a filmmaker, it looks amateurish. It felt like somehow I sat on top of my TV remote and kept accidentally pushing the forward button because there are little in gradual transitions between scenes.I don't think I came with a better understanding of Marie Curie after watching this film. Again, the actors are phenomenal and I don't blame them one bit. My problem with this film is how the story was told and the directing style. Perhaps the History or Discovery channel has a better documentary."}, {"id": 110, "text": "Rosamund Pike has a penchant for playing determined women navigating oppressive male-dominated environments, from the femme fatale of Gone Girl to war photographer Marie Colvin in last year's A Private War. In the latest example, Radioactive, Pike delivers a powerful embodiment of another tragic hero named Marie. As pioneering physicist and chemist Marie Curie, Pike delivers a dazzling performance rich with the struggles of a life defined by perilous discoveries and great personal loss. As directed by Marjane Satrapi, this discursive biopic struggles whenever it cuts away from her drama to explore the bigger picture - with peculiar flash-forwards to a nuclear future - but Pike helps fuse it together. Unfortunately, the movie's unorthodox structure stumbles when it veers off on heavy-handed tangents to explain the reverberations of the Curies' research. Pike remains a compelling figure into old age. Anyone unfamiliar with the Curie family legacy will certainly find much to appreciate about their various accomplishments under incredible personal duress and tremendous social upheaval. So overall, this is a gud moovie."}, {"id": 111, "text": "Try to please everyone, and you end up pleasing no one. There is too much to this story to cram into less than two hours. What we are left with is a film that seems to be almost a checklist of Curie's life.Pike is terrific in the lead and the rest of the supporting cast is very good. The overall production of the film is very good as well. I am not convinced that this particular story could be successfully done as a feature film but would probably work better as a 5 or 6 piece mini series.I feel often forced, or even generic, dialogue is probably due to time restraints. Not many directors out there say I need this to come in under 2 hours and was more than likely production forced limitations.I would disagree with other reviewers that the future sequences are placing blame for those events on Curie. It is simply playing out the ripples in the pond metaphor. I was not incredibly educated on the life and work of the Curie's before I saw this film, but it has since inspired me to do so. And I think there is something to be said about that."}, {"id": 112, "text": "I had a tough time with this film - it didn't really hold my attention.Radioactive purports to tell the story of Marie Curie and her husband Pierre, and their scientific work which resulted in their pioneering work in radioactivity.Madam Curie from 1943 was so much better, in spite of the fact that they drenched Greer Garson and Walter Pidgeon in flour to make them look old at the end. Since Eve Curie chose Greer Garson for the role (and the film was based on her book), it seems logical that Rosalind Pike saw Madam Curie.Pike reminded me very much of Greer Garson except that the way Marie is portrayed in the film is as an arrogant, willful, somewhat unpleasant woman. It's not Pike's fault. I don't think the direction is very good.I also don't know why Hiroshima and Chernobyl were shown. Marie Curie invented polonium and radium, which have nothing to do with these bombs. It just indicates that the research for this script wasn't very good.I won't go through all the other inaccuracies. The importance of a biopic is that people will become interested and read up on the subject, not to accept everything in the film as fact.The performances are good. Marie Curie was an amazing woman who broke through a lot of barriers and worked tirelessly, believing in the importance of science.Somehow I was more swept away by the 1943 version. Radioactive left me feeling kind of blah. Also it was too long."}, {"id": 113, "text": "Dreary re-telling of Marie Curie's life as a scientist. Based on a graphic novel and directed by a woman I'm not familiar with, this one presents Madame as a rather nasty piece of work (maybe she was in real life) and sidelines Pierre Curie to a husband and assistant. Be that as it may, the really jarring things are the flash-forwards to show the evil uses of the radioactive elements the Curies discovered. Aside from a medical flash of little Johnny getting a cancer treatment, we get to see Hiroshima, Chernobyl, and an atomic bomb testing in 1950s Nevada. Even worse, while she is ill from radium poisoning and working as nurse (more or less) during WW I, she hallucinates the faces of the victims from the future. Please!Rosamund Pike and Sam Riley play the famous pair. Pierre died in 1906 when his head got crushed in a street accident; Marie lived on until 1934 and finally died of radium poisoning.I don't remember the Greer Garson/Walter Pidgeon 1940s film, but I guess I'll wait a while before I watch it"}, {"id": 114, "text": "Greetings again from the darkness. There can never be enough movies made or books written about remarkable people with incredible accomplishments. Marie Curie was certainly a remarkable woman and her accomplishments were such scientific break-throughs that we are still using them today. Director Marjane Satrapi's (Oscar nominated for PERSEPOLIS, 2007) film is based on the 2010 book Radioactive: Marie &amp; Pierre Curie: A Tale of Love and Fallout by Lauren Redniss, and the screenplay was adapted by Jack Thorne (THE AERONAUTS, 2019).The film opens in 1934 Paris, and we see an enfeebled Marie Curie (Rosamund Pike) collapse and get rushed to hospital - a sequence used by director Satrapi as a framing device. The film quickly flashes back to 1893 when a headstrong and brilliant twenty-something Marie Salomea Sklodowska gets kicked out of her laboratory for being ... well ... a bit too headstrong for the times. Soon she meets an equally headstrong and also brilliant scientist named Pierre Curie (Sam Riley). Pierre recognizes the potential if they combine forces, while Marie initially demands her independence, having never found another scientist worthy of the efforts required for collaboration.The initial flirtations between brainy scientists is as clumsy and awkward as one might expect. In general, the film struggles with how to best address Curie's personal life with her professional life and the challenges she faced as a brilliant woman in an era when male scientists didn't much appreciate a woman scientist telling them they have misunderstood the atom, as she and her husband announce the discovery of not one, but two new elements: radium and polonium. Romance and science and equality are a lot for one film to tackle, and this one flounders a bit.As the film and science progress, director Satrapi intersperses flash-forward vignettes to show how Curie's discovery of radioactivity is used in the future for both good and not so good. These dropped-in segments include cancer treatment for a little boy in 1957, the Enola Gay bombing Hiroshima in 1945, the Atomic Bomb test in 1961 Nevada, and of course, the 1986 Chernobyl disaster. The segments aren't always a smooth transition from Curie's story, but they make the point of how scientists don't always have control over how their discoveries are applied. There is even a scene where Pierre shows Marie some comical uses entrepreneurs found of trying to capitalize on their discovery, and how their work might factor in to everyday life.As a biography or profile of Marie Curie's life and accomplishments, the film hits the high notes, though we do wish it dug a bit deeper. The gender prejudices of the times are somewhat underplayed, and even Marie herself claims lack of funds and the fact that she wasn't a natural born Parisian held her back more than the roadblocks she faced as a female scientist. It would seem reasonable that those issues were likely tied together and should not be separated. She lashes out at Pierre regarding the Nobel committee initially keeping her name off the submission, but of course this anger is misplaced, as Pierre demanded she be included.The historical aspect of her winning two Nobel Prizes is not treated as the astonishing accomplishment it is, but time is spent on a personal scandal that occurred after Pierre's death. We do see Marie sleeping with a sample of her radioactive uranium, and watch her slow physical deterioration, including an incessant cough and damaged skin. Late in the film, Anya Taylor-Joy plays her daughter Irene, and we see the two of them head onto the battlefield to provide mobile x-ray devices for injured soldiers. The Curie family tree is filled with renowned scientists (Irene and her husband Frederick jointly won the Nobel Prize in 1935 for artificial radioactivity), and some of these discoveries literally changed the world - including cancer treatments. Perhaps it's unrealistic to expect any movie to capture the historical importance of Marie Curie, but we are somehow left feeling she deserved better."}, {"id": 115, "text": "I was really excited to see this movie as it was supposed to portray one of the most well know woman scientist in the world. However, there was almost nothing about her achievements in this movie. The achivements of her kept almost at the background of her relationships, some pointless characters (dancer etc) and historical events happened in that period of time. While her status as a poor immigrant, all the hard work she have done to be a successful and respected women scientist in a male-led and racist environment, her bravery and humbleness, all the support and donations she made was cast aside and she just represented as a cold and smart woman with a critisizing tone (which looks a bit of sexist portray). I don't know if she was like that as a person however, I think even that was the case, it should have been shown what she has been through and how did she come to that point. I understand that she had a complex and very hard life and it may not be possible to portray all of this in 2 hours but 2 hours about a most influential women in the history should have not be focused on her sex life, unrelated characters and all the drawbacks of her invention.I think, they should have created a more inspirational movie about her story such as how her curiosity led to these great achivements and acceptance and respect in a male-dominant society to inspire the future of young scientist. Applications and the results of her invention should have been in a separate movie which includes all the scientists whom inventions brought certain costs when they fall into wrong hands."}, {"id": 116, "text": "This film is of the life of Maria Sklodowska or as we better know her Marie Curie. Maria was a Polish scientist who had come to Paris in 1891 to continue with her studies. The film starts at the end, now i know that sounds like a weird place to begin, but as you will see one of the first scenes are of Marie Curie (Played by Rosamund Pike) collapsing in her laboratory in 1934. As the scene progresses, Marie is seen being taken on a hospital trolley down a corridor, this is where she begins her flashback to how her wondrous life had played out. At this point i will say that you will come to realise that Marie, is scared/afraid of hospitals, of which you will see why. So we are back in 1893 in Paris, Marie (A name she took to be more French and be accepted) literally bumps into Pierre Curie (played by Sam Riley). Marie in her seemingly abrupt manner dismisses Pierre's interest in her work and promptly continues on her way to see Professor Lippmann (played by Simon Russell Beale). Professor Lippmann has a laboratory that Marie is using part of for her studies, but this meeting was to bring the end to this arrangement. As the only woman among a group of 23 scientists in the department, Marie now faces the challenge of finding a new work space. As she hasn't the funds to set up her own, she has to see if anyone will give her the space and a chance. She is turned down by many, she believes that this is because she is Polish or a woman, or both. Then her break comes when she bumps into Pierre once again, this time not so literally. As Pierre has also seemingly been overlooked by the establishment, he offers Marie a space in his Laboratory. He is very aware of her work and has read her papers. The story that we then know of Marie's great work is then portrayed in a very well produced drama, with the added bit of romance and tragedy."}, {"id": 117, "text": "I give it a 5 = 4 for the great Marie Curie and add a 1 for the great Rosamund Pike.I am in my late 50's, a woman of computer science, a nothing compared to Marie Curie. I read Madame Curie written by her daughter Eve Curie when I was 13 years old and I was thrilled, enchanted, transported.This was a 3 hour slog through what could have been a thriller limited series. I am no more happy with the negative things that were done with her discoveries. What about gun powder, guns, and so much else put to use by horrible people. I don't usually ask this, but suddenly I must - is this movie so late in coming and so poor because she was a woman?Someone, please try again. And how about dramatizing the work of Helen MacInnes while you are at it? Some of it dated, but the best spy novels ever, par with LeCarre."}, {"id": 118, "text": "If you enjoy reading my Spoiler-Free reviews, please follow my blog :)So, a little bit about me first: I was always a man of science. I have a Masters degree in Electronics and Telecommunications Engineering, and I was always fascinated by how things truly work. On the other hand, I'm not the biggest fan of biographical movies due to the genre's boundaries. These films often follow a generic script, filled with formulaic plot points and lacking imaginative storytelling. Therefore, I usually analyze these movies based on a single question: do I know more about the character and/or the story that made him/her famous now that I've watched this flick? Another aspect that's important in any film, but even more in this genre: the actor who interprets the protagonist.Radioactive possesses Rosamund Pike as the magnificent Marie Curie. If there's one undeniably incredible element in this feature, it's Pike's brilliant performance as the famous scientist. Now, I have no idea how Marie was as a person, so I can't really evaluate Pike's display regarding how accurate she is on a personal level. Nevertheless, her impressive emotional range can easily get her a few nominations when the awards season comes around. When it comes to which expressions to use or how strong her emotions need to be, Pike manages to always choose the most coherent option having in mind the character she portrays.Sam Riley shares great chemistry with Pike, delivering a couple of genuinely passionate moments and witty conversations. Anya Taylor-Joy (Irène Curie), who I forgot was also in the movie, is always a delight to see on screen and, in this case, a very welcome surprise. However, this film is so focused on its protagonist (as it should be), that every character and actor other than the main one ends up being utterly forgettable (nothing wrong with this). Technically, I need to praise the makeup artists, who did a terrific job getting Pike older throughout the runtime, as time flows accordingly. Evgueni and Sacha Galperine's score is simple yet sweet enough to slightly elevate a few sequences.Unfortunately, Radioactive holds more than just a few minor issues. My biggest gripe is related to how everything is put together. I doubt most people will watch this movie with the hope of seeing more of Marie Curie's personal relationships. This isn't exactly a romantic drama. Having in mind the discoveries that she made, I was extremely interested in watching how, in fact, she discovered radioactivity. Of course, I'm not expecting the film to turn into a highly detailed chemistry lesson and all of its specifics. But Marjane Satrapi rushes through most of the relevant moments or skips them entirely. Marie's first groundbreaking result is so casually presented to the viewer that it makes the whole thing far from being a big deal (which it is).There are a couple of visually captivating animated sequences that sort of explain the process that the characters are going to perform, but it's still quite underwhelming and disappointing. I still have dozens of questions now, which I hoped the movie would answer but didn't. It's also edited (Stéphane Roche) in such an uneasy manner that it feels like I'm watching two completely different films. I don't know if this was Satrapi or Jack Thorne's (screenwriter) idea, but showing (mostly adverse) future events directly related to Marie's discoveries didn't work for me at all. You know how these movies tend to have some sort of information shown before credits explaining how things worked out in real-life? It's like they picked them up and randomly spread them across the film.The focus went full-on to the protagonist's personal life instead of balancing it with her world-changing experiments. Answering my question above, I did learn more about Marie Curie, but not about what I wished to know about her. Ultimately, it feels like this biographical work doesn't honor her legacy. Just as an example, the story brushes over her discoveries so fast that it doesn't even explain the reasons behind the nomenclature of the new elements. Overall, it's not worthy of being the biography of the scientist's life.Radioactive boasts an absolutely outstanding Rosamund Pike as the great Marie Curie, but Marjane Satrapi (director), Jack Thorne (screenwriter), and Stéphane Roche (film editor) fail to deliver a well-structured narrative, rushing through the scientist's groundbreaking discoveries and experiments or ignoring them altogether. Randomly mixing up future catastrophes with the actual story not only breaks both the tone and pacing of the movie, but it also makes the whole viewing a bit uneasy. Despite her personal life always being a point of interest, her work and how she performed it are why most people want to watch this film. To learn more about her contributions to the world of today. Unfortunately, Curie's legacy is remitted to a by-the-numbers biographical work, restricted by the genre's formulaic tropes. A neat score by the Galperine brothers and a couple of visually captivating animated sequences still elevate an overall disappointing feature...Rating: C+"}, {"id": 119, "text": "Radioactive is a biopic about the life and research of Marie and Pierre Curie based on the graphic novel Radioactive: Marie &amp; Pierre Curie: A Tale of Love and Fallout by Lauren Redniss. Starring Rosamund Pike and Sam Riley in the lead roles and directed by Marjane Satrapi (Persepolis, The Voices), it takes an interesting approach to bringing its subject matter into the the film format with some noticeable liberties taken at times.In 1893, Polish-born physicist Maria Salomea Sklodowska (Rosamund Pike) lives in France where she furthers her studies on physics and chemistry at the University of Paris. One day, Maria meets fellow physicist Pierre Curie (Sam Riley) and the two bond over their mutual affinity for science, later deciding to become research partners and eventually marrying, with Maria adopting the Francocised name Marie Curie. Over the years, Marie and Pierre make various collaborative breakthroughs, including the discovery of the elements polonium and radium (the latter of which being where the word radioactive originates) and receive accolades as high as winning the Nobel Prizes for radioactivity and chemistry.It's easy to take for granted how much nuclear energy has changed the world, as something as simple as getting an x-ray at the hospital or microwaving last night's leftover food are now all commonplace in our lives. Of course, if we were to examine the bigger picture, we will see that the origins of nuclear-based elements and their implementation into the world around us have a far more complicated backstory than what we may have initially thought. Radioactive attempts to show us the history of the two key people behind these breakthroughs with various results, some factual and some clearly compromised for entertainment purposes. The film depicts Marie as having a huge disadvantage due to her being a woman in an era where female scientists were rare and that her husband needed to take a large amount of the credit for their discoveries to be viewed seriously. This is partially untrue as Marie was already regarded positively by the general public at that time and something like this seems as though it was only added into the film as a means to show how far women have come in the field of science and that men still needed to help them become noticed. While scenes like this weren't common, I did feel that they became something of a distraction to the true story.Marjane Satrapi, best known for writing and directing the 2007 animated film Persepolis, chooses to frame the film almost in the style of a graphic novel. The long and drawn out scenes of the characters going about their work in the laboratory and the on-screen text used in establishing shots sometimes give the feeling as though you are watching the story being told in still picture form. Rather interestingly, she also intersperses the story with scenes involving the negative consequences of these nuclear discoveries, like the bombing of Hiroshima and Nagasaki in 1945 and the Chernobyl disaster of 1986. This was to showcase the Butterfly effect of the Curie's findings in that discovering something groundbreaking eventually led to the deaths of thousands of people decades later. In addition to this, Satrapi's choices in bright fluctuating colours help emphasise the nuclear nature of all these chemical experiments being conducted. One such moment that stood out to me involved Marie and Pierre watching a dancer on stage with various coloured lights being shone on her at different times, with Pierre likening it to that of a flickering flame on a bunsen burner. I believe this was done to show that the flow of life syncs up nicely with the flow of scientific discovery, in that we are constantly progressing forward in furthering our knowledge of the world around us and, in turn, learning more about how our lives can become better or worse as a result.Much like the husband and wife scientists themselves, both Rosamund Pike and Sam Riley work very well together, with their chemistry (no pun intended) helping make the story all the more fascinating to watch. Pike takes every moment of her role seriously, likely to remind the audience how important a person Marie Curie was in making nuclear-based technology more accessible to people worldwide. Sam Riley also brings a nice, supportive touch to his performance as Pierre, who, although not as easily remembered as his wife, still contributed greatly to their research. After all, whenever the pair are mentioned in conversation, people today tend to say Marie and Pierre rather than Pierre and Marie.Even though I feel it could have been better if it were more historically accurate, the film still does a pretty good job of bringing the story of this important husband and wife team to modern audiences who may not be aware of the impact of their findings. As I mentioned earlier, we often take for granted the everyday appliances we use that are possible due to nuclear power and it is nice to see a film like this that can help others realise who we have to thank for it. With that said, there is still so much more that we do not understand about nuclear energy and how there can be serious consequences when used improperly. But I guess that's a story for another time.I rate it 7/10"}, {"id": 120, "text": "GRADE: CTHIS FILM IS MILDLY RECOMMENDED.IN BRIEF: Too many artsy surreal images sabotage this earnest bio-pix about Marie Curie.JIM'S REVIEW: Radioactive, the film biography of Marie Curie, is a film at odds with itself. The film is bi-polar in its approach as it tries to convey Marie Curie's life story with its artful visions of atomic mass destruction. The two storylines don't mesh particularly well.Demanding and head-strong, Marie Curie, the famous Polish scientist (sans accent) who would go on to win two Nobel Prizes for scientific research with the discoveries of radium and polonium, finally earns her own biography. Unfortunately, her greatness follows the standard formula of conventional storytelling: a stereotypical crusader overcoming obstacles of sexism and societal mores to achieve her dreams. Despite being a fine-looking period piece, the movie is too formulaic in its quaintness and contrivances about science, love, and hardships that never amounts to much. It's a 20th Century CliffNotes version of a great life lost within the artistic vision of a talented 21st Century filmmaker.Director Marjane Satrapi interjects her history lesson with flashbacks and forwards that show glimpses of her innovative visual style. She makes Marie Curie into a modern-day feminist and progressive thinker and Pierre as a kind and understanding spouse. However, their relationship comes off stilted and far too bohemian. So many scenes seem too rom/com...from their first meet cute chance meeting on the streets of Paris which brings the two scientists together to their romantic skinny-dipping and bedroom love-making sessions. In between, we do find the time to see their dedication to scientific research and lab experiments, but it comes off as a mere afterthought.The filmmaker nurtures the Curies as a fun-loving couple who are oblivious to the dangers of their discoveries and its radioactive fallout upon them and others. The overt hints of the Curies' health issues In dealing with their dangerous chemical substances becomes a series of discussions punctuated with ominous coughing jags. While this fact may be accurately portrayed, the far-reaching effect is mind-numbing and, at times, laughable, as they verbally weigh the pros and cons of their scientific discoveries.Their philosophic debates become the filmmaker's folly. As the film progresses, its non-linear structure and the director's continued use of heavy-handed imagery overstates the Curies' dilemma. The film suddenly forsakes its historical accuracies and becomes a protest warning against nuclear energy. This decision to mesh the past with the future is the central flaw with the film and it is all the more jarring in the movie's episodic handling of global events that have yet to unfold. Odd transitions show strange microscopic sub-atomic CGI particles floating around and mixed-up time sequences that depict the yet-to-happen bombing of Hiroshima and close-ups of A-bomb testIng experiments. This leads moviegoers to the 1986 Chernobyl disaster, although Ms. Curie died in 1936, fifty years prior to that tragedy. These inappropriate images, while effectively shot, becomes intrusive and unnecessary plot devices as these scenes overtakes Marie Curie's personal story. (Despite Ms. Satrapi's strong political pontificating about the harmful effects of nuclear energy, she surprisingly downplays the positive use of radiation via x-rays and medical breakthroughs in cancer research that stem from the Curies' scientific research.)The film is chocked full of anachronistic transitional segues that juxtapose then and now moments which intrude upon the early 20th century period time frame, veering the film into the surreal. (Just one such example: Marie is walking the atmospheric cobblestone streets of Paris when suddenly a Russian 80's fire engine speeds past her on its way to a nuclear meltdown emergency. WTF? I jotted down in my notes.) The movie exasperates rather than enlightens its subject as it grows curiouser and Curie-ouser away from its initial biographical narrative...and not in a good way.As Marie Curie, Rosalind Pike has some strong scenes, but as written, the screenplay by Jack Thorne, never makes her character truly convincing. It doesn't help matters that the director's artsy touches don't fit with the period trappings of the early 1900's and this undercut her fine performance. Sam Riley is good as Marie's one-dimensional beleaguered and protective husband Pierre. He coughs with distinction. Fine support is provided by Aneurin Barnard as Marie's younger married lover and Anya Taylor-Joy as Marie's daughter, Irene. Special mention must go to cinematographer Anthony Dod Mantle for his accomplished lensing.Ms. Satrapi's film is a noble but very flawed attempt at honoring this great scientist. The director's creative energy is far from inert, but it overpowers the basic storytelling. All of the artsy surface treatment implodes Radioactive and its powerful effect is barely detected or emotionally felt in this lukewarm drama."}, {"id": 121, "text": "Radioactive (4 out of 5 stars).Radioactive is a good biographical drama film about Marie Curie (Rosamund Pike) and Pierre (Sam Riley) teaming together to coming out with a breakthrough on a new element. Creating radioactivity. The breakthrough takes science into a whole new direction with medical technology. Or weaponry.The plot is good. I also liked how the movie shows Marie Curie trying to do things on her own. Being one of the first woman in science and trying to do things her own way. Which Pierre understood her way of thinking. I also liked how the movie refers to a flash foward when Pierre or Marie giving a lecture about there research while flash fowarding to an event like WWII Hiroshima bombing or Nevadas nuclear bomb testing site. And than the Chernobyl incident. That while creating something helpful in the medical field can also have a downfall with being used as a weapon.Rosamund Pike and Sam Riley did great with there characters. Anya Taylor Joy also did a good job playing there young adult daughter.The music score is good. Its a relaxing electronical kind of feel. The direction is a little fast moving with its pace. Going from brief moments of Marie and Pierre love life. To discovering an element. To the characters suffering from an illness.I did feel like the films final moments with Maries illness coming to her and her moments of flashing with what her breakthrough has become. Did feel a little faulty with the script and weak third act. Otherwise, it is a good biographical film that is worth checking out about the events of Marie Curie."}, {"id": 122, "text": "I really like this movie, maybe because I am a chemist, now retired, and former lab rat. I know how scientific discoveries come about, aside from the inspiration are hours, days, and weeks of hard work. The filmmakers added a bit of fantasy for dramatic effect but overall this is a very good movie of one of the more important scientists of the early 20th century.Rosamund Pike is trusted in the role of Marie Curie and she carries it very well. While she and her eventual husband were working with techniques to isolate and purify Uranium they discovered elements that were much more reactive, they named the effect radioactive and named two new elements Polonium (from her native Poland) and Radium. Since they did not yet understand the health effects of long term exposure to high levels of radiation, she and one of her daughters died young of anemic conditions brought on by the radiation. She literally gave her life for the greater scientific good.In a dream sequence near the end she is with her deceased husband, wondering if her discoveries would ultimately benefit humanity. His reply was to compare it to throwing a pebble into a lake, once it lands you have no control of where the ripples go. Radioactive elements have created such things as atomic bombs and disasters such as Chernobyl, not because of Curie but because of mishandling of technology. But they have also created many life-saving medical techniques. The ripples have spread far and wide.Good movie that gives many insights into who this hard-headed but brilliant scientist was. She just happened to be a woman. I watched it at home on Amazon streaming."}, {"id": 123, "text": "IN A NUTSHELL: Directed by Marjane Satrapi, this drama features the true story of Nobel prize-winning Marie Sklodowska Curie (1867 - 1934). In addition to her incredible contributions to physics and chemistry, she's the only one in history to win 2 Novel prizes. The movie is based on the graphic novel Radioactive: Marie &amp; Pierre Curie: A Tale of Love and Fallout by Lauren Redniss with the screenplay written by Jack Thorne.It was supposed to debut on International Women's Day but, like everything else this worldwide pandemic has touched, the release was postponed until now on Amazon Prime this week.TIPS FOR PARENTS: There is a split second when you see two make people run and jump into a lake. Yes, you see skin and other things. That surprised me for a PG-13 movie. Why? It wasn't needed to move the story forward. You see a married couple tossing around in bed briefly with some skin showing. An unmarried couple is seen in bed, but you don't see any action. Infidelity and talk of intimate relationsTHEMES: The things that make us weak are the things that make us strong. - Marie Curie Persistence, determination Equal rights for women The quest for knowledge Choice and consequence Humanity Love. Love of science and romantic love. Humility in the face of innovation and invention Whether mankind is ready for the benefits of nature or whether it will do harm The double standard for men and womenTHINGS I LIKED: I love Rosamund Pike in everything she does. I love that she's fascinated with the element radium that doesn't behave as it should, just like her. You'll learn so many things about her and her story needs to be told. While Marie Curie's inventions brought humanity life-saving applications, I thought it was interesting that the film also pointed out the negative consequences. Sam Riley plays Pierre Curie If you ever watched The Big Bang Theory: The Complete Series (Limited Edition Blu-ray + Digital), you might have already learned a thing or two about some of these scientific elements. The movie starts out showing off its agifying magic on Rosamund Pike by displaying an old, dying Marie Curie who reflects back on her life. It's helpful to have a character who doesn't understand science so that Marie and Pierre can teach her and us at the same time. My university students have been writing essays this week about which counts more: hard work or talent. I think this movie answers the debate. While brilliant, Marie Curie still had to work extremely hard to achieve her goals. There is an interesting scene where Pierre and Marie argue about whether or not religion can be considered. Pierre points out that you can't see reactivity, yet it's real. Marie dismisses the idea, which is odd since scientists should be open to all possibilities in the search of truth. There are some scenes that show future events and consequences of her discoveries. In most cases, they are powerful, albeit forced. She worried that her work would hurt people, but someone told her that it was her job to bring light to the world and to not worry about the ripples.THINGS I DIDN'T LIKE: The filming itself feels a bit clumsy. The director tries to get creative with an artsy-fartsy dream sequence, but it doesn't quite work. I have no idea what Marie Curie was like in real life, but it always annoys me when movies portray brilliant people as stubborn and rude. I wish more time had spent on the good things that Marie Curie's discoveries accomplished, like the X-ray machine and cancer treatments, rather than on just the deadly bombs that would destroy life. Some of the music was just odd and distracting. All of the characters seem to age except Professor Lippmann (Simon Russell Beale). The color palette is very grey in the 1800s, which is appropriate, but it felt like things should have lightened up in the 1900s. Why don't the British say the hospital?You can watch my full movie review on my Movie Review Mom YouTube channel or website. Thanks for subscribing!"}, {"id": 124, "text": "Radioactivity. How it happened to 'be' ?... Everyone has their intentions, motivations, preferences and priorities ... Humanity as a whole, is a complex combination of opposed ideals.And Marie Sklodowska Curie has played a pivotal role in the history of human kind. She did not know what humans would do/create from her discoveries ... We do not control what will occur of our inventions, discoveries, creations, or even speeches ... It is the history of human kind. From all that has been done in the past, others will build on this to create or discover more, others will benefit from it, etc. There is good and bad that can be found in all things ... Everything is not just defined by what it is/seems to be but by the use that we make of it ; from everything one can generate good or bad, then sometimes by wanting to do good, you end doing harm and vice versa,... etc.What I liked about this pretty piece of cinema, is all the introspective/character study aspect of the movie, her life trajectory, her passion, her total investment in what she believed in. Unreserved, honest, blunt, raw, straight, self-assured, unapologetic. A type of personality that forces the admiration (or to the least some consideration), for the reason that whether we like/agree or not, it deserves respect because Marie always has an approach imbued with a great sincerity, guided by her heart's deep passion. She never justifies why she is the way she is or try to fit in, she is and does how she wants to ; unapologetically, like I said before.She now is among the greatest feminine icons while never searching for that but simply always did everything she wanted to do, without asking the permission to anyone. And Rosamund Pike (as always) brings her A-game, with a delightful blend of determination &amp; sensibility. Sam Riley is very endearing in the role of Pierre Curie. Congratulations to the makeup artists, costume designers and the whole production design ! The late 18th~early 19thecentury looks truly authentic. The lighting and color palette serve the atmosphere quite nicely too...Of course, how not to mention Marjane Satrapi's sharp vision of this singular and so important story (and page of history)... There are many layers of emotion, and you very much feel for Marie, throughout the movie.Definitely a powerful movie it is."}, {"id": 125, "text": "Rosamund Pike is brilliant in this beautifully filmed story based on the life of Marie Sklodowska Curie. Pike seems to become Curie and gives a sensitive and touching performance as the Polish scientist who changed the world through the discovery of plutonium and radium. There are many scenes in Radioactive that harken back to the performance of Greer Garson in the 1943 film Madame Curie, but based on a graphic novel, this movie takes the discoveries of Marie and Pierre Curie into the future, looking at the consequences of their discoveries, with surreal scenes of the atomic bomb being dropped on Hiroshima, the disaster of Chernobyl, and the radiation treatment that has saved so many lives as a result of the work of these fearless pioneers. This film gives Marie Curie an element of toughness that helps to explain her ability to persist in spite of being shunned by the establishment and scorned by French society for her unconventional behavior. The glory of the Nobel Prize was overshadowed by public opinion that prompted mobs to station themselves outside her home and shout anti-Polish and anti-Semitic (even though she was Catholic) slurs at her window while her daughters slept in the next room. Above all, the Curies' story is a love story and a paean to scientific inquiry. As with so many IMDB reviews it is difficult to understand the nasty ratings given this touching and cinematically wonderful film."}, {"id": 126, "text": "Based on the graphic novel Radioactive by Lauren Redniss, this movie is surprisingly boring and uneven mess directed by Iranian-born Marjene Satrapi. Film follows a generic script filled with formulaic plot points and lacking imaginative storytelling. The unevenness in director execution prevents this (109 minutes long) film from having the impact that a movie based on such an extraordinary woman should. The film is undoubtedly dominated by Rosamund Pike, yet M. Curie is not portrayed as a particularly likable woman. Radioactive also falls into the same trap that so many overly ambitious biopics fall into - trying to cover too much material, spread across too many years. I'm giving it 4 out of 10 just because of an idea and the impact that science woman Marie Curie (born Maria Sklodowska) had on the world being the first woman to ever win a Nobel Prize and the only person ever to win one twice. Unfortunately, as end result film Radioactive just does not really shine being more informative than gripping, what makes this movie a disappointing miss."}, {"id": 127, "text": "A wonderful story of Madam Curie and her scientific genius in the field of Radioactivity and where it came from and it's action on the atom that what up until her discoveries was all wrong. As the story progress we can see the after effects of too much exposure to the elements of Uranium and other radioactive elements she is working with along with her husband. We also see as a background story that she has a deadly fear of hospitals that stems from her youth. I enjoyed the story very much EXCEPT FORthe constant interruptions of a mostly POLITICAL nature showing how the her discoveries were later used as Evil tools, even if they were done inaccurately as in the scene of the Enola Gay flight with the 1st A-Bomb. They even portrayed the good aspects of Nuclear Power from an evil perspective. Liberal Hollywood strikes again.I would have rated the movie much higher except for the Hollywood Politics that ruined the movie for me."}, {"id": 128, "text": "Radioactive is a Biography - Drama movie in which we watch the true-story of Marie Sklodowska-Curie, an amazing woman who won two time the Nobel Prize for her pioneering work. Her work and her discoveries changed the world and how we understand it.I liked this movie very much because it showed very well the life of Marie Sklodowska-Curie, the difficulties and the obstacles that she had to overcome and fight for her rights and science. The direction which was made by Marjane Satrapi was very good and she presented very well not only the work of Marie Sklodowska-Curie, but also her personality, her dreams and her goals. The interpretation of Rosamund Pike who played as Marie Sklodowska-Curie was simply amazing and she did a very good job. I also enjoyed the interpretations of both Sam Riley who played as Pierre Curie and Aneurin Barnard who played as Paul Langevin. Finally, I have to say that I highly recommend everyone to watch this movie because you will learn more about the life of Marie Sklodowska-Curie and for her work."}, {"id": 129, "text": "The reopening of the theatres in 2020 comes off to a promising start, with this much anticipated story of a woman discovering the truth about atom science, all whilst getting no credit because of her gender and facing discrimination for her nationality.Rosamund Pike is the main-draw, she's terrific, as always. I can really see an Oscar coming her way for this, she truly gives it all in her performance as a hard boiled, somewhat arrogant and productive woman. The rest of the cast is amazing as well, and without spoiling anything, you are in for lots of drama and tragedy, leaving it with a bitter-sweet feeling at the end. You may even learn a thing or two about science as a bonus, as there is some exposition put into the script in a non-forceful way explaining in simple enough terms how atom-science is conveyed.The costume-design is great, and so is the cinematography and the special effects, truly complimenting this fantastic movie.I know we have a long way to go still, but I can easily see this being nominated for Best Picture among other awards at the Oscars in 2021.It should truly be experienced by yourselves.I give it a 9 out of 10!"}, {"id": 130, "text": "This film was supposed to get a run in the cinema earlier this year but due to Covid that didn't happen, though now Amazon have decided to put it on their streaming service and I have watched Radioactive and here is my review for it. The premise of the film looks at the life of Marie Curie the woman who discovered radioactivity. Main Character Rosamund Pike plays Marie Curie here and I thought she was really good, since the film Gone Girl I think she has delivered some strong performances. She just fits very nicely into this role and gives a strong performance doing a good job in giving a strong portrayal of Curie, with a few strong moments in the film. Supporting Characters Sam Riley plays her husband Pierre Curie and I thought he was really good too, the chemistry between the two leads is really good and really the main reason why I found the first 45 minutes the best part of this film. Though the rest of the supporting cast are pretty dull, Anna Taylor Joy is here for like 5 minutes and I just wish she had a larger part here as I thought she was good in the screen time that she has. Story The best part of the story is the chemistry between Rosamund Pike and Sam Riley as they are very likeable together and they just have a really good dynamic. Also the film looks at some things to do with Marie Curie that I never knew and it maybe could change peoples mind on her as a person. Though I have a real issue here and that is that for a film about scientist Marie Curie we don't see her do enough science, this is a huge missed opportunity as we are told how great she is but we really never see her doing any of it. Also the film tries to show the long lasting effect of Curie but it is used so jarringly that it really feels like a bizarre choice and a missed opportunity. Script The script for me was pretty good, I liked the dramatic dialogue here and thought it rose this film above complete trash also the dialogue between our two leads felt very natural and helped make them more interesting characters. Style The style for the film is the worst part of the film. It just feels really drab and dour, nothing here stands out and it takes this film that is actually under two hours and makes it feel like 2 hours 15 minutes which really hurt the quality. Overall Overall, this is a fine movie. If you are a fan of biopics or Marie Curie then you might like this film but for me it is just okay and one I probably will never watch again."}, {"id": 131, "text": "I was taught that the way of progress was neither swift nor easy. Marie CurieI choke up with joy watching a biopic like Radioactive about Marie Curie's (Rosamund Pike-the premiere actress of strong women) discovery of polonium and radium-it's an expert docudrama touching on the major phases, professional and personal, of the two-time (physics and chemistry) Nobel laureate's life. Although I ordinarily am impatient about expansive biographies in film that dwell on personal life, this one carries me happily along with the weight of humanity while it features a genius giving us life-changing experimentations.Marie's marriage with Pierre (Sam Riley), complicated by collaboration, respect, and unusual love, is historical and complementary, a blessed union transcending the petty professionalism either character can beat up the other with. Director Marjane Satrapi keeps a steady eye on the marriage, the depiction of which she doesn't protect from the jarring conflicts such a gifted couple brings to the lab. Nor does she worry about the facts that are left out-a necessary omission for such a sweeping history of Curie's remarkable life.Besides saving humanity with x-rays, she reluctantly and heroically helps in the battlefield by demanding x-raying of soldiers to make the right decisions about the loss of their limbs. And she doesn't like hospitals-better for her the mobile ones.More exciting than the battlefield are the scenes where Marie must battle aged male professors for laboratory support, at a time when she is to them just a woman, and a thorny one at that. Thankfully few domestic scenes break the spell of her discoveries. Even though both her marriages can be fraught, the couples still don't overshadow the immense good she does for mankind.The biopic reveals the downside of her discoveries, especially the atomic bombs and the sicknesses that come with radiation. While not judging her for the side effects, the film does show her grappling with the realization that her accomplishments can carry pain as well as salvation.Amazon Prime has a winner here-take strength that even in a pandemic, scientists will find ways for us to survive. It helps to have a genius like Marie Curie once in a while."}, {"id": 132, "text": "I found many of the reviews here overly harsh. The use of flash-back/flash-forward scenes which could be construed as anti-American (in a movie launched by 'Amazon Productions'!) was ill-judged. (The view of 1945 Hiroshima as some kind of Eden-like idyll was just silly/uninformed, while portrayal of the mock-up town to be destroyed in a test blast in the 1960s could have been replaced by footage about Tsar Bomba detonated by the Soviet Union in 1961 which remains the most powerful human-made explosive of all time. To get back to the core matter of the film, however, I though the acting of the two principals (particularly the ever-reliable Ms. Pike!) was superb. I was also very glad to see the brilliant Anya Taylor-Joy playing one of Marie's daughters (after I had just watched her (Joy) dumbfounded in The Queen's Gambit (some o the finest television I have seen in months, if not years!) I imagine she must be set to become an absolute mega-star (even though only 24 (TWENTY FOUR!) years of age!!!) The infinite obstacles thrown in Marie's path (although, to be honest, a good number of her own making due to her abrasive and somewhat narcissistic character) are shown very clearly, as are her means of overcoming them and going to win TWO Nobel Prizes as a WOMAN and yet also raising two children (who BOTH went on to become world-leading figures in their respective fields (and some flash-forwards covering Eve would have been nice!) Overall, therefore, in my view perhaps not a great film, but certainly a very good one and one which I am sure I will watch again on some future occasion."}, {"id": 133, "text": "Marie Curie, winner of two Nobel Prizes, is always the first and maybe only answer to the question Name a female physicist for just about anyone out there. This is totally unfair, but her personal history is certainly fascinating enough for movie treatment. Madame Curie, the 1943 classic starring Greer Garson, took a kind of reverential tone and glossed over a lot of engrossing details (but it's still worth seeing if you get a chance).In Radioactive, Marie is a lot closer to a real flesh-and-blood human being. Rosamund Pike is excellent and plays the part with loads of energy and intensity. She also looks the part probably about as well as any beautiful movie actress can do, right down to the frizzy hairdo that Curie always has in the old photos. She's also just the right age: she can look like the younger Marie, the middle-aged one, or the older one to fit the progress of the storyline. Pike portrays her as a very forceful person indeed -- someone who will not take no for an answer, and who successfully forced her way past the immense gender barriers confronting her at every stage. I'm not sure how realistic all of that is, and Wikipedia isn't much help. I'd guess it has to be true to at least some extent.The centerpiece sequence comes early on when Marie and husband Pierre achieve their most famous work: isolating tiny quantities of two of the most intensely radioactive elements, radium and polonium, from tons and tons of pitchblende ore. Along with Becquerel's earlier discovery of radioactivity itself, this revolutionized the physics of the early 20th century. One thing that's refreshing is that the script stays remarkably close to the real history. She and Pierre did indeed pull off a herculean accomplishment to isolate those incredible new elements. With Becquerel they were awarded the 1903 Nobel Prize for physics (fair enough! though their actual lab work was just as much chemistry as physics), and it's true that without Pierre's intervention her name would not have been included. It's also true that both of them suffered long-term radiation sickness; that after Pierre's death she had a year-long affair with French physicist and friend Paul Langevin. It's even true that she helped develop portable medical X-ray units to use in the field during World War I (though it doesn't seem like she actually did go into the field herself -- in the movie, she and her daughter Irene are shown doing that together.)All this is good. Sam Riley does fine as Pierre, Simon Russell Beale as Dr. Lippmann has the thankless part of a male chauvinist bureaucrat-scientist constantly blocking Marie's way, and it was a nice surprise to see Anya Taylor-Joy (who's showing up everywhere these days) as young Irene. But there are problems. The director decided to insert lots of flash-forwards to more modern times: A Nevada A-bomb test site. Chernobyl. A new scanning machine in a 1950's hospital. And so forth. What are we supposed to make of this? that Radiation Is Evil? That the Curies were responsible for unleashing a modern Frankenstein on the world? Ridiculous. Radioactivity was there to be explored, and it would have been part of modern science and society regardless. Add to this that many of the scenes are not given the time to develop fully, and the whole thing leaves the impression of a sort of self-consciously artsy hodgepodge.That's maybe too harsh though. It's very watchable for Rosamund Pike's performance alone, and the meticulous historical settings."}, {"id": 134, "text": "'Radioactive (2019)' is mostly standard biopic stuff, even if it does have dashes of experimentalism here and there. The most obviously non-conforming elements are the infrequent but distinct vignettes focused around the varying uses and abuses of Curie's most profound scientific contribution (the discovery of radioactivity). These are odd and don't really add all that much, taking you out of the main narrative at the most inopportune of moments. Of course, they aim to weigh the positives and negatives of radiation through a retroactive lens. That's all well and good, but the the movie itself doesn't seem to be all that sure as to its own stance on the matter. Ultimately, I suppose, it posits that one cannot be responsible for the way in which their discovery is used and that the uncovering of a fundamental truth is more important than worrying about whether or not it will be put solely to good use. This isn't as big a focus as you'd expect but its inclusion is a nice detail, even if its execution leaves a little to be desired. The film is entertaining and engaging enough to keep you invested throughout. It isn't really about the discovery of radioactivity, it's about Marie Curie herself. Pike portrays her as a self-assured, almost arrogant figure with a scientific mind and an emotional core. It's somewhat unique, really; she's a genuinely strong woman who's neither 'badass' nor infallible. It's this portrayal that makes the movie work as well as it does. Still, it's a mostly by-the-numbers affair. It isn't massively compelling or exciting, and it does feel rather long. However, it's a solid biopic with interesting subject matter and a subtly strong central performance. 6/10"}], "reviews_amount": 135}