{"name": "Never Rarely Sometimes Always", "titleId": "tt07772582", "reviews": [{"id": 0, "text": "I loved it. Indie Cinema at its very best. The film is raw and real. The characters are raw and real. It doesnt try to make anything spectacular or romantisice its Topic and characters. Almost felt like a documentary. It is also the birth of two very talented Young actresses who will go a Long way. Sidney Flanagan and Talia Ryder, who already is set up in Steven Spielbergs West Side Story Remake. Flanagan has the lead and the more complicated role. She really put a lot of effort into it and you never see this as a Performance but a real human being. Ryder might not have had the more complicated role but this makes her Performance more complicated as she isnt as Showy as Flanagan. But she still puts so much heart and Soul into it. I also loved the dynamic between the two Girls. There is actually not much dialogue exhange between both. Often you think they are strangers but still they stick together and stand by each other. Eliza Hittman nailed it again and invites us into the Soul of two teenage Girls of the new millenium. A strong film."}, {"id": 1, "text": "This film brings us into Autumn's world as she deals with an unintended pregnancy. It it slow paced...the action is subtle, and this is just what makes is so encapsulating and believable. There aren't wild plots twists or sensationalized drama.The power is in the nuance. Sidney Flanigan gives a strong understated performance that has you feeling to your core for her. I say this as a 32 year old male who has no idea what it is like to be this character.It was so painful to see how she(and presumably other young woman) get treated by men in this society. It made me question my own actions. I left with a bit more empathy and understanding of a world I was unknowingly oblivious to."}, {"id": 2, "text": "I was attracted to this film by the Metascore of 91. But critics' rating is one thing. I was more surprised (delightedly) to see an IMDb user rating of 7.3.The opening scene is a high school concert in a Pennsylvania town with mundane, half-baked performances. One girl however, despite unsmiling, pours her heart into the song she sings. She is seen next in the washroom, with a close up to her slightly bulging mid-section. Our suspicion of why she looks so angry is soon confirmed. At a local clinic, the health care staff (not unfriendly) explains that they will have her do a self-administered pregnancy test. They also caution that if the result is negative, it may not be absolute, in which case she should take another one a weeks later to make sure. They then give her a device in a package. That's what they sell in supermarket, right? she asks although she knows that it is. The instantly available result is positive. Does it means that it can still be negative? she enquires. No, she is told, the uncertainty does not work the opposite way.This Sundance favourite could use an alternate title three dreary days in New York (a polar opposite of Woody Allen's recent breezy, witty A rainy day in New York). It is an Odyssey of 17-year-old Autumn (Sidney Flanigan), accompanied by endearing cousin Skylar (Talia Ryder), seeking abortion in New York which, unlike her hometown, allows minors to get abortion without seeking parent's consent. Understandably with limited financial resources, they plan a day trip which drags on for two more days. The clinic they visited, upon finding that her pregnancy has been longer than her hometown clinic's assessment, has to send her to their downtown office which, unfortunately, is just about closing. The next day, while received in a professional, helpful and sympathetic manner, she finds that because of the length of her pregnancy, she needs a two-day procedure. I shall not going into the details of the Odyssey of these two girls, strangers in a strange land.There has been many films on the subject of abortion. What makes this one stand out is its honesty. Throughout the film there is not a single moment of manipulative emotion. In fact the two girls, particularly Autumn, rarely speak. When they do, it is usually giving clear, concise information to people as necessary or answering relevant questions in a level-headed manner (there is one exception which I'll come to later). Between themselves, the exchange brisk remarks. And yet, through close-ups and nuanced pauses, we are privy to the soul of these two remarkable girls, not extraordinary, just remarkable.The one scene alluded to above has to do with the title of this film. During a long preparatory interview with a very considerate and professional health worker, Autum is asked many questions requiring only multiple-choice answer: never, rarely, sometimes and always. Starting as quite routine, these questions get progressively culminating in what is tantamount to probing whether her pregnancy results from rape. This is the closest we see Autumn showing any emotions, as colour rises on her face and tears start to swell in her eyes.This is Flanginan's first film and Ryder has only a couple of credits to her name. They are both incredibly convincing in their roles."}, {"id": 3, "text": "Never Rarely Sometimes Always is the second feature film written and directe by Eliza Hitmann. The story follows a 17-year old girl named Autumn (Sidney Flanigan) in a small town somewhere in Pennsylvania who had recently found out she's 10-week pregnant. Together with her cousin and best friend Skylar (Talia Ryder), they travel to New York city in order to abort the unwanted child.Not much is spoken between the duo in the course of this journey, all the feelings, needs and thoughts are given through a gaze, a smile or sometimes a hand touch. The film uses many many close-ups of Autums's face, whereever she might be, along with a powerful ambient music. We get to know her through these moments, and we feel her pain in ourselves.This film has 2 major subplots, the first being the abortion and unwanted pregnancy and director Hittman masterfully delivers her message through this film. the second subplot was the beautiful friendship of the two girls, a friendship that, as is shown in the film, above all other things in this world. I was extremely impressed by this aspect of the film and the brilliant performance of Flanigan and Ryder was a big factor in this regard.this film is not easy to sit through, it's definitely not a date or popcorn film, but it's an important one and it will stay with you for a while at least."}, {"id": 4, "text": "...of libertarian film makers and storytellers; they Rarely misjudge the mood; Sometimes they affect the future choices, some of their audience will make; they Always strive for a fairer and better world.The challenges faced by a young woman and how she faces up to those challenges, overcoming the impediments placed before her, in a system that predominantly fights against her and denies her basic human rights.Informative enough for any young women finding themselves in a similar predicament to know they have choices that they, and only they, need to make.An outstanding performance from Sidney Flanigan."}, {"id": 5, "text": "A simple but raw story with a realistic friendship at its core. No embellishments, no climax. Both comfortable and uncomfortable. Honest.Pro-lifers mad."}, {"id": 6, "text": "Not the type to recommend to everyone due to its controversial subject. The decision to get an abortion is a complicated one. Standout performance by both the girls. It feels almost too real at times. Authentic movie from start to end despite the controversial subject. Well done."}, {"id": 7, "text": "This surprised me. It shows how many things you can say with just a camera and some actors. The two ladies were great and had a great chemistry between them and the music and songs was mesmerizing. Finally an American film that looks like made in Europe."}, {"id": 8, "text": "Greetings again from the darkness. Movies that put youngsters in peril can go one of two directions: the story can feel contrived to the point of manipulation, or it can be real and heartfelt with commentary on society. Filmmaker Eliza Hittman proved her mettle with BEACH RATS (2017), and she proves yet again, that her instincts translate to the screen in stories and characters that hit a nerve.It's stunning to discover that this is the first screen credit for Sidney Flanigan who plays 17 year old Autumn. We first see her onstage at her school talent show singing a soulful rendition of He's Got the Power, a 1963 song by The Exciters. Her performance stands in contrast to the mostly generic acts from her classmates, though it's our first hint at how she is perceived. Autumn is one of those teens who seems to be naturally burdened with more than she can carry. A bloated belly leads her to take a pregnancy test at the local clinic, where she is informed that a positive is always a positive - a brilliant line than doesn't hold true for all interpretations.The clinic worker shows Autumn an anti-abortion video, which leads her to Google do-it-yourself abortion, and finally to the realization that because of Pennsylvania's requirement for parental consent, she'll have to travel to New York City for the procedure. Fortunately for Autumn, she has a trusted and resourceful friend/cousin/co-worker in Skylar (Talia Ryder, who will appear in Spielberg's upcoming WEST SIDE STORY remake). The girls skim from their cash registers at the grocery store they both work at, and then hop on the bus towards the city.Their time in the city is an adventure unto itself. By this time we've seen some of the everyday obstacles faced by teenage girls, including thoughtless teenage boys, a loathsome stepfather (Ryan Eggold), and a sleazy store manager. All of this is in addition to the challenges brought on by being a sexually active minor. On the trip, they meet Jasper (Theodore Pellerin, On Becoming a God in Central Florida), a fellow bus traveler who strikes up a conversation. Is he a good guy or not? Can he be trusted or not? Again, these are situations that the teens must navigate through instincts not yet fully developed.A questionnaire administered at the Planned Parenthood clinic provides the film's title, as well as one of its most powerful scenes. Ms. Flanigan is exceptional as this simple form requires her to face her situation and her life as she answers questions regarding her sexual and personal history. Ms. Ryder is also tremendous in making Skylar such a strong young woman and friend. This film and these actresses show more than they tell. The minimal dialogue contrasts to the many movies who portray gabby teens. Writer-director Hittman seems to make movies more appreciated by critics than mainstream audiences, but it seems her time is coming. She makes her political belief quite clear, but does so by focusing on the real world that teenage girls face. It's a dramatic work of art with extraordinary camera work by Helene Louvart (the excellent INVISIBLE LIFE, 2019)."}, {"id": 9, "text": "I appreciate that this film dares to touch aspects of reality that society consciously and conveniently looks past. This movie not only gives a voice to many without one, but also serves as a necessary reminder that those suffering in these ways are far from alone."}, {"id": 10, "text": "You should watch for the simplicity &amp; originality of the plot and genuineness of the characters and direction. The two ladies complemented each other brilliantly. Both of them on their own trying to overcome the unwarranted situation. You could feel it in the scene where they needed money to get back home. Skyler let her be preyed by a stranger just to get some money in return while Autumn holds her finger from behind the pillar, expressing both helplessness and gratitude."}, {"id": 11, "text": "This movie has very simple plot: a teenager girl 's journey from PA to NY seeking abortion. We can clearly see the hardship she is experiencing. The actresses are unknown/new, plot is simple, but still a quite powerful movie sending clear messages."}, {"id": 12, "text": "I read a review of this movie in the local suburban paper several months ago and put it on my DVD Netflix list to watch. Upon seeing this movie I found it surprisingly good. The two lead actors are great, very low key in their roles, and extremely believable. I was shocked to see it was both their first movie roles.Once again I see the detractors of this film using the terms: slow, boring, nothing happens, etc. I think you know who you are and where you stand based on those terms. This is also a movie that ardent Pro-Lifers will hate just on principle alone.If you have the desire and patience to see a well done story about two very young women trying to deal with a very big problem; as well as, all the sexist and moral junk that society hurls at them, then this is an hour and 40 minutes that you will consider well spent."}, {"id": 13, "text": "This astonishing movie brakes with every major rule of storytelling. There is no character arc no big obstacle to overcome no real conflict in the story or between the characters. The dialog is very flat the pacing very slow not twists and turns. But that is the brilliance of this movie. This is on purpose and it is ok to break rules in art in order to serve a purpose. It makes the story of Autumn extraordinary played by Sidney Flanigan totally believable. We are following her on her painful path and we feel like we what we are witnessing is real almost like a documentary. Talia Ryder playing her friend also gives such a breakout performance that there is no doubt in my mind she will go on to be huge star. The subtlety in both their performances make this not just a movie about teenage pregnancy but also a story of deep and meaningful friendship."}, {"id": 14, "text": "I came to this movie pretty hyped up due to it's great critical acclaim but it doesn't go all that impressing as critics are claiming. The acting is great, the dialogues are pretty raw and well written too. Directing-wise it pretty much works like any generic Indie film in 2020 (the style reminded me a lot of Eighth Grade). This is another movie that intends to talk about an important matter and portrays it in a super realistic way, but at the end you realize it doesn't really say anything about that subject that actually stands out. I do think it brings up some really interesting questions about abortion and misogyny, but nothing that hasn't been done before. Needed to be way way shorter, then I guess it could've worked better for me (and that's coming from someone who likes slow-paced movies!). Probably won't be re-watching it, but I wouldn't discourage you not to see it though; if you're curious go for it, you might enjoy this more than I did."}, {"id": 15, "text": "It tells us about a girl Autumn who Faced with an unintended pregnancy and a lack of local support, Autumn and her cousin, Skylar, travel across state lines to New York City on a fraught journey of friendship, bravery and compassion. and compassion. Sidney Flanigan who played the role of the Autumn who faced with untimely pregnancy just did a brilliant job...Loved her performance in the movie. For Autumn in this situation there is no option without abortion so how she successfully confronted with this situation that was shown in the movie perfectly and the fear and tension were created within the girls on this whole journey which you also feel definitely at the time of watching. Never Rarely Sometimes becomes a story of survival, friendship and resourcefulness as the two cousins navigate two days in the city with no place to stay and very little money. At the time of lockdown due to this pandemic you should watch this movie or not I don't know, but I really loved this movie. One of the best of the year so far."}, {"id": 16, "text": "Never Rarely Sometimes Always is, at its core, a movie about empathy. We see the world from the perspective of an ordinary 17 year old Pennsylvania girl, and what we see is many subtle but clear hints that while many of the people in powerful positions in her life are men, they have no understanding or appreciation for the things Autumn has to go through. Her boss is a great example of this, being completely unsympathetic to her not feeling good and needing to go home, but there are no shortage of examples, from the subway worker who gives them very curt directions, to the boy on the bus who sees no problem with badgering two girls minding their own business. Some of the personal, private events in women's lives, which abortion is the most extreme example of, simply aren't considered by men as something that they could be going through. In contrast to this complete lack of understanding, you see all the women Autumn meets have an understanding of how difficult this is for her. The bond between Skylar and Autumn is essential to the movie and I love the unwavering support we see from Skylar throughout the movie. This is a fairly minimalist film, with just a few big events, a few characters, and a focus on a couple ideas that are explored deeply. Hittman does a fantastic job of showing character reactions, particularly the discomfort and exhaustion Autumn feels throughout the process, and Skylar's understanding and constant support. Hittman just as pointedly emphasizes the complete lack of understanding of their need for empathy and space, instead seeing it as their right to ask whatever they want and impose as they please (we see this primarily from Jasper). The scenes that really drove this home and were painful to watch were as Skylar sees that she has no alternatives, to make it home she has to make out with this guy who just sees her as an attractive object. She's willing to do that for Autumn, but realizing the complete disconnect between Jasper's perception and reality, and realizing the way Skylar accepts the transactional nature of the interaction really hits home. This is a great movie, and one that reminded me to step back and recognize that women have to go through things and think about things I will never have to, and that it's important to avoid making assumptions about what women have or have not gone through."}, {"id": 17, "text": "I believe this was worth watching, but I wouldn't call it great. Personally I found this film too slow and boring. It took too long to tell it's very simple story. I do however like that it makes you think. Does it make you think? Every Doctor visit that I've had was slow, invasive, and boring, so this story is realistic in that aspect. Of course it's sad. People dealing with medical issues are often sad. Abortion is definitely sad. Even if you believe that women should be able to do what they want with their bodies, without a bunch of jerks pushing them around, it's still sad. As a film does it tell a story well? Is it well written and acted? This is what should be reviewed! Not whether you approve of the characters' actions and decisions. Go preach somewhere else."}, {"id": 18, "text": "My criteria for awarding a film a perfect score has always been one that immerses me, impresses me, and overwhelms me. With so many release dates for films in 2020 being pushed back, we will be lucky to get anything of good quality. I was not expecting a film of such high quality to come out.Never, Rarely, Sometimes, Always is a film about an abortion. It argues pro-choice. Personally, I am against abortion. But this little film is much too good at making great cinema for me to be angry at. It is a paralyzing experience where we automatically give it our full, undivided attention. You will be able to hear a pin drop.Autumn Callahan is almost eighteen-years-old and just found out she is ten weeks pregnant. Right away, she decides to have an abortion. Her doctor tries to talk her out if it to no luck. Living in rural Pennsylvania, she and her cousin, Skylar, travel to New York City to get the job done. Many obstacles are in their way.It is revealed through clues that Autumn was raped and that it why she is dead-set on her mission. I personally would rather her do what Ellen Page did in Juno, but there needs to be an original film. Autumn is selfish for taking a life growing inside of her, but we cannot help but sympathize with her. Having an unlikable character but still making them merciful is extremely rare. It shows good and original writing.Obviously, Autumn's mission turns out to be a success, despite her struggles. We hold our breath, not knowing if the abortion will happen or if she will have a change of heart. The main flaw with the whole thing is that it praises abortions. In 2007, there was an abortion movie from Romania called 4 Months, 3 Weeks and 2 Days that was very similar to this but was clearly against the action. I do not like that this film was in support of it. Good thing all of its surroundings were so great.I have never seen or heard of any of these actors. Sidney Flanagan plays Autumn. Talia Ryder plays Skylar. In the performances of the year so far, I certainly hope they get remembered for Oscar season. If they don't, it is only because this film is about such a sensitive subject. The friendship between these two is the essence of the film that gives it its backbone. They are dazzling.I may not condone abortions, but I do condone this film.4/4"}, {"id": 19, "text": "This film tells a teenage girl having to go through a very difficult time of her life, with only the support of her cousin. The scene which features the title of this film is very effective and emotional. The latter part of the film is pretty slow, but heart wrenching."}, {"id": 20, "text": "Fairly sobering view of abortion in America, fluctuations of available support based on geography, demographic and exposure to pro-life factions within the very pregnancy clinics available locally. Impressively and sensitively acted, shades of the Romanian film of last 10 years of which the name escapes me"}, {"id": 21, "text": "I believed in what was going on, and I really cared about the characters. So it was tough viewing but refreshing and courageous.Lovely performances from everyone especially the two leads. A kind of purity of vision and construction."}, {"id": 22, "text": "This is an important film about an important issue but also a story and film with seeing"}, {"id": 23, "text": "Torn on this. On one hand it's superbly directed and I respect how its shot in such a non-judgemental way, with a real empathy for its characters and the situation they're dealing with. There's a real honesty to it.But on the other hand it's also.... a bit of a snoozefest at times and kinnnda underwritten. The protagonist is very quiet and reserved, in a role that's super challenging because you have to convey so much with so little. The film lives and dies by how you connect to that character and in this case it just didn't quite work for me. When trying to understand why it didn't work I was reminded of Manchester by the Sea for some reason and thought how the lead performance in that film really captured the energy I think this performance was going for, albeit much more successfully. The exception to this being the scene the film derives its name from, which is honestly heartbreaking and one of the more moving things I've seen this year."}, {"id": 24, "text": "This young woman defied an ill informed crisis health center and then traveled across state lines, possibly through New Jersey (ie multiple states), to procure healthcare. And then to arrive and learn they'd deceived her. There fake diagnosis of ten weeks was actually eighteen. Well thank god for New York State!!! If it wasn't for their pro life health care laws, women would die. And this girls future would die too. She was allowed an abortion but it compromised her and her cousins safety. Yes, some of it was out of pride, but more of it was out of fear. So days later, she slunk back home to her parent and assimilated to the life we created for her. And no one will knows the triump she lived or the struggles she persevered."}, {"id": 25, "text": "''Never Rarely Sometimes Always'' is neither dramatized nor bias, it doesn't try to push an agenda or have a life-changing lesson. All this film is is an honest look at the journey of two young girls' to get an abortion. It takes you along with them through the mundaneness of life, confronts you with the uncomfortable parts, and shows you the human at the center of this, which is the most important aspect yet sometimes forgotten, maybe even neglected in the heated debates about morality. I'm pretty sure Google didn't look that good back in 2002 though."}, {"id": 26, "text": "A story so simple, that speaks so much louder than just words. Never Rarely Sometimes Always is as real as it gets. Seeing two young women being treated as if they're disposable, was infuriating. The voice this film gives to so many silenced women out there is beyond measure."}, {"id": 27, "text": "I gave it an 8 only because it was slow moving.. Other then that This was a real eye opener! Please parents educate ypur children. No child should EVER have to go thru this or feel like this....After this I hugged my teenager and said NO MATTER WHAT ALWAYS TALK TO ME.. This movie was moving and eye opening.."}, {"id": 28, "text": "This reminded me of The Assistant, another great film from 2020; a quiet, difficult, emotionally penetrating film about a young woman trying to live in a world made for / by men, starring a young &amp; revelatory lead actress carrying the movie with immense ease of power. The questionnaire scene alone is enough to earn her whatever award for which she could be eligible. Undeniably masterful indie filmmaking that I just have no desire to sit through again...though maybe as a male I should have to."}, {"id": 29, "text": "Well acted and at times very moving. I enjoyed that I didn't feel to much of a bias to pro life or choice just an honest story. I would like to have known more about the back story that I was eluded to"}, {"id": 30, "text": "My wife and I went to see this film, more as an change of environment, after the heavy covid restrictions. I wasn't expecting much from it. To my surprise, I found it extremely thought provoking and heart wrenching. The difficulties encountered to obtain an abortion were presented in a very subtle way, as was the history behind the pregnancy. Much is left to the viewers imagination. A very good and worthwhile film to see."}, {"id": 31, "text": "Realistically good one, no zig-zag, simple and well portrayed and kind of melancholic and dark in way of problematic teens now a days! Not that was i expecting, but honestly i liked it to some extent."}, {"id": 32, "text": "An incredibly slow film, with unlikable characters and very few questions answered.Admittedly, a few thought provoking moments as we share a journey with a young lady on a path to solutions with an unwanted pregnancy - Highlighting the struggles young women in America have with local and safe abortion.We follow this journey closely, but you never feel too invested in the lead characters as both lack personality. Wooden characters, whose language is summed up in monotonous teenage misery.The whole film just feels sluggish and grey."}, {"id": 33, "text": "At a loose end and wanting something to do, this became the something. Not expecting much other than a teenage flick with music I wouldn't understand coupled with well you know, teenagers flick scenes. In the end thoroughly enjoyable, not a teenage film but a teenage problem. I loved the underplayed dialogue, no wasted words instead relying on nuance of looks and small actions, two wonderful portraits from two wonderful actors. Not to give give any spoilers I wonder if given the title, the interview given to abortion advisor and an early home scene has thrown us a red herring."}, {"id": 34, "text": "Berlin's 17th main competition. A good youth movie and a movie that focuses on girls should look like. Many scenes have reached the bottom of my heart. This is not only a departure of the two girls, but also a silent struggle. The angle of the title cut is very good, and can even be extended to everyone's social relations and opportunities. Many places have made white space, taste it, do not drag, very sincere."}, {"id": 35, "text": "I never had the feeling of such a wasted time and evening after watching this.. Just wanted to warn you not to make the same mistake. Not worth it."}, {"id": 36, "text": "Just like the other guy from Pakistan said on this review page . WHAT WAS THIS LOL ? Not even a character study, just a plain ole nuttin . Two thumbs down ."}, {"id": 37, "text": "I was thoroughly entertained by the acting and the writing, and the ending was delightfully inspiring and satisfying in so many ways."}, {"id": 38, "text": "And furthermore messages should be concisely written and possibly covering the multiplicity and complexity of the issue they are concerned with. Right from the start this is a predictable film (and being predictable stimulates boredom), maybe it could have been a great short, cut 60 minutes of it and then its only really impactful scene - the one which gives it its title - would have been great. If you want to watch a really good movie about this theme then 4 Months, 3 Weeks and 2 Days by Cristian Mungiu is the right one to watch. My guess is that the rave reviews that it has got have more to do with its conformism to the current dominant climate in the media industry than to its cinematic (lack of) value."}, {"id": 39, "text": "This is a TERRIBLE movie. Waste of time, waste of money. Not good AT ALL. Don't waste your time with this garbage."}, {"id": 40, "text": "Planned Parenthood (and make no mistake - this movie is not about a girl who found herself in a tough situation; this movie is about making Planned Parenthood look good and making abortion palatable) has suffered a serious of PR setbacks in the last few years, so they create this fantasy of a movie to make them look like a loving and caring organization that is reluctant to perform abortions. That's what makes it a fantasy. This movie does not reflect real life. The characters do not represent real people. I'd give this a zero if I could."}, {"id": 41, "text": "I didn't expect the title of the movie to be loaded with so much meaning. Not that I want to give a spoiler, but as women, our lives definitely include those words. And these words point to some continuous situations that arise from time to time for us. This film is remembered me of some stories that belongs to my friends, colligues or a woman whom I saw in the news. Feeling super delicate rn. Like we are already not..."}, {"id": 42, "text": "Beautiful movie, very well written and acted. It feels like it was based on so many true stories I know. It's one of those pictures that schools should show their 13yo students. I see some people complaining that it was unrealistic to portray men as different degrees of disgusting, and women on a more positive light, which I disagree. Everything about Never Rarely Sometimes Always felt real to me."}, {"id": 43, "text": "Wonderful, caring and thoughtful teen story beyond any typical imagination. Beautifully filmed and smartly edited. It's a shame this was not made fifteen years earlier so that the quality of teen girls' lives might have been better understood. Clearly, the only reason to not fully educate teens is to be able to take advantage of them and the money they spend. Our world is full-up with more male pigs than we can afford to support. We actually need to cull them when they refuse to conform. Or, we could make more movies about them in their natural habitat."}, {"id": 44, "text": "Even though she wasn't the man character, it's her performance that kept me watching the movie. Incredible performance from Skylar. Her sacrifice and love for her cousin is beautiful and out of this world. Not too pleased with the story line tho, maybe because am not one for abortion. I feel if it's not a rape case, health risk or you are not married, you shouldn't be allowed to abort. But that's for another day. Aside that, the picture was cool."}, {"id": 45, "text": "Very very very boring ,,, Dont waste your time to watch it ,,, I extremely regretted because I watched ,,,"}, {"id": 46, "text": "I have no issue with the message or politics of this movie at all, in fact they largely align with my own and it is an important topic. However this movie is just too slow in places and as some others have mentioned should have been shorter. As one example - I am not interested in the boring journey from the home town to New York which must have taken up 5 mins or more of screen time - this part is too much likely boring reality TV. We all know what boring train journeys are like. The other aspect that made me uneasy was the poor light in which pretty much all male characters were shown. I am aware that there are a lot of misogynistic guys who are all to happy to hassle girls and treat them with a lack of respect, but equally there are a lot of decent well meaning ones as well. The danger of this last point is that you may lose a lot of the male viewers who will feel they are all being unfairly tarred with the same brush."}, {"id": 47, "text": "Superb movie deep and powerful insight real into young people The main actors were pphenomenal the two women and the one young man on the date they were all great . Felt very real and honest Love the music for sure Sidney Flanigan is great for sure.Wished we had more movies like this.Reminds me of the mumbledore thing"}, {"id": 48, "text": "Never really sometimes always wow what a title if only a movie was interesting or captivating like him,this movie shows a teenage girl that goes with her friend on a mission to abort her baby,by that premise you just know that this film isnt for everyone,film deals with hard subject and theme is often very shuted down and ignored,our lead was good with her performance but she was just to emotionless and completly uninteresting ,i know that this kind of film doesnt need to have that but i felt like it missed some big marks that could be achived throught that,never really sometimes always is a watchable film with good performances and story that wasnt able to follow it"}, {"id": 49, "text": "It was the most boring movie, I've ever seen. If it was a short film maybe it could be honest, emotional or stunning short film, but this is nothingness. It is only time waste, how it has got awards so much i didn't understand. Give my time back!"}, {"id": 50, "text": "Aside from being basically a Planned Parenting infomercial, this turgid and suffocating film is yet another attempt at meaningful minimalism that completely forgets to insert any interesting narrative or characters and relies purely on the brutal subject matter to invoke any kind of substance."}, {"id": 51, "text": "This film start with a girl Autumn performing at a talent show on stage, and she went to a medical center to check for her pregnancy scene! As turnout, this film is about Autumn assist by her cousin Skylar to perform an abortion surgery at New York city! Entire film full of boring conversation, and annoying overuse scene! Such as, overuse of the performing treatment on stomach scene, overuse of the pulling suitcase scene, overuse of the check-in scene, overuse of the buying ticket at kiosk scene, overuse of the singing scene, and overuse of the riding train scene! Make the film unwatchable! Barely laughable scene is, Skylar drop the bowling ball while she trying to throw the bowling ball! At the end, after perform the abortion surgery, Autumn travel back home with a bus! That's it! Wasting time to watch!"}, {"id": 52, "text": "Yes this movie is a bit slow, but it tells an important story. It shows a young girl having to go through something that she shouldn't have to at her age. It also brings up themes such as abuse and possible prostitution. However, at its core, it's the story of two cousins with one trying to make sure the other is okay at any cost. I really like the way the two main characters work off each other. In addition, if you're a man in this movie, you suck. It's definitely a hidden gem of 2020 so far."}, {"id": 53, "text": "I thought this film was great and I'm almost certain all of the bad reviews will be from men"}, {"id": 54, "text": "A crude account of the reality of many young people in the world, an intimate look with much detail of a truth that is distant for many people in today's society, a very special connection between Autumm and Skylar in a New York colder than normally any movie."}, {"id": 55, "text": "Reality of what some young teenage girls go through. This was a raw and real film. Not a lot said but not a lot needed to be said."}, {"id": 56, "text": "The scenario like ( 4 months 3 weeks 2 days) movie Thanks"}, {"id": 57, "text": "This movies is so slow and so predictable that you could pinpoint what will happen in the first 5 minutes. Nothing original. Do not waste your money...or time."}, {"id": 58, "text": "Didn't really know what to think of this film. The subject matter -while serious, never botheresd me or my beliefs. It was just the main character Autumn was soooo sullen, almost morose, played pretty convincingly by Sidney Flanigan. The character seeemed to lack ANY emotion until the very end of the film. Understandably this was probably done intentionally to portray a very scared and very angry young woman. Decent performances all around, especially the best friend/cousin Skylar, played by Talia Ryder. Poor Skylar seemed to burden Autumn's problem throughout the entire film, while Autumn sat stone faced and rude. While the character of Autumn was probably purposefully written that way, the acting was pretty good. And while the story may have been slow in pace, the subject matter is a must see for everyone."}, {"id": 59, "text": "I wouldn't waste my time , it's a lame intend to a movie . I would describe it as a boring YouTube video from amateur actors and producers ..."}, {"id": 60, "text": "Never a dull moment but just very sleep-inducing (or somniferous if you like them expensive words)"}, {"id": 61, "text": "This was never a movie and always an advertisement for PP. The acting was marginal/tired, the situation vague. We don't really get to know the characters except they are under 18 and live in a state where a parent has to sign for the minor to have an abortion. They vilify the local pregnancy center by suggesting that they don't know what they're doing while they glorify the abortion center by showing how concerned they were. This was a very long advertisement."}, {"id": 62, "text": "This is a good movie, but it feels kind of unrealistic in an annoying way. Every male character sucks."}, {"id": 63, "text": "Give a nine year old a camera and get a 10 year old to write a script and you have a good chance of producing a better result than this sorry excuse for a movie. Unbelievable."}, {"id": 64, "text": "7/10 - well-directed indie about a teen undergoing an abortion lacked the punch it needed to take it to the next level"}, {"id": 65, "text": "A very realistic, very relatable film about a teenager trapped by misogynistic state laws which restrict women's reproductive rights. With ACB on the Supreme Court, things could get worse now."}, {"id": 66, "text": "Adequate acting. adequate (barely) plot/writing, but overall lame."}, {"id": 67, "text": "This movie is boring. Slow. Basically movie about nothing. Thousands of women, unfortunately, has abortion every day. It's sad. But this story is nothing extraordinary, nothing special. I feel like I just wasted 2 hours of my life."}, {"id": 68, "text": "Emotionally this film was powerful and moving , I loved the relationship between the cousins and this is a very important topic to put into media ( both abortion and sexual harassment ) however - it was simply too long . There are several powerful scenes including the pre- abortion survey ( never , rarely , sometimes , always ), the grocery store close out scenes , autumn calling her mom from the bathroom , the girls holding hands as skylar makes out with jasper and the overall feeling of fear and desperation and immaturity .I felt all the time spent walking around NYC and some of the scenes felt too long and because of the added time and details you actually left feeling left out, in reality a short film would have given more emotion and that would get more young people , they care ."}, {"id": 69, "text": "Juno but she's sad all the time and not very funny."}, {"id": 70, "text": "Documentary feel. Neo-realism, maybe (the Sundance award). The Berlin win is debatable because I have not seen the other contenders at Berlin 2020 so far.."}, {"id": 71, "text": "Never expect, seldom resist, sometimes cry, always silent."}, {"id": 72, "text": "It is a sad tale of adolescent girls, but it is also a struggle of female resistance"}, {"id": 73, "text": "Independent films that premiere at festivals, get picked up by a pretty recognizable distribution company, and eventually either released in theatres, or in this case, at home, rarely get seen by a large audience, due to the small nature of the movie. Without large marketing campaigns, films like Never Rarely Sometimes Always are likely to fall by the wayside. With that said, it's also very much a case of whether or not you're willing to watch a film with tough subject matter. I always highly recommend viewers seek out hidden gems because you will often find something great that nobody has been talking about. Due to the premise of this movie though, I find it extremely difficult to tell you to watch it and here's why.After 17-year-old Autumn finds out she's unintentionally pregnant, she ventures off to New York City with the company of her cousin. Her plan is to find a clinic that will allow her to terminate the pregnancy, which becomes quite a stressful life-threatening trip for her. Off the top, I'll just state that if this premise will never be able to hold your attention, I'll save you from this movie in saying that it really does waiver from that synopsis. When I watch a movie, I choose to put myself in the shoes of the person involved, even if that means stretching my beliefs a little. In regards to that, this movie is absolutely fantastic.From the dirty, grainy look to the entire film to the incredibly raw performances by both Sidney Flanigan and Talia Ryder, this film had all the makings of what people in the film industry consider a festival darling. Not only did this film feel authentic from start to finish, but can also work as a lesson to those who are faced with a similar situation. While I found myself fundamentally disagreeing with every single decision every character made throughout the course of this movie, I also felt for them. Autumn was faced with impossible circumstances between this and her home life and made you beg the question of what the right decision truly was.Written and directed by Eliza Hittman, Never Rarely Sometimes Always has proven to me that she is a director worth following. The performances she was able to get out of every actor/actress involved were amazing to me. I believe it was due to her realistic screenplay and caring direction that such an authentic film came from her. She is definitely someone I will seek out in the future. While it is some very tough subject matter to handle, I believe she did a great job, even if it will be a devastating watch for many viewers.In the end, Never Rarely Sometimes Always is not a film for everyone. Some viewers will despise it, some, like myself, will be able to look at the story itself and find a fantastically done film, and other may be able to relate to it on a personal level. This is the type of movie that will hit viewers in many different ways. On top of that, it has a very slow and quiet feel to it, so some viewers may also find it slightly boring. For me, it was kind of the perfect storm of being hard to watch, but also impeccably made. Again, it's very hard to recommend this one, but if you're willing, it's pretty great."}, {"id": 74, "text": "The movie's title is a very innovative one, I knew this movie was going to be about abortion but that title didn't make sense to me until the middle of the movie and the scene was really raw and powerful. These are the kind of movies only a woman could make, its tough for a man to understand the bond between two women, the oppression they face from a patriarchal society and the ugly entitlement men feel over their bodies.Eliza Hitman wasn't interested to preach to the audience, she wisely ignores it and rather chooses to hit the raw nerves of anti-choice men and misogynists. Autumn (Sidney Flanigan) is shamed at the start of the film, discouraged to abort her one child, her own state doesn't allow her to make her own decisions on her body, her employer doesn't allow her to take a break when she is unwell, helplessly watches her cousin get preyed by predatory men and also faces cash shortage but in-spite of all this she bravely aborts her fetus with the help of her cousin Skylar (Talia Ryder).Though Autumn is the protagonist of the film, we all would relate more so with Skylar. She sticks by her cousin no matter what and even undergoes great sacrifices to help her. This movie is a must watch by all and a great reflection of a male dominated society."}, {"id": 75, "text": "I never thought I would see the day that countries, states or counties would backslide away from abortion legislation and rights, but that's exactly what's happening in America. A staggering 25% of countries still haven't legalised abortion, which is brutal. Eight states in america are proactively stopping abortions using the covid pandemic as a smoke screen for forcing women into continuing their pregnancies, leading the women to buying dangerous abortion medication on the dark net. There couldn't be a more fitting time for this film. In this film we're shown the complexities of simply being a girl; unwanted touches, kisses, comments, looks, and sometimes all of these in one day, with no recourse to rebuff these leary advances without being branded a sl*t, a prude, mentally unwell, a lesbian or a trouble maker that doesn't have a sense of humour who obviously hates men . There is a running theme throughout the film that this young woman's body is simply not her own, which is essentially what the legislation, the thinly veiled family planning medical centre (anti abortion clinic that attempts to pressure, hood wink, guilt trip and plead young women into continuing their pregnancies) emphasise with their repeated attempts to show her the baby, listen to it's heart beat and watch (a very real) anti abortion video in attempts to halt the termination. The sexual harassment echoes the theme of the women not having agency over their bodies and this is done stunningly well throughout this. In so many films we see this behaviour over dramatized or done poorly, but the director and actors portray everyday sexism (a website called everyday sexism where people tell their personal stories of misogyny and discrimination if anyone's interested) that women endure every.single.day. The director spent time with many professionals and service users before creating this film, and it absolutely shows as it's heart achingly real. I have supported friends in this situation and their decisions to terminate their pregnancies were all different and unique to their situations, but none of them undertook their decisions lightly, and all of them, some years later, still carry grief, shame and guilt. The last thing they need is their district, family, country, community, medical personnel compounding these feelings. This film is absolutely necessary and holds a mirror up to the uncomfortable reality that in some states and countries a bundle of cells has more rights than the women. Forcing women to proceed with an unwanted pregnancy isn't pro life, it's exceptionally cruel. Well done to everyone that created this film, it's message is vital."}, {"id": 76, "text": "The name Eliza Hittman meant nothing to me when I saw it in the credits for this movie, but then the Internet reminded me that she also directed Beach Rats, one of the undiscovered gems of 2017. Now with Never Rarely Sometimes Always, Hittman has once again proven herself to be one of the most adept filmmakers at tackling the perilous transition from teenager to adult, whether in boys or girls.Never Rarely Sometimes Always resembles another exceptional abortion film, 4 Months, 3 Weeks, and 2 Days, though this film doesn't exist in the same menacing environment as that other one. Still, the prospects for the young girl in Hittman's film are no less bleak. For a long time, the film seems to be about the logistics of obtaining an abortion and the desperate lengths a young pregnant woman will go to to have one. But a scene, or should I say THE scene, set in an abortion clinic that gives the film its title, reveals that this film isn't really about abortion as much as it's about sexual abuse and predation. Pregnant or not, abortion or not, this young woman has already been damaged many times before the movie even starts, and it's likely, the film implies, that she'll be damaged again.Hittman is able to get the most amazing performances out of young and inexperienced actors. In Beach Rats, she directed Harris Dickinson to an award worthy performance, and she does the same here for Sidney Flanigan, playing an inarticulate and frequently silent young woman whose silence nevertheless speaks volumes.Grade: A"}, {"id": 77, "text": "The movie shows all kinds of sexual harassment girls are getting nowadays and forever, either from a work boss, friend, boyfriend or just a guy walking in the street and how they suffer from their consequences. And that's a great message to try to send, but were there other things I did like in the movie beside the message? Of course Starting from the great performance from Sidney Flanigan, she was amazing, she was a perfect casting choice, and the fact that this is her first film ever blows my mind, she was perfect! To the dramatic story that breaks your heart when you see that little powerless innocent girl suffering from all that harassment. To the friendship between her and her cousin, and the chemistry between them was fascinating it was really heartwarming.There are somethings I didn't like, sometimes the movie was boring and there were some scenes that don't help or move the story forward, they were added to add more minutes. And I didn't see a change in the character, Open the movie and watch the first ten minutes, then watch the last ten minutes you barely see any difference. and that's a huge mistake in any script.I have to say it was really hard for me to continue watching this movie, there were some scenes I couldn't continue looking at the screen and I stopped it for awhile to could continue it. And I think it did help the story and the message.The movie's title and its reference inside the story was pretty awesome, you've all watch it."}, {"id": 78, "text": "A touching, heartbreaking &amp; bracingly relevant indie that beats at its loudest during the quieter moments in between, Never Rarely Sometimes Always is a small-scale but powerfully resonant drama that tackles its difficult subject matter with prudence &amp; without prejudice, and is wonderfully manoeuvred by the poignant performances from its young ladies.Written &amp; directed by Eliza Hittman, the premise is a simple one but the emotions it elicits are raw &amp; evocative. The plot is lean, focused &amp; constantly on the move, and Hittman places complete trust in her actors to guide her story to its destination. The characters are sketched with care &amp; compassion, their predicament is firmly rooted in reality, and they are beautifully rendered by the cast.Sidney Flanigan plays the teenage protagonist seeking medical help in the wake of an unintended pregnancy and the subtleness with which she brings her character's inner turmoil to surface is simply astounding, even more so on realising that it's her acting debut. Talia Ryder deserves a mention too, chipping in with a strong support that's just as impressive if not more as her character is challenged in her own ways.Overall, Never Rarely Sometimes Always is a sincere, heartfelt &amp; genuinely moving indie drama that benefits from Hittman's composed direction &amp; sensible writing, and is further elevated by emotionally engrossing inputs from both Flanigan &amp; Ryder. The documentary-like approach, silent camerawork &amp; relaxed pace serve as necessities to this performance-driven story while quality work from its cast makes it all the more effective &amp; worthwhile."}, {"id": 79, "text": "I was very impressed by this movie. In a world of superhero movies that have to keep increasing the volume and intensity of the violence to get an audience, this movie is a realistic, understated and heart-wrenching story of Autumn, a young woman who finds herself faced with an unplanned pregnancy, and Skyler, Autumn's cousin and close friend. The movie follows the women as they go on a courageous journey to New York City to get Autumn an abortion and the health counseling she is unable to get in her rural hometown.I have a lot of respect for the way the script and actors show the two young women, brilliantly played by Sidney Flanagan (Autumn) and Talia Ryder (Skylar), quietly and persistently navigating their way to finding Autumn the help she needs, despite their lack of money and knowledge about travel to the big city, the obstruction and dishonesty of the local family planning clinic, the misogynist men in their lives, the lack of support in their local community and families, and the men in New York City who are also not respectful of them and their bodies. The quiet communication between the life-long friends, and their weary deference to authority figures and men who can offer them needed resources, are very realistic and subtle cues that the director and writer Eliza Hittman knows what she is doing and does it well.The script and story are very low key and believable - lending a documentary style to the movie that makes you feel like you are going through the experiences these two young women are going through. Much of Autumn's past is not explained, which is also an unusual and nice touch. I disagree with the reviewers who claim that the movie is unbiased - it isn't unbiased to show every single male the two protagonists encounter as having no respect for women and their bodies, There could have been at least one non-misogynist male in the movie, after all. However, it is very believable that these particular women have no really respectful guys in their lives - it happens. And the actions of the men in the movie make an important point about the hazards and lack of respect young women like Autumn and Skylar often do face in their relationships with men. This movie reminds us that we have a long way to go, if we are to treat each other universally with decency and respect."}, {"id": 80, "text": "Never Rarely Sometimes Always (2020) was written and directed by Eliza Hittman. It stars Sidney Flanigan as Autumn, a 17-year-old young woman who lives in a rust-belt town in Pennsylvania. As the story opens, we learn that Autumn's father is a lout and Autumn's mother, although well meaning, is too hassled to give her the attention she needs. We also learn, within the first few minutes, that Autumn is pregnant.Autumn and her cousin, Skylar (portrayed by Talia Ryder) set off on a bus journey to New York, where abortion is legal without parental consent. (It's illegal without consent in Pennsylvania.)At that point, the film becomes a road movie, with multiple encounters, mostly unpleasant, as the two women are set adrift in Brooklyn and Manhattan.The acting of both Flanigan and Ryder is excellent, and director Hittman knows how to bring out the best in both characters.This isn't a feel-good movie, although Skylar's loyalty to her cousin is impressive. The films also leaves many questions unanswered or partially answered.It's truly an honest film. Director Hittman could have made it easier for the viewer in many ways. She never takes the easy road.Autumn is discouraged and overwhelmed, but she moves forward. However, she moves forward in a erratic and uncertain way, so we can never relax when watching this movie.This film worked well on DVD. It has a respectable IMDb rating of 7.2. I liked it better than that, and rated it 8."}, {"id": 81, "text": "Director/writer Eliza Hittman has exercised her style well enough to have stumbled this far from her full-length directorial debut, It Felt Like Love. Unlike most indie films waiting to sucker punch the audience with its plot diversion, this film sticks to its gut: a streamlined sensual story.What is supposed to be a representative story might come off as political in this film when, in fact, it merely plays with the political aspects of society. Still, the struggles of a woman trying to abort a baby that she fears she's not ready for, in a conservative society is very well portrayed. Much like her previous project Beach Rats, the protagonist is rarely out of the frame which helps us connect to her by the end of the film even though she portrays herself to be tough until a point she eventually breaks down.From trying to cheer one up with rubber band tricks to crossing fingers between uncomfortable times, Never Rarely... effortlessly presents the friendship between two close cousins who, despite the circumstances one gets the other into, understand the weight of the situation and display affection by bold sacrifices rather than direct expression. Unlike Beach Rats where the ineffective dialogue prevents the audience from a deeper understanding of the protagonist, here the absence of dialogue between two major characters adds to the level of their relation, on which much of the plot depends.Newcomer Sidney Flanigan proves herself to be subject worth mentioning with a subtle yet powerful performance. The chemistry between Talia Ryder, who plays very during the run of the film, and Flanigan layers the story of the film. Credit also goes Hittman's writing for not providing teenage characters with superficial dialogues. Perhaps parents being unaware of and unrelated to their children's life is still the path the film likes to go along. The highlighting of the steps conservative people take to not lead others into making the choice of adoption was well done.Unlike few films these days, this film knows the difference between a plot and a story of the film. Hittman's style works very well with this film and the powerful scenes such as the one, where the film gets its name from, prove this film to be an indie highlight of the year."}, {"id": 82, "text": "First of all, this movie strives to be realistic and truly put you in the shoes of a 17yo pregnant girl. the characters are never entirely bad or entirely good which is exactly the right move for these types of movies,because if they were exaggerated in any way the film would end up feeling irrelevant and distant and it would defeat the entire purpose of it.the mistake the writer makes is the distribution of good and evil !when you look at the characters individually they're actually very well written they're never exaggeratedly good or evil and all feel like they could exist in the world we know, but when you zoom out and look at the whole picture you notice how every single male character with more than one line of dialogue was kind of a douche (to different degrees of course, as I said the writer never exaggerates) and every single woman with more than one line of dialogue was a nurturing angel (again to different degrees)?the movie should be realistic and it is, until it isn't, until you realize you didn't see ONE decent man or ONE mean woman for an hour and forty minutes."}, {"id": 83, "text": "I've been wanting to see this for a while but just didn't get the chance. I finally managed to see it and I'm so glad I did because this is easily one of the best films of the year.Never Rarely Sometimes Always follows Autumn, a teenage girl who travels to New York City from Pennsylvania with her cousin, Skylar, in order to receive medical help after an unwanted pregnancy.There have been movies in the past that deal with a subject matter like this but Eliza Hittman makes this film stand out. This is the first time I've seen a film of hers and I can already tell she is a filmmaker to look out for. What impressed me was Hittman's ability to tell a story with a dark subject like teenage pregnancy and abortion with so much nuance. Despite its minimal dialogue, I felt so much for the main character and the situation she was put in. The brilliant score and excellent performances by Sidney Flanigan and Talia Ryder convey the emotions and thoughts going through their characters' heads. The dark and murky cinematography fit extremely well with what the film had to say and Hittman's ability to keep the film grounded at all times made it all the more emotional.As mentioned before, Sidney Flanigan is amazing and it surprised me when I found out this was her first ever film. I could tell all the emotions and pain she was going through just by her expressions alone. There is one outstanding scene where you understand the meaning behind the title and it's a very long shot just focusing on her face as she is answering certain questions. There is some dialogue which reveals more about her character but its her silence whilst answering some of the questions that have the most impact. I won't reveal any more detaila but that scene alone showed me how talented of an actor Sidney Flanigan is and how great of a director Eliza Hittman is. Talia Ryder, who also hasn't acted much, is extremely convincing in her role.So far, Never Rarely Sometimes Always is my second favourite film of the year. Its raw and realistic depiction of such a harsh subject matter is done incredibly well and managed to move me with its heartfelt scenes. The film is very quiet but it spoke volumes to me and it's one I urge people to check out."}, {"id": 84, "text": "When the film is over 30 minutes old, two girls are sitting on the bus to New York. A strange man sitting beside them tries to talk to one of them and asks for her phone. It seems to be the most normal thing, but if you look carefully, you will find that the girl is a little hesitant and uneasy. When you arrive at the station, the man comes up to them and asks them: you know Where do you want to go? The girl replied that after the man left, the two girls looked at each other and frowned slightly. Most of the boys may be difficult to understand, think I just want to meet her, talk with her for a few days, and it's very polite, why does she show indifference? Sometimes women themselves will start to reflect on whether I am too careful, which is not cool at all. But the news of violence against women suddenly comes to your mind, and you have to be alert for a long time. The perspective of the film is peaceful and delicate. For example, autu lies on the couch of the clinic. The lens is aimed at her belly, and the bruises on it can be seen at a glance. One hand is coated with transparent coupling agent on her belly. She looks up at the clock tick by tick, and then at the sky. For example, on the subway, two girls share the snacks they just bought. You take a bite of mine and I take a bite of yours. It's a short and ordinary happiness."}, {"id": 85, "text": "Never Rarely Sometimes Always is the latest mumblecore indie-drama in which all the men are creepy/evil and close-up shots of our sad protagonist rule the day. Did I mention she's sad? She's very sad.Brutally honest dramas that deal with real life difficulties are great, but they've become so en vogue with critics on the festival circuit over the last ten years that they're about as fresh as the latest Marvel flick at this point. Ladybird, anyone? You could dedicate an hour and a half to this film, or you could simply binge watch the original Degrassi, which features a similar level of character development, comes in bite-size versions, and was released during a time when these topics were actually dangerous to cover. If you're all about that sweet, muted colour palette though, go nuts!Btw, why are all the older women in this film meek pushovers? And what kind of registered medical clinic would show an anti-abortion film? I had to double check this wasn't actually set forty years ago."}, {"id": 86, "text": "Not to get preachy here but I think it's safe to say that as a man, I am never going to fully understand the blood sweat and tears that goes into having an abortion, especially in a healthcare system as terrible as the US, it must cost loads of time, energy, money and must (depending on the circumstance) cause loads of trauma surrounding the cause of the pregnancy and trying to get it aborted in time before the fetus has evolved to a point where they will not allow the procedure to continue.For that reason I'm somewhat glad that a film like Never Rarely Sometimes Always exists, because while people like me wont ever experience an abortion procedure in my entire lifetime, the medium of film is powerful enough to where we can reach the closest point of understanding and empathy that we can. Even more admirable is the film's social realist presentation, removing the hallmarks of exposition and melodrama in favour of a documentary esc style filmmaking that a lot of the tastelessness you would see in a worse film like this completely absent. This aspect is ultimately one of the film's greatest strengths as the dialogue is mostly sparse, filling every space with a quiet sense of melancholy, the cinematography is crisp and timeless and the performances from the young actors never once ring false. The most compelling aspect of the film is in it's exploration to the extent of the hassle when it comes to trying to set an appointment and getting the procedure done, from answering difficult and personal questions surrounding the pregnancy, to waiting in line to have your name called out. Even more admirable is it's characterisation of Autumn as a quiet yet flawed, person as opposed to making her perfect in every way, providing a lot of character through unspoken glances and touches and other small details in her behaviour.So with that said Never Rarely Sometimes Always has a lot going for it and is an undeniably important film with a sad, real life subject matter.....But as a film on it's own merits....I had some issues that I just couldn't ignore.This next part of the review is going to make me sound like some unhinged MRA who get's triggered by the portrayal of men as abusers in media and I often don't make points like these so I don't get labelled as that but I found the film's obsession in making every male character either creepy or just dickish to be borderline comical, that's not to say you can't do these portrayals well, nor I'm denying that people like that don't exist, (I've worked in a restaurant where the women would get harassed by drunk lads almost every day, trust me I know it happens) but when you have ALL of your male characters be so telegraphed in their creepiness and misogyny, it ruins the subtlety and realism the film managed to create because at that point It feels like I'm not watching a realist drama anymore, I am watching the director preach some other message that is counter-intuitive to the main and overall point the film is trying to make. It would be easier to forgive this if these portrayals were more short and subtle but these portrayals look like they belong in a short after school special that people would make fun of on Youtube.To draw a comparison, The Assistant is much better in handling this issue in every single way as not only is it a brilliant claustrophobic quiet film about the terror of workplace misogyny, but the male characters in that film ring way more true. They are not overtly evil people, but they are also complicit in the horror's taken place in the establishment that they work in. This isn't just through their silence and refusal to take action but their mildly rude, condescending and sometimes passive aggressive behaviour towards the female protagonist further contribute to that workplace tension whether they realise it or not. The dialogue in those moments is minimal and short quickly getting the point across without beating you over the head.NRSA on the other hand is not only surface level in it's deception of misogyny but the film would have gained so much more without these moments and I don't understand the wider point the director was trying to make other then men suck Which is not only a very reductive way of approaching of handling this but lacks the nuance and subtly that a film like The Assistant (and this film to a certain extent) did have. NRSA isn't a bad film by any means and I appreciate that it exists, but it's portrayal of male characters is so contrived and over the top that it drags the rest of this film down, and serves very little purpose other then to drive a very reductive and one note message that does a disservice to the films greatest strengths."}, {"id": 87, "text": "While watching 'Never Rarely Sometimes Always', Eliza Hittman's film, another production that after the premiere (and award) at the Sundance Film Festival in early 2020 had the misfortune that its launch on screens was postponed for who knows how long as the pandemic lasts, I couldn't help but wonder if the American director and screenwriter knew '4 Months, 3 Weeks and 2 Days', the film that brought to Cristian Mungiu the 'Palme d'Or' award at the Cannes Film Festival in 2007. The two movies are similar not only because the topic of abortions is at their center. They take place decades away in very different political contexts but they nevertheless belong to the same debate about abortion, with moral and social impact, a debate that has been going on for more than half a century and is far from being decided. 'Never Rarely Sometimes Always' and '4 Months, 3 Weeks and 2 Days' have ome more thing in common: in their narrative structure both films juxtapose the issue of abortions with the theme of the solidarity between two young women, who face an adverse world alone, and who are ready to make enormous sacrifices to help each other in extreme situations. Both films are also films about social pressure, dilemmas and traumas related to abortions, but especially films about friendship and the sacrifices made in its name. The story. Autumn (Sidney Flanigan) is a 17-year-old girl from a small town in Pennsylvania, who works with her friend Skyler (Talia Ryder) as a cashier at a supermarket. Autumn's family is apparently normative, with an apparently normatively indifferent father. As her name suggests, Autumn is a melancholic, who keeps inside her feelings and insecurity, experienced enough to have started her sexual life at the age of 14, and hesitant enough not to know how to deal with the fact that she is pregnant. The girl does not want to keep the baby, the reasons are not clear and do not need to be explained, maybe she is too young to face motherhood or maybe the reason is related to the person of the father who we never learn who he is (I have a suspicion, but no I will share it). The clinics in her city are quite poorly equipped and they can't help her anyway, because in Pennsylvania, being a minor, she can't have an abortion without her parents' consent. The two friends leave for New York, where abortion is possible, but their journey is unexpectedly prolonged, they run out of money and live three days and two nights of insecurity, unwanted adventures and not the most pleasant experiences in the big city. It's a film about a completely different journey than the ones we are accustomed with in the films with provincials who come to New York, it's a film about the coming of age of two young women, it's a film about friendship. The issue of abortions is always present without screenwriter and director Eliza Hittman taking an explicit position to impose on viewers. I believe that what differentiates 'Never Rarely Sometimes Always' from other films with similar themes is the feminist perspective. The film is written and directed by a woman, the main characters and most of the supporting ones are women, and the feelings of the young girls at the beginning of life being the main theme, they are approached with a sensitivity coming from real life experiences. That is why I believe that this film should be seen by as many men and boys as the age of the teenage heroines, in order to understand their feelings, hesitations and pains. The interpretations of the two actresses in the main roles are superb and truthful. The scene that gives the film its name is anthological. New York is filmed very differently than in other movies, with its crushing subway stations, the indifferent, hurried and not very polite human universe that populates the metropolis. The minimalist style, the attention to detail, the story told from the point of view of the heroes also reminded me of Mungiu's films. But maybe Eliza Hittman didn't even see them. However, her film stands alone as a mature and sensitive creation, a proof that good films have been released in this year 2020 as well."}, {"id": 88, "text": "Never Rarely Sometimes Always is an awkward title for an awkward situation: Autumn (Sidney Flanigan) must travel from rural Pennsylvania to NYC for an abortion. She's a 17-yeqr-old solitary soul whose cousin Skylar (Talia Ryder) is about the only person besides social workers with whom she communicates.This taciturn protagonist makes anyone question whether the drama can be appealing to a wide audience since the odyssey to NYC is pretty tame, a melodrama at best, notwithstanding the procedure and college student Jasper (Theodore Pellerin), whom Skylar meets in the subway. Hovering around this intense film is a director, Eliza Hittman, who has a Seinfeldian gift for making the ordinary engrossing and employing a naturalism that mixes easily with dreams.There is much to learn about teen age girls, especially in extreme circumstances, and Hittman delivers their emerging consciousness of the consequences for their actions and the necessity for invention when no one is there to help. When, for instance, they don't have the returning fare, they hit up Jasper, who complies and gets a little bit of nooky reward from Skylar. Always men are intruding.Mostly Never succeeds in immersing the audience in a very small teen world of survival with little excitement that many films about coming-of-age include as a matter of tradition. Even NYC seems benign with a lack of claustrophobia and urgency. Yet, Never draws you in because abortion is a prominent cultural topic that newly configured Supreme Court may affect soon.Also, it introduces us to the inside of teen culture, to what's happening there rather than in our remote adult world.Skylar: Don't you ever just wish you were a dude? Autumn: All the time."}, {"id": 89, "text": "Oscar nomination predictions: PictureIf you liked: Ladybird Sex Education SwallowThis is an independent 2020 film that nobody talks about, because this type of movie is deemed uninteresting and tough to watch, when in reality it is actually tough to digest and appreciate. It is a slow film and, just like all films with rough topics, it wasn't made to entertain action-lovers, so build your expectations up accordingly. It's about abortion, an always hot topic for discussion. The film does not explore the ethics or the politics of it and it also does not take sides which is a huge advantage. It merely follows the story of a pregnant 17 year old girl who is too embarrassed to ask for help from anyone but her cousin of the same age, and walks us through the whole mentally and physically excruciating process. There are certain topics with aspects that cannot be properly expressed by words. Abortion and abuse are among those things, and this film does the job that words couldn't ever do. I would not call myself overly imaginative or unusually compassionate, but this film made me feel indescribable empathy. I think that a big part of it was that this was the main actresses' (Sidney Flanigan) first ever film, it really feels like we're watching a real, living, suffering girl; and not an actress. The film also manages to portray female kinship very well which goes beyond mere words as well. I loved the little, seemingly inessential, but important scenes which constantly reminded us that the main characters are still children; and the pre-abortion councilor scene left me on the verge of tears. It is really sad that this kind of film isn't what you can easily recommend to people, but just know that it is an important piece of cinema definitely worth checking out."}, {"id": 90, "text": "GRADE: BTHIS FILM IS RECOMMENDED.IN BRIEF: An honest and uncompromising look at the abortion issue.JIM'S REVIEW: Autumn Callahan (Sidney Flanigan) is a typical moody 17 year old girl: aimless and pouty, sensitive and idealistic. She dreams of a better life and wants to be loved, but continues to make questionable decisions that complicate her life. Derided by her peers, isolated from her family and with very little friends to support her, Autumn is society's outcast. Her days go from bad to worse as she is forced to face an unwanted pregnancy in in Eliza Hittman's drama, Never Rarely Sometimes Always.Ms. Hittman directs her tale with a steady matter-of-factly vision. This filmmaker never allows her narrative to become preachy or, for that matter, emotional. She rarely build to any melodramatic moments and sometimes flatlines her story and characters by depriving them of any real dramatic tension. Yes, they act like real teenagers, but they hide their emotions too often and seldom communicate their actions. Their thought are too internal and infrequently expressed. Yet one is always engaged by Ms. Hittman's well-written characters and their situations, even if the end result could have had more satisfying impact if she would have created more conflict and better resolve.Throughout her deft story-telling, we empathized with Autumn and her cousin and only friend Skylar (Talia Ryder) as they board a bus from Pennsylvania to New York City to abort the baby. The story lays out a common scenario that happens to many young pregnant women in need of their parent's consent today. Yet these particular girls continue to make many odd choices on their journey as they occupy their hours in the big city which tended to exasperated this moviegoer. While it is true that they are flawed adolescent characters, must they lack this much common sense?Also script-wise, there also seems to be an underlining story about Autumn's personal life that is never fully revealed which cheats the audience of any solid explanation for her behavior and decision-making process. In fact, there is only one scene that brings the emotional gravitas centerstage and that involves a heartbreaking interview at a crisis pregnancy center that only hints at possible sexual abuse.Still, the movie conveys the genuine confusion and dilemmas that occurs frequently in the teenage world of angst and rebellion. The film unflinchingly shows the many obstacles put in place by antiquated laws upon teenage soon-to-be mothers at their most dire times. Also enlightening were some early scenes of the societal and political pressure from the anti-abortion movement. Their sharp contrast to preserving the life of the fetus over the mother's life and the sanctity of motherhood itself is subtly conveyed.The two young actresses are superb in their film debuts. Ms. Flanigan brings a finely nuanced performance as the frightened Autumn. Her part is written to be overly guarded and nonplussed and she convincingly layers her character's innermost thoughts through her varied facial expressions and body language. As her cohort, Ms. Ryder creates a vivid sidekick, loyal and slightly naive. Both of these talented actresses should have a long and diverse career.Never Rarely Sometimes Always deals with a serious controversial subject and handles the abortion issue with honesty and needed compassion. Highly worth viewing."}, {"id": 91, "text": "Never Rarely Sometimes Always (2020 release; 101 min.) brings the story of Autumn, a 17 yr old high schooler in a small Pennsylvania town. As the movie opens, Autumn is heckled at a school play. Afterwards, when she gets home, she suspects that she is pregnant. The next day she goes to a crisis center, where she is confirmed to be 10 weeks along. Autumn wants an abortion, but when she learns that in Pennsylvania a minor needs parental consent, she confides in her cousin Skylar. The two decide to take the Greyhound to New York City... At this point we are less than 15 min. into the film, but to tell you more of the plot would spoil your viewing experience, you'll just have to see for yourself how it all plays out.Couple of comments: this is the third film from up-and-coming writer-director Eliza Hittman (Beach Rats). Here she brings the story of a 17 yr. old girl who wants to get an abortion without her parents finding in. From the very beginning of the film, there seems to hand a cloud of doom over Autumn and over this film. And there is a lot of tension, in particular when the girls get to NYC, and they are overwhelmed by the city yet must find a way forward. The film is helped tremendously by newcomers Sydney Planigan (as Autumn) and Talia Ryder (as Skylar). Keep your eye out for singer-songwriter Sharon Van Etten, who has a few scenes in the movie's beginning as Autumn's mother. All in all, this is a terrific, if gripping and terse, abortion drama that is brought without any moral grandstanding.Never Rarely Sometimes Always premiered at this year's Sundance Film Festival to immediate critical acclaim, and opened in select theaters on March 13, yea you read right: just as the coronavirus lockdown came into place. I caught the movie recently on HBO. If you have any interest in a well-made indie movie about a tough subject, I'd readily suggest you check this out, and draw your own conclusion."}], "reviews_amount": 92}