{"name": "Ammonite", "titleId": "tt07983894", "reviews": [{"id": 0, "text": "This is a beautiful minimalist film. People call this movie unpassionate, but they have missed the sublety of what's going on. Every look, every touch, every moment, every sound, and every silence means something. I love this film for what it is. My only caveat is that the girl meets girl but has a husband/boyfriend trope has been beaten like a dead horse. Why can't two women just fall in love without there being a man involved? Other than that, it's a beautiful film. I get it."}, {"id": 1, "text": "The first word that comes to mind when reviewing Ammonite is implicit. The only other review (at the time of writing) laments the lack of explicit sex scenes. There's no need for them; this is an understated love story, not a porn film. The sex scenes are few in number, but shot with delicacy and restraint. In fact, very little of this movie is explicit. An awful lot is left to the imagination of the viewer. Back stories are hinted at, touched briefly upon and only once filled in. Even the ending is left to us to imagine. Implicit, rather than explicit, is the watchword for this movie. The performances of the four female leads are in the same vein. Subtly acted throughout; never overdone. A really beautiful movie."}, {"id": 2, "text": "It's nice and full of emotions. The story is beautiful and flows beautifully with a very good pace and great characters development. The performances by both Kate Winslet and Saoirse Ronan are so strong and Oscar worthy. The movie has some beautiful deep lines and also full of beautiful loud silence. Cinematography is stunning with many beautiful sceneries. Sets and costumes are nice too. Although the movie is so nice and I truly love, I still could feel that it's not new or original to me."}, {"id": 3, "text": "Ammonite excavates the depths of intense lesbian romance. Strong acting would be an understatement. There are a few twists and turns along the way, some of them even predictable but Winslet's authentic performance as her meticulous, passionate character along with the performance of Ronan, keeps us rapt. The film has a captivating cinematography with stark physical beauty and colour palette of the beaches, sets and constumes. However, despite the plot being quite stretched out, Director doesn't fails to deliver a heartwarming and memorable experience."}, {"id": 4, "text": "First, portrait of a lady on fire and now this! every scene is an another ART"}, {"id": 5, "text": "Ferociously slow and meandering, lacking the passion and emotion of its contemporaries and a little too long for what it bestows - which is a rather stale tale of two lost and lonely women, one of which has had her flint removed and couldn't catch light if you dosed her in kerosene and dropped her into the sun. There's always, at least, a little optimism, even in the darkest shadows but seemingly not here. Altogether a little too bland and hopeless, albeit with some talented actors taking the lead."}, {"id": 6, "text": "The protagonist is a real-life figure, although not exactly historic. In her field, however, she had made ample contribution which, alas, were not even credited to her own name, in the male-dominated era she was born into.Mary Anning (Kate Winslet) was a palaeontologist in England in the 1840s. A deprived childhood in abject poverty molded her into something as hard as the fossils she gathers at the rugged Dorset seashore, a passion and a livelihood. She shares her life with just her mother, but only in the sense than they live under the same roof.Honestly I cannot think of any actor who can best Winslet in portraying the bottled up resentment and resignation. Winslet accomplished this with an unsmiling, taciturn face that is subtly eloquent. As well, a half-nude shot of her back shows the hardened, developed muscles from climbing and digging (Winslet must have worked hard on this, unless it is superb makeup). When a fellow scientist pays her a friendly, albeit unexpected, visit, her cold handshake signals rejection rather than welcome.But it is this man's wife that changes Anning's life forever. Delicately beautiful and vulnerably fragile, Charlotte (Saoirse Ronan) is described by her husband as one suffering from mild malancolia. Without saying in so many words, he leaves a clear impression that she is something of a burden. A rich man, he can afford to pay Mary to look after his wife while he has important business to do all over Europe. While Mary does not particularly need a burden either, the money is handy.The rest of the film, depicting the development of the relationship between these two women, is a joy to behold. Trying to describe the mesmerizing performance of these two actors would ruin the enjoyment of the film. Very little is known about the private life of Anning. Therefore, director/writer Francis Lee had a free hand in showing his artistic creativity, which he accomplished brilliantly. The narrative is opening-ended, in a wordless scene showing the two protagonists gazing at each other across the glass display case in a museum, with their hitherto persona somewhat reversed. Just that one shot will stay with you for a long time, let alone the entire film."}, {"id": 7, "text": "Despite great performances from the lead actors I found the film a bit of a disappointment. If you are looking for a spot of geography, geology or paleontology in this film then forget it. West Dorset's ample scenic charms are largely ignored, the rock scapes are minimal and the fossils become somewhat secondary. Even as a biography the representation is highly spurious and misses key parts of Anning's professional achievements. But if a cold Victorian lesbian love story is more your thing then you may enjoy it a lot more."}, {"id": 8, "text": "First , this movie is not portrait on lady on fire. There are overlaps - women in love, talented women who gets ignored, but this is also about class, about loneliness and about how women have been cheated of their contribution to science - either by denying them opportunities or not recognizing them when they contribute. The point where story starts, Kate has been a victim on all three. The movie is slow, messy, raw and definitely not for everyone. A Neon movie - A24 has real competition now Kate did show the pain of woman in early 19th century, stealing the show but Saoirse did wonderful supporting role."}, {"id": 9, "text": "Greetings again from the darkness. Peanuts creator Charles Schulz injected It's the Great Pumpkin, Charlie Brown (1966) with downtrodden Charlie repeating the line, I got a rock after each house on the trick or treat trail. It was funny because no one would rather have a rock than candy, right? Well, maybe no one except Mary Anning, the 19th century English fossil collector and paleontologist whose story is at the core of writer-director Francis Lee's (GOD'S OWN COUNTRY, 2017) new film. His latest film has received some backlash due to the fictionalized approach it takes with her personal life.Oscar winner (plus 6 other nominations) Kate Winslet stars as Mary Anning, and we first find with her living a quiet life of near solitude in Lyme Regis, a sea side town in West Dorset, England. Having never received her deserved recognition from the scientific community for her discoveries, Mary cares for her mother (Gemma Jones, who also played Winslet's mother in SENSE AND SENSIBILITY, 1995), an elderly woman burdened with having watched 8 of her 10 children die before her. They eke out a living peddling the stones Mary finds and polishes to tourists. Mary rarely speaks and her face shows the wear and tear of a mostly joyless life.One day, Rodrick Murchison (James McArdle, MARY QUEEN OF SCOTS, 2018) drops into the shop. As a fellow scientist, he is aware of and interested in Mary's work. He condescendingly introduces his wife Charlotte (4 time Oscar nominee Saoirse Ronan) as suffering from melancholia. When Charlotte falls ill, Rodrick asks Mary to look after her while he continues his travels. Dr. Lieberson (Alec Secareneau, AMULET, 2020) examines Charlotte and recommends rest and sea air. He also takes notice of Mary, an occurrence to which she pays little mind.The contrast between Charlotte and Mary is not limited to age and class. They aren't particularly fond of each other initially, though Mary slowly nurses her back to health. The two ladies finally connect over a heavy rock half-buried in sea wall sediment. The evolution of their relationship is slow, but thanks to the two outstanding actors, it's quite something to watch. Ms. Winslet is particularly affecting as the woman beaten down by life and reluctant to allow any glimmer of hope. We see this in her interaction with neighbor Elizabeth Philpot (Fiona Shaw), a woman with whom there was a previous bond. The old saying goes, opposites attract, and here the two opposites, Mary and Charlotte, bring out the best in each other.The skilled actors never allow the film to slide into melodrama, and instead offer two occasions where unbridled emotion jump off the screen. A passionate and liberating love scene is the first, and then a later re-connection provides the second. Mostly, Mary forces herself to conceal her rare happiness - we wonder if this is due to her belief it won't last, or if it's because she feels unworthy. Either way, it's quite something to watch Ms. Winslet allows us to sense what's she's experiencing inside.Music from Voker Bertelmann and Dustin O'Halloran never overpowers the moment, and the extremely talented cinematographer Stephane Fontaine works his magic. His previous work includes: JACKIE (2016), ELLE (2016), CAPTAIN FANTASTIC (2016), RUST AND BONE (2012), A PROPHET (2009), all beautifully filmed. Filmmaker Lee's controversial dramatic license with the relationship is apparently done to better explain Mary Anning's life, and it's likely the first film where new acquaintances connect in a deep way thanks to the unearthing of a unique rock. Filming took place in Lyme Regis, the actual town where Mary Anning collected fossils in the 1800's."}, {"id": 10, "text": "Two women develop an intense and unlikely relationship in a Victorian backdrop. Kate Winslet nails an astonishing character study, profound, melancholic, enigmatic. An intense lesbian romance, sensitive, arrestingly observed and incendiarily erotic. Saiorse Ronan is also remarkable proving to be a courageous and career defying performer. Lee conducts the material with excellence and such skillful storytelling announces a new auteur."}, {"id": 11, "text": "I'm rating this the same as I did The Portrait of a Lady, as they both have extreme similarities to one another. Not to take anything away from either, but with this especially, I've never known a quieter film. Not in terms of the volume but there is a real contrast to the sound of the violence of the crashing waves and the feeling of being out of control, to the then relative peace of a warmer day whilst the characters establish their relationships with one another. There are also segments of isolation &amp; at times the silence is deafening &amp; the camera cuts quite often to scenes of live animals crawling over paintings of nature, which I interpreted as though the two worlds look like they are in sync, but very definitely not in equal measure."}, {"id": 12, "text": "'Ammonite' is a quiet, contemplative drama that consistently engaging and often affecting. Francis Lee crafts a poetic film that impresses with its poignant storytelling, stunning cinematography, and incredible performances delivered by the titanic talents of Kate Winslet and Saoirse Ronan at the forefront."}, {"id": 13, "text": "I just wanna point out that the scenes with no dialogue are the one's that say a lot ... Kate Winslet masters the way she talks only with her eyes."}, {"id": 14, "text": "I get it - I do - it's just SUCH a dull film. very predictable, although barely anything happens, other than sex, which also happens to be dull. there's very little in the way of dialogue, and not nearly enough interaction to make up for it. best bit is seeing Fiona Shaw basically re-enact her character from Killing Eve. makes me question London film festival's selection process. oh, I forgot - it features lesbians, so of course it had to be the closing film!"}, {"id": 15, "text": "Similar to when a meeting could've been an email, this movie could've just been a 10 minute short. I was incredibly bored for most of it. A movie with Saoirse and Kate should never be dull to watch, so the blame falls on writer/director Francis Lee for letting these incredibly dynamic women feel wooden and stuck in molasses throughout this story."}, {"id": 16, "text": "I would like to love this movie. I watched 2 hours of a movie that I forgot already half an hour after the screening. It was so bland. Plot without any freshness, at times I had the impression that I did not know what I was watching it for. The film could be shortened by half an hour and maybe it would keep people from falling asleep at the screening. Ammonite was killed primarily by a very poor selection of actresses. The roles of lesbians should be played by real life lesbians because only lesbians can transfer to the screen what they feel and what they struggle with. Saoirse and Kate are great actresses, but they have failed at all in these roles. The biggest problem is that all of these movies are directed by men, not gay women. This is why Ammonite suffers from the same problems that plague other similar lesbian movies. Lack of understanding of two loving women. I thought the Ammonite movie would be innovative, bold, but it ended up with another average and prude experience"}, {"id": 17, "text": "The great chemistry makes the best seconds of this film between Kate Winslet and Saoirse Ronan. But those seconds are lost in a bad script that doesn't know how to make a believable relationship."}, {"id": 18, "text": "I love the subtlety and the emotion of it. Would have preferred a less explicit last lovemaking scene, but with more feelings. Yet it works this way as well. I have only two issues with this film: First the ending. It would be really generous to call it an open ending. It's a pure unclear ending, with no hint of what might follow. It's like a knife cut within the storyline and the rest of the tale just fell off the cliff into the ambiss. Second issue: Historical inaccuracy of their relationship. Set 20 years later than the characters met in the real life, one of them being 30 years younger than the historical figure she represents, plus the deliberate misinterpretation of their friendship as a romantic relationship while it clearly wasn't. As a lesbian, I find it offensive for straight historical figures. I wouldn't want that one day someone digs up my life and invents a story about a supposed romance, nonetheless adultery, between me and some of my male friends. It's not respectful, it's not historically accurate and it's not true to the character. Why not rather invent a fictional story instead? Why using real persons' names? And if possible, without cheating for once. On the artistic side, it's wonderful, minus the ending. Definitely worth watching several times throughout years to come."}, {"id": 19, "text": "What a beautiful and great movie, very good chemistry between Kate Winslet and Saoirse Ronan, this movie is di simple but fascinating, great acting between two of them too, i really enjoyed all the scene, this movie it's two hours and i felt this movie is too fast, i highly recommended"}, {"id": 20, "text": "Saw this movie at a film festival. I am terribly disappointed with what I saw. I was hoping to see something similar to the movie Blue is The Warmest Color. Ammonite is by no means an equally good lesbian movie. Something that stands out most about this movie is the lack of chemistry between the main characters. I don't feel this infatuation, this love, this lust. The plot is also not very engaging, it is stretched out. The film is very prudish in expression. I'm surprised because the previous film by this director was really bold. There are no bold sex scenes in Ammonite. The only bold nudity in the movie doesn't even come from women. This prudishness shouldn't happen in an LGBT movie. I rate the movie 4/10. The costumes were beautiful."}, {"id": 21, "text": "This is THE love story most of us are looking for. You can definitely feel their passion, their wanting and lust for each other. Both actresses were at their best and they had such great chemistry."}, {"id": 22, "text": "I find this film flawless, the love story is very pure and rhymes perfectly. The acting of both Kate Winslet and Saoirse Ronan was simply great, they both nailed the role. A must watch"}, {"id": 23, "text": "To look at and to watch and to not only be consumed by but to consume the thing , I don't know what I am saying but I loved it! It was incredible to watch the flow of the thing , and the strangeness the eeriness and awkwardness of it all served to emphasize how how incredibly beautiful this masterpiece with its sanitating overtones and tender undertones, just a compelling work-of-art! Great job1"}, {"id": 24, "text": "Mary Anning is a woman who struggles to express her emotions because she was hearted. Charlotte Murchison is a woman who needs love in her life. Ammonite is directed and written by Francis Lee. The main two characters cast by Kate Winslet and Saoirse Ronan. As always i loved Kate Winslet in this movie, she is a phenomenal actress, and also Saoirse Ronan is really good. Kate Winslet portrays Mary Anning's struggle between her emotions really well. The script is solid, but there were things that should be focused more like the pressure to be a lesbian in the 1840s. The pace is a little out but the romance was great. I like Cinematography, it's peace. I really enjoyed the movie and I recommend you watch this melodrama."}, {"id": 25, "text": "Set on the dreary southern coast of Britain in the 1840's, Ammonite is the story of a lesbian love affair between a repressed fossil hunter and a young wife who is overcoming the loss of a child. The entire film feels like a weaker version of 2019's, Portrait of a Lady on Fire. That French movie captured the restrained passion, whereas this effort doesn't let the spark ignite. Still, Winslet and Ronan are superb."}, {"id": 26, "text": "Enriching, layered performances from Winslet and Ronan.Lovely, quiet, poetic approach throughout... kudos to the entire crew.Landscapes, production design, and costumes were all awesome.Mixed feelings about the directors interpretation on the sexual leanings of Mary Anning. While it's indeed possible that she had a female lover(s), I'm not sure this interpretative portrayal will boost the audience's appreciation for this woman, who was a valuable pioneer in her field."}, {"id": 27, "text": "Ammonite is about women: their struggles to gain respect and attention in the 1840 society, predominantly ruled by men. Kate Winslet, as Mary Anning, in its golden age, is natural and spontaneous. In the other hand, Saoirse Ronan, is young and fragile, forced to obey her husband (even about keeping a child or not, reason for her melancholy). Fragility and courage create the foundation for an intense and secret bond between the two women, who communicate purely through glances and few words. Their relationship improves and changes, as does their spirit and vision of what they really want from life. At the end, when Mary and Charlotte find themselves in front of the fossil locked in a cage, I felt a sort of freedom among the two women: a freedom to exist and to choose their own destiny."}, {"id": 28, "text": "This film is subtle most of the time, given the historical period. There are two explicit sex scenes, which suit the development of the relationship. I would have liked a little closure as to what happened to the husband."}, {"id": 29, "text": "So little has been said and the silence said it all, a silent expression reveals everything."}, {"id": 30, "text": "Although historical fiction, there is a real feeling of natural beauty and honesty in the story told here. I can't speak to other's expectations I'm this film but I thoroughly enjoyed the pace, the silence of stories told on the face, and the realistic depiction of the setting. Evoking feelings of sadness, isolation, and loneliness, this film has done its job in relating a depth of emotion...but then I like the quieter, subtle slowly paced films."}, {"id": 31, "text": "Arnold Schwarzenegger looks like a Chatty Cathy compared to the cast of this film. Too much screen time spent on mundane tasks. Too little dialog to tell the story, if there was one to tell. Was it necessary to show Winslet urinating ? Was the writer a fan of Tom Hanks peeing scenes ? An angry at the world, woman scientist is rude to customers that visit her dinosaur store. She is hired to tutor a fellow scientist then becomes a nurse to his clinically depressed wife. A lesbian relationship begins and ends. Movies should entertain. They should not be so boring the watcher tries to find a hidden meaning in B-roll that this movie tries to pass off as a plot."}, {"id": 32, "text": "Mary Anning did not have a relationship of the nature depicted in the film with Charlotte Murchison. The fictional relationship overshadows the importance of Anning's contribution to Paleontology. The director admits to taking liberties just because we assume everyone is heterosexual so why not gay? Regardless slow paced film , performances are top notch . Cinematography is beautiful. I would recommend it ."}, {"id": 33, "text": "In 19th century England jaded, self-made paleontologist Mary Anning spends her days alone on the coastline excavating fossils, until a well-off tourist entrusts his wife Charlotte Murchison (repressed, melancholy, and a shadow of her former self) into Mary's care. Though Mary initially views Charlotte as an unwelcomed guest, gradually the two become close as their relationship intensifies. In a quiet, intimate, and moody story such as this where much goes unsaid, most of the emotion is conveyed through subtleties and body language, but fortunately the two lead actresses are up for the challenge and deliver strong, internalized performances--though at times it's frustrating to try and discern the emotional depths and complications between their two characters. It's hard to determine the historical accuracy of what transpires on screen, plus it concludes on an ambiguous note, but Ronan is solid as usual, while Winslet is absolutely riveting. **½"}, {"id": 34, "text": "Wow this was a snooze fest.Period peice only got made because of the narrative. Other than that, it's one long boring mess that no one cares about.Does it look good? If you like slow period pieces that go no where.I was astoundingly bored."}, {"id": 35, "text": "Some viewers especially criticised the film unfairly due to the lack of explicit/bold scenes in LGBT cinema. This is not lesbian version of Tinto Brass film. It's a love story between two women coming from different backgrounds and development of story can be slow-paced but not boring. People should not forget that it took place in 19th Century in which the British society approach was prim and prude against same-sex relationships. Both main characters' performance is worth watching. It may not be masterpiece but overall, is a good film Besides, the film was going to compete in in Cannes film festival if it was not cancelled."}, {"id": 36, "text": "Agree that this was missing many elements. I didn't feel I knew the characters well. I didn't feel anything towards either of them until the very end. There was just so much more that could have been explored with this. Not enough dialog. Also, that was a terrible ending. Had high hopes for this, with such a great cast, such a shame."}, {"id": 37, "text": "..but one good story did not get as good realization. No chemistry between the two actresses, meaningless dialogs, boring most of the time. One thing too, almost no interaction between the two before that first kiss, it looked more like an unexpected attack. Both intimate scenes look pushed and non realistic. Maybe it was bad casting, maybe bad direction, screenplay underdeveloped that's for sure."}, {"id": 38, "text": "In terms of plot, i think it was actually really weak and the ending was somehow predictable, but that's probably because i found the movie really similar to Portrait of a Lady on Fire. However, i thought the cinematography was amazing and i also loved they way the whole movie was so quiet and the way they played with the sound in certain scenes. All in all, i was expecting more, but it was a decent effort and not a bad movie."}, {"id": 39, "text": "Although this movie has got such a great costume design , it is meaningless and to me it is kind of empty. There are some elements in this movie which help to cover the weakness of the screenplay , the most important of them is the actings of Kate Winslet and Sairose Ronan , the other interesting element which is my favorite one in this film is its atmosphere and setting which quickly absorb the audience , costume design of this movie as I mentioned before is very good , but the purpose of the movie is not really specified and Screen play is such a weak one. Honestly the first half of the movie was very good , but the second half was not as strong as first one. As a result it was not that good !!!"}, {"id": 40, "text": "Two great lead is the highlight of this movie. The moment of two strangers and fall in love but the difference of them makes the relationship they have are purely sexual. It's quite a real life for what love and sex is. Story can be beautiful but comparing to many homosexual product, this just mediocre. Enjoy the acting part more for me."}, {"id": 41, "text": "This film start with a specimen been moved to the museum, and the introduction of the main actress Mary scene! As turnout, this film is about a fossil hunter Mary fall in love with a girl Charlotte, who entrust by her buyer Roderick to take care of! Entire film quite slow, full of boring conversation, and annoying overuse scene! Such as, overuse of the cleaning specimen scene, overuse of the smoking scene, overuse of the dining scene, and overuse of the searching rock scene! Make the film unwatchable! Even the nudity scene of Mary, and Charlotte can't save this film! Barely laughable scene is, Charlotte tripping while she trying to get the coal! At the end, Mary refuse to move to Charlotte house and live with her! Mary and Charlotte met at the museum at the very end! That's it! Another disappointed film!"}, {"id": 42, "text": "I was enjoying all the time watching this, the comfortable feeling watching and enjoying this untill the last ten minutes came and I was just like WTH! Why did they do that to the ending. Could be much better. But still a 6 is what I can give for this movie."}, {"id": 43, "text": "Way too little dialog. You kind of waited for them to start speak with each other and that never happened. The spark between the characters were missing. But it was beautiful scenes, costumes and good acting."}, {"id": 44, "text": "...did someone really make film for the purposes of revealing Saoirse Ronan and Kate Winslet getting it on? That seemed to be the story! Even with the rich topic of early 19th century geology and prehistoric fossils, the 'story' seemed fixated on the sexual tensions of the two lead characters. Gemma Jones is becoming iconic in her roles as matriarchs of the era, and she brought so much subtlety to her role which was far more interesting than a sex act between two women, but the film avoided all 'that' and more, and became narrow and repetitive. Nonetheless, high quality; great costumes, sets, etc. but I thought with 3 or 4 of the world's finest performers that we'd have been treated to a story that -at least- explored the complexities of women in science during the era more thoroughly....or anything relevant...beyond the sexual tension...."}, {"id": 45, "text": "I love period pieces and understand they can be a slow burn, but this was painfully slow. I guess it was worth it to see face sitting in the 1800's. The ending was abrupt and odd."}, {"id": 46, "text": "Many things about this film disappointed me. I'll start by saying that many comments I saw here seem to think that people who didn't like it simply didn't get all the silences and the nuances of the film. That's rather pretentious, really. I entered this experience expecting nuance and complexity, for all of what the story promised beforehand - women, science, homossexuality, all of which in small english town in the 1800s. Still, I was left disappointed. I can't shake off the feeling that in trying to give the characters depth, the script invested so much in their sadness and melancholy that it felt to me just like another form of being unidimensional. You see, if you explore only how dull, emotionless and taciturn a person is, they become this one thing only. It's bizarre how the film only allows them to display emotions after they have fallen in love and started their relationship. You could argue that that was the point - how they saved each other from the loneliness that they both had to put up with. But I insist that it wasn't a good depiction of that either. For you to get involved with someone you can't be the walking corpse of a human being to begin with. Where does love even blossom when you find life so unbearable as they seem to do?And here I enter my main critique: the film focus so much on showing the contrast of how miserable they are before each other and how their relationship saved them that I believe they had to pretty much bury Mary Anning's story. Now, I know that there's a Green Book-like controversy about this film, and that her family has complained that there's no evidence that she was gay, etc. But you see, after watching the film, I don't think we even need to go there. It just pays no tribute to her loving of science. It shows us some scattered scenes of her cleaning fossils, examining them, but it doesn't explain her main discoveries, the impact that they had in the field, why are they special at all. It also throws at us something about the sexism of the age, the suppresssing of her name, but that's just so badly explored. It's like the writers sat together and said I mean, let's just mention it, it couldn't hurt. Finally, what brakes my heart the most is that this woman was really unique. Can you imagine that she would actually wake up before dawn, in a cold place, to go to a seafront and explore ammonites? She wasn't even recognised for it, she was just that passionate. Yet, the film shows every scene of her being utterly miserable All.The.Time. I do not imagine that she would be prancing and singing, but I can't understand why wouldn't they include a scene of her having the time of her life alone at the beach, smiling after finding something remarkable. That would make for such a great psichological study! A single woman in those days, never married, no children, who loves to go discover ancient rocks, by her own, at the seashore. Honestly, that's what this should have been. Instead, all the scenes of her life and interests seem to be just filling space.I could go on. Side characters are very shallow. The illness of the mother is never explained further and her entire persona is only shown if she's interfering with her daughter and the couple. The scene when she dies is so emotionless and makes so little difference to the movie that she might as well have been dead from the start. The men who come into the shop for Mary Anning's findings are non descriptive and generic, including the husband of her lover, whose interest for Mary Anning's work serves just as plot point for the two women to get acquainted. He's so interested one day, the next he's like Yeah, can you take care of my wife? see ya. And there's also the whole health condition of this one. It's explained that she's depressed, but then out of the blue she gets in such a bad physical state that a doctor gets worried that she might die. But where did all that come from? What happened? And how come it came and went without any further explanation?Because Kate Winslet is in the movie I couldn't help but remember Titanic as I watched it. That was a real story with a fictional romance on top of it, but James Cameron made sure to be so thorough about the real disaster that I actually remember the date that the ship sank. It's a historical tragedy that most people only know because a film depicted it with care and respect. It's a completely different story but I do think that there was something to learn there: if you're making up a love story on top of real people's lives, at least be truthful to them."}, {"id": 47, "text": "Really disappointed movie, i expect way more. The main problem in the movie that it's so long and there is alot of empty(meaningless) scenes. I think the director forgot to cut the movie..... at all watchable but nothing special."}, {"id": 48, "text": "I was really excited for this but wow was I disappointed. Probably the most boring LGBT movie I've ever seen. Zero chemistry between the actresses and zero buildup- even though it took a whole hour before anything transpired. Dull dull DULL."}, {"id": 49, "text": "I don't understand how some people don't appreciate this hidden treasure. Both the top notch leading ladies are at the top of their game as this slow burner finds its pace. I won't give too much away but the relationship that develops between the ladies is sensitive, tender and intense. The choreography was breathtaking and effective. Everything moved the story forward at just the right pace. My only complaint is that it ended too soon. I wanted to know more. This movie will not be everyone but it will be very moving and unforgettable to others."}, {"id": 50, "text": "Great performance by Kate Winslet and Saoirse Ronan. Loved the chemistry between them"}, {"id": 51, "text": "I was sucked into the enviroment that movie present from the very first shot and it kept me guessing, intrested, invested for the whole time. i've seen people like this so I found Winslet's character intresting and specific, so when Ronan's more joyfull young random personality meets hers, the emotional moments and drama begins to work very well. Ammonite is written, shot, directed very well, two major performances i though were brilliant, oscar nomination worthy at least, one think that bothered me quiet a lot was music, score. Overall movie was very good. Strong 7!"}, {"id": 52, "text": "One of the chief sticking points from the negative feedback is leveled at the casting of two heterosexual name stars Winslet and Ronan and the lack of chemistry thereof, and indeed, the raw, libidinous impulse emanated from GOD'S OWN COUNTRY by two anonymous actors (Josh O'Connor and Alec Secareanu, the latter returns here as a courteous doctor with a dulcet foreign accent), is supplanted here by a more contained, stiff, distaff bond that takes more than an hour to build, since initially, Mary doesn't see eye to eye with Charlotte, the hothouse flower ilk who has no clue of how to scrape a carrot.read the full review on my blog: cinema omnivore, thanks"}, {"id": 53, "text": "This is a beautifully crafted piece of work from Francis Lee and Stéphane Fontaine that depicts the rather downtrodden existence of 19th century English paleontologist Mary Anning (Kate Winslet) who spends much of her time combing the beach for shells and fossils that she restores and sells in a small shop she shares with her ailing mother (Gemma Jones). The arrival of the enthusiastic Roderick Murchison (James McArdle) and his wife Charlotte (Saoirse Ronan) changes her pretty breadline, dreary, routine as he, initially, pays her to show him how to spot the ammonite but then leaves his poorly wife in her care to recuperate from an as yet undefined malady. The story is essentially about how the two women bond, and about how that bond intensifies and it features two very strong performances from the leads who struggle with their delicately smouldering relationship. Together with Lee, they manage to deliver a sense of their longing in a largely un-passionate - yet not sterile - fashion. The snag is that the film really, really, lacks pace and characterisation. It's not that is needs to be a full-on sex-fest, it's that their dialogue is sparing to the point of frugality. Why do they bond? At times their affinity is hard to fathom; terse even - and there is a maternal affinity that seems to compromise the potency of their chemistry as people who are falling in love. There are a couple touching contributions from Fiona Shaw and Gemma Jones (sort of reprises her role from God's Own Country (2017)) and there is an explicit swipe at the male-driven scientific community that did it's best to discourage/ignore the obvious skills possessed by Anning, but as a film for the big screen it just lacks depth - we are left to guess/assume way too much and it left me feeling just a bit empty."}, {"id": 54, "text": "I enjoyed the film. I didn't enjoy fictionalising a real person. Having a pop at yesterday's moral's and how they still impinge on us today is something that could have been done without hijacking a real person. A real person who deserves her story telling properly. Even the BBC article I read said this film wasn't a gender issue film, it was a class issue film, with many men and women suffering what she suffered. If anything gender was a side issue. The gender issue would have been an issue within it's own class, not across classes. But they want to lose that because it doesn't fit the modern tick box exercise and all us working class thickies wouldn't be capable of putting two things together. In fact the same insult is levelled at us still!Maybe I'm being a little harsh. That said, I really enjoyed it as a film. The pace reflected the situation, the acting was brilliant, Kate Winslet expression was a brick wall, but when she eventually succumbed to smile it was beautiful. The story was gorgeous.My criticism lies with the writer/director for picking Mary Anning name to write fiction against. If you are writing a film about her, actually focus on her life, yes you can embellish, but embellish the truth, not that it would need that."}, {"id": 55, "text": "Ammonite is one of those rare movies that tells its story with minimal dialogue and an exquisite attention to detail.Every aspect of the complex art of storytelling through film is finely attuned to the weaving of this tale, and Ammonite accomplishes this with a delicate and light touch that allows its world to breathe.We experience the visceral windswept beach that animates the life of Kate Winslet's character, Mary Anning, and breathes life back into Saoirse Ronan's character, Charlotte Murchison.There is a bleakness, it is a cold and hard environment, but Winslet and Ronan make it real and bring warmth with two extraordinary performances marked by keen observation and subtlety.Director Francis Lee has crafted his world with great care using every aspect of the medium to full effect - the result is a work of art, a thoroughly engaging movie, a study of life.9 1/2"}, {"id": 56, "text": "Ammonite's title is deceptive, being not just about a fossil, but linking directly to the character of Mary Anning, hard and curled up against the world around her. Years of scouting beaches and digging in the dirt, only to have her work credited to men in London, has left her cold and brittle. The arrival of depressed young woman Charlotte however, soon challenges her countenance. Filmmaker Francis Lee balances the grit and dirt of Mary's excavations with the high Victorian society Charlotte is from with ease and interesting perspective. The film is about downtrodden individuals, spurned by a number of issues from the period, gaining perspective that they're not as alone as they once thought. Winslet and Ronan play excellently off each other, with Ronan taking on a role you can imagine a young Winslet would have played. Their performance culminates in one of the most intimate love scenes I've seen onscreen for sometime. Knowing that the two actors were allowed to choreograph this themselves with minimal interference is worthy as well, and shows care taken in crafting the relationship. Clearly this film hasn't clicked with everyone, and it'd probably be best to leave any pre-conceptions of what a 'lesbian film' should include at the door. But if given a fair chance, 'Ammonite' could breathe new interest into the life of a British historic figure."}, {"id": 57, "text": "This movie isn't for everyone, that much is clear from the mixed reviews. Some people enjoy it, others think it's an absolute bore. I fall into the first category. The movie isn't flawless but I found myself involved and captivated throughout. Personally, for me it was never too slow, but I can understand that people might feel differently. You should prepare yourself for a slow-paced, two hour long dramatic period piece.The acting from everyone in the film is fantastic but of course in particular from the two leading ladies. Kate Winslet and Saoirse Ronan are absolutely terrific. The chemistry between them felt genuine and well-done to me, which is crucial in a romantic movie.Only two very skilled actors could pull off the type of non-verbal communication that is often present in this move. It's nice that they don't have to share their life stories to each other in front of the camera. Their connection is deeper than basic communication. So much can be said with a glance, smile, and subtle body language. It's refreshing and surprisingly intense. Actions speak louder than words, after all.The soundtrack is lovely and subtle, but gets intense at the exact right moments.The cinematography fits the film perfectly.Finally, I was intrigued by the unique concept of the movie. Ammonites, a love story between two women from very different backgrounds, the struggles of a lower class woman living with her terminally ill mother, the inequality between men and women during that time... and all of that (loosely) based on the life of a real person. Multiple interesting concepts coming together in one movie.If you're hoping for a queer love story between two women that is happy and not a little depressing, you might want to adjust your expectations. This movie can be a bit dreary and sad. I have to admit I'm a bit tired of all the gloomy, unhappy WLW movies that exist, and still longing for a relatively happy queer movie, like a 'Love Simon' for women.All in all, however, I did enjoy it and would probably watch it again in a few years."}, {"id": 58, "text": "Can somebody please persuade French and Saunders to reunite for a parody of Ammonite??!! It's so outrageously grim, so relentlessly grimy, so stubbornly devoid of dialogue and so laboriously and pretentiously arty that it positively cries out to be sent up stupid by Dawn &amp; Jennifer, much as they did with the similarly grim (but infinitely more interesting) Vera Drake. They could make much of the way Winslet and Ronan hurl themselves into a strenuous lesbian relationship (and some in-yer-face - literally- sex scenes) despite their characters having almost nothing in common and no real chemistry. There's endless trudging up stony, inhospitable beaches and tramping around grey, rain-lashed, incomparably dreary Lyme Regis (which, despite how it's depicted, was at the time the story is set one of the more desirable resort towns in the UK). All the supporting characters arrive as fully-fledged caricatures, as though plucked straight from an amateur dramatic version of something by Dickens. It's a shame really. Just as lesbian themed films have earned a degree of street cred thanks to masterpieces like Carol and Portrait of a Lady On Fire, along comes Ammonite to reinforce the popular view that dykes are certain death to either drama or comedy. While historians and scientists debate whether renowned paleontologist Mary Anning (whose sexuality is completely unknown) should be characterised as a lesbian in Ammonite, the more pressing question is whether she should have been characterised as a deeply dull, socially inept, curmudgeonly shrew. I certainly can't help thinking she deserved better."}, {"id": 59, "text": "It was about time to have a collaboration of Kate Winslet and Saoirse Ronan and the chosen material was ideal for them. Its a very slow moving but very beautifully shot romance between two women who are quite different from each other. The film doesnt care for big locations and portrays the women slowly growing friendship in a very intimate way. Kate Winslet is fantastic. One of her best performances in years. She really nailed the role and while her performance seemed one noted moody at most of the time, she was able to show so much more that lays beneath that emotion with her performance. Really good. Saoirse Ronan was also good but its not one of her greatest performances and I am afraid this won't bring her another Oscar nomination. The character appeared a bit underwritten at times and incredibly subtle. She was cute and did all her best but was too much in the shadow of Winslet. A noteworthy performance by Gemma Jones, who must have the saddest eyes in the world. The film has a very gorgeous cinematography and a beautiful score. I also really liked the way director Francis Lee let us witness the blooming love between his two protagonists. A good film, often a bit slow but it takes its time for its characters."}, {"id": 60, "text": "Some people said they didn't really see the lead-ups of their love story, and the storyline was not convincing. I do not mean to offend anyone, but I believe I saw the lead-ups quit clearly while enjoying the movie. Mary firstly found a rock at a high place, and she climbed up to get it. Unfortunately, that rock got broken while falling to the ground, and the ammonite fossil in it broke apart. We can see how upset Mary was when she looked at that broken fossil. When she walked with Charlotte on the beach and saw another rock thing at a high place again, her heart struggled that if she should go get it. Mary was totally devoted to the fossil science, she couldn't bear another heartbreak seeing a fossil break apart in front of her. She chose not to dig that rock thing out. Charlotte didn't know much about the science and Mary's fear at that time. In Charlotte's mind, Mary's job was just digging things out and nothing more. Mary felt offended by Charlotte, so she poured her anger on and insulted Charlotte heavily. Charlotte then left and almost got drowned to death on the beach. Thanks to the bathing, Charlotte got fever in the next morning, but she still rather went to the store and asked for Mary's help than the maid's in the hotel. Why was Mary better than the maid? Because the maid listened to Roderick's, and any other men's, orders, but Mary made decisions and orders on her own. Mary was much reliable than the maid. If Charlotte chose to depend on the maid, she might die already and the story would be ended, immediately. However, considered Mary's bad attitude on the other day, Charlotte might rely on Mary only for a hope to be survived. In fact, Mary still disliked Charlotte when the doctor asked her to take good care of Charlotte. However, when the doctor said that it's Mary's position to care for a fellow sister, Mary realized, once again, in the men's world, under this situation, Charlotte could only rely on her. The sympathy to another woman made Mary keep Charlotte home. During the days, Mary understood Charlotte's sadness and helplessness little by little, and started to have some feeling for Charlotte. When Charlotte woke up, she's surprised for being saved by Mary. She was even thankful when she heard the doctor commended Mary. Charlotte's opinion on Mary started changing. When she asked for Mary's permission to go onto the beach, it turned out Mary cared more about her own thoughts. She liked Mary even more from that moment. Later, Charlotte saw how Mary handled things masterly, and in contrast, she's more like a child who's lack of skills. This was the time when Charlotte started to admire Mary. Charlotte wanted to approach closer to Mary. When the doctor came with the invitation only for Mary, Mary fight for Charlotte's love to music. That was the moment Charlotte discovered how much Mary respected and knew about her. Charlotte was so annoyed when she's getting dressed up by the maid, but she gladly let Mary help her and shared her fragrance with Mary. We can even see Charlotte's disappointed face when Mary was asked away by Molly. Charlotte wanted Mary to be with her. That's why she initially held Mary's hand in front of the door, she got a bit angry over Mary's left, and earnestly complimented Mary after reading Mary's heart-broken poetry. The poetry showed us that Mary was in love with Charlotte already. I would say, her love could be tracked back to the days she looked after Charlotte. The days she witnessed Charlotte's weakness. Mary flinched on that night, although Charlotte's love was so obvious. The next day when they worked on the beach again, Charlotte cared about that rock thing so much because she cared about Mary's passion on fossil. Mary didn't want that rock because she couldn't move it herself, yet she didn't want Charlotte's help. She was trying to deny the love between her and Charlotte, but she failed because Charlotte insisted to dig that rock thing out and bring it home. In the next scenario, I don't think I can find any other fangirl in the world who could've done better than Charlotte. Charlotte was literally Mary's Stan. These lead-ups were many enough to show us how they fell in love with each other. I can't even imagine how they could NOT fall in love with each other after all these things happened between them. Trust me. This is a beautiful and soulful enough love story that deserves you see more than once."}, {"id": 61, "text": "Looking over the actual lives and accomplishments of these two women who are the subject of Francis Lee's Ammonite, Mary Anning and Charlotte Murchison, it's flabbergasting that you'd concoct a romantic interlude between the two when there is no evidence it happened. Just an outline of the accomplishments of either one of these individuals who were leaders in women stepping outside their rigid domestic roles into the rarefied world of scientific exploration is perverse to imagine full sexual relationship. I realize that a litany of what these two women actually did do would have interfered with the hokum of a love story, but why not just create two fictional women and gone from there? What these women actually did accomplish would far outweigh an imagined closeted same sex coupling.And then there are the sex scenes. No, they aren't explicit but they are lengthy and detailed. So, we're left with the impression of some guy's (the writer/director in this case) need to fantasize about lesbian sex. By all means have at it, but why confuse the history of two famous professional women with your own predilections? Francis Lee, who is gay, has justified his choice by saying Why not? There's no evidence Anning had any male companions. That skips over the question of Why? If you don't know someone's intimate life, why make it up? If you've got some ax to grind--and gay and lesbian individuals do have that with a wide choice of historical figures who braved society's mores and suffered for it--why make something up? Was he unknowing that this is a trite classic male heterosexual fantasy? Particularly about two people who have other major accomplishments to their name to say nothing of living relatives (some who objected, some didn't). If these women wanted to challenge sexual repression, wouldn't they have done so? They certainly knock down other closed doors.It mars--significantly--a beautiful film with two very talented actresses in some knock-out period costumes who aren't afraid to get them very, very muddy. Has Kate Winslet ever not been terrific? Saoirse Ronin? Her young, very busy career is already approaching Winslet's.The set-up takes a stretch to accept. A husband tired of his melancholic wife, dumps her on Winslet's character's doorstep (a stranger no less), saying YOU deal with this. Here's some money for your effort. Bye-bye. The mores of the time--and certainly Winslet's withdrawn nearly mute character--wouldn't make this a working proposition no matter how much you needed the money. And Ronin's severely stricken character wouldn't--it seems to me--show up every day to wander the beaches collecting seashells by the seashore no matter how lonely or abandoned you were. She demonstrates her social skills at a party soon after her abandonment. Why keep company with a dour and unpleasant Winslet? But once she does, the movie takes off...or perhaps glides into the sublime.The screenplay is very short on dialogue and what develops is wordless and shows that the cinema is primarily a visual art. And here Francis Lee's talent shines.All of the cast is tremendous, particularly since whatever motivation their characters have is kept from us. A central scene between Winslet and Fiona Shaw, where something happened in the past and we're expecting whatever has been hinted at in the first two-thirds of the film will be explained, well, it's not; and a lot remains a mystery. Even the ever present (and excellent) presence of Gemma Jones as Winslet's Mother never comes into focus. She wanders in; she wanders out. Resentment is heavy in the air, but we never understand why.Yet dreamy, albeit frigid, passages along the shore are wordless as the relationship deepens between Winslet and Ronin's character. Lyme Regis is a far cry from Miami Beach, and the one time the sun seems to shine reflects the warmth of the feelings growing between Winslet and Ronin's characters. Small wordless gestures cue us at what develops between the two.Where it all leads is a final sequence where the two characters wind up in the British Museum where Mary Anning's most famous fossil is on display. That the director chooses to have this magnificent discovery separate the two characters (when in fact historically it brought them together) is a fast way to bring up The End card and resolve the complicated mess the director created.If you can put aside and learn a little about these two historical figures and know what you're about to see is a fantasy, it's worth seeing for Winslet and Ronin (and the entire cast and production crew's) work, and marvel how little slices of film can convey so much. Just realize it's not about these two actual women; it's a male fantasy."}, {"id": 62, "text": "I don't want to go back to the life I had before you.In this quiet period piece, acclaimed but overlooked fossil hunter Mary Anning and a young woman sent to convalesce by the sea develop an intense relationship, altering both of their lives forever. The underwhelming TIFF reviews had me worried for this one. And even when the trailer came out I had concerns about how unoriginal the story seemed. However, I am glad to say I found Ammonite quite a good piece in film. If there's one thing that needs to be noted first, it's that this isn't anything amazing, especially on a storytelling perspective. Gay and lesbian movies have become a thing of great example of cinema lately. Portrait of a Lady on Fire proved to be a masterpiece late last year (or early this year depending on where it was released). Ammonite wants to be another Portrait of a Lady on Fire but can't quite reach it. Immediately, it feels that we've seen this movie before. Two woman, one not wanting to be there and the other stubborn, develop a relationship that turns into a great love. The predictability isn't a problem here, though we all know where it will go at key moments. Still, I found myself enjoying Ammonite much more than I expected.I really needed a quiet, romantic drama. They have always been something I've taken a liking to. Chicago is also a loud city. There's noise happening all the time. Just being in the theater with basically no one else watching this, the tranquility just gave me relief. Just quiet. Dialogue is almost absent in the movie. The blocking and developing relationship is where the focus is put on. When dialogue is used, it honestly isn't the strongest ever, but I'm almost glad it didn't go for that. Sometimes the biggest words and metaphors aren't needed to make something great. One random thing because I'm not sure where to mention this, there's a few scenes that incorporate letter writing. In the 1860s writing looked much different and there isn't anyone saying what is written so I'm not quite sure what they said. If the actors maybe read them allowed or something was done about that, it would be favorable to most audiences. Kate Winslet has been getting praised for this role saying it's her best yet. I'm not quite so sure it's her best but I completely understand. She is so damn good. Without the use of words she can convey so much emotion. Winslet immerses herself into the role of Mary and I couldn't picture anyone else in it. The same can be said about Saoirse Ronan. She is one, of not my favorite actress of all time. Her role of Charlotte reminds me of her playing Mary in Mary Queen of Scots. She's very good and has a lot to work with. There's a scene of her going from laughter to a total breakdown that I though was just perfect. A problem with the writing has Charlotte change into something that I didn't quite like in the third act. I'm not sure if it's intentional but it just didn't work for me. Still, she's amazing but I'm not quite sure she'll get nominated with the competition in supporting actress. I might even say the same about Winslet. There's that, the fact that this is a quiet movie, and the mediocre reviews going for it.On all levels other than storytelling, this is beautiful. Starting off with the cinematography. You know that it's going to look great. It takes place by the seaside, archeology has a beautiful nature to it, and it's a period piece. Every shot looks great and I can't see why it won't get nominated. The costumes are fantastic. This will be an example where out of context you could name what movie the costumes are from. The production design is fairly good. Volker Bertelmann and Dustin O'Halloran compose a soothing score. There isn't much score used (only 23 minutes if I remember correctly) but when used it works to it's advantage. Maybe not the nomination type but I still like it. That sort of plays into the sound design which I took a liking to. Again, the use of water elements has much to its advantage. I don't think Ammonite is a disappointment. Maybe I won't like it as much later on but it's still pretty good to me."}, {"id": 63, "text": "Ammonite's love/dramatic story is very deep and beautiful. But, the film was really missing many things that prevented it from being a great motion picture.The film's love story is very unique and beautiful. Really loved the love story between the two characters and how it was built. But, it was built in a way that was so dull, slow, and boring. It didn't take a long time to build it, it was being built in a dull/slow way that made it seem like it was long. I have watched many films that are like Ammonite, films that are slow and cold but some were actually very great because they used many aspects to make it be so.To have both Kate Winslet and Saoirse Ronan in one film is a very big thing, both of them put a great performance that is worth an Oscar nomination especially Kate Winslet. She was able to portrait her boring/depressed character very well, her face was saying it all, by looking at her face you can tell what she's feeling. But, I feel like the writers didn't use them well, in some scenes, I felt like they were only focusing on both of them too much and ignoring other things like music, set design, and screenplay. What's the point of focussing on the acting and ignoring everything else?. Having both of them in one movie is a very big chance that nobody should waste and they should use it very well and be careful with it especially that the bond between them was so great.In addition, The film has a very beautiful/genuine loud silence. Silence is a very important thing in this film and it has so many meanings behind it. Silence is a language, silence speaks volumes. But, I feel like the reason why the film seems dull and slow is because of this, THE SILENCE. It was used too much and in a way that would make it seem like it's a boring film. If it was used very well, then this film would've been a masterpiece for sure. There are many scenes or films that have complete silence In them. But the audience still enjoys seeing them. For Instance, Call Me By Your Name has many scenes in it that are completely silent. Like, one character is just eating or smoking or watching anything without saying a word. But with all of that Call Me By Your Name is one of the best films ever and the reason why is because the film used many aspects and knew how to use silence in a way that would make it seem great.The sound mixing &amp; sound editing were awful. In some scenes, I was struggling to understand the speech and the background noises were louder than the speech. The film is also missing a music score that would've made many scenes better.The film has visually stunning frames and shots, the cinematography was great. But, they were so few.In the end, Ammonite would've been a masterpiece especially that it has a great love story that would live for ages and two amazing actresses. But, the film didn't use the tools that they have in a way that would make the film a masterpiece.My rating is: 6.5/10"}, {"id": 64, "text": "Despite starring two of the finest actresses of their generations who are also known for sparking a chemistry out of thin air with anyone n everyone, Ammonite turns out to be a surprisingly mediocre, lifeless &amp; uneventful love story that's severely lacking in one aspect it actually needed to get right to make itself work, and is nothing more than a cold, lacklustre &amp; half-hearted attempt at period romance.Written &amp; directed by Francis Lee, the film features a fascinating premise and also had all the ingredients to create an intense, passionate &amp; all-consuming love affair but Lee's stony treatment of the material &amp; poor handling of characters results in a story that has flashes of burning desire but not the intoxicating warmth or intimacy to fully immerse us into the blossoming romance between its leading ladies.The central relationship definitely required more depth, build-up &amp; sexual tension to establish an alluring &amp; appealing chemistry. It often comes alive but then fizzles out just as fast. Kate Winslet &amp; Saoirse Ronan deliver quality performances in their half-baked roles and try their best to make the romance work but they simply don't have enough resources to work with &amp; build their act upon. And hampering the ride some more is the lazy camerawork, dull editing &amp; inert score.Overall, Ammonite makes for an interesting story of love, longing &amp; loneliness but thanks to several shortcomings in the script &amp; bland direction at the helm, the film finishes as a boring, forgettable &amp; substandard example of its genre. Falling short on expectation scale by a fair margin, its only saving grace is the impressive work from Winslet &amp; Ronan who at least make the ride bearable, if not rewarding. Slow, vapid &amp; unstimulating, Francis Lee's latest is disappointing in more ways than one."}, {"id": 65, "text": "The best way to describe this film is if Portrait of A Lady on Fire was written by a man. Meaning, there seems to be a lack of understanding of what builds intimacy and connection between women in this film, so it seems like a bit of a failed attempt to replicate the former film, just in the 1840s with a self-made fossil expert rather than a painter.One character (Mary, played by Winslet) is cold and guarded, and we never really see her come out of her shell. Like ever. The other, Charlotte, played by Ronan) is practically throwing herself at Mary. But we never really understand why she's so hot and bothered, because Mary doesn't ever talk. The little things, like playfulness, eye gazes, and deep conversation that build intimacy are missing. All we get are a few ankle shots and googly eyes from Ronan. Even the love scenes felt transactional and sort of out of nowhere.The plot and premise are certainly worthwhile, but the script and direction fell really short, which created a lack of chemistry. I enjoy subtlety, but this was just confusing and unfortunately, really boring. Ultimately, Mary's character in particular is a frigid icicle who never fully thaws enough for us to sympathize with her. It's also just hard to root for a couple when we don't even understand why they like each other in the first place. Other films have created intimacy/tension far more masterfully.This was disappointing, and suffers from a lack of character development, pacing, and script issues. Winslet and Ronan do their best with what they have, but like Disobedience, there isn't enough for us to digest."}, {"id": 66, "text": "Piano, beach walks, time period, drawing. These are all in the Portrait of a Lady on Fire as well. I am not saying that the movie stole these concepts because it didn't. Ammonite is definitely not a remake of Portrait of a Lady on Fire but they tell a different story in a similar way. Ammonite does a great job at what Portrait, already did a great job. It is slow-paced with great cinematography and it has clever usage of silence. I loved all these things but the setup of the story was just mediocre. The introduction of characters are mediocre. I mean the characters can be ordinary but with great direction ordinary can look mesmerizing. The side plots all fell short, the side characters just didn't work unlike Portrait. The acting was very good, deserving of award nominations. The first 90 minutes of the movie was okay, it definitely wasn't bad and had some good elements(even though they were similar to Portrait) but the last 30 minutes... It dragged, It just stopped moving. Almost every choice didn't work out at that point. It was like the director saying, Yes, I know you've seen the first 90 minutes before in different movies. Now, I will go for something different, but it won't work. The ending just didn't work. I was afraid that I wasn't going to like this movie and unfortunately I was right. If the movie just 90 minutes long, then I could have at least said, A similar story but not bad at all. The movie tried something original, different than what has been done before but it just failed."}, {"id": 67, "text": "In victorian england, could lead to imprissonment and even worse, especially among women in a marriage. this is a story about such caracters, a histori erotic drama, a bit slow, interesting for paleontologists, as the coanst of englang is a gold mine of jurrasic artefacts.i just adore kate winslett, all the way since titanic, she has a beauty and glow that i cant resist, and her job here are very decent. most of the cast delivers by the way, and the production are merely flawless but a bit longdrawn and slow i must admit.lesbianism in the stoneage maledriven england aint easy, i hope they dare to make a follow up to the story, cause the end aint final.this is art for the feimsmaeckers, and sensuality at a jawdropping level, a recommend from the grumpy old man"}], "reviews_amount": 68}