{"name": "Arthur & Merlin: Knights of Camelot", "titleId": "tt07052270", "reviews": [{"id": 0, "text": "Read the user reviews and had to see for myself. I agree with most of them. This was so boring. The acting is really bad. Very light on action. Extremely unconvincing sword play. Arthur charachter is weak and horribly presented. Merlin is not in it for more than 5 min total. Felt like someone had some money to waste and wanted to make a high school production on film. Just skip this one."}, {"id": 1, "text": "The plot is all over the place, the acting is terrible, and I couldn't even make it to the end. An hour in I had to abort."}, {"id": 2, "text": "I was fooled by the rating. Should have read reviews. 90 minutes (not all because I walked the dog) lost forever..:"}, {"id": 3, "text": "I wonder who got the weird idea to tag this movie as a comedy since it's absolutely not in any way shape or form, not even with a second degree of lecture. And worst, this not even a good movie at all.... Not a good swordfight in it , no interesting plot , no attaching character,..... This movie is boring as hell and the only good news is that it last only for 90 min wich feel already like 180 min. Maybe you're a fan of the Arthurian mythology, well you'd better avoid watching this because like me you won't find nothing a bout it in that piece of crap."}, {"id": 4, "text": "The acting was poor. The writing was poor. The actors had to have family boosting the ratings. This had to be one of the worst King Arthur movies I've ever seen."}, {"id": 5, "text": "The only redeeming quality to this garbage movie is the sweet release of the credits."}, {"id": 6, "text": "This is truly awful for anyone who likes Arthurian legends, or movies, or women. We first see Arthur and Lancelot being Bro-boys and talking about the chicks they banged. We then meet a weeping Guinevere and are given no reason to like her or the men. We are told Arthur marries her and are fast-forwarded to him indulging in self pity in a bar while neglecting his duties as king, husband, and father. Lancelot arranges for a woman to proposition King Bro-Boy, and he happily cheats of the heart of his heat, the woman he loves, his wife (who he abandoned and neglects). His son grew up with a thing for his stepmom. Bro-boy Jr. not only tries to take the throne, but he has some weird rapey sexual aggression for his stepmom that in no way furthers the plot. I think it's supposed to be titillating, but it's creepy and nasty. But then. all the men in this movie are kind of creepy. I don't have anyone to root for. I don't know how any of the characters like each other or themselves. I am sorry I watched it. This movie is not good if you have daughters. Or sons. Or eyeballs."}, {"id": 7, "text": "This is surely one of the worst movies of 2020. Everything about it is way below average. The acting and fight scenes sucked, and the plot is just utter rubbish. Watching this movie to the end will only leave you regretting."}, {"id": 8, "text": "I have an affection for low-budget literary adaptations that show a passion for the source material or a fresh point of view.This film has neither. It doesn't even exhibit any zeal for film making. The actors are utterly failed by this."}, {"id": 9, "text": "This movie has nothing to do with the story of Camelot and is such a waste creative effort what little there is here."}, {"id": 10, "text": "I don't know that the director even watched this terrible movie that is made by himself. Very bad"}, {"id": 11, "text": "I wonder how this movie got such a high rating. It's not even worth a 4 to me. Poor story line, entirely wack plot. Most of all inexperienced actors."}, {"id": 12, "text": "This has to be the very worst King Arthur movie ever made. The story line and script is extensively boring in every way. The 'actors' must have been gathered from the village amateur dramatics society. The sword fighting is akin to children playing with wooden swords in the playground. Long shots of the castle in a coastline hill are terrible CGI, typical of 1990's home computer games.I can't think of anything positive to say about this film. It's just terrible!"}, {"id": 13, "text": "Wasted an hour watching this one, before realizing it wasn't going to get any better. Arthur didn't look a bit his TW White, Sword in the Stone hero, nor did Merlin. And that weird woman appearing and vanishing like the vapors. Medieval girl power? They almost deserved one of the stars for managing to work that one in."}, {"id": 14, "text": "What could have been an interesting new twist on the good old Camelot tale turned into a fractured dud. The disjointed storyline and, at times, confusing dialogue makes this attempt at reliving the good old days of magic and mystery fall pretty flat. If you're in the mood for Camelot fun, re-watch the good old version starring Julia Ormund and co."}, {"id": 15, "text": "Every movie has action I suppose but if you're looking for real action and you're mature then this isn't the place to find it. Every movie has adventure - see above Yes 100% it's history with B-Movie or lower direction/acting but must give thumbs up for some of the props &amp; scenery/location.It seems kids of today haven't the time to discover movies made over 10 years ago because I'm sure if they did then they're rating for this effort would be severely impacted.To be honest after 30mins I watched Dreamer: Inspired By a True Story (2005) and loved every minute of it - currently the rating is only 6.8 go figure."}, {"id": 16, "text": "This movie is a mockery of the King Arthur story. The acting is budget and story line in left wanting. Don't waste your time with this movie."}, {"id": 17, "text": "I have never wasted my time like this. I was waiting for something to happen but nothing happened at all. This film was unbelievably terrble in any respect."}, {"id": 18, "text": "Dude, only by watching the trailer one can tell this movie is a total waste. Bad acting, bad screenplay, bad directing, bad is all around. This is even worst than Guy Ritchie's King Arthur: Legend of the Sword. Don't waste your time. I gave 3 stars out of pity."}, {"id": 19, "text": "This Movie is trash, dont waste your time lol its the nastiest thing on earth."}, {"id": 20, "text": "Watching this movie was such wasting time -the story was bad -sword fighting was ridiculous -that merlin oh god don't even talk about it and more"}, {"id": 21, "text": "After just finishing Netflix's Cursed yesterday, this movie wasn't that bad. It wasn't that good, but the bar was lowered severely by the aforementioned show."}, {"id": 22, "text": "Fighting scenes are low budget......acting way over the top...."}, {"id": 23, "text": "I don't understand why the waste our time with these movies or shall I say high school plays. Yet, I'm so happy that I haven't paid for watching this one. Here is my review: Not necessarily all costly movies are the best but undoubtedly, if you wanna make a watchable movie, you have to break the bank. For this particular case, obviously it's meanly spent. Background music is a great deal in movie making to keep audience attention on the scene and increase the scene's influence and even this significant factor wasn't practiced in this movie. Additionally, filming, which was unbelievably terrible! I don't wanna continue more but I must mention the last point which is the title of the movie. Title must be the abstract of the movie and even this one doesn't fit the plot. It would be better to name this movie: forbidden love or treason of Lancelot or generally treason. Overall, it was a great regret watching this movie."}, {"id": 24, "text": "Arthur is legend, the real arthur and there have been great films to tribute that legend, this is an insult not only to the legend but to film making, from start to end weak acting no highlights no tension no thrill no epic moments just 90 min of plain boredom. Why waste money making 1 / 10 star films and ruining a legend, , save and invest the money and spend it along with more and make a film about a Myth / legend fictional or real that has NOT been told yet."}, {"id": 25, "text": "Unimaginative story, bland dialogues, uninteresting characters. Everything that could possibly be wrong is just wrong with this movie. A disservice to the Arthur lore"}, {"id": 26, "text": "No quality in story line, acting, filming and so on. It is rubish and waste of time. Instead of watching the movie, gaze on an empty wall for 90 minutes."}, {"id": 27, "text": "I shall not go into acting and directing performance yet as a Roman historian, I find this movie insulting to the intelligence of all the people who were listening a history lesson on Roman Britain and its aftermath. In this movie, the actors are depicting a time from the 13th century. The fashion, appearance and props are unsuitable for a time when Arthur lived, which was the mid to late 5th century AD. This movie just ignores historical and replaces it with political correctness - a modus operandi of many movie studios (read BBC). It's waste of money and time."}, {"id": 28, "text": "Sadly I went by the initial reviews and watched it, well I didn't actually watch it all I just couldn't. It is that bad and I have no idea how it got any stars at all... My time is far more important than wasting it watching this."}, {"id": 29, "text": "I was just thinking, What does the world need most right now? Why another version of the King Arthur story. This is the part of the tale when Arthur leaves France to regain his throne being usurped by his son. We watch Arthur lament for most of the film on how he is not fit to be king and a lot sayings about being a king. The characters were not overly exciting.Guide: brief sex and nudity. No F-word."}, {"id": 30, "text": "Boring! Low budget! I couldn't understand really the last part!"}, {"id": 31, "text": "I was truly disappointed that I needed to come here and give 1 star. Clickbait title Arthur and Merlin.. Wtf"}, {"id": 32, "text": "The story is all over the place, characters are unconvincing, don't waste your time"}, {"id": 33, "text": "Everything is terrible about the movie! Regret watching it and wasting one and a half hour of my life. Good story was rewritten in such nonsense."}, {"id": 34, "text": "To all you naysayers out there, this adaptation of the classic Arthurian legend was well worth the watch. Yes some of the camera shots were suspect, the acting so so, but it kept to the basis of the legend, and played out well. Some reviewers stated that Merlin was only in it for 5 minutes. Yes in human form he was but as the Falcon he normally portrays in legend, and books, he was in it the whole film long. I enjoyed it!!"}, {"id": 35, "text": "I learned about this movie's existence because Skallagrim criticized the fact that they use cheap prop swords. I can live with that, it's a cheap movie. It can't hold candle to Excalibur but what movie does? If it's airing on public TV and you need a background for your pizza&amp;beer time with your family/friends, this is what you ought to put on TV (with low volume). Nothing more, nothing less."}, {"id": 36, "text": "This is one of those annoying films. It has a rating of 7.4 (at time of writing) and yet the very highest user review rating is 3 stars! - I wish I had read the reviews first....The good: ...*.......*......*.... (that's a tumble-weed moving across the screen)The bad: Well.... to quote a fellow reviewer bloody awful. Its constantly dark/dreary (like the film)Its soooo boring, I had to reach for the FFD button a lot to get to the endThe pacing is terrible, and there is so much slow fluff going on that I could not be bothered to concentrait hard enough to really follow any of it... but basically the story is King Arthur comes home and takes control back off his naughty son (who probably has a point btw) - and that's really it.The king is the most annoying whiny-arse... why would anyone follow him. To be fair he does tell people this all the time, but they are like: we will follow you to the end and crap like that...Did I mention it is very boring?I did not enjoy the screen time of any actor at all - not one, and that is rare... well, possibly merlin, but then he only had about 3 lines - yet its called Arthur AND merlin??? - it should be called Arthur whines a lotehhh... I am too bored to remember the rest..."}, {"id": 37, "text": "A budget drama with fantasy elements, this movie is a committed attempt to show the legendary King Arthur in a different light. Compromised by fighting abroad, he must deal with both the criticism and the consequences he faces for fighting foreign wars rather than protecting his home. Unfortunately, Arthur &amp; Merlin: Knights of Camelot is light on both plot and characterization. Arthur's return to Camelot is slow and tedious, leaving the audience to wait a long time for the movie's final, climactic 15 minutes.It's also frustrating that Modred, Arthur's illegitimate son who has a genuine grievance with him, is reduced to a pantomime villain. Guinevere (Stella Stocker) is likewise undeveloped, as she wards off Modred's advances and does little else. Another criticism is that the script occasionally slips into modern speech -- Modred is described as making a play for the kingdom at one point -- and that many scenes repeat the same plot points through their dialogue. Perhaps the biggest disappointment is that Merlin (Richard Brake) is presented as one of the lead characters, but only appears in a handful of scenes. It's another missed opportunity in this medieval tragedy. James Welch Henderson, Arkansas 12/19/2020"}], "reviews_amount": 38}