{"name": "1BR", "titleId": "tt07541106", "reviews": [{"id": 0, "text": "This has me interested from the get-go. I must admit I'm not usually a fan of these spooky bedroom type situations, but this is far from your bedroom goes bump in the night movie.This could have been a little more intense, and in-depth, as far as story line goes, but the story that they have given you i think is well done, well acted and over all quite a good watch.I wouldn't say this is a horror, at all, but it makes for a good thriller."}, {"id": 1, "text": "A little bit of spin on the cult genre placed in the middle of LA. One thing I liked about this movie is that it's premise isn't drawn out, they get to the main plot in pretty quick order, you're not stuck waiting and wondering when it'll actually start getting interesting. It's low budget but shot well, the acting is fine, the lead actress is very pretty.The story is a young, somewhat naive and introverted, woman moves from the middle of nowhere to start a new life in LA and finds an affordable 1 bedroom apartment. There's a little backstory as to why, but it's a pretty tame reveal and doesn't matter all that much. Soon after moving in she notices some of the neighbors are a bit odd and not as nice as she initially thought. Things soon start getting aggressive then you're pulled into the main plot for the rest of the movie.There's some suspense, a couple scares, some violence and a little blood and gore, and it ended with a bit of a twist. It's not going to blow you away or anything but it's perfectly watchable while stuck indoors and bored out of your mind and the twist at the end left me interested in a potential sequel."}, {"id": 2, "text": "Ever build a campfire? You gather flash, kindling, and solid wood. You stack it up oh so carefully. You light it up. The flash produces a flame. The flame ignites the kindling. Then you wait until the fire roars to life and you get a spectacular display. This movie is what you get when you use green wood for the fire. It builds up then just fizzles and smokes. Budget wasn't the problem, screenplay was. I understand what the screenwriter was trying to say, and the movie itself is shot beautifully, but the story just fizzles out at the end. I expect this review will be downvoted (not helpful) quite a bit, as most of the negative reviews are, by the community of the movie, but... It's My Life!"}, {"id": 3, "text": "With some genuinely disturbing parts. And just when you think it can't be much harder to watch, it gets harder to watch. It takes around 30 minutes to set up then the last hour a real rollercoaster ride with a fairly high squick factor. Overall a very satisfying horror/thriller."}, {"id": 4, "text": "Reviews are a little all over, but the average is where it should it be at this moment. It's low budget and independent. There aren't any well known people obviously, but the lead actor was decent. The story, editing, sets, lighting were all good for what it is. I genuinely felt this could happen to someone, and felt the tension of it. There are a couple of moments where it works as a light horror/drama. I'd give it go if you like feeling off balance in a living arrangement."}, {"id": 5, "text": "A remarkable look at cult activity, society and human conditioning on several levels. Should give it a look."}, {"id": 6, "text": "An average thriller nothing great but nothing really bad, it's just ok if nothing else to watch and you want an ok thriller it was worth watching once. Acting was decent and had a decent ending like I said overall just.....good."}, {"id": 7, "text": "Not a great movie by any stretch. But a clever commentary on the strict conformist society that we now reside in whether it intends to comment on that or not. I liked the twilight zone (60's) ending."}, {"id": 8, "text": "When I find movies like this being given such good reader reviews I'm tempted to think there must be lot of shills out there hired by the studios or somebody. Anybody that can't watch 15 minutes of this movie and not guess the middle and the end hasn't seen movies of this type for the past 15 - 20 years. It was THAT predictable."}, {"id": 9, "text": "It comes across as a made for tv film. one of those you find in the afternoon, and you'd be best advised to sleep through. how does a film like this get good reviews,needs investigating?"}, {"id": 10, "text": "This little thriller/horror flick for certain does not deserve a rate of 10 to 8 but also no rate lower than 4. The production and acting is solid (well done by Nicole Brydon Bloom) and the story and the events did hold my attention. Of course the analogy to societies or to cults or sects is a rather obvious one, also the last twist, but anyway, I was entertained. Nothing new on the Western front I would say, but solid. Reminds me a little bit of Martyrs (2008) but a far more tame one - regarding torture and gore we just get a very little sniff here and there."}, {"id": 11, "text": "I hadn't even heard of this 2019 movie titled 1BR prior to getting to sit down and watch it here in 2020.Now, I am not familiar with the work of David Marmor, but I will say that this movie definitely turned out to be interesting. The movie was nicely directed and definitely turned out to be entertaining.The storyline was good, although it felt a little bit rushed. I mean, it was rather quickly that Sarah (played quite well by Nicole Brydon Bloom) managed to convince her captors of her assumed-intention of remaining in the community. But other than that, it was definitely an enjoyable movie.The acting in 1BR was quite good, especially from lead actress Nicole Brydon Bloom, because she was fantastic in this role. Taylor Nichols, playing Jerry, definitely also performed quite well. It was a shame, however, that actress Naomi Grossman wasn't given a more important role and more on-screen time, because she definitely could have added a lot more to the movie.I found that director David Marmor had an interesting approach with this movie, in terms of taking on a cult mentality and a twisted sense of community. I liked that about the movie.It should be said that the ending of the movie wasn't a particularly fulfilling one. It felt a bit bland, to be honest. Not that it ruined the movie or anything, but it could have been ended in a more wholesome manner. It just felt too cliché.My rating of 1BR is a six out of ten stars."}, {"id": 12, "text": "I've always have more respect with film that has low budget and did the best they could. It's clear that this film has low budget, and manage to make the most of it, that being said it has an unknown cast, average acting and average production. As of the story, the concept is decent. But it's a bit too draggy with little to no plot development. There are also some dull and dumb moment. The horror thriller is good, considering... . The twist is not jaw dropping, but it's pretty good. All and All, it's watchable but don't get too hyped up."}, {"id": 13, "text": "Not the best budget but it had a good storyline. It made sense and it kept my attention. Pretty good!"}, {"id": 14, "text": "The real horror here is going to open rental inspections in a nice area only to find heaps of others are interested in the flat too. And when you do find a place to live there's noises at night that compound the drudgery of day-to-day life. Very relatable stuff. But then the film deviates to a world of enforced anarcho-communism and some hardcore behaviorism is applied. A refreshing application of torture porn here and there, bundled into a movie with a story to tell that may not be a masterpiece, is still enjoyable."}, {"id": 15, "text": "This movie has a really nice idea,that you live in a motel and they are kinda a cult I think but really falls apart in the execution. It could be much better,soo predictable you can tell the ending ten minutes in the movie and it still stupid like hi I am gonna say a word and the heroine gonna be like oh right I am gonna do something and win you cause I am the heroine. We needed to see a back story to Sarah we knew that her father cheated why not expand it to a scene and make us see it instead of telling us, it would make us care for her, root for her and feel Something at least in the fight between her and her father. There were two flashbacks in the movie to scenes that exactly happened like 5-10 minutes before it, I think the director thinks we have a short memory condition cause the flashbacks were useless. The movie feel kinda empty, we didn't know the characters well or the so called cult I think the only reason to watch the movie cause nicole brydon the actress of Sarah is so cute"}, {"id": 16, "text": "I hated it at first but it's pretty fast moving and I got intrigued somewhere in the middle. I'm glad I continued watching because it turned out to be a pretty good random movie for the night."}, {"id": 17, "text": "When I started this movie. I almost turned it off . Figuring it's a low budget flick , it's going to suck . But then I became very interested watching. Just by the behavior of people. That caught my attention. It's a good movie. I'd recommend it. I enjoyed it very much. It's better than a lot low budget films ."}, {"id": 18, "text": "Cat in oven. I shut it off at that point. They warn you about cursing and nudity, but not about serious images of animal cruelty."}, {"id": 19, "text": "There is not much to this story. The budget felt like it was $100,000? Paper thin story, no character development, marginal direction, and barely scary, at all. Another in a long line of very poorly done cult films. Save your time."}, {"id": 20, "text": "What can I say about this movie - WATCH IT!The story is believable, well written, and superbly acted by all members of the cast. it will suck you in and spit you out before you realise it.It's not a slasher but it is incredibly creepy."}, {"id": 21, "text": "Netflix is hitting a new low! Why am I watching this stuff? Movie was awful. It wasn't kinda good. It was so awful."}, {"id": 22, "text": "Read some very positive reviews but I shud have taken caution cos none of the reviews r from prolific reviewers. I wud have given it a 1 or 2 but it gets a 4 cos the entire movie is set up during ample light n none of the scenes r shot in dark to hide the budget. We have seen much better films on cult groups, especially the religious ones set specially in the ashrams or secluded areas but this one is set openly in LA n by some fellas who keeps saying that it is purely science but in my mind I was thinking wtf. Tried hard to be different from ur regular films based on cult groups n this is another reason it doesn't get below 4 from me."}, {"id": 23, "text": "Horrible! The actress didn't shed a tear until the end, I didn't believe she was afraid for her life, or scared throughout the movie. So many opportunities to show a range of fear and sorrow and confusion. It looked promising, it was utter carp. Such bad acting."}, {"id": 24, "text": "I'm strictly speaking from an entertainment point of view. There's better movies to go into all the social commentary and religion stuff. My main issue with this film overall is how painfully predictable it is. In the first few minutes I guessed the entire plot and knew it would end 1 of 2 ways.... and what do you know it did.I mean even though it's very predictable I still found everything in between to be entertaining enough to keep watching. The acting imo is decent. Not great but it gets the job done. The ending is what ruined the film for me even though I saw it coming. Are we still doing this ambiguous bs/could be a sequel but probably not endings? I'm sick of it. It's not clever and it's lazy storytelling. This film isn't good enough for it to linger in your mind so why not just give a clear concise ending. You can think it's some social commentary all you want but it's a weak one. If you like predictable films with downer ambiguous endings have at it otherwise skip this one."}, {"id": 25, "text": "1BR - B+ (Memorable)Gone into without watching promos, and had zero expectations. I found its social commentary and subdue horror thoroughly entertaining.That's how I think Scientology would be, you hear all those horror stories very similar to this movie.Good attempt, i'll be keen to see what director does next."}, {"id": 26, "text": "For horror/thriller fans who only skim through movies, this movie will be a good watch, but for the people who watch movies with a closer look, this movie is a gem and has a strong message about the society we live that you can easily figure out by the time the movie completes ! A must watch !"}, {"id": 27, "text": "I have been looking for a movie that is different than the usual movies I watch(horror, slasher) and this one did not disappoint. This movie is eerie from start to finish. You never know where Sarah's head is at and you never know who to trust or what will happen next. This is an awesome slow burn movie. If you don't like movies that go a little slower, you probably won't like this. But man, what a ride this movie was."}, {"id": 28, "text": "David Marmor has definitely been added to the list of indie horror directors to look forward to, for his debut 1BR is a very well composed, conceptual and thrilling ride into the frightening science of a cult &amp; hopelessness of its members. A thriller not without its flaws, but one well worth seeing.I did anticipate 1BR, had heard some praise, read some headlines, but soon enough into the movie I found out I had no idea of its actual concept, which served me well. For some reason, I was half expecting something like a good old fashioned cat &amp; mouse thriller. 1BR tells a story of Sarah, a young woman who just scored a nice apartment in L.A., where she's looking to start a new life and find some relief over her emotional baggage. There's something going on in her new home, neighbors seem odd and atmosphere can be a little weird... Soon Sarah finds herself in the middle of awful schemes, hopelessness, helplessness, paranoia, torture... and a cult. This is where the real interesting part of 1BR starts, the middle layer of the cake was the most intriguing on my mind. A lot of what Sarah goes through as the cult attempts to convert her to their ideology and agendas is derived from stories of actual experiences from members of the Church of Scientology, NXIVM and other similar organizations.1BR is David Marmor's modern and scary fable of brainwashing, collective insanity and utopian horrors, served as a neatly packed thriller. The story goes a long way in 1BR, effectively structured, providing a consistent and eventually uproaring pacing. However, while being as compelling and offbeat as it is, it also feels like a missed opportunity to go in many crazier directions. Offbeat eventually transforms in a more traditional kind of thriller, a competent survival ride, with enough twists and turns to keep being engaging albeit pretty predictable at times, especially in its second half. The third act is the most bonkers, successfully so, although mostly thanks to fast paced story line conclusions and some action. Structurally, 1BR could be called somewhat derivative.What I can truly commend is the cast, the performances feel believable and actors - devoted. No doubt the highlight belongs to Nicole Brydon Bloom (Sarah), an actress I hadn't seen before but am sure looking forward to see in many future projects. The setting of an apartment building is another thing I'd like to point out, it's a great place of horror when utilized cleverly, I felt a Rosemary's Baby vibe somewhere around the halls and rooms in 1BR. As far as the visual side of things go, 1BR'sdesign is orchestrated as competently as its script. An limited budget indie for sure, but a good one at that. The inclusions of gore and violence hit the rights notes as well, nothing feels like just for shock's sake. Oh, and the original score catched my ear a couple of times, good job by Ronen Landa (The Pact, Holidays).Couple weeks ago I watched The Other Lamb, a movie about a cult as well, just with many different pros and cons if compared to 1BR, I called the review for it The Cult Phenomenon &amp; I wish I hadn't, because I swear it fits better here. Seriously though, 1BR is a great little thriller, be sure to watch it if any of this piqued your interest. My rating: 7/10."}, {"id": 29, "text": "What is this all are wasted of time? It is not good movie. Waste waste movie. Don't watch movie waste of time😢😢😢😢 not horror 😢"}, {"id": 30, "text": "I watched and liked. original script, most important it was creepy and brutal. Just remembered HBOs film about Scientology. So many references. lie detector test questions and answers, Say NO to family Members, should be married same religion person, book as well there kinda Bible. scientology have as well 'Dianetics'... liked. all this bloody scenes was so realistic. I mean you can't complain.... everything was done amazingly. well done Director and whole cast and crew. 10 / 10"}, {"id": 31, "text": "Like another review said, this would've been a great miniseries, there was a lot of good material here, but 90 minutes wasn't nearly enough time and the result was a rushed film with a lot of unanswered questions."}, {"id": 32, "text": "This was one of the worst films I've ever seen.Watched it for 45 minutes,hoping it would get better.It did.Don't waste your time."}, {"id": 33, "text": "No no no no do not waste your time on this crap. A beginning a middle and a very bad ending. Bad acting on an old story."}, {"id": 34, "text": "How stupid and exasperating can this rubbish get?? At some point you seem to get it and start to barely like it....and then, it all turns into manure. Quite quickly. Acting, directing and editing at it's worst. By the way, conclusion is horrible."}, {"id": 35, "text": "Pure boredom. Waited for a clue or sign of live. Dead boring. I wish I could give it a 0/10, because a 1/10 is too high of a rating."}, {"id": 36, "text": "The idea is super cool. Some weird and disturbing parts. But I guess it need budget."}, {"id": 37, "text": "I had never seen a movie like this. I was living it, so there's nothing that bored me, or made me think that I should do something else."}, {"id": 38, "text": "I like this..... scratch that, i love this movie. From what i just saw, this movie could go deeper than what they displayed. That's why a series would have been great. Perhaps they'll make a pt2. I don't want to give too much away, and i damn sure am not part of the cast, although i wish, but the ending solidified it for me. Great movie. I highly recommend it."}, {"id": 39, "text": "It's a psychological horror movie during which you'll be sympathizing with Sarah. She doesn't realize that she's living with a freaky group of people until it's too late! It's OK to watch this movie but not to expect it to be a big deal."}, {"id": 40, "text": "Yes, this is somewhat predictable, as others have already said, and yes the acting is not up for an Oscar; it is prety decent, though... but...It is entertaining!And this is all that matters!The fact that it reminded my of Scientology with its author founder and strange practices to members who wanna leave... that did it for me.Watch this one, you won't be disappointed"}, {"id": 41, "text": "Terrible actingTerrible storyTerribly filmedJust terrible"}, {"id": 42, "text": "So nerve wracking and intriguing at the same time. Keeps you interested most of the way through; such a weird community of people! The makers are kinda sick in the end. A little bleak at times but quite entertaining and has an amazing epilogue!"}, {"id": 43, "text": "This was actually better than expected. I expected a low budget, boring home invasion-esque plot/film, but what I got exceeded my expectations. I'm not trying to hype this movie too much, however, it is one of the better B-rated film from the thriller/horror movies I've seen. I recommend checking this out just on a random night."}, {"id": 44, "text": "Good suspense, dialogue and acting throughout most of this low budget horror/thriller. To be clear I was engaged throughout until the last ten minutes of 1BR. If anyone else has seen one of my favorite movies 2015's The Invitation, then you will know exactly what I am talking about. The ending of 1BR is a slight variation to The Invitation's ending, so when I saw the ending unfold on my T.V. I was a little frustrated by the lack of creativity. 6/10."}, {"id": 45, "text": "This film helps you see a community from a more broader perspectve..in this case in LA. And one person realizing based on her own life that we can be trapped into finding the easy way out and join one viral system of society vs fighting your own insecurities and seeing a way out of it. It's unique, refreshing, well performed with good visuals. I think the script could have been improved, but in all a great film to watch."}, {"id": 46, "text": "The movie was slow for me in the beginning and I was considering to stop watching. However, the movie picked up when she moved to that apartment and things got pretty twisted (interesting) from there. Give it a try. The ending was messed up too."}, {"id": 47, "text": "Not bad during lock down to see.....Sarah tries to start a new life in LA, but her neighbors are not what they seem."}, {"id": 48, "text": "This movie is so relatable now that we are experiencing community quarantine in real life. the lead actress' acting is convincing. This film will leave you unsatisfied and devastated vibe at the end."}, {"id": 49, "text": "Definitely watchable for a low budget horror/thriller. The concept of the movie is what I liked the most, it was definitely something new and creative. The cinematography was okay, you can tell they made it work with what they had. Acting could of been a lot better. But overall it is a watchable movie that some viewers may find interesting. It would of been nice if the plot twist at the end went a little deeper into the origin.If you enjoy horror/thriller movies and you can't find anything to watch on Netflix, give this a try. You may enjoy it or not. 5/10"}, {"id": 50, "text": "This is one of those low budget indie films I just happens to love. It's not that creepy and thus it probably fits both him and her. It's more of a psychological disturbing thriller with a pretty good ending. Most of the actors are unknown to me but I think they did an excellent job. Lower your expectations and you will enjoy it."}, {"id": 51, "text": "I went into this looking for something cheesy to help me relax. Don't do that! This felt more like a drama than a horror movie. I even teared up a bit (shh don't tell). It's got all the stressfulness of a drama and a thriller. As a horror movie, the plot is pretty predictable. I wouldn't watch it again, but I appreciated the commentary on social isolation, loyalty, community expectations, etc. If you're looking for something along those lines but less intense, I'd recommend Society (1989) or Parents from the same year."}, {"id": 52, "text": "Very typical utopian society gone wrong trope and the ending leaves you unsatisfied and underwhelmed. I would not recommend unless you are looking to entertain yourself by criticizing a movie for poor acting and plot line. I think they paid off Netflix to make this #8 most popular in the US"}, {"id": 53, "text": "Fresh , freaky , unique and original.brilliant acting, great direction, amazing story and plot. its kinda mansonesque but on a bigger scale!! the fast and furious fans mustve give this the bad reviews, i couldnt fault it!kidnap, cult , thriller, solid as you like, give it a shot, you wont be let down"}, {"id": 54, "text": "I gave this a 5 purely because it made me laugh how BAD it was!!! HahaThe psychology was BEYOND feeble The SCALE of the community was FARCICAL I found myself sayingITS A BLOCK OF FLATS!!!!! 😆😆😆😆 Dont rent it like I did. But do watch it for a laugh"}, {"id": 55, "text": "People get this straight.. If you don't give directors and writers like this a chance then we gonna have to watch crappy movies all our lives.. I mean this guy used ONE SET i.e the apartment where the whole story develops to give us a a completely watchable suspense filled, disturbingly twisted movie.. The cast did a good job especially the main character.. Storyline was good.. Am giving a 7 bcz i felt like the ending was a bit incomplete otherwise don't mind the negative reviews and give it a watch.. you won't regret.."}, {"id": 56, "text": "Not a detailed review - thought it was a decent film that would have been elevated by more experienced actors. The one thing I really appreciated about this film is that it wasn't some remote village or isolated community, the scary part was that the cult was in the middle of the suburbs, hidden in plain sight. Nice idea, but perhaps not executed as well as it could have been."}, {"id": 57, "text": "Tried to watch this because I heard good things about it online. There was no warning about explicit animal abuse, as it includes a scene where the main character's cat is burned alive in an oven. I immediately shut it off and refused to go further. This is entirely unnecessary to include and a warning should have been put in place. I am aware that it is a fictional depiction, but it is one that I do not want to be subjected to."}, {"id": 58, "text": "I'm fairly certain this chick would have tried to escape a lot sooner."}, {"id": 59, "text": "1BR: A young woman, Sarah (Nicole Brydon Bloom) moves to LA, taking an office job while she tries to get into a design school. She takes a dream apartment in a complex which seems to be full of friendly, helpful people. The pipes are noisy at night though and she gets a nasty note about pet rules when she smuggles in a cat. Things then take a strange turn when other residents drug and imprison her, using brainwashing techniques and other methods to break her resistance. The building is run by a cult who want to create the perfect community this is a rather complex complex. Quite distressing in parts, especially the stress methods used on bloom and how the cat is treated. Not a film for the squeamish or faint of heart. The gradual breaking down of an individual personality to be replaced by a commitment to the group is frightening to behold. Beware of apartment deals too good to be true which come with over-friendly neighbours. Written and Directed by David Marmor. 8/10."}, {"id": 60, "text": "Nothing really new and original;mostly reimagining of many preexisting better films.But it kept my attention quite well and was reasonably entertaining.One time watch ."}, {"id": 61, "text": "A mildly entertaining thriller where things seem off on day one when the female protagonist moves-in to an odd-ball apartment community. It turns out to be a lot more than she bargained for as she is forced to learn the communities secrets the hard way. It closes with an intriguing twist ending reminiscent of The Invitation."}, {"id": 62, "text": "69, I watched this late one night and didn't fall asleep which says a lot in my case. It was slow paced and somewhat predictable but full of originality."}, {"id": 63, "text": "Although this movie is far fetched, I still think it reigns true that cults are very easy to get into. One thing I didn't like about the movie was the unnecessary torture aspect. I felt like it was just cruel and sickening to watch. I truly felt uncomfortable watching this film so I guess the director did his job. However, the dialogue was a bit weak."}, {"id": 64, "text": "First and foremost, know going in to this movie that it is disturbing. If disturbing is not your thing, I recommend skipping this one. I appreciate the message of the movie and it's not an idea that's been done 1000 times but there are parts I wish I hadn't seen. And that's really odd because I usually like movies that are disturbing. I'm a huge fan of horror, especially psychological horror. There isn't much that disturbs me but something about this one got under my skin and not in a good way. Oh, and if you love cats don't watch."}, {"id": 65, "text": "Quite, quite sick with a disturbing sense of community. This reminds me of some horrific real-life events.I'm not a fan of this kind of plot. The original, 1984 was terrific. Its imitators are less so. (I guess that reference is a spoiler.) I did enjoy the ending. I was going to give it a thumbs down on Netflix, but the ending saved it. A different ending would have made it unpalatable.In a creepy way, this is almost believable, but I admit I've read too much news from the tabloids. (Think The National Enquirer.) Don't watch this late at night or your dreams will punish you for viewing this.."}, {"id": 66, "text": "Story of a young girl who newly arrived at LA and take an apartment to live, but surrounding residents are strange and after happening something erratic she has to give a torture session to became one of them and there and no escape way ever then. Story plot is good and feeling realistic Movie also is okay to watch once , however it should have been better with more thrills. Acting by leading lady is well. Climax is good and end is possible for sequel. Watch for a realistic thrilling horror."}, {"id": 67, "text": "First 39 minutes where really good. Some mystery, not sure where the story is going. Then, cliche, cliche, cliche, cliche for horror movies. With about five 5 minutes left, there was hope for an original ending. Nope cliche. The acting is pretty good and dialog is decent. But after minute 39, if you've ever watched a horror movie, you know exactly what is going to happen. But, if you are okay with that, it is entertaining."}, {"id": 68, "text": "I think this movie was a very good quality movie. It was intense and thrilling in all the right places and I think it will stick with me for a while. I wasn't a huge fan of the ending but I'll leave it at that so there's no spoilers."}, {"id": 69, "text": "Nothing to really look forward to. If you're really bored and have nothing else to watch--- I guess this film is doable. Just don't expect much from it."}, {"id": 70, "text": "This film is rated 15. No 15 year old of mine will be watching this. Far to scary and fear inducing. The worst of coercion and mental manipulation. It should be an 18. Good film though. I enjoyed it. Please don't let your teenagers see it."}, {"id": 71, "text": "What a surprise, I went in this movie with certain expectations that they were not met and I'm glad. I like all talent involved in this movie, as well the storyline that kept me on the edge of my seat! Religious folks would hate this movie because it triggers a certain cultish behaviour in their unconscious minds! The ending is great and I loved it."}, {"id": 72, "text": "Obviously low budget, but they did a good job with what they had. As long as you don't expect amazing effects or camera work, it's quite a nice flick. Nice acting from all of them, especially the main actress (who also resembles Natalie Dorman in some scenes). It doesn't drag out, so there really isn't any pointless scene,but there are scenes that will make you go WTF (in a good way). No use of excessive/unnecessary violence just for the sake of action. I quite enjoyed the ending.Overall a nice flick that pretty much deliveres what it sets up in the beginning."}, {"id": 73, "text": "If your idea of a good time is watching a bunch of people torture a young girl then here you go. As for me this movie sucks bad. From killing animals to torturing people. Will never ever recommend this movie. And I'm a horror fan. I'm out of here. 0 stars and I'm not kidding."}, {"id": 74, "text": "This movie is empty. Not enough substance. I wish I would've passed."}, {"id": 75, "text": "The Truth I did not enjoy the movie. I felt it was repetitive and the ending was ridiculous or shocking! I don't give it 4 out of 10 just for beauty of the actress😂"}, {"id": 76, "text": "1BR or I imagine is an acronym for One Bedroom to Rent is a character driven film. The female lead, Sarah rents out a room in a complex for her job. There is a sense that something is a bit off with the residents there.Sarah indulges in prescription drugs and alcohol to cope with past events that are slowly revealed throughout the film. She has a distant &amp; strained relationship with her dad.During the nights, strange occurrences happen in her flat. Messages are left in her room whilst she sleeps, in a passive aggressive tone, warning her against her behaviour &amp; it accumulates in her discovering an intruder in her apartment, she does her utmost to fight this person off. She manages to escape and into the arms of one of the residents for help. She sought refuge from the female resident but soon discover not everything is as it seems...Sarah wakes up in a blank room &amp; instructed to arch over and hold out her hands on the wall until the light from bulbs are turned off... She is subjected to both physical and mental torture until she conforms to the new rules/ their accepted lifestyle. The leader informed her that all the residents have all been tortured in this way until they subscribed to the new way of thinking/ indoctrination of the community (cult). He points to one of the residents that has a missing eye as a consequence of non compliance, as a warning to her.The rest of the film is a cat and mouse game between the protagonist &amp; antogonists. I found it quite gripping and was rooting for Sarah (Nicole Bryson Bloom) She does an awesome job of showing the character's vulnerability, resilience &amp; fight for her life. The ending leaves room for a sequel."}, {"id": 77, "text": "I watched this because of the good reviews and now I am dissapointed. The movie has its ups but mostly downs. I can't understand people giving this 9's and 10's. It's an X-file. First, the story is quite interesting about 30 minutes, then it sinks by itself. There are a lot of plot holes and weird situations. These make this film unbelievable and cheap. Second, acting looks amateurish from most of the cast. Nothing credible or remarkable. Last, story closure is pretty weak, as the script. Are you serious? So, overall better rent a house instead of a 1BR apartment."}, {"id": 78, "text": "Starts off with great potential, it's on a predictable path then scenarios get totally weird and unrealistic! The character even forgets how to run and leave her surroundings!"}, {"id": 79, "text": "Let me preface by saying I watch a lot of dumb D- list horror movies. Some I enjoy, some I don't. I stumbled upon this one while I was browsing the interwebs on a rainy quarantined day. Saw it had some decent reviews and decided to give it a gander.I was absolutely blown away by this film. The acting? Top notch. The screenwriting? Brilliant. The direction? Visionary.Keeping this UR spoiler free, all I want to say is please watch 1BR. It's gory, it's dark, it's thought provoking. It's just a little bit bloody, but it works. Nicole Brydon Bloom is a star in the making."}, {"id": 80, "text": "I really don't understand why she decided to left a good community that provided everything for her. I wouldn't have done that."}, {"id": 81, "text": "Trust me I hate boring pretentious movies. This one is never boring."}, {"id": 82, "text": "Brainwashing sense of ideas with a twistie end..enjoyed it once the fun started.."}, {"id": 83, "text": "I love thrillers and this film caught my attention, I watched it and found it to be intriguing, interesting and thought provoking.I honestly dont understand the low reviews, yes it's another cult film but I was gripped from the beginning."}, {"id": 84, "text": "I always have a look at the feed back before watching anything, but I am no longer going to do this. It's always surprising to me to see 10 valuations alongside 1. That is just plainly ridiculous. I watched this film made on an obvious small budget and found it more entertaining then some of the big budget films. The story was good, the acting also decent, and the film kept me sufficiently intrigued to see it out. The only thing they should have done was to give it a better title."}, {"id": 85, "text": "Let me say, I'm not connected to this film in anyway whatsoever. Just watched it for the hell of it, not expecting too much, just to be entertained and boy, was I! I was astonished at how it kept me riveted from start to finish. In addition to just being a seriously creepy and fascinating movie, it has thoughtful layers that leave you thinking about it when it's over. Well done, filmmakers! And a special round of applause for this leading lady. I've never seen her before but damn, she just carried a movie beautifully. Bravo! I want to add this...I've been in the movie business for a loooong time. It saddens me to see people disrespect filmmakers work as they do all the time now. So many people put an enormous amount of time and skill and love into this project and then some jackass just throws a sad 1 star on it and spits on it like it's nothing. I wish people who do that would try to go out there and put together a movie like this themselves....and then get the same disrespect they've shown. Everyone's allowed to their opinion, but being rude just because you can be is truly despicable. Again, bravo filmmakers! Well done!!!!"}, {"id": 86, "text": "Too bad. I really wanted to like this film. The idea of psychological mind control and its brutal outcome has been a topic I've been interested in for some time. 1BR falls fairly squarely into that category, so it was worth a gander. What eventually doomed its presentation was the extremely poor acting, not by everyone, but mainly the lead actress. She has NO acting chops to speak of. None, zero, zip. Of course, the director is also a poor craftsman because he doesn't extract the necessary fear and angst her character should've portrayed. In stronger hands, I thin 1BR has possibilities. Not in this outing, though."}, {"id": 87, "text": "Very suspenseful movie; well written, produced &amp; acted. I am typically not a fan of horror but was pleasantly surprised by this film, which is more of a psychological thriller. Well worth the rental on Amazon!"}, {"id": 88, "text": "There is not much more to be said. Just watch it. It's clever. Every time you think you know what is coming, it surprises you. Even to the end, everything is logic and coherent. Come on give yourself up, stop being so selfish. The community is the person, you're but tiny part of it. As long as you are useful. Lol"}, {"id": 89, "text": "Been waiting a long time for this film to be released and it definitely did not disappoint. A movie with plot twists at every turn really keeps you on your toes."}, {"id": 90, "text": "This movie had such a unique take on the cult genre and I loved every bit of it. Way more than I would have expected. What I loved most was how drawn in I was to the entire thing. Action kicks in fairly quickly which was nice to have and helped keep it interesting. No drawn out storyline with disappointing action with this one. There isn't much to the backstory, but it was enough to make a decent story that went smoothly. I was pretty drawn into it almost the entire time. Couple of surprises and lots of suspense. There were also tons of creepy parts too. This was just an overall great thriller movie!"}, {"id": 91, "text": "Being a college kid in Los Angeles, this movie really hit home. I'm not going to give anything away, but it will make you think a lot differently when looking for a new place to live. A must watch!!!"}, {"id": 92, "text": "Cult like horror movie- suspenseful at every turn and wonderfully cast. I loved it so much, great thriller with lots of twists and turns that you don't expect.edge of seat!"}, {"id": 93, "text": "It's not what something good happen always when you move out to stay alone .. Creepy, intriguing and intense to find out what gonna happen.. Thrilling and suspenseful .. I'm never gonna stay and end up like this if I has chance."}, {"id": 94, "text": "I've heard about this flick through a group of friends, so I rented it through Amazon. I was impressed, especially with the casting (the lead role in particular), soundtrack, and production quality. The movie takes a number of twists and turns, and is not for the squeamish. I'd recommend it to anyone who likes a good horror/thriller."}, {"id": 95, "text": "IBR is an unsettling and compelling film that builds in mystery and suspense until its powerful ending. One of the best acted films in the genre. Reminded me of Polanski's Rosemary's Baby in its mystery. A great escape film during these surreal times."}, {"id": 96, "text": "This could have been a decent movie, but it was a total waste of my time.A young woman with some family baggage moves to L.A. She gets an apartment in a complex in which everyone is a member of a cult. I couldn't understand why she moved there in the first place, and then once she did, she went through a few weird and upsetting events-making me wonder why she wouldn't just break her lease anyway (they were pretty unbearable things). I try to imagine that she is just young and naïve, so okay. But then once the other things start it's hard to bear. It's basically a lot of ridiculousness and I don't want to spoil the whole movie.If you're able to suspend your better judgement and also like psychological thrillers, and don't mind flashing/bright lights then maybe give it a try. The main character is portrayed well by the actress, she was perfect for the role and her acting was great-the one redeeming feature of this movie."}, {"id": 97, "text": "This film ranks with the most immature and embarrassing efforts of all time. Poorly conceived plot and rank amateurs involved at every level. Shameful to the horror genre. It should and likely will ruin every actor involved. They should all switch professions now. Good luck to you. Hope you can put this behind you and move on."}, {"id": 98, "text": "Wow! What an emotional journey, we were reeling and screaming just as the main character was. What she felt, we felt. My gf and I were pretty taken with this film, we can't stop talking about the ending!"}, {"id": 99, "text": "The protagonist is an empty character with nothing to offer. She is basically a ghost the entire time and in the last 10 minutes she does something different. There's no suspense, nothing. Actually there's not even a story here. It could be a short movie and be told in 10 minutes, it would be better btw. If you love your life and appreciate your time, don't waste it ;)"}, {"id": 100, "text": "The heroine's father has cheated on her, and she is very angry with him. So she ran away from home and lived in an apartment. Unexpectedly, this apartment is a black shop, and the heroine is mistreated by the devil. After the heroine was hurt, she quickly mastered the wealth code. From then on, my love for the apartment has become a saying that the heroine often talks about. The father of the heroine comes to the apartment to see the heroine. The great demon threatens to kill the father of the heroine. Although the heroine forgives her father, she has to take him away in order to save his life. Then the heroine's colleagues also lived in. The co-worker would rather die than surrender. The heroine feels that the co-worker has been brainwashed. At the age of 38, I still have unrealistic star dreams. But the female colleague is not willing to give in, and the heroine says that you are just hard spoken. Soon the female colleague enraged the demon king, and he decided to kill the disobedient woman. The heroine couldn't bear to see her colleague killed, so the heroine killed the devil. But no sooner had they run than their female colleagues were shot dead. Well, the devil just pretended to die. The heroine was angry and stabbed the devil several times before he really died. The heroine picked up the big devil's gun and killed several blocked tenants. With the help of her husband, she really escaped. But my husband was killed by the tenants. It's an open ending, in case there's a sequel. After reading this story, we understand that a kind of violence can only succumb to a stronger violence. To deal with hooligans, they can't understand only by reason. Only by using the language they understand can they be useful."}, {"id": 101, "text": "Very Strange film, very creepy and disturbing. However, the acting is 10/10. Kept me interested from the start till the end. Very physiological film."}, {"id": 102, "text": "Spooky and disturbing movie about society, privacy and freedom of choice. If you vote below 6, I suppose your parents are still paying your bills."}, {"id": 103, "text": "Right from the get go 1BR had me captivated! Nicole Brydon Bloom was excellent in this thriller/ horror movie.She made this very believeable and bizarre."}, {"id": 104, "text": "The film starts matching the title, a woman goes to check out a 1 bedroom apartment in this co-operative looking/style of housing. Weird things start happening and soon the story takes a rapid turn.The movie is fast paced and plays with your psyche, making you question how far the lead actress is willing to go.The movie fulfills it's job of a thriller movie and does a bit more by having the audience question how far are they willing to go to survive. Some of the plotline is lacking and has potholes - like where did her Dad go after he stormed off? Definitely 1BR could set up for a sequel based on how it ended. Or just take the ending as is. Up to you."}, {"id": 105, "text": "It held my attention from beginning to end. Very interesting storyline. To me the movie was hghly metaphorical of the way corporate conglomerates manipulate and own people. Even when we think we are free, we are still owned and controlled without even knowing it, with our every move tracked online in order to sell us on various products. We will obey and we will like it. After all, it's for our own good."}, {"id": 106, "text": "I think this movie is an amazing and original look at cults. I didn't expect to like this movie but I honestly loved it. It just got crazier and more bizarre the more it went on."}, {"id": 107, "text": "Absolutely loved it from the beginning to the end. If you're looking for something different, then this is it. It grips you from beginning to end."}, {"id": 108, "text": "This is an underrated film, but I don't want to overhype it. The less you know about it, the better. Don't watch the trailer or read reviews. Watch it blind. You'll thank me by the movie's end."}, {"id": 109, "text": "I thought it was a poorly done statement of cultism. But it surpassed that by plenty. All of it was disturbing."}, {"id": 110, "text": "Loved it! Great suspense, it delivers the horror, but in a stark and uncomfortable way that's quite different to most genre films. It gets you with the on-screen and psychological horror. Great performances by the cast too. Well worth watching!"}, {"id": 111, "text": "Gives you unsettling anxiety the whole film about whats happening and why- with an ending that still makes you feel unsettled even after finishing, which shows its a good movie"}, {"id": 112, "text": "This was pretty good. The only thing I didn't like was the title. They should have given it a better movie title. It's a social commentary film about the times we live in told as a horror film. The horror films I most enjoy are the films that send social commentaries instead of just mindless jump scares. I think older socially conscious minded adults will like this film. But expect the gen-z'er say, Waahh, its boring! {eyeroll}"}, {"id": 113, "text": "No resolutionWith that being said, I really enjoyed this film. The concept was unique, albeit campy. It's exciting to still be surprised by unique storylines."}, {"id": 114, "text": "I watched this movie based on all of the hype I've seen about it lately. I should have known better. I even asked myself How can a movie about an apartment be 'so frightening i would be afraid to move into an apartment'? ANswer: it cant. I recommend watching the first 1 0 minutes then fast forward to the last 5 minutes. You won't miss anything ... Trust me. Nothing of value happens in between."}, {"id": 115, "text": "This movie every 30 minutes changes direction and tone. This movie wishes it was movie it was trying to be in the last 10 mins. If you want a good thriller watch The Platform. Poorly acted and written overall. I can assure you its not worth the hour and a half."}, {"id": 116, "text": "So to summarize the movie this a like a cult where they condition you to behave good? and everyone is so use to it they don't want to leave. I was so annoyed sarah had to wait for her co worker to come and persuade her to fight and escape before she finally decide to on her own."}, {"id": 117, "text": "1BR is a good time pass movie with zero logic. It kept me interested the whole time and not boring even for a single minute. You will not be disappointed if you are a thriller fan. 7/10 is my rating."}, {"id": 118, "text": "The end is terrible. nonsense. trying for a twist? more like a fart. the middle is emotionally irrational the beginning is trying to set up something that never fully pays offa disappointing watch."}, {"id": 119, "text": "This film start with a bunch of people doing daily chores in a apartment, and a woman Sarah move into the apartment scene! As turnout, this film is about Sarah need to choose to comply with a community with sinister plan, or fight for it! She eventually choose to fight with the community and leave the apartment! Entire film full of boring conversation, and annoying overuse scene! Such as, overuse of the annoying song playing in the torturing room scene, overuse of the watching surveillance video footage scene, overuse of the close-up scene, and overuse of the blackout scene! Make the film unwatchable! Barely intense scene is, Sarah constantly stabbing Jerry on the floor! At the end, Lester sacrifice himself to help Sarah escape from the apartment! Sarah watching the siren and run away from the street! That's it! Another disappointed film!"}, {"id": 120, "text": "This movie could have been better than it was. Think of Midsommer movie but this is much worse. It had that nice cult vibe to it but never delivered. It wasn't scary or intense. Zero thriller or suspense. It was just boring and slow.30 mins in you see the plot and the rest of the movie is just how they brainwash this girl. Zero action scenes, besides the cat getting baked alive (which was awful). Anyway, very dull movie? Don't waste your time."}, {"id": 121, "text": "I was excited about this movie until I watched it. It's a new age cult movie and that's all it is. Nothing new or exciting"}, {"id": 122, "text": "Once a story starts torturing, or brutally killing, animals I'm out. Cooking a cat by setting them on fire in an oven is something no one ever needs to see, so the writer can piss off. On a more narrative note, from the get go this movie follows so many horror tropes and is filled with bad writing. I genuinely didn't haven't any expectations for this film, but come on. It's not they didn't even try to be original. Don't waste your time."}, {"id": 123, "text": "Oh my time I cannot ever get back! Ending was irritating, well whole thing so don't even waste your time"}, {"id": 124, "text": "A lady caught into the apartment by her apartment people...then They start to torture her to live with their community..but she teies to escape from there.. If u watch without any expection then i can complete this movie.."}, {"id": 125, "text": "This movie is dumb and boring... I fed up with psychological horror movies, that support themselves in human emotion... If you are like me, a very indifferent person, that doesn't feel empathy, you will find it very hard to enjoy the movie... It's very predictable, bland... It's not a movie that I would recommend."}, {"id": 126, "text": "OK it's not a 10 but it's a very good cult movie, if this is your cup of tea go for it don't hesitateIf you're looking for horror or you're not into cult movies then you might not like it"}, {"id": 127, "text": "Just another movie where the Black girl character is disposable, just there so she can eventually die so the white girl can learn some kind of life lesson. But what that lesson is isn't so clear. Be yourself, I guess? Just another boring script from a white dude without an imagination."}, {"id": 128, "text": "A Get Out spin off. It reminded me of that. Ending was horrible"}, {"id": 129, "text": "Why does Netflix have these kinds of B - C movies? This is awful. The story, the acting, ugh! This is a waste of time."}, {"id": 130, "text": "The movie is pretty predictable by the opening credit itself, I would recommend to watch martyr instead, since this movie is pretty much the watered down version of it with a different plot."}, {"id": 131, "text": "You know where the movie will go pretty much from the start, which isnt necessarilly bad. Its quite similar to an episode of the x-files in which theyre blending in in a perfect comunity but this is a boring, tedious version of that. I liked Lester, he was ok. The rest was a mess."}, {"id": 132, "text": "Crap Acting, Just Cheap Shock Value Pretty awful film,"}, {"id": 133, "text": "Past the first five minutes, it was almost ridiculous. I'm shocked that it got any reviews over four stars. Love the reviewer that said, The performances some describe as flat, but I would call understated . Call them whatever but they were not good. There was not a single character developed enough to care about, nor any performance that could save this understated script."}, {"id": 134, "text": "It was flat. The acting seemed forced in a few scenes. Looked like it was going to be more for sure."}, {"id": 135, "text": "I held off watching this because the plot didn't seem very interesting. I can say this was one of the most disturbing movies I've seen that involve brainwashing, cults, mind control, and deeper beneath that surface, political fascism. I akin this to ClosetLand, another brainwashing, control, and hyper-fascist film that I feel is even more disturbing given its parallels to our current society. JIC you aren't aware.... fascism = dictatorship and lack of freedom (seems to have a wildly different connotation these days). Do yourself a favor and watch this film. And ClosetLand if you can stomach it."}, {"id": 136, "text": "Excellent movie with a profound message. It is in our face for those of us in the know. Anybody with in depth knowledge of the New World Order Plans, will find this movie chilling. Movies tell you the truth, the mainstream news tells you lies. Anybody not Familiar with the NWO better start getting familiar with it. because it is sure familiar with all of us. NWO themes in the movie : Scientific Social Engineering, Community above self, everybody in the community marked, when you have nothing left to offer the community you are put to death. Real NWO Plans- Global Community, marked with Something showing you belong to this community...probably something like the Quantum dot tattoo that is already patented. Re-education (Fema) camps for you learning your place in the new system, or be executed, hence the population reduction down to 500 million globally. No poverty...meaning Unitef Nations sustainabie development. 2 class system . Ruling class,, and surfs. All global (surf) citizens will have the bare minimum for survival. Shelter in a smart (green) city, and food just above starvation level. Ruling class will have all the amenities we take for granted now. Complete Survellience, and complete control over every aspect of your life. Global Cult. Welcome to the NWO."}, {"id": 137, "text": "No creativity in this one. Predictable. Regret wasting my time."}, {"id": 138, "text": "It's a very good movie. I can't understand the negative reviews ! In fact we see a warning story of our days and what the humanity could become in the near future."}, {"id": 139, "text": "Sarah (Nicole Brydon Bloom ) leaves home for LA to be a costume designer which doesn't happen. She is off her meds. She manages to rent a 1BR apartment where she violates the lease with a pet. There is a cute guy there who nails her as she falls victim to a cult.This is another brainwash into a cult film. Nice community but I own 3 catsGuide: F-word. No sex or nudity"}, {"id": 140, "text": "So a girl has moved to LA, looking to START A NEW LIFE.....working as a TEMP, and looking for an apartment.Upon moving in, she finds herself being woken up by 'plumbing' noises at night. Her old lady neighbor is a bit of a loon. Her cat is acting strangely. She gets a nasty note shoved under her door, reminding her no pets are allowed ...by the rules of the complex.-1 Star for neighbor just happening to pop out the door of his PARTY, when girl walks by.....sillyLOL, when she wakes up in the middle of the night to find her cat smoldering in the OVEN and the cute neighbor in her apartment tying her up and trying to drug her, she makes her escape!! Only to find that all the 'neighbors' in the building seem to be in on it. They all corral her and keep her from escaping. She wakes up to find herself boarded up in a room.Apparently this is part of their indoctrination program to acclimate her to the community!!! And boy when they NAIL her hands to the wall in this prison room, you can really tell she's starting to feel the sense OF COMMUNITY!!!-1 sTAR for how she still seems able to use her hands , after being NAILED to the wall and pulled out of the wallSELFLESSNESS, OPENNESS, ACCEPTANCE, AND SECURITY..... THESE ARE THE 4 CHARACTERISTICS OF PERFECT SOCIETY!!!!+1 STAR FOR THAT.. IT REALLY IS PERFECT!!!!JUST CALL ME ANGEL, OF THE MORNING BABY!!!!!! Oh I cried when she got branded as an official member of the COMMUNITY!!!! SMART AND KIND LIKE MY JESSIE, LESTER SAYS!!!!AND SHE IS OBVIOUSLY SO HAPPY TO BE PAIRED UP WITH LESTER!!!hAHA , well when they bring in Sarah's friend and try to 'recruit' her , things turn out bad for the community!!! Sarah goes berzerk and starts killing folks!!!+1 Star for Sarah finally standing her ground!!!and LESTER, LESTER HELPS HER!!! NEVER LET IT BE SAID THAT THERE CAN'T BE A GOOD GUY NAMED LESTER!!!Oh and the ending was pretty CHOICE!!! EVERYONE NEEDS A GOOD COMMUNITY!!!+1 STAR FOR THE ENDING....6/10"}, {"id": 141, "text": "Another boring retarded Hollywood movie. I was just about to turn it off, I was hoping for a revenge turnaround. I should've turned it off. What a crappy ending"}, {"id": 142, "text": "Not much to say here. If you watch the first 8 minutes you can see where the director is leading the audience and make a few guesses as to how it ends. And if you make it to the ending you'll be just confirming your initial guesses. No real interesting parts, paint by numbers movie."}, {"id": 143, "text": "Would've chosen a zero out of ten but it wasn't an option. This was the dumbest movie I've ever watched. I'd rather watch paint dry."}, {"id": 144, "text": "I know not to expect too much from a low budget random pick like this was but reviews made it seem much more than it was. It was actually... pretty direct with little subtlety and little payoff, so while there are readily predictable elements there is a lack of catharsis. The pacing was decent at first but then it felt like there was a lull in the middle despite important events happening. Needed a lot more substance for me to be worth it, but it isn't a horrible way to pass time if you don't might some cliches."}, {"id": 145, "text": "I had no big expectations before watching this film, but it still was little bit underwhelming. The twists are predictable: she brings the cat with her, that will cause certainly problems; the nice guy is the henchman; they sacrifice the nice old lady; at the end she kills the main antagonist. The movie is also too long the story could take up an hour optimally, it is drawn out to 1 hour and 30 minutes. IF you enjoyed torture porn you will like the middle part, when the protagonist is tortured over a quite long time. The actors do a really good job but that can't save the plot and its straithforwardness."}, {"id": 146, "text": "Really stupid!!!! I watch until the halfway point and found it to be one of the dumbest films I've ever seen. What a joke!!!"}, {"id": 147, "text": "Horribly slow, dumb, makes no sense. Don't waste your time"}, {"id": 148, "text": "This movie is so predictable in all the stupid cliches about making something really easy into something complicated. Main character is so unlikable at some point of time you just want her to get killed so the nonsense is over. I don't want to get into spoilers, but pretty sure that not only the girl , also many of the others would have found multiple ways to escape, even more when things get to a point where she has the advantage... why writers have to come we writing the most stupid scenes for characters like her.And the end... oh boy, how I hate that ending. Yet another movie that leaves everything to your imagination... that is really getting me tired, it is not cool anymore."}, {"id": 149, "text": "I'm only giving the film three stars since it's premise was creative and original. It had potential to be great. However, as a thriller/psychological thriller fan I was extremely disappointed and bored. While the movie does get straight to the point fairly quickly, it leaves a lot to be desired about the main character's backstory. We're given a brief overview of the issues between she and her father which makes it difficult to empathize with her, root for her to succeed in escaping or even care at all. There is no real plot twist, it's two steps past predictable and the ending was completely terrible (not for lack of a better term - it was literally just plain terrible). I watched until the end just hoping the ending would somehow redeem the lackluster content shown up until that point and that I hadn't suffered through the entire movie to no avail. But alas...here I am. It's your life -- but trust me, you won't be missing anything by completely skipping this film entirely."}, {"id": 150, "text": "08/28/2020 Mediocre , NEVER scary, girl held captive 3-4 star movie. Actors were OK, the premise of the storyline??? NOT so much. Watch or don't watch, I don't think it really matters? Bon Appetit'"}, {"id": 151, "text": "It seems like a very close take on Scientology. I like the acting skills, directing, and the quality overall, however, this is too close to the reality of Scientology, of which is strongly disagree."}, {"id": 152, "text": "It's just a bad movie. The premise is decent although cliche. The problem arises it how it plays out. Is it a horror? Okay at least shock her a few times before the nails. Is it a drama? Okay at least convince me before her Dad shows up randomly. In the time allotted they could have accomplished both of these things. Basically the film just leaves you feeling unsatisfied."}, {"id": 153, "text": "Ironically, the main character who goes by Sarah has been in other films that deal with affairs and the guy who plays Brian, his real name is Holes, which is Sarah's cat's name. My mind was blown when I realized Edie's character is Pippy Longstocking. WOW. This film could've been better but you know cults at weird, so it works"}, {"id": 154, "text": "As a long-time serious horror fan, I didn't find this overly scary, surprising, or shocking in any way. If you don't usually watch horror movies, this is a nice mild horror/thriller to get your feet wet, but true horror fans will be left unimpressed.There is some gore and a little torture, but if you're used to watching the likes of I Spit on Your Grave, you might just think, Is that the best they can do?It is a twist on a cult induction movie that I haven't quite seen done this way before, so I will give it credit for originality and being interesting. I would have rated it a 6 except for the pet death scene. If you don't enjoy movies where animals are killed off, don't watch this one. That was enough to drop the rating to a 2 for me."}, {"id": 155, "text": "This movie started off so well then all of a sudden became disappointing and obvious. You'll be waiting for something good to happen, but sadly it won't."}, {"id": 156, "text": "It was ok. I'm not a big watcher of this genre. The ending left me meh... I wanted a better end to the story or a more completed one at least. IS THAT ROSEANNE BARR? As the older Lady??? Why can I not find her listed on IMDb or Netflix ? What up with that?"}, {"id": 157, "text": "Awful actings, not scary, bad story, waste of time!"}, {"id": 158, "text": "Catastrophically poor acting and a terrible screenplay. Don't waste your time on this"}, {"id": 159, "text": "If this movie set in L.A. were about how Hollywood elites force and brainwash newbies to become liberals, then I could at least give it a point for that. But it's not.These descriptors are truly useless sometimes. Drama, horror. What about thriller then? That's the primary genre here. If I had known this was just another torture porn flick or idiots I wouldn't have wasted my time with it.The movie starts off as a mystery, in the Tenant or 4th Floor vein, but quickly morphs into cheesy thriller nonsense.One of the most idiotic movies in recent years, which is quite a feat because the competition is really strong. There must be 100s of movies like this out there, probably just as dumb, but I very rarely watch torture-porn or serial-killer thrillers so every time I watch one of these stinkers by accident I declare it one of the worst movies in recent years. I can't help it. Every time I am overwhelmed by the shameless stupidity.A useful movie though, in the sense that you can use it to measure people's IQs fairly reliably: whoever rates this higher than 5 must a bit on the thick side, somewhere on the evolutionary level of an Oprah fan.Guess where that leaves me? As if you didn't already know. We non-cretins dish out zeroes to garbage. Mistaking garbage for high art or ground-breaking innovation is not what we smart people do.People who consider this to be original don't seem to understand that originality doesn't automatically equate to brilliance or intelligence. Pink Flamingos is also original. Guernica is original. Many of the worst movies ever made brim with originality - because they dare do things so stupid/absurd that nobody else with any sense would ever want to. Originality accompanied with zero logic and a lack of style is useless: it's trash. If I made a movie about aliens living in my anoos and filmed the entire movie upside-down, would that be original? Yes. Would it be garbage? Most probably.The notion that a totally idiotic cult based on absolutely nothing could possibly have more than 2-3 members let alone hundreds (or thousands? millions? the ending can be interpreted that way) is unfathomably dumb. This cult has nothing that is enticing, it has nothing to draw anyone, except extreme masochists. People who compare this to Scientology are clueless. Scientology offers the moon and the stars, it lies to its potential victims like any other cult does with blatant false advertising, but this cult offers nothing except pain, suffering, isolation and misery. Not exactly big selling points.Here's the explanation why the premise has zero basis in reality hence why the movie completely fails on every level.Any cult, as dumb/nutty as it is, can exist, even if with just 20-30 members. But those silly little cults exist on a voluntary basis - at least initially. You can only have idiots join idiotic cults on a VOLUNTARY basis. Later on they may regret it; they may get threatened, blackmailed or even killed. But that's AFTER they'd joined it of their own free will. However, forcing normal/unwilling people to accept being in a loony cult by impaling them, electrocuting them and by burning their cats in ovens - that's as dumb a plot-device and plot-twist as any in Butterfly Effect, one of the most idiotic films of all time. But dumb as it is, at least that's fantasy horse-manure. At least it has that small excuse. This crap has none; it wants to be a philosophical drama as well as dumb sadistic thriller.Forced recruitment? About as plausible as Sean Penn getting a degree in Nuclear Physics.It is asinine to entice a person to join a cult by roasting their cat. Real cults are much smarter than that, they pander to their potential victims, their whims and fantasies. That was an amazingly idiotic twist, one only a daft writer could employ.What Sarah does to the leader - i.e. kills him - would/should have happened ages ago within this impossible, ludicrous cult. Already the first person this ridiculous, super-far-fetched conversion method was used with should have used his first chance to kill and escape. At the latest by the time they tried converting the 5th person there'd be some major havoc, carnage, chaos. After all, they don't pick pushovers but choose people randomly. The fact that they chose the black woman proves this without any doubt; she was literally the least likely personality type to comply with anything, much less to agree being enslaved by a bunch of deranged clowns. Speaking of which, the ease with which every member becomes a psycho doesn't ring true at all. Brainwashing is one thing, but reprogramming people this easily is hogwash. At least in this environment, under these circumstances. These cult members are literally just meters away from freedom, all they need is to step outside and call the police. Gulags in the middle of nowhere? Medieval Dungeons? Those are entirely different situations. Though even then...Whoever wrote this tripe either has zero understanding of human nature and society, or is just happy to deliver a very idiotic thriller, cynically expecting it to gain a cult (pun) following, as many asinine thrillers/horrors do these days. There is a certain hardcore moron/lunatic fringe out there who seek out the dumbest thrillers to worship: the dumber the better, literally. I suppose, ironically, we are talking about cult-like behaviour here.When Sarah stabs the leader in the neck, he very absurdly gets up, like a typical impervious-to-injury cliche movie psycho. (Which proves that this movie is NOT an intelligent drama with a valid message about society, or whatever, but just another mindless thriller for zombies immune to illogic.) Then Sarah, as if suddenly discovering her inner Ninja, swiftly hurls a knife (or whatever) at him, hitting dead center, as if she'd been a circus-act knife-thrower for years. This kind of stuff doesn't happen in intelligent movies: this is strictly dumb thriller territory.Then, as if things couldn't possibly get any dumber, the most psychotic cult member inexplicably saves Sarah - then shoots himself! Just like that.But wait for it... Even that wasn't enough. The writer wanted to go full retahrd, which he accomplishes by suggesting that the entire city had become dominated by numerous small pockets of this awful, boring cult!At least they set this movie in L.A., which doubtlessly has the most idiotic population in the entire U.S. of A. If there is any ideal place to start an absurdly far-fetched, moronic cult, it's there.If you consider the movie good, you are... Well, you know what you are."}, {"id": 160, "text": "Recruiting people off RANDOM FaceBook profiles, yeah right. There are plenty of weak minded people on FaceBook, but randos? The hot black wouldn't even fit a cult profile."}, {"id": 161, "text": "This movie has a score of 5.8 - which in horror terms isnt bad.But that same score is held by The Wretched - which is a far, far superior recently-released horror.Go and watch that instead. I mean it.This movie was just predictable, with some pretty shoddy acting (especially from the Dad who is dissatisfied with the daughters life choices). Yawn. Not great."}, {"id": 162, "text": "Some reviewers forget the obvious questions most potential viewers have when reading IMDb reviews. Here are my answers to them:1. If you're looking for suspense versus a bloodbath with jump scares, then 1BR will give you the low-level anxiety fix you're seeking.2. It doesn't drag. The movie's 90-minute run time passes quickly, and it will competently hold your interest. It's escapist in the best sense of the word.3. Production values, plot, directing, and acting don't read as cheesy in spite of a modest budget and a lack of big-name talent. It's a great reminder that simplicity often succeeds where CGI and tens of millions of dollars do not.The performances some describe as flat are, to me, understated and depict believable reactions to depression, shock and brainwashing. One expects the depressed and those tortured into submission to be subdued, not over the top. That said, the acting is merely good, not great.Complaining about a movie being predictable is like complaining that the outcome of an election is predictable. There is a limited array of possibilities, so predicting correctly doesn't exactly make you a genius.Is it too predictable? I foresaw 1BR going two or three possible directions, all of which have been done before in one way or another. It did, indeed, travel one of the those paths. That said, in spite of an expected general outcome, the ending does offer an unexpected twist that's fair and supported by the plot.For those always seeking a higher message, there's one to be had, and this sets 1BR apart from other run of mill low-budget thrillers. The filmmakers don't beat the social commentary drum too hard -- it's chancy with a movie like this -- but 1BR does say a little something about the tyrannies of paternalism, forced conformity, and ideology by threat, phenomena we're seeing a little too much of in society these days.As with any movie, the fun isn't always in the destination. Rather, it's often in the path you take to get there. That's true for most films, and it's true for 1BR. But no one can force you to watch it. At least not yet."}, {"id": 163, "text": "In an age where movies seem to bang audiences over the head with their storylines and action from the outset, 1BR reminds us that a well told and properly structured film can land a far more powerful punch. IBR is about a young woman who finds herself trapped in an LA apartment complex by a cult, unique in design and complexity. That's about as much synopsis as I'll give as I would not want to give spoilers. 1BR is a modern horror story of cults, paranoia and torture. As horror films go, it's nicely paced going in all the right ways (at first). The small doses of violence and gore are carefully, even artfully placed. Nothing is done purely to shock. The pieces fit well together and the performances work. The director as worked hard with the cast to create highly believable performances that sell the premise and make it believable. 1BR moves slowly, grinding suspense out in much the same way Polanski's Rosemary's Baby did, but with a modern and even more relatable angle. By the end of the movie I found myself caught up in the suspense and rooting for the lead. The audience at the LA premiere reacted strongly, especially in the 3rd act. My high rating of 9 out of 10 does make some allowances for what is obviously a smaller film without big stars, but frankly it all adds up to a viewing experience that feels more genuine than what we often see from larger productions. Check it out, give it a chance to work its way into your psyche and I think you'll have a good time!"}, {"id": 164, "text": "It is another creepy cult movie. A decently done yet still generic film that you shouldn't spend too much time looking for. The film starts off with Sarah trying to create a new start in LA. Unfortunately, this new start is brought to her by the creepy cult that owns the 1-bedroom apartment that is about to be the cause of the drama in this movie. Let me say that this movie does a poor job at creating the suspense needed to set the tone that it wishes to achieve. Most plot points are loudly telegraphed through random long shots. When she spends her first night in the complex, the camera pans away from Sara and stops on the units blinking fire alarm. This is obviously a hidden camera set up to watch her and it will most definitely come up later. I do not have a problem with symbolism, but it is ridiculous how much symbolism this film will try to throw at the audience. It is as if the director doesn't have faith that the audience can come to their own conclusions so the film will constantly hand hold, taking away any creepy tone it was asking for. Movies of a similar genre are successful because of the suspicion. Take the original Stepford Wives film, although flawed, it presents the audience with this suburban utopia, but it also gives the audience bits and pieces of flaws in society that suggest something nefarious is afoot. You have the women malfunctioning, you have strong independent women suddenly becoming subservient, and you along with the character feel that there is something wrong with the town. In 1BR, you never really get that feeling because you know from the start what is wrong so there is no point in watching the rest. This movie is incredibly generic. It doesn't take long for the tenants to take Sarah to try to reprogram her to see the truth. A truth written by some dead guy about the importance of community. It is through these generic tenants that the cult is created and then you just watch her do a whole lot of nothing. The torture is simple and as hard as it tries to emulate other movies that do it, they do it very poorly. Brain washing consists of her stating in an uncomfortable position for hours only being fed once a day with a nasty looking milkshake. The film suggests that hours of standing in this isolated room in the apartment that she rented, hunger, and finally the nails that go through her hands (possibly Christ-like) are enough to brain washing her into joining this society. The brainwashing obviously doesn't work and at this point you are halfway through the movie with little hope of it getting better. It zooms past all the tropes presented in far better movies in order to stay within the genre, for example the idea that man is corrupt and selfish and through this new cult, all of man's problems will be solved. They also do a whole scene where they kill their oldest member because she is no longer of use. Even the big escape and the twist are anti-climactic. There isn't really any saving grace to this film. I wouldn't waste my time watching this movie unless it was free. Even then, there are far better movies in this genre you could be watching. This was a pretty meh attempt at brining the genre to an urban setting."}, {"id": 165, "text": "This was a kinda good, albeit kind of predictable thriller about an apartment complex that's actually a cult.It held my attention. The lead actress was pretty good. She had to make it believable that she had enough backbone to go through all of that and then stage an escape. She succeeded in this largely during the torture scenes. You could see the resolve. She came off as a real person and not a damsel in distress, nor a superwoman.The story was not incredibly original. It's sort of Rosemary's Baby without the baby or the Hail Satan nonsense meets the Stepford Wives.I'm giving it a 6. There's some good acting, and strong production value for a low budget film. Solid pacing and direction keep things moving enough that you can tolerate the unoriginal and wildly implausible plot."}, {"id": 166, "text": "This was another film that I had no idea what it is about and came in pretty blind to check it out at the Nightmares Film Festival. I did actually watch it with one of the actors in attendance, Clayton Hoff, who gave some interesting insight into this one after it ended. This was actually the Midwest premiere of it as well. The synopsis I have is after leaving behind a painful past to follow her dreams, Sarah (Nicole Brydon Bloom) scores the perfect Hollywood apartment. Something isn't quite right when she can't sleep and is receiving threatening notes.We start getting a tour of a courtyard in an apartment complex. Everyone there seems to be quite happy. It then follows Sarah. She is working a temp job where she befriends a coworker sitting behind her, Lisa (Celeste Sully). Sarah is quite timid and can't say no. She is staying a motel and is trying to find permanent residence.This brings her to an open house where she meets Brian (Giles Matthey). He is a good looking guy who lives here and he hits it off with Sarah. She then goes to the apartment and meets the manager of the property, Jerry (Taylor Nichols). She fills out an application and we get an interesting interaction as she didn't answer all of the questions to the full truth.She still gets the new apartment and moves things in. There's a real sense of community and Brian helps to introduce her to the others. There's Janice (Naomi Grossman) who's the wife to Jerry. There's also Lester (Hoff), Ester (Earnestine Phillips) and Miss Stanhope (Susan Davis) to just name a few. The problem though is that she lied. She has a cat and isn't supposed to have pets. On top of that, we learn there was fallout between her and her father, Gus (Alan Blumenfeld). He wants her to come home, but she can't forgive him and wants to start a new life her way.The problem is that this dream place, might actually be a nightmare. It starts that she can't sleep with the weird noises and then threatening notes about not following the rules of the lease. What is really going on in this apartment complex?Now if you've read other reviews I've done, you know that my ideal way to go into a movie is to not really know anything and just experience what it is trying to tell me. That's what I did with this one and ended up really digging the vibe that this one had. There are actually some really scary concepts here that this one explores.The first is that Sarah is here in Hollywood to try to make it as a costume designer. The problem is that she is from the east coast, so she doesn't have anyone there as support. She also comes off a bit naïve and is struggling to stand up for herself. These are all bad things to have though when you're trying to make a new life across the country like she and you're looking for friends/community.There's also a really creepy vibe about this apartment complex. I think that the movie does a really good job in establishing that this place seems to be perfect and that there could be something up with some of the residents. The obvious one is Lester. Sarah thinks he's creepy, but Miss Stanhope sets the record straight and actually makes Sarah feel bad in the process.I don't really want to spoil this film, especially since the Internet Movie Database doesn't have a synopsis yet and I think that this should be experienced. There are some things that are revealed about this community. It really starts with a book that Lester tries to get to her and the more you learn the crazier things get. It also has an aspect that really fascinates as well as scares me, which at the end is even more terrifying when you see how far this really goes.From here I want to shift to covering the pacing of this one. It comes in at 90 minutes and I think that's a good length. I like the opening images we get, establishing things before it gets turned on its ear. The problem though is there's a section in the second act that I did find myself just a bit bored. I think that it really hard to make what is happening exciting, as it is pretty traumatic. I just don't buy that they think there's been a change come over her that quickly to trust her like they do. The ending though was on point and I love the implications there for sure. It actually reminds me of a film from a couple years ago, but I don't want to spoil the ending for either.As for the acting, I thought that it was pretty solid. Bloom is a good lead. She really gets across the naivety that the role needed. We also get to see her grow as bad things happen to her. The only issue I have there is that I don't know if she conveys enough for her to be given some of the positions that she is that early. Nichols, Matthey and the rest of the community members really establish one side of them until it reveals the truth, which I definitely thought worked. Blumenfeld adds an interesting dynamic here and helping Sarah grow. I'd say the rest of the cast also round this out for what was needed.Something that I noticed about this one is that there's not a lot in the way of effects. It isn't necessarily a film that needs it though either. We do get some practical effects on some of the things, like when a character is tortured. There's another scene where someone gets shot that also looked pretty real to me. I think that they definitely did well for when they needed them and it was also shot very well, so that's plus.The last thing to cover would be the sound design. The soundtrack didn't really stand out to me, but it did fit for what was needed. What I really want to talk about is the noises that Sarah is hearing at night. I loved what it turns out to be, but we get a few nights of seeing this and knowing that she's kind of losing it. This in turn makes sense when we learn what is happening.Now with that said, I really ended up enjoying this one. It definitely has a concept that really creeps me out, but I love how they brought this subtly to the urban setting. I really like how they constructed Sarah's character and we really get to know her as well as she her grow. I do think there's a section that was a bit boring, but I see why it is required. The acting I thought was pretty solid across the board. There's not a lot in the way of effects, but we do get what was needed. The sound design is really creepy and helping with tension while the soundtrack fit for what was needed. I thought this was a good movie and would actually recommend this to genre and non-genre fans alike. It really has a socially relevant commentary which if you know me, I'm a big fan of."}, {"id": 167, "text": "1BR is probably the closest to a pure Horror film that I've seen in some time. Let me qualify that. If you want to be scared by a ghost or monster out of fantasyland or want a time-wasting slasher with a few jump scares, this isn't for you. If you can't tolerate sadistic stuff and are particularly squeamish around body horror, I'd pass as well. I found myself looking away more than once.I think 1 BR is a very significant film for the horror genre because it doesn't hold back anything in the way of manmade evil. It's closer to Invasion of the Body Snatchers and Night of the Living Dead than Get Out or Us, for example (both good films but not in this league at all). It's suspenseful, beyond creepy, and genuinely anxiety inducing in ways the supernatural or paranoid fantasies just can't touch. It's one of those films that I'm glad to have purchased but if someone were to ask me when I'd watch it again... I can't say I'm ready for that commitment quite yet. Many great films aren't a joyride every minute to sit through. All the truth-telling can hurt after a while.Watching the trailer I was skeptical of Nicole Brydon Bloom's ability to carry off the lead in this movie, but she is well-cast and has a sort of muted intensity close to Olivia Hussey's performance in Black Christmas (1974). The rest of the cast is solid, especially Taylor Nichols who is a long way from playing the endearing nebbish in Whit Stillman's early films/We follow Bloom's character as she arrives on-the-run from a bad previous life with a philandering dominating father and dead mother. She stumbles into an apartment complex whose tenants seem a bit too content for their own good, then shortly (very shortly, this film pulls no punches) things go way off the charts, and we're not talking about walls that drip blood or discovering Jeff Dahmer's your next door neighbor. No, this is a real life nightmare and there's no Freddy to save you from it.What's odd is that I wouldn't call this film original. 1BR borrows heavily from previously made horror movies and novels, and though it charts familiar territory, it does it with such tremendous earnestness that it's tough to quibble with. If anything, it's flaw might be that it's a bit too perfect script-wise. It's signature song is a nice nod to Danny Boyle's 1994 classic debut Shallow Grave, and shares that film's pitch soot sensibility.As with any extreme work of art, 1BR will polarize people. But if nothing else, 1BR is going to be a stellar calling card for writer/director David Marmor. He definitely understands the genre and what the hardcore fans want, and he isn't hanging onto paranoid totems and crutches to make his point.No, pure fear of each other works just fine in this case."}, {"id": 168, "text": "When you are on your own you are easy to spot in the crowd and an easy victim for a cult. And that's exactly what happens in this flick. Filed as a horror I must say i didn't had that much of horror in it.But what makes it worth watching is the fact that you keep watching until the end and the end was out there before I knew it. So that's a good point.Starts off as a kind of romantic flick which turns into some captivity and then turns into a flick about a cult changing people. But there's more to be discovered.It do has suspense, a bit of violence and maybe you could be scared with some home invasion and the blood used all together makes it worth seeing. Big twist at the end. Gore 0,5/5 Nudity 0/5 Effects 2/5 Story 3/5 Comedy 0/5"}, {"id": 169, "text": "1BR doesn't take alot of effort to hide the fact that it's a character study about the inner workings of the cult of Scientology. Anyone who watches this film will immediately notice the parallels between the cultists in 1BR and Scientologists. For one thing, the main character goes out west to start a new life in the showbiz industry as a costume designer. Where does she end up in a commune that isn't all that it seems on the outside. Of course they brainwash her and put her through a horrendous re-education program that includes both physical and psychological torture. She's forced to disconnect from the suppressive people in her life........anyone that isn't a member of the cult. Sound familiar? Of course it does. There are no secrets. She has no privacy. Every moment of her life is carefully monitored and controlled. Where have we seen this before???? Even the founding father of 1BR's cult, Charles D. Ellerby, is a carbon copy of L. Ron Hubbard.While it is heavily (and I can't stress that enough) inspired by Scientology, it is a slow burn horror that relies mostly on tension and less on violence and gore, although there's some of that as well. The film meticulously takes you through the process of brain-washing and re-educating new members into the cult....sometimes to fault. It does get a little boring at times and you couldn't be blamed for playing with your phone a few times during the film. It takes a long time to get to where it needs to go, and even when the climax is reached, there's still alot left unanswered. Perhaps that again, goes back to the influence of Scientology, which still exists and still functions."}, {"id": 170, "text": "We're so glad to have you in the building.It was two months. Two months that I didn't feel the urge to write down a nuanced and honest opinion about a movie I've seen. Maybe it was a lack of motivation because of the limited feedback on my previous writings. Maybe it was because of the enthusiasm with which I threw myself into a Horror Challenge. A Challenge in which I finally watched 89 films in a period of about 7 weeks. And after these 7 weeks, I realized that I really enjoyed watching 50s and 60s horror. Coincidentally, the movie 1BR passed during this event and there were words of praise for this horror. Enthusiastically I accepted the invitation from Alok Mishra (one of the producers) to send me a link to a screener. And of course, I'll be doing something in return by writing this review. So first of all, thank you Alok for forwarding the link.Now some will claim that I'll write a positive review out of gratitude for having obtained a free link. Or because it's that time of the year where people ought to be mega-kind. However, nothing is less true. If 1BR was a complete crap movie, I would describe it like that without any problem. Before Alok suffers from a panic attack, I will immediately reassure him. 1BR is a decent film with a surprising twist. Despite the lack of too gory moments or demonic, paranormal revelations, it turned out to be a frightening film. One where you feel uncomfortable about the whole situation. However, I cannot tell much about the story itself. That would only spoil the fun. It's best that you watch this film without knowing anything, so it'll hit you without warning. What Sarah (Nicole Brydon Bloom) doesn't realize when she moves into an apartment of Asilo del Mar is that her situation will look very different real quick. Sarah is a timid young adult who wants to start a new life in L.A. far from her family. She wants to make it as a fashion designer and is determined to leave her past far behind. A lopsided relationship with her father caused her to travel to the city of angels. Something that becomes clearer later in the film.As a spectator, you don't need to wait really long before it starts to escalate. After 30 minutes, the mood changes from pleasant to downright unpleasant. There is no indication that Sarah walked into the lion's den. The other residents of the complex are helpful, hospitable, and over-friendly. To be honest, I thought that actually felt scary. I can't imagine such a community in our current narcissistic and self-centered world where everyone suffers from extreme navel-gazing. The atmosphere in this building is of a high Melrose Place level. There's even a central swimming pool, around which all residents can enjoy social gatherings and cozy barbecues. Those residents are introduced to you in slow motion at the start of the film and are a mixed bag of people. Including the retired actress Edie (Susan Davis) whose health is clearly deteriorating. The helpful, attractive neighbor Brian (Giles Matthey) for whom Sarah immediately has an attraction. And even the landlord Jerry (Taylor Nichols) does his utmost best to make Sarah feel at home in her new home.There are only a few disturbing factors, according to Sarah. First of all, the creepy Lester (Clayton Hoff). A resident who keeps an eye on her like a one-eyed pirate. Then there are the disturbing noises at night. She was told this is due to poorly maintained pipelines. And then the main fact that no pets are actually allowed in this building, which means that Sarah is forced to keep her cat Giles carefully hidden. Something that does not go unnoticed and is the beginning of a kind of psychological terror. The unknown actress Nicole Brydon Bloom delivers an excellent acting performance and is the most defining person in this film. She shows a range of emotions throughout the whole film. First enthusiasm. Then bewilderment. And after that, desperation and resignation. And in the end, the bold survival instinct emerges suddenly. Not only Bloom's acting is sublime at times. Also, the way the side characters play their split personality is simply magnificent.Once again, the fact a screener was sent to me, isn't the reason for my positive comments. Believe me, This movie managed to surprise me. It looks slick. And to be honest, I didn't know which way it would go until the last minute. The uncomfortable feeling I had is partly due to the realistic image that is being created. The feeling you have when you end up in a situation and you don't know how to rescue yourself from that terrible predicament. The only (minuscule) minus I could cite is that the denouement immediately reminded me of The Invitation. But that's such a negligible element that I can only say you should definitely check out this intriguing movie.More reviews here: movie-freak.be"}, {"id": 171, "text": "The number one key to any horror film working lies in the characters. In particular the main character. All the great horror films over the years have one thing in common - the audience loves the main character. Because without that it is impossible for us to care about their fate, at least to the extent that we should. '1BR' had a surprisingly likeable and relatable lead character played by Nicole Brydon Bloom (a relative new-comer to the industry) and that is in large part why this film works so well. I needed things to work out alright for this girl.I call it a horror film, and it certainly is in some ways, but in others it probably falls more into the psychological horror category. I would've actually liked to see the film explore this element a little more. There is only really one element used in this process and I thought it would've added a little more believability to the film if they had given it some more variety and expanded it a little. Usually horror films are desperate to reach the 90 minute mark and have to expand everything out as much as possible. In this case though it almost feels like they left a lot on the cutting room floor. I love that the film never delves into the supernatural side of things though. Early on I feared that was the route it was headed down.'1BR' is a competently put together film, with some decent acting and good pacing that ensures it never becomes dull. It's not a scary movie, but it does offer up some thought-provoking elements and the odd good surprise. I would suggest this one is worth giving a watch."}, {"id": 172, "text": "REVIEW - 1BRSelflessness Openness Acceptance SecurityWe all become consumed in our own lives, wanting material possessions, glued to our phones, selflishly putting our selves first but.....Sarah moves to an appartment block in LA where a social experiment has been undertaken for many years.Social conditioning is a proven fact, we behave differently in certain circumstances or situations and can this be changed?Can we become; Selfless Open AcceptWonderful concept that makes you ask more questions than the film answers which is what I personally love about films.Is Sarah conditioned?Admittedly many people will hate this film but I know it will appeal to others (like me).Rating 10 out of 10"}, {"id": 173, "text": "1 BR starts kind of cliched... it seems like the new to the city young woman with a naive but hopeful outlook is going to be relentlessly persecuted... and she is... it is not a spoiler to say this. Had that been the goal of the movie, they would have had to pad it out and it would have barely rated a 3 at best--but that is NOT what it is about. There is altogether more sinister story playing out... alluded to and developed quickly so the movie can go where it needs to go. I will say no more about the plot except to say that for some people the ending will make perfect sense, and for others it will leave them maybe a little dispirited.Regarding other aspects, well, there is not much to criticize. I wouldn't say it is the MOST gripping or at all times the most surprising movie you will ever see, but the story telling is well done with good use of foreshadowing and suspense, and twists are parceled out carefully enough to not give things away too early. The directing and cinematography works well, and the acting is very competent... disarmingly so. The characterization and scripting, much of which feels a bit stilted at the start, gels nicely and towards a destination as the story develops. All in all it is a movie which heads into some newer territory and does justice to the potential to be found there. I am not sure if it will be everyone's cup of tea, but I think it will more than please most who watch it. Go ahead... follow up on the advert for 1 BR. It might be the right place for you."}, {"id": 174, "text": "Although it can be quite a bit mediocre at times, notably more so for the first half of the film, the brutal but endlessly engaging 1BR manages to stir up just enough crazy to make for an uncomfortable, but decent watch. I enjoyed the performances throughout this film by the end, at first I didn't think of them as more than C-list actors who just got their first big acting job, but by the end you really feel the impact of their characters on the screen. Nicole Brydon Bloom provided the best of the performances, although it can take a bit to see her acting chops on the screen, at least until things finally begin to go down. The plot isn't entirely convincing, and you feel a sort of dread through it, not knowing exactly what will happen, but knowing what it will lead to. It can be incredibly gruesome and brutal to watch, and I feel at those moments its most impressive, but I also feel the film lost a great amount of potential somewhere throughout the whole thing. It has so many interesting concepts going for it, but instead of reaching for different heights, it just keeps being consistent on so many levels, and ultimately it makes the film just that less enjoyable. In the end though, 1BR is a harsh but interesting attempt of horror, and though it doesn't nail every mark, it does have its moments. My Rating: 7.25/10"}, {"id": 175, "text": "I watched Apartment 1BR on a whim following a glowing review in Starburst Magazine; I'm so glad I ignored the IMDB score, which is generally the best approach these days anyway as the site has become yet another platform for extreme liberals and right wingers to drag the world down with their silly little online political war.The less you know about the movie the better. Try and avoid reading too much of a synopsis before hand.In the days bloated, poorly written cinema being the norm, this stands out from the crowd as tightly directly, well written horror/thriller. The low budget has led to the writer/director focusing on what he can do with what he has so it works in favour of the movie rather than against it.This is a really tense, unpredictable ride, that kept me guessing right until the very end. It takes a short while for the viewer to settle in, probably because you've read a score of 5.8 on IMDB and fear the worst - but tiny bit of patience and an open mind will be rewarded.If like me you'd like a reminder of what a well written, talent driven movie looks like, give this a shot. I doubt you will have watched anything quite like it before."}, {"id": 176, "text": "When you think of low-budget horror films, the more successful ones are those that prioritize psychological mind tricks over in-your-face gore. In '1BR,' we get a mix of both, but nothing can escape the combination of wooden acting, paper-thin dialogue and a plot that's as interesting as a lump of coal.Putting aside the fact that no one is recognizable in this film, '1BR' is unable to overcome the challenges posed by the novice actors who grace our screen. Nicole Brydon Bloom's protagonist Sarah is a somewhat sympathetic character, but her development throughout the film is not believable. Her interaction with others on-screen comes off as pretty hollow and it's hard to watch. The lack of people to root for weighs heavily on this film.There are plenty of saw that coming moments in '1BR,' to the point where it becomes a walking cliche of many other horror films that have come before it. Although, there are some scenes that were clearly included for the purpose of shock value and nothing else.True, '1BR' can be considered different from others. But it's nowhere near as fresh or exciting as many others that have preceded it."}, {"id": 177, "text": "And, this turned out a lot better than I expected (at least compared to the overall rating). 1BR is a mostly genuine article of creepiness, anchored by That Guy Who Was In That Thing You Saw as the head of this apartment complex (an exceptional Taylor Nichols, and for me it was Boiler Room as a very different character), and it snaps into it after a first act that sets up the basics for what could have been much more rote, or an entirely different sort of horror venture. This director has a solid eye and an above average editor as far as ratcheting up tension and just drawing out dread in this way of well, this could just be a completely bleak venture and... That's what makes this work.It's like a less hippie hippie but no less Conformity-is-All take on the recent HBO documentary on NXVIUM (sic) called The Vow, with a sticky hot pile Body Snatchers (or more to the point, a far less pretentious and obnoxious High Rise). It's all based around the Typical Young White Lady In a Horror Movie (here Nicole Brydon Bloom) who has nowhere to go but into this family.For me, at first Brydon Bloom seemed bland, like as I told my wife a kind of flat-soda version of Hailie Steinfeld, but as the movie goes on and her plight becomes more dire and seemingly helpless - and, indeed, as she may be succumbing to this and doing a sort of acting-job-within-this-already-set-character (becoming this subservient host and potential broodmare) - she gains more intensity and pathos and I totally bought it. By the time she has a confrontation with her estranged father, she's come into her own completely as a real force that I want to see in other movies. It also should be mentioned the rest of the supporting cast is solid, but the stand out is the actress playing Edie.The final act is also, without revealing too much, quite a necessary and effective release and helps to mark this just barely into an exploitation flick. The last minute is one of those that can't help but bite a bit more than it can chew (what it reminded me of the most was The Invitation oddly enough), but it isn't so offensive to take away from all the potent effects that this filmmaker gets here. This is grim, largely hopeless, and all about the degradation and subjugation of human beings and, most crucially, how willing people are to give up to all that."}, {"id": 178, "text": "Admirably, the director managed to produce an entertaining film with very little resources, no on-location filming and mediocre acting talent. Although the beautiful Nicole Brydon Bloom (Sarah) does a good job, she does stumble here are there with her acting especially in the beginning of the movie, and the other actors are not any better.Storyline: A girl rents a room somewhere in LA. Do you really know who your neighbors are? Can you catch on their scheme before it's too late? Do you have any real friend of family that can help you if that situation arises? This film raises many questions and keeps you interested from start to finish, although the punchline at the end is not strong enough IMHO.It's hard for me to recommend this movie, since there are so many better flicks out there on any front, whether it's the psychology of cults, gore films, thrillers, everything was done before and much better than this movie. Overall I felt it was not worth my time and the director did not do a good enough job digging into psychology and characters and has nothing new to offer in the realm of film-making and slashers, this is why I called it 'lazy' and rank it somewhere in the middleExact score: 51 / 100"}, {"id": 179, "text": "First, I want to start by mentioning that if fictional animal cruelty is triggering for you, do not watch this film or skip 23:53-24:13.I thought the idea for this film was interesting. I always enjoy checking out different cult-related movies and was interested after I read that some events were based off of real life experiences from ex-cult members. However, this one just didn't do it for me.There's a lot of telling instead of showing, underdevelopment, and rushing through the interesting parts while lagging through the boring stuff. I didn't feel like I was shown why I should like and care for the main character. I felt like I was simply supposed to care because that's what the movie wanted. And the whole performance of the main actress was incredibly bland to me, which didn't help. I also wanted to see more of the creepiness of the apartment and other tenants before things really picked up. Same with the work friend. They had two conversations and then they're acting like close friends. None of it felt believable, which is unfortunate. Like I said, I think it's an interesting plot. But the development of the plot and the characters just wasn't enough for me."}], "reviews_amount": 180}