{"name": "Superintelligence", "titleId": "tt07178640", "reviews": [{"id": 0, "text": "This is a rom-com not a sci-fi movie. It's just a fun little romp, take it for what it's worth. I did take an entire star away for spelling Pike Place Market wrong. 😁"}, {"id": 1, "text": "It's a romantic comedy, but all in all it had a lot of funny parts throughout and my spouse and I both enjoyed it. I feel like the 4.6 rating currently is lower than it deserves for sure."}, {"id": 2, "text": "Surprised at all the bad review. Very entertaining and funny. A definite 6 out of 10."}, {"id": 3, "text": "My wife and I thought it was very cute. The superintelligent computer was less plot and more a vehicle for the romance, but did have its share of laughs. We found the jokes and the chemistry of the couple very similar to our own, which always brings a breath of realism to a movie. Well done guys!"}, {"id": 4, "text": "Despite the negative reviews I really enjoyed this charming, simple and funny movie. It is pleasant relief from the terrible year that is upon us. Just enjoy it! Some things don't need to be deep, although it makes a point that humans are their own worst enemy and we need to do more and step up!"}, {"id": 5, "text": "I like Melissa McCarthy but anytime she acts in one of her husband's films, I know I need to lower my expectations. Ben Falcone, you're ruining your wife's career!! 😡"}, {"id": 6, "text": "The beginning started to engage me but as the movie continued I realized how stall the jokes grew. It would have been nice to enjoy this movie and unfortunately this is another miss for Melissa. I recommend if you really really want to watch it, have a drink or 2."}, {"id": 7, "text": "How this can be called a comedy I will never understand. The only thing that you can laugh about is how stupid you were watching it to the end."}, {"id": 8, "text": "I think, but I'm not sure, she used to be in some funny films but this was truly painful to watch. Not one single laugh and the acting from all was stiff and pathetic. How can writers, editors, directors etc. make pathetic crap like this and think they've done anything creative? Even anything remotely creative???Embarrassed to have admitted to have watched this tripe!"}, {"id": 9, "text": "Ben Falcone has gotten too many chances. Melissa McCarthy used to be one of my favorite comedy actresses. But this is the last drop. Spending a nice friday on this film when nobody tried their best making it. Nobody"}, {"id": 10, "text": "My review title is saying that in the best possible way. Without Bobby Cannavale this would have been a 1 star movie, he can act, and I feel sorry for him being in this excrement. Absolutely awful. Full of so-called comedians who are not funny at all, and also cannot act, together with a script that is mindbogglingly terrible. Whoever okayed this rubbish must surely have been fired. Please do not waste your time on this garbage."}, {"id": 11, "text": "This definitely isn't as bad as a 3/10 as IMDB users rated it. People either just love something or hate something (although I think they can like stuff more than others). I guess some people just hated this, but I blame the writers.For example, the big bean bag was a cool idea, but it shouldn't have wasted a whole minute of screen time. That should've been like the end to a scene, or something like that (in my opinion).The writers did a good job on the story they actually wrote, however, like when they make sure the audience knows the voice isn't actually meant to be James Cordon himself.However, with that said, I just think the scenes weren't that funny or entertaining. I love the idea and concept of the movie, and love Melissa McCarthy, but sometimes I just felt like doing something else other than watching the movie, and in my opinion, movies should NEVER be like that. Every scene should capture you and grab you, and make you not want to go and do that huge ass pile of work I have sitting around, and this movie had me thinking about that big pile of work still somewhat. I feel like simple benchmarks like this can really tell studios if movies are likeable or not, but these benchmarks need to be tested across large groups of people. I guess this is what they're doing with machine learning (like at Netflix, for their recommendation engine), but I feel like they're measuring the wrong benchmarks. Whether or not I want to watch a movie instead of work or play games says a lot, though, and this had me thinking of going to do both of those things. I know this is a very basic system of measurement, but it hasn't failed me yet. I recommend movies to people all the time and are the guy everyone asks what to watch, so I think I have good instinct in this area.I also wanted to say that while it wasn't very entertaining, it was very well made, and is of very high quality.I feel it's worth a watch regardless, but the ratings speak for themselves."}, {"id": 12, "text": "First 15 minutes ok , then concept wears out pretty quickly Was very bored after 1 hour of movie which has an overlong running time . Score 5 from me ."}, {"id": 13, "text": "This is an easy throwaway movie. It's fine. It's not diabolical the way some people are suggesting. It's not the funniest or the best but there are some moments. Some people are freaking out over 'leftists propaganda' or that's it's anti-Trump - you may want to see how the film handles the Clinton-esq President because it's not favourable! lol ****spoiler The real mystery was how anyone was meant to be taking flights around the world when there was a global black out. It seems to be a key ingredient to the plot so surprised this was just overlooked even during the screenwriting stage..."}, {"id": 14, "text": "When the world is a mess it's nice to relax with familiar faces and voices. Mellisa is her charming, funny, quirky self in this movie. She is supported by the perfect lover Bobby Cannavale also quirky and charming, and her husband popping in at fun intervals. They do a mini Ferris Buhler's Day Off and reference a lot of things from a gentler time. Lots of nostalgic music to add to the cozy feeling. James Corden's soothing voice is perfect as the AI for the funny bits and the friendly banter. When AI decides to follow someone to learn about humans there are times you think about what would I do in those circumstances. Nothing too deep but an updated will the bad guy really take over the world and if so why. What could be done differently in the real world to change the outcome.? Sit back and relax enjoy the laughs, the clever writing, and the familiar faces. It's time to feel good."}, {"id": 15, "text": "Almost a one woman show - Melissa and a pound of her favorite plaster compound. If they had to put that much on her, they should have just stayed away from the close-ups. I struggled through the whole thing with the help of FF. I kept waiting for - anything! But, nothing. I could have mouthed the script along with Melissa. Not one original line. Every concept borrowed from some cliche end-of-the-world 50's and 60's flick, but with an oh so worn out Hollywood ending. Couple of token black comedic actors. Yeah, the NSA never employed anyone that stupid. I assume a lot of Melissa's money went into this. In her string of lame forced comedies, this is up near the front of the pack."}, {"id": 16, "text": "This movie bad acting bad predictable story boring corny jokes and a desperate attempt to get cash grab with a few big name stars. Almost fell asleep. Dont bother."}, {"id": 17, "text": "Please Falcone, quit directing bro! your last movies with Melissa were awful.Melissa is just an awesome actress, i adore her always but the material here isn't good enough, she tries to save it but it's just too far gone to salvage.it's a romcom doomsday scenario.. choose one or the other dude!! they don't really gel, yeah? there are some slapstick laughs but not enough to warrant losing nearly 2 hours of your life.give it a miss."}, {"id": 18, "text": "Melissa, stick to drama roles started, you had interesting characters in that format. This movie is one of of the worst cheese put out with you starring yet. A thanksgiving turkey, not the full with love. Bobby you had to have had better roles offered to you. All in all, sometimes you need to reject what presented to you. Do test audiences with line readings and small portions showed before release to masses."}, {"id": 19, "text": "It's like they've made a film and every aspect of it is to just to annoy me."}, {"id": 20, "text": "Actor (also in this film) turned newb director Ben Falcone, and actor (also in this film) turned newb writer Steve Mallory, successfully put together this entertaining, funny, and heartwarming film. It worked mainly in part due to Melissa McCarthy's usual outstanding and hilarious performance, as well as James Corden's virtual appearance. Finally, Corden was fitting and good in his attempt at Hollywood films (i.e. Cats). Bobby Cannavale as well as the rest of the casting and performances were also great. The cinematography and score was decent. The 106 min runtime did feel a little dragged out and long. I feel at least 10-15 min cut and/or faster pacing in some acts would've benefited this film. Nevertheless, imo it's undeserving of it's low rating. You're either not a fan or are of Melissa McCarthy, and I am, and she nailed it - again. It's a film that will certainly give you smiles and laughs. A well deserved 8/10 from me."}, {"id": 21, "text": "I understand that we are 10 months into a pandemic and we have all run out of good shows to watch, but what the bleep was this???"}, {"id": 22, "text": "Just as Carol Peters is listed as the most average person in the entire world, this movie similarly fits the part of most made-for-streaminng titles. It's some nice, innocuous fun that provides some pretty good jokes (with a few belly laughs) and a familiar storyline that is neither overly offensive nor particularly mind-blowing. Pop yourself some popcorn, pour a glass of wine and snuggle up to your partner and turn your brain off for 90 minutes while McCarthy provides some pretty good entertainment."}, {"id": 23, "text": "It is the typical Melissa McCarthy character but in a very unfunny story. I usually enjoy her movies. Disappointing to say the least."}, {"id": 24, "text": "Thought this was good. Easy watch pretty much what u expect with a few laughs. Great for movie date night."}, {"id": 25, "text": "I'll be honest. I want more movies that are romance-comedy with Melissa. I feel we need people that look like us, not fit or perfect match, but real. Plus, she is perfect. I have always admired her; she is smart, funny, and beautiful.The movie is funny and help you get away from reality, so enjoy and be happy."}, {"id": 26, "text": "Had to fast forward through a lot of cheesiness. Cute fluff. Predictable"}, {"id": 27, "text": "Like all other Melissa Mccarthy movies. She isnt funny"}, {"id": 28, "text": "There were a few laughable moments, but other than those this movie was a dud. Unfortunate because I like the actors."}, {"id": 29, "text": "How do movies like this get greenlit? Do they actually make money? The only reason I suffered through it is my wife ran out of things to watch so she picked this."}, {"id": 30, "text": "Superintelligence is for a huge surprise another wooden and tiresome Melisa McCarthy film that was very unfunny and honestly very dragging expecely during second and third act.I will admit im not a big fan of said actress cause she always stars and plays the same characters but i heard that she was very good in a Can you ever forgive me but unfortunetly personaly i cant confirm that cause i havent seen the film.Story was here in beginning somewhat fun to watch and it had some attempts to make jokes but they failed in end.Superintelligance was another weak comedy from her side"}, {"id": 31, "text": "I love Melissa McCarthy and her movies. The low reviews are absurd. Why bother watching this if you aren't expecting a light hearted comedy with heart. Watch something else."}, {"id": 32, "text": "In my opinion, this is a movie to enjoy with your family, in as much as it has it's down sides, it's still a really good movie but it could have been better... And this is not Action comedy, it's Comedy Drama... !!"}, {"id": 33, "text": "The movie is about an AI that studies the most average human being on earth to determine the faith of the planet. While the idea is somewhat unique, the cheesy script and dialogue made this movie almost unwatchable. The only thing to look forward in this movie are 2018 stock footage of Seattle in the cut scenes and James Corden."}, {"id": 34, "text": "Lets make somethin clear here, if you do not love Melissa Mcarthy do not watch Melissa Mcarthy movies, that is why her movies always get bad ratings, because the wrong people watch them.The woman is a comedy genius and this movie is no exception especially when she teams up with her husband who also happens to be the director of this comedy masterpiece.So what did we learn? watch this movie if you love Melissa Mcarthy, do not watch this movie if you do not love Melissa Mcarthy."}, {"id": 35, "text": "Typical Melissa movie , a few laughs but very predictable. I'm not a James corden fan so wouldn't watch it again"}, {"id": 36, "text": "Seriously, how much more of the leftist narrative can they jam into this movie. The whole talk about climate change, socialism with references to spreading wealth, the diversity boxes they've ticked in almost every scene and the moment that did it for me, forcing me to get up and leave the theatre was the Madam President moment with the obvious, in your face Hillary Clinton look-alike!! What a joke!!I am all for diversity in movies, but I despise it being 'forced' and constant and over bearing! This is a comedy (or supposed to be) not a leftists town hall meeting! Make it stop! Far out!Pop corn was solid this time!"}, {"id": 37, "text": "This movie is cute and funny! The acting is great! If you want to watch a feel good movie just for the fun of it, watch this. It's adorable and entertaining. I have no idea why it's only got a 5 rating."}, {"id": 38, "text": "2 out of 5 stars.Superintelligence is a comedy sci fi film that tries for light hearted humor. But is a complete miss. The story about a super intelligent computer that plans to end the world. But is studying Melissa McCarthys character for a few days to see if the world is worth saving. Dumb plot. Boring characters. The humor is dull. If you seen McCarthys other films that Ben Falcone has directed. The humor is no different than those films. Which is very old with this film. James Cordens voice as the super computer voice is eh.This comedy is a complete miss."}, {"id": 39, "text": "For fans and bored ppl only....but I'm sure there are a few of you out there."}, {"id": 40, "text": "I usually love Melissa Mccarthy's over the top acting if the movies good but this was just painful.Senseless plot with no chemistry between her and her suppose to be BF.Annoying side characters predictable ending and James Cordins voice makes those possibly the worst movie of 2020.No Thanks"}, {"id": 41, "text": "This movie had all the elements needed for a successful romantic comedy but it fell flat in my opinion. I almost felt insulted at how little effort they put into the plot and the over reliance on celebrities to make up for it. Watch it while doing chores as it's essentially a student film with a big budget."}, {"id": 42, "text": "Do you remember The Boss, Life of the Party or Tammy? If the answer to any of these was yes then my next question would be do you remember them and shudder with regret for the time lost?Superintelligence is another Ben Falcone film that relies too much on the fame other better movies have accrued for Melissa McCarthy, she is a good actress but no amount of good acting can save a movie this bad.James Corden being in this movie should tell you everything you need to know about the quality of it, the pacing is all over the place and the comedy is nothing you havent seen done better in other movies.Do yourself a favour and dont waste time on this movie, maybe if enough people dont watch it, Ben Falcone might actually stop getting funded to make more of them?"}, {"id": 43, "text": "Here's the message of the movie - AI (Artificial intelligence) can never learn the idiosyncrasy of the human heart, mind, spirit. And this flick takes its' time bringing that to light.Very little comedy and what is there was like squeezing blood out of the damn turnip. This story is the simmering pot that never comes to a boil. You never really care about any of the characters and some actors seem to be embarrassed to be there!I always liked Melissa McCarthy but here in this movie she's flat on her face just like the scene where she's ejected from that automobile. And my pet peeve is that I cannot stand to hear James Corden speak!! But I suffered his voice to watch this movie."}, {"id": 44, "text": "Enjoyed Melissa McCarthy and she made me laugh a few times. It seems she is improvising sometimes making her screen partner laugh. I like that! The unoriginal plot had a slightly different take but still accomplished it's goal to preach about what humans are/are not doing. Melissa looked great and enjoyed the chemistry with her and Bobby Cannavale. Brian Tyree Henry is always enjoyable to watch. I think all of the cast made this movie worth watching, again plot aside, I still enjoyed it."}, {"id": 45, "text": "I made it through almost 30 minutes before running away from the tv- the sheer volume of woke trope is nauseating.I had no idea Ben and Melissa were such insane social justice warriors, but assuming it's their movie, I think it's a safe jump.Also worth noting, as hard as he tries, Jim Corden is not, I repeat NOT, Ricky Gervais- he's not funny and he's barely understandable.Horrible movie with not-so-subtle messaging; skip it and jam a sharp stick in your ear, it will be much funnier."}, {"id": 46, "text": "I really like when a movie comes out that the entire family can watch but isn't geared towards little kids. My ten year and I really enjoyed this."}, {"id": 47, "text": "It was sweet and heartwarming. Also it was an interesting premise."}, {"id": 48, "text": "If you're a Democrat, you'll love this movie. It ignores the fact that Donald Trump is the president and just replaces him with Hilary Clinton. I found that not only histiorically incorrect, but also embarrassing.Moving on, the plot was pretty mediocre and did not have a proper ending. There was no real point to the story except that love is selfless and Donald Trump isn't our president. The movie also fulfilled its obligatory women, black and LGBT quote, very politically correct.There is a real threat that the power supply might be taken down, but of course there was a Hollywood ending to this, without getting deeper into the topic.Despite all of this, Melissa McCarthy's acting was splendid as usual. Someone could write a script on toilet paper and enact it in a soiled bathroom and she'd still make the movie great. Had it not for her acting, I'd have easily rated it a 4. I also did not get the obscure sports reference (I am neither American nor a sports fan, so that bit was probably lost on a lot of people).If you are a Trump supporter, you will hate this movie. If you are a Democrat, get your 10 cats together and crown this your new favourite movie, because it will not offend you and convey just the right amount of social justice."}, {"id": 49, "text": "I almost think people are hating on this movie because they don't like the main actress, and if that's true then don't watch it. But the movie is so entertaining, her character is likeable, and the movie even has some poignant parts as well. I am telling my friends to watch it, and I'm telling you to as well, if you want a good laugh. Enjoy it!Edit: after reading the bad reviews I can see what happened. Person who hates the genre and main actor watches a bit of it before it gets really good and gives it a 1. If you hate the genre and actor then why would you even watch it? I don't watch movies I know I will hate. Maybe someone else in their family wanted to watch it and they couldn't leave the room? It's a mystery to me."}, {"id": 50, "text": "Don't judge by ratings, it is funny and delightful movie"}, {"id": 51, "text": "Words cannot describe how bad and forgettable this film is. Melissa McCarthy again plays the same role she has in every other film. The film plot is annoying and boring. Pure awful from start to finish."}, {"id": 52, "text": "Great concept and potential premise squandered with irrelevant and stale plot lines. the whole thing just never really took off. it didnt even make mildly amusing level,, such a pity."}, {"id": 53, "text": "I knew going in this was going to be a light fluffy movie. And I really enjoyed it. I laughed out loud a lot and honestly most movies don't do that to me lol Funny and enjoyable and I would watch it again."}, {"id": 54, "text": "This is one of the worst movies I've ever seen. Love Melissa, in about anything else. But this is bad!"}, {"id": 55, "text": "If you are bored one day and looking for a movie where you can relax and laugh a little, then this movie is for you. Grab some yummy snacks and a refreshing drink, relax, and see this movie. There are many funny scenes in this movie. The story is silly though and the movie isn't a n Oscar-worthy movie, but it is a movie that will entertain you. This movie will entertain you and make you relaxed. You won't get too invested in this movie, but you will feel good when the movie finished. This is one of those movies that will make you laugh, entertain you, and make you feel good. We have these kinds of movies then we have other serious movies etc. It is a silly and cute movie. You should watch it."}, {"id": 56, "text": "It was an easy watch Rom Com i smiled the whole way through."}, {"id": 57, "text": "I was expecting THE BIG SUCK to commence in droves but it never did. In fact I found it very entertaining and cute and inclusive and fun, and original and engaging.I thought the writing was a cut above and the the protagonist lady is very very funny. It was just a really sweet and cute thing all the way through; I thought who is the voice behind the A.I antagonist , looks creepy but he was very very funny actor who got really really funny lines, so I have no idea why people are hating so hard on it."}, {"id": 58, "text": "Not Academy Award worthy, not amazing, but fun film. If you LOST INTEREST after 15 minutes - Please, pause the film. Go take your Ritalin. Resume watching. Not as bad as the millennial children seem to think it is."}, {"id": 59, "text": "I do not at all understand the hate for this movie. It's funny in absolutely every scene. What did you guys think you were going to be watching, gladiator? Promise, you will laugh a ton during this. Tons of jokes move quickly, maybe these people weren't catching them all. But I did and highly recommend watching with someone you love to laugh with!"}, {"id": 60, "text": "Loved the movie so much! It has a nice spirit and it's a different story.. Melissa McCarthy never fails"}, {"id": 61, "text": "And this is how I cancel my subscription to H........(you know how) and a few more......covid cant go for ever!!!"}, {"id": 62, "text": "Is the movie going to win an Oscar? No. But it was a cute rom com with an interesting premise. I enjoyed it because I took it for what it was, which I suggest everyone else do too. It didn't deserve this much hate, in my opinion."}, {"id": 63, "text": "One thing I learned a very long time ago, is that everybody's sense of humor is different. Hated Bill Crosby's humor but loved Cheers. Everybody is different. I am very hard to make laugh, but this movie had me laughing quite a bit. So, for me an 8 of 10. A different kind of a Rom-Com and definitely not a Hallmark love story, if that's what you are looking for. The super intelligence's humor had me laughing quite often. Give it a try."}, {"id": 64, "text": "I really enjoyed watching this movie. The cast is awesome and it was an awesome escape from the real world. It was so fun to see Mel McCarthy and James Cordan together in a movie."}, {"id": 65, "text": "This is a lighthearted comedy about a ubiquitous enemy. It find it quite funny and entertaining. It is good for a brain-off watch."}, {"id": 66, "text": "I can't figure out why people are hating on this film. It was so funny and light hearted. All the acting was great and I really enjoyed it."}, {"id": 67, "text": "Don't believe the bad reviews. It was light hearted and silly. It's a rom com so it is what it is."}, {"id": 68, "text": "I thoroughly enjoyed this movie. It wasn't a laugh riot but it was sweet and enjoyable. The cast is great and the relationships felt real."}, {"id": 69, "text": "After seeing the low rating I thought the film must be terrible. I did not read the reviews and I am glad I did not.This movie is quite good. I liked it much better than the last few movies Melissa McCarthy made."}, {"id": 70, "text": "This movie was a fun ride! Great chemistry between the leads."}, {"id": 71, "text": "I deserve a medal for getting 15 minutes into to this low grade piece of garbage. Rubbish acting, rubbish directing, virtue signaling piece of garbage. Hit a unrecoverable low with the James Corden voice character. What an annoying, very annoying, character this was. I gave it a 2 stars because nobody reads the ones and people need to warned to avoid this bucket of puke!"}, {"id": 72, "text": "I liked Superintelligence, just as I did Bridesmaids, Identity Theft, The Heat, The Boss, Ghostbusters and Can You Ever Forgive Me? (I recently saw Alan Parker's 2003 movie The Life of David Gale, in which she had a small role)If you ask me, that woman can do no wrong. This movie has all sorts of clever stuff. You're sure to love it."}, {"id": 73, "text": "Typically the kind of movies much needed right now. It offers a few laughs and good feel moments. Simple but efficient. A sweet pleasure."}, {"id": 74, "text": "Light-hearted fun comedy which would suit people like me (Ok Boomer sanguine type who likes feel-good movies) I just watched Tenet by Chris Nolan, and although I like SF Mindbenders, well, I preferred this movie with the lower ratings. Why? - I just like Romantic comedies that are more fun than the deep stuff. ..so if you are like me, then go ahead and watch this one."}, {"id": 75, "text": "If you like sci-fi, romantic comedies, and comedies, then this movie is for you. If, like critics and IMDb reviewers, you take yourself too seriously and require a movie to be a deep metaphor before you'll consider watching it, then this isn't for you."}, {"id": 76, "text": "There were some funny bits, but there was also a bit of convenient/corny writing. Overall, I would not recommend investing time in this one."}, {"id": 77, "text": "Melissa can make any script fun. This is not her best movie, but the really bad reviews don't make sense unless you don't like Melissa, This is a fun movie that doesn't require much thinking, but there so so many funny moments and great supporting actors. James Cordon was a perfect choice for the A.I. Voice. All this coming from one of the harshest critics, me."}, {"id": 78, "text": "Hollywood needs to stop using technical terms in movies unless they consult experts. This was embarrassingly bad. How does a solid state device have a mechanical difficulty? For a movie that is trying to hide all of its leftist propaganda in a romantic comedy, I think they should take their own advice and follow the science. Seems convenient that the AI in the movie is also a wile leftist in real life and the AI also has the same leftist checklist of talking points. Maybe they should also stop technologically appropriating the field and only put people that know what they are talking about in those roles. This movie should be called Super Hypocrisy."}, {"id": 79, "text": "It was definitely a romantic comedy, but it was also really cute and funny. I live in Seattle, so it was so fun seeing all the scenery and everywhere she went. Maybe I'm biased because I'm from Seattle, but it was really enjoyable &amp; fun. I gave it nine stars to up the ratings because people need to chill out."}, {"id": 80, "text": "Was expecting it to be bad, but was pleasantly surprised by how entertaining it was. Give Ken Griffey Jr an Oscar!!!"}, {"id": 81, "text": "People are trashing this cute movie and I think they all need to take themselves a little less seriously. I don't think this was intended to be a masterpiece. It was likely meant to be a cute, silly, easy to watch, entertaining movie. And I would say it achieved that."}, {"id": 82, "text": "This isnt very complex thriller which tries to add some romance. It is easy to follow and non offensive comedy, Every part of it just works, sometimes barely yet works. Lot of positivity. Main actress is very likeable, same with James Corden- I like how he isnt trying to seem too intelligent even when he is supposed to be. Although reassuring and comforming, I think it will difficult for it to hold universal value, so I reccomend watching it soon."}, {"id": 83, "text": "Because that's about how much funny parts you get. In other words, you have to sit through 1hr 40mins of a stupid story with too many dumb characters to get 5 minutes of funny humor. Folly on you if you believe all those 7-8-9-10 reviews. Even a 10-year old would roll his/her eyes at this boring, shallow, dumb story waiting for a funny moment every 20 minutes. As another reviewer said, how does Hollywood approve this stuff? Amazing how idiotic they believe us moviegoers to be."}, {"id": 84, "text": "In real life that super AI would have killed us instantly just because of Trump. Noticed their work-around by having a female, hillary like president? Still has its funny moments though."}, {"id": 85, "text": "I liked the premise, even if it's not that original. Most of the performances were all right, though some jokes just went on too long. Cannavale and McCarthy had a decent chemistry, and the two NSA agents were pretty good. Certainly did laugh several times, and didn't mind watching this movie, though I did think the writers missed a chance to really demonstrate McCarthy's character DOING something with the Superintelligence's power that wasn't just getting back with the love of her life. I wouldn't really recommend watching this, but I also wouldn't tell anyone to avoid it."}, {"id": 86, "text": "This is the sort of movie you might watch on an airplane where there tends to be a lot of distractions and something more immersive can be hard to get into. There's nothing exactly wrong with this movie, it's just not that good. The basic problem is they are trying to do sci-fi and comedy at the same time and it essentially under-performs in both. The sci-fi is so far fetched that it's ridiculous, and yet they spend quite a lot of time developing it. It would have worked better if the sci-fi was more like a backdrop and the focus was more on comedy. But the actors involved here, although good, don't really stand out as strong comedians. So the thing really just comes together as a half-baked, made for tv sort of effort."}, {"id": 87, "text": "Like McCarthy's character, Superintelligence is as average as average gets. There is literally nothing special here. The script feels contrived and cliche, the story is overused (Skynet, anyone?), and the jokes are boring, even from McCarthy.The result? A lifeless slob of a rom-com best watched when drunk, or when there is nothing else on TV this Thanksgiving."}, {"id": 88, "text": "I would recommend this to moms and younger audiences. a simple movie for gatherings and such."}, {"id": 89, "text": "I love Melissa McCarthy and was looking forward to this BUT oh no.... Biggest load of rubbish. Predictable,no laughs,weak plot and just terrible acting. Very disappointed. Ben Falcone stop directing your wife. It's exhausting."}, {"id": 90, "text": "Superintelligence 2020 PG Director: Ben Falcone Starring: Melissa McCarthy, James Cordon, Bobby Cannavale, Brian Tyree Henry etcOverall rating 34/100Superintelligence is about an all powerful AI who chooses to study average Carol Peters (Melissa McCarthy) the fate of the world hangs in the balance, as she tries to reunite with her ex the AI decides whether to save or destroy the world. Despite me loving Melissa McCarthy this movie just didn't work on multiple levels so lets get started.Lets start with a few positives shall we, the movie was funny in places, Melissa McCarthy was great and the movies self aware tone was great. The movie was very funny in places, this was largely due to Melissa McCarthy and her fantastic comedic delivery but there was a few very relatable comedic moments that got to me, Melissa McCarthy was also fantastic, she did the best with what content she was given, and still delivered some great comedic moments, and had loads of charm that she will never not have. I also liked how self aware the movie was, the movie knew what kind of film it was and where it was going with the characters and it wasn't afraid to tell the audience that, which made for a slightly better viewing experience knowing what kind of movie you are in for so you can relax a bit more and enjoy it while it happens, they did this well with the main characters and let their chemistry do the work for the movie which we will get into in a future paragraph.However, my first few negatives would be the poor script, lapses in the logic, pacing issues and inconsistencies with its humour. The script for this movie was just truly terrible, it was trying way too hard to be cool and funny for younger audiences and it came across very awkward and corny, the dialogue between most of the characters was terrible, generic and there was so much exposition and unneeded bits of dialogue it was painful. I just thought there was so many lapses in the logic, a lot of the movie just didn't make sense, they left a lot of things to do with the superintelligence completely unexplained, and there was just so many unrealistic situations for her character that the superintelligence couldn't just do straight away. The movie had a lot of pacing issues as well, there was just so many times when the plot really dragged and there wasn't enough going on to keep me interested, there wasn't enough conflict or advancing or developing of the plot, so it just felt like it was stuck in a rut for a lot of the movie and it didn't know how to get out of it, and part of the reasoning for the pacing issues was the inconsistency with its humour, apart from a few funny moments with Melissa and a couple of funny lines the movies humour just didn't land, it was just very awkward too watch and the movie tried way to hard. This made the pacing very slow because the movie was hardly doing what it was supposed to be doing which was making you laugh and constantly keeping you entertained with its dialogue.My final couple of positives would be the interesting set up and chemistry between the two leads. I thought the set up of the superintelligence based on the background into Carol as a character and other peoples perceptions of her was really interesting and set up the rest of the movie well we already know how I felt about the execution but it got off to a good start. My favourite part of the movie definitely was the chemistry between Melissa McCarthy and Bobby Cannavale, they were excellent together, there chemistry and relationship felt believable and when the movie was actually focused on their relationship blossoming again I thought it was really sweet.However, my final few negatives would be the lack of character development or depth, tonal inconsistencies, irritating characters and how predictable the movie was. There was just a complete lack of depth or development to any of the characters, we only knew the bare minimum about Carol as a character and whenever the movie did try something it was through exposition and explaining instead of showing the audience, and the other main character was completely one dimensional as well. I thought there was also a lot of tonal inconsistencies as well, the contrast between the comedy/rom com of the main characters relationship and the realism surrounding it and the sci fi elements of AI's and robots just didn't work and felt out of place for the whole movie, the sharp contrast between realism and surrealism was to big and it was very jarring and poorly executed. There was also irritating characters, I just found James Corden and the Superintelligence character itself irritating and it became stale very quickly, I don't think James Corden should do many acting things, unless its just the roles he is given but its usually poor, the intended humour with his voice as the AI just didn't work and was awkward to watch. And finally, the movie was just very predictable. I could tell what was going to happen with the plot and the characters throughout the movie, and the movie did absolutely nothing to counteract that with no surprises or changes to what you would expect, therefore taking a lot of the enjoyment out of it.Overall despite my love for Melissa McCarthy and her fantastic chemistry with Bobby Cannavale, they weren't enough to make this movie not terrible, I think Melissa should have a fresh start and no longer do movies with her husband Ben Falcone, as she is stuck playing essentially the same characters where the scripts are getting worse and worse."}, {"id": 91, "text": "5/10 - while I usually love when Melissa McCarthy teams up with her writer/director husband, Ben Falcone, this movie was pretty slow and relatively unfunny (especially considering what they are each capable of)"}, {"id": 92, "text": "I love Melissa and watch most of her stuff but I found this one to be a bit of a miss. It was never out right horrible, there just wasn't enough comedy or even her signature slap stick humor throughout to keep interest. I know its PG and not her typical R rated stuff but the movie could've benefitted from a PG-13 and upped the comedy a bit. Overall it was just an OK movie."}, {"id": 93, "text": "These days, with moviegoing being the way that it is, it's hard to grasp whether a film is being sent to streaming due to the studio not having faith in it, or simply because they're doing the best they can with the amazing product they have. I'm a huge fan of Melissa McCarthy and always look forward to the next starring role she chooses, but Superintelligence was the final nail in the coffin for films being directed by her husband, Ben Falcone. To be honest, I don't mind him as an actor in comedies, but when it comes to directing, I just don't think he chooses the right projects. I didn't like their first outing together in Tammy, I liked The Boss even less, and Life of the Party was too tame to enjoy. While I have to admit that Superintelligence is probably the best film they have made together, here's why I believe it's still one of the weaker releases of 2020.The film begins with Carol Peters (Melissa McCarthy) enjoying her average, everyday lifestyle, when a new piece of A.I. decides to invade her life, controlling and manipulating her, with the ultimate goal of destroying and ending the world. Movies like this have been attempted a few times now over the last couple of years, but nothing will ever come closer to the lightning in a bottle Spike Jonze made with his film Her. I mildly enjoyed 2019s Jexi, but that was also a throwaway film that wasn't memorable at all. On top of feeling like an imitation, it also tries to balance drama and comedy far too often. The climax of the film decides to get completely serious and I just didn't buy any of it. With all of that said, the saving graces were easily the duo of Melissa McCarthy and Bobby Cannavale.Whether you're talking about films like Chef, Blue Jasmine, Danny Collins, and even Ant-Man, Bobby Cannavale has become one of my favourite actors in supporting roles. His charisma in nearly every role he has ever taken always leaps off the screen to me. Superintelligence gets off to a plodding start and his character doesn't really appear in the film until about halfway through, but I instantly started liking the film a little more and giving certain things a pass when McCarthy and Cannavale were on-screen together. I was able to buy into their history and thought their scenes elevated the film immensely overall. Sadly, their presence is all that saved this one from me hating it, which I usually don't say about many films.I think the screenplay written by Steve Mallory is the main issue here. In retrospect after looking up his previous efforts, he has appeared in very small roles in many of Melissa McCarthy's films and has only ever written one other Hollywood film in The Boss. To me, that just says this crew had a bunch of fun making a movie together, which is great and all, but the movie is not a reflection of that fun. There was also something about the overall tone that just felt off to me. The movie looked and felt like a comedy, but the majority of it is a complete drama. I just couldn't invest myself in anything that was going on.In the end, Superintelligence takes familiar ideas and runs with them in ways that do not mesh well together. I was bored by how slow the first act was, became slightly more interested when she started to interact with more humans but was ultimately let down by how anti-climactic the conclusion was. Movies that have unique premises that do not go the extra mile to stand out are more frustrating to me than films that try very hard and fail. I saw potential here, but not enough was done to impress me overall. Superintelligence is now streaming on through HBO, and even more the most hardcore Melissa McCarthy fans, I really can't recommend this one."}, {"id": 94, "text": "Another holiday, another means to try and get us into streaming with another free trial of original programming. This week's new movie to direct stream offers the potential of science fiction, romance, comedy, and some drama as the genres continue to mix together to net new subscribers. Yet, with limited budgets and potential limit to return of investment, the quality of movies continues to be in question for this reviewer and more so the bar continues to be lowered slightly each time. Still, there is always hope for a nice surprise to come in and wow us and so here we are with another review this time on:Director: Ben Falcone Writer: Steve Mallory Stars: Melissa McCarthy, James Corden, Bobby CannavaleLIKES:No nonsense Pacing Cute At times A Nice Look at the Morals of humans Some Well Timed Comedy Bobby Cannavale's limited time elevates the acting James Corden's energyDislikes: Too many Jokes Did not execute the Sci Fi complex well for me Too Much Slap Happy leading to weakened plot Weakened romance Weak Character Interactions and assistance The purpose of much of the approach of the movieSUMMARY:When it comes to a Melissa McCarthy, you never know what you are going to get, though statistics would be a very quick pace to cram as much humor in. Those odds are in favor of continuing in this movie and does a wonderful job of giving you something to entertain and pick you up. You don't get bogged down in prolonged failures of the main character, and no repetitive desires made famous in Hallmark movies. No this film dives right into the awkward humor and gets you right into the interesting dynamic of machine and heroine. Cute at times, Superintelligence is almost like the beginning of Her mixed with a toned down Jexi, as the two protagonists try to face the age old question of do humans deserve to survive despite their flaws. Over the course of the near two hours, this question sort of gets looked at through blinders where the good is magnified in the one heroine, while the rest have glimmers mixed amid the pool of sinful vices and laziness that they show. Though a bit in your face, I find it directed towards trying to teach the lessons of getting better and not letting those limitations lead to destruction. However most are not going to be wanting these lessons to take center stage and rather get the more entertaining notions in play. Fortunately, superintelligence has got your back on this is as well with a sweet, albeit shallow romance story and a more underdog going against the challenges all while maxing out the comedy. In regards to comedy, it's a bunch of aggressive bantering, puns, and insults that take the front alongside McCarthy's usual awkwardness approach. My particular favorite comedy though comes with James Corden, whose energy and sassy nature on the Late Late Show is welcomed in the movie. Much like his skits during his talk show, Corden holds no insult back, slinging them at everyone with his superior comedic timing, presentation, and an attitude that fits this character so well. Most of my laughs came from these moments, as well as extending his power to many places and targets that were extraordinary for me to enjoy and in my opinion much of the saving grace of the factor. As a side note Cannavale is another great inclusion to the cast, though his involvement happens a little too late and tangential to really enjoy as much as I usually enjoy his roles. Still, in his time frame, his performance has a little more dynamic to it, some layers that affect the rest of the group and finally give the character development that I had hoped for.In regards to the dislikes of mine, well it comes off on the modern approach to movie presentation for many films, which is excess in content at the cost of story. Too many jokes are the foundation for the other weaker elements, with constant banter and repetition to string you along as the moral test goes on. Though charming at times, McCarthy's usual tidbits take too much time away from the story, and though Corden saves it at times, even his banter grows dry and too silly without things to ground it back down. Science Fiction wise, the movie is again weak, the usual artificial intelligence reaching new heights being a little more extreme to get your attention (see Lucy and Jexi for different ways this is done). In this one, the whole computer is in charge of everything seemed more a convenience than a true staple, which though at times was perfect for holding humanity at its mercy, was also at times feeling an afterthought. There was no major evolution with the use of technology, and outside of symbolism really could have been done an other way. Side characters and secondary appearances sort of feel like an appearance in the Muppet movies, one and done to get your name on the agenda and really not contributing much else to the film. That felt like a major number of actors in this film, several of who get tag lines, they are my best friend or my confidant, who will know what to do. Well those people do accomplish some benign tasks, many of them feel like those cameos, a few jokes sliding in and then back to the main cast for more of their shenanigans. These weak character moments I know aren't going to be a big factor for most, but for this reviewer seeing some expansion of others would have opened the gates for some better plot development and comedy dynamics if they had plotted it out more. This is even true for the romance part of it, which though has some satisfaction and eek moments in it, also loses some kick because of how late it occurs and how it is just a piece and not the full effect of the story. My thoughts all come down to, though cute, much of the purpose to this movie leaves me in question of why they did it outside of just roping people into subscribing. Again, another example that stuffing too much into one film can be more detrimental than leaving things out.The VERDICT:Superintelligence is fun, don't get me wrong, with the same familiarities of a McCarthy movie baked in with a lot of other approaches. Cute and funny are the main themes of this film, and so long as you don't go in expecting too good of a story or too deep of character involvement you will be fine. The highlights again for me are Corden's energy, mixed with the charm McCarthy's characters often have. However, the fact that so many of the characters are not needed, the sci fi concept is kind of swept under the rug, and the overstuffed jokes are center stage over the story, these are weaknesses that dilute the factor of the film. If you are fortunate to subscribe to HBOMax, I can say that it feels like a made for TV movie given budget, planning, and plot. Should you not be subscribed then don't kick yourself too much and look for it on other platforms should the need arise. Given all of these factors, my scores are:Action/Comedy: 6.0 Movie Overall: 5.0"}, {"id": 95, "text": "Melissa McCarthy is delightful as always, and looks really good in this movie. She shows some great range here while still being as naturally funny as she always is. Bobby Cannavale is also very good here, I didn't realize he also has some great variety of character and depth.The movie suffers because of Hollywood's penchant for overtly pushing its religion and political views (pretty much one in the same). Overly PC throughout. Very distracting and not necessary. As well as casting another favorite (Jean Smart) as an obvious Clinton clone right down to the blue pants suit...And another pet peeve of mine, full service dress of military members. I'm sure if they were shooting guns, they would have been on full auto..Good thing they had a great cast to pull this PC dumpster fire out of the jaws of defeat. Could have been a wonderful diversion if they'd just kept their religious beliefs to themselves."}, {"id": 96, "text": "Forgettable, humourless and a total bore; Superintelligence is far from being super or intelligent.In this comedy, a former corporate executive, has her unfulfilled life turned upside down when she is selected for observation by an artificial intelligence that may or may not take over the world.If you've been following me for a while now, you know how much I love Melissa McCarthy... NOT! This is yet another failed attempt at a comedy while trying to add some sci-fi flare to it. In yet another failed collaboration with with her husband, director Ben Falcone, McCarthy tries so hard to be funny by pulling off antics you've seen her do again and again. Why do you put yourself through this, Snob? Well, I had a little faith cause Bobby Cannavale was in the supporting role and honestly he's the only decent thing about Superintelligence. Bryan Tyree Henry is also pretty good in a small role. In all seriousness can you imagine an AI system being voiced by James Corden 24/7? Kill me. A total waste of time, don't put yourself through it.Follow @snobmedia for more reviews!"}, {"id": 97, "text": "BREAKING NEWS: Covid has now been bumped down to number 2 in the 'worst things of 2020' list!This film is full of great actors, but sadly, that's where the greatness ends. I wasn't a fan of MM before this...and I'm still not. How does she continue to get work? The film is supposed to be about the end of the world, but at no point did I feel any sense of impending doom.Here in the UK, Channel 4 airs 'Mike and Molly' on weekday mornings...Jesus, what an awful way to start your day! In this (and every other film I've seen her in), she's an exact copy of the character she plays in Mike and Molly. She has no range.Funnily enough, like in all her other films, EVERY other comic actor outshone her in this movie.If you want to watch a great film about AI taking over, watch Jexi."}, {"id": 98, "text": "I'm a huge McCarthy fan, she has great comedic timing, she can act and she is genuinely funny. I was looking forward to watching this movie, but I was so disappointed. She really deserves better than this. And the fact that Ben Falcone (Mr McCarthy) feels the need to pop up as irritating characters in her movies - Air Marshall John in Bridesmaids, Tammy's boss in Tammy, the Uber driver in Life Of The Party - makes him look desperate to hang from her coattails. And in Superintelligence we have the added irritation of James Cordon, who finds himself way funnier and talented than anyone else does. Exactly why the US seems to find him so endearing when here in the UK he is basically Smithy and a figure of mockery is baffling.The basic premise is that an AI looks for the most average person it can find, and finds Carol Peters. It decides to study her and talks to her through various electrical appliances. We have the inevitable scenes where McCarthy is transformed from the dowdy character she is at the beginning of the movie to a far more attractive looking woman, all with the standard 'let's do a funny dress up/makeover scene' that seems to be part and parcel of McCarthy's movies. The AI learns from Carol, but also sees humanity as something not worth saving so decides to wipe out all mankind. The government becomes involved - cue Falcone as a bumbling CIA agent *eyeroll* - after a phonecall from Carol's friend (who conveniently works at Microsoft researching AI presence online). We also have the fantastic Jean Smart as the female President (virtue signal received) who had a horrible dismissive attitude that reminded me of the female who failed to become president a few years ago. But none of this is quite as important as the AI's obsession with reuniting Carol with her ex George from three years ago - Bobby Cannavale playing the usual unlikeable wooden character he is synonymous with. Carol's aware of the impending human apocalypse yet she happily helps George pack up his home for his move to Ireland, because that's obviously way more important.Rewatch Bridesmaids or Life Of The Party.I was really looking forward to this movie, and it was a complete and utter letdown. It's more of a romantic soap opera than a sci-fi comedy. I actually found myself not caring what happened to anyone."}, {"id": 99, "text": "Initial Thoughts: As an overall this film was a washout. It's like the writers were given a grown tree and told to dig 50 feet to make sure the tree wouldn't go anywhere. Instead they only dug about 10 feet, and were then surprised that the tree was gone when the storm came. Yes, this movie has nothing to do with trees, and yes, it's supposed to be a light-hearted rom-com with some end of the world flare, but the actual ability to execute the intention of the producer, and make it enjoyable, was far from. From the get go I was left stunned with how bad the acting was. Everything felt fake and meaningless. I've never been a fan of Melissa McCarthy's, but each movie I watch with her, I'm always left with disappointment by the end. The romantic aspect felt superficial and never truly touched the heart. I could of cared less whether or not a relationship was formed by the end. The only good aspect to this film was the comedy, and I say that tenderly. Although I laughed through parts of the film, by the end the jokes started getting stale, and my attention started to wane as the end couldn't come quick enough. To finish off I will say this. The meaning of the film was good. Sometimes we need the push of a friend, or a super-intelligence, to help overcome our fears, and go after what we want.Overall: The premise of the film is bad, the comedy is ok, and the meaning of the film is good. However, as far as 2020 films go, this definitely falls in the category of, well, that's two hours of my life gone, and therefore goes on my do not recommend list.Enjoy the show!"}], "reviews_amount": 100}