{"name": "Jingle Jangle: A Christmas Journey", "titleId": "tt07736496", "reviews": [{"id": 0, "text": "Grab the family, get comfy &amp; enjoy great singing, acting, sets, &amp; animation. The people that rated this low apparently need more movies like this in their lives. It was beautiful, clean and added a bit of magic &amp; belief which is what we all need this Christmas. Wonderfully over the top - I highly recommend watching!!"}, {"id": 1, "text": "What a magical movie!!! The colors!! The costumes!!! The singing!!! The sets!!!! The magic!!! It's a cross between The Wiz and Greatest Showman. I enjoyed every minute and will surely watch Jingle Jangle every Christmas holiday going forward right alongside Polar Express and Elf.Jingle Jangle is such a pure, heartfelt movie. You will enjoy it."}, {"id": 2, "text": "I am a sucker for a good Christmas film, and a good underdog story. This one hit all the right notes. Yes, there are tooth-achingly cheesy moments-what would a good Christmas film be without those? But more importantly, when this movie hits your heartstrings, it really hits HOME. I was sobbing in the best, happy-cry way at multiple points, and when everything ties up with a bow at the end, it feels so truly well-earned. This captures the real meaning of Christmas-it's definitely going on the once-a-year Christmas film rotation."}, {"id": 3, "text": "Far beyond the usual Netflix Hallmark-style Christmas films, this one is high budget and very well produced. The musical numbers are fantastic and the costume design is marvellous. It's a tad cheesy and more than a little absurd, but the plot is solid and it's very charming."}, {"id": 4, "text": "Some people just have to spew hate but don't believe them. This is a WONDERFUL ADDITION to my list of 'watch every year' holiday movies with LOVELY ORIGINAL MUSIC and fun dancing. The cast's musical talent is off the charts and I love that it shows little girls as brilliant, and mathematical. I am so happy for my two young grand-daughters to have Journey to identify with."}, {"id": 5, "text": "Such a magical uplifting Christmas movie. Music elements make it even better. Just what is needed at this special time of year. Great cast, great acting, lovely story, great music, brilliant dancing and that extra touch of magic."}, {"id": 6, "text": "What a great Christmas musical comedy!! Filled with great performances, songs, characters, cinematography and direction. Definitely worth a look!!Tim Treakle"}, {"id": 7, "text": "I went in blind with this movie. I didn't watch the trailer. And I was pleasantly surprised. I love musicals hence my name. I adored some of the songs in the movie. The STORYLINE is EASY to follow if you pay attention. The people giving it negative reviews must be ADHD or just plain miserable and unimaginative. How can you say Felicia Rashad is crappy actor? What about Forrest Whittaker? Come on now. They are film veterans, y'all need to go back to bed and get back in on the right side.The story essentially is about family and believing in yourself when all hope is lost. The impossible is POSSIBLE if you have faith in your ability. And don't forget to ask for help when you need it the most! How hard is that to follow? Don't listen to the negative people!Watch it for yourself. Absolutely fantastical and purely for people with hearts!"}, {"id": 8, "text": "Absolutely wonderful Christmas movie. The costumes and sets are just stunning, brilliant actors and singing, the songs and choreography catchy and entertaining without being cheesy. Lovely cosy colourful movie to watch at any age."}, {"id": 9, "text": "It looks pretty and feels magical, but thats about it. The movie seems to want to check to many boxes at once and ends up forgetting to do the most important thing: be a good story. The story is rushed and not unique, the personalities feel completely fabricated and dialogs unrealistic. This movie is probably fun for very young children, but thats about it"}, {"id": 10, "text": "Great story line. Great actors. Beautiful staging with eye popping colors. Amazing singing and wonderful songs. Broadway on TV! I loved it. Not quite a Christmas movie, but What a great way to start the holiday season."}, {"id": 11, "text": "I love this movie!! So much Christmas magic and a beautiful story!! Yes i cried too"}, {"id": 12, "text": "Every moment of this movie was incredibly enjoyable to watch. From the set to the costumes and the wonderful actors. I had a smile on my face the entire time."}, {"id": 13, "text": "I just adored this movie from start to finish. I'm a huge fan of stage musicals and this definitely gave me a stage-musical feel all the way. The story's very heart-warming and I the message in it is even better - nothing's impossible when you believe it can be done. We lose so much of this feeling when we grow up that we most often lose our way and this clearly demonstrated this belief. Back to the film though - the sets were absolutely breath-taking, the music was fantastic and uplifting, the singing was truly awesome and the dancing was exceptional - the cast was fabulous too - it was a breath of fresh air to see such a fabulously diverse cast.Overall, this is one movie that will remain a favourite of mine for years and years to come &lt;3"}, {"id": 14, "text": "Looks amazing, sounds fantastic; and the costumes are nothing short of glorious. But this film needs to head back to the cutting room and loose about 30 minutes.with John Legend as producer, it's no surprise that the voices are impressive. The musical numbers and choreography top notch.The combination of digital animation and live action is seamless.But this film feels heavy and by the end of it, we were carrying kids to bed."}, {"id": 15, "text": "The diversity and talent of the cast and dancers, in combination with stunning production design, original animated transitions and world-building make Jingle Jangle the Christmas musical-fantasy classic unlike any other. Wow, David E. Talbert, wow."}, {"id": 16, "text": "This is a jumble of movies you've already seen. It's Wonder Imporium meets short circuit meets Christmas carol meets polar express. It has beautiful sets and a good cast but it's just a thrown together fruitcake of played out themes."}, {"id": 17, "text": "This was incredible! The story was so good, whether you're a kid or adult. Ignore what others say about trying too hard."}, {"id": 18, "text": "Children and most adults will probably love this film. It's got everything but in my opinion a little too much of everything. If you enjoy the greatest showman then you will recognize the similar music and choreography right off the bat. For me this movie is way too sugary, over the top and cliche without any real sincerity."}, {"id": 19, "text": "I'm not a fan of musicals, but I can give 10 stars if done right, like Frozen. On the plus side, this one does have the best sets I've seen in a long time and Forest Whitaker does a great job with his character. But the dialog and story are very weak and the songs are not inspiring at all. If I had it to do over again I'd skip this movie."}, {"id": 20, "text": "This movie is a magical ride and a very inspirational one if you have creative children. Loved every minute. Honestly don't know how anyone can write a bad review of it."}, {"id": 21, "text": "Recently, I took a Friday afternoon with my family to watch a Christmas movie. We were scrolling through our Netflix account when a spectacular cover with vivid colors, costumes, and steampunk aesthetics popped up in the recommended tab. Ever curious, my family decided on the title, Jingle Jangle: A Christmas Journey, for our evening's homemade theatre. I should note, holiday movies are one of my favorite traditions each year, so I was ecstatic about a brand-new release with a different take on the Christmas story. Released November 13, 2020, director and writer David Talbert took my family on a trip to the magical world of the fictional Jangle family. Complete with steampunk holiday magic, the story follows the famous inventions of the Jangle family toy store. Conflict arises when the antagonist steals plans for a future prosperous invention, leading to the downfall of the Jangle's fortune and toy store. Now, the fate of the Jangle's shop lies in the hands of Jeronicus Jangle's clever granddaughter, Journey. I would recommend the marvelous and sensational take on a Christmas movie because of the engaging set, magnificent musical numbers, and well turned out characters. I was a little nervous before starting the movie as the run time caught my eyes. The entirety of Jingle Jangle: A Christmas Journey lasted over two hours! However, only half an hour through the film, I became hooked on the artistic settings, environment, and stop-motion and CGI animations. I felt I could feel the effort poured into the glamourous buildings and detailed costumes, all through my TV screen. Despite the steampunk mood, the state of a Christmas town was evident. The high-quality camera captured each intricate brick, beam, and snowball in each scene. Overall, Rob Cameron's colorful set design earned my respect and attention during the lengthy Jingle Jangle: A Christmas Journey. The set was not the only aspect of the film to keep my concentration focused on the movie during the fantastical storyline. Music is provided by John Debney, who also contributed to numerous famous works such as Elf, The Jungle Book, and The Greatest Showman. Debney moves the tale along with tuneful numbers. One verse in, and I could tell the upcoming songs would be phenomenal. We found ourselves smiling and occasionally dancing along with the characters to upbeat music. To summarize, the music featured in the Netflix original added an enchanting element to the overall film. Further, the cast and characters in Jingle Jangle: A Christmas Journey amazed me. I recognized the name Forest Whitaker, who played the inventor Jeronicus Jangle, and Lisa Davina Phillip, who captivated me with her hilarious scenes and songs. Halfway into the movie, I did become worried the story would become monotonous and crowded as more and more characters continued to be introduced. Nevertheless, the ending nicely wraps up the storyline. The actors took the plot to another level through singing and character development. Since Jingle Jangle: A Christmas Journey is geared towards children, I found the movie to be predictable. However, I was not let down by the loveable characters, especially one adorable CGI robot, Buddy. In summary, I would suggest the Christmas themed musical, Jingle Jangle: A Christmas Journey, because of the intricate set, delightful soundtrack, and diverse characters. I would describe the film as wholesome and festive. A holiday must-see, the Netflix original left my family with wonder and joy."}, {"id": 22, "text": "This is a true authentic Christmas family movie!! I was captivated by the amazing cast. It was magically and now it will be a classic for my family!"}, {"id": 23, "text": "Feels like netflix wanted a bunch of things in this movie, but this resulted in little time for each keyword. There was no time appreciating any relationship and decisions. When the characters lack motivation and logic as well the movie becomes lackluster."}, {"id": 24, "text": "I enjoyed this musical so much! I didn't know it was a musical but when they started to sing, the voices were so good ! Such a cute story reminding me of Neverending Story or The Princess Bride. The sets and costuming were top rate and of course Forrest Whitaker and P. Rashad! I love her sweet smile! Forrest is SUCH a great actor! Thanks everyone!"}, {"id": 25, "text": "This is a wonderful movie that everyone should watch! My two-year-old even loved it. It has great music, singing, dancing and acting. I could say more but just view it for yourself."}, {"id": 26, "text": "The costumes, hair, sets all AMAZING! I liked the story and premise too. The child actors are great, Journey and Edison. The songs however....torturous to sit through. I actually had to fast forward through many of them. They are not catchy nor inspiring. They actually take away from the movie. They should have cut 50% or more of them and shortened the movie to 90 minutes. The movie is over 2hrs long. I found myself pausing it several times and going and doing other things it was so hard to sit through."}, {"id": 27, "text": "Beautiful movie, great actors, my little girls recommend it..."}, {"id": 28, "text": "It's not horrible but definitely passable. The story line is just so predictable and familiar like bits of other movies were pieces together for this one. Definitely not Forrest Whitaker's best performance but some actors were fairly good. Also some weird parts that didn't quite fit or provide much to the story."}, {"id": 29, "text": "The robot 'Buddy' was treated with E.T level importance, the kids just MUST risk their lives to retrieve it, which would be fine were it not for the fact the kids spent only one (very) short scene engaging with it. There was never a connection formed for the kids (or the audience) to really care whether the robot would be saved, or would be repaired. By the same token the inventor and his love interest shared only one musical number together in the beginning, and then were apart for the rest of the film, and so once again it was very hard to care if they would end up back together.Only upside to the film is the musical numbers (great dancing, great visuals). Skip the rest of the film (it drags), and just watch those segments on youtube or something."}, {"id": 30, "text": "Finally a colorful Holiday story that was so enjoyable and filled with the joy and magic of the holidays!!! Thank you to the WONDERFUL cast!!!! Just BELIEVE!!!"}, {"id": 31, "text": "LOVED THIS MOVIE! I just adored this movie from start to finish. I'm a huge fan of stage musicals and this definitely gave me a stage-musical feel all the way. The story's very heart-warming and I the message in it is even better - nothing's impossible when you believe it can be done. We lose so much of this feeling when we grow up that we most often lose our way and this clearly demonstrated this belief. Back to the film though - the sets were absolutely breath-taking, the music was fantastic and uplifting, the singing was truly awesome and the dancing was exceptional - the cast was fabulous too - it was a breath of fresh air to see such a fabulously diverse cast.Overall, this is one movie that will remain a favourite of mine for years and years to come"}, {"id": 32, "text": "Very entertaining, high energy choreography , great dramatics, well designed costumes and soulful. I loved Miles and Miles by Marshida it was inspiring and uplifting as the movie. I have watched it ten times so far.😂"}, {"id": 33, "text": "The music, the theatrics, the dancing, the colors, and THE VOICES! WOW! It made my heart happy and we need that with everything going on. I'm sure I will watch it multiple times during this holiday season with family and friends. #MochaHolidays #JingleJangle #HolidayMagic"}, {"id": 34, "text": "Where do I start. Bad acting, must have used most of the budget on Forrest Whittaker. The songs were out of context for the moment, completely forced with lyrics that were nonsense. The plot is ok, but some if it just doesnt make sense. Its about an hour too long, its padded out terrible songs and scenes which are completely pointless offering nothing to the story."}, {"id": 35, "text": "One of the worst if not the worst Christmas movie I've ever seen. The disappointment is proportional to the size of the production, what a huge waste of resources. Photography and costumes are the only things I save. The story is terrible. The characters are a bunch of stereotypes put together randomly and the soundtrack is the pinnacle of bad taste for a Christmas movie. I am very surprised to read so many positive comments."}, {"id": 36, "text": "The first and last 15 minutes were wonderful. The opening number was so promising and it went downhill from there. I adore Christmas movies, but this started dragging 20 minutes in until nearly the end.I did LOVE the representation and choreography and costuming and sets. But the story and Pace totally lost me-they should've shortened it and cut some songs. It had so much potential to be much better."}, {"id": 37, "text": "I don't know I was excited to watch this, but is pretty boring, 40 minutes too long. No real plot and nothing to do with Christmas in the first 1 :49 minutes"}, {"id": 38, "text": "While my 2 year old was fascinated with the movie, it was not very entertaining for me. Combine the big dancing numbers of the Greatest Showman, with the set from Mr. Magorium's Wonder Emporium with any Disney movie and you've seen the movie. Obvious Lip-syncing. The singing and dancing Shakespearean Choic are just too over the top. Could have been good without all the unneeded theatrics."}, {"id": 39, "text": "Listen, I love cheesy Christmas movies as much as the next person, and seeing a primarily black cast in a stand-alone original movie was amazing! The characters themselves were hilarious and I believed in almost every actor on screen. The crew was literally amazing, and the movie isn't a horribly terrible movie at all...That being said, I couldn't finish it. Maybe it's the overtones of very obvious, repetitive (and honestly not all that great) singing, or the weird dealings with family dynamics... but that kind of ruined the vibe for me? I was watching and all the time I would enjoy the characters, yet cringe at every new stupid little annoying thing they HAD to add for ingenuity...Sometimes a Christmas movie doesn't have to be THAT complicated, you know."}, {"id": 40, "text": "This movie is not just for kids! It is so creative. First off, the costumes are spectacular, I mean Oscar worthy. The musical numbers are great. They have top notch actors. I love the positive theme of being intelligent, creative and inventive. We need more films like this that celebrate diversity, hope, possibilities and imagination."}, {"id": 41, "text": "Some you win some you lose this doesn't work it's dreadful"}, {"id": 42, "text": "I am a huge Christmas movie watcher, and this may be one of the best I've seen lately. The story is original and heartwarming. The characters are immersive with wonderful actors. The costumes and sets amazing!!! Every scene is a delight for the eyes. The songs are so powerful. This movie is for children and adults, and should be shared together. Whoever put this together, thank you!!! This put more happiness and holiday cheer in my heart than any movie in years 💖"}, {"id": 43, "text": "What a lovely, charming Christmas movie. Journey is just fantastic. Watch by yourself, with the kids or grandkids. You'll be glad you did."}, {"id": 44, "text": "Biggest jumble of a movie since The Greatest Showman. Usually love musicals but this just isn't good. For a Christmas film, it didn't feel very festive despite the snow on the ground. Just when you started to get a bit of plot then they'd start with yet another song. Feels like a pick and mix of popular films that just don't gel. So disappointing. Oh Forrest what we're you thinking?"}, {"id": 45, "text": "Deus ex machina anyone?The opening scene has promise, but then quickly falls. The songs are good along with the dance, but the script, the story, is terrible.What I have a problem with is how he creates a living, talking toy, then completely ignores it, along with his wife and child. It's as if they have to ignore it and then leave it along with the apprentice so that the story can have a dramatic plan of evil.It's too obvious and forced.Then he suddenly returns, as if Hey we are going to celebrate with you and you are part of the team but he's been ignoring him for how long? And just in the nick of time to find out his apprentice has run off with his creation!!!This is ridiculous. It could have been so much better."}, {"id": 46, "text": "Amazing cast, visually stunning, &amp; a unique story. It was a little long at 2 hours, but would absolutely recommend to others. A solid choice to add to your holiday line up each year."}, {"id": 47, "text": "All I will say is this: Netflix should have made it obvious from the trailer that this was a musical."}, {"id": 48, "text": "Don't believe user review who give rating 10 It's really bad move."}, {"id": 49, "text": "This is a very enjoyable movie for the whole family. It has the feeling of a play. Hopefully someone will adapt it into a play. I would really like to see it live on the stage."}, {"id": 50, "text": "So the positives. General idea and story telling ok. Not really an original idea as it has a load of influences. You can clearly see the main influence is the Greatest showman. Easy watch that require you to put little effort into watching to understand what's going on. Some kids will enjoy it but I think they'll get bored quite fast.Songs. loads and loads of songs A bit too much. Nearly every scene has one. Over acting over singing over everything.Critics will love it due to its diverse cast but I don't rate films that kind of way.I like forest Whitaker and Keegan-Michael Key performances. 4 stars."}, {"id": 51, "text": "I wanted to like this movie. So much of it it says you should like it: The Greatest Showman like soundtrack, the Tinkerbell like magic of belief, the inclusion of STEM in the magic, the Polar Express like roller coaster-esque ride, the robot that comes to life an unites everyone, etcAnd for me all of those ended up being the reasons I DIDN'T like this movie. So much of it felt like the writers were picking and choosing bits from other movies that made it big and adding it to this, only it never really meshed together in a cohesive way.SPOILERS ahead.......Forest Whittaker's character is a wonderful inventor who begins to lose his mojo when his apprentice steals the Mexican Matador doll that he brought to life. (And the doll somehow convinced him to do it....and let's not even worry about the magical elixer that he ordered that somehow brought the doll to life but he never managed to reorder or use again.....) And then his wife inexplicably dies and he gives up on everything-including his daughter. Really felt like a forced attempt to pull on our heartstrings.The grand daughter shows up because she can see math equations just like grandpa could and she wants to meet him despite her mom being estranged from him for years. While there she discovers a robot her mother built but never got to work that magically comes to life because she believed it could....and then for no known reason it makes her fly as well, until grandpa comes around and his disbelief makes it stop.The former apprentice steals it because he can't invent anything that works on his own. Grand-daughter attempts a rescue, grandpa comes and can only save her if he believes in himself again and then works out a magical equation that saves the day.This movie just tries to hard. There is also a love interest story line for both grandpa and granddaughter, the bad apprentice gets his in the end but grandpa melts his heart through a gift so even he gets a semblance of a happy ending. Oh, and it is all set around Christmas time so you get all those feel good emotions too. I wanted to like this movie. I love musicals, Christmas movies, and happy endings. But there was just too much going on in an attempt to make this BIG that I never really connected to anything."}, {"id": 52, "text": "It's a musical but doesn't know about it.child actors disaster. target; broadway result; disney channel. I would like to write at length, but you get tired just reading. Netflix Christmas/Noel/New Year productions are getting worse every year."}, {"id": 53, "text": "This film never really seems to know what it wants to be, and in trying to hit so many genres, fails badly at all of them. So we get huge musical numbers (which the songs aren't strong enough to carry), a family separation story, a financial crisis, an evil villain, the need to believe, schmaltzy cute kids (who are just plain annoying), weak comic turns....oh and for good measure, throw a Wall-E / Short Circuit-esque robot in there as a McGuffin with all the charm and personality of a vacuum cleaner.Plot points go unexplained, characters under written, and the acting is so hammy. Best thing about the whole film is the use of Crossness Pumping Station for the interiors of the factory."}, {"id": 54, "text": "A lot of fake 10/10 reviews on this movie. The special effects and costumes were superb, however, the movie was terrible. I could not even watch over half of it. This is the absolute worst Christmas movie I have ever seen."}, {"id": 55, "text": "Don't waste your time on it. Rewatch a classic christmas film instead"}, {"id": 56, "text": "Such a fun holiday movie!! I normally fall asleep during kids movies but I was awake the whole time loved all the songs and the feel good spirit!!"}, {"id": 57, "text": "You may be wondering... It's very suspicious that there are SO MANY reviews with 10 and 9 saying this movie was the best movie they have seen in their life, don't you think?I get that other people would like this (predictable, long and cringy) movie, because of great photography and sets, but 10? Really? Compared to what?I would only recommend this if you have kids from 5-10. Don't watch it at night, they'll fall asleep (as I did the first time).This is the type of musical were songs interrupt and pause the plot, without adding any value.I can only say: see it yourself and you'll remember my comment."}, {"id": 58, "text": "The story was fantastic, it had everything within it to be great: good storyline, stellar cast, Broadway vibe. Just everything was too much. Over acting, over singing, over trying. It's good, but not a must watch, and not a watch again"}, {"id": 59, "text": "Knock off version of the Greatest showman &amp; puss and boots...but for the black community, lost interest after the first number. Seems pointed towards children with ADHD. Way too much going on to focus on any actual storyline."}, {"id": 60, "text": "Conceited, contrived, trying too hard. Good cinematography though."}, {"id": 61, "text": "This movie is plain awful! Have seen much better Christmas movies on the Hallmark Channel. Be warned! Do not waste your time on this garbage movie!"}, {"id": 62, "text": "Skips around, hard to follow and the concept is confused."}, {"id": 63, "text": "I watched this with my children last night and we loved it. The visuals and design are stunning and well thought out. The music was catchy, uplifting and beautifully sung. The choreography made you want to get up and dance. As an adult who has watched lots of Christmas films there's always similar themes that you can pick up on but I think that's part of a Christmas film is recognising that hope, joy, faith and belief are usually going to be a part of it. The animated parts were amazing as well and then on top of all of that, the representation made my heart swell. My child even said look she has skin like my skin as he stared at the screen with pure wonderment. This is definitely a new holiday classic for us."}, {"id": 64, "text": "This Movie/Musical is incomparable and is certainly not your average film. Jingle Jangle will wow you in multiple ways. The storyline and plot are amazing and will keep you glued to the tube. The cast is hand-picked and made each part believable; especially the newby, little Miss Madelin Mills ... who plays the part of Journey Jangle. Her charisma is magnetic. WHO IS SHE AND WHERE DID SHE COME FROM? We'd like to see more of her.The music is electrifying and makes you mumble the lyrics even if you don't know the music pieces. The vocal choices displayed in each song were unpredictable and more inviting than your traditional Broadway musical. This movie is sure to get rave reviews. A MUST SEE! A MUST RE-SEE!"}, {"id": 65, "text": "The trailer was so promising and it just did not deliver. Production - decent Acting - ok Songs - bad Story - poor Characters - boring"}, {"id": 66, "text": "It's cringe, stupid, makes no sense, and just a Greatest Showman wannabe"}, {"id": 67, "text": "This is a contrived ripoff combination of The Santa Clause 3, The Polar Express and Wall-E, with a musical format. The continuity and viewer's connection for the characters is completely erratic and weak at best. It doesn't even work as a musical. The African-American cast is strong, but the writing, directing and editing production doesn't back it up. At times, the film is even laughable, for hokey hilarity, not for quality humor. This is easily the most disappointing Netflix product I've watched."}, {"id": 68, "text": "Mumbled dialogue, waaaaaay too long and out of place musical numbers. It has all the ingredients to make a blockbuster, but widely misses the mark. The first 15 minutes are excellent, but it takes a dark turn after that and starts to meander.Avoid if you value your time."}, {"id": 69, "text": "Just so predictable and a melange of so many different films, Wonka/ The Greatest Showman to name a couple! Surprising Forrest Whittaker was part of this considering his repertoire! Animation was brilliant tho but not enough to carry such a cheesy film, didn't have much Xmas spirit either, fell very short."}, {"id": 70, "text": "Too long, bad acting, overdoing it way too much. Very disappointing. Besides the sets and the costumes it's a waste of time"}, {"id": 71, "text": "Feels more like a BLM statement than a real Christmas movie. Equality is not this. The story does not feel like a Christmas movie at all. It's a banal fantasy flick."}, {"id": 72, "text": "Utterly dreadful nothing to recommend poor very very poor"}, {"id": 73, "text": "Jingle Jangle a Christmas journey PG Director: David E Talbert Starring: Forest Whitaker, Keegan Michael Key, Hugh Bonneville, Anika Noni Rose, Madalen Mills, Phylicia Rashad, Ricky Martin, justin cornwell, Sharon Rose, Lisa Davina Phillip, Kieron L Dyer, Miles Barrow, Diaana Babnicova etcOverall rating 95/100Jingle jangle a Christmas journey is about an imaginary world that comes to life in a holiday tale about an eccentric toymaker, his adventurous granddaughter, and a magic invention that has the power to change their lives forever. Wow what an absolutely amazing and delightful holiday movie Jingle Jangle Christmas was, there are so many good things to say about this so lets get started.First of all the cinematography was fantastic, the movie had a charming tone, great soundtrack and a unique narrative/ point of view. This movie looked absolutely fantastic, the movies visual creativity and world building was truly fantastic, it just felt like Christmas in one amazing visual explosion of colour amazing set locations and creativity for the story world. The movie also had a very charming tone, every single component of the movie was charming and made you feel all warm inside just like a good Christmas movie should do, this charm never went away and in fact just got better and better as the movie went along. The soundtrack was also fantastic, there was some very catchy and easy to listen to songs that just put a huge smile on my face, and the vocal talent involved was excellent. I Also loved the films unique narrative and viewpoint, telling the story from the perspective of 2 kids and their grandma was really interesting and tied together with the films themes, it also made the film feel like one massive story book which I absolutely loved as well, also adding to the movies visual creativity.I also loved the movies representation, likeable characters, performances and chemistry between characters. This movies racial representation was absolutely excellent, I loved that the majority of the cast was ethnically diverse, it made a refreshing change for a holiday movie and worked excellently. The movie also had incredibly likeable and loveable characters that were very easy to connect with, The granddaughter played by Madalen Mills had heaps of charm and the way she changed Jeronicuses (Forest Whitaker) life and bought the light and happiness back for him was just excellent. The chemistry between them both was also excellent, all the relationships within the movie felt very real and authentic and handled with great emotion and sensitivity. The performances themselves were also very good, and believable adding to the emotion of the movie which I will talk about soon.My only slight negative for the movie would be that it was slightly generic in places. The movie had slightly generic dialogue and characters that has been seen in previous holiday movies especially with the villain being someone supposedly cast aside and getting popularity for themselves.My next few positives would be the character background, set up with the villain and interesting toy creations. I loved the attention to detail and character background for Jeronicus, seeing him happy when he was younger and establishing and developing his relationship between his daughter was excellently done, it didn't feel rushed and established the desired tone and themes and established the characters well,. I also did like the set up with the villain, him being set aside from Jeronicus and his ideas and creations set the villains intentions out well and this transitioned well into the main plot of the movie with an excellent and campy performance from Keegan Michael Key who did a fantastic job. The toy creations were also really creative and were visually striking.My final few positives would be the deep themes, emotional weight and heart-warming ending. The movie actually had a lot of deep themes that was handled very well, how the movie tackled the process of grief and how that effects the relationships within family was very emotional and made the film have a surprising amount of depth, this added to the emotional weight of the movie a lot, the movie which was helped by its performances was genuinely emotional, in its handling of the relationship between Jeronicus and his daughter and will get to a lot of people. The ending was also extremely heart-warming, the movie had very satisfying endings for all of the character arcs and ended the movie perfectly.Overall, Jingle Jangle Christmas is a fantastic holiday movie, with fantastic performances, a great soundtrack, with heaps of charm and is a Christmas classic that I will be revisiting."}, {"id": 74, "text": "The Movie is a real disaster. I could not understand what was going on in the entire movie ! The acting skills were average. It is a real time slayer."}, {"id": 75, "text": "Very disappointing Christmas movie,after the year we've all had I watched this in anticipation of a much needed morale lifting film. The story,acting and the songs were very poor. I wanted it to be good but it wasn't,the only bright spark was Forest Whitaker as he stood out amongst some very poor actors. Am hoping for better off Christmas Chronicles 2."}, {"id": 76, "text": "Awful script, badly acted, silly songs. This movie is such a horrible mess that I feel embarrassed for the whole production. Money doesn't make a film good. Netflix placed another bad movie in their hall of shame."}, {"id": 77, "text": "This movie was incredible. I Hate Christmas movies. They're boring and cliche and just feel pointless most of the time.This was full of life and whimsy. The costumes, music, and cast were INCREDIBLE. It has the warmth of Christmas anesthetics without being in your face and bland about it. As someone who does not have a watch around the holidays list, this has absolutely created it"}, {"id": 78, "text": "Such an incredible feel good movie. Incredible costume designs. Great music. Forrest Whitaker does such a great solo performance and truly performs the sorrow of his character. The little girl is a true star in the marking with a beautiful voice."}, {"id": 79, "text": "Ignore the bigots this is not a film about race and not should it be discussed as one, it is simply a delight! Magical and full of charm please watch it it's a real treat"}, {"id": 80, "text": "They're boys, so generally immune to musicals, or so I thought. But they watched every minute of this spectacular holiday movie. A treat for every single sense, eye popping colours, award worthy costumes, and what incredible voices! We all loved every minute and this will become a holiday favourite. Witty dialogue, sweet messaging, what's not to love? Thanks for creating a movie for the entire family, albeit Granny is now inundated with requests for a Buddy robot..."}, {"id": 81, "text": "Bunch of bullocks. If It's magic; It's magic. If It's science fiction; It's science fiction. This is neither of such genres."}, {"id": 82, "text": "This feels and looks like a made for tv rip off of the greatest showman with less memorable songs and a better script. Unfortunately the bland songs stop any momentum of storyline you wish they'd just skip to the next part. Great to see a mainly whole cast of black actors. Visuals are also excellent."}, {"id": 83, "text": "Sure it would be interesting for children. Unfortunately I was a little bit disappointed - with everything : cast, story, music."}, {"id": 84, "text": "I knew nothing about this film; my brother recommended it and I watched. Wow! What a wonderful film. I don't care much for musicals, (probably why my brother didn't mention it) , but I thouroughly enjoyed this one. The costumes, sets, music, actors were believable, and and the singing uplifting. Great timing to release a film like this in 2020. I think we all could use a little magic and belief this year. It's added to my must-watch-annualy list for the Holidays."}, {"id": 85, "text": "I wanted to see a movie not a musical. Singing is ok but the songs take to long. Great atmosphere and sets but when i am 15min on the movie and had to listen to 2 songs that takes +-4 minutes ... Sorry i switched it off. And the actors are over acting it would be good on a Broadway show not in a movie."}, {"id": 86, "text": "Sets, costumes, singing and acting is wonderfully magical. Well worth your time! Definitely one of our new family favorites!"}, {"id": 87, "text": "In these bleak times Jingle Jangle is the musical salve we could all use! Fantastically bright sets, rousing songs, wonderful dancing, and a whole lot of heart from these characters who may be new but immediately feel familiar and warm. The amazing children, especially Madalen Mills, definitely drive the show; but Forest Whittaker is achingly endearing and Keegan Michael-Key is delightfully warped. Please keep making more movies like this, where we get to see diverse casts, centered on stories of their lives. Representation matters so we can show our kids the full hearts and souls of all people."}, {"id": 88, "text": "Beautiful sets, the colors, the animations, etc., but... Too many elements, too many pointless characters, scenes, songs, messages... It's like whoever created it were told that they only had one chance to make a movie in their lifetime so they throw in every idea they had and this waffly movie came out. It's like Hugo, meets *batteries mot included, Christmas Carrol, Toy Story, the cat in the hat, wall-e.."}, {"id": 89, "text": "I was surprised at how good this movie/musical was. In a world of remakes it was good to see a new storyline. The music, the costumes, the settings, the actors...all amazing. I hope this makes it to DVD so I can add it to my collection."}, {"id": 90, "text": "Such a well done story with great music and super fun characters! I loved the costumes! The story was so well told and the acting was perfect. Nice job! We will watch it every year. I love the holidays."}, {"id": 91, "text": "Magical! Brilliant! Heartwarming! Spectacular! This movie is an instant classic. An amazing cast! The set was fantastic, the acting, music and choreography was superb. I haven't watched an entire holiday show in years, I didn't miss a minute of Jingle Jangle."}, {"id": 92, "text": "Once upon a time there was an inventor who was a happy husband and father. And so it begins...After watching countless christmas movies, where the girl gets the guy, or the father finally meets his kids, all movies have the same plot, same setup and the same ending. Merry Christmas.But now there comes a movie which is different, refreshing and has a great twist to the story. A movie with music, dancing, singing and drama that is so good it doesn't need you to have kids to watch this. Yes it might be a bit over the top, but thats what Christmas is all about.So sit down, grab yourself a drink and enjoy 2 hours of pure fun and holiday spirit!"}, {"id": 93, "text": "I don't know why the people dress the way they do in this movie but I LOVE it. Beautiful to watch and listen to. Lovely story."}, {"id": 94, "text": "Every moment of this movie was magical. I do not understand all the haters..."}, {"id": 95, "text": "Great story, great visuals (costumes and sets), great actors and great music! Loved everything about this movie. It's a creative mix of magic and STEM. Some cliche, but so much more about love, belief, pursuit of dreams and possibilities.I agree it's not a traditional Christmas movie and I am perfectly ok with that! This movie can be watched anytime to get a quick dose of humor, hope and wonder.Watched it a few times and found new parts to enjoy each time - and for me, that's the true test of a good movie. Give it a chance, if you don't like it my feelings won't be hurt. (Owww! I'm ok!)"}, {"id": 96, "text": "Omg the soundtrack is sooooo good! I absolutely love this magical film. Slightly disappointed with the fan escape ending - a little too unrealistic but apart from that it seriously got me in the mood for Christmas. Lovely lovely film"}, {"id": 97, "text": "This may be one of my favorite movies I've seen in a while. The magic, the costumes, the music, the actors, the steampunk vibe, the story, the dance choreography, I love it all. I hope they make a 2nd movie. And I hope to see more of Madalen Mills, she reminds me of a little Janelle Monae."}, {"id": 98, "text": "This is easily, the best film I have seen this year of 2020!Everything is top notch. The music. The dancing. The performances-particularly the vocals. The costumes. The sets.Everything is pitch perfect.It's a unique and charming story with a wonderful message about believing in yourself. A great movie for kids."}, {"id": 99, "text": "This movie has simply become my favourite christmas movie of all time. It was such a delight to watch!!! All of it was amazing, the effects, the dancing, the casting. THERE'S MAGIC AND ROBOTS!???? LOVELY VICTORIAN DRESSES AND HIPHOP DANCING!??? I couldn't have asked for more honestly, it was A REAL delight, and way better than your cliche boy meets girl Christmas. It was very female empower-ish, AND it had a ton of representation for black and minority people.Was my favourite christmas movie of all times, I hope it matures well :)"}, {"id": 100, "text": "I loved every single minute of it ! What's not to like ? Singing, dancing , fantastic costumes, good story line."}, {"id": 101, "text": "Since when did content on Netflix become so wet? Have I been hit on the head or are they trying to reduce the populus to drones now they have a captive audience...."}, {"id": 102, "text": "Jingle Jangle: A Christmas journey is a 2020 American musical fantasy film. I saw the trailers on Netflix and thought it looked really good, so me and my mum decided to watch it on a Saturday nite in lockdown. The storyline was okay, on the other hand the music was really good. I wouldn't say this movie is 10 as I have seen much better musicals in my time but was okay to watch. I think maybe children might like it but some scenes are more for adults as children might not understand the storyline. The movie was hyped up to much and was not as good as thought it would be. A little disappointed but overall it was okay."}, {"id": 103, "text": "Got bored fell asleep no story line acting was poor watching my grass grow was more interesting."}, {"id": 104, "text": "Adored this Movie. I rmbr wen David E Talbert used to Produce Plays. Your work is Outstanding from the Cast to the Musical numbers and Dance. God Bless You🌹"}, {"id": 105, "text": "Lovely characters, commendable well-known actors (the young lady playing Journey is marvelous), vibrant costuming and choreography, but....though it really does have a Greatest Showman vibe, the flipping back and forth between animation, puppetry, cgi, live, now versus then versus story-telling was just exhausting. Greatest Showman is riveting and I watch it often. This movie though, I can't keep the storyline straight. Every time I think I'm focused, there's another overly loud, overwhelming musical number and I'm lost again. I wanted to like this more and I tried to finish, but it's giving me a headache so I'm bailing out. Good try though."}, {"id": 106, "text": "I'll admit that once I realized that it was a musical watching the trailer I lost interest but wanted to put something for my 6 year old daughter that was Christmasy ....I was immediately HOOKED!!! The story is just magical! The songs truly catch you where I found myself wanting to sing along, the costumes and the set...everything just comes together so beautifully!! The actors did qn amazing job especially little Journey and it really captures the heart of Christmas and the joy we all need this time of year especially during this past pandemic and 2020 being well..not the best. I will definitely rewatch again with the whole family and make it a holiday tradition to watch every year. Thank you Netflix for this wonderful and magical movie!!! Now I feel like watching The Greatest Showman 😆❤🎄** I'm glad I chose this movie for my first review **"}, {"id": 107, "text": "I watched this earlier and was amazed It's such a good film deffinatly in my top 5 , I really strongly recommend it"}, {"id": 108, "text": "Great feel good family movie!!! We absolutely loved the songs and wardrobe. Beautifully done"}, {"id": 109, "text": "I watched this movie with my husband and we both were touched, enlightened, entertained, dared to dream and felt every emotion we felt watching Rudolph The Red Nosed Reindeer! For a few hours, we were able to forget politics, covid-19 and everything disheartening! This musical was jazzy, cultural, diverse and everything a holiday movie should be!!!!"}, {"id": 110, "text": "A Christmas movie that will certainly go down in history, this movie was a delight from one spell-binding scene to the next.Great acting, singing, and dancing - with colorful period pieces and costumes, this is a must, must see for the holidays.A delightful cast and a fantastique story line, a classic and more makes this the first place movie of the season. It nudges out all competition.You'll watch it again and again; not just during every holiday season - but as soon as it ends, you'll want to turn around and watch it again!"}, {"id": 111, "text": "It's hilarious to me to read the reviews and see people saying this is overally racial??? I think this was a breath of fresh air after everything that's been happening this year, specifically the stupid race war. The one or two films that they have under they're belt compared to the MILLIONS of predominantly white films? Yeah I've seen those movies before this was something different! Hahah what a joke people are. It's sickening that people watch a movie and the first thought that comes to mind is RACE!!Anyways my one con on this would be timing and singing other then that outstanding Christmas movie. Great start to our families Christmas movie night."}, {"id": 112, "text": "Pretty boring like most new Christmas films very shallow and has no heart to it.It also has a musical element too probably because of Hamilton's popularity, maybe I feel that way because the songs have a similar feel to Hamilton but very generic, without the wit and even sometimes don't even rhyme. Maybe a fun movie for kids but eeehhh. Though Whitaker and Michael Key are good and the visual effects are surprisingly great. But overall it's just a boring and extremely long for a basic plot."}, {"id": 113, "text": "They would prefer to watch another cookie cutter Hallmark Christmas movie. This is an Instant Classic! Period. Different, fun, something your kids can follow. Characters your kids can look up to. So what if it has a Greatest Showman vibe? Why is that negative? We lived that too!"}, {"id": 114, "text": "This is a Christmas film I will definitely be adding to the holiday line up. It's really good with stellar cast, great animation and visuals for this especially Christmas season. Don't believe the low criticism saying it's a waste of time. If you have the feeling of imagination and Christmas spirit you'll like the film."}, {"id": 115, "text": "This is not your typical Christmas movie and in a good way!"}, {"id": 116, "text": "I'm not a big musical movie lover, but this movie took me so many places. I laughed, I cried, I got goosebumps.... I was taken back to childhood feelings of love, imagination, excitement, hope and wonder. It was absolutely heart felt and I can't wait to add it to my family movie library."}, {"id": 117, "text": "If you are expecting a Christmas film, you might be a little disappointed, but if you are looking for a family-friendly fantasy film, you will most likely find it. Well done, but not the big hit."}, {"id": 118, "text": "I don't know if I would call this a kids movie, some kids may like this. My eldest (that is 8) liked this, and I thought it was a fantastic film.The cast was great, Forrest Whitaker is at his finest as an inventor and man who lost everything and turned into a grumpy lost man who drove his family away and his dreams.Once his granddaughter Journey comes into his life, the magic in him awakens again. The point of the story is a broken family finding their way back to each other.The secondary characters in this film were great as well, I loved (Lisa Davina Phillip) who plays Ms. Johnston, she was hilarious. Keegan-Michael Kay as Gustafson was fantastic as well. He does great in multiple roles he plays. The outstanding role in this film is the young actress who plays Journey (Madalen Mills). She brought the whole film together.Besides the cast I have to give it up to the costume designers, I loved the outfits in this film it definitely had a more steampunk feel to it and I thought everyone looked great. This film will definitely not be for everyone, there are people out there who don't care for musicals, but I will say I thoroughly enjoyed this film."}, {"id": 119, "text": "The visuals and story were so beautiful. The cast is amazing. This will become a new classic to watch every Christmas season."}, {"id": 120, "text": "A cinematic masterpiece, filled will color, sadness, and joy. A different type of Christmas story that was an instant classic."}, {"id": 121, "text": "One of the best Christmas movies I have ever seen. It is just beautiful and it passes you the Christmas spirit. Also the picture, the songs, the music, the costumes, the dances, all wonderful. I was impressed by this movie as it was just a random movie I chose to see on Netflix. Just beautiful:)"}, {"id": 122, "text": "Great musical! Fun story. We enjoyed the magic and the message of believing in yourself."}, {"id": 123, "text": "I call it a cross between Hugo and The Greatest Showman with a flavor all its own. This movie is so special. It's creative, entertaining, empowering and heartwarming. Everything you want in a Christmas movie.The singing was an unexpected surprise. The animation was intriguing and costumes were whimsical and gave each character their own personality.There is nothing objectionable in this movie, except the poor marketing. You say Phylicia Rashad, I'm there. Lead with that. The title is off putting and the preview image is a bit creepy. It turned my 10 year old off. I think many may over look this movie and miss out on something really special but I hope I'm wrong."}, {"id": 124, "text": "I really enjoyed this movie from beginning to end. The music and costumes are fantastic. And oh, the CHOREO. AMAZING. I would have liked a bit more fluidity in the character arc for Jeronicus, but that's my main critique. I'll be watching this every year!"}, {"id": 125, "text": "What a fun movie! Great music, fun costumes, likable characters and a unique storyline. This is not just a kid's movie. I'll be watching this every year for sure. Thoroughly enjoyable!"}, {"id": 126, "text": "This movie was surprisingly good. Forest Whitaker, what an actor, what a singer.I'm not into the kind of shove it down your throat identity politics coming out of the US these days, so i was a little apprehensive at before putting on this almost all black casted movie. There is not much on Netflix these days, so i have it a whirl, and it really did not disappoint. The singing is great, it's funny in spots, Forest Whitaker showed he has still got it, touching near the end, and the Buddy 3000 had my kids jumping up and down with excitement. A multiple better than Christmas Chronicles 2.With all the lazy garbage on TV these days, where half the producers seem to put their feet up once they have come up with a good premise, this movie is worth a shot!"}, {"id": 127, "text": "Watched with 2 6years old and a 13 yr old. Brilliant film. Like a Christmas greatest showman"}, {"id": 128, "text": "This is one of the best Christmas movies I have seen in a while. Truly magical and the story was actually quite emotional. Everything looks absolutely vibrant! My only complaint is that it feels a little bit too long for what it actually delivers but it was definitely worth it. Loved all parts with the mail woman!"}, {"id": 129, "text": "Can highly recommend Jingle Jangle on Netflix for some festive family viewing. Whilst not massively Christmassy, it's a musical extravaganza full of soul, wonder and adventure. Part Greatest Showman with a sprinkle of Wall-E and a few nods to Spielberg. The visual aesthetic is gorgeous too, vibrant and whimsical."}, {"id": 130, "text": "This was a lot of fun to watch! I really enjoyed that it reminded me of or included references to musicals like Hamilton, Rent, Annie, Mamma Mia, Hairspray, Phantom of the Opera, and The Little Mermaid and movies such as The Greatest Showman, Toy Story, Harry Potter, The Wizard of Oz, Mary Poppins, Peter Pan, Charlie and the Chocolate Factory, Hugo, The Santa Clause, Elf, The Polar Express, The Notebook, Star Wars, Wall-E, E.T., and Frozen.The music/score is fantastic, the cast is great, costumes are super creative, and it is such a magical, heartwarming, uplifting story!"}, {"id": 131, "text": "Great musical score and songs. Costumes and sets are amazing, this is a new holiday classic!"}, {"id": 132, "text": "Amazing and entertaining. The story and music is so engaging. Such a great family film."}, {"id": 133, "text": "It's not a revamp of any classic - it's new. I loved it and Forrest's voice blew me away."}, {"id": 134, "text": "This was awesome. I grew up watching Fame and Debbie Allen even came to my school to take us to dance. So, this is the movie I would've loved as a kid. I put myself in the mood for this after the first song. Then got some cake and egg nog. All giddy with sugar: that's the way to watch it."}, {"id": 135, "text": "Loved it! Visually stunning, amazing music, singing and outrageous choreography, in addition the fabulously talented cast. Amazing costumes and set design truly an instant classic for the whole family! A must watch."}, {"id": 136, "text": "A modern day classic that belongs right up there with it's a wonderful life and Christmas story . 10s across the board on everything, we needed this right here and now . All those nasty negative reviews are coming from ....let's just say the same people who voted for Trump ( . U guys should be ashamed of yourselves and let all the hate go ."}, {"id": 137, "text": "If you watch one Christmas movie with your family this year, make it this one. Magical and beautiful. Great music, great dancing, beautiful cinematography, beautiful story. I can think of nothing negative to say. It's so good. Best family Christmas movie I've seen in years."}, {"id": 138, "text": "I really enjoyed this. The colors of the costumes, the lighting, camera work, the beautiful hairstyles, the music and the singing and dancing was just amazing! I was completely caught up in the magic of this movie and the power of second chances through an apology and forgiveness. I think this will be a Christmas classic forever! Representation matters and I am so glad my kids have a Christmas movie where they can see themselves in the characters more easily. Also I just love a happy ending and it just made me happy and feel the wonder of the holiday season!"}, {"id": 139, "text": "A Christmas movie that I'm adding to my annual list! The visual effects are amazing, and the plot line had me absorbed from beginning to end. All the magic, music, and characters all combine for a memorable experience. I love that the young heroine uses math, measurements &amp; physics to make magic!!"}, {"id": 140, "text": "I don't understand why anyone can give this movie a rating score if 1! Of course, it has flaws, of course the plot is obvious, but the acting is good enough, the music is great, the costumes are outstanding. The movie leaves you with real feel good factor, so it gets a good score from me."}, {"id": 141, "text": "Grab the kiddos a a get ready for a colorful journey of simple joy! This was a great pj and popcorn movie for the family. I'm glad we watched it! It was a great way to spend the afternoon."}, {"id": 142, "text": "This is a fun movie for kids, but I have to admit, while watching I felt that I'd seen elements of it before. The most obvious was the Buddy 3000's resemblance to E.T., while forgetting about Wall-E, which other reviewers have reminded me of. What really dazzled me were the outstanding sets, so vibrant and colorful. In that respect, I was also reminded of the 2011 film Hugo. with all those gears and wheels working harmoniously together, much like that whirlygig toy in this movie that required a gyroscopic stabilizer. The shining light of this film was the young granddaughter Journey (Madalen Mills), just a sweet kid with a loving disposition. At first I thought to myself, 'who names a kid Journey', but then figured why not, it's symbolic of a youngster's journey from being a child to adulthood, so why not. For some reason, I felt disappointed that Forest Whitaker's Jeronicus character wasn't as outgoing and friendly to Journey at the outset, I felt he should have been thrilled to see her even though he was despondent over his failing toy shop and career. The whole deal with his assistant Gustafson (Keegan-Michael Key) was a downer, and threatened to turn the story into a maudlin affair. But you knew it couldn't last because after all, this is a Christmas movie and you can't let the kids down with an uninspiring message. I have a feeling this might become a Christmas staple in the tradition of Elf or last year's Klaus, and if this keeps going on, there won't be enough days in December to rewatch them all."}, {"id": 143, "text": "A beautiful movie for Christmas. Brilliant dance and song segments throughout a fairly easy to follow storyline. Fantastic acting alongside warming astetics. Slow in some parts, but not enough to switch off. Overall a delightful festive film."}, {"id": 144, "text": "My Grandson loved it, and he often loses interest in movies!"}, {"id": 145, "text": "I can't get over this movie. It is so magical, sweet, thoughtful and well done. It instantly became my favorite Christmas movie. And the music was stunning! Everything from the costumes to the cinematography were so well thought-out. AMAZING!"}, {"id": 146, "text": "I'm not usually one for Christmas Movies but this one is great! Great story, awesome acting and who knew Forest Whitaker could sing like that? I highly recommend it for the whole family."}, {"id": 147, "text": "A wonderful and delightful treat for the eyes and ears. I'm definitely adding it to the movies I watch every Christmas, ie; A Christmas Story, It's a Wonderful Life. To name a few."}, {"id": 148, "text": "Good story with nice character development. The animation was really nice and blended well with the live scenes. The most outstanding part of this production is the costumes and hair. The singing is also stellar."}, {"id": 149, "text": "That shouldn't matter but it does. It is very difficult to find a Christmas movie that appeals to me. Christmas to me is about family and finding love in what you have. This movie was just spectacular. It tugs at the heartstrings without the dogma. Was it a bit cheesy? Of course! All good Christmas movies are. It is a quality that drags us back year after year. From Emmet Otter's Jugband Christmas to Scrooged the idea is to reflect and hopefully smile. This one is added to my yearly list. Highly recommend."}, {"id": 150, "text": "I'm not sure why there are comments about this being too long. Have you timed the Nutcracker or the Christmas story? Your kids can watch this in the afternoon and be amazed. It's Broadway, it's the Sound of Music, it's a family story for all ages and perfect for a moment of pleasure in a year so full of crazy! Finally a welcome addition to 2020."}, {"id": 151, "text": "Awesome movie! The story's very heart-warming and I the message in it is even better - nothing's impossible when you believe it can be done. The costumes are beautiful, vibrant, and imaginative! Loved the dancing and well written songs! Do yourself a favor and believe in magic while you watch this movie! Love love love this movie! Funny, fun, imaginative!"}, {"id": 152, "text": "Reminded me of other fairy tales such as Peter Pan and How The Grinch Stole Christmas.Typically I don't like musicals but I love this one! T'was wonderful to see characters on the screen who look like me. For years to come, this film will be a treat for Black girls and boys everywhere.This film is the perfect opportunity for non-Black children and adults to get accustomed to seeing Black actors, and a predominantly Black cast in dominate and starring roles as the world has been forced to become accustomed to and accept non-Black and non racialized people in those roles!"}, {"id": 153, "text": "Brilliant, a must see! Great film for all. Just what we needed to see this Christmas."}, {"id": 154, "text": "This Musical movie is very inspiring and has all the ingredients for the seasons greetings. Balanced, emotional, music, magic, family and translates justice in the world. Thanks for the experience!"}, {"id": 155, "text": "Even though it's not explicitly about Christmas, it still gives you that jolly feeling while watching it. With a fun soundtrack and an adorable main character in the form of little Journey, the musical has all the right elements to turn it into a kids classic."}, {"id": 156, "text": "Do not let the naysayers turn you away from this fantastic film. All across the board, the visuals, music, and wonderment leaves you with a sense of adventure and imagination. The movie does not feel like two hours, you are immersed and enjoying every second of it. The characters are charming, and the underlying message of the story is something that all walks of life can relate to. We'll definitely be watching this as a new Christmas classic."}, {"id": 157, "text": "I absolutely loved the story, the characters, the message, costumes, EVERYTHING!! See Hollywood, you CAN create stories with people from all ethnicities 😉😘"}, {"id": 158, "text": "This move was a complete delight. The costumes were so imaginative and really eye candy. The staging was amazing. Quality musical are hard to come by now a days. This one was definitely quality. We host a movie night every Saturday for our bubble. EVERYONE from the 12 yr old to the teenagers to our cynical middle age men loved it. This movie was definitely made for the big screen. If you are able to see it on something bigger than the average TV screen. Please do."}, {"id": 159, "text": "I loved this film I felt like I had just seen a Broadway play. The costuming was fabulous. The dancing snd singing was very professionally done and the actors were perfect. I especially enjoyed Miss Madalyn Mills she seems to have a lot ahead of her with all that talent. The whole play was just AMAZING!!"}, {"id": 160, "text": "Family, music, Christmas, joy, laughter, songs, great cast....what more could you ask for!!"}, {"id": 161, "text": "My four year old was in love with this movie. He hung onto every word, the colors and sounds were spectacular."}, {"id": 162, "text": "What a beautiful movie with fantastic music. The characters have layers which makes the movie all the more enjoyable."}, {"id": 163, "text": "What a beautiful movie that's so fun and heartfelt. There are some out there fantasy moments, but it's a family holiday movie! My kids absolutely loved it - they joyfully danced along to the songs. The characters are so great, especially Mrs Johnston, the postal worker. The representation is so great - both for communities of color and smart, brave female characters. This is going to be in our annual Christmas movie rotation. Highly recommended."}, {"id": 164, "text": "The story line was great, I love that the bad guy was a little manipulated and how intelligent Journey was (she's a genius). But the movie basically started with an unearned emotional number about characters we didn't know yet and ended with a bit too much flying, that was over done. The ending also doesn't seem thought out, did those kids never look out their window and see the factory before, thats hard to believe."}, {"id": 165, "text": "Absolutely adored it! Music was amazing as well as the dancing!!!!! One of the nicest Christmas movies ever!"}, {"id": 166, "text": "This film was enriched with culture! It was nice to experience such a diverse cast potrayed in a Christmas film.The music, the story was well thought out and didn't rush ; you were really able to connect with the characters as we have probably all had a Mr. Jangles in our family and certainly a Gustafson! This movie is now a part of my children and I new Tradition. Job well done.Beautiful masterpiece!"}, {"id": 167, "text": "What an absolutely delightful movie! What a great family movie! It was nice to see # 5 alive again (Short Circuit)! 😊 Forrest Whitaker was wonderful!"}, {"id": 168, "text": "Jingle Jangle has such a feel good factor, proper Christmassy film that all the family can enjoy. It has goodies, baddies, singing, dancing &amp; great characters especially Journey what a wonderful little actor she made the film. It touches your heart, tears of happiness I would definitely recommend this film to anyone."}, {"id": 169, "text": "Beautiful costumes and settings, amazing dancing, singing and a great story which kept you guessing. Exactly the sort of film I want to watch at Christmas, and would happily watch it every Christmas from now on!"}, {"id": 170, "text": "This was the best way to kick off the Christmas season. My family loved watching this movie last night. We loved the story, the singing and dancing. I'm so happy we started off our season with this movie. We will be watching it over and over all season every year. Thank you for the representation and the real life example of how our people have been disenfranchised. Even by our own kind. I'm glad it had a happy ending. This will be our new tradition: watching Jingle Jangle for Christmas!"}, {"id": 171, "text": "Normally i dont write reviews. I don't understand a 6.6. Raiting.. or those people don't like musical or they are to depressed.. with all due respect.. but jezus I'm loving this movie. this movie is so inspirational. The lyrics are almost frozen 1 and 2ish. I lost everything in my life due the corona. But this movie gave me so freaking much inspiration. Ty for such an amazing new movie like this!!!!! Everything is possible.."}, {"id": 172, "text": "The creativity, actors, animation, music, dancing was absolutely wonderful to watch!I enjoyed every moment of it and appreciated it especially for a time we are in right now.Family is important and we all need our family, this movie showed how important it is to have family and all never giving up your dreams.Ms. Johnson was absolutely funny! Forest Whitaker was amazing as usual. I was glad to see him in an movie like this for the kids.Well done"}, {"id": 173, "text": "This is an instant Christmas classic!! There's amazing music and costumes and CGI and -Christmas magic!!"}, {"id": 174, "text": "Truly inspirational and amazing to watch! Definitely worth watching."}, {"id": 175, "text": "It's escapism for your eyes and soul. Costumes are rich and colourful. Singing and dancing is on song. The actors are great.If you want something to lift your spirits. Then watch. It's really fun."}, {"id": 176, "text": "I tried to watch this as I was told the musical numbers weren't that many. That was a lie, every time they change a scene there's people dancing around and singing with very little dialogue at all. Not my cup of tea. If you're a musical theater buff or someone who enjoys meaningless repetition, I'm sure you'll love it. 45 mins in and I had not a single interest in any of the characters. The scenery is beautiful and so is the costume design but it doesn't equate the movie to anything more than a 4."}, {"id": 177, "text": "Jingle Jungle and all that staff in title was a fun time for most of runtime and i think that young kids could enjoy this film and had a fun time with it.Characters are wacky and over the top but for this kind of films it works rather well and such things made this film even better.The best part was Key who was scene stealer here and his character had everything that he needed to have and he accepted that with a pride.Whitaker and rest of cast were also good and kids for the most of film did a good job.Runtime is perhaps little to long and it starts to drag in scenes but still in end this is cool kids film"}, {"id": 178, "text": "After reading the negative reviews, I realized the people who wrote them were looking for ways to tear it down. It is a Christmas movie, naturally a little cheesy, and what Christmas movie isn't? The music and choreography were great. The casting, while not flawless, was incredibly enjoyable. The storybook animation was stunning to look at. It would be unfair to assume that this movie was made to win best drama at the oscars. It's made to be an uplifting Christmas movie with amazing representation not seen in most blockbuster Christmas movies. Before tearing it down, maybe watch it an open mind and take it for what it is. It brings so much joy in such a garbage year and I absolutely loved it."}, {"id": 179, "text": "The cast was great, the dancing wonderful and the story was above average. I wasn't a huge fan of the music used which really took me out of the movie every time the singing started. The movie was a bit long and that ending was just odd. I loved the casts chemistry and the characters just the story needed some pizazz."}, {"id": 180, "text": "Seen it all before and done so much better in other films. Hugo, Oliver, Willy Wonker and Toys to name a few. The writers and film makers have run out of ideas. It's aimed a kids most definitely. Poor kids. The design of the town, England 1880's - 1900's maybe? Are good. Look like York and Lincoln. The music and songs are not represented of the time setting. The snow ball scene was so cringeworthy. With an Afro Caribbean rap but all the characters are all British. So not sure what heritage is being represented here. Not to mention the stereotype Spanish matador doll. Awful dross.I lasted 1hr 17mins. 2 stars for the design and costumes."}, {"id": 181, "text": "My kids and really enjoyed this! To see it live would be AMAZING!"}, {"id": 182, "text": "Really enjoyable film to watch with the family. Greatest showman turned in to a family/Christmas film with decent actors for a Netflix film and a lot of fun. Worth the watch."}, {"id": 183, "text": "What a wonderful movie - nothing is IMPOSSIBLE if we believe :)"}, {"id": 184, "text": "This is the type of movie I watched growing up. Its awesome Netflix and the producers and writer are showing quality diverse stories with the magic we all love. This movie made me smile all over to know that children will see themselves in the characters. This is just what I wanted it to be. I loved it."}, {"id": 185, "text": "This is a wonderful inspirational movie 🎥 that the entire family will enjoy... The acting, storyline, music and set design was 💯.. Great Work"}, {"id": 186, "text": "I absolutely loved this movie. I am sort of neutral when it comes to live action musicals but the musical performances in this movie were fantastic and the music was beautiful. The background was a perfect fit. The acting was top notch with a very likeable cast. The only reason I didn't give it an outright 10 is because I felt part of the story was missing, specifically the part about the daughter. I sort of wanted to know what happened to her during her absence but I used my imagination!"}, {"id": 187, "text": "Nice story, ruined by the musical!! Every 15 minutes...God!!!"}, {"id": 188, "text": "The magic of wit and creativity that this movie portrays is very well executed. Adding to it the mix of dance and glam and colors in all its corners puts you in the christmas vibe. However i couldn't stop seeing Magorium's magic store, Wall-E's voice and shape, and the trip to Neverland with PeterPan and Wendy. Mashing all those themes up in the movie removed the dazzle that we were supposed to have on Journey's inherited creativity and wit. Several short and loose ends that needed more focus. All in all its a great movie to watch...in the holiday season.."}, {"id": 189, "text": "First of all let me say that this movie was our family Friday Night Movie and my kids definitely enjoyed this movie. I found it entertaining and sufficiently immersive enough to enjoy my brief time in the world it created.My biggest complaint about the movie was the vast volume difference between the dialogue and the songs: when I had the volume turned up loud enough to hear the dialogue, the songs were way too loud and I was constantly switching volumes. Many movies suffer similar ailments when it comes to dialogue and sound effects (and for this reason I always keep the remote handy), but this one seemed to have a higher differential than normal."}, {"id": 190, "text": "The Christmas movie I never knew I needed. Creative and delightful with incredible dancing."}, {"id": 191, "text": "This movie has such a beautiful story, it makes you emotional. I cried several times. The cast and set design were also amazing. This is the type of film to show your kids (especially young girls) to inspire them to believe in their talents and to nurture their exceptional gifts."}, {"id": 192, "text": "A beautifully written and well performed Christmas story. Something you can watch with the entire family."}, {"id": 193, "text": "Is the story unique? Maybe not but it's not a remake or a reimagining The characters are fun and whimsical. The costumes and hair design are so beautiful. I adore musicals and the fact that most of the songs moved the story along and introduced characters as opposed to just making a song, is a sign that this was very thought out.I watched this with a group of people whose first language is not English and they loved it. Watched it again with a group of English speaking kids and they had tons of fun.I hate Christmas but this brought me a bit of Chris spirit."}, {"id": 194, "text": "Just don't see movies like this anymore. With the music and characters, and the dancing. So glad we have a new Christmas movie to enjoy that combines the new with the classic goodies."}, {"id": 195, "text": "Everything about this movie was wonderful. My kids loved it and we enjoyed it as a family. It's a great Christmas movie and magical."}, {"id": 196, "text": "I love this, it's a great family film, I could watch it over and over again, it shows that it is so important to believe in yourself to make things happen. Wonderful story."}, {"id": 197, "text": "The story is creative- as being a Netflix film, this one was outside of the usual box (though the beginning felt familiar?)... Anyways, I have watched a many dubbed over films and tv shows, but the lip syncing was so off it was painful to watch the musical numbers. Not that I am bothered by musical numbers, just by the quality I'd expect in a french film dubbed over in english that are in fact english films in english, where the lip sync should be spot on?.... On another note, I'm not sure if it was the movie or bogus volume setting on my tv, but the movie track was super loud, while the voices were hardly audible at times. This isn't the first time I've noticed this problem in Netflix film."}, {"id": 198, "text": "Finally made an IMDb account just to bump the rating of this film. I can't believe it's at a 6! It's beautiful and magical. I throughly enjoyed it. Do yourself a favor and watch it."}, {"id": 199, "text": "SPOILERS: First off all, Jingle Jangle looks incredible, the sets, costumes and visual effects are some of the best I've ever seen. The musical numbers are reminiscent of the greatest showman with their energy, incredible vocals and modern twist. Unfortunately, someone forgot about the actual character development, specifically their actions and motivations. For example; we're to believe that after being given a job, a place to live, trust and education, that Gustafson would find it so easy to turn into a thief, after being ignored a couple times, when Gustafson could obviously see that Jangles was occupied. I also found Jangles annoying, he's always ignoring people. When confronted by a granddaughter he's never met, Jangles speaks to her in such away that any other person, would have gotten straight back on the bus back home without giving him another thought. Later again he ignores and dismisses her until she reveals her intelligence. I personally don't think a prerequisite of loving someone should be based on how smart they are. I think the movie could have been served better removing the book reading beginning so more time could've been given for character development, or a back story for Gustafson which would explain his decision to steal. I'm sure the young kids its aimed at will enjoy."}, {"id": 200, "text": "This magical diverse Xmas movie takes you on an adventure sprinkling affirmations of Joy, Determination and Belief throughout this wonderful Children's fantasy with exceptional musical indulgence!"}, {"id": 201, "text": "The feelings we used to have from Christmas films-love, laughter and warmth-are all wrapped in this masterful movie. It feels good and the music, family and universal love was lovely and overwhelming in the best way. I loved it so much!"}, {"id": 202, "text": "Beautiful, magical, and a joy to watch. Any negative comments are not worth your time."}, {"id": 203, "text": "Omg this movie put me in a good mood! Everything was amazing! A beautiful change from all the ugliness we have endured in 2020. Definitely a must watch."}, {"id": 204, "text": "Amazing film...reminds you how Christmas can be magic."}, {"id": 205, "text": "I loved the snowball fight and then I saw the locals were in the film. This is awesome! I'm from Halloweentown/St.Helens, OR. Anytime a production includes the locals, makes it a special film. I also loved Buddy! Thanks!"}, {"id": 206, "text": "The whole family loved this one. Great story, great characters, great actors. Songs are brilliant. It's a long film but it passes really quickly."}, {"id": 207, "text": "I have long been a fan of musicals. My Fair Lady to LaLaLand and everything in between. Holiday musicals are my favorites and Jingle Jangle: A Christmas Journey could not have come sooner!!! Well written, fantastic cinematography, production design, costume design and all! Forrest Whitaker gives a remarkable performance. In a time when there's is such craziness in our world experiencing this piece of holiday magic on Netflix gives one new hope and all it requires from us is for us to believe."}, {"id": 208, "text": "Okay most Christmas movies are cheesy but this movie is very entertaining and colorful. Madalen Mills (Journey) is adorable and puts on a great performance. I wasn't surprised to read the negative reviews with racial undertones. One person even said that it's unfair to make a movie that's 90% Black, really?! I guess he didn't see The Lord of the Rings, or The Wizard of Oz! Shall I compile a long list of all the White-Washed movies?! These same type of people had the same things to say about Black Panther, the haters just can't stand to see more than the token Black actor on the big screen."}, {"id": 209, "text": "That is the first thing my mind went to when it opened to a large shop, full of moving toys.. and magic. Not original there, but still definitely original. Was not expecting a musical, though, so that was surprising. Pretty cute, my little niece loved the music."}, {"id": 210, "text": "This movie is going to be my new go to Christmas movie every year. Definitely treat yourself to this instant Christmas classic."}, {"id": 211, "text": "Such a great Christmas movie! Incredible singing, dancing, story line, etc. Will make you tear up. If you want to sit down and actually watch a good Christmas movie and you're burnt out on others, well. You're welcome. Thanks, Netflix. Was nice not being forced to watch Hallmark movies quite yet because my Christmas movie stash is running low. Rewatched the same night. My daughter loved it."}, {"id": 212, "text": "The music, dancing, storyline and majority Black and Brown cast were all magical. There are so many Christmas movies that have become family favorites year after year, but very few feature Black and Brown people.It matters for little Black children to see themselves on screen in a well-produced, exceptionally directed holiday family movie. IT MATTERS.Bravo to David E. Talbert for his vision and for a job well done. Jingle Jangle should be watched in every home for many, many years to come."}, {"id": 213, "text": "I REALLY wanted to like this film. First I just wanted to say the attention to detail was amazing. The actors were great and was so lovely to see a Christmas film with diversity. Only let down was the story line wasnt very gripping and dare I say slightly boring."}, {"id": 214, "text": "The plot is a holiday fairy tale, told like a story time. Some of the sets look like recycled from The Santa Clause movies. The musical numbers are catchy in spots. And effects are also descent. Forrest Whitaker does play a broken down toy maker very well, and his scenes with the kids are watchable. Keegan -Michael Key is also charming has the main viilain. The kids also bring some fun to this also. This is a fun holiday film for everybody to enjoy."}, {"id": 215, "text": "I enjoyed this movie with my daughter! She finally got a chance to see someone who looked like her in a Christmas film! I really liked the way that the story was all about the strength of LOVE. I will surely watch this movie again next year &amp; for many years to come!Anderson Brown"}, {"id": 216, "text": "This movie is a treat! Excellent story. Excellent music and choreography. Great for all ages. Forrest Whitaker shines."}, {"id": 217, "text": "Although, it not the typical Christmas Story, it is packed with magical wonder. Great movie. Great story. Thank you for including everyone."}, {"id": 218, "text": "The story itself is simple and endearing, however the film itself is too full. Alsmost as if it is trying to overcompensate, while not focus on any character properly. It is just not funny enough, and extremely childish. And too long to be entertaining for children"}, {"id": 219, "text": "I am a HUGE FAN The Greatest Showman. I had no expectations of this movie coming close the Greatest Showman. But it's cute. The story starts off like a tragic Disney flick and it's kinda sorta cute but a little cheesy. The gal who is hitting on the father didn't seem to be a necessary part of the story and honestly, the scene of her hitting on the father/toy creator was completely unnecessary and made my daughter uncomfortable as it was an unwanted advance to a guy who was completely unaware how she felt about him.It didn't need as many songs, as we agreed there was one song we were interested in listening to again.The setting was adorable with cute Christmas vibes!"}, {"id": 220, "text": "In this Netflix original, we have a Willy Wonka type toymaker who creates a sentient doll - Blue Fairies need not apply - that turns out to be evil and teams up with a disgruntled employee to ruin the inventors life. Now, this is a fantasy style storybook adventure so logic should not be applied - in this movie toys are powered by belief and scientific applications include such formulas as The circumference of sensational - but even so the film's over treacly nature can be a little trying at times.It should also be noted that this is a musical but for some strange reason they cast Forest Whitaker and Keegan-Michael Key in leading roles and neither of them can really sing, and this is not helped by surrounding them with a cast of very talented singers who just makes their inability even more apparent."}, {"id": 221, "text": "Cast was great, music seemed very a similar to other Disney movies. Story line was a little ridiculous."}, {"id": 222, "text": "Setting is oke , but storyline, acting isn't good. The songs are weak and ads nothing of value . Overall not good enough"}, {"id": 223, "text": "The cinematography and costumes are stunning, the music is excellent, and the choreography is Broadway-caliber. And it's a story filled with magic in a fantastic, steampunk world. If you're looking for a great holiday movie that families can enjoy together that is a standout from the usual holiday fare, this is the one that 2020 needed. Jingle Jangle will be an instant classic. Absolutely loved it."}, {"id": 224, "text": "This film was not the best film ever. It wasn't the best Christmas film ever. It probably won't be 2020's best Christmas film. I'm not sure it was aiming for any of those and nor do they matter. The story is nice, the animation is brilliant, the cast and performances all wonderful (massive kudos to the kids), the songs perfect for the film and would not be out of place on a big Broadway stage, and the staging of it (sets, lighting, costumes) all spot on. Watch it, tap your feet along and feel good. Why would you need more?"}, {"id": 225, "text": "Absolutely amazing!!!! Grab your popcorn, hot chocolate, and a blanket to enjoy a Magical Moment to start the holiday season. Absolutely Amazing!!!"}, {"id": 226, "text": "This movie started off great until they started singing and prancing around like little school girls. The magic of the movie for me was lost at that point and had it just stuck to the script without any of that nonsense it would have been an instant classic."}, {"id": 227, "text": "I had a high hopes for this movie as a lover of musicals and family movies. I will say that my kids liked it and the costumes and dancing were fun, but I found the story to be very boring."}, {"id": 228, "text": "The film is stunning. Beautiful sets, costumes, CGI, and talented actors. But the story is so boring, and the musical numbers are dire. It desperately wants to be The Greatest Showman, but doesn't come close. Also, its not at all Christmassy."}, {"id": 229, "text": "Me and my family loved this movie. I usually don't even like musicals but this was done so well. I'm going to add this to my Christmas movie collection. I love the cast of actors &amp; actresses. Its story about hope &amp; belief which ppl need around this time of year."}, {"id": 230, "text": "I love this movie. I love the storyline, the songs, the acting, the animation and the magic. I was delighted from beginning to end."}, {"id": 231, "text": "It's a feel good christmas story!! With great sets and costumes.... But more over is the transition between animation and live acting that is spectacular... Great singing and acting, what we needed for this Christmas and all the Christmas coming. A family Christmas classic!!!"}, {"id": 232, "text": "I love the inclusivity and the songs are so good. Great family movie!!!"}, {"id": 233, "text": "So many comments have mentioned it being an all black cast, well I didn't even notice that until I read the other comments and actually its not an all black cast as Hugh Bonneville makes a slight appearance. The film promotes the message that belief and forgiveness can solve anything. Its a wonderful film with great acting (especially from Madalen Mills who plays Journey and is just 11 years old), wonderful west end stage style songs and amazing special effects. 0its the ideal movie to get comfortable on the sofa with snacks and a duvet. Well worth watching."}, {"id": 234, "text": "A must watch! It's not your typical Christmas movie which makes it even more magical and special, I watched it with my family and we all loved it from start to finish. Make those cups of cocoa, grab the popcorn, snuggle up and enjoy."}, {"id": 235, "text": "The movie is so very sweet my teeth started hurting after the first song. My children complaining: 'not another song!'. It all looks great, but the story is full, you know everything after 5 minutes, the songs remind me of a Frozen gone wrong... And he... There is another boring song."}, {"id": 236, "text": "The story arc is a bit messy, some song are very badly lip synced and feel out of place in the environment . Where other are amazing and touching, Forest Whitaker delivering beautiful emotional song. Songs could be a bit more original. Overal very nice movie, just falls a bit short in some parts."}, {"id": 237, "text": "Heartwarming, inspiring and non-stop fun; #JingleJangleAChristmasJourney is a thoroughly original Christmas film that will become a classic.In this holiday film, an eccentric toymaker, his adventurous granddaughter, and a magical invention may have the power to change their lives forever.Featuring sensational and elaborate music numbers and catchy songs, Jingle Jangle delivers fun holiday cheer with a stellar cast and a deeply personal message. A film filled with relatable messages and that is altogether original with fun characters. A Special mention goes to Keegan Michael-Key, who plays a great villain. Netflix has really done well work this film and I foresee it becoming a new holiday classic.Follow @snobmedia for all reviews!"}, {"id": 238, "text": "Amazing effects - some of the best special effects I've ever seen. Incredible costumes. But it was just trying too hard with not enough story.And it was trying to be the next The Greatest Showman but none of the songs are memorable.If they had fleshed out the beginning of the story and shortened the second act and made it less boring, it might have worked.In the end, beautiful to look at, but blah."}, {"id": 239, "text": "Finally a musical I could enjoy to the fullest again. The latest musicals have all had great songs but were lacking a real interesting story. But this ... Not only is the music stunning and beautifully performed but this musical also has a fantastic, magical storyline. It is a mixture of Finding Neverland and everything you wish for in a Christmas movie. Sometimes it was a little too over the top, so I am giving it a 9/10 stars."}, {"id": 240, "text": "Everything was delightful about this movie. The actors were strong, the songs were moving and the animation was supreme. Thankful to have a strong black Christmas movie with depth and creativity. Oh, let's not forget the costumes! I haven't felt this magical about a Christmas movie since How The Grinch Stole Christmas first came out. Thank you for such a unique creation.To be clear, the only reason people are reviewing this movie negatively is because it's made of a majority BLACK cast which should not be an issue today. Just enjoy the movie for what is it. ART."}, {"id": 241, "text": "I happened to be walking through Norwich when I saw this being filmed in Tombland.. (It really does look like that) I saw the streets covered in snow, and the snowball fight being played out.I didn't expect much, but it looked fun... Have to say, It was enjoyable to watch. Visually stunning. Ignore the lower ratings.."}, {"id": 242, "text": "Fantastic movie. Fantastic cast. It was very well written and kept me entertained the entire time. A great Christmas story!"}, {"id": 243, "text": "Watched this movie and was positively surprised by it. A great music score, beautiful stage and scenery, great effect animation, lovely acting and an entertaining storyline. Don't really understand the negatieve reviews."}, {"id": 244, "text": "I like very much It's a fun story to watch. The atmosphere is beautiful, the graphics are obviously very beautiful. During the Christmas season Make it look warm and the family in that movie is even more warm. Everything is perfect The light, color, sound, camera angles, the performances of the actors are very good. I cried very deeply. The eyes convey emotion, the tone is beautiful, the sound is great. There are animations to enjoy, From start to finish. In the end, the family was reunited like them, I recommend this movie this Christmas, watch this movie with my family, it will be very happy."}, {"id": 245, "text": "Very entertaining. Loved the music, loved the color, loved the story. I don't know why it's pg versus g though. Very clean film. No language, the worst of it is a woman trying to com e on to a man, and that's not even that bad. I felt very comfortable with my young kids. All boys, and they all enjoyed it! Would recommend everyone who loved Roger and Hammerstein's Cinderella (musical with brandy) and the greatest showman watch this as well!"}, {"id": 246, "text": "Feel good positive movie 2020 needed this! The stardom cast reminds you clean is never a thing of the past."}, {"id": 247, "text": "Of course we've seen the plot before but who cares, the music, singing, dancing and acting was great. I will definitely be rewatching again and again."}, {"id": 248, "text": "This is what 2020 needed. We've been desperately waiting for Christmas chronicles 2 to be released and had no idea this was even in the works. It appeared on Netflix so we gave it a shot and it's brilliant. It's fun, magical and superbly directed. My kids have started watching it again!!! Can't wait to see what the director comes up with next."}, {"id": 249, "text": "I just loved this, one of the best Christmas movies I've seen for a while! The sets and costumes were amazing. Original story, fun, it had something for everyone! Perfect family Christmas movie!"}, {"id": 250, "text": "Just what we needed!Brilliantly written, it's like watching chocolate on the screen. I bet this would make a great musical at the theatre at the west end.The sets look great, acting's spot on and a great ending.Thanks Netflix."}, {"id": 251, "text": "Childrens movies are never over 2 hours. Something should have been cut. One thing I can think of is the woman who keeps coming on to the Forrest Whitaker character. Extremely annoying. Otherwise the movie is extremely boring."}, {"id": 252, "text": "I applaud the effort to bring a Black cast together for a non-traditional Christmas musical story, but it the story really could have been much better. The musical numbers really didn't connect that well with the story they were trying to tell. All of the performing singers were good but it was just disjointed."}, {"id": 253, "text": "This is a beautiful movie with a diverse cast. The costumes are amazing. My kids loved it. It is a little long for younger kids, but its to be expected with a musical."}, {"id": 254, "text": "I found the movie to be a messy amalgamation of good movies we've all seen before - lacking originality (so I'm saying lazy). The narration and camera angles are akin to The Grinch - The 'belief' is just the recycled Santa Christmas spirit vibe; there's a bit Christmas Carol in there along with a number of others.To be honest, it felt like this movie was more about demonstrating equal opportunities and diversity rather than delivering a good show.Perhaps for kids who aren't aware it's plagiarised most Christmas favourites, it may be a decent watch.Forest Whittaker is the saving grace in acting terms."}, {"id": 255, "text": "Great film. We'll be watching this again. Didn't pick up any songs that stuck. But my kids absolutely loved it."}, {"id": 256, "text": "This movie has heart. It was suggested by a friend and I thought it'd just be another one of those cutesy familyfmusicals... but by the end... I was crying. Forest Whitaker is just amazing, and you might not think the story is all that great, but at the end, you realize how great it is. It's a movie about losing hope, giving up, and coming back from that. Really just give it a chance."}, {"id": 257, "text": "Great movie! Wonderful actors, incredible sets and costumes, and heartfelt songs. Not to mention dancing! A very enjoyable family movie."}, {"id": 258, "text": "Like my summary suggests, the music, unlike the lyrics, was really unfitting for the theme and time period of this movie. Saying this, the music was really good and enjoyable non the less.Sets and costumes were really good. Sadly there are not many locations, but they do make the best out of it. The dancing choreography was better than expected. CGI was a lot better and more believable than most big block busters, so that is a huge plus.I really wish the entire movie was with animated puppets, because they looked really awesome. The actors were not bad, quite the opposite actually.It was a shame they used an older actor for the main character, instead of using the same just with some facial changes to make him appear older.Humor, while not really amusing, was not bad that it got distracting.I do not know if children will enjoy it, since there is a lot of talking. Even tho the music was very unfitting, I still enjoyed it."}, {"id": 259, "text": "Good animation but something was missing. Completely lost interest, kids got bored as well and they are 11 and 13."}, {"id": 260, "text": "At first it feels like an Oprah Winfrey movie... reeking of quality but way too much sugar to compensate for years of neglect. Also In the beginning some of the musical scenes could have been cut by two thirds. 2nd half is much better. Some very enjoyable parts but overall the movie is mainly for adults because of the musical scenes. Message wise it reminds me of ''Mulan''."}, {"id": 261, "text": "Wonderful magical happy feel-good movie. The music is so good and the steampunk feeling is extraordinary."}, {"id": 262, "text": "For the Love! Stop over-thinking this stuff! It's an adorable Holiday flick! Absolutely gorgeous costuming and sets, positive messages and Christmas spirit galore! Quit the analyzing and comparisons, pop some popcorn and enjoy with the kids!"}, {"id": 263, "text": "The music was fun, the costumes were absolutely stunning, the sets were lovely, the acting was heartwrenching, the magic was real... I loved every minute."}, {"id": 264, "text": "What a breathtaking work of art. Jingle Jangle meticulously conveyed a message to believe, which is what is truly needed now in our current world. More of this please!"}, {"id": 265, "text": "In summary, off/brand. Incredibly impressed with stupendous set design, magical costumes, fun animation that integrates well into the actor-based story. Just magical- obviously primarily for kids- think Harry Potter.. junior, combined with The Greatest Showman. If you just open your mind you'll see it's just great. It's just really fun and joyful. Better than Grinch (which was a 9 from me) for reference. There was a really dumb scene where they completed a robot, and then for some reason they could all fly? Weird and incongruent but again, random magic. So if your kids are 3-5 then okay I suppose, but otherwise most kids will be like wtf... why flying? Why now? What does that have to do with... anything?"}, {"id": 266, "text": "If you are looking for a movie that is going to get you into the Christmas spirit, this isn't the one. That's ok. Hear me out. How else would you market a musical about the literal magic of math and science? You would have to market it as a Christmas movie.There is only one scene in the whole dang movie that even mentions Christmas. I'm pretty sure that was dictated by the studio. Rather than focusing on Christmas it focuses on the creative nature. It takes us through a journey of generational trauma, believing in yourself, and the magic of the imagination.This movie is a mix of Willy Wonka, Christmas Carol, Peter Pan, and Polar Express. Forest Whitaker delivers a top notch performance in this new Holiday Classic. Defiantly worth the watch with the family. I know it's going on my rotation."}, {"id": 267, "text": "Great set, costumes, hair and music. I think the movie was a little long and the plot could've been better but as a whole, I had a fun time watching."}, {"id": 268, "text": "I really enjoyed this movie and the entire cast. I highly recommend it."}, {"id": 269, "text": "A feel good Christmas movie with singing, dancing and a good story, a must see with the family."}, {"id": 270, "text": "Jingle Jangle is a 2020 Festive musical starring Forrest Whitaker,Keegan Micheal Kay,Ankia Noni Rose and the voice of Ricky Martin. And it tells the story of an eccentric inventor who designs a toy that turns out to be bad(Ricky Martin). But will Jingle and the gang be able to save Christmas. The cinematography is good and if I'm not mistaken this is the longest Netflix original movie I ever saw."}, {"id": 271, "text": "Erm... I had to put on this movie for my little brother and I to watch... it was cheesy. It had some familiar actors but other than that it's OK for very young kids."}, {"id": 272, "text": "Whimsical musical enjoyable for kids and adults alike. Stunning costumes and sets, gorgeous music that fills you with Christmas joy Really enjoyed this! Just waiting to buy the soundtrack when it comes out on CD so I can listen in the car!"}, {"id": 273, "text": "The movie was missing something. It just seemed too simple. I think a darker tone would've elevated this film. But regardless, it's unique and kids will like it."}, {"id": 274, "text": "Watched this after seeing pictures on Tumblr. It was great to see a holiday movie with POC represented in it. It has a cool steampunk feel with vibrant costumes and applause worthy effects. Frankly, the singing got a little annoying for me, but I'm biased because I'm not much of a musical fan. It was also kind of long and some parts felt awkwardly executed, but it'll definitely be a classic for sure! Give it a shot."}, {"id": 275, "text": "But why the hell do they all think they have to sing?"}, {"id": 276, "text": "Beautifully made, exciting, and playful. A great start to this 2020 Holiday season."}, {"id": 277, "text": "Watched this movie with my kids and by the end we were all crying happy tears. It's a heart warming spectacle with phenomenal costume and production design, infectious songs, endearing characters and a strong central performance from Forest Whittaker.I only gave 9/10 because I would have liked more musical numbers but that's a personal preference. I wasn't disappointed with the ones that were in it.Definitely being added to the annual Christmas movie marathon."}, {"id": 278, "text": "Jingle Jangle, Netflix's latest big Holiday push, is an extravagantly produced musical fantasy with some really good songs and performances. The movie is sort of Mr. Magorium's Wonder Emporium by way of Willie Wonka and for the most part the elements on display are quite well done."}, {"id": 279, "text": "I watched it with my family and we just loved all the musical parts. Vivid colors throughout! This movie is a feast for the eyes. Worth taking the time to watch with your whole family. Merry Christmas!!!"}, {"id": 280, "text": "Acting, singing, and choreography were all wonderful. Storyline is not unique but beautifully done and uplifting to the spirit. Sorely needed in difficult times such as these."}, {"id": 281, "text": "Loved it! Beautifully produced, fantastic singing and dancing and special effects. The storyline is a much needed message for children today: to believe in yourself and all things are possible. Great for the entire family!"}, {"id": 282, "text": "Utterly spectacular Christmas family movie!!! Touch of Greatest Showman, Short Circuit all served up with a large dose of family magic. Delightful!"}, {"id": 283, "text": "Jingle Jangle is a must watch movie/musical! The songs, costumes and cast will have you feeling charismatic throughout the movie. It will have you tapping along and leave you with a joyful smile! It had great movie tributes/influences throughout: The Greatest Showman Peter Pan Wall E Santa Claus Harry Potter Marry Poppins Black Panther A Christmas Carol... to name a few... The movie ended with me in tears and basking in the feel good holiday magic 💫 Jingle Jangle will show little girls everywhere that their voice matters and can do anything they want. All they have to do is Believe and step into their World of Wonders and possibilities!"}, {"id": 284, "text": "I only really watched this because of the people saying it's like The Greatest Showman... It's not. The story is pretty dull - although it had a promising start. It's pretty well acted, the cast is likeable, the song and dance routines are ok while on screen but instantly forgettable. The trailer made it look like this was going to be some sort of Christmas buddy movie with the girl and her robot but the robot is barely in it. It's fine, the kids will enjoy it but it's not destined to be a classic which is a shame as it could have been so much more! And more should of been made of Mrs. Johnston and her backing singers who are great! My guess is that a lot of people will really enjoy and rate it highly for it's diversity of cast..."}, {"id": 285, "text": "Ever see a Christmas movie that was a classic mixed with the Broadway musical groove of the likes of Hamilton? Me either! This movie is inspirational and endearing! Will be an addition to our yearly list of classics from now on without question! Aq"}, {"id": 286, "text": "Not great, not terrible... But, awfully tacky. Wouldn't recommend it unless you're absolutely sure you've got 2 hours to kill."}, {"id": 287, "text": "I rarely write reviews, but this wonderful movie warrants it. I'm disappointed but not suprised by the obvious posts from racists who consistently downgrade films with predominantly black casts. This movie is not at all racial unless merely having a black cast makes it so. If that's the case, are all the holiday movies without any people of color suddenly racist? Of course not! Let's just enjoy the movie for what it is - an endearing holiday musical filled with magic, stunning visuals, catchy music and great choreography. It's also a wholesome family movie with a positive message. I'm adding it to my collection of movies that become a holiday tradition."}, {"id": 288, "text": "Try's to hard. Acting is shockingly bad, the songs are dreadful, it's too long, and the story is boring. Don't bother watching."}, {"id": 289, "text": "This movie is not even a Christmas movie. The use of mathematics equations was stupid. Some of the action scenes not necessary and the movie was too long. There was a good theme about not losing sight of what you have, this is the only reason i didnt give it a 1."}, {"id": 290, "text": "Nice set and cgi but poor job casting, script and character development. Some of the lines are cringeworthy as if the writer is trying to over compensate for a feeling of inadequacy. There's no need for lines like greatest inventor of all time, just keep it simple and Christmassy for the target audience here (black kids)."}, {"id": 291, "text": "I really loved the cast- Forrest Whitaker plays the aged inventor who has lost his spark and Madalen Mills plays his grand daughter and both do an incredible job with the slightly above average scripts they were given. I also liked Keegan Michael Key but Lisa Davina Philips cracked me right up. The choreography was incredible and the set design and CGI were both really very good. I typically like musicals. I also typically like x-mas movies but this x-mas musical goes way too long and becomes boring(beside set design and implied time of year theres barely any reference to x-mas). Exciting pieces throughout but I can't imagine children younger than 10 or so bothering to watch the entire movie-it goes for nearly 2 hours, which is a whole lot of singing and dancing tbh. My 12yo daughter thought it was too long and boring and my wife(who LOVES musicals) dozed off for a bit! Maybe it's my fault for starting the film at 730pm!"}, {"id": 292, "text": "Great cast, music snd storyline plus wonderful choreography and costumes!"}, {"id": 293, "text": "This movie was spectacular in every way! Great story, great music and dancing! It also is a good movie for children (and adults) to watch, learn and be inspired from. Every cast member did an amazing job in portraying their characters and overall I am very impressed by the cinematography. I highly recommend this movie."}, {"id": 294, "text": "Less than 5 minutes into this movie, you know the formula here. The characters talk like they are in a magical Christmas musical where everyone just needs to believe (and start another hopeful song). At that point, you have a choice. You can go along for the ride and know that the implausible ridiculousness is part of the point or you can get really annoyed. I chose option 1 and managed to get almost all the way through before making fun of anything. It helped that the song and dance numbers were really well done (and honestly it was nice to watch a Christmas musical with a diverse cast). It wasn't my favorite, but my daughter loved it...and you could do much worse when entertaining your kids for a bit."}, {"id": 295, "text": "Give this movie a chance! I felt like I was watching a Broadway show. The singing, choreography, and CGI was great. It's funny, clever, and heartwarming. Jingle Jangle is definitely going on my annual Christmas Movie Watch List!"}, {"id": 296, "text": "Hands down this is the best christmas film I have seen in years. The story, the music and the dancing is incredible!"}, {"id": 297, "text": "It's exciting n entertaining. The storyline is awesome. Would recommend"}, {"id": 298, "text": "Beautiful music, scenery and great talented cast. I thoroughly enjoyed it."}, {"id": 299, "text": "This movie is filled with smart choices ranging from excellent casting to delightful songs to visually appealing sets/costumes and beyond. I firmly believe it's impossible to watch this movie without smiling several times. Is the movie cheesy at times? Yes...but a lovely Camembert type of cheesy...the good kind. It's heart warming, inspiring, and full of cheer. Everything you want in a Christmas movie."}, {"id": 300, "text": "Music, singing, dancing, magic and more! We love this movie! It is warm, filled with life lessons and casted so very well. The costumes are creative and beautifully worn.The singing and score have the wow factor! Jessica's voice is sic! Grandpa's and Journey's too. Quite impressed with the talents of the actors and the dancers. There are many magical moments with grandmother and grandchildren as well as grandfather with granddaughter.Kudos to everyone involved in this masterpiece of love."}, {"id": 301, "text": "I'm so happy about this movie we needed more movies like this, cast was great, the quality and effects are outstanding. This movie deserves several adwards🙂"}, {"id": 302, "text": "The first 25 minutes alone make this movie at least a 9. It's a visual wonder. Have a little holiday cheer. These low reviews are unbelievable"}, {"id": 303, "text": "This was so much better than I thought it was going to be. The music was enchanting and the acting was perfect! Must watch! New Christmas Classic!"}, {"id": 304, "text": "The cast did an amazing job, their performances are stellar. The story is so fun and uplifting, fresh, whimsical, and magical. There is nothing to not love about this movie."}, {"id": 305, "text": "Quick Summary: What's the square root of impossible?! A grandmother tells a Christmas story of magic, imagination and determination to her grandkids. In this story there's a little girl, Journey, that goes on a musical adventure trying to find her place in the world. And in the process tries to reconcile her family and become an inventor. And this little actress is a POWERHOUSE!Parents should know: It's a magical new Christmas musical that's safe for pretty much every age! There are a couple of warnings I would give. The movie involves magic, and even though it's more a science skill than supernatural power- if that bugs you, you won't like the movie. There is also a fair amount of fire. And a parental death (not a spoiler- it's in the description). Check out our full parent review with discussion questions at down the hobbit hole blog. I think this one will become an annual watch for us! Such a fun and inspiring holiday movie."}, {"id": 306, "text": "This gorgeous musical-like Christmas production is high on special effects, large dance numbers, and a diversity of musical numbers. It glows like Broadway Production number with lavish sets and powerful theatrical costumes, and dramatic emotional performances. Strangely enough though, this movie extravaganza seems to lack the traditional number of musical pieces and plays more like a child's fantasy movie with a lot of musical scenes, instead of being a real musical that allows the audience to sing, hum along in a seamless fashion throughout the movie. Nevertheless, this is an enjoyable, huge production piece that deserves rapt attention, in the fashion of Hugo (2011) with music or a youthful fantasy version of Chicago (2002)."}, {"id": 307, "text": "I am not big on musicals that's only reason it didn't get a ten. This is a wonderful movie for a family night. It's a make you feel good movie."}, {"id": 308, "text": "The only thing i didn't expect from this movie is, there is less confrontation between Mr Jangle &amp; his former assistant. As an adult watching this kid's vibe magical movie, it still gives me some good time &amp; moment to enjoy this movie until the end. I did not expect much but i would love to see more what Buddy 3000 can offer for the whole movie besides believing in yourself for it to be alive."}, {"id": 309, "text": "IF you fancy a hiphop/soul christmas musical, this is for you"}, {"id": 310, "text": "From the previews, I expected much more. The imagery was gorgeous, and the songs were great, but it dragged. The story set-up could have been edited down quite a bit to make the movie shorter. I also expected it to be a Christmas movie, but other than the decorated tree, it had nothing to do with Christmas. If I hadn't seen previews, I think I would not have been disappointed in the movie. The soundtrack was fun, as were the dance scenes. I really wanted to give it 10 stars, but it didn't live up to the hype."}, {"id": 311, "text": "My wife loves Christmas films so thought this would be right up her street. After an hour, both she and my 9 year old asked me to turn it off. I was so relieved because it was beyond awful. The songs are terrible and the acting is woeful."}, {"id": 312, "text": "Really enjoyed this. Really rate the production, with some great songs which are rather uplifting. Very much needed this year!"}, {"id": 313, "text": "I truly wish I had this in our annual Christmas repertoire as a child. I'm so glad we can show our little ones a magical Christmas show with catchy original tunes and spectacular artistry. Love it!"}, {"id": 314, "text": "I enjoyed the story but every time I got into the movie a dance scene came on. Normally it doesn't bother me as I enjoy movies such a Tangled and Frost but in this movie it just felt like it was added to make the movie longer. In the previously mentioned movies the plot continued as the characters were singing which made it entertaining.Listening to an entire song and watching the character dance was just boring and I ended up picking up my phone every time a song started. However, during the end of the movie there was a bit more action during the musical numbers.I'd definitely watch the movie again if they released another version with the songs entirely cut out or shorter."}, {"id": 315, "text": "How magical is this movie! I absolutely loved everything about it. The songs, costumes, the magical details in sets, the dances and the talented cast. I especially appreciated their singing! This is my new favourite Christmas movie."}, {"id": 316, "text": "We absolutely loved this. The music is brilliant, the singing fantastic, very reminiscent of the greatest showman. The young girl - just wow! We'll be keeping an eye out for her."}, {"id": 317, "text": "What a year for this BEAUTIFUL film to be released. The music was amazing, the costumes were perfect, the performances were magic. I had all the warm and fuzzies after finishing this film. A must watch for every holiday season to come!"}, {"id": 318, "text": "The head and voice of Elias are the same as Wall-E."}, {"id": 319, "text": "This movie is sensational! It has something for everyone! Music, dancing, love, and laughter - and of course, Christmas spirit! It's nothing like I've ever seen before in a Christmas movie. All new music by John Legend! If you loved Wicked, Peter Pan, and Willy Wonka, this movie is a combination of all 3 and so much more. I can't wait to watch it again!"}, {"id": 320, "text": "Jingle Jangle is a brilliant piece of work for the whole family! David Talbert's masterpiece represents all that is good when a storyteller creates an epic adventure that parallels so much of how we desire life to be. From amazing acrobatic dances to moving songs, CGI that doesn't detract or distract from the humanity of the story, this really sets the bar high for Netflix and for every other studio as well. It felt good to watch a new story that had the familiarity of The Greatest Showman, Mary Poppins, A Christmas Carol, Mr Magorium and Willy Wonka. The sets and costumes are extravagantly elegant, the music is delightful, and the cast is one of the best ensemble casts assembled anywhere. Watch it and I believe that you will fall in love with Jingle Jangle."}, {"id": 321, "text": "First off the music in this was amazing. The dancing and singing all on point. I would love to see this on Broadway. Story was original and decent. Great for kids. Few flat spots in the story where it could have been better. One for the more exciting and fulfilling Christmas movies out recently."}, {"id": 322, "text": "My wife and I watch this Christmas tale today and found it to be a joy part Broadway musical part mystical Christmas tale but most of all a very entertaining movie Christmas movie with some shortcomings in spots but heck its Christmas and all of the adults and children who enjoy the holiday. Did I mention this movie visual was spectacular to watch. I gave it a nine for giving us something a cut above and different from the run of of a the mill Christmas story."}, {"id": 323, "text": "An ok movie. Lovely VFX. But the storyline was ok. Those kids need better acting classes. Overall the jingle lacked jangle. They were trying so hard to make it emotional, but it didn't hit that cord"}, {"id": 324, "text": "I have to be honest. when i saw this was a 'black' x-mas movie i did not want to watch it. I thought this would be another one of those 'inclusive/represent' movies. Wich usually feel forced. THIS MOVIE DID NOT FEEL THAT WAY. It is an amazing movie with good acting, singing, dancing, songs and a lot of magic. Oh and don't forget about the costumes. I love this movie and nothing felt like it was added for political reasons. Just a good movie where most of the people just happend to be black. (ofcourse i understand that that's not the case but as long as the wright people get hired regardless of skin color, gender or sexual preference i'm happy and this movie feels like thats what they did)"}, {"id": 325, "text": "Just watched with the kids and it's awesome! Great effects and production, dances and songs blew your socks off. Love forrest whitaker and his performance was incredible! A lovely little story and 'buddy 5 (3000) is alive!!!!!'"}, {"id": 326, "text": "......You will LOVE this....Mixing the magic of Christmas with the magic of special FXForrest Whittaker, as usual, is awesome and to be honest the film didn't really have any weak links. Where we generally see Christmas films inundated with romantic rom-coms this made a very refreshing alternative to the normality of the genre.Has the same heart as The Greatest Showman with hints of Wal-E and The Nutcracker in what I can only imagine will be a Christmas film that will grow and grow with time!!Enjoy this Christmas with your loved ones and if only for a short while let's forget the trials and tribulations that 2020 has thrown at us!"}, {"id": 327, "text": "A Wonderful Movie gives you the Joy &amp; Happiness with the Christmas Holiday Spirit.Really Enjoyed it."}, {"id": 328, "text": "An amazing family movie. Great for kids. A plus to Netflix Christmas movies."}, {"id": 329, "text": "Its a nice movie but didn't really had a Christmas feeling with it? Or maybe it's just me. There's a lot of high tech and special features on it but I don't know. It's a nice movie for sure!"}, {"id": 330, "text": "This is how black people show middle finger to the film industry. Cast is 99% black. Diversity? What diversity."}, {"id": 331, "text": "Solid 10 absolutely brilliant, fantastic story and excellent acting from start to finish."}, {"id": 332, "text": "This movie was beyond anything I could of had imagined! The fact that MOST of the cast was black, was not only inspiring, needed in this time right now, but also very magical. I felt right at home, and this isnt something I feel when I go on Netflix.The story line was amazing, actors were amazing and the production from beginning to finish, my whole family was taken aback.Loved it and will be recommending to everyone!"}, {"id": 333, "text": "Black people are absolutely gifted! Love everything about this movie!"}, {"id": 334, "text": "Brilliant performances, amazing animation, original songs with outstanding dancing and all round magical movie making. 10 out of 10."}, {"id": 335, "text": "This was wonderful! Amazing cinematography, cast, and music."}, {"id": 336, "text": "Would have been far better not being a musical. Being almost 2 hours long you could have lost all the dance numbers and the movie would have basically told the same story.Also the storyline seemed to borrow from other films including the robotic 'Echo.' Not original at all but that's Netflix for you."}, {"id": 337, "text": "The plot of the film is good and the extra wooden doll animations as well but I believe that they could have had a better idea for the clothes and hair to make it look more like the characters are techy because all they did was they put gears in Journey's hair, for example gear shaped buttons maybe screw shapes earrings.It was a very nice film will all the singing and I've watched it twice but there are just a few tweaks😉"}, {"id": 338, "text": "Beautiful story with amazing cast.. but the sets, costumes, music and choreography make it absolutely magical."}, {"id": 339, "text": "I do not understand those negative reviews at all. This was a fun, sweet holiday musical aimed at kids but enjoyable for adults too. The music and dancing was top notch. The costumes and sets were eye candy. Such talent all the way around. I guess haters gotta hate, but don't let it deter you from watching. This was really a lot of fun to watch and it got better and better. I'm going to have to watch again because I want to learn the songs. Love it!"}, {"id": 340, "text": "A Christmas adventure movie. Made of magic. It is about an inventor who achieves his greatest creation and is stolen by his apprentice, unleashing a great adventure. A great blockbuster. Quality. Entertaining Family. With well-executed musicals and original songs, although in two or three moments the musical ensemble looks a bit out of proportion. Forest Whitaker is spectacular as always and also sings. Ricky Martin voices an animated character. Only two or three moments the special effects are not fully achieved, the animated characters and the sequences where there is action are not well achieved, the video game graphics look better. It reminds us of what Christmas is, to give, to share, to spend it with our loved ones, to forgive, but above all to have faith and believe. A movie that aims to become a Christmas classic."}, {"id": 341, "text": "Jingle Jangle mirrors many Christmas films that we know and love and provides a breath of life into a recently stale genre. Pulling themes and familiar tropes from classics such as Edward Scissorhands, The Wizard of Oz, A Christmas Carol and The Grinch. From the music to the costumes, characters and scenary Jingle Jangle is something sensational, something spectacular, something revolutionary.We are invited to listen to the tale of the world's best inventor, Jeronicus Jangle's (Forest Whitaker) fall from grace due to the thieving acts of his apprentice Gustafson (Keegan-Michael Kay). Losing everything, we see a beaten and broken Jeronicus, in a shabby, bleak, Scrooge-esque state, fighting for survival and in need of a Christmas miracle, to help save his shop and his home. Will his family, friends and colleagues provide him with the support he needs to regain his identity, imagination and creativity?From the very beginning Jingle Jangle is a wonder to the eyes and ears. Jeronicuses environment looking like a mix between Diagon Alley and the city center of Whoville; you are sucked into the world effortlessly. With its streets populated with individuals wearing clothing resembling the familiar bright wrapping paper patterns we use every year. With a contrasting emerald colour scheme, for Gustafson and his henchmen; echoing that of another fraudulent inventor ... or wizard, that we tend to see this time of year. Matching the dazzling garments, we are treated to slightly cheesy, but totally expected, impromptu song and dance numbers throughout. Something that even Jeronicus questions during his love interest Ms Johnston's (Lisa Davina Phillip) solo number. Are you drunk? Background dancers?. A stand out performance by Journey (Madalen Mills), Jeronicuses Granddaughter is one to look out for.With the introduction of Journey and her meeting Edison, Jeronicuses assistant, we are filled with hope as we find they have what Jeronicus has lost. Creativity, wonder and belief in themselves to follow their dreams.Jingle Jangle: A Christmas Journey is a heart-warming, colourful, thoughtful, underdog adventure for all ages. High budget production, slick performances and choreography, and a memorable tune here or there. Jingle Jangle reminds us of what it is to have a childlike curiousity when approaching all that we do and to never give up. Even when times are tough (I'm looking at you... 2020).A child with an imagination always belongs as does this film, to your watchlist.8/10, would watch again."}, {"id": 342, "text": "This film very much takes a leaf out of its flying Buddy 3000 robot. It is wonderfully and masterfully constructed; it is visually spectacular; and, at its core, it brings a beating, emotional heart."}, {"id": 343, "text": "A very low quality story, I guess that's why kids didn't like it, a lot of wrong messages sends to children. I don't think this is one of those Christmas hits of the future. Oh yeah, and what's with that singing, the nature of the movie and the story doesn't connect with that kind of music movie at all, and besides, the choice of music is just bad, anyway, this has nothing to do with Christmas All in all, finger down. The best part is the beautiful graphics that must be admitted!"}, {"id": 344, "text": "I enjoyed this movie from the beginning to the end. It is a great movie to watch with your family."}, {"id": 345, "text": "Ignore the other reviews, this movie is fantastic."}, {"id": 346, "text": "Loved the film colourful, quality production. However is it just me or did the sound keep going low during the songs which rather spoilt what would otherwise be brilliant overall and get 10?"}, {"id": 347, "text": "I wish people stop trying to judge these movies for the worst if it doesn't suit their needs, everything in musicals is not Rogers and Hammerstein, nobody's perfect. Every year there is a new crop of moviegoers who are simply looking to get entertained for the very first time. It's not these actors first rodeo, and who cares about the predictable plot, we already get it. It's a beautiful movie. Don't listen to the critics. Just watch the movie and enjoy."}, {"id": 348, "text": "I had high hopes for this film. The trailers certainly gave the impression of it been a good film. Sadly that wasn't the case!. Although the special effects and set are spectacular the story/plot doesn't make much sense? Pointless dance scenes and bursts of song don't add any clarity to the story Instead they squander time which could be spent developing at the very least likeable characters. Likeable characters are in short supply in this film but obnoxious ones aren't. I realise Forest Whittaker is a bit of a dry actor but in this he was devoid of oxygen.Not even my children enjoyed it."}, {"id": 349, "text": "The story itself was good. The songs weren't anything special but they weren't bad. The movie itself though was way too long at over 2 hrs. And I'm not some Millenial with a short attention span."}, {"id": 350, "text": "The trailer for this movie looked absolutely amazing, so I decided to give it a watch.The visuals are amazing. I loved looking at how beautiful the visuals can get from time to time. It was outstanding!However, the story was overall just... bland? Pretty predictable too. It's worth the watch for definite I would say, but maybe just 1 watch? And the songs just feel very randomly placed.Definately not a Christmas classic, but not the worst Christmas film."}, {"id": 351, "text": "I'm afraid I didn't get very far in watching this film. It's a musical with a period setting and costumes but contemporary singing and dance styles. It just doesn't work for me.That doesn't make me a hater or lacking in imagination."}, {"id": 352, "text": "The movie is way too long. Some songs and scenes are definitely not necessarily and I don't understand how no one saw that before releasing it. The ambitions with this movie are too high and it's just a mess because they want to include way too many elements in it. My 2 stars are for costumes, hair and special effects. The costumes and hair are Oscar worthy."}, {"id": 353, "text": "This is a very sad to see great actors do such poor work. I can easy name 7 films it has parts of, and way to predictable. I respect that that they tried, but copy cat is copy cat. However my young son did enjoy this movie, it just wasn't for me."}, {"id": 354, "text": "The costumes are nice, the story is mess. You can tell that the actors knew that this movie was going to suck."}, {"id": 355, "text": "Even my 8 year old twins couldn't make it through this movie. I love musicals, but not this one. The songs are terrible. It is a rushed movie that feels like you have already seen it. The sets are very well done, but it feels like it was made simply for the sake of making it. Watch Christmas Chronicles instead. The kids loved those movies."}, {"id": 356, "text": "There's so much wrong with this story and the way it's structured. The costume design, scenography, animation and most actors are AMAZING, but the story and the characters are just nonsensical and horrible for such an otherwise magical concept. Don't go into this and think it's about the robot. It's there in three scenes. The protagonist doesn't show up until half an hour into the movie. The songs don't reflect the plot or what the characters wants. It's just a mess."}, {"id": 357, "text": "This had so much potential. The colors, the costumes, the scenery, the singing and dancing. But it was so slow. Same story of someone stealing and being successful. Grandpa's part was so slow and too grouchy and too much of a pity party. We're only half way thru and already the kids have lost interest and the hubby keeps dozing. Starting to be a little painful to watch. But we'll keep watching to see if it gets any better."}, {"id": 358, "text": "It could have been great - had it actually been a Broadway musical. The singing and dancing, excellent. However, the storyline gets lost in the mix in this overly long movie, maybe because it's often hard to make out what Mr Whitaker is saying, or maybe they just included too much extraneous stuff unnecessary to the plot. I was bored most of the time, but hung on, hoping the actors could compensate for this movie's faults. Alas, they could not, although they really tried."}, {"id": 359, "text": "A surprisingly enjoyable movie. It will make one cry tears of joy and tears of sorrow. Great acting, great production and colorful. Madeline Mills is an up and coming young actress. If she keeps her head on her shoulders we'll see much more of her in the years to come."}, {"id": 360, "text": "Story is good, could have been so much better though if they got good actors in it. Very wooden. Photography is good. It's clearly written for the stage."}, {"id": 361, "text": "This is a magical adventure with amazing musical numbers I think it could have been a Disney movie the acting is good enough in this movie The pacing isn't amazing but it's fine I miss overall a great family movie and an incredible story of the potential you have on Earth overall I give it a 84%"}, {"id": 362, "text": "The Black actors were amazing!!! The music! The dancing!"}, {"id": 363, "text": "I think we often mistake datedness for innocence, and dated films for innocent ones. Jingle Jangle on Netflix is a dated film. It's a Christmas movie made for children and thus its datedness is easier to pass off as innocence. I say it is made for children because adult complexities can be captured in single sentences here, and so your reaction to them will only be singular- sympathy or anger or hatred.READ THE FULL ARTICLE ON FILM COMPANION"}, {"id": 364, "text": "It's an ok family movie. I like the music and the story is simple enough for a 7year old to follow. However, there is unnecessary sexual innuendos when the lady is dancing at the pawn shop touching herself all over. I found that very unpleasant and unnecessary."}, {"id": 365, "text": "Cute Cheistmas movie, except for the hip hop. I like Christmas movies, black cast or not, and enjoy musicals, but the hip hop kinda ruined it a little. The dancing scenes could have been left out. I like the clothes and the era. The 3 men doing background singing remind me of BBD. Good movie, except the hip hop and dancing."}, {"id": 366, "text": "Wow wow for two days now I have watched this movie about five times. My daughter say to me Mama this is the best movie ever. I agree, the songs are incredible The costume are to die for, well done guys."}, {"id": 367, "text": "IN A NUTSHELL: This jubilant movie is a breath of fresh air. If you love musicals, you'll love this. If you don't, step away. It feels like a colorful Broadway stage play but it's even better because of the magic of technology and filmmaking. The movie was written and directed by David E. Talbert featuring a mostly African-American cast. It's not the typical Christmas show, but it will definitely get you in the mood for magic and wonder. Thank you to Netflix for saving 2020 with all of the awesome content this year and for inviting me to screen this movie early!TIPS FOR PARENTS: This is entirely family-friendly entertainment. Yay! Little girls, especially, are going to love this. When your kids have a hard time with math, just remind them about the square root of possible.THEMES: We wait for no tomorrows! - Don Juan Diego (Ricky Martin) The square root of impossible is the possible in me! - Journey ( Madalen Mills) Obstacles Possibilities Be who you're meant to be If you believe, it's all possible. - Grandmother (Phylicia Rashad)THINGS I LIKED: The musical score by John Debney is spirited with fun variety. I don't know if little girls around the world will stop singing songs from Frozen 2 but these songs are really sweet. Every singer in the cast blew my socks off. The songs perfectly fit the scenes and feel like they belong to the story. The lively singing and energetic dancing are delightful. It reminded me of the joyful movie The Greatest Showman , which is quite a compliment because I absolutely love that movie. The talented cast includes charismatic performances by Forest Whitaker, Keegan-Michael Key, Hugh Bonneville, Phylicia Rashad, Justin Cornwell, Anika Noni Rose, and even Ricky Martin! Madalen Mills is absolutely adorable and fantastic. Her voice is pure and she's definitely got some acting chops that will surely grant her a great future in films. Do I smell Disney in her future? Who else wants Phylicia Rashad to be their grandmother? Yes, please. I thought the toy matador was so fun and I wanted to see more of him. He's voiced by none other than Ricky Martin! I love how the live-action movie was intertwined with animation. There is a cute snowball fight scene that used local business owners and shops as Extras in Norwich, England where the scene was filmed. Charming set design and production. I didn't know Keegan-Michael Key or Forest Whitaker could sing! Wow! Nice! Forest Whitaker actually sings three times! John Legend recorded the song This song and stated, As a father, I jumped at the chance to be involved with a holiday film that's both inspirational and inclusive, a film with a great message where my kids can see themselves reflected on the screen. He wrote some of the other songs and produced the film as well. Some really great CGI. The costume design by Michael Wilkinson is extremely vibrant and detailed with fun touches. Keep watching during the closing credits for some more cute images that match the job titles of the crew.THINGS I DIDN'T LIKE: The lips don't always quite match the singing. All of the songs are good but they're not all memorable. Some cheesy, overacted, cliched moments. It's hard to tell where the story is supposed to take place...USA? Europe? England? The new toy toward the end of the movie looks an awful lot like Wall-E. There are a LOT of plots crammed into the story.FUNNY LINES: * You can throw roses at my feet later. - Don Juan Diego (Ricky Martin)Ok, back to me! - Don Juan Diego (Ricky Martin) Well, you hurry back as slowly as you can. - (Forest Whitaker)INTERESTING LINES: It's not stealing when you borrow indefinitely. - Don Juan Diego (Ricky Martin) What makes you think you can get it work? - Edison Latimer (Kieron Dyer) Because there's nothing that says I can't. - Journey (Madalen Mills) The magic isn't just in what you've lost. It's in what you still have. - Ms. Johnston (Lisa Davina Phillip) A child with an imagination always belongs. - Jeronicus (Forest Whitaker Never be afraid of what you can see. Only be afraid if you no longer see it. - Jeronicus (Forest Whitaker)You can see the rest of my review on my Movie Review Mom YouTube channel and website"}, {"id": 368, "text": "This likable Christmas movie combines feel-good cyberpunk tech, colorful riffs on 18th century dress, energetic dance numbers, and the gruff-man-redeemed-by-child trope into an energetic escapist concoction that hits all the right Christmas notes.The cast is a likable collection of talented actor/singers, most notably the radiant Madalen Mills as the little girl who eventually becomes the main protagonist.The dance numbers are wonderful; I particularly liked the antagonist's toy debut and the mail lady's frisky (and failed) seduction. The songs backing them are fine but most didn't strike as as memorable on first lesson, although I did find myself humming Madalen's big I'm going to do fabulous things number during the next scene.Jingle Jangle is fun but not by any means original. Instead it's a bit of a greatest hits collection of tropes from other films, including a cute toy that is pretty blatantly a Wall-E meets E.T. knock-off (to the point that when I saw it in posters I thought, wait, that's from something else).It also has an anti-gravity bit that makes no sense even within the world's rather fanciful physics. It's not explained and I just found that really annoying. It's like the movie couldn't decide whether the world was magic or not so it made most of it generally sci-fi-ish but then decided to toss in one thing that was just flat out sorcery. That really bugs me, especially in a movie that really emphasizes science and engineering.Jingle Jangle is also, like a lot of Christmas fiction, wonderfully calculated. Christmas Carol is a ghost story but also an attempt to change attitudes towards the poor and unchecked capitalism while Rudolph the Reindeer is an adventure that is also a plea for tolerance and acceptance of difference in oneself in others.In that tradition, Jingle Jangle is a clear attempt to reframe Christmas entertainment away from its overwhelming whiteness. The movie presents a charming pseudo English village where almost everyone is black and middle-class. It offers a little girl who is a hard-core math geek (can a movie like this change the balance of men to women in STEM? We'll find out in a couple of decades). It is a movie that wants to make the world better, which is an honorable goal.Perhaps that's why the film is so derivative; it doesn't want to rock the boat, it wants to repaint the boat with more colors.While the movie goes on a bit long and has some sluggish patches and janky elements, overall it's hugely likable. My girlfriend was in a terrible mood when she watched it and said it was one of those rare movies that could make her feel better.It's not perhaps the *best* Christmas film, but I do think it's effortlessly put itself into the Christmas Classics rotation. You should definitely check it out."}, {"id": 369, "text": "I had good hopes for this movie, as I tend to love musicals, and do believe that representation is very important, especially when the subject matter involves STEM topics like inventing.But after watching half of it last night, I really have no desire to watch the rest. I can't remember any melodies or lyrics that stuck in my head like they usually do after I watch a musical for the first time. The production values here were very high -- sets, costumes -- it's all so beautiful. But no amount of money can cover up a lackluster story in my mind.It started well enough, but after the first couple musical numbers, I was disappointed that they really didn't do much to further the plot or character development -- they seemed tacked on, like a string of barely connected music videos (complete with bad lip-synching).I can't help thinking about something I heard about one of the people who used to work on Disney musicals, and his philosophy was something along the lines of: when emotion becomes too much for acting, move to singing, and when it's too much for singing, move to dancing. Maybe that's why the music felt tacked on.Also, just thinking about opening musical numbers I've loved the most, it seems they should teach you something about the characters. In Beauty and the Beast, the initial song tells us a lot about Belle -- the things she likes, what people think of her, where she lives, and also the guy who's interested in her. In Fiddler on the Roof, the opening song is all about the traditions of the main characters -- where they live, what they do, what they value. When the big song opened up on Jingle Jangle, I thought there was so much potential -- we could have learned a lot about this Jeronicus Jangle character, we could have been given a tour of his workshop and learned about what kinds of things he's invented, and all the other things in his workshop. But there was none of that. It was just a bunch of people dancing around and singing about how excited they are about some vague wonderful thing that's supposed to happen. But I don't know any of these characters yet. I never felt like I connected with any of them, and so maybe that's why I don't care what happens in the movie.Note to moviemakers: you have to earn your audience's excitement. Don't just wave a bunch of expensive costumes and feel-good words in my face and expect it to mean something."}, {"id": 370, "text": "Great music. And wonderful voices.. Fun and well done dancing, if somewhat repetitive.Tons of fun seeing Keegan-Michael Key dancing and singing.Parts of the movie were contrived and made no sense. But, what Christmas movie doesn't have such parts. Nature of the Beast.I don't know if it will be an ongoing Christmas Classic, not because it isn't good enough, it's just whether the plot is such that one will want to. Great movies don't necessarily mean you want to watch them over and over. But, I may change my mind.Great acting overall and great characters. Only exception is the Edison character. But, he got better.If the people criticize this movie, didn't do the same for Elf, The Santa Clause, or Christmas Vacation, they are being a smidge hypocritical.When it comes to a Christmas Magic, you have to suspend logic to an extent.Overall, it was a very good, if not great movie. Wardrobe and scenery was excellent. Singing out of this world, with the exception of Forrest Whittaker, who was still spot on for the part.I hate to say that nearly everyone being black bothered me at first, then I realized how white most such movies have been in the past. By the end, it mattered none at all. And I think, like Hamilton, it is a very good thing.Great job all."}, {"id": 371, "text": "It was beautiful and splendid to watch...if you turned off the sound. The script was total nonsense. What happened to holiday movies everyone of all ages can enjoy. This movie has age suggestion 0-6 yrs old. Everyone else is going to cringe and struggle through the movie. The story made no sense. Jeronicus goes from depressed, defeated old hermit of a man who hates his granddaughter to getting in a snowball fight with random kids in the street and laughing literally just like that. Absolutely no character arch. Then you have a little girl who can do advanced calculus in her head at the age of like 8-WHAT??! And the calculations were literal nonsense which is just insulting to anyone above the age of 11 who actually knows anything math and science. They said things like 2 + 2= the cosmological factor of the galaxy's fantastical quotient to the power of hyperbole of the square root of unbelievable. I'm sorry to ruin your Christmas movie but this is not teaching kids anything and literally giving the exact opposite impression of how math and science works. Not the mention they suggest that the little girl was born with the skills to do math in her head which doesn't exactly teach kids to work hard in school because if you have to be born with the right genes. Or it teaches they have to do what their parents or grandparents did because the apple doesn't fall far from the tree. Idk about you but I think a diamond in the rough is more inspiring than to teach your kids if your single parent mom is a waitress then that's prolly where you will end up too. Then Ms Johnson (the love interest) was like if Hello Dolly showed up to work all methed up. She clearly was on speed. She didn't seem to even know what her job was because she bumbled around like a chicken. Not to mention how she was demeaning to women for falling all over a guy who point blank told her he didn't like her and he treated her horribly and she still kept running back. What does this teach our young girls. It's that age old stupid notion that if the boy pulls your hair, it's because he likes you which is how girls become women in abusive relationships when they get older. The decisions made by the characters were literally for the sake to move the story along or expositions. It was one crazy stupid decision after another. It seemed forced and stupid to the point where you wasted a marvelous cast of incredible actors and stupendous costumes and vfx. The writers should all find new jobs. They should be ashamed of this."}, {"id": 372, "text": "If you're looking for super deep plot twists and layered story telling then no, you won't find it here. Jingle Jangle may try to cram as much festive cheer into the 2 hour run time as I do with pigs in blankets at Christmas dinner but that doesn't take anything away from the vibe of this film.Beautiful set design, costumes, cinematography, choreography accompanied by a high end soundtrack by some of the industries' highest award winning creatives gives us a real treat on the eyes and ears.I'm not into musicals at all but even I couldn't help but get swept up in this little gem of a Christmas musical, nodding my head and tapping my feet to the non-traditional songs we've become accustomed to with typically 'white Christmas' films.After all of the misery that 2020 has brought to so many, Jingle Jangle is the perfect remedy to put on and forget, even for 2 hours, everything else and feel all warm and fuzzy.Does it have flaws? Of course. Does it matter in a festive kids musical? No.Also, Forest Whitaker's performance should not go unnoticed as he proves he is still very much worthy of being the lead actor. Couldn't help but choke up at times (no spoilers here) and who knew he could deliver when it comes to dropping a tune. He should do it more. Madalen Mills also destined to become a superstar.Take it for how it was intended and you will love it!"}, {"id": 373, "text": "Script is a borrowed boring rehash of other films &amp; musicals. NOTHING original, but that is pretty much the norm for Netflix. Their writers must google good movies them rewrite them as poorly as they can. They should stay out of the movie business, they are destroying it and eventually we will have no choice as they get bigger by the second.Acting was beyond brutal, actually no acting. Just script reading by un-known amateurs, even the 2 big names should run and hide after this train wreck. So embarrassing.Some reviewers are wondering why there are haters giving this a low score. We are not haters, we just see past the glitz and force fed ideals. Think Cats movie - This is in the same wheelhouse for catastrophic failures.Netflix was stamped all over this. Netflix shows are just what the old made for TV movies were like. We need the BIG movie houses to get back into business! NOT the BIG TV companies like Netflix masquerading as one stop shop for all entertainment.I gave it a 2, instead of a 1 because the animation was okay."}, {"id": 374, "text": "In the filmmaker's want to create a universe, he neglected the plot (ie what happens in said universe). There's a lot going for the film: some amazing singing, toe-tapping lyrics, some good choreography, dazzling cinematography, set design, editing. You can tell they really tried to make something special and had no limits to get it. That, though is likely the problem. Limits make creatives cunning and conservative with their resources, it leads to re-writes &amp; redesigns &amp; trimming of the fat. Here, you can tell it has no limits and thus an inexperienced filmmaker is let loose, you can hardly blame him for not grounding the idea in originality or complexity. This is obviously a simple child's tale, there's no problem there. Nobody expected this to be The King and I or Sound of Music in subtext, but the characters too often stop everything to sing a full song, when that song has little to do with furthering their character or the plot. When it does, the plot inches forward in a very slow, predictable and tired way. There is more fun when the young cast is going on then when we flash forward. At least the young brooding toy maker has a Phantom of the Opera darkness that is fun and matches well against the bright Christmas backdrop. However, as soon as we go to the later times CGI characters, not unlike the plastic ones in the early days of cinema (90's Flubber or Small Soldiers comes to mind), take over the direction of the scene but aren't likable enough to care about nor dislikable enough to care about either. They are flat, the whole film falls flat, is hollow, too simple for a mega spectacle. It reminded me of the terrible La La Land, in which everybody in Hollywood thought was brilliant, but my family and I kept waiting for it get started, unable to engage with. I love that they have an all black cast, black filmmakers... totally about time to do so... but this film wasn't the right one to invest in creatively. The production was up to being the best Christmas movie of the season, but the story and delivery simply didn't deserve the attention. I hope Netflix and other continue to invest in black cinema, just with better scripts &amp; more interesting deep characters... even in a musical, even for kids, this fell flat."}, {"id": 375, "text": "There's a lot going right for this film - a simple christmassy story, the colours, the CGI (liked Don Juan Diego), the set scenes, the cinematographyBut the whole movie is spoiled the very naff musical dancing numbers - some that go on forever - was like they gave the composer a few pages of the script and said come up with something people can singIt wouldn't be so bad if any of the songs were memorable but they are definitely not unlike The Greatest Showman - they were far too shouty, maybe that would work on a stage but not in a film. Look to Annie, Oliver Twist etc for how similar films work with musical setsThe Ms. Johnston character is the standout in the film - entertaining and endearing when ever she was on screen(As for the Trivia - Buddy 3000 is nothing like Wall-e - has that person even watched that movie?)"}, {"id": 376, "text": "This had all the ingredients for a great family Christmas film.Good cast, check Solid story, check Great set and costume design, check Excellent special effects, check Top songs, checkThen whoever did the sound/music mixing and editing went and threw a massive spanner in the works.When it comes to a musical, one of the most important things to get perfect is the sound, but oh my days... the levels are all over the place and it really makes a negative impact.It's especially noticeable during songs where there are lots of dancing and additional background noises.One moment everything sounds great, then the music it too quiet, then the vocals are too loud and then suddenly everything muddies together.It's a shame, as it's a massive flaw in an otherwise enjoyable film."}, {"id": 377, "text": "FIRST let's get the thorny issue out of the way: People are saying this is a racial story or a black story. If that's the first thing you noticed, you may need to reassess *why* you noticed that so much. Yes, the lead characters *happen* to look African by heritage (ethnic traits do tend to pass down from same-ethnicity parents!) but I detected no agenda beyond the rather tautological message that self-belief is the key to -erm- self-belief! Now for the actual review. Visually it's gorgeous, but so sweet I sometimes felt queasy. Here's my problem, it looked like an archetypal Christmas film, but did not feel like one. That story could have happened at any time of the year. It was a dull predictable story too - the plot actually had not one single 'I didn't see THAT coming' moment. That's probably still entertaining if your actual or emotional age is still in single figures, but, if you've been around a bit longer, you may come away jadedly disappointed at how little life-affirmation it gave you. It promised to be so much more from the trailer, but I just didn't really accept the characters as real. They were each introduced with formulaic clues as to their inner psyches... then those psyches were never explored. Given that it was over-long for a children's film, they could have found opportunities. Instead we were assaulted with 'uplifting' Disney-style power ballads, but few real emotional interactions. Even there, half the time they weren't even singing *with* or *to* anyone. The songs certainly showboated some powerful voices, but had lyrics that were inane and did not even properly rhyme. I had forgotten every one as soon as the film ended. Sadly the songs also highlighted that though Mr Witaker has many talents, in comparison to the other singers, singing is not his strongest. Without giving away the plot: I came away annoyed that character A clearly under-valued character B, which turned B bad, and then character A was never called to recognise they were actually responsible for creating their own antagonist. Including that one confrontation, admission and reconciliation in the story would have raised the dramatic effect and pathos enormously. My favourite bit, seriously, was recognising one of the location shoots as a place I know! In short, it was ok for a bit of fun - a funked-up Mr. Magorium's Wonder Emporium if you will - but I wouldn't watch it again next Christmas, or ever."}, {"id": 378, "text": "Another glammed-up fantasy movie that's far far from fantastic - unfortunately, as usual, all the expense and efforts went into the glam sets, effects and dance choreography, and good scripting and story telling just dumped aside in the dust heap.A good cast wasted on poorly developed characters mouthing yesterday's tacky common dialogues, some clearly in the zone of laughable unfunny garbage - eg. 'love closes the wave function' - eeek!None of the songs are worth remembering, lacking in originality and a worthy tune.Loopholes abound and characters behaving in ways that are meaningless and ludicrous, with baseless motivation that makes you go 'huh?'And isn't this supposed to be a family children's movie? So what's with the lascivious gyrating widow out to hook her next lay?Ricky Martin's voice over is surprisingly good - possibly the only highlight of this empty glitter. But then as a character that too falls into the throw-away heap.An effort that's all about technical production pizazz ... fullstop. 😟"}, {"id": 379, "text": "Tis the season for new movies... at least it used to be before the virus hit. What normally would be a busy Friday night has turned into scarce pickings over streaming and trying to keep up with the idea of specials that these sites are loading out. Tonight though, I managed to catch the early seasonal film, an attempt to get a Christmas spirit going in hopes your little ones will catch the magic of the holidays. So, what do I think of the latest direct to stream film? Please read on to hear my thoughts as I review. Movie: Jingle Jangle: A Christmas JourneyDirector: David E. Talbert Writer: David E. Talbert Stars: Forest Whitaker, Keegan-Michael Key, Hugh Bonneville LIKES:The Cute/Charm of the movie The Costumes The Setting/Effects To make the Setting The Storytelling CGI at parts The Messages The MusicDISLIKESThe Rushed Opening The Lack of Christmas Energy The Lack of Suspense The Story is Weak AT a lot of parts Too In your Face/PreachySummary:I give Talbert and his crew props for crafting a tale that feels much like a children's novel meant to inspire and ignite the dreams of the young. Jingle Jangle is a movie with all the trimmings and charm that feels like it came out of Disney or Nick Jr. studios. Very little darkness, very little dismay, the diluted hard knock lives only act as a means to ignite the spark of hope that this movie carries with it. The inspiration of hope, creativity, and belief are strong messages in this film and you can be sure those who love their Hallmark and young adult films will get caught up in the aura this movie unleashes. In regards to the manner it tells this story, that is my favorite part at this stage of my life and where I think the movie does things quite well. Costumes bring you into the Christmas Story vibe as a much more ethnically mixed cast shows off the designs and brings you into world Talbert wants to build. Settings using stage pieces and CGI take that journey one step forward, but mixing in a bit of fantasy clockwork that the Nutcracker made a few years ago that is intriguing to see. Regardless the world building is rather impressive, and other movies can be seen as the inspiration for the direction they chose. Amidst the different acts, a nice telling using clockwork robots is used to fill in the interluding space, again capturing the charm of a Christmas specialty shop I visited when I was younger. It's a nice twist in style that I appreciate, though maybe it did get a tad overused.. However, the real wow factor for this movie's presentation is the songs that come with it. While not as diverse, Jingle Jangle's soundtrack reminded me much of The Greatest Showman. Wailing orchestral music combines with hip hop, funk, and classical to make a toe tapping ordeal with numbers that are both motivating to get up and dance and also emotionally layered as well. The opening number in particular was one of my favorites, and a middle number as well hit the spot, while others serve to be whacky and entertaining for all ages. Like many of the modern day musicals, lots of time and resources went into this element, and I believe some story sacrifices were seen to load the 2 hours with as much music as possible. If that's your angle, this movie should be number one on your spot this weekend, if not, well read on to hear my limitations with the film.A strong opening that promised magic and a true Christmas adventure, quickly become rushed, musical numbers overshadowing the story and character development at many parts of the movie. Never did I feel this more than the opening where so much set up was cast into an interlude in order to fast forward to where our younger cast could make a splash so to speak. It seems during this rushed opening where villains and supporting characters quickly got crammed in and swept aside that the Christmas components also got lost, dropped into the pre spirit visit of Scrooge's life and not really escaping this until the very end. The movie sort of diverges from even the Christmas error, instead becoming more towards rival toymakers, greed, and some inventing components similar to Hugo meeting Wall-E's designs so to speak. Was it cute? Yes, quite adorable, but I don't know if I would call this a Christmas Journey, more than journey for self-growth near the end of the year. In addition, the suspense and challenges we see in movies (Santa on trial in Miracle on 3rth street, Home Alone's Kevin defending his home from robbers, or even the Rugrats trying to trap Santa in the chimney) were missing in this film.. A few challenges and test of character, Jingle Jangle trades real development of threat and ingenuity to solve problems for more musical numbers, feel good monologues, and kid friendly slapstick for lack of a better word. It leads to sort of a haphazard story that is a bit weak for my tastes and loses the collective picture I think we all look for in the seasonal films. And perhaps the worst of all... it feels like a sappy, political, Facebook post when trying to deliver its messages. Again inspiration, but I agree too much that it misses the mark of a truly motivational movie for another filler meant to be added to the collection of the streaming movies, but again if that speaks to you, you should have no qualms with the film.The VERDICT:Given what passes for Christmas movies these days in a world of mass produced generic films, Jingle Jangle stands out in several departments. It's got the charm and magic of a kid's imagination that the season is about, with costumes, CGI, and setting that finally took me back to my childhood. Throw in some toe tapping numbers and some cool storytelling effects and you once again add points for raising the positive factor for the season. However, the movie is again about the superficial entertainment pieces and misses the full cohesiveness that several classics have maintained from over twenty years ago. The story is nonsensical and not much of the Christmas direction it promised, and the film's pass on adventure did not quite keep me as engaged as the opening number did. Still above all else, it's going to serve as an inspiration to a number of families and given it's accessibility is perfect for a direct release at home. Given the thoughts, the ideal is for those with young families, primarily ages 3-12 who like the song and dance gimmicks and not so much about complete stories.My scores for the film are:Family/Fantasy/Musical: 7.0 (Family/musical themes) Movie Overall: 6.0"}, {"id": 380, "text": "Very much a kids movie, but one which could be enjoyed by adults as well. This Christmas fantasy's strengths include impeccably detailed, sumptuous set design and set decoration; beautiful costume design, very colorful and imaginative - I'm not usually the kind of viewer that notices costume design but it's really spectacular here; good choreography and enjoyable songs - some of them are a bit too much of what you would expect from this kind of movie, but enjoyable nonetheless; excellent vocals and casting from top to bottom - I never knew Forest Whitaker could sing! Netflix clearly invested heavily in the project. The special effects are excellent and production values are high, and it certainly is good to see such a movie with a Black cast dominating all of the lead roles.The story does rely too much on the all you have to do is believe trope, which is repeated over and over again, and certainly the conflict and character development are utterly two-dimensional. But then again, that's not the point of this movie. It's a fantasy, very much along the lines of Peter Pan, and achieves what it sets out to achieve. It's an entertaining, escapist holiday fantasy."}, {"id": 381, "text": "I wanted to love this, I really did. I give many props for the representativeness of the cast, especially with the theme of empowering women and people of color in engineering, science and math. Visually, this is a really good looking film. A few (not all) of the original songs are catchy, and much of the dancing is off the hook. And then, that's it. Many of the negative reviews on here mention how the film is derivative of many other holiday films that have come before it. True, but not a deal breaker - after all, there are only so many ways to be original when compared to the 1000s of other holiday movies out there. My problems are plot, pacing, characterizations and motivations - the writing seems to be last on the list in Jingle Jangle. Forest Whitaker is a Academy Award winner and a national treasure. He has nothing to work with here. Mr. Jangle moves from resenting his granddaughter to screaming I love you in the course of minutes - I felt like I had fallen asleep and missed important plot points, but nope. The rest of the cast fares little better - what are their motivations? Why are the evil characters so evil?POSSIBLE SPOILERS AHEAD (but c'mon, it's pretty formulaic...)We are told through the frame story that the Jangles didn't have any proof about the evil deeds of Gustafson and I guess we should just accept that? Lazy writing. There is no development of Lisa Davina Phillips' character other than her odd obsession with Jangle...the obsessed fluffy girl trope - lazy characterization. The conflict comes almost solely from the vague threat that the bank(?) is going to foreclose(?) on him, despite the fact that his friend (we know this because he calls him old friend a couple of times) will save him, if only he can complete his astonishing invention. Lazy plotting. I wonder if THAT will happen. Speaking of, the astonishing invention only interacts with the characters for like 5 minutes and suddenly he's their best friend and the most important thing in their world? Or, he's just there to sell toys (look out Baby Yoda!) Everything that happens is a huge MacGuffin - it's never explained how Jangle rediscovers his power to believe. The magical math that Journey can do extends to the square root of possible. Um. I'm not looking for A Beautiful Mind here, but this is so trite and meaningless that it almost undercuts the important work the film does to show that black girls and women can succeed in science and math. And the big ending reveal that our narrator, Phylicia Rashad is...gasp...well, rather than spoiling it, how would these kids NOT have known about Jangle's toy factory - the factory of the greatest toy inventor who ever was - that happens to be across town and visible from grandma's window? It feels like this is a big budget film that spent all its money on visuals, music, dancing, and then there was no money left to polish a script/story. It's not even particularly holiday-oriented other than the glurgy good feeling. Hey, I love glurge, and I'm all in favor of good feeling, especially around the holidays, but glurge has to be backed up with clear character development, or a real experience of something miraculous happening. Both of these are missing from Jingle Jangle. Someone once said that the only thing more disappointing than a bad movie is a movie that could have been good."}, {"id": 382, "text": "Jingle Jangle is Netflix's foray into the Christmas musical market.Forest Whitaker is the grumpy inventor Jeronicus Jangle. Many years ago he was the greatest toy inventor. Then his young apprentice Gustafson egged on by a villainous toy stole his his various designs and became famous and wealthy.Now Jeronicus is heavily in debt and has lacked a creative spark for many years. When his estranged granddaughter visits him he is coaxed back and inspired to work in his latest creation. A talking robot.This is an engaging film but let down by forgettable songs. It needed a big show stopping number. The kids might find the songs a tad dull and also the movie is overlong. The colourful production values are very good and almost Disneyesque.It does borrow heavily from other movies. The Princess Bride in the way it is framed as a grandmother tells a story. The Greatest Showman is the obvious inspiration and Wall-E by the look of the robot."}, {"id": 383, "text": "A Christmas musical that embraces its musicality to the fullest. Jingle Jangle: A Christmas Journey is a very simple, yet heartwarming story that suits the holiday season perfectly.I'll start with the musical numbers since they are easily the best part of this film. These musical numbers are the likes that shouldn't be in a movie. They should be on stage. Everything from the dancing to the singing to all the other choreography is wonderfully over the top and look like something directly from Broadway. The musical numbers are just the right amount of ridiculous to make you smile. The songs are great as well. They are catchy enough to pull you in and touching enough to keep you there. I suppose my only complaint in regards to the music is that there isn't anything even remotely Christmasy. Since the movie is advertised as a holiday movie and takes place during Christmas, I was hoping that it would've been slightly more in line with that theme.As far as the story goes, there isn't much to say. It's a simple story with a predictable direction. However, I do think that kids will really like it. After all, the film is directed at them. But, the story is charming and heartwarming enough to make adults like it as well. The musical numbers certainly add their own flavour and charm, and I think that that's where most adults are going to find their enjoyment. The middle of the movie does feel a little slow, though. That's where the story is the most predictable, and that's also where the musical numbers are the furthest apart.To tell you the truth, I was positively surprised by Jingle Jangle: A Christmas Journey. A film like this could've easily been overly cheesy and so heavily oriented towards kids that adults would've really struggled with it. Fortunately, the film manages to walk that thin line where the orientation is clearly towards kids, but adults can, and will, enjoy it too. The ending certainly plays a big part in that. Although it's exactly what you would expect, it still manages to make you happy and leaves you with a smile. Precisely what films like this, are supposed to do.To enjoy this movie, you certainly have to like musicals. Jingle Jangle: A Christmas Journey takes full advantage of the musical genre and is everything but shy with its performances. If that's something that you like, then this movie will be a great addition to any holiday movie list."}, {"id": 384, "text": "It seems like it is a cute movie, but I don't feel like it contributes much, and gave me serious The Polar Express Vibes, and Annie Music vibes, but isn't nearly as good as the two movies. The music was poor, and it's only been half an hour after I watched the movie and I forgot all of the songs, except one, Make it Work which I did enjoy a lot. and it didn't give enough time to really let you bond with the early characters, and only seemed to be the cliche type villain, where they don't get what they want so they retaliate.The thing is, this movie gives me serious, and I mean SERIOUS The Polar Express vibes. Some scenes reminded me of it, and just the overall theme of this movie was exactly the same about BELIEVING, but the only difference in my eyes is that The Polar Express has very inspiring music that doesn't compare to anyone else's, and the plotting and entire movie did capture my eyes. (I'd recommend The Polar Express more, it has very unique music that cannot compare, and has it's entirely different thing going on that captures your full attention, while being a bit of a musical itself, it definitely flows better since it goes very well with the scenery and doesn't make them stop to capture more minutes in the movie, it's not lengthy and it will always make you curious for more.)Even if this movie didn't peak my interest, the actors were amazing, even if they were given a cliche script to read off of. I'd ENTIRELY recommend them to play in other movies."}, {"id": 385, "text": "I will admit I am a cynical man, but when I was watching this Netflix is clearly trying to paint a perspective of how they see the world and be at the forefront of racial change even if it means making this movie hyper stereotypical and go backwards in what they think they're achieving.Besides the aggressive racial ploy the movie for what it's worth is not terribly bad. It has a great production value and it's easy on the eyes. The acting is really good as well but the movie also falls into the trap where it tries to do too many things at once and at sometimes seemed like it was trying to do too much and lost itself.If you're into Christmas movies for the sake of it, this might be your thing, but it doesn't bring anything new or classic to the table. Essentially a rip of Greatest Showman with a netflix burning left agenda twist on it. It was lighthearted enough to make me smile in certain bits and this is why I wouldn't give it anything below a 5. But this movie is definitely passable."}, {"id": 386, "text": "Having just reviewed the darkly comic Christmas story Fatman, starring Mel Gibson, I anticipated being hauled into the light spirit of a classic-type holiday musical called Jingle Jangle: A Christmas Journey. I was right-it is like other Christmas stories specially crafted with high voices and high jinks for kids, and not so much for adults.The story is boilerplate holiday sentiment-family trying to bring everyone together amicably, greedy guys trying to tear family apart, and songs suiting meaning without much to remember except bouncy tunes and dazzling dancers. Oh, yes, one of the only white guys is the banker Delacroix (Hugh Bonneville), who is about to foreclose on the shop (been there and better done in It's a Wonderful Life).Jeronicus (Forest Whitaker as the older, Justin Cornwell as younger) has lost his gift for invention as well as his invention book, thanks to former assistant Gustafson (Keegan-Michael Key), a disaffected emerging inventor seemingly ignored by his boss. Jeronicus, now just a toymaker with a toy shop now pawnshop reminiscent of the kind of clutter Johnny Depp made magic with) will, of course, be saved by his irrepressible granddaughter, Jessica (Madalen Mills-no child could be that cute, but she is), who has his inventive genes in good order.Writer-director David Talbot knows how to create and sustain the imaginative world of effervescent kids to complement it with serviceable songs from Philip Lawrence, Davy Nathan, Michael Diskint, and John Legend (a producer of this film) like Square Root of Possible and Legend's R &amp; B Make It Work. Magic Man G may be the most memorable, and This Day could have been from any Broadway musical.Jingle Jangle has the potential to be a holiday staple despite grouchy critics like me for whom Bad Santa is the mark of excellence. If you gravitate to over-crowded Dickensian sets, clear villains, weepy moms and grandmas, and magical inventions like the High-flying Buddy 3000, a robot who talks and seems descended from E.T. or Wall-e, then relax by the fire with your kids and a modest cognac, and watch it on Netflix.You may doze, but then you can pick up the story because you've seen it all before. Merry Christmas."}, {"id": 387, "text": "So the good points:The costumes, set and special effects are pretty good.The bad points:The story, the songs, the acting, the length and just about everything else. It tries so hard it fails, it's unoriginal and it tries to be so many things it doesn't actually know what it is. Schizophrenic to say the least.Now the elephant in the room:First and foremost I don't make political points in reviews. I am also pro diversity and I believe mainstream films still have a long way to go but movie this is polar opposite. There is no diversity in this film, when the casted it that anyone who was white was rejected. There are a few token whites in this movie but that's all they are. This film is a step backwards for diversity and equality to the point of being offensive.P.S. it was so boring we gave up after 30 minutes.Give it a miss."}, {"id": 388, "text": "I made it halfway into the movie and gave up when Jangle started singing. Not just because he was singing... for all I know he can.It was because the movie was already showing signs of a weak, phoned in plot and then it just gave up and relied on the audience knowing all the usual kid/Christmas film tropes rather than develop the plot and characters themselves. I mean, if we do that, they said, we won't have room for all the songs.And it had so much potential! It's visually stunning, full stop. A feast for the eyes. I love Steampunk and I love a magical Christmas movie. The cast couldn't be called diverse but if anyone has a problem with a movie of mostly black actors with a few token white people, well, do I have to say it? I loved it. I see white people all day in my own home and in the mirror so it made a nice change to see other members of the human race get center stage. And Forest Whittaker was utterly delightful as the confused and grumpy inventor. I could have watched him all day. Just him.And while I don't care for these Broadway style musicals, the first song was promising. The rest (that I heard) reminded me of Frozen. That was not a compliment... Frozen is yet another film where plot and character were sacrificed on the altar of songs... not even very good ones, but very typical ones.The trouble is, there's a slice of society that looks at you like you're threatening to eat their hamster if you so much as mention that you don't like musicals. People who will forgive any sin of plot failure and character shortcut if there's song and dance numbers. People who think that to crowbar in songs is a reason to make a movie. They ruin a lot of good stories.Not that this was one. It just didn't take the time to do it. It started tolerably well and went on to interrupt an interesting story with a pint sized Mary Sue and predictable action as well as forced conflict. The toy that was gonna make him rich was a creepy sentient tin matador with a giant ego? Why in the world would anyone, much less everyone, want this irritating toy? But it took a toy like that to punt the plot forward so it must be a matador. Honestly, all the toys I saw were really unappealing.This film was a wasted opportunity."}, {"id": 389, "text": "Thoroughly enjoyable and very sweet.I had a great time watching 'Jingle Jangle: A Christmas Journey'. It's very well acted, has a story that's entertaining and features neat special effects. The musical numbers are also good.Forest Whitaker is excellent as Jeronicus, as is Justin Cornwell in the role of the lead character's younger self. Madalen Mills is impressive as Journey, while Keegan-Michael Key is terrific as Gustafson. Ricky Martin is a smart cast, also, as Don Juan Diego. It is a very competently cast film.The plot is very good, I felt entertained and touched by it. It has a fair bit of humour, but also sturdiness and heart. That is all helped by the pleasant effects, which look nice throughout. There's also some nice use of stop-motion animation, too.I highly recommend this."}, {"id": 390, "text": "From the grumpy old man, that got stung by the midas touch of happiness and joy, as a child walking the christmas streets of haugesund, norway at a snowsprinkled evening, ravaging every toyshop and windowexposure of nodding santas and illuminated shining toy trains running through the nicest of the nicest landscapes, making christmas the most magical time of the year.i shall admit as becomming old ive lost that julespirit, but ever now and then i can revive that feeling when viewing a good x-mas film, and this is the one for 2020. the production are pure magic, the music and dance and additional score are just impressing, and the acting plain an truthfull enough to give it at 10 stars,the only thing that could damage that badge were the sound design here and there, but i cant wait to show this to my wife, because she is like a toddler in a pile of presents when viewing this kind of movies.so in all the sad and bitter world of real life with bad economy and a bad pandemic, take a break from it all with jingle jangle, highly recommended"}, {"id": 391, "text": "Jingle Jangle is: Something sensational, something spectacular, something revolutionary!Jingle Jangle: A Christmas Journey is truly magnificent. The accomplished cast brought a touch of magic to phenomenal festive feel good film.It was written and directed by David E. Talbert and produced by singer John Legend. It stars Hollywood greats including Forest Whitaker, Phylicia Rashad, Hugh Bonneville and the voice of Ricky Martin as the impish Don Juan Diego.Jingle Jangle introduces rising child star Madalen Mills plays Journey Jangle who has a beautiful singing voice and captivating acting skills. Anika Noni Rose Dreamgirls who plays Jessica Jangle brings soul and power to the original songs that will be sung for many a year to come. Lisa Davina Phillip plays Ms. Johnston adds a touch of British humour to this brilliant film.I loved the colour, the costumes, the story, the songs, every single moment of Jingle Jangle.A very Merry Christmas indeed!"}, {"id": 392, "text": "This movie clearly had a high budget and was highly produced. That can help and does help in this case. The cinematography, choreography, costumes and special effects are great for this Christmas movie. The music is also fine. The steampunk sort of setting is also a feast for the eyes. The predominantly African American cast is also a nice change for a story that seems to take place at the turn of the 20th century in some artificial imaginary world.The actors are fine for the project. Perhaps the lone acting decision that bothered me was Forrest Whittaker's voice seemed a bit too soft and hard to understand at times.Why the movie overall didn't work to me was that the story was cheesy and not as palatable for adults as they were likely hoping it would be. I'm not suggesting that it needed to be R rated I'd anything. Just add some story elements that don't seem like they've been seen a million times before. The story and presentation weren't original in any significant narrative sense to me. And that means that the story didn't touch my heart in any deep sense.Believing isn't the causation of anything working. Believing or faith is a component for giving oneself a better chance to succeed by putting in the necessary work. I get annoyed by stories that seem to think that Christmas is the time to speak about how important it is to be like a gullible optimist. I prefer Christmas movies that are more about selflessness, love, acceptance and perseverance.I wanted to like the movie more, but in the end it just didn't rise to the same level as some of Netflix's other Christmas offerings from previous years. I would have been irritated if I had paid to see this movie in the theater, and felt fortunate that it only really cost me some time to watch it at home.To me the Klaus movie from last year is a much superior Christmas movie. One of the best I've ever seen. The first Christmas Chronicles movie I'd also argue is superior although not on the same level as Klaus. This movie is on par with Noel from Disney plus or some of the better hallmark movies. I'd put The Holdiay, Elf, Miracle.., It's a wonderful life, A Christmas Story, Nightmare, and a bunch of other holiday movies on a higher tier than Jingle Jangle. It unfortunately likely won't be a Christmas movie that people think about 5 plus years down the line."}, {"id": 393, "text": "I loved the colorful visuals. Everything in the movie felt very Christmas-y and cozy. The costumes were great as well. All the lively ensemble dance numbers were energetic and fun. While not all the songs were memorable, some were made better by having such kinetic accompanying scenes.On top of that, the vocal performances were great from most of the cast, especially Anika Noni Rose. And the acting was very good from even the younger cast members.That said, I wished there were more songs. After having several numbers in the first 30 minutes, there were long stretches without anything. While that's not necessarily an issue, outside of the dance numbers, the film lost some of its energy.I also wasn't particularly fond of the decision to make magic math-based. That kind of takes the magic out of the magic, at least for me.Overall though, Jingle Jangle is a fun, festive film that I think a lot of people can enjoy."}, {"id": 394, "text": "Netflix's recent attempt at a Christmas flick is probably their strongest original festive flick. Yet, for every box it ticks off, it misses some of the most important ones.Yes, it looks lovely and Christmassy. Sets are well designed, costumes are on point, and it oozes all the visual qualities you look for in these types of films. The musical numbers, and performances, do vary with the opening number probably being the best of the bunch. But I don't think they're any classics that will stick around.What it does miss the boat on is the story. Quite frankly, it's a bit of a mess - and for a two hour film, it turns into a bit of a slog making you ask questions such as: But why? and Is that it? You feel like it's going in one direction, only for a new character to be shoed-in halfway through, which takes us on a new extremely rushed direction. There's very little development with this new character or any reasoning as to why it can do the things it does. Then before you know it, the story has wrapped up, with very little impact and a feeling of a damp squid.In conclusion, if you're after a new Christmas flick for the holidays, you could probably do a lot worse than this - but I wouldn't expect this to replace your favourite Christmas Movie of all time."}, {"id": 395, "text": "It started off very good and promising. I loved the music and the actors were wonderful singers. I loved the charm and magical feel and atmosphere. However, I did start to lose interest towards the middle of the film. But by third act I was engaged again. So pacing could have been better.I did love the overall story. And as mentioned above it had this wonderful magical feel to it that felt perfect for Christmas. I really loved the young girl who played Journey and thought she really stole the show. She definitely is the heart of the film. I also felt the film needed more Anika Noni Rose. She has such a rather small part but she's absolutely great with what she does. However, I wish the story could have done without was the Don Juan toy (voiced by Ricky Martin). Every scene with that character felt too corny. Too childish. And therefore by association, I just didnt care for Keegan Michael Key's character Gustafon. He was less annoying, but still came across a little stereotypical villain. I do get that it is a family film and so obviously there has to be elements for kids. But I was totally fine with the Buddy 3000 scenes. I just dont think that character worked for me.I would say that the film was enjoyable enough. I do think its a worth a watch with the family this season. Do I think it will become a Christmas staple? Honestly, I dont know. I enjoyed it for it was but Im honestly not sure if I would re-visit it again next year. Especially when there are other faves and new content to consider.I listed the film as 7. But I think its probably somewhere between a 6.5 and 7.Also, the movie kind of felt like a mix of The Greatest Showman with A Christmas Carol."}, {"id": 396, "text": "GOOD: This is a fun story about believing in the impossible and mending relationships. Its not so much a Christmas movie as much as it just happens to take place during Christmas time. With beautiful sets and costumes, the characters are enjoyable and the actors well chosen for their roles; I welled up more than once during the telling of the tale.BAD: This did not need to be a musical. While the actors all have beautiful voices, the musical numbers were distracting; half the time the music drowned out the singer's voices so you couldn't hear the lyrics. The choreography was uninspiring and the tunes were forgotten as soon as the musical numbers stopped. The direction of the movie was subpar; there were several scenes that did not flow well into the next which had me question the lack of character development or at least transformation. The absence of any positive Black male characters was also disturbing. The main character was a deadbeat dad, the granddaughter was apparently born via immaculate conception because no father/husband is ever mentioned, the villain is a thieving apprentice and the little boy Edison is afraid of his own shadow. For a movie that is supposed to have been written by a Black writer so his son could have a contemporary Christmas classic, I am scratching my head why there wasn't a greater emphasis on the Black family."}], "reviews_amount": 397}