{"name": "Saint Maud", "titleId": "tt07557108", "reviews": [{"id": 0, "text": "Don't trust the bad reviews by people saying it's not a horror film. Horror films are diverse and a lack of jump scares takes nothing away from Saint Maud. A haunting tale of isolation, grief and sadness. The English seaside setting is The perfect setting for this dark and disturbed story. Lastly, it's great to have a horror film with a near enough 100% female cast. Highly recommend. Don't listen to the haters."}, {"id": 1, "text": "Fantastic movie that has a decent pace and great eerie sequences. It is a very religious movie and it stands as one of the best of the decade thus far."}, {"id": 2, "text": "Scarborough is ruined for me and it wasn't that great to start with.Great performance from Morfydd and a fantastic debut feature from Rose Glass."}, {"id": 3, "text": "Enticing watch. Builds and builds and builds into an ending which I am not likely to forget for a long time. I was unsure of where it was really going for a long time, which will probably improve upon second viewing. The performances were excellent, an astounding directional debut from Rose Glass who is sure to be a talent to look out for. Cinematography was immaculate, sound design and score was chilling and very suspenseful. As already mentioned, the ending unsettled me to my core, and the final image is now seared into my memory. Probably the best film I've seen in 2020."}, {"id": 4, "text": "Because it's more than that. It's also a study of loneliness (of both main characters) and obsession. It does have its shock moments, not least when in becomes clear that Maud is not the clear-cut character you thought she was.As I left the cinema, I quoted Dave Allen to myself: I'm an atheist, thank God."}, {"id": 5, "text": "....but almost worth the wait. But the one thing this isn't is a horror film, its a psychological thriller at best. Well worth a watch but I'd hardly call it a masterpiece."}, {"id": 6, "text": "It was a short, straightforward and predictable depiction of a nurse's religious beliefs causing the deterioration of her mental health. Would have been ok for a Netflix or TV movie but don't waste your time or money going to the cinema. It's annoyingly average."}, {"id": 7, "text": "Superb acting but that's it for me. I was a little bored during the build up and the climax didn't do it for me. The critical acclaim puzzles me for what is such an average movie in my opinion."}, {"id": 8, "text": "End of review.Promised so much. Delivered very little. Attempted to create tension but resulted in nothing. Just when you thought something would happen, the flame would blow out. I kept expecting but was left wanting each time.I had to add this extra as my review was short."}, {"id": 9, "text": "Saw the rating of 7.0 on IMDB &amp; thought, let's watch it. It's made by Film4 which has a good reputation. Its storyline is based on the lead character's religious awakening &amp; trying to live up to its expectations. She hears voices etc. But, it was predictable, slow burning. No scary moments at all &amp; left feeling very dissatisfied. This film won't save the cinema business!At best this is a TV film. Avoid imho."}, {"id": 10, "text": "This really isn't the film it's being portrayed to be, certainly not a horror of any description. It's premise merely focuses on the deteriorating mental health of a nurse and her influence by god and religion. Well acted with one unexpected jump towards the end but largely a boring ride of a movie. This movie would never of got a main stream release were it not for the lack of movies available to cinemas, better Fayre on Netflix"}, {"id": 11, "text": "I really didn't feel anything. There was minimal character development and a lack of storytelling. It's definitely not a horror. It would have been useful to learn more about Maud, what happened in the hospital, how she came to be what we see on the screen - basically, we needed to know her backstory. We didn't get any of this, so for me it was just watching a troubled young woman doing strange things that seem schizophrenia related but I had no empathy for her. There was a huge anti-climax, despite the dramatic ending and it was so disappointing.When we left the cinema, I almost had nothing to discuss. So I thought okay, maybe it's one of those films where I need to let it marinate and then analyse. But three days later, I still have very little to say about this film."}, {"id": 12, "text": "Not sure what everyone is talking about in terms of this being a psycho religious horror but I felt this was quite disappointing and poor. It almost felt like a student's half year project when they ran out of ideas but had to put something together and drag the story along."}, {"id": 13, "text": "Learning that in the coming days my local Odeon was going to close,I looked at the listings for what movie I would watch on the final opening day. Spotting one screening of a new Horror,I got set for a saintly final viewing.View on the film:Spending the majority of the film nursing the saving of a soul on her own, Morfydd Clark gives a very good performance as Maud, whose saintly innocent thin smile Clark has become increasingly brittle to all those who try to get near Amanda,and a slide into obsession over a holy faith in gaining her wings.Gazing over in wide-shots the brooding Scarborough skyline, writer/director Rose Glass attempts in her feature film debut to cross a slow-burn sinking Horror atmosphere uncoiled in long panning panning shots pulling at Glass &amp; cinematographer Ben Fordesman plucking at Maud's sanity.Attempting to nail a eerie appearance via covering Amanda's house with dour colours, Glass undermines each chance for a chill to begin,by slapping on Adam Janota Bzowski's terrible,ill-judged Industrial grind,which rumbles on until the eyeball-rolling worthy angelic wings final being a extremely grating, on the nose ending.Burning the candle at religious and psychological Horror, the screenplay by Glass fails to nail either,due to the permanent distance Maud is kept at ruining any chance for psychological depth to be weaved into the Horror from Maud's relationship with Amanda, whilst the attempt at altering religious images into stark symbolism lands with a thud as Glass goes for a sledgehammer level of subtle for Maud's pray."}, {"id": 14, "text": "We are used to seeing horrors where there are 'real' demons, but with Saint Maud you get the honest approach that most demons are in our own heads.Very well acted and has some good scare moments where you really feel your spine tingle. I thought this was a well scripted and directed British horror which I think done well is far more menacing."}, {"id": 15, "text": "When I say this was so boring I almost fell asleep you'll know to not see this if you want to be scared. And that's saying something given that I can't watch horror movies because they make me too scared. Walking past an alleyway on the way home was more scary. Have the critics lost all sense since pandemic lockdowns? It's not really even a thriller. It's just a girl going mad in a completely linear plot. No twists, no turns, and a completely predictable ending that you knew would happen since the beginning. I only didn't rank it lower because it's quite pretty and we'll acted."}, {"id": 16, "text": "I really can't understand the rave reviews from the critics. Rather dull and slow moving and not at all scary. The final few minutes provide a fitting end and winds the story up rather nicely."}, {"id": 17, "text": "Tis better to be that which we destroy, claimed Macbeth than by destruction dwell in doubtful joy. A young Christian hospice nurse, Maud, struggles with this notion when she is charged with taking care of cancer stricken Amanda. The pair are opposites save for arrogance and self-righteousness. Nothing worth trying comes easy is Maud's mantra, yet she gains little traction with Amanda. In doubt, desperation and loneliness, Maud doubles down on her distorted beliefs and spirals out of control.This tense and spell-binding film employs compelling techniques including pulse quickening ambient sound, funnel clouds that mirror Maud's disordered state of mind, sideways and upside-down camerawork to portray drunken delirium and more. A female perspective in this male-dominated genre is refreshing and fascinating. Morfydd Clark (Maud) and Jennifer Ehle (Amanda) are fantastic in their portrayals. An intriguing bit of information was revealed in the question and answer session after the film's shocking conclusion; Morfydd is Welsh and when she appears to speak in tongues, she is actually speaking Welsh that is slowed down enough to be almost unrecognizable. The production crew was careful not to dwell in one location so the setting might appear to be anywhere. Seen at the Toronto international film festival."}, {"id": 18, "text": "Saint MaudThe was a stylish and sophisticated thriller it just wasn't horror.It was very predictable as we all know about Saint Joan of Arc, her fanaticism, her ecstasy and her demise and clearly it was based on that.Whilst good, it was sometime slow, overly bleak and tedious. The acting was sharp all round and the styling was comprehensive."}, {"id": 19, "text": "This looks like one of those straight to TV horror films that they sometimes show on BBC. There were no scary scenes, there were characters in it that added nothing to the storyline, it was an anti-religion film rather than horror, and I giggled at the end thinking what the hell did I just watch!?"}, {"id": 20, "text": "Don't waste your money. I was expecting a scary horror movie but the best part of the movie is the trailer.The story is empty and it's really slow. I don't understand how is it possible that they released it on the big screen. Such a waste of time"}, {"id": 21, "text": "The nurse has supposed to have suffered a traumatic experience in a hospital which you don't see and isn't explained except for a bit of wishy-washy dialogue in the middle. The nurse than is portrayed as becoming a religious fanatic but the script is so scared of offending it misses a fantastic opportunity for her to become a serious pious fanatic with schizophrenic visions. She has one or two throughout the whole movie. The film is 1hr 24 minutes long, but you can skip to 1hr 22m when something actually happens. The script really let this movie down and could have been really good with much more schizophrenic visions and religious fear. Morfydd Clark acting was superb though which scrapes this movie as a 1/10"}, {"id": 22, "text": "You know when you watch a movie and it's so bad that it's actually enoyable?.This is not one of those movies. It was literally bad from start to finish. Morbid, boring, dull dribble comes to mind."}, {"id": 23, "text": "This was one of the most harrowing movies I've ever seen, I haven't stopped thinking about it- and not just because of those last 5-10 minutes. The movie is such a deep exploration into loneliness, and how we choose to cope. Yes the movie was undoubtedly terrifying and horrific, but it's immensely sad too. This is honestly one of the best debuts I've ever seen, it's one of the best horror movies I've ever seen, heck it's one of the best films I've ever seen."}, {"id": 24, "text": "Slow and not scary in any way, shape or form. You couldn't even call it a thriller."}, {"id": 25, "text": "This movie was utterly disappointing! I don't even mind slow paced plots, but this was too much, even for me... You are being kept waiting for the big bang all the time, only to discover that there is none. Even though I enjoyed acting and the attempt to build up something like a storyline, this movie lacks in many things, mainly finesse and good writing. The only terrifying thing here is religion, which is terrifying enough in real life, so it wouldn't have needed this movie to creep me out."}, {"id": 26, "text": "Saint Maud: This dark psychological drama is very much a film of two parts. Starts off with Maud (Morfydd Clark) taking a job as a live in carer for Amanda (Jennifer Ehle). a dancer who has terminal spine cancer . Maud is filled with religious fervor and wants to save Amanda's soul as well as provide palliative care. Amanda smokes, drinks, wants to live a hedonistic lifestyle during her final days. Maud disapproves but they reach a modus vivendi for a time. Eventually though Maud's reverence coming up against Amanda results in a worrying clash. After this the film takes off in the direction of horror. Much of what then occurs is filtered through Maud's perceptions but is she a reliable narrator? While the horror is mostly psychological there are a few violent and disturbing scenes. The narrative is very much driven by Maud's religious conviction, she sees herself as akin to the Saints, an incipient martyr. There is a frisson of apprehension as this movie heads towards it's denouement. Written and Directed by Rose Glass. Showing at the Irish Film Institute, Dublin. 8/10."}, {"id": 27, "text": "It is a classic horror movie but with a great story line the idea is fresh and all the characters have done their part well."}, {"id": 28, "text": "Pros: 1. The cinematography is great especially as it mirrors Maud (Morfydd Clark). It's rigid and purposeful when Maud is confident and assured in her faith, but it goes haywire and literally flips upside down as she loses control and faith. 2. The colour palette is gorgeous, particularly with the black of darkness used to emphasise and embolden said colours. 3. Jennifer Ehle (Amanda) delivers a terrific performance, with Morfydd Clark being phenomenal, especially with the physicality her role required. 4. The score is eerily ominous which seemingly pounds into your very body. It's excellent at increasing the tension. 5. The violence, which is mostly self-mutilation, is intense, itching and really uncomfortable. 6. The atmosphere is thick and suffocating with dread and horror which only increases as the film goes on. 7. The CGI mostly looks great and is inserted appropriately. 8. The scene with Amanda as the devil is utterly bone-chilling, terrifying and mesmerising.Cons: 1. The scenes with Maud having a crisis of faith and sinking into sexual degeneracy feel mostly pointless and needlessly prolonged. 2. The character of Maud isn't likable and is barely interesting. If her backstory had been expanded on, then this could have changed. 3. The CGI fire looked distractingly awful."}, {"id": 29, "text": "Another water ofnaj opportunity to add something to this genre. This was not Horror. In fact this was more akin to a British drama off BBC one or ITV. People seem to think these days that making a horror movie with religious overtones will convince people it's scaelt because it could be real. Bit these type movies are two a penny now and this director is really not made or cut out for making a horror movie. There were no thrills, suspense or intensity just the same boring plodding story that relies on using a religious background if that makes sense to envoke emotion in people although it fails there too. The director should stick to Dramas that are boxed shaped and cardboard cut out so he or she doesn't think the they have talent where they don't."}, {"id": 30, "text": "Tonight was my first visit to the cinema since before lockdown and what better way to return than to watch a critically acclaimed horror on Halloween night.Regrettably, St Maud lacked in scares and overdosed on artsy-fartsy nothingness typically found in low-budget independent horror films. Babadook and Mandy sprung to mind after 30 minutes when I could feel not only my arse aching but a desire to leave the cinema that I had not experienced for a long time.I want my wasted hours back."}, {"id": 31, "text": "I love films that take belief seriously, the best example being the brilliant and shocking Breaking the Waves. I thought this might be in the same league and it certainly has a performance from the lead to match that of Emily Watson. The first half was building very well, but then it lost its way, and the remainder was jarring melodrama. The film ended up dismissing faith experienced at this level of intensity as evidence of derangement and social isolation, which was boringly unoriginal. Some great acting and excellent direction could not disguise the emptiness of the message."}, {"id": 32, "text": "Only seen a trailer of this a week or so before watching &amp; to be honest it actually looked the business.The film follows a young maid/nurse who looks after this woman who she thinks believe in god as she does so religiously. After a clash she ends up being kicked out &amp; then discovers the woman she once looked after wasn't a true believer in god after all.The film for the most part was boring. Sorry not sorry but it was. The end while it had some horror elements in it was in itself a bit flat &amp; uninteresting. The films narrative, dialogue &amp; pacing was incoherent &amp; lost, which made it harder to follow what the main protagonist goals were never mind the antagonists plans were.The only good was the ending which sad to say was actually good to be fair. 3/4 of the film was just plain dry boring &amp; uninspired. Rose whatshername needs to write &amp; direct better scripts.Overall, this film is way too over-hyped &amp; flat out boring. 2/10"}, {"id": 33, "text": "This is a fantastic film about a woman suffering from escalating religious delusions. I won't give any spoilers but the plot is pacey and often takes an unexpected turn, which is what kept me guessing and gripped throughout. The ending was really satisfying, Rose Glass thankfully doesn't pull her punches. And to top it off it's under 90 minutes long. I've seen several new releases recently that all come in under 2 hours, and I dearly hope it's a trend that sticks.I'd recommend this to anyone looking for an original horror."}, {"id": 34, "text": "Well acted and I dare say a very well crafted movie. If that's what you want. Entertaining? No, not for me."}, {"id": 35, "text": "Slow burning, psychological and deeply thought out. I enjoyed this film a lot, no jump scares, intelligent and unusual plot. Religious theme and beautiful filming."}, {"id": 36, "text": "Honestly folks this a corker of a film, sure there are a few tired codes and conventions but otherwise it pretty epic. Incredibly haunting, and yes i found it very scary. I think those that say they didn't find is scary must have no understanding of mental health as the whirlwind this young girl goes through is simply cruel, terrifying and heartbreaking. It's certainly not an easy film to watch but a great piece of cinema and true to form if you like psychological horror. I'd hugely recommend this if it's your cup of tea. I had one of those moments in the cinema when the credits started to roll where i was stuck in my seat trying to catch my breath. I only heard about the film today and I haven't been to the cinema for so long (im writing this late 2020, mid covid melt down world) and wow Im so glad i went to see it. And, no, ha im not a pal of someone who made it, im a film lover and a keen horror fanatic, simply because a truly good horror is so few and far between, and this is most definitely one of the great of the 21st century. I'll shut up now ha."}, {"id": 37, "text": "An incredibly assured piece of cinema directing. Is this really her first major film?Just wow. And as for the soundscape, just superb. I came out with my jaw on the floor."}, {"id": 38, "text": "Grumpy old Jennifer Ehle (Amanda) is a former dancer/choreographer suffering from a terminal, mobility impairing, illness and so requires round-the-clock care. Enter Maud (Morfydd Clark) as a heaven sent nurse to see to her body and her soul. Initially they bond OK, but soon it appears that the piety of the carer and her employer's rather liberated lifestyle are going to clash and that they do! There can be no doubting that Clark's performance is gripping, she really does emanate some of the senses of confusion felt by her character but this certainly isn't an horror film - more an inquest into personal religiosity. We are unsure as to whether Maud is just zealous beyond measure or whether (or not) God is in direct communication and that clearly leads her to some considerable personality issues - which though conveyed effectively by auteur Rose Glass, left me feeling that something was just a bit lacking - perhaps we needed a little longer on the screen; more at the start to get a better grip on just who and maybe what Maud was? Without it - well it didn't quite work for me. Probably doesn't need a big screen either."}, {"id": 39, "text": "Watch this film, if you can appreciate atmospheric, tension building story telling, with excellent performances from the whole cast, and you will love what you see.Throughout the entire film you are kept guessing what is actually happening to Maud, you are given hints of a supernatural element, while also being shown flashbacks that suggest she could be experiencing episodes of psychosis, both of these increase as the movie progresses, at times it is almost shocking, but brilliant, and it isn't till the last second of the film that you find out the truth, or do you really?Easily one of the best psychological horrors I've seen, the entire auditorium was silent throughout the film, everyone left with a full bag of food.i highly recommend."}, {"id": 40, "text": "It's great to see movies made by women with real women in there, far from masculine movie-making stereotypes. Kudos on that. The rest... Meh. it's sold as modern horror and it's not and the big numbers drama just fails for me. I've thought about big numbers. Nothing new or groundbreaking here. And I also find this movie so religion-centered, even if it's for criticize it, that it annoys me just as a Christian-propaganda movie would."}, {"id": 41, "text": "It's TERRIBLE. Bad. Disgusting. The plot was everywhere and WE STILL DIDNT KNOW WHAT THE HELL WAS GOING OM"}, {"id": 42, "text": "Much like hereditary, saint maud managed to leave me with many questions. This movie is built on tension and mystery instead of mindless jumpscares every 5 minutes. I enjoy a movie where i can't guess what will happen next and in many ways saint maud did exactly this. A lack of action and information about the main characters past makes me understand why people might not like the movie, but i really enjoyed myself."}, {"id": 43, "text": "This was more like watching a very well made itv drama, the horror elements were inconsistent and lacking throughout. However, it was very effective at dealing with themes of loneliness and fragile mental health."}, {"id": 44, "text": "This film is certainly something that needs to be experienced in a cinema, and I'm glad it got that rather than the streaming service treatment it very easily could've gotten because the luxuries of pausing, checking your phone etc. would've really gotten you out of the movies many terrifying moments. This is easily one of the most uncomfortable, unsettling movies I've ever seen, and I enjoyed it immensely.To start off with, with have the two main characters of Maud and Amanda, played by Morfydd Clark and Jennfier Elhe respectively. Both of them do a fine job, with us viewing Amanda in the moment rather than as a point-of-view character, and she is portrayed as alternatively pitiable in her dying state, and cruel in her treatment of Maud that makes you view her in ways that intentionally work in the moment, and Elhe conveys this perfectly. Clark, on the other hand, portrays Maud as a gullible, well-intentioned, soft-spoken Welsh girl with a strongly devout Christian faith, but who's always a bad moment away from snapping. Clark is excellent with her physical acting, but especially with her face as in two specific moments she contorts it into shapes that make you unsettled, and carries this all the way through. Just like how Ryan Gosling broke out in The Believer, this is Morfydd Clark's breakout. There are other actors in bit roles who all convey characters that give a great insight into Maud and Amanda's lives, but those two are the main highlight of the movie acting wise.The real MVP of the movie is the Lighting and Sound work. Rose Glass, in her directorial and writing debut does a lot of effective work with minimalism and what isn't there than what was. In terms of scares, a lot of it is through theme and mis-en-scene and not so much jump scares - in that, there's one jump scare sequence at the films end and that's it. The film has a lot of close-ups and extreme close-ups to create tension, and in the dark seeing flashes of Maud's eyes piercing through with blue, or the pervasive clock ticking overshadowing a simple scene really emphasise this. However, there are a few instances where the film tries a more experimental approach, and whilst I understand what she's trying, it didn't work for me; namely, when Maud gets fired by Amanda, she starts to spiral out of control and the film portrays this by slipping the camera upside-down, when a Dutch angle would've worked just as well and not been as distracting.Overall, the religious horror film is one that's easy to make but hard to make well without sounding biased or exploitative, or worse just crass. This film avoids both, by making Maud kind but easily led, right but sometimes doing wrong things, and making the horror elements more inferred than overt. You can tell the clear influences of Roman Polanski in this, whilst also making it Rose Glass to the core.If you haven't yet seen this movie, SEE IT NOW WHILE YOU STILL CAN. It won't be the same on DVD or Stream, and there's not much else out so you might as well."}, {"id": 45, "text": "Atmospheric, slow-burning horror. Beautiful cinematography and wonderful performances from Morfydd Clark and Jennifer Ehle.Those last few moments......woah"}, {"id": 46, "text": "First time leaving a movie review, it was that bad I'm leaving a reviewIt's literally the worst film I've ever in my life watchedEveryone at the cinema laughed when it finished because in a nut shell she kills the woman she's looking after then kills herselfIve just saved you money and time honestly if you don't believe me watch it and leave a review it's embarrassing it's made it into the cinema"}, {"id": 47, "text": "Despite compelling turns by all involved, the weakness of its premise. Simply put the central character is the only religious character, goes mad and kills someone. If that character was instead the only one who's gay or a person of colour this flat story would never have been financed. As it is this movie is female led, written and directed so the critics are falling over themselves to praise this in their Me Too mania. An OK movie but really nothing special."}, {"id": 48, "text": "Waste of time and money. Was waiting the whole movie for something exciting to happen. Then suddenly the movie was finished."}, {"id": 49, "text": "Saint Maud 2020 15 Director: Rose Glass Starring: Morfydd Clark, Jennifer Ehle, Lily Knight, Lily Frazer, etcOverall rating 87/100Saint Maud is about is about a care nurse who become scarily obsessed with saving the soul of her dying patients, Wow Saint Maud was a different kind of horror that was really intriguing and mostly executed well, so let's start talking about it.My first few positives would be the narration, interesting and likeable characters, themes and cinematography. I really enjoyed the narration from Maud's character, it gave more depth and understanding to the character of Maud, as well as filling in gaps with the plot and what Maud was thinking in those particular scenes, it was done right here, it was almost stretched out to being overused but for me was balanced very well in developing and moving the characters and plot along nicely. I also thought the characters were very interesting and likeable, the character of Amanda ( Jennifer Ehle) was very likeable and had loads of interesting qualities to her, she was incredibly independent and was infectious whenever she was on screen despite how ill she was, the character of Maud links into my next positive which is the themes portrayed within the film, the recurring theme of loneliness and turning to religion in your darkest times was explored very well and especially with the loneliness theme it almost became a dark character study based on this which I really loved. I also thought the cinematography was fantastic and very unique, the visual creativity considering it's low budget was excellent and really interesting, there was loads of visual metaphors and some fantastic shots that really impressed me.My next few positives would be the use of sound, building of tension and uncomfortable/scary tone. The film's use of sound was excellent, it's score built up tension well, and just the disturbing diegetic sounds and added performance from Morfydd Clarke made the film even more disturbing, the film also built up tension really well, the movie slowly built up more and more tension throughout and kept on teasing the audience with disturbing imagery making me on edge more and more, the movie also did an excellent job at lingering on the extra tense and uncomfortable scenes to really let it sink in, the movie also created as I previously mentioned a very uncomfortable/scary tone that worked very well. The movie slowly got darker and darker as Maud became more obsessed with her goal the movie was a different kind of scary not needing to rely on Jumpscares but more of a psychological horror that sticks with you.My few negatives for the movie for me would be the inconsistent scares in the first half, pacing issues and some repetitive plot points. For me the movie overdid the teasing of the more horror based tone and scares, this led to the tone being very unclear and slightly messy within the first half of the movie, but they fixed this in the second half but it's definitely still worth mentioning. I also found that there was some pacing issues, the movie sometimes moved at a very slow pace, which mean due to the tonal imbalance with the scares in the first half I lost interest in parts. Finally I also found that there was some repetitive plot points, once again continuing my issues with the first half, I felt like there was too many reused scenes that didn't add enough new plot everytime, the repetition of Maud and what she did with her job got tired after a while and it took a while for the movie to truly do something different with the plot.My final few positives would be the use of gore, the excellent script and fantastic performances. The gore used was fantastic, it was very sudden and unsettling and delivered the desired uncomfortable tone perfectly. I also thought the script here was excellent, the social commentary on faith, mental illness and even being alone and isolated was really clever and thought out and made me think. And finally the performances here were excellent. Jennifer Ehle was incredible in her role, with heaps of charm and likeability and I just loved how she delivered her lines of dialogue. But the true star of the movie was of course the lead role Morfydd Clarke. She was absolutely incredible, she showed so much versatility and depth to her performance, she was very believable and played the disturbing parts to her character very for a very believable, unsettling and powerful performance.Overall, despite a few issues with the first act. Saint Maud, is a different and unique kind of horror that I haven't seen before, with excellent performances, visual creativity and being so much more then just a generic horror, it makes you think whilst at the same time deeply unsettling you."}, {"id": 50, "text": "I'm usually easily pleased with movies. If it's well acted (this isn't), brings something new to the table (this doesn't) and ticks the genre boxes (horrors should be scary - this isn't for a second). I'm stunned that reviews are so positive.Dont waste your time."}, {"id": 51, "text": "Let me start by saying as much as I found this film a complete waste of time I can see how this horror movie could probably be scary and enjoyable to anyone religious. As it was I found two scenes in the entite film creepy and the religeous babble was really wasted on me.That being said if your religeous this will probably be a phenomenal horror and the acting cannot be faulted at any point but I expected it to be a horror anyone could enjoy. If your religeous it's probably a must see, if your not you will probably just wonder why you bothered."}, {"id": 52, "text": "I knew almost nothing about this presumably independent film, apart from reading and seeing posters containing positive reviews from critics, it was these alone that convinced me to go the cinema, while I could, during the COVID-19 pandemic was happening. Basically, following an obscure traumatic experience, Maud (The Personal History of David Copperfield's Morfydd Clark), a reclusive young nurse with an impressionable demeanour, pursues a pious path of Christian devotion. She is charged with the hospice care of Amanda (Pride and Prejudice's Jennifer Ehle), a retired professional dancer ravaged by cancer. Initially, Amanda admires Maud's good intentions, seeing to her every need, bathing, dressing, and feeding her. Maud's intense belief of her faith quickly inspires an obsessive conviction that she must save her patient's soul from eternal damnation, believing she has been appointed to do so by God. Slowly, Maud's behaviour becomes stranger, as she vies for Amanda's absolution and solidarity. The tense atmosphere only increases by the constant visits from Amanda's friend, perhaps lover, Carol (Lily Frazer), who Maud tries to keep away. Meanwhile, Maud bumps into an old friend, Joy (Lily Knight), they have a small conversation, exchange numbers, and go their separate ways. One night, Amanda throws a party at the house for many of her friends and colleagues. Maud is there helping with food and is jealous watching Carol get to close and kissing Amanda. The atmosphere turns sour when Amanda makes a small but seemingly snide comment, and Maud slaps Amanda in the face. Angered, Amanda tells her to leave and orders her superior to send a replacement nurse. Maud is devastated and shuts herself away for some time in her small flat. She tries going out and attempting to socialise with strangers, but only shuns them away. She also tries calling Joy hoping to spend some time together. During her seclusion, she talks to an unseen demonic voice speaking a foreign language (possibly the Devil), who gives her assurance. One day, Maud insanely sticks small nails into the soles of her shoes and goes out for a walk whilst her feet are in pain. She stops to rest on a bench and starts a conversation with a woman, who introduces herself as Ester (Rosie Sansom), until she abruptly walks away. Joy does eventually show up at Maud's flat and makes an effort to communicate with her, but Maud stays silent and faces away from her as she talks. Eventually, Maud lies and assures Joy that she is fine and makes an excuse to send her away. Maud then dresses herself in long white robes, like a misguided martyr, and walks to Amanda's care home, intending to kill her, some kind of absolution. After killing Amanda, Maud walks onto the nearby beach, carrying a large container of flammable liquid. Beachgoers look on in horror as she pours the liquid all over herself and ignites a firelighter, causing her to go up in flames and burn to death. Also starring Turlough Convery as Christian, Marcus Hutton as Richard, Carl Prekopp as Homeless Pat, and Noa Bodner as Hilary. Clark is splendid as the tortured, devoutly Christian and mentally unstable loner, and Ehle is equally good as the innocent but bitter and stubborn dying woman intensely alienating her carer. It is a simple concept, a religious young woman who becomes dangerously obsessive and goes mad to the point of self-destruction, expect knowing nods to The Exorcist and Carrie, it has one or two jumps, but is mostly eerie and builds up to the shocking conclusion, an interesting psychological horror. Good!"}, {"id": 53, "text": "Absolute khara, don't waste ur time. literally psycho and just weird bro"}, {"id": 54, "text": "Been a fan of horror movies my entire life, its by far my favorite genre, but this modern horror trend going on with slow, boring movies that started with the vvitch needs to be done already.. Tired of wasting my time with these artsy fartsy garbage movies! There is litterally ONE scene in this movie that got me, and that was only cause it cought me off guard as i was numb with boredom. I give it 4 stars as the ending was quite good, but the rest of the movie was just boring and eventless.. Cant wait for this era of horro to be over, and hopefully we see a resurgence of evil dead type of horror! It is due time now"}, {"id": 55, "text": "What a refreshing change to see an adventurous UK horror film being treated with respect by the critics. This movie was great with such a lot of care given to every tiny detail. And high praise too for the way the film manages to get in and out in under 90 minutes. Not a wasted second. Such a pleasure."}, {"id": 56, "text": "Can't stop thinking about it. Shame it's being touted as a mainstream horror as it's certainly not. It's so much more, disappointing the zombie multiplex crowd."}, {"id": 57, "text": "A terrific almost-character-study with glimpses of horror, apart from the truly horrific ending. The movie is a slow burn and gets into an obsessive, religious person's psyche. Worth it."}, {"id": 58, "text": "Saint Maud is the debut feature from writer/director Rose Glass, and it packs a punch. The film was first seen at last year's London Film Festival, but was due for broader nationwide release soon. What a crushing disappointment it must be for Ms Glass that so few people will likely get to see it in the current climate... at least, not for a while. Since it is an effective little chiller.Maud (Morfydd Clark) is a palliative nurse looking after ex-choreographer Amanda (Jennifer Ehle). Maud is extremely religious and feels God move in her... regularly. Acting on His guidance, Maud sets out to save the soul of her ailing bohemian charge. But is Amanda beyond reach, and far will the zealot-like Maud go to achieve her goal?Morfydd Clark appears so young in this film that you would think this was her debut film. But she's actually 30 years old and has quite an impressive filmography already. Although this is her movie-lead debut, she's had a substantial part alongside Kate Beckinsale in the excellent Love and Friendship and smaller parts in Crawl, The Personal History of David Copperfield and the fun Pride and Prejudice and Zombies. She's likely to get more worldwide exposure soon as a young Galadriel in Amazon's new version of Lord of the Rings.As Maud she is simply superb - expressing such a range of joy, hurt and despair that you must think a BAFTA Rising Star nomination should be on the cards.Clark is ably supported in the leading role by the splendid Jennifer Ehle, still so memorable to me as Elizabeth Bennett from the BBC's Pride and Prejudice.Scarborough is also a star of Saint Maud. The Yorkshire seaside town is another star of the movie. Clearly filmed before lockdown, the rainy and windswept resort looks bleak and unwelcoming. And that's before Covid! Many of those struggling bars and amusement centres, as in other resorts all around the UK, are now on their last legs.Adam Janota Bzowski supplies the impressively claustrophobic music, which deserves recognition. A scene with Maud, flicking a lighter rhythmically in time with the sonorous beat, is a masterpiece in musical choreography and editing (by Mark Towns).At the heart of this horror-thriller is whether, following a Dawkins-style argument, fervent religious followers are less insightfully correct and more mentally unstable and misguided. When is the voice of God just the voice in your head? And how would you tell the difference anyway? Piecing together the plot and motivations of Maud was intellectually challenging and rewarding.I always get a little tense and nervous when I see the word horror on a movie bill. I am NOT a great horror fan! But for me, as a 'horror movie', Saint Maud is of the 'horror-lite' variety. Highly watchable, it builds more in the way of creeping dread than cheap shocks. There were only a couple of jump-scares (but for me, the one in the finale was a doozy!).A BBC interview with Rose Glass I just saw says she relates Maud's relationship with God as like many people's relationship with social media. Always looking for support, guidance and affirmation. Interesting.This is also an obviously female-led picture. All the men are complete tools. no, really, literally they are. It makes me feel ashamed to be among their number.Overall, Saint Maud is a minor classic. I didn't go in with great expectations of this one, but I was pleasantly surprised. As a small British movie, it packs a punch significantly above its weight. When I came out I was at about a 7* rating. But this is one that really stayed with me, and I've subconsciously thought about little else all day. So for that reason I am going to escalate my rating to something more appropriate.You might struggle now to see it on the big screen, but if you can do so, it comes with a recommendation from me. I think this one could REALLY be a Marmite film.... so if you see it, let me know what you thought with a comment on One Mann's Movies. (Thanks)."}, {"id": 59, "text": "Is religious fanaticism a form of mental illness? Certainly people such as Richard Dawkins and Daniel Dennett would argue it is. However, from the perspective of the fanatic, such fanaticism is often not only logical and justified, but unavoidable; they don't choose to be fanatical, they are compelled to be fanatical. The disparity between what a fanatic believes and what other people believe is the main issue examined in Saint Maud, the stunning debut feature from writer/director Rose Glass. Part-horror, part-psychological thriller, part-character drama, part-ecclesiastical treatise, Saint Maud can be read in a variety of ways - an analysis of the interaction between faith and self; a threnody for the life of a young woman suffering a mental breakdown; a drama about loneliness; a tale of possession; a tragedy about the frailty of the human body. Told mainly (although not entirely) from the perspective of a fanatical Christian, the story makes room for the possibility that, however unlikely, such fanaticism isn't mental illness at all and that God really is communicating with this person. And this magnificently handled ambiguity is the film's trump card. Disturbing, horrifying, challenging, unpredictable, emotional, and occasionally very funny, this is a film that forges a path entirely its own, and is as impressive and daring a directorial debut as you're ever likely to find.In a thoroughly depressing English seaside town, Maud (an incredibly physical performance from Morfydd Clark) is a recent convert to Roman Catholicism. Exceptionally devout, she believes that mankind is amoral, lustful, and wicked, and that only by way of a true saviour can we be saved. Is she that saviour? It's possible, because God has explicitly told her that He has very special plans for her in the near future. Meanwhile, Maud is working as a private palliative care nurse, and the story begins as she arrives for her first day with Amanda Köhl (the always brilliant Jennifer Ehle); a formerly world-famous American dancer and choreographer suffering from end-stage spinal lymphoma. She and Maud get on well - Maud admires her strength of character and zest for life, whilst she wants to help Maud let her hair down a little. However, there are certain elements of Amanda's life of which Maud does not approve; most significantly, the frequent visits from Carol (Lily Frazer), Amanda's lover. When catastrophe strikes and a dark secret from Maud's past threatens to resurface, Maud decides to prove to Amanda, God, and everyone else just how far mankind has fallen and just how sanctified she really is.Although Maud is a hard-line fundamentalist, Glass refuses to dismiss her, arguing instead that such individuals genuinely believe they really are communicating with the Divine - Maud may be mentally ill, but even if that is the case (and the film is in no rush to confirm that it is), then surely she deserves compassion and kindness, so completely has her mind bent reality to support her delusion. Glass tells much of the story from Maud's subjective perspective, and in this sense, it's almost understandable when she sees signs of God's presence in everyday things (an inexplicable whirlpool in a glass of beer, for example) - this may be delusion, but if it is, it's a total delusion that she is powerless against. In a very real sense, she cannot be held accountable for her actions.Even irrespective of mental health issues, however, Maud is all-in on the whole Catholic thing. She tells God, for example, about how important her work is, as it allows her to save souls and she credits her recent conversion to Catholicism as reversing the downward spiral of her life. She's also a firm adherent of the Job school of faith-by-suffering, cheerfully telling a beggar, never waste your pain and later engaging in some truly gnarly DIY shoemaking.Along the same lines, she tolerates Amanda's little digs about her life and how lonely she seems, but when Amanda turns her caustic wit to Catholicism, Maud is unable to let that stand without offering rebuke. Her relationship with Amanda forms much of the film's narrative backbone, with neither woman allowed to occupy the moral high-ground. Amanda is profoundly bored with her illness, and her isolation and inability to leave the house mean she seizes on this strange, ultra-serious young woman who has come to look after her. Amanda is not a villain any more than Maud, but she does regard Maud as a plaything, not with the intention of hurting Maud, but with the intention of amusing herself.As strong as Saint Maud is thematically, however, where it really excels is in its aesthetic design. Glass directs the hell out of it, and there's not a weak link amongst her crew - from Ben Fordesman's murky cinematography to Paulina Rzeszowska's detailed production design to Paul Davies's oppressive sound design to Adam Janota Bzowski's creepy score to Mark Towns's ambiguous editing (including a shocking slam cut right at the end that's as brilliantly jarring and thematically crucial as anything in the work of Nicolas Roeg).Crucial to the overall aesthetic is how Glass handles perspective; most (although, crucially, not all) of the film is told from Maud's perspective, so we encounter her visions not as an objective third-party would, but as she does. So, when she sees a small whirlpool spontaneously appear in a glass of beer, we see the same thing, and there's no cutaway to show us Maud staring at a normal glass; when a towel placed near a crucifix falls to the ground for no obvious reason, we see it as she does, and there's nothing to objectively suggest why it may have fallen; when God talks to her (in Welsh, no less), we hear His voice as she does, and there's no portion of the scene where we see Maud answering a voice we cannot hear.Along the same lines, what are we to make of the many (many) shots of Maud with windows or lights in the background that create a halo effect? Or of the shot of her walking on the beach, with a thin layer of water covering the sand, which is framed in such a way that it looks like she's walking on water? One particular scene near the end of the film, which I won't go into as it would be a spoiler, is especially important in the construction of a subjective point of view - what we're seeing couldn't possibly be anything other than psychosis, and yet the film has given us very little to confirm such a reading. Could it be that what Maud is experiencing is real? Is this scene confirmation that her mind has irreparably snapped, or is it confirmation that she was completely sane all along? Constructing a scene based on two literally inverse interpretations can't be easy, yet Glass does it so smoothly, you won't even realise the sharp dichotomy until it's all over.Running only 84 minutes, it's extraordinary how much Glass squeezes into her debut feature; from the arresting performances by Clark and Ehle to the thematic complexity to the extraordinarily well-handled perspectival ambiguity to the haunting aesthetic design. Looking at issues such as trauma, faith, fundamentalism, sexuality, and human impermanence, the film has much more going on than the generic horror elements one might expect. Either a depiction of the mental collapse of a young woman or a study of the supernatural, the film is built on ambiguity. One of the best directorial debuts I've seen in a long time, I was only half-way through and I was already looking forward to whatever Glass does next. Saint Maud probably won't break any box-office records, but we are going to be hearing a lot from Rose Glass in the future."}, {"id": 60, "text": "With the proliferation of online streaming service companies, the film industry had changed considerably in the last five years. There as some pros and cons, about which I am not going to write in detail, but there's at least one undeniable fact: sales and producers are looking for creative content. Free-to-air television channels, such as Film4, had to invest in the search for new talents, and specifically for female voices. It's under those circumstances that a voice such as Rose Glass was heard. I must confess, what a stylish cry!As a movie produced for British TV, thriller is certainly not a risky bet. It is a popular genre among the British, as you can verify on this list released by the BFI. But Saint Maud is definitely not a common thriller. The film is set in Coney Island, UK, that despite being a seaside town, it is soaked up in loneliness. Its mostly empty beach is the perfect scenario to Katie, or Saint Maud, a nurse that has recently converted into Christianism. She's about to start a new job, as a carer in Amanda's house. Amanda, 49, is a former choreographer who is now spending her days begging for company in her wheelchair.Maud and Amanda's clash is not only based on class and upbringing differences, Maud representing the essence of spiritual life, and Amanda's a preacher of hedonism. Most of all it puts into check mental issues. It is clear from the beginning that Maud is a tormented soul, and Amanda has long ago left the phase mens sana in corpore sano.Both characters have suffered traumas. Amanda's pain is visible and clinical, it's certainly difficult to cope with her new reality as her own life was devoted to movement. Something must have happened to Maud. It becomes clear when she meets a former co-worker who is surprised she's still working as a nurse.Gradually, Maud's mind is revealed. It's dark. A whole set of artifices comes to life to build up this darkness: from insects to William Blake's paintings. We become aware that God is the second main character. Saint Maud speaks directly to narratives such as Paul Schrader's First Reformed -- read our review here. Likewise Ethan Hawke's character, Maud has to encourage someone else to face his demons when herself is failing to face her own.In her debut film, Rose Glass has already formed her own solid style, with tints of gothic psychological drama. Saint Maud is part of the London Film Festival, that is currently on. If you miss it, check Film4 future program.Follow me at Amayzing Movies."}, {"id": 61, "text": "I remember being captivated by the trailer for St. Maud when I first saw it advertised circa-February. It had been a long time since I'd gone to see a good horror film during its theatrical release cycle, and so I was really looking forward to seeing this one at the cinema. But then covid happened and the release was pushed back from April to October, further delaying my gratification. Yet now that I've finally seen it, I can't believe I was ever hyped for it to come out. Make no mistake: I love slow-burn horror movies, but only when they're executed correctly. In this case, I felt that the tension kind of fizzled out half-way through and the third-act payoff just wasn't there. It's less of a horror movie and more of a psychological character study with very brief moments of unsettling imagery. To put it bluntly, the main character just isn't interesting or dynamic enough for this to work. Her internal monologues were much more tedious than they were creepy. The ending felt phoned-in and cliché; I even heard a couple of snide chuckles when the credits rolled. But I think the biggest issue for me was that the marketing felt deceptive... I didn't really get anything resembling what the trailers alluded to... nearly all of the action was shown in the trailers, with the other 90% of the film being a chore to sit through. Now that I think of it, this mismanagement of audience expectations is quite reminiscent of the way I felt about another A24 dud, It Comes At Night. It's not the worst thing I've ever sat through, but I do wish I hadn't paid to see it."}, {"id": 62, "text": "One my best cinematic experiences by far, it has every element of horror from unsettling imagery, madness, eroticism and an unnerving atmosphere. You can't look away, you can't shut it off, it is there right in front of you. The thing about this film which stood out to me the most, was that it was horribly relatable and oh so human. While Maud is at the extream end of things, I found her so understandable and this is what made the film so hard to watch. It's her incredible loneliness that everyone feels but emphasised in the form of cinema and it really gets to you. The direction from Rose Glass was just outstanding for her debut film, the amount of atmosphere running throughout the film was incredible. She held the power to be able to make me apprehensive and frightened over something, so simple like an extreme close up of soup. Morfydd Clark perfectly portrayed Maud as this wandering character searching for someone to project her loneliness onto, she truly understood the character. There were one or two flaws in the film but nothing major that could be noticed. I am quite frankly disturbed and slightly traumatized after watching it but it is (and I don't exaggerate) TRUE CINEMA."}, {"id": 63, "text": "Saint Maud is my favourite type of horror film. It's not full of meaningless jump scares, although there are a couple of worthwhile ones scattered throughout, but it's much more psychological and it had a gripping narrative.That being said, my main criticism with Saint Maud was the fact that I found the first half to be much more interesting and engaging than the second half. That was true until the final five minutes, where I was on the edge of my seat and it gave me images that will remain with me for weeks.The acting across the board was fantastic, but especially from Morfyyd Clark as Maud. Clark was captivating as this character, and I have a feeling we will be seeing more from her as an actor in the near future.The editing was sharp, the cinematography was breathtaking, and the sound mixing was intense. The musical score also helped to build the atmosphere. There wasn't much from a filmmaking point-of-view that I didn't completely love.If the second half of Saint Maud had been as gripping as the first half, I would easily say this is one of the best films of the year. It's still in my top ten at the moment, but it had the potential to be even higher. However, Saint Maud did it's job at unnerving me and the ending will haunt me for ages. It gets a high recommendation from me.SCORE: 86%"}], "reviews_amount": 64}