{"name": "A Rainy Day in New York", "titleId": "tt07141096", "reviews": [{"id": 0, "text": "People will tell you this isn't Woody's best film but it's still more enjoyable, intelligent and amusing than almost all films being made each year. In the same way a lesser-known Klimt painting is still a multi-million dollar masterpiece any Woody Allen film is still a class act."}, {"id": 1, "text": "Nothing too surprising. This is Woody Allen in Manhattan. A rainy day in New York came to me as a rather naive and refreshing way of doing what W Allen does. Gastby and Ashleigh question what they are and what they are becoming. They do that - to my perception - through the eyes of someone of their age. They think but do not overthink. Action immediately follows. They do not get lost in doubts and do not have to deal with an ego bigger than them. They act, they feel, they learn and repeat. They have so much to learn from that one day. I found all three young characters likeable and empowered, and the actors on top of their game (Timothee Chalamet, Elle Fanning and Selena Gomez). I would have loved to spend that day by their side The rain never bothered me anyways."}, {"id": 2, "text": "As soon as I heard about this latst movie we went, I am from Amsterdam, Holland, it is playing in 4 cinemas, in Amsterdam alone and most were sold out out this afternoon ( rainy sunday in Amsterdam) to say I enjoyed the movie is putting it milldly, I absolutely loved it, it was well translated, I ampractically bilingueal, born Dutch but psnet many years in England. It was old fashioned WA (, the dialogues were clever, funny and intelligent; the plot was fine, more to it than meets the eye/ 10/10 from me !"}, {"id": 3, "text": "Great cast, loved Timothee Chalamet &amp; Elle Fanning, intelligent, witty dialogue, storyline kept you interested until the end. Unfortunate that the movie is being kept out of the States."}, {"id": 4, "text": "Just what I needed right now a good Woody Allen film. I'm going to watch it again tomorrow."}, {"id": 5, "text": "Yet another masterpiece by Woody Allen. No matter how many movies he makes, never fails to give a perfect blend of nostalgia, euphoria and diff aspects of love. I loved how this movie has the finest ingredients one can offer. It features an incredible piano background score which seemingly connects with the rainy view of Manhattan. Chalamet did an obvious Oscar worthy performance and the supporting cast (Jude Law, Selena Gomez) didn't felt like excluded. Another treat is def the film's wonderful setting of New York City and the way art, culture and romance is depicted is fascinating. It's a shame that these type of movies are wiping away with time."}, {"id": 6, "text": "1. Excellent music. 2. Beautiful city. 3. Intelligent story. 4. Oscar winning acting.. 4. An happy ending.Who could ask for anything more?"}, {"id": 7, "text": "A classic Woody Allen, loved this all the way. It has al the familiar ingredients: New York in the rain, a neurotic young man, openly struggling with his thoughts and love life, the pretty young girl, the object of his affection.Some of Allen's recent work has been rather lightweight, but here is is in true form again."}, {"id": 8, "text": "The movie has quite a strange period feeling and maybe this artistic tool was intentional. Everybody uses smartphones already, but for conversations only. No Twitter, no other social media... Some jokes were actually a bit tasteless, very atypical for Woody Allen. A couple of chuckles throughout the movie, typical Woody Allen. Ellen Fanning had the best lines and she was the best overall. Liev Schreiber was very good also with the material he was given. Cinematography is beautiful and perfect for a rom-com - warm, bright, sparkling and full of colours. Chalamet was just wooden and dull. That was the first performance by him I've seen and I don't want to judge him too early or too harsh but he seems to be extremely overrated. Maybe the right lead for a late Woody Allen film."}, {"id": 9, "text": "I love Woody, and I lived with some of his movies. I cannot say how I felt the first time I saw some of his masterpieces, such as, Manhattan, Crimes and Misdemeanors, Annie Hall, Bananas, Hollywood Ending, Deconstructing Harry and so on..... I am also not one of those who judge him because of the late accusations..... But this movie, wow, it hit me in the balls.I went to theater and just wished that it gets good at some point, and it got worse and worse. To be honest, It didn't get worse, it was just all bad from the beginning. The acting, the camera, the lighting, the editing, and even the screenplay, all were subnormal. I was surprised and still think it was a nightmare. Only a couple of good lines, and some references to older works, and nothing else. Maybe my expectation is too high about this master filmmaker, or maybe he is going through extremely hard times. Anyway, I wish him all the best, and hope that we see some great works again in the future...."}, {"id": 10, "text": "Woody Allen at his best, a nostalgic look at his Manhattan. A delightful romantic, witty comedy, wishing there were more of these."}, {"id": 11, "text": "A milquetoast Holden Caufield is uncomfortably out of place in this rehash of masterpiece Manhattan. The characters play purposefully phony. Piano plays, mild witticisms are traded, rain falls. Oscar Wilde turns in his grave. This doddery film suffers from the 84 year old director's male gaze. There is no place for it. No charm, cinematography uneven. Selena Gomez stands out."}, {"id": 12, "text": "It is really sad such a great cast got wasted on this film. I've seen both Elle Fanning and Timothée Chalamet play characters with immense depth, and yet these roles striped them of all that with poor dialogue and such a soulless story. It was really disappointing to say the least, I was excited to see this cast work together, but a story really does matter."}, {"id": 13, "text": "Lacks any depth, fails to be funny, the dialogues are artificial, and Elle Fanning plays unbearably irritable character. The setting is really beautiful though and Timothée Chalamet is always a pleasure to watch. Overall, not a bad experience but I was hoping for a better story."}, {"id": 14, "text": "I own almost all of Woody Allen's movies, and have followed his career for three decades. This one was torturously dull. Honestly. If it didn't have Allen's name attached, nor actors you were familiar with, you might think it was a very well shot student film. Such a disappointment."}, {"id": 15, "text": "'A rainy day in New York' is your classic Woody Allen ... adapted to the needs &amp; tastes of the 21st century. A remarkable transition from a filmmaker over 80 years of age, surely showing his genius.For once Woody Allen keeps his face out of his film -- we see a young guy acting as his 21st century stand-in. Around this guy develops a true whirlwind drama, reminding us of Allen's best work.The rainy picturing of wealthy New York of 2018 is fine, and the piano-music surely adds an extra -- even including Eroll Garner (1921-1977), a very famous American jazz pianist.My only doubt: our guy meets his girl in Central Park at the end of this film. I think their characters are too different to make their relation work."}, {"id": 16, "text": "Any film that features the music of jazz legend, ERROL GARNER, gets a 10 from me- with no questions asked.The is a classic, romantic and delightful Woody Allen romp, so there's no need to delve into cinematic details.And like the Coen's Llewyn Davis and, Oh, Brother, Garner's incomparable piano is the defining characterist here- Jazzy, Smart, Poignant and very New York City."}, {"id": 17, "text": "After all the poor reviews by the critics I was delighted! This is a sweet and funny entry in the Allen canon, and Elle Fanning is wonderful. She is worth the price of admission just to enjoy her performance. Don't let the haters stop you from seeing this one, another love letter to New York."}, {"id": 18, "text": "There are so many reasons to watch this movie! It's not boring. It has a full and rich story. Lots of interesting drama and Woody's decades long patented sardonic comedic formula still does exactly as it is supposed to - make a nice romantic comedy with a happy ending. It works wonderfully. Thank you Woody."}, {"id": 19, "text": "This movie is an oasis in today's super-paced, zero-plotted, super-powered, highly cgi-ed cinematic desert. The dialogues are fun, characters are good, New York is always beautiful.The only downside of the movie is Selena Gomez - destroying every scene she's in with a dry and plane acting. Woody Allen might naturally give her role to a log - and it wouldnt make any difference for the scenes she's in.Overall a very nice experience, an oasis to breathe for sincere movie goers."}, {"id": 20, "text": "Woody Allen give us a great Woody Allen movie. A splendid look of New york, good performances, especially Timothée Chalamet who I find perfect ( He really shines in this type of register ). Some references in literature that Woody Allen like to make us discover. A fresh comedy, bright and charming."}, {"id": 21, "text": "As a fan of his work, I went to the cinema with an open mind - but oh boy is this a stinker. The plot - what there is of it - is like a 1970's Brian Rix farce. I was expecting people to appear out of wardrobes with their trousers around their ankles. The jokes are tepid and sparse - and I wonder is he trying to take the mickey out of wealthy spoilt brats or rub less well off peoples noses in it? Not clear. Go and see anything else - but just don't go and see this rubbish."}, {"id": 22, "text": "A typical (early career) Woody Allen movie with the lead male recognisable as a younger version of the chaotic, fast talking, witty and pseudo intellectual romantic and the female as a naive country girl. Not one cheap effect or act of violence or sex that you normally find in movies to please the regular audience."}, {"id": 23, "text": "An old man's movie played by young actors. Unreliable and exhausting over acting. One of the worst movies I've seen in years."}, {"id": 24, "text": "This movie was warm and funny. It had real heart. Watching it was like getting a huge hug - it made me feel good inside. What more can you ask from a film?"}, {"id": 25, "text": "I can't believe but I have never watched a Woody Allen movie until this one and A Rainy Day in New York really makes me curious about his work. It is just so light, charming and funny with two great leads. At the same time the dialogue is witty and natural. Obviously we will not have a deep dive into today's problems, social commentary and the seriousness we have to have now in everything because this is not that kind of movie. It is a lighthearted comedy with an unbelievably charismatic Elle Fanning (who could have been written a little less naive) and an also convincing Timothée Chalamet. There is not head-heavyness, people don't ponder about the way their day goes so much. They just go on for the ride and see what happens next. It is a breath of fresh air. I also liked the way the lighting is used here. The music adds to the great experience. Thumbs up!"}, {"id": 26, "text": "This so so bad. A pastiche of his early work with toe curling script, and painful plotting. The actors do their best, but, come on Woody, time to ride into the sunset"}, {"id": 27, "text": "Low key sweet, charming and romantic. Like a rainy day in New York."}, {"id": 28, "text": "Despite the controversy surrounding the film, I thought it was a witty and delightful film. The dialogue is a little unrealistic for young adults, but adds a quirk to the characters. All the actors did a great job in their respective roles. I felt the chemistry flowed on-screen with everyone. Cute movie to watch on a lazy day. Was worth the 2 year wait!"}, {"id": 29, "text": "It entertained me for 90 minutes and I enjoyed every minute of it. The cinematography and acting were great."}, {"id": 30, "text": "I just saw A Rainy Day in New York and I think that everyone who is fond of NYC, Woody's movies, rain, autumn and Chet Baker MUST SEE IT."}, {"id": 31, "text": "As usual, the new Woody Allen film - his 48th feature in 51 years! - is a disturbing departure from the last few. What disturbs is its newness. We're disappointed when our expectations are denied. So an adjustment is necessary if we are to take it on its own, proper terms. The plot is familiar: when a small town hick comes to New York, her relationship with a city guy is challenged by the Big City. It's Neil Simon country but Allen infuses it with an uncommon density of personal inflection. That goes beyond What's sexy about short-term memory loss? And Time flies....Unfortunately, it flies coach.... It's not always a comfortable trip. Specifically the film responds to the time and circumstance of its making. When Mia Farrow's questionable allegations of Allen's alleged abuse of her daughter resurfaced, Amazon broke their agreement to fund and distribute the film. So here: The world is full of tragic little deal-breakers. And There are no newspapers that are not tabloids. Not since Manhattan has Allen delivered such an encomium to New York City: You are here or you are nowhere. You cannot achieve another level of anxiety, hostility or paranoia anywhere else. Instead of the usual star-studded Allen cast, here Jude Law is the film's one big star. As his name suggests, Gatsby Welles is a cultural construct. Gatsby signifies the illusion of old wealth and social stature. Welles connotes a maverick individuality. The hero's wealthy family propel him into the arts, the responsibilities of high society, the mixed blessings of the privileged. But at that privilege he bristles. This Gatsby took classical piano but yearns to play romantic ballads in a bar. He doesn't have to be able to sing well to enjoy singing a classic ballad. Instead of college studies he prefers high stakes gambling (at which he succeeds uncommonly, like Woody the filmmaker). Ultimately Gatsby breaks out of his romantic rut, unlike brother Hunter, doomed to marry a woman with an emasculating laugh. Gatsby's girlfriend Ashleigh comes from a wealthy Tucson banking family. A journalism student at Yardley College, she takes him to New York to interview the famously serious film director Roland Pollard. You're too original to have mass appeal, the awed Ashleigh assures him. Gatsby's old schoolmate dismisses his work with Never a decent toilet joke. When Ashleigh quotes Pollard's line Love and death are two sides of the same coin she doesn't understand it, but has evoked an early (funny) Allen title. The R.P. director's nominal echo of Roman Polanski sets up Ashleigh's NYC adventure. While in real life Farrow persists in her discounted allegations against Allen, she publicly defends Polanski against the sex charges to which he pled guilty. Here Pollard, his writer Ted Davidoff and actor Francisco Vega personify the predatory film industry that feeds off the star-struck, helpless naifs. Pollard uses his artistic suffering, Davidoff his unfaithful wife and Vega his star power to seduce the relatively innocent Ashleigh. Only the early return of Vega's girlfriend preserves Ashleigh's relative chastity. Implicitly Allen places Farrow's persistent allegations in the larger context that undermines her. Seeing Ashleigh on TV with Vega, the heartbroken Gatsby hires a hooker to represent his fiancee at his mother's classy dinner As Gatsby describes his mother's literary circle: It's rich housewives who have the leisure to pursue esoteric culture. The out of work, discussing the out of print. After his mother sees through the ploy and sends the woman home she tells Gatsby that she had herself been a hooker. Indeed that's how she met his father. Indeed she used her savings to set up his eventually successful business. This candour opens Gatsby's relationship with his mother: She's a lot more than I gave her credit for. With that knowledge he can accept himself as well as her and he can follow his desire to stay in New York and live the life he prefers. There is not such a gaping gap between the respectable and the pragmatic after all. There is non shame in honesty. The film ripples with allusions. Its sentimental core starts with the opening song: I got lucky in the rain. The singer sadly needs a song, then You came along, the love of his life. Relationships begin and end in the rain here, climactically over Misty, because the rain signifies the melancholy chill from which we seek love for shelter. What I really need, Gatsby avers, is a Berlin ballad. In the converse call to social realism, Gatsby is supposed to see the Weegee exhibition at MOMA, but he abandons that to follow his new interest, Chan, the grown-up kid sister of his old flame Amy, into the older histories in the Met. This relationship begins with the Benedick-Beatrice sparring on a student film set, where they meet and have to act a passionate kiss. Eventually their life will follow that art. They meet on that film set, have that museum date then meet again under the Central Park clock reliving a favourite romantic film. Chan's home is full of Old Master paintings and antiques. She reads Gatsby as an exotic searching for a romantic dream from a vanished age. That becomes her. Chan wins out over Ashleigh because she knows Allen's familiar dependency upon art for a meaning and consolation otherwise rarely available: Real life is fine for people who can't do any better. That's a film-romance re-write of Gatsby's mother's career. Unfortunately, to cleanse themselves of the old Allen scandal Timothee Chalamet and Rebecca Hall announced they were donating their salaries to charity. They make themselves victims of the slander and misrepresentation Allen has suffered and survived for so many years. This is a film they should be proud of having served."}, {"id": 32, "text": "Woody Allen repeating himself but in a very unsuccessful way. Characters meeting around all the time in New York like if it was a village of 1000 people. The plot is quite indifferent and I felt that all characters attributes were exaggerated. I would not recommend it."}, {"id": 33, "text": "A rainy day in New York City - one which we all wish could really happen and it most certainly has. Woody's films in his latest decade are all really good at telling a full story, keeping us interested in interesting characters and most of all, a good feeling at the finish."}, {"id": 34, "text": "You know it's a Woody Allen Film by this quote from the Film A Rainy Day in New York. One thing about New York City. You are here or you are nowhere. You cannot achieve another level of anxiety, hostility or paranoia anywhere else."}, {"id": 35, "text": "Another delicious and cult film of Woody Allen. Plenty of classic references , citations,and shows the academic Woody Allen' s taste for arts and music ..."}, {"id": 36, "text": "This movie has no plot.You leave the cinema and you don't understand why this movie was made.They tried to make funny scenes and dialogues but they are very very boring. There is no connection between the actors. One of the worst movies I have ever watched."}, {"id": 37, "text": "Regretfully I found A Rainy Day in New York not to be up to Woody Allen's par... It's OK, but slow... On the brighter side is the splendid selection of music - a standard in most all of his films."}, {"id": 38, "text": "Once again, Woody Allen manages to shape a nuanced story infused with his endless charming style, all the elements of his unique original new york inspired style are front and center, the snappy sequencing, the subtle and witty humor, Woody just knows how to showcase New York and present the best things the city has to offer, from the art scene to the amazing architecture of the town. As per usual, a Woody Allen's film features lengthy, rich, clever dialogues that are just to die for, utilizing an extremely talented cast that just takes to another level, Chalamet and Fanning complement each other quite nicely and I have to say that I was a bit surprised by Selena Gomez's performance as she delivered wonderfully.This has Woody Allen written all over it and I found it charming and delightful, An amazing movie."}, {"id": 39, "text": "Its hard to explain why this movie is so good. ITS simply geniously how cinema should be done. You come to enjoy,to laugh ,to see good acting ,no need of any violence ,special effects. I think its one of WA best movie and I liked the interaction of young actors with more mature ones. Its those type of movies that makes you want to go to Manhatten immediatly! Both my husband and myself really loved this so delightful movie."}, {"id": 40, "text": "This film was brilliant I thought I would watch this film and think wow this is absolutely terrible but no it's great.I personally think it's getting a bad wrap due to the obvious allegations on Woody Allen at this current time but forget it for a small time of 1 hour and 30 mins.But this film was a nice indie feeling romance film with an amazing set of actors! If you want to watch a film that is exactly like prime Woody Allen definitely consider giving this a go."}, {"id": 41, "text": "I thought it would be best to take notes as I watched it, so here they are:unrealistic characters who talk past each otherbad camerawork, just back and forthcolor is distracting, clashes; lighting is harshjokes are not funny and often it just sounds like Woody Allen, circa 1970first key scene is girlfriend (Ashleigh) telling protagonist (named Gatsby) she wants to go to screening rather than with him to a Weegee exhibit that is important to him, but that is left hanging (interestingly, Weegee's film, though not especially good, seems to have been an influence on Allen's early films)dialogue is often uninteresting, purposeless, disjointed, and at least somewhat offensive at timesit has the feel of Woody Allen imagining what he would be like if he was 21 years old in 2018 or whenever it was filmedcharacters just pop up randomly to discuss something that moves things forward, but it feels forced and intended to tell rather than show - it would be amusing if done to be purposely sillythe director of Love and Death gives us Love and Boredom all these years laterprotagonist sings and plays piano after telling a cancer joke, in a meandering scene that is meant, apparently, to show chemistry between protagonist and different young woman - the dialogue seems to be more consistent with people 20+ years older who have been in a long relationship and come to dislike each other (does Woody see successful relationships this way? if so that's rather sad)basic premise certainly could work but most of the characters are drenched in narcissism, who only seem to be interested in proving that they are worthy, which of course comes across as trying to compensate for low self-esteem if not demonstrativve of their self- loathingAshleigh seems to be trying to do an impersonation of Annie Hall at times (as Gatsby acts like the same character Woody Allen has played) - why not do something original? in Annie Hall we get a sense of why she acts the way she does, and we see her change significantly during the course of the film, but that doesn't happen hereone reviewer said, An old man's movie played by young actors, but do old people enjoy this sort of thing? instead, I'd say these characters are reminiscent of ones that were mocked in earlier Woody Allen movies, but now he wants us to sympathize with them, care about their decisions, etc., though they are unsympathetic for different reasonsanother reviewer's statement was funnier than this entire movie: ...oh boy is this a stinker. The plot - what there is of it - is like a 1970's Brian Rix farce. I was expecting people to appear out of wardrobes with their trousers around their ankles.on some level, it feels like the director is saying, see, this is what the super-wealthy are like, and they are just like us, aren't they? but if you are like one of these people, I doubt you have the self-awareness to realize how unappealing your self-centered, insulated life is!overall, it feels like a jumble, things thrown together randomly - there's the general premise, but that feels contrived (the way it gets played out) and there are unnecessary distractions, which lessen any tension that might begin to build upit has a nearly absurdist quality, and perhaps if there was some sort of apocalyptic development and they all had to confront their imminent mortality, perhaps there would be a way to salvage this hilariously terrible messGatsby goes to a poker game while thinking Ashleigh might be in great danger - so the super wealthy don't have smart phones in 2018?TV news report that makes Gatsby jealous is quite contrivedWoody's amateurish devices, which sometimes come across as charming to many viewers, come across here as just poorly renderedtowards the end, the film changes focus, from Gatsby questioning his relationship with Ashleigh to Ashleigh fending off much older males who view her as a potential sexual conquest, then we get a family drama with Gatsby; it seems like filler was needed because Woody couldn't figure out how to articulate the central dramaending is ridiculous, with inverted cinematic values!the main premise changed more than once, with none of them being at all satisfying. the protagonist decides to choose a different woman to be his romantic partner, yet he doesn't change or recognize that his view of himself was inaccurate. instead, we see Gatsby chose the better woman, which I find distasteful, at the very least (in some ways it was like the ending of Manhattan reversed); at the very least the story was flaccid and lazy.the ending makes us question if Woody has normal human feelings, because Gatsy doesn't seem to exhibit any normal attachment to Ashleigh, but rather possessiveness. if this was the case, there should have been at least one scene where Gatsby recognizes his flaws and treats Ashleigh with the respect she deserves."}, {"id": 42, "text": "Since this film is not being screened in the US, I drove to Tijuana Mexico to see it. Of Allen's films over the last ten years I would rank only Midnight in Paris and Blue Jasmine above this one. it shares some elements that have appeared in his other films over the past decade, but he puts them all together this time in an exceptionally elegant way. In the hands of a less masterful storyteller this movie would have been a mess. But Allen makes it look easy. Not a single word or scene is unnecessary, nothing is missing, I always knew exactly what was going on, and the movie never, for one single second, lost its momentum. As always the performances he drew out of his actors was astonishing. Every single one of them moved me. Even one actress who was only on screen for like two minutes. This is brilliant story-telling. Of the last ten films I would tie it for third place with Wonder Wheel. Wonder Wheel had a more dramatic effect on me, but the arc of this film felt more natural. What a shame Americans cannot see it without going abroad."}, {"id": 43, "text": "I saw this movie last saturday, To be honest I really enjoyed it As usual Allen does good plots, funny dialogues and stories too much close with the real lifeI really like it"}, {"id": 44, "text": "Ok... Not the best but it's good and worthwhile. Enjoyed it."}, {"id": 45, "text": "I loved everything about this movie other than the casting of Selena Gomez, just didn't work for me. Chalamet is heading for greatness in time. The music is beyond wonderful, and never played anymore which is a tragedy for the young generation. Manhattan forever, rainy, rich, romantic and full of secrets. You will laugh and cry."}, {"id": 46, "text": "Selena's voice is so sexy and different, this is a thing that stuck in my mind. In general, I enjoyed the movie. But, Her sudden appearance with a t-shirt on a rainy day looks unrealistic. The starring guy suits the role perfectly, I would prefer to watch his other movies. Overall, it is like imagination, if one of the main starring characters weak up the dream at the end, it would more sensible."}, {"id": 47, "text": "Despite the controversy regarding Woody, he sure knows how to make a slick, witty drama. As always, come with stunning visuals, a stellar cast and those signature sleepy, jazz piano scores. I'd say it's well worth the look if you're a Woody fan."}, {"id": 48, "text": "Watching a Woody Allen movie is similar to eating Italian food....it's all the same. The ingredients are the same...noodles, sauce, meat and cheese just put together differently...spaghetti, lasagna, manicotti etc. Woody Allen films are all the same...music from the same era, filmed mostly in New York, all have the same 'feel'...just different actors.I have heard Woody and the word genius in the same sentence many times. I have to agree. The man made 1 movie approximately 50 years ago...from that 1 he has changed the title and made a few other adjustments...but the movies are all the same...he gets away with it and no one notices.If you like Woody Allen movies I am sure you will enjoy this one. I was hoping for something new but didn't get it."}, {"id": 49, "text": "Excellent movie with story telling. Funny, beautiful, warm humor. Lot of text what needs to follow give extra enjoy."}, {"id": 50, "text": "So after the financiers (Amazon) dropped this film from their release schedule (because of the resurfacing of baseless accusations from over 25 years ago) and a legal battle for the distribution rights, the latest Woody Allen film has finally had cinematic releases in most countries around the world outside of North America. After all this I can now report it was worth the wait as this wonderfully light and whimsical film set in New York (obviously) is an absolute delight. The story follows a young couple (Timothy Chalamet, Elle Fanning) who arrive in New York for a weekend where they are met with bad weather and a series of adventures and misadventures. It is a well paced film with a lot of interesting characters along the way. I have seen more visually stunning Allen films but this one does look good and have a few beautifully framed scenes that will stay with me. All the actors bring a lot of charm to this story and I would say this is my favourite Woody Allen film since Blue Jasmine (2013). So in these bleak times if you want something with some light charm to make you feel better while you pass 90 minutes, I recommend this one and at this stage this is in my top five for the year."}, {"id": 51, "text": "Everything you would expect from a Woody Allen film taking place in New York City. Great dialogue and a decent story with great acting."}, {"id": 52, "text": "At 84 years of age, Allen delivers a fantastic, and quintessentially Woody Allen, movie. Whatever the controversy, Woody Allen doing Gossip Girl - despite its obvious, almost brazen unbelievability and unnaturalness - turns out to be both touching and fun. Everything - from the protagonist's name, to his girlfriend's gonzo journalism quest and the ultimate mother-son heart-to-heart - is ridiculous, yet the writing is smart without being pretentious, the actors are having a blast (whoever discovered Chalamet deserves a prize, as is becoming clear by now) and the movie works. Allen's stand-in protagonists ever since he stopped playing them himself have been hit-and-miss - but Chalamet is spot on, New York is gorgeous, and spending 90 minutes in the company of the city's pampered elite and their creative and coming-of-age-woes is neither annoying nor distasteful, but charming and sweet. As with many of Allen's films, no attempt is made at hiding the literary material it so obviously references - but Salinger and Fitzgerald are not done any disservices here."}, {"id": 53, "text": "I loooooooooooove this movie (but I just don't like the end). The cast is excellent. Elle Fanning is very funny. I saw this movie in Amsterdam and in Madrid. We also have the DVD. Woody Allen is a genius."}, {"id": 54, "text": "It doesn't rank with the best Woody Allen movies, but it's a nice little film. There is a suspenseful and sad scene where Elle Fanning's character is mistreated by a slimy Lothario; her exfiltration from his flat counterpoints the Timothée Chalamet character's comical flight through an art museum. There is a touching, albeit far-fetched, reconciliation between a mother and son. The dialogue requires suspension of disbelief, and the many romantic betrayals never cut very deep."}, {"id": 55, "text": "Still very familiar with Woody Allen's style and work.His innuendo, his little humor, his little tricks."}, {"id": 56, "text": "This movie was so unrealistic, not only the plot but the script..ugh! I'm familiar with Timothee Chalamet's work and I believe he is a great actor, but wow, even he couldn't make the dialogue seem natural. The characters in this film are not relatable at all, and I don't mean because their ridiculously rich, it's hard to understand their emotions and thought process. You don't get to sympathise with them at any point. There is no climax to this movie, I find myself wondering what its purpose is.. there isn't anything for the audience to take away from it. I don't recommend watching this, it was bearable, but an honest waste of time."}, {"id": 57, "text": "It's like Once upon a time in Hollywood without the recognition. If you like explosions and CGI then it's not for you. If you enjoy a nice story, you will enjoy this"}, {"id": 58, "text": "I have to say this was a bit disappointing since I enjoy Woody Allen's work. Although the narrative seems promising, I am having a tough time emphatyzing with the characters and their development.Although I like the idea of New York rain being able to wash the filthy glam fasade of the rich, this just lacked some script depth. I am worried that Woody's age is slowly catching up on him and it is not flying Coach."}, {"id": 59, "text": "Each movie by Woody Allen (good or bad) has always some sort of layered thought about cinema and the process of writing. All of them are meta-films, in each we find tokens and signs to follow. In Annie Hall it was the idea to approach a narrative from multiple points of view, and that's why we have Alvey speaking directly to the camera, his childhood in flashbacks, tv shows (inside the movie) and even an animated sequence. In Stardust Memories we have the idea (Fellini style) of wiping out the line between the reality and fiction of the character inside the greater fiction that is the film itself. And so on... In each film we can look for and find ideas of this kind. The interesting thing about this Rainy Day... is that these issues are specially explicit. There is a narrative split between two characters, each searching for their own film:The boy enters a genre movie (thus the literal references to films that belong to a certain collective cinematic memory). The first thing that he does when he finds himself alone is to act in a movie! The romance between his and Selena Gómez's character literally starts at a movie set (a set inside the set of the film we are watching). His character's name is Gatsby Welles - two direct references to a writer and a director. This character IS an actor even if he denies it - he builds his role as the negative of the role his mother pretends him to play. He even buys props like the cigarette holder. He is a pianist, who dreams of playing jazz.The girl, on the other hand, searches for and writes (quite literally also) her own film, through the meetings (more or less accidental) with, no more no less, than a director, a (script) writer and an actor. She enters their stories, and becomes their center. She feeds on them and writes her own story, as she rewrites everyone else's. The joke is not on her, but on the three men with whom she crosses paths. Each one is a cliché, a stock character like those Woody so many times uses (a probably unintentional wink is that Liev Schreiber, who plays the director, already played Orson Welles in another movie).There's a poignant scene, near the end, when the apparently frigid and superficial Mother reveals a past that completely overwhelms the idea that the had on the obscurity of his life versus the shallowness of the University where his parents have him studying. The dramatic twist is the idea that the mother has walked down the road the sun wants to trail, she has had the life that he wishes. The mother is the most powerful character. She lived what he can only act.The end, that Chamalet and Gómez's characters admit to be taken out of a (well known) romantic movie, is so obviously artificial that we know that it can only belong to a movie, not to a real life. It closes the story of the two main characters in a dramatic way, where he will live his movie and she goes on to, presumably, write others'."}, {"id": 60, "text": "Bad main actors. Rich people who want to be leftish. Tobacco sponsored and with a Fanning that's over acting. Totally uninteresting main couple. No charisma, no chemistry between the main couple. Allen has done many great movies, but maybe it's time to retire."}, {"id": 61, "text": "Not only was this film boring as hell, pretentious conversations are not torturing enough for W Allen, he had to also be sexist and place more than half the female characters as shallow, stupid or prostitutes. Glamorising prostitution is not a thing we want to see and it is insulting to think that a beautiful woman sitting in a bar could be nothing more than selling her body to men. When the story took THAT turn I was already done with this film, but then he had to go there with his own MOTHER. Does W Allen hate women that much? Has he not had enough of controversy with his own private life being accused of sexual abuse ? And leave all that aside, the script was lame and boring. I will recommend this film to people I hate."}, {"id": 62, "text": "I loved this movie, just like almost any Allen's movie! It's absolutely not commercial like all directors and studios try to make of their films, and that's what I also like too about Woody's movies! It's a shame that it did not showed in US, I think such movie is too sophisticated for the Americans!"}, {"id": 63, "text": "Ima hardcore woody fan, weirdly i love his works starting from early 90s up to match point, after which i love his films sporadically (but love any one of them anyway). This one is definitely fresh and very well written. Dialogues are gold, main character is typical allens ny character. Nevertheless id say i enjoyed whatever works the most. But this still is the allen at his best!"}, {"id": 64, "text": "The lighting is infuriating. The pretentiousness of the script, which the actors embody masterfully, has been a constant of Allen for a while now. Difference is, decades ago it was a window into a world and there might have been something universal and empathetic about the characters, now he's so out of the social narrative still showing a culture that exists only in the echelons of Manhattan upper class and who gives a rats really."}, {"id": 65, "text": "Went to see this movie in the cinema with a positive attitude. Movie starts and right away the acting felt very amateur and fake (more like a theatricle play than a movie). It starts raining (of course, movies name) but there was literally SUN during the rain the entire time. People (real, ordinary people) on the street were dry, had no umbrellas and there was no sign of rain except on the movie scene. Very very annoying.Overall the movie was a big disappointment for me. The only good part was that it's said to be a romantic movie and it certainly was. 5/10"}, {"id": 66, "text": "Is it because shes such an awkward, uncomfortable, unnatural actor? Casted to keep us at on edge? Maybe she's genuis? Not sure but she ruined an otherwise cozy, usual, Woody Allen movie. Still making the same movie in other wrappings. Still asking actors to replace himself. This movie is as warm as it is unsettling with how contrived the situations are. Kind of like reviewing the same apple over and over again with his films. Just depends on your mood"}, {"id": 67, "text": "A pleasant movie to be watched and nothing more than this. A young couple go to New York where the girl who is a journalist has to interview a well known movie director and the boy wants to have a pleasant stay there with her after the interview. However it happens that things get complicated by the meeting with other oeople which create unpredictable situations that turn encounters into divergencies and lead them to try to disguise their behaviours to each other. This is the usual Woody Allen's way of making movies that tell the stories of ordinary people caught in unpredictable awkward situations."}, {"id": 68, "text": "Felt lackluster and not up to Woody's beat fare.On a side note, Gatsby ended up with the wrong girl."}, {"id": 69, "text": "To be honest it was boring, boring, boring. Aweful pretentious dross."}, {"id": 70, "text": "Ellen Fanning deserves an Oscar. great dialogues and setting. what a nice buidlings. and every actor seems in a good mood, enjoying themselves"}, {"id": 71, "text": "A Rainy Day In New York finds Woody Allen bringing together Hollywood's talented young blood of actors, but too bad the final result is a mixed bag of recycled filmmaking. . In this comedy, a young couple arrive in New York for a weekend where they are met with bad weather and a series of misadventures. . If this turns out to be Woody Allen's final film, A Rainy Day In New York is one of the more familiar of Allen films but it feels really overused at this point. The cast is solid and the locations are gorgeous but the film overall doesn't feel fresh. Personally, the film felt over long and I really hoped it would've been better."}, {"id": 72, "text": "For sure one do The best movies i've seen lately, the hole movie tries to push you into The movie, and the characters are brilliant, Timothée's characteristic character is just amazing, i'm really in love with this movie."}, {"id": 73, "text": "The lead actor says he had chosen his university since it has the best kurdish study (around 70th min.). Thanks for giving homage to the sufferings the kurds have undergone, ezidi slavery by ISIS, and other events.allegorically, what this movie tells us: there is no such thing as great love, happiness and success.in the movie it implies that journalism is near to the second oldest profession. this is a story from 2017. But in 2019, journalists are in retreat, we need even a bit of it."}, {"id": 74, "text": "A Rainy Day in New York is a new American movie from 2019 and the most recent filmmaking effort by writer and director Woody Allen, who is gonna turn 85 already next year. It runs for slightly over 90 minutes and that includes credits already, so not a too long film. And Woody Allen is still a really big name in the industry, so no surprise the cast includes many really famous actors. I don't want to make a list of the names as you can check these out for yourself, but let me say that Timothée Chalamet and Elle Fanning play the two central characters. Rebecca Hall I really like and she is always a welcome addition, even if she only has one scene like in this one here. She worked with Woody already in the Oscar-winning Vicky Cristina Barcelona where by the way she was as good as the actress who won the Oscar for that film in my opinion, maybe even better. Okay but now back to this one. Woody making films in which cities play quite a role is not an exception at all. And this is by far not his first tribute to New York. Think of Manhattan obviously or pretty recently also of the Coney-Island-set film starring Kate Winslet. Still I must say that this one here felt really much more about the characters than about New York and it could have played in other areas of the world too. It is basically set in the now. I wondered a bit about that honestly with mentions of legendary directors and the way they were mentioned felt a bit as if they were currently active still, but later on we find out about mobile phones being used and there is also a brief climate change reference in here. I mean not in the sense where it is in any way trying to make a political statement, but you know it is a film that takes place in the 21st century.Okay now about the plot and characters: Chalamet is Gatsby and Fanning is Ashleigh. I thought for quite a while that Gatsby was just his nickname really because his lifestyle and general approach to life were similar to the famous literary character's but no it is his real name. I wonder what the parents were thinking naming him like that. Anyway, we have a young couple travelling to New York for a weekend because the girl is working on a journal article for her university and she gets a chance to interview a really renowned director. This turns out to be a massive challenge to and chance for her, so eventually she just won't find any way to spend quality time with her boyfriend whatsoever. And that results basically in both of them spending a lot of time with attractive people from the opposite gender. For Ashleigh, it is not just the director, but also his regular screen writer that she is a huge fan of and eventually a really popular Hispanic actor. For the boy, it is the younger sister of a former girlfriend and a lady he meets at a restaurant. Don't want to go particularly into detail what she does because then maybe she would not fit the description anymore. But she becomes his date when they go to a party organized by his mother. I must say all these meetings were fine, but the great attention to detail was not offered in the scenes that included them, so at some point for me it basically just turned into a guessing game who's gonna end up with whom. And Woody sure enjoyed toying with us here because first it seemed as if Ashleigh could start something with the director (Schreiber), then that Gatsby could start something with Gomez' character and that Ash stays faithful, then that Ash starts something with Law's character and so on. Eventually, she is really ready to have sex with Luna's character and it would have happened if his wife had not interrupted that very moment, so it puts Ashleigh not really into the best light, also not when she says to Gatsby near the end that the actor only wanted her body and that she is happy to be with her boyfriend again, the one who she basically not only neglected all weekend, but she even denied him pretty much when being asked if she has a boyfriend, so certainly not a likable character, even if that is not too easy to say for me because I think Elle is really one of the most adorable actresses on the planet and I am sure she will have a great career for decades to come. I still must say hiccups on her I expected to be the cutest thing ever which they were not and maybe with an actress I like less I would have hated that little inclusion, even if it really only a minor addition.Now rain actually plays a crucial role in this film somewhat. There is a lot of talk about it how Chalamet's character finds it romantic, but Fanning's not at all. This is basically the key explanation why they do not really fit together. At the end, it becomes obvious too when the last words by Ashleigh in the carriage are basically an instruction to the driver to hurry up because it rains and at the same time Gatsby enjoys his time in the rain and he meets the girl he really wants there because she feels the same like him, about rain and about mutual attraction you can say. The photo here on imdb is really a bit of a spoiler, but admittedly you really could have guessed with the first (no third) kiss between these two. And how it starts raining this very moment. Or how they through coincidence meet again in the rain in the taxi and they go on the vehicle trip that Gatsby wanted to go on with his girlfriend initially. On the one hand, I am a bit surprised that Woody really cast Selena Gomez for such a crucial part, but then again nothing should really surprise me when it comes to Woody. He does what he wants and not what the media tell him and obviously he himself is controversial enough as a character that he should not really give any credibility to people saying Gomez may not be good enough an actress for the part. And I thought she was good enough anyway. As for Woody, many people still refuse to watch his films because of his romantic affairs, but I think that is not any of my business and I won't strip myself of a quality watch because of that, especially because I have a permanent ticket anyway, so I did not pay any money specifically for this showing, i.e. into the filmmaker's pocket. These criticisms are like the ones about Polanski, another very old and successful filmmaker, although maybe slightly less serious for Woody. But I don't want to write a lot about that here and return to the film instead. How much I consider it worth watching is already described in the title of my review. I don't think it is as bad as many say, but also not a truly great achievement. People who like Chalamet (and Fanning) should watch it as basically one of them is always seen and it is a bit split between these two as they don't share too many scenes like Allen already did it in another recent film with Stewart and Eisenberg. But this one here also has many nice moments and examples of smart writing. I liked the beginning with the song. And how we are thrown right into the action, which is not too surprising though because like I said it is not a long movie. As always, Woody will definitely get a smile on your lips here and there. I will mention some moments when he did with me. For example, that was when near the end all the guys want to get away with Ashleigh and leave everything behind and act as if it was true love, well except her boyfriend, who was crazy in love early on, so I struggled a bit with believing he fell out of it so quickly, even if admittedly seeing your girlfriend enter a famous actor's car makes something with you. But I want to talk about the positive really now. These final moments of Schreiber's and Law's characters were funny. Also funny was how he keeps beating everybody at poker and makes tons of money this way and well I will leave it at that, you will recognize these little funny moments when you see them like what's the secret thing Schreiber's character wants to tell her and she thinks it is something else at first. Simple Woody, you know what I mean. Nonetheless, there were also many moments that were intended as funny, but did not work out so well, like him trying to hide away from his extended family at the museum. Or the scene I mentioned earlier when one character's (still) partner shows up and destroys a scene in which a couple is getting busy. Also for the non-funny moments there are further examples that you will find yourself. One more dramatic scene that did really nothing for me sadly was the one near the end when we have Gatsby's mother confess to him about her professional background back in the day. I mean this really made something with Gatsby as we find out at the very end, but this monologue by the mother did absolutely nothing for me and it reminded me of Chalamet's most famous film, in which his dad makes a confession to him at the end and that scene is so right, so heartfelt, so honest and this scene we have here is really nothing of that. This parallel was really disappointing for me. But yeah, overall I still believe the good is more frequent in this film than the weak and unless you start watching it with expectations that it could be a masterpiece, you shouldn't be disappointed. I give it a thumbs-up and nice to see Woody still come up with movies like this at his really old age now."}, {"id": 75, "text": "Woody Allen's most recent film (2019) is a huge film. One more... Naivety, youth and beauty, powerful mix that makes director, writer, actor and boyfriend -characters- succumb in A Rainy Day in New York Two more women: The mother who calms the waters and the opportune Chan who takes advantage of the momentum ... Life in New York, the relationship of the couple, nobody dominates these themes better than Woody Allen. As is traditional, a movie written and directed by the prolific New York filmmaker. Yet another strength: it is Woody Allen's well-established team in production, photography by Vittorio Storaro (3rd. movie) and editing by Alisa Lepselter, the latter with 20 years of work on the team. Pleasant and very convincing performance by Elle Fanning, in the role of the naive university reporter. Cast includes: Timothée Chalamet, Selena Gomez, Jude Law, Diego Luna, Liev Schreiber, Rebecca Hall."}, {"id": 76, "text": "While not in the pantheon of truly great Woody Allen movies, A RAINY DAY IN NEW YORK is nevertheless fizzy, zesty, silly fun -- and a real shot in the arm for sophisticated comedy fans (if your taste runs more toward (the over-rated) BOOKSMART, you might want to skip this!). T. Chalamet and the delightful E. Fanning are fantastic together -- it's the best thing either of them have ever done -- and the casting, throughout, is spot-on. In particular, an actor named Ben Warheit absolutely kills it (in his hilarious scene with Chalamet), Liev Schreiber essays a very funny performance (that's all the more comedic for being so reined-in and ready to burst), and the great Cherry Jones knocks off a (typically-incisive) Woody monologue with a panache that takes your breath away. All in all, it's no award winner -- but it's the most sheerly entertaining movie I've seen in a year."}, {"id": 77, "text": "A beautiful, quintessential, Woody Allen New York movie. Loved the two principal characters."}, {"id": 78, "text": "The city that has its own agenda, Thimothée Chalamet and one of the finest Woody Allen's in ages... Who cares about the sound of the sirens when you are in New York?!"}, {"id": 79, "text": "A Rainy Day in New York is one of the best and i Like the Way Woody Allen make the movies.the movie was about complication or sophistication of a relationship and who people may make their decisions about any specific and Important moment of their life.whole the movie was about the dialogs and I myself think that it was the writer who want us to feel this way.I Like Almost every dialogs."}, {"id": 80, "text": "Woody Alan hits again Let me start with: I don't particularly enjoy movies directed by Woody Allan. They are too slow for my taste, there's usually too much dialogue and the characters are stereotypes of some sort. But this time, the old pervert did it right. This movie was chosen by pure accident: being a foggy November outside (although it's January) .I wanted to spend the evening with a movie that is light and not demanding, so I've started searching... this one caught my attention as it had more than 6 stars on IMDB. Usually, romantic movies rarely get past the barrier of the '6'. Maybe it's because all of them have the same old pattern, girl or boy falls in love, finds out his partner is not what he thought it was and in the end they end up with someone else, usually some old lost romance. So by watching one movie, you will soon have the feeling that you've watched them all. This one started as well as any regular romantic chick flick: Mr. He, a quiet, although intelligent boy has a rich, popular girlfriend and, being a movie where everything is possible, they are together. Mr. He plans a romantic weekend with Mrs. She - where else than in New York, where Mrs. She wants to have a short, one hour interview with some famous movie actor Liev Schreiber. This is a perfect recipe for these 5 star romantic movies you will watch and forget the next hour. When lucky, your better half will get all romantic about it and you will enjoy some joy-time in the evening. But not this movie: Quite soon from the beginning, the perfectly planned trip is torn apart by some unforeseen events, when Mrs. She gets invited to watch the unreleased movie of this famous actor, so the one hour interview gets suddenly longer and all of Mr. He's plans will be torn apart. Also, after this happens, Mr. He meets the handsome little sister of his first crush, and they end up kissing. Not in a romantic way, no, they are part of a movie and they are being filmed... The Woody Alan style is there, all-right, as the characters talk tremendously much, but this time it kind of feels natural: the dialogues are between people who did not meet for a very long time and they have lots to say to catch up. Also, like in any Woody Alan movie, all of the characters are put into situations where their true self comes to surface: Mrs. She will soon forget that she has a boyfriend and gets drawn into the stormy social life of several famous artists: First, Roland, who has some serious midlife crisis and obviously drinking issues as well, his friend, who by an unfortunate mistake finds out that his wife is cheating on him with his best friend or a famous Italian actor, who just wants to take advantage of her like he did with so many others. Being a naive blonde and helped by the endless drink she's offered everywhere she quickly ends up in the bedroom of this famous Italian actor . Without spoiling the rest of the movie, all I can say that the plot is not predictable at all and very enjoyable: every time when you expect that the character will act in a very predictable way, they fuck up somehow and do exactly the opposite. Unlike other Woody Alan movies, where the dialogue seems to be overwhelming the entire movie, here it feels natural that really helps to reveal the true nature of each of the main protagonists without being over-abusive. Overall, this is a very enjoyable movie where Elle and Timothee's acting talent really shines, but also the secondary characters shall not be neglected, as well, like Will Rogers, for example. To conclude, if you would like to watch a good movie on a quiet evening, alone or with your better half, this is a great choice and I am sure you won't be disappointed."}, {"id": 81, "text": "This film tells the story of a young couple's strangely eventful day in New York.This film is Woody Allen in the sense that it still contains a lot of medical terms and many rapid dialogs. However, it is also not very Woody Allen because it doesn't feature prominently anxious characters. It is a fun, uneventfully eventful film, until the big confessional scene from the mother. That scene elevates the film a lot, in my opinion. Elle Fanning is great in the film, as her character appears truly innocent and very nice most of the time. I enjoyed this star studded film."}, {"id": 82, "text": "Woody Allen's die-hard fans would likely agree that one of the auteur's main draws is dialogue. A rainy day in New York is no exception. In the following brief recap of the plot, therefore, I'll quote liberally. These quotes, incidentally, were jotted down on my muted cell phone from the last, entirely unoccupied (except for myself, of course) row of seats in the cinema. I was absolutely certain that not a single person in the audience was able to see the glow from my cell phone. Not even out of the corner of the eye.The plot is not unlike one of the several story lines in another of Allen's film, To Rome with love (2012), where a young Italian couple Antonio and Milly travelling from a small town to Rome and end up having separate adventures. But, even when some of the details are recycled, A rainy day in New York concludes with a different twist.The couple, boyfriend and girlfriend from the same college, go to New York for a weekend. Ashleigh (Elle Fanning), Pulitzer-aspiring journalism major, has an opportunity to interview a famed director for her school paper. Gatsby (Timothee Chalamet), perhaps thus named intentionally, sees this as an opportunity for a romantic escapade in a city where he grew up in a rich family. Similar to abovementioned Antonio and Milly, Gatsby and Ashleigh follow separate paths after checking into their hotel room in New York, and do not see each other again until the day is over.Gatsby runs into Shannon (Selena Gomez), the little sister of an ex-girlfriend, and fills in as an extra for a commercial she is making, requiring him to kiss her passionately. Upon finding out that Gatsby's current girlfriend is from Arizona, Shannon quips What do you talk about with her? Cactus? And rattlesnakes Gatsby countered. When Gatsby exclaims that he knew Shannon as a cheeky little girl and she is now a young woman, she says, Now, are you going to start singing Gigi?. Yes, there are references aplenty to other movies. Later, Gatsby and Shannon run into each other again, but allow me to refrain from further disclosures here.Ashleigh, in the meantime, goes through her personal Odyssey of three men, who respectively have spiritual, emotional and physical needs which they hope she would fill. The director interviewed, Roland Pollard (Liev Schreiber), not young any more, is popular still with women, prompting a remark from someone what is so sexy about memory lost. He seems to be suffering from an identity crisis and looks towards Ashleigh as his new muse. When he finally breaks down in a work screening to which Ashleigh is invited, and disappears, she pairs up with writer Ted Davidoff (Jude Law), driving all over town to search for him. Things take a turn when Ted spots his wife Connie (Rebecca Hall) going into an apartment where is best friend lives, and becomes so emotionally frantic that Ashleigh wouldn't want to leave him all by himself. This leads to a hilarious scene of Ted's confrontation with Connie, who charges him of bringing a 15-year-old concubine. Ashleigh promptly produces her identity card to prove that she is 21!Later, continuing the search by herself, Ashleigh comes face-to-face with the heartthrob star Francisco Vega (Diego Luna), when she tells him that her roommate considers him the best thing to come along since the morning after pills. To others, however, Francisco is a James Dean minus acting chops. Later, in the evening, all three men converge at a party, where Roland asks Ashleigh to go with him to the south of Francis to help him rediscover himself. To where of what? she echoes. The evening eventually finds her in Francisco's bedroom, and I am not going to disclose how it ends.At the other end, Gatsby is frustrated by Ashleigh's phone call saying that she cannot join him, yet. Finally, seeing her on gossip TV news getting into the car with Francisco becomes the last straw. In a bar drinking alone, he comes across a gorgeous woman whose work is to make dreams come true. Use your imagination is her reply to his prompting question. With a flash of inspiration, he hires her to accompany him as his girlfriend Ashleigh to his parent's party. His helicopter mother (Cherry Jones) soon send the girl away and tells his son point blank I can smell a hooker when a see one. More twists to follow. I have already sinned with much spoiler. Suffices to say that it is not too difficult to see what is coming if you are paying attention.Just by looking at the names, one can see the calibre of the brilliant supporting cast. But its Fanning that is captivating all the way. I won't pretend that I remember her in a 2-year-old role in I am Sam. But I well remember many movies from the amazing proliferation of her work during her teenage years (she just turned 21). In Super 8 she is a daring, adventurous teenager. Maleficent sees her as a mainstream, sweetheart of a heroine. The Beguiled is an eye-opener, casting her against type as an unsuspected fame fatale. I think we're alone now pitches her against the world's most famous dwarf in an acting contest. And then there is heart-wrenching Galveston, where she shows her true steel playing a desperate young mother. Here, with Woody Allen, Fanning displays superb, pitch-perfect comedy sense. Timothee Chalamet is of course another rising star that shines just a bright. But in this movie, he is outshined by Fanning."}, {"id": 83, "text": "Ok the female characters are airheads, or fellatrixes or shallow climbers.Even more fun several of the actors and actresses involved in this film are the most out front nanny PC lecturers wagging their fingers and mouths at the public , yet are working with #metoo poster perv Woody. OK.Woody Allen has made some great films, no doubt about it. But Rainy day feels like a shallow tour of his own tropes. Skip it."}, {"id": 84, "text": "This film start with the introduction of the Yardley art school, and a couple(Gatsby and Ashleigh) talking at the art school scene! As turnout, this film is about the love affair surrounding Gatsby and Ashleigh! Entire film full of boring conversation! The annoying raining sound and the cricket sound in the film also make the film unwatchable! Barely laughable scene is, Gatsby filming a kissing scene with Chan, he say he can't do it, but instead he still kissing Chan after several re-shot! At the end, Gatsby choose Chan and abandon Ashleigh! That's it! A romance film with only talking nonstop! Pathetic!"}, {"id": 85, "text": "It's too bad this film is not getting a wider distribution in the States because it is the best Woody Allen film I have seen in years! I liked how Woody presented the film from a millennial's viewpoint (opposed to his usual older person). I always wondered what MANHATTAN would've been liked if it was told from Mariel Hemingway's point of view. Well, now you've got it in A RAINY DAY IN NEW YORK. I liked everything about it--the acting, the directing, the cinematography--and especially the writing. There were a lot of clever lines in this film. But what I liked most about this film was how the boyfriend/girlfriend and son/mother relationships were portrayed. It's funny because I recently read D.H. Lawrence's SONS AND LOVERS and this film reminded me of it. It's interesting how mothers play a big part in a son's life. Highly recommended. 4/4"}, {"id": 86, "text": "WA in Manhattan, young people, love story, annoying stereotypes everywhere, good music, some funny moments. I always like the way he wants to explore how can people find themselves and find the true love, and some of his quirks."}, {"id": 87, "text": "This movie is so awkward, every line is delivered so badly and I am overwhelmed by how weird this movie was and how stiff every actor and actress was. I cannot believe Woody Allen made this, I am in SHOCK!! and I felt anxious during the whole movie because absolutely every line, scene and movement was delivered SO BADLY. watch this movie for a laugh, because you will laugh. do not have any high expectations. !!!!!!!!!!!!!! aaaaaa!!!"}, {"id": 88, "text": "If you are looking for a movie with clearly defined goals and task based objectives - this movie is probably not for you.But if you want to embrace a process based experience this is just so great and timothée chalamet is incredible ! A rate it 10 of 10 within that category"}, {"id": 89, "text": "Fast, engaging, comic and creative. It came to give life to Allen's repertoire, after the little acclaimed: Ferris Wheel."}, {"id": 90, "text": "Loved this movie, watched 4 times in theater. The best parts of it are Timothee Chalamet and NY. Everything else is very good too. But this too just wowThis movie inspired me to watch other WA movies about NY. Was so good"}, {"id": 91, "text": "It was ok, but the lead actor was out of his depth. Some great lines. Just a shame Allen and Farrow are too old to play these roles... And other things. Just watched this film again. Timothee Chalamet is just awful, unbelievably bad - he speaks the lines with not a hint of any acting ability and he looks so uncomfortable around the female characters, like he'd never held hands with a woman let alone anything else, painful to watch. The film needed an older or more mature actor."}, {"id": 92, "text": "A real feel good movie, but with another twist. Not a typical cry scenario, so pleasantly watchable for adults also."}, {"id": 93, "text": "Most don't know this film is a fantasy. It's a homage to Soon-Yi and Manhattan. Woody doubles down on the #metoo people. Selena's character Chan is Soon-Yi. Chan is an Asian name. Even though Chan and Gatsby appear to be the same age the premise is Gatsby was dating her older sister when Chan was young. Chan (Soon-Yi) says she had a crush on Gatsby (Woody) when she was a kid. Mention is made of the film Gigi in Rainy Day. Mia Farrow briefly called Soon-Yi Gigi as a nickname. Soon-Yi's adoptive father Andre Previn was musical director on Gigi. Rainy Day in NY isn't about today's youth. It's about what it would have been like for Woody and Soon-Yi without all the drama."}, {"id": 94, "text": "I hadn't seen any trailers or posters for this movie, until one of my friends suggested we go see It. So to be completely honest I went Into this film with no expectations or any sort of hype whatsoever.As the title of my review suggests,I found this film quite unique. That Is mainly because It takes a relatively basic and generic plot and adds elements that you wouldn't usually associate with the whole genre. A part of the film that especially stuck out to me was the dialogue. It reminded a lot of old noir films(which was the whole goal of the movie)"}, {"id": 95, "text": "Weak, boring and tiring. The final couple in the movie have no chemistry at all. Very weak movie."}, {"id": 96, "text": "New York is always a good stage for Woody's movies and Chamalet gives a boost to the screen play that is perfectly shaped around him. Nice movie to enjoy especially in the winter season."}, {"id": 97, "text": "I don't know how on earth someone can rate it like 9 or 10. what's the point of this movie? Stupid story, average acting, and most of the things doesn't make sense. Skip it at all cost."}, {"id": 98, "text": "This is a lovely witty movie. Woody Allen surpassed himself even one more time. IMHO his movies are better when he is not acting. Not any dull moment. Lots of witty remarks that make you pause and rewind several times."}, {"id": 99, "text": "You may or may not like him, but his movies are entertaining, they are not whizz bang, or shocking, but they are intelligent. The story is interesting, the acting good, he picks his actors pretty well. I will always give a Woody Allen movie a chance, not go by reviews."}, {"id": 100, "text": "The movie goes at a pace with all dialogues and transitions happening in a well organized manner. The rain, the characters and the dialogues are all so captivating.According to my rating strategy: Story:1.5/2 (Awesome), Actors:1.5/2 (Some great performances), Viewer:2/2 (Loved it!!!), Task Fulfillment:1/1, Wow Factor:0/1, Directing, Soundtrack and Cinematography:2/2 (Awesome)"}, {"id": 101, "text": "The movie is entertaining and the roles are well played, but Woody Allen could do better job.I recommend but don't have too high expectations."}, {"id": 102, "text": "Something about this movie feels unnatural to me. I guess that is normal with most romcoms. The script seems a little off and every conversation feels like a skit from an outdated acting class. Some of the language seems a little childish too which makes it unnatural as well. I loved the piano music in it though. It gives a unique and peaceful touch to it which gives off a cozy feeling. Anyways, wasn't the best movie but I give it a 6 based on the music and Timmy being so adorable."}, {"id": 103, "text": "Woody Allen is not between my favourite directors and this movie isn't better neither worst than how I expected. Some dialogues are amazing, although I lost several parts because I watched the movie in english without subtitles, others are too obvious. I was hoping in a different end, maybe unexpected. I liked the protagonist and the city of New York, but I would have liked to see more about it, its atmosphere and energy. Here the focus is always on the characters, although not all of them are really interesting. It is a nice comedy, nothing more."}, {"id": 104, "text": "Great movie about life. Woody's movies are all so lively and about timeless issues, like loving someone else, romance, sex, etc. If you like Woody you'll like this"}, {"id": 105, "text": "A movie that shlould not be seeing as an intellectual and deep psicological treaty but as a simple and charismatic comedy that makes you end with an smile."}, {"id": 106, "text": "I liked the feel and the pace of the movie. Should be watched on a rainy Sunday afternoon.It's full of situations that would only happen in a movie with conversations that only happen in movies. At the moment I seem to enjoy Woody's every other movie and I enjoyed this one."}, {"id": 107, "text": "It is nothing I stop and think about but it's nice music and pretty"}, {"id": 108, "text": "It's the Maestro's back to the grassroots. And this is what we love him for! I don't understand why this movie was censored, unless I just watched a heavily edited version of it... Like other reviewers said (sadly, in a negative way) there is nothing new here. It's what Mr. Allen has been taking the at all his life, human stupidity and duplicity! The weak link here is not Selina, she was edible in all her takes, but the male lead! Weak! This Timoth... what's his name, does not have the juice. This was a part written for Mr. Allen's boy, Jesse Eisenberg. All alomg the movie I imagined how Eisenberg would have played this or that scene... Bringing a punch to it and spicing it up with the good'oll Woody Allen spastic-paranoia! He would have killed, given the material at hand! For the life of me I will not understand why this part wasn't given to him. This is the only reason it's getting a niner and not a tenner from me. Otherwise, beautiful directing, as expected, solid acting from all cast (appart from the male protagonist, like I said) and the funniest Woody Allen rides you've had in a long time!"}, {"id": 109, "text": "Ok yes is woody allen, is a very specific type of his movies. But come on - even Woody Allen needs to be evolved. This guy give us the same movie again and again for years! He should have been bored till now! I found the story quirky, unrealistic (people meeting up random in New York all the time) and the rainy thing I found it unnecessary."}, {"id": 110, "text": "An enjoyable movie by Woody Allen. Rainy Manhattan and young characters going from one place to another, all sorts of things happening. Art museums, piano bars and parties. The tormented guy, the pretty girl... Ending was kind of predictable but the journey to it was alright. Gatsby, Ashleigh and Shannon are a good cast to this movie."}, {"id": 111, "text": "Having a yearly Allen film isn't the worst thing in the world. This is one his mid range films that is serviceable and has a vast list of characters. I enjoyed it and loved the NYC atmosphere. The story wasn't the best and the lead actor struggles a little and feels miscast. The film is flawed, but it's still better when compared to other less distinguished filmmakers. Allen is a gifted filmmaker and I thought this was okay."}, {"id": 112, "text": "Apart from Timothée Chalamet - who slyly denounced having participated in Woody Allen's movie to improve his Oscar odds - occasionally doing too much of an Allen impersonation, especially when he narrates the events, the story bubbles on effortlessly and more often than not also delightfully. A whole bunch of actors make passing appearances, nailing a scene and never seen again, but that plays well to the story that essentially is just a chaotic, fateful day in New York."}, {"id": 113, "text": "A rainy day in New York was woody Allen's new movie, and I watched it with interest. Even though many people commented that he couldn't jump out of his established frame, that was his style. All the stories in the movie seem so natural, without any drama, but they are full of well-arranged coincidences and expected changes. It is just like a story happened around you and me. There is a trace of sweetness at the end, a trace of sudden realization and a trace of regret. The world is full of prejudice, both in relationships and in everyday relationships. Because you grew up in a different environment, you saw things differently, and every day you have to get stuck in a system of being judged by others. But so what? Many people try to be recognized because they care too much about the eyes of others, but when they put on a coat that does not belong to them, they will always be seen through at a glance because they are out of place in the crowd.A rainy day in New York was woody Allen's new movie, and I watched it with interest. Even though many people commented that he couldn't jump out of his established frame, that was his style. All the stories in the movie seem so natural, without any drama, but they are full of well-arranged coincidences and expected changes. It is just like a story happened around you and me. There is a trace of sweetness at the end, a trace of sudden realization and a trace of regret. The world is full of prejudice, both in relationships and in everyday relationships. Because you grew up in a different environment, you saw things differently, and every day you have to get stuck in a system of being judged by others. But so what? Many people try to be recognized because they care too much about the eyes of others, but when they put on a coat that does not belong to them, they will always be seen through at a glance because they are out of place in the crowd."}, {"id": 114, "text": "This was like a walk in Allen's Manhattan in his imagination. I like the movie. It was naive, relax and easy to watch. There ware lots criticism under line no surprises."}, {"id": 115, "text": "Only two consecutive rainy days are needed to reshape a relationship. The light and lazy Bourgeois sentiment is nothing more relaxing than Woody Allen's comedy. Some people like to hear crickets singing, some people like to smell the car exhaust, as a person who came back from New York two weeks ago-I like the rain in New York."}, {"id": 116, "text": "Woody Allen is indeed a good storyteller. Whether you like his movie or not depends a lot on if you like the story he is trying to tell."}, {"id": 117, "text": "The movie is good. You could say it's more of a sophisticated comedy. I believe Timothee Chalamet is a great actor but there was a connection issue with the dialogue and his line delivery, it made it unnatural. The movie was unrealistic for sure but i feel like the story was okay. It's a movie with no consequences you could say. Selena was very awkward and there was no chemistry between her and Timothee at all. They could have picked a better actress. The movie is still worth watching in my opinion unless you don't like unrealistic rom-coms. But really when are rom coms realistic anyways?"}, {"id": 118, "text": "If i have to describe this movie in a few words that wold be Not Good Enough It has some nice parts that entertain you but it's somehow boring because of the story-line which follows literally nothing. BUT the 3 main cast Timothe Chalamet, Elle Fanning and Selena Gomez all put great performances which make you watch them till the end and it's the best part of the movie for me (I'M A HUGE FAN OF THEM)"}, {"id": 119, "text": "In the love between Gatsby and Ashley, they belong to people who cannot be shared. Just as Gatsby cannot understand why someone worships Francisco Vega, Gatsby's so-called romance is not in Ashley's eyes. Is another trouble.All these shortcomings can only become advantages in the real soul mate. People with umbrellas are not as passionate as those who love the rain like you."}, {"id": 120, "text": "The movie starts off promising but then about 35 minutes into it things start to go off the rails -- and not in a good way. The film becomes way too talkie and boring with characters you can't relate to or care about in the slightest.The main young start tries to pretend to be Allen but doesnt succeed.By about an hour into this I was bored silly.I used to be a rabid fan of Allen. Then somewhere along the line his films became redundant and irrelevant."}, {"id": 121, "text": "Mr Chalamet returned his paycheck ´cos of whatever, and it was poetic justice 'cos his character is one of the most uninspiring in film history. Truly looked like a pound-shop Woody Allen, no vulnerability or lovable dodgy traits, + the other character he apparently fell for (was it Selena something? and has anyone got her agent's number?) had less sex-appeal or screen magnetism in the scenes with him than a day-old dog poo burnt by the sun. Nevertheless Elle Fanning was actually quite good, I mark it a 4 'cos of her, I always watch a film with Ms Elle on it with intrigue. The rest of the cast, like a bunch of mates on a day out that improvised the scenes, perhaps that's the reason of that kiss mock scene. Anyway, Woody, do something good or retire peacefully, it wasn't fair the Farrows-induced crucifixion he has suffered, but honestly, the man who did Annie Hall shouldn't waste his precious time doing this crap."}, {"id": 122, "text": "The two main characters attitudes and script is a new height of disgusting.First of all, they walk and talk like gods but playing it down. Second they cover up obvious cunning narcissism &amp; disapointment with a soft hypnotic voice. Third is a daylong practiced smile to appear human.They are deep villains, and trying to force the viewer to sympathise with anything they go through breaks the movie."}, {"id": 123, "text": "Ellie fannning is one of dumbest actress I've ever seen."}, {"id": 124, "text": "Within 5 minutes the terrible and phoney performance of the young actors ruins a lot. The obvious acting and pretending is embarrassing to watch. It feels like a twelve year old tries very hard to be like Woody Allen but just doesn't because he can't. The dialogue just doesn't seem natural but played. The girlfriend is overacting to an extreme. He gets better as the film (it looks like video actually which is not a good look) progresses but never becomes really relaxed. The story is good but not great either, Law plays well, Schreiber too. Gomez is very natural and professional. Rebecca Hall should have been edited out after her horrible comments about the director."}, {"id": 125, "text": "I've been Woody ALLEN's biggest fan since 1972. I believe he is the greatest in the 'film business'. I've seen all of his work, repeatedly. But this? Why, Mr. Allen? Why would you pick these two totally untalented people? If it is just because you need to get younger generation to the theater, then the only thing I can say is: So sad.I just wish Mr. Allen all the best. I love his work, all of them, except this one and that is only because of the very poor choice of the main characters.Looking forward to better future."}, {"id": 126, "text": "A Woody Allen film is always welcome and this more so due to the delay. Yes, it repeats several ideas from earlier films, but the setting among big Hollywood players all falling for the same dumb blonde is enjoyable. The main actor seems a bit subdued and the ending rushed. Needed a couple more scenes with the other girl."}, {"id": 127, "text": "This movie is truly boring. I was indeed expecting a bit boring rom com, but this is very very boring with no soul no plots no twists just boring truthfully. I really do not recommend watching it."}, {"id": 128, "text": "A rainy day in New York is great, I don't watch much romance but because it's a Woody Allen movie I had to see it and he handed me everything I wanted. Timothée Chalamet (Gatsby Welles) is perfect again, only proving that he is one of the best of his generation. The sequential planes used by Allen are very involved along with the vivid but sober colors. My problem with the movie is the bow of the Elle Fanning (Ashleigh Enright) character which starts well but then becomes tiresome and ends up copying the bow of another character from Allen in To Rome with Love. A very good movie to watch on a rainy afternoon, whether in family, with a person you like or even alone, as was my case. 7/10"}, {"id": 129, "text": "I really wanted to enjoy this. I did. And Chalamet, too. He was great in Call Me By My Name. But his acting in this was incredibly flat. Jude Law, Elie Fanning...everyone, but him felt real. Chalamet's character, acting were just simply...boring...as if he were just reading lines for an audition, and failed. The story felt contrived. A humorless and predictable big fat zero. The ending was just stupid."}, {"id": 130, "text": "The kind of movie i would like to watch with my girlfriend /wife. Showcase of 50 % of Human emotion's Who are in love. To know who really loves you and faithful to you.hell even tells us how pretentious and shallow a person can be. Even the mother of the protagonist and how she wants her son to be exactly like her. Its not that There is nothing wrong in it but truth be told the whole world is like this and worst part is that it is now becoming of our DNA. But i liked the movie."}, {"id": 131, "text": "Acting: 5 Story: 5 Production values: 7 Suspence - thriller level: 3 Action: none... Romance level: 6 Comedy elements: 6 Overall: 5"}, {"id": 132, "text": "It's white, rich, hetero, it plays with stereotypes of dumb girls, it compliments the alpha rich and clever male protagonist... it's bland in its storytelling and reeks, in its numerous XX century social cliches. It's a parade of old-timer elitism and sexism. Skip it."}, {"id": 133, "text": "I am a lifelong fan of Allen's work so I decided to give this movie a chance despite the bad reviews. I should have listened! This film is without a doubt the worst film I have ever seen! Even the character's names are unbelievable. I don't know how Allen managed to direct these wonderful actors to give such hideous performances. The main character, Gatsby, is a 20 year old college student, who speaks like a character out of a 1950's Turner Classic film. At 84, Woody couldn't play the main character himself, so he dressed Gatsby in his signature tweed jacket, affects him with a mumbling Allenesque speech pattern, and completes the transformation by adding an eighty year old's posture to the character's twenty something's frame. Jude Law's character's wife is cheating on him with a man whose name is out of a 1930's vaudeville act. In the scene where he catches her, he reacts like a character in an old Marx brothers' film. All the male characters are a version of Woody, and they have been directed to deliver their lines as if Woody himself is speaking them. Only Liev Schreiber is spared the Allen schtick but he is given so little to work with that his performance is lost in the God awful shuffle. The performances are wooden at best, cringe worthy at their worst. The cultural references coming out of the mouths of college age kids ( supposedly in today's timeline) belong to the eighty-four year old Allen's era and the talented Elle Fanning is just hard to watch. The film is misogynistic , and the plot is almost non existent. It was difficult to sit through to the end. If this is the best Allen has to offer, Woody, it's time to call it a day. Many actors don't like to watch their performances once a movie is finished; in this case, probably a good idea."}, {"id": 134, "text": "I really love Woody Allen Movies but this is a major disappointment. The movie is not only most boring but childish and stereotype. Stopped watching halfway through."}, {"id": 135, "text": "Whilst I'm pleased vm I watched this, the first hour is terribly slow and the whole movie is predictable. The soundtrack and acting are good and some great camera work but this just doesn't make up for the lazy screenplay and unexciting characters. Only for hardcore fans! Woody really can do better!"}, {"id": 136, "text": "The film was light and fun to watch but the script is very weak and the lack of depth of the characters, especially Selena Gomez... I'll never watch this movie again."}, {"id": 137, "text": "While there are some nice one-liners, notably delivered by Elle Fanning- a promising comedy talent, the plot is a bit thin. But maybe who cares, right? It's Woody dialogue, with Woody colour palette, and Woody in NYC... Chalomet in the Woody persona holds up his lead well enough, with a bit of nice banter between him and Selina Gomez. And what is it with Woody and Chateau Mayney?? Is this his favourite vineyard, is he on a commission for getting it into dialogue (here, and in Whatever Works). Whatever works for him too. Glad he's still doing his thing and hope he continues for some years to come!"}, {"id": 138, "text": "I used to love Woody Allen movies from the 70s and 80s, but seeing the same kind of dialogue repeating itself in all the movies made ever after is just simply tiresome. Also, with the unpleasant knowledge of Allens personal life, the portrait of the artist seems anything but charming and I can frankly not understand why anyone still wants to work with the man. Let alone great actors such as Timothee Chalamet and Jude Law. Further on, to witness Chalamet and Fanning's mimicing a young Woody Allen and Diane Keaton is, although skillfully performed, totally unbearable. I had to turn the movie off halfways through the film. Please retire mr Allen!"}, {"id": 139, "text": "Well this is going to be a review from somebody that is not a big fan of Woody Allen, quite the opposite I would say. But for once I did enjoy one of his movies. A Rainy Day In New York is a simple story, easy to follow, but with a touch of subtle humor, the kind of simple phrases that put a smile on your face. The dialogues are well writen and are one of the reasons this movie is enjoyable to watch. And the acting of Elle Fanning, she's by far the best actress/character of this movie. Most of the scenes where I had a smile on my face were scenes with her. Almost the entire cast is well chosen though. To me probably the best one I watched from Woody Allen, but I didn't watch them all so it's difficult to fully compare."}, {"id": 140, "text": "For those who are watching it because you are a woody allen fan, you wont be disappointed. It has everything trademark Woody Allen in the film(Other than himself), Just a new set of faces. Just like many other films nothing much happens and you are just stuck in New york with in the character's head space. Over time Im quite sure Im going mix this film up with many of his other films."}, {"id": 141, "text": "Elle Fanning's overacting was just awful and very unnatural, overall none of the actors can boast they did their best. The end of the movie was so weak, I didn't expect that..."}, {"id": 142, "text": "Cute, beautiful photography, a love letter for New York City...but there is no plot, no dialogues or any idea, looks like an improvisation film, classic comedy of misunderstandings without magic..."}, {"id": 143, "text": "This is my first Woody Allen film and I'm just astounded at how badly this film made me cringe. In my opinion, the writing was atrocious and none of the characters were interesting and likeable much. The cast was pretty decent but I think the issue is with the writing and the plot. There was little substance to the movie and while Chalamet and Fanning held their own, the pretty visuals weren't enough to keep me invested in the movie."}, {"id": 144, "text": "The film had tried to be sweet and romantic, but has become a dull turd with a lot of contrived coincidence. The snotty-sleepy course of events is supported by the periodic rain and the image of the main character Gatsby. Foolishness and inanity of Ashleigh should have been brought fun and amusement, but didn't work either. The only character with balls is Chan (Selena Gomez), who had brought a little piece of hope to the film, but all in all it disappeared as well."}, {"id": 145, "text": "Honestly The only reason I am reviewing this movie is to protect every one of you who wants to see it. Stupid script and moderates to bad interpretations. I sincerely wonder why this tragic film was shot... don't waste your time on this movie!!"}, {"id": 146, "text": "There is no reason to watch this movie It's boring No story No drama No comedy No action No romance Nothing!!!! Don't watch"}, {"id": 147, "text": "Liev Schreiber acting class makes him deliver the few lines in this otherwise disastrous and cartoonish script. They are the only ones I could enjoy the whole time. The rest of the movie sounds as if Woody HIMSELF is imitating one of the numerous bad clones his quality work quite rightfully generated in the 60's and 70's."}, {"id": 148, "text": "From the opening scene the movie lacks a clear direction and stable dialogue. Most conversations feel forced and awkward, they provide little to forward the plot and provide an abundance of useless information. The only thing that makes this movie not 1 Star is the music slaps."}, {"id": 149, "text": "A nonsense movie. Bored as ... what could be interesting gets annoying and boring in all the aapects of the relation."}, {"id": 150, "text": "This was embarrassing to watch, at least the little that I made it through before turning it off. It was embarrassing and I was watching it alone during quarantine, a time when my standards drop even lower than normal, yet I was still insulted by this mess. It felt like it was made by Woody Allen's over-privileged step-son who just got out of rehab and then he had a friend proof-read it and look up a few brainy-sounding quotes on Wikipedia.I just wrote this review to remind myself not to try and watch this again when I've completely forgotten about it in a month. It's very forgettable."}, {"id": 151, "text": "It's hard to imagine you could go wrong on a date night choosing a Woody Allen movie about the pursuit of young love, set to the backdrop of a rainy NYC, but it's a dud. Woody seems to have lost his ability to write an original scene, using every cliche in the book, which could at least still have entertainment value had it not been recycled so haphazardly. Combine that with shallow acting from leads that were in over their heads and hardly relatable. Timothee Chalomet and Selena Gomez fit their roles like toddlers trying on their parents shoes. This felt like Saved by the Bell trying to be Catcher in the Rye. I loved Midnight in Paris but this film was just good enough to make it all the way through without turning off."}, {"id": 152, "text": "Chalk this one up to another woody Allen turd... It claims to be a comedy yet there was no comedy in the movie. Oh yeah this is a woody Allen movie so that answers everything. I got talked in to watching this and what a mistake. Boring and maybe one little chuckle but that was it. Boring and slow is an understatement. Put it with all the other woody Allen movies that dont amount to anything. This in a nutshell is nothing more than a warm moist turd. Flush..."}, {"id": 153, "text": "The acting, especially from Timothée Chalamet, is mediocre. The dialogues are pretentious that turn out funny. The light and editing, lacking. Still, it is a movie you can sit through and enjoy, like when you have nothing else to do on a rainy day."}, {"id": 154, "text": "If you've seen a Woody Allen movie, then you've seen this one since 'A Rainy Day in New York' plays closely like self-parody of Allen's film tropes. The obvious acting and pretending performance of the young actors is embarrassing to watch: Timothée Chalamet does a weird impression of a young, neurotic Allen; Elle Fanning gives a truly horrible imitation of a 20-something Diane Keaton, and Selena Gomez's acting is... pretty decent. While the cinematography is warm, bright, and full of colours, 'A Rainy Day in New York' fumbles to reach to the point of clarity and fails to impress."}, {"id": 155, "text": "Guys, I love Selena with all my heart and she was so good in this movie, but this is probably the most boring movie I've ever seen in my life. I almost fell asleep while I watched it. And this Timothy guy is just.. no. Please, just no."}, {"id": 156, "text": "Odd unnatural dialogue. As written by someone who is disconnected from social reality. The impressive cast do a good job making it bearable. But their best efforts couldn't overcome poor writing."}, {"id": 157, "text": "I was excited to watch a movie with such an awesome cast, and I always enjoy movies set in NYC, but unfortunately, this was pretty boring. I really liked the atmosphere of the movie, I think it's really cool when New York's more laid-back, friendly side is shown with the mellow piano in the background instead of the super-busy metropolis cliché, but unfortunately, this was among the very few things I enjoyed. Elle Fanning's character was pretty unlikable, but it was probably intentional and her acting was top-notch, I also enjoyed Selena's character, she reminded me a lot of Alex Russo from Wizards of Waverly Place, the snarkiness suited her really well. Overall though, this movie is unfortunately very forgettable and boring. It's nice to have it play in the background and sometimes look at the screen for Selena's scenes, but I was expecting a lot more."}, {"id": 158, "text": "The character played by Elle Fanning ruins the whole story and only irritates watching it.The story looks as if it was inspired by a book by J.D. Salinger The catcher in the rye. That's good but not in this movie."}, {"id": 159, "text": "Selena Gomez is the only good thing in this movie. Bad script and what the hell is Elle Fanning in this movie?"}, {"id": 160, "text": "I enjoyed all the scenes without Ashleigh. She is annoying and way too intrusive. Even though i don't like Ashleigh i think Timothée's acting is very good. In the end it's a great movie but it would be better without Ashleigh in it."}, {"id": 161, "text": "A Rainy Day In New York 2020 12 Director: Woody Allen Starring: Timothee Chalamet, Elle Fanning, Jude Law, Selena Gomez, Liev Schreiber etcOverall rating 68/100A rainy day in New York Is about a young couple who go by the names Gatsby (Timothee Chalamet) and Ashleigh (Elle Fanning) who travel to New York for a romantic getaway, but as they both meet different people, they end up growing apart. A rainy day in New York was very charming and had many great qualities to it but was held back by it's character work and issues within its plot, let's talk about this more in detail.First of all, I loved the performances and characters, use of narration and dialogue. The performance in this film were great, Elle Fanning had a charm to her acting, and her character with her innocence and Naivety was likeable in most parts, but the best performance definitely has to be from Timothee Chalamet, who further proves that he can play any role well, his performance was likeable, charming and passionate, to the point where you couldn't help but really like his character and his progression of finding what he wants to do with his life will connect with a lot of people. The narration used was also excellent, it really added layers to the character, making you learn about their pasts, but it also added humour and more of an easy connection to Gatsby as a character. The dialogue in general was also great, it was very witty and fast paced and was a key part in what made a lot of the characters very likeable. The cinematography was also excellent, with the scenery that New York has to offer you are almost guaranteed a visually stunning movie, and this was definitely the case here, the amount of fantastic set pieces and Mise en scene was excellent with key attention payed to the lighting and colour saturation which I loved.My next couple of positives would be the humour and charming tone. The film surprised me with it's amount of humour in places, there was so many different interactions which some worked and some didn't (which we will get onto in the next paragraph) with funny characters with a good running gag of someone with an ugly laugh. The film also had a very charming tone, when watching you couldn't help but have that warm fuzzy feeling inside that just made you smile at what you were watching, the characters and dialogue was a part of the charm, but also just how classic Hollywood it felt.However, my first few negatives would be that there was too many characters with a lack of development making it feel like two movies, the odd creative choices, and the lack of connection to the main relationship. There was for me way to many characters with a lack of development throughout the movie, this made the pacing and the script very inconsistent, also making the film lack a cohesive plot, and it also felt like two different movies, with Gatsby and Ashleigh having hardly any screen time together, so it was two different stories that weren't really connected well enough. I also didn't connect to the main relationship hardly at all. The script did a terrible job at making you connect with Gatsby and Ashleigh's relationship, whenever they were together which wasn't very often, they always seemed very distanced and not that interested in each other, I just thought it was odd that they moulded the whole film on a relationship that people couldn't connect with. They also made some very odd creative choices with Ashleigh as a character. Making her so easily controllable and her lack of thought in terms of the situations she got in and her lack of thought towards Gatsby, made it really difficult to connect with her character.My final two negatives would be the lack of plot and the odd ending for Ashleigh. The film really lacked a solid and developed plot, this wasn't the case with the characters which I will get onto, but the plot was really just multiple different meetings and scenarios and just lacked and complexity, I also thought the ending they chose for Ashleigh was odd and I wasn't particularly a fan of it, the fact that they almost had both her and Gatsby just meet and make up like nothing happened was not a good decision, they did something with Gatsby's character for the end which was good, but they just left Ashleigh without any form of satisfying ending or conclusion to her character arc.My final few positives would be the character background and development and the satisfying ending for Gatsby's character. The film did an excellent job at developing Gatsby as a character so this paragraph is dedicated just for him. The amount of background they went into explaining why he behaved how he did, and his relationship with his family was really well done and in depth, it made you understand his character a lot more and really made you connect to him. How they developed his character was also very well done, to see his personal journey of discovering what he wanted to do with his life was very satisfying and well done, you learned his passions and interests as the film went on, so when he finally decided it was well earned. The ending for his character was also very satisfying, him being with Selena Gomez's character and staying in New York was definitely a good decision by the creative team.Overall A Rainy Day In New York is a charming, and funny movie, that took you back to the classic Hollywood era, with fantastic character work. But is held back by it's lack of detail to it's plot and the lack of cohesiveness with the characters and how they were all connected."}, {"id": 162, "text": "Regardless of the drama around the film. It should be noted that Timothee Chalamet is solid and steals each scene!"}, {"id": 163, "text": "This is probably my lowest rated Woody Allen movie, and I think I've seen them all. I really felt this was a weak effort from one of my favorite directors. The screenplay was lacking, the acting was subpar, the only thing I truly enjoyed was the cinematography. This is an old man movie acted out by young people in a totally unrealistic manner and without the charm of some of his previous works. One final word for Elle Fanning which I thought was unbearable to watch in one of the worst female characters written by Woody. Very disappointing."}, {"id": 164, "text": "So I watched the trailer and was expecting a full Romance and passion Story. As soon as it started I got really bored but continued watching. What kept me going were those little parts which made me wonder what was going to happen next, but it is really a slow movie, and for me it wasn't romantic at all, I didn't feel that passion towards the characters. I expected A LOT MORE"}, {"id": 165, "text": "The movie was kind of combining the old American films with the modern romcom, however in a mocking manner. The story was interesting and kept you interested. It was like a series of unlikely events. The movie was trying to show the witty conversations of the so said 'elite' but failed at it quite many times. The conversations between Ashleigh and Gatsby show clearly their differences. Their conversations don't match and it's very bothering at many points.Over all very addicting to watch even though you can't really relate to the story or really like any of the characters."}, {"id": 166, "text": "I really gotta stop watching movies just cause Timmy Chalamino is in them.This movie tries to be something that it simply cannot be. Timmy looking cute, though."}, {"id": 167, "text": "PROS: ~The best element of the film is the city of New York. The city works as a live character that has an affection on the characters and pushes them to take desicions that will change their lives. The walks in the narrow streets of Manhattan and the various beautiful places give retro vibes to the movie. ~Timothee Chalamet gives a solid performance and portrays a neurotic young man struggling with his thoughts and love life. He makes his own rebellion and despises reach people although he is a part of them. He is actually a Woody Allen archetype and immitates his mannerisms from his earlier filmography. The interaction with his mother (Cherryl Jones shines here) and her revelation make him reconsider his opinion about her and see some things from a different perspective. ~Elle Fanning does a decent job as always. She is a naive young woman who must choose which part of her life is more significant, her romantic relationship or her future success. As expected she makes stupid mistakes due to her immaturity and her little experience about life. On the other hand, Selena Gomez is the most straightforward but relatable character of the film and her chemistry with Chalamet is fantastic. With her first appearance comes the rain which symbolizes the changing of many things. ~The rest of the cast does a respectable effort. Liev Shreiber, Jude Law and and Diego Luna represent intellectual and sophisticated people who hide their uncertainties and their personal problems and see Fanning's character as a their last recourse. ~The ending of the movie is standard but in a good way. The couple finally meets again but they have changed. Each has experienced some harsh realities and truths that have left them more down to earth and each one has made a life-changing decision. ~The piano notes create a nolstagia for the old New York and generally an aesthetic of an older era. The photography of Vittorio Storaro is impeccable and the kissing scene inside a car between Chalamet and Gomez as the raindrops start to fall on the car is magical.CONS ~The film lacks originality considering that its themes is a terittory that Allen has extensively covered before. Moreoever, despite the charisma of Elle Fanning, the end of her character is left in limbo. ~Although the dialogue is witty and sharp, it is kind of pretentious that these conversations come from young people. In other words, it's not how 21-year-old talk and behave in the modern world but how Woody Allen wishes they talked and behaved, something that makes the characters unrealistic. ~The movie chooses to focus only on rich people and as a result it seems that they live in their own bubble and their problems are overdramatized (personally I find it hard to relate to any of them, maybe it's just me)."}, {"id": 168, "text": "I never got what the appeal of a Woody Allen movie is but this one at least was quite easy to watch only for two reasons Timothée Chalamet and Elle Fanning. I think neither of them is capable of anything less but a good performance and most of the times they are great like they are here. Everything else is just the pattern of a Allen movie. New York, piano music, art, some good and some very bad dialog. If you like Chalamet and Fanning, watch it, otherwise skip it."}, {"id": 169, "text": "The only thing I liked of this movie was Selena Gomez. Her acting was decent. I think this is the worse Woody Allen movie ever. The main characters' demeanor never change. Boring. Don't waste your time."}, {"id": 170, "text": "I honestly have been watching mostly all series these days as movies have been a let down. I'm 51, yes I know who Woody Allen is and have heard his movies held in high regard. I don't care who did the movie( watched the trailer and it looked entertaining enough) had a pretty good ensemble but .. Where to start. I like Elle Fanning and Schrieber so what could be so bad? Well that lack of decent dialogue and basic story telling. Was there any? The only person I could stomach was the chap who played Gatsby. He is the only redeeming thing in this whole mess. None of it made sense it was a bunch of random interactions ( mine are more interesting irl) It wasn't awful but what was the story? Guy dates girl. They go to Manhattan she acts like an idiot and ( honestly who acts like that, let me stay with strangers and ignore my boyfriend) he acts in a film with the sister of a girl he thought was beautiful and looked like Grace kelly and then somehow leaves his girlfriend who was so great for a girl he spent a brief few hours with. Had he left gf for the escort it wouldn't have made the outcome any more entertaining, clever. I'm disappointed in Allen now and I think this is his first film I've seen in completion."}, {"id": 171, "text": "Im not a writing major .. I barely skated through high school. But ive seen a lot of movies. Also Woody Allens. Not everyone is someones rich niece or a wealthy nephew of some New York wealthy family. Or moved from the west because their family is so rich they haaaad to move to New York. The issues that are so stressful to these people make an average citizen wan't to barf.. Keep making movies about the rich Woody. I'll keep looking out for good ones"}, {"id": 172, "text": "There's a lot to like here and it's almost a top notch little quirky romantic comedy. There are just a couple of lines that are too anachronistic coming from the mouths of the characters and the fact that 2 characters are basically just versions of Woody Allen. Other than that, it's a breezy 90 minutes that an adult can watch and not feel insulted. Solid effort, B, B- ?"}, {"id": 173, "text": "It's 100% romantic but 0% comedy And same speech are waste of time but actually it's all lovely movie"}, {"id": 174, "text": "What it says about postmodernism is right, that it is very referential; not that anything is wrong with it. Protagonist's name, Gatsby catches the attention. A single name can suggest the whole social philosophy and Woody Allen uses one of the most popular characters of American literature to convey the theme. Later I also got why female protagonist is shown in excessive radiant yellow light; she might resemble Daisy. Nevertheless, movie fumbles to reach to the point of clarity and fails to impress."}, {"id": 175, "text": "The story itself is just nothing, a young bf n gf meet someone else, given the scenery is mostly rainy times. Even though it's quite obvious in the first 30 minutes, I keep watching til the end without fast forward. It's not fun fun kind and very romantic but just enjoy the kinda light movie. Easy, not overdramtic, piece of art to look at. Woody Allen's style ? Let me conclude later."}, {"id": 176, "text": "No surprise, talkative like most of his movies, NY at its best , and honestly watched it until the end for Tim Chalamet. The story is kind of stupid and H Fanning got on my nerves as a plain American brainless not sexy girl..... W Allen did better and worst ones, glad I was not in a theater as I fell asleep do a while . Deceptive but charming teenager movie, as even if you try to see behind, there is nothing much ."}, {"id": 177, "text": "Great movie and touching!!! Woody Allen figerprint is all over. Why not 8: predictible, lil bit to much predictible! Enjoy!"}, {"id": 178, "text": "Ok supposedly the characters have some depth soul but I feel like we're kinda stupid lmao I love timothée chalamet and he has done amazing this one ok I get it may be the character but he was kinda annoying along with Elle again maybe that's how the character are supposed to be, and history itself it's weird and 100% something that only happens in movies, love Selena character and I wanted to watch this movie since it was in the making but with all the drama it happen wasn't sure where or how to watch it"}, {"id": 179, "text": "Have you noticed in all Woody Allen movies; the actors all sound and act just like Woody Allen. He makes them sound nasally and talks with a slight stutter. The story is good and it's well acted, but I've noticed all the recent movies of his have this quality."}, {"id": 180, "text": "The script has not a real story, but that fact is almost a statement to show that a film can and may be dialogue-driven. When Tarantino was stupid enough to let every catchy dialogue slip out of his last film, Allen must have caught those lines and let his actors Rock and Roll with them.Ellen Fanning. Did I know her? No. Do I want to know her forever now? Yes! The two or three scenes where she has monologues are already legendary. And if she keeps her mouth shut, she still completely dominates the frame.NY... 'She' does not easily combine with melancholic, but Woody Allen is able to show and exploit that side of this city. Love it. No one else is so capable of visualizing the love you can have for this city.Allen does not often sink through the 'class' his dialogues already have, to really expose underlying emotions in a more raw way. A lot often remains wrapped in infectious and very erudite - Jewish - humor. But at the very end of this movie actress Cherry Jones has the opportunity to cause goosebumps on my arms in a short, gripping monologue that digs up those emotions. It is proof of the total control that Allen has over his profession over the years. Just like the entire movie. A control that shows itself in a total release of the material, as if this film was recorded in one take of pure improvisation.Great movie!"}, {"id": 181, "text": "Two rich 21 year olds and their mental dilemmas about being so rich, which 5 star hotel to stay in, do they want their family money? So designed that it makes you want a 90% marginal tax rate.Hard to tell if we are supposed to be sympathetic or despise them. Are they smart, pretentious, loyal, easy lays, rebels, conformists - in the end I just don't care, as I have no sympathy for either of them or the miscellaneous constellation of dull bulbs who are supposed to illuminate them.Humor perhaps 4/10. Dialogue is badly written, weak jokes, faux depth.Watched WA's The Front yesterday, which was equally leftist leaning, but was actually fun and interesting.This movie is a failure. Save your time."}, {"id": 182, "text": "This is a fantastic movie. Critics can have their opinions, but they can't change the fact that I not only enjoyed this more than any other late Woody Allen film, but I was deeply touched by it. It reached into deep places. I laughed at it more than other films.The laughter and the delight the film evoked in me can't be mistaken. That's how it affected me. What better criterion can we have for a film? If the same film touches some people and not others, is it more likely due to a limitation of the film or the people AKA critics?Other Allen films are funny. Other films dissect our collective hypocrisy, self-centeredness, and inhumanity. This one stands out because it sounds notes of hope and love, the importance of ephemeral moments of beauty accessible to everyone willing to pay theprice for them.It's about a young man searching for his way in life, what life has to offer that's has genuine value. It rings the bell of the different things he loves, that lift him above the daily grind. THe movie manages to invoked moments of these magic spells for us, too.It's also about the foibles of film makers. Funny, and pitiful. Allen is well qualified to draw those portraits.Particularly impressive is the charm and presence of Solena Gomez. Her character radiates warmth, honesty and aliveness, profound depth of feeling combined with social adroitness.Timothee Chalamet does a good job of presenting a character that captures the features of Woody Allen without being a parody or imitation. Allen invoked the feelings and came up with the words. It's inevitable that Gatsby will remind us of Woody Allen himself, as he is on screen. Chalamet gives us an original refreshing character.People who demand a brand new original plot line are ignoring literary history. Sec comedy has used the same plot twists from ancient Rome, through Shakespeare, down to the present. This does film have insights into the meaning of life not found in many films.P.S.As far as the rejection of the film on the grounds of the accusation against Woody Allen, this is just my opinion. I respect other opinions. This is an unproven allegation based on the memory of a child from many decades ago. It's known that such allegations can turn out to be untrue, for many reasons. As I understand it, three different official agencies investigated the claim. One of them, an expert in such allegations, exonerated Allen. The other two found no credible evidence. Do we want to be a society that destroys the career of a great American artist on the basis of a single, unproven, contested allegation? I don't think that is justice."}, {"id": 183, "text": "This is one of the best that Woody Allen has offered us in the last 15 years or so, on par with films such as Vicky Cristina Barcelona and Midnight in Paris. First of all, New York and Manhattan in particular have probably pictured more picturesque with those cosy shades of sepia and the moody rainy environment captured masterfully by Vittorio Storaro, one of the great cinematographers, a real living legend.This film would go down as one of the highlights in the career of the new promising actors and actresses such as Timothée Chalamet and Elle Fanning, also Jude Law, Liev Schreiber, Rebecca Hall and Diego Luna offer greatly amusing performances, while Selena Gomez provides good proof that she has a solid acting talent as she confronts Chalamet in a few funny instances.The story as a whole is one of Allen's typical themes, presenting a naive college girl dazzled by the film star society of the Big Apple and soon she betrays all love and loyalty to her young lover who desperately tries to reconnects to her on a rainy day in New York.Woody Allen, shows great nerve and style in directing, there's solid fast tempo that holds the story interesting and tight without a single dull moment. There are of course those greatly inspired one liners that add extra laughs and wit to the story. All in all, one of the finest films that Woody Allen has managed to offer in the last 10-15 years! And now, just one small note to the me too or whoever else tries to censor arts: You are the people's WORST nightmare.Only Fascists and Stalinists in the past, tried to censor or forbid arts and we all know very well how much hatred they gained just because of these actions. Well done me too activists, your similar hated actions have placed you in the most hated part of mankind. Great achievement!"}, {"id": 184, "text": "Woody Allen keeps showing why he is one of the best things to ever happen to cinema. Why we need him so much. without Allen, the cinema industry would have been a little boring. His films are unique and very powerful by meaning of beauty, art and emotion. A Rainy Day in New York is another perfect example of true art. The film stars with a young couple visiting New York for the weekend and end up in a rainy day full of excitements. The movie feels like another Allen love story from the start: the location of New York, the narrating, the differences between characters, how they fall in love against all chances, and the sweet ending that all viewers wish to have in their lives. When I first saw this film I immediately had a sense of nostalgia towards Manhattan and Annie Hall. All films perfectly connect to each other, not by plot but more in a sense of genre and dialogue. The dialogues in this film are just like in any other of Allen's films, catchy, humorous and with a lot of sense towards life. The cast is amazing: Timothèe Chalamet is wonderful, his character resembles a lot of Allen's performance in his other films. Basically it's the same character but different actor. Selena Gomez is adorable and shines in her role, Elle Fanning is humorous, the entire cast works so well with the genre of the film. Overall I am in love with this film, I enjoyed it so much and I recommend it to everyone, I think this is my new favorite Allen movie."}, {"id": 185, "text": "I cannot write a proper review yet because thanks to a shameful lynching campaign against Woody I was robbed last year of my yearly Woody Allen film (me and millions of fans around the world). So, I still have to wait until October for the film to be released in Spain. But I know that it will be amazing, so I give it a 10 already.I'm angry and furious at the stupidity and witch-hunt that goes on in the States and don't have words to express my anger and disappointment. How is it possible that Woody's art has suffered because of a shameful prefabricated accusation? Woody has worked with hundreds and hundreds of actresses in the past half century and nobody, NOBODY has ever complaint of his behavior. If you believe that prefabricated story made by 3 vengeful psychos you are either ignorant, stupid, antisemite, or just part of the lynch mob. It does not exist another single case of real abuse that presents only 1 accusation. For the ones who feel uncomfortable with the fact that Woody fell in love with Soon-Yi Previn, just have in mind that Woody and Soon-Yi love each other and are together for more than 26 years, have 2 wonderful daughters and don't care about what you, me or the psychos think about their love. Their relationship and their love is what triggers the ignorant people, not the shameful false accusation.I know that A Rainy Day in New York will be wonderful and magical, like every film that Woody makes, so I can already rate it with a 10. It has an excellent cast and one of the best cinematographers of today: Vittorio Storaro.Since Amazon loves to censure Woody Allen's fans and controls half the world I guess these words will not be published here. But just let me say that there are millions of fans who support, admire and love Woody Allen and who will go to the cinema to watch and enjoy this wonderful gem. Woody's the best director ever and the best writer ever. His films talk about love, death, dreams, art, passions, and desires, and are poetic, brilliant, real, magnificent, stunning and wonderful.We love you, Woody! Thanks for your Art. Your films make life better / Antonia Tejeda Barros, Madrid (Spain).Updated: I JUST SAW THE FILM! I had to wait until today (August 24th) to see the film. I was very lucky to be with my family in the Netherlands this month and this afternoon I went with my oldest daughter (she's 13 and loves Woody's films) to the national Dutch preview of A Rainy Day in New York at the Film Hallen (Hannie Dankbaarpassage 12, Amsterdam). We live in Madrid and in Spain the film will only arrive in October.I don't want to give ANY SPOILERS here, but I just will say: Wow, such a film: funny, poetic, beautiful, clever and so entertaining. We enjoyed it so much. Such a gem! Woody is so brilliant, Vittorio is the king of light, and the writing is so cool and funny. The only problem: the film felt too short! I wish it would have gone on for two more hours... (Woody should always make films that are over two hours long, one hour and a half simply feels too short!).I have to confess that I was very angry with Timothée Chalamet because of his cowardice and opportunism, but his performance in the film is very beautiful. Selena Gomez is also really good and Diego Luna is very funny. Elle Fanning is probably the weakest actress here (to play comedy isn't that easy after all) but it doesn't bother so much because her lines are hilarious. Cherry Jones' performance is absolutely spectacular. Liev Schreiber, Jude Law, Will Rogers and Kelly Rohrbach are also great but I wish they'd appear more.The music of A Rainy Day in New York is wonderful as in all Woody Allen films, you can feel the rain's perfume and there are plenty of quotes that will make you laugh and enjoy.No superheroes here, no bombs, no explosions, just real people with normal problems, like you and me. Woody's films make life better. Thank you for your art, Woody, and, please, keep on creating.10/10"}, {"id": 186, "text": "I've enjoyed so many Woody Allen movies that I keep going to see the new ones, even though I know that his output is mixed. I very much enjoyed *Midnight in Paris*, for example - and tonight felt that I was watching outtakes from it that were rejected with good reason.Basically, there is nothing new here. It seemed like a patchwork of previous WA movies, but never came close to reaching the heights of the best ones. The main characters seemed to be too young to be spouting lines the likes of which we are used to hearing from characters decades older.I felt downright sorry for Ms. Fanning. She was made to play an airhead, which she did well, but do we really want to see that in 2019? I should think many women would find her offensive.The male lead wasn't much better. He seemed very shallow.They were like pale copies - very pale copies - of the engaged couple in *Midnight in Paris*, but without an interesting third party such as that earlier movie had.The usual talk about the arts seemed very superficial, as if the characters were just reciting lines they had memorized but didn't understand.There were scenes that were fun to watch for the scenery. But the dialogue was too often uninteresting, and the plot, to the extent that it had one, of no interest to me."}, {"id": 187, "text": "It's true that Woody Allen is writing silly dialogue that's completely old-fashioned and way above the heads of any youngster in New York, and it's true that the story here is completely silly and motivations are way off. But it's somehow a charming way to spend a couple of hours. Elle Fanning is kooky and does her best to be a chip off the old Diane Keaton block. Timothee Chalamet is dreamy and solid but doesn't get enough clout. I'm not fond of the huddle of middle-aged film lotharios jumping all over Fanning, and I don't think Selena Gomez had enough sharp lines. However, it's another study from Allen of New York as a live character taking over the people in it and sweeping them along. Cherry Jones is extremely well-cast as the mother with a secret and Allen saves the best till last. I probably won't watch it again for a long time, not one of his best but not the worst either. It's a shame that Netflix have done what they did to Allen. Not just for him, but the hundreds of names that rolled past in the credits of all the cast and crew who worked so hard on this movie to have it junked in the US, who did nothing to deserve this. Thank god I live in Europe where art is respected, and we have the intelligence to separate the work from the artist. I look forward to the next one to come out."}, {"id": 188, "text": "Gatsby (what a great character name and played by Timothee Chalamet) is a student at Yardley College in upstate New York. Its a compromise between him and his parents, as Gatsby's main interests are card games and piano bars. Happily, Gatsby has a beautiful girlfriend, Ashleigh (Elle Fanning) who is a journalism student and writer for the college paper. Its Ashleigh's good fortune to snag an interview with a famous movie director, Pollard (Liev Schrieber) but must travel to Manhattan to meet this man. As this is Gatsby's home city, he is excited to come along and show her his favorite sights and the bar where they play the music he loves. So, off they go. After arrival, the two part, agreeing to meet for lunch after the Pollard meeting. But, things go off kilter. The director is in despair over the film he has just finished and, enchanted by Ashleigh's pretty face and winning ways, he insists she screen it with him. This will take hours and Gatsby gets the call she will be later than she expects. Annoying! Thus, Gatsby goes to visit his brother, who if about to be married. Horrors, this sibling tells Gatsby he can't go through with it, due to his fiancees screeching laugh. Having no advice, Gatsby then visits the set of an indie film being shot by an old friend where he runs into Chan (Selena Gomez) the younger sis of an old Gatsby girlfriend. She has agreed to be in the movie where she is to receive a passionate kiss in a convertible! All too soon, Gatsby gets persuaded to be in the movie and bestow this lip clencher. Ho ho ho. Although they trade barbs and insults, the kiss has rattled them both. As Ashleigh is still busy, Chan and Gatsby go visit a museum as rain is pouring. Wait, what's going on? Tihs enchanting film has all of Woody Allen's fabulous ingredients. The cast is great, with Chalamet shining brightly; all of the others, Fanning, Schieber, Jude Law, Rebecca Hall and the rest, do fine work, too. The sets are wonderful and the costumes snazzy. Most of all, the script is full of humor, pathos, and charm while the direction never falters. Yes, as stated many times, I am Allen's biggest fan living in Toledo, Ohio, which is nowhere at all. But, this film is superlative, matchless, everlasting and magical."}, {"id": 189, "text": "In my eyes, both characters were unlikable. The guy because he gave off this tortured old school artist vibe, even though he's not an artist he sure talks and broods like one. The girl seemed too naive and I really didn't like her look. The lines felt forced, there was a little comedy, not a lot of good comedy, a tiny bit of romance but I wouldn't say it's a romantic comedy. It made me exhale faster, nothing really laugh worthy if I watched it the second time. The romance is pretty much not there, I mean just putting a weird couple or almost cheating in a movie doesn't make it romance. Anyway, it's not a classic movie which makes people think it's artsy so they pretend to like it. A rainy day in New York is exactly that, a relatively boring day in New York but both people had interesting connections that were supposed to make it interesting. I think a day in my life would make a more interesting movie. This movie was like... imagine a regular movie with a freytag's pyramid, bulldoze and squish it so much you get it like a centimeter off the ground. Looking at the does this contain spoilers field... even if you write the whole story here it still wouldn't spoil anything."}, {"id": 190, "text": "Someone told me actors doing Shakespeare rarely have any idea what they're saying, and that now applies to Woody too. The young actors have no context, path, frame, experience to play any of this believably. The rain is fun to watch though. It brings this eery context with the global warming doom, which reflects the larger cultural apocalypse, making this film a clash of acting methods, generations, and then Woody's own script that no one seemed to have read since they've seen enough of his films to approximate it. Thing is this is new in the sense Woody has never been so subtle with his 'metaphor'. Apocalypse Woody. The Storaro lights feel both remarking on the artificial with spotlight, warmly inviting in the doom, and over Chalamet to the european canon, making it a parallel collaboration; too bad they have to open their mouths. The release history make it like fragments after the glass shattered following his crimes. Woody, AD. Imagine how much farther removed his work will seem in the future where it actually will feel like some bizarre take on the English language. His films branched off in a chain forming a parallel evolution to a different reality, like how you set the algorithm to simulate a thousand years... and 'Rainy Day' would pop out as the five thousandth Allen film. The rain though. I don't like Chalamet in all this rain. He is the picture of a rich kid so it is a very narrow path to win the audience already. He can work as some great archetype. A prince. A sculptor's subject. He doesn't work contemporary, or rather, vocal; and I see him struggling to make this grand and small at once, giving the film its contrast. The more he talks the more he breaks the spell. The girl with the 12 year old's face, well that's both of them, drag it deeper into the surreal. Is there some dilemma of love at play? But while the world is being flooded, that is not a break from the rain, it is an indulgence of scenery when they're anxious about all the wrong things. The mother's monologue there is more a spectacle of how her intellectual indulgence has destroyed the world. Ok Woody. I just argued he's in the ten greatest American directors, which reminds me of when I demanded my fam listen to Kanye's albums and a week later he did that famous White House meeting making a fool of all of us who vouched for him."}, {"id": 191, "text": "I normally indulge the senses with a good Woody flick. But this one failed me.Main male- boring, no vibe, no charisma, depressing every time he opened his mouth.Main female- playing the stupid role too hard. The blonde bimbo on too much coffee: irritating.They both are clearly acting and going through the motions too obviously. Selena is uneventful and added nothing. Jude was above this film. Must have needed some quick cash or have some time to kill.I found the story could have been written by a 15 year old. The skill, tone, and conversations don't seem to be a Woody- esque ability, but a try-hard under graduate version masquerading as him.I couldn't finish this one and it won't be going into the collection. Sorry Woody, bro! 3/10"}, {"id": 192, "text": "So, I am pleased to announce myself as a Woody Allen fan. I wasn't sure before, but if I look back at all the single movies I watched directed by him.. there wasn't a single one I didn't REALLY like. So, does this qualify me as a Woody Allen fan? I think so.Maybe his comedies are not for everyone but I love their simplicity, their cleverness, their atmosphere..This one has some GREAT performances of people I didn't even know and an excellent acting from Selena Gomez, who is, in my opinion, very underrated as an actress, because she's totally real and sincere (The Fundamentals of Caring gave an example as well).Timotheé is new (at least for me) and I have to say I was pleased to see him in the role of the protagonist and his chemistry with Gomez felt deep and meaningful.. Maybe, as a hopeless musician myself, it was really easy to relate to him as he struggles to find his own way in a sick world, with a big wonderful city such as New York to fulfill his dreams.Check this out. You will feel good at the end, and probably want to see it again, to experience the depth of the characters once again."}, {"id": 193, "text": "A Rainy Day in New York is a classic Woody Allen film: lots of dialogue and multiple intertwined characters with their own personal dilemmas-and, in the spotlight, a seemingly happy couple discovering that they don't have much in common. Gorgeous cinematography, sets and costumes. And a very well-narrated story in which the human condition prevails.Ashleigh (Elle Fanning) and Gatsby (Timothée Chalamet) are spending a weekend in Manhattan for a very special occasion: She (a journalism student) will interview one of the most famous directors in the movie industry. He will visit his parents and both will spend a romantic weekend with the excuse of a school assignment. But the bad weather in New York is a perfect metaphor for a weekend of encounters and disagreements.The cast is fascinating: Elle Fanning shines! Her naiveté and enthusiasm are a great mix to make her character so enjoyable to watch. Timothée Chalamet is on point, despite that this will not be one of his memorable roles in his filmography. Liev Shreiber plays his character in a way that ensures the audience wants to know more about him, but the script does not have a complete arc for him to deliver.Selena Gomez plays Chan, and I love her performance as one of Gatsby's friends from the past (her sister used to date Gatsby) who seems to have a different point of view. Diego Luna plays a famous actor-great to have a Latino represented in the story-and Jude Law is convincing as the famous director's assistant who is discovering an awful truth. All these great actors are absolutely well-directed under the classic, charming, genuine Woody Allen storytelling. The music, classic jazz, evokes the sounds of a very sophisticated Manhattan and underscores the charm and elegance. The movie industry and its complexities as well as the beautiful city of New York are characters in the story like in other Woody Allen films. The cinematography is one of the greatest achievements of this film: Vitorio Storaro is certainly a master of light, and the golden hour scenes make A Rainy Day in New York aesthetically stunning and kept me in awe throughout the movie.I give A Rainy Day in New York 4 out of 5 stars and recommend it for 13 to 18 (and adults, of course). Some themes won't be relevant for audiences under this age, and there's brief nudity, mild drug use and adult themes. A Rainy Day in New York opens in theaters and on demand on November 10, 2020.Reviewed by Zoe C., KIDS FIRST!"}, {"id": 194, "text": "In the age of super hero films I'm glad that there is still someone who is making films with witty dialog. Woody Allen should be praised for that. But in this film neither the dialog nor the story works.Hannah and Her Sisters works so well because Woody Allen understood these characters--how they talk and behave. He knew how to write for them.That was 1986. Now it's 2019.21-year-olds in 2019 don't say I need a drink, a cigarette and a Berlin ballad. No matter what their background that's not how they would talk.A Rainy Day in New York is filled with references that no one born in the late 1990s would have. Songs by Gershwin, Porter, Berlin. Films from the 1930s and 40s. And the name of the lead character, Gatsby Welles, is just a little too cute. All of these are Woody Allen references. The problem is trying to force these references on these characters. It doesn't work.Maybe this film is meant to be a fantasy. It's not how 21-year-olds talk and behave in the modern world. It's how Woody Allen wishes they talked and behaved.No one wants to see a film about people staring into their phones but the truth is that the two leading characters would have been texting each other every few minutes and wouldn't have gotten so completely separated from each other. I think it's clear that Woody Allen hates cell phones because they get in the way of his stories.I would have suggested two important changes to the film. Have it take place 25 years earlier--1994 instead of 2019, before everyone had their own phone--and make the characters in their mid-30s instead of their early 20s. With those two changes I think this would be remembered as one of Woody Allen's better films. As it stands he's created characters he doesn't know or understand and, unfortunately, it shows."}, {"id": 195, "text": "A Rainy Day in New York is Woody Allen at his charming and witty best, even though much about the film is slightly weird and problematic. For a start we have a supposedly contemporary comedy in which a cast of young, hip twenty-something actors deliver lines very clearly written by someone several generations older. So while you'd expect their cultural references to be Beyonce, Bieber and Gaga, Allen has them casually citing Grace Kelly, Gigi, Sky Masterson, Jane Greer and Robert Mitchum while dropping his bon mots. Timothee Chalamet's character at least has the cover of being fan of New York piano bars who feels most at home at the Cafe Carlyle and the Pierre. Still, when he sits at the piano and sings Everything Happens To Me - a moderately obscure song written in 1940 - it's still more than a little odd. The other problematic elements are the usual Woody Allen fixations. All three of the older male characters (played by Liev Shreiber, 54; Jude Law, 57 and Diego Luna, 40) attempt to seduce the nubile 21-year-old Ashleigh (who at one point is mistaken for 15). And both Elle Fanning and Selina Gomez are written and groomed as Lolita types in barely-there mini-skirts. That said, their characters are vivacious (Elle) and smart (Selina) and Allen coaxes wonderful performances from them. Chalamet is also charming, even if I never quite bought him as a somewhat cynical, semi-jaded inveterate gambler, and even though he doesn't always make Allen's witty observations sing as they really should. But there are standout performances by Jude Law and Cherry Jones. The entire movie is (yet another) love letter to New York. Almost every interior location (bars, hotels, apartments) is a visual feast, gloriously photographed. And, all in all, it's an enjoyably frothy confection of a movie, and a cut above most of Allen's late-career efforts."}, {"id": 196, "text": "I had never watched a Woody Allen film before. I was worried this one was going to be either boring or depressing, which is the vibe I always got from him (and now I'm rethinking) but I decided to watch it anyway for the two female protagonists and it was not the case at all.It's the type of movies that don't have a strong plot but instead appeal to the overall charm of each one of its acts, somewhat like Once Upon a Time in Hollywood style. When done poorly, this concept results in 90 minutes of just stuff happening, which is why I was a little reluctant to watch it, but this one keeps the viewer engaged in a very comfortably relaxing and entertaining way from beginning to end. Not anxious about what's going to happen next, wanting something specific to happen, rooting for one character or wanting a couple to end up together.. it just keeps you hooked up enjoying the moment. It advances at a gentle but constant pace, it never stalls, there's something interesting or meaningful happening at every minute.Woody Allen's films are sort of a niche so if you're a fan of his work then you'll probably watch it without reading these reviews first, but if you're worried this might not be your type of movie I highly recommend you give it a try. It will not blow you away but it will definitely keep you entertained throughout the entire length and will leave you with a really nice and warm feeling."}, {"id": 197, "text": "There is no one who shows the wonderful aspects of New York so magically as Woody. The well constructed movie has the fine things everyone loves about his movies - the wit and unexpected humor, the music and the relationships.Elle Fanning plays a naive sweet enthusiastic college girl doing an article for her paper going to NY to interview a director. A funny screwed up bunch she encounters along the way including a famous actor. Timothee Chalamet is The Central character her boy friend who wants to show her a good time in the city. He likes playing the piano and resents his pretentious social climbing parents. But he's got a surprise in store. The two get separated for the day and have a series of interesting encounters.Elle overacts a wee bit but she is right for the role. Tim does a decent Woody type character. Nice to see Selena Gomez acting again.Hope this isn't the last Woody Allen movie."}, {"id": 198, "text": "Honestly never seen her in anything where she wasn't - at the very least - simply wonderful.A comedy from a bygone era, yet a tale of romance, which is timeless. Now, before you roll your eyes back into your head, when I say timeless I mean Woody has basically made this film, I don't know, ten times already, but for me the message hits a little different and still resonates each and every time. And I just love the man's writing. I also watched a couple of Éric Rohmer's early works this year, and A Rainy Day in New York reminded me of them in a most pleasant way.And I probably had the most ideal viewing experience imaginable as well: a steady rain outside the theatre, the film shown in a rather small room, with a senior crowd (old ladies letting out hearty laughs left and right), me and my nice cup of green tea in one hand and a pretzel in the other.It truly was one cosy afternoon. I look forward to repeating it once it hits VOD.P.S. (on the behind the scenes stuff): I get why people wouldn't want to watch/support Woody's work. I myself am quite iffy about watching Polanski films. While I'd question the integrity of certain cast members, donating their income to charities is ultimately a good thing. So at least that shines through the stormy release of A Rainy Day."}, {"id": 199, "text": "How sharper than a serpent's tooth is a thankless child (King Lear). Woody writes and directs a charming homage to his beloved New York. He creates interestiing, quirky parts for these overrated actors. But even Woody with all his directing talent cannot draw compelling performances from the ingrates Chalamet and Hall who fell in lock step with the MeToo crowd to enhance their female-identified creds. What, so he can get a part in worst version of Little Women  ever made? And work with that overrated director Gerwig, another ingrate. Chalamet cannot act his way out of a paper bag. And Hall is so wooden, she's got splinters coming out of her pores. Yet I give this movie a 10/10 - for the amusing story, marvelous score featuring the incomparable Errol Garner, the sumptuous Manhattan cinematography and the exquisite sets. I agree with some of the others on this site that the Gatsby role was perfect for Jesse Eisenberg. Because of the me -too posse, we were not able to see this film in a theatre. This is just another black mark for my country as if we don't have enough. I feel fortunate to have obtained a DVD for my collection. I just hope that when Woody writes his next screenplay, he writes parts for the loyal, talented actors who have the courage to stand up for him, i.e. Alec Baldwin and Scarlet Johansen. I hope he shoots in Europe where he is respected. I am ashamed to say that New York, USA does not deserve to have Woody Allen films made here."}, {"id": 200, "text": "What a shame this wonderful and witty film written and directed by Woody Allen will likely never be released in the US.A young couple (Timothee Chalamet, Elle Fanning) attend a small college in Upstate New York. He's a New Yorker and she's from Tucson. They plan a romantic weekend in New York so he can show her the sights. But they get separated when she goes off to interview a famous filmmaker (Liev Schreiber). Both experience a series of misadventures in the rain.Slim premise but it allows for the main characters to learn some valuable lessons during their weekend NOT together. Chalamaet (fancifully named Gatsby Welles) goes to the planned meeting spots but she's never there. Eventually he meets up with a wisecracking young woman (Selena Gomez) and a prostitute whom he tries to pawn off as his girlfriend when he attends his mother's fancy party.During the interview for her college newspaper, Fanning reveals that she's quite naive and unworldly. When Schreiber offers her scoop (he hates his latest film), she bizarrely asks, Of what? She falls in with the filmmaker's crowd and ends up at a party where she meets a famous movie star (Diego Luna) and almost has an affair with him.The couple finally meets again but they have changed. Each has experienced some harsh realities and truths that have left them less starry-eyed. And each one has made a life-changing decision.Subtle film is loaded with funny retorts and one-liners. Chalamet even sings Everything Happens to Me.Also notable in the cast are Cherry Jones as Chalamet's surprising mother, Jude Law as a filmmaker, Ben Warheit as a malicious gossip, and Rebecca Hall as the unfaithful wife.Chalamet, Fanning, and Gomez are standouts as is the City of New York, beautifully photographed by Vittorio Storaro. And note the always excellent Santo Loquasto's gorgeous set designs."}, {"id": 201, "text": "Shelved in the stateside in the light of the escalation of Allen's decades-long sexual assault allegations, A RAINY DAY IN NEW YORK, his 48th feature film and a white-bread adolescent romance plays out chiefly in a one-day span, has no trouble in charming audience in the other side of the Atlantic.The template is an egregiously well-worn one even the protagonists are, age-wise, considerably rejuvenated to undergraduates, Chalamet plays Gatsby Welles, yes, his name alone is a dead giveaway that he has a very old soul, born with a silver spoon in his mouth, loving playing pianoforte in vintage bars, hanging around museums and anachronistically old-fashioned in the romantic front too, aka. Allen's own invariable alter ego, which is concisely recapitulated by his girlfriend Ashleigh Enright (Fanning) as quirky......reading my full review on my blog: cinema omnivore, thanks"}, {"id": 202, "text": "Most of the events and characters that coincide within this film inevitably make me believe that they could only occur in a Woody Allen film, along with its rich, witty, familiar and reminiscent of a past era dialogue, which can never be absent in a film of his. New York has never been shown with so much melancholy in an Allen offering before, and let me tell you it just feels ethereal, completing that sentiment with its wonderful and pleasant jazz soundtrack, which never fails to suit New York rightly so.Allen's dialogues are usually quite excellent, is where his talent lies, but do his performers' delivery do them justice? You can bet they do. Timothée Chalamet and Elle Fanning play their parts stupendously, they fit incredibly well in Allen's designed universe and filmic context. As do Liev Schreiber and Jude Law, who have great supporting roles, and I must not forget Selena Gomez, who is Fanning's counterpart in terms of how contrasting her roles are.Allen excels at telling stories that develop in the course of a day, a weekend, etc. He knows how to unravel events, incidents and whatnot in a way that it doesn't feel unrealistic, but somehow belong to his peculiar cinematic framework, and that's a marvelous achievement for a filmmaker, but it comes as no surprise, given that Allen has been an established trademark since the late 70s, and has been an unstopabble filmmaking machine ever since, with many hits and misses, but being his cinematic self all the way through, with small adaptations to current times, such as technological developments and new stars that have caught his infallible eye for acting talent.All in all, this is Woody Allen as always, but at the same time he comes in fresh dose of renewal, which is what keeps his many supporters interested in his vast filmography."}, {"id": 203, "text": "In the Yardley College, Gatsby Welles (Timothée Chalamet) learns that his girlfriend Ashleigh Enright (Elle Fanning) will travel to Manhattan to interview the cult director Roland Pollard (Liev Schreiber) for the college paper and he plans a romantic weekend with her. Gatsby is the son of a wealthy family in New York and Ashleigh is from Tucson and her father owns several banks. He has no attraction to study in Yardley but gambling and Ashleigh. When they arrive in Manhattan, Gatsby does not tell his parents that are planning a fancy party in the evening. Ashleigh meets Pollard and he invites her to a screening of his new film with his writer Ted Davidoff (Jude Law). Meanwhile Gatsby stumbles upon his friend, who is cinema student, and he accepts to participate in a kiss scene with Chan Tyrell (Selena Gomez), who is the younger sister of his former girlfriend. Along the rainy weekend in New York, Gatsby and Ashleigh have new experiences and discoveries.A Rainy Day in New York is an average romantic comedy by Woody Allen. The performances are great but the story is conventional and predictable. However it does not exist a bad Woody Allen film and it is worthwhile watching. My vote is six.Title (Brazil): Um Dia de Chuva em Nova York (A Rainy Day in New York)"}, {"id": 204, "text": "Thank You so much for existing, Mr. Woody Allen!!! You continue to be among the Very Greatest, most Original, most Iconoclastic (and Funniest) Filmmakers in the History of Cinema. We *LOVE* YOU.'A Rainy Day In New York' is such a depurated, elliptical, essentialistic, succinct, spare, lean, unadorned, gorgeous, funny, hilarious, emotional, poignant, true, pure, lovely, unforgettable, intelligent, moving, pathos-filled, clever, artful, skillful; impeccably written, shot, directed, acted and edited; wise, dexterous gem of a Film.It is also a Beautiful tribute to the single Best and Greatest City in the entire world: Manhattan.Congratulations!Once again; Thank You so Much for existing and for *EVERYTHING* you've given us!!!My hat will forever be off to you, Great Maestro.*LONG LIVE THE GREAT AND MAGNANIMOUS MR. WOODY ALLEN!!!*"}, {"id": 205, "text": "Well this was a pleasant surprise for me. Firstly that the film was actually finally released after all the foolish faux-controversy nonsense that delayed his 50th film being issued. The second surprise was that it is really rather a fun and likeable watch. (These days, long-term Woody fans, such as I, have become accustomed to regular dud films between good ones) So, here we have a director deep into his 80's attempting to make a film in his unique style but comprising of a cast of mainly famous young actors to presumable draw in as big an audience demographic as possible. I admire him for this, and he, for the most part, blends the ages well and draws good performances out of all but one notable cast member (more of that later) The story triggers off with a young guy called Gatsby (!)(Timothée Chalamet) we meet on campus who's girlfriend Ashleigh (Elle Fanning) works on the college arts magazine and is given the opportunity to interview a famous film director (!) but she will have to travel to New York City to do so. Gatsby decides to accompany her. The plot then involves him being unable to avoid his family who live in NY, the girlfriend being swept up into a chase and other shenanigan's when the film-maker has an artistic crisis and his producer's attempts to prevent him from hitting the bottle and perhaps carrying through his threat to not allow his new film to be released (!), and various other revelations, near infidelities, and hidden talents. This is all handled adroitly by someone who has written and directed 50 films and thus the coincidences galore and the almost ludicrous range of skills Gatsby possesses, we accept as a part of the fun, ...almost. The real treat in this film, however, is the performance of Selina Gomez (someone even I know is a young singer/actress) who is sensational as a younger sister of someone who Gatsby once dated. They bump into each other and she then drifts in and out of the plot. It is a real shame she did not get more to do because when she is on screen the film just takes off. She not only knows how to act and to act comedy, but she knows how to act in a Woody Allen film. With her first appearance comes the rain, and we welcome it. In contrast Timothée Chalamet has absolutely no idea how to do any of these things. He should be carrying this film and making a name for himself. Instead he is a rabbit in the headlights, frozen to stiffness by the challenge, and he never once brings his character to life. The opening long tracking shot of he and Fanning discussing the trip to NY is notable for the way Chalamet never reacts to anything she says but instead gives his next line as if he is talking to us, or, more probably, himself. There is a moment a little later where he meets a college pal who is busy shooting a scene for a short film project. This pal suggests he take a small role in the next scene to be filmed. Chalamet declares But I'm not an actor. Normally when this occurs in a film we, as the audience, note the dramatic irony of such a line. Sadly, though, in this instance there is no irony because he is not an actor, at least not in this film. He was so bad that I, on the one hand, felt sorry for him, but also I kind of suspected that Woody deliberately put in that line to expose the fact that he had soon realised that his hot young star was not capable of making this film as good as it could, and probably should have been. I recommend this film. Ignore the silly stuff that surrounds Woody and sit back and enjoy the fun. Do not expect a masterpiece, or great profound art, although he manages to slip in here and there a few quotes on life: The one that jumped out at me was 'Reality is for those who don't look for anything better'."}, {"id": 206, "text": "I love Woody Allen and have enjoyed many of his films (some of my top favourites include Love and Death, Crimes and Misdemeanors, Vicky Cristina Barcelona, Blue Jasmine, Match Point, Midnight in Paris...). This one, however, was a big disappointment. The cinematography is still stunning as always, but the acting is so bad. Any fan of Woody Allen would be able to tell that the main character in this film is supposed to be a typical Woody Allen in his old films: an anxious, pretentious, whiny little man who adores beautiful women. Timothée Chalamet didn't deliver any of that. I enjoyed his acting as an addict in Beautiful Boy, but in this film he fell flat on the floor. I guess either it was a miscast or Timothée didn't do enough study on his character as well as on Woody Allen's films, because normally he shouldn't be that bad. The acting of the two girls, Elle Fanning and Selena Gomez, was just horrid. Selena's acting made me roll my eyes to the back of my head (who the hell came up with the idea of casting Selena Gomez in a Woody Allen film ???????) and Elle's literally made me fall asleep. In short, although the film is not very long (only 1.5hrs), it felt like forever and I fell asleep before it even got near to the end."}, {"id": 207, "text": "Same old same old W.A. movie, just changed another group of younger actors, making it at least watchable. But Elle Fanning overacted like a bimbo, her acting never improved so far, facial expressions changed like a pre-programmed robot, non-stop. Selena Gomez was even worse, just delivered her dialog without any feeling at all. Meaty face was the opposite of Elle Fanning, no expression at all, just a masked woody face with fat and dead muscles, acted like a piece of log, no nothing. Timothée Chalamet was not bad, but he just tried too hard to look like W.A. in a younger version. Playing piano and suddenly started singing in somebody's New York luxurious apartment? To show off? Trying to impress the female that the wooden Selena Gomez played? That just looked weird and unnatural, man.The non-stop dialog was typical of W.A.'s formula, using dialog to push the whole movie forward. W.A. never learned how to make the actors to act normally, only asked them to blah, blah, and blah non-stop to develop the storyline. The actors in his movies were all like staging furniture, put in different properties trying to make the house-for-sale look better than a vacant one, the only difference is these furniture could talk non-stop but without any feeling or emotion. What we saw Elle Fanning did in this movie was even worse, she used her dialog to control her facial expressions, since the dialog was non-stop, so her expressions got to be synchronized with the dialog, overly exercised but without any true feeling at all.The bunch of the New York people acted in this movie didn't look like the realistic NewYorkers, but a bunch of W.A.'s outdated bunch, woody, lame, self-indulging, phony, yammering non-stop, their mouths control their behaviors and thoughts, self-claimed New York residents but all lived in a bubble, estranged to the real New York, walking around in the streets, parks, fancy apartments....but they never really paid any attention to anything but themselves. All of the characters in W.A.'s movies are all alike, talking non-stop, jabbering, yammering, blabbering, blah, blah, and blah uncontrollably. All of them in his movies were self-centered only paying attention to themselves, their mouths kept churning out the non-stop dialog to represent their feelings and thoughts. But this time, at least Timothée Chalamet, a skinny young man with a more watchable handsome face, a young man with acceptable outlook, things around him or he himself might have encountered, would at least have happened to him and him alone, unlike what W.A. played by himself in his own production and his own directing, an extremely plain non-describable weirdo with thick lens on his nose bridge, receding hairs, stoop, fragile body and limbs....he forced himself to be a Romeo, an unique stand out outstanding attractive to women larger-than-life stud....but actually, men like his kind were doomed to be a loner, no social life, no woman would ever fall for him, fat chance. Yet in his old movies, he was the center of the universe, all things related to him and happened around him. But I have to say, guys he played in his movies, NOTHING would be possibly happen to those characters, not even one living sole would have paid attention to his existence. Guys like he played, things that would be possibly happened to those roles were because he's the producer, the screenplays writer, the director and he made himself as the leading male Alpha. That's why every time when I watched his movie, I always couldn't control myself to jump out of my seat and questioned myself: A guy like him played in this movie would have a woman crazily loved him? A guy like this guy in the film would have a romance?! It'd make Jesus cry on his Cross!But truth be told, Timothée Chalamet in this movie played a role that didn't make me jump out of seat, no matter what is the matter, good or bad, happened to him that was absolutely possible without question."}, {"id": 208, "text": "My 10th Woody Allen film and now my favourite - I found the whole thing oddly hypnotic.It gave me a few chuckles, and I just found myself really engrossed in the adventures of Gatsby (Timothee Chalamet) and Ashleigh (Elle Fanning). It was way better than I thought it would be. It certainly helped that it was set in New York, as the city was one of the strongest characters.It was my first time seeing a Timothee Chalamet film, and I found he really carried the film. He certainly slotted into that self-absorbed and quirky-Allen-cliche-character quite naturally. The supporting cast looked like they were enjoying themselves too.The whole film had numerous really beautiful shots. I enjoyed the witty dialogue too. Couldn't help but smile at times. Sure, it might be a bit pretentious and not for everyone, but I really enjoyed this one. Its short runtime was just the right length.Makes me want to revisit New York. I enjoyed the slight plot twist, loved the ending - and I won't be forgetting that piano."}, {"id": 209, "text": "I never thought I'd live to see Timothee Chalamet play Woody Allen but then I realised the young male lead in any Woody Allen film is only a substitute for the character Woody himself would have played 40 or 50 years ago. In fact, every male lead in every Woody Allen picture is Woody whether they are Timothee Chalamet or Joaquin Phoenix or Owen Wilson or anyone else and that every Woody Allen film is just like the one before, particularly if they are good or are comedies like the early funny ones.A Rainy Day in New York is Allen at his slightest and his most incestuous but it is funny and it is charming. The jokes are old-hat but they're funny even if we did hear them as far back as Manhattan and Woody can still muster a first-rate cast to deliver his old-hat gags. Chalamet is smart enough to take on the Allen role but imbue it with enough of his own personality to stand out while Ellie Fanning, (chanelling her inner Diane Keaton), and Selena Gomez are terrific as the two (young) women in Allen/Chalamet's life. In fact, Allen pops up quite a bit in this film; Jude Law's screenwriter is Allen, Griffin Newman's student filmmaker is Allen and, of course, Liev Schreiber's director is Allen. Oh wait, isn't he Allen's version of Bergman or, at least, Bergman if he were a character in a Woody Allen picture.Of course, no-one will ever claim A Rainy Day in New York as first-rate Allen and while it's funny it's never as funny as those early funny ones but it does look gorgeous, (once again Storaro shot it), the whole cast throw themselves into it shamelessly, (indeed, there was a time before Woody fell out of favour when Fanning might have got an Oscar for Supporting Actress), and Allen completists certainly won't want to miss it."}, {"id": 210, "text": "Woody Allen comes back once again with this pretty good film. As always, we're brought back to New York, and all the characters seem to try to be staying out of the rain. Could this be a nod to climate change?But the real takeaway in this movie, which I was impressed by, was Timothee Chalamet. I think he really shines here as a potential big time movie star, perhaps down the same lines as heartthrobs Pitt and DiCaprio. I've only seen one or two other performances, one of which he played a similar character. I would have to say all in all I really enjoyed watching him. He had a coolness about him. There was also a geekiness tied to him, which I have been worried about with the new young actors in the industry. He seemed to prove otherwise here, really outshine Elle Fanning. She put on weight, and didn't really look that attractive or appealing. Perhaps purposefully?The story is about two college students who are dating. They go to Manhattan so she could meet a director for an interview. During this time, the boy embarks on his own journey, assisting in a short film by a friend and also attending a party by his parents. The couple don't stay together in the end, and yet it's a happy ending all the same.I was really thoroughly impressed by this film. The last Woody Allen movie that got me was Irrational Man with Joaquin Phoenix. This movie is more sweet and simple minded. I do think that Timothee seems to be playing the upscale New Yorker all wrong. And Elle also plays the sweet innocent Arizonan all wrong too. They started off as actors playing a role, and by the end fit into their roles pretty well. Aside from that, everything else was sort of normal. I enjoyed the party scene at the end, and scenes with the boy walking in the rain around New York.The fact that I've given this film so much thought and a wordy review should signify the fact that I really thought highly of it.Great movie. I would highly recommend watching it, though it's not a must see I guess.7 stars!"}, {"id": 211, "text": "My Review - A Rainy Day in New York My Rating 7.5 /10It really nice when you finally get to see a Film that's been surrounded by controversy due to Its Director Woody Allen's alleged sexual misconduct charges I stress alleged and I'm only interested in the film .A Rainy Day in New York eventually managed to get a European release in September 2019. Woody Allen won back the ownership rights from Amazon after lodging a $68 million lawsuit alleging Amazon had failed to meet contactual obligations to release the film.in November 2019, Allen settled his breach of contract lawsuit against Amazon, and both parties voluntarily filed a joint notice dismissing the case.I'm a Woody Allen film fan, not of all his films but a great many of them especially the ones he doesn't appear in . I like his script writing concepts and direction I hear in some of his movies the actors are encouraged to ad lib lines but I don't think the lines in this film are ad lib they're too clever.So I was keen to obtain a DVD copy to see what this one was like and I really enjoyed it. It's not a great film but it's a very entertaining sweet romance of course made more romantic by having New York ,one of my favourite cities in the world as its location. Woody Allen has often used New York and it's interesting that this is the very first full feature film directed by Woody Allen with the words New York featured in the title. However, Woody Allen has made a number of movies featuring suburbs of New York in the title. These are: 'Manhattan' (1979)Bullets Over Broadway' (1994), 'Manhattan Murder Mystery' and 'Broadway Danny Rose' (1983) - with Manhattan and Broadway being used twice in Woody Allen theatrical feature film titles.A film had of course must have more than a romantic setting it needs a good script and actors to provide the main course and I think there's some delicious moments in this movie.Timothee Chalamet as Gatsby Welles a privileged rich but naively sweet College student accompanies his current girl attractive friend Ashleigh played by Elle Fanning for a romantic weekend in The Big Apple while she is interviewed by film director Liev Schreiber ( Roland Pollard) . Their plans of a romantic weekend proceed to unravel when Ashleigh stands up Gatsby by having to prolong the interview to watch the Directors movie.Gatsby has to go solo for his New York adventure until they eventually do get back together but Gatsby Welles has changed and grown up emotionally especially after a visit to his mother's Gala event played beautifully by Cherry Jones where he realises his perception of his wealthy parents is so incorrect.The minor roles characters are just as interesting in the movie Gatsby meets Chan (Selena Gomez )the sister of an ex girl friend ,Ashleigh meets Ted Davidoff Jude Law in a nice cameo and she also has a possible #METoo encounter with charismatic director Francisco Vega (Diego Luna)Some of the actors in this film have donated their salaries to charities after the legal proceedings against Woody Allen took place including Timothée Chalamet who announced on Instagram that he will be donating his entire salary from his work on this film to the charities: the LGBT Center in New York, Time's Up and RAINN, an anti-sexual violence organization. Rebecca Hall who plays Connie donated her full wage from this movie to the Time's Up movement after reconsidering sexual assault allegations against the director in the wake of the Harvey Weinstein scandal.It's a shame this film with its talented cast will probably slip in to obscurity because of the controversy but seeing a lot of profits going to worthy causes may save it.I must say regarding Timothee Chalamet's singing debut that his voice remind me of a Chet Baker the legendary jazz trumpeter and vocalist . If any studio or director wants to revisit The Chet Baker biography for filming ( its been done in 2015 with Egan Hake Born to be Blue but only dealt with his comeback you have the perfect man to star in it with Mr Chalamet. My favourite quotes from Woody Allen's script - Gatsby Welles: One thing about New York City. You are here or you are nowhere. You cannot achieve another level of anxiety, hostility or paranoia anywhere else Gatsby Welles: I need a carbon monoxide to survive. We are two different creatures, right? You like the sound of crickets and I like the rattle of the taxies. You blosom in the sun and me, I come into my own under grey skies.Ashleigh: -Oh my God, you're Francisco Vega! Francisco Vega: -Is that good or bad? Ashleigh: -My roommate thinks you're the best thing to come along since the morning-after pill.Gatsby Welles: I read. I just don't read what they give us in school. I mean, do I really care who wins between Beowulf and Grendel? No, I don't. Maybe if I had a little money on it.I hope it gets streamed by Netflix or Stan it certainly won't be on Amazon Prime meanwhile it's a nice edition to my DVD collection to watch again ."}, {"id": 212, "text": "I feel like this script was written 30 years ago, being as the film takes place in modern day times, it almost comes across as a fantasy considering that young people today don't talk or dress or act like the common Woody Allen character, male or female. But once the story kicks in, it does come across pretty nicely.You'll get the same ole love affair, love triangle, love rectangle, older man enamored by the younger girl story lines that we're so used to in Woody Allen movies but it feels self aware in this one and doesn't go through the usual tropes as previous films did, especially for Elle Fanning's storyline. It's something that is used to in the Hollywood world and it does stem away from that dark cloud.The performances are niche, Timothee does put on his best Alvy Singer/Gil Pender impression but you do feel for him for being undecided on life. Selena is sweet, and she makes the film more real and levels out the humor. Elle Fanning's character could be annoying to some but she is naive and extremely neurotic but it still puts on a delightful performance. Everyone else in the film does well. The music is very beautiful and if you love New York movies this will fit good in the category. If you're against this film for whatever reasons. That's okay.7/10"}, {"id": 213, "text": "If like me you adore Woody's work, then I'd wager you'll love this. I've seen Woody's recent films, but this for me really has his unmistakable fingerprint: witty repartee; romance; immaculately placed and selected songs from the incredible American songbook, all brought to life by the usual cast of flawed characters, bumbling through life. Chalamet does a stellar job embodying the quirky underdog Woody-character, whose alienation affords him a superior view on life, G*d-like, as though he's sitting on top of the world watching from afar. Although Selena Gomez' voice, sounds more worn than the actor who plays a hooker in the movie, she comes across as a child, delivering great lines with the acting chops of a breadboard, ruining any chance at even quasi-believable chemistry; even when she's playing a snotty brat, surprisingly she is still utterly implausible. Yet Woody has handled this well, with Fanning stealing the majority of screentime with her depiction of the all-American blonde. Her rank ambition renders her oblvious as to how annoying her character is, making you want to scream at her through the screen. Really great. As always, the visual splendour Woody portrays NY with confirms his love for the 'knockout city', making it feel even more NY than NY. This film is definitely one of Woody's more serious, albeit light-hearted character-based works, as opposed to the far-fetched plots he likes to have fun with. Not nearly as monumentally classic, but this film did leave me with the same wonderful feeling as watching greats like Annie Hall, Manhattan or Hannah and Her Sisters. For an hour and a half, I forgot the mundanity of life and right now, mid-plague, that's really saying something."}, {"id": 214, "text": "The photography is impeccable, I loved the soundtrack and the light and loose dialogues that explore American literature and philosophy with a beautiful touch of blues. Classic Allen. I don't think it was his best work, but I think I'll watch it again in a month or two ...I liked Timothée Chalamet as the protagonist, the role suits him well and he plays that melancholy side of New York. I never had an opinion about Elle Fanning, but I kind of like her now, even though I don't like her character, it was very vanilla for me.On the other hand, Selena's character was more of a cinnamon feeling, but I wished there was a little more of a punch, I liked the ending tho.To be honest, since we're talking about a Woody Allen film, I was expecting a little more than that, but I liked it in a way. I wonder if this will be his final work. Hope not.I wished they explored more the whole thing with Pollard and his creative crisis. At some part in the middle of the film i think all gets lost as when she is trying to find them and suddently Rollie shows up out of nowhere... I dont know...It should have been a little more well scriptedI know he is not a very good human, but he is one of my favorite directors and writers. His movies speaks right into my soul."}, {"id": 215, "text": "Started off a bit sloppy but turned out into a nice little movie. Typical Woody Allen, like an arch Woody Allen project, just the soft version. Timothée Chalamet was quite good channeling a young Woody Allen-esque character. Started off a bit sloppy too but in the end really delivered a nice performance, proving once again that he is one of the most talented and interesting actors of his generation. Chalamet combines both charmes and innocence to his portrayal of a grow up minded personality. Good work. Elle Fanning however was the weakest part. She really did have a fine character to work with but blew it with absolutely irritating overacting. She gave the impression she really did not get the part and neither played it funny, as is was intended to be nor in anyway convincing. I was positively surprised by Selena Gomez who actually turned into a very good performance herself. Jude Law had a nice supporting role and I wished he had given more screen time. Liev Schreiber was good too. Rebecca Hall had a fantastic cameo and so did Cherry Jones. The screenplay was good and the direction typical old fashioned Woody Allen. It is really not a masterpiece or anything to remember but it is a charming movie for a. rainy but comfy day on your couch... maybe in New York."}, {"id": 216, "text": "I loved the Woody Allen movies I have seen, even in their darker moments they flow with ease, a sense of airiness that perfectly transmits the moments of falling in love, which are numerous in the films he directed. Yet, in this one I felt that very ease was gone. It is an intriguing experience to watch this movie with the allegations against Woody Allen in the back of your head. Maybe a piece of art can be seperated from the creator, maybe it cannot, this is one of cinemas biggest questions since Me Too started rolling. Even if you try to seperate it and see the movie for what it is (the option I try to pick), with this movie it felt impossible. The character of Ashleigh is just so flat, it makes you quite uncomfortable. A naive puppet, put there to provide some laughter and prey for fellow men. This was quite bugging, as the relationship between Ashleigh and Gatsby could have been fantastic material for Allen to mould his dialogues out of (just their first encounter already explores the boundaries of their relationship - how well do they interact? How well do they share goals?). Love triangles, New York City, humor between the lines, this movie had all the ingredients but somehow managed to turn up the heat in some places while also undercooking the whole thing. In my experience, the good Woody Allen films worked excactly the other way around.Maybe Allen tried to deliberately violate everything that is expected in a post-Me Too-movie. That could have been a great move to make you question these unwritten laws of character definition. But it just felt like you are watching a very dumb girl being abused without noticing it. Plus, the two main characters and their love for 'old stuff' was quite unbelievable.At the local cinema it was advertised as the best Woody Allen flick in decades and boy, I think, they just fooled me into buing a ticket."}, {"id": 217, "text": "Gatsby Welles (Timothée Chalamet) attends an upstate New York college but he's more interested in winning his poker games. He has distaste for his family's upper class world but not enough to refuse their money. He takes his girlfriend Ashleigh Enright (Elle Fanning) to New York City to interview filmmaker Roland Pollard (Liev Schreiber) for her college newspaper. They go their separate ways. She attracts the attention of Roland, Ted Davidoff (Jude Law), and movie star Francisco Vega (Diego Luna). Meanwhile, Gatsby encounters Chan Tyrell (Selena Gomez), the younger sister of a former flame. There is intermittent rain over their days in the city.Woody Allen is doing the structure of a rom-com in his own way. The main thing is that I don't care much about Gatsby. It's not until his conversation with his mother that his character develops some depth. That's not to say that the conversation isn't awkwardly unreal. There are quite a few awkwardly unreal conversations. The first one starts with Ben Warheit. He's obviously a troll and I can see what Woody is doing. I just don't believe that Gatsby would helplessly stand in front of him to continue the conversation. Sure he got the Chan information but he should leave as soon as that's done. He's not doing it to be polite so the only reason is that Woody wants to do a funny. Now, Selena Gomez is probably too old to play that part. The point is that she is younger than Gatsby. She was a little girl the last time he dated her sister. Quite frankly, Elle Fanning may be better for that role and switching the two actresses would be useful. As for Elle, she is trying for some broader comedy. She's a very winning actress but the drunk acting may be too much to ask for. I laughed but I'm not sure if it's for her and at her. It's awkward to do that broad physical comedy when the older men are on the prowl. Overall, the characters grew on me and it's a minor later Woody for me."}, {"id": 218, "text": "Since everyone else is writing their reviews based on their opinion of Woody Allen, I'd like to clarify that this is my second time to watch a movie directed by him. just like the other movie I watched, I didn't like the plot of this movie as well.the movie is pleasing to the eyes, the rainy new york-which i hope one day i could visit- but that doesn't make a good movie. the movie was supposed to be a ''comedy'', but i didn't catch myself laughing which meant either i missed all the jokes or there were no good jokes.Elle Fanning's acting was horrible in this movie i recall skipping almost all of her scenes because i couldn't stand the way she acted or talked. I didn't like most of the acting, but still giving this a 4/10 for timothee.overall, it is a good movie to waste time watching; however, there are many better movies out there if you want to waste some time watching a movie."}, {"id": 219, "text": "A Rainy Day In New York (2019 release; 92 min.) brings the story of Gatsby and Ashleigh, two students at Yardley University in upstate New York. As the film opens, Gatsby's voice-over tells us about his girlfriend Ashleigh. We meet Ashleigh and she informs Gatsby that she has secured an interview with a famed movie director, which requires her to go to New York City. Gatsby decides that they'll make it into a romantic weekend getaway. Upon arriving in New York City, things go very differently than expected... At this point we are 10 min. into the movie but to tell you more of the plot would spoil your viewing experience, you'll just have to see for yourself how it all plays out.Couple of comments: this is the umpteenth movie from writer-director Woody Allen. Apart of the quality of the movie itself (more on that later), the movie comes with a lot of baggage. This was filmed in 2017, yes, three years ago, and was part of his deal with Amazon Studios. With the #MeToo movement in full blaze and new rumors against Woody Allen, Amazon refused to release the film, and a number of the movie's stars, including Timothée Chalamet and Selena Gomez, disavowed the project and donated their salaries to good causes. Amazon and Woody Allen eventually reached a settlement and the movie finally saw the day of light in Europe in June, 2019, yes 16 months ago. It was released in select US movie theaters this weekend. As to the film itself, it tries to portray itself as just another Woody Allen film, with the same credits, the same music, and the same overall feeling of so many of Woody Allen's films, except of course that this isn't the same world anymore, and it all just feels very quaint and out of date. Timothée Chalamet as Woody Allen's alter-ego tries to make the best of it, but even he cannot salvage the fact that the script is devoid of fresh ideas. We've seen it all before in so many other Woody Allen films, there is literally not a single new twist in any of this. Bottom line: this is a film that is being released beyond its expiration date.As mentioned, A Rainy Day In New York opened this weekend in select theaters including at my art-house theater here in Cincinnati. The Friday early evening screening where I saw this at was attended so-so: 6 people in total including myself. If like myself you are a life-long Woody Allen fan, you are likely tempted to check this out, be it in the theater, on VOD, or eventually on DVD/Blu-ray, and I would certainly suggest you do so, but come with low expectations, and then draw your own conclusion."}, {"id": 220, "text": "The opening scene felt clumsy, and not in a good Allen-kinda-way, There were scenes where the dialogue flowed as a catchy, upbeat tune, and other times it felt a little too contrived and unnatural, throwing me out of Allen's melancholy world, making me remember this is not how it goes in real life.Storaro, master cinematographer, shot this film wonderfully, but in my opinion there were two times that his lighting choices were distracting.Other than those points of critique, I loved the film. I love the atmosphere Allen creates. I love the leading actors; Chalamet, Fanning and Gomez do very well in this film, Chalamet being a perfect young Allen (with the extra benefit of a velvet voice, enchanting piano playing, and less neurotic demeanor, although of course, the neuroticism is still there).The word I used earlier, clumsy, is perhaps a good way to describe the film. It is difficult for the director to maintain the universe he creates in every action and every piece of dialogue in a way that keeps the viewer engaged in the characters and the story all the time and makes them forget they are watching a farce from beginning to end credits. When it works, it's magic, it's proper good jazz, but you have to accept that there are false notes. Anyway, in my opinion, it's flaws shouldn't hold you back from enjoying this film This movie is worth the watch just for some of the Allen one liners that are sprinkled throughout the film."}, {"id": 221, "text": "I wish Woody Allen's banned movie A RAINY DAY IN NEW YORK was worth trumpeting as a film to be sought out like some forbidden fruit. Alas, it's yet another of Woody's not bad, yet not quite good mediocrities that have littered his filmography for the last couple of decades. Here we have Timothy Chalomet as a college student in upstate New York who travels to his native Manhattan ostensibly to squire his pretty coed girlfriend (Elle Fanning) around town while she is on assignment from the college newspaper to interview a famed arthouse film Director (Liev Schreiber). Along the way, they become separated. Chalomet ends up meeting up with the younger sis of his old girlfriend (Selena Gomez) and his mom (Cherry Jones). Fanning not only interviews the Director, but, has tete a tetes with his screenwriter (Jude Law) and a hot to trot actor (Diego Luna). And, it rains. RAINY DAY is another of Woody's screenplays that seems lost in time. Take out the cellphones, and the movie could just as well have been set in the 1970s. The movie opens with Chalomet's character's narration that forces the young actor to come off like a parody of Allen's early mensch persona - he loves Jazz, literature (he's even named Gatsby!) and, of course, all thing old NYC. The female characters are all ditzes, call girls or wanting babes in short skirts who pant for older more 'learned' men. Allen confronts his peccadillos head on. Here you have not one, not two, not three, but FOUR 'wise' men who are after the young blonde girl. Three of the four could easily be interpreted as stand-ins for Woody himself (the exception, I suppose, is Luna). A babe so innocent looking that she has to, literally (!), whip out her ID card to prove that she's 21. Fanning does her best, but, despite protestations that she's really smart - she comes off like a bubble-head. On one hand, I guess you have to give Allen credit for not giving in to the #MeToo movement and continue to explore his obsessions on screen. Unfortunately, he has nothing new or interesting to say. It's just another Woody Allen movie. And, that's the real irony here. Amazon got cold feet and have done their best to bury the picture. Truth is, the 'controversy' is the most interesting thing about it. If it had been released in the normal fashion, it would have disappeared quickly in the ether -- just like most other Woody Allen films these days."}, {"id": 222, "text": " Plans Film : A Rainy Day In New York Director - Writer : Woody Allen Dop : Vittorio Storaro Cast : tchalamet selenagomez ellefanningThe Charming writing style of woody Allen is always romantic. One of the greatest romantic writer from Hollywood.After finishing his movies we just can't ended up by saying or else putting some numbers, Star's on it. His movies like Rain - Flowing River - Fresh Air , Trip with your girlfriend with kisses and hugs, Musings You have to feel it not going to name it !There's nothing new in the concept in it but his gripping screen play holds your attention and his passionate truth wetty absurd ( sometimes make sense ) conversation will surprise you. Aapart from the question like it's bad or good it gives a comfortable , Joyful ride !And his cast they are too curious about his things #ellefenning #selenagomez #timotheechalamet Did a wonderful job !If anyone asks how was the film Just reply like this  Fun is not the word I would use  The guy who at his 80's making movie's instead of taking rest at his bed. We must appreciate his passion towards cinema !#arainydayinnewyork #woodyallen"}], "reviews_amount": 223}