{"name": "Save Yourselves!", "titleId": "tt07873348", "reviews": [{"id": 0, "text": "Many people here seem to hate this movie even though it's so cute and inoffensive as the baby Su and Jack pick up towards the end. I can only guess that the haters expected a serious alien invasion flick with Independence Day effects and heroics. Well, it's not! The alien invasion is mostly just background noise to the story of Su and Jack and their often hilarious but relatable ineptitude in the face of first their own little problems and later the big alien problem. Just expect the quintessential small movie, have a glass of wine and maybe you too can enjoy this little gem, with beautiful scenery and cinematography and the cutest couple since Harry and Sally."}, {"id": 1, "text": "Save Yourselves is a quaint little sci-fi comedy that follows a young couple as they fumble their way through a rather unique alien invasion, while providing some entertaining social commentary on the smartphone generation. The two main characters are quite endearing in their often pathetic attempts to survive, but you find yourself rooting for them all the same. We have seen this beginning-of-the-end of-the-world type situation before, but the low-key treatment that it receives in this film and the small and personal scale it takes place on, makes it a refreshing and relatable experience."}, {"id": 2, "text": "This movie is so slow! But not slow developing, slow into nothing happening. And the ending its just an insult, thw writers saying yeah, i'm tired of writing, just don't do the ending, no problem. The humor was almost funny for like 3 minutes. Repeat, almost... The rest of the movie, is not funny. The effects are pretty much none. A world invasion movie where they stay inside, do nothing, and when they go ouside they go maybe 2 miles and back to doing nothing but in the forest. Then the movie ends, but has no ending. What were they thinking releasing this???"}, {"id": 3, "text": "... says Su prophetically to Jack, more likely referring to the cast, writers and directors than to their own characters, Tweedle Dee &amp; Tweedle Dum, and their inability to navigate the world around them without a touchscreen or voice activation.More aptly titled 'Invasion of the Alcoholic Glue Sniffers', you may become one too after letting this pierce your inner pouffe."}, {"id": 4, "text": "So I attended this over the weekend at a Cinemaplex of 6. It was at Prime time and we were the only ones in the building. None of the other theaters were even open and aside from 3 employees. No one was to be seen.But at least I felt safe. We had the theater to ourselves.So on to the movie. The characters are very likable and relatable. At least to Millennia's and those mixed in with today's social media.It was a different take on aliens. But the fun part was certainly more in the way the two tried to deal with the situation they were in.A low budget film that is being judged as a blockbuster because it came out during a lag in blockbuster productions.This is fun. My worst critique would be that it needs a sequel or a better ending."}, {"id": 5, "text": "Firstly, the characters are the most obnoxious characters ive almost ever seen in a movie. They have no likeable characteristics what so ever. The movie itself was slow with nothing ever feeling like a truly climactic point in the movie. I don't recommend this movie if you have any other option of something to watch..."}, {"id": 6, "text": "This is minimalistic and micro budgeted film that doesn't take itself too seriously. The plot includes a typical millennial couple going on a retreat with no internet. So they don't know that the Earth is attacked by fluffy killer aliens.This movie has some pacing issues in first act, but then fun begins until the end. The end is left ambiguous enough which might put off some viewers but makes sense at the same time. There is not much into the story per se, but the small touches with dialogs and situations keeps it interesting. It doesn't try to reinvent the genre and plays safe, but the leads Su and Jack handle it too charmingly to be too noticeable. If you are looking for a minimalistic movie with loads of fun, this is it."}, {"id": 7, "text": "This is not sci-fi comedy, it is more like a boring drama with a boring couple.Not funny at all, not even able to produce a single chuckle.Sci-fi elements are weak.One of those movies that makes you feel like you wasted a couple of hours of your life."}, {"id": 8, "text": "This was a great little watch. If you go into it not expecting much then you would be pleasantly surprised. Yes the second half doesn't really align with where the story was initially going, but hey this is 2020 and that ending felt only fitting..."}, {"id": 9, "text": "Worst movie for 2020 Don't waste your time watching this. There are tons of better movies to watch. No questions were answered in the movie Why do the Pouffes love Ethanol? What's the purpose of the Pouffes invading Earth? What do they want? A movie with no ending What's the glass structure towards the end Why did they fly off and to where? If you wanted to emphasize on technology, social media running our lives then don't add the aliens coz it does not add up! Lame dialogue I would have have marked it negative 10 if there was a rating for it..."}, {"id": 10, "text": "Low budget film abit boring for my liking with a strange ending but if nothing else too watch worth a view I spose"}, {"id": 11, "text": "It just shows how stupid millenials are. Comedy? You call that comedy? Really?! And the ending was the worst part. Good thing I didn't have to pay to watch this crap"}, {"id": 12, "text": "Sunita Mani and John Reynolds should sign up for a Judd Apatow flick in the future - preferably, a millennial sequel to This is 40. The duo has exceptional chemistry, expressive faces, and great comedic timing. I'd have been happy to listen to these two going at each other with their internet philosophies and natural relaxation techniques for 90 minutes instead of the sci-fi schlock the film turns out to be. Add Baby Jack into the mix and it would have been hella entertaining (as a pure romantic comedy!). While the alien pouffe things were 'cute', I couldn't take them seriously even when they were going on an alcoholic killing spree. The ending is a bit of a bummer too; expedited and ambiguous."}, {"id": 13, "text": "Total Waste of time. no point no meaning and the two most useless human on earth."}, {"id": 14, "text": "It is the lowest IQ and stupid movie ever! The title should be instead: SAVE YOURSELVES, SAVE YOUR MONEY!It is not even funny... The movie and actors have potential to be funny and to even have a kinda decent plot, but no... nothing exciting or funny happens.We were 9 people at the movie theater and all were saying what a bad movie it was!"}, {"id": 15, "text": "It's a don't think about it too much and enjoy movie.The main characters are performing very well together. Near spoiler alert, no naked scenes, no girl-girl or boy-boy kisses, no crazy action scenes, nothing what is put into all the recent movies to get attention, just simple good and funny acting. Yes, it is funny in most parts, sometimes a little weird funny. It's a good 6 rating almost tempted to give it a 7 for trying something different."}, {"id": 16, "text": "This film is a little gem. It comes at the perfect time when we all need a little cheering up.This film is fantastic, with some great sci fi comedy, the two leads work brilliantly together with great comedic timing while portraying a young couple of the 21st century in all their uncertainty and search of meaning, which is relatable.The timing and creativity is well executed, cinematography is great.This film is well worth a watch for comedy fans."}, {"id": 17, "text": "The only spoiler is noted below.Su (Sunita Mani, G.L.O.W.) and Jack (Stranger Things, Search Party) are in their early 30s and have become disconnected from each other because they're each so deeply connected to the internet. When a friend offers them a week at his cabin in the woods, they take the opportunity to unplug from the world... which renders them completely oblivious to an alien invasion.This is a low-budget combination of a romantic dramedy and an alien invasion flick -- which shouldn't work, but it kind of does. The first portion is slow and dramatic (and a tad overlong) as they introduce the couple and their various quirks, which sets up some of the comedy when they're finally clued into the extraterrestrial pouffes. Things pick up from there, and they throw in a few twists along the way -- although being an indie, there's a lot more talk than action. (SPOILER) I'm not going to outright spoil the ending, but I will say that it's not a traditional Hollywood ending by any means, and its ambiguity could easily make or break one's overall opinion of the film.I was charmed by this little oddity, and thought it was kind of uplifting at the time of its 2020 release, when the everything in the world seemed equally as strange and bleak."}, {"id": 18, "text": "This movie felt like a constant jab at stereotypical hipster young people. They literally could not do a single thing without running into a problem. It's not that there is an actual problem it's just there lack of common sense and skills. You expect it to be funny but it's actually just frustrating watching them struggle at the simplest of tasks. And the more the movie progresses the more frustrated you become.3/10.Not really worth the watch."}, {"id": 19, "text": "At first i didnt took seriously the bad reviews, i was thinking, i was prepared to see a bearable movie and that would enough for me.I really wasnt prepared for THAT AWFUL thing that they called it movie.One free advice, take SERIOUSLY the bad reviews, they dont lie. You thank me later."}, {"id": 20, "text": "Might be the worst film I've ever seen. The filmmakers should never be allowed to touch a camera again. This was a war crime. Someone report these cnts to Interpol for crimes against humanity. They play this on loop in gitmo to torture terrorists and corrupt politicians."}, {"id": 21, "text": "Very good reflection on Millennial generation, couple that are sitting next to each other but faces in the smartphones, Thinking that they are original but getting all the ideas from popular online lists, talking about subjects that are popular online and thinking that they got real influence on the world. To summarize,the young generation that thinks that the sun is shining from their ass :-)Very good film with very good actors and writers. Recommended."}, {"id": 22, "text": "I thought the thought provoking metaphors dotting the movie with good comedic dialog leaves the viewer sitting, in a lighthearted way, with the question do I really need to be connected to that device to get real meaning and truth out of my life, and life skills to survive. The innocent enough alien tether that kills humans when connected but kills the alien when cut. Really, if we all dropped off line wouldn't the internet just die a smoldering death. It was funny to watch them stumble through the movie learning survival skills and relying on each other more than Google.No need to reveal every metaphor. And sometimes it's better to be left with a question than an answer. Maybe a zombie apocalypse that brings down the Net might be good for saving humanity."}, {"id": 23, "text": "Like 'Galaxy Quest' this is an alternative universe's 'Star Trek' episode with much better acting, skillful directing, and a very funny script.If you can't guess which 'Star Trek' episode, you'll miss a bit of the fun, but that's OK."}, {"id": 24, "text": "A fun low budget film. Silly and pointless but worth a watch."}, {"id": 25, "text": "This is the story of a couple who want to have a vacation in a cabin. When they leave the city and turn off their cellphones, the alien encounter occurs. This couple is not aware of the alien encounter in the cabin. This story is an innovative one with a nice ending. The special effects were awesome. I enjoyed background music and sound effects. The movie is filmed in the cabin and different amazing locations in nature. I liked the acting crew. John Reynolds and Sunita Mani were awesome. In summary, I recommend this movie to comedy genre fans."}, {"id": 26, "text": "First off I'm going to say it: the actors are ugly. Must have worked for free or were the family of the director. And their characters are too stupid to be anything above 80 I.Q., and they're so clueless we want the monsters to kill them quickly and PAINFULLY. DO YOU WANT TO BE ANGRY? Nah, you don't want to be that angry. Avoid this like Covid 19. Anyone who rates this film over 1 is obviously bribed."}, {"id": 27, "text": "Even though I put it on as a background movie while I was working I had to turn it off, it's not funny at all, the voices are very quiet and then they are really loud shouting but it doesn't go anywhere it's just a mess and the actors are terrible, .. it feels like a really, really cheap movie. Trust the bad reviews, the strong propaganda especially the gun control nonsense being pushed so hard is what made me have to turn it off, this is my first IMDb review and I NEVER review movies but decided after this one I'd actually do the right thing and leave this review in case it might save someone the suffering and complete waste of time on what is out of the enormous amount of movies I've watched, the worst movie ever! No doubt about it at all, I'd give it a -10 if I could. The characters are ugly and nasty, this is really something you don't want to watch, even if there is nothing else!! I never had to turn a background movie off before"}, {"id": 28, "text": "No idea what the bad reviewers are raving about. I think they completely miss the point and humor of this movie. It's an excellent recap of the hipster culture, fascination with fake interests and pursuit of meaning while missing out on the stuff earlier generations were better at. Likewise, their openness to share, discuss and analyse leads to some hilarious dialogue writing and we found ourselves laughing at smartly written stuff often. It's not really a sci-fi though, the whole alien thing is used just as a prop for the script."}, {"id": 29, "text": "This movie manages to begin by being TOTALLY boring -- and then it gets worse. Even aliens taking over the planet cannot save the complete stupidity of the two main characters. They are both hopelessly addicted to their cell phones, and that is ALL they know how to do -- they have ZERO skills. So then, a giant Tribble shows up, and these people are so dumb they call it a poof. So then the Democrats show up (in spirit), and we have to have the no guns, ever speech. Wherein they manage to spout all their fake statistics about guns, like you are eleven more times like to shoot yourself if you have a gun, etc. Well, with these two complete idiots -- they may be correct. The s-guy (S=Stupid Guy) takes a 'test shot and manages to hit the window he was shooting THROUGH -- after opening it. No, not even aliens landing &amp; invading Earth can save this movie; and the two main characters would be better off eaten by aliens -- as, if they had their cell phones, they wouldn't even notice they were being eaten. One Star."}, {"id": 30, "text": "This movie is a prime example of what happens when you spend too much time in the story doing nothing instead of building the plot towards a climax, that being another thing this movie doesn't really have. I'm surprised it was so well received by critics, but I'm also not surprised since they seem to love boring films. Overall, a forgettable, dull experience."}, {"id": 31, "text": "I loved the movie from the beginning to the end. Very funny witty and entertaining"}, {"id": 32, "text": "Likeable and endearing characters, several laugh out loud moments, this was just a fun viewing experience"}, {"id": 33, "text": "Take a 30-something Brooklyn couple who are struggling to figure out their own meanings of life. They snap at a chance to take a week off the grid, no phone, no internet, no TV news, just the two of them in an upstate cabin a friend loans them. They seem to be enjoying the timeout until ... strange fuzzy creatures start to show up, with a particular craving for anything with ethanol in it, even the gasoline in their car.The start is great, what transpires after that is quite spotty, with the two breaking their own rule and turning on devices to find out what is going on. They attempt to escape to find safety, but where? Then they encounter something in the forest. The best I can say is it is a very interesting movie, most of the dialog is inventive and interesting. But taken as a whole it is just an average independent effort. My wife and I watched it on DVD from our public library.MAJOR SPOILERS: Don't read anything following unless you want to read spoilers. Along the way they also picked up a small boy after the fuzzy ball killed the parents. Along with him in their arms they soon find themselves inside a semi-transparent elongated ball, with just enough space for them to stand up. They start to rise, into the atmosphere, into the stratosphere, and we see similar vessels rising also, presumably with other people in them. And the movie ends, I suppose some alien race is capturing humans, hopefully to transport them to a place to build a new civilization."}, {"id": 34, "text": "Not an Oscar winner but refreshing, people you care about, crazy but fun and a wonderful change from the miserable stuff being endlessly put out on Netflix, Prime etc. If you've got an open mind then we'll worth a watch."}, {"id": 35, "text": "Nice movie, slightly slow in places but a good film. If I was critical I would say the metaphor was too obvious and I would've just preferred a film (ie an entertaining story) with an ending and not the writers pushing an idealism, but I got enough out of it."}, {"id": 36, "text": "I watched it once but won't watch it again, the ending sucked in my opinion. James Welch Henderson, Arkansas 11/27/20250"}, {"id": 37, "text": "A young couple feels stuck in a rut, and jump on a chance to spend a week at a friend's cabin in the woods, and unplug in order to connect with each other. What could go wrong?The husband and wife actors feel real and relatable, and are hilarious. The cabin and forest are lovely, a perfect place for rest and relaxation, and an alien invasion. It quickly becomes clear neither of them have any knowledge of basic survival skills. This film is a delightful mix of an enjoyable Rom-Com and a rather unique take on an alien invasion."}, {"id": 38, "text": "I was under the impression that this would be some kind of R rated violent movie. It is nothing but a snooze fest with a whiny hipster couple blabbing on. I'm not sure why this is rated R. It should be rated PG."}, {"id": 39, "text": "Fantastic acting, great editing and cinematography-fell flat for me. boring most of the time, poor attempt at humor with the BIGGEST fail of an ending."}, {"id": 40, "text": "I went into this movie with an open mind. I saw the trailer and thought it looked interesting, but I was prepared to be a little underwhelmed. So...this movie really tries, but it comes up short. I think the biggest problem with the film is the annoying lead characters. They are unlikable, and ultimately, you don't really care about them or their plight. The other issue with this film is that it doesn't feel it knows where it wants to go. It just was all over the place for me. And lots of inconsistencies. For example, these creatures were so quick to kill everyone else as we see throughout the course of the movie. But with these two people, they are just sitting there, friendly and furry. It made no sense. Then towards the end, they introduce some kind of hallucinogenic substance these creatures emit, why didn't that happen earlier?!! The ending is really lame and makes no sense. Okay, someone is choosing to save them, are they the same entities that put those creatures on the planet in the first place? Are they friendly, or foe? Are they just going into space forever? There was no ship visible. The comedy also was fairly weak, which just mostly involved the two characters complaining or arguing with each other. I was distracted by the man's voice, it kept going so high pitched when he got upset. The way he talked reminded me of the Rusty character on Mad TV. All in all, without characters you care about, and a well-defined direction for the plot, the movie ends up feeling like 3 hours in a 1.5 hour format. Maybe worth streaming, but paying full price in a theater, I don't think so."}, {"id": 41, "text": "Alien Invasion Movie / Comedy. A common scenario of alien invasion with a light humorous tone. Several films have been made in the past with such a tone, such as critters, or mars attacks, etc. It is a light comedy that is pleasant to watch, but does not cause much laughter, nor does it have much action. It has almost two actors in almost the whole film and the aliens are completely simplistic, while the effects are minimal ... It is weak for the genre I would say and I would suggest the critters as a corresponding but much more interesting one."}, {"id": 42, "text": "The description should read:Two liberal millennials with absolutely no survival skills fending for themselves during an alien apocalypse.A fun quirky twist on the genre."}, {"id": 43, "text": "This is an awesome movie, its subtle, funny, and goes places. You get to care about these characters a whole lot, and some of it might resonate with you own relationships. MUST HAVE A PART 2! ~ Alex &amp; Eleanor pleasepleaseplease"}, {"id": 44, "text": "I absolutely loved this movie! Su and Jack in the forest running away from poufies... And hopefully on further adventures (end of movie). I wanted more!!! The relationship between the 2 characters was soooo relatable and cute! The plot was different and kept me glued."}, {"id": 45, "text": "Please dont waste your time watching this like I did. Really nothing happens in it, and I am sure you can find something better to do with your time... like watch paint dry!!"}, {"id": 46, "text": "Please save yourselves from watching this movie.. The girl looks like Daniel-san in his 17.. the dude is just a dude and this movie is just a waste of time..."}, {"id": 47, "text": "Bad movie waste time money for ugly characters. Why do they made this movie for?"}, {"id": 48, "text": "I hate open-ended movies. This is a B-movie without special effects that goes nowhere."}, {"id": 49, "text": "Save yourselves the frustration of sitting through a couple-in-crisis story that moves in fits and starts and suddenly resolves itself in several unearned emotional beats. Save yourselves the annoyance of following two increasingly annoying lead characters who are little more than thinly developed improv characters who are annoying. Save yourselves from a half-hearted alien invasion plot involving ripoffs of tribbles and Critters, a plot that goes nowhere and then just ends."}, {"id": 50, "text": "Never cared about characters. Actors cannot save bad script. It's low budget, and it didn't have to fail because of this. Memorable moment, and significant cultural insight, was baby boomer stealing from millennials to save herself."}, {"id": 51, "text": "This film start with an article indicate the year humankind lost planet Earth, and the introduction of a couple(Jack and Su) scene! As turnout, this film is about Jack and Su need to survive from a bunch of pouffe look alike alien, who invaded earth! Entire film full of boring conversation, and annoying overuse scene! Such as, overuse of the shouting get out of here scene, overuse of the drinking scene, overuse of the eating scene, overuse of the arguing scene, overuse of the shouting Jack scene, and overuse of the playing with phone scene! Make the film unwatchable! Barely intense scene is, Su cut off an alien suction tongue! At the end, Jack, Su, and a baby capture in a pod and fly off from earth! That's it! Wasting time to watch!"}, {"id": 52, "text": "I rent it for 6 dollars and it was the worst ever in my life"}, {"id": 53, "text": "There are tons of funny and enjoyable movies. This one is not. Only pretends to be."}, {"id": 54, "text": "Jack (John Reynolds ) and Su (Sunita Mani ) go to a cabin in the woods to disconnect from the world for a week. During this time the Earth is attacked by ethanol loving alien Furbies. We watch them try to figure out what is going on and survive a large ball of fur looking for a drink.The characters started out pretentious and boring and stayed that way. Not really funny .Guide: F-word. Sex. No nudity."}, {"id": 55, "text": "Characters are horrible, who would enjoy watching these people?... Muddled plot... Idea and directing is nice, but the rest makes this one a pass."}, {"id": 56, "text": "I recently read about this new rom com about a interracial couple facing an alien invasion and thought it would be amusing and entertaining plotwise to check out. Wrong. The movie tries so hard in desperation to make your like the couple and laugh at their witty, clever lines, but it's a total misstep in every aspect. The script isn't funny, and the delivery by the actors (a real life couple) seems to strangely miss at every step. The pacing is agonizingly slow and the comedy just falls flat. the conversation feels totally unnatural and unconvincingly in-genuine. For most audiences, they will find the ending really unsatisfying, since it's vague and inconclusive. You suddenly see the credits roll and you're like...huh? Pretty mediore. View at your own peril."}, {"id": 57, "text": "Load of crap ,it just does not make sense its practicly about a couple in a cabin with silly puffs around everything happened in the city and this couple missed the action"}, {"id": 58, "text": "It's boring, has no meaning, it's not funny, I really don't understand what this movie was trying to be."}, {"id": 59, "text": "Look the concept is not bad, and I have a very high tolerance for low budget. But aside for the concept, which you already know if you read the one sentence descriptive blurb, there is nothing interesting, funny, entertaining, thought provoking, cute or of any value whatsoever in this film.As far as another reviewer claiming there are hidden metaphors; that this what every freshman who wrote a garbage short story or screen play scene claims when graded or critiques. Sure there are. No.Another reviewer suggested having a glass of wine and enjoying this gem. Well, I'm thinking they had a several bottles."}, {"id": 60, "text": "Trailer was funny so i wanted to try but last 45 minute felt like a homework project done by students such a shame"}, {"id": 61, "text": "Don't watch it!!! Save yourselves!!!!! I didn't expect much but it was so much worse than I had expected... This could be a student's movie!"}, {"id": 62, "text": "I downloaded this for free...and i STILL want a refund !!! SOOO stupid !!!"}, {"id": 63, "text": "Comedy core is the acting to me, two leading couples don't have a funny outlook is Alrite. But at least the acting and behavior should be funny. I think the story is indeed ok but the issue of this movie is found the wrong cast. Also the line without any memorable or funny part is the failure."}, {"id": 64, "text": "Save Yourselves! (2020 release; 93 min.) brings the story of John and Sue, a couple in Brooklyn. As the movie opens, they are bickering about computer and smart phone time. After attending a party where a friend offers his renovated updated cabin for free for a week, John and Sue eagerly take up the offer, and furthermore, they decide to disconnect from their phones and computers... At this point we are 10 min. into the film but to tell you more of the plot would spoil your viewing experience, you'll just have to see for yourself how it all plays out.Couple of comments: this small-budget indie movie was written and directed by Alex Huston Fischer and Eleanor Wilson, this being their feature length debut. The story is the umpteenth reimagination of what the end of the world might look like, but they bring it with an original twist that I will not give away. Watch the film and the title of my review will make all the sense in the world. Sunita Mani (as Sue) and John Reynolds (as Jack), best known for their respective TV work, are enjoyable in the lead roles. They are in just about every frame of the film, and for long stretches it's just them. This film is billed as a scifi comedy, and I suppose it is. But I must be honest: rarely laughed (and certainly not out loud). The film lacks gravitas to be taken seriously, but it also lacks truly funny moments to work as a comedy. Instead what we get is an off-center indie film that is more quirky than anything else.Save Yourselves! opened this weekend at my local art-house theater here in Cincinnati, of course fully adhering to all COVID-19 social distancing and other protocols. Not that it matter much, as the Friday early evening screening where I saw this at was attended poorly: exactly 3 people (including myself) in the theater's largest room. I honestly don't know how this and other theaters can keep operating like this on a profitable basis. Meanwhile, if you have any interest in an atypical end of the world scifi comedy, I'd readily suggest you check this out , be it in the theater, on VOD, or eventually on DVD/Blu-ray, and draw your own conclusion."}, {"id": 65, "text": "This movie is about expectations. I had seen the trailer, saw the tribbles (poofs), got a sense of the two main characters (Mani and Reynolds) and knew this wasn't a even a dramedy (just good fun).The film delivered exactly what I expected - something light, fun, relaxing and surprisingly funny (I had 4-5 laugh out loud moments which is very rare for me) among a light sprinkling of an alien infestation.The ending was a little too open-ended for my tastes - so I'm just going to assume that this very likable couple (along with baby Jack) had a happy ending. I think the director made the decision to let the viewer decide how it ends.I'm giving this film a how it made me feel rating of 7 because it entertained, put me in good spirits, made me laugh out loud (a rarity) and Sunita Mani/John Reynolds are the cutest couple I've seen in a long time."}, {"id": 66, "text": "What did Sean Connery say to the hostage with a beard? I'm going to shave you. Are we going to have to shave ourselves?This might be the funniest movie of 2020. Premiering at Sundance, this took audiences by surprise. The movie follows a couple going off the grid for a week. Whilst doing so, an alien invasion strikes the world by surprise. They don't know this is happening till they discover themselves. Much like the audiences, I was also surprised by how good the movie is. The story makes for a laugh-out-loud comedy and also a satire on how the public is addicted to their phones. I'm glad that the social commentary aspect isn't pushed so heavily in our faces. The subtlety of it helps us focus on the overall fun of the movie. And that's all made possible by the two leads. Sunita Mani and John Reynolds have impeccable chemistry. Anyone could look at them and think they aren't even reading off a script. Everything feels unscripted between the two. I couldn't imagine a better duo.The movie starts out real strong with the setup, characters, and comedy. At the halfway point, though, you come to realize this is all it's going to get. Going forward into the movie it dips because of that. Undoubtedly, the movie is hilarious and entertaining, but it fails to get any better than it already established. And since it stays on that level it feels lacking. I still had a fun time watching the rest, but without any change I couldn't feel any different. There's not much more to say about the movie. Save Yourselves! is an amusing comedy that takes you by surprise, both by plot points and the whole thing in general, and I'd recommend this to comedy lovers."}, {"id": 67, "text": "REVIEW - SAVE YOURSELVESFrustration!When a film even a cheap independent film starts and starts well in a way you have to expect that due to budget there will be for example poor effects, creatures or aliens but honestly and surprisingly I found these to actually add to the charm of this film as it simply doesn't take its self too seriously, sorry I'm jumping ahead, let me start from the beginning.A couple decide to go away and not look at their various devices for the entire week, no phone, no tablets, no laptop and just enjoy each others company.While away earth gets invaded by what look like Tribbles, yes Star Trek fans a version of our favourite pest returns but this version kills people!What do they do? what would you do?I'm not sure if this film is listed as a comedy but a few times I did chuckle to myself so surprising enjoyed this except for the sheer waste of time ending, what happened, you actually get hooked, start enjoying and actually sit on the edge of your seat at what happens at the end and then nothing?So yes enjoyable but....?Rating 6 out of 10"}, {"id": 68, "text": "My wife and I were excited to watch this film as it appeared to be an original storyline that fits in with today's society of being addicted to phones. We read that it was a comedy and laugh out loud funny. Which I don't recall at any time either of us laughing at all. We actually mentioned how unfunny it was after watching. The actors were good and the story written well in the beginning, however it quickly turned into a story about how humans are bad, don't eat meat, fossil fuels are bad, guns are bad, etc. The gun issue was pushed way too hard with all sorts of gun control falsehoods. Even going as fall as him over exaggerating shooting a .22 rifle. That's all that gun was with absolutely no kick and one of the quietness guns you can shoot. But I guess that's what Hollywood does, pretend to know something they don't. I guess it depicted well the millennial generation's lack of knowledge of anything not on Facebook. But why can't we have a movie that's just for entertainment? I literally looked multiple times how much longer this movie had to go, hoping maybe it would get better but it never did. Save Yourself by not allowing this movie waste your evening."}, {"id": 69, "text": "I haven't laughed so hard in quite some time. Do you remember Tribbles from Star Trek? Imagine if the world was taken over by fat cute tribbles! A NYC couple decides its time to turn off the phones and get off the grid for awhile to reconnect. They go off to a cabin in the woods and not long after these Tribble Puff creatures start causing havoc for the whole world. This movie is almost entirely a two actor show. It could have almost been done as a play, since it was mostly dialogue between Sunita Mani (who played Su) and John Paul Reynolds who played Jack. This couple was totally inept of real world skills. Their arguments about using a gun was hilarious, because I could imagine real people having this conversation. I thought Sunita Mani was adorable. John Paul Reynolds played the modern sensitive non masculine man to perfection. I fell over when they returned from hiding in the bathroom weilding a toilet plunger and a toilet bowl cover as weapons.I thought the movie was going great. The acting was wonderful, and I thought we were getting somewhere, but the final act was very disappointing for me. The story ended very abruptly. All of those laughs turned into disappointment. I was confused by the ending. But this doesn't take away from the fun performances of our two main actors."}, {"id": 70, "text": "How well would a bunch of quinoa-eating, anti-gun liberal progressive Instagramers fare if faced with protecting themselves from an alien invasion?That's the question this movie asks, and watching the answer play out is humorous, but I couldn't help but think how much better a movie could have been made from such a good premise. For a liberal progressive like myself, it's easy to put myself in the shoes of the protagonists, a hipster couple from New York who decide to take a break from social media at the worst possible time, and there are some chuckles to be had at making fun of them and by extension myself. The film is at its best in the first half, as this oblivious couple gradually catches on that something is amiss. But it unravels the longer it goes on, and the ending falls apart, as if the filmmakers painted themselves into a corner they didn't know how to get out of.In a year as terrible as 2020, the film's message, which can essentially be boiled down to valuing those closest to you and forget the rest, is welcome. I just wish it had come in a better package.Grade: B-"}, {"id": 71, "text": "If you want a more traditional mass-market 'sci-fi' or 'comedy' then this 'SciFi-Comedy' isn't going to do it for you at all (check the low-star reviews for how that will work out!).It is basically a light-heated character study with an off-beat premise, and as that -- and just that -- is quite good. There isn't more story than absolutely needed to support the character stuff, and the ending, such as it is, is very open ended. I have enough exposure to non-modern story-telling forms that that doesn't really bother me. YMMV.The characters were utterly pleasant, though I am a generation behind being able to relate to them or their situation properly, so can't really comment beyond it being very rare that such characters don't just make me frustrated: I don't normally have any patience for 'useless' people fumbling around in the face of adversity, but the writers+actors somehow pulled it off in this instance.If you like art-films, you may well like this. If you expect something more mainstream, you very probably won't."}, {"id": 72, "text": "* There is no end credit scene *The directors Alex Huston Fischer and Eleanor Wilson plus crew brought an unusual alien film. The story sets when a couple unplugs themselves from technology and they wind up missing an alien attack. This is a must-see film, the events leading to the attack were so intriguingly unfolded. The conversations were so practical as to bringing many genuine topics. Like simple things as to when going online and having open tabs and to someone else being oblivious on closing it while not knowing the importance of it. Though was it really important? This film points out how phones and laptops keep one in a bubble while overlooking the surroundings. How perfect it was to show us a couple who decides to disconnect to everything to really live but by doing so they find it hard to connect and get to really know one another. They struggle to be the people they want to be and they find it difficult to take action to reach their goals.It is quite fresh how they mix it up with an alien attack which I found extremely enjoyable because every choice they made had a consequence of how hard life is. I like the appearance of the alien, also the different types of aliens and I would have loved to know more about them. The ending was perfect it could be interpreted in so many ways one can decide if it's good or bad it all depends on your viewpoint. I prefer something bad given the fact the choice they keep making.The composer Andrew Orkin brought the perfect awkward music that defined how unaware this couple was of the alien attack.Sunita Mani and John Reynolds balanced each other making their performance so thrilling to watch. Their chemistry was so engaging by executing everything so awkward and casual on every interaction. I really hope they make a sequel because I want to watch more of their performances and of course the aliens."}, {"id": 73, "text": "It looked like a good concept, it had all the makings of a great story, it even 'flowed' for a bit. The acting wasn't terrible and the 'marginal' humor was actually kind of funny! But, it falls apart so quickly it's devastating!As I mentioned before it had the makings of a great movie but the personal interactions were almost cardboard, I can't thin of a better way to describe them!And, because there is really so little to say about this movie, the ending is a total and utter let down!Synopsis: don't watch this unless you want to see how a good story can be destroyed in so many ways it become depressing. Note: I did, not by choice, watch this entire movie, I really hoped that it would get better and it didn't.I gave it four stars because it could have been great and the overall acting wasn't terrible."}, {"id": 74, "text": "Save Yourselves! is a quirky science-fiction comedy movie with sympathetic characters that actually remind me of a couple I know. Su and Jack love each other but spend most of their time on the internet and more specifically on social media. When they come to realize that technology has taken too much space in their lives, they decide to travel to a lodge upstate where they plan on disconnecting from technology for an entire week. The challenge is much more difficult than anticipated and as soon as the couple is ready to commit to changes in their lives, they learn about a strange alien invasion. Soon enough, they meet these strange extraterrestrials that look like pouffes. They seem harmless at first but the nervous couple soon changes its mind when they witness how the pouffes kill a family father and a family mother. They decide to take care of the orphaned baby and are now on an epic quest for survival.This movie convinces on several levels. The mixture of comedy, science-fiction, mild horror and some social criticism is perfectly balanced. The two lead characters are quite quirky, dynamic and charming. Sunita Mani and John Reynolds have excellent chemistry on screen. The story is unpredictable and comes around with a few creative twists and turns. Despite a low budget, the extraterrestrials look quite intriguing. The locations are simple but well chosen for the plot. The soundtrack focuses on pop music with creative depth and blends in perfectly. The lighting and sound effects are crafted very beautifully as well.On the negative side, the film's middle section has noticeable lengths. Especially the conversations between Su and Jack can be slightly repetitive and predictable. The ending is quite controversial as well. Personally, I thought it was quite imaginative and beautiful while others have complained about the film's lack of closure and a seemingly aborted ending. This unconventional approach invites you to use your own creativity instead of answering every single question in this film.In the end, Save Yourselves! isn't movie of the year material and probably not a film I will revisit anytime soon but it's a visually beautiful science-fiction comedy with quirky characters that is mostly entertaining. Since the movie industry has been suffering due to the ongoing pandemic, it's great to watch something fresh and new. I will always prefer discovering something new than revisiting classics over and over again."}, {"id": 75, "text": "When I read the synopsis for the 2020 movie Save Yourselves! I must admit that I was somewhat excited to sit down to watch it. The movie's synopsis definitely made the movie sound like it could be a very interesting, if not fun, movie.Well yeah, sounded like it...Save Yourselves! turned out, however, to be a rather mundane and monotonous movie actually. Writers and directors Alex Huston Fischer and Eleanor Wilson just didn't manage to bring the movie to fruition.It felt like the movie was run on auto-pilot, just trotting onwards in a very monotonous pace, which left no room for any ups and downs along the storyline. And that, in turn, made for a less than mediocre movie experience.The concept of the movie, though, definitely had some potential. Just a real shame that it wasn't utilized in a fulfilling manner. And I must admit that I liked the alien creatures, the Pouffes as they were named. The creature design was just so simplistic that it actually worked out well in favor of the movie.Save Yourselves! did suffer from not having a lot of characters in the story, and it didn't really help much that the characters that were there, were just so bland and had the appeal of wet cardboard. Now, John Reynolds (playing Jack) and Sunita Mani (playing Su) were doing good enough jobs as performers, but they just literally had very little to work with in terms of script, dialogue and proper characters.I managed to sit through the entire movie, but I was not really particularly entertained. And I can honestly say that Save Yourselves! is not a movie that I will be watching a second time.My rating of Save Yourselves! settles on a less than mediocre four out of ten stars."}], "reviews_amount": 76}