{"name": "Wonder Woman 1984", "titleId": "tt07126948", "reviews": [{"id": 0, "text": "So, here we are after months and months of delays DC finally relased the highly anticipated WW84, and it is... well... cool. My opinions about the movie are mixed so I will seperate them into 3 categories.1. Good: Gal Gadot - she is a GODESS, i repeat GODESS! Excelent as Wonder Woman, full of emotion, extremely likable understood the character and did a great job just like in the first movie, maybe even betterPedro Pascal - I just want more of him! Altough his character wasn't developed that much, Maxwell Lord, and is a bit of a predictible personality you can still see he is having a blast playing him and is so entertaining.The visuals - a really beautifull movie to look at ( fireworks scene ), definetly worth seeing it in a theaterStory and message - it kind of felt like a Disney movie with is main theme of nothing good is born from lies and it's vibrant characters and looks, the pogression of the story is solid and preety interesting, altough it starts slow trying to explain and tell a lot of exposioson about the past and the present, but the second act picks up the pace and it is way more entertaining and action filled than the first act.Chris Pine - loveable as Steve and a nice characterFight scenes - great and really well done ( Mall robbery being the best ) and again. Gal Gadot shows a lot of emotion in them2. Mixed: Kristen Wiig- after the first act i kind of started hating on her character Barbara, which was likeable, with all of the cliche villian tropes she was taking, and when Chettah shows up for a 2 minute fight at the climax her looks reminded me of 2019s Cats and was a bit cringyWriting - some moments could have been less chessy and could have been written more deeply than they were ( scene where Diana says goodbye to Steve was short and was not that emotinal in terms of dialouge and the reunion of Lord and his son also felt so fast and not that emotinoal )Pacing - sometimes a bit slow, sometimes a bit fast, not good, not bad3. Bad: CGI and green screen - at some moments despite looking fabolus you can clearly, i mean clearly see the green screen moving ( every close up of WW running is awfuly done ) and the CGI being absolutly ridiculous ( Cheetah again ) which sometimes ruins the good moments in the movie Logic - I may be nitpicking but some of the moments really do not feel well explained. Like how does Steve now how to drive a modern airplane, modern looking g63 jeeps pulled me from the 80s vibe of the film, for some reason she can fly all of a sudden, and sprint with heavy objects and trucks... these are just some and there is moreOpening sequence - In my opinion, enjoyable but wasn't really necsesary at allAt the end, WW84 while a bit flawed is still an enjoyable movie with enough action and heart to make it entertaining to watch. I think that it could have been better, but sadly it was not. Would recommend seeing it in a theater for the lovley looks.6/10 for me"}, {"id": 1, "text": "Saw an advanced screening - this was the most excited I've been to see a movie in a very long time. It appears I'm in the minority who found it to be, frankly, terrible. While the performances of the leads were enjoyable, I found the movie's writing and direction so flawed as to be practically unwatchable.Gadot continues to embody WW laudably, if leaning at times toward overacting. Pine is effective as the fish out of water launched several decades into the future, even if some of his comedic moments with Gadot fall flat. Pascal plays a classically over-the-top 80's villain with enthusiasm - it seems he relishes every moment getting to play a bad guy. For me, Wiig gave the strongest performance of the first act - her comedic timing is given plenty of time to shine, and the audience has ample opportunity to empathize with her. Unfortunately, these four performances were not enough to dig this film out of the hole the writers created.Written with an over-inflated sense of self-importance, riddled with clunky dialogue trying desperately to convey depth and universal truths, the end result is an endless stream of cringeworthy, eye roll inducing lines that are so on the nose I wonder how they made it out of the writing room. At no point does the film treat its audience with intelligence, opting instead to spoon-feed every concept. How do they convey that WW is not only an action hero, but an advocate for the humanity in all of us? By forcing her to deliver gems like But Barbara, what about your warmth? What about your humanity?Further issues, presented as they occur to me as I tire of reflecting on this mess:Why is the heist scene so intentionally campy? The movie is *set* in '84, not *made* in '84. Fortunately the remainder of the film abandons this style.Their *most* creative way to sell Barbara as awkward but likable is to have her drop her briefcase of papers? Couldn't come up with something original?All Smithsonian employees have access to an unguarded airfield? A WWII pilot can understand the controls?No fully-fueled fighter jet has a range to fly DC to Cairo.WW has only ever vanished a coffee mug in all her trying, but can suddenly vanish the jet because she must.I know we're racing against time to save the world, but let's go fly through some fireworks. It'll look cool, promise.One moment WW can effortlessly sprint pushing a disabled armored vehicle down the road, the next she can't push two of them apart with all her might.The moment she rolls along the road with the two children in her arms is astonishingly poor CGI. Throughout the film, the most obviously CGI'd elements simply have no weight to them.Don't play the audio of Steve's how to fly speech over the moment WW takes it to heart and learns. Trust your actors and audience. Show, don't tell.Max didn't think to steal health in return for wishes until the end of the third act?Cheetah has practically zero screen time to pose a real threat. One fight and she's dealt with handily.Hundreds of nukes launched, and they don't vanish - they crumble in mid-air. This is somehow not a problem for the planet?Returned to the white house grounds, Max somehow lands within yards of his son who has been wandering abandoned highways?Linda Carter's cameo was *painful*. If she didn't actually smile and wink into the camera, it sure as hell felt like she did. I won't be re-watching to find out for sure.I'm tired of griping. I wanted so badly to like this continuation of the DCEU. I'll be there for the next one hoping for better, but my god was this a disappointment. I saw the movie for free and the cost was still too high."}, {"id": 2, "text": "Very long winded and quite soppy, I found myself getting quite bored. I m not really sure what this movie is trying to be, a drama love story maybe with a few action scenes. Disappointed."}, {"id": 3, "text": "I was honestly shocked by how bad this was.First, Kristen Wigg is NOT a convincing villain. I adore her, but Cheetah was not for her. Second, the CGI/effects are terrible. They look unfinished, but they're the final product. Third, the lack of action for a superhero movie is embarrassing. Mary Poppins has more action than this! Fourth, the story is seriously lacking. Instead of action like it should have, they have emotions to make up for it's lackluster feel.I won't spoil anything, but this was seriously disappointing."}, {"id": 4, "text": "The sequel to Wonder Woman was rescheduled time and time again because of the emergence of COVID-19 and cinemas being off limits. It's finally been released however but can also be streamed on HBO Max which has made some to say that cinemas may be a thing of the past.So is this sequel as good as it's amazing first film?The film opens with Diana reminiscing to when she was a child and taking part in an Olympics style event in which she excels until she is felled by a tree branch which makes her fall from the horse that carries her but then decides to cheat to try and take the lead. She is found out to have cheated however and whilst she is heartbroken at not having won she is told that her time will come. This opening is in keeping with the first film and is fantastic.But as the film then flashes forward into 1984 it starts to come seriously unstuck. It's easy for films to fall into a kind of exaggerated, unrealistic and truly irritating parody of a decade especially one that is larger than life like the 1980's. The film falls headlong into this trap and so the 80's we see is wall to wall bad fashions, people eating fatty foods in abundance and littering. It feels fake and manufactured. If there was a hashtag that could be used here for the Twitterati it would be #notmy80s. 'Ah but this is the vision of the 80's that is individual to this film and Patty Jenkins' I hear the comic fanboys screaming. Then in that case it just plain sucks.There then comes an action sequence in a shopping mall in which WW foils a robbery. It's so pointless and pathetic that I actually shouted out in the cinema 'This is awful!' I even for a nanosecond thought of walking out. This would have set a new record for the fastest time I've walked out of a film, having lasted only ten minutes watching Freddy Vs Jason.Fortunately the film calms down on the over the top 80's schtick as we see the main narrative for the film- an artefact known as the dreamstone which can fulfil the wish of those who touch it but with a catch. For every wish, the person loses something else dear to them. When I heard of this premise for the film it seemed fine. But as is stated by characters within the film, this is actually based on the urban legend of the 'Monkey's Paw'. When I found this out (and by characters in the actual film!) the premise disintegrated right before my eyes. I felt robbed and the whole premise for the film felt lazy. In fact, very quickly in the film I found myself thinking 'I really don't care what happens to ANY character in this film'. Nothing in the film's runtime swayed me from this.Diana wishes for Steve Trevor to come back and hence this is how we get Chris Pine back in the sequel. However, with this wish coming true we see WW start to lose her powers. The scene where we see him reappear should have had a massive emotional pull for the audience. There was nothing. This film is just like it's depiction of the decade it takes place in- all surface, no depth.We are introduced to the socially awkward Barbara Minerva who wishes to be just like Diana. She gains her wish. She later wishes to be an 'apex predator'. Again, she gets her wish and transforms into supervillianess Cheetah. The first glimpse of Cheetah was so naff I actually burst out laughing.We also get another baddie in the form of 'orange man bad' Max Lord who is based on Donald Trump. Theres even a border wall in the film. Hmmm. The President of the United States in the film is obviously based on Ronald Reagan. There are even allusions to his Alzheimers with him saying that felt completely disorientated and 'somewhere else' during one scene. Or maybe with such as admission he's based on Joe Biden instead.The real problem for me throughout the film are the scenes that involve Wonder Woman which is massively problematic based around her character. The action scenes contain the worst examples of CGI I've seen in a long long time. There are times when Wonder Woman feels more like an action figure in a really badly conceived computer game from the early 00's.There is also a scene in which we are introduced to a new power that Diana unveils. She can turn objects invisible by simply touching them. This made me roll my eyes when I had already rolled them far too many times already. 'Maybe she can also make this film half it's running time' I found myself thinking.Another scene that had me rolling my eyes was when Barbara decides to go to the gym when she discovers she has superstrength and decides to lift weights. There is also another cringy scene when she bumps into the creepy guy who harassed her earlier in the film.But there are scenes that work. When Diana finds out she can fly it's through a statement Steve has made earlier in the film about his love of flying. These scenes are beautiful to behold and don't involve dodgy CGI. This scene works amazingly well. If only the care and attention that had gone into this scene could have been applied to the rest of the film the whole movie would be more of a rewarding experience.I enjoyed the scenes of Max's health getting worse with every wish he bestows. This could have been exploited more with him disintegrating more radically throughout the film a la the undead character in An American Werewolf In London. But I appreciate that that might not have been appropriate in a film aimed primarily at children.When Diana has to say goodbye to Steve so that she can get her powers back, again, there should have been more emotional resonance for the audience. Again, there wasn't any.In fact when I heard that Diana was to lose her powers to get Steve back I instantly thought of Superman 2 with Superman willingly renouncing his superpowers so he can enter a relationship with Lois. But whilst I was hoping for a sequel as good as Superman 2 for Wonder Woman instead we got Superman 4: The Quest For Peace resplendent with a naff call for world peace in a nuclear free world.After the first film I would have wished for a sequel. After seeing Wonder Woman 84, I renounce my wish."}, {"id": 5, "text": "I can't believe how the studio approved this script 😓😡🤢"}, {"id": 6, "text": "PROS The Cinematography is top notch .The Score is good .The chemistry between Gal and Chris was enjoyable .CONS Gal was at her worst . she did a decent job in the previous installement but this time she was way off the mark .I love Chris Pine . He is an underrated actor and i enjoyed his previous movies but his comic timing in this movie fell flat .The villains are cartoonish .They didn't get a good screen time to performe well but i can't blame them coz the writing sucks big time .The CGI looks Really Bad .The dialogues were cringe-worthy .The action scenes were barely entertaining .All in All . One of the worst sequels i heve ever seen and it's poorly written and directed . Save your precious time and watch the first wonder woman is more entertaining and fun to watch ."}, {"id": 7, "text": "Interesting how polarised the reviews are, personally sI liked it but thought like a lot of people that... in summary: Gal Gadot was magnificent. Wonderful A+ actress. She has found the role of a lifetime. Kirsten Wigg was not the right casting and poorly written for - she didn't make me think nerd or scary ever - Cheetah was onscreen for maybe 90 seconds? Why even bother then, no tension at all in her. Pedro Pascal - well cast and did right by the role but Max Lorre was hammily written, started great but got worse and dare I say obvious. Chris Pine is well used and provides the comedy. He obviously enjoys working with Gal Gadot and the chemistry shows. The direction was great, I have no problem with the production and execution of the film and Patty Jenkins knows what she's doing. But the script.... oh my. See above plus not enough action (what there was is excellent) including not supervillain-based combat. Several scenes were fine but just too long, the flying comes too mind - 'very cool!' then 'OK yup we get it' then 'can we now do something else pls?'I liked the film and glad I got to see it in the cinema too recommend that to all - but if you were to miss it I wouldn't blame you - unlike the legendary first film.I hope there is a 3rd and they sort the script.PS: I didn't think it was woke at all, or that he was based on Trump - literally never crossed my mind during or now. Don't bring your agenda to someone else's story people!"}, {"id": 8, "text": "Very boring movie! Gal Gadot is great but the story and the movie was not interesting."}, {"id": 9, "text": "Probably my expectation was too high for this film, story line was messy and so many things were going on without clear explanation of the events.Only thing it was worth watching was Gal Gadot, she is so pretty and handsome, one of the best actors who can fit in Wonder Woman role."}, {"id": 10, "text": "Can not believe Patty Jenkins has created this feature. If Wonder Woman is a milestone then WW84 is a typical summer movie"}, {"id": 11, "text": "One of the worst movies of all time Super boring with boring supposedly sweet moments, they took it too far. Thr worst storyline The worst vilian DCEU WHAT ARE YOU DOING???"}, {"id": 12, "text": "Illogical screenwriting, cheesy jokes, cheesy dialogue, its everything you want when you are looking for a movie to laugh AT In 2 hours and 45mins, the action sequences are maybe 20 mins and ultra low quality. In all honesty, this is a download kinda movie. Save the cash"}, {"id": 13, "text": "Nothing happens and there's nothing to care about for the 90 mins we managed to sit through. So boring."}, {"id": 14, "text": "The 1st WW film was absolutely brilliant and had more ticks than a farmer's dog in my book. WW84 is, which truly saddens and maddens me, the polar opposite. It has a script so weak it should be classed as highly vulnerable, a plot that has more holes than my kitchen colander, and characters about as believable as a career politician. I did love the opening island scene where the girl actress playing the young Diana was superb, and apparently did all her non-cgi stunts. But then it went downhill faster than an illiterate skier passing a 'Warning - cliff ahead' sign. I won't go into detail over WW84s failings as I have a bus to catch...in a week, but I think I can reveal my favourite, jaw-dropping line from the film without it being a spoiler...'... I want to be an apex predator!'It certainly made me growl."}, {"id": 15, "text": "If you like to watch slight better version of Batman vs Superman, then you can watch this. Otherwise, don't bother."}, {"id": 16, "text": "First 15 minutes was the best, and literally did not contribute to the story... not one bit.Ok where to begin...: Lasso of truth? More like infinity flying power bulletproof magic LassoMain villian is a genie in a rockStoryline is people wishing from said genieMost climatic fight scene is in the trailer.... seriously.. its wonder woman fighting a leopard/ tiger thingy....Main villian is defeated by saying 4 wordsNo emotional connection to characters, shallow and uninspiring. (literally if anyone died, you just wouldnt care.)no consequence after saying those 4 words. things magically became normalI dont get how is this even rated past a 5. Critics rating it 9?!?! Really suspicious. Must be some market manipulation.I literally created an account just to write this... Dont watch this pls. I wasted my time and money, hope you dont make the same mistake."}, {"id": 17, "text": "On its absolute worse day, WW84 could easily score a 6 or more ... easily. Was it perfect ... no. Is it worth your time ... definitely. Should it be seen on the big screen if possible ... without a doubt. It's pretty easy to spot the Depp and Heard trolls with the 3s and below. As always, if you a DC fan, watch and have some fun, and decide for yourself, don't rely on me or anyone else."}, {"id": 18, "text": "Expectations lead to disappointment.... Yes I do expect a lot from this movie but I was disappointed... But when I watched this movie second time with different perspective, This movie was not that bad. So what we can say that it depends upon your perspective or what you are expecting from this movie.. If you are expecting a lot of action , you will definitely be disappointed. So keep you expectations low and then watch this movie, you will definitely going to enjoy this movie"}, {"id": 19, "text": "Poor writing, awkward acting, childish special effects, not good directing at all. I have no idea what they were trying to do here. No action, lots of senseless emotions being thrown around. Do yourself a favor and save your money don't go see this in theaters. I swear you won't be missing anything."}, {"id": 20, "text": "How wonderful was the first WonderWoman, so bad is the second movie. Lack of action, a lot of unneccesary drama, weak anthagonist, strange changes in WW character and actions, and total boring and stupidity.... I start looking at my watches after 1 hour of movie, on the 2nd hour I am start thinking of leaving cinema... The only one thing is good in that movie - Pedro Pascal's acting"}, {"id": 21, "text": "The fact that in the film the world become a mess because of the wish thing shouldn't mean that the movie itself should be a mess, but it's.But it have a touching moment with the main characters and a good scene in the sequence, it also have good message in the final battle."}, {"id": 22, "text": "It's a simple plot about a stone that can grant your wish.. Then one guy, Max took it too far and asks for too much.. The wishes become more and more silly.. First he asked to be the stone itself then he asked for oil in his acres of land.. then he went all the way to Egypt to see the ruler there just to get more oil.. Then suddenly he wants to be more powerful than the president and then he wants to absorb health and energy from everyone...Lots of silly things in between like WW suddenly can make a plane become invisible.. She only succeed to do so with a mug before.. And just for a short time..and why max didn't ask for a better health earlier.. And why Barbara turned into a silly not so great cheetah like creature when she wishes to be number 1 and powerful?So in the end Max did not need to physically touch everyone but the signal broadcast is enough for the wishes to work? How he is so sure about that when the writings on the stone stated you have to touch it to make your wishes come true.. In all the movie becomes too messy and dragged towards the end..Gal Gadot is great in this movie but it is not enough to save the silly messy plot"}, {"id": 23, "text": "Wonder woman 1984 is terrible, it's cartoonish, it's goofy, it's cheesy ands makes little sense. They should have copy the first movie's style but just change the third quarter since that is the worst third quarter of any super hero movie i've seen. This movie was kinda like superman 3 the quest for peace but much worse. G al Gadot can't act so should have been protected more like she was in the first movie by using chris pine's acting skills more to make up for G al's lack of no acting talent at all.. all she does is try and pout like in 'imagine song' thinking that the audience will fancy her and forget that they're watching a terrible movie. If this movies had come out in theatres as per normal in 2019 as it originally should've it would have flopped...hbo max / covid has saved this movie from embarrassment...and patty jenkin's is smart to secure a new job with star wars before this movies release...because her star wars might suck...after watching this goofy dumb movie..."}, {"id": 24, "text": "As much as I don't disagree with the 1 start raters too much, this was pretty awful but at the same time I've seen much worse films so instead it gets a 3. The dialogue was written by a soap opera aficionado and the plot by someone on crack. Gadot delivers it as well as anyone could and I might forgive her more if she wasn't listed as a producer... meaning she had the power to say cmon, this script is horrendous! Still, there were a couple of iconic Wonder Woman reveals that I enjoyed enough to get it 3 stars.. especially the mid credit scene."}, {"id": 25, "text": "Not sure what I expected but it wasn't that. Poor story line.Wouldn't even be worth a second watch."}, {"id": 26, "text": "Story is completely illogical. Very bad CGI but; some visual scenes are good. Well in summary this movie is just a waste of time."}, {"id": 27, "text": "After the most amazing first movie I was looking forward to the sequel but...such a disappointment! Cliche, lame plot with few action scenes. The main character appears weak, uninterested, secondary...Comparing to the villains who are it seems the highlight of the movie unfortunately....Shame!"}, {"id": 28, "text": "Quick non-spoiler summary before I dive into spoilers; there is no semblance of a plot in this movie, it's just some weird rubbish about a wishing stone like it's the real life embodiment of the make a wish foundation for everyone and you don't have to be dying. The CGI is some of the worst I've ever seen given the advances in CGI over recent years; this movie looks like it could've been made in 2004 and no one would've batted an eye lid. Spoilers on some of my favourite CGI moments from this movie below. What really redeems the film is the performances from the main cast, in fact I'd say all of them did a genuinely great job. Gal Gadot, in spite of the film's glaring weaknesses, impressed as Wonder Woman and offers a better performance than she did in the first film, Kristen Wiig performs well as the goofy character that then turns into a popular, sexy figure around the city and then eventually, powered by not wanting to return to the goofball version of herself, becomes filled with jealousy and this eventually leads to her becoming The Cheetah. Unfortunately, the animators seem to have took a page out of the books from the movie Cats, as The Cheetah is a total and utter abomination to behold. There's a reason she's only seen under darker lighting during her 5 minutes of screen time, absolutely horrific but again that's down to the CGI team. The best performers in my opinion were Chris Pine as Steve and Pedro Pascal as Max Lorde. Their acting performances were genuinely brilliant and captivating at times, which helped to draw away from the film's glaring weaknesses. Pedro in particular was great as Max Lorde, it's just a shame that he was let down by a silly excuse of a plot.Spoilers from here on in!!Returning to the plot and why it's so rubbish, a random stone that essentially grants wishes is found in a jewellery store's back-alley black market. The stone was powered by the God of lies and as such if you use the stone to make a wish it takes something away from you; your greatest strength. The woman who becomes Cheetah knows Wonder Woman (WW from here on for short) for all of 5 minutes when she asks the wishing stone if she can be like Diane. She doesn't know that Diane is WW, she just likes her as a person and as such doesn't realise she'll gain WW's abilities. The stone takes away her humanity from her essentially, and she just becomes an inhumane husk that enjoys being so powerful because 'she had nothing' even though she had a very good high paying profession and a likeable personality. Her story arc coincides with that of Max Lorde, a business man who was originally going to purchase the wishing stone from the black market. Cheetah gets her hands on it originally because the FBI sent it to her so that she could investigate it. Max Lorde finds out that the items were all sent to the museum where Cheetah works and pays them a visit, putting all of his funding into their department and throwing a party. At this party, he asks Cheetah if she'd like to go up to her office with him. They go up, make out, Max finds the stone and Cheetah let's him 'borrow it'. Except it isn't borrowed, as big Max decides to become the stone as his wish. His business is failing and he wants to secure a legacy for him and his son, so when he holds people's hands and asks them to make a wish the wish will come true. He can also control what he takes in return for the wish, and uses it for the most part to take everyone's oil at first. However, he finds that the wishes are causing him to become very ill. After a visit with the president, he finds out that their is a system that allows for someone to take over every tv on the planet with a transmission. The particles that touch people after they go through the TV are somehow enough for Max to be able to grant everyone's wishes. At this point, WW tries to stop him but is stopped by Cheetah before she becomes the abominable cat creature. Oh yeah, WW wishes her dead boyfriend back to life and it took her powers from her so she gradually gets weaker throughout the film and is such is absolutely pummelled by Cheetah. Cheetah then escapes with Max. Max grants her another wish and she wishes to become 'an apex predator', leading to this unholy curse. If Cats was the cause of 2020, then this abomination has doomed us to more suffering in 2021 you heard it here First ladies and gentlemen. So to stop Max from granting everyone's wishes and becoming all powerful, WW relinquished her wish and her dead boyfriend dies for the second time, which everyone knew was bound to happen. Commence a sequence of her running away and getting her powers back with some utterly awful CGI that made me wheeze during the film. She then takes some random Amazon girl's armour which could withstand the force of every man (as she requires some plot armour - more on the aforementioned girl later). WW then finds Max but is blocked by Cheetah, who rips the armour to shreds like its nothing. As expected, more plot armour is required for WW to win this fight so they are fighting beside a transformer station and cheetah decides to swing from the electric cables. This causes them to rip and inevitably their fight takes them into a body of water. As you guessed, WW plunges the cables into the water and electrocuted cheetah to the point f being unconscious but she's perfectly fine as plot armour requires it. She then finds Max in a building granting everyone's wishes through the tv. As you expect, the negative effects of this lead to nukes (obviously nukes; it's the Cold War guys this has to be the ultimate threat!) being fired by America and Russia and lots of people start dying. By granting these wishes Max also takes people's health and life source so that he can remain strong and powerful, causing more death. There's a lot of wind around Max, essentially a hurricane that WW can't get through, but as expected plot armour prevails again and she sneakily gets her lasso through the hurricane and wraps it around Max's foot, defeating him through the power of love and truth. Everyone renounces their wishes, Max goes to find his son and Cheetah wakes up and both her and Max face no consequences. Max also gets a chopper back to DC and finds his son with no issue at all. The end.Utter rubbish. I genuinely think my description of the movie may be making it look better than it is. I'll tell you one thing, it certainly looks better than the CGI. My favourite CGI scenes in this movie;-The swinging sequence in whatever that trial at the start was for looked absolutely horrendous. It was so obviously fake looking that I could've sworn I saw the green screen.-Every time WW runs super fast looks hilariously bad. This also applies when she learns to fly.-The sequence where she lassoes around the shopping mall is an abomination.-Cheetah when she becomes Cheetah is a cancer to the eyes and looks just as bad as the creatures from 2019's Cats.-My personal favourite; Chris fires an RPG from a Jeep/Tank and WW lassoes onto it and swings in front of the tanks they are chasing to grab some kids who are playing on the road to stop them from being run over. However, due to her power's weakening, she loses her grip on the lasso when she grabs the kids and while she's holding them they start rolling, like Neymar after he feels a gust of wind. The resulting rolling sequence is utterly hysterical, with animation that would look like a blush of inadequacy in the movie Sharknado. They're left lying in the middle of the road with the tank approaching so how do they survive? The tanks just swerve out of the way. What a waste of time.Overall, scoring this film I give it a 4. The plot is terrible and the CGI is embarrassing however it is redeemed by great acting performances and a great soundtrack. I'd personally put it in the 'so bad it's good' category as I was laughing a lot during this catastrophe. If you enjoyed Sharknado, you'll enjoy this."}, {"id": 29, "text": "Worst movie I have seen in a long time. I was bored within the first 30 mins and would have walked out if I knew I could have gotten a refund. The plot is just plain bad. Bad CGI/graphics, More successful as a failed love story than a super hero movie. DC movies always feel a little lacking that something special but this one is just a pure bomb.So embarrassed for Gal Gadot."}, {"id": 30, "text": "1.- 90% of this movie is a Romance Comedy straight up from the late 80's, the other 10% is an action movie based on a comic book hero. 2.- Cristen Wigg as Cheetah might be the worst casting choice since Halley Berry as Catwoman. 3.- C.G.I. as mediocre as it can get. 4.- A lot of cringe inducing dialog 5- I am sorry for Gal Gadot, but after that Imagine viral video.... I couldn't concentrate on her performance."}, {"id": 31, "text": "The review scores and review content from critics seems to be disconnected but I instantly digress.This movie was a mess from start to finish with a ridiculous plot device that could only send it down a road that makes it nonsensical. Gal Gadot is excellent in her role but Kristen Wigg had the same trajectory as she did in Paul (except she didn't end up turning into a cat in Paul - someone needs to explain to me how this happened anyway).On the flipside, there was some very visually spectacular scenes, some solid sound and excellent score by Hans Zimmer."}, {"id": 32, "text": "First off the soundtrack was great as well as the visuals.But unlike the the first movie the plot just kept tangling together at fist they give some references to the superman saga but as you go on the plot becomes more confusing by the minute . There's a nice final battle and a twist so look out"}, {"id": 33, "text": "While not flawless (it feels about 15 too long) this is a great Wonder Woman movie. Patty Jenkins, the writers, and Gal Gadot perfectly captures the both the character's strength and the trademark compassion that sets her apart from so many other superheroes. The action takes a break in act two, but when it hits it's stride it's breathtaking. Chris Pine and Kirsten Wigg are solid, but Pedro Pascal steals the limelight from everyone but Gadot as the wonderfully layered protagonist Max Lord.this sets a firm nail in the coffin if the dark Man of Steel and BVS efforts the WB kicked off with. Jenkins reminds us yet again that superhero moves should be FUN, and also show us the inherent nobility of the genre was built on. Worth a second viewing :)"}, {"id": 34, "text": "It is the worst movie I've ever seen. It is the worst movie I've ever seen. It is the worst movie I've ever seen."}, {"id": 35, "text": "Don't know what people have been smoking to say this was bad. I really enjoyed the theme of this movie. I feel a lot of us are never content .. with anything we have! And we always keep reaching for the stars with no end in sight cause of the Greed mentality which so much of us have been taught is a good-thing, (where this movie does a great job of exposing through the 80's era where materialism was beginning to take center-stage in the WallStreet era).Patty embarks on a telling tale, exposing the difference between truth and Lies. I was especially moved at the scene where Wonder-Woman had to let go of the Love of her life: Steve in order to do what is right .. You can really feel the weight on that scene! and I'd say it's far better than all the CGI-Fight scenes we are used to with the kind of Superhero movies we watch.In all, I'd say if you are looking for a movie with a good story line, that plays with your conscience (the right way), then watch this. If you are looking for some cheap-thrills and some fancy action-scenes, this isn't your cup of tea."}, {"id": 36, "text": "I was expecting a decent movie at least. It turned out the movie was so boring. I almost fell asleep a few times and my wife had to drink a lot of coke just to stay awake. We agree 100% with others' 1 star review. Still a good time killer in the pandemic though..."}, {"id": 37, "text": "I had so much expectation going to see it but it doesn't live up to the hype. The first movie was great, this one is a drama."}, {"id": 38, "text": "It was a wet afternoon in a nearly empty cinema on the south coast of England. The character build up was quite good, but when the story got going it was all downhill. Cheesy story line, and over the top effects. Make sure you stay after the closing credits, that scene was the highlight of the movie for me."}, {"id": 39, "text": "Wonder Woman 1984 is the second collaboration between Gal Gadot and director Patty Jenkins and it's an amazing film in terms of story and action. Gal Gadot has been fantastic as Wonder Woman, which became one of her memorable roles in the DC Universe and she was born to play that character. In addition to Gal, both Kristen Wiig and Pedro Pascal delivered incredible performances as Barbra and Maxwell Gold. Go watch this movie on the big screen and you'll love it."}, {"id": 40, "text": "First we get 40 minutes of pre movie gibberish that's so cringe worthy my mate walked out of the cinema. Then we had over 2 hours of the worst acting and producing I have seen in a long time, maybe since The Last Airbender. They should be ashamed of this movie."}, {"id": 41, "text": "As stated above, to be honest. We just had our cinema ban lifted here in Malaysia, I got on the first screening in the country together with thousands other people nationwide with the increased ticket price, distanced seating, etc.and lo and behold...it's a drama!Action? Sure, here and there. Fantasy? Yeah, obviously. Comedy? Of course, a bit. But in its entirety, it's a drama. It's like watching ... a DC-ed, Pixar-esque / Disney-ed, live-action movie...yeah. Movies like Maleficent, Beauty &amp; The Beast, Mulan came to mind...somewhat similar feelings.All I'm saying is; if you expect it to be like the 1st WW or the Justice League - don't."}, {"id": 42, "text": "It is so bad that at some point you start laughing with the ammount of ridiculousness. The writing is just utterly terrible. Several times it crossed my mind and you could hear other viewers in the cinema asking: Who wrote this s***?. I do not understand how this movie has such a good rating when it is so utterly disappointing, with no consistent plot and with absurdities that will make you facepalm yourself throughout the movie. I understand that a lot of critics cannot be honest as they would destroy the movie so much that people wouldn't watch it and it's 2020, we are trying to be generous. But the rating given by them is just completely out of reality."}, {"id": 43, "text": "You cant just look the part you have to be the part. Gal Gadot might have the looks but she doesnt have the acting talent to play what the director was trying to achieve. She has no emotional range and forces everything. Her accent makes me think she is this generations Arnie! This film falls very flat on many levels. Although the villian was by far the best actor in the film, they could have chosen a better character for WW to go up against. DC has such a wide range of villians but they never pull the trigger on the big ones same case with the justice league film. Kristen Wigg was decent and brought some well needed flavour to this bland dish. Chris Pine was pointless as Gadot couldn't portray the emotions required to sell me that story. There wasn't a lot of action just a lot more drama. Wait for this come out on netflix or something dont waste your money unless your bored which in these times i dont blame you for being so! Overall just a bland story with strange plot holes that make it seem incomplete."}, {"id": 44, "text": "Wonder Woman 1984 is POWERFUL, BIG, BOLD, BEAUTIFUL and STUNNING from the Epic opening scenes on Themyscira showing us some fantastic environments to the beautiful airplane flying in the fireworks scene, this movie has it all, nostalgia, love, and hope. The way Gal Gadot plays the role Wonder Woman, looks like she was born to play this role. The movie made brought the emotions in me, I never knew a movie could bring. This is definitely the movie 2020 needed to end on!"}, {"id": 45, "text": "Good movie after dark knight this is the great life lesson movie in dc.steve always turn diana in positive thinking only.some guys r not liked this movie y i don't know.if u don't understand movie see another time."}, {"id": 46, "text": "Why can't DC create a decent movie, my goodness this was awful. Clunky writing, dreadful dialogue, terrible flow, dodgy cgi, consistent over acting, silly story line and did I mention boring! Even the post credit scene was cringe worthy and pointless.Can I get my money back?"}, {"id": 47, "text": "I am shocked how well received this movie was on IMDB and RT. Wonder Woman was a well made, well written and well acted movie, but WW84 is really dumb. It would be fine if it is entertaining mindless fun type of dumb, but it is the I don't care what happens on screen anymore type of dumb.Dialogue made me cringe many times, many of the character arcs, connections and emotions are not believable. Everything felt forced and fake, where the characters uttered implausible lines only because they are on the script. The actors gave their best to made the clunky story work. It feels like the director was more keen to create an expensive spectacle this time, instead of tell a good story about the character."}, {"id": 48, "text": "Good But not very good not best ok thats fine My aspirations is so high"}, {"id": 49, "text": "Horrible writing, horrible CGI, horrible acting! The story is too shallow, conversations are cringy, the villains make no sense, fighting scenes were really boring, and the movie is too long!"}, {"id": 50, "text": "So excited for this movie, with so many deaths and tragedy in the year 2020, this is the movie I needed to take me far, far away. Firstly if you're one of those 'Marvel comedy sitcoms' it might be too good a film for you to handle. No actor embodies a comic book superhero as incredibly as Gal Gadot, never has an actor been so perfect for a role. A marvellous film overflowing with all the magic that made Wonder Woman the most interesting comic book ever. This is one of the greatest films of the 21st century full of positivity and female empowerment, never have we needed Wonder Woman quite as much as right now. As a male of the species I bend a knee to the women of our world, as they are our future our saviours our true leaders, the world couldn't be safer than in their hands. Special mention has to go to Lily Aspell who once again shines as fearless young Diana."}, {"id": 51, "text": "Where do I start. First film for 10 months and I was disappointed.Where to start...The story line. Oh gosh.... so random and far fetched. What was the 10 minute fireworks display all about? And some fuel in the fighter jet going all the way to Egypt. Not to mention the random new invisibility skill Oh yeah a ww2 fighter pilot can suddenly fly a fighter jet. Yeahhhhh what a load of nonscience.WW can fly based off a conversation.... yeahhhhhhRubbish. Other that aquaman DC are no way near Marvel."}, {"id": 52, "text": "All this critical acclaim and the reviews for this film are so baffling .What's wrong with you guys? The first WW was good ( not great ) . It deserves a solid 7/10 but this one is by far one of the worst superhero movies i have ever seen .* Atrocious Screenplay . * Lame jokes . * Cheesy dialogues . * Slow Pacing . * Poor CGI ( Especially the scene when WW saved the 2 girls from the tank was really hard to watch ) . * Poor Action Sequences ( The fight between Cheetah and WW was ridiculous ) * Cartoonish Villains . and not to mention the final scene between WW and Maxwell Lord which was really cringe-worthy .the movie looks like the old Superman movies but with a big budget .Sorry but even if you brought an A-List actors . They wouldn't save this mess . Save your precious time and watch the previous WW or anything else .An extra point for the genius Hans Zimmer ."}, {"id": 53, "text": "Given the title, i thought it would be full of 80s music, references, etc. Much to my disappointment, i dont get why they called it WW 84? Or why they did it in 80s? The story it self could have taken place in any decade and wont make a diff to the story.Secondly, the movie is 2.5 hours and had because it prolonged scenes out of proportion, or even scenes that are simply irrelevant to the story and just wasted our time!The movie was too slow, gal gadot cant act, kristen wiig acts the same in all her movies until she became bad, she did a good job, chris pine is ok, pedro pascal is the ONLY TOP NOTCH actor.Overall, its a complete disappointment!"}, {"id": 54, "text": "I am no longer surprise that DC Comics would/could make movies that bad. Lazy writing/Script, poor acting except for Pedro Pascal and if it wasn't for him the movie would be a complete failure. Weak action/fight scenes. Borrowed soundtrack from Sunshine &amp; BvS Dawn Of Justice which shows how lazy they were. I liked Wonder Woman first one (2017) but this one I really hated it."}, {"id": 55, "text": "Wonder Woman 1984 is movie full of passion,love,hope,and action.On the other side only one thing bothers me is lack of let's say better conversation between characters,but other than that movie was GREAT."}, {"id": 56, "text": "This movie was almost perfect, the villains were spectacular, the cinematography was beautiful and the colorful style of the 80's somehow fits into the movie very well. Acting is super, and I'm glad DC brought Patty Jenkins to this movie too because she does it justice. Glad to see DC bringing out the big guns with their recent movies like Shazam, Joker, Birds of Prey and now this.I'm also glad they gave it a long runtime, because that was my one of my only issues with BOP, the short runtime. But hey, this movie is a Wonder Woman movie and it has a bigger budget, so I'm pretty sure they weren't afraid to go all out. Can't wait for the next movies in the DC line up, this just got me even more pumped!I hope this movie succeeds, because I want more of this, and I'm sure most of you do too."}, {"id": 57, "text": "WW is on its own realm, a hopeful and positive and compassionate one. This sequel embodies that perfectly. The costume and hair/makeup department deserves credit for this one too, because the 80s era really lives on in this movie. Also Kristen Wiig and Pedro Pascal are surprisingly fit the role as Barbara Minerva/Cheetah and Max Lord respectively.There were also some cheesy, eye-rolling moments in the movie but, during this trying times, I could take those and just suck it up and enjoy the blockbuster movie cinema experience.Watch it in the cinema if possible (of course with health protocols and regulations applied) and it'll remind you of the wonderful times when we are all gather in a cinema to watch Summer blockbuster offering."}, {"id": 58, "text": "Went to the movie premiere yesterday 15th and just coz I was going to cinema after almost 10 months I had so many expectations from this movie.I am highly disappointed because the movie have so many flaws in it and script just doesn't make any sense. They missed so many things in the movie and you will get confused at so many occasions.Animation and actions are not at their best.Still I would suggest to go out and watch it coz after a long time a big banner movie came out.Dont want to spoil it more!!"}, {"id": 59, "text": "One of the worst movies I have ever seen. Every single review over 5 in here are lying, actually make that over a 3. It is 2.5 hours I will never get back. Storyline was terrible, most of the CGI was ridiculous. We wanted to walk out after 20 minutes but stayed as it was an organised event."}, {"id": 60, "text": "I went in with the (harsh) expectations that this movie was to live up to or even supercede the first installment. It doesn't. But it was still an enjoyable and great movie. There was great action, and even a Christopher Reeves Superman feel to it at some points which was nice, but I didn't get the same type of goosebumps (I still got goosebumps in a few scenes) like I did when Diana entering No Man's Land, or fighting Ludendorrf and Ares in the first movie. But this is coming from a guy who thoroughly enjoyed the extra 30 minute smash fest of Superman vs Zod in Man of Steel."}, {"id": 61, "text": "There is a post end credit scene. I've just read a review by someone saying they were floored on how the amazing ending made the whole movie for them. I'm totally lost as their comment floored and taken aback by the surprise ending would be an understatement must have felt like they were in another screen watching a different movie ending. There is nothing exceptional about the ending of WW84, post end credit scene I didn't see coming but not amazing! Let's rewind to the start. Great opening scene back in the Amazonian warrior days as Diana competing in an event when she was a little girl. Great hopes for the rest of the movie with this fun opening scene. Then fast forward to 1984 and again a great second opening scene and then BOOSH, it falls flat. We have 2 new characters on the scene, Max Lord and Cheetah (don't really see her as Cheetah until the end) and for the next 1 hour it is all about tracking down an artefact with mysterious powers, and nothing much else happens. The action scenes (way into the end of an hour) was great but not amazing compared to the first Wonder Woman movie, and they were very short lived and quite feeble. The build up for the end fight scene, when we eventually see Cheetah, was so underwhelming as it was over as soon as it started. Max Lord was quite annoying and not really one of those super villains that you are going to remember! Should a movie stand on it's own and not be compared with it's previous release, perhaps, but as it's DC Universe strengthening their superhero portfolio I would have expected a lot more here. If we cast our memories back to Man Of Steel (brilliant movie) but then no follow up as it jumped into Batman Vs Superman (which you could say was the Superman follow up to Man Of Steel) but let's be honest it was a bad movie! Then we had Justice League - pretty good but no amazing - and again no follow up to this just yet, and Aquaman which was brilliant. So we are waiting on a sequel for Aquaman and Justice League (don't count the Zack Synder release coming out next year!) Then Wonder Woman was a brilliant movie and now Wonder Woman 1984, the second outing, was nowhere as good as the first, therefore we have a trend forming here that 90% of the time sequels are normally worse therefore the third Wonder Woman movie should be brilliant. Wonder Woman had so much more heart in the character on how she lovingly set out to save people during WWI but Wonder Woman 1984 just didn't have any heart string tugging for me compared to the first. I do wonder if the Director (Patty Jenkins) has peaked too early in her career. Like Mendes did with 007 Skyfall, the movie studios banked on Spectre being better than Skyfall (which it wasn't) and then 1917 movie which rode on the coattails of pure marketing and wasn't that big a deal! The problem with Wonder Woman is it kind of gave up on the action after a while with a built up ending which fizzled out like dunking a short lived, cheap sparkler! A lot of reviewers are saying it's a breath of fresh air to give out a positive message during the current Covid challenges. Yes that's true but WW84 was never made with Covid in mind and doesn't deliver compared to Wonder Woman and Man Of Steel Is this a movie about justice and human compassion (which is the backbone of the Wonder Woman character) yes it is and the ending does have an important message about the gift of human spirit and love for each other. But it failed to deliver the overall feeling of despair and despicable human behaviour and sacrifice which was so apparent in Wonder Woman - a much better movie than Wonder Woman 1984. I hope the next installment goes back to its roots and doesn't dwell too much on unimportant storytelling which is a big criticism I have on this movie. More amazing action is what was needed, of which this movie lacks compared to the previous."}, {"id": 62, "text": "Before the pandemic i used to go cinemas twice a week , WW84 was out in Dubai yesterday , i went to watch on its first day , it was more like an event to me after staying away from theaters for 9 month due to COVID 19 &amp; it was complete disappointment. I do not want to spoil the story , it was just slow , poor fighting scenes , lots of none sense towards the ending ( watch the scenes carefully &amp; pay attention to make up ) The only thing i enjoyed about the movie is Kristen wiig performance , mind blowing at the three stages of her character development."}, {"id": 63, "text": "To sum up this film some women play quiddich, the mandolorian becomes a genie, Chris pine doesn't look like Chris pine but is Chris pine and Kristen wiig is a leopard. Gal Gadot is still a woman. My one wish would be to not watch this film. Disappointing end credit scene. I would rate this film 19/84."}, {"id": 64, "text": "Gadot a load of this! WONDER WOMAN returns and it's clear very early on that the film is bending over backwards attempting to set up this sequel and shoehorn in characters previously written out. The story has more holes than a sieve and the motives for most are sketchy to say the least. That being said, the action whips up plenty of excitement and Gal Gadot proves once again that, along with Hackman as Wolverine and RDJ as Iron man... that she is one of the best casting decisions yet!"}, {"id": 65, "text": "As usual DC did it again and made another worthless, time wasting movie. The first part was way way better and it actually gave me hope that DC can do better but today, my hope just got crushed and thrown away in a trash can.Plot, action and especially the graphics were super pathetic. Please don't watch the movie, trust me you'll not miss anything."}, {"id": 66, "text": "Very Bad, was bored. The story was stupid and the pointless. Trying to bring sum action without any good story."}, {"id": 67, "text": "What on earth are you doing WB why there is no proper continuety in story. Its like romantic comedy more than action. Who are the script writers? 5 year olds??? Damn I feel like seeing the first part again. WW84 is garbage. TV viewing is enough for this no need for imax viewing 25% extra picture to watch what their dialogues .Dissovle this garbage franchise changing directors no continuety. Just concentrate working on batman and joker characters.."}, {"id": 68, "text": "Surprisingly bad follow up to the enjoyable first WW."}, {"id": 69, "text": "Very boring Bad cgi Bad story Bad ending Dc tards well hate this review but it is the truth"}, {"id": 70, "text": "Just Full of Drama, bad plot, bad fighting coreo, but Gal gadot was Stunning!!"}, {"id": 71, "text": "It's just so refreshing to see a DC Superhero...well being a hero. She saves people, she has to give something up for the greater good and is she so inspiring. More DC movies need to be like this. Loved every min of it. The 80's theme was kinda needless though...I mean it didn't add or take away from the film.BEST MOVIE OF THE YEAR!!!"}, {"id": 72, "text": "There is a lot messing in this film. But Gal Gadot and Chris won"}, {"id": 73, "text": "Expected more. Was boring. Very thin storyline. The end was so pathetic considering that this is a super hero movie. Acting at time was never on level expected of actors in such a movie."}, {"id": 74, "text": "If you expect it to be like the last move you would be wrong but this is still a good part 2, its more about good over bad, good message very emotional especially during this pandemic, so I think everyone should watch it but keep your expectations to be something different"}, {"id": 75, "text": "What impresses me the most is the good reviews this movie is getting. Im sure critics are getting paid to write positive things about WW84.DC movies are far from being the best, but WW84 takes the crown. One of the worse movies I have ever seen. Terrible and ridiculous writing. Cheesy dialogue, absurd plot and fight scenes taken out from Bollywood."}, {"id": 76, "text": "The first film was DCs best and I loved it. I was excited to see the new film only to be let down on almost every level. The first 20 minutes where promising then....The story was poor relying on looking at the fun of the 80s and nostalgia to carry large parts of the film. Gal was as always beautiful but even this could not carry this film. She deserved better. Plus, if you set the rules of the film early then don't go breaking them to continue the story. One wish is all I'm gonna say...."}, {"id": 77, "text": "Two hours I won't be getting back. The story is so bland it makes white bread look interesting. And it doesn't help that the actress playing Wonder Woman can't emote and is average at best. The story drags on and on and the action is minimal at best. Some of the scenes are cringeworthy like this is 2020 and it looks like it was shot in the 1990s behind a green screen using Windows 98. It rivals Tom Cruise riding down the storm bad. If you're bored... skip it. If you have anything to do? Skip it. If you're very very bored? Skip it. The drive to the theater will be more exciting than this movie. Flipping through HBO Max to find this movie will bring more entertainment than actually watching it. I saw a free screening and still felt wasted."}, {"id": 78, "text": "With movies like this WB goes bankrupcy. It's one of the worst movies of super heros i've ever seen. The performances are poor specially from the vilan ( the spanish actor Pedro), the script is lousy and the special efects seems to be made in 1984. I really don't know how the director acepted to make this movie ( maybe the money spoke higher) but after acepted the direction of a block buster should have been made more professionally. I would say that this would be the work of a graduate student evaluated with C"}, {"id": 79, "text": "Movie is lengthy and one may not be energitic while watching, story line is too short and we guess everything, I don't know how this movie helps out for coming justice league as the characters are not that strong to make a comeback"}, {"id": 80, "text": "Doesn't surpass the first movie, though its not far behind, no real surprises but over all, thoroughly enjoyed"}, {"id": 81, "text": "Wonder Woman 1984 is an interesting film with a feeling of the 1970's TV-Series. Many films set in the 1980's looks fake about fashion or furniture, but this film looks like a real 80's film, the costume design and the hairstyles are excellent, even the cinematography is totally retro. Patty Jenkins direction is good, Gal Gadot, Chris Pine and Kristen Wiig performances are great, the production is amazing but the script is weak, some good action and sad scenes, but not more, the special effects are not that cool. A fine film, not a masterpiece but funny, the first film is better than this sequel!"}, {"id": 82, "text": "I understand the negativity spreading around this movie, less action, long movie and all. But I enjoyed it very much, its a not regular routine type of super hero movie, this carries a very strong message and also it shows how a hero can make difference through their words and good deeds, the actual meaning of a hero. Yes this doesn't stand upto to part 1 and didn't connect emotionally as much it did in the last act of its predecessor. Having said that this definitely a good movie, children will love it and learn from it as well. Trust me this will get more praises when times passes. Yes the action could have been a lot better, the over usage of Laso of truth was bummer."}, {"id": 83, "text": "As a person who loves the first film, watching ww84 did not disappoint me. It filled me with hope, optimism, and wonder especially in this terrible 2020. WW84 has a lot of surprises that the filmmakers didn't do in the first film, and that risk they took was what make WW84 wonderful.Character wise, they give a lot of depth on the characters, especially to the villains as we get to see their soft side and their ascend into villainy. The movie does them justice.Overall it's an entertaining, worthy sequel and feel good."}, {"id": 84, "text": "The 2nd Woner Woman film was very much satisfying with a strong plot and breathtaking action sequences / cinematography. The only drawback is the long duration of the film as in today's world, people don't want to give more than 2 hours for a film. But WW84 went for more than 2 1/2 hours. Rest all is good."}, {"id": 85, "text": "The film seemed very good to me, although not excellent. The narrative may seem a bit slow, but necessary. Gal Gadot perfect in her role, the expressions on her face and the physical strength she shows, are totally believable. The movie has a good pace, but it could last 15 minutes less and no sequence of the story would be missed.What I liked the most, obviously, the protagonist, with that smile that floods the screen, and makes the rest stop mattering. It's worth it, enjoy it."}, {"id": 86, "text": "I thought it's going to be mega blast super fantastic full of action. It turns out it's a drama movie with so many dialogues about life and love that we already know. Even the costume is the same. Nothing special with this movie! SAAADDD!!!"}, {"id": 87, "text": "It is entertaining and good enough, also worthy sequel and justified wonder woman series, Dc presents wonder woman 1984 is perfect"}, {"id": 88, "text": "A solid sequel, weak but enjoyable storyline. I saw this opening week in the UK, I travelled to my local cinema (34miles one way) to enjoy this film and enjoy it I did. 6 people in the screen including the wife and I. Don't let the headlines of box office flop to put you off, it can't be a success with only 6 people in a 100 seat cinema. The film is what I expected, fantastic effects, good cast, and predictable storyline. In fact for me the storyline was the sticky point, I won't go into details just incase, but the whole first section, it's a shame it bears no impact on the rest of the film or even referred to again. In short, go watch with beer and popcorn, enjoy escape and be happy."}, {"id": 89, "text": "I absolutely adored the first Wonder Woman film so I had good hopes for this movie, boy was I wrong. Cheetah is the worst villain of the DCEU, yes even worse than Enchantress from Suicide Squad. As for the plot, its good for a while but goes downhill fast, overall a really boring movie.The only reason I'm giving this a 3 instead of a 1 star is because I still loved Gal as Diana but good lord everything else about this movie was a disappointment."}, {"id": 90, "text": "Trash, short-attention-span nuggets sewn together in an altogether displeasing way.I don't care about the perceived 'political agenda' or 'social commentary' that many viewers find in the movie. I care about the entertainment factor and the sense of soulful enjoyment that these kinds of films are supposed to inspire. This particular money grab, however, can only be described as a film without a soul.Too long, too corny (coming from someone who likes Predator), unoriginal in every way that means anything and perhaps most disappointingly, a complete washy, would-be fun-loving mess. And I don't mean that it's goofy and self-deprecating. I mean it's rubbish that some tasteless fools threw too much money and too little feeing at. I love superhero movies, I really do. But this felt like no one even bothered to make an effort. Aside from a couple of goofy chuckles, there's nothing going for it. The scriptwriters should take a cold hard look at themselves, if only for having penned the pilot's moronic 'it's just wind...air...' monologue. It doesn't get much worse than that. Acting was subpar, with Wig giving the most predictably elementary performance possible. Don't get me started on the cat costume. Who gave the green light on using a giant cat costume after the Broadway adaptation's legendary failure?Soulless and pointless - WW84's greatest impression is that you never knew you could want a movie to end for so long."}, {"id": 91, "text": "One word to describe this movie cheesy Literally, there nothing good about it."}, {"id": 92, "text": "This movie is so beautiful and heartwarming, I cried several times throughout the film. It's pure Wonder Woman in every way possible and the supporting characters are amazing as well. Maxwell Lord has an amazing arc and Pedro Pascal knocks it out of the arch. Kristen's Cheetah is also amazing and her story is very tragic and moving. This movie is more sophisticated than the first but it is still very enjoyable. Overall, this movie is fun, emotional, heartwarming, action-packed, and just the movie we all need right now."}, {"id": 93, "text": "Can we stop pretending Gal Gadot is a good actress? Why is someone who looks like a bag of bones playing wonder woman? Shouldn't she look somewhat intimidating or muscular? What do you expect, it's more superhero garbage that has no SOUL. KAL-EL NOOOOO"}, {"id": 94, "text": "We (Indians) got d chance to see WW84 two days b4 the worldwide release.WW84 ve heart emotion n strong message. It is bold,wild n empowering.....Only issue is the weak villain , xpcted Big CGI monster but it's ok .......less negativity as it's a Christmas season. Damn that girl can Fly now.Worthy movie to watch in theatre after lockdown."}, {"id": 95, "text": "Really enjoyed this movie. Love that Steve was back but heartbroken too! Gal is fantastic as WW and Kristen Wiig is fab as Barbara. Good all round superhero DC movie."}, {"id": 96, "text": "This movie is fun to watch, But there are some drawbacks, such as very few fighting scenes that make this movie look like a drama rather than a superhero, a cheetah appearance that is less than 10 minutes long and pointless, horrible CGI when Diana picked up two children in the middle of the road, super boring conversation scene between Diana and Max Lord at the end, and also the way that all the mess that happened ended up too easy and unsatisfactory. All of these things spoil all the potential that this movie can get."}, {"id": 97, "text": "Unfortunately, the film has a bunch of plot holes, and the plot itself worked just awful. Gal Gadot is beautiful, but the staging of most of the action scenes leaves much to be desired. Obviously, the authors filmed this movie not for fans of the DC universe.I would definitely not recommend this movie unless you want to watch a mediocre drama with brilliant actors."}, {"id": 98, "text": "I actually liked the first wonder woman movie. This, is an absolute disaster 😆. Half a star is a fair score. The acting is terrible, storyline is just so bad and chest!Avoid!"}, {"id": 99, "text": "It's good film with great cinematography and music the film is 20 minutes long but good watch nonetheless"}, {"id": 100, "text": "One needs some positivity this year. Yes the movie is long winded. Yes there are flaws. But we can all do with some cheer. Overall, the movie works. Especially love the focus on relationships which often lacks in superhero movies."}, {"id": 101, "text": "It has been a while since we go to the cinema and people are shifting to Netflix and other OTTs for entertainment. But with the release of 'Wonder Woman 1984', once again it proves that some movie are meant to be seen in cinemas.Two thumbs up to Patty Jenkins, Gal Gadot who portrays the heroine perfectly and all the creative heads and hearts behind WW84 for giving us the best DC movie after The Dark Knight (IMHO) that went all out not only in its drama and action fantasy, but also in hearts and the believe in humanity and kindness. It truly bring back the memories of Chris Reeve's Superman (directed by Richard Donner).From its spectacular opening towards the end, WW84 is a joyful rollercoaster ride that (hopefully) will bring all moviegoers back to the cinema. #WW84SavesCinemas"}, {"id": 102, "text": "I don't know how they approved this movie, its really bad and has no plot, ok can someone tell me why the hell they chose 1984? A world war pilot came back from the dead and he immediately knows how to fly an 80's jet. Also did I mention how boring the movie was, I mean come on its a super hero movie, well done WB."}, {"id": 103, "text": "Started well but then the movie meander slowly into mindless cliches, boring scenes, dumb convulated plots, ending with sermons. Waste of money and time. Apt ending for 2020. DC world needs to get new screen play writers."}, {"id": 104, "text": "While the MCU took 10 years to give a message, with WW84, DCEU need only 1 movie to give the same message. Don't get me wrong, I love MCU as well, as much as I love DCEU. I think both companies have different approach to entertain the audience, and both are doing good jobs in doing so. And one more thing.. Gal Gadot is the most beautiful creature on this planet."}, {"id": 105, "text": "Ignore the incels who apparently got up first thing on opening day to give this 1 star.It's glorious!"}, {"id": 106, "text": "This is an awesome movie, filled with great cinematography, and amazing acting by all the stars. This movie is better than the first one (in my opinion) and is filled with twists and turns. Awesome film for anyone who is looking for an action packed movie."}, {"id": 107, "text": "Wonderful movie with great life lessons, with a lot more intense scenes than the first movie. However there were a couple cringe worthy moments, but other than that 100% worth the watch."}, {"id": 108, "text": "Haven't been cinema since The New Mutants - (SHOCKING) movie!This however as Wonder Woman's second movie set in 1984 was just an absolute joy!Great cast, performances, action sequences and decent plot... Captured well and very convincing of the time it's set in and well worth a watch in IMAX!"}, {"id": 109, "text": "Expected more of ww vs cheetah. Especially at the climax scene. But that's not what happened in the movie. That's the only disappointing part in the movie."}, {"id": 110, "text": "The age of single superhero movies is essentially over with Avengers ruining it with an ensemble cast for everyone, unless there's a significant character development (The dark knights) or a mesmerizing storyline.This needless romantic drama masquerading as a superhero movie has neither. Gal Gadot fails as wonder woman, on screen and in real life (with her 'imagine' COVID gaffe). DC should cut their losses and focus on ensemble movies in future, or ones which have a gripping plotline or atleast a character that is able to capture the audiences' imagination."}, {"id": 111, "text": "I've just seen the movie on the cinema and like always Zimmerman get it but this time it was to much music and lack of script. The story is good but they don't get the characters to captivate you, also don't feel the spark on the main charactes either. Just an other DC movie like the Justice League. Hope they will finally make a movie worthy of the background they have"}, {"id": 112, "text": "I dont know what happened to this movie. Utterly silly and absurd plot, too many goofs in the movie and complete lack of a proper villian made it not worth the money I spend on 4 cinema tickets. And where was Diana's shield and sword? The action sequence on the Egyptian road could have been so much better, but was completely ruined. And low and behold, wonder woman at the end becomes superman???"}, {"id": 113, "text": "Wonder Wonder 2017 was very beautiful movie and WW 1984 umeedo par poori Tarah se khada utara and proved to be a rightful proud sequel."}, {"id": 114, "text": "I'm actually disappointed, I feel that if my 6 year-old son worked with them on this movie scenario, he would have done a more realistic job than that! How could a movie that achieved so much success to build the story of the second part on this stupid make you wish thing!Why does DC insist on making movies with a stupid dramatic plots that are suitable only for children, as what happened with Mother Martha case for example."}, {"id": 115, "text": "Music and action is very good story little bit slow ending is awesome."}, {"id": 116, "text": "This movie is a pure disappointment and not worth spending your money on it. Save your money for a rainy movie! They just want to squeeze any money out of you on the expensive of good acting, good action, and good story. A pure disappointment."}, {"id": 117, "text": "This movie is mind blowing. There are certain moments in the movie which are very well directed. The acting of all the actors are superb. All in all a must watch for everyone"}, {"id": 118, "text": "As a DC Fan ,first of all I have to say this, Gal Gadot is born to play Wonder Woman and this movie just adds more weight to the already concrete statement. She just exudes Beauty and Hotness. Coming to the movie, the story is about obviously truth, love and greed. Movie starts with a grand Amazonian Sports event and jumps to the 80s America. Kristen wig was great as a Gemologist and many things.Pedro Pascal's Max Lord is a TV personality as well as a businessman which was well played by Pedro Pascal. The story revolves around a Wish-coming-true stone which is there for thousands of years so u can figure what it's all about but it is in the way that's shown. Sadly, there is nothing unique and standing-out about that here in the movi except for some great costumes, action and Background score. Visually the movie was great when it's on the sky, in Themyscira and on Gal. So it was just ok in terms of Cinematography. Coming to the Score, honestly I expected a lot more than this from the Legendary Hans Zimmer it's probably the 80s theme that stung him but anyway the score was still among and similar to the bests in the DCEU . Cheetah's VFX was better than I thought it would be and overall CGI was great in some scenes and dreadful in other scenes. At least the climax was not all about protag v antog fights if anything it was well . And I personally thought the Golden Armour will be the Highlight of the movie but it only just covers WW from Cheetah's scratches that's all. It sends a warming message about the endless wants of us humans which is not very much a convention in superhero movies. So concluding Should you watch the movie? Ofcourse u should for Gal Gadot's grace Wig's rage, the characters were well connected not great. Steve and Diana were Great but I wish there'd beenore depth between them and Steve himself as well but it was fine. Even for a superhero movie there are considerably few logical loopholes. To make it much more straightforward, it's not like the first Wonder Woman. WW84 just will carry the legacy of the 1st WW movie but will not add anything more to it.In a nutshell, Don't miss the movie for it has a heart to it and frankly, nothing much.Pros: 1. Gal Gadot 2. Kristen Wig and Pedro Pascal 3. The heartedness and wholesomeness 4. Costumes and an overall a not bad Technical aspectsCons: 1. Script 2. VFX in some scenes. 3. Connection b/w characters is fine but the depth is lacking. 4. Slow paced at times."}, {"id": 119, "text": "I am very disappointed with this movie, very boring and lousy storyline. This is suppose to be action packed movie instead of slow paced romantic movie."}, {"id": 120, "text": "Gal is beautiful as always. Steve looks a bit older than last time he appeared. But he is the good side of everybody's mind I'd say. This time Diana shows a weak side inside and out. But she choose the right decision. Pedro Pascal plays Max as a not only super villain but he plays a fragile and struggle with his problem man. Maybe it's not a everybody's favorite movie, but I enjoyed it. Also I am glad to see more love scenes of Diana and Steve. They are too cute couple to see in DC comics."}, {"id": 121, "text": "Definitely a successful new take on what a Wonder Woman story can be. There's always a dichotomy with who she should be in her stories. I believe she can be both of these. Patty showed this very well."}, {"id": 122, "text": "Was very excited for this movie, the trailers looked amazing. I went to a preview screening tonight and just go home. But what I got out of it was nothing like what I was imagining it.let's start with the pros: setting - I thought the setting of 1984 was better than the first film being in WW1, added some more color and fun to the film. Kristen Wigg as Barbra - she was my favourite character in the film, (but that's also a con), Diana and Steve - I liked how the roles have reversed now so Steve is just like Diana was back when they went to London in WW1, but not it's Diana showing Steve everything Washington D.C has to offer. Hans Zimmer Score - as usual, the score was great to listen to WW flying scene - I really liked the scene where Diana takes flight in the clouds and they have Steve's voice over, but I would of enjoyed the scene to be silent with no voice over, so the audience has to actually think for what's happening in the scene and the reason behind it opening scene (young Diana) - my first reaction was that scene was so unnecessary, but writing this review changed my mind and made me like the scene since it had nothing to do with the dragging main plot. the backdrop of themyscara gave great visuals and there was some good action in the scene. cinematography - many shots looked great in the film, wether it was action shots or drama shots, most of them all looked bright and exciting or dramatic and powerful. cameo - I've seen some episodes of Lynda Carter's Wonder Woman TV show, but there were some super fans in the cinema that were cheering and clapping so it was nice to see others enjoy the cameo. now to the cons... runtime - for the films plot, the runtime of 2h30m is too much, this really could of been just around 2 hours if they cut out so many unnecessary scenes in the film. screen time for Barbra - a pro for me was that Barbra was my favourite character in the film, but she barely gets any screen time as Cheetah, so her character was basically wasted, they had so much potential for her. Action - out of the like 3 or 4 action scenes in the movie I only enjoyed the one between Diana and Barbra in the White House, but that lasted barely 2 minutes. The other action scenes were a bit unforgettable and short, especially the ending Ending - the ending was so anti climactic, it was just a 2-3 minute action scene between Diana and Barbra and then Diana taking over Max Lords broadcast and the end, like they could of done so much more with that ending fight scene. Plot - the plot really could of been in like an hour special of Wonder Woman TV show or justice league, really. it takes if I remember probably a solid 40 mins - 1 hour to finally get to the wishing stone and why it's important to the story. sub plots - sub plots are usually good to fill the runtime but this film doesn't use it well. when we get a sub plot in this film, it just completely forgets the main story line of the stone or the villans in the film, and a sub plot scene might take up a solid 20 mins of the film, and some can be really unnecessary to the story or comedic timing. CGI - Diana running down that road was like twilight breaking dawn part 2 cgi when they're running in the woods they rushed Max Lords character - we really only started to care about max lord right at the very end when we see his childhood flashbacks, but apart from that, he's just used as a soap opera character with everything to do with custody for his kid overall 3/10 for me. I'll probably watch it again in theatres to pick point some things I missed in the first viewing and maybe getting a second viewing out of it might change my mind on some things but I'll have to wait and see. But also the theatre I was in for the screening was full, about 200 people, was such a great atmosphere to be in a packed theatre since Star Wars 9 came out. Everyone was clapping when Lynda Carter's cameo appeared."}, {"id": 123, "text": "I am a heterosexual man. I hate movies that preach girl power and make all hetero men look bad..eg Captain Marvel, the female Ghost Busters, the new Charlies Angels, the old guard etc.Wonder Woman is not one of those movies. The movie never diminishes the men.Wonder Woman is a straight up fun superhero movie with a hero who just happens to be female.Honestly when watching it, I felt just as comfortable is if I were watching spiderman or any other male superhero.SPOILERS AHEAD ************ This the 2nd wonder woman movie as such, she had already become accustomed to living in Man's world, so there are literally NO AWKWARD SEXIST CONVERSATIONS in the entire movie.Gal Gadot shines here. This character is her crowning achievement much like Christopher Reeve's superman. No matter how powerful she is in a fight scene, she always remains feminine. As seen from the trailer, through some SPOILER her boyfriend is resurrected, and he helps her a lot throughout the movie. He is THE man, and when Wonder Woman is around him, she completely melts and lets him take over....even if she is the superhero (How is that sexist against men ?)Also did I mention that they kept the story feminine? I like seeing feminine women. Wonder Woman is supposed to be the ultimate woman and it is embodied here, when you realize what motivates her to fight.Also for fans of the character of Wonder Woman, the movie does some nice fan-service including some other well known Wonder Woman powers such as SPOILER: -the invisible jet her ability to flyusing her tiarra as boomerang-using the lasso of truth to its full capability.By the end of the Movie Wonder Woman's powers are fully realized and she looks friggin awesome.Again, I cannot stress enough. This movie is the full package, do not listen to the naysayers. It is perfectly enjoyable from a male perspective. And of course women will enjoy seeing an awesome *feminine* Wonder Woman"}, {"id": 124, "text": "I enjoyed this as much as the first movie. WW is the best thing about the DC universe now."}, {"id": 125, "text": "I like it , it has a good story, it will keep your attention during the whole movie"}, {"id": 126, "text": "A rare case of superhero movies where story comes first, and action comes second - not the opposite. This movie has the magical Wonder Woman touch.Hey marketing department when you guys stop making too revealing trailers?"}, {"id": 127, "text": "Not gonna lie. I didn't have a lot of expectations for this film. I mean they postponed the film like 4 times. But after watching the film, I admire Patty Jenkins. She's truly a great director. Gal Gadot was great as well. Chris Pine was charming as usual. And man don't get me started on Kristen Wiig, she was surprisingly fantastic. Pedro Pascal killed his role as Maxwell Lord. This is an uplifting movie with some dark tone, that we all need right now filled with action, drama and romance."}, {"id": 128, "text": "I enjoyed 90% of the movie ! Except the third act! And can anyone give me the reason why the CGI is getting worse"}, {"id": 129, "text": "My first movie after lockdown. from beginning till climax, perfect. I love Pedro and Kristen, both gave great performances, and of course who doesn't love Gal and Chris. A beautiful and empowering movie. The ending is kind of cheesy though."}, {"id": 130, "text": "So, About Wonder Woman 1984 ....I'm a DC boy and I love Wonder Woman . And this movie is overall good, But so much stories and sometimes not delivered fully. The Act is brilliant tho . I love all the Action Sequence . It is very different than the first film. Is it better than the first film? I guess it's not(?)"}, {"id": 131, "text": "9 for the hero 10 for the villain. Thanks Maxwell Lord for being a great villain and a great father."}, {"id": 132, "text": "Yes This Sequel Is Good For Me, but also a Little bit worse the plot doesn't make sense and I hate the villains they were so weak, and Kristen wig as Cheetah you gotta be kidding me, it's not good as they did in the first movie when they make great villains, but this sequel is still fun to watch I these pandemic situations, its superhero movie, so I should give a bad score?"}, {"id": 133, "text": "I think the movie will one of the best DC movie ever.Story line and action very wonderful............ 😍😍😍😍😍😍"}, {"id": 134, "text": "Saw it with my family yesterday I still can't get over how epic this movie is.Going in I lowered my expectations because I loved the first one so much but WW84 just surpassed every expectation I had .First of when I heard the villians were gonna be Cheetah and Max Lorde I thought they were a down grade from Aries and not really a threat after defeating a god but boy was I wrong.They totally eclipse the last movies villains as they break down Diana physically and emotionally piece by piece to the point you can just feel sorry her and cry with her .Also the action scenes are beyond epic and are probably some of the best set pieces in comic book history.A Beautyfully crafted film with Themes that is as relevant today as it was in 1984 .My hat goes off to you Patty,Gal and the rest of the cast and crew .Well done I'm pretty sure marvel fans will jump on sites just to give this film bad ratings coz its not made by Disney/Marvel but if they would really just judge films by how good they are everything wont be either black or white"}, {"id": 135, "text": "She is so beautiful as wonder woman like this title. I'm not DC fan. I don't remember the old story before, but I had fun. This movie had a long time duration presented great mission. The sky scene had a little bit bored, the others part I like it."}, {"id": 136, "text": "I liked the '80s setting. Gal Gadot gave a very good performance, Diana is strong character but is also sweet, I loved the parts where she rescued the children, Chris Pine was good too, I like what he brings to the role. Pedro Pascal and Kristen Wiig (she shows off her talent as an actress with the transition in awkwardness and confidence that Barbara exhibits after getting her wish) were very good villains, well written, you can really feel for both of them. It indulges in the '80s aspect. It's a very pretty film, it's got good cinematography, action and humor. The CGI is good, but I found the lasso effects in the opening to be a little dodgy. The movie has a very good message and it was sad what happened with Steve and Diana when she has to let him go. In comparison to the performances given in the previous film, MoS and BvS, I found the performances of Pascal and side characters to be over the top whereas the ones in the aforementioned films, I found to be more realistic. I would've liked to see a few more connections to other DC films, like a Wayne Enterprises sign etc. Simon Stagg was featured, and there should be more expanding and building for the DC Universe. It felt lonely with Diana in the movie and it was better when Steve came along, but maybe that was the idea because Diana lives a lonely existence as those around her die and she keeps a low profile, and that connects with Barbara. Hans Zimmer gives a great score, I really liked how A Beautiful Lie was included in the sequence when Max renounces his wish. The first one is slightly better as I said in the title, but both movies are well written and put together. This one isn't exactly a sequel to the first one, I would've liked if they delved more into Diana keeping a low profile, keeps that connection to BvS, and why she's doing it, then again I may need to watch the movie again for that part so take that criticism with a grain of salt. This movie isn't Oscar-worthy but it's worth a watch, I love the movie's message. Give it a watch.8/10"}, {"id": 137, "text": "Highly entertaining and just in time for Christmas. Gal Gadot was fabulous and I would have gone 8 or 9 but I hate the 80's. Even Chris Pine couldn't save the most hideous American cultural decade that comes to mind. The Cheetah was superb as well."}, {"id": 138, "text": "Arguably one of the greatest, most well-executed superhero films I've seen thus yet. Sure, there are some cheesy moments (something fairly common in these kinds of films) and minor CGI malfunctions, but the depth and excitement within overpowers it. I haven't been in a whirlwind of emotions from a movie like this in a while, nor did I expect it, and to say I was pleasantly surprised would be an understatement. Marvel could *never* attain.A must-watch."}, {"id": 139, "text": "The only thing is the lack of depth which is totally understandable as a superhero movie"}, {"id": 140, "text": "This is the movie we were all waiting for Wonder Woman 1984 was amazing it was not just like a typical superhero movie it was more than that there was the direction screenplay cgi music everything was fresh DC has shown everyone that they are back with more banging awesome movies totally a must watch movie with your whole family"}, {"id": 141, "text": "Well, to be fair, there ain't any blockbuster this year, due to the current crisis. But, while i got so much complaint on the first movie, this one scores much higher in my book. It's a much more thoughtful movie rather than just action. It's a great movie for this Xmas season. Go support the movie!"}, {"id": 142, "text": "Wonder Woman 1984 2020 12A Director: Patty Jenkins Starring: Gal Gadot, Chris Pine, Pedro Pascal, Kristen Wiig etcOverall rating 99/100Wonder woman 1984 is about Dianna Prince (Gal Gadot) who is helping citizens in need, but with a mysterious stone that can grant wishes, she goes against two new foes Max Lord (Pedro Pascal) and Cheetah (Kristen Wiig). Wow! What a movie Wonder woman 1984 was, it connected with me on so many levels, so lets get started.My first few positives would be the cinematography, set pieces, character background and action. This movie was completely visually captivating, there was so much visual creativity built into the amazing world building it took my breathe away on multiple occasions really making me get lost in the world. The set pieces were also phenomenal, Dianna's home was absolutely beautiful and explored in a lot more depth here, and in general for the whole movie there was some beautiful set locations that the movie explored, allowing the audience to admire the films beauty, whilst also having great sets to set up the big action sequences. I also really appreciated the character background for Diana, having a good amount of time seeing her childhood and the life lessons she learned from her mum aunt through the games was really great and really made me understand how far Diana has come since she was a child. The action sequences were also excellent, there wasn't absolutely loads of action, but for what this movie did it didn't need a lot, but the actions sequences we did get were absolutely excellent, they were thrilling and entertaining exploring Wonder womans powers well, but also with great stunt work and creativity with the sequences as well.My next few positives would be the great 80's tone and aesthetic, its humour, the great performances with great chemistry, as well as the fantastic villains. I absolutely loved the 80's tone and aesthetic of the movie, they just got it perfect, from the score, to the set pieces and costume design, event the dialogue felt nostalgic and it felt like a completely different kind of superhero movie to anything that I have seen, this also stayed consistent throughout and just completely worked. The movie was also hilarious, the script was excellent, there was so many clever funny lines, and Chris Pine was absolutely excellent here and really sold his character being from a different time period really well. I also thought that the performances here were excellent, as previously mentioned Chris Pine was hilarious, Kristen Wiig was excellent, her performance was believable and charming, establishing her character really well, but also showing a more serious side to her which I loved. Pedro Pascal was absolutely excellent as well, he was intimidating and disturbing and was excellent with his over the top execution working really well especially for the 80's tone to the movie. And Gal Gadot was just excellent, she is Wonder Woman and nobody else can play the character, She was funny, charming and really expresses Diana's more vulnerable and human side perfectly she was truly excellent in the movie, the whole cast were also excellent with each other and had brilliant chemistry whenever any of them were together on screen. The villains were also fantastic, I loved that the movie balanced the villains being a great cause of conflict with the protagonists and exploring their powers well, but also making the audience understand their perspective and what they were going through balancing it with sympathising for them whilst also understanding that they made some terrible choices.My next few positives would be the amazing script, the interesting plot points and developments and the great mysterious tone. I found the script for this movie absolutely fantastic, it gave heart and humanity to superheroes which this genre very rarely does, there was some powerful and inspiring dialogue teaching a lot of people great values, and it spread a message that really connected with me. I also found the plot points really interesting, having a stone that you can wish for something and it comes true was really interesting to me, and added a good blend of fantasy to the realistic human emotion of the characters, I also found that they get an equal amount taken away from them after they have wished for it to be really interesting and was explored well with the characters especially Diana. Because of this, the movie had a great mysterious tone. The movie waited a while to reveal the true powers of the dream stone which I loved, it added tension and mystery and had me constantly questioning what was going to happen which I loved.My final few positives would be character development/ depth, emotional weight, powerful themes and messages and the fantastic final act. I absolutely loved the amount of character development and depth this movie had with its characters, the movie spent way more time developing and focusing on the characters which Ioved, you understood Max and Barbara and what they were going through in their lives and this developed into them turning into great villains throughout the movie, the amount of depth that they went into for Diana as well was truly fantastic, her love for Steve was so strong she was willing to give up her powers to be with him and it was just powerful, and her depth of understanding of the people she was protecting was truly amazing. The movie also had a lot of emotional weight which was a welcome surprise. The movie portrayed Diana and Steve's relationship so beautifully and with so much emotion when they had to say goodbye it was a very heartfelt and genuine moment, and the movies focus on day to day life and enjoying the things you have in your life without wishing for more really got to me, these were powerful and well explored themes that the movie handled perfectly. And finally, the final act was excellent, it was an edge of your seat and entertaining thrill ride, with Diana becoming full on Wonder woman, in a culmination of fantastic action sequences, character work and a very touching end.Overall Wonder woman 1984 takes risks, and is a different kind of superhero movie, creating a fresh change for the genre, with the perfect blend of fantastic action sequences and fantasy moments, fantastic performances from the whole cast, but also adding humanity to the characters making you connect to them on a more substantial level, and with a powerful and moving message that movies from this genre rarely have."}, {"id": 143, "text": "I felt it is quite varied from other superhero movies, It was more of an emotional feel-good kind of film, and the sentimental aspects in the film worked satisfactorily. I enjoyed the prequel further, but this isn't a bad sequel either, even though the duration was 2.5 hours and no many action sequences I still liked it without feeling any lag. The story was engaging but still, it's the same save the world thing."}, {"id": 144, "text": "Bad superhero, and not amazing,, this plot bad too"}, {"id": 145, "text": "Absolutely fantastic!! Watched it in IMAX, entered big screens after soo long time of lockdown!! Just wow. Gal is awesome ❤❤"}, {"id": 146, "text": "Dc just keeps getting better with every movie now coming. Gal gadot is brilliant and no one else have played other than gal gadot as wonder woman! 👌👌"}, {"id": 147, "text": "Really enjoyed this sequel. Fantastic action, story, characters and and a heart of gold. Patty Jenkins does a wonderful job of directing this film. It looks amazing and the 80s setting is suitably day-glo colourful. All the actors do an amazing job and really make you care about their characters. The soundtrack is powerful and really adds to the story and action. Some scenes really stick with you and at times it had real emotional consequences."}, {"id": 148, "text": "Watched it in a cinema and u can really appreciate the difference between watching it on the big screen as compared to the TV. The special effects are excellent and acting good. This is a good sequel and has a good story (though slightly predictable) and few weak spots. Well worth the $ and much better experienced in the cinema with the better sound effects and screen."}, {"id": 149, "text": "This wishing stone idea is so well thought out that it both solves the problem of Stevie's return and successfully creates the image of the two villains, flesh and blood and not so cold, saying that Stevie is playing for keeps, stevie's position in the WW series was essentially a tool to bring out the human side of Diana, who was never really resurrected. It is a fact that the female hero is difficult to film, referring to Captain Marvel next door, is a comprehensive view of WW two movies, are wrapped in the shell of a superhero, the inner essence or human weaknesses. Diana image is always sent to deal with combat, the emotional line is the core of WW, Diana again strong, also can not save his true love Stevie, there is a kind of ancient Greek tragedy."}, {"id": 150, "text": "Was able to watch it in IMAX yesterday and I have not been able to stop thinking about it. PattyJenks played with my emotions today. Hands down one of the most enjoyable movies of this decade with outstanding performances and unbelievable stunts! GalGadot, PedroPascal1, Kristen Wiig and Chris Pine outdid themselves! Wonderfully Marvellous! Not to forget the outstanding soundtrack provided by Hans Zimmer is intense and ground breaking! It moves in a fast and harmonious pace, which itself is worth all that happens in the film! And GREAT VILLAINS!! (For real)Please stay safe and follow covid guidelines if you're to watch it in theaters."}, {"id": 151, "text": "For almost a full year I finally stepped into the movie theater to watch this movie and I was extremely disappointed!My God what a horrible script. It is like someone being forced to create a story based on nonsense! It was agonizing and painful to watch it for two and a half hours. In fact, I want to money back.If you don't believe me, go ahead and watch it! You will know what I was talking about."}, {"id": 152, "text": "What an incredible movie, i really love this, comparing to the first one i think this one is better, first of all i wanna appreciate Gal Gadot act here as the Wonder Woman herself because since the first movie is release in 2017 that's 3 years ago and now 2020 i can say that she is still the Wonder Woman from 2017 because i really worried after a quite long years she can't bring the character back and thank god she still have that character, that's the first one and now the second one is Kristen Wiig i watch her performance in The Skeleton Twins and to be honest i don't really like that movie but in here she's is totally different, she's transform from the nice one became a badaas Cheetah in here, her performance in here it just amazing, i think this is gonna be one of her best perfomance ever, Pedro Pascal he is pretty good in here just some of a scene are kinda weird but not a big deal overall his performance in here is amazing too, now Hans freaking Zimmer his scores is super awesome, i really like a jarring scores and that's what his doing in here and i freaking love it, the supporting actor and actress is doing very well, the fight scene is good, the costume is amazing, i really like the post credit scene i wonder what they gonna do with the character but i'm pretty sure they gonna do something with the character, overall i really enjoy this especially in the theater, i highly recommended"}, {"id": 153, "text": "Great movie, just needed a little more action/bad guy interaction, for me.Loved the 80's setting, and the reminiscing of the clothing/style 😄I am never a fan when they make the bad guy too comical. But thought Kristen Wiig pulled off the cheetah pretty well.Definitely worth a watch. Much better than some of the earlier DC movies. And its Gal Gadot in a Wonder Woman costume 😍"}, {"id": 154, "text": "Weaknesses - Drafty plot, the story should be better carved. Acting didn't add much to the mix. Strongs - Good, important, message. A certain level of eloquence was achieved. In the end, it wasn't a waste of time."}, {"id": 155, "text": "The CGI looks rushed and choppy and blurry. The actress playing Wonder Woman talks like she is reading her lines for the very first time. The action is little to none, mostly lights flashing on the screen and slow-motion punching for no reason. The plot of the film is annoying and makes you want to stop watching the f#@%ing movie. This is trash."}, {"id": 156, "text": "First of all I am not a comic fan, so I judge solely on what Hollywood puts out, Second I don't understand all the raving reviews because the movie is def flawed.My thoughts in summary are as it goes:Movie is entertaining enough, action scene are good, acting is good BUT I had issues with the pacing where the ending felt rushed and underwhelming, the writing wasn't good at times, storytelling was flawed where one silly thing causes a major shift in events in a way that leaves you guessing why such insignificant act had so much effect. The romance was rushed and didn't lead to the emotional response the writers was hoping for.But the movie is good enough to spend an afternoon but far away from being the best this year."}, {"id": 157, "text": "Its the worst super hero movie i'v ever scene..0/10.. gal gadot plz stop acting its not ur job."}, {"id": 158, "text": "The soundtrack was more than amazing and great story !!"}, {"id": 159, "text": "A worthy sequel to the incredible origin movie. Full of heart, tongue in cheek comedy, relatable characters, sometimes over the top but great use of CGI and actions sequences, amazing score, and most importantly the overwhelming sense of hope it projects particularly in such a miserable time (covid era)."}, {"id": 160, "text": "WW84 is not a good movie - at all. It lacks any entertainment value or fun, which is what DC and Warner Bros. should be striving for these days. They were on the right track with Shazam!, but everything went back to zero with this sequel. It's all a huge disappointment and not the holiday gift anyone was hoping for. Instead of that new shiny bike with all the extras attached, WW84 is a used lump of coal with slime. Fans of the film are sure to be curious, but will surely be disappointed."}, {"id": 161, "text": "Great movie with great story, must watch filmYou can enjoy absolutely in theater this movie is far better than captain matvel"}, {"id": 162, "text": "Pro contra will be always here, everyone has different point of view, but it's always easy to make critical than make it effort ..."}, {"id": 163, "text": "Really I think it's waste money ... feeel bored all the time"}, {"id": 164, "text": "I suggest doing nothing rather than go watching it, it will be more rewarding than spending 150 minutes watching this.Story it self is so predictable and poor, visual effects and the main villain were shockingly bad.Maybe I would recommend this movie if it was actually made in 1984... maybe"}, {"id": 165, "text": "The storyline seems pretty simple if you think about it, but the whole journey of Diana arriving to the conclusion of the story and the sacrifices she had to make brings great depths to the movie. I thought it was an emotional film, filled with multiple heart-stopping action scenes (watch it in IMAX, trust me haha), that very nicely discussed a few important themes such as greed, power, greatness and honesty.Thank you for bringing this movie to us Patty and Gal!"}, {"id": 166, "text": "Started off well enough, thought it would kick on from the first. Plot was non existent. Big battle is a talk. Festive ending felt forced and reshot to match the festive release date. I was really looking forward to this movie but left feeling like I never want to watch this again"}, {"id": 167, "text": "The visual effects of this movie very amazing and cool, the story very good, and many interesting scene in this movie that very cool to eatch. Worth it."}, {"id": 168, "text": "Cons Way too long &amp; boring. I found myself zoning out at times watching this from home. Terrible CGI. Cheesy comic style action. Unorganized story.Pros Thanks for reminding me Trump can play an interesting villain."}, {"id": 169, "text": "I was really looking forward to this movie after the 2017 success but was so disappointed. Being set in the 1980s, I thought a decent soundtrack might have offered a glimmer of enjoyment but nothing doing there either. In the end I didn't even want the bad guys to win, I justed wanted it to end."}, {"id": 170, "text": "This is one the most boring superhero movie I have seen. Not sure what was worst...story, script, special effects, or acting. I have seen Ironman or Spiderman movies multiple times and still enjoyed them. But this was just poor quality movie making not expected from a large budget movie like this."}, {"id": 171, "text": "What happened? The first film wasn't perfect, but it had charm and momentum. This one? Nothing of note happens for the first 70-odd minutes, just tedious one-note characters moving about, no life in it at all. Then at last we get to the action.. it's fine, stuff happens... but by this point, you don't care. I don't really know why they brought Steve back, he doesn't do anything - other than to marvel at inventions THAT WERE AROUND WHEN HE WAS ALIVE. Save your money and sanity, just go watch the first film again."}, {"id": 172, "text": "Amazing how a two hour movie was able to jam in this many cliches. What a terrible way to follow the first movie"}, {"id": 173, "text": "I get that WW1984 wants to be more than just an action-packed popcorn movie. And it has huge potential. I mean, had. (maybe that's why there's so few fight scenes in it and they are frankly not good enough)But one would need a good script, a good plot to acheive that goal.And honestly, the last act where the antagonist is defeated not by sword but by mouth was underwhelming. Friends whom I watch with all felt the same way, unconvinced. Something is wrong with the script if it failed to convince its audience."}, {"id": 174, "text": "You will be surprised by the way this movie's villain dressed, the way he talked and the way he did thing. This is not fair to say that he doesn't look like Trump. The chaos n threats do get heating up in Trump's administration. Actually, the story line of how he was stopped rely made my day...."}, {"id": 175, "text": "Didn't have high expectation on this one but c'mon have some respect for your audience. Opening was extremely boring, no climax, full of cliches. And the plot, what can I say it was extremely pathetic how did they even approve this script. How did they go with a decent first movie to this?"}, {"id": 176, "text": "One Of The Best Movie In Time Like These...Must Watch It Wonder Woman is the Symbol of Hope, Love, Passion, Strength... It shows Beautifully in this Movie#PedroPascal &amp; #KristenWiig Are MVP"}, {"id": 177, "text": "Was expecting a superhero movie. Not even close. Took my 11 year old girl to see it. Always looking for movies showing strong women roles for her. She walked out saying how boring it was and only thing good was the popcorn. I thought it was just OK."}, {"id": 178, "text": "I really loved the movie.the plot was so good.This movie tops the first one and they focused on many things and the long rang didnt effect me alot"}, {"id": 179, "text": "This is first time ever I walk out of a movie before finish ... it is just so long and boring Bad story and meaningless, like there is no point out of it ... lack of action and too much drama (not the good one) I am so sad ... 1st Wonder Woman movie was really good and I hoped then that DC will be back to start doing good movies again like batman trilogy ... just disappointed Really disappointed"}, {"id": 180, "text": "Was not expecting this when I risked my life and went to see this movie. Waste of time."}, {"id": 181, "text": "The movie was really awful, no work done on the script. D.C really disappointed this time, at the start of the movie was really good but further it goes it didn't stand on the superhero character movie, silly wishes concept was laughable."}, {"id": 182, "text": "WW84 is good. It's interesting with the retro theme. The movie's overall look was great. It gives you the feeling of old movies. I just love the scene near ending of Gal Gadot. I think her acting was greatly improved after the first Wonder Woman movie. That scene, when Diana leaves Steve touches my heart.This movie is totally different to other superhero movies. Not too much of fighting and war, it's totally relatable to us with the change of Diana (and human)'s emotional stages and the greed inside all of us. Maybe WW84 does not have magnificent fighting scenes like ALL other superhero movies, but it's heart-touching. And it has ended in a more human and compassionate way. Overall, that's what I like about this movie, because it's not just a superhero movie."}, {"id": 183, "text": "DC still needs to figure this movie thing out... The movie is better the first installment. Or at least the underlying message is sweet and moving. Rest, the action is still lackluster. Gal.G while pretty is still not (in my opinion) muscular/athletic enough to portray an Amazon - she looks too delicate. Acting is as good as it can be, given the somewhat average script/plot."}, {"id": 184, "text": "This is definately not like the first one. The movie was stretched to 150 mins and it has a very bad story line(something to do with magic). The action scenes at the start of the movie was great but it was very bad at the end.DC should adopt the stories of the animated movies and convert them into movies. Their animated movies are a million times better than Cinema movies"}, {"id": 185, "text": "Dramatic, long and boring movie. Luckily, the main character is beautiful 🙃"}, {"id": 186, "text": "This movie is what 2020 needs - loved every second of it. It's visually stunning, beautiful story and Gal is just brilliant. Please ignore all the negative low reviews - it's typical to see all the trolls out in force as per usual. I find it humorous that most of the negative comments are dated almost 2 weeks before the film even came out. Go see it - any true genuine Wonder Woman fan will LOVE IT"}, {"id": 187, "text": "I've now seen this movie twice and it really is great, first of all it will not be for everyone becase of its tone but it worked for me. patty jenkins balanced this film very well from the charecters, drama, comedy, romance, action and story, the everybodys motivation makes sense the action is spread out and earned the its emotinal when it needed to be, i cried on both viewings. there have been comparisons made to richard donners superman and i 100% see it, the tone of superman 3 though and i love that movie but it makes sense as that movie was 83 and this is 84. The acting all around was great the stand out being pedro pascal, he gives an over the top performance, my eyes where glue to the screen every time he would appear. The score by hans zimmer was perfect! with the additon of a piece from batman v superman used in the most heartbreaking way and its just a haunting track. Easily the best dceu movie beating my favourite man of steel, was just refreshing watching a superhero film that wasnt too gritty like b v s or too much of a comedy like spiderman far from home."}, {"id": 188, "text": "The monologue started really well with solid optimistic message, then it started downplay it's wonder woman character with donner superman clearly it is not fit in this time, like too too much saving from WW became cheesy moments. Han Zimmer score is awesome in this movie which lifts some scenes more. Action scenes are not that good compare previously what we saw in WW 1, sloppy VFX made those action scenes even boring and execution of some scenes not handled well( one scene they try to recreate from previous DC outing not made an impact like it made) . As previously done in WW 1 gal and Chris duo romantic chemistry works really good in this movie as well. Kristen and Pedro made good performance for their characters. Movies 3rd act is at their best flourish those character even more and really loved mid-credit scene. Finally I really wished this movie could have made better."}, {"id": 189, "text": "Epic movie really enjoyed watching it. There are so many moral messages that can be taken, very much related to everyday life A lot of action and interesting plot."}, {"id": 190, "text": "There are so many moral messages that can be taken, very much related to everyday life. although the action is not too much, but I am very entertained by the amazing plot twist . I wish I had a big heart like Princess Diana 💜💖"}, {"id": 191, "text": "In the era of lockdown, social distance and restriction, I was eagerly waiting for the premier of this movie in the Star Cineplex of Bangladesh. Apart from the beautiful Gal Gadot, the performance from everybody was disappointed. Screenplay wasn't up to the mark, lack of action scenes made it happen. However, the show was worth to watch only for Gal Gadot. I gave 7 only for her."}, {"id": 192, "text": "I dont know..am i watching Wondwe woman or super man ? Music good.. Actions..not bad.. The vellens...were v good.."}, {"id": 193, "text": "Super concept! Super screen play! No words film is super duper"}, {"id": 194, "text": "I reluctantly went to this and didn't expect much and the first 20 minutes appeared to confirm this for me. I thought to myself this is a movie for young girls at best and just giddy nonsense. However it began to pick up and develop into quite a complex and fascinating movie tackling some serious issues. The special-effects and cinematography are superb from start to finish and it has its very witty moments. In the final analysis it's well worth a look although strangely not something I would bring to kids nor which kids would follow."}, {"id": 195, "text": "Gal is awesome and the score, the story plus the others as well plus visuals are nice as well &amp; direction by Patty Jenkins is great plus Kristen &amp; Pedro as wel"}, {"id": 196, "text": "Wonder Woman '84 is again very impressive movie, Gal Gadot shines more in this WW movie, Villains were powerful, but what i missed in this DC movie is the Lack of Dark Tone like MOS, BvS, WW, and partially JL along with SHAZAM. Also the signature WW Background Music was spoiled to an extent. And, Last but not the Least, why director Petty Jenkins didn't clarified That HOW DIANA aka WONDER WOMAN ALL OF A SUDDEN CHANGES FROM HER RANDOM CLOTHES TO HER WW COSTUME IN Just a matter of seconds...I Seriously Mean?????"}, {"id": 197, "text": "So disappointed in this film, I was really looking forward to seeing this as the first WW is the best DC film to date. It just seemed to lack a heart and soul. The script was poor and didn't feel a connection between any of the actors, even between Gadot and Pine. The story line seemed to be driven to get them together and to try to relive the original story. Now, I'm not a comic book fan but since when can Wonder Woman fly? I was struggling with the film but when this happened I lost any respect for it, which also throws up continuity issues with the other DC films she appeared in as this super power doesnt seem to be in her locker."}, {"id": 198, "text": "Honestly wonder women was the only movie between all the horrible dc movies that i used like. Honestly it didn't feel like wonder women it felt like a boring drama less action and it was missing that super hero feeling to it. Im just disappointed and cant wait for marvel to release movies because im done with watching anything dc"}, {"id": 199, "text": "Has a big budget feel which is nice. Good for the family after a movie starved year. It ticks the boxes as far as superhero flick is concerned. A more severe critic would probably cite the silliness , weakish unimpressive story, not very villainous villains more oddities, too much romance. But it's Christmas so let's just enjoy it and a bit of 80s nostalgia.Watched on Big screen in Asia 23rd Dec 20."}, {"id": 200, "text": "Please dont watch this movie . Its worse than the first part. Doesn't feel like a super hero movie. It's super long and boring. The story makes no sense at all."}, {"id": 201, "text": "A film that promises from the first trailer and certainly lives up to that. I will not spoil it for you but you will be pleasantly surprised."}, {"id": 202, "text": "Gal Gadot esta riquísima, lo demás no importa. ."}, {"id": 203, "text": "The first film was a fantastic big screen debut for the DC Comics heroine, this was highly anticipated follow-up, the ninth officially in the DC Extended Universe. It has been delayed a number of times since late 2019, then the COVID-19 pandemic did so again, but I'm glad I finally got to see it, directed by Patty Jenkins (Monster). Basically, in her childhood, young Diana (Lilly Aspell) competed in a multistage athletic competition on Themyscira against older Amazons. She is disqualified for taking a shortcut during the competition; her mother, Queen Hippolyta (Connie Nielsen), and her aunt Antiope (Robin Wright) lecture her on the importance of truth. In 1984, decades after the First World War, Diana Prince (Gal Gadot) works as a senior anthropologist at the Smithsonian Institute in Washington, D.C. She also continues to fight crime as Wonder Woman. Diana meets new co-worker, Barbara Ann Minerva (Kristen Wiig), who is insecure, unnoticed by others, and tries to befriend Diana. Whilst researching ancient Mediterranean civilisations and antiquities, Diana is handed a mysterious Dreamstone, which seemingly grants wishes upon contact with any user. Both Diana and Barbara both hold the stone and are unknowingly granted their desires: Diana wishes for her deceased lover, Steve Trevor (Chris Pine), whose soul is transported into another man's body; Barbara wishes to be like Diana, and slowly becomes beautiful, strong, and powerful. Maxwell Lord (Pedro Pascal) is a charismatic businessman and entrepreneur, but he is actually a fraud with a failing business. Lord visits the Smithsonian, it is clear that he knows the power of the stone and wants to get his hands on it. He manages to manipulate Barbara during a gala night at the institute in order to acquire the stone. He makes the wish to become the embodiment of the stone and gains its power. In doing so, he can grant one wish to a person, and take whatever he desires from them. Over the next few days, Maxwell rises to become a powerful influential figure, while leaving chaos and destruction. Diana is overjoyed to have Steve back in her life, and he is amazed by the many innovations of the future. But Diana realises that her wish has come at a price, as she is slowly losing some of her abilities. Barbara however embraces her newfound beauty and popularity and takes advantage of her strength and powers. Diana, Steve, and Barbara investigate the Dreamstone further, it is discovered it was created by the God of Treachery and Mischief. The stone grants a user their wish but takes their most cherished possession in return, and the only way to reverse the condition is by renouncing their wish or destroying the stone itself. Steve realises that his existence comes at the cost of Diana's power. Both Diana and Barbara are unwilling to renounce their wishes and try to figure out another solution. Maxwell is desperate to reach out to as many people as possible to grant their wishes and gain more money and power. He manages to get himself a meeting with the President of the United States (Stuart Milligan), who tells him about a satellite broadcast system that can transmit signals globally. Barbara, desperate to keep her power, is determined to stop Diana from harming Maxwell, and joins him as they travel to broadcast station that he will use to communicate to the entire world, offering to grant their wishes. Steve convinces Diana that she must let him go and renounce her wish, she reluctantly does so and regains her strength, and gains the ability to fly. She returns home and dons the armour of the legendary Amazon warrior Asteria, then heads to the broadcast station. She battles Barbara, who has made another wish with Maxwell, transforming her into apex predator creature Cheetah. After defeating Barbara, Diana confronts Maxwell, who has already communicated to millions of people who make their wishes. But Diana uses her Lasso of Truth to communicate with the world via him, convincing everyone to renounce their wishes, after realising the consequences. Maxwell is convinced to renounce his own wish after realising he will lose his son, Alistair (Lucian Perez). The world is eventually restored, and Maxwell is reunited with his son, telling him the truth about his fraudulent lifestyle. Sometime later, Diana is walking the streets during the Christmas holidays, and she meets the handsome man (Kristoffer Polaha) whose body Steve was inhabiting, and she continues to protect the world. In a mid-credit scene, Asteria (Lynda Carter, who famously played Wonder Woman on television) is revealed to be alive and living among humanity in secret, much like Diana. Also starring Amr Waked as Emir Said Bin Abydos, Natasha Rothwell as co-worker Carol, Ravi Patel as Babajide, Oliver Cotton as Simon Stagg, Gabriella Wilde as Raquel, Kelvin Yu as Jake, and Asim Chaudhry as co-worker Roger. Gadot remains perfect casting as the beautiful warrior princess, Pine is both charming and amusing as he discovers the 80s, Wiig who is normally comedic gives an interesting serious performance, and Pascal is pretty good as the power-hungry villain. I agree that it is little bit long, and the various storylines going on make it a bit messy, but you cannot help but be thrilled by the explosive chase and fight sequences, with fantastic special effects, and one or two good songs, including Frankie Goes to Hollywood, in the soundtrack, an entertaining superhero action. Good!"}, {"id": 204, "text": "Mesg given in movie is very good depending on current status way people are trying to be always in power and always wishing for more and losing real happiness shown correctlyOn action part do belive that it is less way the character is people want more action packed performanceOver all movie is good gal gadot as usual is perfect for wonder woman role worth watchingPlz watch movie in cenima for better experience I watched in iMax see the social mesg if you try to find the action you may not like it."}, {"id": 205, "text": "Story quite good. Teaching about truth and sacrifice. But.. the final battle suprisingly bland. I except more action since wonder woman is fighting cheetah, her archenemy."}, {"id": 206, "text": "No spoilers in this review, because the movie is spoiled enough by itself already! Haha, you could get through the movie if you're watching in imax, but in usual theaters I guess it'd be hard to cross the halfway mark. It's a boring, mind numbing and jading experience. Money can be recovered, but not time. Watch at your own risk!"}, {"id": 207, "text": "Sadly disappointing. This sequel lacked any storyline. It is the antithesis to the first film. There is too much cgi. What was the film studio thinking? The first film was entertaining and in keeping with the brand. This time it lacked purpose. There were inconsistencies in who got more than one 'wish'. Whoever dreamt up the story is obviously now sober and regretting the wasted opportunity to have a hit movie."}, {"id": 208, "text": "This was awful. Gadot can't act to save her own life. Poor acting from everyone honestly. Awful editing, vfx. Cringrworthy humor. What a mess of a script. Don't bother with this."}, {"id": 209, "text": "Yuck! This movie is very long and boring. A lot of drama. The worst movie I have ever seen in the theater. Pedro was plus point to the film, thats all."}, {"id": 210, "text": "To start off with the good, Gal Gadot may not have the strongest acting chops, however she continues to wear the Wonder Woman character like a perfectly tailored suit. She is stunning, and her performance, especially when she was confronted by Barbara after the White House battle, showed a subtle but effective improvement in acting prowess, as well as a level of confidence in her ability to shoulder the privilege of embodying Wonder Woman.Chris Pine was also very good, and for the most part, played the comedic and emotional beats to perfection or near perfection. Kristen Wiig also delivered a surprisingly striking performance, capturing quite effectively, the polarity of her character. Also, Pedro didn't disappoint either, and did an extremely excellent job with what he had to work with.All in all, the acting and cast were up to the task, and carried the movie quite well, however, the movie itself had a whole lot more shortcomings.The VFX of WW84 are sadly below par, the action sequences are quite underwhelming, the fight scenes are either badly choreographed, badly directed, badly edited, or badly photographed, the story is too ambitious which is fine, but unfortunately doesn't manage to deliver that ambition neatly, and the villains make decisions that appear okay on the surface, but are rather nonsensical with a deeper and obvious look.The finale fight wasn't exiting and further showed Jenkin's struggle with executing well directed action, while Wonder Woman's confrontation with Max illustrated very well, just how the movie couldn't live up to the standards it set for itself. And moving from the finale to the beginning, the first 20 minutes of WW84 are pretty thrilling, however the movie stalls thereafter, and at points, dips.In addition, WW84 felt a lot like The Amazing Spider-Man 2, The Wolverine and of course, as this franchise has been doing, Captain America: The Winter Soldier. Feeling like these movies isn't a bad thing, however, the end product needs to somehow be complementary, and in many ways, WW84 failed to do so, though in others, it didn't.To give WW84 a 4/10 would simply be too harsh, however, it is certainly not an 8/10 outing, while furthermore, it sadly fails to trump its predecessor. The romance aspect was wonderful to see, and that together with the casts' performance throughout the movie warrants an average of 8 and 4, for a fair 6/10."}, {"id": 211, "text": "Though the overall pace seems slightly slow and there weren't too many battles shown between WW and Cheetah as I expected, the touching moments and especially the colorful style of 80s earned some credits as the second WW series movie chronologically following the first one in storyline...should have been better if the length to be squeezed within two hours"}, {"id": 212, "text": "The movie starts nice but looses the overall adrenaline rush that every scene and battles of the first one had. Diana looks great but Wonder Woman is ... Well... Meh... The movie overall is good and has good performances especially by Kristen Wiig and Pedro Pascal, but fails to be a memorable one."}, {"id": 213, "text": "Wonder Woman 1984 is a film that had a lot of mixed staff in it some were good but also some were bad.Lets start with good,Gadot was again as Wonder Woman and every time she was on screen i felt happy cause it feels like she was born for this role.Pine was also good and he again had great chemistry with Gal and when they were together they shined in a great way.Wigg as Cheetah was fine but she was left kind a underlooked in a film,Special effects were also pretty weak in some scenes and villain Max Lord was cartoonish at some moments.Wonder Woman 1984 is a film weaker then original but Gal and Pine saved it"}, {"id": 214, "text": "The movie is not bad...but far away to be great.Wonder Woman 1 is so much better! This is a dc movie, so there are a lot of cringe scenes, but there is a scene, on the middle of the film, that she catches a bullet with her tie, that´s so cringe! And when she run, or fly is super weird! The film is too long and with a lot of waist of time. The problem, is on the script. I mean, why would Diana Prince became friends with Barbara? It doesn´t make sense. The main villain, is too lazy, and the final decision, is anticlimax. Steve Trevor didn´t had to be here! He´s there, just to make, the dramatic and the humor part. The sound editing is amazing! Really great! The visual effects aren´t there thoses things, but ok. The post-credit scene, isn´t important at all. The actors and actresses are good, especially Gal Gadot. If there is any chance to make another sequel, please, take time to write a better script! Thanks."}, {"id": 215, "text": "The movie was very slow. The first part of the movie I would buy it, all the part of the rock was fun and I was enjoying the film. But, later there were a lot of boring scenes, which didn't made me feel anything and that is what I want in any film. By the way, the scene when she was flying was very false I was laughing out loud in the cinema, I couldn't believe it. How can a film with that budget does have that so false effects? I think that I have enjoyed more my popcorns that watching the hole movie, at first Pedro Pascal was not credible, but he was winning credibility, but Gal Gadot was totally the opposite she started very well and finished badly. My recommendation is that if you go to watch this movie, be prepared to be disappointed."}, {"id": 216, "text": "It's just too childish, I felt as a little girl watching it. Too many cliche moments and a lot of stuff doesn't make sense"}, {"id": 217, "text": "The movie is n't bad totally .his problem is every thing was overrrrrrrrr action scene and dramatic scene . The Reasons of evil was n't clear to me why did he want to give anyone his wish and how did know about the stone . The performance of glad great comparing the last movie 2017. If they cancel the additional scene because it is useless and take extra time ."}, {"id": 218, "text": "With a film such as this it should be free from as many errors as possible but there were two I spotted, the first was Barbara's self tidying and untidying briefcase. After she scoops her papers in, towards the beginning of the movie, they are sticking out in one shot, a closed case in another and then sticking once more in a third....In the gala scene they are playing Welcome to the Pleasure Dome by Frankie goes to Hollywood, given that the date is around the 4th of July 1984, that piece music was released in October 1984. Sorry for nerding but it seems like they wanted 1984 production values as well."}, {"id": 219, "text": "Just watched the movie Overall its entertaining. The movie is 2 and a half hours long and there were some drawn out scenes which made it dull at times. The trailers were a dead give away and I expected more. The plot was a bit thin for a DC movie. Gal Gadot carried the movie and was well supported by Chris Pine however the conclusion was weak. The villians were a bit dull but overall it's a must watch for DC fans"}, {"id": 220, "text": "So it's just a movie, but you can't call it a superhero movie or some DCEU things, just using the characters and background the story is ok but if it's not of WW or Gal Gadot I won't buy it Not bad but it's a pity there's no much connections between DC movies"}, {"id": 221, "text": "Very poor script and silly plot resulting in a bad Surprise for the fans , I am really disappointed with what I've seen . What I've enjoyed the most is the usual superb outstanding music of the genius Hans Zimmer"}, {"id": 222, "text": "I had so much hope about this movie being much better than its predecessor but I was disappointed in every way. This movie feels like some sort of good message delivery video. Not that I'm against movies which deliver good, positive message but I think that's all this movie does. It feels like I have spent 2.5 hrs in a catechism class with some great score by Hans Zimmer and 3 action scenes, each lasting for 5 mins. The movie starts with Diana who stops a robbery at a mall where they are trying to steal some ancient artifacts. There we come across a Citrine stone created by some evil god(I forgot his name) which grants wishes. Long story short.. Barbara wishes to be like Diana(unaware that Diana possesses superhuman powers) and Max Lord absorbs the stone itself. And the movie is a 2 hour long headache where Diana is trying to stop Max Lord being defended by Cheetah from creating chaos throughout the world with a long speech at the end of the movie. There are so many loopholes in this movie. No clear backstory on the Citrine stone or how it came into existence. Does Max Lord still have the powers of the stone? How did Barbara became Cheetah? She never mentions that she wants to become Cheetah.. she just says that she wants to become an apex predator and Max Lord isn't even touching her when she says that (btw the wishes only come true if your actually touching the stone or Max Lord, after he absorbs the stone). They have also made use of the transitive property so that Max Lord can touch everyone (figuratively) to grant everyone their wishes. It's like Max Lord is controlling some equipment which shoots particles (don't ask which ones) and these particles falling on all the human beings. So in a way, Max Lord is in physical contact with everyone. I don't know.. it's one of those lame things. Even I don't get it. And at the end Diana speaks through Max Lord with everyone to renounce their wishes and everyone agrees. Come on.. seriously? On the postive side, I liked the score by Hans Zimmer. The performance by Kristen Wiig as Barbara/Cheetah and Pedro Pascal as Max Lord were really good. It's a shame that they failed to make good use of it. Overall my experience was not great. The 1st Wonder Woman movie was so much better than this sequel. This movie made me do the unthinkable act - texting someone while watching a movie in theatre. Seriously.. it's a big deal when it comes to me. Anyways it did not make me sleepy, like the Suicide Squad garbage did. Hope they revive the franchise with sequel/prequel containing positive message with adequate action."}, {"id": 223, "text": "The script is definitely weaker in most part, and the acrobatic or action CGI reminds me a lot of a lame Spiderman movie by Sam Raimi. I can see they're using Marvel formula and trying to bump it up further but not everything paid off, some are cringe. Pedro Pascal performance really saved the experience, and Kristen Wiig character's conclusion is somewhat left out.For a superhero movie, the final fight is rather short and somewhat anti-climatic, it's like BvS all over again. It makes you go: Really!? Is that it?Enjoyable movie nonetheless."}, {"id": 224, "text": "After waiting long time really disappointed .... Story wAs very simple not any big and remarkable action sequences ..."}, {"id": 225, "text": "Apologies if this had offended any Gal Gadot's Fans and Miss Gal Gadot. But this is a terrible script / plot and bad execution. I regretted spend $$ (IMAX) for this movie. It's a Flop, personal view. We all were expecting intense + interesting WW fight scenes / actions, we don't even mind if any of it was CG. The idea of Resurrection 'Steve' = bad. The villains or in my opinion, supporting actor &amp; actress were not ... well ... portraited / characterized. I feel bad for them not able to shine in this movie. The final battle or finale looked more like a story line telling people to be good and blah blah blah ~ This is a DC famous Female Hero, the one and only Wonder Woman. At least bring out the Evil possessed being and have an epic showdown or something ... Greek Descendant vs some other religion immortal battle ... TV Animated series are freaking way better portraiting Diana / Wonder Woman. I believe there been months of delay releasing this film due to COVID-19 / pandemic, thought could have someone or some groups reviewed this movie in advance and advised to re-shoot or change part of the storyline to get better results. Feel bad for this movie turn out to be like this. Now my hope is pinned on Marvel - Black Widow."}, {"id": 226, "text": "This movie is okay to put something on telly while cleaning the house. The only highlight of the movie was Diana's boyfriend trying on outfits. I expected more. Music was good."}, {"id": 227, "text": "Going into this movie I didn't have major expectations, as I wasn't a huge fan of the first movie. Yes the 2017 Wonder Woman movie was great, however in my opinion it was so repetitive of the 2011 captain America movie that I didn't respect or enjoy it as much as others did. Not to mention the awful last 10 minutes of that first movie. After seeing this sequel, I was pleasantly surprised by this fresh, creative continuation of the character of Wonder Woman. Gal Gadot kills it as the main character once again, and proves her worth as possibly the best part of the DC universe at this point in time. A stand out performance for me was Pedro Pascal as the main antagonist, with a unique and human twist to his ending in the movie. As great as this movie is, the cgi let it down in some scenes but overall doesn't ruin the experience. There are also many cheesy shots and lines, but this is passable as the movie is set in the 80's - an era of cheesy movies. Overall, an amazing ending to a horrible year. A fresh, exciting story with a great cast, and even an interesting end credit scene.... 8/10"}, {"id": 228, "text": "This has to be one of the worst movies of 2020. I waited patiently for this film to release and I was dismayed by what I saw. The action is dull, the acting is wooden and dialogue sounds like it was written by a a first time writer. If you love cliches this is your movie. It's filled with them and you just have to roll your eyes. Superman v. Batman is a far more superior than this film. Director Patty Jenkins really dropped the ball. The first film was so much better. What blows my mind is that the movie was directed by the same person who directed the first one. I think it was the right decision to split the release between digital and theatrical because it was not going to make its profit back just by doing a theatrical release, let alone on demand. I don't recommend this movie. I'd advise you wait until it's free on tv in about a year. It's that bad. It pains me to be so critical of Wonder Woman because I'm a huge fan. However, I'm not a fan of a director who can't even make a decent sequel. This is the same director who is going to direct Star Wars Rouge Squadron in 2023. If you love Gal Gadot check this movie out, other then that this is a hard pass."}, {"id": 229, "text": "Don't read naysayers, don't go with expectation to match the first movie. Diana is a totally different character here . Matured , outspoken , emotionally hurt to add to complexities of finding an ex. Not Diana in first who was curious &amp; shown as fierce warrior. Target audience looks shifted to young girls who aspire to be her, so bit cheesy at times. But take nothing away from hard work they put in for stunts although some were over the top. Gal looks so flawless &amp; elegant just like ever before, mesmerizing. Kristen &amp; Pedro did justice to the roles , both held well but would have liked to see more of Cheetah. Considering movie already 2h 30m I can understand certain elements being limited.It might not be as high as I rate , but it's definitely not as bad rating suggests. To make things even ;)Go out watch a fun original story. You love it or hate it. But deserves it s screen time . Love to see this franchise return again"}, {"id": 230, "text": "The long delayed release of the Wonder Woman sequel has finally happened, and it is well worth waiting for.Gal Gadot is fabulous as the Amazonian beauty (and then some) with Chris Pine reprising his role from the first film. (Of all the WTF moments of 2020 trailers, this was top of the list.... just HOW? A McGuffin is involved, but no spoilers here!).In brief, Patty Jenkins delivers a popcorn blockbuster than has legs (over and above Gadot's perfect specimens!): the Goblet-of-Fire-Potteresque pre-title sequence is thrilling and engaging. And the story builds cleverly through the first half of the movie. Above all, there is a heap of HEART involved here.... this is not your run of the mill supervillain showdown flick. In fact, it's a movie with TWO villains (normally a doom-laden premise for this reviewer... Spider Man 3.... shudder), but here it really works well.Sure, there is a requirement for a suspension of belief, but - hey - it's a DC movie. On a slight downside, the second half of the movie - for me -unfortunately doesn't quite live up to the promise of the first half, blending Bruce Almighty with Superman 2 and rather over-egging the pudding.But in a lockdown morass of B-pics, this sequel is one that is gorgeous to look at (Matthew Jensen's cinematography is superb), gorgeous to listen to (an epic score by Hans Zimmer) and is genuinely engaging. There's also a nice vein of humour running through it... when Kristen Wiig is in a park, a rough sleeper on a bench is reading Waiting for Godot.... or is it Waiting for Gadot?? It's such a brief scene, I wasn't sure!Although I DEPLORE the Warner's decision to release their material in parallel to streaming, here is a movie that is MAGNIFICENT on the big screen and WELL WORTH you getting out to the cinema to see... assuming that you can find a UK cinema open (I saw this in the excellent Showcase De Lux in Southampton).Oh, and if you are someone who dives for the exit at the first title... resist... there is an excellent and surprising mid-title sequence that will particularly appeal us older folks!(Please check out the full graphical review on bob-the-movie-man, which will be going live shortly. Thanks)."}, {"id": 231, "text": "I have seen quite a mixed reception to Wonder Woman 1984. A lot of people really like it, and it also didn't work for some people. I haven't seen anyone who hated the film though, but no one seems to love it in the same way that I love it.However, with that in mind, it's fair to say that I didn't love the film until the third act. I really enjoyed the first two acts, but there were a couple of elements that kept me from being completely taken with the film. Fortunately, they weren't issues once the third act came around, because the whole film was about setting up little pieces and building to an epic finalé.This was by far the best performance that Gal Gadot has ever given. She was absolutely fantastic as Wonder Woman, and Chris Pine was also sublime. I wasn't convinced about the way they chose to resurrect him at first, but this is one of the aspects that I ended up really appreciating. Pedro Pascal as Maxwell Lord and Kristen Wiig as Barbara Minerva were also terrific.Wonder Woman 1984 might have come out in 2020, but it felt like a product of the 80s. The production design was perfect, and the cinematography had a very 80s feel to it. This was great because it's my favourite decade, even though I wasn't born until a few years after it ended, and so I loved seeing these characters in that time period.The narrative of Wonder Woman 1984 was exceptional. It didn't feel like a superhero film for most of it, but that wasn't a bad thing. In fact, there was a large chunk of the film, probably an hour or so, in which Gadot was portraying Diana alone, and not Wonder Woman. That could have been an issue, but I was so invested in what was happening on-screen that it didn't bother me in the slightest.The story centred around greed, and how having too much power can corrupt even the most innocent of people. That was such a profound message, and Patty Jenkins directed the narrative in a completely engrossing way.There wasn't really a straight-up villain of the film, which I liked. Maxwell and Barbara were easily corrupted because they weren't happy with the lifestyle that they had and they were willing to do anything to change it, but they weren't evil.I'm always a big fan of fish-out-of-water elements, and that's what we had here with Steve being taken out of the 1910s and placed in the 1980s. It was very entertaining to watch, and the chemistry that Gadot and Pine shared on-screen was even better than it was in the first film.There was a scene towards the end that really hit me on an emotional level, far more than I would have expected from a comic book film. I won't spoil what happens, but it involves a choice that Diana had to make in regards to not letting greed overcome her and making a sacrifice in order to retain her humanity. This wasn't something that I expected, and it elevated the film for me.I also really loved a scene where Diana and Steve were in a plane, with some fireworks going off around them. I'm not sure how practical that was, but the cinematography and musical score were beautiful.Aside from a couple of coincidences that were only used to move the narrative along, and the too sharp of a decline from Barbara into Cheetah, I was completely floored by Wonder Woman 1984. It wasn't what I expected, but it exceeded my expectations and so I call that a win. Seriously, whenever you can, you need to see this film.SCORE: 96%"}, {"id": 232, "text": "I'm telling you I'm so disappointed... Gal Gadot is a Goddes, don't get me wrong. But the laziness of the script writers and special effects teams are just shocking. It seems like the wins of DC are just occasions...they still don't know what they're doing. In general: super basic plot with mega ultra tropes;effects are seriously...so disappointing like you're watching Adam West's Batman and it's not even cute..;characters (main villains) are sooo tropey...you only roll eyes on everything they say and motivation...;no background whatsoever...I thought maybe I should have known something from comics, but no...;music of genius Hans Zimmer was so loud, I couldn't hear dialogues.Honestly...I'm so sad writing this. Good things I personally liked: Gal Gadot - goddess;her chemistry with Chris is great;Pascal does a great job. It's not his fault that the character is poorly written and has weird actions ( especially in the end...);the overall message.But really...why... i had such high hopes :("}, {"id": 233, "text": "The film shows a preference for forgiveness over vengeance, which feels like an okay way to end this particular year.Wonder Woman 1984 entertaining? Sure, it's fun, hits all the right superhero marks, and visually, the 1980-something world is a technicolor throwback to behold.Wonder Woman 1984 doesn't have the same jaw-dropping impact of Wonder Woman (how could it?), but Jenkins maintains a steady hand on the character and her story.This is a superhero film meant for the big screen but trapped on a smaller one.Bonkers in a way that superhero movies these days don't have the nerve to be. You'd have to be a Grinch to hate on a blockbuster sequel that's so puppy-eager to please. But despite the fem power of star Gal Gadot and director Patty Jenkins, all the CGI huffing and puffing over 2 1/2 hours deflates momentum and audience endurance."}, {"id": 234, "text": "It's been 10+ years of the superhero genre dominating the box office. Helped hugely by the success of Marvel's Cinematic Universe. After so long (and so many) movies, audiences have come to expect a certain type of action-blockbuster. Usually climaxing with a level 100 boss battle (complete with threatening sky beam).WW84 is not that movie.The original Wonder Woman was closer to that mould, apparently forced in that direction by studio high ups, but this time it seems Patty Jenkins has earned enough sway at Warner Bros to make the movie she wanted to.WW84 manages to achieve something unique in the superhero space by offering a film less concerned with the next action beat, and more concerned with the next emotional one. It's ultimately a love story, wrapped in a social commentary on capitalism, with a message of truth and hope. For me it invoked the same sense of hope that came with watching Donner's 1978 Superman as a kid.Of course Gal Godot and Chris Pine still carry the film with their brilliant chemistry. And Kristin Wiig was a great choice for the role of Barbara Minerva. I also appreciated Pedro Pascal's turn as villain Maxwell Lord who comes very close to being too over-the-top cheesy but still pulls off a convincing humanising performance.WW84 is not the epic superhero blockbuster we might have been expecting with a return to the movies. Perhaps it's trying to be something more. A timely reminder of what a true hero can be in 2020."}, {"id": 235, "text": "When was the last time you saw a proper standalone superhero film? Yeah, I couldn't remember either and as I watched Diana swing from one lightning to another, I experienced that long forgotten feeling of heroic joy. While it certainly didn't live up to the ridiculous hype, it was still a grand spectacle that satisfied my craving for a cinematic experience.To my surprise, the narrative of the film was a lot bigger than was shown in the trailer and I mean a lot! Due to her actions, Diana ended up paying quite a hefty price as she battled two intriguing and non generic villains while the events of the film escalated to levels that are uncommon for most superhero movies. With that being said, WW84 did try to poorly juggle too many subplots and as a result couldn't tie them up in a nice way without leaving a multitude of in-your-face plot holes.I admired that instead of trying to justify the plot elements with pseudo sciene or the word quantum, the movie just admitted that it was magic. Sadly the narrative itself lacked the magic of the original as it failed to conjure up a single emotional moment, not counting the stunning prologue. Gal Gadot was naturally electrifying but her performance felt timid, as if she was sacred of being a powerful heroine that we loved in Part 1.As the film swings between magnificence and disappointment, it satisfies the cinematic superhero craving thanks to the impressive visuals and Hans Zimmer's soundtrack but it fails to create the exhilarating experience due to a flawed narrative and a lack of an emotional touch. If I watched it at home, it would have been a 6/10 so cinema is recommended.Movies.shmovies on Instagram"}, {"id": 236, "text": "If you enjoy reading my Spoiler-Free reviews, please follow my blog :)The superhero genre has been growing exponentially during the last decade, so it's bizarre to go through an entire year with only Birds of Prey and The New Mutants instead of literally dozens of films from both Marvel and DC. Thankfully, Warner Bros. decided to release Wonder Woman 1984 before the year's end, but not without a catch. Most people will only have the possibility of watching one of the few blockbusters of 2020 through HBO Max, a streaming service only available in a couple of countries, while some incredibly lucky moviegoers might have the chance of seeing this visually epic film in theaters, depending on the country's pandemic rules.Fortunately, I'm one of those lucky people who got the opportunity to end 2020 on a positively immersive note by watching Patty Jenkins' latest flick in an almost empty IMAX theater (paradise). If you've been following me for some time, you know I'm a firm believer and defender of the so-called theater experience, and I can't hide the fact that I felt extremely emotional going into one of the best, biggest theaters in Portugal to witness one of my Most Anticipated Movies of 2020. Until 2017, DCEU struggled to deliver a massively loved installment, and Wonder Woman came to the rescue. It was one of my favorite films of the respective year, so I was obviously excited for its sequel, even more having in mind the circumstances we're all living in.In my opinion, this sequel stands close to its predecessor. With a lengthy runtime known for being associated with absolutely epic movies, I was confident that WW84 could deliver a solid film with great villains for a change. Well, Kristen Wigg and Pedro Pascal are definitely two of the indisputable standouts. Patty Jenkins, Geoff Johns, and David Callaham made the right decision in dedicating a significant portion of the screenplay to Barbara Minerva and Max Lord. Their arcs are far from being groundbreaking, but they're a thousand times more effective than the CG punch bag narrative.Barbara follows the lonely, insignificant, no one cares about me archetype, and Wiig does a surprisingly remarkable job in portraying this character, but the script is what really makes her shine. At first, her comedic mannerisms left me a bit dubious about the eventual character's likeness. However, as time flies by, it's almost inevitable to feel sorry for Barbara, making her future motivations understandable and perfectly natural. On the other hand, Max Lord is apparently exploding with conviction, but his life is not as amazing as everyone might think. This time, it's Pedro Pascal who ends up elevating the character, delivering a brilliant performance with just the right amount of over-the-top expressions.Even though these two are magnificent, Gal Gadot continues to prove that she's one of the best casting choices of the millennium, interpreting Diana Prince aka Wonder Woman. I seriously cannot imagine another actress wearing that costume, throwing that Lasso of Truth, incorporating the character's essence as seamless as Gadot. In this movie, she was able to perform highly emotional scenes, nailing every single one. Her chemistry with Chris Pine (Steve Trevor) is palpable on the other side of the world, and their interactions go through every zone of the emotion spectrum. Regarding Steve, I'm not going to spoil how he comes back or anything concerning his arc, but I can safely write that his presence in the film is both necessary and logical.The biggest compliment I'll offer this sequel concerns its screenplay and direction. Finally, I can confidently write that the DCEU is capable of producing a well-structured, well-developed story with well-written characters. It doesn't have as much action as the original, but I still didn't feel the 151 minutes. WW84 flows incredibly well due to Jenkins' ability to fill up the runtime (almost) only with important scenes. There's a slight over-persistence in the attempt at sending a certain message (I'll get there), but story-wise, I sincerely wouldn't take a second out. Even the comic relief moments, particularly with Pine (who plays some sort of parallelism with the first movie's Diana), are welcome and timely.The action scenes might be low on quantity, but the few that the audience gets are long, complex, and technically challenging to pull off. The opening sequence alone almost made me tear up due to its epicness. Hans Zimmer's powerful score, Richard Pearson's clean editing, and Matthew Jensen's camera work all work together to present a lengthy, grand, wide view of an Olympics-style obstacle course with young Diana. Throughout the entire film, the action is colorful, vibrant, fun, and entertaining... except for the (supposedly) climactic clash.Well, to be fair, there are two climaxes during the last thirty minutes since WW84 owns two antagonists to play with. One of them is closed in perfect fashion, with the emotional stakes at their highest. Great job there, no complaints whatsoever. However, the main fight sequence inexplicably contrasts with the rest of the movie's action. The vibrant colors disappear and are replaced by a dull grey, which makes one of the characters involved (who shares the same color tone) hard to notice, transforming an epic final battle into an underwhelming, barely comprehensible collection of awkward cuts, punches, and screams. Gadot's golden suit is way less exciting (and poorly lit) than her original costume, and Barbara's arc ends without real closure.In addition to this, Jenkins insists too much on passing to the audience that greed brings horrible consequences. Be careful what you wish for, money and power can't buy happiness, be thankful for what you have, and messages along these lines are repeated continuously (implicitly and explicitly). I admit that it might be a nitpick of mine and that not many people will feel like I did, but I couldn't help but feel that some moments sounded and/or seemed a bit preachy and way too repetitive. Also, it's a bit weird how the official premise mentions Wiig as Cheetah, but this word is not mentioned once in the entire film... Nevertheless, don't be mistaken: I'm thrilled that WW84 is the last flick I watch at a theater this year!All in all, Wonder Woman 1984 proves that DC continues on the track of success by delivering a well-structured, well-developed DCEU installment without an absurd amount of overwhelming CGI and/or forgettable villains. Patty Jenkins, Geoff Johns, and David Callaham's impressively layered screenplay makes the lengthy runtime feel adequate not only by offering epic, exciting, technically superb action set pieces, but also due to the remarkably well-written heroes and antagonists. Gal Gadot and Chris Pine are outstanding together, but Kristen Wiig and Pedro Pascal steal the show as the newcomers. With two wonderful villains, WW84 boasts a solid, elaborate narrative that I was lucky to witness on the big screen. Unfortunately, the climactic battle is disappointingly underwhelming and colorless, Barbara's arc ends abruptly without true closure, and Jenkins insists too much on the thematic message of the story. These issues may affect more viewers or not, but one thing's for sure: it's one of the most entertaining movies I've seen all year, worthy of being seen on a massive theater.Rating: A-"}, {"id": 237, "text": "What should I write about Wonder Woman 1984? The unique and breath-taking choreograph and action sequence inspired by Cirque du Soleil? How Ms Gal Gadot is perfect for the role? She is strong, determined, heroic and beautiful, you just can't take your eyes off her. Should I commend the skilful direction of Ms Patty Jenkins? Who portrays female power so well? This is not a good year for movies, and also movie fans. First, cinema closure. Then, many movies are forced to push back their screening dates. Will the experience of big screen be finally replaced by streaming companies? I really hope not. After the release of wonder woman in streaming, we know that a perfectly clear digital copy will be available on the web, and this will affect the box office of Wonder Woman 1984 somehow, even diminishing the efforts of Ms Gadot, Ms Jenkins and the entire movie production team who have worked hard for this movie. But let me assure you that no digital copy can replace your experience in the movie theatre. This is a chaotic year, but with the vaccine in the horizon, I believe hope will prevail once again. In this chaotic year, we need a movie like Wonder woman 1984.This movie had brought me into a journey to another world, and let me lost in this world happily. This movie has reminded me how I love movies as a kid and shows me there is hope if we still believe. If you share this love for the movies and are still a believer, go and watch it."}, {"id": 238, "text": "Wonder Woman is the hero 2020 so desperately needed. The movie is a shining beacon in an otherwise dark and depressing year for cinema. If nothing else this film is a rollicking, feel-good delight filled with emotion, classic throwbacks, a surprising cameo and good performances. Pedro Pascal continues to remind us why 2020 is arguably his year; Kristen Wiig channels Annie from Bridesmaids and totally owns the role of Barbara Minerva, whilst the producers thankfully do justice to her CGI counterpart.Is it better than the 2017 film though? The short answer is no: it takes an hour at least to get going, whilst the final showdown between Diana and Barbara is underwhelming, lasting only seconds longer than the infamously short dust up between Batman and Superman in BvS. Thinking about it, none of the action is particularly memorable, at least nothing on the same scale as the trench scene from the first film.However, bum-numbing runtime aside, this film is still a good time, demonstrating that, even in the oversaturated superhero genre, films like Wonder Woman can still have the power to surprise its audience."}, {"id": 239, "text": "Gal Gadot and Patty Jenkis return for the sequel to Wonder Woman. It was one of the thousands of films that were advanced because of the Pandemic, but fortunately it was released in 2020, even with controversy, as it will be simultaneous with streaming, something new for the industry.Gal Gadot manages to act and stand out here than in the first film. The two villains are well developed, the story of the two holds you back. The sequel is better than the first film. Well, here it is lighter, upward, high spirits, even with the problems that the humanity of the film faces, and we also in real life, the film brings a speech of optimism and hope. Inspiring us to be better as humanity!It has the '80s vibe, but with the look, technologies and ambitions of the time. But, I missed the songs of the time, which was the best time to have a soundtrack. In the trailers, they put New Order - Blue Monday and it was one of the things that took me to see the movie.It also has fan service and references according to the mythology of the heroine in the comics. And that post-credits scene was sensational, it made me tear up and vibrate, and look, I didn't even accompany this person in her time!"}, {"id": 240, "text": "After months and months of anticipation Wonder Woman 1984 has finally made its way to the UK and I went back to the cinema today to see it and here is my review. The premise of the film is set in the year 1984 and sees Diana Prince trying to get on with her life as new threats emerge to challenge her.Main Character I remember when Gal Gadot was cast as Wonder Woman, most of us out there were like she looks the part but can she act the part and without a shadow of a doubt she is perfect as Wonder Woman and it is the role she was born to play. She brings so much life to this character and you really care about Diana and really want her to succeed, her character takes interesting twists and turns and it feels like an appropriate development from the previous film and credit to Gadot for that.Supporting Characters Chris Pine reprises his role as Steve Trevor and I wasn't sure about this after what happened to his character in the previous film but it really works and is a real highlight of the film. Pine and Gadot have superb chemistry together and it is even better here then it was in the previous film and that is because both of them are having so much fun together and it is really nice to see and works for the story the film is trying to tell. Kristen Wiig plays Barbara Minerva and I thought she did a really good job in the film, I must admit I wasn't sure at first but as the film goes on she gets better and better and her character is one you can feel a bit of sympathy for and you understand the actions she takes and credit to her for a strong performance here. Pedro Pascal plays Maxwell Lord and he is fantastic here, the trailers make it out that he is just a cheesy villain but he is far from that, he is the most interesting character in this film and they do so much to make him a memorable antagonist and one that will be remembered. I think with The Mandalorian we have maybe forgotten just how good Pascal is and this film is here to remind people just how charismatic and amazing an actor that he is.Story The story for this film is fantastic and one of the best in recent comic book films. The relationship between Steve and Diana is really well developed and better handled here then it was in the first film, mixed with the interesting characters of Barbara &amp; Lord provides a fascinating story that feels appropriate in 2020. It really pulls on the emotion and especially in current times it feels like the story people need and one that will resonate with audiences. A film like this shows that sometimes having less characters but really developing them is a much better idea and allows you to really get invested in what you are watching.Script The script is great, this film takes place in the 80s and doesn't hide away from it but it also doesn't cheese the film up too much and feels like the right amount of it. The drama is ramped up and I grew to really care about the characters in the film and the blend felt right all the right through with those deep moments and the lighter moments.Style As I mentioned above the film does a really good job in making you feel like you are watching the 1980s and it is a fun change of pace from what we are used to for sure. The action scenes are also pretty well done in this film even though there is an over reliance of The Lasso Of Truth, that is a tiny complaint. Though I do have a bigger complaint and that is some of the CGI, these were in the trailers so there not spoilers but it is Cheetah and the Golden Winged Armour. They just don't look very good and the action scene teased in the trailer disappoints and fails to live up to the hype.Overall Overall, this is a fantastic film that improves on the first film. If you are a fan of Wonder Woman you will really enjoy this film and this is a film you have to experience on the big screen so when you feel comfortable go out and support cinemas and this film by seeing it."}, {"id": 241, "text": "Sure you'd agree with me that Gal Gadot is a treat to our eyes, and in WW84 she shines with exquisiteness physical beauty and excellent acting. But the movie itself, especially its script is simply pathetic.Pulling her bf from heaven into Earth is just nuts. Diana asked how was that and he replied that he was in a good place and then all the sudden he was in the body of that unknown guy and he used the phone book to track her. wao, and where the script writers sent the soul of the man whose body was taken (or borrowed)? hey wait, we just borrow a body... nuts.then, the transformation of the nerdy, kind, good-heart archeology lady into the mean-spirited cheetah makes no sense. it doesn't suit well that if you are really good person with respect and love for humanity rooted in you, makes no sense of all the sudden becoming totally the opposite plus becoming bad is not a good message. me, i did not like that.also, everybody getting from egypt to new york in seconds is totally loco, and i don't think a pilot from world war II could immediately fly F-16. and diane gets into the smithsonian to just steal a plane which full gas tank and all ready to fly, come on...i could go on and on. yes, i know its just a movie, but when i compare WW84 with the one we saw in 2017 there is such a huge difference in quality.the one before is far superior, far more entertaining and believable, and the little diana competing in the initial games is a cute lovely little girl, but when running and competing does not seem athletic at all to overpower the other seasoned warriors.also, pedro pascal as max could not be more annoying, and so creepy the way he hugs his little son, who should be scare to no end with a dad so loco that that.i could really go on with more examples on how the script is weird, but sufficient to say that Gal Gadot is PERFECT as wonder woman, the most stunning wonder woman ever. BUT the movie itself is disappointing to say the least. i give it a 2 out of 10 and will not watch it again, nor recommend it."}, {"id": 242, "text": "Just saw it and I have to say I am bit disappointed with it. There was no big battle or catastrophic scenes that is synonymous with superhero movies. Cheetah again is another weak villain and the other one was nothing but just someone who grant wishes. It feels more like a made for TV movie instead.I can't help to think one of the reason why the film was so bad was Patty Jenkins unhappy with her pay though she got a hefty increase on this 2nd movie. It may be justifiable for her comment however I would compared it to someone new who just started working maybe with a couple of years of experience as opposed to someone who has already been doing it for decades. There is no way the compensation package will be the same for both. So she should do the grind like everyone else before demanding more.Unfortunately this movie wouldn't give her that considering how badly it turned out both from CGI and storyline perspective."}, {"id": 243, "text": "Jenkins' fast paced direction makes this film an effective comic book movie that leans heavily on wholesomeness and optimism, leaving out any kind of moral ambiguity or nuance for bright colours and popcorn friendly ostentatious action scenes. WW84 is a rare superhero sequel that, for better or rarely worse, carves its own path and finds something joyous, wacky and deeply enjoyable as a result. Gadot has a queenly self-possession and she remains a charismatic presence who wields the lasso with authority. There are some fantastic costumes and some terrific bold performances from a delightful cast specially Pedro Pascal who's talent is being wasted behind the Mandalorian helmet. It's a visually dazzling melodrama that has to hide it's relative disinterest in superpowered showdowns but the movie's in service of a plot that sometimes loses sight of what makes the character so great in the first place. Though the film can't quite reach the heights of the first film, it is still brimming with the same wonder and joy as the previous one beacuse unlike the first the flaws are minor and aren't glaring at you and the movie definitely soars beautifully when it matters the most. Overall, Wonder Woman 1984 is a very hopeful film with hints of sadness and realism especially towards the end and it kinda takes you back into the real world with a much needed message of hope and a sense of optimism, contemplated strongly by the musical score from the legend Hans Zimmer."}, {"id": 244, "text": "So the pandemic situation cancelled Wonder Woman premiere in June 2020, but finally we are hare ,watching the Diana Prince, who is becoming Wonder Woman in every difficult situation. She is the solution, the one hero that everybody is waiting for. Yes she is entertaining me enough to pass over the corona situation in my country. At least, we can think about movie and we watch it on the cinema like ordinary days we have. It is a fun way to appreciate the world. She is the light on the movie nowadays. I don't know who else can be Wonder Woman, than the gorgeous Gal Gadot. This Wonder Woman 1984 is quite different with the previous Wonder Woman, because we can see more drama and more loves, but at the same time we have more tears and more desperate feelings. Wonder Woman is pictured to have weaknesses, is about to love. Loving can take some energies inside you. Sometimes we lost the way and we redefine again ourselves. I think Patty Jenkins here want us to know that Diana Prince is also weak about love just other women. When we are really in love, we are just weak, we are not becoming ourselves, and sometimes we lost ourselves. The drama inside, the extraordinary special effects, and of course the beauty of Gal Gadot makes once again the breakthrough in our Wonder Woman era. I am thankful to the God that I am alive in the same universe with great director and actors of this movie."}, {"id": 245, "text": "(This review is from my daughter)About Wonder Woman 1984...I cried multiple times during the movie.I was an outspoken fan of the first WW: Wonder Woman was portrayed as a badass warrior with an immense heart. I am so happy that WW1984 explored the other side of Diana: her constant pursuit of love, truth and conciliation; her belief that humanity has achieved great, formidable things and that, in the end, human beings can UNDERSTAND AND FORGIVE each other and rise above selfish motivations. YES, the action sequences are effing AMAZING!! BUT, it is the EMOTIONAL sequences in the movie that will make you cry like a baby and will make you say to yourself: this is the movie we need for the times we're living right now.This movie is aspirational. It captures perfectly the 80's mood in its setting, design, feel, almost cartoonish approach. It is DELIBERATELY corny in doing this. And it works so well because it is self-aware and earnest! This film is like Wonder Woman herself: full of heart, full of goodness, full of hope. The music score... oh my God, the music score...As I said before: Diana/Wonder Woman is the feminist icon we need. Strong, compassionate, truthful, badass, sensitive, sensual. And one of the best parts about WW movies is exactly this: the development of Diana as a character with these traits is not done at the expense of weakening and demonising male main characters. Steve Trevor is her equal (except in super-hero powers...), and she LOVES him PRECISELY because he is so strong, competent, badass, courageous and heroic. Max Lord - one of the most complex main villains I've seen in a comic book movie - well, let's just say... be prepared to cry for and with him. Only a WW movie can make you feel like this for a villain.This movie does a 180 in relation to the previous one. Be ready and open to this change. It is done deliberately - after the massive success of WW1, trying to repeat the same formula would be destined to fail. By adopting a complete different approach, WW1984 works perfectly and is a great sequel to the brilliant first movie!Ana Cavalieri"}, {"id": 246, "text": "I liked the first Wonder Woman. I did not love it, I did not hate it. It was a competent movie and a pretty good superhero movie although it had a lot of bad things about it. This 1984 sequel is cut from the same stone, only dialed up to a over the top 1980s movie. In comparison the CGi is better in this movie, and perhaps the acting is also slightly better overall. The villains are also slightly better, but since the absolute atrocious villains from the first movie are some of the worst of all time it does not really say so much. Everything else though... oh my...Okay, lets start with the good. As mention above the DC computer graphics department has improved. Without checking I assume some got fired and they hired more competent people because the special effects in this movie is about 10 times better than the first... well, it was so bad in the first movie so not a good comparison and the effects have bad moments in this movie too... The music and scenes are done well. Patty is a great director comes to scenes, settings, set design and using it to paint a gorgeous picture. She should make documentaries or something, action movies however... not so much... And as in the first movie the on screen romance and scenes with Diana and Steve are great. Those two have a great chemistry and almost all the plus I can give this movie comes from those two and their scenes together. They should make a movie with those two stranded on an island or something, I think they would do a great job.Sadly there the praise ends.The big negatives are the over the top cranked up to maximum fling and flung to cranked up music. It is hard to explain, but is just like someone threw all they could think of about the 1980s into a blender, threw tons of pastels at it, put the volume on max and then let a subpar action director throw this mix at the screen with little to no thought behind it. This is just noise and colours and attempts at humour that is meant to be cool, teach us something, and the movie is supposed to have this big psychological worldwide unification moment and it all fails. Miserably fails.This movie wants to be cool, it wants to have depth, it wants to give us WW as this inspiring mother figure that cares for all and save us from ourselves. But since it is all done with really bad dialogue (only the scenes with Diana and Steve work) and almost every scene is cringeworthy garbage this movie is a huge failure. It fails with almost everything. And when Diana is not with Steve she is like a walking around cliche teddy-bear stating so many nauseating lines I am uncertain which line is the worst. Dianas wisdom is by itself a drinking game in this movie. Diana's power level change constantly, there are plot holes in almost every scene, and the villains, although a lot better than in the first, are such cringy over the top weirdo types that I kept thinking of Sharon Stone in Catwoman. And the 1984's scenes and feel is too much. This movie is a parody of the 1980s.I could go on about how nukes work, or how much fuel there are in planes, and how geography does not change to fit a movie or any other thing that bothered the hell out of me with this movie, but I will just end this with stating that the 3/10 point is generous, only saved by the great pairing of Gadot and Pine. Those two should always be in each other movies from now on. I also give a extra point for Patty Jenkins use of set design. Some of this movie is lovely to look at, too bad the movie otherwise suck. I also want to state, since I saw this movie in Spain, that if you go and watch it in Spain ignore the translation text at the bottom of the screen. Sure the dialogue in this movie is awful, but the translation make it even worse."}, {"id": 247, "text": "I loved this film so much. DC Comics have been on the right track in recent years with a move from drab superhero films to bright, fun blockbusters, and Wonder Woman 1984 is the culmination of all of that hard work. Though a fairly simple and arguably overlong film, this is pure, unadulterated superhero joy throughout, prioritising fun, action-packed entertainment over convoluted comic book lore from start to finish.Highly reminiscent of the original Superman starring Christopher Reeve, Wonder Woman 1984 is a film that just wants to have as much fun as possible, no matter what. So, while its immediate predecessor may have seen Diana Prince fight off enemies in a fairly more gritty and down-to-earth style, this sequel breaks open the toybox with a seemingly infinite supply of utterly delightful superhero excitement.Everything about Wonder Woman 1984 is bright, fun-loving and so wonderfully innocent. From its humour to its action and even the colour of Diana's superhero outfit, this movie is perhaps the most purely enjoyable comic book blockbuster of the 21st century.Though the story admittedly takes a while to get into gear, the opening two sequences of this movie are so much fun, and hark back to a more innocent, fantastical view of superheroes like in the days of Christopher Reeve's Superman.As comic book movies have come to dominate the box office, we've been looking for new, supposedly fresh angles on classic superhero stories, but it's not often that we get a movie nowadays which just wants to tell that classic story in as enjoyable a manner as possible.Despite an undeniably slow-moving first act, Wonder Woman 1984 bursts into life in the second act, with a thrillingly entertaining story of globe-trotting goodies and baddies, all culminating in an utterly preposterous but brilliantly enjoyable action finale that just keeps getting better and better.This movie isn't trying hard to be relevant to the modern day, or even to the laws of reality, but it's exactly that which will make Wonder Woman 1984 a timeless classic of superhero cinema. Simplistic it may be, and completely detached from reality it certainly is, but that willingness to just let loose and have fun makes the film so enormously likable.Gal Gadot is once again outstanding as Wonder Woman, and without doubt the best hero in the DC Extended Universe by a long way, while Chris Pine delights in a smaller but still thoroughly enjoyable supporting role. Kristen Wiig is a surprise too, while Pedro Pascal is the real stand-out as the film's main antagonist, with just the right balance of menacing greed and comic book villainy to fit this film's fun-loving atmosphere to perfection.Coupled with gorgeous visuals and excellent CGI effects throughout that only add to the film's bright-eyed take on superhero cinema, it would take the coldest of souls to find something to genuinely dislike about Wonder Woman 1984.Director Patty Jenkins led the way forward for DC with Wonder Woman three years ago, and now with this sequel, Jenkins has once again cemented herself as an immensely talented filmmaker, always putting the audience first and telling the fun, enjoyable story that we all need, and that Wonder Woman really should be.Overall, it's fair to say that Wonder Woman 1984 is a far, far cry from the drab beginnings of DC's Extended Universe with Man Of Steel. Blissfully simplistic yet endlessly entertaining, the film's unrelenting imagination and desire to have fun will set it out as a timeless classic of superhero cinema, featuring another spectacular performance from Gal Gadot as Diana Prince, and more incredible directing from Patty Jenkins."}, {"id": 248, "text": "I liked the first movie, not as much as everyone but it was a compelling story, and I enjoyed it very much, nothing perfect but solid. I love the DCEU and superhero movies in general and I was very hyped for this movie and I couldn't wait to watch it in theaters during those hard times we're living. I was able to watch it and enjoy its wonderful visuals in theaters, but I was mostly disappointed.I honestly found the plot awful. The actors, especially Pascal and Wiig play their parts wonderfully, they're good actors but the very inconsistent characters, apart from some good scenes, are not enjoyable. Gal Gadot and Chris Pine are also great and the truth is that the dialogue between Diana and Steve did touch me and there were very good scenes, my favorite of the film was when they say goodbye again, I got really emotional and it was wonderful.But apart from a spectacular opening scene with Diana in Themyscira, and some entertaining action scenes, the plot and script of the film are very bad and border on the ridiculous. It tries to honor the 80s and the superhero spirit but fails, being quite lazy and inconsistent.I don't blame the director as she did a very good job with the first movie, and I think Jenkins is a compelling director with good qualities. Maybe it's mee who has not known how to connect with this picture, and I am not saying that it is a total mess either. But the incredible sountrack of Zimmer, good action scenes and the excellent performances of the protagonists do not manage to save a film with a poor story, with a very different tone from the first and that does not manage to keep entertained or express its message well (an interesting one but poorly expressed).It's a shame because I love the DCEU (specially the Snyder ones), more than many, they tend to be deep films and with good direction and I like their seriousness, or when they try to change the tone like they did with Aquaman which was a bit more campy or go more to comedy like what they did with Shazam or Brids of Prey they also, without being so good, manage to get you entertained and you enjoy them, even their worst films for my taste have something interesting.WW84 disappoints me but at least it has some scenes that I liked. I was looking forward to this movie a lot and it's a shame for me. But I keep my hype for future DCEU installments."}, {"id": 249, "text": "First, let me make it clear that I do not hold any grudges against women, nor am I against strong female figures, for example. Tarantino Kill Bell is one of the most beautiful films that has presented us with female characters, and I don't hold a grudge against female superheroes.For example, Jennifer Lawrence with the mysterious character was amazing and Scarlett Johansson as a black widow was amazing But with this movie, the character, the story, the music, the fighting CGI is bad, and by all technical standards, this is one of the worst Superhero films recently I apologize for the Captain Marvel movie and take the title of the worst Super Heroes movie and award it to this movieLet's first explain that very few Super Hero movies have a dramatic or original story that excites the audience. There are very few, as usual, there is a danger to people, and the job of the superheroes is to always stop this danger. This is the scenario, and this is not a weakness, but there are factors that distinguish these films, including the problems of superheroes who suffer from psychological or family problems or problems with their acquired power. As for the character of the villain, what is the evil that he possesses and enjoys, what does he do with this evil, what are the causes and justifications for this evil, and the moral dilemma that we always live with between villains and superheroes or the superhero can rely on comedy and provide us with many interesting comedic scenes or moments Wonderful fighting, all these factors contribute to making the film close to the heart of the viewer and be beautiful, but this movie does not contain nor does it contain any of this"}, {"id": 250, "text": "Finally, the film we have been waiting for from after the success of the first part and one of the films that were successful in the world DC Everyone is waiting and excited about this movie, which is considered a huge budget and an excellent crew ... so does it deserve? ..... This is what I try to deliver to youFirst, we start with the story, and here is the biggest disadvantage, I mean, I am a fan of fiction films and heroes, especially since it is from a world DC Even though the film has nothing to do with the world at all ... and praise be to God, it is not deficientUnfortunately, the first time I see a bad patchwork story, I mean, without burning, first the story will be as if it was really in the eighties, I mean, the film will become far from serious and familial in an exaggerated way. The second thing is the story itself follows the path of its righteousness and right, meaning everything important to the story has become his excuse was stupid and as if they say the audience is tolerant, or it can not pay attention, or that you see. Why are the heroes not like you ... Unfortunately this is walking the length of the film there was nothing logical in it at all He landed his sweet messages many, and this is acceptable, but not to the point that he turns a silly drama film that talks about how the world has changed with love and affection! Even the bad guys who are the most important elements in the film, unfortunately, were ridiculous and bitter. Do not let me burn you. How did I save the world, unfortunately ..In the sweet element of the story, which is the return of Steve, the friend of the heroine, and how he gets to know the developed world and was trying to adapt to it and was enjoyable, but myself, the whole thing became fast and fast, and everything was controlled without any logic, but it was one of the best elements of the story as laughter at leastWe survived the action scenes, which unfortunately were an Indian film, meaning a movie with a huge budget, the effects were excellent, but the execution was stupid.But the frankness is transmitted as an experience in cinema. It was enjoyable at its moment, I mean, the action scenes took advantage of the cinema screen and speakers, right, and this was a wonderful thing in the atmosphere of the film, especially with the huge scenes and I have a second experience, God willingActing here was excellent frankness from all the actors. Even if the characters were ridiculous, the performance was from the heart, and it is the one that lets you hope for a pen, especially actor Pascal as Max Lord and actress Christine Wiig as CheetahIn general, the film never had expectations and exaggerations, and it reminded me of finding a movie Superman IV: The Quest for peace And how did they turn the action movie and the heroes into a movie How did he try to change the world with positive thinking .. Here the story is patched up, believe it, and how you are The action, as you expected, was bad coordination, even though the effects are mighty Acting is excellent despite the ridiculousness of the characters ... The film is worthy if you love the heroine and that you see it in the cinema as an experience I waited to see him at home, and a huge screen and worthy headphones arranged for you, and his money is related to a world DC I recommend it to fans of the character, especially in the post-end scene, and what I find can focus on and enjoy"}, {"id": 251, "text": "This was the central theme of the movie, and my word, how I'd wished the people in charge would take this into heart! This was a terrible movie, and an even horrendous follow-up to the sparkling original. It provides even more damning evidence to reinforce the notion that DC has ceded even more ground to Marvel in terms of the expertise in transferring comic book heroes to the big screen.If anything, director Patty Jenkins has been found out. All that hoopla she earned from the first movie has been needlessly squandered with a storyline that is both underwhelming and dragging. The unnecessary revival of the Steve Trevor character, and motivation of a meglomaniac villain adds tedious minutes to an already unexciting plot. And worse of all, that supposedly climatic big end-fight between Wonder Woman and Cheetah, well, its so terribly imagined, you would have thought it was the work of a first year film school student. The closest I could think of was Michael Cimono winning Best Director for The Deer Hunter and then went on to make Heaven's Gate. The only bright spark was the appearance of the former Ms World USA 1972. And that wasn't even part of the movie. Yes, it was that badThe news that WW84 tanked big in China (where life is pretty much back to normal) serves a ominous foreboding to the movie's fate elsewhere. For the people at DC thinking of sequels for Aquaman, Batman or Superman, you have been warned."}, {"id": 252, "text": "Throughout the movie there weren't many moments where I'd go 'wow'. It was pretty anti-climatic. Gal Gadot's gorgeous but her acting is pretty bland. The scenes where she reencountered and parted ways with her love interest are just so stiff. Chris Pine did all the work, I felt.And don't get me started on the fighting scenes. The way she would swing in the air is just so CGI-packed and gives off unprofessionally edited vibes.However, towards the end, the fighting scenes got much better. That's a plus. But the main villain was also bland as hell. He was definitely intentionally portrayed to imitate Trump. The supporting villain definitely took over the show for me.It was a good and entertaining watch. Is it up there with the other superheroes I have watched? No."}, {"id": 253, "text": "I thought there were some good aspects of the movie but overall there was a lot that I couldn't get on board with.I really like Gal Gadot and Chris Pine in the film they were great. Pine was funny and did a good job and Gal was impressive and I cared about them two the most. Wiig I usually enjoy and I did enjoy her as the more nerdy character she was playing but then her character sort of got lost and they never used her to her full potential and Cheetah felt like she had just jumped off the set of Cats. Bold decision using a Cat based Gillian I thought and don't think it paid off to be honest.The main vilian in the film bugged me as soon as he got on screen whether that was his purpose or not I don't know but his superpower and the way it was used well let's just say a little overkill and I felt that story arc was poorly written and the film started off well but the second part was just long winded and reaching.Overall the film wasn't bad but just a bit long and story could have been a tad better. Was nice to go see a new film after all this lockdown and what not... I loved the 80's vibe that was well executed."}, {"id": 254, "text": "At the end of 2020, here comes Jenkins' belated WONDER WOMAN sequel, thankfully Yours Truly is currently in China, where cinema remains open, and is able to watch its 3D version on the vast screen. WW 1984, its time-line is set among the Cold War nuclear hysteria, and our heroine Diana Prince (Gadot) does the usual superhero good deeds while remain certain degree of anonymity in Washington D.C.. Still pining for her lost lover, the WWI pilot Steve Trevor (Pine), she alights on a magical wish-granting gem, makes her wish and hey presto! Steve's soul is tossed back into our world (inhabiting another man's body, but in the eyes of his smitten beholder, he is the same old Steve all right), but soon it occurs to her that this miracle has a price to pay, the star-crossed lovers have to brave another adieu when Diana must choose to do the right thing, the emotional crunch is well-wrought, and Pine's soulful blue eyes are too irresistible to take our eyes off, and Gadot also passes muster to act out some real affect other than her acrobatic fighting showmanship.read my full review on my blog: cinema omnivore, thanks"}, {"id": 255, "text": "Overall, I'd say the film is fine, but it's predictable, which is tiring. If you're a comicbook fan, you've watched the second trailer and you have thought a little bit, you could find out for yourself, how the events will unfold in the exact same way and at the end you'll be right. There was not a single moment that surprised me.The action scenes are good, the colors are also used on spot, but the thing that seemed out of fashion a long time ago and that was in the first movie too, is the excessive use of slow motion. Several times done it's fine, but to be used in almost every action scene...To the pros I would add the musical layout, which reminds us in what time period we are, plus the recognizable Wonder Woman theme.Although things were predictable, I liked the performance of Pedro Pascal as Maxwell Lord and I would say that his arc was the best part of the movie. Kristen Wiig was good as Cheetah, but the gradation, toward her final appearance as a comicbook villain Cheetah, was more interesting, than the final battle. They could improve her as a character. I liked it more, than what they did with Ares fight in the first film.There're are too many cliches and Chris Pine is like transparent character. I mean he's there and he's important for Diana, but other than that, with him or without him there's no big difference. Overall his character was written way better in the first movie. Here he's kind of a emotional reminder for Diana plus the funny guy in the movie.At times the movie feels too long and it really is. They drag some plot points way too much and you can feel that a bit boring.I'll not gonna spoil anything, enjoy the movie when you have the opportunity. Definitely will watch it again, but I think that my overall opinion will not change much. Some things in the 2017 film were done better, other were elevated here, but overall, for me both movies are on same level."}, {"id": 256, "text": "It was good to be back to cinema, but this one was a bit disappointing.The movie starts really strong, and for the first 25/30 mins, I was thinking that this could not only be better than the first one, but even one of the most interesting superhero movies of the last years. Both of the intros (in the past and in 1984) are absolutely perfect, really good pace, fun, smart. The film works really well with the 80s nostalgia and take us back to that time as good as other movie/tv show did recently.Even the second act of the movie works. It's not as good as the first one - the relationship between Diana and Steve works most of the time, but it's also a bit too cheesy sometimes; Maxwell Lord starts working really well, but if falls to a too much cartoonish representation - but it has a good pace, the 80s are still there, we have a very good and fast paced scene in Egypt and Kristen Wiig does a wonderful job as Barbara Minerva.The issue is the third act of WW84. We can find some plot holes here, but the worst part is that the final 30/40 minutes felt like an enormous TED Talk. The movie tries sooo much to preach to the audience, to teach us everything about life, to explain us everything like we are 5 years old children that it turns out to be repetitive, predictable (ok, a problem with 90% of comics adaptations), lame and cheesy as hell. During this part, Pascal seems like an animated villain, Gal is not especially inspiring (probably the final scene with Chris work for some, but for me was a bit...meh) and even Wiig has a weird transformation - although is, by far, the best arc of the movie. This act alone is a 4/10. It would be even less, if the soundtrack was not so epic (a fantastic job by Zimmer) and the panic scenes around the world didn't work so well.I tried to think that during most of the time, the movie was fun (even if never memorable), so I can't say that I hated it, but I can definitely say that I was disappointed.The genre is saturated, I think everybody knows that by now, but the problem is not the superhero movies by themselves. We need more Jokers, more Guardians of Galaxy, more Deadpools, more Dark Knights and more The Boys. What we don't need is over and over again the same movie, with the same structure, the same dialogue, the same threats. It's time to move on."}], "reviews_amount": 257}