{"name": "Torbaaz", "titleId": "tt07805960", "reviews": [{"id": 0, "text": "This is a fantastic Film. So original and brilliant, stellar performances all around. I really appreciate the hard work put into this."}, {"id": 1, "text": "Outstanding! This film is a good watch for me. The concept seems organic and natural."}, {"id": 2, "text": "This movie gives absolute peace to my heart watching these guys giving brilliant and stellar performances."}, {"id": 3, "text": "All the characters make you feel that you are a part of it. So natural and real."}, {"id": 4, "text": "I found the film quite interesting. Its has everything a perfect viewer could expect for. Great one!"}, {"id": 5, "text": "The film has a lot of newness interns of the storyline and content as well as the drama. Well presented movie."}, {"id": 6, "text": "Wow! The film has been launched and I can't believe Netflix is with another hit film with tons of surprises."}, {"id": 7, "text": "The movie was a visually stunning experience. Brilliant storyline , great perfomance, and beautiful locations. Definitely, a must watch movie."}, {"id": 8, "text": "Netflix never disappoints its audience. What an inspiring film! I would recommend everyone around me to watch this film."}, {"id": 9, "text": "The trailer is brilliant itself that it gives you a feeling to watch the film. I am excited about the film after watching the trailer."}, {"id": 10, "text": "Action films are hard to make as it's isn't easily make your viewers tuned. But this film has nailed it"}, {"id": 11, "text": "Amazing work. Goes to film the high quality of Indian cinema. Hats off."}, {"id": 12, "text": "It is quite easygoing simple dilemmas. I feel like a heartwarming film. A must watch."}, {"id": 13, "text": "One of the finest films of Netflix. It is kicking off the hitbox. Awesome!"}, {"id": 14, "text": "Every single character of the film 'Torbaaz' is so natural with their character that you just can't stop watching."}, {"id": 15, "text": "I really like how the culture is shown in the film with morality and ethics."}, {"id": 16, "text": "The film is based on society, their culture and ethics. The concept is well portrayed in the Movie."}, {"id": 17, "text": "A lovely film to sit down and watch during this pandemic. Recommended!"}, {"id": 18, "text": "A must watch film. Such an authentic concept, full of talent and natural acting. Good concept!"}, {"id": 19, "text": "All the boys look stunning. They look strong and amazing together. I totally loved their roles."}, {"id": 20, "text": "This film is too mysterious. All the characters make you indulged and lets you enjoy the movie."}, {"id": 21, "text": "I loved the film. I was waiting for the film to get released ever since I watched the trailer."}, {"id": 22, "text": "Hats off to the entire cast and these actors are next faces of natural talent. Wow!"}, {"id": 23, "text": "The concept is really beautiful and it was very necessary to speak on. It is also portrayed well."}, {"id": 24, "text": "The execution of such difficulties in a precise manner is a victory. Good job!"}, {"id": 25, "text": "The delivery of the film is very smooth, natural and realistic. Good concept!"}, {"id": 26, "text": "This film raises the respect we have for the people we hold onto. Truly amazing!"}, {"id": 27, "text": "People who do not understand Hindi can watch it with subtitles. A movie that conveys its point in such a unique way!"}, {"id": 28, "text": "I have never been so satisfied watching the film. It's a feeling of satisfying the film is beautiful."}, {"id": 29, "text": "Loved the movie. Sanjay dutt brings magic on screen. The children are the best part of the movie. The story is so well executed. The message is beautifully told. Enjoyed watching the movie."}, {"id": 30, "text": "Netflix always come up with interesting contents and films to watch. And now I must a masterpiece has arrived."}, {"id": 31, "text": "The film turns into an emotional roller coaster ride after a few scenes which seems amazing."}, {"id": 32, "text": "I just watched the film and it was so much fun to watch. Also, I got goosebumps on in the end."}, {"id": 33, "text": "If you love action thrillers set in hamlets or tribal set up this movie is going to be a great watch for you. Do give it a try."}, {"id": 34, "text": "It shook me to the core, chills and gave me goosebumps on the content. The plot is really amazing."}, {"id": 35, "text": "You become more matured when you watch such interesting and high level of films. Good job!"}, {"id": 36, "text": "Amazing acting, screenplay,direction,story, and dialogues. Everything about this movie is perfect.Excellent movie. A heart touching movie."}, {"id": 37, "text": "This is a film which you can watch with your friends and get entertained. Loved it!"}, {"id": 38, "text": "I think we all should watch this film, share it and support these amazingly talented actors."}, {"id": 39, "text": "Very well executed and i must say that the actors have fantastically acted. Stellar performances! Best movie thanks for making it . acting is superb.high rated"}, {"id": 40, "text": "I prefer watching such films as I love drama, action based films. Loved this one."}, {"id": 41, "text": "Came back to this trailer after watching it, to just appreciate how good is this. Can watch with the whole family. Awesome stuff"}, {"id": 42, "text": "I just came here for Sanjay dutt as he has rocked in the film. His acting skills were on point."}, {"id": 43, "text": "I recommend this movie to all of the crime thriller enthusiasts out there. It's amazing content"}, {"id": 44, "text": "I could see such hardworking and supremely talented actors performing so well. Loved the film."}, {"id": 45, "text": "The best thing is you can have a watch with this with your entire family and get entertained."}, {"id": 46, "text": "The film is excellent. The plot is good. The actors are perfect. In short, it's a perfect 2-hour watch."}, {"id": 47, "text": "If you love action thrillers set in hamlets or tribal set up this movie is going to be a great watch for you. Do give it a try"}, {"id": 48, "text": "The film has a lot of newness interns of the storyline and content as well as the drama. Well presented movie"}, {"id": 49, "text": "Lots of love and respect for this film. Amazingly, the film is relevant to so many real."}, {"id": 50, "text": "I really appreciate the fine line between melodrama and reality. Something I noticed is quite natural and authentic."}, {"id": 51, "text": "For someone who loves thrillers, this movie is top-notch for you. You can have the best time watching this"}, {"id": 52, "text": "I Have never imagined to see Nargis fakhri in such a role, she's done a good job with the mannerisms."}, {"id": 53, "text": "I recommend this movie to all of the crime thriller enthusiasts out there. It's amazing content to binge on"}, {"id": 54, "text": "Everybody has their own struggling stories to present which is another good thing about the film."}, {"id": 55, "text": "I love to watch a Comedy film and so I enjoyed this film to the core. The actors were really good"}, {"id": 56, "text": "I could see such hardworking and supremely talented actors performing so well. Loved the film."}, {"id": 57, "text": "This is film is directed by one of my favourite directors Girish Malik. Truly loved it"}, {"id": 58, "text": "The unpredictability of all the characters when it comes to playing their part is the factor making this movie worth watching."}, {"id": 59, "text": "The film is excellent. The plot is good. The actors are perfect. In short, it's a perfect 2-hour watch."}, {"id": 60, "text": "Quite intensive I must say. What suspense they have held all the way! Gets more and more interesting."}, {"id": 61, "text": "The film stars Sanju and Rahul dev have done great along with the team. Love for all"}, {"id": 62, "text": "Torbaaz played by Sanjay Dutt has done his part so very well in playing this Lovely character."}, {"id": 63, "text": "Actors have played their part well enough and have helped in keeping the movie more alive and engrossing."}, {"id": 64, "text": "I like the fact that how hot and stunning the boys look. The film itself is a powerful one."}, {"id": 65, "text": "These newcomers theatre background stars have nailed the movie with their great performances. Good luck!"}, {"id": 66, "text": "The content is precise and much needed. The actors performed well. It's a package of a hit."}, {"id": 67, "text": "The performances are the highlight of the film. Sanjay Dutt and Rahul dev have done a great job!"}, {"id": 68, "text": "I loved every scene of the movie especially the part of the hamlets. Amazing!"}, {"id": 69, "text": "The storyline of the film is on the point. It is not even less or more, it's just perfect. Good job to the team."}, {"id": 70, "text": "The look and feel of the movie take you back to the New Hindi cinema. Great work!"}, {"id": 71, "text": "The raw acting and accurate action scenes keep the movie fresh and alive."}, {"id": 72, "text": "Great work! A lot of efforts are put into the action scenes. It's a great pleasure to watch."}, {"id": 73, "text": "The story from the surface seems a bit hard to believe but is quite indulging once you get into it."}, {"id": 74, "text": "Love this movie! Real story of how Afghanistan kids are talented and yet brainwashed."}, {"id": 75, "text": "169. This film has some realism and I think it will be an eye-opening film. I am thrilled by the concept."}, {"id": 76, "text": "This is what great cinema is all about. Its worth watching. Sanjay dutt,Rahul Dev and Nargis Fakhri performed so well. The story is unique and real."}, {"id": 77, "text": "Super excited! I shared the film to my friends and now we will watch it together. Very interesting!"}, {"id": 78, "text": "The movie is simply a hilarious ride with an amazing message."}, {"id": 79, "text": "One of the best of the film is that they have kept as real and authentic as they could. Lovely!"}, {"id": 80, "text": "I was very excited for the launch of the film and now it's out. All the actors are extremely talented."}, {"id": 81, "text": "Torbaaz' defines the word love and hate and so does these characters in the film. Nice work!"}, {"id": 82, "text": "OMG! The film is out finally. Planning to binge-watch it as I was eagerly waiting for this one."}, {"id": 83, "text": "One of the finest films so far made on real rural strugglers of India. Every actor feels real."}, {"id": 84, "text": "This is such an outstanding film. I just loved it. I liked each character and loved the storyline."}, {"id": 85, "text": "Lovely movie in every aspect of movies. No over dramatisation or sensationalism so unfound in Bollywood creations. Congratulations to Girish Malik and the entire team on putting together this presentation. Looking forward to the next one soon. All the best."}, {"id": 86, "text": "I just binge-watched this film. A real gem discovered by Netflix. One of the best character this man has played."}, {"id": 87, "text": "Whenever I watch such a masterpiece, I feel overwhelmed as a writer. Too much entertainment and a great concept."}, {"id": 88, "text": "In this film, we have witnessed how acting skills can overtake the story. This film is amazing and fun to watch."}, {"id": 89, "text": "One of the best rural life they have picturized and amazing plot with portraying the characters."}, {"id": 90, "text": "What a simple film! It is very simple but it has magic which holds you to watch till the end."}, {"id": 91, "text": "It is an epic movie. The characters are brilliant and their performances will entertain you to their maximum."}, {"id": 92, "text": "This time in a completely new genre. Thumbs up for this one."}, {"id": 93, "text": "The film has delivered true facts about strugglers of small towns. Torbaaz has nailed it."}, {"id": 94, "text": "I have never been so entertained. The dialogues and punchlines are on point. Enjoyed to the fullest."}, {"id": 95, "text": "The film has captured my attention. I think when I watched this movie I found it quite powerful."}, {"id": 96, "text": "Such a beautiful story. A good family watch. We need such stories where the entire family can sit and enjoy. The well done entire team."}, {"id": 97, "text": "A story that endures love and their love, families and values are put in a test. I loved it."}, {"id": 98, "text": "Amazing one! It's a brilliant film I must say. Great concept and execution. Good job!"}, {"id": 99, "text": "The plot is really good. It entertains you to the core. You can't hold onto your breath as its so mysterious."}, {"id": 100, "text": "You get drama, suspense, emotions, everything in a pack of film. I genuinely loved it."}, {"id": 101, "text": "What a fabulous film! What a concept! It is a film based on the people who value their loved ones"}, {"id": 102, "text": "I am happy that they have cast Rajakumar rao as he is a gem of an actor. His presence builds up a strong personality."}, {"id": 103, "text": "The film is surely a hidden gem. I must say that by the glimpse we figure out how interesting the film is."}, {"id": 104, "text": "For someone who loves thrillers, this movie is top-notch for you. You can have the best time watching this"}, {"id": 105, "text": "For all those asking, just go for Chhalaang. Really one of the Fabolous movie ever!!👍🏻❤"}, {"id": 106, "text": "Every single characters in the movie acted so well. From kids to terrorists. Cannot understand critic reviews giving only 5. I am full on 10!"}, {"id": 107, "text": "This film has definitely inspired many of us. The idealogy behind the concept is amazing."}, {"id": 108, "text": "The content is precise and much needed. The actors performed well. It's a package of a hit."}, {"id": 109, "text": "A must watch movie with a strong message. It is wonderful to see the difference a game can make to hundreds of innocent lives in a nation. Hopefully a lot of children in similar situations will actually choose a bat over a gun. Hats off to the entire crew."}, {"id": 110, "text": "This movie has really set some high bars in the Indian cinema. The entire cast and crew did a great job."}, {"id": 111, "text": "Nargis fakhri is a complete surprise in this role."}, {"id": 112, "text": "Fantastic Trailer! We need such contents to be discovered which holds up a mystery within."}, {"id": 113, "text": "This one seems like a promising film. As it's launched, I am really looking forward to watching the entire film soon."}, {"id": 114, "text": "I think this film holds a hard-hitting story which is hits and churns out the mindset of the society."}, {"id": 115, "text": "The film evokes respect, hatred, love and despair and how interestingly they have reflected in the show."}, {"id": 116, "text": "The entire team has put some real efforts to impact such a great and inspiring film."}, {"id": 117, "text": "I am speechless. What a film! What a concept! Netflix has done some fabulous job here."}, {"id": 118, "text": "This film connects us to love fight against injustice. This film has given us the source to know about it better."}, {"id": 119, "text": "The film is against lovers and iconic story that reflects their honesty and loyalty. Great job!"}, {"id": 120, "text": "I can watch this on repeat. The song is brilliant and I absolutely loved the concept they have executed."}, {"id": 121, "text": "The film reflects a strong, bold and thrilling perspective to a concept which is really good."}, {"id": 122, "text": "I was very excited to watch this amazing cast to perform their excellence on the screen."}, {"id": 123, "text": "The film is emotional and an inspiring one at the same time. The concept is beautiful."}, {"id": 124, "text": "Watching this feels real. I am a writer and I can see this film has a great concept. Great work is done here."}, {"id": 125, "text": "This movie gave me goosebumps. The scenes are quite intensive and drive your attention constantly."}, {"id": 126, "text": "I loved the concept and its execution in the movie. The directors and crew have worked good."}, {"id": 127, "text": "Incredible! The plot and concept are remarkable. Absolutely and utterly had fun watching the movie."}, {"id": 128, "text": "One of the best movies of 2020. inspiring storyline . Girish Malik's magic is back on screen. Young boys did a great job and a special mention for Rahul Dev."}, {"id": 129, "text": "Must watch, also considering this is a family movie. Different concept."}, {"id": 130, "text": "I really like the contents which are real and based on reality. This film is one of them. Superb!"}, {"id": 131, "text": "I am stirred to watch this film because I know it's a blockbuster already. It's launched and I think it's thrilling."}, {"id": 132, "text": "The music is very interesting and the film has powerful actors performing brilliantly. Good job!"}, {"id": 133, "text": "I just watched it and I think this one is especially for the youth. Everybody is loving it."}, {"id": 134, "text": "By watching this I feel the film is very intensive but also very inspiring at the same tim"}, {"id": 135, "text": "It feels amazing to watch all these brilliant actors sharing one screen and presenting a masterpiece"}, {"id": 136, "text": "OMG! The film is super amazing and exciting. It left me surprised. I'm happy that finally the film has been Released."}, {"id": 137, "text": "The entire cast team is wonderful. It felt like few of the actors were made to play these characters."}, {"id": 138, "text": "Amazing movie.Strong storyline. Visuals are beautifully captured. A very simple yet heart wrenching movie."}, {"id": 139, "text": "Iconic! Sanjay dutt was strong enough which made the show look more interesting"}, {"id": 140, "text": "After watching this, I think this film deserves awards and tons of appreciation. Great job!"}, {"id": 141, "text": "The film is based on mysteries and drama. This is definitely going in my watchlist."}, {"id": 142, "text": "This is one of the few films that has all the actors contribute so well to the film's story and screenplay."}, {"id": 143, "text": "The concept is portrayed and conveyed so well that actually many of us would want some more of it. Great concept!"}, {"id": 144, "text": "This Movie definitely is one of worthy contents as I could see its execution looks beautiful."}, {"id": 145, "text": "One of the finest concepts ever. Great execution and the characters performed amazingly well."}, {"id": 146, "text": "For all those asking, just go for Chhalaang.amzing story best seen."}, {"id": 147, "text": "Mind-blowing! I have watched this film like a thousand times and still counting. I loved it."}, {"id": 148, "text": "It's a hit. Superhit one. Full packed entertainment, drama, thrill and mysterious film."}, {"id": 149, "text": "OMG! Ever since I watched the trailer I was eagerly waiting for this one and finally, I watched it."}, {"id": 150, "text": "This film has shown different perspectives on how lovers need to face challenges in life."}, {"id": 151, "text": "If somebody is looking out for new content and breathtaking one, this suits perfectly. I loved it!"}, {"id": 152, "text": "The concept is really good and beautiful. The plot is amazing along with its execution of the film."}, {"id": 153, "text": "The film is beautifully structured and absolutely relatable. Each and every moment is beautifully placed."}, {"id": 154, "text": "These men make everything so realistic that you can't believe it's a film on the screen going on. Awesome!"}, {"id": 155, "text": "Brilliant movie. Sanjay Dutt was asusual amazing, and the kids truly stole our heart. the movie was captivating. It was emotional and entertaining."}, {"id": 156, "text": "This film has saved my quarantine. I am happy that I decided to watch this film. Totally enjoyed it."}, {"id": 157, "text": "I absolutely loved the story. Now that the film has been launched, will watch it Excited!"}, {"id": 158, "text": "This film has brought up some most sincere viewers to justice which again creates a interest for the show."}, {"id": 159, "text": "This film definitely has raised the bars of entertainment which feels fun to watch. Awesome!"}, {"id": 160, "text": "Outstanding! This film is a good watch for me. The concept seems organic and natural."}, {"id": 161, "text": "I loved this film as it is a rare gem. I think I would definitely recommend everyone to watch it."}, {"id": 162, "text": "Weaving together elements of unpredictable scenarios boost the confidence they had in their love."}, {"id": 163, "text": "This movie has covered all the important and current topics which are relevant to many of us."}, {"id": 164, "text": "In some of the scenes, the loyalty of theirs has put to test which I think they dealt with very well."}, {"id": 165, "text": "This movie has a separate fan base. Netflix is flooded with such great contents. Great job!"}, {"id": 166, "text": "Tons of appreciations to the entire cast and crew, also the directors and producers to bring out such a masterpiece."}, {"id": 167, "text": "The concept is immensely heart touching and absolutely commendable. I really liked it."}, {"id": 168, "text": "The story touched my heart. Rahul dev has acted tremendously well along with all the actors."}, {"id": 169, "text": "The entire cast and crew of the movie should receive huge appreciations for their amazing work."}, {"id": 170, "text": "A wonderful piece of work that truly deserves appreciation by one and all. The concept is beautiful."}, {"id": 171, "text": "A wonderful plot! Every scene is been put out to its max perfection. It is a great deal of enjoyment."}, {"id": 172, "text": "This movie has saved my quarantine. I have binge-watched the movie and I absolutely loved it."}, {"id": 173, "text": "The latest in the list is of pulling it off on the Netflix is Torbaaz, written and directed by Girish Malik."}, {"id": 174, "text": "Torbaaz' the title is unique itself, the concept has to be. I think my favourite would be Sanju baba here."}, {"id": 175, "text": "The writing department yet again takes the cherry for going the extra mile."}, {"id": 176, "text": "Finally! Here we have some good stuff to watch. Along with being horrifying, this movie keeps us entertained."}, {"id": 177, "text": "I think the characters throw a strong impact on every teenager or a youngster who is dealing through something similar."}, {"id": 178, "text": "The characters and scenarios are presented in a highly realistic manner which makes them very believable."}, {"id": 179, "text": "I like the fact, that even though the incidents shook all the characters, they were still battling through it."}, {"id": 180, "text": "Girish Malik's brilliant direction yet again stands out."}, {"id": 181, "text": "I love Sanjay Dutt. He has always been my favourite and this movie has made me love him more. I love Sanjay Dutt. He has always been my favourite and this movie has made me love him more."}, {"id": 182, "text": "He not only succeeds in eliciting brilliant performances from all his actors but he also manages to deliver an edge-of-the-seat thriller."}, {"id": 183, "text": "Wow! Such an amazing idea. The concept is really good, the actors nailed it, it's a perfect watch."}, {"id": 184, "text": "I can watch this movie as many times as I can. It freshens all my old memories and also teaches us to be strong."}, {"id": 185, "text": "I was scared too when they played the game and was wondering what would happen. Goosebumps!"}, {"id": 186, "text": "Torbaaz never really loosens its grip on the viewer."}, {"id": 187, "text": "The fact about the movie is it takes you with the flow. You can't stop yourself."}, {"id": 188, "text": "This movie deserves to be a hit one. What a brilliant concept one could think of! Good job!"}, {"id": 189, "text": "I really like the concept in the film and cinematography, the direction is excellent in the film."}, {"id": 190, "text": "This film has some realism and I think it will be an eye-opening film. I am thrilled by the concept."}, {"id": 191, "text": "This film has a whole different perspective which I think is very intensive and authentic enough to watch."}, {"id": 192, "text": "I love such films where there is action, drama, crime and thrill so I enjoyed it. Loved it!"}, {"id": 193, "text": "This is one of the amazing films. The characters are so realistic in their roles."}, {"id": 194, "text": "I watch the entire film and wow! The writing and acting of all the characters were sublime."}, {"id": 195, "text": "This film is a great success to Netflix. Keep making such kind of simple and realistic film."}, {"id": 196, "text": "I just watched the film and I really appreciate it, a very simple story but touches the heart."}, {"id": 197, "text": "We need more such films. I truly enjoyed it watching it once and might watch it again. Heart touching one!"}, {"id": 198, "text": "This is what India loves to watch. The plot is amazing and very well executed. Brilliant concept!"}, {"id": 199, "text": "I just finished watching the film. It is a lovely piece of art and very well done by the story writers and artists."}, {"id": 200, "text": "The team have done some unthinkable and brilliant creativity on the story of the film."}, {"id": 201, "text": "I am in love with Sanju . I am his big fan and I loved his performance in the film."}, {"id": 202, "text": "OMG! I never ever thought it would be so insightful. Each character has put in a mind-blowing performance."}, {"id": 203, "text": "I am completely blown away after watching this movie and waiting for more. What a beautiful and strong concept."}, {"id": 204, "text": "This film has covered all the important and current topics which are relevant to many of us."}, {"id": 205, "text": "I want everyone to see this amazing movie which gives us a powerful message in the end. Awesome!"}, {"id": 206, "text": "This film is quite fun to watch, it gets very emotional in the end though but you'll love it."}, {"id": 207, "text": "After watching it, I kind of became addicted to Torbaaz like I am addicted to Netflix's Lucifer. The great role played by Sanjay dutt."}, {"id": 208, "text": "The cricket scene is by far the best one. Engaging and entertaining. And also the visuals of Afghanistan is beautifully captured."}, {"id": 209, "text": "I feel like is was a good movie with a very important message for us. Heartbreaking to see what some children go thorugh. Hopefully this movie will change somebody's mind to the better."}, {"id": 210, "text": "A gripping plot. The message is deep and has beautifully reached to the audience."}, {"id": 211, "text": "Such great performances. Brilliant story and the actors did justice to their roles by performing it so brilliantly."}, {"id": 212, "text": "I am completely blown away after watching this movie. What a beautiful and strong concept."}, {"id": 213, "text": "Sanjay Dutt and Rahul Dev are looking perfect and they acted so well in the movie. Torbaaz just nailed it."}, {"id": 214, "text": "This is so heart wrenching. Especially all the characters have nailed it. The concept is beautiful."}, {"id": 215, "text": "Direction of the movie is done by Girish Malik, which is brilliantly done. Torbaaz has all the action and thriller."}, {"id": 216, "text": "This is something an epic level of concept which gave me goosebumps on every episode of the movie."}, {"id": 217, "text": "There are some hard truths of the society hidden in this movie. definitely must watch."}, {"id": 218, "text": "This story will truly blow up your mind. Couldn't have imagined something so evil could exist."}, {"id": 219, "text": "The movie story is only good, not the acting in the movie. U can watch if interested in STORY"}, {"id": 220, "text": "Only based on emotional instigation without really addressing anything"}, {"id": 221, "text": "This is a super hit film! The trailer drove me crazy and finally the film has been launched. Much excited!"}, {"id": 222, "text": "Girish Malik has once again done a superb job at his directory and getting the best out. Great work!"}, {"id": 223, "text": "The youth get a lot to learn here. The movie has given too many lessons. Brilliant"}, {"id": 224, "text": "Movie tell u about the fact,overall it's ok type not much interesting."}, {"id": 225, "text": "The most important part of a cinema is the story and the story is not that much satisfactory in this fim."}, {"id": 226, "text": "Torbaaz is a hit. Brilliant performance by Sanjay Dutt. Rahul Dev nailed it as usual and so did Nargis. And the kids were the true heart of the movie."}, {"id": 227, "text": "Watching this type of movie is really refreshing and I am already waiting for the next season of this amazing movie."}, {"id": 228, "text": "The story is great and without these super talented leading and supporting actors, it will not be possible to make Torbaaz."}, {"id": 229, "text": "Culprits,victims and cops, Torbaaz is definitely a nice movie. I love it and am amazed with the work of all the actors."}, {"id": 230, "text": "With great plotting, fact information and all details, this movie is amazing. Torbaaz is directed by Girish Malik, hats off."}, {"id": 231, "text": "Rahul dev has given a tough look in the movie and he just nailed it in the movie. Torbaaz is the best movie."}, {"id": 232, "text": "I don't know many of the movies but when I watched this movie, this definitely has become one of my favourite movie."}, {"id": 233, "text": "This movie promises to give goose bumps and adventures to the viewers. It is very intensive too."}, {"id": 234, "text": "Torbaaz is a really great movie, and there is no other story to do the comparison. Excellent cast and story."}, {"id": 235, "text": "Netflix is loaded with such inspiring contents and we have another one. This is definitely a hit."}, {"id": 236, "text": "I loved the concept and its execution in the movie. The directors and crew have worked good."}, {"id": 237, "text": "This movie is focused on so many things but out of all that Sanjay Dutt looked damn hot and smart."}, {"id": 238, "text": "What a movie! The entire cast has their perfect roles it seems. They performed brilliantly."}, {"id": 239, "text": "I have word to explain how I feel after watching this movie. Thay have conveyed very powerful message"}, {"id": 240, "text": "The story is relatable with the news reports. But I like seeing it in episodes, plotted very smartly and it is actually good."}, {"id": 241, "text": "Perfect movie, I loved this movie and already asked my friends to watch it soon. A hit movie."}, {"id": 242, "text": "My friend and my family loved Torbaaz, I have recommended them to watch it, and they loved the movie."}, {"id": 243, "text": "Such movies should be launched consistently in India. We need such contents. Hats off to the team"}, {"id": 244, "text": "Torbaaz is a hit movie and we all loved it. This movie made our weekend more interesting and intense."}, {"id": 245, "text": "The movie talks about terrorism in Afghanistan and how the kids are used to fulfil the wrong motive. The story is well put and is engaging throughout."}, {"id": 246, "text": "I have no words to explain how I feel after watching this movie. They have conveyed a very powerful message."}, {"id": 247, "text": "The most awaited movie I must say. I watched all the episodes of Torbaaz and absolutely loved them."}, {"id": 248, "text": "The entire cast of the movie has given phenomenal performances. This movie deserves millions of appreciation."}, {"id": 249, "text": "Torbaaz is a top class movie. This movie has a message which people should watch and amazingly done."}, {"id": 250, "text": "The direction and writing of the movie are the best. New concept and very entertaining."}, {"id": 251, "text": "It's a worth watching movie, Sanjay dutt and Rahul dev looked great and they performed their roles perfectly."}, {"id": 252, "text": "I want everyone to see this amazing movie which gives us a powerful message in the"}, {"id": 253, "text": "This movie is appreciated; the makers did a perfect choice of actors. I have already shared this with friends."}, {"id": 254, "text": "No one can believe that these actors of Torbaaz can perform like this. Excellent job makers and the actors."}, {"id": 255, "text": "A wonderful plot! Every scene is been put out to its max perfection. It is a great deal of enjoyment."}, {"id": 256, "text": "Sanjay Dutt in the lead role has thrilled the series even more. In love with the movie."}, {"id": 257, "text": "This is not a typical Bollywood movie. Phenomenally beautiful movie. Girish Malik sure"}, {"id": 258, "text": "I love the story, the action, the thrill, and the acting skills. This TV movie Torbaaz is superbly done by makers too."}, {"id": 259, "text": "I am actually thankful to my friend who has recommended me to watch the movie. Really It's a classic movie."}, {"id": 260, "text": "If you haven't felt the thriller of this movie then you must have seen Torbaaz very very soon."}, {"id": 261, "text": "Director Girish Malik and his team of writers have done a great job in moviecasing the twisted mindset of killers."}, {"id": 262, "text": "Loved the movie. It's always an amazing experience to watch Sanjay Dutt on-screen. Rahul Dev was exceptionally good. The children in the movie were a surprising element."}, {"id": 263, "text": "Sanjay Dutt and Rahul Dev have a real mystery in this movie Torbaaz. You will be amazed."}, {"id": 264, "text": "I really appreciate the actors and directors who have played their parts with such ease."}, {"id": 265, "text": "I had to watch 'Torbaaz ' movie because this movie has directed by my most favourite director."}, {"id": 266, "text": "I found this movie very interesting and have left a remarkable impact on my life. Great one!"}, {"id": 267, "text": "Now that's called a super hit movie. I am I love with its execution and the real content."}, {"id": 268, "text": "This movie has a different fan base. Tons of appreciations and much love for this movie."}, {"id": 269, "text": "A gripping plot. The message is deep and has beautifully reached to the audience."}, {"id": 270, "text": "Incredible! The plot and concept are remarkable. Absolutely and utterly had fun watching the movie."}, {"id": 271, "text": "Tons of appreciations to the entire cast and crew, also the directors and producers to bring out such a masterpiece."}, {"id": 272, "text": "What a role Rahul dev has played! He was already my favourite but after watching the movie I love his even more now."}, {"id": 273, "text": "Speechless! I am falling short of words to describe the movie. Creation and execution are amazing"}, {"id": 274, "text": "I did not get the hint at the start of the movie what it is based on but as it moves on the bittersweet truth is revealed."}, {"id": 275, "text": "Each individual actor has contributed to convey a powerful message. Brilliant performances."}, {"id": 276, "text": "This is something an epic level of concept which gave me goosebumps on every scene of the movie."}, {"id": 277, "text": "Never thought a movie could have such an impact. I absolutely loved the concept."}, {"id": 278, "text": "The base of the story is really interesting. I loved the concept which beautiful and inspiring."}, {"id": 279, "text": "This movie goes deep into my heart. I'm happy we have such overwhelming contents to watch."}, {"id": 280, "text": "This movie indeed is a heart wrecking truth. I had to share with all of my friends. Amazing!"}, {"id": 281, "text": "This movie has saved my quarantine. I have binge-watched the movie and I absolutely loved it."}, {"id": 282, "text": "Some of the scenes are quite traumatizing which speaks the truth again of our society."}, {"id": 283, "text": "It is a masterpiece. The movie is very interesting as it is a crime thriller and attracts youth."}, {"id": 284, "text": "This movie has saved my quarantine. I have binge-watched the movie and I absolutely loved it."}, {"id": 285, "text": "What a great concept! I really appreciate the writer's thought for creating such a masterpiece."}, {"id": 286, "text": "Wow! What a movie! I can't believe I would watch it once again. It is a very interesting one."}, {"id": 287, "text": "Sanjay dutt is one of the best actors and this another of one of his best performances."}, {"id": 288, "text": "Such an emotional one. It's just a movie but in some of the scenes, they have conveyed the reality."}, {"id": 289, "text": "This one is quite an unusual story and that's what I like about it. Hatts of to the creators."}, {"id": 290, "text": "The base of the story is really interesting. I loved the concept which beautiful and inspiring."}, {"id": 291, "text": "The film filled with adventures scenes and cons of the negative people around."}, {"id": 292, "text": "The movie promises to give goosebumps and adventures to the watchers. It gave me and I loved it."}, {"id": 293, "text": "What an outstanding concept! I couldn't find a much better story to watch in my pandemic."}, {"id": 294, "text": "This is an eye-catching movie for the youngsters. It really gives you goosebumps and makes you want to watch again and again."}, {"id": 295, "text": "How did I not watch this movie yet? Just watch the trailer and I'm starting with this movie the very next minute. I'm super excited."}, {"id": 296, "text": "A film for the people who are in love with crime and are always excited to watch"}, {"id": 297, "text": "After a long time, I have watched a movie with realism and relatable concept. Awesome story! Amazing movie. Powerpack performance by Sanjay Dutt and Rahul Dev."}, {"id": 298, "text": "It's perfect! I found it very intense filled with a rollercoaster of emotions and love till the end."}, {"id": 299, "text": "This movie is emotional as well as entertaining too. It had an evil side too. Loved it."}, {"id": 300, "text": "I have watched this movie and I absolutely loved it. It was very interesting and rememberable one."}, {"id": 301, "text": "This movie was one of the powerful movies I have seen lately. The actors were really good."}, {"id": 302, "text": "I really loved the moments they spent together, hanging out and that beautiful song just got me tears."}, {"id": 303, "text": "Such a thrilling movie! I am glad and I don't regret at all to watch this one. One of my favourite movie."}, {"id": 304, "text": "A movie that will give you goosebumps and excitement at the same time satisfaction. a perfect pack to sit back and enjoy."}, {"id": 305, "text": "Every move of torbaaz character is soo smooth and precise. The has done a great job playing this role."}, {"id": 306, "text": "Hands down it's a mind-blowing movie ! all the characters have nailed it completely. Loved it!"}, {"id": 307, "text": "Sanjay Dutt has always won hearts of millions and now he is back on the screen leaving us amazed"}, {"id": 308, "text": "Fantastic movie! The idea, plot, execution, everything Is just on point. I am amazed to watch this movie."}, {"id": 309, "text": "In all, it is a fantastic series to enjoy with family. Crime, evil and justice delivered is something soothing in this quarantine."}, {"id": 310, "text": "Now I know how important it is for all of us to watch this entire movie on Zee5. Well done!"}, {"id": 311, "text": "This movie is more of play with you psychologically. It's a thriller based movie with some of the entertainment."}, {"id": 312, "text": "The concept is really beautiful and it was very necessary to bring out in our society. Great work!"}, {"id": 313, "text": "Some of the scenes are quite traumatizing which speaks the truth again of our society."}, {"id": 314, "text": "Great concept. Storyline and direction. Perfect execution and a perfect movie to binge on."}, {"id": 315, "text": "I love Rahul Dev. I have seen all his work but I think this was the best one. I absolutely love his performance."}, {"id": 316, "text": "This movie brings such a rush to you that you cannot stop watching it. Great work!"}, {"id": 317, "text": "This is just a movie but you will connect on another level with every character and their role in the movie. Wonderful!"}, {"id": 318, "text": "Such kind of thriller, drama and electrifying performances was unexpected from these. Superb!"}, {"id": 319, "text": "The concept is connected to a game which brings a twist in the story. A dangerous one."}, {"id": 320, "text": "Another commendable aspect about the movie is it's incredible cinematography and background score."}, {"id": 321, "text": "I'm in love with great efforts that I think are put by entire cast and crew in making this movie the one it is. Amazing!"}, {"id": 322, "text": "I did not get the hint at the start of the movie what it is based on but as it moves on the bittersweet truth is revealed."}, {"id": 323, "text": "Sanjay Dutt, with his restrained acting, upright posture, amazing dialogue delivery, and a perfectly chiseled body."}, {"id": 324, "text": "This movie is fantastic. Each character was gelled up with his role and so the viewers were."}, {"id": 325, "text": "Tons of appreciations to the entire cast and crew, also the directors and producers to bring out such a masterpiece."}, {"id": 326, "text": "Girish Malik has chosen the perfect locations to improve the overall look and mood of the movie."}, {"id": 327, "text": "I was going through a rough time and this movie refreshed my mood. I watched it one night. Great one!"}, {"id": 328, "text": "All these actors have given brilliant performances that are convincing to the core, Torbaaz is a hit.."}, {"id": 329, "text": "I think we enjoy more when we feel it and if it's relatable then I think this movie is the best one."}, {"id": 330, "text": "The background score also adds to the excitement of the viewers, increasing the level of suspense and agitation."}, {"id": 331, "text": "Its is so well directed. I am in love with scenes and shots taken. Much love."}, {"id": 332, "text": "The story is breathtaking. I still get emotional shedding tears if I think of the movie."}, {"id": 333, "text": "The cast is also extremely well-thought-out and each actor has done justice to their role."}, {"id": 334, "text": "The brilliant editing and the background music immensely enhance the mood and the tone of the movie."}, {"id": 335, "text": "A gut-churning mystery-thriller that will have you hooked. Torbaaz is an engaging."}, {"id": 336, "text": "Incredible! Its fun to watch something you can relate to and I think I absolutely have. Well done!"}, {"id": 337, "text": "Sanjay Dutt has made his OTT debut through this Movie"}, {"id": 338, "text": "I truly and utterly loved the concept. They have brought out something similar and relevant to reality."}, {"id": 339, "text": "Sanjay Dutt has a strong build and enacting Torbaaz's role is icing in the cake for him.The character is going to leave the audience stunned."}, {"id": 340, "text": "Sanju baba yet again delivers a convincing performance.Thanks to his restrained acting which allows him to make Torbaaz a very relatable character."}, {"id": 341, "text": "This movie is very dramatic and enigmatic in a beautiful way. I truly loved the script. Good job everyone!"}, {"id": 342, "text": "Torbaaz has been on my top list since the trailer has arrived. I have been absolutely in love with this movie."}, {"id": 343, "text": "I watched this movie with my family and we absolutely loved it especially my mother. She is a big fan of sanjay dutt!"}, {"id": 344, "text": "Totally out of the box. The entire plot which is executed by the terrific actors and the team is amazing."}, {"id": 345, "text": "This movie has my heart. I can watch it all over again and also recommend to many."}, {"id": 346, "text": "Incredible! This movie has kept me in deep thought and a deeper thinker."}, {"id": 347, "text": "The entire cast and crew are supremely talented and have also done a very good job in the movie."}, {"id": 348, "text": "Girish Malik doesn't waste much time, he knows what to deliver to his audience."}, {"id": 349, "text": "It is a breathtaking concept! I was on the verge of all my sentiments throughout the seasons. Commendable."}, {"id": 350, "text": "It deserves to be a hit. All the characters of Torbaaz bring smartness and magic to their roles. Interesting!"}, {"id": 351, "text": "The visuals are beautiful and unbelievable. The motive of the movie"}, {"id": 352, "text": "I liked the intense ideology behind the movie. The drama, thrill, action, the mystery is movie beautifully."}, {"id": 353, "text": "The kids are the heart and soul of the movie. Their innocence and writing of the movie are blended well and surely has touched hearts."}, {"id": 354, "text": "Torbaaz can't be much better and I am now eagerly waiting for the next season. What's more to movie us?"}, {"id": 355, "text": "Outstanding and a classic movie. I wonder what we have next to watch, Torbaaz has set a bar, amazing."}, {"id": 356, "text": "Hats off! This movie needs to be shared with a massive amount of people. Great movie!"}, {"id": 357, "text": "A wonderful plot! Every scene is been put out to its max perfection. It is a great deal of enjoyment."}, {"id": 358, "text": "Well done creators of Torbaaz. What an excellent team of the whole cast, their performance is totally out of the box."}, {"id": 359, "text": "Worth the watch! Everybody should watch this movie of Torbaaz. It helps you get inspired and motivated."}, {"id": 360, "text": "I want everyone to see this amazing movie which gives us a powerful message in the"}, {"id": 361, "text": "The actors had spectacular performances and totally have done justice to their roles."}, {"id": 362, "text": "This movie has the most eye-opening story. It has thrill, action, drama, emotions and horrifying evilness."}, {"id": 363, "text": "This movie leaves you inspired and motivated in the end. It is real and the concept is authentic."}, {"id": 364, "text": "The movie talks about terrorism in Afghanistan and how the kids are used to fulfil the wrong motive. The story is well put and is engaging throughout."}, {"id": 365, "text": "Netflix is loaded with such inspiring contents and we have another one. This is definitely a hit."}, {"id": 366, "text": "This movie has a separate fan base. Netflix is flooded with such great contents. Great job!"}, {"id": 367, "text": "The best part is no-nosense screenplay. I think thars what has attracted millions of viewers."}, {"id": 368, "text": "The movie provides a great message with amazing performances by the child cast. Cricket scenes help keep the balance with an intense background of terrorism on the side"}, {"id": 369, "text": "The story of the movie is very eye-catching. Every episode has driven me crazy. Awesome!"}, {"id": 370, "text": "It's truly a masterpiece. The concept, story, dialogues, plot everything is perfect. Great work!"}, {"id": 371, "text": "It is a powerful concept. This one is such an unbelievable concept that touches my heart."}, {"id": 372, "text": "This movie has a separate fan base. Netflix is flooded with such great contents. Great job!"}, {"id": 373, "text": "Torbaaz is an excellent movie. Every fan who loves suspense and action should watch this movie"}, {"id": 374, "text": "Torbaaz is a Superb movie. It has a mystery movie, every scene has new suspense. Loved the story."}, {"id": 375, "text": "Rahul dev has really great acting skills, why doesn't he get more chances to work. Torbaaz is a great movie."}, {"id": 376, "text": "The story of Torbaaz is extremely good, the actors did well and the fans will love this movie. Full ratings."}, {"id": 377, "text": "Sanjay Dutt and team contributed to the Afghan Peace and prosperity, Thanks to them. A very clean and nice story, specially for the people of Afghanistan. And Thanks to the Netflix for showing this movie to the whole world without any border restrictions. A must watch, for a light fun and knowledge."}, {"id": 378, "text": "Well, you can try reading those review, they ALL look the same 1-2 lines of the same text. And look at their names too, they all have a number - these are bots and IMDB should look into them. No previous ratings as well. This is a massive scam by the producers of this garbage. Some are only reviewing the trailer and never seen it( comments are bots so they are just generic) I can't believe Netflix got involved in this garbage. Horrible acting, amateurish directing and bad script. Maybe standards in India are very low, but this would be a B- movie in North America, with 2/10 average review rating!Script: 2/10 Acting: 2.3/10 Directing 2/10 Camera: 2.3/10 2/10"}, {"id": 379, "text": "No matter what. I loved Torbaaz nailed in the entire film. A beautiful movie."}, {"id": 380, "text": "Superb acting by everyone. Amazing cinematography. A beautiful movie. Inspiring and emotional."}, {"id": 381, "text": "The action scenes are great and look real. The realistic work is commendable."}, {"id": 382, "text": "THIS IS ONE HECK OF A FILM!!!! VERYY UNIQUE AND AWESOME. LOVE U SANJAY DUTT!!!!!❤❤❤❤❤"}, {"id": 383, "text": "Netflix India is not tag to worth looking up. Move on, come with sth new."}, {"id": 384, "text": "This movie leaves you inspired and motivated in the end. It is real and the concept is authentic."}, {"id": 385, "text": "Netflix has been releasing some really good web series for people to binge- watch during this lockdown period. But one of their best ones yet is Torbaaz."}, {"id": 386, "text": "The background music may not be the best in the genre but still goes well with the premise and keeps you glued to your sofas."}, {"id": 387, "text": "It's a good movie with good performances, specialy Sanjay dutt and the kids, nice location as well"}, {"id": 388, "text": "In war-torn Afghanistan (shot in Kyrgyzstan), if on one hand innocent children were being brainwashed into becoming suicide bombers, on the other hand, they were learning how to play cricket. In this terrorism versus cricket plot. Amazing work is done by the director Girish Malik, cast, and crew."}, {"id": 389, "text": "The story is very inspiring where the man lost his script at gets to know it is used in another film."}, {"id": 390, "text": "Afghan national cricket team came out of Peshawar Pakistan. Just saying."}, {"id": 391, "text": "The makers have missed an opportunity to deliver an impactful film. It has a body, but no soul. The film lacks effective dialogues and tight editing. Also, the dragged screenplay makes it an unimpressive watch.Sanjay Dutt delivers average performance. Nargis Fakhri has no significant role in the film and she hardly leaves an impact in her short role. Rahul Dev effortlessly played the antagonist Qazar.Child actors Aishan Jawaid Malik, Hamid Shafi, Mohammed Khairkhah, Rudra Soni are good in their parts and gave watchable performances.Direction 2/5 Acting 2.5/5 Editing 1.5/5 Story 2.5/5 Screenplay 1.5/5"}, {"id": 392, "text": "Another garbage movie from Bollywood. No brain used to developed movie. All Bollywood is needs quick money. Please don't waste your 3 hours."}, {"id": 393, "text": "Good for today generation child. Good movie sanjay is back for a great project"}, {"id": 394, "text": "As an Afghan, I can say that every single detail about Afghanistan in this movie is incorrect. They should have checked their facts. At one point it says Tora Bora is close to Kabul, in reality it's very far from Kabul located in border between Afghanistan and Pakistan. Also, how it has portrayed Afghan people and their culture is absolutely unrealistic. And what was the random explosion and foreign soldiers running around doesn't make sense."}, {"id": 395, "text": "Bad acting ,NO EXPRESSION NOONE WANT THIS TYPES OF MOVIE, EVERYONE KNOWS WHATS HAAPEN AFGANISTAN AND TERRIRISIOM."}, {"id": 396, "text": "The plot was good but it did not convey the emotions ,the meaning ,the reality ,the pain of AfghanistanIt was extremely slow and needed a good edit as some scenes were dragged thus making the movie long in duration... the direction was also very poorThe casting was very ordinary and did not gave what was needed on the screenSanjay has lost his charm and was pathetic nargis had few words to utterOnly good thing they have showed is beautiful Kazakhstan"}, {"id": 397, "text": "Same cricket match story .expected better story .not happy"}, {"id": 398, "text": "This movie is based on Afghanistan cricket team. This is based on a true story. Toorbaaz is carrying a great content and very clean cinematography with no extra heroism. Must watch movie of Sanju Baba."}, {"id": 399, "text": "After the first 10 mins, I guestimated that this movie can't be bigger than 2 hours. Paused to check the length, and there it was it - 1 hour and 42 mins. Clearly stretched scenes to pad movie time make it painful to watch. Half of Sanjay Datt's dialogs are inaudible and we feel like waiting for the next day so that he is out of his hangover. Cliché situations copied from Lagaan - a. Repeated twice in the movie - the coach brings a new player, rest of the team resist, but agree in the end. b. Coach challenges a better team for a match, team practices, and ends up winning. c. Opposition team starts well in the start. d. Hat trick e. The team thinks they lost. f. Last ball win.Plus - scenic views. Afganistan landscape itself serves this purpose."}, {"id": 400, "text": "The director has done hell lot of nonsense in this movie. I mean none of the actor acts. No one knows when the flashback starts or why Sanju baba tears the boarding pass in the initial scene or why he came back to Kabul and throws away children's ball in water. I mean poor and boring direction with no coherence in the scenes."}, {"id": 401, "text": "Storyline and great performance by cast makes this movie watchable."}, {"id": 402, "text": "Nice work Brother God bless you and Congratulations To sanjay dutt and all team"}, {"id": 403, "text": "Fantastic movie with unique characters. Must watch movie. Nice concept."}, {"id": 404, "text": "This is the best and the most amazing movie I have ever watched. Great"}, {"id": 405, "text": "Getting goosebumps after watching the agony of child in Afghanistan. What a masterpiece by Girish Malik with excellent performances by Sanjay Dutt and Nargis Fakri!!! 10 on 10."}, {"id": 406, "text": "Concept was good, also well made but execution can be better..."}, {"id": 407, "text": "In war-torn Afghanistan (shot in Kyrgyzstan), if on one hand innocent children were being brainwashed into becoming suicide bombers, on the other hand, they were learning how to play cricket. In this terrorism versus cricket plot. Amazing work is done by the director Girish Malik, cast, and crew."}, {"id": 408, "text": "Sanju Dada is a very sensitive actor; his eyes speak volumes, an understanding of the character. In the film he bonded with the children so well; a feeling of loss in his eyes of the son and wife but when he smiles, the world smiles, and the Chemistry of Sanju Dada and Children is mesmerizing."}, {"id": 409, "text": "Torbaaz is the story of one man who rises above his personal tragedy and decides to transform the lives of a few refugee camp kids who are on the path of destruction through the game of cricket."}, {"id": 410, "text": "The film portrays the finest concepts ever. It is very powerful and presents a great sense of curiosity."}, {"id": 411, "text": "The film portrays the finest concepts ever. It is very powerful and presents a great sense of curiosity."}, {"id": 412, "text": "Cinematography is decent. I liked the execution which is just perfect according to the plot."}, {"id": 413, "text": "This film gives me so much relaxation. One of the best films I have ever watched."}, {"id": 414, "text": "It is an amazing film with little heart humour and awesome acting. Enjoyed it!"}, {"id": 415, "text": "The film portrays the finest concepts ever. It is very powerful and presents a great sense of curiosity."}, {"id": 416, "text": "I watched the film and I truly enjoyed the film. It has everything you look for. Amazing concept!"}, {"id": 417, "text": "I loved every bit of simplicity, boldness and drama. It is very well written and performed."}, {"id": 418, "text": "Some of us can actually relate to the movie as it is very authentic and natural. It makes me feel better."}, {"id": 419, "text": "A must watch. Outstanding acting by all the actors. Very gripping story and very impactful."}, {"id": 420, "text": "This film deserves tons of appreciation. It makes you laugh, it surprises you and it entertains you."}, {"id": 421, "text": "I must say this is going to be the biggest hit. I watched the film and I couldn't roll my eyes off."}, {"id": 422, "text": "OMG! Sanjay dutt is so bold and so entertaining. His acting skills nailed the concept totally. Hats off!"}, {"id": 423, "text": "I watched this movie with my family and the film was great. We had super fun together."}, {"id": 424, "text": "The film looks promising. It makes you want to the movie that will entertain you and make you mysterious."}, {"id": 425, "text": "The concept inspired many. It reveals the truth behind every love who struggles to seek his loved one."}, {"id": 426, "text": "Very mindblowing movie. I absolutely enjoyed it. Dexterity is great,punchlines were amazing and the seeti maar too."}, {"id": 427, "text": "Amazing movie. Sanjay dutt did a great job. The children in the movie are a treat to watch. Interesting storyline. Great direction."}, {"id": 428, "text": "We get drama too. Couldn't stop laughing throughout the entire film. The story brings up a lot of punches."}, {"id": 429, "text": "I watched the film and considering all the legend actors performing, the movie is a hit."}, {"id": 430, "text": "I have seen this movie and it is nice enough to watch. Sanjay dutt is one of the favourite actors. Blockbuster!"}, {"id": 431, "text": "Torbaaz is a really good movie. the story of love, hope and humanity. So well written. Best cinematic experience. There is humour, emotions and hope in every scene. Loved it"}, {"id": 432, "text": "Fire film! Pretty happy for this brilliant cast to perform their excellence and work out there."}, {"id": 433, "text": "I loved the execution of the film. The team has portrayed the concept of precisely maintaining its boldness."}, {"id": 434, "text": "This film is a masterpiece. I suggested all of my friends after watching it. Awesome!"}, {"id": 435, "text": "It is one of the most relaxing films. You won't regret watching it. I loved it"}, {"id": 436, "text": "It is one of the most relaxing films. You won't regret watching it. I loved it."}, {"id": 437, "text": "Mindblowing! There is so much more to talk about this film. It's a perfect film to watch any day anytime!"}, {"id": 438, "text": "Mindblowing! There is so much more to talk about this film. It's a perfect film to watch any day anytime."}, {"id": 439, "text": "Two legends working together, Girish Malik and Sanjay dutt make the film more interesting."}, {"id": 440, "text": "This film has shown how important screenwriters are and the number of efforts they put in."}, {"id": 441, "text": "I watched the movie in 30 mints.no story super flop"}, {"id": 442, "text": "Torbaaz is a heart throbbing film and watching it for the first time anyone would say that this is Sanjay Dutt's best film in a decade. The film revolves around the evolution of cricket in Afghanistan.A country that has been ruined by wars in the recent and past. But the true sacrifice made by the Afghan teenagers and their rock solid belief of indulging in non-violence,is something that uplifts the sentiments of the viewers. The film has got a twisted ending and keeps the viewers glued to the screen,till the final ending. This film shows how revolution can be brought about even if a single individual changes his mind,thereby influencing an entire community. The storyline has a lot of parts which are indeed very true and the screenplay has been absolutely fantastic.The initial part of the film is a bit slow,oscillating between the past and the present life of a doctor and his family who are stationed in Afghanistan. Amidst turbulence and action,how peace paves the way for the better to happen,is something that has been well depicted in this film.All in all cricket is something we all love to watch,talk and hear about.But building a cricket team in a disturbed nation is something that tests the true character of a person. Watch this movie and I am sure you will love to share and watch it again.Amazing movie and background scores by the legendary Bikram Ghosh.Great work done....kudos to the entire team!!"}, {"id": 443, "text": "I will have to say the movie in itself was OK, however the visuals were stunning and acting was good especially the kids.Now for all the illiterate people out there who are giving the movie poor ratings. The movie touches upon the conflict in Afghan society between the pakhtuns and all others, this is put to the viewer through the kids. The movie mildly attempts to give you a view on innocent pakhtuns children and the brainwashing that goes on by the adult taliban and the fear that is instilled in them.I give this movie a 7 mainly for its attempt to give people a view of Afghanistan today through the vision of children and I would ask people to ignore the poor ratings and watch this movie."}, {"id": 444, "text": "Kudos to the entire cast. Powerful message good background music and nice direction give powerful platform"}, {"id": 445, "text": "Nothing special in this movie. I think you won't be able to even complete watching this movie. You ignore this movie and save your time. Acting of the actors is not very great too. Bakwas movie."}, {"id": 446, "text": "Apart from those forced Afghani accent, Sanjay Dutt looked like he was drunk our something."}, {"id": 447, "text": "Aaah total crap why they don't watch their movies before releasing and why Netflix isn't reviewing its content"}, {"id": 448, "text": "This is not regular Bollywood fare guys. The Director captures the mood of a haunting war destroyed Afghanistan as well as the raw and simple innocence of children. Cricket is not just a sport but a metaphor for a life that can be lived to simple rules- a team game that can overwhelm traditional clan enmities. Without really attempting to , the director exposes the hollowness of extreme right wing fanatics. Not through any display of masculinity and force but by demonstrating the alternative to terrorism. The background of Afghanistan real cricket team and what it had to do to play international cricket in war torn country comes through. Set in the beautiful Afghan landscape with Nature at its best. An enormously entertaining movie, like nothing we've ever seen before, and yet completely familiar. I really loved this film and highly recommend this to everyone. A great story with a provoking message, and humor injected throughout the film to keep it light-hearted. I highly recommend you to watch it. This is a film that stays in your mind long after it's over. I enjoyed the film and celebrated with the refugee children!"}, {"id": 449, "text": "This is the most cheap and fake, even 1% not close to realty, the place, the people, the costume, vehicles, license plates, phrases, hotel, nothing give you a feeling of Afghanistan, the only thing is from Afghanistan some pictures and short scenes, that iam sure they stole it from peoples social media and they violate the copy right 😂😂😂😂 they definitely needed an Afghan advisor hired"}, {"id": 450, "text": "Getting goosebumps after watching the agony of child in Afghanistan. What a masterpiece by Girish Malik with excellent performances by Sanjay Dutt and Nargis Fakri!!! 10 on 10"}, {"id": 451, "text": "If you haven't watched this movie yet, then you are making a big mistake. Great casting team and story."}, {"id": 452, "text": "This movie develop hope for the child how lose there parents. All the Afghans are not terrorist they are also human Love from Pakistan."}, {"id": 453, "text": "It has everything-excellent production values,Amazing script,great acting from Sanjay Dutt and rest of the cast, Mind-blowing music."}, {"id": 454, "text": "Sanjay Dutt Sir you are brilliant along all the rest of the cast. One of the best Hindi movies ever made."}, {"id": 455, "text": "Girish Malik, Bharti Jakhar both are Amazing guys . Any one watching this review, dont give a second thought and first watch it. Its a pride of indian cinema, be it story wise, characters wise or direction wise. A true masterpiece."}, {"id": 456, "text": "Getting goosebumps after watching the agony of child in Afghanistan. What a masterpiece by Girish Malik with excellent performances by Sanjay Dutt and Nargis Fakri!!! 10 on 10."}, {"id": 457, "text": "Torbaaz is a movie with hope There are so many films on the subject, but nothing with hope. Torbaaz is a movie with hope."}, {"id": 458, "text": "Serious issue The film based on the touchy issue of the youngsters who are trained to a self-destructive suicide bomber in Afghanistan"}, {"id": 459, "text": "Truth of AfghanistanThe account of Torbaaz is firmly lined up with the truth of Afghanistan, and the wonderful portrayal of cricket as a method for liberation is as valid for the kids for what it's worth for my character, Nasser Khan, who ricochets back from individual misfortune. I preferred it and prescribe the readers to see it."}, {"id": 460, "text": "Truth of AfghanistanThe account of Torbaaz is firmly lined up with the truth of Afghanistan, and the wonderful portrayal of cricket as a method for liberation is as valid for the kids for what it's worth for my character, Nasser Khan, who ricochets back from individual misfortune. I preferred it and prescribe the readers to see it."}, {"id": 461, "text": "A Tranformational FilmTorbaaz is a story of a Doctor who transcends his own misfortune and chooses to change the lives of a couple of outcast camp children who are on the way of decimation through the sport of cricket"}, {"id": 462, "text": "Film Based in AfghanistanIn war-torn Afghanistan (shot in Kyrgyzstan), if on one hand honest kids were being conditioned into turning out to be self-destruction terrorist, then again, they were figuring out how to play cricket. In this psychological oppression versus cricket plot. Astounding work is finished by the chief Girish Malik, cast, and group."}, {"id": 463, "text": "Torbaaz is a film with substanceThere are countless movies regarding the matter, however nothing with substance. Torbaaz is a film with trust"}, {"id": 464, "text": "Feels like a war movie I like war films. It is one of those films I might want to observe once more."}, {"id": 465, "text": "It was totally an uplifting and an inspiring film...I'm not an Indian myself, I'm an Arabi and this is actually the first Indian film I've ever seen but I was automatically enthralled as the film starts playing."}, {"id": 466, "text": "Wow! - Finest performance by Sanjay DuttI normally find sports films only mildly interesting. Stuff like Field of Dreams for example is OK, but only because it deals with big issues, like Suicide Bombing, Taliban, Pashtun, and Hazara conflicts I am now having some respect for Sanjay Dutt and Nargis."}, {"id": 467, "text": "A story of the people over coming oppression through cricketI really liked this movie."}, {"id": 468, "text": "Torbaaz is unstoppableYeah I watched Torbaaz today on Netflix it came out and I thought it was one the best movies that Bollywood have ever made and they should be proud of themselves.Its movies like these that make a person feel good about themselves and it makes you want to achieve more in life."}, {"id": 469, "text": "Once Upon a Time in Afghanistaan'Torbaaz' is a film based on war-torn Afghanistan and the spirit of its people. How cricket saved this country, and how the Taliban, in the name of Jihad, is converting innocent children and their helpless families into trained suicide bombers. In my view, entire Asia should watch this movie with the US. Truly world class movie."}, {"id": 470, "text": "Take Me Out to the Cricket MatchEverything I ever need to know about cricket I learned from this movie.Torbaaz, in not typical Bollywood fashion film, it is a master piece and superbly entertaining."}, {"id": 471, "text": "Two passions of Indians combined in one, namely movies and cricketTorbaaz is absolutely a stunning piece of work. It is one of the best films I have seen in my lifetime if not the best. Thoroughly entertaining and without meaningless subplots. The screenplay is as good as it gets and the 2 hour+ film just flies by."}, {"id": 472, "text": "Incredible! A 'must-see'. From Talibani to Sports, this gem has it! What an amazing film!"}, {"id": 473, "text": "MY REVIEW: The Bravest Bollywood Effort of 2020!!Best wishes to Director Girish Malik, Producer Rahul Mittra, Bharti Jakhar, Sanjay Dutt, Nargis and entire cast and crew of Torbaaz"}, {"id": 474, "text": "Entertainment at its very best! A MUST see! Torbaaz is absolutely an amazing piece of work specially the director did an amazing job of putting together the story in a finest way possible. Kudos to Sanjay Dutt for the amazing role done by him as a coach. It is one of the best films I have seen in my lifetime if not the best. Thoroughly entertaining and without meaningless subplots. The screenplay is as good as it gets and the 2 hour+ film just flies by."}, {"id": 475, "text": "Entertainment at its very best! A MUST see! Torbaaz is absolutely an amazing piece of work specially the director did an amazing job of putting together the story in a finest way possible. Kudos to Sanjay Dutt for the amazing role done by him as a coach. It is one of the best films I have seen in my lifetime if not the best. Thoroughly entertaining and without meaningless subplots. The screenplay is as good as it gets and the 2 hour+ film just flies by."}, {"id": 476, "text": "Touching, well-written and DirectedThe brilliance of Torbaaz is evident from keeping your interest up to the last minute and stimulating the audience to numerous scenic applause's."}, {"id": 477, "text": "One of the best directed movies that I have ever seen. The director does a great job of showing how a group of people with the will to win succeed over all odds. Although the movie has a pretty guessable story, the amazing screen presense of Sanjay Dutt along and the direction of Girish Malik will keep you engrossed for all the 2 hours! A must see."}, {"id": 478, "text": "Movie straight from heart of the Director Girish MalikIt has everything-excellent production values,tight script,great acting from Sanjay Dutt and rest of the cast,excellent music.It is in other words a great celebration of Indian cinema and culture and above all Indian friendship with Afghanistan"}, {"id": 479, "text": "Sanjay Dutt Sir masterpiece !One of the best Hindi movies ever made. Sanjay Dutt Sir is brilliant along with the rest of the cast."}, {"id": 480, "text": "A Masterpiece. Its like a lesson on Story Writing.Girish Malik, Bharti Jakhar guys your rock. Any one watching this review, dont give a second thought and first watch it. Its a pride of indian cinema, be it story wise, characters wise or direction wise. A true masterpiece."}, {"id": 481, "text": "Tells story of leadership, determination and team buildingGetting goosebumps after watching the agony of child in Afghanistan. What a masterpiece by Girish Malik with excellent performances by Sanjay Dutt and Nargis Fakri!!! 10 on 10."}, {"id": 482, "text": "A distant gaze animates this 2 hour long film set in Afghanistan- it begins with gliding drone-shots of a pristine town blessed in the shadows of the Hindu Kush, and it retains this distance for the rest of the film. Gun fights and bomb blasts play out at a safe mile away from the camera- as a viewer you are never made to feel like you are in the thick of things.READ THE FULL ARTICLE ON FILM COMPANION"}, {"id": 483, "text": "What a fantastic movie! All the star casts and other casts have work outstanding."}, {"id": 484, "text": "Finally a bollywood film with an original story. A film with brilliant screenplay and cinematography, showing the passion for cricket 🏏 in Afghanistan and also the tough conditions the locals over there have to deal with. This is film should not be missed on Netflix."}, {"id": 485, "text": "I would love to go to a place where you can eat as much as you want for free and never get fat though. That would be fun. Well, only as long as you weren't on trial or anything."}, {"id": 486, "text": "I would love to go to a place where you can eat as much as you want for free and never get fat though. That would be fun. Well, only as long as you weren't on trial or anything."}, {"id": 487, "text": "Interesting view of the inbetween or purgatory, whatever it is meant to represent. I would love to go to a place where you can eat as much as you want for free and never get fat though. That would be fun. Well, only as long as you weren't on trial or anything."}, {"id": 488, "text": "Was really hoping to be able to give this movie a much higher rating than this, because in the previews it looked great"}, {"id": 489, "text": "Sometimes of humor is more annoying than funny, but it was definitely fun and cute."}, {"id": 490, "text": "It was a little hokey at times, and sometimes Ben Stiller's brand of humor is more annoying than funny, but it was definitely fun and cute."}, {"id": 491, "text": "I would hate this movie, but I actually ended up enjoying it. It was a little hokey at times, and sometimes Ben Stiller's brand of humor is more annoying than funny"}, {"id": 492, "text": "I honestly thought I would hate this movie, but I actually ended up enjoying it. It was a little hokey at times, and sometimes Ben Stiller's brand of humor is more annoying than funny, but it was definitely fun and cute."}, {"id": 493, "text": "It is just a pieced together series of moments in two random people's lives who happen to be in love."}, {"id": 494, "text": "This movie is an insane train wreck of a romantic comedy. It fails horribly and miserably. It is just a pieced together series of moments in two random people's lives who happen to be in love."}, {"id": 495, "text": "If a film is eye-candy with carefully designed decorations, masterful camerawork, lighting"}, {"id": 496, "text": "I love beautiful movies. If a film is eye-candy with carefully designed decorations, masterful camerawork, lighting"}, {"id": 497, "text": "Whenever he's on the move, using his cool stoicism to counteract the rampaging bus, Keanu Reeves can't quite match his costar"}, {"id": 498, "text": "While he's fantastic whenever he's on the move, using his cool stoicism to counteract the rampaging bus, Keanu Reeves can't quite match his costar in the quiet moments of Spee"}, {"id": 499, "text": "Beautiful and intimate cinematography really captures all the emotion."}, {"id": 500, "text": "We were all left with strong impressions that will certainly remain with us. We will certainly use the movie in the future in many different ways"}, {"id": 501, "text": "I just want to share with you what I took away from the movie and what I found to be the most touching and intriguing part for me. The way you show the importance of the social/emotional piece in educating children is beautiful."}, {"id": 502, "text": "An indie masterpiece It has been such a long time since I don't feel so much anxiety in a movie theatre, the story was perfectly edited in a way that it doesn't reveal too much until it gets to the climax. It's such a well-done thriller it never gets slow or boring. It's obviously not for everyone. But for people who love well tell stories, this is your movie."}, {"id": 503, "text": "I was so excited to see Cookie because I loved the idea and its an awesome trailer and what did I think; weeeeell, apart from a few small differences than to what I expected,The acting was superb and it was very clever and very intense. Rajeev Gupta was amazing as well and so was Heeba Shah (i forget his second name, but he played an amazing role) I mean what the hell, It was fun to see this movie. Cookie is a clever,"}, {"id": 504, "text": ", played by Vibhoutee Sharma who is the daughter of two top psychiatrists' parents.. I was so excited to see Cookie because I loved the idea and its an awesome trailer and what did I think; weeeeell, apart from a few small differences than to what I expected, it was an awesome horror film. The acting was superb and it was very clever and very intense. Rajeev Gupta was amazing as well and so was Heeba Shah (i forget his second name, bu I mean what the hell, It was fun to see this movie. Cookie is a clever, intense and very atmospheric movie with great acting that keeps it fresh!"}, {"id": 505, "text": "Amazing as well and so was Heeba Shah (i forget his second name, but he played an amazing role) I mean what the hell, It was fun to see this movie. Cookie is a clever, intense and very atmospheric movie with great acting that keeps it fresh!"}, {"id": 506, "text": "Wonderful fantastic awsm suprbbbbb 🌠🌠🌠🌠 mind-blowing dhamakedar"}, {"id": 507, "text": "I was so excited to see Cookie because I loved the idea and its an awesome trailer and what did I think; weeeeell, apart from a few small differences than to what I expected, it was an awesome horror film. The acting was superb and it was very clever and very intense. Rajeev Gupta was amazing as well and so was Heeba Shah (i forget his second name, but he played an amazing role) I mean what the hell, It was fun to see this movie. Cookie is a clever, intense and very atmospheric movie with great acting that keeps it fresh!"}, {"id": 508, "text": "The film follows a psychiatric parents and a young woman, played by Vibhoutee Sharma who is the daughter of two top psychiatrists' parents.. I was so excited to see Cookie because I loved the idea and its an awesome trailer and what did I think; weeeeell, apart from a few small differences than to what I expected Cookie is a clever, intense and very atmospheric movie with great acting that keeps it fresh!"}, {"id": 509, "text": "Interesting and Clever I finally got to see this anticipated film! The film follows a psychiatric parents and a young woman, played by Vibhoutee Sharma who is the daughter of two top psychiatrists' parents.. I was so excited to see Cookie because I loved the idea and its an awesome trailer and what did I think; weeeeell, apart from a few small differences than to what I expected, it was an awesome horror film. The acting was superb and it was very clever and very intense. Rajeev Gupta was amazing as well and so was Heeba Shah (i forget his second name, but he played an amazing role) I mean what the hell, It was fun to see this movie. Cookie is a clever, intense and very atmospheric movie with great acting that keeps it fresh!"}, {"id": 510, "text": "Tense and gripping psychological thriller later become a horror. What a movie it was. That was a treat to my eyes."}, {"id": 511, "text": "Tense and gripping thriller. Tense and gripping psychological thriller later become a horror. What a movie it was. That was a treat to my eyes. Lalit Marathe has done a super fabulous work so as to all casts. Vibhoutee justified the role. Amazing work.. loved it"}, {"id": 512, "text": "That was a treat to my eyes. Lalit Marathe has done a super fabulous work so as to all casts. Vibhoutee justified the role. Amazing work.. loved it"}, {"id": 513, "text": "Wonderful movie Switch off your inner critic and enjoy the ride. I just returned from watching this. Found it totally absorbing."}, {"id": 514, "text": "I just returned from watching this. Found it totally absorbing. I found the format drew me in, making the viewing very claustrophobic."}, {"id": 515, "text": "I found the format drew me in, making the viewing very claustrophobic. It is a very interesting horror movie. Just switch off your inner critic and enjoy the ride on the edge of your seat."}, {"id": 516, "text": "It is a very interesting horror movie. Just switch off your inner critic and enjoy the ride on the edge of your seat."}, {"id": 517, "text": "I just returned from watching this. Found it totally absorbing. I found the format drew me in, making the viewing very claustrophobic. It is a very interesting horror movie. Just switch off your inner critic and enjoy the ride on the edge of your seat."}, {"id": 518, "text": "It has been such a long time since people who love well tell stories, this is your movie."}, {"id": 519, "text": "The story was perfectly edited in a way that it doesn't reveal too much until it gets to the climax. It's such a well-done thriller it never gets slow or boring."}, {"id": 520, "text": "It's such a well-done thriller it never gets slow or boring. It's obviously not for everyone. But for people who love well tell stories, this is your movie."}, {"id": 521, "text": "Despite sloppy script and some flaws Torbaaz still engrips you on your seat because of Sanjay Dutt and Rahul Dev performance."}, {"id": 522, "text": "Torbaaz. The movie show casing about how children die n turns into terrorist. S good attempt but lacks at end ..the story was good but Lacks of converting into a good one ...the climax is the main backdrop for the movie..apart from showing cricket nothing much they focused..but can watch once ."}, {"id": 523, "text": "Torbaaz. The movie show casing about how children die n turns into terrorist. S good attempt but lacks at end ..the story was good but Lacks of converting into a good one ...the climax is the main backdrop for the movie..apart from showing cricket nothing much they focused..but can watch once ."}, {"id": 524, "text": "It's such a well-done thriller it never gets slow or boring. It's obviously not for everyone. But for people who love well tell stories, this is your movie."}, {"id": 525, "text": "The story was perfectly edited in a way that it doesn't reveal too much until it gets to the climax. It's such a well-done thriller it never gets slow or boring. It's obviously not for everyone. But for people who love well tell stories, this is your movie."}, {"id": 526, "text": "This movie is awesome. One must watch!!! Pure family movie. Great acting by Sanjay Dutt and all child artists. And last but not least great direction."}, {"id": 527, "text": "This movie is awesome. One must watch!!! Pure family movie. Great acting by Sanjay Dutt and all child artists. And last but not least great direction."}, {"id": 528, "text": "Absolute eye-opener for the world and Baba is straight from the heart.....a never seen movie before watch it instead of being misguided and listen to Ur heart , and know that we all the same and can be self guided directly through our maker.... No one leads ..... U connect with Ur maker and listen to Ur inner voice....."}, {"id": 529, "text": "The film is EXCELLENT!! One should watch it for sure. Beautifully made. All characters welll justified, the kids were so amazing. Loved the new guy too, kuwaarjeet chopraa."}, {"id": 530, "text": "Thanks Mr.Sanjay Dutt i can't describe my feelings while watching the movie. very sad story unfortunately this is real story . Long live Afghanistan peace ✌ love freedom peace for the World"}, {"id": 531, "text": "I have seen this movie on Netflix. Its very decent movie. you can watch with your faimly because there is no any bad scene. All actor's have played their role perfectly, specially child actor's acting are very nice."}, {"id": 532, "text": "Fantastic movie!I have seen this movie on Netflix. Its very decent movie. you can watch with your faimly because there is no any bad scene. All actor's have played their role perfectly, specially child actor's acting are very nice."}, {"id": 533, "text": "Really OSM Movie. I Appreciate @RudraSoni For Being In This Movie.As I Am Great Fan Rudra,But I Am Huge Great Fan Of Rudra.Really Osm End Of Movie.I Dream May Be Their Its Second Part As TORBAAZ 2 :) (But It Can't B Possible)"}, {"id": 534, "text": "The finest of movies Bollywood could ever bring out. Depicts the intense emotions of common man as he surpasses the troubles and pain in his life. Several heartbreaking moments but makes happily satisfied at the end."}, {"id": 535, "text": "Being a movie freak I like to watch only the movie that has a great story line .I put my views based on reality of the story line"}, {"id": 536, "text": "Torbaaz is dealing with Terrorist attacks and their aftermath have had a powerful impact on children and their families. Girish Malik and Bharti Jakhar wrote researched based socially relevant film and intelligently directed by @girish_malik with cutting edge thought provoking narrative and engage the audience with it's emotional rollercoaster ride throughout the film."}, {"id": 537, "text": "Greatest movie of all time seen. At beggning story waa not clear too me but later the movie was crystal clear too me. Mind Blowing movie great effort by star cast and childrens. Special love to sanju sir"}, {"id": 538, "text": "A great story with a strong and good message. It's staty In your mind long."}, {"id": 539, "text": "The result speaks for itself. A narrative with enough horror, suspense, thriller elements that has Mr. Lalit's signature as a filmmaker has written all over it. Impressive performance for"}, {"id": 540, "text": "Very entertaining movie. We enjoyed the film with family. Completely familiar movie. I recommended this movie to all my family and friends."}, {"id": 541, "text": "This film was so beautiful . Sanjay Dutt performance was much better than his last decades films. Specially the kids in this film gives a great message how to live happily when we are in big terrible situation ."}, {"id": 542, "text": "A movie with a good message after a long time. The movie is good and touches your heart a lot of times. Do not go on reviews as they are misleading. This is must watch."}, {"id": 543, "text": "A strong message narrated through a heart warming story presented in a subtle way by using a sport which represents teamwork is totally commendable👌 plot of the movie is captivating, excellent performances by all the actors specially the children."}, {"id": 544, "text": "Girish Mallik amazing direction a good film after ages throughly enjoyed it grows on you and the characters of the movie kuwarjeet stands out along with Baaz. You covered so beautifully angle of war over a cricket match."}, {"id": 545, "text": "A great movie indeed!! Superbly acted. Explores all the human emotions at one place. Leaves you with an overwhelming feeling that will linger even after the credit rolling is over. A very fine piece of movie I say. Well done the cast and crew!!"}, {"id": 546, "text": "Nice movie, nicely shown the situations of people and specially children of Afghanistan... They should be educated and properly guided or else they will fall for the false teaching as shown in movie."}, {"id": 547, "text": "It's surely a masterpiece movie. Oh god what a lovely yet true n unique message has been forwarded to the people trough the film. Really those children of war needs such help to get out of the threats of danger It's a family movie and I recommend this movie to everyone."}, {"id": 548, "text": "Sanjay Dutt and team contributed to the Afghan Peace and prosperity, Thanks to them. A very clean and nice story, specially for the people of Afghanistan"}, {"id": 549, "text": "A brilliantly directed movie that conveys a strong message of love over hate, we are divided by geographies , religion , color etc but United by humanity . Movie delivers a message of healing touch for war torn nation Afghanistan , excellent performances by all the actors. The message of hope, peace and humanity is actually need of the hour. A must watch ..."}, {"id": 550, "text": "It is very good movie , strong acting, loving out door shooting, it is good message. after long time I have been a wonderful movie. specially Sanjay 's acting"}, {"id": 551, "text": "Awesome Awesome awesome movie.One of the best movies I have watched- Gripping, emotional ,eyes get tears at many scenes, wonderful performance by child artists and forever Sanjay Dutt, entertaining, thought-provoking,a real children based movie, good background music and child based movie,climax"}, {"id": 552, "text": "The ultimate Well-executed modestly budgeted film production. The result speaks for itself. A narrative with enough horror, suspense, thriller elements that has Mr. Lalit's signature as a filmmaker has written all over it. Impressive performance for Vibhoutee Sharma. Remarkable support from Rajeeb Gupta and Heeba Shah as parents, inmates that she has encountered in the psychiatric facility. Great Work."}, {"id": 553, "text": "Good message. Good story line. Good acting. Kids and Sanjay Dutt were great. For someone who doesn't know much about actual realities, movie was great. Could last quarter of the movie used better editing? Sure. But it was not a dealbreaker."}, {"id": 554, "text": "This film is based on a story of Afghanistan, splendid job by director, how merely he has captured imagination of the distraa being faced by the people over there due to growing terrorism activity and indulgence of yong people as influenced to them"}, {"id": 555, "text": "Being the biggest fan of Sanjay Dutt can say go and watch this for sure The movie has the strongest story line just like him. This movie is not a time waster nor money"}, {"id": 556, "text": "Extremely new terrain for Bollywood. Amazing film. Must watch. Amazing theme, new country for filming, Sanjay Dutt did amazing job, child actors are superb, Rahul dev also did justice to his role, only week point is editing."}, {"id": 557, "text": "Mind blowing fantastic movie h Bhai log .......🍻🍻🍻🍻🍻🍻🍻"}, {"id": 558, "text": "This movie will surely get under your skin and promises to keep you on the edge of the seat. Worth watch"}, {"id": 559, "text": "Torbaaz deals with theme of Taliban using little children as suicide bombers and Sanjay Dutt, as an ex Army officer, fighting to give their life a new direction and meaning."}, {"id": 560, "text": "Lovely movie. Sanjay Dutt has put his heart into it.......Afghanistan is a most lovely country of incredible people who are a victim of world real politic and nasty neighborhood."}, {"id": 561, "text": "Loved this movie so emotional makes one cry. Actually shows what children go through in a war torn country and to see how game of cricket brings them some joy. Sanjay Dutt's acting is award winning."}, {"id": 562, "text": "The story of TORBAAZ was a sensitive real issue.good Peak into how children are used as an instrument of terrorism in Afghanistan. Director has captured scene beautifully and the metaphoric representation was brilliant."}, {"id": 563, "text": "A hugely entertaining movie, like nothing we've ever seen before, but totally familiar. I enjoyed this movie very much and I highly recommend it to everyone."}, {"id": 564, "text": "In spite of the absurd IMDb ratings, I decided to watch the movie and it turned out to be pleasantly wonderful. Sanjay Dutt's acting was average but the storyline and the concept around which the movie revolves has been portrayedVery effectively"}, {"id": 565, "text": "One of the best movies I've seen so far.Director Sir, if you see this review, please make more movies like this. We will be eagerly waiting to see. Such a good concept that there is no need to copy the concept and make a movie"}, {"id": 566, "text": "Actors and actresses both play their rolesas a great manner. Cinematography is mind blowing"}, {"id": 567, "text": "The movie deals with the real aspects of life. The movie starts with full of happiness and ends up really good. At first we can understand the meaning but after watching full film we get the true depth of the reality."}, {"id": 568, "text": "There are very less good movies under Drama/Mystery genre in Bollywood and this one definitely makes it to the top of the list. The suspense and thril gets doubled with each passing scene.This movie is still a spectacular piece of art. I personally recommend this to everyone to watch this masterpiece with your family or friend."}, {"id": 569, "text": "LThis movie will surely get under your skin and promises to keep you on the edge of the seat. Worth watch"}, {"id": 570, "text": "Masterpiece! So Lalit Marathe came here with an absolute thriller masterpiece! The story is about best psychiatric parents who are too busy in fixing the minds of the world till they are challenged by their own teenage daughter Cookie (Vibhoutee Sharma). This movie will surely get under your skin and promises to keep you on the edge of the seat. Worth watch"}, {"id": 571, "text": "Sanju Baba looked at his Best. Welcome Back!Finicky Billu Cricket Coach played by Raaj Singh Arora was Superb especially his Camaraderie with Sanjay Dutt."}, {"id": 572, "text": "One of the Finest Movie released in the Lockdown on the Most Sensitive Topic by Girish Malik.Superb Characterization since everyone played their part brilliantly."}, {"id": 573, "text": "The message and storyline of the movie is very strong, Afghan children are the tragic victims of the ongoing war and have disproportionately affected them over the past 3/4 decades. The intent of promoting and using sport as a unifying factor is portrayed well to an extent."}, {"id": 574, "text": "The kid actors are awesome, we (finally) have a really menacing villain, and Sanjay Dutt as Nasser Khan has (also finally!"}, {"id": 575, "text": "At the beginning, the storytelling ist a bit erratic. But after a while, the movie really takes off and reveals a gripping plot with powerful images and a strong atmosphere."}, {"id": 576, "text": "The movie is tightly knit and keeps you at the edge with each frame. It is a roller-coaster ride of emotions. The issue is a sensitive- using children and women as Fidayeen. The fact a film on such a sensitive and brutal topic leaves you with the message of hope and faith is the winning factor of this movie. It also shows the feelings of frustration that often the development practitioners go through, their own divided perceptions within the community about the 'refugees' due to the disturbances are hard hitting. It also showcases the challenges faced by the people who want to work for the peace in the conflict ridden areas and how the humanity and people to people bonds lies at the core of the solution to these problems. Last but not the least, have heard a lot about Cricket Diplomacy, this was effective to see how sports, like cricket can be cultivated as means to solve issues of terrorism."}, {"id": 577, "text": "Each of the child actors are incredible. They make you laugh, they make you cry, they surprise and make you sad when they portray the inner conflicts among the tribes; being a Talib or not being a Talib. Each child is a chota packet bada dhamaka! Not just this, the chemistry between the lead character played by Sanjay Dutt and the kids is beautiful, cute and sensitive. It again brings smile on your face and tears in the eyes while you watch their relationship unfold."}, {"id": 578, "text": "Feeling of danger lurking on those kids and you could sense it all over the film, credit to the great performances by the child actors. Many of the scenes just make you feel like jumping off your seats to just go and save them"}, {"id": 579, "text": "Torbaaz Movie Review-- Sanjay Dutt's Latest Netflix Film Is Good love to the story."}, {"id": 580, "text": "Outstanding performance my sanjay dutt once again u rocked it u perform is nailed just a great script"}, {"id": 581, "text": "Might have been a good story on paper but they went horribly wrong on the execution of the film. Acting performances of the cast especially Sanjay dutt and the kids were good. Nargis fakhri was just there and had nothing to do. Watch it if you have 2 hrs to spare otherwise better to skip it."}, {"id": 582, "text": "GOOD ACTING .NICE MOVIE.WORTH WATCHING.All actors performance was very good, specially Sanjay Dutt"}, {"id": 583, "text": "There are countless movies regarding the matter, however nothing with substance. Torbaaz is a film with trust. 10/10"}, {"id": 584, "text": "In war-torn Afghanistan (shot in Kyrgyzstan), if on one hand honest kids were being conditioned into turning out to be self-destruction terrorist, then again, they were figuring out how to play cricket. In this psychological oppression versus cricket plot. Astounding work is finished by the chief Girish Malik, cast, and group."}, {"id": 585, "text": "Sanju Dada is an extremely touchy entertainer; his eyes say a lot, a comprehension of the character. In the film he fortified with the youngsters so well; a sensation of misfortune according to the child and spouse however when he grins, the world grins, and the Chemistry of Sanju Dada and Children is entrancing."}, {"id": 586, "text": "Torbaaz is a story of a Doctor who transcends his own misfortune and chooses to change the lives of a couple of outcast camp children who are on the way of decimation through the sport of cricket."}, {"id": 587, "text": "The account of Torbaaz is firmly lined up with the truth of Afghanistan, and the wonderful portrayal of cricket as a method for liberation is as valid for the kids for what it's worth for my character, Nasser Khan, who ricochets back from individual misfortune. I preferred it and prescribe the readers to see it."}, {"id": 588, "text": "The film based on the touchy issue of the youngsters who are trained to a self-destructive suicide bomber in Afghanistan"}, {"id": 589, "text": "Torbaaz is an account of an Army expert Nasser Khan (Sanjay Dutt), who has lost his family in an implosion attack in Afghanistan. A couple of years later, he re-appearances the country to help his buddy Ayesha (Nargis Fakhri), who runs an NGO for youngsters there. This film is probably the best film I have seen for the current year."}, {"id": 590, "text": "Streaming on Netflix and featuring Sanjay Dutt in the principle part of a previous Army specialist, Girish Malik's Torbaaz conveys on its guarantee of being entertaining. The film depends on the subject of looking for concordance and harmony through cricket in clash desolated Afghanistan, which was needed for a difficult screenplay. Furthermore, truly, the storytelling and writing (likewise Malik alongside Bharti Jakhar) is the greatest strength of this 133-minute-long should watch offering."}, {"id": 591, "text": "The film is a good one time watch and dont know why people bashed it. The thought itself is unique and sanjay dutt does a really good job in the film. Kids are really cool and good actors."}, {"id": 592, "text": "Girish Malik, Bharti Jakhar guys your rock. Any one watching this review, dont give a second thought and first watch it. Its a pride of indian cinema, be it story wise, characters wise or direction wise. A true masterpiece."}, {"id": 593, "text": "This film needed to show in Kashmir, this really inspiring movie."}, {"id": 594, "text": "Its an average movie, story was good overall and Sanjay Dutt as always delivered his best."}, {"id": 595, "text": "Total waste of time. Nothing is good about this movie. The combined worst efforts of everyone has created this price of crap."}, {"id": 596, "text": "Directed by Girish Malik, 'Torbaaz' tells you the story of an ex-military doctor Nasser Khan (Sanjay Dutt) who lost his wife and son in a blast caused by a suicide bomber. Years later, he returns to Afghanistan to help his friend Ayesha (Nargis Fakhri), who runs an NGO for war-affected families and helps children to come out of the Child Suicide bombing squad."}, {"id": 597, "text": "Sanjay dutt acting is superb. This is a unique kind of story film."}, {"id": 598, "text": "The story of Torbaaz is closely aligned with the reality of Afghanistan, and the beautiful depiction of cricket as a means of deliverance is as true for the children as it is for my character, Nasser Khan, who bounces back from personal tragedy. I liked it and recommend the users to see it."}, {"id": 599, "text": "The film is about child suicide bombers in Afghanistan, who have been trained to believe that killing the enemy is a virtue and glory in the afterlife and a cricket coach who think that peace could prevail if kids are given a bat and ball so that they can play cricket and leave weapons."}, {"id": 600, "text": "Torbaaz is a story of an Army specialist Nasser Khan (Sanjay Dutt), who has lost his family in a self-destruction assault in Afghanistan. A few years after the fact, he re-visitations the nation to help his companion Ayesha (Nargis Fakhri), who runs an NGO for kids there. This movie is one of the best movies I have seen this year."}, {"id": 601, "text": "Torbaaz is a story of an Army specialist Nasser Khan (Sanjay Dutt), who has lost his family in a self-destruction assault in Afghanistan. A"}, {"id": 602, "text": "Amazing writing apart, the film is edited well, in excellent direction, and, most importantly, the acting of Sanjay Dutt as a cricket coach was simply superb. For a person like me who is Sanjay Dutt's biggest fan - and he does have millions of like me, Torbaaz is a must-watch"}, {"id": 603, "text": "Streaming on Netflix and starring Sanjay Dutt in the main role of a former Army doctor, Girish Malik's Torbaaz delivers on its promise. The movie is based on the theme of seeking harmony and peace through cricket in conflict-ravaged Afghanistan, which was required for a challenging screenplay. And yes, the writing (also Malik along with Bharti Jakhar) is the biggest strength of this 133-minute-long must-watch offering."}, {"id": 604, "text": "Well when I saw the trailor I felt some thing good is coming But director seems incompetent... Sanjay Dutt seems weak I guess becoz he was going through his treatment... If some one like rakesh om prakash was needed for better treatment.. songs dint work emotions dint work .. few Kids were good. Dialogue writer needs to be more prepared .... 2020 none of the movies worked .."}, {"id": 605, "text": "I watched this film with my family one of the best performance by kuwaarjeet chopra. His facial expressions in film conveyed his hard work. Dialogue delivery, look , body language, expressions changes perfectly. Remarkable and commendable performance. You nail it! Best wishes for your future n looking forward to seeing in new films.. continue this waves bro.."}, {"id": 606, "text": "Torbaaz, highlights how terrorism is a worldwide issue and how it influences blameless kids to take path of being a suicide bomber. Girish Malik did a great job directing Torbaaz, featuring Sanjay Dutt and Nargis Fakhri as the lead characters . The film is produced by Puneet Singh and Amardeep S Reen, can be watched on Netflix. My rating for the movie is a 10 star coz I am greatest fan of Sanjay Dutt."}, {"id": 607, "text": "Cricket has always spelled magic in films whether it was Lagaan or the Dhoni movie. This one is different since it shows young boys of a refugee camp in Afghanistan being groomed to form a cricket team by an ex Indian Army doctor ( Sanjay Dutt) from India, who had lost his wife and son there in a terrorist attack. On the other side we a local Taliban terrorist Rahul Dev objecting to his boys playing cricket since it was coming in the way of him using these boys as suicide bombers. Both Sanjay Dutt and Rahul Dev have a confrontation where Rahul allows one match to be played. A plain tale told in an equally plain though engaging manner. However the director has captured the outdoor location effectively, the songs used have good lyrics and add to the impact of the scenes. The cinematography is excellent which makes the film visually appealing. Sanjay Dutt acts adequately within the narrow scope provided to the character. Rahul Dev impresses with his characterisation and surely steals few scenes he has with Sanjay Dutt. Nargis Fakri has a small role with no scope to impress."}, {"id": 608, "text": "Watching now. And after 1 hour i can say it's superb movie . Great story and best acting direction OP"}, {"id": 609, "text": "Great movie .. fun to watch!! Great work by director girish malik. Performance were good- sanju baba justified his character, rahul dev was too good, kids were awesome, habibullah-kuwaarjeet was tremendous with acting and expressions.. indeed a nice movie after a long time on such subject."}, {"id": 610, "text": "Just watch it. I have watched this movie on 15th December, 2020 and just fall in love again and again ❤ 👌Supperbb.."}, {"id": 611, "text": "Bollywood must make more movies like this - content, story, message. 8/10. Great work !"}, {"id": 612, "text": "One of the most refreshing shows that I've watched in recent times. Wonderful!"}, {"id": 613, "text": "Despite being a very simple and basic, this film rules because of the dialogue presentation of every character."}, {"id": 614, "text": "I literally got goosebumps watching this film. Definitely, a must-watch content."}, {"id": 615, "text": "This is a very good movie and mostly I liked the fact that it is very relatable to your life."}, {"id": 616, "text": "I loved every bit of simplicity, boldness and drama. It is very well written and performed."}, {"id": 617, "text": "I watched the film and I truly enjoyed the film. It has everything you look for. Amazing concept!"}, {"id": 618, "text": "Such a inspiring movie, the viewpoint from the kids of taliban and refuge camp. Not easy to make this story very powerfull story"}, {"id": 619, "text": "While the theme of the movie is nice, I don't think sanjay dutt could act. His acting seems forced to me. Nothing special. I wouldn't recommend this movie."}, {"id": 620, "text": "What a thought! We needed such kinds of film to be launched for the youth and it has. Brilliant!"}, {"id": 621, "text": "Avoid watching this waste of time. Bollywood is gutter. #Justice"}, {"id": 622, "text": "This movie is of a new concept. Sanjay dutt just killed it very good performance by nargis fakhri overall good mobie"}, {"id": 623, "text": "Couldn't help but notice that first 50 comments all gave good rating and surprisingly 12 out of 12 people found it helpful! All first top 50 comments Something fishy going on here"}, {"id": 624, "text": "Excellent story with good massage seems to be a very good movie with great massage😊"}, {"id": 625, "text": "I expected Sanjay Dutt to be play better, his facial expressions did not reflect what was happening .. same. May be Fakhri's character could have developed further to make this movie more entertaining."}, {"id": 626, "text": "#OneWordReview #Torbaaz Decent I saw Torbaaz because it looks good trailer but the real movie is little bit disappointed. The story is how all the terrorist using kids for suicide bombing in Afghanistan &amp; how they having life at refugee camp. Sanjay Datt is done a decent job he is just like enjoying his role, Rahul Dev the terrorist is also doing well. Nargis Fakri was poor. But all the Child Characters they done exceptional acting. Few moments good in the movie, But Final Cricket match is not much entertaining. Screenplay is so slow. That makes it boring. A one time watchable movie."}, {"id": 627, "text": "Sanju sir I know he is a great actor but story of his current movies are very bad Kalank , sadak 2 and now this Torbaaz All he needed a good story and he can carry whole movie but writer and director can't even give him a good scriptAnother lackluster from sanju sir"}, {"id": 628, "text": "Guys pls dont go by the 5.0 review. This is much more than that. I rate it 9/10. The direction is poor but the plot is just too good to miss out. Sanjay dutt has delivered an amazing character and so have the kids. The last part was a bit rushed. I feel could've been better but overall the movie is awesome!"}, {"id": 629, "text": "I can watch this film whenever I'm bored or upset. It is very entertaining just makes your mood good."}, {"id": 630, "text": "Brave attempt to raise this complicated situation in this troubled nation. What beautiful and deep dialogues with terrific performances by Sanjay Dutt, Rahul Dev and real Afghan kids."}, {"id": 631, "text": "Kuwaarjeet as Habeebullah - was way to good and confident for a new comer,the performance was INTENSE without him overdoing it anywhere, the scene where he speaks on news with undertones of sarcasm and the threatening intent, tells that this actor has skills, his interaction with kids brought the soft side of him but with toughness in the character well maintained, he also did justice to the character by pulling off the dialect and the accent really well ,his performance and expression in the climax scene was IMPACTFUL. You will find it hard to believe that this film was his debut. I am sure we will get to see him soon again."}, {"id": 632, "text": "Superb excellent movie good acting by sanju baba....."}, {"id": 633, "text": "Very good movie excellent work👍👍👍👍👍👍👍👍👍niceone keep loving"}, {"id": 634, "text": "What nonsensical stuff...dont waste your time ...watch something better."}, {"id": 635, "text": "The movie had the right intentions but unfortunately the actors specially the kids are supposed to be the backbone of this film are too weak in their roles. Apart from mind blowing locations this movie is a huge disappointment as it has nothing new to offer. There are some scenes which are unrealistic and does not make any sense."}, {"id": 636, "text": "Storyline was good but didn't expect this from sanjay dutt. There are many problems in acting, direction and cinematography. Seems a low budget movie."}, {"id": 637, "text": "Below Avarage FiLm sorry But its a time waste Direction ,dialouges are very cheap and even sanjay dutt dont know how to act in this film"}, {"id": 638, "text": "Netflix India churns out another garbage. Hire me as your content manager coz you don't know what scripts to back, And, Sanjay Dutt really needs to find better scripts and stop the doing the 'I'm so sad, my life has had so many tragedies' routine. This is the guy who did Munna Bhai and now, churns out crap. He probably need the money, but seriously."}, {"id": 639, "text": "Just wasted my 2 hours, no storyline, one of the worst movies i have ever seen. I don't know what they thought while making this."}, {"id": 640, "text": "I was able to make it through the first 24 minutes before bailing out, this is just an incredibly bad bollywood movie. I had to return here and check out the reviews. All of the first 100 or so reviews give this film 8,9 or 10 stars, from one review accounts. I have never seen such a heavily upvoted movie in my life.I think IMDB is going to suffer from this, as obviously they aren't doing anything about it.Amazon ignored their fake reviews for years until their customers finally got fed up and it became a well known joke. The same is happening here. I'm thinking IMDB is getting paid as some of these accounts are obviously created with help. 1 review in the last week with an account of 8 years? Whatever.With all the ads, and trailers you'd think that this website would at least try to keep it honest.I'm slowly moving to other sites as this is just getting out of hand. Even Reddit has threads about IMDB fake reviews, so bad it's a common autofill search extension now."}, {"id": 641, "text": "I tuned in to watch it purely due to the content and subject matter as it looked like a courageous take on highlighting the important global issue of child suicide bombers.I've not so far seen a film like this from the Bollywood industry and I'm sure it'll be an eye opener for many as it grippingly intertwines both Sanjay Dutts character's background story in the film with a beautiful message of reform and justice for the innocents. The visual backdrop and cinematography are breathtakingly stunning and you can clearly understand the intention of the director Girish Malik's vision about giving war torn children a positive motive to live their lives. Their harsh experience and upbringing is taken into consideration when you see the child actors arguing with Sanjay Dutts character (some of my favourite parts of the film). It's definitely a fine balance of entertainment and serious cinema while not being too expositional which Bollywood could do more of.All the actors have been finely cast, from Rahul Dev's stellar performance as the negative Talibani to Sanjay Dutt bringing to life a role that portrays a broken man doing his best to overcome his past trauma of losing a wife and child, so you do end up sympathizing with him. Kuwarjeet Chopra also does well, bringing a subtle edge again refreshingly devoid of melodramatic acting doing justice to his part. The child actors, a firm favourite throughout bring in a quick witted and raw sharp appeal which ends up making them see the 'real deal' surrounding the chaos and destruction caused by the adults they're bound to and who come to save them. The end of the film looked like it was heading to be a victorious win of the underdog in sports genre films BUT without giving it away, the unexpected twist leaves you stumped and saying that was cleverly done!"}, {"id": 642, "text": "In a country where children have seen more terrorism than books and bats, promoting cricket is an impossible task. Netflix Torbaaz movie is a story of hope. Hope .. of a happy life, of humanity, of fulfilling dreams, of a better tomorrow. The theme of this film revolves around terrorist activities happening in Afghanistan.Torbaaz film is a heart touching story that shows the mood of people battling fanatics and children living in refugee camps.How do children brainwash by terrorists, what effect does it have on them and their family. All of this is shown in the film. Girish Malik, who wrote the script, is quite weak and fails to hold up for two hours.The director was also not impressed with this sensitive story. Length is also a big reason for this. The initial one hour of filming only takes the story.The story moves extremely slowly. At the same time, the story picks up in the second half, but in the Climax, it is scattered like a card.The theme of the film and the thinking behind it is good .. positive. Bringing together fascism and cricket is also interesting. But coming to the screen, the soul of the film is no longer there.Sanjay Dutt is cast in the role of Naseer Khan. He has a good rapport with the kids .. especially in the emotional scenes. However, there was a shortage of a cricket coach. Also, when Sanjay Dutt is in the film, some action scenes are also expected, but there is a disappointment here.Nargis Fakhri looks like a bag in a small roll. The talent of Rahul Dev in the character of terrorist Abdul Qazar has also been completely lost by the director.Well, the strongest side of the film is the children .. makes 'Torbaaz' worth watching for two hours .. especially Eshan Javed Malik, Rehan Sheikh, and Rudra Soni.Overall, Torbaaz can be omitted because it does not deliver the intense massage with the intensity it deserves. It is a cumbersome film made on a good subject, so giving it two hours would be a waste of time."}], "reviews_amount": 643}