{"name": "Alone", "titleId": "tt07711170", "reviews": [{"id": 0, "text": "Started slow, the film is predictable throughout and the plot is pretty poor. I was expecting something exciting/ thrilling but to be honest I was just bored."}, {"id": 1, "text": "Slow paced , back ground music not good and nothing new in the storyline"}, {"id": 2, "text": "Simple and effective hits every right film making thrilling note must watch dont listen to stupid negative reviews just watch and enjoy"}, {"id": 3, "text": "LOL I saw a rating where the dummy who rated it said it was bad acting..??!?!.. the main bad guy is a regular on Ozark and the main girl is a great actress. The acting overall was really good. This person doesn't know what bad acting actually is and probably think Transformers was a masterpiece Hahahaha.I was convinced and that kept me watching it. Is it original? Nope.. was it good? Yup!"}, {"id": 4, "text": "This one seriously kept me on the edge on my seat, which doesn't happen that often. It's a pretty 'simple' movie, in theory, but extremely well done. Anyone giving this a rating under 6 is just being jerk for no reason. Solid movie."}, {"id": 5, "text": "It's not that this was a bad movie, but it's just been done before and doesn't bring anything new or memorable to the table.The title cards were unnecessary and the villain's monologue, during which he challenges our protagonist to grab his gun, is cringey and elicited a big eye roll. It's also astounding how he managed to keep finding Jessica with ease in his car, almost as if she had a psycho homing device on her. At one point, he even manages to dump a body right where Jessica happens to have stopped to take a rest in the woods!Stupid decisions are, of course, a necessary evil in these types of movies, like Jessica failing to finish her attacker off after a car crash renders him temporarily unconscious.Was it worth the $6.99 I paid to watch it? No. Is it a way to kill an hour and a half? Sure."}, {"id": 6, "text": "I'm giving a generous 8 as support for the director and writer. Of course this is a remake but there's much more to appreciate from the film. The only thing I didn't like was the guy's motivation, which unexplained and deserves a closure at the end."}, {"id": 7, "text": "Just fantastic, pleasantly surprised, thrilling, raw and gripping screenplay, amazing performances from the two leads. This movie deserves a lot of praise, needs to be seen. Highly recommended."}, {"id": 8, "text": "A random guy we don't know anything about chases a random girl, the movie is completely plotless and boring, also is totally nonsensical the girl is kidnapped without water or food for days and is still able to run and fight, best part is when the girl is shot by a powerful rifle probably a .308 in the shoulder and nothing happens to her. Completely ridiculous, a waste of time and money."}, {"id": 9, "text": "Alone is a rock-solid thriller. If you are a jaded horror fan, you'll scream don't do it multiple times, and mostly, your wish is granted. Very well acted and tautly paced, it is a worthy entry in the serial abduction and escape genre."}, {"id": 10, "text": "I enjoy survival movies because I like to put myself in the situation - how would I react? What would I do? This movie is very believable, especially from a female perspective. The heroine, Jessica, is not a superhero nor is she a victim. She isn't blond, buff &amp; twenty like most of victims portrayed these days. Instead, she is your sister, daughter, friend - just a regular youngish (30?) woman, moving from one place to another, pulling a U-haul behind her much used car. Same for the man. Average looking, even a little common looking - exactly the kind of guy you see everyday at the store or gas station. Their meeting, too, is an event that occurs a million times a day all over the world. As I watched this, I found myself thinking, I've done that... Don't get me wrong, this isn't a feminist film at all. The movie keeps your interest simply because it is so believably realistic - Jessica and the man act and react like one would expect - not like a character in a script. And the ending, though violent, dirty and degrading, was not how I expected this particular story to end. Definitely worth watching."}, {"id": 11, "text": "I didn't have any expectations coming to this. So, despite the somewhat formulaic plot the great direction, the top notch performances, ( particularly from Jules Wilcox), amazing soundtrack, all contribute to make this better than the sum of it's parts. It's incredibly taut at times and it never lets up. Definitely worth a watch. I'll be interested to see where John Hyams goes from here. a solid film and , owing to my nerves being shredded at times it's a 7/10 for me."}, {"id": 12, "text": "I rarely write a review but I had to say something in defense of this movie. I'm stumped by the negative reviews. Plain simply put, this was a great tense thriller. My wife and I walked away totally surprised and satisfied. I left with none of the criticisms some of the other reviewers expressed."}, {"id": 13, "text": "Alone 2020 is an amazing little thriller that delivers the goods on all angles, acting, writing and the cinematography is especially beautiful in this film. Please check out this film you won't be disappointed"}, {"id": 14, "text": "Failing to consult Kidnapping for Dummies, Rescuing for Dummies, Escaping for Dummies and, more importantly, Filmmaking for Dummies leaves you hoping for an audience of Dummies, good luck!"}, {"id": 15, "text": "I saw Alone, starring Jules Willcox-Dirty John_tv, Snake &amp; Mongoose; Marc Menchaca-Ozark_tv, Homeland_tv and Anthony Heald-X_Men:The Last Stand, The Silence of the Lambs. This movie is a remake of a 2011 Swedish movie called 'Gone'. Jules plays a recently widowed woman that is moving away from the city to the country to help soothe her pain. She has a few run ins with Marc-innocently at first-but she soon decides that he is probably stalking her. Sure enough, he drugs and kidnaps her and she wakes up inside an isolated cabin in the woods. She escapes and is in the process of trying to get someone to help her when she runs into Anthony, a hunter. Can he save her? Does she trust him? Or should she just stay away from any strangers, altogether in the future, that is, if she survives this encounter? It's a pretty standard movie, which was made in 2018-I read the end credits-so it's 2 years old. Oh yeah, maybe it's just me but Marc Menchaca reminded me of Jason Sudeikis with a bushy mustache. It wasn't rated but it contained violence and language and has a running time of 1 hour &amp; 38 minutes. I don't think I would buy it on DVD but it would be alright, as a rental."}, {"id": 16, "text": "The movie starts off well seeing the atmosphere for a show thriller. But all goes downhill as soon as she gets out of the house. Wherever she goes he is there or vice versa. In the end I don't know why the guy doesn't bring the gun with him. Instead he brings a knife. The subplot where another guy gets killed doesn't add any value. Also she's in a river and always it's raining but she looks dry most of the time."}, {"id": 17, "text": "How did he know where she'd come out of the river? How did he know which way she ran? How is there always a road but she keeps missing it? Why didn't she call the cops sooner? Why didn't the hunter call the cops? Why are there so many roads in the woods which seem to be in the middle of nowhere ? How is he always right there even after pouring rain all night? Rather implausible... but kept me nervous.... don't NOT watch it, but there are lots of holes...."}, {"id": 18, "text": "Surprisingly good and well written! Make more movies like this please!! Very entertaining"}, {"id": 19, "text": "Dumb weak main character making dumb weak decisions."}, {"id": 20, "text": "Drive, stop, sulk, act weird, rinse, repeat. No thrills or misteries...The only mistery is why this woman keeps making the same wrong decisions over and over again, like, why does she run through the woods (barefoot) when there are perfectly cleared roads?SPOILERS Her stupidity keeps her alive, but manages to get someone else killed....."}, {"id": 21, "text": "Suspense ....on the edge of your seat...I thought it was better than most movies in this category..."}, {"id": 22, "text": "This is another reboot/rehash/remake of all these 90's movies. It brings nothing new and you almost feel like watching on fast forward."}, {"id": 23, "text": "This film kept my adrenaline up because it is well shot, edited, and acted...But it's also insanely stupid.So many things make zero sense... This guy keeps finding her over and over and over and over and over... On the road, on the road, in the woods, in the woods, in the woods, in the woods.... Not only does it defy reason, it defines the rules of physics. This dude is just everywhere."}, {"id": 24, "text": "Excellent movie Thrilling from the beginning to the end Fantastic directions Deserve watching"}, {"id": 25, "text": "Woman traveling alone minding her own business what could go wrong. Scary movie. Worth watching."}, {"id": 26, "text": "John Hyams, mostly a tv show director, directs a slowly paced, mostly predictable abducted woman story. We had to use the FF/skip button alot during the final hour, because it was like walk, walk, struggle, hide, hide, walk, hide, ugh. It was pretty much a game of call the next scene with us, so predictable."}, {"id": 27, "text": "Before i decided to watch this movie i skimmed over the reviews and the reviews made me believe i was going to watch a typical cat-and-mouse movie but a little bit better. I was terribly disappointed. This movie was not good. It just wasn't. It was very typical for its genre, like any of these types of movies (bad guy catches girl, girl escapes, bad guy hunts down girl, and then the typical girl power happens). It brings nothing new to the table, and the worst thing for me was that it was terribly predictable and all the clichés one could ask for are in this movie which means the whole runtime the characters make idiotic decisions. It wasn't believable in the slightest.The only reason that i gave it a 3 was the cinematography was ok and the actors weren't too bad either."}, {"id": 28, "text": "You've seen countless movies like this, it offers nothing new, don't waste your evening."}, {"id": 29, "text": "No logic, common sense, or survival instincts whatsoever to the story--nothing but irrational sequences and actions taken. Not grabbing any weapon at first chance after escaping from basement?! Leaving shovel behind where the killer buried the body?! Oh, come on?! Nothing believable, original or suspenseful. Annoying throughout the entire film--just skip to the last 5-minutes of the film for the revenge or final showdown scene. Overall, not recommended."}, {"id": 30, "text": "Really good suspense movie well worth a watch. Very well acted and a film held primarily together by two actors. Give this a view you won't be disappointed"}, {"id": 31, "text": "This is a very well done movie that delivers on the premise presented in the synopsis. The characters could have been developed more. However, I believe that the actual development leaves the characters just ambiguous enough to allow the viewer the ability to imagine the motivations and background for each. ALONE will not be added to any of my favorite movie lists, but when I come across it again in a few years I will rewatch it. Ultimately, I truly enjoyed watching this film."}, {"id": 32, "text": "Terrible acting, unrealistic and done before way too many times before. The trailer looked decent so I figured I'd give it a shot but hot damn I wish I hadn't. What a trash movie, don't waste your time."}, {"id": 33, "text": "I'll admit she made some dumb moves here or there. Hello more head shots! Or drive in a different direction! But overall a pretty good movie that not a lot of people will see. I was invested in seeing her outcome and rooting for her. Loved the twist of her calling his wife. And tears filling his eyes that even if he doesn't go to jail he won't be able to go home. My only complaint is I wish I was slightly closer to the edge of a panic attack. Which maybe I would have had i seen movies as they were intended to in the theater"}, {"id": 34, "text": "Abduction of a lone female traveler.So, it's been done before. The acting was ok and it was filmed well but it was a bit slow. It's forgettable because it didn't bring anything new to viewers but it worked at maintaining a tense atmosphere. I thought it was a decent thriller."}, {"id": 35, "text": "I am embarrassed to say that I actually watched this movie to the end. Trust me, you've seen this movie A MILLION TIMES. The script was lazy, totally predictable and common place. Do yourself a favor. Leave this movie ... alone."}, {"id": 36, "text": "An hour and 37 minutes of nothing happening !No suspense, no action and no thrills.This was like a comedy in parts. The funniest bit was when she happened across a dumb hunter who she attacked by mistake. Once she has explained what has happened all he says is come to my car to get some spare boots !! Really? Then she stands around admiring the trees before she gets into his car.I won't even talk about the part where the abductor catches up with them because that has to be one of the worse scenes for acting I have ever seen.Don't bother with this. Watch the election news that's even worse. Lol"}, {"id": 37, "text": "The scene was so slow, this girl had escaped from being kidnaped, but she's still choosing bad way, like too slow when she's in Sam's car while Sam burried Robert. And also, Jessica is too stupid by keeping all by herself when Robert saved her, she just sat silently in the car and didn't tell what she'd just been thru... Nah, the director just wanna playing around with the audience's adrenaline, and this plot gave otherwise..."}, {"id": 38, "text": "Its astonishing that this movie has an avg rating of 6.2. Dumb characters, making extremely stupid things for the sake of the plotI give it 2/10 just for the sake of the beautiful forest where this movie wad mostly shot in"}, {"id": 39, "text": "The woman is followd by a dangerous man. She must have braindamage making such stupid decisions it makes me to ennoy. Tippical 90ees thriller. Wen you love these movies I think you will enjoy it after all, I can't watch it anymore due the stupidety from the chased woman."}, {"id": 40, "text": "Boring as hello. And a terrible ending to boot. Takes ages to get going, storyline is predictable, give it a wide berth or be bored &amp; disappointed"}, {"id": 41, "text": "Do not waste your time w this pile of crap. Just don't. Absolutely awful in every way - from the horrid acting and crap script. Zero originality. Basic - entire flick shot at one location tripe. So freakin bad. Avoid at all cost."}, {"id": 42, "text": "I wish she would have escaped the serial killer, and then the movie just became a nature survival movie like the synopsis said. Instead, it was just stupid.The serial killer and escape part was watchable. The rest was just stupid, though I guess worth watching.Not that goodWatch it, ehh whatever6 stars"}, {"id": 43, "text": "Totally unbelievable cat &amp; mouse story. You will be eye-rolling at how everything conveniently falls into place for the cat (always at the right place at the right time) and the mouse just makes poor decisions. With little backstory and plenty of plot holes, you should skip this one."}, {"id": 44, "text": "Aren't we done with watching a flailing, helpless and dimwitted - yet invincible woman be hunted by a man while she makes stupid decision after stupid decision?If I see one more cliche tire iron being brandished as a weapon, it will be too soon.Alone is exactly what you would expect it to be, and that's so irritating given that I thought movies had moved past this pathetic and basic premise of man hunts woman. Not for any woke reasoning, but just for the simple fact that it's been done to death."}, {"id": 45, "text": "Before watching this movie ensure you have gone to the bathroom, have a full drink and popcorn, all phones off. Every scene is important and there are no lulls in the action. It is an edge of your seat thriller. Some parts are tough since there is a kidnapping. Great acting and well directed.Well rounded between her being followed, pursued, captured, escape and chase. (This is not a spoiler since all of this in the trailer.) A good pace throughout the movie. Very realistic and believable. You can feel her misery. Great acting.Family Friendly? Lots of Swearing F-Bombs and some others. Tough scenes for young woman since this is a kidnapping and the kidnapper definitely has plans. Some smoking No nudity or sex"}, {"id": 46, "text": "This movie was absolute GARBAGE. I wish i could get the time back that I lost watching it. It was so predictable and awful that I could have told you the ending without even watching the whole thing. Such a boring and drawn out movie. Don't waste your money and watch something better."}, {"id": 47, "text": "Thats not a good movie. every scene is too long and boring. no good thriller no good horror no good sound no good lyrics. skip this one. thanks."}, {"id": 48, "text": "About 4 times throughout the movie, the main character either does something incredibly idiotic which NO normal human would do, OR something so incredibly improbable happens that it borders the realm of a sci-fi film.The problem with filling your movie with so many unrealistic and improbable events is that the viewer stop believing that it's real... the viewer realizes that they're watching a fictional movie and then the whole 'thriller' setting flies completely out of the window. I spent most of the movie just waiting for the next completely unrealistic event to happen, and one after the other, they kept on coming.I wasn't afraid or 'thrilled' for a single minute... the movie should be classified as a 'sci-fi movie' instead of a 'thriller' due to how unbelievable the set of circumstances are that befall the main character. 4/10, would absolutely not recommend."}, {"id": 49, "text": "Re-do of every kidnapping thriller I've ever seen. Completely predictable. My son and i were able to call out in detail the next scene as if we had already watched the movie. Save your money. Boring, horrible."}, {"id": 50, "text": "Another stalker from the road stalks a lady story.The two leads are great, make no mistake, they both act perfectly and were great in these roles. The direction was solid and done well and the tension builds greatly in many of the scenes.The super annoying rain clearing ect black cards precursers to parts of the movie were annoying and take you out of the film. Dump that stupidity.But the worst thing was again, the girl is being stalked and does the absolute dumbest stuff. You're going no no no, run the other way! but nope. She's an idiot. I hate it when you have a movie like this that is done really well yet the person being chased is once again, a moron.You'll find yourself screaming at the screen a few times. But outside that, this was good."}, {"id": 51, "text": "Originally a festival fave in 2018, this film became a sizable success during the pandemic benefitting from great reviews ( 94% RT) and a solid audience score. The film is an intense, sometimes frustrating, simplistic theater that focuses on a young woman moving cross country who comes up against as serial killer. It's a survival thriller that takes a bit to find it's stride but when it does is quite impressive. Filmed beautifully with a solid lead performance this stylish horror flick is slick, escapist entertainment. I expect great things from the director and actress moving forward.***.5/5"}, {"id": 52, "text": "Silly movie and low budget. Just 2 actors and nothing take attraction, nothing to terrify you only usual nature a man who maybe gone mad or serial killer. I don't see any horror in that. Just when I thought this movie couldn't be any more stupid, she hides in the kidnapper's car and even makes a phone call. Women alone and sees killer many times and keeps going on her trip alone until she gets kidnapped?!! Normal women who see that man more than once in the remote woods? Stranger Danger. Exactly. How many times did she see him pull up or drive by, and yet she continued on her trip/? I suspect being followed don't tell a stranger which way I am heading."}, {"id": 53, "text": "Both leading actors gave strong performances, especially from Menchaca as the creepy stalker. The isolated backwoods of Oregon also provide a great, atmospheric backdrop to this drama as the victim battles both man and nature for survival. Had me gripped the whole way through. 8/10"}, {"id": 54, "text": "Jules Wlcox is excellent as Jessica. She is strong, determined not to let this awful creep get her. The simplicity in which the story is told has the viewer razor focused. The photography is really good and showcases Portland, Oregon's wilderness. I thought Marc Menchaca was beyond unnerving. I don't know that people realize how many women are abducted and how few escape with their lives. It's nice to see a strong woman character carry the film."}, {"id": 55, "text": "I think I'm being followed. Uh oh. I'm pretty sure I know what those words mean.Anyway, Jessica (played by Jules Willcox) is a widow who loads her stuff in a U-Haul and heads to an unknown destination. Along the way, she gradually gets tormented and kidnapped by a nameless psycho (played by Texan Marc Menchaca). That's the blueprinted rub of 2020's Alone. With ample enthusiasm and the need to write at 5 in the morning, it's my latest review.So yeah, we've seen films like Alone before and its title, well it's not too thought out. Still, Alone is one of this year's best. Feeling like Spielberg's Duel in which the antagonist actually talks, Alone's setting of lush, wet Oregon takes over as it becomes a swallowing co-star.The performances in Alone are as it seems, nerve-ending and calculated. Jules Willcox and Marc Menchaca share different sides of an acting coin. They exhibit decent vs. evil and damaged vs. non-empathetic. Menchaca reminded me of a mustached Jason Sudeikis while Willcox gave off a heroine, Winona Ryder type vibe. They are pretty much in every frame and carry Alone with superior aplomb.Directed by John Hyams (son of veteran helmer Peter Hyams) and nifty and compact in its 98-minute running time, Alone keeps you on your toes with devised, inching tension. It's a thriller mind you and it's done with careful skill despite feeling a little familiar (pale, cold-blooded killer stalks vulnerable female). Hyams using rack focusing, low angles, and teeming overhead shots, actually outdoes his pops here. Confidently committing to every shot, he is aided by rich, forestry cinematography from the seasoned Federico Verardi.Alone ends like other violent, heady rides but it doesn't cheat the audience. Every nuanced plot point, every grubby mano-a-mano, and every sense of foreboding shake up is assured. I hope I'm not alone in this inference."}, {"id": 56, "text": "I had no expectations of this movie. I heard somebody talking about it, saying it wasn't all that bad. So we ended up giving it a go. We liked it, it is a small budget thriller with few actors in it, but it worked. You don't always need these big budget or the best of actors in movies.I would recommend not seeing the trailer, as always. They just give away too much. Looking for an easy thriller, give it a try. 6.3/10"}, {"id": 57, "text": "Ok thriller. Bit predictable. The mini titles prompting what the next part of teh story is pointless and spoils the movie."}, {"id": 58, "text": "It's really not worth watching. Storyline is weak, characters are weak and filming is not to today's standard."}, {"id": 59, "text": "I believe the movie tried to purposefully add little details to the murderer's profile on order to convey a message. He was the average guy you could see sharing Jordan Peterson quotes and Stoic philosophy in the Red Pill and similar subs in Reddit. Middle class family guy, obsessed with power and manlihood, hunting women for sport, perfectly rationalizing all his inhumane acts and even displaying a sickly, fake code of honor. I congratulate the director for highlighting an important problem of today's society.Other than that, it was an okay movie. Tense, but pacing was slow at times."}, {"id": 60, "text": "I liked the movie because the story is good and I felt uncomfortable the ENTIRE time!What I didn't like was the character in it, she did all of those things you would never do if you were stalked down by a crazy psychopath, which was really frustrating to watch. Another thing I didn't like (SPOILER ALERT) was the fact that no matter where she went hiding he always managed to find her, even though the forest was giant."}, {"id": 61, "text": "Checked my Fitbit during one of the many intense scenes and bpm had risen to 117 so yeah, I'd say this film is packed with great suspense.I won't give any spoilers away in saying it was refreshing the writers didn't take the easy way out and make their protagonist choose silly polite woman easily gets abducted choices. Character choices were believable and highly suspenseful. The acting was so well done especially for such a small cast.Extremely well directed! Great pacing. And killer suspense. Looking forward to many more from these creators."}, {"id": 62, "text": "Man abducts woman who escapes, repeatedly evades and ultimately kills him. If you've never seen a movie with a similar plot, this could be a good one to start with as it asks very little of the viewer and gives very little in return."}, {"id": 63, "text": "This movie was perfectly realistic, and didn't have to go overboard on the gore in order to scare the sh** out of you. It's intense from the start, they did a great job with creating a natural tension and sense of danger, based on realistic situations women encounter all the time. The main character isn't one you have to yell at through the screen, and the ending is jump out of your chair satisfying. I recommend this movie to anyone looking for something new that wont disappoint."}, {"id": 64, "text": "I watched the trailer a few months ago. It didn't look very good so I passed on it. After realizing Marc Menchaca plays the killer I decided to give it a shot. I'm glad I did, I was hooked about 10 minutes in. I thought it was a great little cat &amp; mouse thriller. One of the better films I've watched in recent months. 6 stars from me"}, {"id": 65, "text": "I love Tyler Posey. He finally has an awesome role since Teen Wolf! Great suspense &amp; action. I was blown away in the 1st 20 minutes!!"}, {"id": 66, "text": "This unasumming low-budget film has the appropriate ingredients for keeping your eyes glued on the screen. The film depicts a real fight for survival in a barely trodden territory where murderous minds succeed into leading a double life that will allow them to make a killing of unsuspecting innocent souls driving through it."}, {"id": 67, "text": "Was rather not bad if anything this movie teaches you how to try to survive if you were to be kidnapped... movie kept my attention wasn't boring a bit predictable kind of wish there was more the the story other then how it ended but a overall good movie."}, {"id": 68, "text": "A woman travels to new house from deep wood and like no man land road, where a mysterious car is chasing her. Later she was captured by its driver ( a psycho killer) and he was going to kill her. What is the next. You have to see this one lady thriller. Though story is not new but perfect presentation, decent outdoor shooting of deep wood makes you this movie watchable. Helpless and loneliness parts of a woman are well portraying here. Climax is interesting. Once time watchable for alone horror and thriller. Acting of leading lady is good. Perfect background location is well catches by camera. We can see movie in 5 different parts like chapters of a novel ! Road, Night, Rain, River and Clearance. Story seems like inspired by 'Duel' and ' Monolith'."}, {"id": 69, "text": "The movie was shocked me. I thought was not good movie. But i changed my mind when i saw it. From beging to the end was perfect movie. You must watch it!"}, {"id": 70, "text": "Superb movie simply mind-blowing. A great thriller and definitely one of the best. Storyline, direction, acting all are exceptionally good. Specially the lead actress Jules Willcox (Jessica) acted superbly. Hats off to the director. After a long period of time watched a great thriller."}, {"id": 71, "text": "Watching this movie was absolutely a waste of a good evening. It was exhilarating and kept you on the edge of your seat. But the lazy writers couldn't even write in a decent ending. If you like getting furious at the end of a movie because you don't know what the heck happened, then this garbage truck of a production is for you."}, {"id": 72, "text": "Just watch 1993 movie 'the vanishing' with Sandra Bullock, Jeff Bridges &amp; Kiefer Sutherland instead. It's literally the exact same movie but much better. It also takes place in the PNW. This movie is a cheap Knock off. It's also not as entertaining."}, {"id": 73, "text": "I'd not say tht this was the amazin', but let me just drop this in here....All of tht doesn't matter. The thing tht matter is; The story or a plot is not tht much appropriate or kinda grt but when you're wathchin tht movie u can feel the every single scene at your minor gut tht suspense, the feelin of amazement tht was what makin' me give this review about it...The men and women both did a pretty well nd sesquipedalian job....#wasgrt..."}, {"id": 74, "text": "Loved it. Movie was edge of your seat suspense and makes you feel like you are really somewhere in the Pacific Northwest."}, {"id": 75, "text": "Please O please movie maker people. Please stop making movies where unbelievable character situations make incredibly stupid moves and decisions. It's just frustrating to no end. Can't you see this for yourself?"}, {"id": 76, "text": "I absolutely hated the heroine. I was actively rooting for her to lose because of her absolutely asinine decisions. This had so much potential. I was very much let down."}, {"id": 77, "text": "It's a fifteen minute Tom and Jerry episode stretched to one and a half hour thriller with three actors."}, {"id": 78, "text": "In the midst of a pandemic, and other worldly things I needed a good film to rejuvenate me. This little film made a big impact on me as it was totally a thrill ride through and through. It's advantage? Simplicity. This film doesn't go over the edge, but rather stays centered on what it is. Good old and classic filmmaking proves you don't need capes, and superpowers to make a great film. No big named actors or director, but people who care about the material they are given. Jules Willcox just acts scared the entire film, but it's her bravery when she needs it is when her character and performance shines through. The standout however was Marc Menchaca. He really does a great job at making you believe at first that this guy is harmless and fools you until it's too late. Menchaca goes from harmless to feared on a flick of a switch. Once he does that, he holds your suspense tight and doesn't let go as you have no idea what he's going to do next and how. It's the most intense chess match this year and is worth renting and even buying depending on if you like it or not. I loved it! 9.2/10"}, {"id": 79, "text": "I run out of telly and netflix it was A good thriller and I love simple minds aswell"}, {"id": 80, "text": "This movie I think is for the simple minded people only who enjoys simple plots. It is a typical cat and mouse story with a lot of dull moments which certainly is not for the people who have short attention span. I gave this a rating of 3 for the effort. I might have given it a 4 if I was only in a super good mood when I watched it."}, {"id": 81, "text": "*NON-SPOILERS*Average watch, wouldn't really recommend as there are too many unrealistic coincidences that happen in the film for it to lead along the storyline.The main character in the film lacks a whole lot of common sense, which makes it a bit silly really as there was plenty of opportunity to get out of the situation before it excelled. That's pretty much all I can say without revealing anything.The two real saviours are the acting and the picture for several scenes, both are very impressive indeed."}, {"id": 82, "text": "The tone, atmosphere, setting, and set up all make for a simple, yet effective thriller about a women's survival against a killer and the elements. But my God she is dumb and dumb characters in these situations infuriate me. She has her moments but the dumb ones by far outweigh the smart. That's all I have to say."}, {"id": 83, "text": "This is enjoyable to see a woman that has suffered a great tragedy being stalked and kidnapped. It is great seeing the character progression from the damsel in distress change to the heroine that fights as though her life depended on it. It is thrilling and one cannot help route for the protagonist in this film. The antagonist is convincing in being creepy and revealing his evil side."}, {"id": 84, "text": "Generally speaking movies today aren't what they used to be. Much of the talent has migrated to the small screen or TV series. The tentpole super movies will always be around like James Bond, Batman and what not. But the arthouse and quality 2nd tier movies not so much.Alone had the potential to be in the latter category, but the storyline falls victim to many of the same predictable, contrived trappings that so many others do. If they would have cleaned that up, they'd have themselves a truly good movie.As it is, for the most part it is very watchable. Yet any experienced movie buff will cringe at those dumb moments where the creators just HAVE to do the same stupid things they always do in movies. Overall, consider it a move that provides B+ for effort and a C for execution."}, {"id": 85, "text": "This is just a realy good movie, dont get the low recensions, i enjoyed it from begin to ending. Go watch this movie!!"}, {"id": 86, "text": "The story is too weird! A few things that I can't believe! 1) Is it that easy to search a girl in a forest right after she jumps from a river. That man will keep murmuring while catching the girl. 2) instead of escaping, the girl decides to go back kidnapper's boot for hiding. She even calls 911 while kidnapper is driving. 3) the kidnapper insists driving the car even being beaten up and stabbed, still not stop driving... Is he in hurry to go somewhere? 4) instead of calling 911, the girl will call kidnapper's wife in the end, OMG"}, {"id": 87, "text": "And that is the high point for me.Nothing that ground breaking going on here, but not absolute tripe either. You've probably seen a half dozen films of this nature and I found little redeeming quality other than my preface, the cinematography.Other than that, wait for it to hit cable, or just watch Dr. Pimple Popper. It's more original."}, {"id": 88, "text": "I have a hard time believing the writer considered how humans react to fear and paranoia. You're stressed that a man has acted aggressively towards you twice so you pull over to smoke? Fine. You then get out of your car and walk across a parking lot to smoke? Guess she's not that scared. The man shows up and makes a beeline towards you so you HANG UP THE PHONECALL YOU WERE ON? I've seen women get on phone calls on the odd chance a man is waiting for them in a parking lot, let alone actively pursuing them.Later on she, at two different points, stops attacking her assailant with a weapon and instead gets up close in an effort to choke him. Again show me a real human fighting for her life that decides to try overpowering their attacker instead of using weapons on hand.Acting was fine, shot composition was fine, it was just impossible to believe even someone working on instinct alone would make half the decisions in the film."}, {"id": 89, "text": "In the movies industry to make a film, you should have a story, well this is not the case in Alone, I think they went short on the budget, I wasted 2 hours of my life on this b movie..."}, {"id": 90, "text": "Jessica whose husband took his own life moves to another place 4-day drive away from home. He hit the road with his stuff towed to his car. A man with an old jeep messes up with him on the road and after the night she spent at a motel he apologizes her for being a reckless driver. Then he saw him on the road his car broken down but as him being a creep she didn't help and kept driving. Then at a cigarette smoke break out of his car he saw him again and drove away but as he cut his tire she got out of the road she got rid of the trailer but he broke the window and caught her. She woke up locked up in a basement. He came and mocks her husband committed suicide and then after one night she uses her hoodie under the door and with a nail she dropped the key and took it inside the room and got out of the basement to see the man coming right into the house. That part was extremely tense. She waited in a dark room by the door as he sat down to eat lunch and talked to his family over the phone. She managed to run out of the house and the river part came up. That was a splendid part. She jumped in the river to run away. In the forest she walked over some root and had to take it out it was really gory. She then hit a an old hunter with a stick thinking it was the Kidnapper. The man helped him and they drove away but the road was blocked with a fallen tree. The kidnapper came with His car saying his sister had problems. After some hesitation the hunter wanted his phone and the kidnapper beat him to death. And then at the night part he found her inside a cavity and shot her in the arm but she got away and hid. He let her use the rifle but she didn't buy the trick. After that in the daylight they come across while he was dumping and burying the old man. She sneaked into his car but the keys weren't there. She hid in the trunk taking the phone. The fight in the car was awesome. She attacked with a metal bar and they had an accident. She left the car and arrived an area without the trees and a fire that's being put down by a helicopter. She called his wife and told everything which I found a bit too far-fetched as everyone would call 911 once again. Then they fought once again and covered in mud and blood she managed to stab him to death and smiled at him while he was dying. It was one of the most tense movies I've seen lately."}, {"id": 91, "text": "I watched this type ( kidnape &amp; then survive) many movies but this movie was Finest Among all, Direction,Script,music,Acting all was soo good A full time Entertainment will keep u edge on ur Seat &amp; yes not for foolish people Dont listen bad losrrs review ."}, {"id": 92, "text": "Its good but i have seen more than 1000 film like this story so its fine for me i can enjoy when i saw this film but its too slow"}, {"id": 93, "text": "So many movies with the same name this year (I found 3) that the irony is they are only alone in name not in class/plot. Run of the mill. Don't expect too much and you will enjoy it. A generous 6."}, {"id": 94, "text": "Good suspense and story of survival. The problem with cat and mouse plot is that the schtick ends up getting old pretty quick. There are no real surprises here. What u think will happen based on the plot summary or trailer is exactly what happens."}, {"id": 95, "text": "So, loved the film. Very intense and a really good portrayal of how I or anyone else would feel being stalked or kidnapped. The actors were amazing. HOWEVER! I live and work in Portland and... in the opening scenes of the film, its clear shes never spent a day there in her life. She starts in the Pearl (downtown), then shes heading towards the Pearl (DOWNTOWN) and suddenly shes on the St Johns Bridge, which again, really only would head BACK TO DOWNTOWN!!!!!! This girl is going in absolute circles, and for what? CINEMATOGRAPHY??? I beg to differ!........................Overall, very good film, I thoroughly enjoyed it."}, {"id": 96, "text": "This movie is shocking. Not just the plot and suspense. But how thoroughly Jules Willcox and Marc Menchaca make you believe they are for real the characters they play, Jessica and Man. You are glued to your seats the whole movie. This is the best suspense movie I have seen for many years. You will be rooting for Jules Willcox's sympathetic character, Jessica, who keeps her wits and gains strength all along as she adapts to her changing situations up to the final climax. Director John Hyams is brilliant in crafting this masterpiece from Mattias Olsson's screenplay."}, {"id": 97, "text": "The first 30 minutes I was bored and angry with hooooowwwww slowly she reacted.... good trailer but nothing further except the killer according to my option was good at his part. On the other hand the girl in the whole film made us laugh since all her actions were with delay and not real! I mean you are being chased, you run you do not stop and talk! Jesus!!!! For me totally a waste of time, just kept on watching just to see what the rest of people found so good.... still can't find it"}, {"id": 98, "text": "After seeing some of thr reviews i was reluctant at first to watch the movie. bit than i made up my mind and watched it one night. now the movie is very good. full of suspense and thrill. yes we have seen these all before but the way of their presentation was different. recommended to everyone"}, {"id": 99, "text": "This was a excellent and well done edge of your seat Thriller and if you're like me and you like to be scared then this one is for you. The only problem I had was where it left off with you guessing what happened but then I don't want to give anything away. Just find it out for yourself. Happy watching"}, {"id": 100, "text": "1) Starts out well but even with the initial set up, it's just too movie-ish (no matter where you go... this guy just keeps finding you even though he's not always right behind you? ; A good looking gal just packs up her stuff in a tiny U haul for a trip that'll take 4 days! A clear marker literally attached to her, with no protection). 2) Acting is solid, so is the cinematography. 3) The ending is a bit abrupt or rather half assed. 4) A bit disappointing that it's merely a remake."}, {"id": 101, "text": "The plot / subject isn't very new, I 'll give you that, but it is very well acted and executed. It's tense and gripping from start to finish. A must watch."}, {"id": 102, "text": "Very good. In the beginning a kind of poor, but the end is very good. Very good this thriller. Well done Keep in touch till the end"}, {"id": 103, "text": "I don't get it is why run away and bump into the killer again. It happened twice. For excitement, this movie really low. Can watch if u very free."}, {"id": 104, "text": "Okay, so this film starts out pretty decent. We are introduced to our main character and she's packing up to leave town early. She's lost her fiance/boyfriend (not sure) and for some reason leaves a day early after her parents said they'd help her move, because she doesn't want to talk to her mom. This is NEVER explored but let's fast forward to the meat of it.She's driving across the country and eventually runs into a car that stays playing games on the road. Long story short the guy driving the car stalks her (how? He just knew where she'd go and what stops she'd make?), captures her, keeps her in his basement and plans on molesting her and killing her. She escapes, he notices, she runs off, and dives in a river.From this point this guy might as well have a honing beacon planted on her because he knows EXACTLY where she is at all times (despite her floating who knows how far down the river, she gets rescued by a hunter who is driving her and he sets up a trap on some dirt road a ways down the river)... like WTF? And he's a psycho with a family... not like some mountain man expert.Basically this was the Terminator without ANY logical sense of how the Terminator knows where to go.The acting by the lead actress was pretty good and production quality was decent (hence the 2) but this movie was absolute drivel. Don't waste your time.This movie kind of set it up like a Rust Creek type movie (girl trying to survive) but the survival was barely even there, and it was COMPLETELY illogical how the 'Terminator' found the main character. Rust Creek did a film like this SO much better and showed how the guys could track the protagonist which made the film logical. This antagonist in this film just 'showed up' and 'did stuff'.Don't waste your time, 2/10, again check out Rust Creek. FAR better film (still kind of a C thriller, but how this has 6+ on IMDB is beyond me)."}, {"id": 105, "text": "This is a decent thriller, but as with so many similar films the victims keep making the most stupid decisions. There were so many opportunities to have avoided being captured and it made me want to shout at the screen. Then she just kept making so many idiotic choices that it became almost impossible to sympathise with her plight. In fact by the time she got into the psychos car AND TRIED TO MAKE A PHONECALL! I actually thought she probably deserved to die."}, {"id": 106, "text": "It's one thing to remake a movie, its another thing to completely mimic another movies screenplay and concept. This movie was almost entirely copied from #Alive!!! I don't see how directors get away with doing this, unless they pay other production companies for the rights or pay out royalties. So so sad!!! This movie was so boring and predictable after already seeing the screenplay before."}, {"id": 107, "text": "Looks like the final projecto of a Basic school movie endeavour. So much clichê and low-iq characters ir hurts. Gave up before the end"}, {"id": 108, "text": "If i could Id rate this movie a 0.... if you can sit down and watch this movie and then turn around and say it was a good movie youre sick.... this movie tries to make light of rape, suicide, kidnapping and murder... yes i understand its just a movie but theres no back story, theres literally no reason this should be a movie."}, {"id": 109, "text": "Absolute dross - its one of the worst movies I've seen in years. Go and watch paint dry for 1hr38mins rather than this..."}, {"id": 110, "text": "I have just wasted 1 hour and 40 minutes of my life watching this movie."}, {"id": 111, "text": "This movie is generic and as you and me know would have been better as male conspet but alas it never happened."}, {"id": 112, "text": "Think of a thriller movie in your head for a couple seconds. Girl gets followed, gets kidnapped, escapes and dukes it out with the kidnapper. Most maintstream piece of **** movie i have watched in 2020 so far. Literally a combo of EVERY OTHER HORROR movie in this category. Not a single original thought made throughout this movie and script. PLEASE DO NOT WATCH, IT IS A WASTE OF TIME!!!!"}, {"id": 113, "text": "It was ok but some of the decisions made by someone who is supposed to be kidnapped were a bit ridiculous. You get back in his car???? Comon people!"}, {"id": 114, "text": "Some parts will certainly keep your attention, but there really isn't much of a story here and as others have mentioned, there are some plot holes.It lacks character development, there is no explanation of the antagonist's motives nor is there a satisfactory explanation of why the woman is leaving or exactly what her plans are or where she is going.However, that being said, the movie will not disappoint those looking for sheer horror."}, {"id": 115, "text": "It's been done so many times but 'Alone' is a finely made film that delivers on the premise of an intense, heart-pounding thriller. John Hyams' direction is spot on, and so is the acting, cinematography, and production design. However, the runtime felt much longer with the slow pacing and dragged out scenes. Considering there's little substance to the story, there's way too much filler, and pretty much zero character development of the two leads."}, {"id": 116, "text": "A low budget film that should be seen by many of these little filmmakers who are out there doing garbage. When a film has few actors but they are of sufficient quality and there is a good camera work this can work. This is the case, not being extraordinary, it is watchable and decent, not having to endure actors who are not and badly executed scenes without taste. Beautiful landscapes with a simple story but well executed enough to leave the category of a class B horror movie. The rating I give is for the effort made, I repeat nothing spectacular but watchable."}, {"id": 117, "text": "Started off good. But got boring &amp; predictable. Just wait until it comes out on tv don't waste your money seeing this."}, {"id": 118, "text": "Why anyone in America today would NOT own a gun is beyond belief. Many times in this movie, she had an option to get a weapon, starting with when she escaped the cellar, kitchen knife or even cast iron frying pan, that I saw hanging up. Please everyone Don't make her mistakes if God forbid this situation arrives."}, {"id": 119, "text": "The premise is not very original: someone who's on a road trip for whatever reason, is followed, abducted and held prisoner by a maniac for whatever vile purpose and has to find a way to escape. We've seen it dozens of times. So it's important to make such a premise into an exciting, fresh and compelling movie and here this movie fails in my opinion. Sure, the mortal fear of main character Jessica is palpable, the villain is creepy and menacing and there's a lot of running and panting so the pace is reasonably high, especially in the second half.But the point is, that apart from the premise, nothing much else happens, no sudden scares, spectacular twists or gruesome happenings, it's all about someone caught, on the loose again, chased and then: one of the two wins, the end. Even in the details everything is, for a meant-to-be horrifying thriller, rather lackluster. The villain for instance doesn't do anything nasty to Jessica when he has locked her in (his motives stay totally in the dark anyhow!) and Jessica succeeds in escaping in an almost ludicrously easy way.Marc Menchaca as the villain hasn't much to act besides looking creepy and threatening, but the acting by Jules Willcox is fine and very convincing. It's just not enough to make this movie rise above average."}, {"id": 120, "text": "...that entertained me enough to rattle my nerves. I like watching survival movies so this one was right up my alley. Very good performances from both of the main actors that carried this film to a watchable event. I wasn't expecting much, but I was pleasantly surprised that I was enjoying this tense thriller. One of the better survival movies lately On Demand...worth the $6.99 rent for me. A decent 6 but 8 stars for the two actors."}, {"id": 121, "text": "Predictable. Boring. Tense scenes made by simply dragging the time out too long. Acting is ok and believeable. The type of movie you leave the room to go get a drink and couldn't be bothered to return or even wonder how it finished."}, {"id": 122, "text": "ALONE is a finely made film: the paranoid cinematography, languorous editing, and immersive sound design coalesce into an experience that is palpably nerve-racking at times, and the performances, albeit not especially outstanding, are perfectly believable. This film should satisfy you, more or less, as a riveting thriller, but it's doubtful that it'll stay with you long after the credits have rolled.The story is, well, very simple--a classic cat-and-mouse thriller pulled from Serial Killer Plotting 101. There's a freshness to how the main character behaves quite realistically within every situation. She never falls for what's obviously a trap like many cinematic idiots often do; there's a sense that she's always doing what we would probably have done in the same situation rather than simply what the screenwriter thinks would be interesting. While such believability is, unfortunately, rather rare in movies, there's also nothing very surprising about it. From beginning to end, everything is quite predictable.Unfortunately, whatever the film succeeds at in terms of behavioral realism, it fails at in terms of making the situations unfold naturally. The woods of the Pacific Northwest are quite massive, but the number of serendipitous run-ins in this story makes it seem like they're a couple of acres at most. The plot depends upon the characters always being within about fifty yards from each other, which is rather frustrating by the end.What was more frustrating for me, however, was how weak the characterization was. The film never succeeds at making the two characters anything other than superficial ciphers in a very cliched serial killer plot, however realistic their behaviors and the actors' performances might be. The screenplay hints at some possible thematic meanings that a very generous viewer could possibly mine--likening the abduction to grief; comparing the will to survive with suicidal depression; the hint that you never truly know what's going on in another person's mind, whether that's suicidal urges or serial killer urges--but in the end none of these interpretations really resonate.In the end, there's nothing to really recommend this film--nothing that really stands out--despite it being perfectly competent."}, {"id": 123, "text": "A recently widowed woman is trying to relocate and escape her old life, find herself being stalked on the road and kidnapped by a demented stranger, after she escapes her kidnapper and into the wilderness battling both nature and the chances of her recapture in a last attempt of survival.The movie is over all a mindless thriller, that doesn't stand out from the stalker/kidnapper sub-genre in anyway balanced paced at moments yet very dull and stretched at others due to the lack of a strong story to support it.The plot is basically revolves around a random woman who's being hunted by a random man! No presence of any back story to make us care for the lead character and her survival.With the number of wrong and stupid choices that every character do in this movie (the widow, the killer or even the guy haunting in the woods) along with the fact that this movie is 1 hour and 38 mins long and lacks an interesting dialogue, you'll find yourself forced to fast forward almost third of this movie in various parts just to escape the various awkward dialogue pauses that lasts for minutes during the endless chase scenes."}, {"id": 124, "text": "REVIEW - ALONENot another!YepWe have seen so many of these films recently where a female gets either kidnapped or chased by a nutter what could possibly make this stand out from all of the rest to make this your choice to watch?Well actually it was rather good with the suspense building nicely throughput the film, yes predictable in places and slow in others but what made this for me was 2 very simple things.1st, It's set in the real wild so rather than having an actor pretend to be in a forest in the middle of the sun shine this was actually filmed during one of the biggest rain storms so added that realistic element.2nd, as we see in so many films the complete back story of every character is told just rushing what could have been a great film, answering every question by the end of the film but this film doesn't, you don't know why he is doing what he is doing, you don't know his back story and you are only briefly told the main female characters back story which is relevant to what is happening in the film so this film could concentrate on the story without rushing or explaining everything, keeping you guessing as to his motive or not.So yes this does stand out from the other films of this genre and is one to see if you get the opportunity.Rating 7 out of 10"}, {"id": 125, "text": "This movie is for fans who really love edge of your seat suspense. Yes, the plot has been used before. Yes, the genre is an old one. Nothing new under the sun in any film. Hitch made at least two of his movies twice, and used the same theme of innocent man pursued by both the police and the bad guys multiple times.Yet when you add good production values, good writing, good direction, and good acting, even an old plot device becomes new and thoroughly entertaining. And that all rings true in this more than adequate suspense movie. It's doubtful that one could even count the number of films about an innocent woman confronted with acute danger. Yet the suspense here is so strong it all becomes rather new and exciting.Here, the woman is alone, with only her own wits, determination to survive, and some Hollywood luck to aid her. The only thing I found slightly distracting were the drone or helicopter shots taken from the sky. Since none of the characters are up in the sky to see these views, such camera work tends to mar the suspension of disbelief. Still, if you're a real suspense fan, you'll thoroughly enjoy this movie."}, {"id": 126, "text": "The directing by John Hyams was spot on, and the cinematography was excellent. Casting and performances were great, especially Jules Willcox. Even the score was fitting and not overbearing like most B-grade filmsHowever, the normally 98 min runtime felt much longer with the very slow pacing and long/dragged out scenes. Considering there was little substance to the story, there was way too much filler, and pretty much zero character development of the two leads.Much more could've been added to the story to have more suspense and intensity. Otherwise, this story has been told many times, and much better, and will be easily forgotten. As is, it should've been a short film.This is newb writer Mattias Olsson's fourth writing credit - 2 prior shorts, and Gone, a full length feature Swedish film. Oddly, this film is almost an exact remake of the Gone, even using a Jeep in both films.If it wasn't for this film's great performances, directing and cinematography, this would've been a flop, just like Gone. It's time Olsson expands his writing repertoire beyond Gone and this film. It's a generous 6/10 from me."}, {"id": 127, "text": "Alone Micro Review -Alone is masterful genre filmmaking harking back to the classic psychological thrillers of Spielberg's Duel (1971) and Kurt Russel's Breakdown (1997). With a 98 minute run time the film is self aware of what it is and fully succeeded in accomplishing that result. Alone is fantastic at rollercoasting the tension while presenting stunning cinematography and superb performances.While Alone features many creative takes on the genre there are two specific clishies that occur for the sake of progressing the story. These will be self-apparent but are very brief moments that understandably serve as story shortcuts given the budget. The film features a fight scene that is better chrographed than most studio films due to its proper editing and use of longer takes.Marc Menchaca as the disturbed antagonist is a standout. His body language oozes dred and tension. The choice of Menchaca to just be disturbed amplifies the tension in that you never know who you could actually bump into. Alone is a memorable film that walks the line of what genre needs to be but adds just enough new to feel fresh."}, {"id": 128, "text": "Usually when I don't know any of the cast for a film, and I've heard nothing about it before seeing it, the film doesn't turn out to be all that great. So for those reasons alone my hopes weren't particularly high for 'Alone'. Boy, was I wrong. This film was a blast from start to finish. I kept thinking to myself, there has to be a weak segment of this movie coming up - surely? Nope, it never came. This is a hidden gem of a film.I loved the lead character 'Jessica'. She was likeable, smart, never did dumb things, had great instincts and was easy to root for. A perfect lead for a horror/thriller film. Marc Menchaca as 'Man' was also brilliant in this film. He never overdid anything, but was extremely watchable when he was on screen. He and Jules Willcox are a large part of making this film as good as it is.This is also a very well directed film. A lot of the action sequences are perfectly filmed to create maximum suspense. I was on the edge of my seat from go to whoa in this one. The film finds a perfect balance between keeping the action going, and never making things unbelievable or far-fetched. I had a great time with 'Alone' and would highly recommend people check it out."}, {"id": 129, "text": "This was a movie that I was looking for a Featured Review over on Journey with a Cinephile: A Horror Movie Podcast and saw this was playing at the Gateway Film Center. I checked up a bit to confirm it was horror and from what I read, it fit the bill for me. Jaime and I decided to give this a viewing that night as well. The synopsis here is a recently widowed traveler is kidnapped by a cold blooded killer, only to escape into the wilderness where she is forced to battle against the elements as her pursuer closes in on her.To just build on what the synopsis is stating, we're following Jessica (Jules Willcox). She is packing up her life into a mini-trailer that she can tow with her car. There is the feeling that she is running from something and isn't until later we learn what that actually is. I did notice early on that she is wearing two rings around her neck, her engagement and wedding ring. Before moving on, it should be established this is taking place in Oregon.While on the road, she gets behind an SUV that is going slow. She tries to pass, but when she does it speeds up. There is a near-miss with a semi-truck. The driver then decides to tailgate Jessica, honking and flashing lights. This causes her to go more into a panic and she pulls off the side of the road, allowing them to pass.She calms down and later gets gas. Jessica finally calls her dad, which he is voiced by Shelly Lipkin. She reveals what she is doing and he is shocked. Things get a bit weird though while she is talking to him and she sees the SUV from the highway go by. Speaking that is a bit off the highway in a small town, this spooks her where she struggles to go to sleep that night.The next morning as she goes to hit the road, a man knocks on her window. He is Marc Menchaca and he is the driver of the SUV. He apologizes for what happened and although Jessica accepts it, she is weirded out by what is happening here. She takes off and continues her journey. Later, she comes to the same SUV blocking most of the road and the guy is in a sling. He asks her to help him push it off to the side of the road and give him a ride to the next gas station. She offers to help in other ways, but he is insistent. She finally drives off, leaving him.During all of this, Jessica keeps avoiding answering calls from her mother. She finally calls her back when she stops off at a rest area. This is cut short when the SUV pulls up. Jessica panics as the guy walks toward her vehicle. It gets tenser when a van stops, blocking her progress and she panics. He catches up and knocks on her window, stating that she almost hit him when he was going to the bathroom.It all culminates when she loses control. There's a flat on the U-Haul trailer and the SUV isn't far behind. The man gets out and attacks her, where she wakes up in the basement of a cabin. We get to learn more about this guy as Jessica does what we can to escape and survive.There's where I want to leave this recap of the movie. This is definitely an interesting film, but I will say, we are getting some tropes that we've seen quite a bit of. That's something that I'm not going to say ruins the movie though. To really get into this, Jessica is dealing with the death of her husband. It appears that she wants to start over so she just packs up and leaves for a fresh start. This is really the worst decision that she makes as it puts her on the path of the man who is after her.Now I state it that way, because what makes this scary for me is the fact that she does a lot of things right and it still goes wrong. The writer of Mattias Olsson and director John Hyams know the history of abductors like this. I noticed when we first met the man that he only had one arm. He does actually have, but one is in sling, much like what Ted Bundy would do. It is disarming toward people to see them hurt like they are and shows vulnerability. Despite this though, Jessica knows something is off. She doesn't help him or get out of her car when he stops on her on the highway. She flees immediately when he comes into the rest area. She even calls 911 when a van comes up on her very fast. I just love even though it scares me with the idea that she is making the right decisions, but no matter what she still gets put into a bad situation.For this movie, we really get two different types of movies meshed together. The first part is a road horror akin to a Duel or Joy Ride. I'd put it closer to the former in how it all starts with the man following her, but we get personality of our villain like in latter. It then changes into a lost in the woods to survive movie. This is why I say it is tropes we've seen before, but I do like the conventions that they're playing with.Much like you'd get in a slasher film, I like that we have a broken character of Jessica who needs to find her strength. This is something closer to a rape/revenge film, taking out the rape aspect. I do like seeing that. Jaime told me this is something that really scared her and made her uncomfortable, as this is a big fear for her. I do want to give credit to Willcox for her performance. To bring this full circle, she is broken when we meet her and through this survival, she has to find her strength. We know its there as she is moving to take back control of her life.I really do need to go over Menchaca and Anthony Heald, the other two actors we really get to see. Menchaca I don't think I've seen before. I like the idea that we're getting real aspects pulled from kidnappers and killers to make this character. It makes him feel clinched, but his performance in the role I think helps. His look is just creepy. Heald is an actor that I normally despise the character he plays, but his performance fits well. Here he is Robert, a hunter that Jessica encounters. I like how things play out and I will admit he frustrates me. I can't fault him though as the logic is there. Aside from these two, the rest are mostly just hearing their voice and they do well for what was needed.The last thing for me to go over would be effects of the movie. This is one where we don't get a lot, but what we do is really good. The bit of blood and the bruising on characters looks realistic. There's also a scene where a stick gets lodged in a foot. This made me cringe and squirm. If you can do that, you got me for sure. The cinematography though is amazing. They do some really long shots and takes where they play with focus to where you can see only the foreground or background. This is effective in building tension for sure in my opinion. This is probably my favorite aspect is how well it is used.Now with that said, this movie was one that just popped up on my radar and I'm glad that I got the chance to see it. The concepts aren't new, but I like that they combine a couple of types of films I enjoy and have two great performances to drive it. The movie is intense and really does a great job at building tension as well. Something I didn't really go over would be the soundtrack and how that helps to drive it as well. There aren't a lot in the way of effects, but it doesn't need them either. What we get are practical and work really well. The cinematography is also amazing in my opinion. For this, I'd rate it as an above average movie, just bordering on good and one that I would definitely revisit to see how it holds up.My Rating: 7.5 out of 10"}, {"id": 130, "text": "Starting my first wide release of the summer in a theater with Russell Crowe's bad boy in Unhinged menacing a single female in her car, I thought I had my mindless thrill about road rage. No, I found one even more thrilling and more mindful: Alone.This action thriller has all the tropes a genre buff could hope for, only more. Not only is Jessica (Jules Wilcox) pursued by car by at first a nice but strange Man (Mark Menchaca), who in not nice at all it turns out. He ends up pursuing Jess by car and then foot in a forest of the Pacific Northwest in an unexpected conclusion with a twist new to the genre.In both films, the heroines are smart, tough, but still believably endangered by bigger and ruthless males. In both cases the smart phone promises to make the heroines smarter than the men. Alone should satisfy feminists who like their women to be survivors, but not easily so.In both films the women are single, with Jess having lost her husband to suicide, a point the villain plays on to Hannibal Lecter effect.That reminds me: A victim along the way is played by Anthony Heald, who played the hospital head in The Silence of the Lambs (as I write about psychos like Hannibal).Alone is not so much bloody or jump-scarish as it is about survival in a jungle of wackos like the Man. Although the photography is sublime (nothing photographs as lush and dense as the Northwest), the real action is seeing a gender we used to think vulnerable to men now going nose to nose and doing males better by thinking better.Now muscular can be applied to a thriller with an intelligent, attractive woman heading the film. It's still best not to give in to road rage. It will come back at you."}, {"id": 131, "text": "A tense, fast-paced serial killer story that stuck to the basics and succeeded as an entertaining movie. The plot was simple, the dialogue basic, and the acting realistic- all of which made the movie more convincing. There was no need to rely on jump scares, overt gore, or a hyper-active plot. Just the meat and potatoes of what makes a serial killer film successful.Bonus points for the cinematography giving the movie a gritty nature vibe. I felt like I could feel the sharp branches, river, mud, rain, cold, etc. that the protagonist experienced.We all have seen these types of movies before, but what makes this one higher quality is it was simple without trying too hard to stand out.Highly Recommend [7/10]"}, {"id": 132, "text": "The movie was very close to be one of the best serial killer, cat-mouse thrillers. The story was good, the acting was really good from both the main characters,the location of Oregon, the West Coast wooded area was good, the picturization was great. The good things about the movie was not adhering to the cliche script, there are dozens of these kind of movies come and go almost every couple of weeks and almost 99% flop because of same treatment of damsel in distress cliche scenes when main character make one after the other stupid after stupid moves, scream, run naked through the wood and unnecessary gore, violence and sexually pervertness. This movie didn't even go that route which was the positive thing and probably the only positive thing which is the reason I gave 5 stars and I could end up giving 7 stars easily if it's not for the following negative points. There was hardly any character development. Whether its West Coast, East Coast Canadian wooded and forest areas, it's really, really difficult to locate anyone so quickly in thick woods. But, in this movie, the serial killer was always within a few yards from the victim at any given instance, it was almost like he inserted the GPS chip and following her with GPS device, at one stage I thought when he knocked out the main character, he might have put a gps locator inside, or at least they should have showed that to make it more practical the way he was keep locating her, even after 7-8 hours. At one instance, she passed out for the entire night and next morning he was just there? It's almost frustrating and all the real things about movie been varnished with this unrealistic within yards chased. The second most negative thing about the movie was the motive of a serial killer. Majority serial killers catch their prey for sexual gratification, or make them feel powerful. When the serial killer kidnapped her, he didn't abuse her sexually or physically, also the holding chamber didn't show any past victims were there or any other evidence. Overall, the movie was one time watch, but it could be a really good movie if it's not for above items."}], "reviews_amount": 133}