{"name": "The Silencing", "titleId": "tt07149730", "reviews": [{"id": 0, "text": "I am generous with a 9 cos i enjoyed this movie. Simple, aint no wannabe critic. It is rare to find good thrillers n horror films nowadays. This movie has ample amount of tension n suspense. It started without wasting any time n at the same time it delivered developed characters n background stories. The twist came as a surprise. The plot may remind viewers of Nic Cage's Frozen, Renner's Wind River n Most Dangerous Game. The story is about an alcoholic ex hunter who has become an animal savior n lives secluded in a sanctuary named aft his daughter who has been missing since five years. The arrival of a new sheriff brings some hope in the method of investigation but things get ugly aft a discovery of a female teen's dead body pointing to a killer who is hunting teens for sport."}, {"id": 1, "text": "You can definitely tell the writer and the director were heavily influenced from the True detective series for this particular film which is a good thing imo. The visual style, thematics, and plotting aspects are executed in similar fashion as the show. The overall story is relatively run of the mill as far as the murder mystery, and seeking revenge in tracking down the killer. Still it stays interesting enough and never gets too stale with enough intensity and suspense to keep attention. The actors are all decent and keep a level of intrigue throughout. Also some very well done cinematography and fantastic scenery/settings. There are some moments that seem a tad cliché like a big reveal towards the end, but overall it does what it needs to as a basic thriller."}, {"id": 2, "text": "Decent directing, excellent cinematography, but the writing needed more oomph and a more cohesive plot with less plot holes and technical issues. A good watch, but nothing spectacular. Would've been better as a short film, as the 93 min runtime with the slow pacing made this film feel much longer."}, {"id": 3, "text": "The reviews here are being far too kind. Whilst it has an interesting premise the film just bungles along and has far too many plot holes and characters making absurd choices.The writing is pretty bad and annabelle Wallis' performance is seriously phoned in and at times - just bad. The reveal of the killer is a serious let down and the motive is just not believable at all.The scenery is nice but the cinematography is very uninspired and very low budget looking. Give this one a miss."}, {"id": 4, "text": "This is definitely worth a watch. I'm a very picky viewer and if a film doesn't grab me in the first 10 minutes then I'll quickly turn it off. I'm happy to report this kept be interested for the full (nearly) 90 minute run time, which is the perfect length for a picture like this IMHO.Jaime Lannister once again did not disappoint. I thoroughly enjoyed Shot Caller so I figured I'd give this a try as well and I'm glad I did. A couple decent plot twists along with good performances from all actors and a decent script held this picture together quite well.Its far from Oscar worthy, but its also slightly above straight DVD, $1 store trash bin. Just a decent little thriller that should hold your attention for 90+ minutes. I recommend it."}, {"id": 5, "text": "So yeah the movie is actually pretty engaging and its backed with an amazing backdrop and a solid performance from Nikolaj . However this movie is far from being unforgettable as it is let down by a cliched climax. The last 15-20 mins of the movie makes its feel like its just an another serial killer movie .. The movie lacked originality that at some point it had to resort to the way a serial killer movie would usually go. People who are fond of this genre could enjoy watching this movie without any expectation once .."}, {"id": 6, "text": "On your CCTV, you see a walking pile of grass chasing a barefoot girl through the woods right after another girl's dead body has been found. Do you call the police? Why, nooooo! You grab your rifle and don your red jacket and take off after him all by your lonesome. If I didn't pay $1.98 to rent it from Redbox, I'd stop watching now. Redbox needs to give refunds if you can't get past 30 minutes.An hour later: I just finished watching it. All who gave it high ratings....you either worked on the movie or you were paid. At any rate, you owe me for listening to you in the first place. That has to be one of the worst movies I've ever seen. How the financiers were convinced to part with a dime to make it is beyond me."}, {"id": 7, "text": "Solid 6 star film. Not great not terrible. Dragged a little here and there but was still watchable."}, {"id": 8, "text": "There were so many plot conveniences, unmotivated actions, plain stupid decisions, and even a few blatantly impossible inconsistencies, and unfortunately Nikolaj Coster-Waldau's (admittedly decent) performance can't save it. I was also very disappointed in Annabelle Wallis's performance, as I really liked her in Peaky Blinders. She somehow manages to sound bored while holding a killer at gunpoint. The film's only other saving grace is the gorgeous scenery."}, {"id": 9, "text": "Nice movie. Well performed, filmed and directed. Writing needs more depth on some characters and less in others. Too much expectation created around the main guy beeing a great hunter for nothing, and the woman being sheriff just to shoot a civilian without any consecuence at all. Uhmmmm...besides that is entertainig. The constant drinking didnt added that much either because it was missused."}, {"id": 10, "text": "Absolutely ridiculous.Bad. Bad. Bad.-spoilers alert- So a sherif shoots a civilian to cover up the assassin after reducing him, because she thinks the assassin is her brother. And even she tells him go and then chase the civilian (probably to kill him and leave no witnesses), and no one NO ONE detains the Sheriff... and she even continues running with a badge and a gun, after the civilian escaped and produced a witness statement while showing up wounded, explaining what has happened to the other officer, who already had doubts about the brother of the sheriff? And life continues back to normal...?Only in stupid Fantasy land and in this movie..."}, {"id": 11, "text": "Solid performance from NCW, Annebele was sub-par performance, the script is horrible. All the build ups were not nothing, the motive of of the killler is laughable. The title silencing, what's the point? Well, they should silence whoever wrote this. One major downturn of the movie was when the Sheriff thought the suspect was her brother by guessing the guesture he made, without making sure, she shot the guy who caught him. That's one dirty cop! Better yet, she later found out opps it's not her brother and she vowed to catch the killer in front of the seriously injured girl. After all these, the writer would think the audiences are still into the movie? Do yourselves a favour, save the 90 mins of your life."}, {"id": 12, "text": "A bland and uninspiring script that relies on tired tropes over creativity. Disjointed and poorly execute."}, {"id": 13, "text": "I love murder mysteries, movies that dont give away the plot to early. So this one was actually good i didnt figure it out to close to the end. The acting was 6/10 and the plot and writing was also a 6/10 thats why i gave it a 6/10 rating. I find that when a story has good character building and it really gives you good background into why things happen in the story.but it wasnt developed enough for me the Sheriff played Alice Gustafson, and the male lead Nikolaj Coster-Waldau as Rayburn Swanson did a great job. Id recommend it for a good watch nothing more then that"}, {"id": 14, "text": "It could be a pretty good film. Acting of Nikolaj Coster-Waldau, the background were pretty good. But... Sehriff ruined it all as a character. Boring, sexist, lack of moral.Such an irritating character. Then we've got a dull plot, which would have been more acceptable if it had included some others storylines. I mean i do not feel anything to the majority of cheracters, which had everything to get at least a small story behind them. Like why someone is drug addicted, what fell parents of kidnapped girls and so on... Rayburn Swanson was told to be always drunk, but we never see it. It appears only as a fact with no circumstances. There is not much to say, just an usual film with some modern tendensions. But it has nothing inside and doesn't make feel anything."}, {"id": 15, "text": "Really good! Lots of tension and twists. Exactly what I'm looking for in movies now: No more of the same. A movie that I'll probably gonna watch again!"}, {"id": 16, "text": "Slow and lugubrious like a funeral procession with a by the numbers script we have all seen before - Nothing new to see here, quite a tedious &amp; depressing sub par thriller if you can even call it that."}, {"id": 17, "text": "A clone of a better movie really, Wind River is a much more interesting and better paced watch."}, {"id": 18, "text": "The sheriff shoots you in order to protect who she thought foolishly was her brother the news gets out but still nothing happens to her and suddenly she and Nikolai weirdly becomes partners trying to find the real killer !this movie is so unrealistic and boring the same time just beneath garbage"}, {"id": 19, "text": "It has its moments, but in the end falls short. Acting is good, but the story is jumbled and drags."}, {"id": 20, "text": "Decent acting and the movie did a decent job of building tension. It did have a few plot holes and police procedural goofs but overall it's a good watch."}, {"id": 21, "text": "You would figure that in this day and age movies would need something more to be approved. A true story, or based on true events, unjust conviction, innocent and found guilty. I mean there are thousands of real stories out there that are interesting, thoughtful and memorable.Why spend money, time and effort and make an average film that probably barely break even, especially in a time where the biggest bang for your buck, the theaters, are shut down?I always hope hollywood will get better at making films but they never seem to do."}, {"id": 22, "text": "A little slow start, but then turns into an edge of your seat thriller."}, {"id": 23, "text": "There was so much back-and-forth and around and around that I got impatient. It was too many suspects in the movie. Once the killer was revealed, I had three big questions: really?? huh?? And what?! The person that was the killer didn't make any sense. When you watch this movie you'll know what I mean. What saved this movie was the acting. I would say, watch this movie on a day when there is nothing else available to watch."}, {"id": 24, "text": "Interesting setting, with okay cast. Just needed a little improvement in writing."}, {"id": 25, "text": "Good acting all around, good pacing, good setting, okay story. It's good enough to get a 7. I add another star for Coster-Waldau. He's a broken alcoholic a-hole, but he's carried the character with just enough to make me like him. And that's a big plus considering so many writers and directors these days don't know the importance of a likeable main protagonist. I left so many new series after a few episodes exactly because of that. Some movies suffer the same problem as well. This one doesn't."}, {"id": 26, "text": "The biggest unanswered question in the movie was why the killer was actually hunting and killing the girls? The film answers why the lead males character daughter was murdered, in a vague way but never explains the gilly suit or ancient Greek weapon...?There is also a potentially HUGE plot twist in the middle of the movie but sadly the movie reverts and virtually ignores the twist, it's not a good plot twist but it's one you won't see coming, mainly because it makes no sense. Which sums up this movie really, a lot of it makes no real sense.Is it worth watching? Sure, but it will leave you disappointed.Ultimately it's a shame as it probably could have been a great movie, it has a short runtime of only an hour and a half,perhaps if it had an extra half hour it would have been a more fulfilling movie and answered all those unanswered questions."}, {"id": 27, "text": "Its not a mastermind plot, but it dont have to be. In fact the main plot is obvious 30 minutes into the movie. The pace is okay, I am sure that some would call it slow. But I liked it."}, {"id": 28, "text": "Predictable plot but enjoyable for an easy Sunday The reason I have only rated 4 stars is because the sheriff Is the less credible and annoying character ever I think instead of spending money on plastic surgery, she should give herself an acting class"}, {"id": 29, "text": "Although the last twenty minutes of the movie is somewhat too predictable, overall this is a decent crime thriller. I would have preferred we be given more background details, especially concerning what happened before the beginning scenes of the movie.But there's a very good cast here, and there's enough mystery and suspense to keep the viewer's interest."}, {"id": 30, "text": "Everything is nice except it's a tad bit slow at times, lacks much action.... the movie on the whole is nice and definitely worth a watch on a lazy Weekend."}, {"id": 31, "text": "This movie truly sucked. Tried to get in to it, but decided to take a nap. Time better well spent."}, {"id": 32, "text": "I gotta admit, this was a solid film. A watchable serial killer film with a couple of nonsensical scenes but overall consistent to the end. I do enjoy that the killer was not revealed unto the very end, and that's a good sign of someone putting in the time of writing a somewhat coherent story. For me it was a one time kept my attention the whole time watch but not to be watched ever again film."}, {"id": 33, "text": "Was pretty cool to see all the shots of the Northern Ontarian city that I grew up in. Seems like Scuzzy Sudz is getting famous :)"}, {"id": 34, "text": "I dont write many reviews but felt this one is way better than the reviews, it kept me entertained right through"}, {"id": 35, "text": "I hated this movie for being too unclear and negative. The dominant emotion is anger. And leaves us with too many questions unanswered. For example who is that girl on the picture with the culprit (could she be main actor's daughter and still alive), did they find all the bodies especially of main actor's child, why policewoman (sheriff) acted too inapropriately (unreasonably) (even if that is her son, is is still too extreme and unreasonable), why would someone perform surgery on kidnapped children if that is just to save them from drunk parents, what is really wrong with sheriff's kid and what crime has he done and is doing. But good is the environment, look, and bit experienced actors. I liked seeing scary envirnments, different jurisdictions, weapons, car tracking mystery, and that sheriff's son who looks so so so bad, pure evil"}, {"id": 36, "text": "We have seen this kind of movie alot! But it works every time with me on different levels because the filmmakers have to put their touch on it to make it little bit different, it's not the greatest thing but it's good one, it's short very tense, scary, and dark also the movie have fantastic cinematography and great score. The cast are not that great unforchantly with thier performance and don't know why, is it the script, the direction or the time!."}, {"id": 37, "text": "As a character the sheriffe ruined the whole movie.. Don't watch it. I'm sure you will disappoint"}, {"id": 38, "text": "Its kinda low budget movie , but good quality performance , some decent direction except sometimes some scenes are way to dark. .the movie has some twists and suspense , but in the end. it really killed all the twist n suspense . -----------------spoilers----------------i really thought the end villain would be someone in start of the movie. but it was totally out of all characters in start which make the movie has stupid ending."}, {"id": 39, "text": "Story pace is good and thrilling till the end ! Yeah, the main cast is all the reason to watch.. Nikolaj Coster Waldau always delivers his best, get beat up so many times, that's quite an action there.. So it's pretty enjoyable watch, not boring..Although there's some parts that can improve.."}, {"id": 40, "text": "I like the mystery, story-wise, albeit seems like a copy of other films; and the twist too. The cinematography is pretty darn good. Nikolaj Coster-Waldau delivers such good performance among other okay-casts. Overall, this film is good but there is still room for improvement. It's not that wow but it's watchable."}, {"id": 41, "text": "I find it pretty intense, suspenseful and engaging. I think Rayburn is captivating because of his past, and his unique role in the search for the killer. I enjoyed watching it."}, {"id": 42, "text": "This movie is so baseless, if you're one of those who entertain themselves by watching literally anything, than I only recommend you to check this out too, lol"}, {"id": 43, "text": "Great acting, mediocre plot. i saw the twist coming from like 1/4 way into the movie...ending would've been better if the killer didn't have a motive instead of the weak one we got. could've done without the red herring side plot that was simple but somehow also confusing in the manner it was presented. a few continuity errors that bothered me like why Rayburn was putting up missing posters stating that his daughter was 14...when she would now be 19 if she disappeared 5 years ago. also the midway reveal/twist would've made sense if the killer was also shown doing the same thing with their hands some other point in the movie...which would explain the confusion, but no. also the sheriff would be in jail for pulling the stunt that she did. lol"}, {"id": 44, "text": "First of all comparing this to Wind River is not a useful critique. Wind River addresses the high rate at which Indigenous Women in North America/Canada go missing around exploratory mining sites.This movie was a look at individuals who are flawed and who eek out their own idea of justice, to exact revenge or protect others. It's not a box office hit but it is underrated.After 20 mins I forgot all about Jamie Lannister and Grace Shelby.I recommend watching, if you enjoy story telling and can put away preconceptions."}, {"id": 45, "text": "She was hunted. Uh-oh. That can't be good. Hunting is for other stuff which I don't condone, like killing a wild animal for sport or misbehaving like those dudes in 1994's Surviving the Game.Anyway, 2020's The Silencing is my latest review. And yeah, I'm not quite sure what the title of this movie actually entails. I mean there's no silencers involved and well, people get loud and angry. Oh I forgot, there's a scene where a muted persona willingly writes her name in the dirt.Released in July of this year, filmed in the dark-clouded wilderness of Canada, and featuring an ending that does a 180 just for kicks and giggles, Silencing is helmed by second-time director Robin Pront. Pront divvying a twist or two with a few whip pans, thinks he's channeling his inner Jonathan Demme. In reality, he's just well, channeling.Starring an almost unrecognizable Nikolaj Coster Waldau (in looks and in accent), glorifying spears as murder weapons, and distributed by the busy bee organization that is Saban Films, The Silencing has its characters getting stabbed and shot yet miraculously recovering as they walk around unscathed. I mean it makes sense while being senseless. Otherwise the flick might cease to continue.So yeah, Silencing kept me involved for at least some of its 90-minute running time. Still, it's over-familiar with stuff like Wind River, Blood and Money, Cold Blood, and 2019's Daughter of the Wolf already making the rounds.The Silencing is about a wildlife sanctuary owner who tries to track a killer bent on preying on young girls. Said owner is an alcoholic, he's got a closed-off personality, and he takes the law into his own hands without so much as a mild indictment. As an avid movie watcher, it's been there and done that for me. Tranquilly mixed results."}, {"id": 46, "text": "Wanted to watch this film because as a GoT fan I like watching anything with Nikolaj in.Enjoyed it. Made me wanna drink whisky! Glad the dog wasn't hurt.Few twists and turns and he got his closure in the end. Probably only watch it once."}, {"id": 47, "text": "I watched this twice and enjoyed it about 70 percent of the time. The film kept my attention. The story held my curiosity. The scenery is gorgeous. The acting is solid from the lead to many of the supporting characters. My sole reservation was the one outlandish costume that appeared, disappeared and re-appeared without any continuity or explanation. There must have been a more convincing way to conceal the identity of the bad guy(s)."}, {"id": 48, "text": "Engaging crime thriller but a bit dark and one critical plot twist made no sense at all. It's a shame screenwriters don't ask themselves more often whether what they're doing in a movie meets the common sense test. The lead acting was good, however."}, {"id": 49, "text": "Very different and capturing story superb acting and great movie after a lo0ong time... WoW..."}, {"id": 50, "text": "The Silencing is a crime thriller set in Ontario, Canada, in a large nature reserve.Nicolaj Coster-Waldou is one of the main characters, and he manages to play a father who has lost his daughter, and his alcoholic portrait is a recognizable portrait in the way that one feels his loneliness, and his torment.The nature reserve is a really good scene for the intense thriller scenes where man chases man.Besides Nikolaj Coster-Waldou, the remaining actors do not have much to do in the film.Moreover, the plot is also pushed forward by slightly strange paths. This is especially true after the red herring is redeemed.All in all, a little movie that has emerged out of the blue, with an interesting plot that is unfortunately brought out by a red herring through the 2nd act, and some strange plot creations, and a serial killer that is extremely creepy, but whose motives are never properly explained."}, {"id": 51, "text": "Keep your expectations low with this one and you'll be fine. First, the setting, scenarios and cinematography are the best of this movie. Second, the script even pretty predictable and simple, has a few good twists. Last, acting from the main character is the best one. On the other hand, a lot of plot holes from the script make this movie a little messy and empty. So, overall just an entertaining movie. Watchable but far from great."}, {"id": 52, "text": "Brilliant movie. Excellent plot and acting. A must watch"}, {"id": 53, "text": "I don't know why it has such a low rating. I like it. Kept me on my toes from start to the end ;)"}, {"id": 54, "text": "I gave it a 10 star because I don't remember last time I was actually engaged in a movie before this one. It was a great thriller for a change, not too slow paced or boring. Great acting and story."}, {"id": 55, "text": "Excellent movie, too much people who believes themselves like film critic and they don't know anything!"}, {"id": 56, "text": "Definitely worth the watch Ang couldn't have got better actors to play the parts, One off the better films I've seen in 2020"}, {"id": 57, "text": "Glad to see Nikolaj Coster-Waldau is back. His acting is quite good in this film as well as the whole feel of this film. Good thriller with great plot twist. I didn't see the ending coming. The only con I can say is that the movie never reveals the story behind why the incisions in the victims. Don't worry, not giving away anything since its one of the first things we are presented with.I want to see more Jamie Lannister on screen. Make it happen!"}, {"id": 58, "text": "Nicholas is always a good watch. That being said, this movie had potential but there are some big holes. They really lost me when the sheriff shot Nickolai to cover for her brother, nearly killing him with a shotgun and she was able to function around town as normal. To add insult to injury, he decided to let it slide and liked to protect the sheriff. Really? Here's a big hole - the serial killer who is the town doc gone crazy after his daughter was hit by a drunk driver and, is killing girls with arrows with his initials on them. Cmon!! And there is no good connection as to why his dead daughter has caused him to kill other girls? The movie was entertaining, aside from the above and another dark and dreary small town depressing watch.....but it does hold your interest. A few tweaks and this could have been much better. The stars are for Nickolai mostly."}, {"id": 59, "text": "The plot built on nicely till about the middle and then it didn't, it just became senseless and then cliched. Nikolaj is the only redeeming feature of this thing. Surprisingly it is not a boring watch but rather a disappointing one."}, {"id": 60, "text": "I just wanted to point out that this little detective, thriller, action movie is a lot better than some negative reviews are saying about it. The movie has a script and a story that stick together, a plot that we follow until the end, finally a movie without making it the movie of the year, of course is in the end very good and you will have an excellent moment of cinema, especially when you see the bad movies of the moment. The performers play well, in the end a good little thriller."}, {"id": 61, "text": "Because this movie doesn't hold up. The acting reaches sub par at times but is otherwise shallow and pedantic throughout. I stand by that. Uninspiring script and just plain blah all around.Don't waste your time. It sucks."}, {"id": 62, "text": "Most Hollywood movies tend to follow a linear path with a generic ending, however this ending was very satisfying and unpredictable. I found this movie pretty entertaining, the directing and music score really excellent. As some others stated the blonde sheriff lets it down a little, but it didn't matter the acting from the others and the suspense made up for it. A movie that will make you watch until the very end."}, {"id": 63, "text": "It was okay. Nothing more nothing less. There were a few story lines that seem to be abandoned, however it did keep me watching to the end."}, {"id": 64, "text": "Good storytelling and satisfying ending , enjoyed every minute."}, {"id": 65, "text": "Full of plotholes and facepalm moments. Acting is fine but the storyline is so shallow and often makes no sense. The lack of sense each character shows makes this film more aggravating than anything else"}, {"id": 66, "text": "This movie was something else. If you believe that alcohol abuse or drug abuse only affects you, you are mistaken. Our actions create a ripple in space and time that can not be determined or measured. I found this film to be outstanding. I would recommend it to anyone, especially parents."}, {"id": 67, "text": "A very good movie both well written and well acted. It will keep you on the edge of your seat from start to finish as well as keeping you guessing."}, {"id": 68, "text": "Kept you guessing all through the movie. Rotten Tomatoes must not have watched this movie."}, {"id": 69, "text": "Rayburn's (Nikolaj Coster-Waldau ) daughter went missing 5 years ago, but not his taste for hard drink. When it is discovered teenage girls are being hunted, Rayburn wants to find the killer as much as Alice (Annabelle Wallis), the newly elected sheriff. Her brother has issues and becomes an early suspect. Victims have their vocal cords cut so we can have a title to the film. They are hunted ancient school with an atlatl.This is a mystery without a lot of characters. Alice was the interesting character, a newly elected sheriff who wants to protect her brother who has brushes with the law. This leads to an interesting unexpected scene later in the film.Guide: F-word. No sex or nudity."}, {"id": 70, "text": "I had my doubts several times during the movie, but this one is quite alright and keeps you at your seat till the end."}, {"id": 71, "text": "Someone compared Wind river with this one. CMON. This movie is beast comparing to Wind river. Do not listen to others, do not look for movie with good imdb rating since this imdb ratings are such a disasterr. I highly recommend this movie, You will enjoy this one for sure!!!"}, {"id": 72, "text": "Liked this movie with the exception of the sheriff character. Willing to shoot and kill for her brother but, when it comes to the actual serial killer she wants him to go to jail. I don't know she bugged me from the time she shot Rayburn. Her driving around as law enforcement like no big deal from that point on just didn't feel like it fit or would ever happen. Other than that this is a good film."}, {"id": 73, "text": "This film start with a female dead body floating along the river, and a man Rayburn stop two men for hunting in the wildlife sanctuary scene! As turnout, this film is to find out who is the mastermind of the killing of a series of young girls, including the daughter of Rayburn! The mastermind actually is Dr. Boone! Entire film full of boring conversation, and overuse scene! Such as, overuse of the driving scene, overuse of the aerial river scene, overuse of the searching things scene, and overuse of the watching surveillance video footage scene! Make the film unwatchable! All the action scene have blood at certain point, but overall portray by sideways! Not intense at all! Barely intense scene is, Rayburn fighting with Dr. Boone in the kitchen! At the end, Rayburn push Dr. Boone inside the animal trap, and let him rot in there! That's it! Wasting time to watch!"}, {"id": 74, "text": "What a waste of time! It makes no sense whatsoever. Avoid at all cost. It is a badly written incoherent cliche ridden mess. It doesn't even deserve the time I am wasting writing this and you reading it."}, {"id": 75, "text": "Not a new concept but nothing is these days, never really expected much from this but i was pleasantly surprised. Goes a long at a decent pace and is well worth a watch."}, {"id": 76, "text": "I love Nikolaj, besides his Jamie Lannister role he has done a couple other great movies. He's a very honest actor, very enjoyable to watch and really absorbs his roles. But this movie, whoa, what a clunker. There are big plot elements that are never explained (the girls throats), just laughable circumstances and developments, bad (or no) acting by the female lead with unexplainable things going on with her, and a TOTAL let down with the big reveal of the mystery killer. I really wanted to enjoy this but there's just no way."}, {"id": 77, "text": "Former Game of Thrones star, can't seem to fond his mark. Could have been so much better, acting, sound,script,continuity, Since i am a Canadian , i can usually spot a Canadian made flick. This low budget, Canadian actors..............always seems amateur , never professional. When you look at what Australia puts out , the quality and production way way above this . Canada just seem to suck , because they always use Canadian production team"}, {"id": 78, "text": "See, there is no need to review this movie with much talk because it is a very bad movie, no beautiful production, no impressive performance, no strong script scenario. Very very bad. Oh, Lord, help me, this movie is only for sale. And anyone will see it good for you."}, {"id": 79, "text": "Nikolaj, Canadian Woods, and Murdered Girls. You have a movie. Blame a bottle of RedWing for the death of a daughter. Throw in a sweet dog, some cameras in the woods, and a bizarro Doctor. Disjointed and lacking a plot.The title is never explained."}, {"id": 80, "text": "This move is disappointing--to say the list. Hackneyed script, the revelation of the serial killer in the finale was absurd -- didn't make much sense."}, {"id": 81, "text": "Good leson! nice story! ... but why was the girls have that scar on neck? purpose?"}, {"id": 82, "text": "It was going good untill the last twenty minutes.The way the lady cop finds about the killer is too abrupt. Also the motive behind the killings is not at all satisfactory. But its worth a watch, Jamie Lanister being one solid reason"}, {"id": 83, "text": "The Silencing is a solid film, despite not having considerable dialogue or delving very deep.Nikolaj Coster-Waldau's certainly one of the Game of Thrones cast members capable of carrying a film. It's a little far-fetched though, someone doesn't just become a monster overnight, that and happening to see something on the cameras and happening to be in the doctor's office and being able to get there so quick. There's a missed opportunity to take it up a notch, after the minor twist, but unfortunately it's just put to the side."}, {"id": 84, "text": "Not that my level of Crime Mystery film, not enjoyed much. Just complete it for Game of Thrones hero sake."}, {"id": 85, "text": "First, it was watchable. Made it all the way through w/o the usual fast-forwards. BUT - sloppy directing, really bad editing, and stone-faced acting. The premise and area shooting carried it for me. Nice and misty murky feel, but as others have noted, the characters did not seem to make real-life decisions, and most were just too stoic (read: what do I do with that line?). The twist at the end, in my opinion, wasn't realistic, and certainly the killer would have been caught long before in real life. Nevertheless, suspenseful and spooky enough to watch it through."}, {"id": 86, "text": "Hero Fiennes-Tiffin's acting is amazing! It is very interesting and I would reccomend!"}, {"id": 87, "text": "Good names bad movie. Nothing worth keeping you watching it.. I t was a disappointment."}, {"id": 88, "text": "Brilliant film, brilliant acting, brilliant story line. Watched this after the disappointing Tenet and it restored my faith in Hollywood again. Give Tenet a miss and watch this instead. You will not be disappointed"}, {"id": 89, "text": "This movie made no sense. The writing was really, really bad. The plot was nonsensical, the acting was poor. Everything about this movie sucks.It's also obvious that this is written by a european. Movies written by europeans but set in America are always cringe, because the europeans simply do not undestand North American culture, and it is always obvious that the movie is written by someone who has never been to north america, let alone lived there. This movie is almost as bad as that awful Three Billboards movie. Why do people on the left enjoy creating their own villains and narratives to support their political beliefs? You can't find anything to support your ideas in the real world, so you write fictional stories in which you get to be right, and make everyone who disagrees with you look mean and evil."}, {"id": 90, "text": "A nice thriller with suspense. Not a revolutionary one but a must see... once"}, {"id": 91, "text": "Features stars from game if thrones, Fargo and peaky blinders. Enjoyed the story, the cinematography was very good and the acting was above average. It's not an oscar winner but it's a definite excellent thriller. Will watch it again."}, {"id": 92, "text": "I always go by the lowest reviews.But for some reason this one is better than the average 6 is has so far ( 2020)It's well acted &amp; gripping till the end. Yes it has an end , so that's a plus in itself these days. You're never quite sure who the murderer is till near the ending even though you'd probably guess who it wasn't.The characters are down to earth &amp; I don't think there are many plot holes.Definitely worth a watch IMO ( not what I usually say)"}, {"id": 93, "text": "As a crime thriller fan, The Silencing is off to a good start with the setting of small old town, damp and dark. Anabelle Wallis as the new town sheriff gives an okay performance. I feel her character needed more depth as the lead of the movie. Nikolaj Coster-Waldau Costas as a reformed hunter as Rayburn Swanson searching for his missing daughter. His hope in searching for his daughter is constant and persistent. A surprising performance from Hero Fiennes Tiffin as Brooks Gustaffson which his troubled and abused chararcter has me cracking my knuckles rooting him as an obvious killer candidate. Of course the twist needs to be the less obvious town doctor."}, {"id": 94, "text": "It's got the flavor of a modern western. Came out super excellent since it doesn't have the biggest budget in the world, none of that artys fartsy garbage winning at the film festivals."}, {"id": 95, "text": "The story is not so bad, although far from great either. I think the strong parts of this movie are the cinematography and the mood it creates. The acting is also good, well above average (compared to all the trash that have come out in the past few months)."}, {"id": 96, "text": "Solid 6, not great, not horrible. I like the cast and the cinematography."}, {"id": 97, "text": "There is really nothing new here, however it is very well executed. Good directing, good acting, good atmosphere. On the other hand, meh plot and meh editing. The first half leaves you well connected. Slow paced yet interesting. The second half feels like the editor was getting tired and wanted to get it over with. The first twists are well presented but towards the end it gets pretty fast, thus uneplained and unrelatable. It wouldn't hurt to add another 15min to the film and develop those last scenes with more thrill. It would change the whole feeling in the afterwatch."}, {"id": 98, "text": "This dark drama had its moments. The acting was good, setting was great and the story was engaging. The ending falls a bit flat for me but it was still a decent film. Worth a watch."}, {"id": 99, "text": "Action packed, suspenseful with what I believe is a realistic and satisfying ending"}, {"id": 100, "text": "A solid and decent thriller - nothing new on the Western front one may be dared to quote. The cast and production is solid, the story good enough, and last but not least it is nice to watch Nikolaj Coster-Waldau again (he was the main reason why I gave The Silencing a try). Recommended if you liked Wind River (2017). Precise rate: 5.5"}, {"id": 101, "text": "Hooked me in, which is rare these days. Will watch again to see the things I missed. My husband loved it."}, {"id": 102, "text": "I'm sorry to say that I struggled to even give this 5 . Good acting , beautiful scenery and camera work were let down by a poor , predictable script . I thought I knew the culprit after the first body was found and couldn't believe that I would be right . I thought, given the RATINGS , that there is bound to be a twist but saddly not . I'm not sure if that qualifies as a SPOILER but I will ere on the side of caution and say YES . An enjoyable enough movie but SE7EN it is not"}, {"id": 103, "text": "Awesome movie. Had me guessing the entire time and still got it wrong. I love movies like this small budget thrillers and mysteries."}, {"id": 104, "text": "Nice ambience, good acting for the most part. Script needed work, especially as it tried to cover some plot holes with DCS (dramatically convenient stupidity). That was a disservice to the actors and the story. But reading that the original director was replaced might account for those lapses."}, {"id": 105, "text": "Not bad...not particularly spectacular ,very simple ,overused premise...good acting brings it up. Overall enjoyable one time watch."}, {"id": 106, "text": "Very watchable lower budget drama thriller movie, the writing is ok, the acting is good, and it was filmed very well. Has a few plot twists and turns that keeps you watching. Not a bad film at all. 6.5/10"}, {"id": 107, "text": "I actually liked it! It's raw and writing is questionable at times but what it does well it creating suspense. It keeps the audience at the edge of their seat and does not have any dead or boring moments, and does all that in a beautiful small-town mountain scenery of Canada. Although different it reminded me a little bit of one of the better part of Fargo episodes.I applaud the straight-up character buildup and presenting the human dilemmas quickly and efficiently. So, sure this movie is not perfect, it could use a better special effects and I wouldn't mind a stronger ending, but overall it is entertaining and the director and actors do an excellent good job of carrying the story. I would recommend it dearly if you like suspense and inspiring sceneries please give this movie a look. Exact score: 71 / 100"}, {"id": 108, "text": "Predictable poor writing Good photography and great scenery"}, {"id": 109, "text": "Solid acting from Nichola Coster-waldu. Slow pace. The big twist underwhelming. Overall it's a half baked movie."}, {"id": 110, "text": "Its a heart puller all right- Right from the beginning they want you to be sympathetic to one our main characters you know the guy from Game of thrones and yet his written so poorly loses his daughter almost saves a girl and than goes ahead and let her die as for the sheriff WTF"}, {"id": 111, "text": "Yes, I have said it. This was a good film but way to slow without fleshing out the characters enough to make this a great film. If this had been made into a series and they fleshed out the characters and the story line a bit more then this would have been excellent . When the film did get going it was really good but when it was slow I found it dragged a bit to much. I enjoyed it but would not watch it again."}, {"id": 112, "text": "The game of thrones fella did good, very enjoyable it's not a classic, but so what watch it"}, {"id": 113, "text": "Great acting and a great suspense! I would watch it again."}, {"id": 114, "text": "Better than average thriller drama movie. Strong acting and realistic in many ways. Also liked that it was exciting for most of the time.Recommand this for sure!"}, {"id": 115, "text": "I love murder mystery films and I love Nikolaj Coster-Waldau, so there was no way I wasn't going to enjoy this. The acting was very solid from all cast members, with Nikolaj being the biggest standout. I also enjoyed the backdrop and mood of the film quite a lot. Is it a perfect film? No. There are the typical poor decisions made by the characters that drive you crazy, as well as some (pretty big) plot holes. Character development could have been a bit stronger. I am also not quite sure I buy into the killer's motive. That said, I still liked it a lot and would recommend it to others that love mystery/suspense thrillers."}, {"id": 116, "text": "Promising cast, and slickly presented with an interesting enough premise, then Grammarly took over the script. I'm going to assume some Exec producer got involved in this and dumbed everything down cutting short story lines and character development for a Scooby Doo wrap up. We had a good chuckle spotting the dull as get out lines and figuring out the plot. There was an attempt to create multi layered characters however this just ended up a right 'ol mess with a resolution as old as bad tv movies. Shame, effort was made."}, {"id": 117, "text": "It's always interesting to see what the stars of big and beloved shows do after their characters leave (or when the show ends, sometimes in a manner that's anything but beloved... Yes, Benioff and Weiss), so a thriller with Nikolaj Coster-Waldau (Game of Thrones) and Annabelle Wallis (Peaky Blinders) was anticipated with intrigue. The setting and plot topped the cake off with a cherry. And so, The Silencing is quite the decent thriller - never reached the stars and pales considerably in front of its spiritual similars and perhaps inspirations (True Detective, Wind River etc.), but no aspect really in this movie is below the average.Nikolaj portrays Rayburn Swanson, a reformed hunter living in solitude in a wildlife sanctuary, troubled deeply by the disappearance of his daughter years ago. A deadly game of cat and mouse ensues, as he and the town Sheriff Alice (Annabelle Wallis) set out to track down a newly active serial killer who may have also kidnapped Rayburn's daughter. The story provides most of what one would expect, chases, clues, violence, investigative and other misconceptions, offering also some minor plot turns that could raise a couple eyebrows. Though serious and working on heavy themes, The Silencing lacks suspense and the atmosphere that could've been, as plot largely functions on familiar tropes and leads to a rather clichéd final act. Where the first feature screenplay by Micah Ranum doesn't realize its full potential, the performances, geographical backdrop and visual work tries their best to make up for it. I took some issue with the character of Alice, and Annabelle Wallis didn't have a whole lot to shine on, whereas Nikolaj's offering of Rayburn felt like the most fulfilled character, and acting performance within The Silencing. Shot in Ontario, Canada, The Silencing utilizes the landscapes and small town's drab charms well, though this backdrop eventually plays a role smaller than I'd wish to see. Cinematography's solid if not exactly impressive, though throughout I was thinking it'd do better with a little less greys in color grading.The Silencing feels lesser than it should've been, but it's never bad or truly boring. Decent, but forgettable, lands in the middle, one of those many movies that feel disappointing for... not being disappointing. Fans of rural thrillers, devious small town shenanigans and serial killer mysteries should be able to find a kick or two in The Silencing. My rating: 6/10."}, {"id": 118, "text": "Everything about this movie is okay. The story, the characters, etc. are all okay. None of it is bad. But none of it is fantastic either. It does the bare minimum a good movie should do. Good acting. Good writing. Good pacing. Good filming. Good editing. From a technical, movie 101 perspective, everything is textbook and it doesn't make any huge mistakes.However, where the movie prevents itself from being very good, is in the following two things:1. Ruins one very good opportunity and turns it into a pointless plot device. Midway through, a discovery is made which raises the stakes tremendously. From that point, the film could have done something very good. But in the end it's rendered useless as the plot jumps onto something else. And the villain emerges with very unconvincing motive.2. It's a carbon-copy of a much better movie called Wind River (2017). I couldn't help but notice the similar look/feel within the first few minutes. The setting, the music and how the story opens was very similar. And much to my disappointment, the borrowing of ideas didn't stop there. The rest of the movie is practically the same. So if I could recommend one thing, is to go and watch the that other movie (Wind River) instead. Wind River is everything that this movie wishes it could be. In every department, that movie is fantastic."}, {"id": 119, "text": "'The Silencing' had all the things I love in a film. It had unexpected moments sprinkled throughout, a lead character I liked and wanted to be alright in the end, a whodunnit element and some twists. What more could you ask for from a thriller? This was the type of movie that was coming out every week back in the 90s, and they were all great, yet these days you're lucky if you get one every couple of months and they're not usually as good as they used to be. So when I come across one as well done as this film was it is a rare treat.Nikolaj Coster-Waldau from 'Game of Thrones' plays the lead role, and he was a remarkably good lead-man. Not only is he naturally likeable but he is also very easy to sympathise with. His character has had something awful happen to him and so he has become an alcohol and can be quite unpleasant to his ex-wife's husband for example. Sometimes these characters can be very hard to get onboard with if they're played by the wrong actor, but in this case I was happy to look past his flaws and get on-side with him.As mentioned earlier I really like a good whodunnit. They're incredibly out of fashion these days unfortunately, but 'The Silencing' is a great reminder of how well they can work in cinema. I really enjoyed this movie and would highly recommend people give it a watch."}, {"id": 120, "text": "Ive seen better movies on this subject/topic, and that is because there are too many inconsistencies and loud screams of ludocrisity done by the caracters in the plot. a superindependent sheriff that does the lonesome ride everywhere danger is, and the parkkeepers lack or will of communicating with police and others in dire situations, a w/t or a cell might have given some truthfulness working or not, or a simple houseline phone or better. its also hard to understand the police juristictions and the way law enforcement are dealt with, it just becomes deadwater where there are no push to be found.acting wise, and the filmographic presentation are well done, much thanks to the choice of locations and nature scenery, but the story are plotted like good old ''twin peaks'', extremely slow, and wait till next weekend to get another clue.its a film that will enerve some and make others bite nails from the nerves, the grumpy old man liked the first one third the rest is for you to decide. its a recommend anyway"}, {"id": 121, "text": "The Silence is a very mediocre thriller that doesn't do anything particularly well, except perhaps for Coster-Waldau's performance.The script is sort of underwritten and overwritten at the same time. There are too many characters and too many extraneous scenes. This is a thriller; it needs to be taut, without a scene wasted. It wastes many scenes, and you stop paying attention.The twists and turns were uninvolving and sometimes made little sense. There is one bizarre turn around where a previously heroic character goes bad, and then the movie seems to forget about it later. They were apparently willing to kill to protect a family member, who they believe is a serial killer?There is also a backstory for Coster-Waldau's protagonist that fails to convince. It needed to be hinted at strongly, not involved unconvincingly."}, {"id": 122, "text": "The Silencing is an Action - Thriller movie in which we watch a father trying to find the man behind the kidnap of his child while he has to deal with his addiction in alcohol. Soon he will realize that his daughter was not the only victim and he has to do his best in order to find that man.I have to admit that I did not have high expectations from this movie but I was happily surprised by it because it was not only a nice and interesting movie but it was more than this. The direction which was made by Robin Pront who is also the writer, it was very good and I believe that he did an excellent job on focusing and presenting his main characters problems, history and goals. This had as a result to make us not only relate to them but also to feel that we are a part of it, something that made his movie far more interesting. Finally, I have to say that the interpretations of both Nikolaj Coster-Waldau who played as Rayburn and Annabelle Wallis who played as Gustafson were very good. I highly recommend everyone to watch this movie because it is a nice thriller with a simple but interesting plot and some very good interpretations."}, {"id": 123, "text": "The SilencingI enjoyed this movie, it was in the main a simple linear pursuit movie with a few twists. Nikolaj Coster-Waldau as Rayburn was perfectly cast as the brooding revengeful father losing himself in an alcoholic oblivion of Red Wing whiskey following the disappearance of his daughter.The cinematography was great and the action sequences were shot with real drama.The whole ensemble were fully committed and worked through the plot that had a few holes we will overlook, as everything was sacrificed for the driving impetus of who done it.The music was great but the real star of the movie was the natural beauty of the forest."}, {"id": 124, "text": "This is the synopsis found on IMDBA reformed hunter living in isolation on a wildlife sanctuary becomes involved in a deadly game of cat and mouse when he and the local Sheriff set out to track a vicious killer who may have kidnapped his daughter years ago.When I read in a synopsis that someone is involved in a deadly game of cat and mouse Im almost always automatically suspicious. It's a tired , over used description to make a dull film sound exciting and while I wouldn't go as far as to say The Silencing is dull , the synopsis does make it sound better than it is.Nicolaj Coster-Waldau is doing his best to cash in on his popularity after Game Of Thrones and he's not doing a bad job at all. He was great in Shot Caller and has a few films ready to be released in the next twelve months . He's definitely the best thing about this movie. He's totally believable as the alcoholic father who has lost his daughter, it's just a shame that Annabelle Wallis is totally miscast as the Sheriff. Caked in make up , she swans around in a police uniform looking totally out of place .The action is few and far between , it's more of a character study than an action movie . There are many plot holes and unanswered questions in the film but it's probably best not to question the poor decisions of the characters if you are to enjoy this . It's not unlike an adult version of Scooby Do ! You just have to guess who's going to be unmasked as the bad guy .Overall it mildly entertaining as well as lazy at times but it's probably worth watching for Coster-Waldau's performance alone ."}, {"id": 125, "text": "A title with no meaning. Actors with no oomph. A story we all know. Little to no bloodshed....sounds good, doesn't it?😋 just kidding... This is actually a very unoriginal film. We have seen this before many time, and have seen it done better. Still though, this is a decent film. The second feature from Robin Pront in no way holds a candle to his first film, The Ardennes which pretty much looks the exact same as this film, but is much better. Personally I kinda of expected more from Prong considering his first film seemed to have enough grit and rawness to go around with a hefty side of violence. The Silencing is a let down in the sense that it doesn't provide anything new for us. It doesn't even have any really cool kill scenes. This movie needed more violence and it needed one more death in my opinion to fully achieve the uniqueness that would have brought viewers back for a second viewing a year or two down the road. There is very little to like besides the aesthetic and filters used. The acting is good, not great and the story is sooo recycled. It passes the time but it's just so bland at the same time. For hardened movie fans this film will disappoint but for someone who only watches a movie when they get the chance once every week or two, this movie will probably wow them. Truth is, however, ita very mediocre and that is sad because I was anticipating something hard, gritty, and unforgiving. Waldau is okay but the dude is currently over used in film. I would have liked to see a different face in this movie as the protagonist."}, {"id": 126, "text": "For the first 30 minutes this film had me glued to the seat. I went in with low expectations, and from the eerie opening shots with a body drifting down a mountain river to the moody lit nature scenes, the tone immediately pulls you in. This is arguably the films strongest point. No gross oversaturation and high contrast steadycam shots to gloss over a non-existant budget, no trying to be cool and flashy or overly slow and pretentious. This film gets the tone right. That's a rarity these days. The first meeting with the killer really ratchets up the tension. He could be anywhere, and a sense of dread kicks in which lasts right up until the confrontation in the house. They could have done even more here, having the killer keep up the pursuit to really push the sense of omnipresent danger.However, that's when the film falls apart. One of the main characters makes an extremely stupid and unrealistic decision, and the script never regains its footing. From there on out, the main characters make one head scratchingly dumb decision after the next up until an extremely disappointing reveal of who the killer is. One major problem is, that we're never given a list of suspects aside of an obvious red herring, who's plot line fizzles out like so many of the interesting setups from the first half.It's frustrating, because there's so much talent on display. Excellent acting from the leads, good score, great photography, several interesting backstories and conflicts for the main characters, none of which get resolved in a satisfying manner, which makes the plot just feel heavier than it needs to be, and the second half a chore to slog through.As so often, the script is the main problem. With a better script, this could have easily been one of the best films of the year. The Silencing is a mix between a classic 90s serial killer film and a modern low budget indie thriller."}, {"id": 127, "text": "I need to see that girl. She could be my daughter.It's always nice to see how actors from a successful television series cope in a feature film. And especially if the genre is quite different from what they played in that series. Here Nikolaj Coster-Waldau makes a decent attempt to show that he has more to offer than playing a king's son who prefers to perform gymnastic exercises with his sister between the sheets. His performance here is on a similar level to that of Jaime Lannister in Game of Thrones. Convincing enough, but not exactly of exceptional quality. A role that doesn't annoy you. But every time you see his face somewhere, you have to think for a moment where you know that face from. This is also the case here in The Silencing. I was like, Damn, where do I know this guy from?. Only after fifteen minutes or so, I could figure it out.The Silencing itself is of the same level. Certainly not a bad movie. But also not a movie that'll blow you away. The story felt a bit incomplete to me. There were some improbabilities (not to say completely nonsensical decisions). And the denouement with the disclosure of the perpetrator and his motivation, I personally found a bit far-fetched. The film had something Silence of the Lambs-ish but then set in an extensive, forest-like nature reserve. An area managed by Rayborn Swanson (Nikolaj Coster-Waldau) that has been given the name Gwen Swanson sanctuary. A reference to his daughter who has been missing for 5 years. It's a place where animals can live undisturbed and protected, far from hunters and poachers. Rayborn lives an isolated life far from the civilized world. A way to silently grief about the loss of his daughter. Usually by consuming liters of alcohol. A bit strange because that's exactly what caused that disappearance.The story gets a little bit more exciting the moment a serial killer comes into the picture. Someone who probably watched The Hunt too much. What follows, is a cat-and-mouse game with the participation of the local female sheriff Alice Gustafson (Annabelle Wallis, series-loving fans will recognize her from Peaky Blinders) who herself has her hands full with the stupidities her little brother Brooks (Hero Fiennes Tiffin), a drug addict with a traumatic past.Without a doubt, this could have been a much better, coherent movie, provided the script was changed a bit. It's linked together with hooks and eyes. Full of coincidences and ridiculous twists. Decisions are made that are too ridiculous for words. Alice's surprising action at one point is understandable on the one hand. But on the other hand completely unreal. And the indifference that those involved show afterward as if nothing had ever happened, made me frown for a moment. Rayborn's paint pot trick seemed so absurd and stupid that I spontaneously burst out laughing. Not exactly applicable to a serious thriller about a serial killer.The Silencing isn't so great. A mediocre piece of movie. Actually, you could say that you've seen it all before in other movies. And much better movies too. Cinematographically it looks professional (despite the low budget) and the general mood is also good. But, when you love watching exciting flicks with nerve-racking suspense, you'll be disappointed. The only thing I can't say anything wrong about is Nikolaj Coster-Waldau's acting. Solid and constant. Just like in Game of Thrones. Again a pitiful persona. But I'm sure I won't recognize him in his next feature. Once again.More reviews here: movie-freak.be"}, {"id": 128, "text": "* There is no end credit scene *The director Robin Pront and crew brought a good film but with a restrained thriller. The story is about a reformed hunter and a sheriff who tracks down a murderer. This movie is so good but it could have been great it had so much potential with fascinating characters. The suspense was very weak it felt too controlled for a certain build-up in which never came. I like how it tackles the love between a family and how the lines get blurred to do what might be right. There were many incredible moments and it frustrates me how everything turned into the most expected outcome.The composers Brooke and Will Blair brought fantastic music that defined the town's atmosphere beautifully.What a cast! Annabelle Wallis, Nikolaj Coster-Waldau, Zahn McClarnon, Hero Fiennes Tiffin, and Melanie Scrofano! Their performances were solid as ever but it left me wanting more as in one of the reasons the film felt incomplete. It gives one a glimpse but then it rushes ever so quickly to track down the murderer without realizing how it skips so many great things about these characters. I was intrigued in the Sheriff's storyline every decision she made got me so engaged with so much of her complexity but sadly along the way it was like they put it aside and that is where the movie got ruined. If only the length of the film was longer it could have accomplished more than a simple entertainment film."}], "reviews_amount": 129}