{"name": "Yes, God, Yes", "titleId": "tt08949056", "reviews": [{"id": 0, "text": "Being homeschooled and a christian growing up in a very humble lifestyle and household, I appreciate the message they were trying to get across in this movie. You grow up with so many restrictions and when you're out of that fearful environment it truly is a wake up call. Knowing that people have been doing what you have been forbidden to do for years and they are alright. I like seeing movies like this where I can relate somewhat to the plot. It wasn't really amazing or the best movie I've seen but it was a good message I think. I have absolutely no idea why it was rated R since it was pretty tame for what else comes out these days but maybe I'm wrong? Anyway I loved Natalia Dryer, even though she's well in her twenties, she can still pull off a teenager pretty well."}, {"id": 1, "text": "A great coming of age story. Natalia is a perfect fit for the role."}, {"id": 2, "text": "This scene cracked me up! 🤣 The obsession with his arms. Poor girl is just going through puberty with a bunch of Stepford children."}, {"id": 3, "text": "Kudos to Karen Maine!! Her writing is spot on in how she has managed to tell and share the truth (The Hypocrisy of religion) in a way that I can personally relate with. Natalia Dyer was phenomenal, her expressions, reactions, and screen presence was absolutely spot on. everyone should watch this movie. I am glad I found it."}, {"id": 4, "text": "I saw the short this was based on and it was great. This doesn't really add much of note.The plot is bulked out with high school stereotypes and a hypocritical priest, played by the horribly miscast Timothy Simons (Veep).The positives are that it has a great lead performance from Natalia Dyer, and it's a good looking and well shot movie. I'm not sure why they felt the need to set this in the past, but still in the era of the internet and the mobile telephone. That aspect is as well executed as it is pointless.The film is enjoyable, but it seems like exactly what it is, a misguided attempt to stretch a short film out to almost feature length."}, {"id": 5, "text": "Here it is, finally a film exposing the paradoxical nature of christian sexuality, which it does in the most hilarious ways! This movie shows the reality of human sexuality and how conflicting and hypocritical it is to try to put it into the moral box that christianity tries to and fails. As well as showing a lot of other funny aspects of both christianity and human social nature. This movie had me laughing out loud many times and was really smart and well done and is something that the world really needs to see! So I hope you watch it!"}, {"id": 6, "text": "After writing the winsome comedy Obvious Child, Karen Maine puts her talent to work behind the cameras with this satisfying directorial debut. An irreverent satire on religious principles and hormonal behavior, the film follows the sexual awakening of a High School Catholic teen girl whose explicit online interaction with a stranger arises her curiosity towards the prohibited. Her quest for understanding herself, the pleasures of sexuality, and acceptance increase and gain shape during a Christian Camp where she witnesses some unusual, scandalously freaky encounters. Natalia Dyer is fantastic, funny and relevant as the heroine trying to figure out herself while observing and learning from the hypocrisy surrounding her. Winner of the Special Jury Award at SXSW it's a refreshing, provocative and smart little gem."}, {"id": 7, "text": "Being raised in super religious home, I could Relate to this movie all they way to the end.Excellent acting,and just and all a round AWESOME Film. Best film I have seen this year."}, {"id": 8, "text": "Karen Maine's Yes, God, Yes won me over for its slice of 2000s nostalgia and the way it portrayed some very relatable things in the lives of teenagers of those times. The story is a little too simplistic, and it doesn't try to bite off more than it can chew. In that sense, the film's climax probably won't seem too revolutionary when viewed in 2020 where 'sinning' is more of an innuendo than something religious.There are some predictable turns, there are some funny moments, there's a little sexual exploration (something the film could have dwelled more on, given its theme), and there's a neat central performance from Natalia Dyer. For a 25-year-old playing a high-school teenager, I really enjoyed her adorable facial expressions for the most part. The film's only 77 minutes long, so it doesn't take up much of your time in telling a straightforward, unsurprising story."}, {"id": 9, "text": "This movie was funny. Loved the performances especially by Natalia Dyer. What else to say except check it out for yourself and don't forget the dressing with the salad lol.Tim Treakle"}, {"id": 10, "text": "This movie is so spot-on about what it's like going to a Catholic School. I don't know if I would have enjoyed it as much as I did if I hadn't been raised Catholic and gone to a Catholic high School. The humor is subtle, but it's good. Go into this movie open-minded and I think you'll really enjoy it."}, {"id": 11, "text": "I had the great fortune of seeing Yes, God, Yes in the Emerging Director section of the St. Louis International Film Festival. The film is pitch perfect, and lead actress Natalia Dyer (Stranger Things) carries the film with tension and humor. I will watch this film again, and certainly recommend it as often as possible. Director Karen Maine's mastery keeps this film moving forward with precision and never misses a beat."}, {"id": 12, "text": "The moral hand-wringing of Christian youth is inherently boring and trite, though it could be hilarious in the right hands. In terms of writing and direction, these are not the right hands. It's just schlock. Don't bother."}, {"id": 13, "text": "Some young are cursed by pious parents and guardians in the name of? Gina sums it up: 'We're all just trying to figure out our own s*it'.A young teenage lass, having been led down a garden path that's not for her, discovers the vibrations that will turn her into a women, with her own choices, on her own terms. Brilliantly performed and relevant, an overflowing salad bowl of comical and christpy metaphorical hypocrisy."}, {"id": 14, "text": "Loved this film! In spite of lower reviews.i thought this was a fun way at looking at sex and coming of age"}, {"id": 15, "text": "Of course it wouldn't be popular here because christians wouldn't like it. But trust me, for the rest of you, this would be a great watch. It's a perfect take on christian hypocrisy &amp; I highly recommend it."}, {"id": 16, "text": "I gave up Catholicism for Lent right about the time this movie takes place, so it was easy to relate to the struggles of Alice on a personal level. Pretty sure anyone raised on a steady diet of guilt and fear of burning in hell for any reason will relate to it. For the majority of the movie, Natalia Dyer plays the complete opposite of her best known character Nancy on Stranger Things. Dyer delivers a heartfelt portrayal of a confused Catholic teen with that is largely delivered through her body language and facial expressions at a religious retreat that is not quite what it proclaims to be. I'm not sure how much those not raised Catholic will appreciate this gem; but, it's definitely an accurate portrayal of the teenage hormonal angst and confusion of being taught sex education by religious leaders who are supposed to be celibate. Give in to the temptation and watch this movie!"}, {"id": 17, "text": "Ignore some of the bad user reviews. This is a short 1 hour 10 mins good be coming of age comedy. It's second theme of religious hypocrisy is gently made. A Catholic in my family found it amusing. So give it a go."}, {"id": 18, "text": "The topic seemed puerile, so I ignored this film until I noticed a good average rating from critics. Then I watched, and at first felt bored, but stuck, despite it's miserable pacing, pedestrian production values, and cliches. I realized there must be some redeeming value, because it seemed like religious hate speech barely masked with good intent.I was confused a little at first, by its handful of laugh-out-loud moments that arise from naive characters saying stupid things. For example, one character starts ranting to a friend, with some mixture of shock and relish at telling a disturbing secret, about a disgusting scene in a partial-birth abortion film she was shown in class, and her friend cuts her off saying,Don't ruin it for me! I laughed out loud, truly fooled into supposing this was clever satire, rather than seeing it as a deceptive portrayal.But this film is terminally wounded, and the jokes revealed as pitiful attempts to portray every Catholic (they are all Catholics) as misled through either naivete or stupidity, and mired in a juvenile cowardice that eventually matures into institutions led with willful blindness and cruelty, directed by senile nuns with poor eyesight. It becomes clear, by the end, that the average of approval by critics must be proceeding in part from their approval of this religious hate speech.The G. Bush Administration was genuinely concerned with helping children, as a theme for it's time in office: No child left behind. And consequently it investigated sex abuse in schools. What it concluded is that students in public schools are about one hundred times more likely to be sexually abused than are students in religious institutions, and about one hundred less likely to have their assaults addressed as crimes. That ought to matter. You should have been told. Someone really ought to have made a film about it, don't you think?There may be quite a bit of truth in the proposition that girls and boys are misled by poor religious models, but that's not a crime. It's just an avoidable tragedy that results too much from religious hatred polarizing and isolating children. Religious hate speech is a crime. Sexual assault is crime. And willful ignorance is on us."}, {"id": 19, "text": "I hadn't anticipated watching this title, but there wasn't much else on so I gave it a try. I genuinely ended up liking it a lot. Mostly because this is one of the few films that gets Catholicism right so I can only imagine their must have been some real Catholics in the production of this film.I grew up Catholic and I attended parochial school in the middle school years and I could certainly identify with some of these characters. i can only imagine some people who aren't Catholics might not get all of the jokes.Best advice Alice received from this four day re treatment camp, go to college on the east or west coast. Otherwise the Catholic guilt trip and burning in hell psychology can seriously mess you up as an adult."}, {"id": 20, "text": "If you wanna watch something short, good, I'd recommend this movie, I enjoyed this movie you should too.."}, {"id": 21, "text": "It's not great, but it's quite an enjoyable movie and it's really short."}, {"id": 22, "text": "No story, no twist,no comedy,not a single thing to charish about in this movie.... a group of teens goes on a camp and nothing mention-worthy happens there....."}, {"id": 23, "text": "It's so good! It's funny and it never gets boring. Plus Wolfgang is gorgeous 😍"}, {"id": 24, "text": "In Idiocracy, one of the greatest films ever made, there is a scene where a crowd in a movie theater laughs out loud at the vision of someone's nude behind.Well, this film most certainly is directed to this crowd. Simpletons who find amusement in pseudo-pornography packaged as an artsy-fartsy film.Pretty soon they will make films about pesky and disgusting humping dogs and they will call it a comedy too.Brave new World..."}, {"id": 25, "text": "The film is way too short and a lot of characters are underwritten and the sub plots not explored at all. A feature film should always have a minimum 80 minutes running time and some conclusion in the end. Natalia Dyer delivers a very good performance and the satirical take on catholic schools works well. Definitely an independent drama worth a watch and will be looking forward to Karen Maine's next project."}, {"id": 26, "text": "This film held my interest, had good acting and was well made. However, it was a bit of a let down. A lot of buildup and no real follow through. Worth watching I suppose. But I was left feeling like it needed more and was a bit disappointed!"}, {"id": 27, "text": "If you went to a Catholic high school in the early 2000s, you'll TOTALLY get this film! Like I, you'll be thinking someone in my class must have wrote this screenplay. It is spot-on... COR, TEC, and yes of course Kairos retreat attendees - this is for you!"}, {"id": 28, "text": "I may potentially spoil this, therefore I will tick that box regardless of where I go with this. I have a hard time rating this movie, I have read the reviews on here and I concur with much of what has already been written about it. However, I also feel that people have given this film a bad wrap for the wrong reasons. You will have uptight religious folks that won't like the sexual nature of the film, on the same token you will have people that complain because It indirectly casts Catholicism and Christianity in a negative light. No, the writing, acting, and movie itself are not the best. It's not a blockbuster film. I think people have misinterpreted what this really is. I think it's more of a TeenyBopper kind of thing. Like afternoon, afterschool TV. I think the overall message of the film is good. It takes some of the sting of religious stigma away. It's not really meant for people like me to critique the nuances. It's not a comedy, but it's funny. Keep and open mind and watch it."}, {"id": 29, "text": "I liked the trailer which made me watch the film, and the beginning was good but for a 77 minute film I kept checking to see if it was over yet. It is so boring. There's little to no composition, songs are almost obsolete; I mean, near the end there's a Collective Soul song as the main character gyrates on a mop pole which, I guess it was supposed to be funny but I just found it weird. It moves unnecessarily slow. At first I actually didn't mind as if it were building up to something and it kind of does, like the utter hypocrisy of those who spout one thing but do the opposite but the punches (punchline) were misses as if the person was totally stoned in the concept.I guess after awhile I was looking for quaint but humorous and really all I got was quaint, which, I guess is fine but it's just too little. It does have the 'raunchy' aspects but it didn't seem it was trying to be raunchy. It seemed to be trying to be real, like real life, and maybe it was or is but for the content it really shouldn't have been. People looking for raunchy want raunchy. People looking for feel good typically want that. People typically don't want both entwined together though I did recently see a Canadian raunchy-feel good film but it was Canadian: they're always feel good /facetious.I think it was just too quiet. There just wasn't any excitement when there should have been. It was quite monotonous."}, {"id": 30, "text": "This is meant to be a Comedy/Dark Comedy movie according to Netflix weird category system. This movie isn't funny in the same way as a typical comedy there aren't any actual scenes that contain any real comedy in them or are really intended to make people laugh. Now don't get me wrong this movie will make you laugh but because of how relatable the situations and characters are throughout the movie especially if you grew up in a particularly strict, religious environment where you were taught that everything apart from breathing and praising Jesus is a sin."}, {"id": 31, "text": "7/10 - short and sweet coming-of-age film exposes hypocrisy in the Catholic faith, but accomplishes little else"}, {"id": 32, "text": "I liked this film because it examined the obvious hypocrites involved in extra-curricular religious activities. And that goes across the board for all religions and all extra-curricular religious activities, such as retreats and the like. The film is quite funny, and the lead actress does a great job, as do all of the supporting actors. But the real star here is the writer and director (who obviously went to a Parochial School, as I myself did). I can relate to the onerous cloud of guilt that is perpetuated by the religious zealots of all religions. It is a common denominator. The coming (literally) of age sexually is a very commonplace occurrence, and is within the natural order of things; however religion somehow tries to deny nature at every turn. I thought the two funniest scenes were the chocolate pudding lid licking and the oven/microwave metaphor for girls and boys by the cleric. Good stuff and not to be missed."}, {"id": 33, "text": "I went to catholic school from elementary up to high school. I did the many retreats like the one in the movie. Just like the film portrays, those retreats get wild and all kind of hell breaks loose cos at the end of the day we were all teenagers. I don't remember anyone taking it as seriously as Alice's friend though. The retreat is done so well in this film, everything from the real ones is here. The story sharing, the songs playing, the girls crying with whatever story they've shared - I laughed at how well they presented it, brought back so many memories.Natalia Dyer is perfectly casted as the main character. She has the perfect facial expressions that illustrate the inner confusion happening to this poor (but clever) high school girl. She gives a great performance. In terms of the story, the rumor made up about the main character comes out of nowhere. The way the film starts off, we're made to believe that Alice's sexual urges are the main point of the story and what will drive whatever whacky events follow, but we're hit out of nowhere with a raunchy rumor being spread about Alice and a boy in her classroom. That rumor then is at the center of everything that goes on afterwards, which was really random. However this showed another accurate depiction of the Catholic school experience with how both the teachers and the priest are aware of the rumor going around and guilt trip Alice about it, that does happen. Although in my high school they were more subtle, middle school though, those frustrated women were vicious - like the teacher shown in the film. It feels like even the movie forgets about the rumor sometimes and bring it back up when it's convenient. I feel like the plot could've done without the rumor, I know it sets up for when Alice innocently uses the priest's computer to find out about the supposed act she partook in at the party, but that's minor to the big discovery she makes of the priest and what he does with his free time on the computer. Those major events are set up by her sneakily keeping her cellphone instead of giving it to her group leader. The rumor just felt unnecessary, could've done without it and the ongoing salad tossing joke. Another random thing was making the film take place in the early 2000's. It did make me feel nostalgic, especially hearing the AIM noises, but I didn't get the point as to why that decision was made ? This story could've worked in a present day setting too, so I didn't get the point of that.The movie isn't perfect but it is really funny. It has a great message about how at the end of the day we're all figuring our 'stuff' out we just have to be respectful of one another and not judge each other for our actions or mistakes. The message that every Catholic school kid should take away, since we got to see firsthand the contradictions in Catholicism but we know faith is one thing, fake fanaticism is another. Worth a watch."}, {"id": 34, "text": "Yes God Yes 2020 15 Director: Karen Maine Starring: Natalia Dyer, Francesca Reale, Alisha Boe, John Henry Ward, Donna Lynne Champlin, Wolfgang Novogratz etcOverall rating 79/100Yes, God Yes is based off an innocent catholic teenager called Alice who gets into a racy online conversation with a stranger, and after a rumour of her having sex with someone else materialises she goes to a catholic retreat to try and find herself. I thought Yes God Yes was very good and different to a lot of comedies with its themes and cleverness, so let's talk about this more in detail.First of all, there was an interesting concept, likeable main character and performance, as well as the movie being very funny. I thought the whole religion aspect of the movie was really unique and added a fun new perspective to previously explored sexual themes from previous comedies. The main character was very likeable as well as the main performance from Natalia Dyer, lice had such a likeable innocence and charm to her that made you instantly connect with her, Natalia Dyer also bought the character to life excellently, with a versatile performance and the kind of charm and likeability that made me not take my eyes off her, she stole every scene she was in. The movie was also very funny, the amount of hilarious but often relatable awkward situations that the characters were put through were great, there was some funny visual metaphors, as well as completely contradictory characters in terms of what they were teaching about religion that was very funny and executed well.My first two negatives however would be the generic high school formula and the lack of explanation into certain plot points. I thought the film did sadly follow the very generic and corny high school formula throughout with no real attempt to be different from that, there was the generic split friendship groups and unneeded conflicts it was a shame due to the other unique parts to the movie. I also thought that there was a lack of explanation into certain plot points, I thought that one of the key plot points t hat were used throughout the movie about the rumour of Alice and a male student was not well explained, it was a clear example of telling us a detail but not showing us, therefore it loses it's importance and impact despite it being such a big part of the movie.My next few positives would be the charm between the characters, good themes explored as well as balancing of religious and non religious themes. All the cast had excellent chemistry with each other which was great, Natalia Dyer and Francesca Reale had fantastic on screen chemistry and how their friendship developed throughout was well done, Wolfgang NovoGratz was also great and played his role with other characters very well. The film also had well explored themes about religion. I actually learned some things about religion that I didn't know before which was both interesting and almost concerning in parts, but learning about the sexual sacrifices they have to make and what they considered sins was well explored and really interesting to me, but also the themes of still being religious but not as hardcore in terms of following all the rules was interesting and more reflective of how religion is viewed in todays society, and on that note they balanced these clashing themes and views very well to give both ways a voice throughout the movie.My final couple of negatives would be the questionable character decisions as well as some generic and lazily set up plot points. I thought the main character of Alice did make a couple of questionable decisions that made her slightly unlikeable in places, there was just a few better ways that her character could of handled certain situations in places. I also found that there was generic and lazily set up plot points that didn't work that well, I thought other characters putting the blame on other people to get out of situations was very generic of parts of this genre and was lazily handled in places which was a shame.My final few positives however would be the script, clever parts to the plot linking to the themes and character arc of the main character and the ending. The script was excellent and told this coming of age story excellently, with some in depth and well thought out dialogue that really made you think which was excellent especially when Alice met Susan Blackwells character. I also thought the clever titles of the movie for different days cleverly represented Alice's character arc of finding herself and accepting that she wasn't a complete catholic was excellent and fantastically well done. And finally, the ending was very satisfying, I thought they ended all the characters relationships and arcs very well and the true message that the movie was trying to express was delivered excellently.Overall, despite the script and creative choices making the film not quite as good as it should be in places. Yes, God yes is a clever and mostly unique kind of comedy that's boosted by an excellent main performance from Natalia Dyer and plenty of laughs along the way."}, {"id": 35, "text": "The only thing new and different here is Dyer - who needs better material and a new agent."}, {"id": 36, "text": "Where to begin. Overwhelmed with unimpressive attempts at film making. a travesty what it has become. Yes go, yes, please do hurry this title into oblivion."}, {"id": 37, "text": "I thought either it might be a funny movie or some serious stuff kind of story. But at end, it's waste of time. Few events did gave me trill but they didn't ended up as expected. Thank you."}, {"id": 38, "text": "I liked this WAY more than i had expected. the premise sounded really intriguing, but i didn't think i would be so entertained by this. right from the first until the last minute, this movie just made me laugh and i gotta say, i had a pretty great time while watching this. not too long, light-hearted and just funny. some dialogues felt awkward, which kind of made them even better (at least after i realized that it's not the writer's fault and that i probably wouldn't be any different in real life). i bought every minute of natalia dyer's performance, but some of the supporting cast's acting felt a bit unconvincing and unnecessarily exaggerated to me. all in all, a very entertaining movie though, and the perfect feel-good movie for a sunday night."}, {"id": 39, "text": "It's not eventful enough but a good cool short movie to watch."}, {"id": 40, "text": "Try looking up the blatant hypocrisy of the left instead, since Hollywood will never show you that. No Safe Spaces and even An Open Secret are a better watch than this hypocritical trash."}, {"id": 41, "text": "Did a fairly realistic representation of mind-controling religious retreats for teenager. Excellent sexual awakening coming of age, funny and convincingly performed. Lady Bird, but hornier"}, {"id": 42, "text": "It brings back memories. I attended such camps in my youth. The conflicts are identifiable. It is quite realistic. But too obviously preachy. The acting is creditable. It is acceptable and watchable."}, {"id": 43, "text": "She is so beautiful and cool, perfect actress. I hope there will be more movies with her &lt;3 loved this one, will love all other movies with her too"}, {"id": 44, "text": "Funny, compelling and endearing; Yes, God, Yes is a coming of age film most filmmakers wouldn't dare to make.In this comedy, after an innocent chat turns racy, a Catholic teenager discovers masturbating and struggles to suppress her new urges.Backed by a terrific lead performance from Natalia Dyer, Yes, God, Yes takes a racy subject and turns it into a thought-provoking and often funny turn of events. Watching this film made me realize how many people out there for sure struggled with issues like this one growing up. Delicately written and directed by Karen Maine, Yes, God, Yes is a fast paced and solid film worth the watch.Follow @snobmedia for all reviews!"}, {"id": 45, "text": "Catholicism always appears to be portrayed in the media as the Christian denomination that emphasizes 'sins of the flesh' (versus other denominations). How true to life (or indeed false) that is, I'm unlikely to ever find out.However, this is a suitable vehicle for the subject of this feature length sitcom. The ever bankable Nathalie Dyer's teen character is torn with lustful thoughts and is persuaded that attending a voluntary weekend 'camp' emphasising clean living and the evils of lust will remedy this.If I were to tell you that the camp certainly doesn't do that, I do hope you're not too suprised. Because many of the central characters are female, the storyline is I think 'gentler' insofar that were this written to portray male characters the script world have been more overt in expressing their desire. Funny, amusing, I wouldn't have called this a 'dark' comedy as Netflix did."}, {"id": 46, "text": "This movie was a slow burn but the point that it was trying to make came across. As someone who grew up catholic, I knew exactly what she was going through and how catholic guilt can get you when you are trying to figure out who you are as a person and it sucks. Natalie portrayed that very well and how we all try to hide who we are or we will be struck down by God. One of my only gripes was that it was a little slow at times but I loved the main characters story of embracing who you are."}, {"id": 47, "text": "Having grown up Catholic, I can relate to this movie and I did enjoy it. However, I felt the damage done by Catholic indoctrination was treated meekly at the end. The ending I would have written would have been a punch to the gut. I thought nearly all the production aspects were excellent, especially the casting. The casting for Chris, Laura, and Father Murphy was brilliant."}, {"id": 48, "text": "Bland, tedious and not particularly funny or entertaining. Despite it being ridiculously short it was a chore to finish. Strong 3/10."}, {"id": 49, "text": "The plot was pretty good coming of age story, seemed a bit weird for being back in the late 90s era. Nonetheless Natalie dyers played her part near perfectly throughout the movie. She's probably the only reason I kept watching the movie to be brutally honest."}, {"id": 50, "text": "Get this... a holier-than-thou Christian girl goes to a religious camp, and soon discovers most of the devout flock who lecture her about sin are complete hypocrites. The head counsellor does naughty stuff in the woods, the priest in charge is hiding a dark secret, and STILL no-one will tell her what is means to 'toss' your salad...!Huh? What do you mean, none of this surprises you? That movies that extract the pee out of God-botherers are a dime a dozen, and Yes God Yes, while it might be amusing in places, ultimately has little to bring to the table?...You might have a point there. And also when you mentioned a similar movie about Islam would be protested and banned from here to kingdom come. But let's not talk about double-standards here. You never know who could be reading... 5/10"}, {"id": 51, "text": "This movie is slow, but things are tied together in an interesting and hilarious way. The revenge with the bracelet, the confession in the end- I cracked up!"}, {"id": 52, "text": "Yes, God, Yes is basically about this 15 or 16-year old girl named Alice who begins experiencing feelings of arousal and struggles with how to reconcile what she feels with her religion. She goes to a Catholic youth retreat to try and find her way back onto the path to God and hopes that'll help her.As someone who grew up in a strict Catholic household and was fed many of the same sex-ed wisdoms that Alice encountered, this movie felt like rewatching my early adolescence. Natalie Dyer did really well at portraying a girl grappling with the weird mixture of guilt from one's budding sexuality and the ensuing frustration when people were so quick to judge and condemn you in a religion that preaches tolerance.Overall, this movie was a raw representation of coming-of-age and all the nitty-gritty that it entails. The interactions between characters were, at times, a little extreme as most people in a Catholic environment were not so readily hateful (from my experiences), but I have met all of these characters. I've met the grouchy school administrator. I've met the young, judgmental priest (who always looked weird when he wasn't in a cassock). I've met the cool youth leaders who were always up to no good when they weren't praising God. I, too, experienced that weird double standard between boys and girl when some unsubstantiated rumor circulated. I even sympathized with Alice rewinding the sex scene in Titanic (except for me, it was a scene in 300). It felt like looking into the mirror and seeing all the things I wanted to forget, but eventually just embraced as a part of my adolescence.It was funny, awkward, and a little uncomfortable, just like growing up usually is. However, one of the reasons I liked this movie was because I related to it. The person I watched it with did not grow up in a religious household and wasn't as impressed, so I think that the nostalgia really plays a role.This movie wasn't perfect. I find that when a short film is adapted into a longer movie, there tends to be lulls in the plot that I don't really encounter in other films. There were times when I would get distracted because there wasn't really a whole lot happening to keep my attention. The scene in the bar with the lesbian bar owner was nice, but felt weirdly forced and a little disingenuous? Like yeah, that's a really easy way for Alice to resolve her guilt: by meeting a wise, older woman who grew up just like her and happened to be within a mile radius of where her retreat was and was willing to dish out some sage advice.Overall, this movie is good. It's cute, but a little forgettable. I might rewatch it in the future, might not."}, {"id": 53, "text": "We've seen this type of coming of age story before and this one almost delivers...almost. Missed a few key payoffs and story executions. Needed to be much better, but at least the cast delivered for the most part."}, {"id": 54, "text": "In a teen simplistic way we're shown that point in life where social pressures, establishing your identity, and sex are topped with religious (Catholic in this case) educational, moral &amp; faith pressures. I thought the script was fairly balanced between religious doctrine, and its fallible proctors as counterpoint to restraining human biology."}, {"id": 55, "text": "I watched this movie a few weeks ago. I highly recommend everyone to watch this amazing movie. This film is based on a 2017 Short Yes, God, Yes. I love that short was well. Please ignore, the negative reviews on IMDb because it's sadly too opinionated! Natalia Dyer is amazing in this movie. She's one of my favorite actresses. The other actors are amazing as well. The cinematography is simply beautiful. The music is amazing in this movie. I love it. This movie made me realize that everyone has their sexual thoughts and desires. If you're reading this, give this movie a watch because us audiences needs to support more stories like this form the points of view from the female, LGBTQ+, &amp; diverse perspectives. If you don't like this movie give this another watch! We as humans should realize that self pleasure and masturbation is normal! Teenage girls, boys even adults shouldn't feel ashamed to want sexual pleasure. Our society shouldn't be so judgemenal. As a straight man, I don't judge on sexuality. I'm more supportive of diversity and LGBTQ+ stories that should be told. If the cast and crew of Yes, God, Yes reads my review thanks for making an amazing movie! Yes, God, Yes is a phenomenal, hilarious, inspirational, and beautiful movie. This is one of my favorite movies of 2020! I'm giving this 10/10 stars. Go watch it. NOW!!!!"}, {"id": 56, "text": "Very boring at the end. Would not recommend watching this if unless your like cleaning around the house"}, {"id": 57, "text": "Pretty fun movie... a teenage girl becoming aware of her sexuality is a confusing time, and getting guidance from the religious sect makes for a hilarious-at-times flick while simultaneously showing some seriously sad hypocrisies of the christian set which, hopefully, those watching will be able to see and learn from... all in all, a good short watch"}, {"id": 58, "text": "This film was very real, very honest, and extremely well cast. One doesn't have to be a Catholic to appreciate the story though being a teen or older will certainly help. A sensitive issue was masterfully handled without being preachy or condescending.The film's length was a refreshing alternative to the plethora of movies that seem to subscribe to the theory that longer is better. This was just right, just long enough to tell the story but not too long that it became repetitive.To everyone involved with this film, thank you!"}, {"id": 59, "text": "It's quite obvious from some of the holier than thou comments in some of the reviews that the people never saw this, they are just attacking anything they see as attacking their religion.If you DID see it, you'd know it's not attacking religion, it's attacking people who falsely use religion to push their own agenda (that has nothing to do with God).The film has flaws, some characters are too predictable in their actions, and the film itself is woefully too short, but I actually laughed at times, and the message is decent.Worth watching at least."}, {"id": 60, "text": "A poorly made, lewd, anti-Catholic coming of age film. I like Natalie Dyer from Stranger Things so looked forward to seeing her in this film. From the very beginning the viewer discovers the acting is poor, the dialog cheesy, and the plot stereotypical. Lewd dialog and tawdry situations abound. Imagine a takeoff of 'Fast Times at Ridgemont High' done by an anti-religious zealot. A cute coming-of-age film this is not."}, {"id": 61, "text": "Combining coming-of-age themes with perspectives on institutional hypocrisy, 'Yes, God, Yes' often feels a little too simplistic on its story for its own good - like there isn't enough substance within the narrative to allow the commentary to have the impact that it should. A lot of buildup with no real follow through. Natalia Dyer gives a wonderful performance and carries the film all the way through."}, {"id": 62, "text": "If you've ever been to a private Christian or Catholic school, then you'll enjoy how painfully accurate many of the hell-fire and damnation speeches given by teachers in the movie are. The film has an interesting way of critiquing the hypocritical nature of the church while still remaining fairly light hearted. The last fourth of the movie kind of fell off for me as it became a little too cheesy for my taste (like the bar and speech scenes); however, I found the conclusion satisfying and effective. Overall, I thought the portrayal of Christian schools and youth retreats were pretty spot on, but the characters were pretty bland and forgettable (although I found Dyer's performance very convincing). Additionally, I expected the film to be much more comedic than it was. The beginning started off pretty strong, and then the jokes fizzled out quickly after. the film was well shot and portrayed a realistic high school very well. The film was worth the watch in the end."}, {"id": 63, "text": "Watch the 2017 short instead. Would not recommend. Dyer is one of the only bright spots in this movie. Truly a solid 5/10."}, {"id": 64, "text": "The writer/director Karen Maine went to a Catholic school in Iowa and made this movie based on her own experiences there in the 11th grade. I didn't attend a Catholic school but grew up being taught Catechism by Priests and Nuns so I can identify with a lot of it.The movie points out a truth about religious education in general, the use of fear to try to motivate teenagers to stay on the straight and narrow. Watch porn and you'll go to hell. Masturbate and you'll go to hell. Lose your virginity and you'll go to hell. The problem with that approach is eventually kids get to a point where they realize what is going on and all that goes for naught.Yet somehow most of us grow up to be good, moral people. And that is sort of the punchline of this story.I watched it at home on DVD from my public library, my wife skipped."}, {"id": 65, "text": "It's very funny be honest and I think everyone would been this when young. The characters and acting of stranger thing sister is very fit this story. Love it. The message hidden makes me feel more it's real that happening inside the community."}, {"id": 66, "text": "This film start with the introduction of the term salad tossing, and a female student Alice talking with her teacher scene! As turnout, this film is about Alice obsess with masturbation, after chatting online with an unknown person! Entire film full of boring conversation, and annoying overuse scene! Such as, overuse of the close-up facial scene, overuse of the dreaming of holding hand scene, overuse of the chatting online scene, overuse of the song playing at the background scene, overuse of the on screen singing scene, overuse of the cleaning scene, and overuse of the boring speech scene! Make the film unwatchable! Don't expect nude scene from the main actress! Certainly won't have! At the end, Alice confess she watching people copulate! She back to her house watching tape! That's it! Wasting time to watch!"}, {"id": 67, "text": "The evil Catholicism angle is tired. I kept waiting for the money shot, but no money shot. Natalia Dyer was appealing but not many other characters. This was totally unfunny with no real purpose for existing."}, {"id": 68, "text": "This is just another cutesy Anti-Catholic bigotry piece. Total garbage."}, {"id": 69, "text": "This movie is a complete waste of time, 1 hour is even too much for such!"}, {"id": 70, "text": "Yes,God,yes is a cute little film that shows coming of age story but in a little different way,film has some jokes and humor that wont work to everyone and if you are religious person you may even hate this film,cause it makes fun of such religious traditions and rules that people who live in that community must follow,the reason why this film was a fine watch was due great performance from or lead played by Natalia Dyer she stole every scene and she was also very cute and reletable,her facial expressions were also in some scenes also very cute and she made this film,Yes ,God ,Yes was a nice short film"}, {"id": 71, "text": "Poorly written, stereotypes all over the place and it's religiously overwhelming, definitely not a good ground for a movie unless you are Mel Gibson. Apart Danielle Dyer performance ... Nothing is really worth watching. Said so, up to you..."}, {"id": 72, "text": "The story is supposed to be about a girl who discovers her sexuality at a christian camp, but what happens in the end is she humps a broom a bit and uses her phone's vibrating feature on herself for all of 15seconds... There's nearly no kissing, no fondling, no sex, and then the movie ends. I just thought they left SO MUCH unexplored with this topic and the fact that the movie is barely over 70 minutes long doesn't help at all. How was this girl supposed to explore her sexuality if the viewer barely couldn't even explore the movie theater in the running time of the film... so overall, it's WAY too short and the subject matter isn't hardly explored. 5/10."}, {"id": 73, "text": "Bad casting, bland cinematography, and awful dialogue."}, {"id": 74, "text": "Watched it as it had the girl from stranger things in... kept watching and waiting for something funny to happen which sadly didn't happen and then it finishedThank you"}, {"id": 75, "text": "I'd heard buzz about this movie from various sources, so I decided to check it out on Netflix. It's about an awkward and shy teen girl going to Catholic school that is Hellfire and Brimstone towards sexuality of any sort outside marriage, but girl is going through a sexual awakening, so we have conflict.Now listen, this has the potential of working out. It's an interesting idea and a challenge that many teens have, especially ones who grew up Christian. But in execution, this is all over the place.The biggest problem is that the filmmakers seem to be more interested in the anti-Catholic sentiments than telling an effective coming of age story. I get it. There's a fine balance that needs to be had in raising teens in a confusing world and many Christian groups aren't the best with their approach. Which is why this premise isn't one that I have a problem with, even though I am a practicing Christian (although not Catholic). But every Catholic leader in their retreat felt so fake. Every time there was a sermon preached, it felt like the writers and actors hadn't ever been to a Sermon. It was super cheesy and awful. It made Christianity sound like a huge joke.Now maybe you are laughing at me. The Christian guy doesn't like the anti-Christian movie. But I just want a good movie. And all the Catholic characters felt fake. And all the teenagers in the movie also felt fake and purposely stereotypical. The only real characters were our main teen, played brilliantly by Natalia Dyer from Stranger Things, and the ex-Catholic lady she talks to at the bar who tells her how awful the Catholic church is. The fact that they were the only two sane characters who felt real made me laugh.So much like all those cheesy Christian movies with horrible acting and predictable storylines (I'm looking at you, PureFlix), this anti-Catholic movie just really misses the mark. I'd rather watch properly done coming of age movies like Eighth Grade where their focus is on making a good movie with real characters. So like I said in my header, conceptually interesting, but messy execution due to lack of focus on what makes these types of movies good."}, {"id": 76, "text": "A really solid coming-of-age drama that portrays the transition from innocent youth to world-weary adult in stark fashion, Yes, God, Yes blends sobering drama with charming humour and charisma in a short but punchy tale of personal growth and discovery.Combining perspectives on institutional hypocrisy and personal maturing, this is a film with a lot to say, and for the most part, it does a great job. Far from a preachy or even aggressive attack on those it discredits, it's a movie that's genuinely charming, heartfelt and tempered in its approach.Though it might sound like a strange topic for an 'inspiring' film to focus on, our young lead's discovery of the pleasures of masturbation are used as a metaphor for her coming-of-age, and discovery that the world she has been instructed by all her life is not in fact all-knowing.Taking this discovery as a cue for a quiet yet powerful rebellion against her strict Catholic community, she begins to open up to the wider world, as well as to the reality of how hypocritical those who seek to teach her rigid morality act.In that, the film isn't so much of an attack on Catholicism or Catholics themselves, but rather uses the extremes of the religion to showcase how damaging and hypocritical certain practices and ideologies can be on young people.Natalia Dyer gives a wonderful performance that sees her proving convincing both as a sheltered and innocent teenager as well as a quietly rebellious young adult, and it's through her that you really understand the hurtful effects of the hypocrisies of her elders, particularly given how free she becomes once she removes the shackles of her upbringing and begins to fight back.Dyer is funny and charming all the way through, and brings a soft, sweet presence to what could at times have been a very heavy watch. In that, Yes, God, Yes isn't quite as intensely dramatic as The Miseducation Of Cameron Post, which also looks at the consequences of extremist education, but it is just as charismatic and enjoyable as it is hard-hitting.Featuring a pleasant dash of '00s nostalgia too, Yes, God, Yes is a thoroughly enjoyable watch, with buckets of drama and thought-provoking themes taking centre stage over the course of a punchy 78 minutes. The lead performance from Natalia Dyer is wonderful too, and her blend of charisma and dramatic chops gives the film's sobering message an uplifting and even inspiring edge."}, {"id": 77, "text": "Disappointing that it's sort of just another coming of age movie, taking the tropes and side characters that you usually see in those movies and using them pretty ordinarily here. With the premise it had, I really wish it had been funnier, crazier, edgier, or just a little less predictable.It falls into that annoying category of dramadies where it's neither particularly funny or particularly dramatic (I call it Entourage Syndrome, named after how lazy that show could be when it frequently didn't commit to either comedy or drama).Most of the performances are okay, and the brief length keeps it from being too dull, but it was a slight disappointment, even if not bad.Oh: and it doesn't capture the time period nearly as well as something like Ladybird. Sorry to compare it to that, but overall that was a much faster, funnier, more emotional, and far better paced movie in general."}, {"id": 78, "text": "You know those comedies where, in retrospect, all of the funniest parts are shown (i.e.; spoiled) in the trailer? Yes, God, Yes one-ups this annoying and actually portrays (in the trailer) very unfunny parts of the movie as if it will be hilarious when you actually see it.And that is my biggest gripe here. This is very much not a comedy. There may be a funny moment or two, but I came into the film expecting something similar to Saved! And then spent the whole film not laughing &amp; being upset at every lost opportunity for a great funny moment. I can only guess that the writer/editor did not actually intend this to be a comedy at all.As a sort of coming-of-age drama, this may be a decent flick, but when I was expecting a comedy, I just spent the whole movie feeling very unsatisfied. Even as a drama, the pacing is very slow/off - at one point I had to check how far into it I was. 2/3 through and it still felt like just barely the introduction.Decent acting, but unless you feel this story speaks to you personally, skip it."}, {"id": 79, "text": "I never attended a Catholic school, but I have been part of the youth group and even served on retreats.First the good stuff: Natalia Dyer. And that's it. That's it.The film has a message. And it's a good one. But it throws it in your face and hopes you're comfortable with it. Things that are captured in the film do happen. That's totally true. But not like that. The script is based on throwing scene after scene at you where the church is being hypocritical and, as I say, it's a good thing. It's a good message, and it's something that happens. But you don't have to show it that way because the viewer quickly becomes disoriented and doesn't feel it's something real.All of these scenes are NOT good for anything. Just get past the window scene and NOTHING. Pass the computer scene and the bracelet, and NOTHING happens. Minutes later the great speech of our protagonist is about to come, where she will finally be able to gather courage and not shut up about what she has seen... NO. The scene is ruined by a joke and everything comes to nothing.Damn, I don't know what happens in this movie, but I feel that it has a good intention but a very bad script. If they didn't focus so much on giving everything to the viewer and trying to look superior in front of a specific type of person, it would have been something else."}, {"id": 80, "text": "I wasn't really sure what to expect when I went in to watch Yes God Yes, but it ended up being one of the biggest surprises of 2020 so far.Natalia Dyer had her breakout role a few years ago, playing Nancy on Stranger Things. Whilst it's fair to say that she wasn't one of the best actors in that ensemble, I really enjoyed her presence. The performance she gives in Yes God Yes isn't mind-blowing, but Dyer is more than serviceable and the character she plays is interesting to watch.The rest of the cast also bring in competent performances, with a special shout-out to Timothy Simmons as Father Murphy. Simmons played The Eagle in the TV adaptation of John Green's novel, Looking for Alaska, and he was equally as fantastic in that.The narrative of Yes God Yes was engaging, but it didn't break any new ground. The runtime is extremely short, clocking in at just over an hour and ten minutes without credits. I almost wish it was fifteen minutes longer, but I don't know what else they could have slotted into the story.The script was clever, thought-provoking, and provides plenty of questions for the characters to answer. I can't say that I related to the questions, but I can see this film having a profound impact on a certain demographic.Overall, Yes God Yes won't go down as one of the best films from 2020, but it was a massive surprise and I thoroughly enjoyed the film from start to finish. It gets a strong recommendation from me.SCORE: 83%"}, {"id": 81, "text": "It makes sense that movies like this would exist in our day, when there's so much widespread misinterpretation of the Bible, especially as it concerns sex. Here you have people who don't understand biblical Greek, reading verses that seem to condemn sexual immorality (a translation basically as cyclical as don't do what you're not supposed to do), and not knowing what to do with the fact that we have natural urges, as if God didn't intentionally make our bodies to work that way. If God designed us (beautifully, I might add!) and the clitoris has no function but physical pleasure, doesn't that tell us something about His view of pleasure?This movie is probably helpful for the people who grew up in a similar setting, where the Bible gets functionally replaced by human tradition, and by a judgmentalism that allows a group of people to control and shame other people. This movie is probably helpful for those who need a wakeup call, to see the idiocy and hypocrisy, and to pursue a healthy alternative.But what is the alternative? It's illogical to assume that Hell must not be real just because a Hell where one is forced to eat peas is silly. That's a straw-man fallacy. But that's basically what we get from the voice of reason character in the film. I encourage the reader to read the Bible for themselves, and see how it obliterates superstition, judgmentalism, illogic, shame, religiosity and fear.I'm glad I watched this movie... once. There's not much of a character arc here, so don't expect much in that department. And it's not really a comedy... unless it's an accurate depiction of your life and you really just need to laugh at yourself and your situation, and make a change.The highlight of this movie, for me, was how nostalgic it made me feel for AOL and Snake. Good times. Good times."}, {"id": 82, "text": "An honest, funny &amp; thoroughly relatable account of a young girl's sexual awakening, Yes, God, Yes is short, simple &amp; straightforward in its approach, and is brilliantly led by Natalia Dyer's sweet &amp; amusing performance. There is a sincerity in this coming-of-age portrayal and a proper understanding of that awkward teenage phase which makes this film both fun &amp; evocative.Written &amp; directed by Karen Maine in her directorial debut, the story is adapted from her short film of the same name but the larger canvas &amp; longer runtime offer her an incentive to spread out the plot, create new situations &amp; explore some more themes. However, Maine decides to not venture out further which in turn makes this film look like an overly long version of the more compact &amp; effective short.Much of the hilarity comes from our very own relatability to the protagonist's journey after she discovers masturbation, experiences sexual urges &amp; lustful desires for the first time and the feeling of guilt, confusion &amp; awkwardness that comes with it and is further exacerbated by her Catholic teachings. And the authenticity with which Dyer articulates her character's temptations &amp; inner turmoil is by all means praiseworthy.Overall, Yes, God, Yes commences Karen Maine's directorial career on a promising note and is a fascinating depiction of a young girl trying to figure herself out through her curiosities &amp; observations while also serving as a delightfully nostalgic trip down memory lane. Those who have already seen the short may not find anything new or refreshing about it but for the rest, this brief, breezy &amp; brill piece of work is definitely worth a shot."}, {"id": 83, "text": "I wish I knew the prospective of filmmaker Karen Maine's vision with 'Yes, God, Yes'. Even though I detest the 2014 film 'God's Not Dead', I at least firmly knew where I stood with it. In this case though I wasn't really sure whether she was taking a pro-religion stance, an anti-religion stance or simply a neutral stance. If I had to guess I'd probably go with the last one, but there were elements to the story that gave me hope that she was trying to show the faulty side of religion and how it can ruin the way people live their lives. I was glad she showed how hypocritical almost every character in the film was.I feel like 'Yes, God, Yes' was having trouble deciding what it wanted to be. At times it feels like it is going for laughs, other times it goes for deep and meaningful and other times it feels like it's trying to get a point across. The problem is that it never really commits to any of these concepts and so ultimately it just drifts along and will be gone from my memory by this time tomorrow I suspect. There was nothing this film had to offer that will stick with me.I didn't hate the film though. It is very short at only 87 minutes so at least it can never be said it outstays its welcome. It does bring up some interesting discussion topics even though I feel like I had to do the leg work in terms of the actual thinking on them for the most part. As I said, this film can kill 87 minutes for you, but don't expect too much else."}, {"id": 84, "text": "A moderately engaging but underdeveloped movie about a teenage girl who's horny as all get out but is being brainwashed by her Catholic community to believe that everything to do with sex is bad.The movie points out the hypocrisy rampant among religious people (a righteous priest and leader of the Jesus camp the girl attends is seen watching porn in his office), but it lacks teeth. The main character remains too subdued to be truly effective. I have a feeling the filmmaker was trying to keep it real and make the character believable as a timid teenager who's only tentatively flirting with rebellion. But the whole movie revolves around her and its success depends on us wanting to see her put a bunch of phonies in their place, which never really happens to the extent that would have made the movie truly satisfying.The film's best moment is a scene between the main character and a lesbian she meets at a bar who gives her a little bit of world wisdom.Grade: B"}, {"id": 85, "text": "On an antisex catholic camp, where they learn that spilling the seeds to barren ground and filling the womb with other things than a baby, or taking a walk on the wild side of the bush, threading the salat in front of god and everyone, thats a very nice recipie for a comedy that all of us neutral believers that doesnt live stringent religous lives can laugh of. this is my summary.its glitchfree in the act, the musical score are chosen with great care and underlines and protrudes the haresment of the sexual hypocracy that was and are today in i guess every dire religous order, in this case the catholic world.if i , the grumpy old man, still smiling from the thought of recommending this to my wife , had had a hand on forming the script i would have made it more juicier in word and action, but for the pretenscious this is far beyond the limit of good conduct anyway, so have a look, hands cuffed behind your back, because this is spankingly erotic and good fun. recommended"}, {"id": 86, "text": "On the fence with this one. The film is about a young girl having her sexual awakening while being told by catholics that its a bad thing. Saying that this is reminiscent of other work would be an understatement. There's a lot to it that feels ripped from films like Lady Bird or Miseducation of Cameron Post. The main story not only reminds me other films but the coming of age story at its heart just wasn't that interestingWhich I think boils down to the main character being horribly bland. Her whole purpose is to wander in between scenes and see things. She's an incredibly passive character that probably has less lines then most of the other characters. If the film needs her to see something hypocritical happening they wander her over to observe it. Then people get mad at her and we repeat this cycle over and over again.The film doesn't even reach 90 minutes and it still feels long. There's whole plot lines they have running through the film that we don't get to see the start of. Which means we have no idea what's going on. The whole lead up to the characters going on this catholic youth retreat is so tedious. And it's constantly rehashing the same material.I get it, God doesn't like people being sexual but the people preaching it are doing the opposite of what they teach. Haven't seen this before. It's all incredibly lame or boiler plate. At times so little was going on I would zone out and snap back having missed nothing. No one is particularly likeable (expect biker lady, who is introduced way too late), it's not that insightful on any issue, and everything it does a good job with I've seen done better elsewhere."}, {"id": 87, "text": "I must admit that I was expecting more comedy from Yes, God, Yes, but it was more heavy on the drama side. Which, I found a bit disappointing, because I had hoped to be entertained by a comedy, and not by a coming of age movie.With that said, I should also say that Yes, God, Yes is not actually a bad movie. It just failed to strike home with me, because my expectations were elsewhere. The movie definitely would find a base with a large audience out there, readily expecting the drama and coming of age approach. I assume young teenage girls with heavy religious backgrounds would definitely find appeal in this movie, given its storyline and plot.I will say that the cast in the movie were performing quite well. And lead actress Natalia Dyer definitely carried the movie a long way with her performance as Alice.However, I was only mildly entertained by what writer and director Karen Maine managed to dish out with this 2019 movie titled Yes, God, Yes.My rating lands on a less than mediocre four out of ten stars. I managed to sit through the entire movie, but I fell short of the target audience, so I wasn't really overly entertained or enjoying the movie. And this is not a movie that I will be returning to watch a second time."}, {"id": 88, "text": "What's interesting that Natasha Lyonne's performance as a Lesbian teen discovery (1999's But I'm a Cheerleader) was pioneering with a Y2K coming of age story. It takes place during a summer camp, using comedic tropes to discuss teen complexity. Then in 2004 (although not set during a summer camp) Tina Fey's Mean Girls had Lindsay Lohan's teen perseverance, followed by Saved!'s Mandy Moore teen awareness to now, Yes, God, Year's Natalia Dryer's teen model.There are recent teen discovery films Eight Grade, which is truly original and Boy Erased as the dramatic Teen LGBTIA+ film, it hard to say that Yes, God, Yes is that original.But Maine's direction is superb being this is a first full length feature (originating from a 11-12 min. Short). But it's story is not that original giving that in the 2000's there teen girl coming of age, like Bend It Like Beckham and who can't forget America Ferrera performance in Real Women have Curves.This film's nostalgic feel for Y2K era, may get an interest from an aging Millennial, or a curious Gen Zer on what dial-up internet looked like (pre-social media). But the true gold here is the performance of Natalia Dryer, coming strong and loosening up from her Stranger Things fame.Her projected state of innocence really helped this feature, what otherwise would have been a forgotten indie film."}, {"id": 89, "text": "Went to Catholic school most of my school years. There were a lot of inaccuracies, but overall, the vibe is on point. You can be a bit sheltered there compared to public schools. Most students however are not devout religious zealots. It's very cliquey, there is a lot of racism and classism. It's a cagey environment. There is a lot of bullying. I can see whoever made it probably never has ever been to a Catholic school. They transposed what would be a Baptist or Mormon school with a Catholic school. Maybe even one of those modern Evangelical churches. The father, especially for the late nineties, is way too young and hip. They're not like that. Most are very by-the-book and stodgy. I never once was offered to go on a retreat nor did anyone think it was cool.There was an odd scene near the end where a lesbian character in a bar tells Alice all of her issues will be solved if she goes to a college on the West or East Coast. Which is just absolutely stupid. Alice is not LGBT, she's VERY conservative and obedient to authority. Someone like her, with her Catholic school upbringing, would not like to live in a very liberal area. The whole scene was just an example of bad writing. Why was this character even back in the Midwest if she loved San Francisco so much?Anyways, it's a good watch, surprisingly wholesome despite some of the more taboo material. Other than that idiotic bar scene which seemed like a timid attempt at propaganda, this was actually an alright watch."}], "reviews_amount": 90}