{"name": "I Am Vengeance: Retaliation", "titleId": "tt08972556", "reviews": [{"id": 0, "text": "So bad it's hilarious. Acting is dreadful, dialogue is terrible!! We started it and decided to finish watching sadly because we don't give up."}, {"id": 1, "text": "Fighting scene mostly very nice.. but the story the plot seems too simple n too drag the same plot.. the movie scene just around the warehouse .. how the villain cant even just shot the hero because they already meet them almost 10 times in the movie"}, {"id": 2, "text": "This is one of the lamest un believable movies yet. I've never seen armed combat but I'm pretty sure shooting at people with a machine gun from 10 feet away is going to hit atleast one of them. Hand gun shooting at 20 30 40 feet and no one got hit?? Just not believable. I've seem prime time tv shows with more carnage and believable action than this."}, {"id": 3, "text": "Going into this film I just wanted to be entertained and that's exactly what I was. Vinnie Jones is always enjoyable and it's great to see Stu Bennett getting in the mix. This is simple fun, treat it as such and have a great time."}, {"id": 4, "text": "I really like Stu Bennett, he's very likeable and a great badass. This movie, however, is a major step down from the first one.Instead of continuing on with John as a lone wolf, very particular and focused (which fit him very well), this movie gave us a bunch of mediocre, cliche characters who took up a lot of screen time that should have gone to John.The two girls had some surprisingly good fight moves, but I still would have preferred the movie without so many side characters.I watch a lot of B movies, so I wasn't expecting a great movie here, but this was definitely a letdown. This one is for completionists, or people who like and/or want to support B movies. Just go in with super low expectations."}, {"id": 5, "text": "John Gold (character) reminds me of Ross Kemp in that episode of Extras! Lol.It's worth a watch. It's funny. Not sure if it's suppose to be 😃Was gonna give it 5 but added a point for comedy value."}, {"id": 6, "text": "It's obviously a very cheaply made movie, but it's redeeming feature is that there are plenty of fights, hand to hand - and two badazz girls who can (and do) take on anybody.The story? Not much, find a guy and bring him in.As long as you don't expect Hollywood gloss, this is almost like a low-budget Expendables, with plenty of action and enough firepower to fight a war. There is also some witty banter and funny one-liners. I rate it a 5/10."}, {"id": 7, "text": "The fill was very good for action fun and hint of Saturday morning wrestling from 80s with actors. Girls explode on the stage. Jones isn't big bad but let's others do it.Want more"}, {"id": 8, "text": "Good actionflick that never tries to be anything else. the story is workable, the acting is good, the action is prettymuch constant and well choreographed. Katrina Durden stood out to me, i think ill keep an eye out for more of her. anyway, if you are looking for a actionflick, this will deliver. if you are looking for anything else, you will not find it here."}, {"id": 9, "text": "The whole movie has been just a single action scene on the repeat. The only thing changing is the background. I don't think I have seen that many macho scenes in one movie since the 80s, dropping the gun to fight one on one, again and again."}, {"id": 10, "text": "So I didn't really know what to expect from this film, but I ended up thoroughly enjoying it! As a life long WWE fan, I'm always intrigued when wrestlers pop up in films and former IC champ/King of the Ring Wade Barrett (under his real name here) is great in this movie squaring up against none other than footballing hard man Vinnie Jones. Look, it's not gonna win any Oscars so if you're looking for arthouse, thought provoking, visionary cinema, then this isn't for you, but the action is great, it's non stop from start to end and entertaining as hell."}, {"id": 11, "text": "And no one can land a hit? This movie lent a lot for comedic purposes but it's hard to take it seriously when they say and do things that go against even the most basic of common sense..."}, {"id": 12, "text": "As a women watching this action film, i was highly impressed with the amount of female involvement, it was very empowering to see women involved in all the action and kicking some a$$! Stu and Vinnie portray their characters extremely well and I would love to see these two head to head again in the future. I was engaged until the very end and if you would like to see a film that has action from start to finish then this is the movie for you."}, {"id": 13, "text": "Watching I Am Vengeance: Retaliation was such a breath of fresh air. Haven't seen a great action for a very long while so was totally blasted away with the performances from Stu Bennet, Vinnie Jones, Bentley Kalu (sure I saw in Red 2) and stand out Katrina Durden. Think the show stealing fight between Greg Burridge and Jean-Paul Ly was particularly amazing to watch and be great to see these too go at it again in the future. Very reminiscent of those good golden era classic action films and really do hope we get to see more in the future. Let's keep action films alive"}, {"id": 14, "text": "Those who are giving poor reviews had either not seen the trailer or was expecting oscar level things in vod movie. This movie though on limited budget tried and quite successfully hidden the cheapness in settings with colourful camera work and delight to eyes. The acting is all right and the on liners are great. Vinnie is a veteran so he is all right. Katrina is the surprise package and with stu Bennett the action was awesome. The action choreography was nice. This movie will rank in better half of vod movies. Just go for it from a action fan"}, {"id": 15, "text": "John Gold (Stu Bennett) good guy must bring in Sean Teague (Vinnie Jones) bad guy. John and team go after Vinnie and team. Dun fight. Fist fight. Gun fight. First fight. Car wreak. Gun fight fight. Fist fight. Knife fight. Explosion. etc. etc. They needed to develop the story line better. Maybe a mole in the group. The fight choreographer must have been the script writer.Guide: F-word. No sex or nudity."}, {"id": 16, "text": "I''m talking about fights and mayhem, Brothers! These are guys with big 5 pound swinging balls that know how to use thy stuff, Bro's! They big guy in the movie can fight with they wrestle, he can kick like a John Cloud Van Dame, he can box like Ali, he can Kung Fu like Jackie Chen, and he can shoot like a cowboy. My wife like the full frontage nudity and liked his python which big even for a dude as tall as him. And he knows how to use that thing to please the blond girls, BOTH! They fights is REAL and they alls can MMA like the best. They acting is so great that this will get some awards! The story is the best that even seen in a movie. I was stomach sick when I went to my friend house to see it on his TV. By the end I was not sick any more! It was that good."}, {"id": 17, "text": "Director Ross Boyosk has a certain style influenced by some of the funniest action movies ever such as Tango and Cash, and he takes this to the next level with his action packed films full of witty dialogue. Are you supposed to believe that any of this mirrors reality? Of course not. This is a roller coaster ride film with fight scenes, and moments of buddies helping buddies even when they're not really buddies. If you like bravado and fast paced complete and nothing but entertainment, you'll enjoy this film. It ain't perfect, but it's worth the ride every time."}, {"id": 18, "text": "This film is essentially one long fight scene with plot delivered on the move and that's no bad thing. The set-up is quick and once it gets going the action doesn't let up. There are some incredible fight scenes in this film and the action directing and choreography are superb throughout. There are also some funny moments and the occasional nice character touch that elevates it above similar films that take themselves too seriously. I had a lot of fun with the film and think the filmmakers did an amazing job with a limited budget. It's refreshing to see an action movie that actually contains some real action and I would definitely recommend watching it for that reason."}, {"id": 19, "text": "Good action british film and good to see the likes of vinne Jones and Stu bennett back in action. A must for fans for just them actors alone. Lots of action"}, {"id": 20, "text": "Excellent action Sequences with awesome choreography. Well delivered comical timing in dialogue. Qdos on casting rising star Sam Benjamin in a break out roll worthy of his talents."}, {"id": 21, "text": "10/20/2020 I watched the old 2018 version of I Am Vengeance along time ago and remember it as being an OK watch, but this new and definitely NOT improved 2020 version really SUCKS. The main character played by Stu Bennett aka Wade Barrett is not a believable actor, nor is he a Brad Pitt wanna-be look alike (pretty he's NOT). I quit this 2020 really lame version at about the half way point (yes, it's that bad). Bon Appetit'"}, {"id": 22, "text": "This has to be one of the worst action films of all time. Bad script, horrible acting and nonsensical and lousy fight choreography - this movie has it all. It is so bad as to be laughable."}, {"id": 23, "text": "It's the worst film I've ever seen. I started laughing it was so bad. Comes to Something when Vinnie Jones is the best actor in a film."}, {"id": 24, "text": "British writer &amp; director Ross Boyask observes all the conventions and clichés of bullet-riddled 1980's B-movies in his I Am Vengeance (2018) sequel aptly entitled I Am Vengeance: Retaliation (**1/2 OUT OF ****), with Stu Bennett reprising his role as the indestructible John Gold. Bennett wrestled professionally for WWE from 2007-2016. At six feet six, towering above most of the cast, the bearded Bennett resembles a stereotypical lumberjack without an axe. Meantime, he wears outfits like Arnold Schwarzenegger wore in the Terminator movies. Bennett appears as agile with his wits and fists in any slugfest as he is juggling knives, pistols, and assault rifles. Indeed, as gigantic as Bennett's John Gold is, you'd think the villains would have no trouble with killing him. All they have to do is aim high to take out this big galoot. I Am Vengeance: Retaliation is a better than average, but formulaic melodrama where the bad guys outnumber the good guys, but they have a tough time killing enough of the good guys. Presumably, inferior marksmanship accounts for these guys missing a man who presents such an accommodating target. The henchmen fare no better off tangling with John Gold (Stu Bennett of Dead Man Down) in hand to hand combat. Mind you, Gold takes a smack every now and then to make things appear competitive, but this palooka winds up trampling them like a rampaging dinosaur. I Am Vengeance introduced the John Gold character, and Boyask must have been inspired by Michael Hodges's original Get Carter (1971) with Michael Caine as a revenge-driven mobster in search of his brother's killers. Similarly, John Gold blows into town to avenge the death of an old army chum at the hands of some bloodthirsty veterans peddling narcotics to the locals. Nevertheless, you need not have seen Vengeance to appreciate Retaliation.I Am Vengeance: Retaliation boasts a bigger budget, and Vinnie Jones of Lock, Stock, and Two Smoking Barrels makes a more menacing villain. Comparatively, the R-rated Vengeance clocked in at 92 minutes, while Boyask stages even more contentious firefights and close-quarters combat clashes in this profane, 82-minute, R-rated sequel. Happily, the Retaliation fights are orchestrated with greater polish and aplomb. For the record, Vengeance was strictly a one-man army revenge epic with our hero smashing a narcotics racket. Actually, John Gold was wounded at one point, and his enemies often reminded him about that soft spot. In Retaliation, our brawny hero heads up a team rather than handles the job solo. The only holdover from Vengeance is Mark Griffin. He reprises his role as Gold's boss Frost. He relies on satellite technology to track Gold down to a London night club where our hero takes no prisoners during a brief fracas. Initially, Gold wants nothing to do with Frost, until Frost shows him a photo of his old nemesis Sean Teague. Gold thought Teague was dead. Gold remembers Teague when they worked together in the Department. Teague turned traitor, left Gold in the lurch, and defected to the opposition. Gold is shocked Teague is still very much alive and smuggling arms. He accepts the mission to abduct Teague and pack him off to a black site prison. Nonetheless, Gold abhors the prospect of bringing his old adversary in alive. His intel and contacts alone, argues Frost, are enough to bring down the baddest of the bad. Meanwhile, Frost promises to wipe Gold's slate clean, so he can stop dodging the Department.Frost's two agents, Shapiro (Sam Benjamin of Justice League) and Lynch (Phoebe Robinson-Galvin of Black Site), accompany Gold, and the three surprise Teague at his makeshift hideout in England. A model of efficiency, this firefight qualifies as the best because the good guys hit what they shoot. Gold takes Teague into custody. No sooner does it look like smooth sailing ahead for our heroes than Boyask complicates matters. He throws in a mysterious, loose cannon, James Bond type, female interloper. Jen Quaid (Katrina Durden of Kick Ass 2) wants Teague dead because he murdered her father. Our heroes are loading Teague aboard a van when she draws a bead on them. Everybody ducks for cover when she starts shooting at them with a telescopic sniper rifle. Our heroes elude her until engine problems force them to make a pit stop at an abandoned factory. She follows them. Again, Quaid tries to kill Teague. This time she brandishes a LAWS rocket, a disposable, hand-held, single-shot weapon which fires a 66mm unguided anti-tank round. Predictably, Quaid pulverizes the van, but Gold, Teague, Lynch and Shapiro escape injury!If Quaid didn't pose enough of a problem, Teague's well-armed henchmen and his bosomy blonde fiancée Pearl (Jessica-Jane Stafford of Dragon Kingdom) appear and pandemonium erupts. At one point, Gold challenges Teague's henchmen with nothing more than a baton. Predictably, Gold kicks the crap out of them. One of them isn't so compliant, and he puts his gun to Gold's head. The leader, Renner (Bentley Kalu of American Assassin), orders him to pull the trigger. When the henchman's automatic pistol jams, he shouts stoppage. Naturally, fortune favors our hero at this critical moment. Sometimes, both the good guys and bad guys blaze away, but miraculously miss each other. Afterward, they opt to make it more personal. Shedding their firearms, they flaunt their martial arts skills. Since more henchmen are on hand, Retaliation has bigger and bolder ambitions. For instance, during the introductory nightclub scene, Gold whips five guys. He shoots the first one for simply threatening him at gunpoint, then disposes of the rest without a qualm. The bad guys could easily have killed our heroes on some occasions, but they allow hubris to go to their heads. Watching Retaliation is like watching several The A-Team television episodes. Simon Rowling's impeccable widescreen cinematography makes Retaliation look far bigger than its low budget for a home video release. Robust but overwrought, I Am Vengeance: Retaliation lacks the tingling, razor-edged spontaneity of Boyask's earlier British gangster saga 10 Dead Men."}, {"id": 25, "text": "Acting is so unrealistic, a very poor played movie. What a waste of budget, with great actors such as the one who plays Teague, the quality should have been ways better."}, {"id": 26, "text": "Wow. My husband put this on without really finding out about it. We've just watched the first 20 minutes and it's the most diabolical diatribe we have ever seen. And he likes action and solder stuff too. Cheesiness extraordinaire! Watch if you have watched EVERY THING else first."}, {"id": 27, "text": "There is no proper flow throughout the film. The action is almost laughable if this wasn't supposed to be an action film I would think it was a spoof. Gun fights from 5 feet apart, acting seems labored. If I didn't know any better I would think the script was plagiarized from kids on the playground. There were moments when I honestly felt like a 10 year old telling his friends about a movie he saw would do a better job of delivering an action story."}, {"id": 28, "text": "The acting's so wooden, fight scenes look like practice runs. Disappointed vinnie had signed up for this"}, {"id": 29, "text": "Get past the first 10 minutes which are downright stupid and it gets marginally better. Clearly on a very low budget and all one location with laughable firearms effects and pyro but several decent martial arts sequences, notably form the two female leads. Stu Bennett is likeable and would fit in well to any army / action / Expendables type movie. I can imagine a couple of the actors (I don't count Vinnie Jones in that category) must have struggled to deal with such terrible writing and dialogue, Starts off as a 1 out of 10 and finishes as a 4. More locations would have helped and minus 1 point for the inclusion of Vinnie Jones, but I guess there are some who would watch the movie just because he's in it..."}, {"id": 30, "text": "Most of the action and fight scenes were mostly good, (there were a few that were definitely absurd). Problem is throughout the movie it seems the director forgot what was going on. Example: There were times they were being chased by bad guys then the scene would change to them acting all calm on the phone like there was magically no urgent matter. The scene where Gold, with only a small metal stick for a weapon, walked up to four bad guys with guns and somehow beat them all to the ground is another example of directing absurdity."}, {"id": 31, "text": "A solid movie that reminded me of the throwback 80s action movies. Ridiculous in concept, completely bonkers with its action and some trademark one liners that raised a smile from me.The film has been locked for being essentially one action scene. Although it's a movie I've seen plenty of times with Arnie, Sly and co, it is still a fun experience to sit back and watch.Vinnie Jones and Stu Bennett have chemistry together that carries this movie. The supporting cast do their bit to keep this going but this is where I knock stars off. The cast is not deep with memorable characters, like the aforementioned 80s movies it is inspired by. And the plot, yeah it is not original.I will recommend to give this a watch, for the two leads, the violence and the sheer fun I had. It's a British action flick which isn't trying to hide what it is, for that it should be commended."}, {"id": 32, "text": "Without ruining the story but I have no idea what I watched. Another poor Vinnie Jones outing (must have been one of those I did it for the money jobs). Vinnie Jones's character Teague (a traitor to his team and country) is quite unbelievable and unintimidating considering the big up speech they have him at the start.The dialogue is laughable and a poor effort, lots of one liners but no substance. The fight scenes unimaginative and uninspiring. Supposedly supposed to be a great black ops team but you wouldn't think so from the quality of their attacks and getting beaten so easily (looks like the best rep is not deserved). Also you can see people taking a hit when a kick out punch is still a distance away - at least with wrestling you expect a fake pantomime coreographed fight but this is seriously poor action film making at its worst. All smart dialogue and no substance.Overall very predictable story and poor acting from pretty much Z listers.If they spent more time writing a decent script and less time coming up with stupid quips and time wasting dialogue this could have been much better. Two out of ten is generous - it would have been 1/10 if I haven't seen worse before. Also why all the pausing when attacking someone - coming up with a corny one liner seems more important.I wouldn't waste your time watching this when there are plenty of decent action movies out there. I'll update my review if it imprints but so far - half way in I am unimpressed and close to switching off."}, {"id": 33, "text": "The credits roll its exciting because Ross Boyask has Stu Bennett back as Gold with Vinnie Jones who will chew up the screen and Jean Paul-Ly will bring it and who will put the A in Action the one and only Tim Man. Now add the fact that the reason not only Gold will do the mission, to bring in Sean Teague (Vinnie Jones) the man who previously brought down his team but Teague, also has crucial information that could bring down the baddest of the bad. Now Buckle up for action, its gonna get messy. Ross has upped the stakes with some nice one liners that even the late great Sir Roger Moore would have been proud of. It was also nice to see Max Repossi and Lee Charles get some screen time with the latter getting a quick one on one. You'd be mistaken to think that Ross doesn't know how to get the best out of his Actors or their skills when you see Jean-Paul Ly desk bound but thankfully he's unleashed for the finale and hes eventually thrown into action and its worth the wait with a toe to toe fight with Greg Burridge in a pulse pounding fight fest. I am Vengeance Retaliation is just a full on, non stop action extravaganza, it has everything, chicks with kicks and 80 minutes of Non stop action I'm not sure you could pack more in but this time around, Gold has gone platinum."}, {"id": 34, "text": "Stu Bennet is an unstoppable killing machine and ultimately hunting down Vinnie Jones with the aid of a small mercenary team in this sequel to 2018's I am Vengeance.There is A LOT of fighting in this one, with a focus on hand-to-hand combat, peppered with gunfights. Writer/ Director Boyask keeps things moving at a fast clip and manages to interweave plot detail and exposition expertly into the action, so it never feels anything less than a mile-a-minute.There are some areas where the film dips, such as the painted-on muzzle flashes on the guns, and the characters - both good and bad - somewhere have decided that when they're fighting, that they must drop their weapons and go old school with their fists, but without it we wouldn't have all the inventive action, and wodnerfully choerographed and lensed action sequences.I Am Vengeance won't win many awards, unless they're for stunts and action, but if you're considering watching this, then it's presumably because you want an entertaining ninety minutes.The other 1-star reviews here have missed the point, or are trolls. It's Stu Bennett vs Vinnie Jones, the latter in particular has some very funny one-liners, so if that pricks up your ears, then you've found the right movie. 8/10"}], "reviews_amount": 35}