{"name": "Songs of Solomon", "titleId": "tt08910408", "reviews": [{"id": 0, "text": "I saw the short clip and felt emotional since Armenians live with the pain of the Armenian Genocide that took place in 1915. Until this day Turkeys are killing Armenians. I'm excited to see this movie and for all my non Armenian friends to see it with me."}, {"id": 1, "text": "I had the pleasure of watching this touching movie about Komitas, an Armenian composer touched by the ugliness that befell his people in the Ottoman Empire in the late 19th and the beginning of the 20th century. I hope it earns the Oscar."}, {"id": 2, "text": "An intriguing story of a young man with an exceptional gift for music but a tragic life."}, {"id": 3, "text": "This is a must watch for anyone. The film circles around Komitas, an armenian priest, music composure, taking place from the late 1880s to the horrific events of the 1915 Armenian genocide. The way the director went about filming this movie was amazing."}, {"id": 4, "text": "A heartfelt story about a musical genius that unfolds amid the tragic events that took place a century ago."}, {"id": 5, "text": "I am so happy to see a movie made about Komitas, it is an incredible homage. His life is very interesting and he accomplished so much. I understand now why Armenians idolize him. Brilliant movie. Touching movie and kept me entertained the whole time. Armenian music is beautiful!"}, {"id": 6, "text": "Amazing work showcasing the musical genius of Komitas (aka Solomon, an Armenian priest) intertwined with the historical tragic events of the 1915 Armenian genocide."}, {"id": 7, "text": "Amazing movie, historically accurate, amazing acting, makes you feel like you're living with them &amp; thru them. This movie will change how you view the world. So fitting with the present tumultuous climate in the caucuses. The human aspect is on full display in this movie."}, {"id": 8, "text": "Truly a brilliant depiction of the life of Komitas and his compositions. This is a beautifully told story of a remarkable man who had to endure many hardships throughout his life including witnessing the Armenian genocide."}, {"id": 9, "text": "This is a must see! Absolutely Phenomenal!! Make sure to watch it!"}, {"id": 10, "text": "It's so refreshing to see things that are based on truth ... finally a truthful account of the global atrocities perpetrated by the Ottoman Empire... the cultural side of the genocide ... since it's based on true events it's absolutely heartbreaking to see all this but facts must me spread and truth must come to light !"}, {"id": 11, "text": "The way they portrayed the story of komitas was was perfect and it's crazy that it was true story of one the saddest moments of human history"}, {"id": 12, "text": "Must watch!!! Truly inspiring. What a wonderful tribute to Komitas!!"}, {"id": 13, "text": "Be prepared to be taken on an emotional soul-enriching and fulfilling journey of the Armenian people's history!"}, {"id": 14, "text": "I cannot wait to watch this movie because Komitas life was sad but very inspiring."}, {"id": 15, "text": "Based on true events.... this amazing move will take you through an emotional roller-coaster. You will experience feelings, and learn about the atrocities that were committed to an amazing, fun, cultured and loving group of people."}, {"id": 16, "text": "Indeed a wonderful movie and the story touches every ones heart, a must watch, I mean A MUST WATCH :)"}, {"id": 17, "text": "If you haven't seen this movie, then you're missing out! The story is told from a historically accurate point of view but expressed in such a poetic, artistic way. Will definitely win an award!"}, {"id": 18, "text": "It touched my heart, beautifully made piece. I would recommend all my friends to watch it"}, {"id": 19, "text": "What a lovely ode to a such a true and raw talent. This movie is inspired by true events and tells the life of Komitas and his work. Knowing it's based on true events, it's a lot to take in watching his upbringing as an orphan and the time in which he grew up and the hardships he faced that we cannot fathom today. It was hard at times to watch the atrocities he (and countless others) lived through as an Armenian man during a time of mass genocide against himself and his people. Highly recommend!"}, {"id": 20, "text": "The story of an artist, composer and priest who stayed forever in history. The story of Armenian genocide in 1915 which should never be forgotten. Learn history and enjoy the magnificent music of Komits."}, {"id": 21, "text": "WOW WOW WOW Interesting and based on true facts!!! Loved the trailer can't wait to watch it."}, {"id": 22, "text": "Amazing movie about the history of an entire culture and people that once there was an attempt to be destroyed. The film is about one of the music geniuses that is known, and his music is being taught in so many European music schools. The voices and pictures are so real to me, and i think the director did a great job trying to picture the life back then. Nothing is surreal in the movie except it could be more violent to picture the events better."}, {"id": 23, "text": "Great movie ! Put it on your list of movies to watch !"}, {"id": 24, "text": "What an amazing masterpiece! Solomon(Komitas), an orphan, who studied in Armenias' religious center and later went to Berlin to continue his studies. With his music and lectures he influenced many well known musicians. His work will live continuously. It's unfortunate that because of the Armenian Genocide Armenians lost most of his work, his inheritance. Also very sad how he mentally couldn't handle witnessing the Armenian Genocide. One starts to wonder how much his eyes have seen..."}, {"id": 25, "text": "I highly recommended this movie, such a brilliant movie"}, {"id": 26, "text": "Touching story based on real events. This movie gave me chills from beginning to end. I definitely recommend watching this incredible movie!"}, {"id": 27, "text": "An absolute must see. Make sure to watch it , greatly done 🙏"}, {"id": 28, "text": "What a phenomenal movie . So well written and directed about the factual history. I highly recommend this movie."}, {"id": 29, "text": "If you're Armenian you know this story very well. By the looks of the trailer this looks like a beautifully produced yet haunting emotional journey of Komitas. Looking forward to the U.S. release!!!"}, {"id": 30, "text": "People must watch this film it was fantastic. I highly recommend this film to anyone it is amazing. It is based on a true touching story. It is an incredible film that everyone must see."}, {"id": 31, "text": "Amazing movie, beautifully written and perfectly executed. You all need to watch this film, and be amazed at the original film work."}, {"id": 32, "text": "A must watch for anyone even remotely interested in history. Amazing story. If you haven't seen it, you should!"}, {"id": 33, "text": "Everyone should see this beautiful movie. It's brillant!"}, {"id": 34, "text": "If you like good classic movies, then this movie is for you. Phenomenal story of true events, that keep you on the edge of your seat, as they take you back in time to show you the songs of Solomon. Amazing-must-watch film!"}, {"id": 35, "text": "This story was written based on true events that occurred during the Hamidian Massacres in the late 1800s under the Ottoman Empire. Director, Arman Nshanian beautifully captures the forgotten history of the Armenian people. A very emotional film about one of Armenia's most influential composers, Komitas, who's music is taught to students of arts conservatories around the world to this very day.Story written by Sirvart Kavoukjian which was inspired by her grandmother's survival.10/10 would recommend!!!!"}, {"id": 36, "text": "Marvelous film an absolute must see. Such a powerful film."}, {"id": 37, "text": "This movie is about the iconic Armenian composer Komitas. It is based on true events. It stirs every emotion in your body and the music takes over your soul. It's a story that's is especially important to be shared in light of the recent war in Armenia. A true Armenian classic that I don't doubt will receive international acclaim. A must see for everyone!"}, {"id": 38, "text": "The story aside which is a rich historic and emotional journey, the film is a beautiful production with a stellar direction.and phenomenal artistic execution."}, {"id": 39, "text": "A look at what evil really looks like. This was a PG movie compared to what really went down but it's enough to give you an idea of the history behind the Ottoman Empire and their agenda"}, {"id": 40, "text": "Amazing film. Really displays rich Armenian culture. Love to the 🇦🇲 People!"}, {"id": 41, "text": "I had the honor of watching this epic film at its private screening last year. As a first generation Armenian, this one hit close to home. It's based around the Armenian Genocide and focuses on the legendary music of Archbishop Komitas. It's powerful, dark and beautiful at the same time. It's no surprise that Armenia chose Songs of Solomon as its official submission to the 93rd Academy Awards in the international feature film category."}, {"id": 42, "text": "The story is extremely well-written and it follows the life of Komitas, an Armenian priest who lives through the Armenian Genocide. Well done, an absolute must-watch."}, {"id": 43, "text": "This is what needs to be watched no other movie's, watch for a benefit in life."}, {"id": 44, "text": "A story about a beautiful childhood friendship of Komitas Vardabet who was an Armenian composer, ethnomusicologist and priest, who lived during the years of the Armenian Genocide. This movie depicts his tragic lifestory and his beautiful music. If you never heard his music, you are missing out. Search it on YouTube - Sergey Khachatryan - Komitas, and give it a listen. Then enjoy this great film!"}, {"id": 45, "text": "Beautifully written and played with historical events of the Armenian genocide included. A must see."}, {"id": 46, "text": "This is astoundingly told and made, depicting the story of a remarkable man living through one of the darkest ages of human history, the Armenian genocide. It's absolutely a must watch movie!"}, {"id": 47, "text": "There are stories in human history that touch the heart and speak to ones soul. This is one of them. A tragic story so beautifully portrayed that must be seen! Can't wait for it to come out so everyone has the opportunity to see."}, {"id": 48, "text": "A must watch for all to see. Bring forth the constant denial and aggression towards Armenians, til this day Turkey denies the Genocide, which has been well documented by all."}, {"id": 49, "text": "One of the best I have seen in a long time, movie quality in my opinion has gone way down in the recent years but oh boy this told me that there is hope. This better get the oscar, the emmy, the grammy......."}], "reviews_amount": 50}