{"name": "The Opening Act", "titleId": "tt08633748", "reviews": [{"id": 0, "text": "This film gives a great insight into not only the world of stand up comedy, but what it is to go for you dreams. Many laugh out loud moments with this great cast, and a real depth to the story."}, {"id": 1, "text": "Seeing the casting, i was expecting this movie to be hilarious, to Laught My Ass Off, but all along the movie i was just smiling and having symphaty (just a little bit) for the main character.... I wouldn't say it's a bad movie but it' s not a great one either, it's just a comedy which is not fun enough to be a good one, and a movie not deep enough to be actually interesting."}, {"id": 2, "text": "The Opening Act resonated with me on so many levels. On the surface this movie is entertaining and enjoyable, however underneath there's a real quality to the story. You can tell this was made by someone who truly understands the craft of stand up comedy, because not only do you get the laughs, you're also left with something special. While I found myself laughing a lot throughout this movie, I also took away a lot of deep insights into what it is to be a comedian, and what it is to really go for what you want in life. A truly hilarious and inspiring movie, loved it!"}, {"id": 3, "text": "It's refreshing to see different genres that Asian performers are involved in. A light hearted comedy and tolerable to watch through, with appearances of Ken Jeong and Cedric the Entertainer. Try it."}, {"id": 4, "text": "I loved The Opening Act, it's so funny :D one of the best comedy movies ever!!! It has (like many movies) a message, that it's best to tell the truth, but above all it was very funny. This movie is absolutely hilarious!"}, {"id": 5, "text": "Tried to really like it. He received alot of chances for a not so funny comedian. Decent follow your dreams movie but not so realistic. Life is a little more cutthroat."}, {"id": 6, "text": "Amazing film giving insight into the trials and tribulations of making it as a stand-up comic. With a film about stand-up, you'd expect scene after scene of polished, fall-out-of-your seat comedy &amp; laughs. This is not the case with this movie. While there are some very funny scenes, much of the stand-up by the lead character is awkward and falls flat. And that's exactly the point. The film is about obstacles &amp; rejection, about finding your own voice, and about how difficult it is to create even just a few moments that can bring laughter to people's lives. Steve Byrne reveals the pain that lies beneath surface, the self-doubt, and the courage it takes to go after your dream night after night. Great cameos by lots of familiar faces, and a solid performance by Jimmy O. Yang. But the real revelation is from Cedric the Entertainer. Grounded and moving performance. The guy has real acting chops. Kudos to Steve Byrne for continually going after his dream."}, {"id": 7, "text": "Such a stellar cast and story. It captures the nuance of not only working as a comedian. but it captures the nuance of what it means to take that first step and follow your dreams! It was so dang funny and honest and real."}, {"id": 8, "text": "Will Chu (Jimmy O. Yang ) quits his day job to be a comedian. He gets a job at the Improv in Pennsylvania as the MC. He doesn't make much money, but it is his passion. He bombs a few times too and has to play wing man for the other comedians. The drama of film overshadowed the comedy aspect which I didn't think was very funny, just cliche nightclub jokes.Guide: F-word. near sex. No nudity."}, {"id": 9, "text": "Loved Jimmy and everybody else in this. Funny, great story that teaches a great lesson."}, {"id": 10, "text": "What a beautiful movie about the passion for comedy -and passion altogether. I loved seeing the roles being portrayed by comedy contemporaries. As heard on The Monday Morning Podcast and Conspiracy Social Club, TOA is a true to life look into the humble beginnings of a comic, based on director Steve Byrne's experiences. As a full time EMT with less than 10 open mic sets experience, this movie spoke directly to me, it shared my anxiety, fears, and doubts. It also shared the angst to escape an unfulfilling profession for an inner calling. What a good watch, will watch again!"}, {"id": 11, "text": "With an incredibly stacked cast of some of the funniest comedians working today, Steve Byrne captured the anxiety, excitement, and fun of jumping from day job to full time comedian. It's funny, heartfelt, and a beautiful love letter to the art."}, {"id": 12, "text": "Films and TV about stand up aren't always funny, but this one doesn't forget to deliver laughs in an accurate portrayal of a comic's journey. Casting actual comedians creates a reality and chemistry that could only happen from spending years together in comedy clubs. Entertaining, funny and a lot of heart!"}, {"id": 13, "text": "This movie is really good. Makes you feel as if you are walking through the life of a new stand up comedian and what they have to go though when trying to get a start in comedy. I love that they used real standups for most of the characters. Really fun movie to watch."}, {"id": 14, "text": "The story has an interesting idea, but is executed very poorly... slow and akward pacing makes the movie very boring. You see very early on that the director and comedian Steve Byrne has not much experience in directing and tries his best to put his personal experience with stand up on the screen. It has some funny jokes and the right message, but lacks in skill set. The acting of the most actors are terrible (and i am huge stand up fan and know all the comedians). The dialog scenes are little off and delivered poorly.I follow most comedians and their podcasts and was happy to see many known faces but it makes it even more dissapointing to see them in a bad movie."}, {"id": 15, "text": "Highly recommend this film for any standup comedy fan. Jimmy O. Yang is a great as a young dude trying to find his start in comedy. There's a bunch of great cameos of favorite comics &amp; jokes galore, but the movie also has a lot of heart. Great job by Steve Byrne!"}, {"id": 16, "text": "I enjoyed this film from top to bottom. Casted excellently, all the supporting rolls had me laughing through the whole movie. The story itself walks you through all the ups, downs and challenges you go through when chasing a dream. It was so much fun watching all the things I hear all my favorite comedians reminisce about in interviews and on podcasts play out on screen."}, {"id": 17, "text": "An honest look into the world of stand-up comedy and comedy clubs. Featuring an all-star cast, this film taps into life on the road as a performer. Fun, funny and real. Added bonus it was written and directed by a professional comedian. Definitely worth watching."}, {"id": 18, "text": "This is by far the best movie written about the journey of breaking into standup, but you don't need to know standup to enjoy. Just a great story of the sacrifice it takes to do what you love. Virtually every headliner working today makes a cameo. Hilarious movie, definitely worth the watch."}, {"id": 19, "text": "I just loved this feel good movie.Love the way it was shot it made me feel like I was in the audience at times. An inspiring story to follow your dreams even when people tell you they are over. There were times (a lot) that I laughed out loud and was something very refreshing for the year thats in hit. Hat tip to the crew who put this together. Ohio sucks ! Favourite comedy since Superbad"}, {"id": 20, "text": "I grew up in the 80's (born in 1973). Big fan of comedy because it was on TV so much growing up. HBO had a ton of comedy specials, and I watched them with my family and laughed, and had no idea how hard it is to become a comedian. I think this movie really explains how hard it is to get to the place where you're doing a special that's broadcast out to normal folk (I live in WV). There are no comedy clubs here. Great movie..."}, {"id": 21, "text": "Terrific film! Gives insight into the world of a stand up comic"}, {"id": 22, "text": "This movie is definitely worth a watch. It's funny, sad, cringy, inspiring."}, {"id": 23, "text": "Up until I saw this film, Being There was my favorite movie. It held that title for a long time. This movie is all heart. You will really enjoy the message of this movie. This is a must see!"}, {"id": 24, "text": "I appreciate when I see a movie about a comedian and it actually seems legitimate. This was smooth and great story telling. It's fun to see stories I've heard over the years from the great comedian, Steve Byrne, told on the big screen. My wife and I very much enjoyed it!"}, {"id": 25, "text": "Definitely one of the greatest movies I've ever seen, it is definitely worth rewatching more than once. If you haven't seen it already I can't recommend it enough, do yourself a favor and watch this movie. If you're a fan of comedy you cannot go wrong with this movie."}, {"id": 26, "text": "What an amazing cast! A story well told about moving up the ranks in the comedy world. The grind is real! I truly enjoyed every aspect of this movie! Well written and performed!!!"}, {"id": 27, "text": "Lots of fun and with an all star cast of many of my favorite comedians. Great entertainment and felt like I was getting a glimpse of the behind the scenes of the stand up comedy world."}, {"id": 28, "text": "This movie has an amazing cast from Cedric the Entertainer, to Jimmy to Alex. Not to mention an entire list of cameos from Bill Burr to Ken Jeong to Whitney Cummings. A true look behind the scenes at what it takes to be a successful stand up comic and the road blocks in the way. Funny and thoughtful/ Steve Byrne takes us on a nice ride in this brand new comedy."}, {"id": 29, "text": "For those who have ever worked at, done comedy at, covered comedy, or gone to a club to see live comedy, you need to check out The Opening Act - Steve Byrne's nuanced writing captures everything a comedian goes through during the beginning of their career and can be appreciated by anyone who has a dream being challenged by adversity. The actors nail Byrne's vision with precision and heart. And yes, and it's funny as hell!"}, {"id": 30, "text": "Gives you an amazing insight into the world of stand up comedy which a lot of films have tried like Punchline but failed to deliver. This movie makes you care about the actual characters as it very accurately portrays the struggles stand ups go through as a lot of the big comics in it all struggled themselves so it comes off very genuine."}, {"id": 31, "text": "A real genuine look at life on the road...the performances were great - cameos galore. Any fan of stand up should watch this."}, {"id": 32, "text": "Absolutely loved this movie, i was so scared for him in parts, totally unexpected emotional rollercoaster. incredible story, Jimmy O killed it, and great cameos from every comedian in LA it seemed. this movie was incredibly inspirational in a time incredibly lacking, thanks💜"}, {"id": 33, "text": "Some of the stand up bits are funny but there's no major laugh out loud moments for me. I don't know the fella this is based on, I just saw him on Bill Burr's podcast so I gave the film a watch. It does make it cooler knowing that the stories are all semi-true, especially the whole cop thing.Some great guest stars (as an Englishman I didn't know all of them though) and it is a nice story. But, now I don't know how far the fella this is based on is in his career (I probably should of looked that up before writing a review) but I assume it's further than where the film ends which I'll get to...It's a very nicey nicey film and I was never bored, but it seemed like this should of been a TV series to me. The closer and closer I got to the end, I worked out what the finish would be and that disappointed me a little as I feel it should of gone further into this blokes career. Which would of been totally possible in, as I said, a TV series.Worth a watch especially if you like stand up and if you know some of the guest stars in it."}, {"id": 34, "text": "Well, the 2020 movie about working in the stand-up comedy scene actually turned out to be better than I had anticipated that it would. I sat down to watch The Opening Act without really knowing what the plot was, nor had I actually heard about the movie prior to watching it. But I was given the chance to sit down and watch it, so of course I did.Sure, the storyline was sort of predictable and very straight forward, but it proved to be enjoyable enough. It is not something that will revolutionize the comedy genre, by no means. But it turned out to be adequately entertaining. However, it was the acting performances that made the movie rise up and out of mediocrity.For a movie that has the likes of Cedric the Entertainer, Bill Burr, Iliza Shlesinger and Ken Jeong on the cast list, then the movie was actually phenomenally carried by lead actor Jimmy O. Yang. He really performed quite well and rather believably as well. The way those awkward scenes where he bummed out on the scenes were just cringeworthy to watch, and he pulled those off phenomenally well. This was definitely his movie for the most parts.The Opening Act has a good mixture of both comedy and a good storyline at heart, so there is a little bit of something for just about everyone sitting down to watch it I think. There are some good jokes in the movie and definitely some good performances.This is, however, unfortunately not a movie that I believe has the contents to support more than a single viewing. Don't get me wrong here, because the story was good and the movie was entertaining, but the plot just doesn't really offer enough to carry more than a single viewing.My rating of The Opening Act is a six out of ten stars."}, {"id": 35, "text": "Simple, funny and overall entertaining; The Opening Act does a great job at offering viewers an inside look at stand-up comedy thanks to writer/director Steve Byrne's personal approach.In this comedy, an open mic comic is given the opportunity to emcee a comedy show opening for his comedic hero, but must decide if he wants to continue the life set-up for him or follow his dream.I loved this film. Not only do things look promising for lead actor Jimmy Yang, but comedian/writer/director Steve Byrne hits a home run. The way the movie is shot and the way it unfolds, you can clearly see how Byrne wanted The Opening Act to be different than other films about stand-up comedy and how much heart he put into it. The supporting cast is terrific and overall a feel-good film. If you love comedy, you'll love The Opening Act.Follow @snobmedia for more reviews!"}], "reviews_amount": 36}