{"name": "The Unfamiliar", "titleId": "tt08109470", "reviews": [{"id": 0, "text": "I don't know where this came from. The characters are fairly well developed. Minus one 18 year old daughter. A very spooky vibe in some parts. Twists and pretty good acting. Including the crazy Polynesian priestess. The CGI eyes at the end are lacking big Hollywood effects, but the rest of the movie was good. The tar, though. That was weird af."}, {"id": 1, "text": "This really rides right down the middle for me. Concept isn't exactly ground-breaking, but there was enough variety and differences to be enjoyable. Moves along pretty fast at times, but then will leave you questioning what just happened.Not the worst thing ever by a long shot, but not at all scary."}, {"id": 2, "text": "Izzy returns from Afghanistan with a mild case of PTSD. She is a doctor, soldier, mom, and an auto mechanic. Her husband Ethan (Christopher Dane ) is a professor at Oxford for studies ancient Polynesian history. He wants to go on vacation to Hawaii and return all his artifacts. They have three children, an older daughter from a previous marriage.Things happen around the house that Ethan claims is just PTSD. Izzy believes otherwise. Son Tommy (Harry McMillan-Hunt ) is acting a bit weird.There are other horror films with a similar theme. In those, you know what is going on. In this one, you have to use the clues which don't lead you to any kind of answer. You know when Izzy knows.Guide: No swearing, sex, or nudity."}, {"id": 3, "text": "After creating a comfy environment (popcorn, drawn curtains, blankets, lights off, sound on) I sat down to watch the much anticipated The Unfamiliar. From rich imagery to eerie sounds I was definitely intrigued. Needless to say, my popcorn bowl went flying a couple minutes in, that was the only real jump scare that I got, which I can appreciate.I felt that the movie had a strong plot BUT I would have liked some elements of the story and characters to be a bit more exposed. The cinematography was awesome and the movie score was impressive. Jemima West's performance was spectacular, I felt like she really leapt into her character and created a feeling of relatability for the audience.All in all, I enjoyed The Unfamiliar and would have loved to have seen it in the cinemas. The first few reviews I read do not do it justice."}, {"id": 4, "text": "Captivating, fun and a solid story. I enjoyed the bread crumbs that it left along the way. Great twists and an interesting mythology. Personally I'm a music lover so the score was something that really stood out for me too. Worth a watch!"}, {"id": 5, "text": "This movie was just bad. I dont believe any of the writer's, actors or crew had ever been to Hawaii making it hard for me to wach. The Brady Bunch Hawain curse telivision episode was much better. This movie is not clever not any attempt at a story that is original or compelling."}, {"id": 6, "text": "Literally the worst movie i have ever seen. absolute garbage."}, {"id": 7, "text": "I really enjoyed this film, it was a fresh new concept to horror, bringing together the impact of war and what it does to a person alongside the fear of the unknown when returning to a family you know but who are strangers at the same time.Visually I found it quite intriguing and appreciated the effort which had been taken to tell us the story of such an unknown culture and its own demons and urban legends.Well made and well received!9/10"}, {"id": 8, "text": "Okay, rodgers-09462. Your review, and I quote...Greatest horror movie ever made. REALLY! Tell me, is it comfortable under that rock you live? I'm saying that because you probably don't get out much. Because I can count at least a HUNDRED horror movies that are better than this piece of crap. Lets see about this movie. Boring. Uneventful. No jump scares. At no time was I scared. You get the picture, and by the way, I NAILED it as far as the review. As a game, my wife and I guess at what IMDB gives as a rating after we watch a movie. I guessed 3.9 and it was EXACTLY 3.9. Can I call a crap movie or what. Look, people, if you want a confusing, non-scary horror movie, this is what you want to watch. Me? I'm gonna go drink and try to forget I watched this dull garbage. Peace. P.S. Just so you know I watched it, IMDB, woman returns home from war as a medical doctor and finds out something strange is going on and it's not PTSD. There."}, {"id": 9, "text": "All entitled to our own opinion but this is just garbage it's so confusing it starts off and u think itll be decent until they change it up way too much and just twist things I mean come on.. why does the devil sneak around like hes in a spy movie."}, {"id": 10, "text": "I seen some bad reviews but still gave it a go and I have to say i'm impressed. I don't normally write reviews on here but I had to support this film as I would consider myself a big horror fan and i felt like the way they shot and edited this was original and refreshing. It was cinematic, creepy and will have you glued to the screen right to the end. I haven't seen to many indie films this year but if your like me and into original horror films this is one to watch for sure!"}, {"id": 11, "text": "People need to stop being so damn serious!Where is everyone's sense of adventure and imagination for that matter. What happened to just enjoying a film for what it is, taking in the story and letting your imagination run wild.I enjoyed this film, it allowed me to step into the mothers shoes and to imagine what I would do if I were in a similar situation, I felt her sense of fear and confusion, I appreciated her husbands resistance as the doting father, I respected the son for trying to protect both.The world has become such a serious place, everyone has something to say, can we all not just take a moment, sit back and escape into a story as it is presented to us?Visually the film had a lot to offer, especially when the actual transference took place, this was well executed and straight out eerie! Imagine being on the other side of yourself, another place where there is no sound but that of your voice and racing heart.I enjoyed it, it was eerie with a sense of the macabre and I wanted to understand what was going on....so it definitely had my attention.All in all, I will definitely watch it again come Halloween, when we are all seeking a little bit of darkness and a good old fashioned scare.It's a 8/10 from me."}, {"id": 12, "text": "The film starts off really well and has some spooky moments but once it gets to about the half-way point, it devolves quickly. To be frank, the last half is a total train wreck. They pretty much were just throwing all the possession tropes against a wall to see what would stick. The lead actress is quite good."}, {"id": 13, "text": "Had potential with a couple good creepy spots but not one good jump scare &amp; honestly the very end was EXTREAMLY predictable! I rate this as Junk with potential!"}, {"id": 14, "text": "There is bad, really bad, plain aweful and then 'The Unfamiliar'. Fell asleep after 15min"}, {"id": 15, "text": "The film house and associates must surely be rating this a 10... Hats off to them for trying to make the rating more appealing - get spambots to assist with the 10's for this was REALLY painful to watch ."}, {"id": 16, "text": "If you need to fall asleep at night! No thrills in this dull performance bore fest knock off."}, {"id": 17, "text": "Some of the plot elements are familiar, but I credit the filmmakers with creating an exceptional atmosphere of brooding malevolence. Some reviewers here have called the film dull but I disagree. It's methodical in its presentation and quite enough happens to liven things up. The cast also works exceptionally hard."}, {"id": 18, "text": "It's honestly the worst movie I've ever seen, the acting is so bad I can't even begin to describe.The cultural appropriation makes this already bad move even worse and leaves an aftertaste no movie should in 2020."}, {"id": 19, "text": "Here is a film like many others this year that are mediocre at best. i gave this a 5 star rating and it couldn't be better or worse in my eyes, i watch a lot of films and never go just on other reviews, yes i read others and bear them in mind as sometimes like on here for this film you see lots of negative reviews.sometimes i get pleasantly surprised when the film comes through as a good one, this didn't prove to be one of the best films out there but it kept me entertained, it was ok, and had a bit of a Hocus Pocus sort of storyline, probably best suited to be a Made for TV film and would never make it to the big screen.worth a watch, take it or leave it."}, {"id": 20, "text": "One of the best horror movies in 25 years. I've always loved slow dull horror cinema... But this one just took everything to the next level! Great acting, accompanied with fantastic script, superb cinematography and spine chilling background score. How much can be accomplished without showing even minimum gore in the horror genre, The Unfamiliar is the testament to that."}, {"id": 21, "text": "I don't like it and i don't know why this movie exist?"}, {"id": 22, "text": "This is littered with horror clichés that you find in many American horror films. A female antagonist Izzy (Jemima West) returned from war &amp; is traumatized with her experiences there &amp; she starts seeing unusual things in the house and with her family. Is this her PTSD at play or is there any validity to her suspicion?I guessed &amp; figured out the answer within 15 minutes of watching this movie. The amount of jump scares used during this film is laughable. I did not find it scary at all. The acting is ok but the script itself may have seemed better written than is presented in this film. If you want to watch a mediocre horror film then this world not be a bad choice."}, {"id": 23, "text": "It's amazing how some people on here can be so critical. I didn't think it was bad at all. I actually found it really entertaining and the storyline will have you on the edge of your seat to the very end. Henk Pretorius did a great job making this. It's a watch from me!"}, {"id": 24, "text": "Don't judge the movie by its cover - a very predictable and clearly low budget production. At least some money was spend on the cover to dupe the consumer."}, {"id": 25, "text": "Confusing, predictable, borrowing... I can't take this theme seriously, it is like a Herditary but with less pathos."}, {"id": 26, "text": "This is a pretty descent film with some genuinely thrilling parts. It's a supernatural thriller-horror. Not sure why some dumb dumbs are giving it 1 or 3 rating. It's a solid 6-7. I rather enjoyed it."}, {"id": 27, "text": "Now we could argue that the theme of the movie is so overused that there is no point in expecting anything truly great, yet, if you look at superhero movies you will find some, like The Dark Knight that make everything just right, and I really want to start this review, basing what I am going to say upon it.Yes, The Unfamiliar is not original, it has however a better, somewhat of a The Others vibe to it, managed to trick me into thinking something else entirely and for that, well my hat is off. The problem here is the fact that it reveals itself too early and tries and manages to offer a lot of action in the third act, but it felt unnatural and even bored me at times. The ending itself is a bit too out there, but not a deal breaker, but a worthy conclusion I guess, and that is about all I can say without revealing anything that will spoil the action for others.There are pluses, good actors/characters, good tension built in the beginning, some nice reveals, good offtrack throws, but they didn't really bring anything new, they simply did their job right but in the same way others done it before them. The people involved in the production of The Unfamiliar needed someone with more guts, that would have had the courage to go further and blend in some new elements here. All in all a good production, but still, nothing you haven't seen before.I do recommend it, it should be viewed by horror fans, goes down great with junk food and beverages and in the end, it will probably be soon forgotten.Cheers!"}, {"id": 28, "text": "*NON-SPOILER*Yes, this is a mid-low budget film. Yes, not many people have heard of it. Yes, it doesn't have huge named actors in it.But...... The storyline and acting in this is actually really good. If I'm honest, I was unsure on both fronts to begin with, but as the film got further along, you could see the talent on show.As for the storyline, I don't like to give away any spoilers, but it does start very quickly and you'll be wondering what exactly is happening. Things do develop and then explain themselves in time. It has genuinely creepy moments and moments of horror with a decent storyline to go with it.I would've rated this more but there are aspects to the film that let it down, like the lack of background on why what happens actually happens. Scenes jumping quickly from one to the next without any middle ground is another reason.Regardless, this film isn't less than a 4/10 which it's currently rated at, if you like horror and are open minded, it's definitely a solid 6."}, {"id": 29, "text": "The Unfamiliar was a horror movie that came and went without as much as a dent or a screech. I hadn't heard about this movie prior to getting a chance to sit down and watch it. And with it being a horror movie, and me being a huge horror fan, of course I found the time to sit down and watch the 2020 horror movie The Unfamiliar from writers Henk Pretorius and Jennifer Nicole Stang.And I will say that the movie was definitely off to an interesting start, but then everything just seemed to slip through the fingers of director Henk Pretorius, because the movie quickly lost its momentum and slipped well below mediocrity. In fact, towards the end of the movie I was more in surprise at how incredibly stupid the movie turned out to be than I was entertained. So I was definitely not blown away by this 2020 horror movie.For a horror movie then I will say that The Unfamiliar had promise and potential, but director Henk Pretorius somehow managed to thwart the rather nice build-up of atmosphere and events that were done early on in the movie. Come midpoint of the movie, I have to admit that I was about ready to call it quits on the movie. But I endured to the bitter end, and trust me, it was a bitter end. The movie ended up becoming something of an ordeal to sit through towards the end.The acting in the movie was actually adequate, especially taking into consideration the total lack of a properly written storyline and plot. So the actors and actresses were holding the movie afloat with their performances. I wasn't familiar with anyone on the cast list, and that is usually something I enjoy. But oddly enough, I didn't enjoy it with The Unfamiliar. I suppose it was because of the atrocious storyline.If you enjoy horror movie, you might as well give The Unfamiliar a wide berth. In fact, take the movie's very title to heart and let it remain unfamiliar. Trust me, you will not be missing out on a great horror cinema moment by missing out on this 2020 movie.My rating of The Unfamiliar is a mere, but generous, three out of ten stars."}, {"id": 30, "text": "There is currently so much uncertainty in the real world and it feels like there is nowhere to go to try and forget what is happening.I usually escape into film, horror specifically, as horror offers me escape from reality into an imaginary world encompassed by the adrenaline of fear, but from a safe distance, where I remain in control. The Unfamiliar offered me this escape, an escape from a once familiar world, now gone.Most horrors these days are a slow burn, so much focus on character development that you lose the plot completely and when the antagonist appears, instead of fearing them you feel empathy instead.With The Unfamiliar, it took me back to the days of old school horror making. What is the evil, will I get to see the evil, does it have a name, will it find me when I am asleep in my bed?I felt as though I was on a roller coaster from one moment to the next, waiting for something to step out from a dark corner when I least expected it. I didn't want to solve the mystery, I wanted to be scared....and I was.This film showcased a mother who would do what it takes to save her family, in-spite of her own safety and sanity. A feeling all mothers would relate to. In saying this I felt a sort of relatability with the lead character and at the same time felt her fear and confusion. Her character was very well written and performed in engaging this feeling from it's audience.The time and effort which has gone into researching myths and legends for the basis of this story has not gone unnoticed and if anything made me want to explore the story even more.In a world where online content feels recycled and limited, this was a great film with a promise of great things to come from the team who delivered it.Well done on a great film, well written, well acted and well directed.Don't read too many reviews, go find out for yourself, you won't regret it.7/10"}], "reviews_amount": 31}