{"name": "Broil", "titleId": "tt08997712", "reviews": [{"id": 0, "text": "I had the impression an OK movie was taking place in the background but I couldn't follow the dialogue or story because of the loud and intrusive noise of the music, I finally gave up about 20 minutes before the end."}, {"id": 1, "text": "Broil had been marinating in my watchlist for months. I finally decided to give it a try. Bad choice.. I'm surprised I actually finished this film. It was boring and unentertaining. Jonathan Lipnicki held is own, but the rest of the cast was pretty stale. Nothing really happens throughout the film. Just a bunch of corky dialogue and strange music. Nothing I'd recommend. 4 stars"}, {"id": 2, "text": "I've heard of planted good reviews but this is my first encounter of such, don't believe them. The music was way too loud throughout the movie. Really bad acting, except maybe grandpa. Horrible editing. I watched it till the end and regret it. I wish I could have heard what they were saying I would have understood the ending more, but the music was so frickin loud."}, {"id": 3, "text": "Shocking movie, makes no sense... awful.. acting bad, effects bad,"}, {"id": 4, "text": "Truly awful film, bad acting and the sound effects they through the whole film made my ears bleed. Do not waste your life watching this because you will regret it. Absolutely poor."}, {"id": 5, "text": "The movie is alright, didn't enjoy the out of order scenes, you didn't need them that way to enjoy the movie, just made it more tedious.The family drama and back and forth backstabbing was interesting. Could have gotten more elaborated but eh.Now, the unforgiving aspect of the movie is the LOUD music. I watched this to chill with a migraine, and just made it worse. If you lower the sound to not be murdered by the loud music you won't hear the characters at all, you barely even hear some sentences. Why the loud music seriously? It's so annoying and ruins your scenes."}, {"id": 6, "text": "Whoever got paid for the audio in this movie should never work in the industry again. I was flipping between 2% volume and upwards of 80%. Absolutely atrocious.As far as the movie itself goes, it's pretty uninteresting, wanted to turn it off about an hour in, but kept on pushing through. Wasn't worth it."}, {"id": 7, "text": "Had this movie backlogged for a while now, I decided to give it a try. I didn't expect it to be about vampires, which I love with my entire self. Don't listen to the bad reviews saying the sound is loud because thats literally the point of movies like these. The music takes you perfectly throughout the entire film. Expect it to be 50% like Twilight, 50% Dracula."}, {"id": 8, "text": "August Sinclair (Timothy V. Murphy ) is the head of the clan where everyone is named for a month except June's children, Chance (Avery Konrad ) and Lucky. Chance is the granddaughter who does not yet know the family secret, one where she must stay out of the sun and is constantly given blood. Not too hard to figure out the plot spoiler. They have an event called harvesting. A fest is going to happen. A chef (Jonathan Lipnicki) is hired to poison August. He is borderline autistic.It is interesting to watch the story play out. Who will win and who will lose.Guide: No swearing, sex, or nudity."}, {"id": 9, "text": "This movie definitely beat my expectations. Thought I'd keep it in the background but then couldn't stop watching it. Kept my interest the whole time, sound design was really well done. Director really understands this genre and how to keep the audience engaged. Great choices in casting as well."}, {"id": 10, "text": "Once again I found another by accident.It is unique and totally enjoyed it.Give it a try."}, {"id": 11, "text": "Definitely didn't know much about this movie at first. Couldn't really tell if them were demons or vampires. The name of the movie Broil didn't fit the film. Would of been a better film if the family turned out to be monstrous cannibals instead. Didn't fit my expectations though"}, {"id": 12, "text": "Director did a wonderful job Excellent cast . soundtrack was above average . Story opens a new realm for the dark arts and the light. well done well done indeed"}, {"id": 13, "text": "Worst movie ever....just plain bad acting....stupid plot....and should be burned"}, {"id": 14, "text": "Hi All, I have never given any movies 1 star before this is the first....If it was a low budget than we can take it as a low budget... This movie does not seem to be a low budget.The plus points. 1) The acting was OKNEGATIVE POINTS Movie was all over the place No explanation what so ever The killings that was done was not even shown There was little scary scenes if none at all. No action at all.Please please seriously do not waste your time with this...When you start the movie you think it was going to be OK than you continue and after watching it....you will definitely feel you wasted your time.This looks like a bad rip off from the movie THE HAMILTONS.Please.avoid"}, {"id": 15, "text": "Story is more interesting and complex than expected but doesn't quiet come together so smoothly. The grandfather and chef were clearly best performers.And as everyone else has noted, the music is too loud."}, {"id": 16, "text": "Characters and plot are interesting. The director tried his best to put in everything with its budget. But would be better if this movie has higher budget or made into a TV series!"}, {"id": 17, "text": "The film just starts, boom, I wondered if I missed something. I loved that. The acting is odd but totally committed. I loved that too. I questioned the time line so often which totally confused me. I loved that. The story is weird and I found myself questioning what I thought I was watching. I loved that. It's kinda gory and kinda corny and kinda vicious and kinda cheesy. I loved it.I didn't think much of this at first and found myself staring at it, captivated."}, {"id": 18, "text": "Enjoyed the story and the characters, all well put together. Also surprised by the end!A good watch, even if you aren't a large fan of scary movies. Everyone should give it a chance and branch out of the basic remake movies that Hollywood keeps spitting out."}, {"id": 19, "text": "The plot twist in the film is unexpected! Love the acting from the characters! And there are beats and places that scares me in the movie.. Will definitely recommend! :)"}, {"id": 20, "text": "This film start with a girl Chance talking about she born as a Sinclair, and her grandpa August scene! As turnout, this film is about a couple of a vampire family(June, and December) need to hire a chef Sydney to poison their father August in order to save their daughter Chance from the killing of August! Entire film full of boring conversation, and super annoying overuse scene! Such as, overuse of the hallucinate scene, overuse of the flashbacks scene, overuse of the annoying sound effect scene, and overuse of the dining scene! Make the film unwatchable! All the killing scene just show the blood after the killing, shaky, and messy! Make the film quite painful to watch! Barely intense scene is, Mickey shooting at November! At the end, all the family member of Sinclair dead, except April, and Chance! That's it! Wasting time to watch!"}, {"id": 21, "text": "Noisey and annoying, with incredibly bad script and acting.2/10 not in the mood for this level of stuff right now."}, {"id": 22, "text": "A decent attempt seems like an accurate summary of Broil, which is something like a film school project with a higher budget. The writing had great potential in an experimental sense, but the editing and direction seemed to suffer a great deal. Some shots were out of focus / blurry, but the cinematography overall was one of the finer points, IMO. I personally didn't experience the loud music that many are complaining about, and the sound effects fit fine. The visual effects clearly lacked a budget, and reminded me of something out of the nineties, like Star Trek: TNG or The Outer Limits. Wardrobes were well done. Some minor plot holes, but mostly a convoluted plot with some inconsistencies or goofs and bad makeup / blood effects. There were a few good castings such as Timothy V. Murphy, but overall most of the acting was 2nd rate or 3rd rate. Somehow I suspect the director did not put enough pressure and passion on his subjects. 4/10"}, {"id": 23, "text": "Broil exceeded all expectations, loved it. The grandfather scared the hell out of me. The sound design was weird but I got over it. Great cinematography, genuinely and sincerely moved by the story of the daughter finding out she's a vampire. The story stays with you, made me think. Best movie I've seen in quarantine.I'm watching it again now."}, {"id": 24, "text": "This is a strange yet intriguing film. It follows an unruly teenager that is forever in trouble at school but can avoid any consequences due to her family ties...It has an 1980s Vamp vibes in its making &amp; I can see a bit of Mandy in this too. It is like a darker Twilight but with a bite. There is an aspurgus character that has more of a character development than you normally see in films... It is worth a watch."}, {"id": 25, "text": "This is not what was advertised but in a good way. I wouldn't call it scary as I would say it's more of a haunting feeling and tone. Reminds me of The Shinning with a vampire edge. You get invested with the Chance arc and what her family puts her through. The chef character was interesting but the family story is freaky. Not enough of the family backstory though. Would like to see more of them"}, {"id": 26, "text": "Pleasantly surprised by this one. Kinda came in just for a fun horror flick, didn't expect to relate to my actual family as much as I did. We just don't have the whole demon backstory. As far as I know.I've seen Broil twice now and without giving anything away, the exact same moment broke me both times.Would be super interesting to see these characters in the future, or a prequel - the world feels a lot bigger than what we saw in this movie"}, {"id": 27, "text": "This movie is better than it's average ratings. I find the plot structure to be generally well done in light of the jumps that take place and the episodic sections of the movie. I can see how some people might find it harder to follow, but I think that would be in the case in many movies that are written this way and there are others out there. I think the acting could be flat at times, but was generally up to par for the production value. Some plot points could have been fleshed out a little bit more to help the audience and I wonder if the movie was cut down just a little bit too much for time. Overall, I would recommend giving this a watch if you are interesting in non-action supernatural-based movies."}, {"id": 28, "text": "This is a skillfully written, sensible plot story that instantly builds the characters.Very entertaining!"}, {"id": 29, "text": "This story was not the horror movie that I thought it might be, which was fine by me as I enjoy drama and character driven stories. It's a strange and unlikable family (for obvious reasons) but Chance (Avery Konrad) and the Chef (Jonathan Lipnicki) kept me engaged."}, {"id": 30, "text": "Excellent fantasy storyline with some twists towards the end. I'm scared easily and this was not scary at all so a very enjoyable 90 mins."}, {"id": 31, "text": "If you want something very different, try this. A bizarre little obscurity that will at first greatly confuse you, but if you stick with it you'll have fun. The first 20-30 minutes will leave you bewildered, maybe even questioning whether to go on or not. Almost like an (unintentional) Umberto Eco test.The premise itself is original enough to not require/warrant such an eccentric treatment. If somebody (competent) had done this story in a conventional manner it would/could have been a very good film too. However, the weirdness gives it a special something; it was a risk because it could have become a major drawback but eventually this decision turns out to be correct. In the hands of somebody less intelligent and/or lazy and/or greedy this premise could have failed abysmally, with or without the art-house approach.For example, the Soska sisters. They would have turned this premise into the usual nonsense; it would have been just an excuse for an orgy of sadistic violence and excessive gore without an iota of meaning or sense. Doubtlessly though, such a garbage version of this story would have had a much higher rating and been much more successful, because the dumbed-down Soska approach to film-making has a lot more adherents than this unique, much more intelligent approach. Because the vast majority of film-goers are zombies, especially horror movie fans who tend to be extremely stupid and misanthropic. After all, aren't most of them huge fans of Stephen King, the Master of Garbage? Sure they are.One smaller criticism I'd have is Dakota's character, who seems to be there as comic relief. I don't believe this movie needed any comedy, whatever little there is of it. Admittedly, Chance is a fairly ditsy character too.Which brings me neatly to another small flaw. Chance losing the battle to Dakota doesn't necessarily make sense. On the other hand, her failure to defeat Dakota could be excused by her reluctance to kill innocent people.The origin of Chef isn't entirely clear, though that is less of an issue than the fact that his sister lived and worked not far from him."}, {"id": 32, "text": "This movie starts a bit slow and you have no clue what direction it takes. Once you get into it, it will keep you watching. The writer clearly has been influenced by some other movies within the mystery and horror genre, The Man from Earth has been mentioned, I'd like to add 'He Never Died' as well.The well thought through story is what makes this movie stand out above the, mostly cliché vampire horror flicks of the last decade or so. You do need to stay focused to make sense of the whole story: the origins, history and grand picture. Together with the actors giving it the right feel, it gets a 6,5 rating, despite the sound track being somewhat poor and badly channeled (I had to use the 'normalize' feature of my sound system). Blood and gore/hack and slash isn't overdone, and that works quite well here (just wait for the surprise).Cast is certainly interesting, and well fitted for this movie. Grandpa August was excellent. There was some very decent SFX. The flashback editing part could have been a tad smoother. For a low-budget production, this is was well balanced.I can certainly recommend this, but watch it with subtitles if you can."}, {"id": 33, "text": "This movie is all over the place, and the music was incredibly bad and loud!!! I had to keep rewinding it, to try and make out some of what the characters were saying. Still I couldn't hear what they were saying at times.I ended up falling asleep almost halfway through it, and left my boyfriend awake struggling to hang in there and give it a chance.I later woke up almost at the end of the movie, only to now find my guy fast asleep next to me. LOL! So, I pressed rewind back to where I left off on it, b4 I fell asleep. I wanted try watching it again while I was well rested...just to be fair on my overall take on the movie. I struggled my way through, until I finished it. Whew!!!I liked mostly all of the characters...Especially grandad August, his daughter June, and Chef.It's a rainy night here, so I don't feel my time was a total waste watching it. It's definitely NOT the worst horror film I've seen. Just give it a chance, and see for yourself. You may really like it. Good luck!Cheers🥂"}, {"id": 34, "text": "It's not every day I stumble across a movie with no stars, no rating. I expected another failed attempt at a college film-school project. I have rarely been so delighted to have my expectations destroyed.This movie slightly reminded me of the Twilight series, with a bit of Hannibal Lecter mixed in. The overall effect was good, with much less of a teen-aged love-story flavor. Some of the themes and plot elements are definitely more in line with a more serious horror genre than that other, lighter material.Beautiful actors, acting, music, settings, and a thought-provoking story line. It's a little bit hard to follow all of the details at some points, but they do all seem to mean something, and they are not so many that you can't mostly keep up. Actually, I would watch this a second time, to finish examining some of the frayed edges. I suspect it would only lead me to a deeper appreciation of the quality of the fabric.A different twist on familiar themes of angels, devils, and vampires was original enough to be interesting - and avoided beating those subjects even further into the ground.Perhaps, after a second viewing, I would revise my rating of 7 stars upwards to 8 stars. I'll see if I get back to it again sometime in the future. I have a feeling that I will. This one stays with you for a little while."}, {"id": 35, "text": "This one feels like The Man from Earth (2007) only less captivating and genuinely, delivers very little. I get what they wanted to do with it, but it had little hopes to start with because a movie like this should rely a bit on some practical effects if not special ones, something that could be present at its climax thus the viewer would get a better grasp of the family. After listening to them talking for the entirety of the movie I would expect to be handed some insights as well, like their appearances and other traits, yet we get close to nothing on that also.So all in all, there is little to say about Broil as it is mostly a long conversation between the characters, with some different scenes every now and then, and that's it. One of the simpler movie I've recently seen, clearly not a horror but more of a drama really. Watch if but expect nothing of it and I still think you might get ripped off.Cheers!"}, {"id": 36, "text": "There are so many movies released that fall under the genre of horror, there really needs to be a unique angle for it to stand out. This has its moments, a sinister hint, a mother who isn't quite what she at first seems and a dysfunctional family. It genuinely had promise in the early stages. Although the jumping from scenes and music was a little jittery, I was definitely intrigued. AS the movie progressed and a slasher element was introduced, the movie lost its eeriness and intrigue for me. Some of the acting was suspect but a shout out to Avery Konrad who had a natural innocence as Chance Sinclair and particularly toJonathan Lipnicki as the chef, played in an almost autistic way, he was spot on. Almost futuristic at times, this was artfully shot and the music over the end credits was well researched. I just never felt this reached its full potential. Touches of the Adams family and Snow White in a loose kind of way, it has a place, just not at the front of the queue.My favourite line - Oh my God, please kill me before you finish that sentence."}, {"id": 37, "text": "The film isn't just downright awful but it could use work.The music is where they should start. It is overpowering and takes away from what is happening on screen. The acting was ok but with the music being so loud, making dialogue an afterthought, the way the characters interact seems off because you can't get a good feel for the dynamic taking place between them.The story isn't bad but the execution is odd. There is an attempt to make everything come full circle but parts are so vague that it leaves you with a lot of questions and wondering if you may have missed something.I may take another stab at watching it but after this first viewing, it isn't a film that I am overly impressed with. Most of it's credit is found in some of the acting, the underlying story and it being well filmed."}], "reviews_amount": 38}