{"name": "Black Water: Abyss", "titleId": "tt08010336", "reviews": [{"id": 0, "text": "The movie starts good the tension is there similar to the old Black water movie which was really good. But then pacing slows down and character decisions and actions are became annoyingly stupid a few times.There are some total unnecessary story lines. So yeah after 40 min i was really cheering for the croc...Not to mention the last act of the movie which was intentionally stupid or hilarious i couldn't decide.5/10 cause at least the atmosphere reminded me the old movie."}, {"id": 1, "text": "Black Water: Abyss is about a group of 5 friends who go exploring an undiscovered cave which happens to be the domain of a big man eating crocodile. There are 2 couples and 1 single guy. A huge storm causes a rock fall which blocks the way they came in and they have to find a way out while being picked off one by one while the water levels keep rising. The acting is decent enough and the effects are not great but are passable for this type of lower budget film.The movie starts off ok with a little character development and there is some suspense when the crocodile first starts stalking them in the cave. The movie then loses momentum and starts dragging way too much however and the situations become more implausible and predictable. At first it looked like the movie tried to avoid all the horror cliches and jump scares but in the second half of the movie those are pretty much the only things that keep on happening: cliche after cliche with jump scares in between. There is an attempt to flesh out the characters by bringing in unnecessary personal drama which seems contrived and only there to pad the run time. In the end the survivors make it out, get into the car and drive off straight into the water again where the same crocodile attacks them for the final time. And that's just dumb, unnecessary and there only to provide the last showdown with the predator that's been stalking them. Unfortunately it is not believable or well done so it cheapens the movie even more."}, {"id": 2, "text": "Pretty standard formula here; trapped desperate to escape a killer croc. What are you expecting exactly. Acting pretty good, the usual daft decisions in a film such as this are being made and even the unnecessary story line detour was fine for me. A few jump scares here and there...all good.Then there's the stupid ending. The survivors go roaring off in the truck and crash it right back into the river where they escaped. Obviously get attacked by the same croc and end up killing it.Why does it need this part in the film? Some form of revenge satisfaction to kill the croc? It's just a croc doing what it does. Would have been a better film if they'd left the stupid ending out. 6/10 without the crappy ending."}, {"id": 3, "text": "If you've read the title of this review, you've seen the movie. Forget about seeing any actual crocodile."}, {"id": 4, "text": "5 go into a cave. They get trapped inside because of a storm ( that they knew about ). A big croc is lurking and you can guess the rest yourself. Could've been a lot better but also worse. Was just glad to be back in the cinema"}, {"id": 5, "text": "I really enjoyed the other Black Water movie, which this one's title seems to be referring to .It's nothing like that film though; just a drawn out sequence of almost identical scenes , no storyline to speak of, and actors that are instantly forgettable ."}, {"id": 6, "text": "I left after 30 minutes. Boring, poorly staged, awful camera work. Just utter drivel"}, {"id": 7, "text": "Luke Mitchell is one of those actors that the camera really loves - especially when he is wet; unfortunately though, he isn't the only thing that is a bit wet about this. He leads a group of friends on a cave-dive in the remote Queensland forest where only days earlier, a couple of tourists had gone missing. Initially, all goes well until a thunderstorm above floods their caves and they find themselves on the menu for a particularly nasty crocodile as they try to get back to the surface. At times, the direction and lighting do create quite a tense, claustrophobic, atmosphere and it reminded me why I would never want to get into any sort of hole in the ground that didn't have an escalator and train at the end of it. The characterisations are poor, though - the usual melodramatic mix of personal sub-plots that all really just make you contemplate that maybe the croc is just performing a public service - and the wishy-washy ending sort of sums the whole thing up! I can't say it was worth the money to see on a big screen, but I reckon that is the only way to watch it - it will look very ordinary on the telly."}, {"id": 8, "text": "A cheap monster movie that isn't bad per say, but is boring to watch. It has 1 or 2 good moments, but the story is formulaic, the characters are bland, the family drama sub-plot is unnecessary and the dialogue and acting is passable at best. No horror (unless you're afraid of dirty water) and no real surprises or suspense. The ending and scenes with of the crocodile are ok, but nothing special."}, {"id": 9, "text": "Jen, you silly girl. Jen cant explain what happened to Victor, she just cries . Jen is cheated by her bf who gets the other girl pregnant. not now, before what we see. Jen is so clumsy, she need to get out of the water and its a step out high and she trips and hits her head to sleep so the other guy, not her bf, but the bf of the other girl, has to get down to her and gets the jaws. Jen. you should not even step outside your home, you silly charachter."}, {"id": 10, "text": "If your bored and have nothing else to watch then by all means go and watch this film, you could do worse but if you have other things to watch and miss this little title then don't panic your not missing much. I was hoping this would be much more edge of your seat tension but there was none. That's right no tension at all, in fact the last thirty minute I was praying the film to end. Now don't get me wrong, the cast and the story did nothing wrong but the film itself became boring quickly, nothing happened and that my dear reader is where the film falters. A basic adventure film, not a horror. Just about four stars."}, {"id": 11, "text": "Loved the first one, a 5.9 is ridiculous, it's one of the best survival horrors.Now, this one isn't as good, true, but it was still a decent follow-up, it's not Deep Blue Sea 2 &amp; 3 and Sharknado bad, anyone giving it a 1 needs to stop reviewing things.Now, i loved the setting, a lot more claustrophobic than the first, giving The Descent vibes, but i do take issue with a few things, there was no need in the affair sub-plot, it lead nowhere, one of them was dead before learning the truth, and it felt forced in to create unneeded melodrama, which lasted all of 5 minutes. The ending, absolutely terrible, I could've done without the silly crash, sure, let them believe they escaped and come across another croc but don't make them look so unbelievably dumb by crashing their car second after getting into it. One of them should have died too, realistically Jennifer, she still could've killed the croc but perished with it. And finally the CGI was shoddy when it killed Eric and Victor, when it picked them both up as if they were dummies, it didn't look convincing in the slightest.The rest of it was good fun."}, {"id": 12, "text": "Black Water: Abyss doesn't have much to offer in the killer-croc subgenre. The writing is shallow and the fates of characters quite predictable from the start; the crocodile scares get repetitive and the kills end up looking PG. When a film's plot starts with A group of friends explore.., you already know the word 'group' doesn't apply to its ending. It's always the woman (or the women) who survive in the end, right? RIGHT. No points for you! Throwaway entertainment, it is though."}, {"id": 13, "text": "So many haters in the review section. Don't know how much these people expect. compared to stupid movies these days, this is fairly good. Suspenseful and keep the viewer on edge."}, {"id": 14, "text": "Two of the reviews I read for this movie, one before, one after, were grossly unfair, so much so I struggle to wonder if people really care what they leave online. The movie opens with a startling 'forerunner' scene, and it's chilling. There are a few minutes of getting to know the cast, then the tension begins. Black water: Abyss is well cast, and the characters aren't irritatingly teenage or immature, in fact, they are very believable. I loved the lighting. I assume in modern terms there are a number of modern lights you take into a cave system, in any case, it worked well. Creepy reflections off cavern walls perfectly highlighted the horror lurking in the pools below. The croc itself is realistic, not massive as in Rogue, but big enough, and seen pretty often. Hats off to the actual attacks. I thought that very realistic. Black Water: Abyss was, for me, a very satisfying wild creature horror experience."}, {"id": 15, "text": "Whatever you wanna say about this movie, it definitely has restraint and doesn't over use the croc."}, {"id": 16, "text": "This is not too bad and the crocodiles look real. It's your standard crocodile thriller about a group of friends going spelunking and get trapped in a cave with a hungry crocodile but it's quite well done and the crocodile is shown just enough and it's not an exaggerated monster movie. There's some silly friendship melodrama but overall it was an enjoyable creature feature."}, {"id": 17, "text": "This is a fun ride with not much crocodiles. Most of the tensions work. It is not perfect but the experience is better than what they said!"}, {"id": 18, "text": "I'm struggling to find a good thing to say about this film - the characters are super annoying and none of them seem capable of acting scared which removes any speck of tension before it has a chance to form. its filmed really cheaply and essentially just shows the core cast gets to the cave - get trapped there and proceed to shine their torches at the water for long periods looking for the croc. it felt like the same thing over and over - the filmmakers completely fail to convey the sense of the dread of the water rising. its actually baffling how badly this film sucks.The film's tone completely shifts from serious monster / people in peril to syfy sharknado style for the last five minutes.I just watched Deep Blue Sea 3 and this film made that seem like JAWS"}, {"id": 19, "text": "This is the most stupid movie I watch lately, plot is like something scaring children, none makes scene. If you want to waste your time and money go and watch it, I can not believe people can make a movie from this POS."}, {"id": 20, "text": "I enjoyed the start, withe couple lost and arguing, and for some strange reason switching to argue in English, but as soon as the four main thrill seekers appear on screen, it all goes downhill.I can't remember the last time I watched a good monster in a cave film, there seem to have been quite a few. You watch for ages before anything happens, it literally takes about fifty minutes for anything to happen.I was genuinely glad when that crocodile got what it wanted. The good looking blonde dude was such a smug character.Toothless, 4/10."}, {"id": 21, "text": "Clothes always dry after swimming, or very quick dry?"}, {"id": 22, "text": "Too long, not scary, I laugh at the last bite, lame killing, totally a D class production."}, {"id": 23, "text": "UNDERRATED INTENSE THRILLER This is very much tension based horror, to describe what that means I would say it builds slowly and keeps you on the edge of your seat. I feel like it's a combination of The Descent and Crawl."}, {"id": 24, "text": "Seriously worth giving a miss especially the dumb ending where they actually die anyway making watching the whole movie a complete waste of time meanwhile Where are all the great movies people actually want to go out and see?"}, {"id": 25, "text": "How did this get realised theatrically!? One of the worst creature features I've seen. Don't bother wasting your time..."}, {"id": 26, "text": "For a road trip/exploring caves/man-eater horror it has the most absolute modern beginning: we're introduced to the first couple that is going to bite the dust with a small glimpse of the animal, then an aerial shot of the suburbs, rock music in the background and our main characters getting together for a great trip they planned, followed by a party where we find out that some of them have couple problems and at the end of the first act, they are into the woods. This is the new way to start a basic horror movie based on the fact that our characters are about to go somewhere, and you won't see anything different anymore.After this happens, Black Water: Abyss transforms into 47 Meters Down: Uncaged, because the development is absolutely the same: they go to explore this cave, mother nature interferes and they get trapped there and theeeeen, a man-eater appears. So they seem to have no way out, they need to find one, and surely enough some of them are not going to make it. And that's it, that's the movie right there.No the execution isn't great, the death scenes are quite similar to those from Jaws 4: The Revenge, where you can't actually tell what's happening, a lot of yelling is happening, the most common of twists you can imagine and one ending that was simply put, overlong. I mean, what was the point of the last 5 minutes, the movie felt quite alright without those, but sadly they did not know when to stop and it actually hurt the last act. Less can be more people, so let's keep that in mind.All in all, Black Water: Abyss is just as bad as Crawl in my opinion. A more recent croc movie I've enjoyed is Rogue (2007) and I do recommend that one.Cheers!"}, {"id": 27, "text": "5 Spelunkers end up tangling with a hungry crocodile in an underground cave system.Very tense movie in the dark.Small cast means the kills are farther apart.The crocodile footage is sparse and good. Way way way better than the latter Lake Placid/Anaconda movies and the Asylum films.This was a good time."}, {"id": 28, "text": "I wasn't expecting much and I wasn't disappointed. Just a stupidly poor mish-mash of any number of evil killer animal flix. Being stuck in a cave adds very little to the mix. But hey, it's my sixth month of lockdown."}, {"id": 29, "text": "If anybody can make a terrifying, white-knuckled, killer crocodile movie, Australian filmmaker Andrew Traucki is just the bloke for the job. He made Black Water (2007) and Black Water: Abyss arrives on video as a belated sequel to the earlier film. Mind you, unlike Black Water, which Traucki co-helmed with visual effects creator David Nerlich, he goes solo on the sequel. Basically, nature's predators share something in common with serial killers and slashers in that the chief mystery of those movies is guessing when who will die. In Black Water: Abyss, five attractive Australians-three guys and two gals in their twenties--go spelunking, i.e. exploring underground caves and searching them to see where they take them. Our protagonists lug along a minimum amount of gear because they are optimists who haven't planned for the worst contingency. This quintet is largely irresponsible more than imbecilic.They should have known better when they ventured into the bowels of the earth in primarily rock-walled caverns that a storm could cut off their escape route and lead to a worse predicament. Traucki and writers John Ridley and Sarah Smith set up this simple situation and for 98 minutes we watch as everything which can go wrong does to our unsuspecting protagonists. Anybody who has seen movies about nature's predators can imagine the obstacles that will inevitably confront these twentysomethings when they find themselves trapped in an underground cavern that fills with torrential rainfall. If this weren't bad enough, a huge crocodile is swept into these subterranean waters. The cast consists of largely unknown actors and actresses, with the exception of Jessica McNamee. McNamee co-starred in The Vow (2012), with Tatum Channing and Rachel McAdams. She has also co-starred in the big-screen version of the television series Chips as well as opposite Steve Carell and Emma Stone in Battle of the Sexes (2017). Afterward, he co-starred with Jason Statham in The Meg (2018).You can always tell when the ravenous croc is going to strike owing to the presence or lack of dramatic music to drum up tension. Basically, the four characters find themselves separated, and one must make their way across the shadowy water of the rapidly filling cave with the toothsome croc prowling the waters. This individual manages to swim the entire agonizing length of the cave without winding up in the croc's jaws. Afterward, it is primarily a matter of time before the cave floods completely and our protagonists are at the mercy of the hungry croc. The part that a seemingly innocent photograph plays in this dramatically charged moment cannot be underestimated. The scenes after two survivors escape from the cave deliver an added jolt of terror in a far more realistic predicament. Nevertheless, the Australian Tourism Authority will probably play down the chances of anything traumatic as this happening to foreigners much like the natives."}, {"id": 30, "text": "Bark stronger than its bite. Nothing much more to say."}, {"id": 31, "text": "Disappointed. Was hoping for another, huge croc eating both dumb girls at the end scene. Such a waste of creating perfect ending where dumb people die"}, {"id": 32, "text": "Worse film I ha e started to watch over the last ten years at least.Clichéd, terrible acting, nonsense storyCan't really say anything else as that's enough."}, {"id": 33, "text": "Starts off well but 30 minutes in becomes completely ridiculous. So called cave explorers. They'd be sacked by Health and Safety. Anyhoo if the main protagonist had been an alien rather than a member of the Crocodylidae family. Then from 30m underground they appear at river level???WTF???"}, {"id": 34, "text": "I really wanted to like this movie. I loved films like the Decent and the Cave, and hoped this film would have the same atmospheric and claustrophobic feel to it. It started off ok. Even with the predictably very good looking and enthusiastic actors this type of movie almost always has, blindly decending into an unexplored cave system potentially full of man eating croodiles with little or no equipment. You can forgive them for being niaeve. You wouldnt have much of a movie if they were sensible proffesionals. What not forgiveable is just how predictable and boring the film was. Their wasnt enough of the croc, and when there was it seemed like it was too expensive to make it look impresive and realistic in the attack scenes. So they used quick camera work and distant viewpoints on the scene to deflect and try and fool the viewer that they were watching something horrific. It just wasnt effective or scary. I just felt id missed the best bits. True to form in most modern movies the men in the film were all killed due to them being too weak, stupid or selfish to survive. Once the two timing girl said she was pregnant, you knew she was safe but the way her so friend drove her car after they had finally made it out only to land straight back in the water. She deserved to get eaten surely. Talk about turning a good turn of events into a bad one because you're in a mood. Needless to say they both survived, hugged each other in a show of sisterhood love and probably lived happily ever after with each other. Who needed the men anyway. This could have been great but turned out to be another forgettable b movie."}, {"id": 35, "text": "Who would give this over 5 stars? I am always amazed how many people give rubbish films a 10/10. This is predictable and at times a ridiculous film. One person's review hit the nail on the head. It's a film you can put on while you do something elseYou could not care less about the characters and you will soon find yourself checking your phone about 20 mins in. The highest praise should not be above 5 stars anything more than that I would ignore unless you have very low expectations."}, {"id": 36, "text": "Uninspired, uninventive, drab, dull, waste of the use of my retinas.Pointless subplots, mediocre performance I'm pretty sure the croc wasn't killed in the end it actually shot itself as it didn't want to endure the embarrassment of it's friends and family enduring this tripe."}, {"id": 37, "text": "No, really. The croc looked great. Very menacing. The characters however. Very poor and unnecessary plot lines. Did we really care one of the women is pregnant. I mean if she was in her third trimester, ok, sure. But just a few weeks, way bother? It didn't impact the storyline at all. The end was cringeworthy and predictable. Zero tension. I gave it a four because, hey, I liked the croc! Mediocre sequel in name only."}, {"id": 38, "text": "Look. If you're going to sit and watch a film about a man eating crocodile in a cave, please don't expect the best film ever made. With realistic expectations, I thought this was okay for what it was. It was anxiety inducing, the croc looked real and wasn't hugely over the top. There was some obvious storylines with the characters which I guessed within the first 5 minutes of the film. One of the guys seems to be obsessed with getting in the water and saying 'were going to have to swim'. The ending.. ok the ending was just silly. But. Its a fun film! If you fancy a film night with something that isn't too fancy, doesn't require much attention or thinking, this is the one!"}, {"id": 39, "text": "Well as the title says The first one was betterAs soon as I found out there was a second movie it really excites me a lot as the first one was so good although it's not a high budget movie. But boy, I really disappointed with this one.The movie try to create drama by having a storyline in which involving the characters having an affair. Apart form that, it offers nothing. The plot is so predictable and repetitive. Well at least the croc looks decent, at least for me.The ending? that is the most stupidest ending ever. if they leave it after they escaped with car that would be better in my opinion.Go watch crawl it's so much better than this."}, {"id": 40, "text": "It wasn't so bad as I thought, and not as good as the trailer makes it seem. But all in all it's a midrange movie, typical hangover Sunday popcorn5/10"}, {"id": 41, "text": "See you at the bottom. Bottom of a cave that is. That's where a killer crocodile is waiting for five guileless friends in Black Water: Abyss (my latest review). The croc is big, it's not too fake-looking, it's stealth, and it has a wicked first step.Anyway, Black Water: Abyss earns its title cause the water is indeed black and the abyss, well it's almost bottomless. Shot in I'm thinking Australia (it's the accents and the surroundings) and almost Hitchcockian in the fact that we don't see the croc fully until the last twenty minutes, Abyss is far from being prototypical but it still packs a small wallop. Heck, because of movies like this the only body of water I'm treading in these days is a pool.Not overly gory, not overly claustrophobic, and containing a psychological twist involving three of the protagonists, Abyss starts out as prodding until the crocodile VS human action gets heightened in the film's tension-filled coda. It's like The Descent meets Crawl meets Aliens with Abyss being the fiscally restricted, compact version of those three flicks.Directed by Andrew Traucki, featuring a well-padded film score by Michael Lira, and heralded as a sequel to 2007's Black Water (I didn't initially know that Abyss was a sequel), Black Water: Abyss gives the viewer enough reason to stay out of any loch and even more reason to avoid spelunking (that's the exploration of caves).Yeah the characters seem to have an endless supply of juice to keep their flashlights going. Yeah the croc-attacking jolts could be a little more startling and yeah, there's no sane reason why said characters would possibly want to enter a hazardous cavern (well there'd be no pic otherwise). Still, Black Water: Abyss somehow works as a low-budgeted, horror B movie made with limited production values that have admirable intentions. Cheers mate! Rating: 3 stars."}, {"id": 42, "text": "I have no affiliation with the movie. Hubby and I rented it on iTunes because I love scary cave and underwater movies. If you like the cave and the descent you'll like this. I thought this was better than Crawl. The pacing, acting and music were great as was the cinematography. I think we will actually buy it. If you just want to be entertained for 90 mins and not think about coronavirus this is a great movie for you."}, {"id": 43, "text": "DONT WASTE A MINUTE WATCHING THIS BORING MOVIE.TH ACTING WAS CHEAP"}, {"id": 44, "text": "There wasn't anything horror/thriller about this was just a waste of time for me ...just a drama that involves a killer croc that just wants to kill all of them for no reason ..it would likely eat them but then it just keeps tracing each of them one by one as soon as they get into the river plus the ending was highly dumb and unnecessary so nothing to see here keep it pushing!"}, {"id": 45, "text": "It started with some melodrama nonsense then I fast forwarded it several times and each time they were looking around caves looking confused which I found boring so I turned it off."}, {"id": 46, "text": "Watch only if you have nothing to do.a bad movie with bad graphics ."}, {"id": 47, "text": "I do not know what people expect these days on a low budget but massive CGI and loads of horror seems to be the remit but this is not often necessary and although this film has a few flaws it does what it says on the tin.It is not going to win any oscars nor does it pretend to, it is a simple but effective man vs wild encounter and although the characterization is minimal, the photography, acting and tension is adequate and I have seen a lot , lot worse...and I did like the ending even though a lot of reviews seem to think it is stupid but c'mon folks it is a horror movie, what do you expect...Duh!!!An average 5 out of 10 hatchets for this one!"}, {"id": 48, "text": "Truly, what a better place to have an infidelity argument than a cave with a crocodile that has just eaten 3 of your friends. If she had just pushed him in as bait after the pointless confrontation and escaped it would have made this movie a solid 8/10 for how fucking awesome that would have been. These characters all deserve what happens to them. They're all short sighted self centered horrible friends. Oh, and the cave they spend 90% of the movie in looks like a spa with water jets, kinda seems cozy."}, {"id": 49, "text": "This is the worst film I've ever seen. It made no sense, horrendous acting and storyline."}, {"id": 50, "text": "Like washing the car or going shopping, your time would be much better spent. The acting is fine but the story is the same old same old and it gets pretty boring. If you like this sort of thing Crawl does it way, way better."}, {"id": 51, "text": "This movie is scary and superb...if u are not a fan of suspense or do not like movies with reptiles doing the killing than this is not for u.... the suspense the graphic the acting are all spot on....it was like the Descent all over...this time with crocs...please watch this....."}, {"id": 52, "text": "Lacking the genuineness and originality of the first (2008), at least keeps the spirit. Average, not pretentious, here is what here is. If you're into a predator (crocodile) and prey (unprepared cavers) movie it's ok, ive seen worst, if not quite wait for TV..."}, {"id": 53, "text": "As far as cave diving horror movies go, The Descent, this was not.. But accepting a few too many overused tropes into the mix, it was a fun adventure ride. Especially if you think back to the midnight friday horror shows that used to be streamed"}, {"id": 54, "text": "Great acting, nicely put together, and nice to see a story with actual relationships. I don't know who the boneheads are who gave it 1, but clearly they didn't actually watch the movie. Not to mention some pretty awesome girl power. Nice work!"}, {"id": 55, "text": "Storyline was good but CGI according to 2020 was not so nice and No surprise attacks by croc ...A child will also know which time croc gonna attack in this movie .Plot should be a little bit better because last part was much better than this and have a good CGI as compared to this movie."}, {"id": 56, "text": "This movie is awesome. Very 'edge of the seat' stuf. I thought that the crocodile looked real in most scenes. Except for one or two moments. The acting was good. The look and the feel of the movie were good. The sound was great. And I totally believed this could happen, on a very, very bad day. Will watch again."}, {"id": 57, "text": "This movie while providing the viewer with some excellent film sequences at times, is just a totally unbelievable plot. The earlier movie of the same name, less the Abyss is far better.The goofs and filming errors are so often, that Blind Freddy could see them. I would struggle to even say this is a B Grade movie... it is barely that.While they tried to build suspense, everything that is supposed to be suspense was totally predictable... The viewer can know what is about to happen... no surprises anywhere. I found it tedious to watch."}, {"id": 58, "text": "What is the point of this stupid movie, same plot as the first Black Water: Two women survive, one of them pregnant and the other shoots and kill the Crocodile. Both escape and movie ends, Ridiculous 😝."}, {"id": 59, "text": "Anyone who has watched an incredible amount of crocodile videos on YouTube would understandably watch this and recognise how the makers of this film have no idea how crocodiles operate.The original film is clever. This is not. In no way does this crocodile exhibit any crocodile behaviour. A clever premise ruined by lack of depth."}, {"id": 60, "text": "I love a good tense water film. However whilst there were a few tense moments watching this film, i can't help but notice we barely saw a crocodile. I understand it's the directions of hiding a giant crocodile to make it more intense but i was expecting to see more of a crocodile considering it's about crocodiles! Even scenes where the croc mauled a character the camera was just everywhere i felt dizzy watching and not knowing what was going on at the moment.It was just too much of a mess for me to give it more stars"}, {"id": 61, "text": "I'm a big fan of these types of movies, so I'm kinda biased when I say I liked it. Honestly the acting was pretty good and the story was fine. The only thing kinda lame about the movie are the attacks themselves. Other than that it was pretty creepy."}, {"id": 62, "text": "Mr Traucki et al. continue to produce films of the same megabeast genre that improve with each iteration. This is their best work so far. Their films do not promise to be anything that they are not and provide very good entertainment value and I find a lot of the comments on this page very harsh. I would encourage Mr Traucki et al. to stretch their talents and attempt other genres."}, {"id": 63, "text": "Movie was all Hollywood and at last 10 minutes turned into Bollywood."}, {"id": 64, "text": "Final girl Jen (Jessica McNamee ) goes along with a group of people exploring a cave in Northern Australia. We saw a Japanese couple disappear there in the opening scene. They are excited by the underground cavern and lake until it floods blocking their way out and oh BTW they are not at the top of the food chain anymore.The film has some innuendos about the parentage of the baby Yolanda (Amali Golden) is carrying. Most of the production are the people standing on rocks at the edges of the cavern trying to figure a way out without being lunch. Good croc scene at the end eating folks, but not good enough to make up for the boredom.Guide: F-word. No sex or nudity."}, {"id": 65, "text": "Doesn't hold a candle to the first Black Water; take that as you will."}, {"id": 66, "text": "So, what is the point of making a film, when they cannot understand the main protagonists behaviour... lots wrong with this."}, {"id": 67, "text": "I was bored and wanted to waste time so I just watched it. Do the same. That ending though 💀"}, {"id": 68, "text": "Total and utter guff. seen it all before, trapped on dry land unable to get back to safety due to something with teeth and anger issues in the water, sharks or cros theyre all the same, you couldve scripted and wrote this film before you watch it. its boring and pointless, do not waste your time nor your money. garbage"}, {"id": 69, "text": "Never done a review on here and this film made me feel like I had to. Dont waste your time."}, {"id": 70, "text": "My 3/10 for this cheap unimaginative and boring C movie is just for the handsome lead actor who is nice to look at. The set design is 1 single small dark cave throughout the movie. Nice."}, {"id": 71, "text": "I'm so bored of these Horror flicks with really pretty Actors that are usually Australian or American &amp; are just typical &amp; boring now, so dull as actor's!!!!This is supposed to be a fun Creature feature but it's fairly boring but the Crocodile does look very good i admit that but everything else is just dull, it's ok to watch once but that's it. None of these Crocodile/Alligator films come close to the Masterpiece of that sub-genre LAKE PLACID 1999."}, {"id": 72, "text": "If You are going to spend almost the entire film in one location, make it claustrophobic, make the water a terrifying element. Instead we get an absurd drama with the occasional National Geaographic animal shots."}, {"id": 73, "text": "This move was dreadful. A complete waste of time. The CGI monster was laughable. Don't bother watching this."}, {"id": 74, "text": "This film start with two Japanese lost in the jungle, and both of them fell into a hole scene! As turnout, this film is about a bunch of friends need to survive in the cave with a crocodile in the water! Entire film full of boring conversation, and annoying overuse scene! Such as, overuse of the searching things scene, overuse of the blackout scene, overuse of the staring scene, and overuse of the swimming scene! Make the film unwatchable! All the action scene also just show the blood in the water! Make the film quite frustrated to watch! Barely intense scene is, Jennifer killing the crocodile at the very end of the film! At the end, only Jennifer and Yolanda survive in the film! Another sexist ending! Not recommended film!"}, {"id": 75, "text": ".. and not in a good way. It pales in comparison to black water 2007, rogue with radha mitchell and crawl 2019. Watch those films and compare for yourselves."}, {"id": 76, "text": "A bunch of friends go for a wild adventure to find themselves in much trouble in the abyss by a great monster. Just wonder was it a lesbian ending. I Love you? Queer!"}, {"id": 77, "text": "I should have written the tagline! I'm here all night."}, {"id": 78, "text": "Why don't they just end the movie after they got out the cave? I mean it's a good ending. Why did they have to jumped back into the river? And I don't see the reason why the croc had to die I mean that's the point of making them crashed back in to river right?It's not a bad movie tho. Acting's decent, but the subplot about cheating just makes things weird and the vfx is cheesy esp when the croc is about to bite the characters in half or whatever."}, {"id": 79, "text": "Just watch it, you will love it! It never over use the croco as some said! It is actually fun! And I love the ending!"}, {"id": 80, "text": "This movie is not that bad. But come on, Aussies, you can do far better than the old monster croc movie. Recently, I was very impressed with 'Relic'. Not so much with this one.The end scene here is what I expected, but hilariously ridiculous. After losing partners and having excruciating experiences in a cave with a blood-thirsty croc, you finally manage to get out and drive away.And what happens? You crash your car in the lake and meet up again with the old scaly friend. I know it's a movie, but you have to be the dumbest person on the planet to get into that position.Or the dumbest movie writer to come up with this ending."}, {"id": 81, "text": "Well, did we really need another movie about a group of spelunking people getting trapped underground with no way out, a rising water mass and a man-eating creature?The answer is no, not really. And the 2020 movie Black Water: Abyss from writers John Ridley and Sarah Smith didn't really impress much. Especially since it offered virtually nothing new to the genre, and there are other movies in the genre that proved to have more bite to it - pardon the pun.And director Andrew Traucki didn't really manage to muster up a story that was all that entertaining. Sure, Black Water: Abyss was watchable, but it was awfully predictable and generic. And that made the movie suffer.The acting in the movie was adequate, but the characters were slightly less adequate. But once you've seen one of these movies, you've essentially seen them all. And the characters in Black Water: Abyss were generic, sure.And for a movie with a man-eating crocodile, then Black Water: Abyss just didn't pack enough of a forceful bite. The scenes with the crocodile were just too far between, and there wasn't enough scenes with the man-eater. So it was slightly boring.I will say, though, that the crocodile was nicely animated and seemed very realistic. So that was definitely a plus. Just a shame it wasn't all that much in the movie.The ending of the movie was just bland and super predictable. It was actually a ridiculous ending to the movie; one that you saw coming a mile away.I am rating Black Water: Abyss a less than mediocre four out of ten stars. It offers nothing that we haven't already seen in other movies in the same genre."}, {"id": 82, "text": "Andrew Traucki, director of the somewhat acclaimed creatures features Black Water and The Reef, brings a sequel (only in name) to his first killer croc hooray. I remember watching Black Water way back when, and it worked on suspense, the limited location, the one woman's show, though still lacking some necessary sauce. This next part seems to be also relying a lot on suspense and fear of a force that's lurking unseen - the movie largely does so with lackluster energy, and a newcomer filler is a fair amount of melodrama, which didn't feel very welcome to me.Like many similar movies, Abyss kicks off with a pair of unfortunate tourists falling prey to the croc of the caves, it will be in his home we're going to spend most of the screentime. A home too plain, too evenly lit, barely succeeding to feel claustrophobic, consequently struggling to establish an atmosphere. Our protagonists are 5 rather stereotypical movie friends with typical plot problems and arches - one has to be prepared for soapy notes throughout. Story's simple and slow, ending does not hit any nails on the head, and all in all there's a predictable story riddled with minor bugs. While all this may be so, a good portion of people are probably most excited about the action and croc himself. Well, he hides. A lot. There's some cgi and some practical effects, and I'm not entirely sure about the partial usage of real crocodiles as it's known about the first Black Water flick. Abyss is a low budget feature, and action describes that, not the worst, but mostly heavily edited with close-ups, shaky cam, all kinds of cheaper substitute techniques. It's a killer reptile movie that's above the syfy-type, but below the better examples like Rogue or Crawl, though I'll admit the latter is not a lot about that realism. The cast consists of little known names who do a decent job, but little of anything manages to impress as the growingly tedious nature of Black Water: Abyss marches on for 90 minutes.I felt a certain disappointment for an anticipated movie coming from a guy who's biggest love and mission seems to be animal/nature/creature horror genre. If you have a lot of patience and are looking for utter realism in this genre movies, it might be worth giving Abyss a spin. My rating: 4/10."}, {"id": 83, "text": "The film is long, generic and absolutely uninteresting.I mean, a group of mostly inexperienced people decided to delve into a random cave and also bring a pregnant woman with them. You can't write characters that are more stupid that these, really.It was mostly fine on a technical level, but there's just nothing interesting about the characters or the story, no interesting locations, visuals, anything.I understand that maybe the creators wanted to make it look realistic and dry, but you have to have something in your film that will capture the viewer's attention, just having stupid people in it doesn't help, nor does help having a love triangle subplot in a crisis situation. And yeah, the ending is just ridiculously bad.As I scanned through the reviews it become clear that this is a sequel to a popular film I haven't seen (which is much better), so I'll guess I'll check it out as well.Surprisingly enough, this was a very weak attempt at a croc film provided that Australians have some really good films in the sub-genre, like Rogue (2007).This is very skippable. There's absolutely nothing in this that will horrify or entertain you in any way."}, {"id": 84, "text": "'Black Water: Abyss' seemed like an odd title to me, but I didn't click on to the fact it was probably a sequel until reading it was after seeing it. Usually I like to see originals before I watch their sequels, however in this case I don't suspect it will matter too much. An opening scene for any horror/thriller is so important. It sets the tone for everything to come. The opening scene is this film is about as bland as they come. Almost no creativity or effort on the part of the writers went into it. Everything that happens is as bland and predictable as you could possibly imagine. The film does get slightly better as it goes along, but it never reaches any great heights.I hate it when a character in a movie is said to be pregnant early on. It's supposed to make us care more about the fate of that character, but all it does it make them feel extremely safe. It does play into a side plot later on, but the movie would be so much better without it being there.The plot of the movie is basically a group being stuck in a cave, with a crocodile running rampant. That sounds like a fun movie. I was hoping for something more along the lines of 'The Decent'. But in 'The Decent' they felt genuinely lost underground and like they could be miles from getting out and only digging themselves deeper. It created an extreme sense of claustrophobia for the audience. In 'Black Water: Abyss' however, it feels like they have only just entered the cave when the trouble begins, and like they are always very close to being able to get out.There are a few scenes that create some genuine tension and the effects with the crocodile are quite well done throughout. Caving in Northern Australia sounds like the worst thing in the world to me and is something I'll never do, but I can handle watching a film about it. There isn't a whole lot to recommend about this one sadly."}, {"id": 85, "text": "Five friends set out on a caving trip, unaware that they will soon become prey to a crocodile and must fight to find a way out.If you are expecting anything more than exactly this, you will be disappointed.One thing in particular about this film that I really enjoyed was how it subverted my expectations. There were a number of moments where I fully anticipated something would leap out from the dark, only for the film to seem to recognise my train of thought and build up tension instead. The setting also helped contribute to this. I'm curious to know if this was filmed at a real cave, because it is quite convincing. There's some seriously gorgeous cinematography in the first act showing off as much as possible.The film also seemed to understand which characters you would like and which you would like to see killed off, and this made my experience of this film much more satisfying. They pull no punches, there is lots of bone-crunching, blood-curdling horror to be found here.Overall I think this will cater to anyone looking for a solid horror flick to watch with friends. But if you are looking for an intellectual film with strong characterization and writing, you are in the wrong place."}, {"id": 86, "text": "Blackwater Abyss: The amuse-gueule provides us with a couple lost in a North Australian rainforest, bright sunlight floods through the trees, still a sense of threat though, The duo fall through a crevasse into a waterlogged cave and are devoured by a crocodile.The starter is a group of five friends who enter the cave system through another entrance and advance through tunnels to the larger caverns. Calamity strikes as yet more water surges into the caves and a crocodile strikes. Bringing us to the main course when the rising water forces the friends to either shelter on ever higher ledges or attempt to escape through the flooded caves. Meanwhile the determined crocodile stocks up it's meat larder. The dessert is just a bit too twee. Some good scenes of leaping snapping crocs and gore, though the underwater filming is a tad too murky. Some good tension is built up but things become too much of a soap opera with the characters personal problems. A bit like Neighbours with a crocodile. Not as good as the original. Directed by Andrew Traucki, written by Sarah Smith and John Ridley. On Netflix. Can't give it more than 5.5/10"}, {"id": 87, "text": "Black Water: Abyss is nothing like the original 2007 movie, which was a bright, suspenseful and frightening production.This one has nothing to root for.(-) Poor production(-) Poor direction(-) Lame screenplay and plot(-) Average acting with unmemorable actors and terrible behaviors(-) Unrealistic events and happenings(-) Shy, observant, satiated and not so aggressive crocodiles with weak jaws!(+) Some nice wilderness and landscapes(+) Some tense suspenseful moments, quickly diluted in the horrible script(-) Women in the movie shouldn't drive(-) Men in the movie better play comedyA less than average film from Andrew Traucki, the director of the very good and tense The Reef (2010)"}, {"id": 88, "text": "When you go to see a film like this, you are an idiot if you are expecting fireworks, but it is nice to see something that exceeds your expectations from time to time.I saw this film because I am currently working a personal project involving jungles and elusive animals, and I had an affinity for movies like 'Rogue' and 'Black Water' when I was young.There is a bit of repetitive camera work in the opening scenes (lots of talking heads in particular), which kind of gives off a bit of a free-to-air TV show vibe. But that isn't something to get upset about given that we're talking about a partly government-funded joint released mid-pandemic.As the story got going, I was glad to see some inventive choices taken. This is despite the film having a claustrophobic simple setting and few characters with which to play. Going underwater in anticipation of the scares was a clever move and I loved when the crocodile's teeth became gradually visible through the murky water.I also wanted to mention, if I may, that I felt for the director on this one. No one grows up wanting to make a low-budget cash grab, a sequel to a film no one saw ten plus years ago. Something like this would tear you in half I presume. On one hand there are some cool ideas to play with, some creative uses of light to try out etc., but at the end of the day you are (probably) being paid to shoot a big croc munch on a bunch of people. Props go to the creatives behind this one. I had my eyes open for interesting filmmaking and I left the theatre satisfied."}, {"id": 89, "text": "REVIEW - DARK WATER ABYSSDuring these reviews one thing that crops up time and time again is lazy writing and I've got to admit that when trying to get buns on seats in theatres why?This latest film such a film.A group of young adults explore a cave system only to get trapped inside and my try and survive a crockerdile which for some reason has decided to live there,Crockerdiles are cold blooded and need direct sunlight to warm their bodies up or else they become dormant and hybernate, so why is such a creature who depends on sun light living in a dark series of caves, additionally all the way through the film with the group looking for the crock in the water in the cave they can't see its eyes and head above water?Lazy writing spoils films for me and if you are making a film don't have your protagonist act like a shark when it's obviously not, oh wait sharks are also cold blooded!So the suspense which was supposed to be there just wasn't and can guns actually fire underwear or when wet?Such a shame but as you will see from another review I'm going to post soon a similar story can be told well, but as for this film, avoid.Rating 5 out of 10"}, {"id": 90, "text": "Way better than any CGI infused Sci-Fi channel &amp; a six-pack movie.You need a dark room &amp; total silence to make it work. Maybe some THC infused substances too.Caving is fairly nerve shredding on its own without tipping Croc's into the mix.Uses the surroundings &amp; scenario the protagonists fund themselves in to great effect. You don't need much in way of special effects when low lighting, heavy breathing &amp; bubbles in the water do the trick.Same director as The Reef which is also very much worth seeking out.Cracking stuff."}, {"id": 91, "text": "Well, I have been looking forward to this film since I heard about it. I'm a fan of Andrew Traucki and his style. I love his first Black Water film, as well as The Reef, and I was expecting something more in line with those titles. And this is still within the survival horror genre, but it's a far cry from those earlier films. One of the things I love about Traucki is the use of live animals instead of CGI. There was some of that used in this, but it didn't translate well, and I do believe there were some dodgy CGI shots mixed in as well. Maybe having this take place in a cave system just complicated things a little, I don't know, but a lot of the croc shots weren't as well executed as the ones from the original. There were a couple of great moments where the real croc footage shined, but not many. The acting wasn't awful, but the story was a little boring. Overall the story just wasn't as believable. This was more of a typical B-movie horror type of film whereas I felt his earlier films kind of transcended that status. The earlier films were very believable, and had a level of realism to them you rarely see in this genre, mainly because of the use of actual animal footage. Bad CGI and poor writing can pull the viewer out of the experience. The idea had great potential, but I felt this film missed its mark partially for those reasons and didn't live up to the original film."}], "reviews_amount": 92}