{"name": "They Live Inside Us", "titleId": "tt08327630", "reviews": [{"id": 0, "text": "The film started well with two kids bicycling around n as they approach an abandoned house, hope starts to rise when they show a ghost near the window.... But as soon as a writer along with his physically challenged kid moves into the same house on a Halloween nite, the film became very predictable. We see the typical stuff, some same scenes over n over again, just two characters in a single location n nothing scary happens. Generous with a 4 for the effort cos this cud have been a good scary movie if they wud have added some new thing rather than the predictable stuff. U jus cant show purgatory stuff for 100 mins n expect fellas to get scared."}, {"id": 1, "text": "And I'm talking ten minutes looking at a bloody doorknob waiting for himself to open the damn door we know he's been meant to go through since the year dot. The entire script must have been made of up HOLDs. I think they thought it was arty? But any tension they managed to build up (which was very little) was lost in the hour-long breaks taken to look down a hallway or at a flippin wall. How many 'legs in the orange light under the doorway' and slack-jawed mouth-breathing darting-bug-eyed expressions can a viewer be subjected to? This question needs to be answered and communicated to the writer/director/editor/cameraman. Mind-numbingly boring and predictable."}, {"id": 2, "text": "Thin plot where nothing really happens and characters that are one dimensional. Actors are also horrible and deliver wooden performances. The set designs and music however are incredible, but sadly it's not enough to save this film."}, {"id": 3, "text": "Tries to be clever but is predictable &amp; boring. Doesn't sound like a particularly terrible review but when I say it is boring, I mean it was SO boring that I was ill, confined to bed &amp; this film was the most torturous part of my day."}, {"id": 4, "text": "Predictable, slow, awful acting. Don't understand why people keep reviewing it 9 or 10 unless they are people actually involved in making the film! It is truly dreadful and very boring!!"}, {"id": 5, "text": "A really great and fun indie halloween horror film! Spooky, well, acted, and what a great ending! holy cow!"}, {"id": 6, "text": "'They Live Inside Us' is the debut feature from filmmaker Michael Ballif. His previous work includes the anthologies series, 'The Witching Season', which focuses on stories specific to the Halloween season. The story is dark and complex but compelling. It also has moments of reprieve with subtle comedy. Ballif painstakingly captures not only the look and spirit of Halloween so wonderfully, he uses the film to pen a love letter to the horror genre and pay tribute to many sub genres within as well. This is a strong first feature for a young filmmaker. The practical effects, stunning cinematography, and incredible set design feel much more mature than a low budget horror film. This is definitely a film to check out."}, {"id": 7, "text": "I have always loved everything that The Witching Season has produced. They're a group of extremely talented people. I am so happy to see their first feature film! I know it will be the first of many.All the actors did an incredible job! They were casted perfectly. I especially loved the little girl! This movie is not only entertaining but also keeps you on the edge of your seat. It is a must see, especially if you love horror movies!"}, {"id": 8, "text": "They Live Inside Us is the type of movie that knows exactly who its audience is, because the filmmakers are so clearly fans of the genre. The film hits on all the right notes in all the ways horror/thriller fans will love, while maintaining a near-flawless execution of originality and tone. Ballif and Morris show all the characteristics of seasoned filmmakers here, making confident choices and trusting their material. While so many fans will speak for it, the quality of They Live Inside Us has already proven that it can speak for itself. And not to be forgotten: I laughed. A lot. It isn't a gore-y slasher film that never lets up, it's an homage and an adventure all wrapped up in one. It's easy to recommend They Live Inside Us, ESPECIALLY to fans of the genre. It's got a lot of something for everyone."}, {"id": 9, "text": "An indie horror made for Halloween lovers by Halloween lovers. For a modest film, it certainly packs a punch."}, {"id": 10, "text": "They live inside us was always my favorite story in The Witching Season and I'm so happy they made it a full feature... this is a must see!! James Morris and Hailey Nebeker were amazing. Whole lot of creepiness going on here. Thank you Michael Ballif and all of the crew, you did an amazing job!!!"}, {"id": 11, "text": "If you have issues with suicide, skip this. I really wanted to enjoy the film but that took any fun out of it for me."}, {"id": 12, "text": "If you love Halloween (who doesn't?) and are ready to dive into the season, this film is a great place to start. The cinematography is really amazing throughout the film, with settings that perfectly evoke that crisp fall, apples-and-pumpkins, spooky-costume excitation you had as a kid... progressing to the more adult terror of the claustrophobic caught-in-a-nightmare horror genre trope. Although the premise is novel and a bit mind bending (don't want to spoil it here), there's also a nostalgic nod to the classics - from haunted house and creepy characters, to the time-honored sheet ghost costume. The acting is really good. The clown is one of the most nightmarish I've seen. The character of the daughter is played with the spot-on preteen attitude. Although the pace does drag a bit in places, the dream-like quality definitely adds to the atmosphere and suspense. I really liked that the last scene brings the film full circle."}, {"id": 13, "text": "Wow. Once again the Witching Season team has created a wonderful cinematic story. This film will resonate with anyone who has struggled with internal demons, and the story is told in such a unique way. It's scary, but beautiful. Creepy, but profound."}, {"id": 14, "text": "Nearly all the 9 and 10 reviews are by people who have only reviewed this one film, surprise, surprise, and whose reviews are sad attempts to big up the film. Their reviews look like they were all written by a 10 year olds.When a film's producer needs so many fake reviews to promote their dross then you know that watching it will take years off your life.Avoid like the plague."}, {"id": 15, "text": "Nearly every review is 10......? Think I'll give this one a miss, probably overdid this one a bit guys. Hope I didn't miss the BEST MOVIE EVER......!"}, {"id": 16, "text": "They Live Inside Us is a fun, creative, and stylized indie horror film that has nothing but love for the genre as a whole. The fact this was based off a short segment from the Witching Season series, which I would highly implore others to check out, shows just how much of the story the filmmakers knew they could expand upon. There is a lot of passion and heart that is in this. They have the talent for the genre by exploiting tropes, giving nice homages, and allowing the cast to have fun with killer production design. Stoked to see what else they do."}, {"id": 17, "text": "I love the twist throughout and the foreshadowing weaved through the film. I'm truly impressed and love what this production company has done. Can I just say THE CLOWNS! Whoa! Great job!"}, {"id": 18, "text": "I couldn't say this is the worst horror film I've watched, because frankly I've watched some doozys in my time, but this was so boring. The acting, particularly from the main character, was so boring. Watching him try to find his words while talking to his daughter was like watching a kettle boil. The story itself had potential, but it needed a charismatic actor to carry it, and I'm sorry to say this guy just wasn't it. Not one I would grab off the shelf to watch again in a hurry."}, {"id": 19, "text": "They Live Inside Us mixes classic horror, inventive independent film-making, and Halloween asthetic into a fun, creepy film. The standard setup of a haunted house evolves into a creative plot with twists and turns that feel earned. The acting is solid throughout, and it's a showcase for young talent, especially the lead. If you like creepy movies with dark themes without the stupidity and excessive gorr common in many horror films, you will love this film."}, {"id": 20, "text": "Witching Season films always delivers when it comes to bringing Halloween to life and they do not disappoint with this film! The movie begins with a beautiful scenic fall setting and then fully immerse's you into the mystery that is the Booth house. This movie truly does have it all. I laughed, got teary eyed, jumped out of my seat and I enjoyed every minute of it! Every little detail put into the movie is done with absolute intention and with their fans in mind. So excited for this wonderful teams future projects and films!"}, {"id": 21, "text": "Wow! I got wow'd a lot more than I expected with this. I was impressed! I think certain scenes could've been cut shorter, but some of the acting pleasantly shook me and I really enjoyed myself. Great concept. I would've loved to see more emphasis on certain concepts of the plot, but overall? A great time. Well done."}, {"id": 22, "text": "This film has a vibe - a Halloween nostalgic charm that keeps you wanting more. The cinematography is superb. Acting and score is impressive. I look forward to watching this every year..... I haven't appreciated a modern Halloween movie this much since Trick 'r Treat."}, {"id": 23, "text": "Pleasantly surprised by how great this movie was. In a world of garbage superhero films and endless CGI, it was nice to see something so humble be so profound."}, {"id": 24, "text": "This movie is amazing. I absolutely loved it. It kept me on my toes. The acting was phenomenal. It had me scared and made me cry. It has such a great Halloween setting and feeling. Everything about it was great."}, {"id": 25, "text": "They Live Inside Us is a slow burn filled with amazing cinematography and a surprising and spooky twist at the end. Halloween lovers will enjoy the art direction, costumes, and attention to detail. Everyone loves a good haunted house story and this is the perfect remedy to get some popcorn, Halloween candy, and celebrate Halloween at home this year while getting a glimpse of all your favorite Halloween villains/monsters."}, {"id": 26, "text": "Those 1 star reviews have got to be from people that Think Saw is the best horror movie or maybe this movie was made for my generation. I feel Halloween and Fall pouring from this film. Its a Penthouse letter to the season and to to what fun horror is and can be. I feel the writers, directors, and cinematographers genially love what they are doing and remember the little nuances that make Halloween great. Nostalgia overload, it gives me a feeling of being a kid again."}, {"id": 27, "text": "If you experienced 1970s Halloween like someone my age did, you should be following WSF and everything they release. They get it! They Live Inside Us is an excellent film, and it should be part of any self-respecting Halloween enthusiast's collection."}, {"id": 28, "text": "Like the feel and tone of this movie!! If you loved the nostalgic Halloween of yester year. You will like this!"}, {"id": 29, "text": "Really fun horror movie. Clearly an indie-horror, but very very well made."}, {"id": 30, "text": "Awesome job to all involved with the movie! It's a fun indie movie with all the key ingredients of a Halloween thriller! Chilled me at the end!!"}, {"id": 31, "text": "This flick is not only a love letter to the spooky season but a confirmation that independent cinema is alive and well. The team behind this film (Witching Season Films) are operating at a whole other level. Check out this film, it's great!"}, {"id": 32, "text": "For How Much I Enjoyed This Very Well Acted And Made Indie Horror Project I Rate It A 10 It Was A Great Time I Had Also Been Anticipating This To Come Out For A While And It Was Worth The Wait! I Personally Loved It And Will Put On My Watchlist For Every October!!"}, {"id": 33, "text": "This haunting film from my friend Michael Ballif and the fine folks at Witching Season Films is an absolute Halloween powerhouse! It brings all the goods - a mixed bag of creepy treats that is sure to please fans of well-crafted, quality horror... They Live Inside Us is an artful, relentless barrage of nightmarish mayhem!"}, {"id": 34, "text": "This film brings back the scare of the original horror classics. A film that shows any independent filmmaker can go out and make a great film. Michael Baliff has done it again! Bringing the thrills of The Witching Season to the feature screen. I highly recommend seeing this film. The film is beautifully shot, acting is great and the story keeps you on the edge of your seat through the whole film. They live inside us is definitely one of my favorite independent horrors!"}, {"id": 35, "text": "This is perfect to get you in a Halloween mood or to watch on Halloween night. The movie also includes the 80-years vibes, and the soundtrack is fabulous. The story it's spooky and had some dark humor. It's definitely a worth watching."}, {"id": 36, "text": "This is perfect to get you in a Halloween mood or to watch on Halloween night. The movie also includes the 80-years vibes, and the soundtrack is fabulous. The story it's spooky and had some dark humor. It's definitely a worth watching."}, {"id": 37, "text": "I found Witching Season Films through their short YouTube videos. I instantly fell in love with their visuals; spinning ghost decorations, skeletons, graveyards, and other fall-themed treats. As a fan of those videos, I was excited to watch the feature film version of They Live Inside Us. It's great to see how much the plot has grown from the original short film. Various plot points are given new life and context. The narrative is fully fleshed-out, leaving room for interpretation. The visuals are a huge highlight in the film - keep a lookout for the in-universe TV programming. They Live Inside Us will be a yearly must-watch for Halloween and horror fans."}, {"id": 38, "text": "A really fun Halloween/haunted house movie about the demons we all have inside us. Well made, despite its humble beginnings, and a lot of fun to watch."}, {"id": 39, "text": "What can I say? Well when the film started its titles ended with the fact that it was written, starred, directed and I think produced by the same guy and another of the writers was the main lead. That was que for me to turn off.It was an absolute boreathon from start to finish...the most exciting thing was a door banging shut and opening several times which made me think that it sounded like people leaving the room for fear of being bored to death..Do yourself a big favour and switch off before switching on."}, {"id": 40, "text": "Don't watch it. I was waiting for the scary part the whole time and it just ended. I was like what the hell, where's the horror in this bad show. It shouldn't be included in horror genre. It's just waste of time."}, {"id": 41, "text": "I want to start off by stating the cinematography was great in this film. You can almost feel the cool, autumn air and makes you want to go get your costume on for trick or treating. The storyline is interesting but the beginning is a bit slow. It could be tightened up a bit. But....the third act really picks up and drives in on home! James Morris was fantastic. He has a great range. The Clown really freaked me out. I really have been enjoying Witching Season Films. Can't wait for the next project! 🎃🎃🎃"}, {"id": 42, "text": "What can I say that hasn't already been said? I agree with the positive reviews. I love when filmmakers don't take themselves too seriously and there are plenty of spots where this is evident. Also mixed in is a healthy amount of jumps and horror. Good job, guys!"}, {"id": 43, "text": "I've been so impressed with Witching Season Films. So much talent! The producing, directing, cinematography, acting, wardrobe, locations used, just perfect! There are some unexpected twists and turns that make you want to watch it again! I love this movie. Great job to all involved!"}, {"id": 44, "text": "This is a slow burning of a film but the ending joins all the disjointed dots to tie up this story. There are ghost stories galore in this film &amp; finale review takes a leaf out of a famous Bruce Willis' film."}, {"id": 45, "text": "If you haven't check out They Live Inside Us, you need to check it out now! It's a perfect Halloween horror and they knocked it out of the park! Highly recommended."}, {"id": 46, "text": "The overall vibe of They Live Inside Us is worth the price of admission!!!! It has so many layers of cool Halloween stuff, and they are all stunning!!! James Morris does an amazing job as The Writer who is obsessed with getting some motivation and inspiration to write again! Michael Ballif has created something that will surely stand the test of (Halloween) time! He gives us a clever story, and some really amazing characters! Music is spot on, practical effects and lighting are top notch!!! See....They Live Inside Us!!!!!"}, {"id": 47, "text": "With the thousands upon thousands of indie horror films out, the guys at Witching Season Films got it right. They didn't go for cheap scares or overblown gore or pretentious cinematography. They made a straight forward indie horror that is a throwback to 80's horror (which is the best decade for horror films). The cinematography in this is great, the acting is good and the music is spectacular. The story is original and very well planned.If you are tired of the same indie horror films that have been coming out, you should definitely check out THEY LIVE INSIDE US."}, {"id": 48, "text": "I was so eager to watch this film since the original short film. Just to name A FEW of the amazing things of this film, cinematography is one that really catches my eyes. The shots are absolutely glorious, and complete Eye Candy to look at. They story is original, and makes you want more, and more. Acting from James Morris was very great, and it is not this often that you see such great acting, and production value in indie films like this- but this film really set the bar even higher. I recommend this, especially for this current Halloween season. Truly amazing."}, {"id": 49, "text": "I was so honored to get to play the role of Dani. Thank you to everyone who has supported this film. Everyone, especially James Morris and Michael Ballif worked so hard on this film and I am very proud of them both.It's a great horror but also has some really funny moments as well. If you want the perfect film for Halloween than this is a must watch to get you in the Halloween spirit."}, {"id": 50, "text": "Great new horror film! Full of cool references and unique twists. Definitely a nail-biter! Great acting, too! Perfect for Halloween."}, {"id": 51, "text": "As someone who loves Halloween and a good ghost story this film hit all the right marks in my opinion. There are some really great creepy scenes as well as some very humorous ones. Michael Ballif's cinematography is beautiful. I really enjoyed the details and nostalgic touches throughout the film. If you like movies such as, Poltergeist (1982) and Lady in White (1988) chances are you will like this film too. I highly recommend you watch The Witching Season (2015) anthology series first if you haven't seen it already. I think the entire cast and crew did a really stellar job. This sets a high bar for Indie Horror films and is now part of my permanent collection."}, {"id": 52, "text": "Is this supposed to be a play on 1408? The Lead sure does sound like John Kusak, and there is a little girl in the back seat of the car. 1408 John's character had a little girl that looks around the same age as the girl in this movie?"}, {"id": 53, "text": "They Live Inside Us is a timely horror film that investigates the fragility of the human mind and the horrors of facing our inner demons.While it follows the story of a single father as he strives to balance his failing career, struggling family life, and inner personal trauma, there is more to this indie film than meets the eye. With stylistic nods toward directors like James Wan and M. Knight Shyamalan, They Live Inside Us will leave you both frightened and pensive.They Live Inside Us is a triumphant conclusion to The Witching Season's first round of horror features. I'm excited to see what they'll do next."}, {"id": 54, "text": "This movie was incredibly boring. I'm fine with movies that are slow starters to build the suspense but this movie didn't have that. The character is a writer, and if the short snippets of their stories they show are any kind of indicator, he's terrible at his job. As the movie goes on, you hope that it will get better or something. It really only gets interesting within the last 20 minutes and definitely doesn't have a payout worth sitting through the other hour and 20 minutes."}, {"id": 55, "text": "I had planned to wait until Halloween to watch this, having seen 'The Witching Season' I had high hopes for this and was not disappointed. A novel premis, strong central performances and a look and feel that is 'of the season' this is one that's going in to my annual October film line up.Watch it and enjoy."}, {"id": 56, "text": "I watch the short that the film is based on (The Witching Season, episode 4 found on Amazon Prime). The movie takes that original story and expands on it, it does a wonder job. I have to say the whole movie was great but my favorite was really the ending. I love how the movie really tied things together in it, you get sucked into the story."}, {"id": 57, "text": "A beautifully crafted, and well shot film that delivers the thrills &amp; chills. Congrats Michael, you did it my friend."}, {"id": 58, "text": "Really well done film. The story line was very interesting. The ending was the best part I feel. I would recommend it"}, {"id": 59, "text": "Jake (James Morris) goes into the haunted/cursed Booth house in search of ideas for writing a horror story. His wife has passed on recently and he is there with his handicapped daughter, Dani (Emily Broschinsky). Jake gets ideas for stories that are acted out on screen. Meanwhile there is a presence in the house as he has conversations with his deceased wife.If you don't like looking at James Morris for 90 minutes, this film isn't for you. Poorly scripted. Poorly acted. The scene where Jake berates his daughter and makes her cry was pathetically written and performed.Guide: No swearing, sex, or nudity."}, {"id": 60, "text": "Absolutely the worst scary movie I've ever seen. I've seen bad movies before, but this was ridiculous! BORING! Excruciatingly boring! The house and music were great,that's it! Bad script, bad direction, bad,bad acting. I don't care for gore and guts, which this movie doesn't have. I like thrillers and scary stories. I like movies that have details and keep you on your toes. Endings with a twrist,but still leave you feeling like the ending makes sense. In other words, not this movie! This movie explains it's self in the end. Yet still doesn't make sense. The characters are flat ,one dimensional. Long shots of quivering lips and bug eyes. I seriously do not understand how anyone could give this movie a 10. I would have given it a 0 if possible. If you want a good movie for Halloween or anytime, don't waste your time on this one!"}, {"id": 61, "text": "This film understands the genre and filmmakers that inspired its creation, and it honors those inspirations while simultaneously doing new and creative things with them.I found the film engrossing, spooky, entertaining, fun, and thoughtful.The house in which the film is set is awesome. The effects are authentic and unique. The story unfolds in interesting ways. The film looks amazing, and it is evident the filmmakers created their story with care and passion.I'm flabbergasted as to why so many others on IMDb have given this film such a low rating. On Amazon the reviews are much more favorable. Director Adam Robitel, of the Insidious franchise, said this about They Live Inside Us, An insidious chiller that delivers on the thrills. And Dave Parker, a director on Tales of Halloween, said, It gets under your skin, instilling a sense of fear and dread.I'm with them. I'm so happy to have seen this film, and recommend it highly."}, {"id": 62, "text": "What does one look for in a good, spooky, Halloween film? Atmosphere. Seasonal scenery. A few good scare jumps. Interesting characters. Mystery. And above all, a good ghost story........that's not so.......gorey. This movie has all of that. Dripping in Halloween scenery, decor, homages and chills, They Live Inside Us is a sensory delight. It hits all of the right notes for those who love the witching season. What I love most, is that after the director passed on a very obvious moment when a predictable bone sticking through the skin shot could have been easy bait for him to take. Instead, he let the tension ride and the actors make the scene instead of relying on gore for effect. After that, I knew that I could relax and enjoy the story without fear of some overly grotesque effects filling my 80 inch screen and surround sound. I believe that a great deal of scares and story can be had without gratuitous gore. He and John Carpenter got it right, more story, more atmosphere, make for a better film. In describing this film to friends, I did use John Carpenter's Halloween as an example of the flavor of the piece. If you are looking for another seasonal classic to watch every Autumn in anticipation of our favorite holiday, THIS is for you! A really good ghost story, with great atmosphere that brings all of the tricks and treats with it. Enjoy and Happy Halloween!"}, {"id": 63, "text": "They Live Inside Us is a great little indie gem, oozing with Halloween atmosphere and terror. The scares work, the jokes work even better, and the soundtrack is phenomenal.The film's production level is definitely a cut above the average indie and it feels like the classic 80's horror films it openly pays homage to in the films anthology segments. But the story manages to remain fresh, with a few great scares and a mythology that slowly reveals itself until the last moment of the film.The movie does start fairly slow (for me the story really didn't pickup until the 17 min mark, which by all accounts is probably too long for an indie) but this is smoothed over by the fantastic cinematography and musical score. However, stick with it. From the moment the dad turns on the record player, I found myself totally pulled into the characters and the world they inhabit.It's creepy, atmospheric fun. Definitely worth a watch if you're a fan of Halloween, '80's horror movies, or a well told ghost story. The final twist is fantastic and haunting."}, {"id": 64, "text": "Flick from the makers of the The Witching Season web anthology takes one of those tales and expands it to feature length. The story is simple. Writer Jake (James Morris) is looking for inspiration, so he and his daughter Dani (Emily Broschinsky) stay in a haunted house on Halloween. The Booth House has a past filled with witches, madmen and murder and Jake may get more inspiration than he bargained for.They Live Inside Us is written and directed by Michael Ballif and acts as both stand alone film and an anthology film in itself, as we visualize Jake's various story ideas as he writes them. These segments are filled with Halloween imagery and many of the popular tropes, such as masked killers, living scarecrows and killer clowns (each played by lead Morris) all chasing a pretty woman (Hailey Nebeker). In between the segments, we see writer Jake slowly feeling and seeing the effects of staying in an allegedly cursed house with a terrible past. It's not quite as fun as the bits born of his writing ideas, but it certainly has it's spooky moments as the house brings Jake's tales and it's own story to life. A Halloween horror would not be complete without some spooky reveals and Baliff provides them in a chilling last act. It's moderately paced, but that suits the type of story it is. On a production level, the film looks good. Ballif has a really strong visual eye, especially for the All Hallow's Eve inspired stuff and his cinematography gives this some nice atmosphere and Halloween spirit. There is also a really cool house location and a very atmospheric score by the aptly named Randin Graves.The cast is solid. James Morris is good as Jake. He could have been livelier in a few scenes, but nails it when it counts, such as his scenes with dead wife Cynthia (Stevie Dutson). He also has fun playing all the film's Halloween creepers. Emily Broschinsky is good as Jake's precocious, paraplegic daughter Dani. The two actors have a nice chemistry together and sell being father and daughter well. Hailey Nebeker gets to show various degrees of fear as the Woman in White in Jake's stories. The actress does however, get to do a bit more once Jake's stories and the house's history collide.This movie shows a lot of love for the spooky season and of horror films in general from Michael Baliff. It's not perfect, but one can really see the labor of love put into it and Baliff's passion for all things Halloween and horror, show through. Baliff knows the tropes well and knows how to use them effectively. It's certainly worth a look and has enough spooky moments to make it a nice new flick for watching during The Witching Season. Available to rent on streaming networks such as Amazon Prime and on blu-ray."}, {"id": 65, "text": "This is a story about a writer and his physically impaired daughter who take a short stay at a house that is supposedly haunted, as the town tales go. Along the way the characters address grief and how that has affected their family situation. The film shows off a living snippet of each of the horror ideas the writer entertains (and an honest affirmation of why they just don't seem to work) while playing up the real life dread building in the house. There are some unexplained pieces to the story but that's actually a very good thing. Michael Ballif, the director and writer of this story, doesn't want to hold your hand all the way through. There are just enough questions left over to keep you talking about all of the scenarios post-film and that's the best kind of film really. As far as everything else, Ballif knows EXACTLY how to create the Halloween vibe... perfect set decoration and lighting, great score, just enough scares to keep people on the edge of their seats. Ballif was inspired by the opening credits of Halloween IV and it shows. You get numerous horror story tropes played out all within the context of the writer's work. Really this is like a smorgasbord of Halloween and Horror. If you enjoy this, I would check out The Witching Season on Blu Ray, a collection of shorts from the same Director, with the same Actor (James Morris) and a very familiar vibe. You'll even get the short film version of this feature length film and it's fun to see the genesis of these concepts. A great film that definitely will make it into my annual Halloween rotation."}, {"id": 66, "text": "It shouldn't come as a surprise from the Witching Seasons team, but they really know how to make you FEEL Halloween. I've been a fan of their work for a while, and THEY LIVE INSIDE US is a super strong first feature out of the gate.As per usual, the cinematography from Michal Baliff is one of the many strengths of the flick. You really feel the love for the season when watching this film. Most filmmakers don't really know how to stretch a shoe-string budget, but this guy knows how to make a film look pro. Nearly every frame could be a portrait to hang on your wall. Plus, the handful of tiny Witching Seasons easter eggs was an added fun touch if you have been following them for a while.James Morris, a Witching Seasons recurring alum, once again delivers fantastic performances. Yes, you read it right,; PERFORMANCES.. plural. Tons of them. Not only does he portray the film's troubled but ultimately very likable protagonist, he also seems to have a menacing blast taking on the role of multiple killers throughout the film. From that damn clown to Count Spookula, the guy has chops. Morris has Elijah Wood/Anton Yelchin vibes, which if you're a fan of horror, you know that's a compliment. The kid is just a solid actor, and I'm excited to see what he does next.Just see the movie if you love Halloween, and check out their youtube channel."}, {"id": 67, "text": "The team behind The Witching Season (a web series compiled into an anthology film) is back with an expansion of one of the shorts from that film, They Live Inside Us. The feature length version is much expanded on (at 103-minutes) and takes the promise seen in the short version way above and beyond! Yes, the film plays with conventions of a classic haunted house story, but the filmmakers spin this yarn into something fresh, scary, and fascinating. Writer/Director/Editor/DP Michael Ballif puts together an incredibly professional production here and sinks his teeth into the story with glee. The movie follows a writer-suffering from writer's block-who inexplicably takes his daughter to a purportedly haunted house for inspiration. As things move on, we start to see that what he writes takes on a life of its own-in some really novel ways. The film starts with a deliberate pace but picks up a considerable amount of steam once our protagonist starts writing. Ballif envisions the author's thoughts as brief vignettes (some paying tribute to other Witching Season shorts) which break up the main action in creepy, fun, and sometimes funny ways. The real point starts to rear its head when we realize that Ballif seems to be talking about horror creators and audience goers with regards to why do we either create/connect with characters in horror films, only to have them subjected to the most awful things? There's a lot of great meta stuff going on here that left me damn impressed-especially by the film's end. Performances are strong with great work from James Morris (pulling multi-duty here, as well), Hailey Nebeker, Stevie Dust and Emily Broschinsky (who are all super-invested). Ballif isn't afraid to dig into these characters and gives them a lot of emotional space to do their thing. They Live Inside Us has to be one of the most striking horror films I've seen in a long while. It reeks of Halloween throughout, tells a twisty tale that kept me interested, features wonderful production values across the board, and gives horror fans a little bit of everything. Could we ask for more this time of year?"}, {"id": 68, "text": "I am a lifelong lover of Halloween, always looking for new Halloween media to consume. I stumbled upon Witching Season Films' Instagram account one afternoon last year, and have been obsessed ever since. The original They Live Inside Us short film became an instant favorite, and I couldn't wait to see the full length version! It most definitely did not disappoint!This movie is truly a love letter to Halloween and all that can possibly go with it. It has everything you could ask for. Oozing with atmosphere, nostalgia, and just the right amount of horror, this is a must see if you love Halloween. You can truly tell it was made by people who love the season and what they do.James Morris is truly impressive, not only in the lead role but also as the killers in each of the separate horror segments within the movie (particularly Choppy the clown!), and the iconic Count Spookula. As the lead character, Jake, he brings incredible emotion to the role, and you truly feel it when the movie reaches its conclusion.This movie deserves to be a Halloween go-to for anyone and everyone who loves the holiday. I don't want to say too much and reveal any spoilers, because I want everyone to watch this movie for themselves. But please, do yourself a favor and check this one out. It's everything a Halloween film should be!"}], "reviews_amount": 69}