{"name": "The Stand at Paxton County", "titleId": "tt08362228", "reviews": [{"id": 0, "text": "Good story presenting the abuse of power by activist groups taking advantage of ranchers. The movie presents a real problem with overreach perpetrated by special interest groups who created loopholes in laws, passed in the name of helping needy animals. Acting is decent and story is good, but gets a little conspiracy  focused. But the story needs to be told. Extremists who don't want animals used at all in ranching push bad laws into law, then harass ranchers to go out of business."}, {"id": 1, "text": "Very interesting true story that I feel needed to be told. This was film editor Brett Hedlund's directorial debut, and although his inexperience showed, especially in directing his cast, it was still decent for his first visit to the rodeo. Newb writers Carl Morris and David Michael O'Neill put the story together quite well and smoothly, but the pacing certainly needed a pick-up, as the 102 min runtime felt long and dragged out. I'm glad though that this film wasn't Hollywood glorified. It felt more like a Lifetime TV show, and that's not a bad thing. Cinematography was good, and the score and sound very fitting. An enjoyable film, but you'll need patience before anything really interesting starts to happen. It's a 7/10 from me."}, {"id": 2, "text": "05/07/2020 The first half of this movie seemed pretty dull and uneventful. The actors/actresses coupled with the storyline lacked any excitement necessary for drawing the viewer in. Late in the movie it all gets better and we get to watch an actual movie. Bon Appetit'Addendum: Having been raised on a farm in the 1950's this movie lacks reality. Culling sick animals from the rest is prudent and necessary. The rancher in this movie has to put down an old sick animal he loved. No farmer or rancher would ever do it as presented inside a barn/stable stall. That would require a ton of unnecessary work trying to remove the dead animal with a rope/chain and a tractor to pull it out. Reality is, if the animal can still move on it's own, then it would be lead to it's final resting place and put down. Be sure to watch ALL of the closing credits - within the rolling credits you will find the actual people involved tell a brief story regarding their real life experience."}, {"id": 3, "text": "This movie is disgusting and a flat out lie. He abused his animals and now he's glorified in a movie. Don't support this or waste your time."}, {"id": 4, "text": "I really enjoyed this movie, based on a true story! It keeps you on edge. Great acting by all!"}, {"id": 5, "text": "Decided to take a chance on it and was not disappointed. Based loosely on a true story."}, {"id": 6, "text": "Very well done. The acting was superb. Just shows you how money corrupts even in rural America."}, {"id": 7, "text": "The producer Forrest Lucas has contributed large amounts to anti-animal rights causes and made other non-true-story movies with the same political message. To keep the politics heavy, some of the other usual bad guys are thrown in - government and the press. I'm no fan of PETA, but I really hate to see politics masquerading as art. This just shows how eager certain special interests are to manipulate us."}, {"id": 8, "text": "OK, really, this is the FIRST story about horses and people where I was NOT wishing the Klingons would land, or something. It IS something we can all relate to. What do you do when your elected 'officials', or unelected bureaucrats are crooks? As I write this, amid COVID-19 plandemic, we have this going on in our country. The good old Michigan Governor decides you cannot buy seeds; yet her family sought to get their boat to the front of the line, while other Citizens' boating was/is restricted. Tyrants? You decide. The acting was good, the story was excellent, and there were not lots of CGI -- just lots of appreciated scenery. DEFINITELY worth everyone's time."}, {"id": 9, "text": "Artistic liberties definitely taken with this story, and good people turned into antagonistic characters for no reason."}, {"id": 10, "text": "If you like predictable, uninspired, Hallmark movies, this may be the film for you.Since when did North Dakota have palm trees and and busy freeways?"}, {"id": 11, "text": "I loved this movie. This is the first review I have ever written on here. I know this is no box office hit but it truly is a must see. It is heartfelt and sad. Sad because that is what greed is causing in this world. My heart goes out to any family, rancher or business that has endured such a thing."}, {"id": 12, "text": "The story line is actually pretty good. My issue is the based on real events is an extremely loose statement for this one.They're giving ND small town sheriff's some real street cred with this stretch of corruption.It started off ok but just got too unbelievable halfway through."}, {"id": 13, "text": "I thought I was getting into a B movie with subpar acting. I didn't think any of the writing was cheesy, usually found in was type of movies. Also, very good acting and cinematography. Very very well done."}, {"id": 14, "text": "This movie is based on a true story and illustrates the what happens when you have corrupt people in positions of authority. It is well worth watching as a lesson in history of what can happen when bad people get into positions of power."}, {"id": 15, "text": "The story has a strong emotional core and point of view, but the objective events shown can tell a different story than the pinko-elites vs we the people presented here.The creepy ending sequence, where a fat cat in a suit expounds to a darkened meeting room that, despite minor setbacks, their ultimate success is inevitable, made me wonder. Who are these guys in that meeting? They're not lefty animal lovers, nor are they corrupt local officials. The fat cat looks and sounds like a cartoon banker or CEO.Then I noticed that the story is based on events in Stark County, ND (Paxton County is fictitious), which is located on the Bakken oil shale formation! This scene doesn't change the corrupt predator storyline, but it bumps the level of corruption up to a higher, richer plane.I wondered how a law like this Title 23 could get passed in a state like North Dakota? Not your leftwing stronghold. The usual answer - big money, with powerful local and national interests - works here. Who would those interests rather have to deal with: Ranching families with generationally successful operations, or failed spreads, desperate for money? Title 23, ruining rancher families, driving them to sell out to the oilmen, while providing a handy left-wing paper villain, is a win-win for powerful petro.Business in America is done legally, but who writes the laws?"}, {"id": 16, "text": "Based on true events illustrating what can happen when misguided fanatical animal rights people create opportunity for corrupt law enforcers to steal peoples property."}, {"id": 17, "text": "Yes you have seen it all before. A standard made for tv bore fest. Corruption, revenge etc......."}, {"id": 18, "text": "What you have here is pretty much a 1940's B Western updated with modern day trappings, replacing your standard gang of conniving horse rustlers with a corrupt sheriff and a county veterinarian using subtleties in the law to 'legally' steal horses from local ranchers. Under the animal abuse provisions of Title 23, the animals are confiscated for minor ranch violations, and sold at a premium in other jurisdictions as the human victims find themselves defenseless and reduced to poverty. Unlike the old time Westerns, the villains of the piece don't necessarily look the part, they're dressed up as your average law abiding citizen, but with larceny in their heart and a lack of human compassion. It's not until the film ends that you're shocked into recognition that this was actually based on a true life case, at which time there comes an appreciation that the characters in the story were heroes in taking on corrupt law enforcement. A defining moment occurs at the end of the picture when the bully sheriff gets taken down by one of his intended equine victims. I'm sure you'll agree with me when I say that it was a real kick in the head."}, {"id": 19, "text": "Great movie. Do u have a soundtrack it's time we have some movies that are not to violent"}, {"id": 20, "text": "When the story line began to unfold, I said to my husband that this is frightening because it really could happen. Not until the end did I find out that it is based on a true story. This is really worth watching."}, {"id": 21, "text": "This movie was slow, plodding and telegraphed many of its suprises. I liked the actors and I was puling for them, particularly Michael ONiell as the patriarch and Jacqueline Toboni as his daughter. The Sheriff was creepy but I have a hard time seeing him as anything but Shooter McGavin. This movie was like a poor made for tv flick. Numb and mindless."}, {"id": 22, "text": "Terrible dialog, story too oversimplified. Her friend calls her to tell her that her dad collapsed, but first, take the time to lightheartedly joke around with her, HUH? No friend wouldn't do that. As soon as your friend answered, you'd immediately tell them about their loved one being in trouble.A few actors are decent, but without good direction, the ones that aren't so good put the emphasis on the wrong words and don't tell the story in a believable way.Here's a weird complaint: We watched with the captions on and at least twice the lines said I should of seen this coming. Should of?? How about should have or should've?! 'Should of' is nothing; it's not correct. So either the captions are wrong or the script is.Simple, possibly paranoid, people who can't tell they are being manipulated (and perhaps more importantly, why they are) might enjoy this, but modern viewers demand better. Some people use propaganda to get your money, to make you angry at institutions they hate, or to control your mind. Lazy, simplistic choices. Okay, okay, we get it--government bad, animal rights bad, sheriff bad. So much propaganda, I had a bruise on my forehead from all the did you get the message? Did you get it yet? poking me in every scene."}, {"id": 23, "text": "Got to the 15 minute mark and turned it off. Lame acting lame dialogue, wasn't going to waste another minute on this junk."}, {"id": 24, "text": "It's not best picture material, but it doesn't deserve the negative reviews. It's flyover country problems, but those too are real problems. It shows how corrupt well-intentioned laws can become. Very good."}, {"id": 25, "text": "I found the film slow and boring. The subject matter on the other hand is shocking. So not for me I'm afraid."}, {"id": 26, "text": "This film start with a girl Janna saving a wounded soldier, and her father Dell collapse scene! As turnout, this film is about a corrupted police Roger want to possess the horses of Dell by falsify the horse medical report, and he eventually get paid for his wrong doing! Entire film film full of boring conversation, and annoying overuse scene! Such as, overuse of the song playing at the background scene, overuse of the walking scene, and overuse of the flirting scene! Make the film unwatchable! Barely intense scene is, Janna fighting with Brock at the barn! At the end, Carl having gunfight with Roger! Roger shot Carl! Matt choking Roger with a rope! Roger eventually kill by Dell! Still have a post credit scene! The interview of Gary and Missy(the couple that the director dedicated to)! That's it! Another disappointed film!"}, {"id": 27, "text": "Bored and turned it on and boy was I surprised how great this movie was. Great acting and timely storyline."}, {"id": 28, "text": "Based on a true story? Not. Glorifies animal neglect which is not surprising in ND. Our state ranks close to the bottom of the rank for treatment of animals. So sad that what actually happened can be turned completely around and make him come out looking like a hero. Sad sad sad."}, {"id": 29, "text": "Well written and acted. First action that I watched in one sitting in a long time! (Now I'll get back to exercising and knitting, don't think I'll find another thing this good for awhile.)"}, {"id": 30, "text": "Just watched this movie! People just don't realize how truly evil these animals rights groups can be. They say it's to help the animals but it's really greed on the animal groups. Take your animals away and sell them before you can appeal! I have seen this very thing happen with dog kennels and their breeding them. Yes there are some bad ones out there but many many more follow the rules that they (the state vets) keep changing. One day you will not be able to get a pure bred dog, cat or even a horse because of the laws the groups have talked our government into doing. PROTECT THE HARVEST!! Your groceries aren't coming out of thin air at a store so your family can eat! THANK A FARMER!!"}, {"id": 31, "text": "Based on a true story of chapter 23 shenanigans, this is a taut, well put together film with solid acting."}, {"id": 32, "text": "The movie caught my attention from the beginning and drew me into a nicely unfolding story about an Army captain called back home to help her father with problems on his ranch.Jacqueline Toboni carries the movie with an understated but strong performance, the film makers portrayed her as tough but sympathetic and I was relieved they didn't go for some kind of female Rambo angle. The characters have depth and develop throughout the movie in a way that is compelling.The movie is well paced and develops somewhat unexpectedly into a spy thriller kind of movie and a conspiracy of increasing complexity. Without giving too much away, unfortunately I eventually found the story to be so wildly implausible that it was a little hard to watch the ending, and it just seemed like pro-rancher and anti-activist propaganda. The film makers obviously have an axe to grind and hate those damn libtards, I get it but it detracts from what was otherwise a pretty good movie."}, {"id": 33, "text": "If you've never heard about Title 23 in North Dakota and how it affects the ranchers I highly recommend you watch this movie."}, {"id": 34, "text": "My family lived this nightmare. The following is just my opinion based on what I know about the true story and the movie.There were some liberties taken, but the people involved in the production took a lot of time and effort to keep to the majority of the true story; yes it is based on, but the corruption of a sheriff who had lost his way, the fact that a vet wielded her power to try and take all the animals that were worth money (they left the dog and cats, but the vet was going to get all the mares that were expecting babies), the law was voted down by the voters but passed in back door legislation and was sponsored by The Humane Society of the United States are part of the true story.Early on when I was told how it was going to have originated (an anonymous complaint from out of state) it all sounded a little too conspiracy theory to me too.Until it happened. Exactly like I had been told it would. The Humane Society of the United States also provides training to our law enforcement and they train that minor every day things are criminal negligence.I do not think it was a coincidence that The Humane Society of the US had provided training to the sheriffs department before this ordeal started.By the grace of God we prevailed; but what would you do if they showed up at your door?Is your Sheriff an honest person with integrity who will stand up for citizens rights? Or will they fold to special interests that make donations of equipment in addition to political donations?Feel free to take a look at the page TheStandAtPaxtonCounty true story on Facebook. I outline what is Hollywood and what was the true story.If the movie is about 80% true to the real story still propaganda? Not if you ask me; I was there and these type of cases are happening across America everyday and I know that now because it happened to my family."}, {"id": 35, "text": "Contrary to the initial claim of the first reviewer, just a cursory research on the web verifies that the basics of this story are true. And in real life the judge threw out the charges of animal abuse and ordered the animals be returned to their rightful owner. And nowhere in the movie is the mistreatment of animals glorified. It is a story about a conspiracy to claim falsely that animal abuse HAD occurred in order to seize the ranch. But enough of correcting obvious misstatements in reviews.In reality, this movie is actually a well crafted suspense piece that you can relate to even if you have never been on a ranch. For those looking for extended gun fights and other lengthily episodes of gratuitous violence, look elsewhere. The emphasis here is on suspense, not violence. And there's that other subtle message from this story, viz. should business owners of all pursuits be a bit apprehensive about their government's growing penchant to shut them down and seize their property, whether based on animal abuse or health concerns.I recommend you give the movie and Netflix a chance. It will be well worth you time."}], "reviews_amount": 36}