{"name": "His House", "titleId": "tt08508734", "reviews": [{"id": 0, "text": "Moments of heartache then genuine terror. I had goosebumps.Sope Dirisu is incredible - and Wunmi Mosaku is an absolute scene stealer."}, {"id": 1, "text": "This was the perfect horror movie. Genuinely terrifying in parts. And also giving a view into a world of human experience that encompasses human-born horror, loss, grief, desperation, striving and hope. I really cared for these characters and what happened to them, their story. I felt they were so real and believable in their struggle with one another, their love for one another, their tragic loss of community and connection, their being thrust into a cold, thin alienating, lonely new life in a strange land. Great actors , great script and engaging story, great camera work and yes, a twist. For me, there is a lot to like here and I will be looking out for more by this film-maker."}, {"id": 2, "text": "Decided to watch this film on Halloween as pretty much watched all the classics over the October month and i found this little gem very refreshing. Netflix has been disappointing this halloween with the terrible blyth manor but they pulled it back with this one. A horror story with heart that makes you feel lucky for the life you have. It tells the story of two asylum seekers and the struggles they face to settle in a new country BUT something has come along with them!! The story flows nicely, the acting is a decent effort and there are some very good jump scares. Some of the dream scenes are beautifully shot and kind of reminded me a bit of the scenes in The Ritual. Its not all horror but that shouldn't stop you giving this one a go."}, {"id": 3, "text": "Different and memorable. Not predictable, left me wondering in what order it was written."}, {"id": 4, "text": "It starts well, midway you think it's following a standard horror movie course, but stick with it! Very well done. Terrific ending!"}, {"id": 5, "text": "The horror genre is filled with junk, so it comes as a pleasant surprise when you run into a gem, and His House is very much a gem. I don't wanna give too much away, but the story is about African immigrants who escape their war torn country to settle in a dilapidated house in the UK, and from there bad things start to happen.There is so much depth to this movie that a few words just don't give it justice, what's more is you genuinely feel for the main characters of the movie. The scares? Let's say this one is just downright creepy, coupled with some excellent angles that really make the movie crawl under your skin.Great great watch!"}, {"id": 6, "text": "This movie was amazing. There are so many metaphorical meanings behind the film and it was interesting to see what happens at the end. The fact that the story of refugees was told is amazing because you hardly hear those stories. Let alone see it in horror films. The scary moments were actually scary, there were elements I've never seen in any movie, etc. The actors all embodied their roles well. Great Job, Remi"}, {"id": 7, "text": "If you're a fan of in-your-face horror, this film is deeply psychological and not for you. Although politics lay the foundation for the story, the story itself isn't really about immigration. I think sometimes people see minorities in horror films and automatically think it's about racism or prejudice. To be blunt, there's no political message in film. It's well crafted and allows you to draw your own opinions. See it for yourself."}, {"id": 8, "text": "Its not spooky or creepy. Mayb some wannabe critics may term it as a horror film cos of the trauma the couple went thru or mayb cos of the evil men can do (one tribe butchering another tribe) or mayb cos of the Folie à deux. The performances by the two lead actors is top notch, the film ain't boring n moves at a decent pace but it aint a horror film."}, {"id": 9, "text": "The psychological torture and torment of two immigrant refugees, a married couple, brilliantly examined and presented through the culture they have travelled from, the beliefs of their homeland, within a derelict British society they now call home and the tragedy endured trying to get there. Some genuine jump scare moments with goosebumps, excellent visual effects and makeup, encapsulating two of the most talented actors around providing us with two of the best performances of this cinematic year."}, {"id": 10, "text": "I'm always looking for a different twist on the horror genre and here is a good one. African asylum seekers in Britain get housed in a haunted social housing property. The leads are just brilliant and utterly convincing as a married couple who have literally been to hell and back. Remi Weekes, the director, has a very sure hand with horror and breathes some fresh life into the haunted house/demonic posession/witchcraft genre. A very small cast, a disconcerting and claustrophobic atmosphere and winning leads make an original and fresh movie. It starts very creepily and builds the tension throughout although the end was a little heavy on the virtue signalling."}, {"id": 11, "text": "Really liked His House, great effects, great characters, brilliant actors, well done horror and very good political / society story, good ghouls - a solid 8/10 from me"}, {"id": 12, "text": "⭐⭐⭐⭐⭐⭐⭐⭐⭐ The last scene of this film isn't very long but being someone who's seen it all and a connoisseur of DISTURBING FILMS.. you know 120 days of sodom.. Serbian type Begotten films, I'm no clown. That last scene ranks right up their with my Midsommar favorites the Witch or even Hereditary. The whole storyline, Acting along with videography and effects was superb. Just watch it, Definitely 👍 a hidden 💎 i do recommend this film for all."}, {"id": 13, "text": "The love between the main characters are tangible and is stretched to the breaking point as they try to acclimate to a hard new situation. Will they learn to live with the ghosts of their past or destroy themselves and everything they've fought for? A must-see! Saw it at Sundance and am waiting in anticipation to see it again and again"}, {"id": 14, "text": "This was a great movie all around. Lots of tension, a few jump scares, and a great storyline with a surprise ending."}, {"id": 15, "text": "I like the idea, the concept is sound (no spoilers, sorry) but it's execution is flat. It feels like a half baked BBC drama more than a Horror on Netflix.The cast is fine, downtrodden but likeable in a 'not entirely likeable sort of way' I think it probably wants to be more of a social commentary than an actual horror...And it's this which I think is part of the problem, it wants to show the horrors that people are fleeing from and the perils and loss of the journey but that (if done properly) would be enough, better even than what we wind up with here.People will review it well and say it's the best movie of the year etc, but it isn't, if it is then they need to watch more movies... It could have been so much better, it's a shame they wasted the opportunity."}, {"id": 16, "text": "Was not expecting that! Jump scares and screams that I have not experienced in a while! I feel like this story is relevant for its time and seeing the raw emotion from the main characters through a scary jumpy film was done very well and had me wondering what the hell is going on with the unexplainable goings on inside their house. Creative and new kind of scares that were not samey as some other modern films. The actors who play Bol and Rial were really believable."}, {"id": 17, "text": "Very moving story with twists and suspense throughout. Also, bring out the horrors and unfathomable hardship that many refugees faced with certain death, take to life a peaceful life. Superb acting by all."}, {"id": 18, "text": "His House is a beautifully acted movie about a Sudanese refugee couple who are moved into a rundown house in England. The house turns out to be haunted, and there are a number of questions left up to the viewer to decide by the end. The movie does a neat trick of making it clear exactly why the couple can't just leave this house once the haunting starts. They have strict rules in place to maintain their asylum status, and one of those rules is they don't leave that house before they're told that they can. There's conflict between the husband and wife, as he is eager to assimilate while she wants to hold onto their culture. The ominous mood is set up early, as the house they are given is large enough for two families but they are being given it to themselves and the rehousing agent (Matt Smith) acts shifty about it and won't explain why they have this house to themselves. The house has been used as a trash dumping ground by the neighborhood kids, so it has fallen into an abandoned state and they wind up having to fix up parts of it just to have livable conditions. There are holes in the walls from which come whispering sounds. And from the very first night, there are jump scares and WTF moments, and some pretty good ones too. The wife, Rial, becomes convinced that a ghost from their past has followed them to England. The husband, Bol, doesn't want to hear it at first. They have a big secret between them, a major source of guilt. Whatever is in their house is feeding on it. The thing is, if the ghost followed them there, why do other people who have lived in the neighborhood longer treat their house like it's haunted? The movie hints that there might be something much older occupying that space but never explains it fully. However, the movie does manage to come to a mostly satisfying resolution."}, {"id": 19, "text": "I was waiting for this movie since I saw the trailer... I'm a little disappointed.I liked the performances, and the daughter's plot twist, but it could be much better, it is one of those stories that could become something else but just didn't."}, {"id": 20, "text": "What a magnificent film!Using traditional horror elements,the creators of this movie,show the real life horrors of genocide,PTSD,survival and guilt which comes with it...Absolutely heartbreaking,fantastic film,which touches topics,unfortunately,mostly left alone in our society ...Highly recommended!!!"}, {"id": 21, "text": "A good physiological horror film with a main theme and a surprising twist to the story."}, {"id": 22, "text": "It is an irrefutable fact for me that it is one of the best horror films of this year that is absolutely worth watching."}, {"id": 23, "text": "This movie was boring and slow nothing much happen. If you are looking for a horror movie, I would not recommend it. It more of a slow drama with a bit of horror. I give it 4 for the acting because the actors were good otherwise it's less than 4."}, {"id": 24, "text": "I didn't know anything about this movie, and wasn't even sure what to expect given the trailer. I guess somewhat reminiscent of Get Out, this film enabled me to build empathy towards folks from different backgrounds, circumstances, and life choices ... while also keeping me on the edge of my seat with creepy scenes."}, {"id": 25, "text": "It starts out really creepy and the first half was great horror, but I got the feeling they didn't go far enough. The location was awesome. Really gloom and dark. But I just feel like they they had the opportunity to make this much more scary then it ended up being. Seems like this is often the case these days. But it was quite entertaining. A seven out of ten for me."}, {"id": 26, "text": "To be honest, I didn't see the whole movie, the pace is so slow I had to turn it off. Witch BBC / UK productions it goes 2 ways, or it is the most brilliant thing ever, or it is a torture. This movie is in the last category, if you want a very slow burner, this is your thing."}, {"id": 27, "text": "Watched this with the wife for Halloween and she nearly fell asleep. The acting is good but the movie is boring and not scary. It's also poorly written: what was the deal with the weird cat woman neighbor? I was disappointed."}, {"id": 28, "text": "So I originally thought this was going to be another classic demonic spirit possesses house and harasses family film but boy was I wrong. The trailers make it seem like just another jump scare type movie but with an immigrant problems flair but that doesn't do this movie justice at all. This was a breath of fresh air for a Netflix original and really felt like a new and original concept. Kudos Netflix, this one was well done!"}, {"id": 29, "text": "Three words to describe this film: beautiful, terrifying, and heartbreaking. It had my spine tingling and my heart aching and I genuinely loved the film. I highly recommend this to anyone who isn't susceptible to nightmares after scary movies."}, {"id": 30, "text": "An ambitious film that seeks to cast off the shackles of the haunted house genre in order to create something more impactful than your typical horror flick. This film has impressive visuals and tremendous acting especially from Wunmi Mosaku who plays Rial. What is truly remarkable about this film is the way it toys with the viewer's relationship to different aspects of the film including characters and the horror itself. This film packs so much emotional depth in only 93 mins. My only negatives are that at certain points the movie becomes a little ungrounded with the extent of the hallucinatory/dreamy imagery. Also, I'm not exactly sure how I feel about some of the horror imagery being traditional African body art. I'm certainly not sufficiently knowledgeable of the subject to judge whether there is narrative significance to the art or if the filmmaker just thought it looked spooky."}, {"id": 31, "text": "Now when it comes to movies in this exquisite genre, there isn't always satisfaction, but this amazing masterpiece is no doubt one of the best low budget movies I have ever seen. The animation is amazing, the acting is to point and the direction is no doubt one of the best I have witnessed. All in all it was a delight watching this movie and I really wish it's sucess.( Your ghost follows you.)."}, {"id": 32, "text": "I was surprised by this movie.It has multiple layers and the story is told as a thriller/horror movie.In the 17 comments it has right now, a lot has been said about the story.I will not go into that. I want to say the acting is great, the music suits the story nicely and it does has some scares and creepy moments.I enjoyed it, not your everyday watch I guess, but very well executed, with a tense atmosphere almost throughout."}, {"id": 33, "text": "It starts of feeling a lot like a regular horror movie about a haunted house, but soon turns out to be more like a drama about two refugees trying to fit in and to cope with their guilt. Which they do in very different ways (i wont say more about that as it is a huge spoiler). But that being said it is a well crafted movie and i found myself gripped by the story and the characters. I felt the ending was a little bit of a letdown, but i guess i had different expectations because of the title. Still it is a solid 7 in my book."}, {"id": 34, "text": "What a refreshingly different horror film. Serious depth and heart, but also super creepy. Horror fans: you must give this a watch. Don't read too many spoilers."}, {"id": 35, "text": "Seen some of the great reviews for this film, and one does love a good horror film. Watched for 35 minutes and nothing happened, watched for 50 minutes and the story itself was by far one of the bland. I wish I could get those minutes back from watching this terrible film."}, {"id": 36, "text": "A thoughtful and poignant character study that explores the immigrant crisis and poverty through horror and mystery.Been a fan of Sope Dirisu since watching Gangs of London.He is phenomenal in this.Matt Smith and Wunmi Mosaku also give fine performances.There r quite a few jump scares and the whole atmosphere is moody and creepy."}, {"id": 37, "text": "Started out quite creepy but became a bit boring gave me the impression of one of those bbc Xmas ghost stories that used to be on every year , worth a watch but nothing special but must say the two main actors are very good"}, {"id": 38, "text": "Well I found it really boring and acting wasn't professional for me. Not sure why it has 72 Metascore but it wasn't my cup of tea. Wouldn't recommend to watch it if you like horror movies because it had 0 elements of scare. If you like drama/ghosts then maybe it's for you but the movie is bland and nothing special."}, {"id": 39, "text": "Always the same story: a couple move into a cursed house. The public is frightened a couple of times. The couple finds the solution and defeats the ghost. There are already 200 such movies."}, {"id": 40, "text": "Ok so this is not your typical horror film, and I really gave it a chance. It's super sloooowww. I get that some movies take time to set the story/tone etc,, but the movie is 90min and nothing happens until almost an hour into the movie. There were a few jump scares, and a small twist at the end., that's about it. Wasn't impressed or scared."}, {"id": 41, "text": "I read reviews of this movie and the reviews were quite good so i thought i should watch it myself but in my opinion movie was average and story is kinda boring!"}, {"id": 42, "text": "Feel like we've wasted a Saturday night watching this! Good acting but by crikey it's dull! Nothing more to say really, getting back to my Saturday night now!!"}, {"id": 43, "text": "Gosh where to start... the first 20 minutes of the movie were fine but then it starts to get weird and boring. The movie is 1h30 but if feels like 6 hours... zhat a waste of time"}, {"id": 44, "text": "Not only was this a very creepy horror movie but it also, in a very educational way, highlighted the extremes humans have to go through in order to flee their homelands and what hardships that awaits once they're out. It's scary, beautiful and heartbreaking."}, {"id": 45, "text": "Story about two refugees haunted by guilt. Entertaining enough but without the jumpscares it will just be another boring and sad netflix movie"}, {"id": 46, "text": "I waited for this movie since I saw the trailer month ago, it seems promising and interesting because I like the hunted house plot lines and His House barely satisfy the expectations. The story was simple, straightforward and seems a commentary on social issues like immigration. There is a recent trend on horror film makers where it is 'woke' thing to incorporate certain socio/political/philosophical topics as a storyline, but this one was hardly entertaining. It was forgettable and very basic but still I gave it a OK rating because I like the shots and imagery of the film."}, {"id": 47, "text": "This movie is all about a twist that makes things interesting for a moment and that's it. No matter what you will be expecting, you are not gonna get it. You start your car, driving it in the roads enjoying it and suddenly realized you are driving it in an ocean absolutely no logic."}, {"id": 48, "text": "Low burn start, then we go deeper through the African violence drama and refugees. Their folklore with witches and ghosts is brand new to the move on a new house cliche. Bol and Rial bring the evils spirits with them like a sinister luggage. The visual FX are pretty decent (the nightmares at sea are magnificent) but in the end story runs out of gas leaving us with some appetite."}, {"id": 49, "text": "I have to agree with some of the other reviewers that this film begins well but falls a little flat by the end. It does a wonderful job at keeping the viewer on their toes, using a simple storyline, and one that brings awareness to a real world plight. There are some frightening moments. Unfortunately, the conclusion doesn't tie up the loose ends. It's a smart film, but a little complicated at the end in that we don't get our problems solved. I wanted to like it more, because the acting is great. Sadly, I doubt I will ever tune in for another viewing."}, {"id": 50, "text": "I thought the first half of the film was great. They move into this extremely run down apartment and instantly start hearing and seeing things. It got really creepy there for a minute. The second half of the film really starts to drag, I found myself bored and disengaged. It just got a little too strange for me. I would normally give a film like this 5 stars, but because of the first half I'll give em 6."}, {"id": 51, "text": "I honestly dont know who has been giving this movie 9-10/10 the must surely be part of the cast or filming crew i had high hopes reading the reviews and found it really boring and slow almost turned it off a couple of times i wish i did now dont waste your time with it"}, {"id": 52, "text": "Neither the cheese nor the horror are strong in this one - a rather boring affair trying to catch the audience with including refugees (I can hear the voice of the marketing guy of the production company coming up with the idea). Boring."}, {"id": 53, "text": "Pointless hollow terrible movie. Not wpryh spending a second."}, {"id": 54, "text": "It started off interesting but then got a little boring for me. The twist in it wasn't what i was expecting (in a good) way but i don't like how the characters weren't exactly good people but still got what they wanted. Should've ended when Bol was getting killed by that monster and i would've been happy, love it when justice is served in a film."}, {"id": 55, "text": "This movie wasn't really that scary except a few jmp scares got me.The real horror is what two tribes are doing to each other in the Sudan.A couple escapes to Great Britan and are afforded asylum, given an allowance, and housing. The area is poor and the houses ramshakle.The couple are pursued by the ghosts of their pas5 and the death of their daughter, drowned at sea.The wife tells a story about a man who wanted a better life so bad, he began to steal until a demon pursued him to take back what he stole.Spoilers below; I was confused though about the daughter. Didn't the husband steal her to gain passage on the bus? Wasn't that her mother chasing the bus screaming for her daughter back? Is that why he was pursued?"}, {"id": 56, "text": "It's a great metaphor for the need to existentially integrate the three temporal dimensions of one's life: past, present and future. One cannot take shelter in any of them separately, by dislocating it from the other two. More to the point, one cannot identify oneself exclusively with one's present, respectively erase one's past, for then he/she becomes haunted and hunted by the latter (as it initially was the case with Bol). However traumatic, only by facing and seeking to constructively deal with one's own past, can one find the means to 'start anew' and ensure a future. Time, the great unfolder of Being, can cure everything, but only if allowed to flow between the three dimensions. Of course, once disturbed, (re)bridging the gap between them is not without peril or potential sacrifice. Charon must have his obol, after all."}, {"id": 57, "text": "If the level of this film is not evaluated by number 3, then what film can be estimated at this low leve?l .. a subject that is not interconnected .. events go in one direction and then without justification they change to other directions .. I do not know which sea or ocean is this on which South Sudan is located?, and we know It is an internal state .. Then what is the relationship of this house to evil if the main character claims that it accompanied her from outside .. Many events have not been explained .. It is like that: You should have accepted what you see without asking: What is this? The film gave a very poor picture of what is supposed to be the best efforts made by England for immigrants."}, {"id": 58, "text": "I've made an IMDB account just to warn people of how bad this film is, I've given it 1 star because it's not possible to give it a 0. 93 minutes of your life you'll wish you could get back, but you'll not be able to because obviously that's impossible."}, {"id": 59, "text": "OK, this movie works on a few levels, particularly when it comes to the plight of refugees in the UK, that part is conveyed well. There are some effective scares that are done well, and shifts to memories and transferences of the characters back to their home lives in real time. The relationship is done realistically and the acting is good. The story and explanation is however not clear at the end especially when it comes to the big reveal and resolution. That part confused the hell out of me and could have been done a bit better. Worth watching though for its bleak realistic stye and not bad FX."}, {"id": 60, "text": "Quiet dull and boring, more drama than horror - nothing special or interesting, and for sure not a good horror movie: the horror parts are what I call all cliche in. If you are a connoisseur of the art of horror you can easily skip this one."}, {"id": 61, "text": "Slow and boring, why it is shown on the homescreen of nextlfix is more of a mystery than the whole film!"}, {"id": 62, "text": "Fantastic movie regards horrors of asylum seekers. Great pitch at the terror of what makes people face death into the the unknown and likewise the fear of what greets them. The film has all manner of Demons, the inner demons being the scariest, but are they mental manifestations or real?"}, {"id": 63, "text": "A Sudanese couple escape to England and are placed in a house which also seems occupied by a particularly unpleasant spirit which may have followed them on their journey and following the tragic death of their daughter.Genuinely quite scary in places, this is a compelling and quite smart horror feature. It may be a tad brazen with its imagery, but it's a solid story which finally and shockingly explains what is going on. A great debut."}, {"id": 64, "text": "Sad because it is propaganda. If it was left to play out as a supernatural horror without the social propaganda then it could have &amp; should have been a decent movie. But no, they had to push it repeatedly and so on...."}, {"id": 65, "text": "There is good realistic look of monsters, emotional stuff, real life stuff like family, culture, relationships, immigration. But the main topic, the unreal stuff appearing in real world and out of nothing is not good enough. Fake, unconvincing, unclear, unfinished. Actors are average. I expected more science and reality."}, {"id": 66, "text": "Omg worst movie ever, nothing scary just a waste of time"}, {"id": 67, "text": "I thought it was going to be good but it was just eh. It was insanely slow. It doesn't explain anything till the end. The ending showed how lazy the movie was when you find out it's all in their heads. You can watch it if you want. But as a person that loves movies I wouldn't recommend it."}, {"id": 68, "text": "I don't usually watch horror films as I don't like gore so this was okay in that respect. However, I found it a bit flat and not in the least frightening. A score of 6 is about right."}, {"id": 69, "text": "So good and loved it. Everything was brilliant. I felt so sad for them"}, {"id": 70, "text": "Consider this movie about how people deal with ptsd, traumas, grief and loss. It also tells how being an outsider in a foregn country is so exhausting and depressing. Good movie"}, {"id": 71, "text": "The movie could be better than what they make good story good atmosphere but it has one or two scary scene at beginning of it and nothing for the rest of movie i wish a scary movie i wish"}, {"id": 72, "text": "I started watching this late night and had to turn it off because is starting scaring me and didn't want to go bed with this being the last thing I saw. When I resumed watching it (during the day) I will confess, that not since the 73's Exorcist and Insidious pt.1, has a film scared me so well like His House. Excellent story, cast was spot on the yes I jumped a few times watching....Wow! It scared, moved me and shook me up. Best thriller I have seen in 2020. I even watched Come Play and in all honesty that movie sucked major ass. But His House is the best of film psychological thriller film making. Good job Netflix. A definite highly recommend. You will not be disappointed."}, {"id": 73, "text": "A very good movie that covers alot of ideas concerning immigrants, racism, living the dream and dealing with lost. The movie is definitely more psychological than just a horror, it doesn't depend on any silly jump scares. It has a very good writing and good characters building."}, {"id": 74, "text": "With so much appalling made for tv trash at the moment this was surprisingly good. At last a different spin on horror. Didn't know what to expect from the start but it made my evening. Give it a go."}, {"id": 75, "text": "Don't bother. Just weird and doesn't mean anything"}, {"id": 76, "text": "When you set out to make a horror picture and you get Javier Botet ( tall, slim man from many successful horror films like) including IT 1 and 2 , 'the Slender Man, Insidious the Last Key, Crimson Peak and many more...and then to not use them more than for 5 minutes. Bad, Bad Movie."}, {"id": 77, "text": "This film was absolutely brilliant. Honestly I don't understand how people are not appreciating a concept like this. This is not a typical film. This is not a typical horror. This is not a typical setting casting etc. This is one of the most original horrors in a while. The movie is more of a emotional hit rather than a horror. But it is really just brilliant. If you are into movies that mess with your mind this is definitely it and it has a amazing twist"}, {"id": 78, "text": "Rarely do horror movies include a fresh yet interesting premise while providing great story work and subtle foreshadowing. Highly recommend watching this. Also spotlights several issues immigrants deal with when seeking refuge from war-torn countries but that's a whole nother conversation."}, {"id": 79, "text": "The best thing about the film is the running time."}, {"id": 80, "text": "One of the best movies I've seen all year and potentially one of the best horrors I've seen EVER. Highly recommend"}, {"id": 81, "text": "Waste of time. Just don't watch. No more comments necessary."}, {"id": 82, "text": "As an horror it doesn't always work, as a drama it doesn't always hit but overall it's just so precious that it will stick with you for a long time."}, {"id": 83, "text": "His house is a film about an African couple that is escaping the murderous rage that's taking place in their country seeking asylum in London, but the true story lies within the life making decision they had to make to get to London, will come back to hunt them? This is by far one of the scariest movies I've seen in a dog's age. If you are frightened easily, watch this film during the day or with companions. Surprisingly, a clean film with no nudity or foul language, but petrifying. Felicity Evans's authorship is impeccable, I look forward to watching Percival, another film that she has out this year. Actor and actress Sope Dirisu and Wunmi Mosaku played the rolls flawlessly both have had roles in other movies and series. As for me, I believe that you'll be seeing a lot more of these two. This film is a must-watch as well as a game-changer in the horror genre."}, {"id": 84, "text": "I was expecting a generic horror and what I got was a very eerie horror/drama that had eye opened moments too. The suspense was evident throughout the film, the setting wasn't horrific or ghostly yet it felt uneasy. The acting was top notch. Definitely recommend this film"}, {"id": 85, "text": "I watched this on the basis of the high ratings here but was extremely disappointed.I have given 2 stars simply because the acting of the two main actors was very good.However, what the actors had to do was not. The storyline is simply pretentious supernatural claptrap. I am not at all sure what the significance of the main characters being Sudanese refugees in the UK is? If there is any special allegorical meaning I am afraid I missed it. The story seemed to suggest that the refugees had brought their supernatural demons with them - so what does the UK have to do with it?The supernatural parts are really quite laughable and similar to what you might find in a very low budget horror film that would normally score about 3 on IMDB - so it beats me why this is getting the high ratings."}, {"id": 86, "text": "I enjoyed this very much. A beautiful story of resilience after a life of great struggle. The cast was perfect. A high quality horror story."}, {"id": 87, "text": "A story about 2 African refugees that are followed by a ghost of a young girl and others to a house in England. Its a different story to a degree but a surreal haunted house story is what it really is. Several jumpscare moments are mildly scary but although the atmosphere is fairly well done it doesn't quite lure you into the creepy mode of dread that is essential in good horrors. Some may find some of the scare moments mildly silly in other words you are seeing too much which takes away the supernatural scare factor and shift it towards a zombie flick. For a low budget horror its OK but its not going to be near the top of many peoples list of top horror movies."}, {"id": 88, "text": "This is absolutely brilliant movie, the plot was absolutely unpredictable and absolutely different. Very exciting background of main characters. Bringing new demon culture to the horror movies. It's incredibly simple movie in a simple space but absolutely terrifying. I'm sure we will heard about this director in future a lot."}, {"id": 89, "text": "This movie has a great message behind it, is multi-layered and goes far beyond your typical for scares horror movie, has great acting, and has genuine scary moments. But- it's so slow! I got bored over halfway through because I was waiting for more stuff to happen. If you're not in a thinking mood, don't watch it. If you are in that sort of mood, then check it out."}, {"id": 90, "text": "This is not a bad movie. It's interesting in the beginning, has a good plot twist (really unexpected) and the actors made a great job BUT the production and the director failed in the times of the plot.The movie is really slow, it is even bored at some time and the final death could be so much better.So yeah, is a ok for this movie but u have to know before watch it's definitely not a fast movie or one that will make u have a funny time"}, {"id": 91, "text": "At least the plot line in that film is interesting. So many tangents in THIS movie got me so confused. And why after killing the weird demon witch did the ghosts appear normal?"}, {"id": 92, "text": "First review, but I had to in response to some of the reviews here. If you're expecting Paranormal Activity or another run of the mill horror from those studios, with cheap scares and lame characters, forget it. This movie shows the reality of immigration, but is also beautifully shot (the dream sequences!), emotionally charged and scary in a lot creative ways. It's also undeniably sad, with a great twist coming half way through. Honestly a refreshing take on the haunted house trope."}, {"id": 93, "text": "My eyes were at my lap for most of the film. The jump scares ruined the experience for me."}, {"id": 94, "text": "This is a one and done movie, really fell short and forgettable. Overall disappointing."}, {"id": 95, "text": "This movie was actually better than I expected. I thoroughly enjoyed the film. It was very unpredictable with an interesting plot."}, {"id": 96, "text": "The best horror movie released in 2020, this is not a cheap horror film based in jump-scares but more of a slow burn complex horror/thriller with a profound message inside. I really enjoy it. ---7,5/10---"}, {"id": 97, "text": "Spoiler ahead! One of the few mystery movies where the backstory aka the twist, makes sense. The refugee couple who kidnapped a child (unfortunately drowns on its way) to get passage to Europe pursued by a dark entity. Maybe it's about Justice or faith. Either way a good, in parts atmospheric watch, rooted in and reflected on current global society issues. The generic formula: dark house (this time not the usual Manor in the middle of nowhere) a couple moves in (this time refugees not the successful author) a troubled past (this time a lost child and Culture) plus, a dark entity (this time African witch craft) it's not groundbreaking as outlined by others but that's personal taste I guess and should not stop watching his house!"}, {"id": 98, "text": "This film poses that question. Does the horror lie in the back story of the characters? The dismal housing estate? The 'system'? The distorted and displaced lives? Or in the house, amidst the surreal tension and jump scares? The overlaying of real contemporary horrors onto the theatrical genre horror was unsettling and highly effective. Very scary, very 'enjoyable', very thought provoking."}, {"id": 99, "text": "I liked this because there was more than just a haunted house.the whole ghosts and stuff was ok, a bit silly, sometimes stupid, but ultimately creepy and acceptable as a plot. But the backdrop of the couple in a new country trying to fit in and adjust was a nice sub plot,The ending was a little bit of a let down, but overall really creepy, jumpy, interesting and thought provoking horror, well worth a watch"}, {"id": 100, "text": "Filme bizaaaaaarro de terror no Netflix. Nem me perguntem se é bom ou ruim: teve momentos que achei muito bom e teve momentos que achei muito ruim. Resumindo: é bizarro. His House Really bizarre horror movie on Netflix. Don't even ask me if it's good or bad: there were moments that I thought were really good and there were moments that I thought were really bad. In short: it's bizarre.#movieslover #horrormovies #netflix"}, {"id": 101, "text": "The spoops are pretty good, the psychedelic mind-f'ery are a bit off-putting but not annoying, the performance and visuals are great, the story and twisty twist are unpredictable for me."}, {"id": 102, "text": "Don't get me wrong I prefer jumpscares than gore or movies like Hereditary . But in this one except from 1 or 2 jumpscares the jumpscares were cheap . It didn't make me jump . But the movie is disturbing and ultimately creepy . The acting is spectacular and so are the stunning visuals . What I didn't like , though, was the ending because I was slightly confused . I am going to watch an explanation video and then I may change the score but for now my score is 6,5/10"}, {"id": 103, "text": "The target for this movie is good but shouldn't be like that...... We all have emotions with refuges but i have to say frankly it is bad and disappointed...."}, {"id": 104, "text": "Was an amazing Doctor Who episode, albeit a little scary. He helps another British (pending) family. He kinda takes a back-seat role in the movie just helping a little.I have kind of desensitised myself to scary movies. They just don't affect me any more which sucks. This movie got me a few times but just barely. Still, that's more than most scary movies these days. I enjoyed the story. Not the best but definitely far from the worst. Give the movie a go. See for yourself."}, {"id": 105, "text": "Now if you're waiting for you're typical, surface level horror film to pass the time, you might be disapointed. From what I saw, most bad reviews were about the movie being boring, which will probably be the case if you're only looking for jumpscare instead of looking into the story.However looking deeper into it, you'll get a great social commentary about colonisation, immigration and all the consequences, or rather ghosts, that inevitably come with it. Here's my personal interpretation, but to each their own (SPOILERS obviously):Story (just ignore this paragraph if you already saw/understood it): We follow a couple, Bol and Ryal, running from their country in a attempt to make their way to the greater land and start a new life. However the house given for their trial period as UK citizen turns out to have obscures presences hiding behind its walls. We eventually discover that in order to make his way to london, Bol stole a little girl from her mother in an attempt to get himself and his wife seats in the bus that will lead them to the boat to England. Ryal, filled with remorse sweared to protect the little but the latter ended up dying in the sea as they were floatting to the Occident. The presences tormenting them are ones of a demon, Nygyak, and the many ghosts he appropriated the souls from, including the little girl's. He offers (or rather demands) to get Bol's soul in exange of the little girl's, as a sign of reparation. Eventually, the demon is killed and and Bol and Ryad accept the price that comes with freeing the little girl from Nygyak and the thousand ghost that were under his influence.Now you could see this as a simple story about this couple of immigrants being hunt by demons after comitting a crime, but in my opinion, this movie is a commentary about colonization as a whole. Bol represent the colonizer: he takes from people to make his path to more success and belonging, at the expanse of other people's life. Then once his ghosts (the immigrants) comes to reclaim their part of the cakes, he plays the denial card: you can see him trying to get rid of everything linking him to his past life, and naïvely hide the scratchs of his damaged house in a attempt to make himself at home. The same way a lot of Occident countries, after so much years of slavery, colonizing and stealing ressources, likes to paint those event as part of the past while fully keeping the economic advantages that came (and still comes) with it. I'd say Ryal represent your actual immigrant, scarred by war and full of remorse (just as Bol, she made her way to UK at the cost of someone else's life) and nostalgic of her home, not quite able to fit in as she's lost in a world that isn't hers and where people mock and reject her. But now she's also here in this house, which imo represent the land, within which colonizer and colonized have to cohabit anyway. Bol wants to make the house his, while Ryal wants them to acknowledge the ghosts and leave. I'd say Nygyak is a metaphore for war and death, as he slowly draw the two characters against one an other in order to get his blood sacrifice, presenting it as an easy way to fix their tornment. Once the demon is defeated, Bol and Ryal finally both understands they have no choice but moving forward while bearing the consequences that come with leaving on a ground obtained at expanse of so many lives, and fix their mistakes (aka fix the house).I like this interpretation as it doesn't paint a white and black picture, simply aknowledge that as long as this circle of stealing and repaying continues, more lives will be lost.This movie is great, the performances are outstanding and doesn't fail to keep things interresting despite a limited budget. However I think if you're looking for more traditional horror, this probably ain't it. Still, congratulation to Remy Weekes, looking forward his next projects."}, {"id": 106, "text": "I thought this was a spectacular film. Superb performances by the cast that you can't help but be drawn into their lives, and feel the terror they experience while they try to understand their new lives.Its subtle, its raw, its authentic and I loved every minute of it.If you are burned out of typical horror films (1BR anyone?), then give this one a chance."}, {"id": 107, "text": "I thought this was going to be a social commentary much like any Peele film but I was SO wrong. The plot is constantly unraveling and your feelings change with it. You do NOT know these characters. Ended up being a great film period, genre aside."}, {"id": 108, "text": "After sitting down and watching this eerie film I can easily say I thoroughly enjoyed it! It's definitely worth the watch. It kept me interested the whole way through while also maintaining a good thrill level to it. It's a little bit mind boggling at times but the psychological sections are so entertaining. I think it really touched upon some real emotions like *SPOILER ALERT* the hardships of having to try and survive within a war-torn country. I felt worried about what could happen to the two main protagonists while also being kept on my toes whenever the spirit was involved. I also felt emotional towards the finale. I won't ruin much more... leave the rest up to you! I'm a huge horror fan and this one is so simplistic and stylistic it really makes it that little bit more enjoyable. It also hits a bit close to home as well because I am from the UK and lived in an area similar to where the main protagonists are housed."}, {"id": 109, "text": "A haunted house movie that could be really good If the story was more basic. Because the real time effects, and makeup are really super this time around. And it was a long time ago a ghost movie almost dropped every cgi and made it oldschool. But the hokus pokus flashback story, a couple that can't communicate at all. Really destroys the scary scenes and only gets irritating. If the ghosts where a part of the house it would be thousand times scarier then having this sobbing daughter/ not daughter, demon witch that kills thiefs but only surface in a house in england and can die but not die?? Its just ridiculus. his house undermines itself all to often with a convoluted mess of a story when it could have been the best ghost movie since the others."}, {"id": 110, "text": "This blew my mind. I absolutely loved this film.and it became an instant favourite. From the underlying story to the incredible effects it was a joy to watch. It also genuinely freaked me out and scared me in parts. Excellent acting and all round a bloody brilliant film. More of this please."}, {"id": 111, "text": "By far the freakiest and scariest horror movie ive ever seen, netflix movies are a pretty mixed bag (to say the least) but this was really one of its high hitters, every single scare tactic in this movie was great, the acting was amazing and the ending was actually good. this is one of the few movies where the main characters actually has a legitimate reason as to why they didnt just leave the house, if they did they would get arrested and get sent back into the nuthouse. the only thing i have against this movie was that it can be a little confusing at times and the characters actions can be kinda hard to understand, although it didnt affect the plot so it didnt hurt the movie too much"}, {"id": 112, "text": "This is how you tell a story. It has good frights because you're not expecting them. It has a good story to tell because you go in thinking you know. Then they tell you the truth and you lose respect for the main characters, but then end up feeling for them! Wow Also, this is how you can have a strong female character along a strong male. There's strength in being a woman rather than her being like a man. Both actors acted their tails of in this one."}, {"id": 113, "text": "It's rare to find a good horror movie these days. I'm not gonna exaggerate and say this is the best horror movie ever. It's not. Although, it's a GOOD horror movie. There's no reason not to watch it, go ahead and don't miss out."}, {"id": 114, "text": "The acting is amazing and the whole movie has an awesome creepy feel to it, the story is awesome and out of the ordinary which is refreshing, this movie does not have the usual cliches you find in horror movies and cheap jump scares. Give it a watch!"}, {"id": 115, "text": "This film portrays the weight of guilt, in fact, that ghost was his fault, for his responsibility in the death of the little girl, excellent film, psychological terror, seasoned with dark photography alternated with pastel colors, and scary ghosts, these innovations in terror are always coming, and Netflix presents us with yet another quality suspense, I try as a background the prejudice suffered by refugees ..."}, {"id": 116, "text": "Thought I'd give it ago seeing as commenters said it wasnt political. Ended up switching it off half way through only continued to watch that far because the guy lead was ok. Basically refugees come england his wife has a chip on her shoulder to white people slags them all off after being given a house etc and them trying to genuinely help the man. Before this shenanigans I was wanting to switch it off because whoever filmed it did a horrible job on lighting the scenes shot in darkness were unwatchable you couldnt see anything the kid in the walls wasnt scary. His wife just became annoying I'm left wondering whether to carry on watching pit of guilt for the husband. But let's be honest it's pointless he tries to get a other house like their kid ghost wony follow there stupid overrated movie. Too many cr@p releases on Netflix at the minute I'm dreading trying to pick anything"}, {"id": 117, "text": "I've just watched with my wife the movie is 10/10 incredible. Marvelous. Well done!!! The movie it's awesome. it's masterpiece. I am literally speachless to describe how such amazing this movie it is . I highly thoroughly recommend. We watched the whole movie hugging each other because we were so scared, which we need to pause the movie to calm down and to breathe. the film went straight to the point, surprisingly scary, impressive performances, the rhythm it's excellent, the director knew what he was doing. and without speaking the tension of the film was incredible well done , several frightening elements, jump'scare, my wife said I can't keep any long and I agree me too it was so terrified that make us feel uncomfortable of fear. the best movie ever made. the movie holds you the entire time. I was so scared to death which I was holding my blanket so hard. Congratulations!!!! The actors was so incredible. The director it's incredible. The movie it's awesome. Pure horror movie ! The best movie ever made! 100/100."}, {"id": 118, "text": "I'd heard this film had received good reviews and was intrigued by the story. I did find it jump scary and worked on psychological level too. For me the real monster in the film is War and the trauma caused. The mundane locations added to the menace and the acting is excellent."}, {"id": 119, "text": "I really enjoyed this movie how anyone could rate it anytbut a 7 or better is beyond me. It's not your friday the 13th horror it's a mix of thriller with a demon inspired horror twist. The 2 lead actors were phenomenal and the cinematography or the filming was excellent. Watch it with the idea it's not your usual horror it has heart, it made me feel like I really need to change my thought process about immigrants. BRAVO!!!!"}, {"id": 120, "text": "Expecting a more standard horror story, I was pleasantly surprised to see a different take.Overall I felt it was a dissection of the horrors many asylum seekers leave behind or bring along with them. The haunting in this instance being symbolic for survivors guilt and ptsd suffered. Living in the UK where the media and the conservatives devote a lot of time and energy to denigrating &amp; dehumanising these people, it's Refreshing to see a film really humanise them and give them a voice. Especially in a time when children are dying in the channel whilst sociopathic Patel files her nails.It's not often a horror film inspires you to go out and find a way of help people."}, {"id": 121, "text": "I'm not a fan of witch plot of movies but this movie is done well. Few scenes were scary with continuous suspense, not done before in movies. I liked it."}, {"id": 122, "text": "Small movie with an original plot, excellent acting by the protagonists. Their flight from an African country and the atrocities they are subjected to makes you think. Would they ever feel at home in their new country? Will they shake off that ghosts of the past and be redeemed for their sins? Intriguing."}, {"id": 123, "text": "First time can watch a haunted house movie without yelling at the screen for the dumb people to just move already. This is a great mix of real life issues &amp; scary movie. It's also a great example of cultural clashes &amp; how people work through them."}, {"id": 124, "text": "Way better than i expected, i thought it was going to be about refugees but no much more ,for people who like horror you are going to like this ."}, {"id": 125, "text": "While this movie does have jumpy horror scenes and some thrilling imagery, I found the movie to be horribly sad. I'm not sure if I'm the only one but I cried through the last third of the movie."}, {"id": 126, "text": "Without saying too much, if you're a horror fan, there is finally something decent to watch if you're tired of Brahm's-the-boy-doll type fluff. Highly recommend a watch. I think you'll enjoy it. I did."}, {"id": 127, "text": "Chilling and creepy peek into African mysticism. Well written, acted, produced and directed. Excellent cinematography and social commentary. Worth your time."}, {"id": 128, "text": "I really enjoyed the film. The trailer led me to believe it was gonna be just another haunted house tale but it is much more than that."}, {"id": 129, "text": "I kind of expected a generic haunted house film with a side story of the main characters being immigrants, making it that much more difficult. What I got was so much more. A beautiful movie with good horror to match. Don't miss this film."}, {"id": 130, "text": "Not sure why I watched it as don't do horror anymore, maybe as Matt Smith was in it (hardly though) and Wunmi Masaku (like her in everything she's been in), but wanted some escape. Not cheery, but so glad I watched it. Wunmi is brilliant! Low key, no amazing special effects needed, just a good story, surprises you (well it did me). If you want to watch great actors, something that keeps you wondering what's going on with a supernatural twist then give it a go. Struggling to describe it but it's well worth a watch."}, {"id": 131, "text": "I've been wanting a decent, intelligent horror so so long now. I hated the like of Hereditary &amp; Midsommar. But this? This I loved. Full on tense drama, thriller, mystery, horror. Genre-bending &amp; mond-bending brilliance. Both leads were perfect. The twists &amp; turns kept me guessing. A harrowing story of descent in to delusion, despair and unimaginable grief."}, {"id": 132, "text": "Oh wow, wow. What a breath of fresh air from all the other nonsensical horrors showing lately."}, {"id": 133, "text": "I was surprised at this new twist on the 'horror' genre that begins as more of a Ken Loach style social commentary than a conventional 'B' horror film.It follows the plight of a Sudanese couple, Bol and Rial Majur (Sope Dirisu and Wunmi Mosaku) who seek asylum in England following a perilous journey over land and sea that tragically results in the death of their daughter Nyagak at sea when they are thrown from their packed boat.After a successful asylum application with strict conditions attached they are housed in a southern England town in what can only be described as a squalid, unfurnished council house.The house can only be described as dangerously uninhabitable in terms of dodgy electrics, damp walls, exposed piping and a front door that literally comes of its hinges when the couple are introduced to the property by unsympathetic council housing inspector, Mark Essworth (Matt Smith in a cameo).As the film develops a typical haunted house scenario develops complete with strange noises, jump scares and holes appearing in the walls. The noise is caused by a witch/apeth and ghostly images of the horrors of the Sudanese couple's past.Excellent acting by the leads and steady direction by newcomer Remi Weekes keeps the tension at boiling point as a clever plot twist explains the witches presence.It is the plot twist and the psychological emotions of it that are released by Rial killing the apeth.A good, suspenseful new twist on the genre delivered in a compact running time. Job well done by all involved. The conventional horror scenes mixed with the emotion of the couple's plight."}, {"id": 134, "text": "Very very bad, don't waste your time. So disappointing"}, {"id": 135, "text": "Dreadful. The fact that this is considered high art in today's society demonstrates how terrible most art is. This film is predicated on one hollow metaphor about the family's misdeeds in their efforts to escape their home country. Simultaneously, it makes some sort of half-baked effort at social commentary by way of reference to the 'hostile environment' culture and so on and so forth. The result can probably be best characterised as a fart: a series of images depicted by a series of individuals that only the mind of a social media addled, soap-opera addicted, 21st century fool could think was remotely inventive, intellectual, or poignant. As I said at the beginning, dreadful."}, {"id": 136, "text": "A really well made, well thought out film. Really refreshing for a genre that is so easy to fall stale and flat. Definitely worth a watch!"}, {"id": 137, "text": "A strong directorial debut, Remi Weekes elevates 'His House' beyond the conventional haunted house movie and manages to dive deep into the struggles of immigrants. It is beautifully made and downright creepy. The performances are good with Sope Dirisu and Wunmi Mosaku showcasing credible, lived-in feats that make you genuinely feel for their characters."}, {"id": 138, "text": "I loved this film. Although it is categorized as a drama, horror, and thriller, I found it to also be unexpectedly beautiful and unique. I'm going to watch it again!"}, {"id": 139, "text": "Had the usual po knee grow/ noble savage/ white villain theme. However, it was interesting and tolerable until the horrendous end. The ending was even going perfectly until the 90210 lib interference, then ruined just like that."}, {"id": 140, "text": "Jump scares rarely work, but Remi Weekes' 'His House' does more than make you jump. It crawls under your skin with stellar lead performances, while terror evolves from its haunted house premise to cutting deeper into the psyche of two struggling refugees. Worth a watch!"}, {"id": 141, "text": "Great movie, it talks about refugees from totally different perspective, a perspective that I never thought of. It shows not only that refugees are expected to be integrated and they aren't free to choose thier house, job.. Etc, but also they are carrying a heavy burden, they feel guilty because they had survived when the other died in the see and they are traumatized."}, {"id": 142, "text": "This was pretty good until the third act came in. Initially they showed all the struggles of this husband and wife beautifully. The ghost shows up and we will instantly hate it. The ghost is being a d***. But then we come to know the motive and all. After that the movie fails.They just show some random stuff and by the end everything is solved.This could've been so much better."}, {"id": 143, "text": "Without giving too much away, this film knows what it sets out to do and tells it in an extremely effective way. Beautiful mood and cinematography, wonderful actors, no wasted dialogue. I'd say that the horror aspect is on the medium scale, but probably less if you're used to watching a lot of horror. I enjoyed this even more than Get Out, but it's unfair to compare the two because the stories are completely different."}, {"id": 144, "text": "From the very beginning of His House I knew I was about to see something different.The story is rooted in the horror of war, dislocation and desperation. The tale explores the idea of possession and haunting. At first I wasn't sure wether the haunting was connected to the people or the house.This is a dark tale that forces us to confront some uncomfortable truths. It's a very clever piece of writing that's beautifully acted and utter terrifying at the same time.It's a story that stuck in my mind for several days after I watched it, be aware, you are not in for an easy ride. There are some very difficult scenes to watch and this takes horror into a very different and uncomfortable direction."}, {"id": 145, "text": "Being South African, I am used to African culture and the terrifying superstitions that go along with it. A deep seated respect for the elders, the ancestors and a genuine fear of witchcraft spell out African culture and often dictate how lives are lived here. This movie perfectly captures those fears and beliefs, but there is more to this. I believe this encapsulates survivors guilt. The intention to save another from a terrible fate, going awry and ending in tragedy must surely leave a deep wound on the mind that is self destructive and requires an honest introspection and eventually acceptance of the role one may have played in the loss of that life. It amounts to wrestling with one's own demons and a process of self forgiveness and acceptance that that pain and guilt will always live on inside you. Very interesting movie. I loved it and I so enjoyed the creepy moments. When Rial tells Bol the story from her mother, I felt once again as if I was camping out in the pitch dark of the African veld and listening to a wise, old African woman telling me a moralistic tale with a terrifying, supernatural consequence, and nothing but open veld and darkness surrounding me. It's pretty creepy. Unless one comes from a deeply superstitious culture, you may not appreciate that feeling, however the movie captures it perfectly. Totally worth a watch. I loved it. I've got a pretty good case of the creeps now, so it was certainly effective."}, {"id": 146, "text": "A good horror movie, with very unsubtle references to the horrors that refugees have to endure in their home country, fleeing away, and adjusting to new countries, resulting in being homeless yet followed by all their demons.The acting, atmosphere and blending of reality and nightmare works perfectly. The only downside is that the ending throws the symbolism overboard, when the filmmakers chose to make the demon real instead of symbolic. Still much respect to the actors, for making their struggles feel palpable."}, {"id": 147, "text": "Without fail one of the most original horror films this year, if not within the last 10 years. Solid acting supported by a strong, concise and emotional plot, all underpinned with an artful balance of dread-drenched suspense and outright scares."}, {"id": 148, "text": "This is one gorgeous looking film, that moved me to tears. Showcasing the African immigrant experience in London, and the terrifying real world tribe clashes in Sudan, the film stands out as an authentic exploration of trauma and guilt. Beautiful imagery, with a spine tingling sense of dread, the scares pay-off spectacularly. Finest horror made from the whole year. Must watch."}, {"id": 149, "text": "I was debating if I was going to give this a 6 or 7, but since most movies made today are total crap I ended giving it a 7.Acting is top notch. Monsters are well made. As I said, it is a different type of horror movie and maybe that in itself is a good thing."}, {"id": 150, "text": "His House: A different sort of horror film involving asylum seekers from South Sudan. Boi (Sope Dirisu) and Rial (Wunmi Mosaku) are given a house in need of improvements in an outer London suburb. Bol ties to assimilate joining with other men in the social centre singing football songs, Rial sticks more to her culture. They both mourn their daughter who was lost at sea during their journey. Nightmares, visions and memories of the sea journey plague them to a frightening extent. While decorating, Bol finds a wire in a wall which turns out to be attached to a seaweed draped rope. Creatures and their dead friends appear in the house. Eventually Rial realises that an Apeth (Night Witch) is their house. Good imaging of this frightening monster as well other disturbing scenes. To be suddenly thrust again into the sea and be at risk of drowning incites existential terror. Being plagued by petty bureaucrats on to p of that doesn't make for an easy life. Convoluted at times but it hangs together in the end. Co-Written and Directed by Remi Weekes. On Netflix. 8/10."}, {"id": 151, "text": "All I will say is I can always appreciate and love a horror movie that actually has some real substance to it. A horror movie doesn't need to just use gore and blood to be good. This movie, in my opinion, delivered something so much better than a lot of the new horror that has come out recently. Give it a try !"}, {"id": 152, "text": "A MASTERFUL display of metaphors, driven by a stunning cast. This is a fresh point of view that is as relevant as it is powerful. Though it is listed as a horror, it transcends the boundaries of just one genre. I was completely invested in the story within 15 minutes before any of the real horror kicked in. I can't recommend this movie enough."}, {"id": 153, "text": "I came in expecting another rushed diversity brigade film blasted in my face.I was glad to be wrong, the movie used real good native actors, the script and contrast in culture are well portrayed. The film is somewhat scary, emotional and touches on different topics.It walks all over Wakanda, and that other film where they all clone each other.It was a pleasure to watch something naturally diverse and not more Hollywood rehash, or token crap."}, {"id": 154, "text": "It's probably an 8.7 for me. But the idiots reviewing it are giving it low ratings so I'm definitely going with a 10. The writing is superb. The metaphors and the meanings behind every little detail put into it make it amazing if you are smart enough to make the connections. This movie DOES NOT bash you over the head with anything and it is NOT pandering. Very good and very scary. My wife jumped 4 times completely scared out of her pants during the middle of the day while viewing."}, {"id": 155, "text": "This is why I love Film. To experience amazing stories and go on an incredible ride of emotions. This is what this film does. His House."}, {"id": 156, "text": "It does not matter if you are into horror genre or not, you should watch this unique movie.I was surprised by the flawless acting of the entire cast. The director managed to seamlessly blend in Drama, Horror and a bit of Comedy."}, {"id": 157, "text": "Usually when we hear horror movie we think of an enhanced bimbo running upstairs from a masked slash killer. I cannot stress how this is not it. The horror elements are used as a metaphor. This is in fact a heart breaking, well played, meaningful drama that reaches deep and make you empathize with the main characters. Solid performances from Wunmi Mosaku and Sope Dirisu. Great cinematography. The movie succeeds in not being a documentary like/plead for the refugees in general. Instead it makes us get attached to those two people and see how much they are more alike us than they are different, in spite of being from a different culture and distant land. Feeling down because of the Covid 19 restrictions, thinking this year in your life sucks? Go see this movie for a change of perspective..."}, {"id": 158, "text": "I would never have imagined someone making a horror movie out of this storyline about a migrant man and a women seeking asylum like every other migrants do but can they leave the past so easily that's where this movie is scary at some moments but tearfully sad . all well done."}, {"id": 159, "text": "Talk about a slow burn of a movie ... some may read horror movie and think this will be just one jump scare after another ... and while there are some of those, this builds up! And in quite the original and weird fashion! The fear of living or being in your own appartment/house cannot be put into words. Well not accurately that is - which is why this is also a visual treat.A horror movie that has quite impact - or is able to, if you let it. Visually stunning and creepy as it can be. The pacing probably will be an issue for some, but it isn't for you, do it! Watch it - you should be able to tell, if you like this after the first 15 minutes or so. And you can watch it again and again - because while this is a horror movie on the surface, there is a lot more beneath it ..."}, {"id": 160, "text": "Spoilers: His House is a story a married South Sudanese refugee couple who have been granted asylum in England. The couple struggle with the concept of what it means to be one of the good ones. For the husband, it means assimilating smoothly into English life and establishing themselves as a family in that image. He cheers for their local soccer team, attempts to dress like the images of English families, and disregards the lifestyle practices they used to have in South Sudan. For the wife, it is about coming to terms with their past and the loss of their daughter. Their struggle manifests as a demon in the walls of the house they are granted asylum in. The demon appears in many forms: as their dead daughter, as the dead passengers of the sunk ship they survived crossing the mediterranean, and in its true form. Long exposure shots, eerie non-diegetic sound, and the use of shadows are all horror conventions used to create frightening ambiance for the demon and create scenes where the fears of the couple are realized.The demon forces the couple to confront the repressed, a critical turn in the film: their daughter was never theirs in the first place. They took the child so they could board a bus which only was helping families with children escape. The daughter dies in the sinking ship crossing the mediterranean; the couple being some of the only survivors. They struggle with what it means to be one of the good ones and cannot come to terms with the passing of the child that they abducted for their escape. Their time in England is met with skepticism for their existence as refugees, but the film is really a commentary on the dilemmas of survival that refugees face. The film for me could only be a horror film. The demon lets the viewers feel the fear and repression for the appearances required of the refugees in order to make it through the system of asylum approval. It reveals the horrors that they are trying to escape and how even in safe country, it can continue to haunt them.Even if the content isn't interesting to you, the movie is a must watch for horror/thriller lovers. The acting, directing, and plot development is superb.#cens201"}, {"id": 161, "text": "I was scared at certain points! A movie that works on multiple levels: a cultural film, a war film, a horror film - in reality and in an other worldly sense and ultimately what it means to be at home in the world.I usually am turned off by horror films since I am not a fan of violent, bloody movies - they have a bad effect on the psyche - but I watched this because it had a domestic yet strange feel and I was interested in learning about other cultures.Excellent film - it has a randomness and out of control feeling but it also provides a sense of ethics, justice and that gives order to the chaos."}, {"id": 162, "text": "Im enjoying it. Very good jump scares. Great acting"}, {"id": 163, "text": "It tells a good story and it is terrifying, I recommend it if you want to be scared."}, {"id": 164, "text": "Well directed, written, and cast. Hard for one film to bring chills and tears at the same time."}, {"id": 165, "text": "Hauntingly resonant, thought-provoking and genuinely scary as hell; His House is an impressive debut from director Remi Weekes and a film that will challenge viewers.In this horror film, a refugee couple from war-torn South Sudan, struggle to adjust to their new life in an English town that has an evil lurking beneath the surface.A film that stay with you long after you've watched it; His House never offers cheap scares and constantly pushes for viewers to see the true horrors of a refugee. Expertly shot, well written and overall mind-boggling. This film will change how we view the horror genre and you'll keep a close eye on director Remi Weekes for his upcoming projects. Stream it on Netflix now.Follow @snobmedia for more reviews!"}, {"id": 166, "text": "But after a while of it sitting with me I understood. The history of violence and trauma and horrible choices we make in life always is with us. Always."}, {"id": 167, "text": "This movie is just great. A simple topic, great development. There´s something, but it seems that they are not surprised. The movie colors are sensational, they contrast with the protagonist. In short, is a excelent horror movie, with a diferent taste."}, {"id": 168, "text": "Netflix maybe your not failing. This movie shows that you can produce gooood crap. Phenomenal acting, captivating storyline, amazing visuals. Great ending! And understandable! Why does this have a 6.7 rating.. that's how you know IIMBD is FALSE."}, {"id": 169, "text": "I did not know much going into this movie. I suggest you do the same. The movie tells an emotional story with amazing scares throughout."}, {"id": 170, "text": "This move is not what your expected it's everything you need to see. I believe this is one of Netflix best ones yet. Just watch it!"}, {"id": 171, "text": "I was almost expecting a comedy thriller/horror from the trailer, but damn. This was a smooth blend of passion, heartache and the shear willingness of the human soul/mind to forgive and forget. There were tiny scenes of comedy which were soon overshadowed by the realism of the horrors that plagued the couples minds, thoughts and memories. The more poingnent scenes of the film where almost heartbreaking and really made it clear that this film meant business and wasn't messing about. Would love conquear all and bring peace to an otherwise distorted relationship, or would desperation take it's grip over the hearts desire to re-claim what was seemingly lost forever? Please watch, i emplore you."}, {"id": 172, "text": "Putting aside any political/internationally flagged zones portrayed in this movie, His House has met its genre with excellent execution. Talent, performance, storyline, climax, even the duration has been in perfect order that would keep u engaged till the last shot. Such movies as this one are truly of great added value to the genre and to the audience who crave for legit scares without gushy and bloody scenes."}, {"id": 173, "text": "Totally overrated; the story was not that appealing; the special FX were disastrous; the logic of the scenario was flawed."}, {"id": 174, "text": "Loved this movie! The cast was brilliant and the whole premise of the movie was just amazing. So glad I decided to watch this film."}, {"id": 175, "text": "The haunted house flick is old and cliched these days - to be fair, it's been so since the 1930s - but HIS HOUSE manages to breathe life into a flagging, overblown genre. The point of view, that of a pair of Sudanese asylum seekers, is spot on and allows for a fresh perspective on otherwise familiar events. This low budget film adopts an understated approach for the most part, painting a grim social milieu and interspersing effective flashbacks in the narrative to tell a story of sadness and despair. What keeps you watching is the quality of the acting from Sope Dirisu and Wunmi Mosaku, who are both excellent in their parts. My only gripe is with the climax, which gets a little too drawn out and over the top for my tastes, but otherwise this is a minor gem."}, {"id": 176, "text": "And it had such an intriguing plot that I have never seen before in a horror film. It has elements of monster horror and psychological horror, I have also never seen African culture incorporated into the horror genre like it is here. It would be awesome if they put the lead actor in the role as the New Black Panther if they don't go with Michael B Jordan's Killmonger taking up the mantle. Sope Dirisu has the voice and billed for it as well as the acting chops! I hope he goes big places after this as well as the leading female actress, Wunmi Mosaku. I believe she was in a Black Mirror episode and is also a phenomenal actor. The movie had good all-around acting and a great fear element that catch me at the edge of my seat, or floor or wherever the hell I was sitting while watching it...!"}, {"id": 177, "text": "Amazing movie. So original and the right amount of humour added. I have high standards and low patience this was just too notch in every way."}, {"id": 178, "text": "Not the classic ghost story cliché. The movie is structured very well and the backstory makes it outstanding. Heartbreaking and powerful, I have enjoyed every second of it."}, {"id": 179, "text": "Wonderful movie - deserves a rating of eight at least."}, {"id": 180, "text": "This movie has everything. You'll get goosebumps, you'll jump, you'll cry and you'll come away thinking about it for days if not weeks.It tells a deep story about refugees coming to the UK and leaves the viewer to decide if what they are experiencing is real, or whether they are merely suffering mentally from survivor's guilt.It's a truly incredible spectacle.Anyone giving it bad reviews doesn't understand film full stop. They don't get much better than this.What a fantastic debut. Looking forward to many more."}, {"id": 181, "text": "When it's a horror or wild script telling m game but not sure what was this I tried to match each n every puzzle but no dots connecting later realise it was already 12 n I slept wasting my time with something really boring"}, {"id": 182, "text": "His House 2020 15 Director: Remi Weekes Starring: Sope Dirisu, Wunmi Mosaku, Matt Smith etcOverall rating 100/100His house is based upon two refugees who have fled their country, in search for a better life for themselves, but when they are placed in a rough housing estate fitting in proves to be more difficult for them as an evil is lurking in their house that will torment them forever. Wow what an amazing, creative, impactful and genuinely terrifying movie His house was, let's get started.First of all the movies cinematography, tense and uncomfortable tone and Jumpscares were excellent. This movies visual creativity was incredible, there was some shots and use of lighting, and camera trickery that I had never seen before and the movie blew me away, the visuals despite having one key element to them were always changing and getting more and more interesting as the movie developed. The movie also had an incredibly uncomfortable tone throughout, as the main characters mental health declined slowly and slowly more as the movie developed so did the increasingly uncomfortable tone and the characters became more and more unpredictable you never knew what was going to happen, which made it very uncomfortable due to the increased stakes and power that the witch was getting over the characters, the movie built up tension and had amazing Jumpscares, the movie did an absolutely incredible job at building the movies tension, it did an excellent job at extending the scenes and building the tension making the audience not know when a jumpscare was going to happen made me on the edge of my seat throughout, the creativity when it came to the Jumpscares was also excellent, it was completely different every time and the director somehow made one house be capable of way more scariness and Jumpscares than it should of done, I was simply amazed at how well they did with the Jumpscares which got even more scary as the movie went on.My next few positives would be the representation, unique character perspective and themes making the concept of the movie really interesting, as well as the character background and depth. I thought the movies representation was fantastic, to have a largely black cast was excellent and considering the themes of refugees and escaping your country it was really interesting to see the different cultures displayed within the film, and having the characters escaping their country due to having no other choice due to gangs was so interesting and unique for me, and they cleverly linked these themes with not being able to let go, these were both balanced and tackled really well and were cleverly intertwined throughout. I also really appreciated the character background added, spreading out what life was like for the main characters across the whole movie really helped with understanding what they were going through, there was also so much character depth, both main characters were fighting over not letting go of their country and troubled past with their daughter but also having to fit in a country that shuns them or where they don't feel welcomed so this was powerfully done and added multiple layers to the characters involved.My final few positives would be the performances, script, equal amount of time spent on both characters, plot twists and amazing ending. The performances from both Sope Dirisu and Wunmi Musaku were truly incredible, they showed such depth and nuance to their performances, they managed to make their characters so believable and real it was incredible to watch, their performances and subtle facial expressions were also terrifying and contributed towards how scary the movie was. The script was also very powerful, the social commentary the movie conveyed about a lot of the populations views on refugees and even black people was powerful and would be really impactful for a lot of people and it still was for me, and the script and dialogue in general was masterfully constructed and put together. The movie also did a good job at spending an equal amount of time on both main characters, the movie did an excellent job at balancing both of the characters out, I understood and connected with both characters an equal amount, and the movie spent a lot of time developing both and it was never one way or the other. And finally the movies plot twists and final act was just fantastic, I genuinely didn't see the plot twists coming and they really changed how I saw the movie and its characters but in a good way, it really concluded both their character arcs excellently and very cleverly and ended the movie on a high.Overall His house is a creative, unique, powerful and terrifying movie that is an incredible debut feature for Remi Weekes, who judging by this movie has a bright future ahead of him."}, {"id": 183, "text": "I very much enjoyed the suspenseful nature and the setting of this film but what caught me off guard in a pleasant way is the plot and the human side of the story. In my opinion this is why it will be seen as different to others in the genre. It is, ultimately, a love story, made all the more poignant by loss. Throw in genuinely scary (not in a gory way) moments and you have a great film."}, {"id": 184, "text": "Excellent premise and great story. Very well made and acted film.The horror left me disappointed as I was hoping for something more sinister than what they were enduring."}, {"id": 185, "text": "This film isn't just a really well done horror flick that managed to give me the chills, it's also a very beautifully written story about two people who have to leave their home in order to survive and find a new one.In my opinion this film is very special and wants to show us a lot more than the usual white-family-buys-a-spooky-house-films. It's about real demons but also inner demons and demons from the past. It's about refugees but also culture, vulnerability and being scared of a new world. I've watched a bunch of films in my life, and there's only a few that are stuck in my head and make me think. This one managed to do so."}, {"id": 186, "text": "A power-house debut from Remi Weekes, deftly balancing social commentary with old school horror (and for once, without zombies).The movie pulls you inside the life of a Sudanese refugee couple assigned to an apartment in London after a harrowing escape via boat. In addition to the nightmare of their experience, they've got a potential poltergeist.Movies often face-plant while they struggle to convey what is real, a dream, a backstory, or something else. His House weaves these shifts expertly. And you will not see the twist coming in the last act.Here's hoping Remi Weekes joins Ari Aster (Heriditary/Midsommar) and Robbert Eggers (The Witch/The Lighthouse), bringing horror to a new level of intellectual freakiness."}, {"id": 187, "text": "His House is a film in such that may not be completely what you are expecting since most Netflix things have that ring to it. If you like the horror or the thriller genre then you should definitely watch this film. His House is also great to watch around Halloween. The performances are great, the cinematography is good, the filming area / setting are good, but the CGI is not the greatest although it should not mess up your viewing experience. Don't be afraid to watch this one and go in with a open mind."}, {"id": 188, "text": "At last a horror movie which has some depth . The story and the background is so contemporary on the real life horrific past and present we all are living in today . Tribal wars, refugee crisis, racial discrimination and the desperation for survival . What else can be more horrific than these harsh realities we are living in today . All these horrors are so nicely captured my the film ."}, {"id": 189, "text": "I really liked this movie. I thought it was just going to be a typical horror story but when I watched it I was surprised. It has so much depth... and it makes you think about the things that you do that end up bringing bad consequences. Plus, some scenes really make you jump."}, {"id": 190, "text": "What a surprise this was. Desperate to find a decent horror after some many terrible ones. The acting is understated and brilliant. Great casting for a start. There is a great miss of questioning, is this about reality, PTSD, different beliefs in different cultures, or all of the above. There's definitely some tension, scares and the right amount of confusion, but above all, you actually get a decent ending. One to watch for sure."}, {"id": 191, "text": "I'm annoyed that this isn't rated higher. I think the story was done pretty well and the horror (with the jumpscares and creepy mind bending) was also quite good. There's also a really stark portrayal of refugee life in Europe and brought out the dread, insecurity, tension and sorrow in a solid way. Acting is top notch by both leads. Must watch!"}, {"id": 192, "text": "Super interesting. Excellent acting. Good amount of scary mixed in with reality."}, {"id": 193, "text": "Story about a couple of refugees that lost their daughter living in a home given by the uk government the horror is not subtle so many surprises, great performance and direction"}, {"id": 194, "text": "This is a horror film with a message. Two people feeing civil strife in Africa wind up in Britain as asylum seekers and are treated like scum by Brits both black and white. They are put in some grungy housing with peeled wallpaper and roaches but they attempt to adapt to their new surroundings. The African couple playing the husband and wife are excellent. They endure ghosts and other evil spirits after their daughter has drowned on the journey on a small boat. The ending was quite a surprise and I highly recommend this movie."}, {"id": 195, "text": "This is such an amazing film I absolutely cannot believe anyone who's rated it lower than an 8 yeah it's got jump scares and it's horror which is cool and all BUT OH MY GOD DOES THIS FILM HAVE SUCH A MESSAGE. Strong metaphors woven into this movie it's gripping from the start when you watch it it might seem like your average horror movie but stick with it it's absolutely amazing and heart aching at the same time. There's a lot to learn from this movie and if ignorant people can look past the black acting leads and director they will be open to a touching story which we all need to be aware is happening in this world. Love it."}, {"id": 196, "text": "Firstly, the film settles the tone of gray, cold England and introduces the main characters, Bol and Rial, both well played by Sope Dirisu and Wunmi Mosaku.The first 60 minutes of the film are pure horror, perfectly directed by Remi Weekes who utilizes suspenseful sequences to capture the audience attention and concludes with well executed jumpscares. Moreover, the film deals with relevant themes such as xenophobia in what, in my opinion, is one of the best scenes in the feature; Rial speaking in his native language to a group of black english teens who respond with aggressive insults and mocks. Furthermore, Weekes correctly portrays an atmosphere of intrigue and confusion, in the complete style of Jordan Peele, as it something was really wrong but you just don't know what it is; a clear reference to Peele's 'Get Out' can be perceived, as well as the soundtrack, which resembles the music from 'Us'.The second part of the movie focuses on telling the backstory of the characters, employing a series of dream sequences, beautifully filmed, and very clever flashbacks. However, this part of the movie breaks with the formula that had been going on for the first hour and the feature acquires a dramatic atmosphere. Furthermore, this second part becomes more subjective, confusing and ambiguous, which in my opinion is a great decision from director Weekes, who guides his direction into making the build up of what would be the movie's plot twist and climax, an event that would wrap everything up and will make us understand why everything took place.In conclusion, the movie is like two movies merging to tell a single story; in my opinion it should have stayed as a suspense/horror film, with the formula of the first half, because it had potential to become on of the best scary films of the year. Cinematography is one of the highlights along with direction and edition and acting is pretty decent.The movie is great at its suspense moments, but it kind of fails in the combination with its dramatic aspect, at the end it tends a lot to hard-to-believe fantasy and it just doesn't work because it stays in the middle of drama and horror, ergo, it is too real to believe the fantasy and too fictitious to don't; the closing scene is brilliant though. It's a good, entertaining, original movie; far better than your average horror film."}, {"id": 197, "text": "His House is a exceptionally written film with great performances from both of the main stars. I have to admit the way the story was written was pretty clever. The film is more of a thriller rather than horror, but there are plenty of creepy moments to keep the movie on the thrilling side."}, {"id": 198, "text": "There are quite a few clever and eerie shocks here, and the setting, a run down estate somewhere in the UK is a nice change from the creepy old house scenario, at first seeming an unlikely location for a 'haunted house' drama, but it is used very effectively. The story, about a refugee couple, touchingly played, who having escaped massacres and civil war in an (unnamed) African region, who are allocated a house to live in in a down at heel estate. The house seems haunted at first, but maybe it's the ghosts of those they've lost back home and maybe a demon has followed them? The sense of threat and danger is well done, and although here and there some of the dream/haunting sequences and flashbacks might confuse the audience, the cast and director manage to draw you into the experiences of the couple and gradually reveal their secrets. It's all a bit downbeat, but it's an intelligent and meaningful piece of filmmaking."}, {"id": 199, "text": "I love the genre of horror and seen a lot so I'm really surprised about this rare gem! Excellent actors, beautifully filmed, and on top of all that also a great storyline with a depth of something completely new and different. It's so refreshing to finally see something new just like the absolutely amazing Indian/hindi movie Bulbbul which I think is the best horror movie of the year. Well done Netflix, plz more of this and less American crap."}, {"id": 200, "text": "It felt just right. All the way through. No need for further explanation."}, {"id": 201, "text": "2 African immigrants are given asylum in the U.K. and bring same baggage with them.Great acting. Brilliantly filmed. An actual script that builds characters, has a plot and beginning middle and end......rather than a half baked, laboured, metaphorical 'elevated horror' that has sadly infiltrated the medium in recent years.The only real problem is that it is not scary. Go in knowing this and you will not be disappointed when the scares are thin on the ground."}, {"id": 202, "text": "This 2020 horror film tells about an African immigrant couple that move into their new home and discover that something evil haunts it. This is ok, it has some creepy moments, a bit of drama and kind of drags a bit, but ends well. You could check this out If you like supernatural horror flicks, but for me it's a one time view."}, {"id": 203, "text": "Was an enjoyable film that really does grip you with some nice touches and dark comedy mixed in.I felt as a horror movie though the scares and horror elements were not particularly interesting, scary or coherent.Good film overall, but if your looking explicitly for a horror movie then I don't think this scratches the itch personally."}, {"id": 204, "text": "In this genre His House is a nice breath of fresh air, something different from the usual things we see. It's not all perfect but it's certainly good enough to entertain many fans of this genre, with creepy passages and decent horror scenes. The cinematography isn't bad with interesting camerawork at times. As for the acting I thought the two major characters played by Sope Dirisu and Wunmi Mosaku were very believable in their roles. Good performances from both of them as well as from the rest of the cast. It isn't a movie I would watch again but it was certainly good enough to keep me entertained for the whole duration of the movie."}, {"id": 205, "text": "Dont let the comments fool you! The movie plays with the fact that the traumatised protagonists see ghosts of their past. The premis of the movie was better the the result. It trys to be critical to the social impact of migration but sells it for cheap jump scares. If it had only a little of Cubricks Shining it would have been a 10 out of 10. But the story is lackluster. But on the bright side the cast is very good. But they only can deliver what the script is giving them. But what can i say its free on your Netflix subscription so watch it if you are boared. But it is nothing that you should pay specificly!"}, {"id": 206, "text": "Been thinking about watching this film since it came on Netflix and last night against my better judgement I did and really enjoyed the movie. First off as a horror film it is a slow burn but makes very good use of it for the most part. The acting was top notch. The story was okay and not to political which you think it's going to be but thankfully it didn't stay on that subject to much which I personally think would have spoilt the film. Some of the genuine horror scenes didn't work for me as I found that when there was one person scaring the main character it worked really well but when there were many scary characters it didn't work and the tension went out of the movie. Does it deserve the 8, 9 &amp; 10 star scores no it doesn't. Having those kinds of scores means is is flawless and it wasn't. A solid five or six star review is teal. Some people are wanting this film to represent something it's not and that is why they have given a false rating. Watch it enjoy it, which I did. Would I watch it again, no but that is not to say I didn't like it, I did but it wasn't the best thing that I have seen."}, {"id": 207, "text": "This seems to be one of those movies severely hurt at the editing studio or by lazy directing.The story has potential; Sope Dirisu and Wunmi Mosaku do a remarkable job at acting; even the ending is good and special effects are satisfactory. Still, it feels like a good story that is poorly told.The first half or so of the movie is very good, tension builds up steadily and it really looks like it will eventually skyrocket. Unfortunately, that never happens: it gets boring after some time and there is no climax at all. Even a major plot twist towards the end is wasted by poor storytelling.It's a shame, not for what it is but for what it could have been."}, {"id": 208, "text": "This is the story of an African couple who come to England as refugees. Their ship sinks in the middle of the trip and their daughter dies. They stay alive and they reach England. After a while, they are released from the refugee camp and they are living in a strange house in England. It is hard to predict the next scene. The story is well-written. The special effects were awesome. I enjoyed the sound effects and background music. Sope Dirisu and Wunmi Mosaku played well in this movie. In summary, I recommend this movie to horror genre fans."}, {"id": 209, "text": "I watched it, story looks interesting , at least they tried something new. Watchable but do not expect too high."}, {"id": 210, "text": "I did not enjoy this movie very much, it was strange. It seemed like something that Stephen King would've wrote. Supernatural storyline that is never truly explained and just leaves you thinking, wait... what?!?! Not a fan."}, {"id": 211, "text": "A great story , a very very good performance from the couple and an amazing music through the movie . Really l didn't think that l would like the movie"}, {"id": 212, "text": "His House was a watchable horror dramathat had some worthy moments in it that will give you some good and effective scares and drama that many people can relate to.This film had also some good actors in it ,and even if i dodnt know many things about them but i think that they have a good acting future in front of them.Story was fine and it had some good story telling and good family dramas that showed how how refugee life is like and how it is for them to get use to and how long that takes for them to get used to a new life style.His House was a watchable horror drama"}, {"id": 213, "text": "As an film to entertain you I found this bleuch!!As a supernatural horror again bleuch!! As a statement on how humanity is totally screwed I'd give it 10/10. I found it tedious from start until the last twenty minutes. The plot was obvious (to me) and the mistrust of the newcomers by the locals as expected if you read or watch the media. The last twenty minutes makes up for I thought as it explains visually what a crap life some people (maybe most ) have. The only truly unbelievable part of the film the house the two main stars were given in the film. As an ex-landlord myself I'd be sent to the pokey and fined heavily if I rented out a house in that condition. I don't believe councils would get away with it either."}, {"id": 214, "text": "He's big he's red his feet stick out the bed Peter Crouch"}, {"id": 215, "text": "Going in I thought I'd know what this film was about, I mean a film in 2020 about two black refugees going through the immigration system in Britain how can it be anything but what I'm expecting it to be? But I was wrong, and I am so glad I was.Another reviewer said that this is woke and a commentary on immigration, it isn't, not at all. This is not a film about race or the differences in race or the difficulties of adjusting to living in a new country, it's not trying to say anything about the immigration system it's just telling a story that happens to involve new immigrants to a country, saying this is a commentary on immigration is like saying Jaws is a commentary on water safety or Die Hard 2 is a commentary on airport security.This film is a supernatural horror about the desperate things that people will do to survive and the consequences of those actions, and it's one of the most entertaining horrors I've seen for a while with some genuinely unsettling scenes, I can only hope people don't dismiss it because of a few ignorant reviewers who see imaginary agendas whenever there are black characters leading a film.8/10"}, {"id": 216, "text": "There are so many terrible films, particularly in the horror genre, on Netflix at the moment. This is not one of them. All the horrors I've watched recently are either far too dumb, or too far the other way - relying on being artsy or having powerful imagery but sacrificing a satisfying story. This one gets it just right. It is genuinely intriguing but leaves you with a resolution. There are layers of interpretation, but also a nice clear cut story.I found for a good part of the film I thought it was just a theme of asylum seeking; a couple fleeing something bad and arriving at a not-beautiful side of Britain, with the man trying to adjust to a new culture and then woman conversely holding onto her roots, all through the narrative of an apparently haunted house. The pair being explicitly warned that they might be sent back if they made any trouble, or didn't integrate properly, emphasised this theme. But it turned out to be about something quite different - something I can't really say without giving away the plot substantially. It could have been based on anyone with a past, and the fact that the main characters were refugees worked well for the narrative but was not the entire theme.It was well cast and very well acted, which is not actually all that typical in many films being streamed at the moment. Matt Smith is in it but as a side character: they don't try to force him into it beyond his welcome just to exploit the well known name; also refreshing. He is good in his part, but the two leads are allowed to shine.I'm not much of an artistic critic but I felt they built and maintained the atmosphere brilliantly. I can't even tell you if it was visuals or score or lighting or whatever because I'm not the type of audience to dissect that - I just know it gripped me and took me with it emotionally. The tension is good and there were jump scares that work well. Personally I can't stand a film that's just reliant on jumpy moments or gore and lacks any actual substance. This, to me, gives the best of all worlds. And when it ended I felt genuinely glad I'd watched it, and watched it to the end.Honestly this little film buried far below the (poorer quality) netflix recommendations was a very positive surprise for me and I would definitely recommend watching."}, {"id": 217, "text": "The horrors that asylum-seekers have to put themselves through when meshed with a haunted house storyline is what we get in Netflix's His House. Bol (Dirisu) and Rial (Mosaku) are refugees fleeing their war-torn country of Sudan; they brave bullets, rough waters, and even lose their daughter as they finally arrive in Britain where they're granted probational asylum. They're temporarily moved into a shabby, crumbling house in the London suburbs, and that's when the past begins to haunt them.His House is a pretty strong directorial debut from Remi Weekes, who has also written the screenplay. It may just be a 93-minute film, however, His House manages to dive equal parts deep into the struggles of immigrants as well as survivor guilt. While Bol tries to blend in with the new surroundings (he sings football anthems at bars, changes his attire, and prefers to use tables while eating), Rial holds firmly onto their culture (she wears their daughter's necklace, dresses in vibrant colors, and sits on the floor while eating).The scares, the greatest thing about horror films, are well-conceived. Weeks mixes jumpscares with more atmosphere-heavy ones in an effort to keep viewers on edge. Practical and visual effects are put to solid use in these sequences, though some fare better than others. A little inspiration has been drawn from films like The Conjuring and Lights Out, in a good way. Weekes, through some effective crafting that blur the lines between fantasy and reality, elevates His House beyond the conventional haunted house movie.Not everything works though. The final act switches horror for a somewhat predictable twist, and while the closing frames make for a powerful set of metaphors, it feels slightly sketchy from a closure standpoint. The performances are good for a film that revolves mostly around two (or three, if you include the beast) characters - Dirisu and Mosaku showcasing credible, lived-in feats."}, {"id": 218, "text": "Well... I was lucky enough to watch this movie at the 2020 Sundance Film Festival (internet). I am a big fan of horror films and this movie definitely delivers. The story is one that blends very well the horrors that many refugees face along with the manifestations of the terrors they bring. Often times the most scariest stories are those that deal with the non supernatural.More specifically, the movie is actually logical and doesn't fall for the classic tropes. In many scary movies that deal with a haunted house, I ask myself Why don't they just move?!?!?! but in this case they can't because they're placed in these specific, confining circumstances in order to get their asylum granted. I was also a fan of how the film portrays the female character as the strong, cool and collected wife while it's the husband who quickly descends into madness.Overall, I encourage everyone to watch this movie when it comes out on Netflix Turkiye."}, {"id": 219, "text": "As my parting shot to the Halloween season, I give you a horror film that mostly eschews the usual tropes to concentrate on two good human beings terrified by their country's turmoil and their own familial loss. Scary it is a bit; searing it is much in its commentary on current societal guilts.You've not seen a haunted house tale like this one. The ghoul is less ghoulish than emblematic and the residents haunted by their past more than their Stephen King-like ghostly resident. Brimming with commentary on refugees and loss, Remi Weekes' His House is a thinking person's thrilling scare and cultural relevance.Bol (Sope Dirisu) and Rial (Wunmi Mosaku) flee from war-torn South Sudan, losing their daughter in the sea, and are given a home in London by the Brit social system. They aren't allowed to leave their new home, and thus they must endure the torments of a creature that may have followed them to torture them, Babadook-style, about their alien status and responsibility for their daughter's drowning.While the ghost makes sounds and actually talks at times, writer/director Weekes centers the story on the protagonists themselves-Bol's guilt and Riel's motherhood. The jump scares are few but the menace all the more harrowing because of the mental torture. Weekes masterfully displays the couple's loneliness through shots of a hollow home and bleak, vacant outdoors. He also quietly shows through flashbacks the grim remembrance of a ravaged country and a lost daughter.As refugees, Rial and Bol are appropriate examples of good people caught in compromising situations they seem to have no control over. In that way, Weekes has given the audience a realistic heads-up about the challenges of immigration and the plight of unfortunate parents upended by war and fate.This thriller at a hairy time of year does double duty competently scaring and responsibly commenting. His House becomes our house of the mind and the world, now and forever. On Netflix"}, {"id": 220, "text": "I'll jump straight into it. I thought this film was pretty good on the whole, but at same time it could have been so much better.First off, I enjoyed the message the film portrays and it definitely resonated with me hours after watching. The acting was good from all involved and it built suspense really well also.What I didn't enjoy was that I thought it was a bit dull at times. Long dream sequences you knew full well were dreams and, because of this I felt slightly disengaged from the film. Sticking with the theme of the dream sequences, some of them I just didn't understand at all. Seemed like it was made to be confusing for the sake of it.It's not a bad film whatsoever, but it's something you won't shout about to your mates or whoever. I think a 6/10 suits this well."}, {"id": 221, "text": "First, the main actor is realy good! This guy should get more roles.Movie is slow but it has a deep, sad point to make. It makes you realize what it means to be a refuge from this god forsaken countries. I see this horror moments as nightmares, created by guilt, fear and heartbreake, while being in enviroment that doesn't offer much more than staying alive.Movie got in my head, I couldn't sleep few hours after watching it. I couldn't stop thinking my god maybe some of people who came to my city saw this kind of horror and I judge them.Then the moment when main actress wakes up in, I guess a school in Sudan. It was horrible. Made so real. Director did great job to show us what it means to see this. It is a moment that happens, a lot, for real. Humanity is cruel.This movie is horror with its parts but the sad thing is, there are many people who do have this nightmares, who realy saw this kind of real life horror, making this movie more a drama.World has so many parts that are pure hell.This was a sad movie."}, {"id": 222, "text": "His House starts great and it also ends strongly. However, that beginning and that ending feel like they are from two different movies. It's quite unfortunate that it made me feel that way because I do think that there is a lot of things that this movie gets right.Let's start with the first half of the movie. What I would consider the horror half. This film began very quickly and left very little time for the viewer to get situated. The first 45 minutes were indeed very scary, and I was drawn to the screen. But what made that first half so great, was that it didn't just rely on the usual horror tropes. His House explored themes of racism and all the other challenges that refugees face. These issues were explored in a way that caused tension even outside of the house that works as the centrepiece of the story. Another aspect that created its own horror was distrust and challenges of marriage. This film managed to create an atmosphere of constant terror and tension, and I, for one, really liked it.The second half, however, moves into a completely different direction. What started as a pure horror film, shifts more and more into a drama as the run time moves towards its end. The horror changes from the typical haunted house style more into creature horror. That's also where the movie stopped being scary for me. I have never found creature horror to be particularly scary and this film didn't change that. I do realize that that is a personal problem, and most people will probably find the second half to be nearly as scary as the first one. But it's not just the normal horror stuff that changes. The two aforementioned aspects of immigration and marriage are almost completely forgotten about. And it is quite unfortunate that this is the case. I felt that they added so much to this movie and made it more than just another haunted house film.With that being said, I did like the second half nearly as much as I liked the first one. His House end up becoming a rather touching drama by the time it finishes. And if it forgot about the challenges of immigration and marriage, it replaced it with the conundrum of whether to leave ones home country in the first place. Although a new home promises a better life, is that always going to be the reality?There is a lot to like about His House. I think that it fantastically approached horror by making it about more than just jump scares and a scary atmosphere. I also liked that it was a haunted house film that didn't take place in an abandoned mansion. And, I also liked the second half with everything it had to offer. The thing that lessened my excitement was the fact that I felt like I ended up watching two different films. Had there been more cohesion between the two halves, I'm certain that I would've liked this film quite a bit more."}, {"id": 223, "text": "Already in the trailer she looked sinister and did not disappoint. Full of terror, on the one hand the story of a haunted house or rather ghosts, since that concept is used of saying that ghosts do not inhabit the house but that they inhabit us, on the other the drama of the refugees, which is also horror. A Sudanese couple escapes from the war in their country and lose their daughter in the process of fleeing to England, after a time detained they are transferred to a dilapidated but spacious house where they can rebuild their lives. It will not take long to realize that they are haunted by terrifying presences, a masked child brandishing a knife and a witch (according to the cast but in the translation he is named as a witch) who asks for a blood sacrifice to bring back to the life to the minor. Terribly gloomy, it appeals to the atmospheric heaviness and the social and family drama that adds to the share of terror, plus successful moments that make the hairs on the back of the neck stand up (be it the cliché of the genre or what refers to the tragedy of the refugees). Compact, original and as ominous as it is simple, they have in the performances of the Nigerian Wunmi Mosaku (Fantastic Beasts, Batmans vs Superman, Luther) and the British Sope Dirisu (The Hunter and the Ice Queen, Humans) one of the high points of the film. Also appears Matt Smith (Dr Who, Charlie says) and when not playing amorphous bicharraco the Spanish Javier Botet (It, Mara, Polaroid, Slender Man, Insidius 4, The mummy, Alien Covenant). An intelligent terror very close to Get Out (2017), not far from the conventions of the genre but without the rubbish of a serial killer reaching teenagers.Detail: both protagonists participated in Black Mirror in 2016 but in different episodes."}, {"id": 224, "text": "His House is simply excellent! It's really hard to categorize as simply just a horror film as well because this film has so much going on under the surface. All in all, it plays out as more of a psychological drama than it does a horror film.Shedding light on a unique underrepresented perspective of refugees seeking asylum, this film has it all, great acting, a well constructed plot that coincides with the philosophical message it conveys, a subtle social commentary on immigrants and discrimination, and of course horror elements that take an interestingly artsy and stylistic approach to the predictable pattern we've come to expect from the haunted house genre. With sequences that place our protagonist in dreamlike fantasies stemmed from tragic events of his past, this film refuses to be confined to traditional ideas in terms of its haunts. There is also something to be said about the candor the film has about its own plot, the characters seem to know exactly what is happening to them and why, this is echoed through a couple of my favorite of Riel's conversations, one with her husband and one with Mark their case worker. The mystery for the audience becomes about the tragedies of their past rather than what is haunting them. This is a bold move because in doing this I will say the second half of the story looses a bit of its suspense but at the same time remains completely unpredictable.The second act that reveals the source of the couples harbored angst, although placed in reality, is arguably more horrifying than all the scares that lead up to it. It is sure to be the scene that sticks with you long after the creepy ones fade. Although the atrocities are still there, after this turn in the film there is a shift in mood away from traditional horror which is why I would recommend this movie to anyone not just fans of the genre. My one criticism would be that the end scene was a bit anticlimactic in my opinion but it doesn't take away from the story overall and that should not deter anyone from seeing this film. It honestly has to be my favorite horror film of the year probably because like I said before it packs in many themes and such a deep message. It's a story about coming to terms with guilt, shame and loss that is told more through a horror lens than it is horror at its core. This is sure to be a future classic."}, {"id": 225, "text": "'His House (2020)' follows a refugee couple who are moved into their new urban home and struggle to adjust to their new life, thanks - in no small part - to the otherworldly presence that lurks within their home. It's a film steeped in subtext, a marriage of genre and theme that creates an incredibly cohesive experience. Though it makes several missteps and is often too heavy-handed for its own good, the affair is compelling throughout and succeeds in pretty much everything it attempts. Its two leads do a fantastic job of portraying the terror of their situation, trapped in a haunted house and expected to be thankful for it. They have two distinct ideas about how best to proceed and this conflict makes for an interesting dynamic that allows the piece to explore its central issue even more fully, both on a literal and metaphorical level. Whether or not its horrors are 'real' is, ultimately, irrelevant; the movie's spooky events work just as well either way. They're a reflection of both the characters' inner conflict and outward situation, an intriguing and effective way of exploring how these things feel rather than how they are. These suspense sequences are atmospheric and intense, only occasionally tipping into potentially silly territory. As it moves towards its conclusion, the thing gets a bit more overt than it perhaps ought to (visually, at least). However, it sticks the landing thanks to its complex and satisfying final message. The overall experience feels oddly important, in a way. It empathetically delves into an underexplored situation, funnelling each and every one of its genre elements through this in an affecting and resonant way. It isn't perfect, but it's a gripping and distinct affair throughout. 8/10"}, {"id": 226, "text": "His House dwells deeper in a broadly spread subject matter. Integrating precarious &amp; widespread issues; such as hardened immigration policies, racial discriminations etc. All being in the vicinity of a horror themed depiction.From its very commencement, grabbing my attention through surreal sound designing &amp; an innate subtlety in the Cinematography. Capturing war torn african hinterland to a civilized London suburb; the transition is assiduously managed. Depicting social conscience through its persuasive narrative. Barring few flaws, it sailed smoothly enough. With the help of two stellar performances from our leads; their intent eventually became discernible. Setting up an emotional barrier around the premise; effectively foreshadowing other horror elements.Although there was room for improvements. We barely see any cognitive explanations for the supernatural occurences that take place. Nor any befitting insights into their pre habitat or the violent consequences they faced in the past. Apart from our two main characters, others didn't really have much of a screentime to reinstate their presence.In conclusion, the film took an unconventional route as a Horror project; indulging itself into various socio-political affairs. At the same time delivering ominous undertone which in return helped to create an unsettling yet tempting ambience."}, {"id": 227, "text": "Your ghosts follow you. They never leave. They live with you. It's when I let them in, I could start to face myself.His House is about a refugee couple that make a harrowing escape from war-torn South Sudan, but then they struggle to adjust to their new life in an English town that has an evil lurking beneath the surface. As a horror piece, this had the elements to make an effective experience. Storytelling is where it stands out. The premise is based off of a story from their background. There's a long monologue that tells it all in a great way. What it also utilizes is the fact of passing down stories from culture and generation. Going back into our characters' past lives furthers the experience. It's less of a dramatic past but more of a horror story of war and loss. A scene that captures a war zone experience is one of the best action scenes out there. Between the agony and how the scene is filmed, I couldn't have wished for a better directed scene. I don't know the story behind writer/director Remi Weekes but this must be a personal story for him to tell. Above all this is a story of what refugees must face after their given sanctuary.Actors Sope Dirisu and Wunmi Mosaku really did well. They're a great duo together and the essence of their character are portray perfectly. You wonder if what they are seeing is real or just a product of PTSD. What I found most interesting is the complex they live in. It's a character itself. As it's torn apart slowly, it doesn't just look great but also is done with purpose. Another scene uses the deteriorating walls to transition into a war zone. Everything is all meaningful. That's what makes this movie good. Sometimes I wish it could be just a little better. This is a more personal note for me but I wasn't always the most interested in what was happening. I appreciated everything but the slow paced scenes didn't always keep my attention. But I really do think this is a good movie. Horror should really aspire to be as meaningful as His House. The relevance and personal drama betters the connection and creates a psychological horror like no other."}, {"id": 228, "text": "I really want to be positive about this one. With even the horror movies trying to push the envelope like Hereditary often having major technical flaws, this movie despite some drawbacks, truly feels like a professional job, not only in its production but truly in its writing. It feels neither by the numbers nor without a basic sense of prudence in its structuring.Get ready for some cheesy visuals but that is only a cosmetic aspect of the movie. This is one of those supernatural horror movies that tries to have a very human terror at its centre as very well developed characters have to deal with their personal figurative demons in a very material way.Sure, some will insist its all some kind of metaphor like how they insisted that The Babadook was really about depression and you can take that angle if you like but the story stands on its own two feet without the need to pull at too much subtext.With its slight, chill atmosphere in a stagnating corner of my homeland, the sense of dread almost never quite leaves us as our two main characters deal not only with the unknown menace but with that curious omnipresence of the authorities and no matter how good our intentions, it's hard to not feel like a criminal. You cannot tell me that they weren't going for a racism theme.Seriously, that candle terrified me. I'm not kidding.I never know what to say about acting except it's amazing here. Matt Smith is memorable but he doesn't manage to quite steal the show.This is one of those movies that confronts us with some of the very worst humanity has to give and can experience and although there are indeed wrong notes in there horror is hard and one feels that a lot of passion went into this and it truly does respect its audience."}, {"id": 229, "text": "The best way to describe this is 'a BBC drama about refugees relocating to London...sprinkled with a bit of horror'.The recipe is:Take 1kg of 'Insidious', mix in a bowl with 250g of 'Lights Out'...and then garnish with a tablespoon of 'Hotel Rwanda'. So much plagiarism it's unreal. Monsters in the walls...ghosts that only appear when the lights are on...the list goes on.It was very slow throughout...and I literally couldn't wait until the final boss battle was over.A few jump scares, but nothing really 'scary'...the ghouls are just humans in weird masks and the final boss is just a man in a ton of make up.I was totally lost during the part when Rial went back to Africa through the window. I had no idea what was going on. As a consequence, my attention started to fade.A great idea, that wasn't executed to it's full potential."}, {"id": 230, "text": "Chock full of excellent acting, writing, and production design, My House is the most surprising Netflix production I've seen so far.It's surprising in part because the story is inventive and unusual, and almost defies classification. It is more or less billed as a horror movie. It would be more accurate to call it a drama horror, though. The horror is literal and visceral if you want to watch it that way; but, more interestingly, it is allegorical and even political. At its heart, this is a movie about the horrors faced by people forced to flee genocide, and the resultant trauma they carry with them through having to make impossible choices, including having to assimilate into another culture at the expense of one's own selfhood and culture.Don't get me wrong: this movie has some traditional and extremely creepy, scary moments, especially in the middle third. It does function well as a horror movie. But there is so much more to it, including more character development and more thematic content than even most above average horror movies."}, {"id": 231, "text": "One thing that I was instantly annoyed by, or rather surprised, is the fact the two characters speak perfect English. Even when the female character asks for directions while mispronouncing words, she speaks perfect English the entire film.The stero typical racial differences are also very distracting from the political message they want to send (more on that later). It seems that they desperately wanted our sympathy, but didn't want to put in the work to build up their character.The political message they try to convey is simply unclear and very poorly visualized. They move from one time and place to another and it's unclear how it alles fits together.The sound effects are heavily overused; there is often more sound than image and it often used in overkill to keep the viewer interested. That being said, the overuse of jump scares is also a very desperate attempt to get the viewer in their grip. This should not be the kind of movie that should have to rely on these easy ways to scare the viewer.The visual effects were OK, but also overused and you could definitely witness the early days of a young visual effects creator, using everything he has in his tool belt to how off his recent skills. The director should have known the time and place for this better.My most important observation was the idea that this film borrowed a LOT of elements from other horror films, but copied them without any real original tone of voice. They just wanted a quick way to bootstrap their movie and sell a decent trailer, which is simply disappointing.The ending, which I will not reveal, because there is not much to spoil, is just blurry, plain and not quite as thought provoking as the film leads up to. You turn off the tv with an awful font for the end credits and think to yourself well, that's one and a half movie that I won't get back....The acting of most characters was OK. I hope this film may lead to more roles, but I think their talents were underused; they could have easily carried his film more, instead of relying on cheap computer effects.In summary, this movie seems like a long short, one that was stretched to an hour and a half in order to be used by Netflix and add to their large stack of average-quality films."}, {"id": 232, "text": "A couple fleeing tribal violence find refuge in Britain, but their nightmare doesn't end there.Complex characters in a finely tuned horror - strictly for adults! This starts with a sequence of brief action scenes, almost a montage, that convey just as much as we need to know. That's followed by a glum depiction of refugee bureaucracy, which got my spidey-sense tingling that this might be another issues movie. We've seen plenty over the past few years, mostly family dramas that use horror to make a point: The Babadook, Relic, even Hereditary. Impressive, but either too metaphorical or incoherent.Well, this one hits the spot. It does raise the expected issues, but doesn't hammer them home, instead leaving us with their texture while the characters get drawn deeper into a mysterious terror. The performances are excellent, as the couple move together and apart, each absorbing in their own way the malevolence that stalks them. The emotional high comes in an accusation during dinner, with the couple truly at odds with their predicament and themselves.I prefer my demons introduced gradually, so while the director sustains the sense of hallucination, he does get a bit ahead of himself on the visuals. This blunts the suspense, and in the climax he goes too big on CGI. That's my preference, and I found much of the imagery startling, with some ghoulish touches out of Africa, plus a superb dream scene bang in the middle, followed by several atmospheric episodes. The sound design is subtle, which may leave the jump scares underpowered, and the orchestrated music only comes in later, finishing with a gorgeous choir.About halfway through I was delighting in the sophistication of the screenwriting - however, by the end me not so happy. The reveal genuinely confused me over whether there was one crucial character, or two. And if it was just one, doesn't that muddy the wife's motivation? It was the bus scene that made me think, Hang on ..., so maybe I'll get satisfaction on another viewing. The final scene is touching - it was only afterward I realised the contrast between the two sets of people, but still a great reminder that horror is best when it digs a grave for our most basic and dreary troubles.Overall: a few flaws, but a superior horror that weaves its wicked way, rather than ticking off the frights."}, {"id": 233, "text": "Creating a significant critical stir at this years Sundance Film Festival where debut director Remi Weeke's topical horror/drama was quickly snapped up by streaming giant Netflix for a worldwide distribution deal, His House is going to be a divisive film amongst genre fans even if a number of moments in this solid effort suggest Weeke's is a director to keep a very close eye on.Certainly more drama than horror, His House will disappoint anyone entering through its doors expecting a fright a minute exercise, not to say there aren't horrifying moments to be found within of which there are occurrences, with pure horror fans likely to be left severely let down by this small-scale offering that is more focused on the mental trauma and refugee experience of its main characters Bol and Rial.Played well by Sope Dirisu and Wunmi Mosaku respectively, Bol and Rial are realistic examples of those seeking a better life in a Western country and there terrifying escape and tragic circumstances create the backbone of His House's morals and narrative as the two figures try to deal with their new environment, new house and new horror's that may be lurking for them both real and imagined.Similar in some ways to lauded modern Australian horror The Babadook, His House prefers to steep itself more in the realism spectrum of horror even if in its latter stages it goes all out on a more out there finale that will divide appreciation amongst its viewers but regardless of what you feel towards this final stretch it offers some of the films most thrilling and tension riddled moments that are needed after much of the film prefers to slowly get through its material that is mostly thrill free for the majority.This more event-filled portion of the film is both a good and bad thing for Weekes film with it showing off some great skill by the director to craft some unnerving and unforgettable moments but also his mismanagement of the film throughout much that had come before with a feeling ever present that the genre moulding that film does may've been better served had it focused on being an outright horror or a social commentary drama that was more interested in the horror of the everyday rather than the supernatural.Final Say -A film with some brilliant moments, intriguing ideas and some solid performances, His House is a valiant attempt at crafting something new and fresh but as a horror film it barely raises a pulse until its final segments hit, while as a dramatic effort its engaging without every becoming a truly gripping experience.3 prying neighbors out of 5"}, {"id": 234, "text": "This movie could have gone from good, to very good if it wasn't for one thing (which I'll touch up on, without spoilers, in the final paragraph)What I liked about the film were the following things:quite unique in the message it tells within the horror genreActing was fantastic - especially the ladyWasn't predictable at all. The plot device that this movie centres on, was beautifully executed.Some of the cinematography and props was good for a low budget movie. The practical affects gave it an aura of authenticity.Paced very well. Starts of slow and suspenseful, but it picks up at the right time(s) and coincides well with its story tellingDoesn't attempt to over complicate itself. It's a relative straightforward horror movie that excels in its simplicity.Despite all of the above, I did have one big criticism. And this was a decision the writers made in the dying moments of the movie. It could have opted for a more daring choice that would have suited the theme of this movie. One that would have raised the stakes. But instead, I felt it copped out and went for a something safe which, in my opinion, erased the good work it does with some of its reveals.But nonetheless, it's worthy of a watch. So give it a try, and appreciate it for its attempts to be original and not cliched."}, {"id": 235, "text": "I think the scariest horrors for me are the ones rooted in real human suffering. And this is. A story of two refugees, displaced, traumatised, scared, alone and in a system they don't understand.Arriving in some nondescript suburb in England, they had finally escaped and the terror was now thousands of miles away. But now that they were in a physically safe place, the dark and the quiet and stillness swallows them and gave life to their memories.For me, it wasn't about a witch. It was about their traumas and their own demons, the wrong they had done to survive. The evil and suffering they had witnessed. Where else was all the pain from their memories going to go? It manifested in their walls and in the dark corners.In the end it was about learning to live with the ghosts. Acceptance and maybe even healing. A brilliant film, truly frightening to watch, unexpected twists in the storyline and packed full of ideas to dwell on.This is a horror with meat. The things that stick with me as the credits roll is the sorrow for all the faces of the countless ghosts who didn't get to live because of conflict in their home. The continued suffering of those that survive and attempt to start again."}, {"id": 236, "text": "A couple from Sudan suffer horrific atrocities in their homeland; they flee to safety deciding to make the treacherous journey, across the sea, in a dingy to the UK. As refugees they are initially kept in a less-than-friendly detention centre. After being housed, being moved to their home through the night, like cattle, they begin to try and integrate into their new world. Unfortunately ghosts of the past have travelled with them and begin to destroy any hope they had of a new life.I found this to be engaging from the very beginning, the cast are wonderful and the story is intriguing and unpredictable. The raw portrayal of what Sudan refugees flee from is pure horror and how this is shown in contrast with the UK and the treatment they receive in the UK, as if they are criminals themselves, is pretty eye-opening to say the least.The husband does something desperate to get themselves on the transport to come to the UK and this act of desperation haunts the couple in their home.Great performances here and an original, fresh story which held my interest through to the end."}, {"id": 237, "text": "It starts exactly how we expect. Wretched refugees fleeing war and death in Sudan. Tragedy on the long journey to England. The hostile, uncaring asylum system. Miserable accomodation among bigoted locals. A friendly official (Matt Smith), his hands tied by red tape, but trying not to be a jobsworth.So far so seen it all before. Worthy. A tale that must be told. But original? Not a bit.And then the haunting begins: a malevolent entity, a Night Witch from Africa with a point to make. But what is that point?The shocking twist (which we do not see coming) reveals all. We see our downtrodden refugees in an entirely different (and very unflattering) light. From here on it becomes a morality tale about monstrous guilt, about acceptance of deeds which cannot be undone, and about redemption and rebuilding.Is the Night Witch supernatural or allegorical? In the end it doesn't really matter in this sombre tale which ultimately is about facing the ghosts of the past and learning to live with them."}, {"id": 238, "text": "Must be me because it's a bit hyped at the moment as it is mostly with Netflix horrors. A must see. So I did and left with mixed emotions.Original at the fact that it's full of African culture and the refugee problems in the UK. The horror lays in the fact that it's all about the African culture are things are being seen at the house given to refugees. A witc is in the house.Sounds great but it's a lot about blah blah and now and then indeed some zombiefied people appear and masked ones.Was I scared, not one bit. Was it creepy, not at all but the effects used were okay and the zombiefied ones were well done.But still, towards the end I was just waiting for it to be over. Not that much of horror to see after all. Not for me this one. Gore 0/5 Nudity 0/5 Effects 2/5 Story 2/5 Comedy 0/5"}, {"id": 239, "text": "3 out of 5 stars.His House is a fair horror film that does offer some scares and jump scares which will keep your heart pounding. But the story is shallow as it tries something new and direction is dull and bleak that does make it difficult to sit through.The plot is about a couple who was able to escape from an hostile country in Africa. Able to get shelter in England with a probation period to pass through the immigration laws. They move into a house. Until they begin experiencing some haunting noises and sightings.There is more to the plot without giving away spoilers which focuses on the couple and there tragic losses they dealt with escaping.The film does have several creepy and scary moments that will get your adrenaline going when the couple run into ghostly figures or strange sightings.The performances were decent with the cast ensemble. The direction is also decent which feels shallow and could have been so much more. While it feels forgettable to any other horror movie."}, {"id": 240, "text": "Yes, I know Halloween was last week and I am late with this review but better late then never so here is my review for the new Netflix Horror Film His House. The premise of the film sees a refugee couple arrive in the UK but struggle to adapt to new life.Main Character Sope Dirisu who did a great job on Gangs Of London plays the main character here and once again he does a great job, he delivers a strong performance that makes you interested in his character. He just does a good job as a lead male in a horror film, there isn't much else to explain without spoilers just that he is really good.Supporting Characters Wunmi Mosaku who was on Lovecraft Country, though I didn't care much for her character Ruby, also does a great job here. Her and Dirisu have a great dynamic and actually it very well could be argued that she is the protagonist of the film and the moral centre. She does a great job here and adds plenty to her role and the film that you are watching. Matt Smith has a small role here and he does a good job when on screen, he doesn't take away from the film by being in it too much and actually adds plenty to the film and his relationship with the two leads works well.Story The story is good, especially in the last act for me. There is a twist in the movie that made it way more interesting for me and by holding off on it the reveal felt more impactful, also just the feeling of the surroundings was done well and made you feel stuck in this place with the couple. Though I will say that the first like 30 mins are fine but a bit slow, you aren't really given much in terms of plot and it feels a bit like it is moving through the numbers but it does pick up as it goes on.Script The script is okay, it creates a tense filled atmosphere and helps develop its characters to make them interesting. There is some decent dialogue here but nothing particularly memorable and no real moments to rise it above other horror films.Style The film does a good job of unnerving the audience and the characters, it relies on tension building instead of jump scares (mostly) which makes it more scary in my opinion. The film also is only 90 mins which is a good thing because any longer would have been too long, though I will say the pacing isn't quite there as I mentioned in the story section as to why it holds the film back.Overall Overall, this is a strongly acted tension filled horror film that is a good watch. It isn't going to change the horror movie genre but if you like horror films and have 90 mins free then I would say it is worth a go."}, {"id": 241, "text": "Our two, grievous Black leads, Bol and Rial, are anything but strong when separated. Power comes in pairs, and it's a lesson viewers come to define as they watch the two toil through the muck and the piss to keep each other in close arms.His House rather chooses to express the mentality of guilt and sorrow over subtle flashes of horrific figures, clips filmed in total darkness, and simple but effective music that works to keep you at the edge of your seat. Not too many jumpscares with this one, and it's just the perfect movie for a cryptic Saturday night. You'll feel an ease with the theme and be invited to explore the world of struggling refugees after harsh times learning to adapt in modern society with European fellows. Overcome the horrid dredges of Fear and submit to Love, but keep in mind that you cannot hide your true self from another's peering gaze.THE GOOD: Wonderful theme that mixes well with our plot and mingles exceptionally within the cast. THE BAD: N/A THE UGLY: Movie falls apart in the last 8 minutes. A terrible Hollywood-esque ending serves to resolve conflict."}, {"id": 242, "text": "Exploring themes of grief, trauma, immigration, assimilation, remorse &amp; acceptance through a horror lens, His House is a haunting &amp; harrowing depiction of the refugee experience and, in addition to capturing their inward &amp; outward struggle in adjusting to new life in new place, also delivers as a thrilling &amp; effective haunted house chiller.Written &amp; directed by Remi Weekes, the film blends character drama &amp; genre thrills into one finely layered narrative and holds nothing back when unleashing the terror that dwells within the walls of their new home. While there are times when the story becomes perplexing, everything adds up &amp; makes sense once the full picture of the characters' backstory is revealed.The atmosphere within the rundown residence is palpably tense &amp; often unsettling, and though Weekes relies on jump scares to frighten the viewers, most of them do work out in the film's favour. Wunmi Mosaku &amp; Sope Dirisu play the young refugee couple seeking asylum after escaping their war-torn homeland, and they both chip in with performances that are credible, grounded &amp; convincing.Overall, His House is a welcome entry in the world of horror and also marks a solid debut for Remi Weekes' directorial career. The proper care with which he sketches the characters' troubled past, vulnerable present &amp; uncertain future, and brings it in sync with the immigrant issues gives his picture a relevant touch &amp; relatable appeal. One of the better horror entries in Netflix canon, His House is certainly worth a shot."}, {"id": 243, "text": "I bet you might not know what this film is but it is the breakout film from Remi Weekes and it is a pretty good breakout film.His House is about two black refuges named Bole (Sope Dirisu) and Rial (Wunmi Mosaku) get released from a war in South Sudan. They end up in a house that has a evil presence waiting for them.His House was a film that completely surprised me. I had no idea that this film was coming out but it was definitely worth my time. It is a film that is a little hard to find now. Must films are just gory and forget about the scary part of the film. This film remembered to be scary. I am not saying that films should never have any bit of blood in them but I am just saying, if you make a horror film, make it scary. This film did just that. The story was the key aspect of this film as is most. Th background that they created for the characters really helped you feel for the characters. They also did this thing were you didn't always know if the the scene that they were showing you was a dream or if it was real. That really helped make the film pretty freaky. That was also the films disadvantage. The end of the film had way too many of those scenes and it messed with your brain the way it shouldn't. It was confusing at the end not knowing if it was really happening. That was the only flaw of His House. Otherwise the story was wonderfully crafted.The acting was the best of the year. The two main characters were executed marvelously. Sope Dirisu hasn't been in anything else I have seen but he gave a fantastic performance in this film. Wunmi Mosaku has been in some big films like Batman Vs. Superman and Fantastic Beasts. She didn't really have much to do in those films but she was in them. She sort of gave a little bit of a creepy performance. Both of the leads did fantastic jobs. Matt Smith was also in this film as as a guy who was checking on them every week or so to see how they were doing in the new house. He didn't have much to do and did good when he was on screen. Overall, the acting was pretty good.This film used practical effects a lot. It was a genius idea that worked to the films advantage. It looked 100 percent better than just putting glossy computer generated images in there. Some of the practical effects reminded me of the Pans Labyrinth. Especially at the end.I would really love to see more films like His House in the next couple of years. The only problem with the film is a little bit of a shaky ending. Besides that I would recommend this film to any movie fan."}, {"id": 244, "text": "What is left behind is a horror film with a great construction and development of characters and plot, we have a contained horror that permeates the work that goes beyond the supernatural, we have a social horror that works very well during the work, even if this aspect is explored in a light and often subjective way.The script, which tells the story of a refugee couple who flees to England, and in his new life needs to deal with prejudice, with social phobia and with the pain and regret of having lost a child in the crossing, the film is full of small mishaps and details that complement his work, such as the exploration of the culture of Sudan and the religiosity that mixes the psyche of traumas of the couple.The direction of Remi Weeks is very good, the director knows how to build tension very well, without resorting to sound effects or cheap scares, here the fear is real, it is built and grows throughout the work, the film also has a beautiful photograph, which contrasts well the gray of england with a yellowish palette of sudan.The performances, both by Wummi Mosaku and Sope Dirisu are great, both deliver characters full of quirks and with many dimensions, some explored and others are more on the surface, it is also worth mentioning the house where almost the entire film unfolds, we have a great scene composition and an aversion climate very well given the residence.What was left behind is not a perfect film, we have a rhythm problem that bothers the viewer and we also have a third act very triggered by the rest of the work, but overall we have a great film. NOTE 8/10"}, {"id": 245, "text": "Initial Thoughts: I did not find this film to be a politically motivated film, however, it does pull from that streamline with refugees being the focal point. I felt the story to be absolutely compelling. The undertone for me showed that adjusting to a new place, a new land can be difficult, and strenuous. This film pulls from that and then adds a cultural lore that adds to the intensity. The evil of His House is slowly pieced together with shadows, whispers, and patience. Eventually everything is brought to a front that comes to a death-defying end, but eventually brings about it, some peace as well.The two leads were strong together and in their own ways. They brought the intensity and calmness of each situation to a story, as I said above, was already strong.Lastly, the cinematography was spot on. Everything was fluid, from steady camerawork to near perfect effects, this film was fun to watch.Overall: If you haven't had the chance to watch this film. I would definitely recommend it. Especially if you enjoy thriller films that offer a hearty meal instead of cheapness to just get a scare.Enjoy the show!"}, {"id": 246, "text": "'His House' is a fine horror film with interesting shots and imagery overall.Other reviewers (bot accounts with only one positive review of this film, as always) mention that there is a twist in this film, but there's not. They also state that this film is amazing, but it's not that either.The 'twist' can be seen after the first 10 minutes of the film, and the ending, while not being anything original, was still ok.There were also some cool scary shots and nice surrealistic imagery, but sometimes the CGI was taking me out of the film.In terms of storytelling, there's not that much to work with, the whole film can be summed up in 4-5 sentences. Our family duo is overcoming their fears, and...that's pretty much all. There's also Matt Smith in this, but he's just sort of there. And there also was a neighboring lady that had 2 sentences in the film.Besides some social commentary and lots of victimization attempts and wishful thinking, there's nothing more of note. Lines like They will send you back to die like the ****ards always do and some more bashing on Europeans, as well as further pushing of an idea that if there is a military conflict on your territory, then people all over the world owe you something.P.S. Was nice to see Javier Botet wearing full-body make-up again :)"}, {"id": 247, "text": "His House is far from a traditional horror and will certainly not appease viewers looking for a movie that follows the Haunted House status quo.The concept was good. Following an African refugee couple who have fled turmoil in their homeland only to find an all new horror that awaits them within their temporary accommodation.His House has a slight art-house feel with good tone setting that reminded me of The Babadook. But it moves too quickly to the revelation, physically, of what torments (or will torment) the lead couple. It didn't build any real suspense and because of that the scares fall flat. A shame because it could've been truly terrifying.And this is the issue with the whole movie. The pacing is off. Too slow where it could move more swiftly, which ultimately diminished the scenes where suspense could be utilised to ramp up fear.I was rooting for His House and I can see why some have opted for the higher ratings. But for me it felt like a great opportunity missed. A genuinely compelling concept let down by below par execution.The twist is not so much a twist. More an explanation for the presence within the house. The final scene is swift but good. A simple but well shot piece.I would recommend fans of cerebral horror give it a try. I didn't feel my time was wasted. It just didn't quite fulfill the early promise."}], "reviews_amount": 248}