{"name": "Bheemasena Nalamaharaja", "titleId": "tt08016356", "reviews": [{"id": 0, "text": "What an amazing master piece. Each and every character serves a purpose to make this amazing Delicacy Bheemasena Nalamaharaja The Music adds the perfect Garnishing to this master Dish of Karthik."}, {"id": 1, "text": "This movie indeed is a Director's Masterpiece. The concept is fresh, a top notch Cast and Crew with an amazing Screenplay. The climax of the movie is another thing that needs a mention. This movie has a meaningful concept. 2 sides of the same coin showing different perspective is another masterpiece. Every character in the movie is nearly written is another plus. Arvind Iyer is another Gem of this movie. The technical aspects of the movie is as well top notch.A must watch for all the movie buffs. A movie with a concept and a message."}, {"id": 2, "text": "I haven't got bored in entire movie. It was smooth like butter. Hero done a natural act. Liked uttara Kannada language in between with little humor that's like a pinch of salt to make movie tastier. Achuthanna is a star now. Worth to watch movie to relax"}, {"id": 3, "text": "The plot seems very interesting to begin with, but it's stretched too thin with concepts and styles of too many people. While we can see good actors, they fail to perform in important scenes due to bad screenplay. Too many irrelevant scenes filled, characteristics of actors which neither adds to the plot nor adds to humour. Some Spoilers ahead: 1. Movie about mental health but friend's mental health completely ignored 2. Doctor was supposed to be funny but given a serious role 3. Cooking was another central theme but it's hardly used in the cinema 4. That lady's past is useless 5. Forced costumes for the hero. Bheemasena shown as a fighter not a cook. Made to wear female make-up for one lame saree joke."}, {"id": 4, "text": "Excellent performances by Achuth Sir and Arvind but story line is too lengthy.Good plot though.The background score and music by Charan raj is brilliant."}, {"id": 5, "text": "Vedic Brahmin girls eating Fish, unreasonable parent, etc While glorifying western (evangelical) system"}, {"id": 6, "text": "Audience will get ending suspenseful but story telling is not good enough, finally it's my opinions"}, {"id": 7, "text": "Beautifully written and directed movie. A fresh breath of acting, direction and music in the backdrop of lush green Karnataka. A soul soothing film with a beautiful message. Must watch...."}, {"id": 8, "text": "Aarohi Narayan, the hardworking and humble actress has given the performance best to her abilities and has even took risk for few scene. Her transformation to different shade and expressing variety of emotions has been really great. One of the big advantage along with her good acting skills is that her sweet voice. Trust me Aarohi's voice will add to the beauty of the film. Her performance in the films like Drishya, ShivajiSuratkal deserves appreciation and this BheemaSenaNalaMaharaja performance adds to her list of best performance. She deserve the success for all her hard work and dedication."}, {"id": 9, "text": "Pure time waste. Not worth watching. Boring and Unnecessarily Lengthy"}, {"id": 10, "text": "I'm running out of words to describe how beautiful the movie is. Congratulations to the entire team, you guys have done an amazing job ❤ PS: Totally worth your time!"}, {"id": 11, "text": "The film is like an undercooked, bland mutton biriyani with chewy rubbery meat and no flavor to add on to it. Mediocre performances combined with a lame plot fails an otherwise good idea. But Achyut is as always brilliant."}, {"id": 12, "text": "One of the best movies in Kannada in recent times. Direction, Music, Cinematography, acting from all lead actors is top class. Do watch it to get a real feel of New-Age Kannada Movie"}, {"id": 13, "text": "Screenplay, direction, music, camera work,,, awesome movie 😍😍😍😍"}, {"id": 14, "text": "There may be some loopholes but these type of movies are better than jatre movies like bharate odeya kiss I am not saying that is wrong but from that industry will never grow but this movie has a essence of something new and this movie's cinematography is excellent apart from that acting and direction is good and overall good family entertainer"}, {"id": 15, "text": "Very gud movie...has an message but lil lengthy in middle but apart from tat great movie! Loved arohi Narayan acting more than anything 💓n music too😘 -preethi rathod"}, {"id": 16, "text": "First half is good, then very weird ending. Sort of dishonest towards viewers."}, {"id": 17, "text": "So as Lucia taken from inception. This movies plot was taken from Shutter Island."}, {"id": 18, "text": "Very good narrative..natural acting..very nice movie"}, {"id": 19, "text": "This movie has been hyped by reviews. but lengthy movie"}, {"id": 20, "text": "Arohi , Aravind Aiyyar's acting is good, but story is boring and very slow. Only positive thing is Background music."}, {"id": 21, "text": "Everything is great about this movie.. Story, screen play, direction, cinematography, music, performance and climax. Top class..!! Kudos to the team for making such a wonderful content."}, {"id": 22, "text": "A must watch movie to all those who love to be with their loved ones in the most difficult times... 10/10 for location naration and the final twist inthe movie... will surprise all of them who watch it from the beginning.... selected best characters best suited for their roles. at last i would say Bheema has cooked it right with all the spices in it.. taste it with your eyes on the screen..."}, {"id": 23, "text": "Wonder why such movies are made...torture, stupid storyline, draggu...its like you go to a pani poori fellow in India, he will have his life story...where he was born , his parents friends what he does daily etc etc..nothing extrodinary..even i have a similar story of my life. whats the point ? this stupid movie is one such story..but drag and boring aste. Also that heroine is shown as a brahmin, from Iyengar family..she eats every animal in this picture..lots of such inconsistencies. Also that singer &amp; lyrics etc ..yappa, wonder where does such talentless artists come up"}, {"id": 24, "text": "Writing - Screenplay - Casting - Acting - Music - EditingThese 6 are always the pillars of any movie. Writing - Very fresh script with spice and other ingredients added. (9/10) Screenplay - Good work - Justice to the writing. (8/10) Casting - No role turns out to be unnecessary. (9/10) Acting - Male lead and Achyuth anna did a great job. Except for both the heroines all others did great. (7/10) Music - First and foremost hero of the movie is BGM score (10/10) Editing - There is a drag in some shots, can be easily avoided (6/10)"}, {"id": 25, "text": "Natural acting, excellent narration, BGM, locations"}, {"id": 26, "text": "This movie is too good. It deserved a theater."}, {"id": 27, "text": "Nice movie , acting skills of Arohi is very nice , movie has mixed emotions and shows why fathers are so strict some times the reason behind appears subtle but it is logical and has in-depth love on children &amp; wife which makes them so"}, {"id": 28, "text": "In a very long run, got to see succha best movie... being a family movie, no dirty scene,well composed.....no extra nessery dailogs.....movie plot is the best....the twist at the climax is mind blowimg..... And not to forget, actors have given their 100% especially arohi and bheemasena.....truely loved it......highly recommed...."}, {"id": 29, "text": "Female lead role would have been better, as this is an new direction and experimental movie. Grip was slippery in between and felt lengthy. Overall story is good.Triple A acted awesome Aravind, Achyut and Aadhya"}, {"id": 30, "text": "Beautiful narration, acting especially the kids, soothing music.... If the screenplay and narration would have been little tight, it would have been out of world.... The length could have been reduced by some 10-15 min.... Overall it will go down as a best of 2020 for Kannada industry...."}, {"id": 31, "text": "It's definitely Arvind Iyer's movie!!!...I was waiting for this movie long time, finally its released and didn't disappoint me. Worth watch with all the emotions like food(with all spices). Definitely it's Iyer's and Kenda's acting with all supporting roles, camera work, dialogues and music what ever requires. Good attempt team, wish all the success..."}, {"id": 32, "text": "A superb movie which should be watched with whole family. And the final twist, didnt had small hint from the beginning. You should watch the movie for twist. Loved this food and my stomach is full 😂 Thank you all cast and crew for this good movie. Nowadays Sandalwood bringing back its origin. Acting of all the characters was remarkable.Dont read reviews here and watch movie. Watch movie, then read the reviews. Most of the people watch worthless, storyless movies just for fan craze and write 1000lines positive here. And people support those reviews. Not actual movie reviews."}, {"id": 33, "text": "A new Concept,thoroughly enjoyed watching this movie"}, {"id": 34, "text": "One of the best movies I have watched. Story line, direction, camera work, location, music, everything is good. Very good movie. As soon as I saw Rakshit Shetty as one of the producers, I had high expectations. Movie met that expectation. Thanks to the entire team. Keep it up!!!"}, {"id": 35, "text": "I found the movie to be very tasteful. No double meaning dialogues, No unnecessary songs or hero build-ups. yes, I too, found the story little dragged at times, but climax makes it up for everything. Great job Mr. Director!"}, {"id": 36, "text": "Why always go with the regular love storyline. Need to see a different approach? Watch this once. Making different films are not easy..when someone tries if its worth appreciate it. Or just being quiet is the best thing to do. Spolers are alwayys there.. they don't try to see the effort and enjoy the movie the way it is. Pay NO heet to SPOILERS. Watch it yourself, as a movie and appreciate it!"}, {"id": 37, "text": "Truly loved the direction to showcase all the flavors of life - happiness, anger, sorrow, jealousy, hunger etc. And connect food to it at all phases. Beautiful camera work, acting by the cast. A good Kannada movie after a long time. Kudos to the director and the production."}, {"id": 38, "text": "Very good movie to watch , it is class apart. Has a gripping story line and intense at times. I did not get bored , wonderful to watch. Good movie to watch this deepavali!!"}, {"id": 39, "text": "Good movie like apthamitra.. The story is same but here it is accident instead of mental trauma.. She is like ghost.. And twists, all emotions are somewhat predictable ones.."}, {"id": 40, "text": "One most amazing movies ever captured in Kannada industry. Absolutely stunning setting milestones to make us nostalgic. It's unfortunate that after 90s is industry could not produce movie like this. For records: I have watched this movie immediately After watching the town  rest you got get straight"}, {"id": 41, "text": "To be frank, I was not much impressed when I watched it for the first time except for BGM(may be i failed to observe), but it definitely appeared to me as a good movie when compared to usual movies with stories of same old love/fight/mass-dialouge. Today I thought of showing this movie to my Mom, I thought I will be bored since I'm watching it for second time, but i was in for a surprise. I fell in love with the movie. Congrats to the Team, every department and every one has done an excellent job(with little scope for improvement) We need more movies like this in Kannada."}, {"id": 42, "text": "Screen play, direction and music are supeb. That climax is 🔥🔥🔥 ultimate."}, {"id": 43, "text": "Every character plays an important role and the twist in the climax was superb expecting many more from paramvah studios"}, {"id": 44, "text": "Wonderful story and spicy twist! All characters were amazing and very natural."}, {"id": 45, "text": "Total package of movie was just too good.. climax was really exciting... great effort from B.S team.. All the Best"}, {"id": 46, "text": "Quirky screenplay, creative cinematography, perfect music. Overall... a well crafted film. The actors have added on value by playing the character so passionately. Especially the Vedavalli character played by Arohi...makes it the right kind of casting."}, {"id": 47, "text": "One of the best movies in kannada and the climax is real shocker... Amazing work by the entire team.... Kudos and all best 👍👍👍"}, {"id": 48, "text": "Now a days kannada movies is more like glorifying rowdism or some old wine love story. I watched this movie with zero expectation and it totally blew my away. The production team has bought something fresh and totally different into kannada cinema. With absolutely local setup which everyone can relate themselves to, the movie can be enjoyed with the whole family. The movie is a must watch and is an inspiration to other makers to generate quality content that recreates a society and not like the ones where rowdism is a full priority."}, {"id": 49, "text": "Great acting from everyone in the movie, good message on parenting :) Good mix of comedy and drama. Loved the fish market scene and the scene where they show about moter's food."}, {"id": 50, "text": "An unpredictable climax takes away all the cons of a lengthy movie and changes the perspective of a viewer in a few minutes. A brilliant direction and cast in its own praise. Screenplay could have been better to first time Kannada movie viewers but nevertheless a complete package in its own way."}, {"id": 51, "text": "Such a heart reaching, what a directionz very well directed. Felt very happy to see such a beautiful movie. It's art work."}, {"id": 52, "text": "Another best movie by Rakshit shetty and group..Amazing acting by all the actors involved."}, {"id": 53, "text": "Movie is full of boring content untill you reach 75% watch time of movie , plot start with mediocre story line ,and boring untill you complete 75% movie watch time until you reach twist in the movie . Acting from kids and achuth are really good especially kudos to chitali for her acting , if you don't have any work to do on weekends this movie is time pass"}, {"id": 54, "text": "It is a feel-good movie from the Kannada Film Industry. If you have watched the trailer then You might have seen the abstract of the film but to see how they have effectively implemented you must watch the movie. Wonderful acting by everyone especially child artists. Any film freak would predict the climax twist because the director gave hints from the beginning of the film may be the director's motto was to make a feel-good movie not a suspense or mystery genre movie. If you are looking for a movie which can be watchable with family then definitely Bheemasena Nalamaharaja  is the best one."}, {"id": 55, "text": "Awesome movie aptly made with perfect ingredients. It is s directors movie with perfect screenplay supported by cast, background music and shining cinematography. Simple story which is close to common man and feels like it's happening around us and shot at lush greenery of malnad. Movie is a treat for every movie goers. Don't miss this."}, {"id": 56, "text": "Here comes, a best movie of the year. A great struggle of lives due to global pandemic aside, people lost their lives and opportunities. Everyone had to lead their lives with all great difficulties.This movie brings on screen all of the struggles that a person has to face once his life got a turn.Anger, Revenge, Sadness, and Love...A great emotional gift to watch. Hoping him, Bheemasena Nalamaharaja to cook on theatres!!"}, {"id": 57, "text": "Must watch movie . Good script with twists in d end . Great direction"}, {"id": 58, "text": "One of the best Kannada films of 2020(The climax was mind-blowing👌)"}, {"id": 59, "text": "Story, plot, screenplay, acting, everything is Brilliant. A must watch. 👏🏻👏🏻👏🏻👏🏻"}, {"id": 60, "text": "First impression of the movie is- Rakshit Shetty production, simple suni story and charan raj music and These combination worked very well(background music is awsm).So I started the movie it started well as usual movies do then after an hour I started getting bored I was about to stop the movie and I thought why Rakshit produced this movie man but I have to wait if he has produced den there must be something in it so I went on watching it and like multilayers each character was hidden which opened up slowly as we went to the climax and den boom!! wowww this movie has so many layers and showed us perspective, suspense and so much. The ending was just mind-blowing and stunning at the same time."}, {"id": 61, "text": "I liked the intelligence of Director portraying he revealed everything in the trailer and its a boom in the picture... Nice story, bit lengthy screenplay but didnt affect much Music is the real hero of the movie I felt weird about the characterization of Vedavalli as it mostly revolves around her, but as the play goes on it is justified why it was designed as that. Arohi Narayan - I am not sure if any actress might have done this great. Aravind, priyanka,Achyuth Kumar - Fantastic job Overall - must watch, emotional, family entertainer Pushkar Films &amp; Paramvah studios - keep up the good work team, your movies are setting examples in the industry"}, {"id": 62, "text": "Another different...type...of movie by rakshith shetty,pushkhar. And also.. karthik sargur, loki🔥."}, {"id": 63, "text": "Brilliantly made film... That could have been little crisp in the first half, having said that, it didn't bore anywhere. Music, Location and Camera Work have been far more than excellent. Switching between the extreme emotions by characters is slightly hard to digest, but as the film goes on Viewers gets adjusted to the wavelength. Dialogues simple and straight forward. Song lyrics with variety of genres are so catchy and will be remembered for long time..Twist in the climax is absolutely unpredictable and its the greatest part of the film. I was awestruck while watch first time. 2nd half has done the complete justice and worth watching.Every Artist has given life to their characters, including the lead and Supporting..Story narration by Karthik Saragur is at next level.. His hard work and sincere efforts are visible in every frame."}, {"id": 64, "text": "I have been following this movie for more than a year, not sure why it was delayed and not sure how they completed in lockdown and released it so quickly.. Was very happy when I learned that this movie is being released.Saw the teaser didn't connect with it, the trailer didn't help either..After all this, I decided to watch it only because it contains names like Heamanth Rao, Rakshit..Firstly, storey doesn't stand truthful to the Name... Big let down..It feels like an arcade puzzle where its Forcefully tried to fix, where pieces are not even from the same game....Main characters Lattesha, veda, lalli, Dr. Arohi, Fransis and Kenda, nothing actually develops.. you wont relate or like any character except the Achuth sir...Its a movie where always something is happening, each characters is running on its own and you are never comfortable...Having said that, last 15 mins makes you feel a bit different than what you felt for the last 2 hours. Only for that and music, 5/10 rating.So, we can watch this one time on OTT but I wouldn't want to pay for a ticket if it was released in the cinema."}, {"id": 65, "text": "The film's title is an attraction for promotion and not something that has it's roots or it's base in the story.The story is about trying to regain a woman's memory and nothing of sorts in connection to anything that is food as per the trailer. The trailer was horrible though and yet I watched the film keeping my faith in the Paramvah logo but in vain. The film tells a fake story throughout the film only to make it look like a suspense/ thriller at the end which totally washes away the little bit the story's holding throughout the film. The last 10 minutes were depressed and forced writing. The characters are written very poorly. The entire film had unnecessary number of supporting cast and extras. The dialogues are also blunt. The underwater scene is very poorly written. There was no character's struggle there. It was the most important moment in the character's life and yet so badly done.The acting is very bad by most of them barring Achuyt, Aravinnd, and the chubby child artist who plays the leading lady as a childhood version.The cinematography has some decent individual shots which make it's own track in the film and doesn't blend with the story at most times. The famed cinematographer Santhosh Sivan always has some pretty shots in his films and they are always beautiful to look at or to get immersed in it but many at times, they take you away from the story of the film. Everything that happens, everything that is made, everything that is worked for/at including the music must be to make the story move forward and nothing else. If it doesn't, then no matter how divine that shot, sound, music, act is, it HAS to be edited out.What works in favor of a film that was expected from the trailer is the music. Chandan's music is soothing and the lyrics are also beautiful. Though Chandan's music does work in favor of the film, it is not helping him as a musician because his music seems repetitive. The song Kanna Muchche straightaway took me to 'Ee sanjege'. The resemblance in the melody is uncanny.The film has a look alike base line structure in it's core idea to that of the Hindi film 'Kahaani' where the entire film we hear a narration (and actions in between) only to be deceived at the end. (A past moment) When stroked with this question of dishonesty, the director Sujoy had buttered it up in a way to make the audience confused.This film running for 140 minutes is just an elongated 'part visually pleasing' lengthy short film of around 60 minutes. I was disappointed not just with the trailer but with the film too. An off beat/ off track Kannada film needn't always be delightful. Unfortunately, most are blind to that fact."}, {"id": 66, "text": "I was very eager to watch the movie as early as possible so joined a group of our relatives and started watching from 12 00 midnight on 29th though I was feeling sleepy and tiredDue to fatigue and drowsiness I couldn't watch with the required concentration as a result of which I felt left out of the show and started to feel bored.But there came a very surprising, an unexpected twist in the story in the last part of the film that made me very alert and interested in it.So I watched it again two more times and now I appreciate the wisdom , passion , dedication and labour behind this work.The way the story is conceptualized, and narrated is very interesting. The movie is a blend of dreams, stories, dramas and reality which is a unique experiment.Coming to the work of the crew cinematography, music, art costumes editing etc are good. The performance of all major and minor characters is impressive.I was impressed and touched by the way the songs of our own Ankanayaka master and famous Kannada poet Sri Parameshwara bhatta are used in the film.#Thanner# #meedre# song of Ankanaikaru depicts the simple philosophy which majority of the simple and down to earth people of our country believe in where as the the song #Odalemba gudiyolage# is about the adoration and trust which a wife has on her dependable husband with divine qualities which every wife wishes to see in her husband .The movie showes how an intense love story can be told without allowing sensuality or lust to creep in. This makes it a very special one for me.This movie is certainly not for those who watch it just for some entertainment or to pass some time. It has enough in it to capture the attention and win the hearts of those who respect life and art based on and near to life."}], "reviews_amount": 67}