{"name": "Centigrade", "titleId": "tt08945942", "reviews": [{"id": 0, "text": "The whole idea that you could get snowed in in your car and not even try to break a window to dig you free is...ridiculous. Consider that they could hear vehicles passing by and they could get a cellphone connection (which appropriately got cut due to a dead battery). What sense does this make?Add to this the insipid dialogue, lack of any interesting plot revelation, and that the woman even gives birth in the car. They spend 15+ days in the car eating snow. Were they waiting for the movie to end? I was. In the meantime I just sent emails and read the news while watching inattentively for the movie in the background."}, {"id": 1, "text": "This movie put 3 people watching to sleep. The beginning of the film kinda gave us hope that it may be a good movie but boredom soon set in and never left. It's two people stuck in a car under snow and all they do is talk about how to get out. Nothing happens. Nothing scary. Nothing suspenseful and definitely nothing interesting. Very long boring movie. Very low budget."}, {"id": 2, "text": "This movie was an absolute piece of crap. This is an American couple traveling through Norway, in the winter, for a book tour. The wife is 8 months pregnant. Can someone please tell me how she was allowed to fly on a plane? The couple pulls over during a snowstorm to sleep. Why on earth would you pull over in a snowstorm? In one of the countries known for hellacious winters? The couple constantly fight. It was the longest, most excruciating 90 minutes I've spent watching a movie in a long time. DO NOT WASTE YOUR TIME!!!"}, {"id": 3, "text": "Movie isn't too bad. But the situations and decisions is plain idiotic. -That's my review.Here's my questions:Can a woman fly that close to her due date?The road looked like it's been plowed multiple times before the scene we seen. So why didn't they hear the plow the other times? Besides having already plowed that much snow, that car would be completely covered long before the measly amount that the plow did on his last pass.After hearing the plow go by. Wouldn't they know what direction it went past from the sound? Wouldn't it be wise to dig that way, get to the road and be seen?The snow is much brighter near the top of the window. Too light to be buried very deep. Why not break out the sun roof? Even holding a candle up to it may have melted enough to see sky.Sitting in a car with nothing to do. Cell phone battery really low. Wouldn't the couple have decided exactly what to say if they were able to get a call out?She got out of the drivers side. And started to walk the way they already came from. So how did she reach the Hotel they were headed to? Common guys. After you put a movie together, watch it a few times, make sure it makes sense! Like the car slid off the side of the mountain side. That would of got rid of the plow truck issues."}, {"id": 4, "text": "Stupidest decisions I've ever seen. Wasn't worth telling their story. Survival of the fittest."}, {"id": 5, "text": "Just a poor story that needs something to make it interesting. All talk and zero action is going to put people to sleep fast, unless that's your intent."}, {"id": 6, "text": "We fast-forwarded through most of this disappointing film.Gave it the lowest possible score (1 star) for existing... and a bonus star for the baby who portrayed a baby quite well... and didn't ask to be in the movie."}, {"id": 7, "text": "Great plot. Terrible writing. Bad acting. Godawful editing. Those surviving ideas showed in three movie makes literally zero sense. You can't eat snow for surviving while stuck at a cold place. The result would be, your internal organs will freeze soon and you will die. And don't light a candle at your car for God sake. You will be out of oxygen and suffocate to death."}, {"id": 8, "text": "The acting is good, but it's too flat..like nothing thrilling or suspense happen..they just talking and arguing..plus poor that guy (I think I've seen him in tv show, he's pretty good actor)..I watched the entire things waiting for something crazy to happen..I believes this could be good if they are not based on true events at all."}, {"id": 9, "text": "This movie was so bad I sold my tv. And I ate my shoe."}, {"id": 10, "text": "That's what this is. Would've liked to see them before this, how it happened, etc. Starting it at the climax of the movie left it nowhere to go but down. I'm giving it three stars for ok acting, for those parts I actually watched and wasn't so bored I got distracted by my phone. Also, we get it, the baby is upset but I don't watch movies to listen to a baby cry in every single scene with said baby. Rough story though!"}, {"id": 11, "text": "Showing that man have no interest to getting out from the car and give up even though he have responsibilities towards his family and in the end woman also act so irresponsible to carrying a baby. But of course this is all because story is so Lame."}, {"id": 12, "text": "There's literally 6 inches of snow in the car and plows drive by clearing the road but they won't break a window to get out. They could literally walk down the road and get rescued by a passing car within an hour but they chose to sit inside the vehicle for weeks. Nature got it right trying to kill off these two."}, {"id": 13, "text": "Super annoying movie with a woman wining. If I was the man of the story I would have rather killed myself than spending one more minute with that woman."}, {"id": 14, "text": "Honestly I fell for the based on true events at the start and thought that was about the actual story in the movie so I thought it would be interesting but from the first scene we were getting tense with the inaccuracies. First we have lived in the Arctic circle in Sweden so we know about thick snow! You can see so much light at the top of the windows that they could have easily broken through. If they really were in deep, unmovable snow, the 2 of them and lighting candles would have made them run out of enough oxygen for them to breathe properly in 24 days. In the depth of winter (esp as a tourist) you can only stick to main roads and they are plowed daily (even where we lived with 3 houses for 30mins) so they would have heard that plow everyday and been truly buried within a few days. They even see car lights really clearly through the snow when 1 drives past! Seriously they could have easily got out as the snow couldn't have been a few cm deep due to the light penetrating. The amount of candles they have could have helped melt it since they started to do that DAYS later anyway. Matt also uses the smallest pick to try and break the ice when he said at the start of the movie they had a tool kit for safety (its standard in these Countries) so he could have used something bigger or used the car headrest bars, he is also shown always picking at the ice at bottom of the window, Seriously!? You'd obviously do it at the top to dig yourself out. When she had the baby everyone knows (and clearly she did too as she does it in the end) the placenta is full of nutrients and people eat it anyway let alone when starving and trapped so basically Matt would rather die than eat the placenta? OK. She finally gets through to her dad and she doesn't even know where they are and panic cries. In situations like this adrenaline takes over and you would be clear and definitely have learnt your position! Honestly I could go on on and was so happy this wasn't a true story as dam i was starting to feel they deserved it haha. The acting wasn't bad but dam what awful writing how could they not see all these OBVIOUS mistakes! Its embarrassing"}, {"id": 15, "text": "As if being trapped in a car isn't horrifying enough, making a reference to the metric system is just terrifying. So terrifying in fact that the makers decided to dial it down a bit and call it Centigrade in a hope that most US viewers would not pick up on the fact that Centigrade is the old name for Celsius. As for the story, honestly it was a bit dull, although I'm not sure how exciting you can make a movie based upon two people sat in a car refrigerating at -22°F.(that's 243°K). Although saying that, Open Water did manage to pull off quite well a similar style movie in sense that the majority of it is just a single scene with two people yabbering to each other. So I guess this movie just needed more sharks."}, {"id": 16, "text": "😑 wee dont do that hère 🤝 bad bad bad soooo bad why why i lost my time"}, {"id": 17, "text": "I will not even bother to explain you how annoying this cinematic trash opera is."}, {"id": 18, "text": "They sleep through an avalanche! Yep you read it right. The film starts of with the woman waking up and then it goes down hill from there. She winges and moans, He winges and moans. Then its 11 days later and they are still trapped in their car. Your wish by the one hour mark the avalanche had killed them as it would have been more entertaining. Why didn't he smash the window and dig his way out at the beginning?They weren't buried very deep ffs. Really disappointed as had the bones of a good film but unfortunately no meat was added. 3 stars and thats only because I enjoyed the annoying actors suffering and the wife stabbing her husband with the head rest."}, {"id": 19, "text": "I don't understand the bad reviews. It's a well made survival movie, great acting, great production, psychological and realism at it's best (I read the movie was shot in the freezing temperatures of an ice-cream freezer). For people who wanted more actions and asks why the Characters didn't do this and that , I invite them to stay 15 mn outside in freezing temperatures. I wouldn't have done it differently and the producers kept it real all to the end. If you liked Open water, All is lost ... , you will like this one"}, {"id": 20, "text": "Sorry, but this is kind of nonsense. You can also come up with a movie where people could not leave the toilet. With doors and windows."}, {"id": 21, "text": "Brendan Walsh, Hey man, don't do that again please Thank you"}, {"id": 22, "text": "That was an insanely terrible and stupid movie. A couple and their crying baby trapped in a car. That's all this movie consists of. The husband was a wimp. He could of dug himself out and went for help. Instead he sits around waiting for help to come along. Which never happens. Resulting to his death. DO NOT WATCH THIS MOVIE. 2 Stars 2 thumbs down 👎👎"}, {"id": 23, "text": "No spoiler just bad bye an this review is too short so it needs more words"}, {"id": 24, "text": "You could only do so much with a storyline with two people trapped in a car but the acting was good and as someone else commented the actors did their job. You could actually see they were acting in cold conditions ( a plus...there was actually fogging in car, the foggy breath in air with them talking and the baby being born etc. ). The story was missing that extra spark to keep you hanging on for their rescue. The desperation was there but kept fizzing out when it could have been more embellished upon when those scenes appeared. One thing that kept nagging at me since they were in that car so many days...I couldn't understand why they didn't use the headrest to keep chipping away at the top of the snow from the car window after the wife broke it to at least try to stick a piece of clothing or something out as a sign someone was there. A few years ago that is what another couple did out west and they were seen because of that. Anyway I gave the film a 6 for the acting and kudos to the realistic environmental setting."}, {"id": 25, "text": "This movie was so frustrating. Never even attempted to get out. You can see daylight through the damn window and I'm pretty sure I saw the road. What a joke."}, {"id": 26, "text": "..... not even worth a 1 star. If it is based on true events, well I'm sorry.... the original people should have known better .... enough said.This shouldn't even make it to the £1/$1 shop"}, {"id": 27, "text": "I sat and watched this film believing as the beginning of the film states that this is a true story... Firstly I can't believe that anyone would sit in a car in a snow drift For a MONTH, and not attempt to dig they're way out.. And to then have to give birth?? If you hadn't eaten for a month you wouldn't produce enough milk to feed the newborn in the first place.. and then when she finally does dig her way out she has the energy to walk to the hotel she was meant to staying at!!!!! This Fillmore was not at all thought out properly and then to say it's a true story and at the end to say that she carried on writing books in memory of her husband, I have looked through so many pages to find anything about this said author, or to find anything about this story, I thought there is no way this can be a true story and I was right!! The characters in the film are a husband and wife, the wife is an author who was on her way to a book signing, didn't anyone realise that they were missing this whole time, especially as she made a hysterical phone call to her father to say they were buried surely a rescue team would have been sent out?? Basically don't be sucked into the lies this is a mix of true story's and then embellished to make it seem even more interesting... I gave this a three for the actors but a very weak storyline. Don't waste your time."}, {"id": 28, "text": "First of all if a human body was frozen it wouldn't be bendable"}, {"id": 29, "text": "This film is really bad and really boring.Was it necessary to have the annoying baby screaming for 60/90 minutes of the movie?No background on characters, no ending really."}, {"id": 30, "text": "Anyone else hoped they'd snuff it in the car? Just for being so stupid? Let's light a candle? Yeah first thing to do when stuck in an enclosed space where air should be at a premium. Idiots. And using the towels as a toilet and no mention of the surely inevitable stench? What's the baby eating? Nappies? Placenta,? Avoid. Had high hopes for this but it's pretty dire"}, {"id": 31, "text": "All human life and more, inside a snow-bound car capsule. Slow start to what was a satisfying knife-edge conclusion, against the odds. Laudable premier movie from Director."}, {"id": 32, "text": "You would have to be stuck at least 10-20ft of snow in order to be stuck and you would see almost no light if this were the case. Boring, the wife is annoying AF. Thumbs down."}, {"id": 33, "text": "An insight to what it would be like to be trapped in a car with a soy boy during a snow storm. At one point a character asks what happens when the food runs out? I thought, then you both die and this terrible movie can be done with. Boring plot, boring characters, there's nothing good about this movie."}, {"id": 34, "text": "The movie is kinda bored . I just got time for only to skip but some part were so intresting"}, {"id": 35, "text": "Poor story, very hard to believe these people stuck in car next to the road and for long time they did nothing."}, {"id": 36, "text": "I think there was literally an hour of screaming baby in this movie. Coupled with dumb people making dumb decisions from start to finish, I think 4.5 is way too high of a score for this trash film..."}, {"id": 37, "text": "They also suck at spelling believe in the outtake. Horrible year 2020 was better than movie."}, {"id": 38, "text": "These people are idiots. She's annoying as hell and was ready to give up 10 seconds into realizing their predicament. They never tried to exit through the sunroof...they had candles but never tried to warm up the windows enough to be able to dig themselves out even a bit, they didn't try to use the rear defroster (car's battery wasn't dead, it just wouldn't turn over). Breaking the glass (finally!) with the headrest prongs will NOT lead to freezing to death...snow is an insulator which also means that the car's inside wouldn't be as cold as they're implying. A great example of everything NOT to do in this predicament."}, {"id": 39, "text": "You get to listen to her whine or the baby crying the entire time."}, {"id": 40, "text": "This movie is a guide to what kind of a human being you're not supposed to be. And yes, I do know it's a real story and that this man died. But he died because of his actions and lack of logic and will to survive. The whole situation is ridiculous. If they had a little respect for this man, they wouldn't make this movie which shows everyone what a waste of air and space he was. I'm not sorry to say that because it's the naked truth. If you can, you should avoid this movie and save yourself 85 minutes."}, {"id": 41, "text": "Really lame. the time line of them being stuck didn't show at all. how did they have so many candles? they weren't buried that much and could have gotten out a long time before they did. the road was way too perfect for no cars to go down often. and their was a full tit shown. just not good"}, {"id": 42, "text": "At least it is a true story that simulates the incident in a real way"}, {"id": 43, "text": "This film was so stupid it actually gave me Autism."}, {"id": 44, "text": "OK - like the characters, you spend most of the movie feeling claustrophobic, and like the characters, you start to get annoyed. But you get drawn in to the movie as the survival days go by, until you escape, like the...By the end I really enjoyed it, and realise I had been transported by the movie to a very cold place!"}, {"id": 45, "text": "Yes, some terrible decisions were made, but the story is haunting. People make bad decisions in extreme situations. Watched it with a group and we all enjoyed it. Found ourselves yelling at the screen in irritation at the characters behavior. Acting excellent."}, {"id": 46, "text": "Slow and the couple fights basically the whole time and they are completely stupid and unrealistic"}, {"id": 47, "text": "It's bad enough that this movie is extremely boring but then she has a baby and you have to listen to a baby crying for what seems hours but is really only 15-20 minutes. Whoever wrote, directed, this movie should pick a different profession. He absolutely sucks at making movies"}, {"id": 48, "text": "I really enjoy non fiction movies. Especially survival movies. You can learn from their experience. I actually cried in the middle of this movie. I will watch again"}, {"id": 49, "text": "The films drags out, is just uninteresting.Survival ideas are stupid, after breaking the windows they could have tried to dig out using the headrest which was deployed as a weapon (also weird)."}, {"id": 50, "text": "Great movie! Human resilience at its best! Actors were fantastic and the setting was amazing. Wanted it to end to see if they could survive too tense for me at times! Look forward to the next one from this director"}, {"id": 51, "text": "As true stories go you have to question the survival instincts some folk. I'd certainly have tried harder to get out of an overnight blizzard (especially if my wife was nagging and blaming me, I can tell you!)The arguments were well scripted and resonated well with me. I held on til the bitter end of the movie but it was a hard slog on a Saturday night."}, {"id": 52, "text": "It's entirely plausible that this largely happened in real life as it did in the film, but if it did, why make a film about it? It's over 2 hours of nothing. Nothing escalates, nothing interesting happens until maybe the last 15-20 minutes. It just two people sitting in a car being cold and depressing for 2 hours of screen run time. Avoiding spoilers, but the amount of calenders time they're willing to sit there is unrealistic. Even if it wasn't it's just boring to watch. I say that as someone who was interested in seeing this. I was ready for a tense slow burn. No tention no burn. It just kinda ends at a nonspecific point. Man, I'd pay money to get my two hours back."}, {"id": 53, "text": "A very convenient way to learn what NOT to do if you're stuck in a car, under 1ft of snow. Basically don't do anything the two twits in this movie do. I would've taken my chances outside the car after being stuck in there for 1 day with this woman. I am glad to find out this isn't a true story as I would despair for humanity if people this dumb actually existed."}, {"id": 54, "text": "Stupid decisions I would have dug my way outta that mess making sure my wife and child survived after a few days lol to think they sat there for almost a month was INSANE!!!!"}, {"id": 55, "text": "Good as a soporific to summon sleep but not much else. With films like this made inside an enclosed space you need a really good story with plenty of elements to fill the dead space but sadly this should have been a 30 min short not an entire film."}, {"id": 56, "text": "Got five minutes in and turned it off. These characters are so unlikeable. They immediately spiral into conflict at the first sign of trouble and bicker and fight the whole time. If I was stuck in the vehicle with either one of them, I'd be desperately trying to start the car and let the carbon monoxide take me. Seriously, though, folks. Don't start your car when you're snowed in lol."}, {"id": 57, "text": "So when she talks to the father Matt yells we are fifteen miles east of our hotel. Who the hell would stop driving after fifteen miles? Is he a toddler that needs his nap? Break a damn window! I've never seen two stupider people. I'll just wait here until hopefully someone rescues me instead of trying to help myself and my pregnant wife."}, {"id": 58, "text": "I don't understand the bad reviews. Good story that deals with survival and love. Great honest acting. Beautiful camera movements and angles . I really enjoyed every minute of it. It may not be for everyone, but it's worth watching and the 90 minutes I spent waching it wasn't a waste."}, {"id": 59, "text": "I was screaming at the tv. They show absolutely no desire to escape even when she gives birth to a newborn baby and the husband dies! Feel like giving her a shake. What are you waiting for?!The baby constant crying is not enjoyable to my ears also.Quite disappointed tbh, would not watch again."}, {"id": 60, "text": "Naomi (Genesis Rodriguez ) is an American author on tour in Norway. During an ice storm her husband pulls off the road. They get ice and snowed inside...for a couple of weeks. They go back and forth, light a candle (?) seriously? Eventually they use the head rest to break the glass, which is what it is for. Oh yeah, plot spoiler. She is very pregnant.About as boring as two people trapped in a car. No one is injured and no Cujo outside.Guide: F-word. No sex or nudity."}, {"id": 61, "text": "Brandon Walsh? Why didn't you dig out right away, instead of that? Don't do that no more. Bleak and sadly stupid."}, {"id": 62, "text": "Story is flat but the it's true event. How dramatic it could possibility be when trapped in a car? Under this circumstances, at least I stay focus and keep thinking what's the possible way out ? Should attempt the first day will change the whole thing? Given the snow not thick and would that be wrong on the theory? These parts already worth to rate a 5."}, {"id": 63, "text": "Ok, my wife was hoping that it was something like human centipede except that maybe someone crossed a centipede and a tardigrade (she loves tardigrades!). We watched it anyway, it was ok, slow, nothing really exciting happens, but in the end we felt that we didn't waste our time watching it. Wouldn't watch it again unless they add killer wolves to the mix."}, {"id": 64, "text": "Brendan Walsh should never direct again. I'm sure Brendan Walsh and Daley Nixon were drunk when they put this storyline together. This unbelievable work of trash that the State of New York sponsored should never have been released. Genesis Rodriguez and Vincent Piazza's acting careers have forever been affected by Brendan Walsh's insensitivity to put out a quality screenplay. I won't ruin the movie for those that want to watch it, but I will say the storyline is not remotely plausible... even though they say it was based on true stories."}, {"id": 65, "text": "This had the potential to be something special but instead I felt a bit flat at the end. If this is based on a true story then the ending is given that the protagonist survives.It brings back memories of the film Buried &amp; it captures the claustrophobic element of those characters' predicament &amp; it is grim viewing. It is a film that depresses the viewer at the end."}, {"id": 66, "text": "I love movies like these. Non fiction nightmare which really happened. The day started off like a normal day. Then.........I actually cried during this emotional torment movie. It's a nail biter"}, {"id": 67, "text": "This is not an adventure nor an action movie... it's simply an account of a very tragic set of circumstances. The low ratings are a shame because most ask 'why?' when that is not the purpose of the movie. It's based on a true story of a couple who pulled over in an ice-rain storm to wait it out because they couldn't see. Yes, you can fly while pregnant, and certainly book tours aren't scheduled according to weather. It's Norway!... of course the weather's not going to mirror Florida.I thought it was very well acted and showcased sacrifice and determination for love of child; both father and mother. Movies like this always resonate with me in the sense that it could have been a stage play. Almost like Phone Booth.Don't go into it expecting anything more than a peek (almost voyeuristic) into the lives of a couple that has to endure a severe hardship under unfortunate circumstances. The actors did a more than fine job. I would have normally given this effort a 7/8 but I'm up-rating it to a 9 because of all the negative/ignorant reviews."}, {"id": 68, "text": "From the very first few minutes into the film I immediately found myself not liking this couple one bit at all! For a start they were in their predicament because of neglecting all the safety points; something which is an idiotic human trait in most people. I found myself getting more and more annoyed with this stupid couple as the film progressed and, it took an awful lot of my willpower to stay the course with this tediously boring tale. At 00hr:25min:39secs I was totally fed up of the lady/wife and her bickering, whining, whinging etc and, at 29 minutes in I had had it with the husbands caveman selfish lack of sympathy.It did not improve one iota as it dragged on and they continuously displayed the usual humanistic inability to converse truthfully (a trait that is much of the reasons for humanity's lack of peace, tolerance, understanding and compassion). The trouble that is caused by people not talking truthfully to each other is why the planet is in such a terrible state. There is one piece in the film I am sure, like me, you will call her the dumbest, selfish idiot blah, blah, blah etc. etc. (if you watch it that is and, if you do you will - I am certain - highly regret ever doing so!).Like the films based on the same kind of tragic events it is not something you would ever wish to experience. However! I could find no sympathy for these 2 individuals and a story that would have been far better as a 20 or 30 minute short story.As always! It is your choice to view or not to view but I will give some advice I do not normally offer. Don't waste any more precious time in your life by watching this complete boring dross. Do some laundry or take up a hobby like watching paint dry! The only reason it has even 1 star from me is because you have to give a star rating (why are there no minus 1-10 ratings to be had?)Gone till next time, goodbye peeps!"}, {"id": 69, "text": "This movie isn't for the marvel comics mentalities that seem displeased with what can only be described as an awesome movie.I was turned on to watching this movie because kelsey Grammer tweeted ,  I highly recommended this film, ...and kelsey Grammer rarely gives accolades to anything. After Kelsey Grammer's recommendation and several other like minded viewers chatting up how great the movie was...I watched the movie, thinking after I knew the predicatable outcome /ending from watching the trailer. To my surprise and delight the outcome/ending was not even close to my prediction.This movie embodies the human experience, in ultra suspense...that we can all in current pandemic share a commonality, understanding.The movie isn't an X-Man Flick, for those with room tempature IQs, it checks all the boxes , Suspensely Plot, Characters that expand and actors that hit it out of the park.A Must see for those who like to think during suspense and those who have the capacity to appreciate beyond comic book level content ."}, {"id": 70, "text": "Insipid and vapid. The writing doesn't exist at all. There is no preamble or first act. We are just forced to watch two morons trapped in a car.Here's the thing, at no point did the two characters even turn the car on. Yet they somehow have candles and a lighter.Why were they even staying the night on the side of the road? Why... The guy knows he is 30 miles away from their hotel. What?They show the bottle of water is frozen to slush. Yet the next scene they show it is water and is spilled accidently. This flip flop of events happen so many times for false tension.This is the most plot hole ridden item I've ever watched, nothing makes sense and the characters are completely braindead.2/10 appauling script, this was somehow worse than 'Outback'."}, {"id": 71, "text": "Centigrade is not quite as horrible as people say, but in a small film with one location there is not much room for the viewer to eventually not get absolutely bored out of the film.They could've saved the film by writing the characters you would want to root for, so you could really care and want them to survive.Also, why not write them out of the car and try for them to survive in the snowy wilderness for a change? I'm ok with people taking bad decisions, but why not make the viewer believe these are smart, but then put the characters in a worse situation due to hazardous environment? Introduce a couple of unlucky coincidences?While the ending provides for some satisfaction the film never felt like they were in great danger anyway. And, excuse me, but I don't buy an infant surviving a couple of days in such environment."}], "reviews_amount": 72}