{"name": "Greatland", "titleId": "tt08215480", "reviews": [{"id": 0, "text": "This movie offers very little. I personally forced myself to watch the entire thing. Unfortunately it lead nowhere. The poor acting is only surpassed by the horrible script. The best comparison I can give would be Zardoz. A movie that seem to be lost in it own world. Not sure if you should be a comedy or a drama. Infact, i did not laugh, or cry, just dumbfounded by the stupidity of it all. . This is no gem, and should net see the light of day."}, {"id": 1, "text": "Greatland is a satirical look at modern society. There is some inventive art direction and great young performers. If you enjoy films like Fahrenheit 451 or Brazil, you'll like Greatland."}, {"id": 2, "text": "It's like Romeo and Juliette in a CircusThe two young leads give solid performances and are just stunning to look at. They bring peace and normalcy and are more mature than those old dudes in charge of this crazy place. The child speaks the truth it feels at times like an updated version of 1984 mixed with Idiocracy. A powerful and innovative score."}, {"id": 3, "text": "Reminiscent of a Terry Gilliam world mixed with Idiocracy, this inventive indie creatively explores many of today's most pressing issues and questions within the context of a richly envisioned and satirical world. Would recommend!"}, {"id": 4, "text": "Surreal, cosmic comical coming of age story for the moment. There are so many wild and interesting ideas and visual motifs in this film, each scene will take you by surprise. There is comedy, love and heartbreak, all set against a colorful world, but which resonates with our actual one. Never a dull moment."}, {"id": 5, "text": "Really interesting film especially if you're looking for something different than the hollywood norm. The filmmakers take some chances and that's something I always appreciate. Strap in for a feast of color and style."}, {"id": 6, "text": "This movie is so fun to watch. Interesting story and amazing cast."}, {"id": 7, "text": "Ugly Duck is not Ugly! She's so pretty so expressive in her performance. She and Arman Darbo are such a cute couple! Girl + Boy + danger to overcome + heroic journey to accomplish = good movie = happy viewer"}, {"id": 8, "text": "For you that love to run photoshop or edit on adobeview and love filtering the world around you. the serious viewer might find similarities to ongoing pandemic and upcoming election. its not for the grumpy old man"}, {"id": 9, "text": "What the world would be like if humanity cedes any authority to the morally deranged minority among us.Through shouting the loudest and calling everyone who doesn't agree with their agenda a bigot, they hope to cow those not mentally ill among us to remain silent and just accept their deviant behaviour."}, {"id": 10, "text": "What happens when you suppress boyhood and natural instincts... rebellion and chaos of epic proportions. Greatland gives a lot to reflect upon but it's also plain entertaining. Don't be taken aback by the visual aggression of Act 1. It shows how this world of fake entertainment is manipulating us with a constant wow narrative pushed down our throats. The Act 2 and 3 draw the curtains to show you backstage where the elite is pulling the strings. It's a movie for smart people and Ulysses is an icon for a generational revolt."}, {"id": 11, "text": "Psychedelic movies like Greatland are few and far between. Cats with Taytay may be coming close. It takes creative courage to do something like this on a shoe string. Technically Greatland lacks the means necessary to carry out such ambitious world building. Story wise, it's much more layered and complex than Cats. Although it has only a tiny fraction of its budget, Greatland has a great music and stunning imagery. Acting is also good with few exceptions. A lot of really colorful larger than life characters. I love it, I'm buying it and hosting a watching party with my friends shrooms."}, {"id": 12, "text": "I had high hopes for this movie. I had heard it was deep and thought provoking, something that would perhaps enlighten me. I had heard it was true to our modern world and gave answers to questions we all have. I was severely disappointed. This movie is awful. The plot is confusing and seems to change every other scene. While some shots are filmed beautifully, others look to filmed on an iPod touch. The costumes were cool, but couldn't add anything to the plot BECAUSE THERE WAS NO PLOT. The entire movie was satire about extreme leftist ideals, but I couldn't tell what the characters would have preferred. They had no drive to do anything productive. The acting was pretty awful, although at times they did ok. The characters had confusing and weird relationships with eachother and I was constantly trying to figure out what they all wanted. I came in with high hopes and was not satisfied. However, I would suggest this movie. It was like an acid trip that leaves you scratching your head, not in an intellectual way, but a what the hell did I just witness way. Good luck and enjoy Greatland."}, {"id": 13, "text": "My heart beats for Greatland. If Trump gets to stay, I'm moving to Greatland."}, {"id": 14, "text": "This movie is a wild ride! The set designs and special effects so colorful. Ugly Duck, Chloe Ray Warmoth was spectacular! I can't wait to see more from this rising star."}, {"id": 15, "text": "This movie is bonkers! Like Pee-wee's Playhouse meets Terry Gilliam's Brazil. If it were a bit more deadpan and raunchier, it would be right at home in the Adult Swim catalogue. Though it seems influenced by various dystopian/ sci fi movies, this has a palette and style of its own that I have never quite seen before. Its low budget is utilized very effectively in its ambitious world-building and mix of CGI and practical effects. If you're in the mood for something wild and flashy, and a critique of woke culture, then this is for you."}, {"id": 16, "text": "I have never experienced a film quite like Greatland. It is unique, creative, and has a striking visual style. Everyone who worked on the visual side of this film need some applause -- from the production designer, cinematographer, costume designers, digital fx team, hair and makeup, and beyond. I really like discovering these unique and creative indie films. While not everyone may appreciate these bold choices, I think there's a lot of people, like me, who really do. Getting to watch an Eric Roberts performance is always a nice little bonus in an indie film too!"}, {"id": 17, "text": "A true indie film with a refreshing science fiction twist that really hits home. Seems like its pulled from today's headlines. Worth the watch with great performances, visual effects and FUN!"}, {"id": 18, "text": "Okay, I've never done acid, but it felt like I was in a super duper colorful trip. Kudos to the writer/director for creating such a wonderful world full of symbolism (reminded me of Jodorowsky). Good acting (also the supporting characters), great sound and charmingly weird story. A world where genders, roles, goals are questioned. If you like clever weird, this is the movie."}, {"id": 19, "text": "In this complex original screenplay where Mother is Big Brother, a father and son re-unite. Will love conquer all in this crazed and twisted dystopian world. Beautifully shot and produced. In the end, Greatland delivers an emotional rollercoaster between reality and perception where love and betrayal coexist."}, {"id": 20, "text": "Insanely creative social and cultural commentary - can't really be explained, but you've got to see it, and see it through for an ending that'll rock your perceptions!I've never seen anything quite like it!"}, {"id": 21, "text": "Every frame of this dystopian, sci-fi drama is lush, gorgeous, and extremely well thought out. The details of the production design are a journey of their own, and a marvel on a lower budget indie. Compelling, entertaining, and highly relevant. If you enjoy a fantastical dystopian story, this one will not fail to surprise and entertain."}, {"id": 22, "text": "Greatland is pretty much unlike any film I've ever seen before - it's candy-colored visuals and spectacular costumes and sets may have you believe you're watching the next big budget Netflix show, until you realize it's an independent film in the truest sense - with totally bonkers world-building that subtly reveal commentary on everything from pandemics and viruses to fake news and social media addiction. I was at times bewildered, nervous, confused but always intrigued - Greatland has to be seen to be believed."}, {"id": 23, "text": "Hard to describe the movie, it's so crazy, yet sweet and loving. great acting, and just wild."}, {"id": 24, "text": "Nice to see something different out there. Well acted - Eric Roberts was fun and Nick Moran puts in a strong performance. I enjoyed watching this film."}, {"id": 25, "text": "Finally, a film that is relevant. Not a boring miserabilist flick about the working class in rainy Liverpool or the grey suburbs of Belgium (can't take them anymore!) But a colorful fast pace punch in the face of a movie! The Woke culture manipulated by a cynical and immoral oligarchy. Wow! That's real subversion, take that Michael Moore! Take that Hollywood! Want to stay relevant? Make relevant movies like this one!"}, {"id": 26, "text": "A crazy film, but accurate to some parts of our own world. The dystopian utopia controlled by an external being - I nearly wished there would be more movie to explore it. Arman and Chloe were great in their roles. I would describe it as a combination of The Gift and Brave New World, with a satisfying feeling of hope at the end."}, {"id": 27, "text": "I saw this young actor a couple of years ago in a school shooting movie, it was refreshing to see a 14 year old and played a 14 year old. Usually actors playing teenagers are closer to 30! Arman Darbo is great as Ulysses he delivers so many quirky moments. It's not an easy role to play, I wasn't sold on few moments but overall he nailed the character. One to follow for sure. Greatland is one weird movie. He has to wear swim goggles as sun glasses and gets a rabbit as a son for God's sake! Can't wait to see what he does next."}, {"id": 28, "text": "Psychedelic mindless Greatland. I liked it there. You need to watch it in a changed mind so that the crazy world on the screen is in harmony with your inner world."}, {"id": 29, "text": "Visually this film is loads of fun, and this film's concept could have been interesting. However it fails to explain or bring any measurable resolution to what it is trying to say. The movie feels artsy and teeters on the verge of self-awareness, but never really makes it over that hill, instead ending up confusing and unsatisfying.The actors play their parts admirably, and the set designs and props, while showing their budget, are well selected and represented. It is a shame that the film they are contributing to doesn't give the crew and cast a chance to shine."}, {"id": 30, "text": "From what people say, there is a political message in this film that is supposed to be relevant to this day and age. Truth is this film is just some nonsense that was written during the car ride home from a San Francisco rave. The only genius you can find in this film is the fact that you can turn it off. I recommend you never even turn it on... You're welcome."}, {"id": 31, "text": "True to what is happening today. I found the film to be one that challenges what is modern social norms and political strife within society. A planned utopia pushes further and further into chaos as truth and reality is blurred. To grasp all of the nuance of this film i would need to watch it multiple times. I feel like they really hit the nail on the head with this film with a feeling of hope at the end.If your looking for a film that peals at the scab of society and our political classes. This is the film for you. definitely challenges the way you think. Well done."}, {"id": 32, "text": "Greatland is a mind melting phantasmagoric film set in a Dystopian future where Ulysses goes on an epic Journey to save Ugly Duck his childhood sweetheart after she's taken. This is only the tip of the iceberg in terms of the story but with so many complex ideas at play they simply need to be seen to be believed. The films production design, costuming and look are off the charts, you can absolutely taste the rainbow here and while the world is a type of sci fi dystopia, the film is just as much a commentary on our society and where we might be headed. I watch films to be challenged and taken out of my comfort zone and this film will certainly do that in a way that only the best films can. This is not just a movie, it's true cinema designed to challenge and provoke, check it out."}, {"id": 33, "text": "A totally bonkers ride into a future world that turned fun and tolerance into a prison. But beyond the visual madness, there's the meaningful coming of age story of Ulysses who embarks on a heroic journey to deliver a message of hope and love conquers all. Young actors Arman Darbo and Chloe Ray Warmoth were very touching and carried the film as they fight against all the weirdness around them. Amazing soundtrack with electronica versions of Prokofiev, Ravel and Beethoven pieces. No other movie like Greatland..."}, {"id": 34, "text": "Greatland renews the dystopian genre with a fresh take on a disturbing future. The oppressed do not feel nor understand their oppression, worse they cherish and celebrate it as their Greatness...The dominant elite does not impose its rule by force but by fun and indulging its citizens with their whimsical desires and apathy. This looks closer to our reality than the spectacular crypto fascist universe of say The Hunger Games. In this future, technology plays a role but has actually regressed as the downfall of the general intellectual level in the nation does not allow to maintain a complex infrastructure. But beyond the dystopian portrayal of our world to come, Greatland is also very poetic and full of symbolism and mythological references. Arman Darbo and Chloe Ray Warmoth are perfect as the beautiful young couple fighting for life, love and a return to normalcy. An ambitious and thought-provoking film."}, {"id": 35, "text": "I've seen some wild movies over the years, but this one is right up there. Funny, strange, damn quirky and just a ball. A really crazy mix of sci-fi and satire. And wow, does it nail 2020 in all it's effed-up glory! Watch this one. I guarantee, you won't forget it!"}, {"id": 36, "text": "Greatland is a wild, colorful, quirky, well paced and structured indie movie with Terry Gilliam flourishesLove seeing Eric Roberts in anything and he has a great character in this. A fun little indie cinema ride thats packed with imagination."}, {"id": 37, "text": "(MOSCOW INTERNATIONAL FILM FESTIVAL 2020) Dana Ziyasheva's Greatland, a dystopian fantasy, comes to Amazon video on demand Sunday, 1 November 2020. Greatland, with a Ziyasheva written screenplay, stars Eric Roberts, Nick Moran, J.P. Manoux, Bill Oberst Jr, Shannon Briggs, Arman Darbo, and Chloe Ray Warmoth.The film, set in a futuristic vintage style Los Angeles, revolves around rebellious non-binary teenager Ulysses and their mission their childhood sweetheart. The story unfolds in the midst of a ridiculously absurd election, a deadly virus outbreak, chaos, and violence.Whilst the story is ridiculously bizarre, noting current global issues, Greatland is thoroughly entertaining. This is a world where boys are married to trees, cats and dogs run for President, and the Virus has become a new religion."}, {"id": 38, "text": "What an interesting, quirky, science fiction trip. Visually amazing, especially for an indie film. Love the art design for the production! The performances are fun and the movie has a lot to say about so many current issues that are going on in our world in 2020."}, {"id": 39, "text": "Greatland is Idiocracy + 1984 + 2020! Beyond the crazy visuals and over-the-top parallel dystopian universe, there is an acid social commentary showing how the one percenters are manipulating common people's desire for individual freedom, diversity and tolerance in order to enslave them in a prison of fake fun. Greatland is an instant cult classic and an atomic bomb of cinematic subversion."}, {"id": 40, "text": "If you don't have skills to read in between lines, don't even start watching this movie. The movie is targeting audience with high IQ. It became clear to me one more time how many people (including some reviewers of this title) are actually belong to the Greatland. Arman significantly improved his acting talent comparing to his previous roles. The rest of the cast was also awesome except man with mustache in the beginning of the movie. He was too theatrical. I really enjoined the movie and recommend thoughtful approach if you're brave enough to immerse into the matrix. and almost forgot... special thanks to costumes designer. I could never expect to see such costumes from American mode movie. They are so European."}, {"id": 41, "text": "This is a great parody of so many of the issues that we are facing in today's world. It is fun and definitely quirky, with a strong cast in the leads. It's fun escapism and I recommend a watch."}, {"id": 42, "text": "Greatland filters 2020 through the lens of satire and does a fantastic job of keeping me on the edge of my seat wondering what I will see next. Great performances and the production design is especially fantastic. The post apocalyptic landscape explodes in technicolor visuals that are quite dazzling. It reminds me of Smiley face by Gregg Araki meets Zardoz and Rue Paul's Drag Race. Who doesn't love that!"}, {"id": 43, "text": "Colorful, imaginative and bizarre. A fantasy-like surrealistic tale with a message about gender roles, this one could eventually become a cult film. It won't be for everyone, but I enjoyed it. Star actor Eric Roberts is memorable as well."}, {"id": 44, "text": "I just loved this movie. Not just me, my family did too! Chloe Ray Warmoth, Holy Cow! My goodness she was good! Actually, all the actors did a good job. This film really makes you think. My wife and I kept discussing it after we had watched it. I want to be careful with what I say because I don't want to give too much away. But suffice it to say, this film gets a Thumb's Up from me and my family. Bravo all! Well done!!"}, {"id": 45, "text": "It's trippy. It's way out there. And yet it strikes a chord on what is happening in our world today. And that makes it genius. The performances suck you into this world. And no matter how weird or out there the world is, it is so well-rounded and developed, you never feel lost. Strangely enough, you feel right at home, ready for the wild ride you are about to begin. And boy, what a ride."}, {"id": 46, "text": "I can't say too much in the interest of not spoiling this, but be prepared for a mind-bending extended metaphor that is easy to swallow and easy to follow. Watch this and you won't regret it!"}, {"id": 47, "text": "You have never seen anything like this! If you want to be entertained with something absolutely original, crazy, fun and camp, Greatland is your movie! Get on the couch, pop-corns and refreshements... and clear your mind for this psychedelic trip!"}, {"id": 48, "text": "Typically I don't watch this genre but I checked it out and I couldn't walk away from it. The red hair actress Chloe Ray Warmoth caught my attention as an especially talented actress. She's one to watch. I highly recommend watching Greatland"}, {"id": 49, "text": "This movie could have been written by anyone of the Proud boys or Trump himself. It's over the top portrayal of ethics and morality seems to imply that any change to society's moral code is a bad thing. If the actors knew about the goal of this film and still chose to act in it, they should be embarrassed at least and ashamed at best. This film takes every conspiracy theory and tries to imply that they have been forced to upon society and this film is the result. This movie is an attempt to scare people into thinking that diversity is a bad thing, that the only morality is one that never changes and born in the 50s, that covid is hoax, and Trump was cheated out of the election. Do not waste your time!"}, {"id": 50, "text": "This film is just so quirky fun and original. Its colorful and contemporary.The world they built is so interesting And the twist at the end is great.If you like films such as Turbo Kid and Troma This one is for you!"}, {"id": 51, "text": "Simply love this film, brilliantly out of this world storyline, wonderful acting and film making. Truly original and a feast for the senses. Very, very brilliant film making. Great movie"}, {"id": 52, "text": "Very topical and wild ride. Greatland is sure to entertain or at least leave you with lots to talk about. Chloe Ray Warmoth as Ugly Duck and Arman Darbo as Ulysses have strong solid performances and have a genuine chemistry on screen. This failed utopia turn dystopian world is fun, scary. and a bit prophetic."}, {"id": 53, "text": "Set in an imaginary country which is said to be the birthplace of love and an endless source of fun, Greatland is all about the rebel teen Ulysses, who is attempting to save his childhood sweetheart as an election and a deadly virus wreaks chaos and violence.So you know, it's ripped from the headlines, I guess.There's a pretty decent cast on hand with favorite of our site Eric Roberts, Nick Moran (Scabior from the Harry Potter films), former boxing champion of the world Shannon Briggs and horror star Bill Oberst Jr (The Devil's Rejects).It's directed by Dana Ziyasheva, a former journalist and a UNESCO diplomat with 20 years of development work around the world. Her film Defenders of Lifeabout child-brides set in the indigenous Ngäbe tribe of Costa Rica helped bring about a national ban on under-age marriages.This is a neon world of what happens after the virus, a world where people only care for themselves and their fun forced to come back to our reality. It goes past non-binary love the whole way to interspecies romance, too.This isn't for everyone, but is an interesting take on post-apocalyptic film."}, {"id": 54, "text": "On the surface it's crazy. Deep down, it's scary. Those who can pass the first level, are treated to a full range of political, MK Ultra and totalitarian propaganda tricks. It's so subversive it hurts my brain. No wonder MSM doesn't cover it."}, {"id": 55, "text": "The only reason this movie didn't get a ten from me is that I would love to watch it again in an enhanced state. Unfortunately I gave that up a long time back so it will have to remain a nine for me.When leftist ideals go to the extreme! You too can marry a tree and have a rabbit for a son, we must be all inclusive. The few who dare question this are either sent to repentance island or tagged for resurrections. The sad part though is the majority would rather live in this world where they are told what to eat, who (or what) to marry, and how to think, than a world of freedom that might just be a bit scary.I didn't know either of the young leads, Arman Darbo and Chloe Ray Warmoth, but thought they both did a nice job with their characters. Bill Oberst Jr. and Eric Roberts each have small parts that they play quite well. Bill does creepy so well!!This movie sums up 2020 quite nicely and if you want to put the thought into it you will find a lot of parallels. And if you don't want to put a lot of thought in to it you can just look at the pretty colors. Either way, strap in, you're in for a hell of a ride."}, {"id": 56, "text": "With echoes of Aldous Huxley's Brave New World, Dana Ziyasheva has created a wholly unique piece of dystopian science fiction in the spirit of Fellini and Gondry. Especially at a time when indie filmmakers need to take bold risks into the avante-garde and experimental amidst a sea of studio-generated franchise films, Ziyasheva and team emerge with a movie primed for cult following.With striking allegory to our current political climate, pandemic, and our obsession with technology and social media, the film is both social commentary as well as a surreal coming-of-age story.Susannah Lowber's production design and Megan Spatz's costume design, especially, create a tactile (albeit psychedelic-inspired) landscape that compliment the impressive, low-fi visual effects.Ziyasheva's unique, international voice is a refreshing reminder that indie filmmaking is alive, well, and unconventionally thought-provoking."}], "reviews_amount": 57}