{"name": "Vampires vs. the Bronx", "titleId": "tt08976576", "reviews": [{"id": 0, "text": "A trio of teens from Bronx r concerned about their local grocery store shutdown cos of new real estate development. They r forced to protect their neighborhood when they come to know that the new land owners are a bunch of vampires responsible for the invasion of their locality and murder of their godfather. Comparisons to Attack The Block, Fright Night and Lost Boys will continue to pop up in reviews but this one aint no copy cat. Coincidentally i was on a Dracula/Vampire movie marathon and aft almost revisiting all the Dracula films n gotten tired by this genre, i somehow enjoyed this. The vampire effects r cool, ther r few scary moments n some good acting by the kids. Good to see a hot vampire chick. They shud have focused a bit more on atmosphere n added more kills."}, {"id": 1, "text": "The plot is not original but, the execution is decent. The kids performances are pretty good. The humour is at times cringe but, there are some moments when you might find yourself laughing out loud.There is clearly some symbolism in place with the Vampires. They represent the rich who take advantage of the poor in the real world. There is a message that is being sent throughout the film in regards to this.The kids also, have their own small storylines going on and even though it doesn't get too deep it tries to also, send a message to the viewers of good and bad.If you don't take it too seriously and just try to watch it casually it's a fun movie."}, {"id": 2, "text": "It gets better midway through but doesn't really go anywhere. I thought it was going to be a fun film like attack the block but definetly nothing alike. Had a lot of potential but didn't live up to much. Watch if you want something to eat to or browse your phone throughout."}, {"id": 3, "text": "Vampires vs. the Bronx was a cute dare I say, family movie. I don't get the comparisons to The Lost Boys at all. It's a campy decent movie with good young actors, that used a real life issue as it's foundation. Gentrification and re-Genetrification is a serious subject, that has invaded inner cities forever. I think, the use of Vampirism and taking over of neighborhoods (that are primarily habituated by people of color) was a unique take. Kudos to the young brothers, who did a good job imo. Check it out, it's definitely not the worst way to spend 1.45 hours!"}, {"id": 4, "text": "Lots of in-jokes for fans of the vampire genre, likeable leads and a lot of laughs. A good family film. Great for fans of Stranger Things or Attack The Block."}, {"id": 5, "text": "Give the racism comments a rest please, what's up with people.Enjoy it for what it is, a fun, lighthearted film about vampires.It's not to be taken serious, which is obvious.Come on people, chill out."}, {"id": 6, "text": "This movie achieved its purpose, kept me entertained for the duration which is pretty much what I basically from titles such as this one.It lost a star due to some of the predictable parts of the plot but all in all I felt the representation of ethnic minorities and people of color in areas such as this was well presentedAs long as you take this movie for what it is, you won't be dissapointed"}, {"id": 7, "text": "Just ok. Quite weak. For a movie about vampires it really lacks bite."}, {"id": 8, "text": "This movie is fun and short and i think it deserves a watch. but it isn't great yes, it took it's time to build up the story and the characters in the first half in pretty well way and the last 30 minutes or so was just way too fast for what they were building up to and made the movie at the end: meh it was fun... forgotten"}, {"id": 9, "text": "Could have been way better but the end was rushed and a lot of scenes where people just showed up... made no sense... lastly the vampires werent scary and had no plot whatsoever... there was no real mystery to it and thats what a vampire story should be (along with a menacing creature)"}, {"id": 10, "text": "The main characters in this movie were very one dimensional and weren't very likeable. One could predict the entire plot of the movie after seeing the first 10 min of the film. The best character in the movie was definitely Tony but he died in the film, it would've been nice for the audience to be sad at the fact that he died but for sum reason the movie never showed us his death or gave his character any hopes or dreams that would make us sad that he died. There's barely in any action throughout most of the film and when we finally get to the 3rd act, the action was so bland that a 6 year old could've came up with better scenes, and the final battle was very anti climatic. All around this is a low tier movie that can't even be classified as so bad it's good and probably won't be remembered by anyone. With predictable writing, lame characters, characters getting no development besides one, and boring action scenes, this movie fails to capture or put me in the spirit of Halloween."}, {"id": 11, "text": "I didn't expect this to be Schindler's List, but I found the production quality sub-par, even with a film of this budget. The script had some promise, but lacked in a few key areas - climax being a big one. Even as a PoC, I find it disheartening that we live in a world that seeks to end racism, except against non-PoC. This movie and script do not help."}, {"id": 12, "text": "If you take Attack the block and move it to Bronx and exchange Aliens for Vampires you have this movie."}, {"id": 13, "text": "Found the film too predictable! Reminded me too much of Lost Boys especially when the young boys go hunting! If your going to do a vampire film or redo one make it better!"}, {"id": 14, "text": "LOVE LOVE LOVE THIS MOVIE!! I was surprised at all the stars in this that had bit parts compared to the leads who are relatively unknown. Two standouts are the lead Jaden Michael (Miguel Martinez) and Gregory Diaz IV (Luis) who play best friends who figure out early on that vampires have come to the Bronx to slowly infiltrate and take over by buying out businesses under the cover of their company Murnau Enterprises (Murnau - according to IMDb - being a nod to F.W. Murnau who directed Nosferatu which is considered to be the first vampire film). The vampires chose the Bronx because they wanted a place where no one would know or care when people went missing. The residents bands together to go up against the vampires and take back their city.This film has laughs interspersed throughout so it's kind of a dark comedy. I find it really hard to enjoy movies anymore. I usually spend more time looking for movies that look halfway interesting rather then actually watching anything so it is hard to impress me BUT I was hooked from the beginning. This is a funny endearing little film and I think it can be enjoyed by most audiences. There is some foul language and some intense scenes that may not be suitable for little ones so this is strictly for teens and up.I have no qualms about recommending this film.Body of Christ!"}, {"id": 15, "text": "It's a fun romp. Mean reviews. It's a Netflix film. Totally enjoyed."}, {"id": 16, "text": "Vampires vs. the Bronx draws heavily on the (far superior) British film Attack the Block, as well as on eighties classics like The Lost Boys, but it doesn't do anything interesting with this borrowed material. This is an extremely generic vampire movie, with all the familiar traits. The only interesting addition is what the professional critics are calling an 'anti-gentrification narrative'. Normal people will recognize it as blatant anti-white racism. All the vampires in this movie are white and all the humans fighting them are black and Hispanic. Just imagine the response to a movie depicting dark skinned vampires invading a town inhabited by white people! It would correctly be seen as unacceptable bigotry, but when whites are dehumanized in Vampires vs. the Bronx the woke critics and Netflix praise and reward it. It is a sign of a sickness in our culture that hating anyone because of skin color is encouraged."}, {"id": 17, "text": "I can only assume the politics of this film are the reason this has a surprisingly low score. It's not reinventing the wheel and it's not the scariest film but let's remember this is a family film with a young central cast it's not intended to be an 18 rated horror. It has likeable characters with a political message about gentrification. If you are part of the white lives matter brigade you probably aren't going to enjoy this film but one wonders what you do enjoy."}, {"id": 18, "text": "Vampire is a metaphor for white gentrification in all of the urban neighborhoods. I loved it, y'all just mad🤣"}, {"id": 19, "text": "Between the low budget and blatant evil white people looking to wipe out the all minority Bronx, I just cannot say it was good. The one good white person in the movie turned out to be the most evil person in the movie. Around 15 minutes into the movie, I already knew the whole story. I fully watched it to find out if I was right. I was. Nothing new here. Just more left leaning politics. The ending had a pretty cringy moment. It was so ridiculous.It really is too bad. This movie could have been ok."}, {"id": 20, "text": "Pretty confident this is the only horror movie I will ever hear the bachata song Dos Locos played in. But the rest of the film relies too much on familiar themed. Plus it makes the grave mistake of showing the climax of a quintessential movie like Blade in the background like it's a throwaway. That's not how to properly give an homage. This needed a lot more work on the script before shooting started."}, {"id": 21, "text": "This is a good production, this is something different, is about the Bronx, shows in part the reality in the bronx, nobody cares if you disappears in the Bronx"}, {"id": 22, "text": "What The Wiz is to the Wizard of Oz, this is the same for the Vampires vs. The Bronx is to The Lost Boys."}, {"id": 23, "text": "This is an obvious (poorly executed) stab at gentrification with extremely anti-white undertones. Think about it. Every vampire in the city is white. coming in to ruin the Bronx, and buy up all of their property? This film tried WAY too hard. The actors look like they had fun, and some had talent. The effects were off, and there are a lot of holes in the plot that don't make sense. Why not just make it a movie about gentrification, and call it good?"}, {"id": 24, "text": "It's not a 10, but it's definitely not a 1. 6-6.5. A decent, entertaining watch. I wonder would the same people have been claiming a rip off of Lost Boys if it had a white cast..."}, {"id": 25, "text": "Although it is lower budget and predictable, what makes this film special is that it makes fun of itself while also being tongue-in-cheek: using vampires overtaking the Bronx as an allegory for gentrification from the perspective of the poor, immigrant families who are being displaced.I also enjoyed the subtle foreshadowing using Salem's Lot at the beginning, along with the fun band shirts worn throughout the movie.As a side note: I'm not sure why people are complaining about it not being scary; the genre literally states horror-comedy on IMDb and Netflix. As for the other movies it claims to copy: not even close.Give it a watch if you want a good laugh with a new perspective on comedy-horror."}, {"id": 26, "text": "An adventure film with light touches of suspense. It is not a horror movie far from it. It is about a real estate agency that wants to establish itself in a neighborhood by buying everything when in reality it is a sect of vampires and some teenagers discover them and set out to dismantle them. Entertaining Quality. The fields look like something out of Twilight. Most of the effects are well achieved, only two or three are not. Predictable like all of its kind. A movie to spend the afternoon. In moments of Spanglish. For the title one would expect a lot more but it really doesn't. Not suitable for susceptible in question of religion. It fulfills its function which is to entertain."}, {"id": 27, "text": "If you can't be original, don't bother. Nothing wrong with the film, it's watchable if you've nothing else to do. Why try to do Lost Boys? It's like the idiots who tried to remake Psycho. Young actors do a good job."}, {"id": 28, "text": "First of all, anybody offended by this film or calling it racist are probably bitter white people who think reverse racism is a thing. If you're not offended by the concept that white privilege does indeed exist, the political themes in the movie won't bother you.Anyway, the main part of the movie is the vampires vs the kids. And it's hella entertaining. It's mostly funny, not scary, but it makes for a good time. I was honestly surprised it was this good considering the budget must've been fairly low. Would definitely recommend to anyone who isn't a white supremacist."}, {"id": 29, "text": "This is a a great movie. So what if it's like other movies in this genre. It was well acted, funny, and cute. Take it as it's meant to be, a coupe hours of entertainment."}, {"id": 30, "text": "Think of the Evil Dead and Night of the Living Dead, but with less quality and less production funds, not as funny nor as interesting.The movie really was terrible. Vampires move in to The Bronx for some reason? There was no logic behind the script. The acting was actually OK and they had some special effects which I think accounted for 90% of their entire budget. The rest of the special effects were low tech.I can't recommend this movie for any reason other than if you need to familiarize your self with terrible movie so in the future you'll be able to use it for comparison."}, {"id": 31, "text": "It has an amateurish feel but it's a alright movie. The boys do a good job and it's something you can watch with your kids. It doesn't feel like a film as much as a tv show."}, {"id": 32, "text": "Even for a movie (presumably) targeted at teens, Vampires vs. the Bronx fails to provide any thrills, let alone genuine scares. The filmmakers have copied the stories and visual styles of Attack the Block, The Lost Boys, and Stranger Things and combined them with an unsubtle message about gentrification, which amounts to promoting hatred of white people who live in affordable neighborhoods. The filmmakers seem to think everyone with pale skin receives a trust fund and can afford to live in Manhattan. Even if the viewer ignores this message, which is difficult because the film all but hits you over the head with it, there's very little fun to be had. The vampires aren't scary and the silly slapstick action isn't ever more than mildly amusing. The movie falls apart in the last third and the ending is sloppy and unsatisfactory. The best thing about seeing this movie was that it reminded me to rewatch the superior movies it 'borrows' from."}, {"id": 33, "text": "Worst movie i have seen... Dont waste your time..."}, {"id": 34, "text": "I actually like this. It is an unusual storyline. I like creativity. I love the actors &amp; their acting."}, {"id": 35, "text": "I try not to compare vampire movies like many reviewers did. This was not horror... my 3 year old loves it. He's obsessed with anything Halloween related. Easy movie to laugh too. The vampires reminded me of the ones off of Buffy the vampire slayer. Are you easily entertained? Then watch this for just that."}, {"id": 36, "text": "I love a campy vampire film. The story doesn't take itself too seriously but also never crosses the line into too silly. Add solid performances and production for a complete delight. I especially enjoyed the fresh metaphor of vampires as rich white gentrifiers attempting to literally suck the blood out of a solid local community. Don't compare it to Lost Boys. Vampires vs. the Bronx is an original vampire story that stands on its own."}, {"id": 37, "text": "Three teens from the Bronx get angry when their local grocery store shuts down due to a new real estate development. They take it upon themselves to protect their neighborhood when they find out the new land owners are vampires.It's a charming tale of gentrification essentially being a form of vampirism. I loved all the kid actors and it reminded me of films like The Lost Boys, Fright Night, and Attack the Block. It has enough new to say without being an outright rip off of those other films."}, {"id": 38, "text": "Liked it more than I thought I would. Vampires vs. the Bronx starts off great. The first half or so really gets the feel right. There are some Stranger Things vibes early on as the kids try to solve this Vampire mystery.Unfortunately the movie does fall apart a little bit towards the end of it. The big finale feels a little too easy and there's never any doubt about how it's going to end. I get that that this a comedy as much as a horror film, I just wish that they would've made the ending a bit more tense.With that being said, Vampires vs. the Bronx is a fun Halloween movie that gives you just enough horror to keep you engaged and put you in that Halloween mood."}, {"id": 39, "text": "I enjoyed this movie could have been a little more longer but hey great movie to watch with your teen kids or just you . I've watched it about 6 times now with my kids my nephews nieces sister etc really good movie great job actors and actresses!!!"}, {"id": 40, "text": "I don't know what movie everyone has seen, but this movie was awesome! Great acting, script, direction, and soundtrack!!!"}, {"id": 41, "text": "Movie reminds me of Lesandro Junior Guzman-Feliz, but it's talking about vampires not gangs that killed the kid."}, {"id": 42, "text": "This movie was excellent and starred a cast of people of color that make this movie worth watching. Not only is it a fascinating story about vampires, but it speaks more to the gentrification of our hoods all around the country. I love the symbolism, but it's also why so many people gave this movie a low rating. As we drag our way through a pandemic that has further illuminated the racial inequity and injustice in this country, this move forces gentrifiers to recon with what they are...vampires. They suck our culture, and our resources dry, leaving nothing but broken communities in their wake.. Well worth the watch, and awesome movie for the culture."}, {"id": 43, "text": "Yes, this movie is a ball of corn dipped in orange movie theatre nacho cheese. Yes, there are cringey moments.But, I think this movie has heart, the three main boys have great chemistry and the movie manages to have a message without being preachy. It reminds me a lot of Monster House and Fright Night. Which is a great thing.Definitely a nice watch this Halloween."}, {"id": 44, "text": "This is clearly a silly film targeted primarily at kids, but the child actors were good, the plot entertaining if a bit too lighthearted, and a good entry in the library of kids that no one believe vs vampire invaders. There is also a more serious message in there, because the vampires in the film are a metaphor for gentrification by white rich folk, just as vampires have become a metaphor for the nobles sucking the life out of normal peasants.Bottom line: feels like one of those 80's movies, so I quite enjoyed it. Plus, with the scene at the end with the vampire dust, one might even call this a prequel to Vampire in Brooklyn :)"}, {"id": 45, "text": "It was enjoyable to watch. I thought the acting was pretty good, the story was decent(and pretty on the nose about what they were trying to say), and the characters were interesting to watch. I felt like the movie was a little derivative from 80's and thug movies. There's a scene where they kill 3 vampires and it's very similar to a scene from the movie The Lost Boys.The effects are pretty laughable. Not once did I find the scenes where the vampires were flying believable. Also, the main antagonist was very easy to guess the moment she appeared. Even with these flaws it was still a decent movie. If you like urban and fantasy films, this's for you. It was a pretty decent film. I actually wouldn't mind it having a sequel instead of bright. This's a movie you definitely want to sink your teeth into."}, {"id": 46, "text": "This is a good movie , don't let the reviews mess you up . Watch it"}, {"id": 47, "text": "This could have been really good. But ultimately it's just a kid's movie with a lot of inappropriate language.The vampires, all five of them, died so quickly and easily (after surviving for over 700 years?), it was a joke. The vamps supposedly could move at incredible speeds, fly and had super strength. Yet a myopic 13 year old, with low blood sugar, easily took two of the five out. The second vampire apparently was only as strong as the kid and took a broken wooden skateboard to the heart.If only the vampires wore some sort of body armor to protect their hearts. Then the movie would have been worth it."}, {"id": 48, "text": "I enjoyed Vampires vs.The Bronx it was entertaining,funny, and also had hidden messages about certain places in America no one really cares if you disappear which is true and the gentrification of neighborhoods are true also,but overall a great horror comedy not to be taking too seriously,its a overall decent movie,and I love to see fresh new faces of up and coming actors on the screen and I also gave it a 10 because even though their roles were small in the movie,I'm a fan of Method Man and Zoe Saldana"}, {"id": 49, "text": "A funny and intelligent comedy about the blood-sucking business of gentrification.An estate agency starts buying out the Bronx. Three friends want to save the neighborhood bodega but step into a dangerous business.Lighthearted but poignant, the film is a coming of age story in the Bronx, with a twist. A sweet, quirky tale of friendship, courage, integrity and the resilience of a community against the evil forces of exploitation and corporate invasion.It reminded me of Attack the Block, the 2011 film with John Boyega, but lighter."}, {"id": 50, "text": "Nicely simple story that is sometimes too similar to attack the block. Underlying message of white people taking black culture, especially with the vampires (creatures with pail skin). over all good."}, {"id": 51, "text": "Interwoven with Do the Right Thing and popular vampire movies, this teen comedy-horror attempts to be original with adding a blend of theme, location and social commentary into the mix.However, it demonstrates perfectly the conventions found within its genre. It is very predictable and the intertextual references are in abundance, which became irritating.That having said, there are moments of juicy ominous vampire fun, but they are very rare.So, if you're a fan of the genre, it's an ok watch."}, {"id": 52, "text": "I suppose it's probably a good preteen film. Solid effort for that demographic, but otherwise it's a very low budget flick riddled with cliches, rip offs and stereotypes."}, {"id": 53, "text": "I enjoyed this movie and it was entertaining. It is a funny movie and I suggest you watch this movie and don't listen to the bad reviews."}, {"id": 54, "text": "As a Dominican American, I ABSOLUTELY loved and adored this film. A Hatian, Dominican, Puerto Rican and Black kid saving the world against colonization while making you chuckle: splendid!"}, {"id": 55, "text": "Mediocre movie. Not that fun to watch and the vampires are really bad looking. One actress is way to old to play a kid."}, {"id": 56, "text": "I've seen this draw comparisons to the Lost Boys. The only thing this and the Lost Boys have in common is vampires. Then I heard it compared to the monster squad. Maybe a little without any humor. I even heard it's like Attack the Block. HELL NO! It's like someone decided to make Disney Channel show in The Bronx with vampires. It's not good. I figured it's got The Kid Mero so there's got to be some funny parts? There is not at all. Just........ just don't. I have this to say to anyone associated in the making of this film. APOLOGIZE AT ONCE!"}, {"id": 57, "text": "Do the Right Thing meets Lost Boys but fails at both. The overall hurried feel of the movie gets really annoying just after a couple of scenes, pacing is all over the place and both story and character development moves way too quickly. Little Mayors acting is not good and that only adds to the half-assed feel of the movie. There are great vampire movies starring kids or teens, this really isn't one of them."}, {"id": 58, "text": "Middle aged white woman here. I loved this movie. It had a lot of heart and loved its characters and its home, and I liked that the rich white folk got what was coming to them. (The more I think of it, the more it seems a fitting allegory.) If you like tongue-in-cheek sassy coming-of-age vampire flicks, this one is for you."}, {"id": 59, "text": "They clearly didn't have a big budget for this movie but they did a strong job representing an underrepresented population and driving home the point that the lives of minorities in America are *STILL* not valued properly. Vamps represented gentrification and selling out culture for money, while the kid protagonists did a great job bravely standing up to the evil and one even represented the temptation of corruption into a gang lifestyle.So I can't speak to how realistic this film is because I'm a white girl from the suburbs. But it brings these racial/class issues to our minds better than most mainstream entertainment and it still entertains us--it's not a prequel, sequel, or a reboot. It has decent acting from young kids. The action sequences and effects aren't amazing, I won't lie, but I liked it. Not fantastic, but very watchable and speaking with a voice our society needs to hear."}, {"id": 60, "text": "I think this movie is brilliant. It made me laugh, the acting was great and Method Man is the vicar!! What more could you want?!"}, {"id": 61, "text": "Similar plot to Attack the Block but still well done. The kids hold their own and the movie really tries ro capture the feel of the Bronx and the culture. Decent pace and some fun cameos."}, {"id": 62, "text": "Basically a Lost Boys for this generation. Most hardcore Lost Boys fans will say this is a cheesy ripoff not realizing that Lost Boys was cheesy when it came out back in the day. And that's ok. Chessy movies are good every now and then."}, {"id": 63, "text": "This a kid's friendly vampire film that is better than the emo gothy vampire Twilight series. It captures some of the endearing elements from the teen vampire 1980s horror classic like the Lost Boys &amp; Vamp but just falls short from being a modern classic. The chemistry between the young cast has the similar vibes as the remake of IT &amp; Stranger Things."}, {"id": 64, "text": "While this film is reminiscent of the Lost Boys, The Bronx, New York City setting is what really sets it apart. Light on the horror but delivers with lots of charm."}, {"id": 65, "text": "Vampires vs the Bronx was really cute. I definitely think 10 to 14 year old kids will love this film. I'm older than the target audience since I'm 27, but it's still enjoyable for adults too. You can tell it's inspired by a lot of movies we all grew up watching, with a Bronx twist. It's about gentrification which apparently has turned some people off. I'm a white person from Connecticut so I think about this topic a lot. I'm close by so it's easy to see how things are changing over in NYC. It's a very real subject, and it needs to be discussed. Anyways, you will like this movie if you like nostalgic things like The Warriors, The Lost Boys, Stand by Me, The Sandlot, the It mini series, or Silver Bullet. If you like newer things like On My Block, the It films, or Stranger Things this movie is also for you."}, {"id": 66, "text": "I went in to this expecting a horrible movie... i was very wrong. great acting, perfect casting (aside from the leads love interest who could have been 14 or 35... hard to tell. the story was well executed, good characters and direction. i wish this was a series!!"}, {"id": 67, "text": "Many of the reviews on this are comparing it to The Lost Boys, which is fully unfair to Vampires vs. The Bronx. One, The Lost Boys - while having a few light moments of humor - is pretty much classic vampire horror. Vampires vs. The Bronx bills itself as a Comedy / Horror, and that is accurate. It's funny in all of the right places, and the scares are meant more for teenage audiences - not adults with jaded expectations. It moves swiftly, offers cameos of some pretty rad players, and stays fun throughout. Personally, I would have enjoyed it even more had they taken a little more time telling the story and offering deeper inside-looks to the 'vampire takeover' and the company surrounding it. An extra half hour of film would have done it justice in a more complete way. Yet, the acting is great throughout, the plot is solid, and it is so unlike The Lost Boys that those saying it's a copy of The Lost Boys should rewatch both films, which I've done recently. Normally, Netflix Movies are fails in my opinion. This was like a fast-paced, blood-thirsty block party, and it rocks."}, {"id": 68, "text": "Smart, witty and spooky; Vampires Vs The Bronx is entertaining as hell even if the film is aimed at teenagers.In this horror-comedy, a group of young kids from the Bronx fight to save their neighborhood from gentrification and vampires.Some films that are aimed for a specific audience like teens, sometimes crossover and become enjoyable experiences for older folks. Vampires vs The Bronx is one of those films. A wholesome and vibey horror-comedy that is sure to please. The three lead characters are terrific, the writing is clever and the overall atmosphere is a good time. Stream it today on Netflix.Follow @snobmedia for all reviews!"}, {"id": 69, "text": "Good fun. Don't expect much of a plot. I enjoyed it and isn't that the point."}, {"id": 70, "text": "Tried to have the charm of Attack the Block, but ultimately made the vampires too stereotypical and cheesy that dragged the whole movie down. Added nothing new and offered nothing. Script, dialogue, acting, everything was poor.I only sat through the whole thing cause Sarah Gadon is really pretty. But woof. This was a stinker."}, {"id": 71, "text": "It's a corny, kid-friendly, vampire, family movie with a valid message that most kiddies won't pick up on. Take it for what it is &amp; enjoy the cameos."}, {"id": 72, "text": "My wife and I watched this last night, and really enjoyed it. There's some scary stuff in here, but little gore. Overall, a fun movie that uses stereotypes and atmosphere to put a new spin on the vampire genre, and I was very impressed how much was done with very little. Minimal special effects, no headline actors (unless you count Method Man), some laughs that used to underline, but not to diminish from the plot."}, {"id": 73, "text": "Good lighthearted horror The acting is extremely questionable though 😂"}, {"id": 74, "text": "Don't take this movie as an Academy award nominee and look at this as a fun movie, because it is! To me, this is a mix of Stanger Things, What We Do In The Shadows, and The Lost Boys. This was a great movie if you go into it not taking it seriously. We loved it!"}, {"id": 75, "text": "While Vampires vs. the Bronx isn't inspired and doesn't do anything original for the genre, I thought it was fun. They actors were good and the characters were likable. It is a teen movie, so there is limited opportunity for adding any real punch to the ending."}, {"id": 76, "text": "Went into this film with mid to low expectations and was actually very pleased with what I watched. What I watched was a very fun, entertaining, and funny vampire film with a great set of characters all who are very believable in their roles and are extremely likeable as well. With the exception of some pacing issues causing me to lose interest in certain segments, Vampires vs. the Bronx is a fun vampire film that I look foward to rewatching soon."}, {"id": 77, "text": "The movie does not serve really new things to people who've seen movies ... horror movies in particular. But it is a fun little gem of a movie we get served here. From the casting (Method Man as a man of faith to name just one), to the dialog, to the setting (in the Bronx).Yes you get cliches but the group of kids and the way they behave ... everything is fitting. Even their mistakes (filming a vampire and so forth) - they just don't know any better. Also any movie that references Wesley Snipes as Blade has already won on mutiple levels. So don't overthink it, don't expect anything more from this than it actually is: a fun little horror movie aimed mainly at a younger audience"}, {"id": 78, "text": "Sweet watch. Fun freaky Friday movie for sure. Would recommend."}, {"id": 79, "text": "Cute little flick if you're wanting another take on a vampire movie. I personally love all vampire movies so I give most a chance. Really can't discuss without spoilers so... But why doesn't ANYONE in the movie have a New York accent if everybody is from the Bronx?"}, {"id": 80, "text": "Eeeeeevery vampire film you've ever seen done again. Just your bog-standard plot and events unfold like all other cheap versions of this script.The cast were pretty good though.I've just had KFC for tea, was pretty good. Only ever had KFC maybe 6 times in my life. Mad that."}, {"id": 81, "text": "Went in thinking it will be a bad C list movie. However it turned out to be fun and we'll written. Not the best movie you will ever see but it has clever humour, characters feel authentic and are well written. Plot is a bit basic but plot is not the focus of this movie. Will definitely watch again"}, {"id": 82, "text": "Vampires vs. The Bronx: Very much a comedy but also a social satire about the gentrification of the Bronx; blood sucking developers driving local people out. The vampires' Renfield is named Polidori and the fiends are the Clan Murnau. Some real horror scenes with the vampires biting throats out as they suck blood, levitating with the teeth stuck in. Holy water bombs in balloons prove effective against the bloodsuckers as do the old reliable stakes. Not great but it is entertaining, a bit like Do The Right Thing ... With Vampires. Written &amp; Directed by Oz Rodriguez. On Netflix 6/10."}, {"id": 83, "text": "So frustrating! This movie had so much potential but really fell short. No character building so I didn't bond with any of the characters, ergo didn't much care what happened to them. Some of the character's choices just did not make any sense, i.e. why wait to go into the nest half hour before sunset? Sueprificial attention to detail and lame comedy - e.g. do vampires forget they can move fast most times? How did Miguel stab a dangling vampire in the chest? Where are all the supplies when they need them? Bad editing and dialogue - so much exposition and what's up with Vivian's flying??? Lmao. Rated 4 mostly for the great political undertones and good acting, but otherwise a disappointment. As someone else said, it's no Attack the Block."}, {"id": 84, "text": "There is not much of a story and what there is so predictable. The vampires arent scary and look very weak. Its just about ok if you've really run out of things to watch and it raining outside. There are many much better vampires films out there."}, {"id": 85, "text": "With the way things are these days I'm pretty sure it was a cheap way of saying black/Latino (heroes) vs white vampires (villains) It started off pretty good though. Then went downhill fast"}, {"id": 86, "text": "Serviceably entertaining little movie, but it's very lightweight, from the lack of character depth to the tame vampire violence (this is clearly targeting teens). There are worse ways to spend an hour and a half, but if you're looking for the next Attack the Block, this comes up a bit short."}, {"id": 87, "text": "A great film, innocent and fun. It reminded me of a modern day Lost Boys, but with better actors. Don't listen to the bad reviews, watch it and judge it for yourself."}, {"id": 88, "text": "The 3 young guys are 3 of the most talented child actors that I have seen, and I have worked with many.The plot is unique as far as I am and a great mix of comedy, drama, suspense, and horror. I don't understand how this could get lower than a 9.Good acting by all. And it's not because I am an actor from Nueva York, it's that it just is all-around fun. Not to be missed!"}, {"id": 89, "text": "Hilarious, funny, perfectly cliche. It was exactly what i expected, with great acting."}, {"id": 90, "text": "The characters are so likable and it's just fun, a little campy, but scary enough. Thought it was a good update to a genre that can become predictable. The young cast was especially notable, hope to see their careers take off from here."}, {"id": 91, "text": "Don't go in expecting the best film ever.. just sit back and enjoy it and have some fun.. it wasn't that bad at all.. happy Halloween"}, {"id": 92, "text": "I love this movie the edits are very good and there is no sexual and nudity scenes which is good to watch with kids however there is swearing which is kept to a minimum level so it's not an issue. However I hated how the commander ate the guy at the shop it was sad"}, {"id": 93, "text": "Vampires vs the Bronx was a good solid fun for this halloween season that had some laughs in it and it had a style that was survicable for this kind of a film.Story was solid but nothing special,but for this kind of a movie it was fine and watchable..Script was little cartoonish and cheesy but it had that low budget charm in it ,and make up for this project was fine to.The rest of this film was predictable ,cast was with acting fine but they lacked a bigger experiance to have a bigger effect on me,Vampires vs the Bronx was a solid film that had some cool and fun storyline and cool ideas"}, {"id": 94, "text": "It wants to be Lost Boys or even Attack the Block, but does not have the comedy, horror, thriller or writing/direction to match. Those movies managed to have some scary elements, true drama with comedy mixed in. This....no.....just no.Worst offender is the dialogue, not even up to par for young teenagers."}, {"id": 95, "text": "Most of this movie has nothing to do with vampires, they are sinfully under used for a movie called vampires vs the bronx. The vampires are really lame and barely do anything of interest. One scene that really confused me was when the guy who works for the vampires hired a bunch of thugs to kill the main kids, but before they can do that the vampires kill the thugs, why? Why hire them then just kill them and do what you hired them to do? This movie has a lot of moments like that and it was really blowing my mind how inconsistent this was. I cant tell if this movie is for kids or not, you would think so with the young protagonists but this movie is so boring and contrived I cant see any child liking it, it's not scary, funny, or action packed, it's just lame. Worst thing I've seen on netflix in a long time."}, {"id": 96, "text": "The cast, director and writers did their job! It's a comedic children's movie for children of all ages Not for creepy pervs critiquing this family movie for Oscar certification!"}, {"id": 97, "text": "Should have been better. Too pathetic. I was hoping for something better!"}, {"id": 98, "text": "Monster squad was a good movie and this movie has similar tones. Kids coming together to face a villain of the supernatural. This was a fun movie and I can say I enjoyed watching it. It was also fun to see vampires placed into a more realistic story. A group of kids that do not want to leave their homes and are trying to save the neighborhood. The story does lack build up. When you reach the finale you realize halfway into it that it is a finale. Other than that, it is a fun watch with some good jokes. It will get some jump scares for younger viewers. I watched it with my family and I did cover my daughters eyes due to some mild graphic death scenes. I would say watch this movie cautiously with children just because some people are killed and you see a bit more than a monster squad type movie. There are a lot of great things about this movie. One specifically is the power of community. Throughout the movie you see the community come together. These leaves a good message to viewers about the power of coming together to face uncertainty."}, {"id": 99, "text": "This is a good kids film, it never pretends to be anything more then that, and it does it well, limiting violence and language and showing that teamwork, friendship, and community, is all that stands in the way of those who bring trouble in their wake. Forget the reviews pushing political views, they're seeing what they're predisposed to seeing when they look in a mirror. Meanwhile, the vampires saw no reflections, with the Effects shots done nicely, and the Cinematography done beautifully, Audio done equally as well."}, {"id": 100, "text": "More comedy than horror, with great commentary on gentrification of urban centers, corner liquor stores starting to sell kale and oat milk, abandoned courthouses converted into condos, etc. I thought the kids did a great job in the film. Fun movie."}, {"id": 101, "text": "If you've ever sent attack the block you know a rip off when you see it...can't live up to the original.."}, {"id": 102, "text": "So many negativity about this flick. Please don't take it serious. It's a family flick that is entertaining for sure and do has some scary moments for those not used to see a horror flick.But if you think you are going to watch a real vampire flick, forget it but still, it do has some references towards Blade, The Lost Boys, Murnau (director of Nosferatu) and a logo straight from Vlad Dracula.No gore or any blood but there is some biting here and there. As I said it, a flick to watch with the whole family. Gore 0/5 Nudity 0/5 Effects 2,5/5 Story 2,5/5 Comedy 0,5/5"}, {"id": 103, "text": "This movie brings life to a whole teen-horror genre. Even though this may not be fully horror, it feels like a homage to RL Stines Goosebumps or many early 90s kids movie, such as The Goonies, Sandalot, ITWhat's more good about this movie is the way that it keeps its authenticity. I did not feel ever feel if the movie was losing it's plot, every scene and every thing is relevant. After such a long time ive enjoyed a movie, and yes we need more movies like this in an age of stupid high budget movies, and silly overhyped movies this one seems so underrated and massively denied by people due to the fact they're so ignorant to watch another teen horror movie."}, {"id": 104, "text": "The plot was quite predictable but it was fun to watch. Do not expect too much entertainment from this, it's just straight to the point no caption.10/10 because I watched it till the cast popped up yay!"}, {"id": 105, "text": "Everyone in the cast is good. Their acting and humor is applaudable.There is no big plot twist except for the part where the beautiful lady turned out to be the commander of vampires (this one is also quite predictable)However, the simple storyline was executed perfectly making this film one of the most entertaining to watch during this quarantine."}, {"id": 106, "text": "Fun light hearted film. Solid vampire lore. And the concept of gentrification being vampiric is great. Any deeper exploration of this metaphor could have ruined the fun adventures tone."}, {"id": 107, "text": "This is definitely meant for a young crowd but that doesn't mean it's not entertaining. It's mainly carried by the charm of its trio of protagonists. The vampires are silly cliches, but in an odd way that makes this more enjoyable. The choreography in the showdown could've been better, but this isn't a high budget affair, so it's no big deal.The reviewers calling this racist are just trying to stir up issues. It's not racist unless you're a vampire."}, {"id": 108, "text": "If it wasn't for the kids, this film would have been a complete disaster!Im not going to comment on the white vampires as people are stirring about it but i will take this movie for what it is and thats a vampire flick."}, {"id": 109, "text": "Ok, once you can get past the gentrification, White people bad, etc., it's an ok movie. Has some Lost Boys elements."}, {"id": 110, "text": "The tree main kids did a good job and made it worth watching. But the script and action scenes were clunky. Unfortunately this is yet another horror movie with an anti-white message. Always ask yourself what it would be like had they done it the other way around! - It would cause an outrage!"}, {"id": 111, "text": "You know how sometimes you sit down, and can't really commit to anything. This is what you watch. Bit funny, some B grade, some alright effects, and it doesn't take effort to watch. I actually enjoyed it, and it was just what I needed when I didn't know what I wanted to watch."}, {"id": 112, "text": "Really enjoyed this. Reminded me of 'Attack the block'"}, {"id": 113, "text": "Why they add annoying characters like they are funny. That blogger with her stupid finger snapping and corny attitude ruin the whole thing. Seriously if they didn't have her would have been a chill movie. This world we live in"}, {"id": 114, "text": "But it ended up being just ok. Not really original at all. They copied and pasted a lot from classic vampire movies. Some of the characters were funny but the clear anti white stance the film took made it pretty lame. If the script was flipped and it was a bunch of white kids fighting vampires of Black or Latino backgrounds to keep them out of the neighborhood I'm sure there would be a lot more people upset."}, {"id": 115, "text": "It presents us with a very simple plot, although it has very funny and epic moments."}, {"id": 116, "text": "I hope they had permission to use the numerous similarities to The Lost Boys: 4 male vampires - leader with long blonde hair. Similar vampire makeup. Vampires hanging from the ceiling. Three young male heroes. It was cute. Sometimes funny. Ok for a Netflix movie."}, {"id": 117, "text": "Basically a rubbish copy of the British film Attack the Block."}, {"id": 118, "text": "It's a nice little cool vampire flick. Just plain fun and campy. It would've been a good series to explore more the story, but as a one off comedy it is alright. Imagine Stranger Things but with vampires. Too bad it ended right when it got interesting."}, {"id": 119, "text": "Not a scary vampire movie. Instead a somewhat relaxed vampire story that could have been much more but a strange feeling of a good sunday rainy afternon movie. It lacks some complexity and its obvious that money went out somewhere during the making. But it fits the purpose. Some comedy, some adventure, some suspense, no terror at all."}, {"id": 120, "text": "A group of kids from the Bronx, fights to save the neighborhood from a very peculiar group of real estate speculators (yes, they're ampires).It does not try to be more than what is expected of it to be, which means, it's a film for pre-teens that serves as an introduction to the youngest to the Horror genre.It has more weakness points than strengths, especially the acting and the final part, where everything is too predictable and without anything that makes us support and cheer the main characters to be the winners and saviors. Talks about the problem of gentrification and social and racial issues, in a light way so that it is easily understood by the target audience (kids/pre-teens)."}, {"id": 121, "text": "I would rewatch this but as one of those guilty pleasure movies that are bad, corny, or cheesy, I had some fun with this."}, {"id": 122, "text": "And speaking of saving the neighborhood, what's up with all these missing persons flyers?I fully understand what this movie is going for. And I'm all for nostalgia style movies. But I couldn't get behind it. We're not supposed to take it seriously with how cheesy it is. The movie is mainly a comedy. I just couldn't get invested enough to give the movie my full attention. Maybe someday I'll appreciate it but for now it's just ok."}, {"id": 123, "text": "Murrau real estate in buying up shops in the Bronx. The firm is run by vampires who make generous offers and then kill the owner once they sign. These are classical style vampires. Some young boys accidentally discover the vampires and no one believes them.This is a fun film. Amusing. It appears to catch the flavor of a small neighborhood and goes easy on the rough stuff. Even the gangbangers are not that bad.Guide: No F-word, sex, or nudity."}, {"id": 124, "text": "This is very middle of the road and with 5 minutes spent tweaking the script could have been a modern classic the likes of Attack the Block.The ending was abysmal and like many movies these days felt like they had no ending and cobbled together any old rubbish to finish it.Lots of bad writing and silly errors like explaining a vampire familiar to each other despite having watched Blade which literally has a scene explaining what a familiar is so they would have known what that is already.This could have been a really great monster squad meets the lost boys meets attack the blocks adventure for the 21st century and it didnt deliver. It's an entertaining watch if stuck for something to watch with your teenagers but not much else."}, {"id": 125, "text": "I thought the story was pretty nice and it will come true .... but the film was really not a horror for me. the cast is well done. Too bad but the movie could be much better, for example really how a vampire sucks a human his blood and you see the blood. I really didn't see that. therefore 5."}, {"id": 126, "text": "Well, I stumbled upon this 2020 movie on Netflix and of course had to sit down to watch it, given it had vampires in it and seemed like a horror comedy.And I must say that Vampires vs. the Bronx, while not being a sound work of genius like Shaun of the Dead or Lesbian Vampire Killers, definitely turned out to be entertaining, albeit a bit too generic. So writer and director Osmany Rodriguez definitely managed to churn out something well-worth watching.The storyline in Vampires vs. the Bronx is pretty straight forward; a nest of vampires take up residency in the Bronx and seek to overthrow the neighborhood and take control of the humans. But a small group of teenagers, that no one believes in, take up the stand against the immortal undead bloodsuckers.It should be said that the special effects in Vampires vs. the Bronx were good, and they definitely brought a great deal of enjoyment to the overall feel of the movie. And I did like the design of the vampires, as they were kept sort of a mixture of bestial and the traditional charming, romantic archetypes.As for the acting in the movie, well I weren't really familiar with anyone on the cast list, so that was definitely a plus for me, as I enjoy watching unfamiliar talents on the screen. And I will say that the actors and actresses in the movie were definitely putting on good performances; not award-winning material, but good enough.Vampires vs. the Bronx is definitely a movie well-worth sitting down to watch. It is a horror comedy that aims towards both a younger and mature audience alike, so there is a little bit of something for almost everyone in the audience.There were some nice references to the likes of the Blade movies and Bram Stoker to be seen in the movie as well.I am rating Vampires vs. the Bronx a six out of ten stars. If you enjoy vampire movies with a bit of fun in it, then you should take the time to sit down and watch this particular movie. While it hardly will become a vampire classic, it is definitely a movie worthy of a place in the vampire collection."}, {"id": 127, "text": "As some who feels the need to watch every vampire movie created. This is a long way from being good.Is it a horror movie? there is no horror. Is this a kids movie? Not enough to hold their attention. Is this a thriller? Not enough of a thrilling nature.There seems to be a lot of unwarranted 10 and 1 in these reviews. Which I feel doesn't balance out this movie. Plainly it is a boring hum drum affair.I take issue with comparisons here, mentions of:The Lost Boys(TLB) No this is not fit to lace the boots of TLB, no style, no decent music, none of the flair. Vampire Vs The Bronx(VVTB) is at best a late in the series TLB movie, where all of the decent story has been trimmed out.Attack The Block (ATB). I can see some comparison, but it even lacks some of the tension of that movie.The Monster Squad (TMS) No no no at least TMS had some identifying qualities and appeal to it. VVTB has none of this.This isn't even as good as some of those really ropey, so bad it's good vampire movies like for example Vamp.I'm surprised at Netflix pouring money into this slop with its unoriginal, see it coming from mile away, mundane drivel. Not enough jokes to be funnt, not enough horroe to be scary, not enough style to stick in anyone's memory. Do not bother unless you have seen everything else on Netflix"}, {"id": 128, "text": "As I was made to watch this work against my own will, I was consequently hostile towards it all the way through. Looking back, though, I'm rather sure I would've been hostile to it either way.Vampires vs. The Bronx is the story of three friends and their crusade against the vampires who try to invade, you guessed it, The Boogie Down Bronx. This premise is enough to inspire a few laughs; the execution, on the other hand, is so cliched and lifeless that any humor beyond a few generous chuckles. At that.The aforementioned three friends are Miguel Martinez (Jaden Michael), Bobby Carter (Gerald Jones III), and Luis Acosta (Gregory Díaz IV); Bronx kids who spend their free time at the skate park or the local bodega, ran by the beloved Tony (The Kid Mero). Everyone's disturbed by the neighborhood's rapid pace of gentrification... the sudden appearance of white faces and businesses in el barrio is enough to keep everyone's mind off the frequent and mysterious local disappearances! The hand behind these disappearances, as well as the gentrification, are of course the titular vampires.These vampires are white, pale, blonde, vicious, and did I mention white? How SUBTLE.Ugh! I can go on, but why the hell would I? I have nothing against woke horror (I quite like Get Out), but this was just miserable. I will just say I have not been quite so tremendously disappointed about a movie in a long time.(P.S. Coco Jones, in her supporting role as Miguel's love interest, Rita, is a bright spot.)"}, {"id": 129, "text": "I enjoyed this fun little Netflix movie that is a Horror Comedy &amp; is a mix of the Classic 80's The Lost Boys &amp; the British Sci-fi Horror Comedy, Attack The Block.Vampires VS The Bronx is a nice feelgood street smart urban Comedy with a Supernatural twist of Vampires gradually taking over a very downtrodden &amp; half forgotten about part of The Bronx &amp; it's up to 3 local neighbourhood kids to stop the invasion &amp; save the Bronx. The kids are all really nice &amp; cool dudes &amp; the performances are fine &amp; often funny but never over the top or annoying &amp; in fact the kids here are nicer than the Hood thugs in Attack the Block!!! There's definitely similarities to that Block film &amp; definitely similarities to Lost Boys but put together really nicely like a homage to those Cult flicks that came before it. I loved the look of this film, the cinematography is lovely &amp; very atmospheric with mist &amp; the use of red &amp; green glowing lights &amp; Neon signs that make it feel very Retro &amp; i loved it. The Bronx is an Awesome setting for a Vampire invasion &amp; the rough, gritty urban streets reminded me of another 80's Cult Vampire flick called VAMP starring Grace Jones &amp; that's really cool. There's a nice sense of community here too &amp; it's drenched in a feel of the spirit of helping each other &amp; not giving up, fight for your community &amp; work together but it's never sickly sweet or too sentimental. It was so cool that the kids watch Wesley Snipes' BLADE for inspiration on how to take out Vampires &amp; the Vampires themselves are pretty damn cool looking with their modern-gothic but trendy look &amp; very 80's Vampire face when they change again like Sunderland in Lost Boys look. There's hardly any blood or gore but it's a kids film really &amp; that's fine because it's full of atmosphere &amp; mood which i loved. The night time look of the urban streets are lovely &amp; i liked the Nest building where the Vampires hide during the day &amp; it all plays out really nicely, nothing Amazing but definitely a really Cool little flick with an 80's vibe &amp; a great cast that are all good.A really entertaining &amp; fun Comedy Horror"}, {"id": 130, "text": "Miguel li'l Mayor, Luis, and Bobby are three life long friends seeking to save their favorite hangout, Tony's Bodega, from encroaching and predatory real estate developers Murneau. The Three soon discover that Murneau is a front for a coven of Vampires and when they become aware of a plan to take over the Bronx the fight for surival ensues.Vampires vs. The Bronx is the feature film directorial debut for TV director Osmany Rodriguez, known for his direction of A.P. Bio and SNL. The film is a very strong showcase that manages to balance it's horror and comic elements reasonably well, even if there are occasional snags in the material.The film is very good at establishing its characters with Li'l Mayor, Luis and Bobby played with genuinely good performances and chemistry by Jaden Michael, Gregory Diaz IV, and Gerald W. Jones III respectively. The film also has a talented supporting cast with Tony, played by The Kid Mero, serving as a likable mentor like figure to the boys and Father Jackson, played by Method Man scoring some well earned laughs as an overly serious neighborhood priest. The villains are also well played with Shea Whigham's sleazy developer Frank Polidori serving as an effective boo hiss/villain and the vampires are played quite well by their respective actors. The movie plays like a mixture of Fright Night with Wes Craven's People Under the Stairs, much like the latter movie the movie deals with gentrification in a similar fashion to how Craven approached the topic of Slum lords, and despite being a bit broader in terms of its satire it does manage to effectively convey its point while still being an effective horror comedy.Unfortunately Rodriguez runs into problems when filming in dimly lit indoor areas, one sequence involving an abandoned courthouse is viewable maybe 60% of the time without much issue, but the remaining parts are difficult to see due to the poor placement and adjustment of lights in the scene. Luckily this isn't that recurring of an issue, and there's at most two other scenes with this issue. Some supporting characters I thought were also rather underdeveloped. There are two female characters, Livestreamer Gloria Glo and Haitian-American Rita and while Glo does have some level of character, her presence doesn't really affect the plot and we're never given a good reason why we give her focus. Rita seems like she'll be fighting alongside the boys, but despite knowing of the vampires when no one else believes she's mostly irrelevant for the majority of the movie with her only contribution being delivering a message. Certain sequences also stretch suspension of disbelief, including a sequence where Li'l Mayor seems ignorant of every facet of vampire lore despite vampire movies existing in universe. It's a very clunky scene that isn't all that funny and grinds the pacing to a halt, but luckily the movie is a brisk sit at about 82 minutes and it never lingers on any one scene too long.Vampires vs. The Bronx is a entertaining and promising feature debut from Osmany Rodriguez that hints bigger and better projects down the line. While not every joke lands and certain sequences and characters lack a certain amount of polish, this is a fun well paced horror comedy with a nice satiric bite(no pun intended)."}, {"id": 131, "text": "A few nights ago I watched The Lost Boys, I had forgotten just how amazing a film that was, so I had vampires on the brain.Vampires Vs The Bronx doesn't exactly register on the scale as a Vampire film in the conventional sense, it lacks any real horror or gore, but as the central characters are three kids, you need to be reasonable with your expectations.It deals more so with gentrification, ordinary people being squeezed out of their neighbourhoods by wealthy developers. It's always greed that's the motive, only this time it's not money that's craved, but blood.Some good bits of humour, the overbearing mums are all pretty funny.The kids are really good, their acting is very good, I really did enjoy Method Man as Father Jackson, and The Kid Mero as Tony.So long as you know what to expect, I would say it's a fun watch. Nothing heavy here, just some fun, 7/10."}, {"id": 132, "text": "A group of young friends' dedication to achieve what they believe despite everyone's objection. The movie has lovely moments, interesting and exciting elements and very good acting, especially from the boys. The neighbourhood is alive and vivid. There are tons of references to other movies and all put a smile on my face. Most of the effects are surprisingly good too.There is also a deep lesson, a resemblance to the real world. How the good guys and the bad guys actually go through the same things is shown beautifully and simply.I loved it and would recommend it to anyone who wants to have some fun time.EDIT: As I was reading the other reviews, I saw a good number of them claiming the movie was racist. It is NOT. There are good black people as well as bad black people and the total number of white people are less than the fingers on my hands, which makes it scientifically ineligible to be taken as a statistic. I guess the people are so used to seeing the white guys saving the day that they find a bunch of black kids as heroes racist."}, {"id": 133, "text": "This film I found entertaining, it was never overly played like you'd expect it to be. Combines a great coming of age film with some horror elements, not to mention putting also mixing real life issue without being too preachy. Three friends from the Bronx make a shocking discoverer that vampires are in there neighborhood, and have sinister plans for it. Knowing that nobody will believe them, the boys must get evidence to back them up before it's too late. The three young actors do have great chemistry, you really buy that they are all good friends, and it never feels forced. Also the ones playing the vampires are great too. Not for kids under 13, this is a film to enjoy for Halloween, never tries to anything more."}, {"id": 134, "text": "Let me get this out of the way right at the top: This is, at points, too light-hearted for its own good.The execution is a bit ham-handed, and largely dispenses with the gore one might expect from a vampire movie. The running commentary on the narrative's events by one of the supporting characters, in the form of live broadcasts on her phone, is a gimmick that sours quickly from amusing to obnoxious. Given too that the protagonists are very young teens, one is reasonably led to wonder if this was produced by Disney for a teen audience, especially (unfortunately) during the ending scene when all are very giddily self-congratulatory about what they've done.If you can get past the cutification of horror, this is otherwise a fairly solid movie. The plot is decent, if familiar, and the cast is quite capable. The obvious social commentary of the premise is admirable, and important, but isn't delivered so forcefully that it overwhelms the rest of the film. This is clearly geared toward a younger general audience: There's enough tension and suspense to keep the narrative going, but above all this is more fun than scary. As if to emphasize the point, the protagonists watch Wesley Snipes' 'Blade' to educate themselves on destroying vampires.Not bad--not bad at all. Again, my main issue with it is that the content is otherwise defanged in an effort to expand its palatability, but even at that, it's strong enough to float by on its own, and there's something to be said for creating stories that everyone can enjoy."}, {"id": 135, "text": "This little film appeared out of nowhere on Netflix. It didn't cause much of a stir, and I initially saw many reviews comparing it unfavorably to Attack The Block, which is one of my favorite horror films of the last decade. And while those comparisons can be a bit much, the two films do share quite a bit in common. Both are tales of ethnic kids fighting back against supernatural intruders in their communities. Whereas Attack The Block saw aliens invading UK projects, this one, obviously, sees vampires taking on The Bronx. One of the film's only original touches is using the pasty-white creatures of the night as metaphors for increasing gentrification, and the film is at it's best when wittily observing that comparison. It does have some loveable characters, and a few genuinely funny moments spread throughout. But the more the film wears on, the more derivative it becomes of other vampire flicks. It doesn't seem to know what to do with it's more horrific elements, which leads to some crumby CGI effects and goofy battle scenes. It's a shame, because there was certainly some potential here, and the young cast members are charming and likeable. But this is a generic, somewhat aimless film at the end of the day."}, {"id": 136, "text": "Here's a little nice spooky movie for the kids during this Halloween Season and not just for the kids but for the grown ups asl well.The movie is about a group of friends who live in Bronx , NY who are fighting to save their neighborhood from A cooperation moving in. Specifically their favorite bodega. The cooperation is also happen to be run by vampires. The movie starts off by a lady selling off her nail salon to some strange businessman after some blonde dude sucks the blood out of them. The movie is sure interested taking horrors of gentrification and white supremacy. The vampires of the movie are a metaphor for these kinds of people. They are just trying to sink their teeth in and suck up the blood of all these poor neighborhoods.If, you like the show Stranger Things you will sure like this. It's like  Stranger Things but with vampires. It's funny, spooky, Another must see for this Halloween Season!"}, {"id": 137, "text": "Trying to save his neighborhood, a kid from the Bronx and his friends come to believe that the series of incidents organized by a real estate firm buying up the properties is a clandestine operation by a vampire coven to move into the neighborhood and race to stop them to save their homes from the creatures.This was a pretty enjoyable kid-friendly genre effort. One of the strongest aspects here is the fun setup here that brings everything together in a charming manner. The way in which the vampire swarm is shown taking over the neighborhood from the inside by looking like real-estate developers while slowly worming their way through the community is a fine method of doing things. The entire system of doing this alongside their efforts to safeguard their community that goes alongside this plotline, it allows for a rather warm and engaging setup with the idea of the vampires coming in and taking over while they're going around trying to save everything that sets the second half into motion. As well, there's quite a lot to like here with the actual battles that emerge from this setup. The series of enjoyable ambushes throughout the first half where they come across their victims unexpectedly for some fun shock scenes, while the brief bits of their early scenes confronting the series of vampires in the few areas in the neighborhood are enjoyable enough to get a sense of fear from the creatures without putting too much tension into the confrontations. Once it gets to the kids finally having their big series of encounters and putting the traditional vampire-slaying qualities to use, there's quite a lot to like here as the different locations and tactics take on solid action and enough thrills to get itself across in the kid-friendly style. These offer up quite a lot to hold it up overall. There are a few minor flaws to be had with this one. Among its more noticeable efforts is the rushed feeling that happens when they introduce the friends to his vampire scheme. Rather than deal with trying to prove to his friends that what he saw was real, this thankfully goes the route of having them jump on-board almost immediately yet that now highlights how underwritten this is since there's almost nothing to grab onto at that point. It's basically an unproven eyewitness account that's brushed off without incident and a chance meeting at the grocery store which is a fine way to signal something going on but not at the stage where something has actually happened to warrant that. This, combined with the boundless cliches apparent in the storyline, might be somewhat problematic but not truly detrimental.Rated PG-13: Mild Violence and Language."}, {"id": 138, "text": "Think the Warriors but without any gang fights or running through the night. Think Buffy but without the Cheerleaders Think The Wanderers without The Wandering Think Rumble in the Bronx but without Jackie Chan and the karate bits Think Underworld but without the fights Think Boyz N The Hood but without the powerful message. Think Juice but with added fangs. Think Hotel Transylvania but less scary Think about why I actually watched this. Think how desperate I must have been for good films. Think that I'm willing to give anything a go.You better think (think) Think about what you're trying to do to me Think (think, think) Let your mind go, let yourself be free Let's go back, let's go back Let's go way on, way back when I didn't even know you You couldn't have been too much more than ten (just a child) I ain't no psychiatrist, I ain't no doctor with degrees But, it don't take too much high IQ's To see what you're doing to me You better think (think) Think about what you're trying to do to me Yeah, think (think, think) Let your mind go, let yourself be free Oh, freedom (freedom), freedom (freedom) Oh, freedom, yeah, freedom Freedom (freedom), oh oh freedom (freedom) Freedom, oh freedom"}], "reviews_amount": 139}