{"name": "The Cleansing Hour", "titleId": "tt08009906", "reviews": [{"id": 0, "text": "This is one of the better straight forward horror movies of recent times. It is what it is and doesn't pretend to be anything else.The story and production are solid and the acting superb.Well worth watching if you are a horror fan."}, {"id": 1, "text": "You have to give this one points for originality. I think with a slightly larger budget this could have been a 10 out of 10 but damn it didnt stop me from enjoying this movie. Acting was outstanding and the story that pacing was perfect. There's a million possession films that have been done to death but this breathes some new life in a way that I havent seen since Emily Rose. I will definitely be recommending this one to other horror enthusiasts. God damn you gotta give a round of applause to the director and cast. I was really worried this one was gonna get real campy and the cliches would start rolling but once it gets going it doesn't let go of you."}, {"id": 2, "text": "Quite gruesome just the way I like it. I really enjoyed. Started out a bit slow and bad acting but the movie and the acting got a helluva lot better. Alix was brilliant as the possessed. Absolutely loved it."}, {"id": 3, "text": "Great cast. Started off well. I loved that thing in the alley. Where the horror experience went wrong for me was that the possession was like full on exposure- there was no creepy mystery to it. Initially the voice and appearance were very effective but I want haunting snippets of that horrible old woman voice to send a chill down my spine. Not full, direct conversations with it as it loses its scare factor."}, {"id": 4, "text": "Loved this movie. It was entertaining all the way through. Wasn't slow in any way and it delivered the story. Acting was only decent but make up, costumes and CGI was great. I definitely recomend."}, {"id": 5, "text": "Not your typical run-of-the-mill horror story. This one has substance and great special effects. Acting was average but still was effective. Recommended!"}, {"id": 6, "text": "When i am out of popular horror movie titles to watch i always resort to as what i call Failsafe horrors.The term reffers to promising(in my taste) movies under 1000 reviews on IMDB. I have to say i wasn't expecting much from this movie but it actually kept me glued to the screen. Beginning is meh-in a sense like all these horror films start with the same story, mid-movie was great and the big finale was WT?!? All in all i have to say it was worth watching and i really enjoyed it!"}, {"id": 7, "text": "Compared to most of the horrors You see these days, this one delivered. Decent acting, CGI pulled off right and a compelling story line. Most importantly, it had me watching with constant entertainment. With no big names or high budget marketing, this movie really did surprise. Heavily recommend it for horror fans."}, {"id": 8, "text": "This is a really great movie! So much better than I thought it would be. Don't allow the terrible poster art to put you off. The acting is good, the practical make-up effects are outstanding, the little bit of CGI used is not too obvious and the stunts are cool.The ending to the film is really clever. I like the way they overlay a sort of epilogue over the credits. It is a nice touch.A definite 8/10 from me."}, {"id": 9, "text": "This could have been an interesting story about an internet Exorcist who has to confront a real demon. Instead this movie is so poorly directed, edited and put together that you won't care about any of it. The acting is bottom of the barrel and so many lines are mumbled or spoken so quickly I had no idea what they were babbling about. There is nothing suspenseful or frightening in the least. It's poorly filmed nonsense. The most interesting thing in the movie is the excuses they come up with to get Ryan Guzman out of his clothes. Yes this is a horror movie where the only fascinating thing on display is Ryan's derriere. 2 stars for side-butt."}, {"id": 10, "text": "But there are so many out there flooding the market that just blow. Bad story, bad acting or both. This to me was better than the majority I've seen and that's why I scored it the way I did. Yes I've seen some better ones and scored them higher. But sadly not many. I liked this one, it was entertaining and stuck with me a little bit after the movie was over. That's all I can ask for."}, {"id": 11, "text": "Why would anyone complain about this movie? Unless you're jealous or need attention there is nothing negative to say about this film. The camera work, editing, costumes, directing, and special effects were awesome. The story-line stayed to its guns and produced a suspenseful film worthy of a good Friday night viewing.Take my word for it as a movie lover, this film has merit! Enjoy."}, {"id": 12, "text": "I dont review movies. this one actually turned out to be pretty good. and it had some seriously dope cg and a strong message! it actually gave me chills thinking about it. im actually high too so i dk if that adds to the factor but i take my demons pretty seriously and if you didnt get it that was Lucifer himself and he played every single one of them! and they gave you little easter eggs through out the movie and you actually would have to put it together to understand the context. and i got that! bravo zulu guys!"}, {"id": 13, "text": "I really don't get all the negative reviews. The film is technically well made, the acting is solid and it keeps you involved in the story. It doesn't slow down and there's even a satisfying twist. This is NOT your typical possession movie at all."}, {"id": 14, "text": "I thought this was a great exorcism movie, considering the genre has been done to death. Yeah, pun intended! Good special effects, good acting, and good story, I was entertained! The Cleansing Hour was much better than what I had anticipated... yeah!"}, {"id": 15, "text": "The film is entertaining and honestly overall an awesome night in. Its well shot, directed and edited who ever thinks otherwise is a jealous moron. It will scare you here and there people."}, {"id": 16, "text": "Films starts with a good solid Grade B horror film with black humor and lower production qualities (but just below a top production). Then it becomes serious, sort of. It doesn't quite lose the silly elements completely, but the shift to more serious horror possession turns sour as it clashes with the previously established lighter elements. The conclusions tries to do something more with the film. Unsuccessfully. Not horrid to watch, but it became tiresome as it unfolded."}, {"id": 17, "text": "Happy horror fan here))) Traditional premise,modern interpretation!Small production makes a huge horror! Who knows,maybe we will have next Wan in this director!"}, {"id": 18, "text": "This had some interesting and unusual ideas where as this theme has been done before. You wanted them to win and defeat the evil. It was also nice too see Good win for a change....sort of"}, {"id": 19, "text": "Totally thought this would be super campy and corny. At first, yeah and I got a huge kick out of the comments during the live stream. Sooooo did not expect it to turn into what it did and ended up being so glad I watched it. It's been forever since I've been this surprised by a movie like this that I had to give 10 stars. Seriously loved it and some of those twists I honestly did not see coming. What I think added to my enjoyment and shock value is the way of the world right now. Couldn't have been more perfectly timed for Halloween 2020."}, {"id": 20, "text": "I did not expect that a 'B' movie would be so good, but it's original and the special effects were on point. The story line was consistent and believable. You will not be disappointed. A Shudder subscription is worth it!"}, {"id": 21, "text": "Live-streaming has replaced found footage as the new genre fad. Because its relatively new to the scene, many are surprisingly well-done and innovative. Standouts include Host, Cam, and Guns Akimbo.The Cleansing Hour does a decent job live-streaming the exorcism sub-genre. Striving to be more fun vs. scary, it is an enjoyable watch with surprisingly good special effects (both practical and CGI). Unfortunately, it veers from fun with feeble attempts at drama with an unneeded backstory.If you can forgive this sin, you'll have a good time."}, {"id": 22, "text": "'The Cleansing Hour' updates exorcisms for the YouTube era. It tries to do something different with the exorcism movie tropes but for the most part it fails to avoid all the exorcism clichés. However, it is a thoroughly entertaining ride, combining timely social commentary on online fame and violent media with the creepy atmosphere of a good thriller."}, {"id": 23, "text": "That was grade A certified trash. It had some of the worst cgi and some of the worst voice overs I have ever seen"}, {"id": 24, "text": "Oh, Cleansing Hour, how I loathe thee. Let me count the ways. 1. Horrible film school acting. 2. Pathetic demon possession script. 3. Amateurish production. The reason I gave this a '2' instead of a '1' is because I actually tortured myself to its predictable conclusion. This is film school writing at its best, meaning average. I wish the actors and filmmakers better luck in the future. If this cliched tripe of a film doesn't create that, well, blame the director."}, {"id": 25, "text": "The best things in this movie is the every part of its getting intreasted while watching,outstanding acting and good Special Effects. Enjoyed alot after watching this, Movie also gives good moral. I fully Recommend this movie, Dont watch it alone if u dont have brave heart, Loved it"}, {"id": 26, "text": "This is so much more than a pleasant surprise. The story and concept had me doubting that this film would and could be successful. I was so wrong for my doubts. The writing was solid. After watching the film you can't imagine any other actors other than those on screen playing their parts. Meaning the acting and actors put this film over the top. Finally the director and production staff managed to create one of the best horror, exorcism, demon, supernatural flicks to hit the screen in the past 20 years or more. This is an instant cult classic. Damn I'm impressed!"}, {"id": 27, "text": "It's interesting, pathetic really, that so many people in the world, lacking intelligence and inability to think for themselves, propel charlatans to Christ-like figures, the chosen ones in the flesh. This idea has been front and center in the news lately because of the coronavirus's unfettered spread through South Korea where a doomsday cult - the Shincheonji Church of Jesus led by Lee Man-lee - has more than half of the infected which, of this writing (2.22.2020) numbers 430. That people allow themselves to be manipulated because they're looking for a ray of hope is understandable, unfortunate, but understandable. The Cleansing Hour exploits that premise in spades, gaining views for their sham webcasts by brainless subscribers. In that sense, the movie works. What fails it though, is the lousy acting by everyone involved, especially the lead. As an exorcism film, there isn't anything new to see here, just more of this and more of that. Too bad. At least the premise was interesting."}, {"id": 28, "text": "Excellent movie. Love how social media could cause something like this."}, {"id": 29, "text": "I watched this based on the reviews. I dont know what those people were watching. This movie was dreck. Poor acting, blah story, clichéd, not one bit scary. The only saving grace was the actress who played the possessed woman. I generally am content to watch just mediocre horror movies for a fun romp but this one was so bad I am angry that time is gone...could have spent it on another movie."}, {"id": 30, "text": "This is a really good take on the possession genre which these days is filled subpar films with old and rehashed ideas. If you like supernatural horror you'll love this.The end twist is interesting as well and totally caught me off guard."}, {"id": 31, "text": "This is a really horribly made film. Don't waste your time"}, {"id": 32, "text": "Sure, I guess that's not much to go on here. I watch A LOT of horror and really really miss and appreciate when someone puts the time and effort into their FXs.If we're rating on story alone, I'd probably go with a 4/10 😬"}, {"id": 33, "text": "This movie was so much better than I had anticipated. Aside from some silly looking demons and effects, it's entertaining, the acting (especially from the main actress) is on point and it has an interesting plot. Worth watching for sure."}, {"id": 34, "text": "Honestly I haven't ever before been as confused whether I liked a movie or not as I was with this. In the end, the answer was yes, I did like it. There are plenty of questionable moments here, even poor acting at certain points. The low budget has hurt it quite a bit, but it's a movie that keeps getting better as it goes on, so if you feel like you're wasting your time like I was early on, I suggest you stick with it and you won't regret it."}, {"id": 35, "text": "It's never going to be the exorcist, it's a bar that was set years a go and it was a new and magical movie. Now every movie about the devil or demons gets compared to it. I judge based on entertainment value, and this movie was entertaining, decent story, nice twists, decent acting, decent special effects, basic cinematography, but overall a must watch for any TRUE horror fans!!"}, {"id": 36, "text": "Speaking directly to horror fans..its not scary..You've seen it before. You've seen it done better. I will say that the main character does a hell of a job and carries the film. There is a twist at the end but it was a bit too random.. nothing that'll make your jaw drop. Still, a pretty cool way to end it. Bottom line: It won't keep you up at night and you'll likely forget about it by next week. It is, however, a solid option if you're into possession movies. If not, skip it."}, {"id": 37, "text": "This movie was awesome! It had a great mix of jump scares, predictable and not, as well as some very interesting plot twists. There was also a bit of low-key social commentary (trumps Twitter) and sass mixed into it that made it even more of an enjoyable watch. The pacing of the movie was also very good, it didn't waste half the movie trying to build up to one scary moment as many horrors do. The editing in some small parts and the dubbs were a little off, but the effects in the more major scenes were phenomenal."}, {"id": 38, "text": "I have never personally written a review. This movie has a great cast. A great story. It will not disappoint! Give it a watch!"}, {"id": 39, "text": "Fun, gruesome, unsettling, crazy! Brilliant Horror!! After rewatching this and thinking about it further, this goes hand in hand with what is going on in the world now with social media and how ridiculous and far people will go to get those views and likes. I really love this movie! The reality of it... not so much."}, {"id": 40, "text": "I wanted to have something on in the background while I worked on a project and found myself having to put the project off for a little bit. While the movie isn't scary, it is suspenseful, entertaining and fun, so I was drawn in to the action pretty quickly. I love horror and I love trying to figure out endings, even more so when I can't figure it out like with this one. Solid fun!"}, {"id": 41, "text": "Very good take on the standard exorcism flick. The lead actress does a great job flipping between human and demon, and the two male leads deliver fine performances as well. The plot has some holes, of course, but if you can ignore those and just go with it you'll have a good time. One of the scariest parts is the footage over the closing credits - with just 6 days to go until the election in the US, it feels like a preview of news reports we'll be seeing a week from now."}, {"id": 42, "text": "Had no expectations, a was completely surprised at the quality. Great/solid scarey movie. 'Nuff said"}, {"id": 43, "text": "Not really sure if this is a true horror movie but it is entertaining. Definitely a good B movie tho. I think it's definitely worth a watch. Want really a dull moment. Had done laughs and scares. 👍."}, {"id": 44, "text": "Is it scary? No. But it is entertaining. I've watched a million movies classified as horror and I've seen some really bad ones. This one isn't awful. I enjoyed it."}, {"id": 45, "text": "I actually enjoyed this, it wasn't boring at all. Kept me interested all the way through trying to figure out what was really going on."}, {"id": 46, "text": "Wow! I don't really have the words to properly describe this movie, other then to say WATCH IT!!!I'm not big on exorcism related movies, but this is the best horror movie I've seen in a while! Interesting storyline, lots of action, decent special effects, gore, an ending I didn't see coming and Kyle Gallner. Who did a wicked job of playing Drew btw.Just watch it. If you like horror movies, you won't be disappointed."}, {"id": 47, "text": "I gave it a chance and it actually wasn't that bad come the end I'm glad I stuck it out even if it was cringe as hell at the beginning"}, {"id": 48, "text": "I just watched this film at the virtual Mile High Horror Film Festival 2020. I've watched a lot of exorcism movies, and from my experience this is the best I've seen. I found the acting to be more than adequate, and the plot to be significantly different from and more interesting than what I've seen in the past. It kept my attention from start to finish, and I thoroughly enjoyed it."}, {"id": 49, "text": "That movie is not that bad. Storyline is little boring, acting not the best but watched many worst movies . Big plus for makeups and special effects."}, {"id": 50, "text": "I had the pleasure of seeing the award winning short film that this movie is based on, at the 2016 Milwaukee Film Festival. And yes, the movie was awesome, with a great ending. I feel that the whole story was told and there was nothing more to add. It seems like a waste of time and money to make a full length feature that isn't going to add anything to the story."}, {"id": 51, "text": "Movie was Great.. actors doing pretty good acting.. especially the ending was good with some new concept.. Can these creepy ghost or devil , satan etc can interact with our wireless devices so answer is obviously YES.. this concept you will also see in this movie in the ending. I recommend watch this movie."}, {"id": 52, "text": "Shame on those that said it gets better after the horrendous start. May god have mercy on your soul"}, {"id": 53, "text": "Don't waste your time watching this thing, it has an absurd story and very bad performances."}, {"id": 54, "text": "The story is very creative and the ending is ironic"}, {"id": 55, "text": "!! NO SPOILERS !!This is really a great movie 5/5, the music and the demon in the movie is awesome, the storyline is little different and the concept is new, actors have performed very nicely. Lastly, the ending is definitely unpredictable, anyone who is a horror fan and has a good taste in a horror movie will love it !!!! GO AND WATCH IT :)"}, {"id": 56, "text": "Wow, this was entertaining, and not what I expected at all. Enough said by me..."}, {"id": 57, "text": "I dont know whos giving this decent reviews. Maybe just a bunch of edgelord teens but this movie is complete trash. In fact, it seems like a bunch of edge lord teens wrote this movie because its whole first half is just establishing I engage in sex and alcohol and Im not afraid to make sexual jokes about God. Im so super cool. I have many live stream followers and I rock. Very cringy the whole way. Non stop cringe writing. Movie is all over the place. Makes no sense. Hard to watch. I have yet to finish it it sucks so bad and I usually love most horror movies. It went in 3 different directions plot wise and not one of them made sense. Hated it. Awful. Gross. Seems like a home made movie. Dont bother."}, {"id": 58, "text": "This is one helluva ride! No, I have no affiliation with the movie before the morons start. I'm a horror fanatic and I'm left unsatisfied with most offerings but this is great. As both a social satire and a horror film, this nails it."}, {"id": 59, "text": "It starts off and you think Man this is going to suck but it really picks up.Well presented movie and the last few minutes had me going OMG!Well worth the time to watch"}, {"id": 60, "text": "If you like your horror films played straight, without any post modern post scream irony, then this is a decent way to spend an hour and a half. It goes down a very well trodden path, that of demonic possession, and takes it in a modern direction.The cast are great, the effects are OK, and the story is intriguing enough to keep you engaged and entertained.I would have given it 7 or 7.5 but I upped it to eight because it really is better than the average of 5 something it has on here.It doesn't deserve a ten but the 1 and 2 star reviews are just wrong. It's a entertaining bit of horror. Enjoy!"}, {"id": 61, "text": "Great story telling and good performance by the actor"}, {"id": 62, "text": "Went into this movie with zero expectations. Based off the trailer I thought it was just another exorcism movie. But the ending was unexpected and made the movie great. Overall very entertaining. Don't expect to be scared throughout, just watch and be entertained!"}, {"id": 63, "text": "It was really a good movie but the overall it was actually good"}, {"id": 64, "text": "Watch this movie if you can..You won't regret it.Great effects ,great acting"}, {"id": 65, "text": "I never have done reviews before and I always check reviews before watching a movie. This movie was amazing!!!!! Especially towards the end!!! It really gives you something to think about especially during the times we are living in during 2020, COVID and our current President."}, {"id": 66, "text": "Absolutely the best horror movie that I've seen in AGES. Actually sat glued to the tv the whole movie. I usually make it about 30 min or so b4 I start wandering around the house or messin on phone with any of these new horror movies. Great story line pretty cool twist at end. Loved the way the demon looked at end. The acting was good. Hope these people make many more horror flicks in the future."}, {"id": 67, "text": "At first when I put this on, I was having a case of dejavu, cause I swear I saw this same storyline before. Turns out I saw it was a short film with the same name starring Heather Morris (Glee) who also guest appearanced in this. It was a fun short film that I enjoyed, this one was a great addition into expanding that world. The cast had a great performance and I definitely got caught up in the excitement. The ending was my favorite part cause I was wishing it would go there and it did. It was definitely a nail biter and alot of fun to watch."}, {"id": 68, "text": "Ryan Guzman looks fantastic in this film. The long hair bearded Jesus thing is a great look for him.He plays a young narcissistic x-Priest. He and the other actors do a fine job in this romp.My one critique is that the big reveal of the demon possession is at about the 30 minute mark. The dealing with the demon takes up 2/3 of the movie...while not completely boring...it is a bit predictable.But, a scary, great, B-movie exorcism flick."}, {"id": 69, "text": "For A Low Budget Movie This Was Great The Acting Was Fine But The Scares And Practical Effects Were Great Towards The End Especially.This Movie Does Not Deserve Such A Low Rating At 5.7 That Is Insane Compared To A Lot Of The Bad Horror Films To Come Out Recently.This Film By Far Is Definitely The Best Demonic Possession Movie Since The Exorcist!!"}, {"id": 70, "text": "This was very well done, they eeked every angle out of the scenario without becoming tedious in the least. Taken as light fun and it's wonderful! Enjoy the show!"}, {"id": 71, "text": "This is the story of a fake priest who fakes exorcism scenes. The movie kind of starts when everything turns real in one of his fake exorcisms. I like the acting in this movie. In my opinion, Ryan Guzman was awesome in this movie. The special effect team did a great job. I liked the sound effects and background music. In summary, I recommend watching this movie to horror and exorcist genre fans."}, {"id": 72, "text": "As a fan of exorcism movies i was really desperate about the genre's downfall due to cheap budget movies, bad acting actors-actresses, funny make ups and cliche story lines. I expected the same from this one before watching. However this movie was surprisingly good compared to late time productions. Ofcourse there appeared some problems like cheap effects, funny creatures and non scary makeups. But after all i satisfied with the whole movie and enjoyed. I 'm not sure if it's because of consumed genre productions but overall i think it's worth to watch if you are a fan."}, {"id": 73, "text": "The Devil sure knows alot about modern technology, electronics and social network. It was a interesting idea for a movie, like they said mess with the bull, you will get the horns eventually, but why, pretty WHY with the cherrie on top would anyone make a movie where the Devil knows everything about social media and the internet, asking the people who watch to punch the heart icon to reach 100%. This movie would be much better if they kept religion and modern technology separate. Fake priest doing fake exorcism, because of that the Devil wants to punish him making him confess his sins, while everything is being filmed and live on the internet so people can see, tell me that's not better. The makeup and special effects were actually good, well filmed."}, {"id": 74, "text": "Whilst I would define this as a B grade film its the best of B. The Cleansing Hour takes a simple but well considered premise and builds a highly entertaining film around it.It amps up the excitement and horror, degree by devilish degree, even managing to build in wider plot elements, that cleverly leads to a satisfying ending.The special effects are nothing special but they are not dreadful either. The acting is above average for a film with this kind of budget. Its to the actors credit they do such an excellent job of convincingly carrying this decent little horror thriller.I say this quite a lot but I really think the future of entertainment is not big budget flicks but smaller studios and modest productions. They don't have money to burn, so they take extra care with the limited resources they have, to craft something worthwhile. The Cleansing Hour is one such example.7/10 from this happy viewer."}, {"id": 75, "text": "...I love it when this happens, you stumble upon such a true gem of a horror movie..and lets face it, these days thats a real rarity in terms of Hollywood's horror film industry.I certainly was not expecting anything at all when I chose to press play and watch this little horror film today. Many times, if not most times, I come to imdb and check out what's known about a film prior to me actually watching it. I didn't do that today, but rather went into it only knowing what I'd seen a few months ago in having watched what I assume was the original short horror film of the same name. I found the horror short film to be entertaining, and my only hope was that it'd not been ruined by someone in the industry taking over and adding a ton of filler in order for it's run time to be sufficient enough to reach full length film requirements.And just let me say, again, just how damn thrilled I am with this horror film. It truly has it ALL! Great storyline, great, thoroughly filled out characters(who you grow to care for, root for, and scream for when they meet their brutal deaths), excellent special effects, including tons of blood and gore to go around! I really could go on and on about all of the excellent qualities of this little gem of a horror flick, but I won't!I will simply say the minute you come across an opportunity to see this movie, do so! I would really love to see this film in a theater..its one where the audience would only enhance the experience as each viewers tension, excitement, and enjoyment would ebb and flow throughout.. Love it and am even shocked at myself giving this movie the rare 9/10(and Good Lord before the haters coming squirming out of every nook&amp;cranny I do not know a soul involved with this movie, or any other movie ever made).. I am just a die hard horror movie fan that absolutely loves when she stumbles upon a true diamond in the rough!"}, {"id": 76, "text": "This movie was a complete and total surprise. While the trailer was pretty well done and set the scene for the entire film, the end product was so well done, I really am shocked to see movies like this relegated to streaming. Everything from the direction to the acting was top notch, but it was the special effects took the stage and really brought this movie to the next level. Using a mix of CGI and practical effects, the film really does an amazing job of creating an effective and well realized universe.I haven't been entertained by a possession film in years. This is the first one in a long time that was so expertly executed, that it deserves to reach as wide and audience as possible. If you enjoy well done films that are visually striking, then this is the movie for you! Plus, the ending is one of the best endings I have seen in a Western film in a long time. Truly masterful work, everyone involved should be commended on doing an amazing job!A truly entertaining and well made film in every respect. It deserves high praise and any horror fan should give it a watch."}, {"id": 77, "text": "I was expecting a so bad its good movie .. kind of like an amateur-ish attempt at horror with bad effects, poor acting and run-of-the-mill story. What i got was a movie that both confirmed the bias/expectation and also exceeded it.The acting is below average .. there is little to no subtlety. It is a ride of extreme emotions and a bit of over-acting. There are non-essential characters that .. sadly are also treated as such (red shirts) - a stereotype that could have been averted without harming the plot.There is good .. what i think .. practical effects. and absolutely TERRIBLE!!! CGI that looks like it comes straight from the Playstation 2 (and i really mean it). This is especially sad because some of the practical effects are really, really well done. Had the director (or whoever decides that stuff) decided to use the lights/darkness .. and use practical effects (in that case silhouettes rather than to show everything..) it would have improved the movie significantly.There is good pacing .. in what is otherwise a predictable and simple story.The conclusion .. is a bit surprising - for the movie does not follow the usual tropes for an ending of that sort of movie.All in all, this movie is well worth watching"}, {"id": 78, "text": "I expected very little, and while it possesses not only people but also faults and cliches, The Cleansing Hour (a.k.a. The Devil's Hour) is a fairly entertaining and technically effortful exorcism horror romp.The filmmakers here take up the good old possession horror shtick, with stereotypes and all &amp; puts in our modern millenial all-internet world. A live-stream show about exorcisms, secretly a hoax, gets visited by an actual demon and the many confrontations can start. The story has layers, backstories, twists, but the problem with all that is that it all (including the characters) resembles seen and expierenced horror trappings, cliches &amp; has a pretty high predictability factor. Too much familiarity. In the end, The Cleansing Hour proves to be less original (in almost all aspects of filmmaking) than it might appear in the beginning. However, I wish to compliment them on the visuals - the camera work is dynamic and interesting enough, there's enough gore and various enjoyable fx, both practical and cgi, none of which stand out as bad or effortless. The movie has its action side, without which it'd be even lamer. As for the acting, I thought it's quite okay, assuring enough, on the background of many other imperfections.If I was you I would be weary of all the high ratings (and also the extremely low ones), The Cleansing Hour is sort of unique on the surface, but after spending the 90 minutes closely together with it, I can surely say that it's nothing much more than another mainstream take on the exorcism horror subgenre, just visually well enough done to appeal to the masses. My rating: 5/10."}, {"id": 79, "text": "I'm not as stingy with movie reviews as most people seem to be, especially with horror which is my favorite genre. Personally as a fan of horror I'm never expecting to be scared. I do want thrill, stress, excitement and emotions. The Cleansing Hour is one of the best scary movies I've seen in a while. The relatively low rating here has me genuinely upset because it's a top tier, high bar, exceeds expectation movie that incites every feeling from ugh, this is going to be stupid a few minutes in from the acting, then lol that was kinda funny before plummeting you into an internal nooooooo!. It really kept you hooked on how it's going to play out. For one, religious thrillers, mysteries, horror etc have been done. And done very well. Exorcisms &amp; demons are easy to work with, but it makes it that much more difficult to set a movie aside from the thousands of other movies just like it in the pile of eh, demons. The Cleansing Hour not only being the name of the webshow also plays into the plot. Lies, sins, confession, deception, greed, betrayal, fame and all that other good stuff is violently turned onto the show's stars, set staff and producers. The trend of live streaming and cancel culture, likes, views &amp; going viral is commonplace now and Incorporating that in with a good old fashioned possession was done seamlessly and skillfully. Moral and emotional struggles not only between characters, but within themselves produces a stress that's impossible to ignore for the viewer. All while leaving just the right amount of shock for the end. I'm just in awe of how good this was when in this day and age movies usually meet the already low expectations I have before seeing them."}, {"id": 80, "text": "What a pleasant surprise! Almost the entire movie in a room, with a premise from pranksters to reality that we have seen numerous time, so, I was not expecting to be so surprised by this.There are some parts a bit over the top (when Drew is confessing about the profits or after he knows about...something), but, overall, the acting was very good. Some people complained about the CGI, but I liked, it had a bit of that vibe of those 80s/90s movies we would rent on a Friday night and would surprise us (the movie, itself, remind us a lot of classics, like The Exorcist or The Omen). The pacing is usually a big problem on movies with a low budget in a single room, but here it works really well and the ending is perfect - one of the best endings I've seen in the last years and (will say it again) bringing back that nostalgia again. And those ending credits, oh man!Very curious to check what this Director will give us next."}, {"id": 81, "text": "The Exorcist is probably the greatest film of all time, and aside from maybe Emily Rose and Last Exorcism I'm not sure any other even half decent exorcism films exist.This then came as a total breath of fresh air. It approached the matter in a pretty unique way compared to most, and although it does get a bit over the top and crazy at times its all adds up to a really fun ride.The cast are decent, making what could very easily have been hammy dialogue fairly authentic, and for something with a presumably modest budget 90% of the times the effects are on point.I love that as a film it just doesn't hold back, everything it sets up or promises it delivers on, and as I've said, yes at some times that is crazily over the top, but it's also a worthwhile watch I'd recommend to any horror fan."}, {"id": 82, "text": "In a saturated field of exorcism movies, this is a unique one! The cast was well put together and expertly conveyed apathetic millenials only interested in social media likes and fame. Although by the end, I did feel for the characters and cared about what happened. Combine that with the exorcism/demonic theme, and you have an interesting blend.The pace of the movie was full go with gory/scares aplenty. What made this more unique was the element of humor mixed with social media, and exorcism.This movie had the right amount of scares, humor, an original plot, and good acting to make it a good watch.Recommend for exorcism fans looking for something different[6/10]"}, {"id": 83, "text": "While it's a far cry from The Exorcist and the most notorious possession movies of all time, there's something special to be said about The Cleansing Hour. It takes the classic possession story and modernizes it, telling a live-streamed version of a summoning-gone-wrong. In this movie, false prophet Max is the ringleader of a grand religious hoax, producing artificial exorcisms to be live-streamed to his small-but-mighty audience. The exorcisms have everything: the blood and guts, deep gurgling voices, spewing of profanities and, most importantly, merchandise pawned off on the viewing public at multiple times during the show. However, this film focuses on one particular night when things go awry and the theatrics being executed by the unbelievers quickly become a desperate attempt to return the evil they've unknowingly unearthed.The acting was on point, the pacing of the film was wonderful, and it struck a little too close to home for people who grew up watching pastors like Bob Larson, for whom every individual on the planet is crawling with demons and in need of an exorcism (he even has quadruple the merchandise our performers had in this film.... and people buy it up!).The focus on this film, as with all possession films, is to be careful what you mess with, but this one has the extra message on the importance of being truthful, presented in a nice little package that, while a dime a dozen in the horror genre, is pulled off in a manner that is wildly entertaining. It makes for a good night out.Good on the filmmakers for beating a dead horse but still making it extremely entertaining."}, {"id": 84, "text": "Desperate to increase their viewership, a popular webcast that performs fake exorcisms carries on with their show as normal when they come to realize their intended target has actually become possessed by a real demon in retaliation for their trickery and deceit, forcing them to turn the tables on their lives to get away alive.For the most part, this was a solid enough genre effort. One of it's better aspects is the rather fun way in which this takes the idea of their trickery and production quality into a seemingly enjoyable exorcism show. With the behind-the-scenes look that we're given here, ranging from the film-quality rigs and setups that are used to trick audiences into thinking they're friends are genuine people in need of exorcisms, the acting classes they go through and the research that goes into the sort of production they're attempting, this gives off quite an intriguing look at what they're attempting to pull off with their show. On top of that, the actual scenes of the crew being tormented and plagued by the sudden possession that occurs is a lot of fun and generates some genuinely creepy and enjoyable confrontations. With scenes of the possessed commanding everyday objects around them in supernatural means to cause harm and injury to others that include bursting flame tattoos into actual fire, breaking glass around their barefoot figures, forcing hallucinations that bring about their demise trying to stop it, these scenes are fun and energetic with some solid action and gore involved. Including an over-the-top finale which signals a far darker ending than what's expected in a film like this, this one gets a lot to enjoy about it which holds it up for the most part. There are a few slight problems with this one. One of the biggest issues is the seemingly random manner in which the possession takes place as there's little build-up or notice about what's going on. As it's so last-minute how she's supposed to take on the role, she seems to have no preparation for what's going on and how to deal with what they're trying to accomplish so when she seems to go possessed there's no real connection to what's going on. They have no real natural reaction as everything is immediately haywire so there's nothing about what happens that feels realistic. Likewise, some of the CGI during the finale is a little unnatural and comes off as too cheesy for this type of effort, but otherwise, this one has a lot to like.Rated Unrated/R: Graphic Violence and Graphic Language."}, {"id": 85, "text": "The Cleansing Hour has inarguably taken a bunch of innovative measures in terms of the concept; at the same time lacking a certain amount of maturity, in my opinion a Horror movie should always possess!Trailers looked real nice, convinced me to watch. And when I finally gave it a go, the end result turned out to be nowhere near satisfactory! Despite fulfilling the 'Gore' quotient, lousy acting and unnecessary spoofy tonality deteriorated its prospective outcome! The editing, the soundtrack, even the screenplay; they all were bang average! Scares aren't effective enough! Even though the storyline is based around exorcism, the execution of the same is 'Lame' in simpler terms! Performances are forgettable, perhaps the loftiest approach failed to draw my attention! Characterization is as weak as the performers. Admittedly some efforts were put using flashbacks in order to provide a base for the two main individual characters but that too seemed frivolous. A predictable plot throughout except the End! Which to be honest; I didn't see coming. A rather welcoming conclusion keeping in mind how below average the rest of the movie was.All I wanna say, this was disappointing! Cause I could clearly see how better it could have easily become! Lamentably it was never meant to be its destined fate."}, {"id": 86, "text": "I sat down in 2020 to watch the 2019 horror movie The Cleansing Hour without ever having heard about it, much less knowing what the movie was about, aside from it being a horror movie.But I was intrigued by the movie's cover and the fact that it is a horror movie is more than sufficient to make me have an interest in it.So I sat down and watched writer and director Damien LeVeck's movie. And color me impressed and entertained. The Cleansing Hour turned out to be a very enjoyable horror movie, and it is without a doubt on the best demonic possession movies out there, hands down.The storyline told in The Cleansing Hour was rather good and enjoyable, and I really liked how writer Damien LeVeck worked to slowly and gradually set up the atmosphere and the plot. And it worked, it really, really worked. I was definitely quite entertained by the plot and storyline.And the characters in the movie were also likable and enjoyable. And I will say that they had some nice performers to portray the various roles. Ryan Guzman (playing Max) really carried this movie phenomenally with his performance. And he had a good amount of help from Kyle Gallner (playing Drew) and Alix Angelis (playing Lane).Now, the special effects in this movie were just phenomenal. I had not expected this movie to have such grand, amazing and realistic effects. It was pure eye-candy to sit through The Cleansing Hour and watch what the special effects team dished out. And let me be the first to say that the special effects in the movie were so great that they added a very enjoyable aspect to the movie.Amazing horror movies seem far and rare in between within recent years. So having a movie like The Cleansing Hour pop up and surprise like it did, was just pure bliss. Especially for a seasoned horror veteran as myself.If you enjoy horror movies and movies about demonic possessions, then you have to sit down and watch the 2019 movie The Cleansing Hour. This was simply put, amazingly entertaining. It is well worth the time, money and effort, believe you me.I am rating The Cleansing Hour a well-deserved eight out of ten stars."}], "reviews_amount": 87}