{"name": "The Nest", "titleId": "tt08338762", "reviews": [{"id": 0, "text": "I don't know whether to add this film to the Movies where NOTHING Happens list or Advertised Thrillers with NO Thrills list, but Lord knows it probably deserves both. This movie was a slog with a plot that was just miserable to witness made even worse by how purposeless it all seemed. What was the point! I feel like this was supposed to be an informative video on Family Issues After a Big Move but they left out the narration. Seriously, I am not seeing a reason to this movie"}, {"id": 1, "text": "If you are having a really good day and you want to feel really depressed I suggest you watch this movie."}, {"id": 2, "text": "The story line is built up nicely, the actors carry the movie but the director fails in delivery of telling us a story. There could have been more details on the main characters motives. With the sudden finish is seems like the covid hit and the movie production just stopped! The movie had a great potential to be done well but IMHO the director did a terrible job."}, {"id": 3, "text": "Awful. Nothing happens. No movement. No interest. Don't care about any of the characters. Colossal waste of actor potential. Awful."}, {"id": 4, "text": "This obviously is a movie where someone thought they would put a new/different twist on the presentation of the main ideas in the story...they failed miserably.Not taking the time to realize we, the audience, are not mind readers...something a director may think is great may not be understood, make sense or fit in. I have to admit there are a few scenes that I did not understand the meaning or how they contributed to the story. Sometimes a straightforward approach works the best.We all know what it was about...family and home life is the most important, that is where your riches lie...do not put on airs or try to live outside your means...people can easily spot what you are about if you are full of b.s. etc. etc. etc. BUT a bunch of random thoughts pieced together do not make a movie."}, {"id": 5, "text": "Sean Durkin's latest film The Nest is about Rory (Jude Law), a trader who in his own words pretends to be rich. He keeps moving from one place to another and one day he informs his wife Allison played by the brilliant Carrie Coin that he got a great job offer from London. His family including his son and daughter hesitatingly move to the new place and struggle to adapt there.The core plot of The Nest is about greed and false prestige. Rory's sweet talking and his high class lifestyle appears charming initially but as time passes we cringe at how miserably he fails to appear like a socialite and how his selfishness affects the entire family.The scene at a fancy restaurant towards the end of the film where Allison calls out Rory for being a fake infront of his potential clients is the most important part of the film. The ending though not very conclusive gives us an idea about what happens next. Does Rory change now after hitting new lows or will he go back to being greedy again? One can hope it's the former.I found this to be far more impressive than Durkin's previous outing Martha May Macy Marlene. The two lead actors Jude Law and Carrie Coon are brilliant throughout the film. The pace of the movie is quite slow for a dysfunctional thriller but nonetheless the scenes are so well written and beautifully edited."}, {"id": 6, "text": "I liked this movie, but as at least one other reviewer has pointed out, it doesn't really go anywhere. Which maybe is the state of many unhappy marriages, as that seems to be what the movie is trying to portray. The acting is amazing and while a bit slow at many points, I was pretty engaged in the story. However, unless you've lived the hopelessness of a failing marriage and the unmet promises inherent to one, I think it might be difficult to find much to relate to in the movie."}, {"id": 7, "text": "This is not a movie. Just what the #ell did we just try to watch? We had to fast forward the back half just in case.... but nope. Just as lackluster and boring as the first half. If you like movies with no ending, no middle and no story line, this is for you. What is going on with scripts these days? We just want to be entertained, escape. But not be fed crap that someone thinks is 'art'. Oh boy. So bad so slow. Backwards. Stay away. Ps. Stay away :)"}, {"id": 8, "text": "Talk about a wasted potential. Absolutely nothing happens and I'm 40 mins in so far. Wtf is this movie even about at this point. Great cast absolutely wasted"}, {"id": 9, "text": "They should change the name, it would be more appropriate. The Dump is slow, depressing, dark, foreboding. I do not understand what is the point of movies like The Dump. What is the message? That we all should be happy and content living with minimal means in a hut in the middle of nowhere as peasants with no running water and electricity, etc. as long as we have our family with us? Meanwhile, actors, writers producers, directors, studios, etc.get richer by the minute selling garbage as The Dump. I feel sorry for the actors. Jude Law deserves something better than this nonsense."}, {"id": 10, "text": "I saw a 83% on rotten tomatoes so I kept waiting for something interesting to happen. I kept waiting. And waiting. I couldn't believe it when the credits rolled. That's it? Just dreadful. Then I went back and double checked rotten tomatoes. Of course - the critics review was 83%, but the audience score 49%. That's 2 hours of my life I won't get back..."}, {"id": 11, "text": "I did not find the Intention and Obstacle in this at all. Just a Bunch of Scenes strung together that really lead to nothing ? Do like the lead Actors, but they needed a Story that Moves Forward ? Disappointing attendance at Theatre. That I don't get 🙁"}, {"id": 12, "text": "I was not really enjoying this movie already and then this piece of garbage calling itself a thriller disgusted me through and through. I find NOTHING THRILLING about abusing and basically murdering an animal for ANY reason. Despicable and unnecessary! I would have rated this much higher if not for this garbage! Animal lovers will HATE this or anyone with a kind heart towards them. I wish I could give this trash ZERO STARS because I would!!!"}, {"id": 13, "text": "The only reason that I gave this one star is because Carrie Coon is in it. If this was meant to be a psychological thriller, it failed miserably. If it was meant to be an art house study on family dynamics in the '80s, it failed miserably there too. Jude Law's performance was disappointing at best. The most disturbing parts of the film, for me, were when the horse was upset or in pain. Those screams/whinnies were visceral. Overall, I feel like I wasted my time and the seven bucks for the on demand fee."}, {"id": 14, "text": "The first half hour or so is like accompanying the most boring family ever as they run through the mundane activities of their life. After that, the movie is so dark that you can barely make out what any of the characters are doing. I suppose filming the movie with little light is supposed to add substance to what is an otherwise empty plot. I wouldn't waste the time."}, {"id": 15, "text": "This is a quiet whirlpool of a film that very gradually draws you in through some brilliant acting by Coon and Law at the top of their game ( their bar being higher than most in the first place). The superb script gives an initial sense of unease with the way forward being unpredictable but compelling. This film stays with you long after having watched it."}, {"id": 16, "text": "This is a movie about a married couple with two children who relocate to the UK.The acting is fine, but nothing happens in this film - NOTHING! My dead mother has a lot more to offer than this film ever could.A terrible waste of time."}, {"id": 17, "text": "In an age where everything seems to resemble a made for TV movie, The Nest declares itself, right from the first shot, as a return to something more cinematic. This feels like a real film. It's shot beautifully, with wonderful locations and with a great cinematic gaze that lingers on its subjects.This is what films should be. They are a visual medium. Too many movies today are talkies that endlessly explain with a sea of words and dialogue. The Nest instead shows a long outside shot of a horse kicking the door of its tiny barn in rage and let's that do the explaining for it. As it does this, it builds an incredibly atmospheric world that created a real feeling of dread in me, similar to watching a horror movie, and as other commenters have noted, in some ways this actually is a bit of a horror movie of an unconventional kind.My only mild critiques of the film are that the 80's theme seemed tacked on for some reason. I'm not sure why, but it seemed a bit anachronistic, like it wasn't the real 80's but some idealized version of it, which is not necessarily a deal breaker either. And my other comment, that may surprise some, is that I actually wish it had turned into a more outright horror film at some point. I think that may have actually taken The Nest into the realm of a masterpiece, or at least a cult classic. Never before would there have been such a well acted, serious, and believable build-up to a horror climax, but in 2020, I will take what I can get."}, {"id": 18, "text": "Allison takes the cushy offer with a pinch of salt, as the family has already been relocated several times, but Rory doesn't really ask for her permission, but compliance. Once there, he immediately lavishes the family with luxury, renting a capacious mansion in Surrey, building a paddock and buying a new horse for Allison (because she is a cowgirl born and raised), enrolling their two children, Samantha (Roche) and Benjamin (Shotwell), in expensive private schools. But soon a crack appears on their ostensible easy street, but it is not as we are lead to expect, no, it is not a haunting mansion scare-fest, but the shattering distress it reveals is no less emphatic.read my full review on my blog: cinema omnivore, thanks"}, {"id": 19, "text": "I guess covid-19 has given actors no choice for better projects.Why would anyone make a movie like this? Where did they get the money for something like this? They should have donated the funds for this project to the frontliners. What a waste of money. Did anyone notice the wife was just smoking non-stop. Almost every scene including when she wakes up in the morning, the first thing she does is light a cigarette. I wonder if the actress is like this in real life because how could anyone stand to be married to anyone like that even in a movie? Boringboring boring doesn't begin to describe this movie. Nothing else to say because the movie itself says absolutely nothing --except non-stop on-screen smoking. Please consider donating your movie-making or distribution money to cancer prevention and covid-19 charities if you are going to make or distribute another movie like this one. At least the money can serve a purpose."}, {"id": 20, "text": "Should be called 'The Void' because nothing of interest happens. Maybe this story has it all for the well off: how to deal with your horse dying. And how to project your luxury problems on said horse. Even writing a review about it is a waste."}, {"id": 21, "text": "Excellent acting set in the late (?) eighties in a very dark and dramatic sad family setting. Very cinematic and beautifully filmed. Very raw and convincing. Conproducee by Law himself. We loved it."}, {"id": 22, "text": "Omg I kept waiting and waiting for something to happen but wow I will never get back the time I wasted watching this snooze fest"}, {"id": 23, "text": "Why waist time to movie, what makes you depressed. No single light only downhill from Anerica. Better spend time with loved ones. Reccomend only for those who live with pink glasses."}, {"id": 24, "text": "This film was highly recommended on a film podcast I enjoy so I went in blind, aside from knowing the director from his passably enjoyable Martha May Marcelene Whatever movie. This film certainly holds your attention with the excellent cinematography and foreboding soundtrack, but really nothing happens in this film aside from showing a family dealing with issues of moving abroad. It really felt like I was watching a mid-season episode of an acclaimed tv series that I'd never watched before. The recommendation I had heard mentioned that it all builds up to a fantastic ending, which this doesn't. I was expecting some sort of reveal or at least a climactic conclusion that would explain why the film's storyline was so basic and uneventful. But it just sort of fizzles out. That all said, I thought the actors did a fine job and as I said the cinematography was really the star, but the film certainly could've used a much better script and better direction."}, {"id": 25, "text": "Excellent small cast. Gut-wrenching morality tale. Head and shoulders above everything else that's out presently."}, {"id": 26, "text": "The majority of people watching this movie already live this life and do not need to watch it! It was major waste of time and money!! Whoever approved this movie to be made is a jackass! I'm sorry I'm not sorry, but Jude just stick to acting."}, {"id": 27, "text": "Marmite. You either love it or hate it. I loved everything about this movie. Listen closely for the contextual clues in the dialogue to tell you everything. This whole era in the mid-late 80s had an on-the-brink feeling in real life before markets and institutions toppled. I wish this had been adapted from a book instead of being an original screenplay as I need to know more details about the O'Haras please."}, {"id": 28, "text": "No hidden message. No moral meaning. No fun. No laughs. No sadness.Nothing really.Oh and he's not an entrepreneur - commodity brokers are more the leeches of the world than entrepreneurs."}, {"id": 29, "text": "Finally something that touches you in every way. So many feels with this one. Tension, pain, worry, irritation. I fell in love with the main actress in this movie, she is incredible. Jude Law is always great at playing a Peter Pan type of character that resists maturing, much like his character in Talented Mister Ripley. I feel that the parts in this movie that touched me the most was the relationship that the wife had with her horse. I watched this movie twice and both times I saw something new. It is the best movie I have seen in a long time if you are someone that likes to see the how deeply flawed many of us are in an age that we lose touch with what really matters and forget that we never heal externally but only internally. I believe that the wife was so much more aware of what life really means than the husband. But without giving anything away, I will say I liked the movie all the way through to the end, feeling that on some level, that the end of this movie, maybe marked the beginning of transformation for the family that was involved. Great movie!"}, {"id": 30, "text": "It is an engaging drama of a disintegrating family. I find it slow, but the acting is good."}, {"id": 31, "text": "Pre-pandemic, I didn't bat an eye when spending money at movie theaters. Now, with so many shows available in steaming format, a new-release movie would have to be worthy of my $4.99 to rent it. The premise of The Nest seemed worthy enough. The beginning and the middle parts offer a good study on mundane life and human desires as they unfold mysteriously, with great acting from the always-dependable Jude Law and his British accent. Carrie Coon is also impressive and unpredictable, reminding me of a mixture of Emma Thompson's sophistication and Diane Lane's housewife-y vibes. The ending, though, leaves a lot to be desired. It's a disservice to the great efforts of the actors and the production crew to just abruptly end it like that, like a kid giving up on homework. So yes, I want some of my $4.99 back."}, {"id": 32, "text": "I didn't want it to end! This is a fine wine and you want to keep sipping. Love the references to the 80's. Its spot on and reminded me of my younger years. Gorgeous film and I am SO glad I didn't take reference from these idiotic bad reviews. LOVED IT. If you've got a brain, and you might remember the 80's, watch the wonderful film and enjoy."}, {"id": 33, "text": "Unsure why it's advertised as a triller. It's a half-finished story. Beautiful visuals but was hoping for more."}, {"id": 34, "text": "I enjoyed the storyline and the modern American/English tradition contrast. I was invested to see how it would work out for everybody. I found the acting believable and the setting interesting. There was a looming darkness throughout the film that made me wonder if it would turn into a horror movie. It didn't, it actually doesn't reach any real clue other than that the family is no longer a functioning one after the move.I did miss a bit of credibility on why the wife agreed on moving one more time, even though she seemed smart and capable. I also struggled to believe that these two characters were actually THAT negligent and damaging towards their children even though they seemed loving and invested in them. But that didn't stop me from having a good time seeing this film. Me and my boyfriend turned to each other smiling/laughing quite a few times in disbelief of the characters behavior (in a good way). We enjoyed ourselves seeing the parents we never want to be."}, {"id": 35, "text": "Amazing deep scenario, mesmerizing picture, great actors."}, {"id": 36, "text": "Total waste of the evening. Would not recommend. Story of a loser - Loser of a story. Unrealistic ,Even Jude Law could save this"}, {"id": 37, "text": "Absolutely made no sense. No redeeming qualities. Family moves back to England, dad has big plans, no one knows what, buys a horse, kid gets high, horse reappears, dad takes Uber, kids make breakfast, mom smokes some more, over! I"}, {"id": 38, "text": "If you wont to watch movie just to kill time and nothing more its ok. But if you look for some more skip this one ,has nothing to show !"}, {"id": 39, "text": "I grew up without money and can relate to this in a weird way. The story captures a bitter feeling and a uncertain emptiness very well. Outstanding performances by all actors. This could have been just as good as a stage play."}, {"id": 40, "text": "Watched from beginning to end and in a new word, I came up with to describe the film, it was slowinteresting. Slow story about a man who pretends to be something he's not and drags his family thru the process. Interesting because it slowy reveals the ugly truths about wannabees and that you can't keep up a facade for so long before the real you manifest. I totally got the point of the story but for some, this movie will go right over their heads and they will label it as a boring film or just say it was bad. But quite the contrary this was slowinteresting."}, {"id": 41, "text": "Starts a little slow but if you stick with it its entertaining. Acting was good and the scenery and settings."}, {"id": 42, "text": "The cinematic landscape must be really boring if a big name such as Jude Law would choose to act in a such a waste of time (for the cast and viewers) and money (especially for the producers). Why this movie was even made? What was the reasoning behind? Target audience? The director seems to lost his touch since the rather good debut Martha Marcy May Marlene. The characters are behaving in random manner in a very obvious timeline of events. It's impossible to relate to any of their decisions because we cannot understand and emphatize with them. And what about that horse? What happened with him? What about the scene at the end? What is happening there? Anyhow it is pretty hard to see the details because of the poorly lit scenes. Did they spent all the money on the rental of the huge (and pointless) manor? A positive mention would go to Carrie Coon that look (when one can see her) absolutely gorgeous in this movie."}, {"id": 43, "text": "The setup is good. It's well-filmed, well-acted and generally well made. All the way through you get the sense you're really building towards something, some big event or twist.And then, nothing. It just stops. And not even in a way that's clever or thought-provoking, just in a way that screams that they couldn't think of a way to end the movie so they just didn't bother. A crying shame."}, {"id": 44, "text": "Well written and directed; great acting - especially from Jude Law but you wouldn't expect less from him. Pretty good camera work that builds this weird ghostly and sometimes even horror-esque atmosphere. There's a lot of tension in this movie, mostly emotional and here is my biggest, and probably only, problem - that tension is never really resolved or fully blown. It seems that all of characters anger, ups and (mostly) downs went for nothing so in the end all of that sadly makes this movie an easily forgettable one. On the other hand it kept me interested whole time and I still consider it a decent picture worth watching, so give it a shot if you have a chance."}, {"id": 45, "text": "Now out of the movies. I enjoyed the movie the story of the movie was sweet directing it was great the story was sweet and the acting was good. There was a negative in the story that made me bored The film will not be liked by all people because of the Western story +15. 7 out of 10"}, {"id": 46, "text": "My daughter and I were glued to this film, it was very cleverly written and the soundtrack was cool / complimentary.My daughter figured out a lot of the interesting themes...Recommended!"}, {"id": 47, "text": "Horror movie. The movie itself was a horror.Jude Law had a great performance in a terrible movie."}, {"id": 48, "text": "Had a great build up and story as everyone slowly went mad and then it just ended!!! Not the ending I was expecting!"}, {"id": 49, "text": "Who write the negative, but also the positive review. Don't you have any basic knowledge about psychology?What is bipolar disorder? also called manic-depressive. Do you know what that does to a family.This is a psychological movie, and it requires attention to notice the subtleties of the scenes.I won't give you the last scene, but it's very clear, the family was being destroyed by a mentally sick husband, and they knew it!Not a masterpiece but worth watching. Why the Title ? I have no idea!"}, {"id": 50, "text": "PLOT SPOILERS: Rory O'Hara (Jude Law) is a commodities trader. His wife Allison (Carrie C**n) teaches horse riding. They have two children. Rory wheels and deals. He moves the family to England where they live above their means with Rory banking on his company selling out. He constantly lies to his family.The film was boring. I waited for a film climax and it fell flat leaving the viewer hanging, but not wanting more.Guide: F-word. Sex. Nudity (Carrie C**n)."}, {"id": 51, "text": "Rory O'Hara (Jude Law) is a commodities trader. His wife Allison (Carrie Coon) teaches horse riding. They have two children. Rory wheels and deals. He moves the family to England where they live above their means with Rory banking on his company selling out. He constantly lies about what he is doing which causes riffs.I kept waiting for the climax ending. It wasn't that much of a climax and it leaves you hanging, asking, :Is that all there is to a movie? Nothing really happens.Guide: F-word. Sex and nudity (Carrie Coon)"}, {"id": 52, "text": "I doubt most people read the reviews before watching but just in case, you can sum up this movie pretty simply. The movie starts off with a family of four living the idyllic life and then their life goes downhill as the story peels off the veneer of each character. It's not about a house or anything supernatural. It might have been an interesting story if the director didn't seem preoccupied with the mundane. Okay, yeah, parents pick up and drop off their kids at school. Doesn't mean there is much meaning to it so why repeat these moments over and over, along with other equally mundane moments. This is one of those cases where you've got a director that has simply gone amok and wasted some of the best talent in show business. Most of the movie is like watching your friends or neighbors squabble about money and responsibility. Both cringy and depressing... and then the movie just ends with the characters standing at the cliff. Hope this doesn't mean a sequel."}, {"id": 53, "text": "This is a film that relentlessly dissects the veneer of marital and workplace pretense. Jude Law and Carrie Coon are terrific as the 1980's couple who play along with upper class social construct for as long as they can... before they crumble. The film is superbly acted, but lacks a meaningful resolution. It essentially says... Look at these pitiful people and wallow in their shallow misery."}, {"id": 54, "text": "Hoo boy, let the discussions flow.It is rather lovely to soak in a well made piece of cinema that will no doubt elicit a bevy of experiences depending on the audience. The Nest has a basic mid-life family implosion crisis plot at it's core, but just how rotten is it?Jude Law (Rory) is a slick talking investment advisor, living a comfortable New York life, with a pretty horse-training wife, and requisite two children. Yet he yearns for more. Soon the quartet are off to his England, to live in an isolated ancient mansion filled with too many rooms, a table so big it cannot leave the premises, and secret doors. Sounds like a horror movie, and in a sense, it is. Just not of the supernatural variety.Law owns the screen as the flashy business stud, pushing all his chips into the middle of the table, dragging his reluctant dependents along for the ride. Carrie Coon (Allison) is his American match, willingly embracing her husband and his white lies until breaking point, then unleashing a vindictive, cruel yet understandable side in their escalating partnership.Is this a family drama? An allegory for greed? A warning? A husband and wife coming to relationship climax?A riveting turning point, actually one of many, has Allison beaming beside her man at a posh dinner party, as the boss welcomes him back to the English fold, revealing a devastating lie. Her smile doesn't break, but it is clear that there is trouble a foot. Much trouble. The husband and wife dance continues, but as finances spiral out of control, the tight solitary quartet starts to crack.Every act is punctuated by a primo British new wave nugget from the likes of the Cure or Psychedelic Furs as a reminder we are in the eighties. It is a rather odd reminder, as the movie really doesn't depend on an era, other than referencing the greediness of the Reagan and Thatcher right uprising. It does elicit a weird alarm bell of nostalgia for anyone of that age, and perhaps was a bit of directorial self-indulgence. Not unwelcome mind you.How and not why this plays out is the strength of this film. Blame is easy to hurl, but sometimes life is the problem.A moody a piece of cinema, both visually and thematically, The Nest is a film that leaves an odd, bitter aftertaste, long after the main course is digested. A burner.hipCRANK"}, {"id": 55, "text": "Yes the plot is simple and some people say it had many scenes that added nothing to the experience and I disagree. I think the movie achieved what it wanted perfectly.First of all. Live within your means. People in the west and increasingly all around the world live in a fairytale. They want the latest iphone, a brand new gucci bag and high maintenance car just because it's out there, just because they think it will add value/meaning to their life and give them the opportunity to post something on Instagram. If you cant afford it- dont buy it. Learn to say NO.Either make more money or be content with what you have. Invest in your skills/hobbies instead of a fancy lifestyle you cant afford.Are you honest and real with the person that you truly are? Who are you trying to impress, yourself or others? Look at Warren Buffet. He's a billionaire and lives in a modest home, drives his rusty car ,and gets breakfast at McDonalds. If you walked past him you would probably never tell that he is one of the richest men in the world. Thats because his biggest asset is his mind and not his bank account. Find something you are passionate about and stop trying to impress others.And finally family is number one. Your kids dont need to attend the most expensive school and live in the biggest house possible. They need love and attention. They need something to look up to. Yes a man is a provider , but as long as your kids have a roof over their heads and food on the table its gonna be fine. If they get less they get less, people who accomplish biggest feats usually come from poor background because they learn very early what it means to struggle. You get out of life what you put in. Its far more important to have a father in the house than live without financial struggle.The acting was great and i really loved the way filmmakers used Richmond in this movie. There is a heart breaking scene when Allison comes back home after drinking. She desperately wanted to get her life back(horse). Life in New York wasnt perfect, it wasnt without struggle but at least the family was happy.My english is not the best but this movie is very well worth watching. Dont listen to the haters."}, {"id": 56, "text": "I really enjoy dork character studies, but this film just left me confused. Lots of scenery, dark, moody lighting, and close-ups, But it all seemed very vague. As if there were no there there. There are threads that apparently lead nowhere as if just jumbling together random generic examples of family dysfunction in bite-sized scenes. Mother has a secret stash of money. Son wets the bed once. Daughter buys drugs and has a party. Mother (for some reason everyone thinks is down-to-Earth) bumps and grinds at a disco. Father brings coffee into the bedroom in the mornings. A door opens all by itself. And, nothing really seems to happen as a complete story --it's just bits and pieces that don't really add up to anything. There's not even an ending, unless you count the other inexplicably digging up the dead horse and then the family having tea. The acting was decent, but without much real story there wasn't much to go on, given that there wasn't much character development beyond the usual cliches.I think most of the good reviews (10/10? Really?) were from people who felt they should like the film because it was artsy. I tend to like many artsy movies, but this was not one of them."}, {"id": 57, "text": "Greetings again from the darkness. I'm not sure how to officially protest, but this is writer-director Sean Durkin's first feature film since the excellent and thought-provoking MARCY MARTHA MAY MARLENE in 2011. Okay, he directed a TV mini-series (Southcliffe) in that span, but there really should be some kind of ordinance mandating (or at least pleading with) Mr. Durkin to share his art more frequently. His approach is not conventional, and it challenges the eye and mind. The story doesn't move at the pace we've come to expect, and the characters - though quite believable - don't always act the way we expect.Jude Law stars as Rory O'Hara, a business man with big dreams ... dreams far bigger than his work ethic. Carrie Coon (Fargo, GONE GIRL) co-stars as his wife Allison. This husband and wife couldn't be more different. Where Rory is the big-talking blow-hard who, Allison is the down-to-earth horse trainer. Oona Roche plays teenage daughter Samantha, and Charlie Shotwell (CAPTAIN FANTASTIC, 2016) is the younger Benjamin. Durkin does a nice job with the family set-up in the first few minutes of the film. We get a sense of each, as well as the family dynamics. There is a great shot of Rory sitting idly at his desk, and soon after he wakes up Allison with a cup of coffee and the announcement that they need to move to London.The film is set in the 1980's (the Reagan-Thatcher era), and Rory's desperation to prove his business acumen is on full display when he meets his old (now new again) boss Arthur (Michael Culkin). Rory is a social climber, intent on keeping up with the Joneses (or whatever they're called in London), and he's referred to as Old British - New American. He takes it as a compliment, but we soon witness Rory as little more than a fast-talking salesman. A restaurant scene featuring Allison, Rory, and his co-worker Steve (Adeel Akhtar) is brilliantly played, as Rory's professional life begins to unravel at a pace matching that of his family life.We see each of the family members cut loose in their own way, in an attempt to deal with the strain. Timid Benjamin lashes out at school. Samantha throws a wild bash at the family home. Allison guzzles gin and lets go on the dance floor. Speaking of the family home - it's an old mansion that is the loudest symbol of Rory's stretch to impress. The film seems to tease us a couple of time in regards to possible paranormal activity within the home, but that's simply Durkin's misdirection. The only thing rotten or haunted is the make-up of the family. Their domestic dysfunction is horror in its own right.Rory's delusions of grandeur and worshipping of money are finally thrown back in his face during a tremendous scene of Taxicab philosophy. When asked what he does for a living, Rory answers, I pretend to be rich, in what may be his only moment of clarity. Jude Law is superb as the charming guy we don't really like, and Carrie Coon goes toe-to-toe as his polar opposite, and she's exceptional. Mr. Durkin and cinematographer Matyas Erdely (SON OF SAUL, 2015) keep us off balance with the fascinating shots within the mansion, and startling close-ups that make a point. There is certainly no abundance of light, but this isn't the type of family that the spotlight tends to find. It's likely to be a divisive film not embraced by mainstream audiences, but adored by those who crave projects that are creative and different. It played Sundance prior to the pandemic, and now we have to hope we aren't forced to wait another 9 years for the next Sean Durkin film. Although I will I have to."}, {"id": 58, "text": "The Nest (2020 release from the UK; 106 min.) brings the story of Rory and his wife Allison and their kids Samantha (14) and Benjamin (10). As the movie opens, we are in New York and watch a day in the life of this family. Next morning, Rory has news: he has a great job opportunity in London (where he hails from). Allison reluctantly agrees, and soon the family arrives in the UK at their new place in Surrey, a massive 17th century mansion. It's not long before tension rises... At this point we are 15 min. into the film but to tell you more of the plot would spoil your viewing experience, you'll just have to see for yourself how it al plays out.Couple of comments: this is the second feature-length film from writer-director Sean Durkin, who previously gave us the excellent Martha Marcy May Marlene. Here he examines the consequences of uprooting a family from their familiar New York surroundings to a brand new and unfamiliar environment in the UK. This movie is plot-heavy and hence I'm not going to say a whole lot more, although I will say this: I found this movie classify, as it covers a number of different areas, although a generic 'family drama' could cover it. Also, the movie is set in the 1980s: there is reference to President Reagan on the radio, and 1980s music is a-plentiful including the Thompson Twins, the Cure, and many others. What I thought at the end of the film was this: Money's Too Tight (To Mention), the 1985 hit by Simply Red. Why? Just watch! Jude Law (as Rory) is excellent once again (he currently stars in the HBO mini-series The Third Day), and the same goes for Carrie Coon (for Allison). Beware: there are a few scenes in the movie involving horses that you may find difficult to stomach (I looked away).The Nest premiered at this year's Sundance Film Festival (yea, pre-COVID-19) to good buzz. Then of course movie theaters shut down. The movie finally was recently released in select theaters, including my art-house theater here in Cincinnati, fully adhering to all COVID-19 protocols. Not that it mattered, as the Tuesday early evening screening where I saw this at was attended poorly: 2 people (including myself). If you are interested in a hard to classify 'family drama' or simple a fan of Jude Law or Carrie Coon, I'd readily suggest you check this out and draw your own conclusion."}, {"id": 59, "text": "Durkin's The Nest tries to recreate an economic portrait of the late 80s, via an US family living in London. Jude Law this cast, as the English father of American children. But the strength of the film is Carrie Coon playing Law's wife. Many have said this feature is study of character.Coon's performance helps the film's often pretensions of depicting classism. Her appearances are strong with emotional wealth, look out for the horse sequences. The other cast members were not as strong, even the film's production worked hard to recreate London in the late 80s. It's equipped with pop culture reference to Britian and UK then musical trends.Beyond there's a mist of emtpiness, here is where the film offers some strength, ironically when it was not intended. Other times when it's intended, it comes off very superficial. But as a contemporary look into white middle class, it's definitely a good study.Truth of the matter is that this film maybe had been more stronger if it was set in the present time, with the pressure of social status on platforms would have strengthen Jude Law performance, luckily Coon was able to translate the film's emotions.The shots of a decaying mansion were actually done well to show the process of the family's disfunction."}, {"id": 60, "text": "British Rory (Jude Law) and American Allison (Carrie Coon) appear to have everything a youngish married couple could have in the '80's: good looks, money, beautiful kids, and now moving back to his home, London. Wall Street was not enough for this gifted trader, whose previous company eagerly welcomes him back.Following up on his smash debut in Martha Marcy May Marlene, writer-director Sean Durkin narrows his focus, with the appropriate tight shots inside a gloomy neo-gothic estate in Surrey. The background Britpop tunes from The Thompson Twins and The Cure early tracks, for instance, help place us in the '80's and the energy of Britain.The family is about to go through a challenging time when dad does not have the money he used to have, and he neglects to disastrous effect his family to pursue money and investment success.When a savvy young cabby asks him what he wants out of life, he is at a loss to come up with an answer in a moment of revelation that diminishes for the audience his professional success and more importantly his interaction with his family. Like Donald Trump. He can't get outside himself long enough to see that his family is the wealth he has been toiling for.The Nest is another modern cautionary tale about dysfunctional families that can be traced to parental deficiencies. Only when one can see his weaknesses played out in his children can he begin to approach the humility that will allow him to connect with his children, wife, mother, and as well his employer. This drama is a smart family story for the holidays because it makes sure we don't get too cocky ourselves about the perfection of our families.Or, we can just look at the family assembled at the Thanksgiving table and feel much better after watching this cinema family struggle."}, {"id": 61, "text": "Sean Durkin's new film is a modest yet searing drama about a family that relocates from the United States to the English countryside after the father (Jude Law,) an entrepreneur, moves his job. The move eventually brings out a variety of conflicts between him and his wife. The film works best as both a layered character study of the two leads (Jude Law and Carrie Coon.) Both of them are very well-developed as characters, with their strengths yet deep-seated flaws thoughtfully communicated. Viewers are able to feel for both of them, and will understand their imperfections while simultaneously sympathizing with some aspects of their daily lives.The film's aesthetic, including the score, are beautifully understated. This isn't a flashy film, but it's not trying to be. The score is ominous yet powerful and moody in the best way possible. The screenplay goes a great job ratcheting up dramatic tension between the husband and wife, while also providing careful context to the narrative on many levels-Jude Law's character's work situation, the characters' relations with others they meet while settling into life in the UK, and how they respond to difficult and adverse events. The main couple's children are also thoughtfully depicted in the script; the writing shows them to be dynamic yet shaped by a variety of external circumstances in their personal and familial lives. The acting is terrific across the board, as the main characters are able to clearly convey raw grit and anguish as their interpersonal relationships end up getting increasingly muddy and dysfunctional. All in all, this is a complex, smart and well-made look at the the impact of greed on our lives, as well as the intricacies that govern how we respond to each other during difficult and uncertain times. Despite all of these positive qualities, the third act is a bit underwhelming and fails to completely satisfy or pack the expected emotional wallop. Instead, it leaves us with a feeling that doesn't quite add up to the sum of its previous parts. As a result, the film is not a home run. Yet I do recommended it without hesitation to patient viewers who can appreciate challenging, slow-burn cinema. 7/10"}, {"id": 62, "text": "IN A NUTSHELL: This is basically the directorial debut of Sean Durkin, although he has done other projects. His style is very unique and different in writing and filmmaking. It might not be to mainstream taste, but cinephiles will adore the artistry. It offers a haunting and heartbreaking look at an American family imploding after moving to England where the entrepreneurial husband chases fortune and success, oblivious to the toll it takes on his family.TIPS FOR PARENTS: Profanity (some uttered by kids), including quite a few F-bombs Sex scene showing skin, body parts, and sound effects We see a woman topless a couple of times. Teens party with alcohol Adults drink alcohol and some get drunk. You see a dead horse several times. Parents will feel sorry for the kids in the film who are practically abandoned by their parents.THEMES: Family disfunction Marriage: communication, expectations, teamwork Image vs. substance Power, money, prestige, and what is sacrificed to get it. How much money do you really need to be happy? Dishonesty with yourself and othersTHINGS I LIKED: Jude Law is pretty much great in everything he does. We expect that, so the surprise performance for me was Carrie Coon. I hadn't remembered seeing her in anything before, although she has been in plenty of very good films like The Post, Gone Girl, Widows, and even Avengers: Infinity War. She was recruited to play soccer in college before she studied at the American Players Theatre. What is soccer's loss is the Big Screen's win. The two kids did a good job too, especially young Charlie Shotwell. The filmmaking is different from a lot of things we're used to. Different is good! The absence of light in many scenes shines a light on movements and causes our eyes to see intriguing things. The close-ups on facial expressions are intimate and telling. I heard one critic say, When their life closes in on them, so does the camera. Good point. You'll feel uncomfortable as if you're a Peeping Tom spying on a family's day-to-day life. The one funny moment is when the wife takes a swig from an open bottle of wine at a restaurant and says, It's fine. We'll take it. It's so sad that Rory hasn't seen his mother in many, many years. The story does a great job contrasting a wife who is relatively down-to-earth and loves horses with a husband who is willing to sacrifice his family for money. The story takes place in the 80s when the economy was booming, headed for a crash. It's fascinating to watch how the various family members react to the feeling of being trapped in life's situations.THINGS I DIDN'T LIKE: There is an element of the movie that suggests there is something paranormal occurring in the English manor, but this is not a horror movie, contrary to what the creepy music at the beginning of the movie suggests. Some are saying this movie is a horror film, although it definitely doesn't fit into that traditional genre. The horrifying part of the movie is watching the family fall apart before our eyes. Some viewers will complain it's too slow-moving. This is not a feel-good film but a cautionary tale. Feminists will protest that the Alpha husband says he's in charge of the family and that the wife steps back to let him lead. There's no real teamwork in the marriage. Some people will be confused by the scene of the horse in the shallow grave.You can see the rest of my review on my Movie Review Mom YouTube channel."}, {"id": 63, "text": "Even though there are quite a few storystrains that spins out in nothing. but it tells a familystory that elaborates and gives a real touch of how life was in the 1990's, with extreme mobility, the start of ''globalisation'', crystal palaces, and utopian dreams and abilities, that ultimately crashes into a cataclysmic shakedown of selfsurveying, and retrospectiveness.the actors do a good job, and its a fairly good production apart from some story parts unfinished/vanished. its best said to be an introspective psychosocial analysis of family dynamics in a world on hyperdrive, where the winner takes it all...and the looser is a looser like the 99% of the rest population.so if you want to feel a touch of european 80/90's filmmaking try this. you will either love or hate this drama. the grumpy old man thought this was a forgotten filmgenre and had a good time.recommended"}], "reviews_amount": 64}