{"name": "Happiest Season", "titleId": "tt08522006", "reviews": [{"id": 0, "text": "This is a very good movie with a lot of feel good moments. Dan Levy is the man and Kristen Stewart and Mackenzie Davis shine. As a straight man who has never had to hide who I am, I really learned something in this movie and I hope others do too."}, {"id": 1, "text": "Look, I get they took a gay story and put it through the straight trenches, but this movie had the chance to really make a statement by having Abby and Riley be the end game. Was anyone else hoping for that??? Harper wasn't redeemed enough to get her happy ending. Still good, but really missed a huge opportunity for a unique love story."}, {"id": 2, "text": "I loved the concept of this movie. A gay Christmas rom-com, how much better could it get? Answer: a lot. It was great up until Kristen Stewart's girlfriend blatantly lies to her and shows no remorse. I have no issue with the concept of people coming out on their own timelines. I do have an issue of lying to your partner like that. In my opinion, they make a terrible couple. I would much rather see Kristen Stewart with Aubrey Plaza. Great concept, terrible execution."}, {"id": 3, "text": "The movie starts off all joyful and festive, sticking to what was marketed and promised in the trailer, however that all comes to an abrupt end way too soon. This movie left me feeling more annoyed than it did make me feel happy about a journey meant to be about self acceptance and family. Firstly, I'm shocked to see so many people overlooking and justifying Harper's manipulative and ignorant actions towards Abby. There is a fine line between being afraid to be out and mistreating your partner because of it. She doesn't need to be painted as a villain but she should've had better character development rather than shoving it all in the last 10 minutes of the film and call it a happy resolution. Second, what is up with movies/tv shows casually placing outings as the major turning point plus for shock value? Then proceeding to brush it off with a half assed apology from who was responsible, downplaying the seriousness of how wrong it is in the first place. Cliches like that are literally meant for straight audiences. The fact that so many saw Abby and Riley being a potential couple further accentuated the lack of chemistry between Abby and Harper in the long run of the film. The jealousy antics and the overly fake forced heteronormativity that was done to an extent that tormented Abby, only made Harpers character even more dislikable. Yes, this fight/situation alone didn't have to mean they should've parted ways, but given the poor writing choice for putting Abby in the limelight, mostly seeing her perspective makes viewers much more sympathetic for her, making it harder to be so quickly forgiving for everything she had to go through like 3.5/4 of the film. Everyone's coming out story is different perhaps the most important line in the whole movie. This movie had its wholesome moments and I see why people enjoyed it but overall for me it just left a sour aftertaste, made me uncomfortable at times for how stressful and triggering it was, but like it or hate it, the film was poorly executed for the themes they wanted to explore and surely shouldn't be regarded as a romcom."}, {"id": 4, "text": "The moment Harper said she lied about being out to her parents, I would have been out of the situation. I would have ubered home with harper paying. Harper was so disrespectful throughout the entire movie, I really felt for poor Abby. (who was really trying to be a trooper) Dan levy (voice of reason) said things exactly as I felt them aside the ending where he felt she should forgive harper.F that noise!Abby should have gotten with Aubrey plaza. I was rooting for that.Disappointed it didn't go in that direction. Nightmare gf. Nightmare family.Kristen Stewart wasn't as bad as I thought. She looked really beautiful..."}, {"id": 5, "text": "I should start by saying I can't stand dramedies. The idea of spending two hours cringing isn't exactly appealing to me, but if that's your thing this might be the movie for you.The punching bags for this film are Jane and Abby.Jane is portrayed as a person who is seemingly nonneurotypical in some way, and we can tell because her family treats her like a pet that they tolerate. She's smart enough to write a novel and be the family's IT person but she can't be trusted to do a basic task list. If I didn't hate this movie by halfway through the scene where her painting gets destroyed would have done it for me. She deserves so much better as a character.It is easy to blame the criticism of Harper and Abby's relationship on people's ignorance of the nuance of coming out, but you can tell that it's a toxic relationship from the first scene. Why can't Harper respect Abby's feelings about Christmas? Why did she let her partner fall off of a roof rather than help her? If that wasn't enough, you get to see Abby confront her complicated feelings about the holidays and losing her parents right before being told that she was lied to by the partner who is insisting she enjoy Christmas.Harper is easily one of the worst people I've ever seen Kristen Stewart paired with romantically in a movie and I've watched all of the Twilight films.Dan Levy is brilliant in this and so is Aubrey Plaza. Both of them feel out of place in the film because we end up rooting for Abby to leave with them rather than deal with Harper anymore. Their messages about being an LGBTQ+ person trying to navigate love in a complicated world are what the film was supposed to be about. The rest of the movie feels like filler around their onscreen time.If you like dramedies and toxic relationships (of all types) then this may be the film for you. If you were looking for a lighthearted holiday RomCom that features an authentic LGBTQ+ couple then this isn't it."}, {"id": 6, "text": "The main character, Abby, gets treated horribly by her girlfriend and her family and this is never addressed. The film pretends that the problem is Harper not coming out to her family and the troubles this causes for her relationship, but really all the problems come from her being a huge d*** to her patient girlfriend. I suspect the parents are supposed to be laughed at, but for me they were just too mean. Let's say that Abby really was just a friend of Harper's, even so, the way she gets treated is just too rude for me to be entertained by the comedy. It was painful to watch her spend horrible days alone in a foreign place, abandoned by the woman she hopes to marry who is too busy flirting with her ex boyfriend (she's not even flirting with her hot ex girlfriend Aubrey Plaza!). Moreover we learn that Harper did something horrible in high school and that's also not a problem. The ending is ridiculous- as if conservative parents and competitive sibblings can turn around overnight. The writers could have made an effort there. The problem is that i am asked to forgive Harper and the family and be happy that Abby is going to be part of their gang but they have been written unredeemable- so the only way to do this is to take a leap of faith. I can't believe this is supposed to be heart warming and funny. The only good things in this movie are Daniel Levy, Aubrey Plaza and K-Stew but mostly because I feel so sorry for what she's going through and that they didn't give her more things to do as the talented charismatic actress that she is."}, {"id": 7, "text": "Such disappointed by this movie and wanted to love it because of the lack of representation of holiday films that aren't heteronormative schlock...but, the lack of chemistry between Mackenzie Davis's Harper and Kristen Stewart's Abby and the unbelievably dysfunctional family at the center of it was too much. Harper's treatment of Abby had me rooting for the latter to run away with Aubrey Plaza's Riley which would have made this a much better movie. Dan Levy's coming out speech is one of the few bright spots in this film. I'd suggest skipping this one and rewatching the far better City of Trees if you're looking for a way better LGBT holiday movie."}, {"id": 8, "text": "Should of left the rich white lady for Aubrey Plaza. Booooooo 👻"}, {"id": 9, "text": "I'm one of the biggest fans of Rom-com no matter gay or straight. The story had promise though hardly original. The first few minutes had promise. The last few minutes had a twinge of a happy ending. Everything in between was filled with cliches, horrible unlikable characters doing horrible things with just the worst dialogue I am sad to say. Aubrey Plaza and Dan Levy, bless your hearts for making this movie a little less unbearable."}, {"id": 10, "text": "The Happiest Season this movie is not. Honestly, this movie was just watching someone gaslight their partner into staying with them during a horrible, awful family holiday. I was stressed and shocked almost the entire running time, and the bad acting and writing did not help either.Seriously wouldn't recommend."}, {"id": 11, "text": "I was impressed with this film considering all of the big name actors/actresses in it. The production is strong and beautifully shot. The styling is also great. Kristen Stewart shines in this role. The storyline is heartfelt and entertaining. But also, representation matters &amp; Happiest Season is a movie everyone can relate to, LGBTQ or not."}, {"id": 12, "text": "Fresh. Relevant. Heartfelt. I thoroughly enjoyed this film. It was so nice to see LGBTQ characters at the center of this story, rather than side characters or fillers. For those who have already come out, and for those who struggle to find a way, we see you. This will be on my holiday must watch list for years to come."}, {"id": 13, "text": "The far too often shallow facade and deceit of meeting traditional and expired conservative expectations played out in a cinematic seasonal pantomime (oh no it isn't; watch it and find out!). Primarily preaching to the converted, it reminds us why individualism is the foundation of us all. Could have been the best Christmas film ever if the father had come out as a cross dresser and the mother as an habitual piercer but you should always leave room for improvement and any improvement in the views of some is always well and truly welcome."}, {"id": 14, "text": "This movie is light hearted, heart warming and literally the cutest gay movie I've ever seen. It's absolutely worth watching with such an amazing cast. The way its directed is charming and clever that it gives joy and comfort. Happiest season definitely reaches up to the mark and proves their title name and the Christmas vibes are so fresh and delightful. Lead actors are nothing but best as we witnessed Dan Lavy before in Schitt's Creek by his ravishing performance, he does not fail to do so again and of course Kristen is a treat to watch. In a nutshell, it's a perfect Holiday rom-com to watch and feel good in these difficult times. Everyone should def watch it!"}, {"id": 15, "text": "Nonstop cringing. Awful script. Awful acting. Just one cliche after another. Not once did I root for this couple. If anything I hoped Abby would leave her for Aubrey Plaza. I booed at the end. Clea Duvall, you're better than this. So much talent wasted in this god awful movie."}, {"id": 16, "text": "I found that movie to be a painful, tragic drama exploring how overly perfectionist parents can completely ruin their children's entire lives well past childhood, and the toxic environment they create destroys all around them while maintaining a saccharin stepford wives midwestern idealism.The movie was much more of an emotional horror that had a completely idiotic and unrealistic happy ending shoehorned in, in which everyone realized the power of love and being a good person and everyone was happy and and accepting there were no more tears ever the end.Really bad. Just... Really bad."}, {"id": 17, "text": "What a pile of drivel this was. You can't spend an hour and a half of a movie with bad acting, with disrespect, lies and deceit and the last 12 minutes, with a few redeeming words and that is supposed to save the movie; and about that the only reason Harper has seen the light was because she was trapped by the situation..Abby showed no self-respect, by turning a deaf ear and taking Harpet back. This movie sends the LGBT cause, back to the closet."}, {"id": 18, "text": "One group loves this movie, the rest of us are still trying to figure out why. OK I did love the nostalgia (for me personally) of seeing the Guthrie Theater in downtown Grove City, PA (one of the more repressive villes I know of, but it is the ancestral home) otherwise there was little to like.As with most people in my group I found Dan Levy and Aubrey Plaza to be excellent. I too felt that Abby and Riley could have found happiness together sharing their common heartbreak.There were so many cliches, so many stereotypes, and how did I miss that Sloane and her husband resolved all their differences in the background while Harper and Abby found eternal bliss in the closing minutes? How did the kids not get into huge trouble for having set Abby up for shop lifting?It was painful, dreadful, slow, and I was really looking forward to a thoughtful and well acted treatment of an important moment. Better luck next year."}, {"id": 19, "text": "Good performances, but a script filled with tired tropes about dysfunctional family holidays which miraculously resolve in the last 5 minutes. Ambitious (at family's expense) father, aggressive you-will-be-nice mother, family members lying to each other all over the place, and no real good reason for the main character to actually be in love with her lying partner.The only refreshing parts are the ones exploring the incredibly painful results when a family rejects a gay child. That needs to be explored more everywhere, and while I know not all families reject their gay children, this family seems well-placed to do so except for the last-minute turnaround into mental health for everyone. The only reason this is two stars instead of one is that the attempt to explore this aspect was ok.My biggest beef: Why on earth does Abby love her partner? Liars rarely confine themselves to one area of their lives, and we never see what makes the relationship important to either of them. We're supposed to simply accept it as a given and be surprised when lies and dysfunction abound.And, MY biggest beef: no real character development. Just character about-face at the last minute. Someone needs to inform the writers that development is a process, not an event."}, {"id": 20, "text": "Last year, we had Last Christmas for the annual holiday season movie, with the charm of Daenerys Targaryen. This year, the charm is doubled, in Happiest Season, with Bella Swan the converted vampire and Grace the latest version of bionic woman (in Terminator: Dark Fate). The stories are quite different but both are reasonably enjoyable holiday fare.In my headline, I made reference to the 1967 movie about a girl bringing a black boyfriend home to meet her parents. Times have changed. The parents in Happiest Season are perfectly happy with a black son-in-law, even when his genes dominated her daughter's in the twin grandchildren. The issue now is coming out.Abby (Kristen Stewart) plans to propose to Harper (Mackenzie Davis, hardly recognizable from her role in Terminator), after spending her meet-the-parents vacation over Christmas. The little twist is that it is only when they are about to arrive at Harper's parent's house that she tells Abby that she had lied about coming out with her parents. Somewhat shocked, Abby resigns to making the best use of the situation to get into the good books of the parents, and have coming out and proposal after Christmas, in that order, quite obviously.There are subplots and support characters in abundance but I have covered all you need to know about plotline. A lot of this movie looks familiar, even cliché. But it has its little charms here and there, cruising into the mandatory happy ending, offering generous portions of ingredients in tune with the holiday spirit: love, forgiveness, reconciliation, positive vibe and so on.Stewart and Davis have done well, even with some of the awkward scenes they are written into. Mary Steenburgen and Victor Garber are just about the best veterans you can find for the parents. The rest of the large support cast generally delivers what is required to hold this movie together into a feel-warm holiday season flick."}, {"id": 21, "text": "That was quite frankly terrible. Full of horrible characters depicting awful behaviors, and a wholely farssical plot. I'm so disappointed."}, {"id": 22, "text": "Pathetic screenplay, unlikeable characters, and a tremendous waste of talent from a cast that could have been great in the hands of competent writers."}, {"id": 23, "text": "The family in this movie is detestable with zero redeeming qualities. Kristen Stewart, Aubrey Plaza &amp; Dan Levy are the only likeable characters. And that's not enough to make this movie watchable let alone enjoyable."}, {"id": 24, "text": "I don't know why anyone thinks is lighthearted holiday fare. It is one of the most depressing and aggravating holiday films I have ever watched. There is just so much heartbreak and a lack of joy, and not at a lot of holiday fun and romance. I loved the representation for the LGBTQ community, but this movie was not what I hoped it would be. I wasn't looking for a Hallmark or Lifetime cloyingly sweet Christmas movie, but I at least expected some romance in the middle of the movie. What I got was like watching my family if a movie was made about us."}, {"id": 25, "text": "In the beginning of the film i was thinking and predicted that this movie is gonna be bad or just alright, well surprisingly this movie is very good, as the movie progesses this movie become more entertaining, funny, and more intense, Kristen Stewart perfomance is pretty good, Mackenzie Davis performance is amazing, the supporting actor and actress especially Mary Holland and Dan Levy perfomance is amazing, they really funny, i really like both of them, this is a very good holiday movie"}, {"id": 26, "text": "Slow, dim witted, no character development, no believable comedy, no script, no believable gay relationships, JUST A WHOLE LOTTA NO NO NO'S"}, {"id": 27, "text": "I see a lot of reviews here saying they did not expect this movie to be good and I have to agree. I put it on while I was working and barely paid attention. By 15 minutes in I turned it off to watch it later, knowing it was something special that deserved my attention. This might be the first time I have ever seen Kristen Stewart look comfortable in love on screen. Alison Brie &amp; Dan Levy are hilarious as usual and Aubrey Plaza brings a down to earth, calmness to the film, providing Abby with the only true support for most of the movie. Im giving it an 8 because it was slow in some parts but overall this film was delightful. When the credits rolled I tearfully looked over at my boyfriend who was crying as well. He said this is now on our holiday movie list every year!"}, {"id": 28, "text": "How was this movie made? The characters are terrible. I dont believe the story at all. Utter fail."}, {"id": 29, "text": "9/10 - heart-warming, hysterical, and groundbreaking holiday flick is an instant classic thanks to a standout performance from Mary Holland and its themes of acceptance"}, {"id": 30, "text": "Such a good movie. Thought the plot and acting was amazing. The lgbtq representation was really nice to see in a christmas movie which we never get. Also has some great humor in there as well and a great cast. Overall i loved it!"}, {"id": 31, "text": "I hated this movie. I was so close to shutting it off halfway through and pretending it was all just a nightmare. The characters are shallow, the writing is terrible. There is no reason anyone should be condoning toxic relationships. And that's what this movie does.You can't spend the last 10 minutes in a film just showing happy people and pretending that all the awful things before that didn't happen.The characters all got over the pain they endured way faster than I could get over the pain I endured from this movie. It's been 3 hours since I finished the movie and I'm still upset. So how could Abby just take back Harper after 10 minutes."}, {"id": 32, "text": "The only way this movie got a 5 or higher was on the coat tails of Dan Levy and Kristen Stewart. Dan coming off of the Schitt's Creek.f"}, {"id": 33, "text": "What a depressing movie. Other than Aubrey Plaza and Daniel Levy, no likeable characters in the movie. Stay away from this one."}, {"id": 34, "text": "This film is a great feel good movie, but it doesn't let its characters off the hook too easily either. Everybody gets their story here and it's so compassionate to all characters. It's got a fantastic cast (Aubrey Plaza! Dan Levy! Victor Garber! Mary Steenburgen!) 100% recommended."}, {"id": 35, "text": "Daniel Levy was the only redeeming part of this movie and he was barely in it. If you think you know where the stories is going, don't waste your time actually watching."}, {"id": 36, "text": "The acting is absolutely horrible except for Aubry Plaza."}, {"id": 37, "text": "I loved this movie! It captures so well the stress of hiding a part of yourself from your family (and being the partner of someone who isn't out), but also doesn't force the idea that coming out = loving your partner enough. As Daniel Levy's character said Everybody's story is different, if your partner doesn't feel comfortable telling their family yet, don't pressure them, but if you don't feel comfortable being in that situation then it's okay to say that you need to be with someone who is more ready.The actors did a great job, the characters got me very emotionally invested and I felt like I was apart of the story. The storyline is a bit predictable and cliché but it was still done well and I loved the happy ending."}, {"id": 38, "text": "This film had potential, it was funny at times and wasn't filled with cringey lines or over done. My problem was with the relationship itself, I didn't even want the two to end up together, at least not right away. Harper was not a likeable character to me whatsoever, after lying time and time again, and pushing away Abby as much as she did. I was not rooting for her in the end, I think Abby put up with too much and I wanted her to stand up for herself walk away. The family also didn't treat her well at all! Very frustrating."}, {"id": 39, "text": "I initially wrote this one off as another contrived Christmas romance movie, and I was also expecting this to be another contrived LGBT romance as well. But I was surprised at the sensitivity that the film sometimes demonstrated. Certainly, it was a bit cliched, but not harmfully so. A wonderfully fun and heartfelt film, to be sure. It's one that we need in this year."}, {"id": 40, "text": "With a cast like Dan Levy, Aubrey Plaza, and Kristen Stewart and a story written by Clea Duvall - I had high hopes. A nice cheesy christmas movie that just so happens to involve lesbians should have been a big win. Many, like myself, were rightfully disappointed to find out it would involve the over done being forced back in the closet cliché but gave it a shot anyways. Not worth the benefit of the doubt. It displayed nothing but toxic behavior/relationships, over-the-top dialogue, and nonsensical interactions for the majority of the story. That being said there were still ways the movie could've somewhat redeemed itself but it instead offered a one-dimension happy ending that tried to tie every negative aspect of these people's lives into a pretty bow. The ending lacked depth, ignored highly problematic behavior, and provided a resolution that was both phony and undeserved. Overall disappointing."}, {"id": 41, "text": "Lots of hate in the comments but the movie slapped as far as im concerned. no one wants to lose a family and homophobia makes you scared like that, so i don't know what are ya'll expecting from us who are in similar situations. harper did what she had to do."}, {"id": 42, "text": "A movie that you can really enjoy. Christmas or not. Gay or not. And I haven't seen Kristen Stewart this attractive before."}, {"id": 43, "text": "There are some good messages about inclusiveness and a Christmas energy that makes this film hum along. It's pretty funny and I enjoyed it up until the ending.Harper is portrayed as a generally terrible person for most of the film and a quick speech at the end doesn't redeem her enough to justify Abby staying with her. Kristen Stewart honestly had more chemistry with Aubrey Plaza's character and this film could've taken a bold direction in having those two end up together. This doesn't ruin the film, but just hinders it from becoming a real Christmas classic."}, {"id": 44, "text": "Where to begin. this is one of the best films i have seen all year, though admittedly i am a tad biased because of my undying love of kristen stewart, and the fact that i have been waiting five months for it. regardless, never have i felt so represented by a film before, many aspects of this film encapsulate my story. it's done beautifully - far better than anything i could have possibly imagined. it's a heartfelt, genuinely funny film that was exactly the kind of media that could have changed my life aged 13. i am so unequivocally grateful to Cléa DuVall for the creation of this movie. i'm not sure if i'll ever have the words to describe how important this movie is, but i can say that i recommend it to you, and would do so a million times over."}, {"id": 45, "text": "I honestly haven't related to a movie as well as I do to this one. Especially to Harper... my parents are me as the perfect child and I feel if I came out as anything but straight I wouldn't be good. I have this big crush in this girl but again I can't have her because that would not be what my parents want. Anyways I love this movie and the storyline and I may have cried a bit! 10/10"}, {"id": 46, "text": "What are you looking for? Hallmark movie? It's better. When Harry met Sally? It's gayer. While you were sleeping? It's funnier."}, {"id": 47, "text": "Wow! I didn't think I would love this film as much as I did. Not only is it sweet, but it's also hilarious, and it's never cheesy (unlike The Christmas House on Hallmark, for example). It brought a tear to my eye. Not only is this the most beautiful Christmas film I've ever seen, but it's my favorite film of the year so far."}, {"id": 48, "text": "If you seen one of these LGBT movies, then you saw them all. One person is in the closet and the other person isn't. Now they must pretend not to be a couple. The truth comes out in the third act and the family changes its values. This isn't real life, this is a fairytale. The family wouldn't change their beliefs because their daughter wanted them to. This is a lie. Also, this movie isn't funny or well-acted."}, {"id": 49, "text": "I gave this movie three stars, one each for Daniel Levy, Aubrey Plaza, and the criminally underused Michelle Buteau. Why even cast someone as great as her if she gets 20 seconds of screen time?The direction and script are both flat and uninteresting. The lead couple's acting was unfortunately terrible. Did they leave a lot of the cutting room floor? Family members left the room and went to bed instead of finishing the movie.I wanted to at least like this movie. It was terrible."}, {"id": 50, "text": "Happiest Season is very fun and made by people who understand what the characters are going through perfectly, which is so important. Kristen Stewart is amazing and has been so for a long time now. Daniel Levy is absolute comedic gold as well. It made me laugh and cry all throughout and I am so happy that this movie got made."}, {"id": 51, "text": "I gave it three stars: 1 for Kristen Stewart, 1 for Dan Levy, and 1 for Aubrey Plaza. I should give one for Mary Steenburgen but this movie doesn't deserve the 7 star rating it has, so someone has to sacrifice.Overall this movie has such a good message but it's executed so poorly. For 3/4 of the movie they work off this cringe comedy angle, but the real cringe is the poor writing and utterly disgusting plot. There are a few moments that meet expectations but they are preceded by insane and unrealistic moments. This was a lame waste of time that lets you think it's going to turn around at some point."}, {"id": 52, "text": "This was a beautiful story and often hilarious. I shouldn't have to say this, because it shouldn't matter whatsoever, but I am a straight male. I want more stories that show that love should absolutely span gender, orientation and race. Best holiday movie I have seen in years. I feel bad for criticizing Kristin Stewart for her earlier work, she was good already, but really shined with something that connected with her. Lastly, Dan Levy is fantastic."}, {"id": 53, "text": "If you like cheesy rom-com movies then you might like this movie. I only watched because I likes a lot of the actors. It starts out alright but then the second half us honestly so cringe and cheesy that I was embarrassed my husband was in the room while I was watching it. So if you hate Christmas cringe then definitely skip this one."}, {"id": 54, "text": "Great emotional complexities of coming out. the acting was superb, and dan levy is one of my favorite human beings."}, {"id": 55, "text": "I wanted to love this, but it was just meh. I think the concept and the premise of the movie were good, but it was poorly executed; it started very christmasy and then i guess they forgot about that. i really didn't like Harper and Abby together, they never made it clear why they were together in the first place. Aubrey Plaza and Dan Levy were amazing, their characters made the movie more enjoyable. i don't know why, but i thought Kristen Stewart did a really mediocre job, her face literally changed 2 times. they wrote a lot of things in the script just so that the movie would be longer and that was really annoying. i guess the movie is ok if you want some light rom com attempting to have a christmas theme."}, {"id": 56, "text": "Happiest Season has a lot of the hilarious awkwardness of Meet the Parents with the added twist of two closeted girlfriends. It's got some very funny moments, though usually farcical. In contrast to Meet the Parents, this one is missing some credible subtleties. Would be in-laws are clueless, but dialog is less ironic when they're over-the-top, ultra-clueless."}, {"id": 57, "text": "Really want more from this film. Was cute but felt like it was missing something... Daniel Levy &amp; Mary Holland are the only reason why this film didn't completely sink!"}, {"id": 58, "text": "Happiest Season - A- (Almost Perfect)One of the best movie of the year sofar. The movie perfectly captures Guess who's coming to Dinner and Meet the Parents vibes while bringing it's own heartwarming and hilarious tale of sister rivalry and competitors mentality. You never felt being lectured, and lesson of self acceptance is perfectly resonate with viewers.Kirsten Stewart was the true shinning star of the movie, her comic timing and awkwardness perfectly shows how one feels meeting the family of significant one on major holiday season. Mackenzie Davis, Alison Brie, Aubrey Plaza, Mary Holland, Victor Garber, Mary Steenburgen and Scene Stealer Dan Levy were all absolute blast. I was laughing out loud, Clea Duvall has directed really charming feel good movies. Which requires repeat viewing in holiday season."}, {"id": 59, "text": "I'm genuinely surprised by all the negative reviews on here. I really enjoyed this movie. It's both funny and serious- there's a good balance between the two. There's also a lot of casual queer representation, and it never felt preachy to me (which I guess is what some people are complaining about)? If you're not going to watch for the plot, at least watch for Dan Levy and Aubrey Plaza- they are definitely the best pets of the movie."}, {"id": 60, "text": "Not the holiday movie you need to see. If it weren't for Dan Levy, it wouldn't be worth watching. Just not good writing."}, {"id": 61, "text": "Loved the simple, human concept of telling your parents at Christmas you're a lesbian. I think there were a million fun situations they could have gotten into before they decided to tell them, but her being outted by her sister took away the responsibility of the character coming to her own decision. This does happen and is heartbreaking, but isn't easy to do so in a script that badly needs that moment. The two sisters were kind of throw away c-plots that didn't go much of anywhere... one is getting divorced, one is mad she is getting overlooked/writing a sci-fi book for some reason. The kids that frame Stewart's character just shrug off they stole it and move on without remorse of consequence. The parents go from extreme blamers to totally okay with a new lifestyle rather quickly. While I'm okay with their coming to grips quick due to time constraints of a feel good Christmas movie... the character/plot elements weren't set up enough in advance to make this feel legit. Don't get me wrong... there is plenty to love... Kristen Stewart is always great in indie/low budget work and her character keeps things moving (although it should be both leads that do... maybe that's the real issue). Dan Levy is great, but is on the phone taking care of fish for the first half of the film... we needed him to somehow be along for the entire ride. Aubrey Plaza plays a great role of the ex that takes Stewart out for a good time. These scenes are the real and lively stuff I needed more of. The at-home scenes with the family comes off as hard to get into, plastic, broader strokes. Love the message of being your true self, just wanted more characterization and more fun to be had with the awkward moments."}, {"id": 62, "text": "Our family was so excited to watch this. It was terrible: the writing, the character development, the ridiculous sudden change of everyone's characters in 5 minutes at the end, the gaslighting. Ugh. It could've been so good! Not worth it."}, {"id": 63, "text": "This movie is barely a step up from a throwaway Hallmark Channel flick. This has some of the cringiest humor sourced from buzzwords and stereotypes of what producers must think young people sound like. None of these characters feel like real authentic people, none of them are fun or relatable, and it's a waste of all of these talented actors' time. Dan Levy, Kristen Stewart, and the rest are much better than this."}, {"id": 64, "text": "I was willing to love this. But in the first 15 minutes we could sense the desservice. The way they use the story of Abby's dead parentes is just so insensitive. And the hole plot of the movie is shaming LGBT+ women, which makes you cringe all the time. It's not funny or beautiful. It's just torture. We don't need more coming out stories, specially if all it does is show us an abusive relationship and agressive family, just for in the last few minutes force us to swallow the complete transformation into a happy loving family. No. I don't but it. That's not love. Happiest Holiday? Really? Was NOBODY there to warn???"}, {"id": 65, "text": "For a love story its pretty lame. Not believable at all. One of the leads is either nervous through the entire production or just can't act."}, {"id": 66, "text": "This movie is full of unlikeable characters and after all the abuse the main character took, she stayed with them in the end. What a nightmare."}, {"id": 67, "text": "I watched this movie for Dan Levy, and he did not disappoint. He is a national treasure and deserved more screen time. Kristen Stewart wasn't as bad as I thought she would be. Aubrey Plaza was a delight. I love the rest of the cast, but their characters were annoying. Harper was an absolutely horrible girlfriend, and I was actually rooting for Abby and Riley to end up together instead. Overall, not that bad of a movie because I'm just happy to finally see an LGBTQ Christmas rom-com, but this could have been done so much better."}, {"id": 68, "text": "A young woman cares more about her pretentious status obsessed family than her girlfriend. None of this is believable. The wrap-up everyone learned their lesson and is a good person now was so underserving. It may also be the whitest upper middle class story ever told. A conservative fantasy for people who don't deserve one."}, {"id": 69, "text": "In comparison with other tv movies such as The gambit's queen, Happiest season appears a total failure. Stewart needs better directors and screenwriters."}, {"id": 70, "text": "There are better ways to spend your time.This is the LGBTQ (etc) version of Meet the Parents but it just missed the mark. It had some nice moments and some funny moments but overall just not great. How this movie is a 7/10 right now is beyond me."}, {"id": 71, "text": "Sadly sad And the worst thing is that this is the most common in this world... The more I know about people, the more I like my dog. - Mark Twain"}, {"id": 72, "text": "Holiday movies are always filled with awkwardness, secondhand embarrassment and cringeworthy moments. This movie is no exception but unlike many others, these intense moments are very realistic and likely relatable to many in the lgbt community. I enjoyed Kristen Stewart and Aubrey Plaza's performance and feel they did a wonderful job portraying the emotions that come with a story of this nature. Anyone who has had to come home with their partner and pretend to be a friend can understand what this movie was trying to portray. Overall enjoyed the movie!"}, {"id": 73, "text": "This is a hilarious holiday film that I can't wait to rewatch over and over again. I know that people are mad about how this film ends and who Abby gets with but I am someone who supports who she picks because it takes a lot to come out to people and for Abby to stick by her is very admirable."}, {"id": 74, "text": "Let's be honest.. I only really watched it for Dav Levy. The movie is terrible otherwise. Kristen Stewart has half an expression throughout and is perpetually annoyed, confused, awkward, demanding and irritated.. like she is in all her other movies. Script and treatment is just meh - it's forceful. All the characters and situations are so deliberate and predictable. It's forcefully trying to prove a point and it's unnecessary. I'd say it's nothing less than a Hallmark Christmas special, if you're into those overly directed and poorly scripted movies - you'll be into this!"}, {"id": 75, "text": "The idea was there. And it was a good one. But the execution was very poor.It took until the last 30 minutes for any of the characters besides Abby to be likable. And I still strongly dislike Harper. I think that this should've been one of the movies where the main couple break up and grow from the experience. All of the characters were just too intense. The plot wasn't grabbing. And I spent the majority of the movie rooting for the characters to break up. This is not how a holiday romance should be, gay or not. But kudos for the attempt at representation (and the fantastic and memorable line delivered about coming out to one's family). I hope we can get some better ones."}, {"id": 76, "text": "I guess this was the exact intent of the director and it's obviously a commercial success, but this kind of movies (and there are a lot...) just can't possibly be worth more than 6/10 in my world, so yay, this one got the maximum possible score. Both lead actors can be much better if given the right material but considering what they got, they did good. Just know what to expect and you won't be disappointed. If you haven't watched many of this kind of movies probably you'll even like this one a lot and it's okay, please just remember that movies can get a whole lot better and real."}, {"id": 77, "text": "Dan Levy made it for me. Kristin too. But it's crap. Lame and predictable. Sorry. But I would have stopped it had it not been for the two actors above."}, {"id": 78, "text": "Kristen Stewart is an incredible actress. Loved this movie and hope to see more holiday and LGBTQ movies and series from Hulu soon!"}, {"id": 79, "text": "Loved this movie so much. Finally we get Kristen Stewart right in her element playing that lesbian character we have all have been waiting for! Deff cheesy giggles and yes there is some flaws but I loved this movie a lot. Give it a chance. Kristen and McKenzie's chemistry was pretty good I thought."}, {"id": 80, "text": "Okay regardless of representation, which is good, and done alright, the film, the plot and story itself is mediocre. Opening is good, the rest is filler and suddenly there is a happy ending. It's okay to watch but it's going to be 'one of those christmas films' you'll see on the discount shelves in stores, or you know, the hulu backlog. Sure I enjoyed it and thats good! Not a waste of time. But it really isn't anything special."}, {"id": 81, "text": "At the very first 20 minutes of this movie, I felt unrealistic and bored to death. This movie is nothing about excitement to visiting the family, and having a good time, and seeing everyone for hugs &amp; cheers; it was all about one specific reason for anyone who had a fantasyland of being woke by giving a more attention on someone who are in relationship with same-sex and other one with a couple of WW and BM nonsense, and it was so overheated depression.I would rather to watch Just Friend instead of this one."}, {"id": 82, "text": "I wish I had never watched this. I thought it was going to be good, but the whole time I was cringing. Abby should have left Harper. Harper was gaslighting her the whole time. This movie is so bad. Don't waste your time watching it."}, {"id": 83, "text": "Would give zero stars if I could .Trash film making"}, {"id": 84, "text": "This is not a coming out story, as I have seen people call it. It's a story about a toxic partner lying to her girlfriend, gaslighting her, ignoring her, throwing her under the bus to save herself, and leaving her to the horrible treatment of her family while she hangs out with old friends and her ex boyfriend. We can talk all we want about how terrifying it is to come out to your family, and how everyone deserves to do it in their own time, but that's not what this film is about. We don't see the story from Harper's perspective. We see this relationship through the eyes of Abby. As a queer person, it was extremely frustrating and triggering to watch Abby be put through all this, and then having the emotional manipulation swept under the rug at the last second while Harper's parents did a full 180 and turned into understanding people all of a sudden, only so that the screen writer could say that the film had a happy ending. The way Abby was treated by all of them throughout the film DID NOT set up for such a simple resolve.I love Kristen Stewart tho. That's all."}, {"id": 85, "text": "Aubrey all I have to say she is always fantastic what else to expect"}, {"id": 86, "text": "A lot of people giving this movie a 1/10 saying how far away it is from reality. Newsflash! This isn't based on a true life story! Some people saying how badly behaved the characters were etc, never actually got this movie at all. It's fiction and yes some things are exaggerated. It's like you've never seen Titanic, Love Actually etc, all of which had ridiculous unrealistic moments that would never happen in real life so get a grip. Thank goodness I didn't start watching it hoping for a realistic lesbian love story like a lot of people here commenting on how it's a bad depiction of gay relationships. Get a grip. This is an entertaining and good movie. Don't let the people expecting a boring true to life lesbian love story put you off. Go and see for yourself."}, {"id": 87, "text": "I really loved this movie; I wasn't expecting that much if I'm honest and was worried it would fall into a whole load of cliches, but surprisingly both the story and characters felt original and believable.There are funny moments whilst the movie still takes on the seriousness of coming out, and the complexities of family."}, {"id": 88, "text": "Overall I enjoyed the movie. Kristen being a gay icon gave me life. Aubrey served looks and Dan was great for comedic timing. However Mackenzie Davis, while being a great actress, Harper was not a likeable character. And it has nothing to do with Harper being in the closet. Rather from everything we saw of her, she was a liar and built a relationship based off of several lies. And she really does nothing to redeem herself. Being in the closet does not absolve you of being a bad girlfriend to literally everyone that we were showed that she dated. That being said, I did like the movie and I will be watching it a few more times. I'm very happy that we have it, but we've got to do better with lead characters. Harper made it seem that gay girls should accept whatever from their partner because she's closeted, and that's just not true"}, {"id": 89, "text": "Like others have said, once MacKenzie Davis (Harper) told Kristen Stewart (Abby) that she had not told her parents she was gay I probably should have shut it off. Aubrey Plaza (Riley) and Mary Holland (Jane) were much entertaining characters in the movie. Everyone else and their situations were pretty painfully awkward. Now if you can make it about 3/4 through the movie things start to resolve and it finally becomes a decent Christmas movie that leaves you with some good feelings. Shouldn't a Christmas movie give you good feelings???"}, {"id": 90, "text": "What was everybody thinking when they signed on to this low-budgeted, cliché-ridden mess? Kirsten Stewart, once one of the highest paid stars in Hollywood, has been reduced to this drivel about her girlfriend coming out to her family over the holidays in a one-dimensional plotline that was fresh 30 years ago, if then. Cartoonish characters, silly plot twists, pratfalls, big misunderstandings, the witty, supportive Gay friend, and, of course, the threat of the BIG SECRET being revealed, which will ruin the family's sterling reputation. Horrors! All set against flat, generic production values that scream Hallmark, with truly awful dialogue, dumb acting, and Stewart sabotaged with one of the worst hairdos in recent memory. The entire project is as cheap as it is jaw-droppingly stupid. If you've been stuck in a cave since the last century and have no idea how LGTBQ characters and plotlines in film have advanced, this is the movie for you."}, {"id": 91, "text": "If you need, in your heart of hearts, to see a queer Christmas movie, this might not be a total waste of your time since it is a queer movie taking place around Christmas time. It's not great...it's not even good, and it's more than a little insulting to think that this is what we might have to look forward to as a community if quality continues to take a back seat (or have to be hitched to a poorly rigged trailer with wooden wheels) to the excitement over representation.The Good - the production value is evident and it looks like people spent money to make what they hoped would be a good movie. Levy, Plaza, and Stewart do what they can and the scenes that include any combination of them and only them are ok. The acting isn't great but I blame the writing and the directing more than the actors so I guess you could say that they did a good job since it's not a complete Transmorphers.The Bad - Everything. The plot is not just cliched but also terribly executed. The writing was so bad that the actors, who are all decent if not outright excellent in other films, are called to do too much to make their scenes and dialogue actually work.In 99% of this movie you are given no real reason to root for Harper and Abby. My wife and I spent most of the time screaming at Abby to leave Harper who is a character with no redeeming qualities. We immediately shipped Abby with Riley but, truthfully, it's for no other reason than the fact that Plaza and Stewart have much better chemistry than do Stewart and Davis. The casual toxicity of their relationship and Harper's continuous lack of respect and consideration for Abby is apparent in the set up.She waits until they are on the way to her parents - effectively holding her hostage and putting her in a situation to make Abby feel like the bad guy if she decides not to follow along. Time and again she does nothing to show Abby that she understands or appreciates that she is forcing her to do something uncomfortable for the sake of terribly ignorant and rude people in her family. Every decision she makes in the movie reinforces her selfishness. She's so bad that you also end up losing respect for Abby, the one you're to sympathize with, because you're frustrated at her obvious lack of self-respect in continuing to put up with it all.The rest of the characters are torturously unrealistic and have no depth because of their mouth-breathingly simplistic use as archetypes who only appear or exist when they must drag you through plots and beat you over the head with themes. I'm Sloane, the bitter older Karen-esque sister. I'm her husband, a pleasant and clean-cut black guy who gave the white conservatives beige prop children. I'm super handsome and popular ex boyfriend who is still into you and has the blessing of the family. The only things you can't predict in this movie are the terrible scenes set up to put Abby's character through cringe.The Ugly - As I noted above, for all the hype about representation, this movie disappoints and disheartens. I can already see that people are cheerily settling for this and geeking out over cast and the implications of the film. The story is bad, the characters are bad, the lessons are bad, and what the industry is likely to take from this is that they can keep serving us up some decent representation and we'll forget that we actually have taste. I'm genuinely frustrated at some of the positive reviews and going as far as offering such hyperbolic praise as this is a movie everyone can relate to.... Garbage. Neither my wife nor I relate to any single scene in this movie and that's saying a lot considering the hectic people in our lives."}, {"id": 92, "text": "I can't be the only person who was sincerely hoping that Abby ended up with Riley, right? I loved this movie. Kristen Stewart did amazing. I loved all of the characters except Harper, I hated her character and thought she was awful and manipulative and if I were Abby's friend I would tell her to dump Harper and go out with someone who treats her better."}, {"id": 93, "text": "When watching a light hearted rom/com for Christmas, it is probably not good to be rooting against the main couple. Kristen Stewart is likable and great. Dan Levy is funny and, with Kristen Stewart has a great miment at the climax. However, the love interest Harper has treated Abby (Stewart) so badly theoughout the movie that i was actually irritated at the idea that she would stay. I was rooting for an ending of Levy and Stewart with the dogs and fish hanging out and enjoying Harper drama free time."}, {"id": 94, "text": "An ok-ish Christmas romcom with a lesbian twist. No surprises. Filled with gay tropes. A rushed unsatisfying ending with reprehensible behaviour rewarded by eternal love. Yuk! The occasional laugh occasioned by Dan Levy. He is hilarious. The rest not so much...."}, {"id": 95, "text": "I definitely recommend this one! It has more laughs than I expected, and it also brought out a couple tears. Enjoy and Merry Christmas!"}, {"id": 96, "text": "The cast is amazing and the characters too, but the whole script and the plot is so badly done that at one point you don't know if you are watching a Christmas movie or to a old hypocritical stereotyped tragedy. Please spare me the Lgbt.. I am gay and our community do not want to represented like this!!!!"}, {"id": 97, "text": "39 mins in and I'm still waiting for somei funny to happen !The scene in the store when Abby I caught shoplifting was cringey. Awful attempt at comedy acting.Cod someone post what this was supposed to be . . It's daft.Who is the target audience?What does Abby look like she's just left rehab?Rubbish"}, {"id": 98, "text": "This is a better than average family-centric holiday movie. It's also a succinctly heartwarming story about being scared to come out and live in your truth, whether your gay or straight. We all have secrets, skeletons and aren't perfect in some people's eyes. And even though it centres around a lesbian couple, It just another viewpoint about being human but, also an important film because it represents and we need that now more than ever. But it's not good just because it represents, it's authentically funny and awkward. Frustrating and loving. Dan Levy steals every scene he is in - man does he have a transcendent charisma! And I think this is K Stews best role to date."}, {"id": 99, "text": "Dan Levy is awesome and this literally might be Kristin Stewart's best role. It's a super cute Christmas movie that totally makes me want to forgive Victor Garber for Legally Blonde."}, {"id": 100, "text": "Happiest Season is a funny Christmas film with drama about a lesbian relationship. Some good laughs, fine acting and lovely soundtrack. The cinematography is not that cool... a good film about love between women in Christmas season."}, {"id": 101, "text": "The storytelling is lazy and full of cliches... at no point was this movie romantic or even remotely funny. All the characters are flat and unbelievable. I give 2 stars to Aubrey Plaza for her down to earth performance (which is weird in itself!) and 1 star to the basic idea of a lesbian romcom. Don't bother to watch if you have other options available!"}, {"id": 102, "text": "Kristen did great as Abby but the Harper character was so frustrating. She's a bad person.Abby should've ended up with Riley."}, {"id": 103, "text": "Firstly Clea Duvall is a great director. She already proved this with The Intervention and this movie is no different. Well shot and acted, this film deserves recognition and praise!"}, {"id": 104, "text": "Zero chemistry between any of of them. The only likable character was Jane, also where can I get a copy of Shadow Dreamers? I'd watch that if it ever gets made into a movie."}, {"id": 105, "text": "Happiest Season had a lot of potential but it was dull and full of unlikable characters. For the amount of funny people in the film, it lacked any type of laughs. In fact, you probably won´t laugh at all if you watch the movie. There were a few unnecessary characters which took up too much screen time and led the movie to be longer than it should have been. It´s not the type of movie that after viewing you think you wasted your time with but you begin to think about what you could have done instead with your time. 4/10"}, {"id": 106, "text": "Finally the lesbians have a freaking happy ending! Im sick of lgbt movies where one character either dies or decides to be straight in the end. This movie does a great job of not doing those things. There's drama, but it has meaning and ultimately, a happy ending. Acting is mostly good especially from Kristen Stewart, and writing gives purpose to scenes. The only reason I'm not rating this more than 8 is because they could have spent 10 extra minutes redeeming Harper a bit more. It doesn't make as much sense for them to just get back together and everything's fine after Harper doesn't even treat Abby like a good friend through out the movie. I get lying to your parents because your scared, but she didn't even treat her as well as a friend should because that's what they supposedly were. That being said, this is going to be in my collection of Christmas movies for a long time!"}, {"id": 107, "text": "It's about time that lgbt people were better represented in holiday rom-coms. Yup, it's a christmas movie so it is highly predictable. However the cringe ia real, in a good way. Everyone worked together on this and it's satisfying. Well done."}, {"id": 108, "text": "It's about time there was a really good lesbian Christmas film! Quite a few original ideas in this story, and some really good topics brought up (Dan Levy and his words of wisdom!) that ended perfectly for a holiday film. Absolutely loved it. Laughed all the way through and was satisfied in the end. Highly recommend!"}, {"id": 109, "text": "So lovely and refreshing to see a gay Xmas movie that's well made, well acted and directed. Xmas hats off to all involved and I'm so happy that my awful 2020 year ended with this beautiful little gem that promotes happiness and love in all its guises. I love the Xmas movie Family Stone and this is now second on my list of all time favourite Xmas movies."}, {"id": 110, "text": "Just when you thought you couldn't hate her more.. Kristen can't wait to show off being a lesbian."}, {"id": 111, "text": "It's a fun watch when you can't sleep at night and need a distraction. Harper's character is so unlikeable and after a while she started looking like a man in drag. She's tall! Stewart was fine in this. Levy is always a joy. And Aubrey, big fan."}, {"id": 112, "text": "Man, had I been looking forward to this movie. A romantic Christmas movie with lesbians? Yes, please!I was really hoping for a feel good, happy-go-lucky Christmassy romance flick but I ended up feeling mostly conflicted. Harper and Abby's relationship seemed kind of... off. I was never really sure if I was truly rooting for them. Harper comes off as quite unlikeable 90% of the time and she treats Abby pretty terribly. I mean: you drag your girlfriend of a year into Christmas with the family she's never even met, under false pretenses, forcing her to lie about her identity and pretend to be someone she's not? Yikes... That doesn't seem right. Giant red flag, basically. And that isn't the kind of thing I was really hoping for with this film. I was hoping for humour (there was some, admittedly), some goofy moments, a grand reveal, and a beautiful romantic ending. Genuine and heartfelt emotions. Instead, we get a movie filled with angst and in the end there's a somewhat happy ending, I guess? But I felt like Abby had doubts until the very last moment and that absolutely ruined the romance for me. If you're not sure if you want to be with someone, then I'd say that person is not the one for you. But maybe I'm being too cynical.Like many other people have already said: Abby should've ended up with Riley. They had more chemistry in their few shorts scenes than Abby and Harper in the entire movie. Riley was always friendly and honest towards Abby, unlike Harper. It seemed like they had a real connection, but in the end I guess that didn't matter at all. All Riley's purpose seemed to be was show us and Abby that Harper is actually kind of a terrible person.Ugh. I feel kind of dissatisfied. Can't us lesbians just have a really cute, romantic, stress-free WLW movie for a change?I'm giving this a 7 because the acting in this movie was good and there were some pretty entertaining and funny moments. Kristen Stewart was good in this. Very nice to see her in a role that seemed genuine and heartfelt. Also, Jane and John were amazing characters. Jane's the best. Dan Levy is a delight, as well. And of course, seeing Aubrey Plaza act is always a treat."}, {"id": 113, "text": "Originally intended for theatrical release this charming LGBT Christmas movie explores the struggles many of us gay people face when it comes to our families and the holiday season. Starring Kristen Stewart as one half of a lesbian couple who is invited by her girlfriend played by Mackenzie Davis of Terminator Dark Fate to spend the holidays with her family. Along the way she tells her that the family doesn't know shes gay or that she's bringing her girlfriend. Funny scenarios as well as heart wrenching ones ensue. The movie is quite refined in the way it explores its subject matter and for that reason, that's what sets it apart. The brilliant Dan Levy of the phenomenal Schitts Creek stars as Stewart's gay bff. Mary Steenburgen (book club), Allison Brie (Glow), Victor Garber and an awesome Aubrey Plaza also star. The film is director confidently by one of my favorite actresses Clea Duvall. It's definitely a must see.****.25/5"}, {"id": 114, "text": "Enjoyed this film, great to see a Christmas movie with LGBT characters! Both funny and emotional, lovely watch with a loved one :)"}, {"id": 115, "text": "This was really cute and while it followed some similar tropes: couple visits the family for Christmas, but WAIT, one person didn't share all the details, it did so successfully and had enough alterations to make it really enjoyable. Clea Duvall put together an impeccable cast and every single character was interesting and creative, except maybe ex Conner. He was meh. Straight men often are :) Kristen Stewart continues playing the same character she has always played, but the rest of the cast more than suffices. Special mention to Mary Holland, who played a funny, charismatic, and endearing third wheel sister. Super fun, super cute, and very entertaining."}, {"id": 116, "text": "This movie is really great. The characters are unique and great. the writing is mature and funny. Remember going into the movie that it still is a christmas rom com so don't criticize every little thing. I enjoyed this movie dearly and I know that people don't want to watch people coming out anymore. I get it and it's a fair thing to want but don't let that be the reason to not watch this movie."}, {"id": 117, "text": "What can I say about Happiest Season - it's fun, easy to watch, proper enjoyable. It makes you laugh (Daniel Levy is hilarious, I laughed at just about everything he said) and makes you cry. Sure,its filled with clichés but it works. I felt it honoured important subject matter while being funny Xmas movie you can enjoy year after year."}, {"id": 118, "text": "I'm not even sure where to begin. This whole movie was a mess, and it romanticized toxic relationships. I was rooting for Aubrey to get with Harper's ex the entirety of the film, and I was disappointed when she stayed with her manipulative girlfriend. Now I could write an entire essay on everything wrong with this movie. Instead, I'll list several events that triggered my fight or flight response.-Harper waited to tell her girlfriend about her family until it was last minute.-She then follows it up with the statement that she never even came out to her family to begin with. In other words, she had lied to Aubrey before their trip.-Harper's ex's were EVERYWHERE. Poor Aubrey. Harper never once told her ex boyfriend to back off. Rather, she let him get close and touchy all the while knowing that her girlfriend was right there. Yikes. -Whenever Aubrey tried to voice her complaints, Harper would kiss her and tell her not to worry. Not once did she try to have a discussion with her girlfriend.-The children of Harper's sister slipped an item into Aubrey's purse, leading her to get caught. This caused the family to treat her like a black sheep (well, she already was one), and Harper never defended her. She let her family ostrasize her girlfriend. -Harper's jealousy got to be too much. It's okay if SHE hangs out with her ex boyfriend (who is very clearly making moves), but the moment Aubrey hangs out with the ex girlfriend of Harper, it gets to be a problem. Seriously? You treat her like an outsider and get mad when she finds someone to connect with? Grow up.-This follows Harper's jealousy scene. She has the nerve to tell Aubrey that SHE needs space. She gaslit her girlfriend all because she was jealous despite having continuously acting out of line.-This is my last one otherwise I'll write about the entire movie. Everything gets solved with a little speech by Harper. Aubrey is finally ready to leave until Harper talks about how much she loves her girlfriend. And imagine that, everything is solved. Ridiculous.The only enjoyable parts of this movie were the scenes with Aubrey and the ex and the scenes with Aubrey's best friend. The rest of it was just a toxic mess with a sloppy resolution that somehow made up for Harper's manipualtive actions. Everyone is open to their own opinions, but I do not reccomend this movie. Is it too much to ask for a wholesome lesbian movie that does not revolve around coming out? This movie was a joke, shame on the director, and I sincerely hope that this doesn't enforce the stereotype that lesbians are toxic. We just want good representation, not this bull."}, {"id": 119, "text": "I really don't understand all the negative reviews. I thought this was fun, light-hearted and refreshing for a Christmas movie. I loved anytime Kristen Stewart was in a scene. I thought her relationship with her girlfriend was genuine and I thought overall the plot was different and interesting. I will definitely be viewing this again around Christmas time."}, {"id": 120, "text": "I watched it and loved it. It could become classic. The cast and the performances are excellent. The setting, script and atmosphere are magnificent. It is a real christmas movie with everything in it. I felt warmth, happines and enlightment watching it. It is the HAPPIEST SEASON with a great movie. Enjoy."}, {"id": 121, "text": "This movie was fun. I enjoyed the sarcasm, family drama, and romance. By far one of the best reality check coming out movie. Because it felt sooo genuine to the character being played. Anyways, smoke some ganja and watch this movie- the laughter level will triple lol! (A must watch)'"}, {"id": 122, "text": "I don't usually ship... but I ship Abby and Riley. Otherwise, this film is pretty good. Decent acting, typical storyline, and a great cast. Dan Levy steals the show and Kristen Stewart surprisingly displays a range of emotions. Well done all."}, {"id": 123, "text": "An easy 10 stars. best movie of the year! bravo! bravo!"}, {"id": 124, "text": "Just trash, full of cliched and tired tropes. Do not waste your time!"}, {"id": 125, "text": "Whilst the movie was boisterously priceless, it didn't lose the emotional reality. A predictable, but classic, movie which melts your heart with the love potency showed by various characters, especially the main couple. The film is filled with a lot of emotions, almost bottled up. This film is a movie about learning to open up, deals with an intimate dilemma a lot of people relates to. 'Happiest Season' is a heartwarming romantic comedy which might even fill you up with mixed emotions."}, {"id": 126, "text": "Even Dan Levy and Aubrey Plaza couldn't even save this disaster of a film. Funny it was was not! Not only did I not laugh, but I had a hard time rooting for anyone in this film. The entire family was so unlikable, the only interesting character was Jane, who they treated like crap and couldn't even bother to acknowledge her. They took superior entitled as...... to a new level. Why do they keep giving Kristen Stewart acting jobs? Her acting has to be one of the worst out there. She had the same depressing mellow tone expression throughout the entire movie movie."}, {"id": 127, "text": "The most disappointing and depressing (Christmas) movie I've ever watched."}, {"id": 128, "text": "I should have known when every establishment journalist wrote the same article the same day about how this is an instant Christmas classic and will be your family Christmas movie forever more that it was being over hyped.This isn't quirky, this isn't cool, and the beaten trope of how hard it is being the most powerful demographic on earth is just an exhausting lie we're told over and over again.If you think for one second being pretty, female, and gay will ever hold you back then you fail to understand the human psyche at all. I've never found the need to hold my identity out there to justify a view and I won't start now, but there are no barriers or limits on pretty women's lives, gay or not. We're the most privileged class of human that exists."}, {"id": 129, "text": "I liked the movie so much, and it was sweet to see kristen stewart and mackenzie davis as a couple i've always picturing them in that way, so emotional and fit. Almost everyone's preformance is pretty good, the couple for sure and the famliy and by the way dan levy! OMG!! High sence of humor he was pretty damn good, mad me laugh from heart."}, {"id": 130, "text": "But I couldn't. Mackenzie Davies was stiff and uncomfortable even before she was with her family when it would've been understandable. The family dynamics and plot lines were so cliched they weren't even worthy of a Hallmark movie. I think it showed in the actors performances. Kristen Stewart gave a great portrayal of someone being pushed back in the closet to protect her love and getting no love back for her sacrifice. Dan Levy is always a delight and his moment of explaining how everyone's coming out story is their own journey was heartfelt. Really wanted to like it more and see more of the friends than the tired family drama."}, {"id": 131, "text": "This film made me to enjoy and remember some good feeling that I forgot. These movies make me think of how beautiful it is to love someone even if there are many difficulties infront of you and your love to show how happy you are with the each other. This didn't work for me, I'm 27 tried many time to find the love of my life. Asked many who had good personalities and likable to be with but I got always a no. Many many times that I tried that it finally got me to a bad situation. I lost all my expectations. I lost the feeling of love. I had best degrees in college but I failed all and came out of college. But even for me who has the least emotions and feelings about love I wanna say that it is so beautiful to watch it. Reminded me of my old me."}, {"id": 132, "text": "Just watched Happiest Season and I started the moving smiling and ended smiling as well. It's just so adorable and heartwarming. I LOVE IT SO MUCH!! Jane was the only sane person in that family, to be honest lol The rest was crazy af, but they made up for it in the end. And Abby is the most understanding and patient person I've ever seen. I bow down to her. Kristen did an excellent job! And omg she is so smol!! my baby! BEST CHRISTMAS MOVIE 💛"}, {"id": 133, "text": "Love Kirsten Stewart; she was great, and Mackenzie Davis just fantastic!!! Great acting, Funny and quirky!!! Great 2020 Christmas movie!"}, {"id": 134, "text": "Its amazing, if you're having second thoughts just because these coments are mean, go watch it"}, {"id": 135, "text": "Well that was nearly 2 hours of my life I'm not getting back. I took a chance on this based on a well edited and funny trailer I watched this week - if only the whole movie was as good. But it's not. It's painfully unfunny with the exception of a couple of Levy's quips - this guy's good, I should check out more of his work. But I digress...The other reviews are pretty much correct - the only saving graces are Levy, Aubrey Plaza and sometimes Kristen Stewart. The rest of the cast are sleepwalking through the film - Victor Garber, what the hell was that, man?Avoid this, save your $$ and just wait for Wonder Woman next week."}, {"id": 136, "text": "I watched this for Dan levy.. and he never disappoints. However everything about this movie disappointed me. Dan levy, how could you be in a pile of trash like this?! The movie was full of terrible innuendo one liners meant to be clever that continuously miss the mark. Every character in the family was awful. They were the most horrible humans ever imagined yet we are suppose to like them at the end because they all accepted their failures?! Not worth the watch. Everything great about Dan levy is seen in the trailers. I might have enjoyed it more if Kristen Stewart's character had more self worth and left her love interest and her horrible abusive family."}, {"id": 137, "text": "I liked the first five minutes of the movie. The rest was just fake people pretending happiness during the happiest season. Failed to make me laugh, cry or create any other feeling I want to associate with christmas."}, {"id": 138, "text": "Maybe ever? Written at a fifth grade level. Mannered acting. Caricature acting at best. Like watching Disney or an after school special. Reminds me of the incredibly stupid network sitcoms from the 1970s and 80s."}, {"id": 139, "text": "Guess this is comedy now? Then why didn't I crack one smile? Is this people's idea of romance now? Just because the main characters are gay I must automatically root for them? Also, some reasoning is missing here. Why the heck does everyone hate on Abby and is mean to her? Why are Harper and her sister always fighting? Why doesn't Abby stand up for herself and defend herself? Is there a back story to all this? I WANNA KNOW thank you!!! This movie is SO bad, it triggered my anxiety as I was halfway through. If I could give it half a star on imdb, i would. I hope people's taste in movies doesn't get ruinned by movies like this. I hope there are still people out there who have at least slightly higher standards. This movie is living proof that talent is worthless these days and connections do all the work, otherwise how on earth could they get the budget to make something out of this script?"}, {"id": 140, "text": "This movie was amazing and I loved every minute of it. So funny and heartwarming."}, {"id": 141, "text": "As a fellow LGBTQI+ member, I really did love watching this movie so much. I think that Kristen, Mackenzie and the whole cast and crew did an excellent job in portraying their characters. The whole production was very simple and clean, the pacing was not too bad. I actually thought it was excellent.The mise-en-scene, costume, set, props, camera shots and cinematography does capture the aesthetic of the film - as being Christmas and all, and it does really make you feel like home.Also a bonus if you could watch this with your loved one, friends or family.Overall, I do recommend to watch this film. 8/10. HonestReviews."}, {"id": 142, "text": "I reall loved this film it was perfect. it's my new favourite movie now. and i really love kristen stewart's acting she is really great."}, {"id": 143, "text": "I went in expecting fairly typical cheesy Christmas fare - which this had a liberal sprinkling of - but was pleasantly drawn in to an engaging story. Solid cast who all seemed credible in their roles - nobody overplaying to a stereotype. And as the threads all wove together I found it all quite touching. I didn't expect 'great' cinema but was happy to experience 'very good'."}, {"id": 144, "text": "Man-woman relationship poorly imitated and as lesbians."}, {"id": 145, "text": "Listen I love Kristen Stewart with all my heat so seeing her smile makes me smile but at the end of the day Harper was literally the worst. She didn't even try to make Abby feel welcome. She ditched her to hang out with her ex boyfriend the whole time. I'm so annoyed with her"}, {"id": 146, "text": "Funny. Great acting. Important message. I'm so happy to see this movie and how Hollywood is supporting normalizing relationships and love of all kinds. It's a feel good, honest, uplifting holiday movie."}, {"id": 147, "text": "Christmas Movie night with Iris &amp; Gertie.Kristen Stewart and supporting cast are full of charm in this groundbreaking queer Christmas romcom. So-needed in hellish 2020, the film has turned out to be a delicate, relishable piece of Yuletide joy.Yes it's a conventional framework, but Happiest Season is always finding ways to casually undercut these tropes. The characters are absurd, but never without a sense of humanity. The key performances, each funny and grounded in their own way, make Happiest Season the perfect seasonal gift."}, {"id": 148, "text": "I agree with many other reviewers about why this film was just not good -- in the main, because of the Secrets and Lies w/in a family that can go on for 20+ years. And yet again, where 'love' is b*stard*ized because the writers don't know it's a verb.The best moments were Plaza and Stewart because Truth and Reality and Caring were between/with them, and the Levy and Stewart moment near the end on their walk together because . . . Truth and Reality and Caring were between/with them.Sad it wasn't good/better."}, {"id": 149, "text": "That this is a drama comedy and like with many comedies there's a lot of dysfunction because dysfunction can be funny. It's resolved in the end and not meant to be taken so seriously.Yes I was pissed and I laughed and I cried. It shows that people can do wrong but if they change and make up for it it can be ok to forgive and move on. I'm happy that a quality lesbian Christmas movie has been made and will see it again."}, {"id": 150, "text": "I thought the same thing about learning something from this movie....I can't imagine having to hide your true self for a majority of your life....now for the positive aspects....this is my newest favorite Christmas film, sometimes reminded me a lot of another favorite of mine, Home For The Holidays....Kristen Stewart played a great part, but Dan Levy shined like a Crazy Diamond....I can't say enough good things about this stellar cast.....I've watched it four times this week and will probably watch it again later today...."}, {"id": 151, "text": "This was actually the best of the holiday movies I've seen so far this year. Not the greatest in character development, but for a bubblegum pop type film which has to try and cover all the bases, it certainly succeeds. I wish it had been slightly more slapstick versus serious (the ending family brawl could have gone a bit more over the edge), but all in all it achieved its goals and with a good dose of class for the long run."}, {"id": 152, "text": "Really impressed by this movie. The acting, dialogue and general flow of the movie is great, you also feel for the characters. My main thing to say is I normally berate Hollywood suits for being safe, but for once they've shown some belief in the audience and tried doing a gay female duo lead in a Xmas movie, of all things. I happen to be straight, but am a firm believer in equality. Well done and about time."}, {"id": 153, "text": "Uggh. Avoid at all costs.Really good cast, which desperately tries to save lame dramedy. Slow paced, cliched, devoid of twists or surprises. This movie would have felt hackneyed in 1982. No excuse for making this in 2020."}, {"id": 154, "text": "....film, like we are 25 years ago when being gay was still a dirty secret in some circles. Only a couple of scenes saved this from total desaster, including Dan Levys scenes."}, {"id": 155, "text": "A film that went beyond entertainment and actually had me questioning my own reactions to decisions made by the characters. I judged them but was judging myself by the end."}, {"id": 156, "text": "The story was great. Loved all the characters. Kristen and McKenzie nailed it. Perfect movies to laugh out loud in this epidemic."}, {"id": 157, "text": "I enjoyed this film. I think the cast was very good, scenes between Kristen Stewart and Daniel Levy were funny. Good chemistry between characters. I enjoyed the storyline.I'm glad nothing happened between Abby and Riley, to me it would have been an unnecessary complication."}, {"id": 158, "text": "This is a quite predictable movie but enjoyable nonetheless. For all you serious critics out there, this won't be your cup of tea. I thought the gay guy played a great role."}, {"id": 159, "text": "I understand the situation Harper (Mackenzie Davis) was going through, but if she was honest with Abby (Kristen Stewart) from the start then they wouldn't be in this predicament...among the other bad decisions Harper made. And it doesn't help that the family sucks, but had an odd major shift in character development within the last 20 mins of the movie. It made the ending seem like a fantasy like this is what we all want to happen type ending, but it's kind of the opposite of what I expected. The happiness in the end was forced just to make it a happy ending. I'm not trying to be pessimistic, but more realistic because I don't believe that should've been the ending. I thought Riley (Aubrey Plaza) would've contributed more to the plot, but she was wasted alongside David...I mean John (Dan Levy), who was typecasted. And maybe it's just me, but the focus should've been put more on Abby rather than Harper. I didn't know enough about Abby except she's with Harper, an orphan, and let people walk over her. That's it.In the end, I'm going to let the movie be a movie and say this isn't a movie I would watch to get into the holiday spirit. It probably wasn't Clea DuVall's intention, but what else do you expect from a movie categorized as a christmas movie."}, {"id": 160, "text": "Soooo Good!!! Hats off to Mackenzie Davis (Harper)! I want to see her more in leading roles she did a great job! Applause 👏🏻"}, {"id": 161, "text": "I liked a lot about this movie, especially the cast, but I spent most of the movie hating one of the main characters and that character's family, so that really took the enjoyment out of it for me. The acting was great, but I found those specific characters so unlikable that it was an uneven result for me."}, {"id": 162, "text": "This was so cute and funny. Digging lesbian Kristen Stewart. LoL."}, {"id": 163, "text": "Sweet and believable with an all round stellar cast, Happiest Season is an instant holiday classic"}, {"id": 164, "text": "It was better than I was expecting. I was worried it might be an overly-LGBT-themed movie and wouldn't appeal to a straight person like me, but instead it felt more like a normal rom-com holiday movie, where the main characters happened to be lesbians.The main character grew up in a conservative and controlling family. This story was more about hiding ANY part of yourself you're afraid your family wouldn't accept or approve of -- and how hiding that part of yourself may cause you to miss out on real love.I found the film to be enjoyable, well-written, heartful, entertaining, relatable, and had a positive message. I definitely recommend it."}, {"id": 165, "text": "I'm not exaggerating but this was one of the worst movies I've ever seen, and I've seen a lot of bad movies. The good thing is; it's the kind of bad movie that you laugh at instead of with. Even though the cast was great, the acting was unbelievably terrible. The writing didn't make sense at all and the delivery did not help at all. I still really enjoyed it, so I highly recommend it."}, {"id": 166, "text": "What i wonder is- are these actors actually red the script? I mean, what can you do with pages (probably 100 of them) filled with almost nothing. First of all, male characters are just dropped in there, nothing funny, important or, god forbid, revealing about them. They are just like wrong drink in some obscure, awful cocktail. Its all about ladies, few stupid secrets and several forced scenes that were supposed to be funny. Alison Brie- not good at all, Kristen Stewart- she obviously felt unpleasant in her skin (although that's hers method), and the rest of actresses just being around saying those stupid, unimaginative lines. Aubrey Plaza, on contrary, being serious and comfortable in her small role- that was the only bright spot, which was a great surprise to me. And that's it, i can't think of this blasphemy any more..."}, {"id": 167, "text": "Garbage! Predictable all the way! To like it you gotta have a low IQ, there is no other way to put it!"}, {"id": 168, "text": "It's a big cliché but honestly, they put every actor I fn love in this one movie so yea I might watch it about 10 more times this year."}, {"id": 169, "text": "Kristen Stewart is amazing In this role! It's really a movie everyone can relate to. The plot is good. The acting is good. It's so good. It has a lot of awkward moments that like make you feel embarrassed for the actors but I love it. I will definitely watch it again."}, {"id": 170, "text": "While I don't love Kristen Stewart as the main character, the entire cast really provided the movie with sincere and/or heavy moments with excellent comical relief.Would definitely watch again!"}, {"id": 171, "text": "Hello, i hope this doesn't hurt anyone as they read this. but when i first saw the trailer for this, and saw that Daniel Levy was going to be in it, i was excited. Schitt's Creek was ground breaking in the LGBTQ+ community. it ignored the trauma homophobia brings. When I saw him in this, i thought oh! this will be good. the lesbian fantasy of my dreams. Not too much conflict, it'll be funny, a romantic comedy right? boy was i wrong. I'm young, im impressionable. im literally in my early teens just barely getting through highschool. i thought this movie was gonna represent us, positively. without the trauma of fearing that our parents wont accept us. (they do, they do in the end and thats great whatever.) but the conflict that this movie had, tore me bit by bit. 1.) Harper is afraid her parents arent gonna love her because shes gay and shes scared things will change. nobody needs to think that, this is fiction. this is literally fiction. its okay to have a movie about just loving. instead of fearing for the fact that our parents might dislike our choice. or our lifestyle. 2.) the parents were overly offensive towards the fact that abby is an orphan. funny or not, i would sob if someone said to someone new shes an orphan nobody really needs to know that. its not the most important thing dude. 3.) the toxic relationships being portrayed in this film jeez oh MAN. none of it was necessary. it literally wasnt. i dont want to sit here, and see that. it gives me the mindset of will, will that happen to me? and i dont want to have that mindset. i want to be happy with my girlfriend without the thought that, oh she might be hiding something, i see it all the time in movies i dont want that. 4.) all of the obstacles that came to harper being forced to come out? what the heck dude, why did that have to be shown? there wasnt a moral to this story. it infuriated me. i literally ran to my bedroom and bawled my eyes out, i just got over a breakup from a healthy relationship. and knowing that, maybe the next relationship i have might not be so healthy, that terrifies me. this movie gave me that thought. and now i miss my ex even more. i just wanted to see 2 lesbians being in love, no conflict, just love. nice hot chocolate dates, going to the mall to get nice gifts for each other, christmas light shows, just love. just normal love. you dont get this stuff with straight people man, you dont. and the fact that we need to have these? its unnecessary. we dont need to have this kind of stuff, we're just people. and the media needs to show that we're no different than the average cishet. we're just people who love people. we're different in our own way. everyone is. but you shouldnt have to represent us and show all of the troubles we face all the time. there are so many movies of us being hurt. i dont wanna get hurt. i dont want my love to fall apart because of what my family thinks or what her family thinks. i dont want that. i just want to be loved. and this movie gave me false hope. and the end was just a normal christmas movie ending, after everything that happened? they just fall back into lesbianism like that? bruh. if that was the case then why did this movie have to have that whole fight scene where the oldest sister tells abby you stay out of this sappho dude i didnt wanna hear that. that literally felt like she was telling me that. why did that have to be in there. but yeah, i hated this movie. it made me cry and not in a good way, i hated how i felt. i feel awful. i had such a bad day and this just made it a whole lot worse. this might make no sense to some of you, but im tired, i cried for 15 minutes, im done. im so done. come back to me when i see a movie revolving around lesbian fairies snuggling on a flower lily."}, {"id": 172, "text": "It's fun, beautiful and different Christmas movie. The story is well written with many deep and interesting conversations, it's also simple, real, beautiful and important with interesting topics like family and coming out. Also the movie is so humorous at some points with very good jokes. Christmas decorations and all is just so beautiful and gives a beautiful cozy mood. Kristen Stewart and Mackenzie Davis are both great and the chemistry between them is so beautiful. Happiest Season might seem like a typical rom-com but it's way more than that."}, {"id": 173, "text": "I had high hopes for this movie. Was such a Huge disappointment! The writing is as bad as the acting. I wish I could not give it a star at all!"}, {"id": 174, "text": "When it gets going it is quite moving. It's funny enough but it's strength is in the frustration and awkwardness of extended family gatherings. Folks complain that costar Davis' Harper isn't likeable. Have you looked in the mirror lately? She's human. Deserves a place in your Christmas viewing roster."}, {"id": 175, "text": "The story has a lot of potential, but the finishing product just not quite match certain level."}, {"id": 176, "text": "I'd hang out with Jane. She's the fun one. A bit clingy, but so what."}, {"id": 177, "text": "I liked the movie and the concept they used. It was a holiday movie so of course I have the mindset that it'll be just like all the other holiday movies. Unfortunately, I was right. The main character Abby chooses to suffer through toxic behavior (forced back into hiding being a lesbian) for the one she loves (many of us would do) except the behavior goes above and beyond. Harpers sister spills the beans to everyone at the Christmas party. Then Harper continues to deny her claims IN FRONT OF HER GIRLFRIEND. Idk about anyone else, but I was definitely yelling at Abby to LEAVE. John was such a great friend throughout the whole movie and even made it seem like the movie may go into the direction most of us wanted. Unfortunately, instead of Abby leaving Harper for good (which needed to be done) the writers thought it was smart to make them stay together?!?! WHYYYY. That ruined the rest of the movie for me. Why would writers tell people it's okay to be toxic like that to someone they love as long as they love them. Absolutely disgusting. Riley was amazing in the movie and Abby and her should've either been together in the end or became best friends/wing girls for each other because I loved them together."}, {"id": 178, "text": "Heartfelt , funny and all a Christmas movie should be. (and DAN LEVY) !!"}, {"id": 179, "text": "The movie was good, the acting was good as well, the movie has some drama in it too which I liked . I like that finally a Christmas LGBTQ+ movie was made and it had great actors in it, the plot was good and the representation was also good . It's predictable, obviously, but what kind of Christmas movie isn't ? That doesn't mean people are not gonna watch , they still do and they still like it . I hope that this is just the beginning and a lot of movies like this will be made in the future !"}, {"id": 180, "text": "The characters were funny and made me cry. Jane was super funny and the character development was great."}, {"id": 181, "text": "This film is so heartwarming. It's hilarious without being corny and the love between the main characters is realistic and sweet. Definitely recommended."}, {"id": 182, "text": "I can't watch full movie. I can't watch full movie.I can't watch full movie. I can't watch full movie. I can't watch full movie. I can't watch full movie. I can't watch full movie.I can't watch full movie. I can't watch full movie. I can't watch full movie.I can't watch full movie."}, {"id": 183, "text": "Why? Just why? Every movie trope. Every foreseeable outcome. Mildly correct politically but how did they get this cast together for this turkey?"}, {"id": 184, "text": "Predictable, repetitious and beyond predictable. Terrible writing and premise."}, {"id": 185, "text": "If it's meant to be sarcastic 100 minutes, i would give it a 6/10..but unfortunately it isn't.. Such a bunch of terrible characters through all the movie.. Stupidity on every corner.."}, {"id": 186, "text": "The movie was ok. There were a few comedy moments. The reason why I give a 10/10 is because of Kristen Stewart. She's a phenomenal actress and is the reason why I watched. This movie is true for a lot of families who are publicly happy but privately miserable. They put up with unhappiness for the sake of the image of their family and it isn't fair. This movie rings true. Overall, ok movie"}, {"id": 187, "text": "Really good story told well and I'm enjoying it. But I wish the cast was more diverse and LGBTQ+ stories lack representation!"}, {"id": 188, "text": "I liked this movie. It made me feel things, but not too many things, as a rom com should. My only beef with this movie is that Harper did not really redeem herself totally. Coming out should be done on your own timeline, but lying about it to your partner is pretty bad. She also essentially ignored Abby the whole movie when she could have spent time with her and continued a friend narrative. Especially considering she was leaving Abby alone with unfamiliar people. I would have liked to see that issue acknowledged before the movie ended.I did sort of ship Abby and Riley for a bit (clearly more chemistry between Stewart and Plaza than between Stewart and Davis), but ultimately I'm glad that it didn't happen. I'm a firm believer in making an effort to resolve issues in a relationship rather than giving up and jumping ship. I just wish the issues were actually resolved.Ultimately though, this was a fun Christmas movie that I enjoyed watching."}, {"id": 189, "text": "'Happiest Season' is lovely and a perfectly fine holiday fare, but the movie lacks the sparks and charms to become something truly special. Clea DuVall's direction just can't find the right rhythm that allows the story to flow from laughs to romance to sentiment and heartache. Every cast member is a winner but none more so than Aubrey Plaza who steals every scenes she's in from right under her co-stars noses."}, {"id": 190, "text": "This is enjoyable, believable and perfectly fine. Kristen Stewart &amp; Mackenzie Davis (Halt and Catch Fire) are both terrific actors -- separately, in other movies. The issue is the 2 leads are too close in acting styles: introverted, subdued, quiet &amp; intense. We thought the better pairing in this story would have been Aubrey Plaza &amp; Stewart's characters. Arch, witty Plaza really meshes with Stewart."}, {"id": 191, "text": "It's really not funny at all. Except two the characters are pretty annoying and it's just painful to watch. The story had potential, but the script is so cringeworthy."}, {"id": 192, "text": "This movie was very sweet. I would've changed the ending but over all it's very good."}, {"id": 193, "text": "So cute. was heartwarming to see a coming out story with a holiday twist."}, {"id": 194, "text": "As the first LGBTQ holiday film I'm happy they finally made a film like this and let's hope we see more like it. The film is far from perfect but it's still enjoyable. The flaw is it try's way to hard to be slap stick or over the top funny like family stone at times this is no family stone. The story does drag at times too. But overall the acting is great and the story is good too."}, {"id": 195, "text": "What I liked- 1.Consistent Christmas ambiance 2. Lgbtq+ representation, family dynamics, and sweet ending 3. Maintaining hallmark happy-go-lucky comedy in the midst of serious tension. 4. Special thanks to Daniel Levy for his impeccable comedic timing.The movie has our red-green-yellow Christmasy color pallet. It was so refreshing to see a classic hallmark style movie with a fresh lens of modernity. Even though it talks about important topics like LGBTQ+ representation, fake perfection of all family members for societal validation, coming out (quite literally one of the main characters is put in the basement and utility closet), the movie continued to have a delightful Christmas charm throughout. All the characters did a great job of acting their part and of course, it has a happy ending. Get some hot cocoa, cozy blankets, and watch with your loved ones."}, {"id": 196, "text": "It's a Ho-hum cast and a Holiday twist on MEET THE PARENTS with same sex relationship.I am not going to waste much time writing about this MADE FOR TV movie since I already wasted a little time half watching the movie &amp; half working on my work laptop.It is a good movie if you are doing other things like wrapping Xmas gifts, setting up the tree, banging Mrs. Klaus, cleaning the house, etc....I gave one star for Christmas Charity!!!"}, {"id": 197, "text": "I'm not a fan of Kristen Stewart...feeling that her poor acting skill and emotionless delivery has ruined otherwise potentially good movies. Watching Happiest season made me change that opinion of her; she was quite good in it.I AM a fan of Mackenzie Davis, and she doesn't disappoint here either.This is a spoiler free movie, so I'll just say that it's a holiday movie worth watching with laughs and tears, the two things that all holiday movies should have."}, {"id": 198, "text": "I was both hesitant and excited when the trailer came out (no pun intended). Now I've seen the movie, and while the overall premise is a little over done, and it's not a perfect movie by any means, I was still very entertained. Definitely appreciative of the higher quality production and hope this continues for many lesbian movies to come."}, {"id": 199, "text": "I really enjoyed this movie. Many people harped on it bc they didn't care for Harper or all the toxic relationships in the family and that they weren't both out and proud. The truth of the matter is that this hits close to home for so many of us who are scared to death to loose our family and would rather stay in the closet simply out of fear of rejection from the ones we want the most acceptance and love from. I think it was very true to life so people can see the hoops that the LGBT community have to jump through at times.Overall I thought the casting was perfect and they all did a great job. Job well done Clea Duvall for your first feature film as director!"}, {"id": 200, "text": "So corny, terrible acting, predictable----------- Ugh"}, {"id": 201, "text": "Not a bad movie. Harper is a terrible girlfriend. Abby deserves better.. like Riley.."}, {"id": 202, "text": "I love the genre of family drama but I struggled to get through this movie. Unfortunately, the charmingly funny Dan Levy and the beautifully understated Kristen Stewart were cast along side a most annoyingly unreal family consisting of a mother, father, and three daughters. Whenever any member of this family was on camera, I felt like I was watching live community theater - so much stiff overacting. As a side note, Aubrey Plaza, who is always a gem to watch, wasn't given much of an opportunity to shine in this film."}, {"id": 203, "text": "There's nothing more erotic than hiding your authentic selves. is such a good line that I'm more than happy to look past some of the cliches here. :) In all seriousness, this movie could easily be criticized for its slightly formulaic nature or its questionable plot twists...but it works for a few reasons: 1) Great performances from cast members like Stewart and Levy, 2) Smart writing that makes even predictable moments work, 3) Non-traditional stories that make formulas a little less formulaic. It is not perfect, but it works better than many other holiday films. You gotta start someplace."}, {"id": 204, "text": "Nothing spectacular but it is very well made feel good kinda movie. Two lead actresses are great, definitely worth watching."}, {"id": 205, "text": "I'll just leave it at this, Happiest Season was a movie with great potential I wanted to love(and at certain parts did), but ended up feeling meh about it overall beause the final decisions they made in the film. Decisions that felt more like they were made because they were supposed to and had to, to follow a certain formula, over making decisions that made sense for the story.It gets 6 eye rolls out of 10."}, {"id": 206, "text": "I would hardly classify or market this movie as a comedy. IMHO, it's more of a drama with some funny lines and twists, necessary to detonate the actual drama boiling underneath the surface of the holiday season. It is indeed a quite balanced movie complete with believable and also interesting characters, quite a few lovely eccentrics and a plot that does keep you at the edge of your armchair sometimes. The performances range from noteworthy to excellent and the approach to the overused and even abused Christmas movie concept of dysfunctional families coming together is really fresh- not only because the main characters are gay. My only reservation is the ending. I somehow feel a less than happy ending would be more believable and realistic, it would work better - but, OK, after all it's a Christmas movie, although not just a Christmas movie."}, {"id": 207, "text": "I love that we're finally getting a love story about a same-sex couple that isn't pigeonholed into the LGBTQ genre category, even if it is a cheesy Christmas movie. However, I was dissapointed at how lazy the ending was-parents like that don't literally change overnight, Kristen Stewart is ultimately still basically a doormat, and her girlfriend, who promises to show her why Christmas is so wonderful, basically shuns her the entire time. There was a better ending to be had, and it was far too long with opportunity for easy cuts (there was truly no reason for those children to frame her for shoplifting). Thank goodness for Dan Levy, and let's do more of this type of movie, please...just with better writing."}, {"id": 208, "text": "Anything Daniel Levy does is precious. Oddly, enough I'm not a fan of Kristen Stewart, but I was team Abby. I was hoping Abby would end up with Riley...I liked it but everyone is right it's made for tv. My husband was laughable, he was like No, don't choose Harper, she's a jerk! I would have enjoyed it more if Abby ditched Harper and started seeing Riley, but it was still cute. Jane's character was adorable, loved her."}, {"id": 209, "text": "Pretty disappointing movie with average acting and a pretty lame plot. This is a shame and a missed opportunity to do something a bit different with the genre. It does not really work as a comedy or a drama. Dan Levy is excellent though - almost makes it worth watching for him alone, although he is not in enough scenes and cannot really salvage the film."}, {"id": 210, "text": "This movie is a vehicle for the elite limousine Hollywood liberals to spread more hate about conservatives. By the end of the movie, you learn that sex-out-of-wedlock is good. Wedlock is bad, heterosexuals are mostly buffoons, immoral and to be shunned unless they redeem themselves by embracing homosexuality. And trannies are especially wise and loving. Oh, and there's a little humor thrown in, and it's mostly forced and banal. When Kristin Stewart shows some cleavage in her butch outfit, it's yuck! She's awkward as heck in this move and so stiff. I enjoyed Aubrey Plaza's performance as usual. She would have been much better in the role Kristen Stewart played, and she was basically wasted here. What a shame. And Mary Steenburgen was excellent as always. She manage to rise above the freakish mom she was written to portray. Watch this if you are a masochist and you want to see part of the reason why society is spiraling downwards."}, {"id": 211, "text": "A gay woman brings her girlfriend home for the holidays. There's just one issue. Her family doesn't know she's gay. Sound familiar? I have seen many independent gay films with similar themes done much better which made this higher profile film all the more disappointing.. I kept rolling my eyes at the predictability of all of it. Attempts at humor often fell flat. Dialogue was unnatural. The family was horrible and one dimensional. Dan Levy was on hand as the gay friend. Or should I say David from Schitt's Creek because that's exactly who he played. Not that that is a bad thing as he provided the few laughs the film had. Subpar first effort by director Clea Duvall."}, {"id": 212, "text": "Needed more Dan Levy. It was a great story, but everything seemed so lackluster. There are a lot of great actors here, but it felt like they were all holding back."}, {"id": 213, "text": "They had a very good cast for this movie, and yet, they muffed it up... The movie needed to be at least 20minutes longer to flush out the relationship between Aubrey Plaza and Kristen Stewart, because in the end it just was a disappointment. There also was the slightest glimmer of a 'redemption plot' but in the end that fizzled out like a candle in the wind as well... the whole movie had a lot of promise but just ended up going nowhere. The movie also had a jarring emptyness with regards to comedy... it honestly lacked any humor and I didn't laugh a single time throughout the entire movie, which is a disappointment... movies like this are supposed to have at least SOME comedy in them, and with a cast that includes comedy-veterans like Aubrey Plaza and Dan Levy, I honestly expect to laugh at least twice. Overall, it's a movie with a very good cast and plot but it just falls flat due to it being too short and lacking any real conclusion at the end... solid 6.5/10 romantic movie."}, {"id": 214, "text": "You can pretty well predict the outcome when somebody deceives their lover. These rom-coms all seem to follow a similar format where deceit, gossip and making assumptions leads to unnecessary drama. This is just rehashed bad behaviour. Dan Levy is the only 'comedy' here."}, {"id": 215, "text": "The cast is excellent but the story is blah. Abby was treated awful the entire movie and I don't think there are very many people that would tolerate it. Furthermore, I am saddened at how things work these days. It's not about what is actually a good movie or story,etc. It's about what topics are in and what will be PC and get more likes and clicks.Like I said, it was an enjoyable movie. But nothing special. If it was about a straight couple I can guarantee the scores on here would be much worse. I just want everyone to be accepted so we can enjoy things for what they are and not for what they represent."}, {"id": 216, "text": "I don't like Kristen Stewart at all but I love Dan Levy and he's not been in a lot so I wanted to see this. I actually felt sorry for Kristen's character (Abby) because Harper (Mackenzie Davis) and her family were horrible. There should've been a hell of a lot more groveling from Harper &amp; her family (except Jane). Dan (John) was the best part of the movie but he was only in a couple of scenes."}, {"id": 217, "text": "The story they tried to tell is honest, sweet and warming, but the execution is not upto the mark. The performances of the leads in this movie fall flat and as much i like HEA's, this one is just two cheesy and off for my taste. I hope the next time someone involves big name actors for lgbt themed movies, i hope they make sure to get it right. This feels too much like a hallmark movie rather than the big budget starring big names premiering on hulu sort of movie."}, {"id": 218, "text": "The characters in this movie have zero credibility and the script is so far from reality that is not fun or romantic at all. The sugar coated completely over the top end of the movie is even more annoying. I would not recommend this movie to anyone."}, {"id": 219, "text": "So bad writing....all situations are cartoon-like exaggerated, to make everything goofy.... With so many good actors, one might hope in a better script."}, {"id": 220, "text": "I don't often yearn for a movie to finish. Interesting for 10% of the population I imagine, I'm not in that 10%."}, {"id": 221, "text": "My family and I were all really excited to see this movie solely because of Daniel Levy. The movie wasn't bad, but we all felt that John played by Dan Levy wasn't shown nearly as much as he should have been or as much as the trailer made it seem."}, {"id": 222, "text": "I really wanted to love this movie. Dan Levy and Aubrey Plaza were the only redeeming parts of this movie. They were sweet, funny, charming, and it they, and only they, that earned my 2 stars. The rest of it was a sad, unfunny hot mess. There's no sugar coating it; Harper and her family are rude &amp; horrible. You spend the entire movie rooting for Abby and poor abused sister Jane to walk out the front door with two middle fingers held high on the arms of John and Riley. Alas, the ending suddenly and magically finds everyone happy and completely changed, after some sad half assed my bad style apologies. If only Dan Levy had a hand in writing the script, it could have had the potential to truly be great."}, {"id": 223, "text": "Yeah, it's sort of cheesy in the way a Christmas movie is. The beginning was a bit lacklustre. But it had some interesting characters and some good actors and it was... different. I really enjoyed the fact that the two lovers are women. In a mainstream Hollywood movie! It's fantastic! It felt authentic, it felt right, it felt normal. We need more of this, please. I think that some movies and tv shows just try way too hard to be diverse, and sometimes it feels forced and unnatural. I didn't get those feelings with this movie. No, it didn't have to be a coming out story, but it was, and j thought it was handled well. I shed a tear or two, and I left the theatre feeling very uplifted. I found Harper to be a bit off-putting. Her sister, Jane, was the most interesting character. Mary Steenburgen never disappoints. Kristen Stewart stole every scene with her penetrating eyes, except for those with Dan Levy, coz... Dan Levy, HELLO. And Aubrey Plaza... yasss. I, also, found myself hoping for an Abby/Riley ending, but it's Hollywood, so."}, {"id": 224, "text": "Happiest season is a movie that starts with a soothing atmosphere and goes on keeping up a holiday vibe. The first arc travels smoothly through all the elements of the film. Both Kristen Stewart and Mackenzie Davis deliver a fine performance that doesn't make us feel bored. The second arc feels kinda off the track but still manages to deliver us elements that keeps us tied with the movie. Talking about the third arc the film does a really good job by presenting all the elements perfectly and also by giving us a good ending that we can ask for. In the end happiest season is not a story that we can say it is first of its kind specially when some parts are predictable but still the movie has it's own vibe that just makes us sit back and enjoy it. Overall happiest season is definitely a must watch but not one time watch."}, {"id": 225, "text": "Aubrey Plaza , She pushed the movie up! She appeared in a few scenes but shone, made the film spectacularIt had a higher level of play ......"}, {"id": 226, "text": "All the interactions with Mary Holland (Jane) are the funniest. And Mary Steenburgen is the classic perfect mom. Kristen Stuart &amp; Mackenzie Davis's struggle is real. Aubrey Plaza was under-utilized. They could have done so much more with her. It was a decent movie. Worth the watch. The only thing I kept wondering is why Kristen Stuart and Mackenzie Davis looked like they never combed their hair through the whole movie."}, {"id": 227, "text": "I love a good LGBT+ christmas movie as the next person, and we really truly need more of them- but not like this. Abby and Harper were cute in the start but then the whole lying and hiding was awful, as if we havent seen that in many movies already. The outing scene should have also been removed from the movie, why do we still do scenes like that? It was for the ending shock of value and drama. Not to mention it's never okay to out anyone like that. Did Harpers sister even apologize? No. Happy ending was nice but it didnt save the movie. Go watch The Christmas SetUp instead."}, {"id": 228, "text": "I almost never write reviews, but this was so awful that it would be a disservice on my part not to warn others. I did not expect a cinematographic masterpiece, and just wanted something light and heartwarming to wind down, but this was just... a different level of awful. Apart from the terrible plot (come on, are we still in the 1980's?), non-existent acting, terrible attempts at humor, my main issue is that this movie normalises abusive, toxic relationships. It was quite triggering actually, and the fact that so many found it sweet is very concerning. The last 10 minutes felt like a can of excessively sweet syrup poured on a pile of horse manure."}, {"id": 229, "text": "The major problem with this movie is that the entire Caldwell family are simply unlikeable, bordering on deeply unpleasant, and the only scenes in which the humour actually lands are the ones featuring Daniel Levy's character. The second best scenes feature Kristen Stewart and Aubrey Plaza together, and frankly their characters should have ended up together. The character of Jane was simply bizarre (and unnecessary) and while the character of Connor served a purpose, there was no closure to that storyline. Promised a lot; delivered very little."}, {"id": 230, "text": "Happy couple Stewart and Davis go to Davis' parents for Christmas which is full of tradition, snobbery, family disagreements, old lovers and the father trying to get the nomination for Mayor. The real issue though is that Davis tells Stewart before they arrive that she hasn't told her parents she's gay, so Stewart reluctantly has to pretend to be her hetrosexual flat mate.As a drama about being yourself and understanding everyone's trial of life it works quite well. It is though supposed to be a comedy as well with Stewart and catty mum, Steenburgen both on good form. The comedy though switches off half way through and it all becomes pure drama, missing a number of opportunities. A well made festive drama with good performances all around, it's just that the balance is rather off kilter."}, {"id": 231, "text": "The cast is so good but the movie is predictable in every way. The over acting is cringe-worthy, but it's a holiday movie so maybe its to be expected. That said, I will see any movie or show that Daniel Levy is in. He's incredible. The rest of the cast is his supporting cast. The last 10 minutes redeem the previous 92 minutes."}, {"id": 232, "text": "Show your parents if you are gay and want to come out. It's a movie help you to tell your parents I'm gay after watching this. Totally have its value and quite fun. We want to be prefect but didn't know what perfect actually is, really a perspective of personal experience."}, {"id": 233, "text": "I was so much looking forward to watch this and I really, really wanted it to be good. Some parts are funny but mainly because of Stewart and Davis. The script, well ... you have seen it before and probably a better version. What kept me watch until the end was the acting."}, {"id": 234, "text": "This could have been a string film, but it was clear they tried to hard in the beginning to push the crazy family dynamic and the movie suffers. The Caldwells are laughably stereotypical throughout most of the film and all portrayed as terrible people with the exception of Jane. It's clear where the story is going from the first two minutes. A waste of of a star studded cast."}, {"id": 235, "text": "A Christmas movie centering around a dysfunctional family is certainly nothing new, it practically dominates the genre, but this one has the added gay rom-com wrinkle to bring a little extra cheer and that is not a bad thing, but as much as wanted to embrace this movie the relationship between Mackenzie Davis's Harper and Kristen Stewart's Abby never quite worked for me and throughout most of the film's running time I wanted Abby to run off with Aubrey Plaza. That all said, it still has some solid charming moments and the cast overall were great, it's just sad that the film couldn't have been a little more honest with itself."}, {"id": 236, "text": "Espite Covid-19 putting a sombre mood over the 2020 holiday season, Clea DuVall's festive rom-com is here to put a smile on your face. 'Happiest Season' is Hulu's latest loved-up rom-com, but it doesn't exactly stand out above its predecessors. Productions like 'Palm Springs' and 'Love Victor' appear to be a little less cliche than this 1hr 42m lesbian love-story.The story follows Abby (Stewart) and Harper (Davis) as the pair head home to Harper's parents for the holidays, but there's a twist, Harper isn't out to her parents as gay. The two then agree to hide the fact that Abby is Harper's girlfriend by introducing her as Harper's orphaned roommate. As the story progresses, Abby becomes more and more agitated by the fact that Harper won't come clean. After meeting Riley (Plaza), who is revealed to be Harper's first girlfriend, the two begin to bond over their shared relationship troubles. As the film comes to a close, Abby has finally had enough and decides it's time to leave Harper behind and head back home to Pittsburgh. This comes to a head just as Harper is expressing her sexuality to her family, only to be left heartbroken by the one she loves. However, as all holiday movies end, the two finally reconcile and live the happy ever after they were destined to have from the get-go.'Happiest Season''s cinematography and overall appearance is ok. It echoes the modern, contemporary vibe the film gives off. But there's not a huge amount that sets it above every other holiday rom-com, with random cutaways to the house's exterior making viewers feel like they're watching a sitcom, not a feature-length film. DuVall and Holland's script gives off the impression that the two should probably stick to their respective fields, especially when it comes to writing comedy. Viewers will also pick up on the fact that John (Levy) seems to be the only source of comedic relief throughout the entire movie, and when you're making a rom-com the majority of the comedy shouldn't be coming from a supporting character. Despite the flaws, the upbeat, bubbly soundtrack throughout makes you tap your feet without realising you're doing it!The cast is well-rounded, likeable and they all seem to work well together on screen. Viewers will enjoy watching Davis and Stewart on screen together, and it's heart-warming to see their bond flourish over the 102m. If you're watching 'Happiest Season' this holiday, don't expect to be blown away, because even though it's got a unique and promising premise, what DuVall gives viewers isn't exactly expectation-shattering. However, Plaza's performance as Riley is enjoyable to watch on screen. As a viewer, you'll pick up on the fact Riley and Abby have more chemistry than Harper and Abby, so if you're subconsciously rooting for the pair don't worry, you're not the only one!'Happiest Season' is a film that is not produced to deal with one specific theme - more to convey a message. That message is, of course, that you should always be true to yourself and be honest with those around you and if you're not it can result in you losing the ones you hold closest to your heart.In conclusion, Clea DuVall's 'Happiest Season' is Hulu's attempt at providing viewers with a fresh twist on the classic holiday rom-com, and for the most part, they do. So, if you're a fan of Kristen Stewart, Aubrey Plaza, Mackenzie Davis and Dan Levy then you should be adding 'Happiest Season' to your holiday watchlist but if you prefer something a little less hallmark movie then you might want to keep scrolling."}, {"id": 237, "text": "The Happiest Season 2020 12A Director: Clea Duvall Starring: Kristen Stewart, Mackenzie Davis, Aubrey Plaza, Dan Levy, Mary Steenburgen, Victor Garber, Alison Brie, Mary Holland, Burl Moseley, Sarayu Blue etcOverall rating 54/100The happiest season is about Harper (Mackenzie Davis) who invites her girlfriend Abby (Kristen Stewart) home for Christmas to meet her family, except she hasn't told them that she is in a relationship with her or that she is gay, as Abby begins to question her relationship with Harper, she must make a decision on whether being with Harper is the best decision or not. I wanted to Like the happiest season so much more than what I did and it definitely had its moments but for me was a big let down and fell apart as the movie went on.My first few positives would be representation, cinematography, chemistry between characters and comedic performances. It was refreshing to have so much LGBTQ representation for this kind of holiday movie and for me showed that a movie showing relationships like this should be as popular and regularly made as the traditional holiday movies. I also thought the movies cinematography was fantastic, the movies visuals just made me feel warm inside, It was truly visually stunning and every set location and attention to detail was excellent. I also thought the chemistry between most of the characters was absolutely fantastic. Mackenzie Davis and Kristen Stewart had excellent on screen chemistry, their relationship was believable and felt authentic, but the chemistry between Kristen Stewart, Dan Levy and Aubrey Plaza was fantastic, they all bounced off each other so well and were so infectious and fun to watch in every scene that they were in together. The comedic performances were also fantastic, once again Kristen Stewart, Dan levy especially and Aubrey Plaza were just fantastic, Some of the comedic dialogue especially for Dan Levy was so excellent it was brilliant, his comedic timing with Kristen Stewart in her awkward and very animated facial expressions was just fantastic.My next few positives would be the humour, likeable characters and its charming tone. I thought the movie for the most part was hilarious, the slapstick humour was great, some of the dialogue and social commentary on a lot of things was hilarious and the comedic delivery from the cast involved was excellent. The movie also had a lovely charming tone throughout. As a lot of the relationships developed and with the involvement of the holidays the movie did manage to achieve a lovely warmth to it that stayed. There was a lot of very likeable character throughout, they kept the movie watchable as you just couldn't help but just love them.Now time for some negatives. Some of the humour got very stale, there was some very unlikeable characters with odd decisions made, and there was a lack of depth to the conflict. For me not all of the humour connected well enough, at first they were funny but the movie overdid it with some of the jokes and they got really old and not funny very quickly, I thought that there was some very unlikeable characters in this movie. The parents were just horrible human beings and weren't really that likeable throughout, but my biggest issue was with the character of Harper played by Machenzie Davis. She was incredibly unlikeable and absolutely horrible to Kristen Stewarts character, she made so many terrible decision I just didn't want them to be together despite the complicated issues, and how poorly she had treated past people in her life as well, the movie just didn't do a good job at making us sympathise of connect with her as a character. And I just thought the plot decision of Harper inviting her girlfriend home for Christmas without telling her family she was gay just didn't really make sense and put her in a deliberately tricky situation, I just thought it was a slightly lazy set up for the conflict. Adding onto my previous comment there was just really in general a lack of depth to the conflict, the film just played it really safe in terms of its conflict, there was nothing that ever really felt serious therefore effecting the sakes, a movie with LGBTQ themes needs to have depth and conflict and this movie just didn't, there was no signs of the parents being homophobic, and the explanation we got about them being a perfect family for me wasn't good enough.My final few positives would be the good use of characters to create conflict, the uplifting script for LGBTQ themes and the partly heartwarming ending with good character arcs. I thought the movie incorporated characters to create conflict well, the characters played by Aubrey Plaza and the use of ex partners was really well done, you got to learn more about the main characters as well as connect with new characters, and off course they created good conflict because of the connections to the Harper so this was well done. I also thought some of the script was uplifting with its LGBTQ messages, Dan Levy's character in particular had a really heartfelt scene exploring different peoples experiences with coming out and it was a really heartfelt scene and the script was at its best here, its shame it wasn't consistent throughout the whole movie, but I still applaud them for moments of greatness. I also found parts of the final act heartwarming and with some good character arcs, the characters of the parents accepting all their children and them all being a happy family was admittedly heartfelt and at least gave Harper a good character arc with her relationships.My final few negatives however would be the movie poorly handling its LGBTQ themes and its messy final act. I thought largely the movie poorly handled its LQBTQ themes, having characters forcing others to come out really didn't sit well with me, and just how clueless the characters were, the movie played it safe and made the main message for the movie get lost in all the drama and comedy. I also found the final act an absolute mess, I thought having Harper's sister having to out her instead of telling her parents herself was just terrible, And it really made me not want the two main characters to get together, Aubrey Plaza and Kristen Stewart had a lot more chemistry as the movie went on.Overall, despite fantastic comedic performances from Aubrey Plaza, Kristen Stewart and Dan Levy, and moments of charm and greatness, the Happiest season falls flat, due to its extremely unlikeable characters, poor narrative decisions and playing it safe and poorly handling its LGBTQ themes making the message of the film not feel earned."}, {"id": 238, "text": "The only thing that made the movie watchable is Levy's outstanding performance in the few scenes he appeared in. This guy deserves a leading role. He's effortlessly charming and hilarious and can't be more real and relatable when needed.This guy is gold! he just saved a pretty boring Christmas movie from a lower rating"}, {"id": 239, "text": "I love the LGBTQ characters in this but I honestly just wish I felt some more emotional depth from Kristen Stewart!"}, {"id": 240, "text": "It's a very good movie, it's funny and heartfelt, with great lgbtq+ representation. BuT (there's a but) it made me unbelievably angry. Harper was being unbelievably rude to Abby throughout the entire movie. The whole time I was hoping that Abby and Riley would get together. (My mindset was that they both deserve someone who was proud of who they are and who they love) I was really proud of Abby when she walked out for a second time, but it pissed me off that they got back together in the end because of some cheesy, cliche speech. But it's an okay movie. But I was really rooting for Abby and Riley. 6/10"}, {"id": 241, "text": "It is no Richard Curtis film, but it is fun and entertaining nonetheless. The plot here - the trip home to meet the family where things go wrong/haywire - is quite a common plot in this genre of film, i.e., the Christmas romantic comedy. The writers (DuVall and Holland) also draw on a popular plot device: i.e., deception - the fake relationship intended to deceive family and friends (this year, Holidate and Midnight at the Magnolia, come to mind). The twist in this film, of course, is that it is a same-sex female relationship, where they pretend to be roommates as opposed to a couple. Overall, I thought this worked well. There is a lot of good and funny dialogue in this movie; I found myself laughing quite a bit, at times. At the heart of the humour for me was Sloane and Jane (the two sisters), and Tipper (the mother). The writers did a good job of developing the lines and dialogue here. That said, I thought the biggest shortcoming of the movie was that the writers did not spend enough time developing the relationship between Abby and Harper (the leads) before the trip home, before the deception began. In essence, we get one scene before they are off to visit the family for Christmas. The writers could have spent more time setting up why these two, Abby (played by Kristen Stewart) and Harper (played by Mackenzie Davis), are together, in love as it were. The chemistry between the two is never really established. Because the film spends much of the time playing out the deception, I found myself asking (towards the middle to end of the film): why are these two together? Of course, at the very end, the writers try to sort this out with a heartfelt reveal, coming out, by Harper. But by then, I felt it was too late, I already had a 'bad taste in my mouth'. The acting was impressive overall. The leads both had great performances. I especially enjoyed Mary Steenburgen's portrayal of Tipper (she was very funny!). Alison Brie (as Sloane) and Mary Holland (as Jane) were great too (hilarious in some scenes, I thought). You are in for a treat with these performances. Leaving the shortcoming aside, this is a fun (and at times, emotional) Christmas romcom. I really enjoyed it, thus I highly recommend it."}, {"id": 242, "text": "I really liked this movie. It's has parts that are pretty fun and the cast is fantastic. It really is an all Star cast and they all get moments to shine.I think that definitely it's biggest strength is it's characters.They are just so fun and interesting you really wish that you got to spend more time with them and unfortunately you kind of wish that the movie was about them because bizarrely enough I think this movies biggest weakness is also it's characters.The two leads characters are some of the more boring ones in the movie. Kristen Stewart's is ok for the most part and I did like her but Mackenzie Davis' character is quite bad. That is nothing to do with the acting because I think everyone was pretty great it is purely a script issue.The character of Harper is really unlikable. The movie really leaves her out to dry. It is like the writers hated her and because of that she becomes really unlikable for most of the movie. I really think they should have reworked her so she was even slightly more redeemable.That was really my only complaint. I think this movie is charming and cute. It's nice to have another LGBTQ+ Christmas movie available. Definitely watch it and support this film existing."}, {"id": 243, "text": "* (Rating 9.5/10) * * There are images during the end credit *The director Clea DuVall and crew brought a heartfelt film and a much needed beautifully full-on representation. I would love to thank Clea DuVall for accurately pointing out the emotional complexities of coming out. This film deeply projects the obstacles one faces of coming out to the family and how one can't be truly happy if their true self is hidden. The understanding and the patience of being with someone who is not fully out was tested, love keeps one together but there is always a limit. The perspective of showing two sides of a person was heartbreaking, how devastating to watch how she treated her love for the sake of keeping up appearances due to her family's reputation, and by hiding, she didn't notice the hurt she was causing. Even though it was painful to watch it was understandable because it isn't easy to say it to the family. This was a meaningful film that gave different points of view for one to know that there is hope and that hope is projected through the relationship between Abby and Harper.I loved this line Everybody's story is different, a few simple words that defined the difficulties of coming out. During that scene, tears began to flow because it explains in detail how terrifying it was when those words come out while not knowing what would be one's family reaction. Acceptance is a powerful word in which many seek, and not every family knows the meaning of loving a child for who they are. It is easy to be out surrounded by strangers but not easy with family, never knowing if it's the last day one can call them family. All those feelings were profoundly placed in that scene and it made me cry so hard.It was very well done to make her family defined by perfection to project as many situations as possible. They wanted to seem perfect but like any other family, they were all struggling to be proud of or to gain love. Everything would be simple if one learns to not let society control one's life and not letting them decide who you are. This storyline tackles every awkwardness, stress, and the terrible pain that causes when one decides to live in a lie.When the high point of the movie came, it was so excruciating, I have cried in many movies but this kind of cry was different. I felt like my heart was intensely crumbling down even as I write this my tears are remembering and I'm so thankful for this movie for letting me cry in this kind of way. I love how this storyline doesn't give a simple solution and doesn't even set any cheesy moment by doing so. The struggle of reaching the limit was perfectly structured by establishing how a secret and denial are two different things in which can have a hurtful consequence.The composer Amie Doherty set beautifully a holiday romantic cheery atmosphere. I love the theme music of Abby and Harper it was so cute and it defines the love they have for each other. The new Christmas song of Tegan and Sara (Make You Mine This Season) is perfect for them and the song was added at the right scene.The entire cast was perfectly chosen and performed magnificently. The main actors Kristen Stewart as Abby and Mackenzie Davis as Harper, undeniable chemistry and their performance brought up a beautifully much-needed relationship to be told. Abby, the one out, and Harper not fully out delivered the meaning of how life brings barriers toward true happiness and the only thing keeping one from being happy is not friends nor family is oneself. I love how they looked at each other, how attentive and cautious they were to not lose themselves over the secret even though it was inevitable. The way both of them cry was more than acting, it felt so true and natural. Abby's story of the loss she had added more feeling of having a family.Victor Garber and Mary Steenburgen as the parents projected the bubble of perfection which blinded them from not really seeing nor feeling the truth about their family. Alison Brie as one of Harper's sisters, I like how competitive their relationship was because most of the time sisters fight or argue and they brought those moments fantastically and with humor. Mary Holland another of Harper's sisters and also co-wrote this screenplay, portrays the invisible sister. My heart goes to her, when there is more than one child and depending on their goals or capacities sometimes there is one that feels left out. She portrayed her so lovingly and when it was time for her to feel noticed my heart sank. Aubrey Plaza is another great representation of Harper's ex-girlfriend. She portrays the feeling of rejection and loved the way she talked to Abby, she really shined in every scene. Dan Levy the best friend of Abby was wonderful and his scenes of tracking and the fish were hilarious. I loved how attentive he was with Abby and how he explained to her about understanding the situation of others.Dear Clea DuVall once again thank you for creating and sharing this film, this representation was a breathtaking masterpiece. There is no other film that could even compare to, there were so many brilliant small details, also it was fresh, and bold in every way. This film means so much to me and I'm also glad that it was a Christmas theme film being as it is my favorite holiday and I added this film to my traditional Christmas movie list."}, {"id": 244, "text": "With a cast as dynamic and talented as Happiest Season, this movie truly misses its mark.I will not post spoilers but I will say that aside from Kristen Stewart, Dan Levy and Aubrey Plaza - who are genuinely enjoyable - there's not much to see here.A homophobic and judgmental family who seem to live in an altered parallel universe are forced (literally) to deal with the actual lives of their three daughters. If the script isn't condescending enough, the settings really are.Wealthy whites can't avoid reality, and their privileged life is set off kilter... my heavens! Nastiness and bigotry abound throughout this piece, and it is jaw dropping-ly offensive.To claim an achievement for producing one of the first holiday films with a lesbian couple is only lip service when the messages are so ugly.Try harder next time. The actors, the LGBTQ+ community and we the viewers deserve better."}, {"id": 245, "text": "I know, I know, there are a lot of really schlocky Christmas movies already out there.But just because this is a LGBT Christmas tale - and thus quietly groundbreaking (or whatever) - doesn't give this flick the right to be THIS god-awful.It sucks in every trope-y, contrived and cringeworthy way possible, as well as blazing new ways to be bad.If anything, this film should have been written as a cut-above, since it's forging into new territory and attempting to build a new tradition.Honestly, the only redeeming scene was Eugene Levy's short soliloquy about the relativity of different coming out experiences. That's IT!Also, I felt that the two female gay leads were portrayed as excessively girlish and asexual. Their depiction was way too cutesy and sophomoric to be credible, and IMO it was actually offensive.It's as if the film makers felt they had to neuter this lesbian couple to not offend mainstream viewers.Well, that offended me!And again, this movie was just SO terrible in all the aforementioned ways.No matter what your sexual orientation may be, this film deserves a HARD PASS.Maybe next Christmas will serve up some better LGBT offerings.That's MY 2021 Christmas wish!"}, {"id": 246, "text": "In a burst of Christmas spirit, Harper invites her girlfriend Abby to come home with her for Christmas. Having previously lied to Abby that she is out and her parents are accepting of their relationship, Harper introduces Abby to her family as her orphan roommate.This underlying-dysfunctional upper-class family has a father who is a conservative politician running for mayor, a mother who tries for perfection, 2 other sisters competing for the parents' love, one of whom is married with kids. There is also a still-single former boyfriend Conner, who mother tries to foist on Harper, and Harper's 1st girlfriend, whom she betrayed. The standout character, however, is Abby's male friend John, played by Emmy-winner Dan Levy (in a supporting role, though IMDB lists him 1st), who is supportive of Abby, even if he is anti-heteronormative.There are too many holes in the plot. I have trouble believing that, in the big house, they don't have a guest bedroom, and so Abby displaces the grandkids from the room they normally occupy when visiting. I don't believe all the rounds of attempts to take a family Christmas portrait. I don't believe that mother would invite Conner to a restaurant dinner without pre-notifying the restaurant, and Abby gets humiliated by being given a shorter chair - or that the taller Harper would not insist on switching chairs. As all this plays out, I start to wonder if Harper deserves Abby, and whether Abby should follow an alternate path.I saw this at an online preview courtesy of the Inside Out LGBT film festival, and was happy at being able to rewind and pause to read the text messages. Be warned: you have to read quick!"}, {"id": 247, "text": "There are so few comedies out there featuring a lesbian couple and this is the perfect one.Harper invites her girlfriend Abby over for Christmas, the latter of which is planning to propose to her. The only problem is Harper hasn't come out to her parents so Abby has to pretend she's her orphan roommate. Although Harper insists that she will come out to her parents at some point during the holidays - Abby notices she is completely different around them and that there is a competition between her and her sisters to prove to their parents they are the most successful daughter.I've been waiting for a queer romantic comedy set around Christmas for ages - and we finally have one! One of the great things about it is that it's hilarious. The awkward social situations, the comebacks and the acting is spot on at all times.Dan Levy as Abby's concerned friend was an absolute breath of fresh air, and perhaps my favourite character.It's feel good, sweet, hilarious and intensely satisfying. Don't miss this!"}, {"id": 248, "text": "4 out of 5 stars.Happiest Season is a good family holiday drama. About Harper (Mackenzie Davis) and Abby (Kristen Stewart) characters who are in love with each other. When Harper is heading to visit her family for the holidays. She invites Abby over. But her family does know. Is she is a lesbian. Afraid to come out to her family. Her past ex boyfriend is visiting her family. Her two sisters with one in a estranged marriage. And another feeling like an outsider but tries to be included.Good plot. The film does have that regular cliche with meeting the girlfriend with the family situations. Like Abby trying to impress. But Harpers family makes her feel a little unease. Like her going with the sister shopping while watching her kids. Her kids decide to cause some sort of trouble that makes Abby look bad. Or Harpers mother inviting her ex boyfriend so they can get back together.The cast ensemble is good. Mackenzie Davis and Kristen Stewart did a great job. Its a coming out kind of story. With a feel good ending."}, {"id": 249, "text": "I was always inclined to give Kristen Stewart the benefit of the doubt. I wasn't of an age to get into the Twilight films/books, and neither was my daughter. Too old, too young. I heard she was One-Note. I heard she was Underrated. Well, l maybe she is both, I don't know. My husband liked her. He said if he's only watching her every five years, who cares if she's always the same? She's good at what she does. Fair enough.But the trouble is, I expect better from Allison Brie, of Mad Men and Community. She's a really good actress, but here her character is just one-dimensional, unlikable, and utterly unrealistic. And that's not her fault. If an actor I know to be talented doesn't shine at all, it's the fault of the material. And this material is schlocky.I appreciate the effort to make a mainstream, Hallmark-ish Christmas movie involving gay characters and complicated families. I suppose in that sense, it succeeds. Happy ending, yay. But it seems unearned, especially given how badly some of the characters behave during the course of the film. I was kind of rooting for a bittersweet ending instead of the usual happy one. Girls, maybe you are just not ready to be together?Dan Levy is a delight, as is the actor/character of the youngest sister. And by the way? Stop treating youngest sisters like dirt, Hollywood. And Jane Austen, for that matter. We are not freaking leftovers. I was glad they gave Jane her due here. Jeez, enough already.Fun holiday movie, in the usual Hallmark vein. Shallow and paint-by-numbers, everyone is phoning it in, including Stewart, but I seriously think she always acts that way.. There, I said it, her range is limited AF. She's lucky to have ever been associated with such a popular franchise. Plenty of much better actresses have struggled to even work for a damned living."}, {"id": 250, "text": "JIM'S REVIEW: (NOT RECOMMENDED) Critics have been far too kind to this gay Christmas love story. This dumb and pointless exercise of yuletide fun is absolutely dreadful. It's pure sitcom nonsense about a lesbian couple, Abby (Kristen Stewart) and Harper (Mackenzie Davis), visiting the folks one holiday season. Only the folks are unaware that their daughter is gay. As Abby so astutely says on their drive to their place, It's only 5 days. What can go wrong? Doh...Understatement! Complications will indeed ensue.This is the kinda of rom-com holiday movie one can regularly see on the Hallmark Channel with conventional good-looking straight couples falling in and out and back into love with enough glitzy Christmas decorations to choke a horse with or without its sleigh. The only real difference in this escapism is that two women actually kiss and show affection. Oh, how shocking and (yet relatively tame) for 21st century moviegoers! (The movie might have been ground-breaking in the 80's. Nowadays, it's commonplace, safe, and dull...fortunately.)Clea DuVall directed the movie with no real style. She can barely muster one laugh from her cast as she resorts to jolly Christmas music and silly slapstick humor to disguise this screenplay's inane plotting. The director is also responsible for the inept story-writing. She co-writes the movie with Mary Holland, who has a supporting role as Harper's youngest sister, Jane. Ms. Holland does capture the annoying qualities of her character and then some. (I might urge her quit acting and to stick to her writing skills, but her story is so contrived and unfunny that this advice would be detrimental for anyone, including Ms. Holland.)The film's only redeeming graces in this overcooked Christmas goose are Ms. Stewart who is always a delight and Dan Levy as her gay sidekick. He essentially plays the same lovable if less flamboyant character as he did in Schitt's Creek, but, at least, he does have a nice comic delivery and screen persona. Seriously wasted in their lightweight roles in this alleged comedy are actors who have done much better work: the aforementioned Ms.Davis, Victor Garber, Mary Steenburgen, Ana Gasteyer, and Audrey Plaza. Let us hope their paycheck bought lots of Christmas presents for friends and loved ones.More accurately, Happiest Season is the dumbest of movies. The message may be positive and uplifting, but the whole venture is banal and as artificial as that store-bought evergreen on display. All this film really shows is that gay people, despite their best intentions, can make just as bad holiday movies like heterosexuals with that same purpose in mind. Despite all of its pretty wrapping, it's coal. (GRADE: C-)"}, {"id": 251, "text": "Romantic Christmas movies are usually something to avoid, mass-produced with same formula (cheesy dialogs, flat characters and a direction without any personality) just to make money in theaters. You could argue, watching the trailer or the poster, that this is the exact same thing but gay, but it's not. This is such an enjoyable movie and not because is corny or predictable or cononical at the contrary, this is a remarkably written christmas movie, and there are not a lot of these, that use a simple but effective formula, yes even unoriginal, to talk about serious, important themes such as coming out, being gay and have to live with a determinate type of family, being ashamed of yourself and many more; and it does that without being rhetorical, heavy or detached but with empathy, honesty and sense of humor. It's the perfect example of a movie you can enjoy every year without getting tired of it, like a Christmas movies should be, and sill talk about important stuff and doing it right. Being gay I felt a lot, this was a true emotional experience, I laugh a lot, I was anxious practically the whole time, I got angry and frustrated and I was also touched. And I usually don't feel this way with this type of movie and, again, it's not because it's a gay movie but because it's a well-made one, with heart and personality."}, {"id": 252, "text": "Remember when stars had what they used to call 'the X factor? They may or may not have been good/great actors, but they had a certain glamour or charisma or unique personality that made them watchable, even in sub-standard fare. A real star could dazzle you into overlooking a weak plot or a lacklustre script or even that their character might be, on paper at least, unsympathetic or unlikable. With a Bette Davis or a Goldie Hawn or a Barbra Streisand in the lead the most far-fetched story or the most ho-hum script could still produce a good time. But in Happiest Season the two leading players are Kristin Stewart and Mackenzie Davis - two stars entirely lacking in glamour, charisma, or even much in the way of personality. Neither are bad actors, though it must be said that neither has any discernible gift for comedy. In fact, there are bit players with only one or two lines in Happiest Season who have better comic chops than either Stewart or Davis. It doesn't really help that the movie is otherwise cast with actors who have an abundance of charisma and comic ability - among them the delightful Mary Steenburgen, the under-rated Alison Brie, and the adorable Dan Levy, who totally steals the movie. Ultimately, what we're left with is a somewhat thin, but essentially workable rom-com scenario that might have been elevated into something enjoyable, had it been blessed with two stars capable of distracting us from the script's major flaws - namely that Harper (played by Davis) is essentially unlikeable, Abby (played by Stewart) puts up with way too much before she heads for the door, and that at no point is there any indication that Harper's mildly uptight parents are too conservative, too religious, too parochial, too... anything... to not cope with having a lesbian daughter. So Happiest Season just kind of flounders for the most part, and is ultimately way, way less than the sum or its modest parts."}, {"id": 253, "text": "It's all highly cinematic (and exaggerated to an extent) and it's clichés galore in the characterization department, yet Happiest Season is a film that leaves you emotionally fulfilled. It follows the formula but adds ample doses of heart, making everything magically work. In this film, you'll witness brilliant performances from Kristen Stewart and Dan Levy. Their friendship (more than the film's core lesbian love story) is what stands out as a truly memorable story arc. The thing about the Caldwell household is that nearly everyone's got something to hide, and that makes it a little easier for writer-director Clea DuVall to collectively provide closure to their issues.Mackenzie Davis and Kristen Stewart share decent chemistry as a queer couple. But I've gotta say those few scenes that featured Aubrey Plaza and Stewart make you feel like they had some totally untapped chemistry. That's for another film to tackle, I guess. Happiest Season is tonally all over the place, oscillating between wacky comedy and genuinely emotional moments. And as a Christmas flick, Happiest Season isn't technically the 'happiest' though it manages to get there eventually (after a lot of misery!). It's an enjoyable 100-minutes alright!"}, {"id": 254, "text": "I watched Happiest Season last night.It's billed as a Christmas movie, but it's not really. It just happens to be set at Christmas.It's really a movie about a gay couple (Kristen Stewart and Mackenzie Davis), visiting one of their parents for 5 days. Just before they get there, one of them reveals not only do her parents not know she is in a relationship, they don't know she is gay.So lots of awkward situations arise, and believe me, they are awkward, not funny. I did laugh a few times, but it was at two of the supporting characters played by Dan Levy and Mary Holland.I thought the ending was totally undeserved, as one half of the couple was incredibly selfish and unlikeable. Everything is tied up in a neat bow, when it's not really earned.This won't make its way onto my Christmas Movies To Watch In December List"}, {"id": 255, "text": "Fresh, sweet and a feel-good flick; Happiest Seasonwill make you laugh, cry and pull at your heartstrings.In this holiday romantic comedy, a woman struggles to come out to her conservative family during the holidays.An honest and timely look at what the LGBTQ community must go through in order to gain acceptance. Sure this little holiday flick has clichés but it's heart is in the right place and will make you feel all warm and fuzzy inside. The entire cast is terrific and their synergy flows throughout the film. A special shout-out to Canadian Dan Levy and his hilarious performance that steals the show. Overall, Happiest Season delivers a solid holiday themed rom-com that is original, funny and and sweet. A great watch.Follow @snobmedia for more reviews!"}, {"id": 256, "text": "Yo ho ho:Yes, so it's predictable and the storyline is nothing new.BUTThis is a WLW Christmas film. I for one am 100% very much HERE FOR IT.Put Aubrey Plaza and Kristen Stewart in all the films.Ba humbug:However, note to future writers; the gay/ coming out part doesn't have to be the central theme of the film, would be nice for it to just be secondary/ completely normalised."}, {"id": 257, "text": "I wasn't necessarily expecting much from Happiest Season. I fancied watching a Christmassy comedy and this popped up, so thought I'd give it a go. It was such a pleasant surprise! Its such a sweet film, with some great comedy, heartfelt drama, and a lovely and important underlying message.The story was very well done, engaging from start to finish. The characters were sometimes a little bit too much and exaggerated, but mostly they were well crafted and I loved the way that they all interacted together. The family managed to seem quite real while also maintaining enough ludicrousness to remain funny.I though the film was best when it was getting to the heart of its more emotional moments. I was blindsided by some of the emotional and poignant parts of the film, which were very well scripted and played out. It was so heart breaking and frustrating to watch at times, making this a really touching and moving film in ways I hadn't expected.I also really loved the comedy in Happiest Season. It was a good mix of subtle comedy and more in your face stuff, and I liked the balance that they managed to strike.The cast were also fantastic. I adored Kristen Stewart in this film, and thought that she played the part to perfection. Daniel Levy is such an incredible comedic actor, so his addition was most welcome. He is the definition of a scene stealer, and so is Aubrey Plaza, who was equally fantastic. Two of my favourite comedy actors from two of my favourite TV shows in the same film, whats not to love?Happiest Season is such a lovely film, and one I'm probably going to revisit for many Christmases to come!"}, {"id": 258, "text": "Happiest Season is the holiday movie of the year, and it is an instant classic that everyone should watch. The film revolves around Harper, bringing her girlfriend, Abby, home for Christmas to meet her parents. The only problem is that Harper's parents don't know she's gay, and she doesn't want to tell them until after the holiday. What follows is a crazy emotional roller coaster as Abby struggles for her girlfriend's attention. And while I love the plot, what really sells this movie is the characters. Abby and Harper are both sweet and relatable. Kristen Stewart and Mackenzie Davis have incredible on-screen chemistry. Also, Aubrey Plaza steals the show as Riley. Every scene she is in is incredible. And Jane is so precious. And the family relationships are so relatable. Honestly, it all reminded me so much of my own family drama. In the end, this movie isn't just about being gay. It's about having the freedom to be who you are and to be accepted for that fact. And while this movie is a little too neat in some places, I like the idea that we can all change for the better to be more accepting. And when a better time to start than at Christmas?"}, {"id": 259, "text": "Haaaah, where to start?!!! Without giving any spoiler, first of all this movie deals with the LGBTQ matter amazingly It's sweet and hurts at the same time, more like shows things not to do so that your loved ones get hurt The chemistry between our lead cast is sensational Mackenzie and Kirsten both are just the dearests Especially Mackenzie, I mean we all know that how good of an actor Kirsten is, but Mackenzie holds her own ground and delivers as a master She is sweet, troubled, funny and misunderstood But whatever it is, she just adores her loved ones One must think that the support staffs sometimes, maybe overdo it but if you think properly, you'd realise that those people are pretending so, so that, Tedd gets the position (little spoiler) but it's not what they are They are all troubled people being misunderstood by their own close ones This movie isn't your always happy Christmas movie, but it shows that one shouldn't do this and that in order to be happy with your family and friends Finally for Kirsten, well you know who you are, An amazing actor I give 10 out of 10 to this movie and 1 extra mark for perfectly showcasing all the realted matters to LGBTQ relationship I wish it was 10-15 mins more"}, {"id": 260, "text": "Great watch, would watch again, and do recommend.There is a huge advantage in knowing as little as possible about a movie before watching it: mostly it removes expectations, and allows little surprises to delight you through the movie.I watched it because it was a Kristen Stewart movie, but was happily surprised to see Clea Duvall involved, and continually delighted to see familiar faces appear: Mary Holland, Alison Brie, and Aubrey Plaza especially.I'm honestly not familiar with a lot of coming out of the closet, but not quite yet stories, but I have seen a lot of secrets for the holidays, and don't tell my family x, and this is very interesting that it uses that concept to knock the wind out of the sails of the story so early.While the majority of the story is basically abuse humor, it's delivered in a way that manages to both garner sympathy for Abbie and be charmingly amusing.If the movie has a real downside, then it's that it tries to do (almost) too many things, but manages to pull it off. Yeah, I pretty much hate Harper, but that's by design, and she's a victim as much as a villain. The shift in stories as things all start to resolve is the worst part of it, but ultimately makes for a satisfying ending."}, {"id": 261, "text": "And everybody who hates my reviews, hates my grammar english trying to construct a long big review with loads of digressions like a train set trying to choose which iron to follow in the railyard, that is like nonsense to 99% of everyone who reads them, just because im boiling over when i see movies that i dislike and movies that i love... and here it comes...THIS WAS A SPECIAL AND DIFFERENT X-MAS MOVIE...see it and enjoy it, good actors, lovely set up, good comedy, and most of all x-mas is all about love , peace and loneliness, so reach out an elbow or bandana to those who needs a push at x-mas 2020... this film is a decent start for this holiday season, thinks the grumpy old man when comparing 99% of the rest of x-mas movies thats made for the tv, thats glittering prizes of perfectness in wealth and personal egoism. do watch it unless youre a lgtb+ . hater. recommended"}, {"id": 262, "text": "A warm, whimsical &amp; wonderful embrace that's brought to life with genuine care, is narrated with heartfelt compassion and is beautifully manoeuvred by its lovely ladies, Happiest Season has all the makings of a holiday classic and, apart from offering its viewers a jolly good time, it also acquaints them with the often scary, difficult &amp; life-altering process of coming out to your loved ones.Co-written &amp; directed by Clea DuVall, the plot is derived from her own experience yet it is going to be relatable to many. The film establishes the loving relationship between its two leads with effortless conviction during its opening sequence and then captures the events which threaten to shatter their bond due to undisclosed secrets. DuVall directs with passion, keeping the merry vibe alive throughout the happiness &amp; heartbreaks.While often amusing in its depiction of familial expectations, siblings rivalry &amp; fear of getting caught, the core element of the picture is treated with sincerity, gentleness &amp; understanding. And then there are credible performances which impart soul into these scripted characters. Kristen Stewart &amp; Mackenzie Davis are adorable together, plus the chemistry they share is incredibly lifelike. Dan Levy &amp; Aubrey Plaza also deserve a mention for leaving a lasting mark of their own.Overall, Happiest Season is undeniably one of the most endearing, heartwarming &amp; soul-stirring stories to surface this year. Radiating intense warmth from the get go &amp; exhibiting true affection for its characters, the film is an exquisite delight for anyone n everyone, and is definitely destined to become a Christmas staple in the years to come. Neither the plot nor the filmmaking is groundbreaking but there is so much heart &amp; tenderness to it that one can't help but instantly fall in love with it. One of the best films of the year."}, {"id": 263, "text": "Over the last ten years or so, Christmas movies have sort of become a thing of the past in terms of quality. Aside from Hallmark making an endless amount of them on a yearly basis, mainstream Christmas films are very few and far between. Happiest Season was likely a film that would've made it to theatres in time for Christmas this year, but due to obvious reasons, it's now available to stream at home. I had very little expectations when going into this film, but you can colour me absolutely surprised. I loved watching this film and here's why I believe it deserves a watch.On the opposite side of things, over the last ten years or so, audiences have absolutely been treated to many films based around inclusion in terms of sexual orientation. For that reason, much like how there are many mediocre stories in every genre, I love talking about the ones that stand out. Happiest Season absolutely fits the bill in that regard. Following Harper (Mackenzie Davis) as she brings her girlfriend Abby (Kristen Setwart) home to meet her family for the holidays, many revelations about her family having no idea about her love life quickly come to fruition. From wishing to hide the truth from them to many other family issues happening around her, it all makes for a funny, charming, and heartwarming film to watch during the holiday season.This film is very well-rounded in terms of its casting. From the always great Alison Brie to the underrated Victor Garber, Happiest Season is loaded with talent. The cast around the central characters are all great here, but this is really the Mackenzie Davis and Kristen Stewart show. Whether you're talking about her appearances in massive blockbusters like Blade Runner 2049 or more intimate films like Tully, it's very hard to dislike her performances in anything. Along with her delivering another wonderful performance here, I think this may just be the best performance Kristen Stewart has ever given. This duo together illuminated the screen for me. I normally don't find myself praising Kristen Stewart as the highlight of a film, but she surprised me here.Sure, what I will say is that there are many plot points that you have seen many times, but I feel like that argument is sort of becoming invalid when talking about most movies nowadays because so many of them are being made and will eventually have similarities to others. It really comes down to standing out among the rest and this film absolutely does. I knew where this film would end up, but between the very solid direction by Clea DuVall and her writing the screenplay with much care alongside Mary Holland, nothing about it felt too familiar. You can always feel when a fresh take on a tired story is being explored and I thought that made this movie feel very fresh.Overall, Happiest Season pulls you in with a lot of likeable characters and brings you on a journey that will have some viewers laughing, others crying, and many just sitting there with a smile on their face. The message of this film is all about accepting people for who they are, and even though I said that is beaten to death throughout the majority of films that have done it in the past, there's just a spark here that works. Happiest Season is now available to stream on some platforms as well as being available to rent/buy digitally. I highly recommend checking this one out."}, {"id": 264, "text": "Kristen (from the terrible Charlie's Angels movie that was SO bad it was enjoyable) plus a Holiday movie? Why not.... Great lighting and colors, locations and good sound-editing. Though it certainly wasn't what I was expecting it to be. Less holiday-ish, and more dumb-romance family stuff..Kristen has the better role reacting to everything. She actually feels really organic, and her attires are good. I'll probably will be seeing more movies with her in it. Her delivery is good, lines and emotions.. She has gotten better over the years. As for Mackenzie Davis, she looks baaaaad. It's her hair.. it's not doing her any favors. It actually might be a character choice.. since she is so dislikable. Visually, it makes it easier I guess. Mary Steenburgen always an elegant lady. The character Jane is a bit too much. Like taken from a recent Adam Sandler movie. And the intense relationship with the other sister (Alison Brie) was promising if not a tad predictable, but wasn't used for good comedic purposes.The movie does end very well! Making up for the story so far. Don't watch it as a holiday movie.. wait for March or some somber month, haha. It was fine, I guess. Not something to recommend or watch again."}, {"id": 265, "text": "The situations in Happiest Season ring of truth. Particularly, when the infatuation ends in a relationship, and a serious inventory of is it worth it? is writ large before you. Making this kind of situation a comedy--in addition, loading the matter of coming out to your family on top of an already heavy subject matter--is tricky. Happily, for us, it succeeds for the most part.Abandoning the familiar mantra all gay people are scolded with we're here, we're queer, get used to it, we're offered a much more realistic situation where proclaiming alternative sexualities isn't as simple--or welcome--in every family. For that alone, kudos.Assembling a crackerjack cast, Clea DuVail tells her own story and just how fraught being yourself can be. A competitive sibling, a family's definition of perfect that quashes any deviance, and a political campaign in a small town leaves the principal character with literally no choice (she thinks) than to hide her partner's real identity, giving her that neutering label: She's my roommate. And the family's unconscious threat also adds, ...she's an orphan. The latter is played with hilarity by Kristen Stewart who assumes the role because, well, she IS an orphan. Stewart keeps adding more and more success to her achievement as an actor. She grounds the film but she also earns more sympathy than the writing perhaps intended. Her partner whose family they've entered really alienates the audience with her partner's behavior. We just don't like her or find her worthy of Stewart's character's devotion. And it makes the film wobble from comedy to some serious thought--at least from the audience--this ISN'T worth it. Even in the early scenes of bliss before they enter the ambush of the family, I thought Mackenzie Davis felt uncomfortable in the role. She was just trying too hard.The rest of the cast shines with substantial support from Dan Levy, Mary Steenburgen and Alison Brie, who really deserves her own film. She can frost a room with the arch of an eyebrow. Too, Aubrey Plaza brings an undercurrent that makes us wish Stewart's character would just pick her, and they could run off and live happily ever after.This is a big, glossy, important holiday release, hoping to garner a place in the pantheon of Christmas classics. That remains to be seen, but the fact that it's up for consideration makes it an impressive achievement."}, {"id": 266, "text": "The trailer really built this up as a feel-good studio rom-com, and the actual product was a kind of cute, meandering indie film with the sappy, cliche studio moments that twist your emotions. I didn't mind the storyline was very done before, as, I've never seen a lesbian holiday film, and was hoping for a good one. It was Ok. No Home for the Holidays or The Family Stone, and no Imagine Me and You.Kristen Stewart and Mackenzie Davis start out likable and cute, and you root for them, then things take a bad turn, but things wrap up nicely for them in the end, and you root for them again. The real hit of the film was Jane, the quirky sister, and, again, the cuteness of Stewart and Davis as a couple. Dan Levy had some funny moments but his character dialogue was really annoying in some spots, and funny in others. The LGBT community didn't fight for the right to marry so just a few years later some character can drone on about it being a patriarchal institution. Frankly, it was kind of disrespectful and out of touch.For Clea Duvall's second film? It was decent. She's early in her directing career so I'm not going to be super critical. I'm glad it was made. I wish it had been better. It had the elements, just needed to be tightened. The middle was just a lot of stuff happening and not much storyline cohesion. It felt more like watching home videos of someone's life rather than a tidy story. I think the co-writer wrote, The Spy Who Dumped Me, and that film was similar - kind of funny, but just a bunch of stuff happening rather than a nicely paced story.I'll probably watch it again and just fast forward to the scenes I like. Cute but not quite the fun holiday classic I was hoping for."}, {"id": 267, "text": "A delightful holiday romcom.Happiest Season is a nice LGBT twist on the romcom format. Though the cast is chock-full of A-listers, the film felt a bit too surface level. But it's a romcom, what do you expect?The plot is upfront right away. It's an LGBT movie about... well, I won't spoil. But it's an uncomfortable topic for many. The audience has no doubt about the plot upfront. All while having a few laughs between.Abby (Kristen Stewart) does an amazing role starring in this film as she plays a believable lover in conflict. We emphasize the struggle that she faces throughout the movie.The movie moves fast from an idea to Harper's (Mackenzie Davis) house and conservative family. Though the family is a plot device to introduce conflict, they felt a bit too contrived and artificial. Comic relief is too obvious and forced in some places. Though no fault of the actors, more could have been done to the script.Every character has their own hidden secrets and conflicts. For better or worse, they must face these consequences later. This aspect of the film was appreciated as it gave more character development for everyone.Yet, by the third act, the hidden secrets seem to have little to no consequences for everyone. The third act felt rushed and contrived.Thankfully, the cast of A-listers carried this movie. Everyone who watched this movie will stan Aubrey Plaza. She did an amazing job, but Dan Levy, Allison Brie, Victor Garber, among others deserve their own praise. All had stellar performances and did the best that they could with the script.It's a good watch with some genuine moments and highlights. Even with all the positives, I can't bring myself to feel at ease with the ending. If you went through all the struggles that the protagonist suffers in this movie, how would you feel? Sure characters are happy in the short term, there are some real underlying relationship issues that aren't answered. This is true within Abby/Harper's relationship as well as the larger family.3/5. You want an LGBT friendly holiday romcom film, this is it. It's a good idea with sloppy execution. The entire package leaves more to be desired."}, {"id": 268, "text": "Happiest Season has a lot of good moments and works for the most part though sometimes it appears to be a little bit corny and confused whether to be a comedy or romance. The coming out story in a Christmas setting was refreshing, a welcome change from the Love Actually wannabes we get every year never mind how problematic the film itself is.Kristen Stewart effortlessly plays the role of Abby, the matured and brave lover of Harper (Mackenzie Davies) a promises to come out to her parents after the Christmas holidays. Harper takes Abby to her conservative parents' for Christmas and we began to see the unfolding of typical high end family who hide behind masks. Aside from the lead actresses, no one has any significant screen time or part to play. Alison Brie and Aubrey Plaza could have had better roles.Ideal to release it in OTT these times, as its the best for it to get a wider reach in these tough times. Happiest Season clearly shows the path for Christmas movies in future. The best way to save this dying genre is to put some social commentary into it."}, {"id": 269, "text": "Happiest Season is a Christmas comedy filled with heartwarming and funny moments. Where this film shines the most, is being very pleasant. It's fun when it wants to, it's wholesome most of the time, and above all else, it's festive and wonderfully Christmasy.This is exactly the type of film I have come to love this holiday season. A year ago I would've never even watched a film like Happiest Season, let alone enjoyed it. But now, instead of scoffing at another pointless Christmas romcom, I look forward to letting myself forget about the world for a moment while I fall into a what is hopefully a warm and pleasant couple of hours. And for the most part, Happiest Season is exactly that. I laughed often, and generally speaking, I had a really great and joyous time with it. It certainly is exactly as cheesy and predictable as I expected, but then again, that's what it's supposed to be like. How could a movie like this, ever be as enjoyable if I didn't at all times know what is going to happen? Or how could it ever feel so wonderfully Christmasy if it wasn't painfully cheesy? These kinds of films thrive when they feel familiar, and when they give a warm and fuzzy feeling.The story follows Abby and Harper, who have been in a relationship for some time. While Abby is openly gay, Harper still hasn't told her parents, and once she invites Abby over for Christmas, things get complicated. Old acquaintances and love interest appear, complicating things further. Harper ultimately has to decide whether to lose Abby or whether to come out to her family. It's a simple story and if you have ever seen another movie like Happiest Season it's not hard to figure out how it's going to end. The story, while simple, didn't bother me. However, what I found quite unenjoyable, were the characters. In a film that is so intensely character-driven, as Happiest Season is, the characters must be likeable. Unfortunately, they aren't. At least most of them. Abby is great, and for the most part, I ended up feeling sorry for her. She is stuck in a painfully one-sided relationship, and all I wanted for her was to be happy. Jane, one of Harper's sisters, is also fantastic. I really liked her a lot and ended up feeling sorry for her as well. While she is one of the three sisters, the parents never appreciate her for who she is. The whole rest of Harper's family, herself included, were quite infuriating. Although I have nothing against unlikeable characters as long as they are done well, I really would prefer movies like Happiest Season to keep them to a minimum. All I want to do while watching these films is laugh and have fun, feel warm, and maybe even cry a few times. The last thing I want to do is feel frustrated by the characters.While this film is genuinely enjoyable for the most part, had the characters been likeable as well, I'm sure I would've enjoyed it a whole lot more. Happiest Season and others like it rely on being easy to like. There certainly needs to be an unlikeable character so that the main protagonist can triumph over them at the end. But when most of the characters are that way, the film becomes harder and harder to like. Thankfully Happiest Season is otherwise a near-perfect example of how to make a Christmas romcom. In addition to everything else, it also captured incredibly well the awkwardness of having to meet new people through someone close to them, which lead to some very relatable and funny moments that ended up making this film as enjoyable as it is.Although I wasn't the biggest fan of the characters, ultimately this film is exactly what I wanted it to be. It was funny, it was tremendously heartwarming, and it put me right in a cosy Christmas mood. The ending, while easily predictable and cheesy, made me smile and feel happy. And as far as I'm concerned, that's exactly what Happiest Season needed to do."}, {"id": 270, "text": "Like a lot of these reviews, I really wanted to like this movie. Highly promising cast, the story was a familiar trope but with a twist of what I thought would be a truly cute and funny gay couple. Unfortunately this movie never really decided what it wanted to be, moving from cute and silly and then jumping right to drama and seriousness. You never really get to appreciate the main couple before you get hit with the we have to pretend we're straight plot device. That could've laid a path for either a really funny fish out of water/hope they don't get caught comedy or a real deep dive into the reality of same sex relationships and how they effect each other and their families. As it's said everyone's story is different and it feels like a missed opportunity for either really funny family Christmas movie or a tear jerking drama that leaves you sobbing. The bright spots in this include Aubrey Plaza who's delightful and remarkably reserved, you find yourself wanting her to get the girl vs. Harper who never really earns her redemption. Kristen Stewart really shines in this, I was really impressed with her nuance and comedic timing. Speaking of comedic, Dan Levy, to the surprise of literally no one is fantastically funny and steals every second of scene he's in. All in all this is a near miss"}, {"id": 271, "text": "Gingerbread cookie-cutter, I put 100 hours into that painting, and you just destroyed it like it was nothing paint-by-numbers rom-com. Set during Christmas for extra schmaltz. As for the romance and several of the characters being gay, I suppose it's progress that all sexual orientations make equally trite rom-coms. Maybe if it came out a decade or so ago it would've seemed at least daring, but Happiest Season seems to occupy a safe space now. I'm not sure if it's ever even made clear where they travel to for Christmas or whether the father is a Republican. And is it still a tired trope to have a gay friend invested to a disturbing degree in the central romance when that romance is no longer a straight one? That editing back and forth between the inevitable make-up kissing and love declaring and Dan Levy cheering from the sidelines was sickening--just keep the camera on the couple. There is one reason the lesbian coupling works better in this case, though, because they play it straight in front of the family. They're actors playing actors. Most of the humor revolves around this mistaken-identity comedy of errors.It's for that reflexivity that I watched it. Plus, I like the cast--some familiar faces from TV shows and other movies I've seen, and they're all pleasant enough here for the most part. Unfortunately, nothing beyond the obvious family Christmas connection is made of the film-within-the-film, It's a Wonderful Life (1946), that's never shown. Anyways, I tend to dislike modern rom-coms; they're terribly formulaic. This one, at least, doesn't succumb to some of the worst pitfalls. The grand romantic gesture is kept relatively intimate. The Christmas stuff doesn't even get too sentimental. It's better than what a Richard Curtis or Garry Marshall would've done with it."}, {"id": 272, "text": "Happiest SeasonA rather bland Christmas movie that had a coming out story as the present for the supposed intolerant family at the festive break.What was good, we did laugh, there some very funny gags.What was problematic, no chemistry between the two female leads, predictable story, and a ramming home of political correctness.What was bad, everything was presented from a heterosexual viewpoint, sexual expression was dumbed down, we had class profiling and even some tokenism.I did fidget when the predictable ending came into view, and the shock value that it was about two women is passé we are in 2020 and no one is even mildly exercised.I give this a hard 6 for entertainment but alas Kristen Stewart was miscast."}, {"id": 273, "text": "Harper (Mackenzie Davis) reluctantly invites her girlfriend Abby (Kristen Stewart) to her conservative family Christmas. Abby excitedly plans to propose but Harper reveals that she had lied about coming out to her family. They have to pretend to be straight while Harper's father (Victor Garber) runs for mayor. Her mother (Mary Steenburgen) is stressed. Harper is constantly competing with older sister Sloane (Alison Brie). Jane (Mary Holland) is the overlooked awkward sister. Riley (Aubrey Plaza) is Harper's ex. John (Dan Levy) is Abby's friend.This is basically a traditional Christmas comedy with all the rom-com and family dysfunction toppings. It adds the newish lesbian coming out story into the mix. Actresses Clea DuVall and Mary Holland are the writers and filmmakers. Clea is not necessarily an experienced director and it shows in a couple of scenes. Mostly, this is a fun romp with a serious premise. I really like all the actors. Davis and Stewart are good together. I would probably switch out Steenburgen for someone more high strung. She needs to be more Waspy. The comedy is great although sometimes, it needs a sharper pen. There is also the differing tones. Sometimes, they clash. The denouement stretches out a little too long. Not everything needs a wrap-up and the comedic tone fades away after awhile. This is very good all the same."}], "reviews_amount": 274}