{"name": "The Tax Collector", "titleId": "tt08461224", "reviews": [{"id": 0, "text": "So much hate for this movie, for no reason. I had a good time. Shea was pretty damn good in this and I've never been a huge fan of his. If you enjoy David Ayers films, then ignore the hate and just give it a try."}, {"id": 1, "text": "Shia did great, but he wasnt the main character.The acting by David could have been better, it almost seemed like he was reading off of cue cards in some scenes.And the girl who played the wife Alexis... her lips are so full of filler and it was so distracting during the movie! Her and David are supposed to have a passionate marriage, so they kiss a lot. There are a lot of close ups of the married couple- and all I could focus on was her lips full of filler. Jesus."}, {"id": 2, "text": "This movie has potential but everything goes to heck because of the extremely bad script. First, you need to wait almost 60 minutes of 90 to see something interesting. Second, when the action starts everything goes extremely fast. Shia's character was barely developed. Are you serious? Last, Fx's look cheap and acting amateurish, except from Shia. But...So, overall a wasted opportunity to create a great movie. Shame on Director 's and writers. Make yourself a favor and watch Sicario 1 and 2 instead watching this one."}, {"id": 3, "text": "Best part of this movie, the trailer. pretty funny he got real tattoos for this role for as bad as the movie was."}, {"id": 4, "text": "He should have stayed in movie longer..It was a good movie. Not the best.. not the worst.. he was great though."}, {"id": 5, "text": "It's a bit like a film student and a few extras had an afternoon off, and played with a camera .The story couldn't be more basic, acting and dialogues are cringeworthy, never credible, just very amateurish ."}, {"id": 6, "text": "Thinking it was going to be a badass gangster movie instead turn out to be boring and just bad cinema."}, {"id": 7, "text": "If you like gangster movies and you want to watch one that doesn't follow the same story as every single other one you'll like it. It made me laugh and made me say, Oh s$@t a couple times."}, {"id": 8, "text": "Granted it isn't going to win any awards but some of the reviews were straight up brutal - especially people who wouldn't like this kind of movie anyway and you can tell by their reviews.This was something half way decent to watch while waiting for some good movies to come back around. I gave it an extra star just because I thought it needed a little push."}, {"id": 9, "text": "I liked all characters except David. Felt like he was scary and lacked bravery (speaking nicely). Really excepted a different story line and more action and roughness on CreeperS (Shia LaBeouf's) end, however I still liked him as a character. The story line should've been written differently IMO."}, {"id": 10, "text": "It's generic. I thought it would be better. The women in the movie are beautiful. The story is generic. It's every hood movie ever made. I've been drinking and couldn't even get into it. Nothing stands out and makes it special. It's just a movie."}, {"id": 11, "text": "So the movie starts off interesting, with both characters equally important in their own ways, however, is suddenly turns into a hodgepodge of scenes. I don't really know if it was edited this way purposely or not, but many scenes seems like to time had passed by. It really distracted me from finding the movie interesting anymore and I ended up fast-forwarding until the end."}, {"id": 12, "text": "Best actor in it was Shia LaBeouf, creeper. Unfortunately he gets killed off pretty quickly. I expected him to be in the trenches with his partner and getting his hands dirty because that is what the trailer had portrayed. Speaking of the trailer, if you have seen it, then you have seen literally every scene shia LaBeouf was in, not very much. If you're watching this for shia LaBeouf, you will be disappointed. Side comment, I am not sure why he got the tattoo, I dont recall seeing it at all in the movie."}, {"id": 13, "text": "Some good bits which were watchable The main problem is that the 2 main actors just mumble all their lines, and I had to watch the movie with subtitles."}, {"id": 14, "text": "Weak plot, weak writing. Very messy. Great actors but let down by the poor story."}, {"id": 15, "text": "I really enjoyed the flick. Definitely not as bad as most are making it out to be. I definitely think it could have been longer to tell more of the story. A lot did seem rushed. I actually like the fact that Shia wasn't the leading man. I think both main characters did great. It had me on the edge of my seat for most of the movie. I would definitely watch again."}, {"id": 16, "text": "A different look at life in the city, not everyone will understand because they don't have a source of reference. If you want a good movie with action and not predictable give this one a try. This movie isn't for everyone but it doesn't deserve all these negative reviews. Watch a movie that isn't predictable and will be a good time to watch, definitely check this out."}, {"id": 17, "text": "Another very watchable David Ayers LA hood flick. It's not no harsh times, the watch, street kings or training day but it's decent. I highly recommend you check it out online if you can."}, {"id": 18, "text": "Yea the budget wasn't big and We all know Shia LaBeouf is a tool but he is a decent actor and the story actually wasn't terrible.. Could the acting have been better, Absolutely.. But given the budget and mostly no names it was pulled off pretty good.. A story about corrupt and illegal business dealings that then turns into one man's revenge for what is done to his family the story is actually decent. Ignore the mostly negative reviews and give this a chance if you are a fan of organized crime action.. Give Shia a chance"}, {"id": 19, "text": "This movie is poorly made. There isnt any character development. Bobby Soto is not a lead actor. Una mierda Una mierda Una mierda I havent finished the movie and had to write its una mierda"}, {"id": 20, "text": "A lot of people giving criticism on a movie they can't relate to. This movie depicts how it really is. Something that has been hidden for so long. If you grew up in Cali and lived the lifestyle you know this is as real as it gets..."}, {"id": 21, "text": "Shia was surprisingly the best part of the movie. This looked like a student film because they threw in every camera angle out there. Spoiler alert... once Shia dies everything goes way down hill. Worst $7.99 I've spent in a long time. Save your money... if you're really curious, just wait til it's free like next week."}, {"id": 22, "text": "Wasn't bad liked it. At the end the phone call do we remember him from sons of anarchy would be cool if that was his dad just saying 🤔 .as for low reviews just watch it 😉"}, {"id": 23, "text": "Its not bad but could of been better as any movie can always be better maybe a sequel showing Shia alive still."}, {"id": 24, "text": "Is it the best movie you'll ever see? No..but definitely not as bad as some of these reviews are making it out to be. I agree the end seemed rushed and Shia's character wasn't the main character like we thought he was going to be, but still a pretty good movie overall. Have an extra star to counter all the hate."}, {"id": 25, "text": "I will say that this movie and especially Shia LaBeouf's part in it was a little overhyped but it's not as bad as these other reviews are saying. I say Shia LaBeouf part and it was a little overhyped because he just doesn't get as much screen time as you thought he would. He's great in this movie, he is totally believable. I will say this is a standard La gangster film. It's not going to break any records but this is not a bad movie. At least it's work a little bit more then the collective reviews that IMDb reviewers have given it."}, {"id": 26, "text": "I couldn't finish this movie. Everything about the movie was trying so hard to be cool and badass. The acting and dialogue from LaBeouf and Soto was embarrassing to watch. I finally turned it of at one point where a 'scary' boss asks to speak to his underling and proceeds to quietly laugh into the phone before hanging up. Very intimidating... and cringe worthy. You'll see what I mean if you make it that far into this garbage. I'll be very impressed if you make it to the end."}, {"id": 27, "text": "Hugely underated movie. Could have been better? Of course but the performance of Shia makes it just above average"}, {"id": 28, "text": "It could've been longer, it could've done w/ a bigger budget, it could've used some character or story development but, overall, a solid movie. I liked it. There's a character in this movie w/ the same name and played by the same actor as one in Training Day, I wonder if there was intention behind this coincidence?"}, {"id": 29, "text": "Deep, introspective - asking the big quesions of how far can you stretch your humanity, until you're no longer human. Gritty, stylized and unpleasant at times, but that's the point. Low budget to be sure - but they make the most of what they have. Very well made film."}, {"id": 30, "text": "Go look..as soon as he started incorporating minorities playing lead roles, his ratings started scrambling... just check. Now to the movie; it is ok! I think there's good build up to an outcome mostly predictable yes, and while he tries to not make it so predictable, it ends up like that. I think the first two acts of the movie were actually being well constructed, but then the last act seems rushed - it could be that there was not enough script development to fill in or studio pressure to cut the movie run time - and the ending is overly simple. But one can still enjoy the effort, the diversity in the movie and, the possibility of understanding the world he tried to portray. I liked Bobby Soto as lead; he pushed himself hard to bring depth to the role and for most part feels credible, and Shia LaBeouf, he is good too, finally has the kid feel stripped off him and it feels great."}, {"id": 31, "text": "Shia will be hating those tattoos for the rest of his life because the shame he will feel every time he looks in the mirror and remembers how bad the movie tanked if i could give it half a star i would better luck next time"}, {"id": 32, "text": "This movie is by far one of the best I've seen recently. It's not the same old b***s*** storyline with a happy ending. It's not always easy to watch, but for those in the know...this movie hits home. I have to believe that the people giving this a low rating watched it solely because of Shia LaBeouf. They watched it thinking it would be one like one of his other projects. While I approached this film knowing next to nothing about it and was pleasantly surprised to see Shia in it. This movie isn't about him or his character. It's about something so much deeper and if you don't get it, you won't like it. It's that simple."}, {"id": 33, "text": "I only rate films on IMDb and don't write reviews but since there's so many negative reviews aka haters, here I am. If you enjoy gritty cinema, know someone or you yourself are familiar with street code, or just plain like crime films genre - you will completely understand this film. They do the same thing with Tyler Perry films because they can't relate, they spread negativity and horrible reviews. Shia and the cast did a wonderful job! I laughed, flinched, and cried. Without too many spoilers, the real reason people are hating is because of the films messages. Some people don't like to see the black and brown pride. Some people may be confused and not understand how a criminal can be portrayed as a man of faith, a good man. This film is not for them. This film is for us and we will make it a classic, like we do all of our other films."}, {"id": 34, "text": "I came into this not have high expectations because of the terrible reviews. Honestly this film is for a certain type of person. First, a person who loves Los Angeles and everything associated including the criminality and gangs that are intertwined. Second, if you love the film Training Day and Sicario and like Shia then your in for a treat! Yes there is gore and extreme violence but that's been around in action since the early 90's.I have to admit I'm a huge Shia Labeouf fan and that was the motivation behind watching this but David Ayer is a fantastic director too. Long live LA!"}, {"id": 35, "text": "Gritty, confronting, violent movie. The story was well written, mix of Sicaro/ Savages/ Resoviour Dogs and Training Day kinda feel. Well acted, Shia's character will probably become a cult classic.If you like correcting ppl and telling them what they can and can't do, say, how they show say and what is acceptable... become a language teacher, don't bash movies with reviews.Movies are an art form. You don't like a painting don't look at it, you don't go bashing the artists with reviews telling them what they can and can't paint. Same is with movies.Definitely worth watching and you'll probably end up watching it again if your ok with graphic violence."}, {"id": 36, "text": "Not sure the hate here. The main character was sympathetic and the 2 deaths were certainly unexpected. I would have liked to see the movie end the way needed with the loop closed."}, {"id": 37, "text": "You can tell that David Ayer directed the film. With the los angeles location. This was a brutal film (especially shia LaBeouf's death and conejo death scene too. Could of been a lil bit better but overall...i enjoyed it and really liked seeing shia lebeouf play the role pf a psychopath cholo."}, {"id": 38, "text": "Movie got some lil bad choreographies BUT boy, loved the story line. It really was captivating and man, loved Shia LaBeouf and his performance not forgetting his wicked dialogues, wished more for his character though. I say watch this movie regardless of what the Critics say and you will enjoy it like I did, just ignore some bad choreographs and that's all."}, {"id": 39, "text": "Take it for what it is and you can enjoy it.. Don't get all the hate. Not great but far from terrible."}, {"id": 40, "text": "A lot of people hate this movie because they dont understand it. The movie shows a different world that most people will never be exposed to."}, {"id": 41, "text": "Stop comparing every movie to citizen kane or godfather. You guys complain about the acting. I didn't grow up in the hoods of LA. But I'm pretty sure a lot of these gangsters weren't well educated and some of them don't articulate very well. They probably speak very choppy and are not charming or funny. It's probably very awkward and scary to be around them. I thought that came off very well. And Shia lebouf was amazing. The violence I thought seemed real enough. I never seen someone get their head stomped in so I couldn't tell you how real it was. I'm sure if I did, I'd say oh man this looks like a movie, right before I pissed my pants and ran away. Sometimes a movie is just a gritty real look into these underworlds and their misguided loyalty, values, and bravery. So don't go in expecting Oscar bait. You're not going to get it. Especially with a David Ayer film. I thought it was Excellent."}, {"id": 42, "text": "This movie was one of the best I've seen in a long time.. reminds me of end of watch... THIS movie was great suspenseful and keeps your palms sweating.. amazing work Shia La'beouf"}, {"id": 43, "text": "Fire movie front to back. Most people that hate on this movie probably ain't familiar with the LA Chicano lifestyle. Only knock on the movie is that it was too short imo. When I saw they cast shia as a sureno I thought it'd be forced and wack but he pulled it off like a mf. Creeper reminds me of a lot of homies from the neighborhood, great acting."}, {"id": 44, "text": "This website won't let me use any profanity but I swear on everything I love this movie is so freaking dope. Definitely recommend. MUST WATCH. It's too good not to watch. To those of you who rate it below an 8, think twice about your existence because this movie is tooooooo dope."}, {"id": 45, "text": "The movie was very nice and enjoyable Their acting was perfect specially Shia LaBeouf"}, {"id": 46, "text": "I dont understand the hate for this movie, best movie we've seen alllll year! Nine because we wish it was longer !!!"}, {"id": 47, "text": "Weak plot? weak writing? messy? Wow. Talk about killing a good movie. Acting was good for what it was portraying. This was not a Tom Hanks its A Beautiful Day in the Neighborhood type of movie. It was an action movie, with lots of violence. That kind of movie and it was well done. No you don't learn from this movie other than you want to have nothing to do with selling drugs. It was entertaining. Acting was good. I would give it an 8 for the type of movie it was representing."}, {"id": 48, "text": "This was a good movie.. not Oscar worthy but it was a really movie... give it a chance... pretty intense and very emotional.. can't trust critics these days along with everyone who thinks they are critics.. this movie isn't a 10 but im giving it that to make up for the 1s it received from haters. I would say it is a 7.5 and if everyone gave it an honest review I believe that's where it would stand."}, {"id": 49, "text": "I loved it. Good beginning to end. Loved seeing the gang members from the past lol. Don't get the hate. Just enjoy."}, {"id": 50, "text": "I don't really comprehend the negative reviews as there is nothing wrong with this film - any rating below a five is unwarranted and unfair, although I am admittedly a fan of the gangster film genre. I could see critiquing some minor points, such as the pacing, but overall this film holds up very well and does a great job of capturing the gang atmosphere without resorting to stereotypes. The characters seem authentic, although the brutality might be somewhat exaggerated. The cartels are obviously extremely cruel and violent but this film takes place in America where in reality the violence is generally less severe. It's about two enforcers who mostly do routine collections but get caught up in an escalating turf war. It's a great street-level perspective on cartels operating in America and a great watch for a fan of such material. As an added bonus, it has a great Latin Rap soundtrack. Those who give it a low rating probably should be watching something else, just as I avoid all the comic superhero movies because I don't like them, although I never claim they are bad."}, {"id": 51, "text": "Was raised around similar circumstances and Shia did a great job! Only thing wish he had a bigger part. Great movie love the unity! Kudos to the director on this. That's what the world needs."}, {"id": 52, "text": "This film is just BAD! Awful acting, awful story, just AWFUL! Shia LaBeouf does not even save this. Don't bother!"}, {"id": 53, "text": "The trailer is misleading because it makes the film look like it's a Shia Lebeouf movie, but he's actually in a supporting role. There are a few very slow scenes and it's extremely violent, but, overall, I really like The Tax Collector because of its story. It's a fresh take on the gangster movie genre."}, {"id": 54, "text": "Wao wao... Horrible!!!! The worst tax collector in gang history. Horrible script, directing, the acting was sooooo baddddd my gosh, Shia's character was the only thing you wanted to see and well if you see the movie you will understand. The freaking cgi for the action you could see it that it was computer generated, I mean come on. Not recommended at all. The funny thing is Shia got a real freaking tattoo for this trash of a movie."}, {"id": 55, "text": "I really don't get the bad reviews this movie is getting, David Ayer makes cool action/crime movies which don't pull their punches and it's refreshing to see in an age where big studios are watering down their movies to get a PG rating so they can make more money. Shia LaBeouf was excellent and he was actually very intimidating which is something i didn't think i would ever say about him and Bobby Soto did a good job too, he really sold the emotions his character was going through.Is it as great as other movies he's made like Fury and End Of Watch? Not really but does it deserve a 4.7 on IMDB? Hell no, this is a fine movie which fans of this genre should enjoy. If you're a fan of action and crime thrillers then check out it, you might be surprised."}, {"id": 56, "text": "Awesome movie. Watched it 3 times so far. Everything about it is awesome. The violence was too much but that's about it. Lots of girls with big boobies, super suspenseful, etc. Loved it."}, {"id": 57, "text": "I'm no movie critic. I've seen the reviews for this movie before watching. If your like me and enjoy a good thriller/shooter, I thought this was a pretty good movie!! Some people get too critical, but if you're an avg person who enjoys good action, this is a great movie and you will like it!"}, {"id": 58, "text": "Quite possibly one of the best hood movies I've seen in a while, majority of the people being negative about it don't know what they're on about. I'd recommend this movie to anyone."}, {"id": 59, "text": "I love to see Shia in another movie, but this ... damn it sucked.Humanizing criminals and glorifying crime... trash topic :)I would love if they tag these types of movie so I skip them.PS: The story, god so bad. Like what was the point? People die without reason, predictable scenes and the music on the background ... damn. Such a bad sync."}, {"id": 60, "text": "Original story with dope performing. Just go along for the ride"}, {"id": 61, "text": "Use that 1hr 30mins you would waste on this,and go and paint a room and watch it dry more exciting than this pile of dung!!!!!!!"}, {"id": 62, "text": "But I agree. Shia was best part and best actor. After the killed him it all went down hill. But come on. Some people gave it a 1. Seriously? Way better than that."}, {"id": 63, "text": "When I first heard about Shia taking this lead role I asked myself if he could pull it off. But, i am surprised this went the way it did with David Ayer leading the way as director and writer.This script, particularly character development, was absolutely cringe worthy. The lead roles have this battle of trying to act with a horribly written script and imho couldnt pull it off.Truly unbalanced and not the quality you saw in Training Day."}, {"id": 64, "text": "It seems like David Ayer films get a lot of negative heat these days even though he has some solid movies in the past. End of Watch was an amazing movie, Street Kings was solid, Fury was good, and Bright was decent. It seems people have been hating on him since Suicide Squad.I've been waiting for this movie come since I'm a huge fan of Shia and he does not disappoint. I wished they did more with his character because he was the movie. Bobby Soto (David) was also good but the rest of the cast is where the acting gets weaker even though I did enjoy Cinthya Carmona (Alexis). Jimmy Smits part was very small which sucks cause he is talented. George Lopez was completely horrible, he never needs to play a crime boss ever again. This movie is not as good or as gritty as Street Kings but it is a solid watch. I would give the movie itself a 6 with Shia bumping it up to a 7. If you are a fan of Shia, you need to watch the movie."}, {"id": 65, "text": "What has happened? Shia LaBeouf. Transformers. I expected more. Why sink to this level? Is he desperate? Why mix with amateurs? Does he need money? This movie is really bad from start to finish ...."}, {"id": 66, "text": "It's more of a bad Mexican telenovela with poor acting and characters you cannot difference or follow ... + Shia LaBeouf .. boring since the very start and the story makes no sense, full of cringy cliches.We left the drive-in cinema 20min before the movie ends. At that point we cared more about not getting stuck in traffic at the exit than the ending of a terrible movie."}, {"id": 67, "text": "A movie is about full of bad guys, but you see the first gun shot at 56th minute. Full of ego around all the time but no one is doing anything, just talking.LaBeouf, kept talking and he got shot at the first gun fight and then dead. What was that?What about the tatoo? We kept seeing news about his tatoo, his commitment but you dont see it in the movie. Only once when he is dying, covered full of bloood.Man, also he as supposed to be scary but with those ears he had in the movie and the size of his body he is like the wizard from pixars onward.Complete waste of time... How come all these people worked on this movie can not see that their creation is nothing but wate of time."}, {"id": 68, "text": "The film starts off alright, but quickly descends into confusion and boredom. There are so many characters and I can't follow who is who. There's little intensity or thrill either."}, {"id": 69, "text": "People gave this movie horrible reviews. Yes, it's no Training Day but still has some good scenes with great actors. I'll take anything during these depressing Covid times!!!"}, {"id": 70, "text": "Shia LaBeouf is a bad ass and so are a lot of the other characters. The trailer gives you a good idea what to expect and it hints at the ultra violence/gore that you get in the movie. I don't know why it's getting so many low ratings. If you liked Sicario and Sabotage then you'll enjoy The Tax Collector."}, {"id": 71, "text": "Great movie! Incredible actors. I see a lot of critics criticizing the movie. I'm from the area and the accuracy of the script is insane. The individuals leaving bad reviews are more than likely privileged people who are unaware of what really goes on in the community of people of color."}, {"id": 72, "text": "I really don't know what the .... people are complaining that this film wasn't good, because the film I just watched titled THE TAX COLLECTOR 2020 was fricking great! I forgot these people prefer to watch that boring drama that puts you to sleep garbage constantly being released! This film was excellent and if anyone disagrees I really don't care! Nice film shia!!"}, {"id": 73, "text": "The Tax Collector has an extremely familiar and unoriginal plot but is still a good crime drama overall. Bobby Soto is mostly great, if a little wooden at times and he has sufficient chemistry with Shia LaBeouf who is reliably great if a little underutilized. David Ayer's direction is good and reasonably stylish, although it can occasionally look cheap in the more action packed sequences. The soundtrack and the music by Michael Yezerski are both good."}, {"id": 74, "text": "Movie is dope. It isn't perfect by any stretch of the imagination, there are some plot holes but overall the acting was great. I was surprised by Shia's and Conejo's performance. It's refreshing to see a real movie coming out amongst all that superhero bulllshhhh that Hollywood's been pumping out for the last couple of years."}, {"id": 75, "text": "Was a little hesitant to watch after reading so many negative reviews but I think maybe people just had a hard time watching Shia in this role... But I thought it was a great story and well worth the watch"}, {"id": 76, "text": "I loved this movie, paid $5 to rent on Prime and was not disappointed. The Actors did well. I was surprised , I saw Shia in it and I thought let's give it a shot. I was drinking a little when I watched it and regardless it was badass. Must watch!"}, {"id": 77, "text": "Loved this movie! I'm glad they used new Hispanic actors."}, {"id": 78, "text": "If you compare this movie to all of the movies that come out daily, it's not bad. Some parts are corny but overall it's more good than it is bad. It's entertaining and the acting is better than most of the gangster/crime movies in the past decade."}, {"id": 79, "text": "I'll be honest, the movie started off a little slow... but once it picks up it really picks up. It got a few screams out of me! In the end I love that the message was of good vs evil, and good always prevails. I love the strong family message behind it and I was heartbroken to see the guy's beautiful wife die. It was a cool role for Shia but I felt like he could have done more. Overall, really enjoyed it."}, {"id": 80, "text": "I watched this as soon as it dropped on Amazon at 2am then another 13 times. solid acting. A handful of legit action/gun shootouts.Shia Labeouf character was my favorite he was like when Actor Al Pacino played Tony Montana in 1983Scarface. also George Lopez was AUTHENTIC, and Conejo was THAT BOY. . Best Gangster Film I've seen in 20 years."}, {"id": 81, "text": "I enjoyed it easy watch plenty of violence worth a watch ignore the negative reviews"}, {"id": 82, "text": "It's just doesn't cut it. It tries so hard to make you believe you're being introduced to a 'gangster' lifestyle. But it tries to do so with wannabe-tough guys played by actors that aren't convincing(and that apparently have never met real tough guys or fail miserably to impersonate them) and a script that produces paperthin characters that never develop any real depth. Any treaths make during the movie feel superficial and have no gravity to them, making them sound more like comedic lines.In short it's a movie produced by people utterly unfamiliar with the subjects the movie is supposed to be about."}, {"id": 83, "text": "To this day I still don't know who they hire to make a good movie have such low ratings. I am sure in this case someone was. I understand 10 it is not but a solid 7 defiantly. Watch this movie you won't be disappointed!"}, {"id": 84, "text": "It's a movie of the world and lifestyle of Mexican mafia/ LA gangs. Really graphic movie but had me on the edge the whole time!!!"}, {"id": 85, "text": "Why bother spending money and time on this movie? I went for it despite the heavy tones of violence, gangsters, tattoos, profanities, not that there were no good movies with these themes in the past. I continue watching past the first 10 minutes because of David Ayer and Shia Labeof. But was I mistaken. Wonder why Labeof was sacrificed early in the movie? And don't be fooled by the trailer. I plead with you not to waste your time, money and Your dear life on this movie. A great disappointment."}, {"id": 86, "text": "Arguably.....one of the worst movies ever. So bad actually.....that I watched the whole movie, just to see how badly it would end. It was worse."}, {"id": 87, "text": "Shia LaBeouf was ways always going to be the major draw for the film, and trailers paint it as such. He even got a giant full chest tattoo for the role. All to get his head stomped in halfway through the film and we never seen even a tiny bit of this bad ass he is built up to be.To put it lightly, I would give it a zero if I could because it is that terrible of a movie."}, {"id": 88, "text": "I liked the Creeper character, but at times Shia trying to sound like a gangster was comedy. I couldn't take him and the other lead serious. Watching two pretty boys collect money from real cholo's looked unrealistic. The movie started to get ridiculous when they go to the club to meet Conejo. Although, it was great to see George Lopez's big ugly head in a cooler, I didn't understand how he got kidnapped right under the tax collector's noses. He was literally sitting at a birthday party surrounded by people in one scene. Then his head in a cooler the next. Anyways, the tax collector's decide to reject Conejo's proposal, which meant going to war. The very next day they go back to the mechanic shop. Why after starting a war would you go back to the one place where you'd be easy to find? leading the movie straight down the toilet. Creeper gets kidnapped and murdered. Creeper did absolutely nothing in this film. They try to make him look like this total badass, then kill him off before we get to see any action. It would of been great to see Creeper and David take revenge in the end. But nope! that doesn't happen. Really disappointing movie and sad story. 5 stars from me. Wouldn't recommend it."}, {"id": 89, "text": "I am not sure I understand the point of this movie. To call it grossly inaccurate would imply that some accuracy was achieved. The plot and dialogue seem to be what a poser would come up with. From the main premise of gangs paying tax to some higher authority to the way it is collected to the people who collect it, not remotely true or portrayed in a way that's believable.The beginning was disappointing.The middle was disappointing.The ending was disappointing.It was beautifully filmed and there did not seem to be a lack of money or expertise for any of the acting, costumes, locations, vehicles, etc.It is just dumb. If you want to know what gang life is like, watch this movie and you still won't know. The funniest part is the portrayal of Shia Lebeouf's character as some bad-a** killer and he get's taken out like an amateur. The dialogue is incredibly off between the two tax collectors, do you meditate?. So dumb.The home life of the main character is so completely unbelievable it ruins everything that comes after. A sensitive, loving, super-religious, family oriented extorter of gangbangers who works 9 to 5 and lives in a mansion. lol"}, {"id": 90, "text": "Shia needs to stick to screaming and crying at Trump supporters instead of acting."}, {"id": 91, "text": "Crap story. Crap dialogue. Crap music. So predictable. Shia is in the movie for about 5 minutes - he's completely wasted. This is a movie that feels like a high school kid's idea of a cool movie. Makes Boondock Saints look like Citizen Kane. Zero redeeming qualities. Just awful from top to bottom. The lead character has the charisma and intimidation of a lukewarm bowl of soup."}, {"id": 92, "text": "This is awful. Set in the city with no law but there is so low action happening. So many nonsense talking leads to nowhere. And when the action comes, it was so plain."}, {"id": 93, "text": "I rarely write review, but I made an exception for this movie. Shia deserved better and even his presence wasn't able to save this movie. The movie had terrible acting from the beginning to the end. The movie was cheesy and messy. This movie had no explanations for the events that took place and just felt like lazy writing. The movie had so many plot holes that it made it hard to follow. Not worth the 1:35 minutes just rewatch training day honestly you'll appreciate sicaro, training day or every movie ever made after watching this."}, {"id": 94, "text": "Wow. How disappointing. It's a great big ball of gangster-related cliches tumbling down a hill of stupidity and disappointment. Like everyone else, the trailer got me so hyped up, and everything was going fairly well until the action finally started. Reaper (Shia) was made out to be some badass, but got reaped before we could even see him live up to his rep. Like, wtf? I hope this film director never makes another movie again. I hope the writers wrote their last script. Shame of them for tarnishing a solid actor like Shia LaBeouf. He was on such a good streak."}, {"id": 95, "text": "Who pays to produce this garbage and WHY? I don't understand how films like this get released"}, {"id": 96, "text": "Awful acting in a complete copy of any other garbage drugs/crime/Mexican drugs movie ever produced. Not even 1 original moment in the whole slow paced, badly directed movie. Total waste if time, money and use if your retinas and eardrums. What is the point of creating such a flop? Seriously,"}, {"id": 97, "text": "First off, Shia should have been the main character. This movie lacked substance, synergy and character development and was noticeably rushed for whatever reason. Casting was not that great. Antoine Fuqua or Chad Stahelski should have directed this. Expected more from David Ayer. I wouldn't recommend this."}, {"id": 98, "text": "Is a point of view how the streets are in L.A ....some ppl wouldn't understand"}, {"id": 99, "text": "Not bad pretty good... watch it and this place sucks for reviews"}, {"id": 100, "text": "I was really looking forward to watching this film, but the cinematography, writing, and characters stories were a let down. The movie had no soul and feom the very beginning fails to grab your full attention, it was very disappointing!👎🏽👎🏽"}, {"id": 101, "text": "This movie is bad in everything apart from Soto and LaBeouf's short performance The story is a rehashed generic drug story and dumbed down. The dialogues (when you can hear em clearly) have no point at all. You can watch the movie muted and not lose a thing. It has many boring no-point scenes The music is off The picture is bad like it was shot with a mobile phone, the filters used are very bad.All in all I am done with Ayer, all of his movies are barely watchable. I will avoid em at all cost."}, {"id": 102, "text": "One of the better gang movies I've seen. It is very dark and gory so not for the faint of heart."}, {"id": 103, "text": "With a record of movies in this genre, like Training Day, Harsh Times, and End Of Watch; i expected much more from this movie. Ayer wasted Shia Labeouf's talent on this movie."}, {"id": 104, "text": "I expected better than that David Ayer. Harsh times was a homerun. Training day script was perfect. End of watch amazing. Fury was a great brotherhood war movie. But the Tax Collector? I need my taxes back. Shia was the only spark this movie had and it was turned off way too early. We needed more action from creeper like we saw Christian bale go psycho in harsh times but sadly that wasn't the case. Having said that, this film deserves first place and a gold medal in a high school student film competition because it was just that. Horrible acting, bad character development, unnecessary flashbacks, bad angles, cringe worthy action sequences, and most of all way too rushed. Once creepers dead it's as if the cast and crew said alright let's wrap this up before it gets too embarrassing. I'm still a huge fan of Ayer and I'm excited for new upcoming projects but this ones a flop."}, {"id": 105, "text": "Seriously, what a jumbled, pointless mess. Shia was the reason everyone wanted to watch this movie and his part is so under utilized. He wasn't the main character like all the trailers made him out to be, and he's by far the best actor in this movie. He is touted as the devil and you're expecting some John Wick type stuff from him and they don't even show him getting any action. Just standing and following David around like a lap dog, and occasionally threatening people. What an epic disappointment."}, {"id": 106, "text": "The plot holes the bad acting the cheesy lines its all too much to bear. Stay away from this movie or you will regret it trust me."}, {"id": 107, "text": "Shia is one of my favourite actors, which is the only reason I watched this movie, I got bored very early and struggled to keep watching it all. I can't believe he got a real tattoo for this movie! He made such a wrong choice taking part in this project."}, {"id": 108, "text": "No need for all the hate, wasn't a blockbuster but still a good watch! Should have seen a bit more of Shia. Liked the ending."}, {"id": 109, "text": "Shia did a great job. Conejo was a ruthless villain and I thoroughly enjoyed that as well. Obviously, there are some things that could've been tweaked. Movie went south pretty quick, I wish David Ayer would've kept Creeper till the end. I enjoy LA crime/gangster movies and I like The Tax Collector. It's going in my movie collection."}, {"id": 110, "text": "It's a pretty intense movie. Took turns I didn't expect. Great watch."}, {"id": 111, "text": "I was entertained through out the whole movie. Great action and good plot. Shi Lebouf was great and the ending surprised me. Worth watching and if you know this director he's very good"}, {"id": 112, "text": "It is better than people say. Shia is good. UFC star Brian Ortega was excellent for his debut movie. Wish they didn't use Alexis as the main actress name, reminds me too much of Amazon thing.some tense moments. worth watching."}, {"id": 113, "text": "All these people bashing it are just being over critical. Good movie of bad people doing what they gotta do to survive. I like Shias movies. This was a good one too. I gave it a ten cuz it needs a higher score than it has now. Good flick. I was cringing at some stuff and had me hooked in. I knew what was gonna happen but i kinda like seeing it played out."}, {"id": 114, "text": "Maybe if David Ayer didnt write the movie and just directed it it wouldof been great, I'm so dissapointed. I felt the soul of the movie die hald way through. What was left was a shell of on again off again try to get back to a good movie. I'm so dissapointed!"}, {"id": 115, "text": "This movie is david ayers finest work since end of watch this movie so epic,the direction cinematography screenplay everything was fantastic and the actors did an amazing job especially Shia and Bobby they were outstanding their performance was epic this movie is a must watch"}, {"id": 116, "text": "It actually felt quite authentic for the most part. I had to skip some bits that were too savage and bloody, but even that felt reasonable compared to what little I know of the mob or gangs. I thoroughly enjoyed the Mexican perspective and customs (his niece's quinceanera preparation) I'd like to see more of that in movies. We Americans will get too stale with just our own culture fed back to us in movies, it's refreshing to see how other families celebrate and the things that matter to them. The mom's comment about seeing the Mexican Kardashians at the dress store was HILARIOUS.Certainly this is a woman's opinion and this is more of a guy's genre movie, but some guys might have girlfriends or wives and they might enjoy watching it with them.Shia's best role in a long time!"}, {"id": 117, "text": "I liked the movie. It wasn't great but it was decent."}, {"id": 118, "text": "First of all Shia LaBeuf is in the entire movie ! Not sure why people are saying he's not. And second this movie is so good . The story is epic the actors are amazing. Watch the movie before you write a review . It's far more than just a gangster movie ."}, {"id": 119, "text": "Contrary to the negative ratings here this movie was actually better than they painted it out to be ..it was definitely not the worst movie I have seen this year better than that Charlize Theron movie ( can't remember the name lol) and makes you notice Shia laboeuf because I never paid attention to him before this"}, {"id": 120, "text": "Action packed, gritty and violent. If you didn't like that kind of movie stick to your marvel comic superhero movies and move on but don't give it a low score just because you dont like these kinds of films. You're just showing your ignorance."}, {"id": 121, "text": "I'm surprised at the low ratings, but I thought it was a worthwhile movie from start to finish. As someone raised in South Central LA and Inglewood, it captured the raw essence of the streets. Trust me, I've seen a lot of movies that failed miserably at it. This one doesn't. It's a B movie, yes, but has good production value. Not low budget by any means! Shia played his role well as did his co star. It was good to see George Lopez in a serious role and Bone Sloan repped like he always does.If you like movies like Street Kings, End of Watch, Illegal Tender, Waist Deep you'll enjoy this ride as well. I was entertained from start to finish!"}, {"id": 122, "text": "I have a feeling that this film has a low rating only because people are watching this half assed on their mobile devices or at the drive in theatres. So most of these reviews are coming from people who either watched half the movie, or watched the movie in 1/3 the quality of the original master, or watched the movie without its intended theatrical surround sound. I made sure to watch the theatrical version of this film at my home theatre. What can I say? Creators of End of Watch and Training Day. Enough said. If you loved those movies, and if you are a fan of Ayer, watch this one. I enjoyed it very much."}, {"id": 123, "text": "Charla buff does outshine the whole cast but on the other hand it's a solid movie by hands-down the best underground style director of our generation no one can shoot LA like this man. I wish the movie was about a half hour longer and went more in depth on Shiers character because he was just so good but with the lamb movies that have been coming out over the past five years I would take this over most of them any day"}, {"id": 124, "text": "I was very interested in this movie due to Shia Laboufs involvement. The overall premise does not make sense that such a well connected and protected member of a drug gang could have this happen. It also makes no sense that one of the most dangerous characters in the movie could be killed off so easily. Overall plot is poor and disappointing."}, {"id": 125, "text": "Really? Seriously? This is being called a film? It's more of a POP channel movie of the week. The story is thin, the acting is weak and the....you know what. I'm wasting my breath. Shia LaBeoif is a shell of the artist/actor he was YEARS ago. The only reason I watched this farce, the rumors that Shia ACTUALLY tattooed his whole chest, for real, for this so called film. I still think the rumors are false. AVOID AT ALL COST."}, {"id": 126, "text": "This movie had potential. Everytime it started to get slightly interesting that was the best it got. If you must watch this wait until it's free!"}, {"id": 127, "text": "Amazing film and and shia lebeouf what an awesome actor and everyone else. movie was great in entertaining i give it a 10/10 rateing 100%"}, {"id": 128, "text": "I liked the movie, I hope they make a second movie and hopefully longer. I would have liked if creeper didn't die but overall it was a good movie. If anyone gives this movie a low number y'all hating as hoes. Conejo needs to start acting more he has potential."}, {"id": 129, "text": "I'm not going to praise this film , or beat it up, watered down, incoherent and lack of character development, is the final result of this made for streaming crime drama, plot was simple but along the way, the message wasn't received, watch SNOWFALL, all three seasons if you want a good crime drama."}, {"id": 130, "text": "This movie was a lot better than what it was rated, if it didn't have Shia in it, it would easily have 6+. I liked all of David Ayers movies so it seems strange that he or anyone else for that matter would put him in their movies even if he's not the main character!"}, {"id": 131, "text": "There's not enough space to list all of stupid cliches and worn out stereotypes beaten to death in this cheap knock-off including Shia's absurd portrayal of the toughest guy in L.A. I want my mind erased of this trash, I forgot how bad movies can be!"}, {"id": 132, "text": "Was going to give it a miss after seeing the bad reviews but it is a perfectly watchable movie. Starts OK, Shia LaBeouf is by far the best actor on show but the main character by Bobby Soto is over acted &amp; not an overly convincing tough gangster. Script is a bit weak and 2nd half of the movie seems overly rushed &amp; gets a bit cheesey. It's an OK movie all in all if nothing groundbreaking"}, {"id": 133, "text": "Forget everyone else this was a great movie. Yeah yeah you can say you've seen plenty of movies with same story but I watched this beginning to end by myself and was top 3 best movies of the year. Most of the people leaving low ratings are just Shia le Beouf fans and was mad he wasnt main character dont watch a movie for one person."}, {"id": 134, "text": "I really didn't want to believe the bad reviews for this movie but man this time they were right. I couldn't understand anything from this movie. I mean I have friends that are Mexican and none of them speak this way and I don't mean to offend any culture out there but seriously is that how gangsters and Mexican mafia talk? It's hard to make out what they're saying. Also the trailer is B.S, fooled us into thinking that Shia is the lead and main bad guy or main boss but when I found out it was David the soft spoken Mexican I gave up, not convinced. Like some reviewer said it took 56min for the first bullet to fly, with all the macho and boss act. Shia had his hands on the gun Everytime he met someone or collected money but yet you don't see him shooting or beating up anyone. Also you don't see any actual killing in this movie. It's all Ayers fast cuts of the movie to make the Audience interpret that someone did get killed. It's stupid and yes I did watch for Shia cause he is really good at almost every role. This proves he can play a bad guy If the right script come along."}, {"id": 135, "text": "Anytime a movie has extreme reviews it's worth watching and this didn't disappoint. i thought it was great!!"}, {"id": 136, "text": "It was good at first than they rushed through the second half. had the makings and characters to be good but totally rushed the 2nd half.It's Too convoluted both regarding to action set pieces and the plot. Shia and the unexpected dramatic turn from George Lopez were two best things about it. Too bad those were just supporting roles."}, {"id": 137, "text": "I have been a fan of David Ayer I have loved his films many of them he is a great director I Loved his creative work, he is soo great at crime films, action, war films he is a guy who deserve direct a lot of films deserve it an Oscar one day down the road if he makes a powerful film with story in it like with End of Watch and Training Day, Street Kings those type of movies everytime I have loved his movies with gangster hoody LA type of films but he has been known for writer in U-571,Training Day, The Fast and the Furious, Dark Blue, S.W.A.T, Taking Lives then he start directing films Harsh Times a film no one talks about but it's worth watching you gotta see Harsh Times, Street Kings a masterpiece film, then he done a huge strong powerful film End of Watch loved it, Sabotage, Fury, Suicide Squad, Bright a Netflix film that is Hood Film genremixed with Lord of Rings Fanasty type. he is known for Action, Thriller, Crime Hood Genre type of film with Mexican Cartel or Blood &amp; Crips type of style I have always loved his work in films like that I really do love all of his films but with this film I would not put it as my films I like or loved in my list in 2020 or Ayer top films because this was average film there are things I like about film and there is some things I didn't like about film because towards middle it sabotage's everything of something you won't expect. I wanted this to be a other version of Harsh Times with 2 friends that are Tax Collectors that's what I wanted but I can't believe how in earth David Ayer messed this up badly no wonder this film gets a 4.7 sadly I thought this film would take things simple, and it's film will be how it was like with David Ayer work in his previous films I thought it would be like Training Day or Harsh Times type of genre but in expect those 2 are Hustlers, Hustling people for money to earn it back. he just needs better writing because their are no other writers David Directed and Written this film he needs bit of support to have better writers hire Kurt Wimmer or Max Landis who worked with David Ayer they are writers from Street Kings &amp; Bright because I will be curious to know what other writers would think and how they turn this film differently then to David Ayer idea if you getting my point. . Ayer can't just keep this film very simple why does it have to be that hard to know how to keep characters alive the ones they don't deserve to die and could made better choices and choose wisely to keep characters alive and write film and fix up story follows 2 Tax Collectors witch meaning the collect Tax from other Gangs, people anybody that has money that people needs to payback to those 2 Collectors they Hustling everyday to people to earn money that people need to payback from. David (Bobby Soto) and Creeper (Shia LaBeouf) he plays a different type of character he is like gangster scary type of guy that you don't wanna mess with this is something I wish he could of played character like this in another film but in this. David has a family 2 kids and wife Alexis (Cinthya Carmona) he has Uncle who runs a car wash Uncle Louis (George Lopez) David is a very successful man who is rich guy has family and has a close friend creeper they work their asses off to collect money to start to middle first and second act of film was perfect the cinematography, location feeling type of film where it's filmed at a hoody type of gangster film like with Ayer films is Fantastic, and acting performance is perfect Shia acting was soo great he plays a different type of character with gangster look on him suit, tattoos, he is one hell of creepy guy tape of look that just you don't wanna mess with not because he is called creeper but in another way he is like devil type of character he plays way how he played it was 10 out 10 in Transformers type of role or Holes or any of other movies he play's either prick or nerd that's always like that I like Shia LaBeouf as actor as well I enjoyed some of his films, but him in this film was something a lot more different gangster type of role to it I loved his character. film was great to start to middle 1 and 2 act seeing those 2 guys acting performance out standing that's was worth of acting. then to villains Conejo (Jose Conejo Martin) plays a evil gangster type who uses Black Magic spell he uses. he wants his money to earn back from those Tax Collectors upends the business from those Tax Collectors Gata (Cheyenne Rae Hernandez) plays a villain chick witch I liked her role she was an interesting type of character I wanted to see more in film and get to know her more often but it's more on main villain Conejo. when s*it hits fan Uncle was trying to take down Conejo with his men then later you find out his dead with his head in box so then I am like why David could get his family his wife and kids tell them get out of town deal with other gangs or cult whatever they were but no I don't mind car wash action scene it was pretty good action scene worth watching for action keeps your head up then in 3rd act this is where David Ayer F up everything I Don't even know how in earth he is happy with 3rd act of film??eventually suddenly film destroys everything Creeper gets killed off for no reason I don't see why, I don't see why should Alexis should get killed off as well I mean like they could written this film a lot better too me it's either Ayer rushed this film soo much what was he thinking? did he think it was great idea? I don't freaking know how in earth he agree to this direction of film how in earth did he destroy 3rd act of film? Shia and Cinthya Carmona should been kept their characters alive but sadly no because writers wanna screw up and destroy film because they are dry and out of ideas film leaves you dry to 3rd act then David wants revenge because his wife, his uncle, his close friend dies that was Shia LaBeouf I just don't know why should Shia Labeouf character and Cinthya Carmona character alive I don't see them getting killed off in film for no reason wasted Shia Labeouf character I thought he stole movie not Bobby Soto he did fine in film but I thought Shia should have been lead keep his character alive and Cinthya character alive but no writers wanna take it very difficult idea where they are out of ideas. so after David wanted his revenge he hires Bone (Cle Sloan) who is in Blood gang he explains everything what happened he agree to work with David to take down Conejo final action showdown nothing too special then ending wasn't bad ending it was just flat when you see it your gonna say what the heck what else happened?? this could been written better this film is written &amp; Directed by David Ayer he could hired writers he kinda rushed the story and script of film he f up everything in 3rd act of film he could written it better or if he doesn't know what else he can write or if he goes dry hire great, good writers of film they could write this better David Ayer always keeps his films very simple but in some reason he could not keep this film simple I don't know why but in my guessing he was out of ideas that's why he decided to destroy 3rd act of film he could done a lot many things better of this film could been written better 5.10 things I liked about characters, performance, action, cinematography of film, location feel to it but rest of it where it screwed up with a fault ending of film killed it. this is a film I could watch it as time waster not something I would watch it like 50 times in row this film had half of good things then to middle too many missing screws witch it doesn't look too great."}, {"id": 138, "text": "I enjoyed the movie for what it was. I'm not ranking 9/10 for screenplay, writing, acting, and Oscar worthy but for how much I enjoyed it for what it was for. Now maybe I should give it an 8 possibly. But Shia was definitely the actor I enjoyed the most, wish he was in movie longer for sure."}, {"id": 139, "text": "As far as being a proper story, it lacks in a few departments but things rarely are perfect. Seems forced at times, rushed, dialogue becomes less complimentary to the image it's trying to project at times.However, I loved just about all the acting performances, and the reality... perhaps it was because I was expecting something a bit different with a more cliche atmosphere but the seriousness hit me really hard. I'm sure the events in this movie have happened and do happen. I didn't feel like it was theatrically presented to me like a fictional tale I could later write a review, on no big whoop. I felt like I was there at the crime scene looking at the aftermath of something real and not in a tacky gore-fest way either. This submerged me deeper into the main character's conflict from then on and by the end I found myself asking what I would do over and over. That, for me, made up for all the it was lacking. It won't be for all, but it will be a powerful watch for certain ones out there."}, {"id": 140, "text": "This is tax collector, you'll see blood and of course you'll see people who don't want to pay tax."}, {"id": 141, "text": "It was definitely a lot better than the reviews. I thought it was very entertaining but still could've been better. I felt like they could've spent more time on character development especially Shia Labeouf Character and Most of the other main charters in this movie and this could've went from a good movie to a great movie. In the movie Shia Labeouf was really betrayed as this bad a$$ the first half of the film but it never showed how bad a guy he really was and the main character and villain fell flat by weak character development. Maybe it was cut short due to filming restrictions because of covid, not sure, but they really missed an opportunity for what could've been an epic film, but overall a decent movie and the last half of the movie is action packed. I give about 7.5 and definitely worth a watch"}, {"id": 142, "text": "I'm not sure what people expected here. It was not a bad movie. It wasn't anything special but I don't think it was intended to be. Audiences don't even know what they want anymore. Everything gets cancelled if it's not PC or whatever. Shia did a good job and the movie was decent. You gotta give it to David Ayer he knows the LA underworld. People expected this to be The Godfather or something. Take it for what it is."}, {"id": 143, "text": "I rented this movie for 6.99 and would like a refund. My favorite scene was when the masked cartel walk out of the van and start blasting David and Creeper."}, {"id": 144, "text": "John and Alexis did not like. Needs more explosions and less Shia death."}, {"id": 145, "text": "The trailer had me thinking Shia was the main character and I was stoked about it; but man the disappointment!! Bad casting of the main character Bobby Soto--looked like the role was too big for him to fulfill (didn't believe his acting, not sure if he believed in himself either)--this is probably what affected the film's rating the most. There were a lot of cringy moments and cringy dialogues, felt like the majority of the actors tried too hard to sound bad. The BEST PART of this film was Shia and the little acting that he did and that's about it."}, {"id": 146, "text": "If you have 90 mins to watch a movie, then go see it. Plenty of action, good acting overall w/ an avg story line. The movie should have been another 30 min longer. This is a gangster type of movie that is fast paced and predictable. Its worth a watch ONE time."}, {"id": 147, "text": "I watched it because Shia was in it but man was the movie horrible, I enjoy these types of movies typically but I don't know what this was, so disappointed and waste of all talent involved especially Shia Labeouf"}, {"id": 148, "text": "And worthless this movie is. and shia? always liked him and thought he's a lot smartrer but full chest tatoo 4 shyt movie like this one isnt rather wise. and wtf they do to his ears?"}, {"id": 149, "text": "I thought this movie was great. It's exactly what you expect from David Ayers and Shia LaBeouf working together. I think we all expect Shia to take the center stage, but when the movie takes a different turn it catches you off guard. I for one have gotten to a point where all movies are predictable and this one I did not expect to end this way. It's also good to see a minority take the center stage and play the hero of the movie working along side other minorities. David Ayers and Shia LaBeouf have always allowed their movies to speak to their politics and I respect it because it makes me feel as though the characters are reflective the actors real life character traits and beliefs. A movie like this is meant to be appreciated by people who respect the art of the actors and directors and not the mass media."}, {"id": 150, "text": "So I actually enjoyed the movie. My only thing was I didn't feel like Shia fit his role. I feel they could have chosen someone else for his part but he did do a pretty ok job. Other than that, movie was good. Deserves a better rating than what it has."}, {"id": 151, "text": "How are people giving this movie a ten. Wow. It was really bad writing and directing."}, {"id": 152, "text": "I disagree with 90% of the total reviews all together. Yes the film is low budget and could have been better, but it's definitely spot on correct. Unfortunately this movie will only resonate with people that have somewhat been around that type of environment. So suburbia people that have never been around danger in any way will dislike the movie all together."}, {"id": 153, "text": "Very intense and suspenseful drama. Unfortunately, the presence of Jimmy Smits rather than an 'unknown' or more believable actor in the role played by Smits ruined the movie for me."}, {"id": 154, "text": "It is a good movie. Very irritating since it does not follow the classic scheme with an expensive actor win it all. But if you like to see a bunch of dead people killed in revenge, John Wick style... This is the movie for you you."}, {"id": 155, "text": "Entertaining movie, boot Davis Ayers bear. Shia's role is a lot more minor than the trailer makes it seem"}, {"id": 156, "text": "Routine gangster thriller without big surprises with good actors and a lot of toughness, but with its predictable story and cut action scenes builds up some plus points."}, {"id": 157, "text": "WHO keeps casting Shea LeBeef as a tough guy? That is the most unbelievable thing in the world."}, {"id": 158, "text": "Not sure why so much hate... not bad... especially when running out of things to watch"}, {"id": 159, "text": "This film had so much potential for a new twist on the gang and drug genre. The acting was awful (other than Shia) the story line was all over the place the script sounded like it was written on the spot. The music was bad and the ending was pointless. What next 2020??"}, {"id": 160, "text": "I'm a big fan of Shia LaBeouf so I was excited for this because of the trailer but the trailer was very misleading. I guess the reason for this was because if they made a trailer that represented the film accurately then there would have been considerably less interest. There just wasn't any substance here. Instead, it was filled with typical David Ayer imagery and cliche. Even the scenes where gun fighting was going on at were just trite. The main character bust into a room with his automatic weapon pointed at the 2 people in Bed and miraculously misses both of them...obviously because there needed to be more of a build up to add some drama for the conclusion but drama can't be built up if there's no compelling story. There were two things about it I liked though. Although Shia's character never really got fleshed out, I felt he was great w what he had to work with. And there was a lot of great atmosphere present throughout the movie. But when your characters are cliche and your plot is flat great Ambience simply not enough to carry a film."}, {"id": 161, "text": "If you liked movies like Training Day, Harsh Times, End Of Watch, Blood in Blood Out you will like this movie. A little slow at times, but I enjoyed it. I wish that we got to see more of Shia's Creeper character. And to say he played brown face gtfo, if you grew up in those neighborhoods around those people you would talk like that too.. good movie, too many haters."}, {"id": 162, "text": "I have recently watched both Ayer's movies Training Day and End of Watch , so the bar was really high. yet this movie is not at all what i expected. the pacing was extremely off, there is a lot of pointless talking that didn't do much to develop the characters and the ending felt rushed even though its 90min movie. all in all play this movie in the background while you're focusing on something else."}, {"id": 163, "text": "If you like End of Watch, Sicario &amp; Borderland etc you'll enjoy this movie about treacherous &amp; villainous Mexican drug gangs &amp; ganglords. The 2 leads were very good. The film starts off tense due to the fact that anyone these 2 collectors encounter could pop off at anytime. Also, the special appearance by the black gang leader from End of Watch was a neat surprise. I have 2 problems with this film: 1) The quickness in which George Lopezs character is killed - in a scene where he tells his son he's headed out to deal with the rival gang leader, a female comes in literally 2 seconds later telling his son hes been captured and to meet with the rival gang leader who has his severed head already in a cooler. 2) the wimpy way Shia 's bad boy character &amp; his crew went out - they didn't even put up a fight! He seemed to me like someone who would never be taken alive yet the screenwriters did the opposite - without a fight. smh"}, {"id": 164, "text": "Not sure why so much controversy around Shia, the true issue is this is just a BAD movie, terrible script, badly cast, Shia may have been the only descent part of this movie and not sure how they got him on board, straight garbage."}, {"id": 165, "text": "If anybody is familiar with this level of dope distribution, then they would understand these are occurrences that happen many times over and over in our country and others. What you see in this movie is what happens, so take it with a grain of salt and believe it!!! A different role for Shia LaBeouf. If you enjoy drug dealers, violence, passion, Women, and lots of money. This is a movie for you enjoy!"}, {"id": 166, "text": "It was watchable but a waste of time. Too many plot holes to list. It felt LAZY &amp; FORCED at the same time. Although it says David Ayers wrote this I'm assuming they mean they stole bits and pieces from his other movies that were actually good and tried to make this work. Lots of wasted Potential. Really wish they had utilized the great cast a lot better...... FFS 2 min left in the movie and Jimmy Smits comes on screen. Where was he the whole movie."}, {"id": 167, "text": "Agree with other reviews, Shia is on another level of acting here. Tremendous job by Shia. Far and away, he was the only amusing thing about this movie. The story is nonsensical and confusing, every single character is under developed, the script is painfully annoying for nearly the entire movie, the fight scenes are boring... there really isn't a very good reason to watch this movie. On the whole, the movie doesn't make sense. And I don't mean it doesn't make sense in like an artsy sort of way. Like, legitimately, it just flat out doesn't make any sense. The ending was a joke... like the fact that you made it to the end of this movie is someone's punch line to an awful and elaborate joke."}, {"id": 168, "text": "This film start with a man David wake up with his wife Alexis on the bed, and their daughter come into their room scene! As turnout, this film is about a tax collector David need to revenge for the death of his wife and his working partner Creeper, by killing the mastermind Conejo! Entire film full of boring conversation, and annoying overuse scene! Such as, overuse of the driving scene, overuse of the smoking scene, overuse of the drinking scene, overuse of the walking scene, and overuse of the staring scene! Make the film unwatchable! All the action scene in the film have blood at certain point but overall quite messy, portray by sideways, with slow motion and shaky! Make the film quite frustrated to watch! Barely intense scene is David fighting with Conejo in the bathroom! At the end, David talking to his father after killing Conejo! That's it! Another disappointed film!"}, {"id": 169, "text": "I had high hopes for The Tax Collector. I mean, look at that cool poster! I thought it was going to be something fast-paced, exciting, and full of action. I thought it was going to be something like Sicario, but I was wrong. David Ayer wrote and directed this crime drama about L.A. street gangs. Not unfamiliar territory for him; he did End of Watch, Training Day, Street Kings and the very first installment of the now blockbuster franchise, The fast and The Furious. So, theoretically, he should have been able to write and direct a really strong, really successful film in this genre. Unfortunately, that's not the case. The Tax Collector started out strong but at about 35 minutes in, it fell apart and I found myself extremely bored. The saving grace of this film is Creeper, played by Shia LaBeouf. He was dark, mysterious, ultra-violent and extremely interesting, but he was only a second fiddle to Bobby Soto's main character, David Cuevas, an enforcer turned rising crime boss in the LA gang scene. Had the film been mainly about Creeper, it would have been so much better."}, {"id": 170, "text": "Spoiler!!!!!!!!!!!! This could have been an awesome movie but the direction it went screwed it's up. The trailer made Shia Labeouf's character out to be a badass but came up short extremely short in the film.They killed him off way too soon. He didn't even do anything. He gives a great speech to his boss then gets killed two minutes later. Should of have them both survive then go on to attack the rival. I kept saying when I was watching why would they kill him off so soon Very disappointed. They messed up again very disappointed"}, {"id": 171, "text": "This movie is worth the watch only for that absolutely stunning performance from Shia LaBeouf. I used to hate this guy. But in this movie he is absolutely brilliant. I couldn't even recognise for an hour straight! (I'm not cutting him any slack, though... let's see what he does next!) Everything else is complete BS. The usual gang-land fantasy LA, with shoot-outs and mexican butcher-style vendettas, beheadings... the works. All stars go to Shia LaBeouf. If the rating would be just for his performance, I would give it a 10."}, {"id": 172, "text": "Loved this movie...action packed, and insane! Loved Shia's character Creeper, and Bobby Soto did an amazing job as well!"}, {"id": 173, "text": "Overall it wasn't a terrible movie. That being said, I felt mislead by how Shia was portrayed in the trailers. That was the whole allure for me, and it only delivered a tiny fraction of my expectations of his character, and I saw most of that in the trailers.Besides that, if you didn't see the trailer and were not aware of the Shia getting tattooed for this and that backstory, you may enjoy it.But even in the movie itself, I was craving to see the full extent of his character/reputation, and was let down by that.I rarely if ever review movies, but felt compelled to write something about this one.Make a movie about Creeper now!"}, {"id": 174, "text": "This is a decent and entertaining movie. You just have to gage your expectations based on the type of movie it is."}, {"id": 175, "text": "Like many others, I'm not a big Shia LaBeouf, but his acting wasn't horrible and I hated him a little less after watching this movie. The story was loosely based on the title, so no spoiler here, two men are tax collectors in a criminal way.The sound quality was good, the plot was flat but entertaining enough that I didn't fall asleep, and the acting was sub par at worse but still good enough to keep me entertained.Bobby Soto is the protagonist, for some reason he reminds me of a Hispanic TI (the rapper), and his acting is about as good as TI as well... which is not to say its horrible, but not snatching up any awards either.Sit back, ignore the reviews and watch for yourself, I'll be your are entertained."}, {"id": 176, "text": "First moan, I'm soOoooo tired of watching good looking people who can't act. I wish directors would cast people on acting ability and not attractiveness. It's hard to invest in a character when you say to yourself (as I did during this) 'man that was bad acting'. Shia did well, so i can't fault him, but a lot of the super attractive cast weren't great at acting. As a viewer, I don't care if you're hideous looking as long as you can act. Good acting sucks you into the characters and that's what I want, regardless of how you look. Ok, moan over. To the film. I liked the start of this film. It built tension well, was setting up the fight with the bad guy quite well.. and I was ok..let's stay with this..and then suddenly... the last 30% went utter pants. It's like the script woke up, smoked a big fat herbal, scoffed some cornflakes and went..Nah, I'm out of here man. I can't say too much without spoilers, but basically it went 'all family and stuff' and became verrrrrrry cheesy. Hey ho. 4/10"}, {"id": 177, "text": "Shaia Labeof 's character was great, but unfortunately they didn't use it as expected in the movie. If he was involved more with a better story line it would turned to a great movie. But the story line wasn't as expected.I hope they make a movie for the same character which Shaia Labeof was playing, his character has potential to be like John Wick."}, {"id": 178, "text": "Awesome movie! David Ayer once again creating a classic with the phenomenal performance of Shia LaBeouf. Keep them coming!"}, {"id": 179, "text": "The story line was there, it just wasn't executed well enough. Had the film been two hours a few plot holes could have been elaborated on to garner the viewers attention."}, {"id": 180, "text": "I think this was a good movie and great acting except for one person shia LaBeouf. so I'm glad they easily killed him off and smashed his head in. Stick to protesting because that's all your good at"}, {"id": 181, "text": "I really enjoyed this one and it had me riveted from the start...Shia LaBeouf owned his role and was utterly immersed in character....Mesmerizing performance to say the least...The lead actor playing his friend was very good as well...The moral of the story is you can believe your the top dog, that is until you realize there's Always someone bigger and badder than you! In the case of the 2 main characters, that understanding comes with a terrible cost and it comes....too late...this was one of the better gang flicks and ultraviolent as expected... shia's performance and his nemesis are the standouts here and make this film worth seeing...just shia's total immersion in the role is a treat to watch.. cool movie with a different vibe than most.."}, {"id": 182, "text": "I watched this as soon as it dropped on Amazon at 2am. Short and sweet review. A slow burn crime thriller. Solid acting. A handful of legit action/gun shootouts. I'll say it's no Shooter, but it stands on its own feet. Awesome antagonist. I'm not disappointed with my purchase. I'd recommend not listening to these negative reviews. I personally loved it and I'm all about crime/gangster films. I'm not gonna say it will win any awards, but for 2020 it's dope."}, {"id": 183, "text": "Where to even begin... what a disappointing, pathetic piece of crap. Look at the money they spent on this, and it's just crap."}, {"id": 184, "text": "It's not really bad and the bad reviews have been a bit brutal...sure there were some weak points but the acting was on especially shia and conejo....Bobby Soto did his best but I felt this was not enough as my evidence in the 6/10 rating.Overall, simple storyline, some actors did their part well and some don't but the ending was good and applicable.if you have nothing good to watch. check this one out."}, {"id": 185, "text": "Movie fails right away when trying to do that. He doesnt look the part, doesnt compensate for that with acting nor does the script boost him up. Failure all in all"}, {"id": 186, "text": "LaBeouf is the reason this movie has anyone watching it and they wasted the great character development with a stupid plot twist. This movie had the potential to be the next John Wick franchise but they wasted it and it fizzled out. Depressing, sad, not a movie I'd recommend. Should have waited to see it on Netflix or Redbox."}, {"id": 187, "text": "I don't know if this movie was rushed because of COVID but this movie just feels rushed. It starts off interesting but then he goes all over the place and just feels like the movie is being fast forwarded for you. If you are watching this for Shia just stick to the previews because those are all of his scenes. Shia's acting is great as usual. I am just disappointed on how they did his character. They portray his character as this heartless killer but when it came down to being that it doesn't happen. The summary of this movie or more interesting than the actual movie. Not too much action either. I think if they have would made the movie a full two hours then maybe it would have a chance. Bottom line this movie isn't going to be what it portrays itself to be."}, {"id": 188, "text": "I had really high hopes for this movie, the trailer looked pretty good. Started off okay but i just got lost about half way through, i was a bit misguided with Shia's role in the movie thought he would have had a bigger role considering he is in most of the trailer. id stay away if i were you.."}, {"id": 189, "text": "This movie was great. I thought it might be your basic LA cartel movie, but it was a refreshing perspective. Shia's character Creeper was sick. Overall I loved this movie."}, {"id": 190, "text": "I am surprised how bad movie David Ayer is capable to do... Thats all.. Trash movie without any tension or structure for escalation. You know everything from the beginning.. Dont waste your time."}, {"id": 191, "text": "Awful film. Shot with all the production values of a soap opera. Looks cheap, cringeworthy script, poor acting and the sound crew must've had the day off - you can barely understand the muffled dialogue. The lighting crew might've also gone AWOL.I'm sure the director had the intentions of making a gritty, ultra-real film. But he missed the mark by a long way."}, {"id": 192, "text": "Once the opening credits started rolling I was immediately second guessing my decision. It's a dreadful film from start to finish. Incredible to think that the man who directed Fury produced this. Don't do it."}, {"id": 193, "text": "Wtf was Shia thinking attaching himself to such a pile of crap? Forced myself to watch til the end and it didn't get any better. Script - awful Acting - extremely bad Plot - What was the plot?!? Just a totally pointless film."}, {"id": 194, "text": "The movie started off well..Starts at a 7 Then goes a 6 Then shila dies and it becomes a 4 Ends around a 2"}, {"id": 195, "text": "The Tax CollectorGratuitously violent advert for violent criminals, I could see very little redeeming aspects of this movie that portrayed low-life's going about their business of violence, intimidation and coercion.The acting was mumbling method and some of the actors seemed very limited in their craft.A violent turkey 3"}, {"id": 196, "text": "Almost perfect. Actors look realistic, dangerous, cool, serious, confident. Story is realistic, comparable to real life cartel crimes around Mexico and Columbia. Graphic is good too, meaning much done in form of makeup, movements, gore, effects. But two bad things I did not like is too unresponsive behavior of main actors, where they do not take any action neither when being provoked nor soon after, which is not realistic, and too much negativity in form of gore and anger. I expected more positivity, science, mystery, details, and emotions. Some parts are just skipped and obviously too fake or too quick. Good for those who like to watch cool and dangerous people and crimes, and not sensitive to gore."}, {"id": 197, "text": "This movie is not good at all, bad acting, and script, awful editing, the whole thing is cheap. I would argue that it not even worth watching but if you have nothing on and want to laugh at some trash then throw this on"}, {"id": 198, "text": "This movie is a dog. The only interesting part was Shia's and even that was intense but one dimensional. I saw the low rating a while back so skipped it, but got bored + ordered on Amazon. The 4.7 rating is spot on, and I normally skip everything that's not 6.5+.I couldn't care about the main character and his family. The labored alot on him being a family man, but it felt juvenile. Jokeman George Lopez was too light on acting gravitas to pull off his role. Avoid this movie like the plague."}, {"id": 199, "text": "It's not that good! Actors are good but the screenplay is very veey weak! The director did not use the actors well and damaged their reputation..."}, {"id": 200, "text": "How can we separate from fact to fiction Movie had potential til they added LaBeouf and soto as main actors, they were to clean cut from reality. Story line had no legit premise from reality.this aint no training day, thumbs down"}, {"id": 201, "text": "It was so lame, I didn't even bother to finish it. Not entertaining at all. They tried so hard to look some type of gang movie and everything looked so fake. Really bad editing, camera, script, just whole thing was a waste of Shia Lebouf."}, {"id": 202, "text": "Of course a lot of us came to see the movie because of Shia and he did great. But Bobby Soto did his thing. He was smooth and charismatic. He can definitely act, I do feel that the movie transitions were a little slow. But the acting and story line was interesting. End of Watch was definitely better ( and if you watched that film you'll see a familiar face as an ally) honestly I liked it. I would just say watch it for yourself it's definitely worth that."}, {"id": 203, "text": "This movie was borderline garbage. No character development, no good story-line. Massive plot-holes, character inconsistencies. Why did the Lomas gang members look like Mexican cowboys?"}, {"id": 204, "text": "This poor guy struggles to put together anything decent enough to watch. So many cliches in his movies, tired and worn out story lines. Terrible pacing, lots of pointless scenes in the first 60 minutes, maybe 20 minutes of action and annoying to watch.How can Shia be in the previews as a badass, then says he's killed loads of guys, says he has like 4-5 guns on him at all times and gets kidnapped in a gun fight without pulling a 2nd or 3rd weapon? And he never is seen killing anyone. Hmmmm.Just all around bad. Poor plot, nothing like Training Day just a mess."}, {"id": 205, "text": "I've been a fan of David Ayer for a long time and this isn't one of his better films. This feels like it was always meant to be a straight to home release film, the plot is sloppy and the acting is sub par. Shia Labeouf is misplaced in this cast and the rest of the actors fall flat when they share screentime with him. As far as the other poster who commented that he dies early on the film is 1 hr 30 min (not including credits) and his character dies a little over 1 hour into the film, so he is actually in the majority of the film.Overall unless you're a diehard fan of David Ayer or shia labeouf I would recommend skipping this one."}, {"id": 206, "text": "The film is perfect on his way. The film is about choices, family, hustle, hood and loyalty. You can see all of that in the film. Just watch, is worth."}, {"id": 207, "text": "I don't care what critics say. I'm from L.A. (residing in Minnesota), &amp; Shia has my vote on portraying is role perfectly. Being Latina, he made me believe he embodied &amp; embraced the Mexican/American culture. Though the movie may have had some cheesy moments, because of Shia's performance, hands down a 10 in my book. And he's not even latino! Every movie he's done lately is definitely worth watching!"}, {"id": 208, "text": "Giving a 4 just for Shia Labeouf. He's the only person in the whole movie who can act. Everyone else's dialogue sounds like they're reading it straight off the script. Everything seems so forced, movie moves along slow, and the score is lackluster as well. All this pairs with a poor plot and you're better off skipping this one."}, {"id": 209, "text": "This one doesn't deserve many more words, except to sincerely urge anyone who reads this before seeing the movie to do your soul a favor and stay far, far away...why would anyone want to put out this hellish vision where once it hits the streaming services and disc, kids will see it? Shame on you, David Ayer...you should quit movie making and work on putting some good into the world - but you're going to have to work at it really hard brother, to make up for this evil-worshiping piece of garbage!"}, {"id": 210, "text": "I feel like this film had great potential. I respect what David was trying to do by telling a LatinX LA gang story. He could have made Shia the main lead and he didn't, was a little disappointed about that but I liked the two main characters David &amp; Alexis. Two unknowns but talent that you can tell will go far. Refreshing to see new LatinX faces as well. I thought the cinematography was nice and the music in this film is great. I don't understand why people hate this movie so much, there is definitely worse out there. Script had a few holes but I was entertained none the less !"}, {"id": 211, "text": "Weak script, embarrassing performances, basically a mexican soap opera. I don't think Shia should be sorry for his tattoos but her character definitely doesn't deserve them ..."}, {"id": 212, "text": "Shia has come a loooooooong way since the Even Stevens days! The movie is fair.....fair I said. I watched it because of Shia."}, {"id": 213, "text": "I was really looking forward to this movie. I've always liked Shia as an actor and an Ayer movie is pretty good. I've read some of the comments about the movie and my complaints are basically the same as theirs. I don't want to figure out the script ten minutes into the movie but I also don't want to be blindsided in a bad way. Creeper was made out to be this bad a** man and I was so looking forward to seeing him let loose. He doesn't even get the chance! I don't want to give away too much but Shia was the reason I paid for the movie and he was second fiddle to the main character. I do think it's pretty cool that this movie seems to take place in the same world as Training Day with Denzel and Ethan Hawke. Now that's how a movie with two main characters is done!"}, {"id": 214, "text": "The entire movie had an exciting edge of your seat action for maybe ten minutes...that was it. The characters and plot had so much potential, it almost pains me to hate this movie since the acting was good, its just the plot and story never really worked on any level."}, {"id": 215, "text": "Shia is good in the limited capacity that he's in this, but the two other leads acting is just not convincing. Pretty bad. Watched this after Fury-watch that for a rebound from this."}, {"id": 216, "text": "Of all the bad things to happen in 2020...this rubbish just might top them all. All the talent involved should slap themselves in the face on my behalf!"}, {"id": 217, "text": "I spent an hour completely mesmerized by Shia's character until the moment he gets caught. Then I spent the remaining time waiting for him to still be alive and...do what he's supposed to do.What a waste, the director completely missed the value of her/his own movie..."}, {"id": 218, "text": "Aftr the first 5 minutes, you realize it is cheap and nasty"}, {"id": 219, "text": "While I will admit I'm not big into gangster movies, I can still appreciate a good script. This movie did not have it. No character development. Every other word is an f-bomb. That's be fine if the rest of the movie was redeemable, but it's like listening to an 8th grader try and act tough. No likable characters. I want my time and money back. This movie was boring, uninteresting and the writing was terrible. FX were cheap looking as well."}, {"id": 220, "text": "The movie had potential and the development of Shia's character was slowly developing, but then - nothing. Such a weak plot, lazy writing, even the directing could be better. Such a waste of money and talent. I gave it 2 only because of Shia's acting which was really good, but other that that - a total ZERO!This could have been a mafia version of Sicario. Such a dissapointment!"}, {"id": 221, "text": "Its a nice movie. Nothing extraordinary...but nice. Good lead actor and good Shia, as always. I would love to Shia go back on tracks and watch him on blockbusters again"}, {"id": 222, "text": "No matter how you spin it's post production advertising attempts, no matter how you spin what this film attempted to portray, no matter how much you think Shia is awesome, there is not a single redeeming quality to this film. It's embarrassing this film had the team it had, and what they put out. This film has no heart. What starts out as kinda bad turns into horrible. The first noise the film has, is a child screeching and the audio mix in itself is a goof. Both characters are horrible people with nothing redeemable. The writing is abysmal and offers nothing of insight. There is no action. The performances are entirely wooden. The pacing is so shotty that a 90 minute film feels like 2 hours 45 minutes in. When the action begins, you realized that this film just nose dived off a cliff into some of the worst moments of writing, acting and cinematography you'll ever witness. This film is pure garbage and entirely in poor taste. It's not so bad it's good. This is just abysmal."}, {"id": 223, "text": "Script seemed rushed and acting was horrendous, gave it 3 stars just for the bit of action and deaths in it!"}, {"id": 224, "text": "It is simply bad , acting directing Horrible but the storyline was the worst , you wait an hour for the action to actually start and the characters are not believable or developed through out the movie, Shia was just there no roll what so ever. My advice do not watch it."}, {"id": 225, "text": "If I could fill this with curse words I would.. Only reason I watched was for Shia and he did nothing for all the time he was in it Main character wooden, annoying female Co actors... It literally all went wrongI've watched some crap in my day but nothing made me feel as angry as this"}, {"id": 226, "text": "Nobody wanted the story to go the way it went. Ayer could have switched Shias character with sotos character and it would have been better."}, {"id": 227, "text": "Who writes this crap? I mean, the thought process of these writers couldn't come up with anything better than this? It's so painfully stupid, it makes me a little upset. If gangsters were actually this dumb there would be zero crime because they would have gone the way of the dodo bird. It's almost like a 15 year old child wrote dumpster fire for their acting class in high school. ugh, the movie had a lot of potential and could have been a great gangster film but the writing, the lines, and production was piss poor. I feel bad for the boof, he got all these tattoos for a movie he was hardly in it. looool. I'd actually like to see a movie about the boof and how he got to where he was as the lead assassin. That would make for a much better story, just don't let this director or writer near it."}, {"id": 228, "text": "Apparently it seems the copy of Scot Adkins starrer ' Debt Collector' but fails to copy it and been a average movie. The main hero is looking dumb and its slim voice is not perfect for his role. Once time watchable."}, {"id": 229, "text": "If you want some brain candy and an escape, this movie is NOT as terrible as people make it seem and is worth a watch. Will critics hate it? Absolutely. But any regular cinephile who takes movies with a grain of salt will enjoy the movie. It's not for the faint of heart but there are a lot worse movies out there. It's kind of messy, a little all over the place and could have been a way better movie. But it does have a beginning (takes a minute to see where it's headed) and the end is o.k. There are a few cameos from the Latinx community and I wish some characters had a more substantial role. All in all it's not going to win any awards but if you like B type movies with blood, fighting, gangster stuff-then it's up your alley and give it a try."}, {"id": 230, "text": "When Conejo Appeatse First time It's obvious that he kills Everybody and David Back for Revenge Its cliche story. I didn't Relise why Shia Labeouf Tattood his Chest while he Wore Suits"}, {"id": 231, "text": "I mean, Training Day, End of Watch, FURY!!!! WTF Happend to David Ayer?!!!! Suicie Squad dosn't even count, it was all producers flick. But when he can make something he's god at....We get this. Shame."}, {"id": 232, "text": "Great idea, strong casting but by the second half of this 'gangster film', I was just rooting for it to end. The story started out interesting , began to develop but then went totally off the rails. Shia was killer as the cold-blooded, Creeper. George Lopez was channeling his inner Luis Guzmán as the street tough uncle/crime boss of the family. Whole movie implodes with a train-wreck ending."}, {"id": 233, "text": "If you like David Ayer you will love this movie!! If you have not seen any one his work. You probably won't not care for this one! It's perfect! Things happen you didn't think would. You might disagree but go watch it for yourself!"}, {"id": 234, "text": "I think this has to be DA worst movie hands down. It was your typical Latino gang movie with some kind of chance of romance ..? It was just messy. I think it was due to a poorly written script and bad directing. I think Shia's character is all tough but you never find out why! Same with the wife as well as the other female characters in the film, just poorly written. Conejo seemed like a legit gangster so I enjoyed his character. Bobby is not awful, just didn't really scare me. Not a fan."}, {"id": 235, "text": "Right the movie starts off really well with a really interest concept, but all of a sudden the most powerful man in LA isn't anymore in one night it just all feels forced! And the main character isn't really interesting to me Shia Labouf's character was way more interesting and I would have liked to see some more back story to him and some action but they kill him off half way through! The whole plot just pushed forwards with not enough explanation, the main lead ends up getting help from some dude he has one scene with? I mean come on. The movie started really well to"}, {"id": 236, "text": "How to downgrade yourself as an actor? Ask Shia Laboeuf. Such a disappointing movie"}, {"id": 237, "text": "The first half is full of pulp fiction knockoff dialog that leads to nowhere, and then all of the sudden all hell breaks loose for no reason but for pure unexplained gore, boring and stupid, waste of time and money."}, {"id": 238, "text": "The movie is epitome of bad. Bad writing, bad acting, bad casting, bad directing, bad editing, bad storyline, bad visuals, bad everything. I love it. Sometimes a movie has some bad aspects and some good parts and you're confused. Not this one though. This is just bad everything which warms my heart somehow. Makes me able to hate it full heartedly. Only watched it for Shia LaBeouf. Not disappointed. He was the only good thing in the movie."}, {"id": 239, "text": "This movie was the worst movie I've ever seen from The bad acting... no annunciation and the horribly written plot line... to the weakest main character there ever was with 1 hour and 20 minutes of decline for 10 minutes of actual action. Just horrible."}, {"id": 240, "text": "Two stars because I suppose there could be something worse than this disaster of a film, hard as it is to imagine. It feels like they simply gave up very early on in the writing process and just decided to go forward and shoot with what they had: barely anything at all.Over half of the movie is over before anything significant even happens (other than some talking: i.e. Shia LeBeouf's character is on a keto diet for some reason, etc.). The actor playing the lead lacked charisma and seemed to be lost. Two-thirds of the movie has gone by and there is essentially no character development whatsoever before one of the main characters is killed off, no arc, no stakes, nothing. Just pointless violence and then onto what I guess you could call a third act?At the very beginning it seems like things are being set up to go somewhere, but then it just.. sort of, uh.. it just.. I lost my train of thought. What were we talking about? I could go on, but why bother? I probably put more thought into this review than the writers did with the script."}, {"id": 241, "text": "I honstely thought it was going to be good. It was horible really it was bad acting and bad taste in ym mouth. Really bad."}, {"id": 242, "text": "Expected more from the usually solid David Ayer.. even his lesser films have a certain quality to them. This is just horrible.. poorly written, horrible acting expect shia.. The whole thing looks and plays out like a day time tv show. Poor stuff from such a talented director."}, {"id": 243, "text": "This move has some of the absolute worst writing i've seen in movies or tv or high school plays, but it's not the writers fault. someone approved this script, someone said to themselves this is entertaining and believable dialog... that person is at least 50% responsible for this mess. This movie has some of the absolute worst acting i've ever seen in a movie or tv or high school play. but it's not the actors fault, i've seen them in other projects and they were amazing. this director was unable to get believable performances out of them and was incapable of detecting the laughable dialog.from beginning to end, this fan-fiction turned film seems like it was produced by 12 year olds. they manage to toss in every cliche in hollywood, peppered with ridiculous dialog, and a story you see coming a mile away. there is not one redeeming quality i can squeeze out of this whole train wreck."}, {"id": 244, "text": "I couldn't bring myself to finish this movie. Everything about it was cringe worthy so much so that I'm still thinking about how terrible it was a week after attempting to watch it. Bad dialogue, cheesy character development, boring cinematography, B movie script. Don't waste your time."}, {"id": 245, "text": "30 million budget? for whatwaste of time, waste of everythingif the action movies become like this we are doomed :("}, {"id": 246, "text": "This film is about drug dealers who kill people for not paying up. Then a bigger drug dealer turns up.The problem is.Drug dealers are criminals. They kill innocent people.So why should we care about these ones?The acting is so bad from the lead guy 'Soto' it's non existent.Shia is good but wasted.The thing about this film in general is it's poorly made. The editing, camera, and directing are low standard. This feels like a first time director but we know the director has mad massive films before that turned out ok.Just a bit confusing as to how he made this film seam a bit amateur.Anyway yeah it's not very good. And the characters all deserve to die."}, {"id": 247, "text": "David (Bobby Soto) inherited the tax collection business from his father. He takes 30% of all drug sales in LA. Creeper (Shia LaBeouf ) is his muscle. A cold-blooded godless killer whom people think he is a Satanist. As it turns out pops killed a man, but not his son who now wants the business and he has the guns.I liked the Creeper character. There was a little too much religious dialogue. What started out good ended up in a shoot out mess, Where was the combat between Creeper and his female counterpart?Guide: F-word. nudity."}, {"id": 248, "text": "Big bold looking characters with no bite. Shia did not live up to his hype, instead we get it from a few flashbacks. What a waste of time."}, {"id": 249, "text": "Jesus.. are you serious? Lebouf was funny as hell. Him trying to be a bad ass was comical. Thank you so much. The rest of this monstrosity was horrible. Oh and the freaking ears. As if to let the fighting public know, yea he's a tough guy. He wrestles. Lmfao just hilarious. Hey the dude who said this is the Cringe collecter,. You nailed it. BOOM."}, {"id": 250, "text": "Really enjoyed the film until I saw Brendan Schaub on screen. It completely ruined The whole film and my whole night with his so called acting brought the film down from a 7 star movie to a 1 star.It's really a shame that they did make a wish for Brendan to put him on the film and on the latest podcast he talks about how bad the film Is."}, {"id": 251, "text": "I don t understand why they killed Creeper.that was a very stupid thing to do.I wanted to see Shia s character till it ended.I liked the start of the movie,it was pretty ok and then it flipped.What was that?I think the role of Creeper was really good for Shia.He played his part verry well in my oppinion.I thought this movie was about his role.It is a shame that they killed Creeper."}, {"id": 252, "text": "I found watching this film a bit taxing... This is a modern gangster film that has been made and remade many times. Some are rightly forgotten and there are a few that become classics like Heat, Goodfellas, Godfather, etc... But this is more like Training day in that it is shot as though it happens within 2 days. the director does well to capture this illusion &amp; the 2 antagonists David (Bobby Sato) &amp; Creeper (Shia Labeouf) go out to do their runs/ collections.Everything seems to go like clockwork except a couple of minor issues that they can solve without it resulted in gang warfare. However, with this gangster lifestyle the calm before the storm does not last for ever. A tragedy leads for one of the antagonists to go down a darker path from which he cannot return. The way in which it is done it is unfathomably unbelievable &amp; film logic is implemented in that you know he cannot be killed. The suspense is nullified due to this fact. However, the action scenes are a mixture between of fashion killings and matrix style slowed down bullet time like a John Woo's action film. It is a run of a mill film that won't go down as a classic. It isn't offensive. Just don't go in with high expectation as it probably won't live up to that."}, {"id": 253, "text": "This film is not as good as Ayer's other ones. Characters weren't fully developed and pretty predictable while not being remotely plausible. I REALLY tried guys. It's a solid 4 and worth watching once if nothing better is on. I only gave 5 stars due to the rad gratuitous violence and special effects."}, {"id": 254, "text": "If you got 90 minutes to kill and like Harsh Times you'll enjoy this. It's exactly what you would expect from a mediocre David Ayer flick. It's not a End of Watch but it's not terrible. Shia was great, wish he was in it more. When he was he nailed his character. The other lead was meh. Not missing anything if you don't see it, not gaining anything if you do."}, {"id": 255, "text": "A little cliche, could have been more of a deep dive into the gangs, A lot of negative reviews, but the pace the acting and the camera work had a flow to it that kept me watching till the end.Wish I could give it a 6.5, Only reason why I watched it was for George Lopez and Shia."}, {"id": 256, "text": "I have been following this film since they started filming (thanks to the amazing Lana Parrilla), roll on 2 years and here it is. The tax collector is full of grit, action, guns, gangs and most importantly familia! We get to see into a world that is so different from our own (well mine at least) but still at it's roots is about relationships. I personally enjoyed watching this film and found myself wanting to know more about the characters backgrounds and how they got to the position/place they find themselves in. A great Latinx cast full of great actors and actresses."}, {"id": 257, "text": "Shia's character dies an hour into this film. I stopped watching after this. Terrible acting, script, and direction. So many montages. Total rubbish."}, {"id": 258, "text": "The first 15-20 minutes of this film were compelling. Showing the collection of taxes from the small gangs to pay to the larger ones. Interesting back story. Then it takes this odd turn of power struggle for the tax collection business. So many questions arise and are never answered. Like, why couldn't David enlist all the smaller gangs to fight off the threat to his business? If Shila is supposed to be this crazy menacing enforcer, why isn't he Hispanic? His accent is horrible and acting is just as good as his accent. Not many bright spots to this film. You will end the film wanting your 100 minutes of your life back."}, {"id": 259, "text": "If you told me this movie was written and directed by a 13 year old wanna-be vato gansta from the suburbs it wouldn't surprise me. That's the only demographic this pile of cartoonishly bad piece of garbage could appeal to. Terrible acting, terrible dialogue and an outlandishly stupid plot line."}, {"id": 260, "text": "How can such a gifted Writer and Director make such a bad movie? Like other users have mentioned the trailer is misleading, peppered with the 'better' scenes and wrongly spotlighting Shia LaBeouf as the main protagonist.The character development was thin at best. The Protagonist 'David' is essentially a conflicted anti-hero but we're supposed to care just because he has a family, kisses his wife a lot and decides one day enough is enough? If he was really in that line of work he would be a lot more scarier and psychotic rather than reading off some 'cool' lines to scare the other criminals. Screenwriting 101 - Show don't tell.And where was Shia is all of this? Standing next to him, looking tough, always threatening but never really fulfilling his character's potential. And Shia talking about meditating and zen-like philosophy? What?? Are we going to see a yoga scene next? David and Creeper in the studio wearing spandex and juicing together...It seems to me this should've been Shia's movie. Less talk, more Creeper taking the reigns, doing more badass stuff and David doesn't like it. Create conflict between the brotherhood dynamic. Think Christian Bale and Freddy Rodriguez's relationship in Harsh Times (a great movie I might add). Maybe the Gandalf character (or whatever he was called) puts a hit on Creeper and David has to suck it up. Thats the business. Whatever. Something that could've built on David's conflicted conscience, not just loose plot points.Plot-wise it was comparable to a bad finger painting. You could kind of see what it was about but was muddled, sloppy and incomprehensible at the same time. Made me wonder if this was something David Ayer wrote when he was a kid and found at the bottom of a pile of good scripts.The action scenes were entertaining at times however it seemed like these were just filler scenes to mask some terrible acting.Overall, I guess like other reviews I had high hopes for this as I'm a fan of David Ayer but something about this fundamentally was off. Was it rushed through production and editing? Did David Ayer actually get a say in the script development? Was the budgeting decided by an accounts manager with a gambling habit? Did they shut their eyes and just point when casting? I don't know.I guess if you don't care about story structure, character development and just want to see some action whilst doing your own finger paintings then this is for you. All I hope is David Ayer had some sleepless nights after cutting his pay check on this one."}, {"id": 261, "text": "Never made up for the hype of the trailer! Got started but never came through on action! Just fell short all around!"}, {"id": 262, "text": "Good start but it completely loses its way till the end. wanted more of shia lebeouf and his acting. It just went sideways completely"}, {"id": 263, "text": "It would've been better if direction was good. I enjoyed the climax but did not like the end. Thank you."}, {"id": 264, "text": "This film fell short of a possibly great movie . It had so much potential with the acting and story line but did not deliver . It was facts paced but in a bad way. Never really hit its high mark. Very disappointing and irritating. They definitely dropped the ball. Not to say it wasn't worth watching but it could have been a great or at least good watch. I'll tell you like this , it would have been a great pilot for a series if you see it going that way. But it was a movie with a bad short felt script ."}, {"id": 265, "text": "The casting sucks so bad, Shia and bobby can't handle these roles man.....is like a joke seeing kids acting like grown ups...lol....story line is simple, it could be a better movie with better actors.....tho"}, {"id": 266, "text": "It seems like the main actor of this film stepped fresh out of acting school and read some cur cards off camera. He sounds and looks to effeminate to be a tough guy thats believable. Terrible editing and bad acting from everyone with the exception of Shia, George Lopez and Noel. This movie was a huge let down."}, {"id": 267, "text": "Ridiculous matrix style slow mo not appropriate to the movie. Dissapointing cookie cutter plotline that you have seen 100 times. most of the time was spent making the main actor look cool for being a cartel badarse and the bits that actually mattered were rushed. I kinda feel like a grandma saying this but it frankly kinda glorifies the evils of the cartels who actually send people to hell .... a movie about them deserves more respect paid to how bad they really are but instead now kids are gonna think its cool....the only good part of this movie is i hate shia lebouf and enjoy seeing him die"}, {"id": 268, "text": "This is another David Ayer born again marketing venture targeted at the Latino community. Super lame predictable story and horrible production. Best part was Shia Lebeuof and his acting skills are not even tapped into."}, {"id": 269, "text": "The trailer told me everything I had to know about this film. Acting as bland and unbelievable as a cup of tap water and a gaggle of diamond horned unicorns flying across the sky. Any controversy surrounding the film would have been worthwhile if it could have provided even a breath of entertainment to justify the viewing fee."}, {"id": 270, "text": "I was waiting for this movie after seeing The trailer. But man, I gotta say, what a waste of time. It was really bad and boring. Can't still understand what Shia have to do in this movie."}, {"id": 271, "text": "Weak story line, good cinematography, worst selection of cast - couldn't take anyone seriously esp. the main lead. Some of the moments were pushed to look so intense that it ended up way cringy.Only saving grace was the Shia Labeouf, but his character wasn't given anything to do except look menacing enough, disappointing, such a wasted opportunity.1 star for cinematography, 4 stars for Shia, -1 for too much cringe."}, {"id": 272, "text": "Stupid plot,bad script,pretencious and bad acting.Shia Leboef and George Lopez hit rock bottom of their career!!!"}, {"id": 273, "text": "Unimpressive crime drama that misses the mark. The lackluster script does a disservice to all of the actors. Dialogue between characters at times feels flat and nonprofessional. The entire film seems rushed so character development and backstory are almost non-existent."}, {"id": 274, "text": "This is a wet piece of garbage. Shia LaBeouf is great, his character sucks. The whole movie is just bad... I tried to like it."}, {"id": 275, "text": "This movie is a mix, starts with good idea following the tax collector for big boss Wizard that keeps peace between gangs, until new player appears and tries to take over. If you felt any hype from the trailer you will be disappointed. The movie is slow, never shows why every gang fear/respect them and the end its so stupid with a speech like they are good guys because family It waste the best character and the action is horrible and in so little that it's a waste of time."}, {"id": 276, "text": "Shia's role is perfect even he is not in main role, mustache and glasses perfect on Shia's face. Mexican actors are not perfect as Shia, they are missing something about gestures. They can't express their feelings well at all. Opening scene was really perfect with rap songs and cars. All i can give is 4 out of 10. Could be so much better with better camera shots and effects. House ambush scene was great but gun sounds and effects are so bad."}, {"id": 277, "text": "I loved the trailers and was really excited to see a film about the camaraderie between Creeper and David. Instead it turned out to be a movie with underlying religious influence, no real character development and an accelerated plot that didn't really hold my interest. By the time a character died I hadn't really gotten attached and therefore it just felt like another time-consuming scene-I felt like I must have missed something along the way. May have been a better premise for a series rather than a movie, or if the focus (like the trailer teased..) had been more crime thriller and less drama..."}, {"id": 278, "text": "This has left me speechless and in total shock Like the end of watch ,training day or harshtimes David ayer yet again delivers a raw image of the ruthless street gang life loaded with thrill, suspense and fear at its core. Be aware this can get scary and frightening P.S NOT FOR KIDS!"}, {"id": 279, "text": "Having seen previous films by director David Ayer and knowing his style, went into the tax collector as decent high hopes. This film is quite entertaining but also disappointing. It isn't on the level of his earlier films such as Harsh Times or End of watch. Although found it better than Bright (which found to be lacking of excitement)As many reviews have stated, Shia LaBeouf is the highlight but he isn't the central character, and unfortunately his character dies early one (around the final 30 mins or so). The central character of David is the typical Latino type (family man but a crime lord- found his character to be quite irritating with his constant whining and over the top cursing).The violence is quite brutal and excessive but expected. Some strong scenes but at the same times rather predictable. In the end this film is enjoyable but not great- which it should have been better."}, {"id": 280, "text": "Spending the entire first half of the movie to show how heartless and badass David is, only to spend the rest of it throwing montage after montage about spirituality, family and blah blah blah you know the rest. Skip it"}, {"id": 281, "text": "1st half was very good and intense but then somewhere it started bro drop down down and down and ended up with a very mediocre ending.. disappointed"}, {"id": 282, "text": "Alright so I went into this with no expectations so I can't say I was totally disappointed, but this could have been done a lot better. First off, did they really try to make Shia Lebouf the scary mass murderer that the whole hood is afraid of? I'm not saying his acting was bad or anything, but scary is one thing he will never be. That being said, his character should have at least had the chance to actually do something gangsterish before getting taken out. Next, the plot was pretty generic with essentially two big crews going after each other, and it was pretty hard to believe that after the half dozen or so guys at their little sit-down all got killed, there was NO ONE else to come help?? Not exactly a very powerful gang if the whole thing can get taken out in seconds. I did like how the Bloods came to his aid in the end (don't ask me why) but the ending left a lot to be desired in my opinion. After all, Mr. Demonic Gangbanger did say he was just following orders so why did we never get to find out who was pulling his strings? Sure seems like the cartel will still be after him and take him out soon after the movie ends. I've seen worse movies this year for sure, but I truly feel like it wouldn't have taken much effort to make this a far better movie than it was. Watchable? Sure. Forgettable? Absolutely."}, {"id": 283, "text": "Had really high hopes for this one,especially after seeing Shia come off of Honey Boy and Peanut Butter Falcon with excellent performances and watching him team up with David Ayer i thought it would be nice to see him in something different.But this movie was just bad,the plot was basic to say the least and the pacing just felt off.as for Shia's performance, it was solid but he really didnt have much to work with.really didnt care much for the main character and by the time the movie was over i didnt really care much about anything."}, {"id": 284, "text": "I'm giving it 2 stars....and I'm being very generous. Felt rushed...usual typical violence.. GTA 5 has a more compelling storyline than this 2 hour waste of time."}, {"id": 285, "text": "I think it's a basic movie. Like, they couldn't even afford shia lebeouf after 6 scenes and killed him off. Very little action. Worst of all, to kill the monster bad guy took NOTHING. Like, I think accessing him should have required more."}, {"id": 286, "text": "Lots of opportunities wasted. The character developments were unfinished, love stories unfinished, story arches were unfinished, martial art wisdom montage was unfinished, action sequences unfinished, crazy super natural ceremony, unfinished, Tony montana style culture of excess also unfinished and worst of all, the Bromance was unfinished... I just wanted to know why these two were so loyal to each other... you'll go to bed angry after this movie."}, {"id": 287, "text": "Somebody give me back 2 wasted hours of my life back. One of the worst movies I've watched, recommended to blind people only."}, {"id": 288, "text": "Unfortunately this movie falls short in a lot aspects. The direction was good but not the best from Ayer. When you see the trailer you star thinking is a movie similar to harsh times mixed with training day but the scrip is very poor. The cast, a part from Shia, was OK but sometimes forced in some scenes between the couple. Shia was exceptional! His character showed so much promise but dies in the early stages of the movie. The writers should've done a movie about him and his background. Shia delivers as always a great performance and full dedication to his work."}, {"id": 289, "text": "Short and sweet review. This movie was going to go one of two ways. Main guy dies and other one kills everyone or supporting main guy dies and kills everyone. Shame they killed off the wrong person as im certain we were all looking forward to Creeper kicking some ass. Shia deserved better he really did! Same script like you've already seen and same ending like you've already seen."}, {"id": 290, "text": "This movie had lots of potential in terms of story line (a cartel tax collector) but it was definitely not written by anyone with any kind of background or knowledge into gang/cartel lifestyle. I can't decide if it was just bad writing or corny acting."}, {"id": 291, "text": "Started out really good, fast pace, good tone, good performances by the lead actors . The last 30 minutes were cut scenes, a montage, oddly filmed action scenes and it was like a different director stepped in at the last minute. Shia Lebouf was good in it, he's done some good work lately and this was right on par. Wait till it's free and check it out."}, {"id": 292, "text": "Better than I thought it would be. Shia usually annoys me but he is ok in this as not the main focus. His rubber ears were a little distracting though and the voice he put on. Ha haStory has been told before but it's a good watch. Not fantastic but holds up and the feel is gritty and stylish when needs to be. Shia character was made out to be a bad ass but we never see him do anything at all!?Some fun gory moments too."}, {"id": 293, "text": "The Tax Collector is anew film from David Ayer a guy who give us some great films in past like Fury and End of Watch and one of my favourite films of all time Training day,yes he also made that awful Suicide Squad bet lets not talk about it,let talk about this one,Tax Collector had some good staff in it and it was improvement compared to his last film,Shia was by far the best part of a film ,he was awesome on screen and he had that badass energy around him,it is shame that he didnt get more screentime,his partner in crime wasnt so interesting,his realtionships with his family were rushed and i didnt care for them,Tax Collector was a fine film that could still be a lot better"}, {"id": 294, "text": "What i expect from these strange times we live in, the acting was horrible ,reminds me off power"}, {"id": 295, "text": "The actors are not really Mexican or chicanos, they looks so fake, the only good actor is Shia LaBeouf and he is not even Mexican!"}, {"id": 296, "text": "The Mexican actors are not really Mexican, they are so bad... they look fake, the only good actor is Shia Saide and he is not even Mexican! Well if you want to watch it is on you."}, {"id": 297, "text": "This movie had potential but the whole time I kept thinking that it felt very contrived and shallow. Perhaps David let a film intern at the helm and said make a movie like I would then went on vacation. The editing, acting and script were all sub-par. This would have looked better shot on film. Really, the bloods are helping the tax collector for no apparent reason except that he is 'Real?' So dumb...Ayer's usual gritty, raw and realistic depth is missing here sans a few brief moments from Shia. I think he needs to land better scripts or take a break from the L.A. gangster theme, perhaps try some new backdrops or themes. We saw him stretch himself with Bright and it was great. A good time waster movie but will not remain in my collection."}, {"id": 298, "text": "I thought when it worked, it did so in aces. But it had its flaws, and could've done with patching up the plot surrounding a few characters. Overall, decent flick. When David Ayer directs a movie as such, with gang elements in L.A, it scares me that it's inspired by his upbringing, and some of the stuff he comes up with makes you ask about the harsh realities in the lives of many we don't know. Still an Ayer fan, but have to admit, miss the feel of his earlier works.P.S. Shia is fast becoming one of my favorite actors."}, {"id": 299, "text": "A solid start and sprinkled with well done scenes, but overall a disappointment. It has promise, but spirals, and never lives up to what it could have been. By the end, you still don't care about the characters. Well acted, though.Not even sure why Shia is in this. They waste every opportunity to use his character. Supposedly he got tattoos for this role, but we never see them.Don't waste your time."}, {"id": 300, "text": "Really!!!! Stick to what you know best S. He didn't even have the leading role."}, {"id": 301, "text": "After seeing the trailer earlier this year, this seems like it had high hopes and expectations...Unfortunately it's a huge let down with lots of gaps of story lines and character backgrounds. Shia LaBeouf is what sells the reason to even wanna see it and it sells. Most the characters you see are small times thugs you see in gangster movies who got lead roles in this film. It's a flop and i really tried to give it a chance. David's character is super soft in this film and this isn't some John wick movie most people thought when i read early reviews."}, {"id": 302, "text": "Trailer had some promise. But the movie went like they won't play the writer for the entire piece. A waste of time."}, {"id": 303, "text": "I could easily make this a great movie. Build up a major character and then kill him off half way through. No logic to the ending and no one to cheer on at the ending. You build up a bad ass character but never release him."}, {"id": 304, "text": "I have been waiting for an action picture that I would not have walk away from! This was Tax Collector!! Great to excellent stylization. Editing on point! Soto has great charisma and played well against Lebouf subdued performance. Both had my attention! Although the script had some weak spots, it was and enjoyable experience. Special effects were gross and amazing!! I think with a few script tweaks, it would have made it a classic!! It's a action movie! And I like it for that!"}, {"id": 305, "text": "I can't believe the same person that made training day made this movie. And the way Shia got taken out was wack for being some kind of bad ass. Don't waste your time!! I hope I saved someone a few dollars."}, {"id": 306, "text": "The acting was so bad, even from shia lebeouf who I've always though was a good actor. But in this movie he sucked. Clearly not a fraction of 'G' in any of these actors and not enough skill to fake it either. I'm not sure who to blame so I'll blame everyone...."}, {"id": 307, "text": "Awful and obvious storyline, Shia's role is minimal, unconvincing acting, and it's just a waste of time. Seen a million gangbanger movies done 100 times better."}, {"id": 308, "text": "One star for the music and one star for Shia acting skills, perfect as always.. too bad his character had almost zero development and when you finally think ok here we go, good stuff coming(I was really hopping for a clash between him and the crazy girl, that I can't even remember her character name..) no, no good stuff ever came!So very disappointing!"}, {"id": 309, "text": "The first half was good but once creeper die it went downhill from that it seem it was rush and there was no build up and some of the acting seem pretty off but it overall it was a good movie"}, {"id": 310, "text": "Story sucks, it needed a backstory. The movie felt rushed and poor acting."}, {"id": 311, "text": "Couldn't wait to see this movie!!! Couldn't wait th see Shia as a badass......ultimately I got nothing but disappointment. You killed every good actor off. These directors need to sit down and watch good movies...... you don't do this to your top actor"}, {"id": 312, "text": "If u Spanish u will love it fr the action and the effects and camera are really really good"}, {"id": 313, "text": "This movie is not Harsh Times, End of Watch but its also not a 4. If you like crime movies like the ones I mentioned you will be fine with this. Not going to blow you away but not many new movies hitting VOD in 2020 are this good.The majority of people are saying this movie is terrible because Shia is in it. If anyone really watched this they know he's not the lead, Bobby Soto is, and he is not doing brownface."}, {"id": 314, "text": "This seemed like a college made movie. Like something your friend would have made and forced you to watch and you'd say it was good but really it was just the effort you'd be applauding. It's mind boggling that this came from a union director. The acting is terrible. Just awful. The editing too. The shot composure is inconsistent. The story is outright laughably cliche. I only gave it a 3 because of the marketing. They did a great job making this look like it was a real movie but really this is junk."}, {"id": 315, "text": "This could have been so much better. So many moments that just fell short. Shia was the best part of the movie. But it makes me dislike it even more knowing he got real tattoos for it. Like come on man. He would have been better off getting a tat of a peanut butter falcon"}, {"id": 316, "text": "I was really looking forward to this movie but what a waste of time and money. This film has so much potential to be a good film even if it is the repeated cliche story about drug cartels and redemption. If you love END OF WATCH and FURY this is nowhere in the same field of those films. Shia steals the show being so involved with his character but Bobby Soto was miscast as the protagonist of the movie. I was not convinced of him being a mexican gangster running the streets of LA. His character barely spoke spanish fluently. The film story is missing depth and the film needed to be longer than its run time it feels rushed. Like I said I was really looking forward to this and bought it on itunes today but I wish I had rented it. SMH"}, {"id": 317, "text": "The movie is called The Tax Collector, and I'm not sure why because Shia LeBouf's character is absolutely pointless. I'm thinking the story of him getting the chest tattoo for the movie is also a lie because that is equally pointless. If you remove the title, and anything to do which Shia LeDouche it's an otherwise good movie. The problem is David Ayer made him a pivotal character and titled the movie after his character."}, {"id": 318, "text": "I am a huge fan of David Ayer. Personally I think training day and harsh times go down in cinemas top 10 realistic, deep authentic quality movie making. Tax collector did fall short of his previous work. Being a little to main stream and almost seemed to have a different flavour entirely. I'd almost question this being solely David Ayers work as I know it so well. That being said you could feel his artwork present In this piece. Definitely well done and even though I am a huge fan of Shia and totally biased in the right ways. I feel like this role he played was captivating. Similar but not close enough to Christian bales in harsh times. I imagine Shia took it that way but wasn't given the proper return. Shia was top notch but the story was David Ayers most unthentic piece. If that is even a word. What I'm trying to say is David dropped the effort of making it 110% realistic and instead swapped it for WHATS most current: which is okay and it worked. However I don't think I have ever gave David Ayers work an 8 before. It's always 10s across the chart. If it was any other writer or director I probably would have only gave it a 7. Probably, it was really deep and still well done."}, {"id": 319, "text": "This piece of trash was so bad I was actually moved to write a review. I want to save you wasting your time watching it. You're welcome. I mean, who thought this movie was a good idea? Who sat down around a table and said yeah, let's tell the story of some gang guys collecting their taxes until it all goes wrong. Were they under the impression it's never been done before? Did they feel they had something new to offer this overcrowded genre? Because if they did, they were sorely mistaken. It just lurched from one cliche to the next; Main character collects from the nastiest gangs in LA - but really, he's a teddy bear with a heart of gold. Ugh. A family man. Ugh. And a man of God and morals. Ugh. We had awful buddy chats in the car (a wee laugh about the fact they're psychopathic killers). Then we had moments with the kids to drive home the idea they're really good guys. Cut to a martial arts training montage reminiscent of bad 80's straight to video action flicks. Flashbacks to happier days like something a teenager would do in a 48hour film fest (but at least they'd do it with a sense of irony). And if that wasn't bad enough, the writers even added some clumsy exposition to make sure we could keep up (with an infantile plot a 4 year old could follow?). There was violence sure - if you like that kind of thing, but it was artlessly done and for the most part, unnecessary . Acting? Ugh. Art direction and grade. Ugh. Just the opening credits were enough to make me want to leave. They looked as poorly conceived, dated, and rushed out as the rest of the film. Seriously, what were they thinking when they decided to make this crap?"}, {"id": 320, "text": "Ok firstly, this movie is very good. Yes there is a lot of weak writing and some of the scenes seem out of place but it is still entertaining enough nonetheless. The beginning starts out a lil dull but the film builds momentum as it gets going. Personally, I feel it would have been better as a film about Creeper with him as the main character and with David as the second to main. Shia Labeouf was immersed in his role as Creeper and he turned in the best performance of all the actors. Most people that watch this movie will be coming for Shia but staying for the mean spirited final act. Shia usually plays some variation of himself in literally every role he has ever done except for Honey Boy and sort of now this film. Shia has seemed to lose himself in the character of Creeper, becoming a victim for the screen in a turn of horrifying gang related events, allowing himself to be scene in a humans most vulnerable state: helpless at the hands of a killer. All the while, though, he was still portraying a personality that isn't too far from his own, im sure. Overall this movie is really good and doesn't deserve the bad reviews. In ways it reminds me a lot of Spring Breakers and I was wondering when another movie with that feel would come out. The actor who played Conejo was quite good as his character was rather menacing, committing atrocious acts. The way he spoke and acted was very similar to that of Gucci Mane's character from Spring Breakers. They even smoked their cigarettes the same way and they are both rappers as well. I totally don't get the bad reviews for this film. Yea, it wasn't the best movie ever made but it is definitely a decent one. The 4.7 rating is wayy too low. Deserves a 5.4 at least"}, {"id": 321, "text": "First off let me just say that giving this movie 1, 2 or 3 stars are just a joke. So it's suppose to be worse than any new Steven Seagal movie?! Believe me, it's not!! Many complain about IMDB being corrupt, fake accounts giving a high score to promote the movies. In this case, the movie has been trashed, for any other reason than it's quality. And obviously for some kind of different expectations than given.Being a spun-off to Training Day, this movie is pretty much gangster as you might expect. I just saw Training Day for a 4th time a few months back. Given, this one isn't on the same level or production, it ain't bad.It had some fun old gangster scenes with fun violence. Guns, women and drugs. La Familia, I get it. It is an easy movie, like a good Friday movie with some buds (both beer and friends) and a large pizza. I liked the paste in the movie and the soundtrack. It's a bit cheesy here and there, but I did not mind, as I did not know what to expect really. I don't watch trailers.Please, don't believe all the bad reviews, they don't give the movie justice. I'm not a super Shia LaBeouf fan, but I honestly think he did a pretty good job here. And, Jose Conejo Martin is just pure gangster to the bone. He got me excited and delivered a really evil and ugly part in the movie.Don't expect Training Day and don't expect a Denzel Washington worthy performance. Other than that, just enjoy this little ($30 million) gangster movie and have fun. 7/10"}, {"id": 322, "text": "I personally thought The Tax Collector was a solid action movie. No, not really in terms of originality, but the action, performances and an interesting narrative. I must warn you in advance that if you're expecting Shia LaBeouf to completely dominate the movie, you might end up disappointed. He's mostly decent in his role, and so are most of the actors. David Ayer has directed the film pretty well and has kept the story quite simple. There's nothing extraordinary about it, other than it's, in simple words, entertaining. It's not too long either; 90 minutes is a fine duration for a film like this.The Tax Collector starts well and goes on well for the most of the first half. Some might find this slow but these bits are necessary to set the story up. Once the setup is done, it's nonstop action from there to the end. Gunfights are choreographed and shot in a stylish manner, and some raw hand-to-hand fighting is also neatly done. Needless to say, it's the highlight of the film and makes it intriguing. I'm speaking for myself when I say I really liked the film. As for others, I can only suggest viewers to expect less of a character driven film, as it seems to skimp on heavy character development. Nevertheless, it serves a decent and gripping plot as the backdrop for the stylish action sequences.It's not David Ayer's best film by any means, as his other action thrillers had both great action and intriguing stories while this one, on the other hand, just offers good action with some nice acting and a good, not great, plot. But that one issue isn't big enough to stop you from enjoying it if you like action movies. It's enjoyable, and I can't deny that. It really worked for me, and I had a sense of satisfaction when it ended."}, {"id": 323, "text": "Before we go into the hot streaming pile of garbage that is The Tax Collector, I think it's worth remembering that at one time writer/director David Ayer was responsible for the script of gritty cop thriller classic Training Day and also was in charge behind the camera of really quite good thrillers Fury &amp; End of Watch.His also responsible for downright atrocious films Bright and Sabotage but we could previously put them down to bad luck or mismanagement, but now Ayer's lack of ability to craft a coherent or well-put together feature is becoming a major concern.Originally planned for a mid-tier level cinematic release, The Tax Collector comes our way now courtesy of VOD/direct to disc releases and if there was something to be thankful for its that we never had to witness this crime against cinema on the big screen here in Australia as the charisma free Bobby Soto and the extremely method Shia LaBeouf get caught up in a seen a thousand times before story of family loving criminals that find their business mixing with pleasure when a big bad throws his hat in the ring to be the new kingpin.Much publicity was made around LaBeouf's role here as the loose-cannon tattoo clad Creeper but make no mistake, LaBeouf may as well not have shown up (and could've definitely completed this role without adding to his tattoo collection) as Ayer is more focused on exploring the trials of Soto's David who has his money rich world turned upside down by the appearance of Jose Conejo Martin's chicken hating Conejo, a blood-thirsty criminal hellbent on taking over L.A's drug world.It's a constantly nasty and bleak affair, filled with some of Ayer's worst ever dialogue I got a .38 on each ankle, .38 on my right, .25 on my left, chopper in the trunk, lockin' my belt, I'm on it! is just one such moment that is supposed to get the energy levels up but ends up making you turn your head in concern and the film is filled with a bunch of characters that are neither likable or interesting as Ayer's obsession with the Mexican criminal underworld finally culminating in this atrociously staged outing.The films best chance at being something worth enduring was to be found in LaBeouf's Creeper but he plays a backseat role to proceedings here as we instead get a lot of badly staged family life snippets of David and his offspring/wife that begins to turn into a generic and highly over the top revenge tale that goes too places that make little sense or create little interest as the film falters badly in almost every department.Final Say -A new low for Ayer whose obsession with a particular sub-genre and subject matter has culminated in this humiliating misfire, The Tax Collector is not worthy to be placed alongside its creator's more regarded works and wastes a locked and loaded A-lister on a underutilized character in the process.1/2 a beer cooler out of 5"}, {"id": 324, "text": "Yet another movie poorly rated because the majority of audiences no longer know how to watch movies. If Robert Downey Jr. doesn't show up at the end to explain the payoff, through a moral truism, most movie watchers seem to be completely lost. Ugh.To be very clear: this move has good character development, a solid story, and realistic dialogue.I think one of the main challenges that people might have had is a lack of connection or understanding to the subject matter. I have a friend who used to be MS-13 and he said, years ago, exactly what this movie is about: you can't play around with being a good person in this world. You either live a good life, doing good things, or you be a gangster and it's all you are. If you try to be a good person in a bad life, the evil will get you. You may get out, but there WILL be a cost.That's what this movie is about. We see the two main characters being developed, David prays, and claims God is watching over him. Meanwhile, his buddy Creeper, refuses Christianity, and even invokes eastern meditation. They're relatively good guys in a bad world. They're involved in bad business, but they have good sides to them. More to the point, David is a relatively good guy; he collects money for gangs and threatens people who don't pay, but he acknowledges God and shows his kindness at timesUnfortunately for David, as we learn, the world he exists in IS evil. I won't give any spoilers, but there are costs to existing in the world he operates in, and you can fool yourself that you're a good guy and going to be ok, but if you try to be good while doing bad work, you'll be eaten alive by those who are dedicated to evil.The ironic complaints to me are about the dialogue. I've grown up around a lot of Mexican gangs as well as a couple friends who were MS-13, and I thought the dialogue was very authentic. As soon as David and Creeper were in their SUV talking back and forth I cringed at how much it made me feel like I were hanging out with some of my old buddies. The problem is that most people don't know how these guys really talk, I have to imagine, and ironically, movies try to sound like real life, while real life gangsters and such try to sound like they're ultra hard. So it's sort of a funny cyclical thing where if you want to sound authentic, then you also have to sound pretty cheesy since the real things are constantly posturing and trying to sound like the movies.One last note. As I was watching and feeling like the writer/director knew his stuff, I was wondering if they would get into a key aspect of the gang life that doesn't get any attention (a very dark aspect of it), and I was surprised to see they actually did get into it, which also made for the roughest scene in the movie. But again, it goes to show they knew their stuff when they made this movie.I definitely recommend it to anyone who is into gang life/organized crime type movies. If you're not, there may not be enough to make this worthwhile to you since it's definitely a dive into the moral plays in the criminal underworld.Final note: I don't like movies that praise criminals, and some might think that's what's going on in this movie. IT IS NOT. This is a study on an aspect of life that most people don't relate to. What might seem pointless to some viewers is everyday life to others."}, {"id": 325, "text": "I am reviewing this within hours of it being released. Currently there are 30 total IMDb votes. My guess is when the score settles down after enough people watch it, it'll hover around a 5.8. But, if you like violent crime movies, I recommend checking this out. It is not very long, so there is not too much opportunity cost (it's about 85 minutes I think).The dialogue did come off kind of tongue-in-cheek at times. Shia did great, as always. Even though I did enjoy being entertained by the movie, I wish it played out differently than it did. I am not saying it has a bad ending. The ending was okay for me and where most of the action is. I wish certain characters in the film played a bigger role in the overall resolve of the movie. This might not make sense, but if you watch it, you'll probably know what I am talking about.The visuals/cinematography was good. The acting was mostly good. The dialogue was hit or miss. Some of the stuff that was said was kind of corny. One non-spoiler example of corny dialogue would be Take this gun, it has a lot of murders on it. The way that line was delivered made me cringe. There are a few other examples of that in the movie.I also feel like the movie did not come full circle. Sure, there might be a tiny bit of a twist...but I would have liked to see the actual last clip to have been in a different setting to bring the film full circle. Again, this probably makes no sense unless you've seen it and remember how the film begins.It is hard to write a review without spoiling anything. Basically, if you like shoot 'em up crime movies, it's worth checking out. The characters do not go into much depth, but at an 85 minute runtime, that's kind of expected.I feel like this movie would have been much better if movie theaters were still open; and they had to run test screenings. Maybe a couple changes could/would have been made to improve the film...but I know that Covid, and the realization of a lower ROI of this film without a box office, may not justify investing too much additional work into it.It will entertain you, but it could have been better....and it probably would have been if Covid wasn't making things more challenging for filmmakers at this time. It's worth a watch, and I think a lot of frustration from the critics is due to the potential this film had. With more character development, some dialogue changes, maybe change up a couple scenes...there is a lot of potential for a great movie. It did feel a little rushed, but hey, I was entertained.6/10. That's what I give movies that entertain me, but won't stick with me for very long. Worth watching, but probably not worth re-watching. I wouldn't go out of my way to recommend it...nor would I dissuade anyone from watching it. It's always a treat to see Shia, though...he's a fantastic actor."}, {"id": 326, "text": "Tgchan's rating: 2 /10 Absolutely rubbish...Bobby Soto/David weak and lame... feels like a misplaced actor from a Disney movie. Terrible scripting, acting, dialogues and everything else... It feels like an amateur project of some kid with some money...All that gore and money, yet no traction with quality whatsoever...The whole film has just two positive things I can think of...Shia's performanceOne shooting scene with a nice camera angle and slow motion. That's it.Utterly-wasting-time pukes/ Filled with some religious propaganda...I don't even want to write anything more about it. I just want to forget it and not think about wasted time."}, {"id": 327, "text": "With a true hope for David Ayer making something top notch awesome after his past couple bad boys, The Tax Collector came as gut-punch disappointment. Though film came out (painfully) average in my book, the disappointment was felt deeply. Nice trailer, right, nice poster, solid director, interesting cast, so what happened? Nothing much happened, sadly. It is undoubtedly the script dragging The Tax Collector down the most. Ayer, whose love for the gang and street culture have been prominent in his movies, injected a little too much of said love in The Tax Collector. The film, having a shallow story and all too familiar character doings, relishes gloriously on the spiritual nature of gangsters, boasting morales left and right. Being as openly preaching as it is, some of the dialogue feels very staged. The core plotline moves at a snails pace and ends seriously lacking. Acting performances in The Tax Collector are decent, though feeling wasted on the background of all the flaws. Shia LaBeouf, who was another pull for me, was given only a supporting character whose role in the story and ending went underwhelmingly. The man got real tattoos for the role of Creeper. I hope the man is rolling with it nicely, for his sake.Cinematography also is not in any real way impressive or quality feeling, but the editing and original score are worse. Very shortly into the movie it's apparent that there's something funky with the editing, weird cuts, weird shot changes, nooks and crannies feeling a little off. It's not constant, but consistent enough. There's quite a lot of cheap dramatism displayed, random slow-mos, befitting and cheesy high stakes score pieces. The music overall is a lackluster. Honestly, too much about The Tax Collector simply feels like a TV movie.The Tax Collector hardly even justifies its own name, and is a gang movie that feels itself like a king of the underground, but is in fact a thug for hire. I can hardly recommend it to the audiences its aimed at, because I believe it has a real knack to elicit a pure sensation of disappointment. My rating: 4/10."}, {"id": 328, "text": "(3.5 out of 5 stars).The Tax Collector is a pretty fair crime drama film about David (Bobby Soto) and Creeper (Shia Labeouf) who are tax collectors that collect money from other gangsters. When they come out short. Everything falls apart when another gang leader shows up. Intimidating and attacking everything they care about.It was a pretty decent plot. Can be a little predictable with the direction it goes. Creeper and David are best friends that would die for each other. Even when things turn for the worse.The film is violent and gritty with its content. Like a brief torture scene. The action sequences was decent.The script is lacking the emotional depth with the characters. Which makes it difficult to care for when lives are at stake. Which the film really needed with the main characters.It was a pretty fair film if you enjoy gangster kind of films."}, {"id": 329, "text": "While it pulls no surprise punches, the greatest issue with The Tax Collector is that it doesn't add depth to any of the characters. Running in at just over 90 minutes, it feels that the film is rushed, and doesn't make the most of the fenetic actions scenes David Ayer is famous for, managing to only get one in extremely briefly.If more thought, time and money was put into the film, it could have been much more akin to End of Watch, but falls quite short of it. Short enough to call the film bad? I wouldn't say so. Shia LaBeouf carries his role as Creeper extremely well, but again this doesn't feel like it is explored nearly enough, but there's enough there to make this film a solid eh, it's okay.Given that there's a lot of significantly worse films out there with a higher rating e.g. The Evil Dead (2013), which has zero redeeming qualities, has abysmal acting, terrible script, garbage pacing etc coming in at a higher rating, I feel this film is overly criticized, although don't expect anything that's close to greatness."}, {"id": 330, "text": "When The Tax Collector starts, it feels as if writer-director David Ayer is headed back to his L.A crime roots.. in the same universe as Training Day, End of Watch, Street Kings, and Harsh Times. But no, it quickly turns into an unbelievably shallow gangster saga with dreadful dialogue, oozing machismo, a generic revenge plot, and stock characters. All the action is reserved for a climactic showdown which, by the time you get there, feels too blah. Out of all the cardboard gangsters we come across, only Shia LaBeouf (in a supporting role) manages to leave a wacky impression. A feral vibe could be felt from the guy.I'm not going to comment on the performances of the rest of the ensemble, or the uninspired soundtrack choices, or the overdose of violence. The Tax Collector feels more like a Michael Bay prototype (if you disregard his zillion explosions) and less like a gritty Ayer attempt. The writing, the cross-cut edits, the underused talent, the much-seen turf-war heroics - it's all just a giant, gory mess with nearly zilch payoff."}, {"id": 331, "text": "Much like great comedies, gangster movies seem to be very few and far between these days. From cartels to mobs, it really seems like television shows are covering the bases, leaving no room for a great film to break out. Of course, there are tons of movies like this either being made or trying to get off their feet, so that statement might be a little hyperbolic, but it just seems that way lately. The Tax Collector is the latest film from director David Ayer, which surprises me because I've really liked some of his in the past. Even though this definitely has his style written all over it, this film is kind of a mess.The basic premise is that a rival gang shows up to reclaim territory and David's (Bobby Soto) family is placed right in the crosshairs. This film could've easily been a lot simpler and focussed on the revenge aspect of the story, but it decided to play out more like a video game. There were multiple times where I felt like a writer from the Grand Theft Auto video games stepped in and decided to randomly throw in side quests for these characters to go on. This in turn made the movie feel very disjointed. Even though it has a short run time of 95 minutes, it still seems to lose focus on the core premise until the final act truly begins.The anchors of this film are the duo of Bobby Soto and Shia Labeouf. Labeouf has proven that he's better off investing himself in a meaty role in a smaller project and those films have ended up being some of my favorites from the last few years, so I wasn't surprised to see him deliver a great one yet again. Soto, having appeared in multiple episodes of television shows and a few smaller films, never stood out to me until now. His devoted performance to bouncing back and forth from criminal to family man felt very authentic and I felt for him by the end, even though his actions were atrocious at times. He's definitely an actor I'll be keeping on eye on.David Ayer is a very good director when he is working on the right project. Whether it was his superb effort on Fury or the very well-done End of Watch, it's lower-budget movies like this that get me excited. With that said, the story here deserved much better dialogue and the look of the movie felt too unfinished in my opinion. I get that Ayer was going for a grimy and simple aesthetic, but it felt too plain to me. I was engaged in the story at first, but eventually lost interest and didn't care all that much about who lived and who died in the end, because the screenplay just wasn't strong enough.In the end, The Tax Collector is a film that has some very well-rounded characters in a world of crime that was interesting to explore, but the movie just feels like a series of side plots that eventually leads the core character of David on a plot of revenge. That choice made the movie very disjointed and uninteresting as a whole. Some viewers may enjoy the characters enough to look past these issues, but this film just didn't give me enough substance. A nice effort from all involved, but it wasn't truly worth it by the end. Looking at the talent in front of and behind the camera, I must say that I came out of this film feeling slightly disappointed."}, {"id": 332, "text": "David Ayer is a bum; Bright was mediocre at best, but basically a carbon copy of Training Day, Tax Collector is basically a carbon copy of both of them, but not remotely realistic.Not saying the gang life doesn't exist in LA but no cops can be found for what seems like an entire day of gunfire, explosions, and killings until the end, when a house is on fire.Movie is dragged down by the cliched figurative portrayal of gang life. Underboss thinks he's hard but when faced with a challenge he runs away. Goon is hella suped up that he doesn't even realize he's puss. And, any other tough guy gets deleted before they can even do anything.No empathy for the loss of family as that was brought on by their own actions. This was a film I laughed as the hero had everything taken away from him.Old Blood set leader decides to ride for a rival gang; ok David is a good guy but what set leader is really going to put their gang on the line for someone elses' issues?The story was a mess, too fast, too short, too ambiguous, too sloppy. Just bad."}, {"id": 333, "text": "The Tax Collector was written and directed by David Ayer, who brought us films such as Fury and End of Watch. Despite rumors of this film being good because Shia LaBeouf took it to the next step and got his whole body tattooed, doesn't save this film from being a huge plot hole of messes. The Tax Collector brings nothing to the table besides some well choreographed fight scenes, but that is at the very minimum. The bland vision behind this film is what really destroyed its potential, with lazy writing, sloppy directing, and acting. The only good thing that came from this movie was the potential that Shia had, his acting was top notch with the script he was handed. Of course we all know that Shia has a background of taking things a bit far, with cutting his face for fury, tattooing his whole front body, and even getting arrested while filming the peanut butter falcon. The sheer lack of chemistry between each character makes it seem as if I'm watching test footage. Stupid plot holes that add nothing to the story besides some cliche drama found in these types of movie. It's just such a shame to see a movie fail so badly, with a director that has a good background of directing and writing film. But, Shia's performance and some well choreographed fight scenes doesn't save this film from being an absolute train wreck of cinema."}, {"id": 334, "text": "This movie is like End of Watch for the bad guys of Los Angeles. Very much like End of Watch this movie had all sorts of potential. The L.A. crime vibe is undeniably cool in all periods of history and there is such a good opportunity here to make another Heat or Training Day with a Hispanic protagonist. This movie in concept seemed destined to win. The Tax Collector, however, fails miserably in seizing the opportunity and already belongs in a $5 DVD bargain bin at Walmart.Firstly, almost all of the characters are incredibly shallow and/or cliche. Sadly this includes the protagonist and all of his family, the antagonist and all of his crew, and even the great George Lopez's character Uncle Louis. Amazingly the one bright spot is Shia LeBeouf who plays an interesting antihero role. Though personally I find Shia intolerable in most movies, he actually is the one character with any depth in this movie and I grudgingly admit the part is well-acted.Secondly, the writing and plot is just as shallow and cliche as the characters. The dialogue is mostly horrible with some quirky Shia bromance moments being the only exception. The plot is also completely telegraphed and seemingly taken out of a bad 80s Steven Seagal movie. If you are the kind of person who can sense where plots are headed you will find yourself knowing exactly what will happen at least 10 minutes in advance.Thirdly, to compensate for uninteresting characters a predictable plot there is a lot of gratuitous violence in this movie. This type of crime movie is going to be violent, I get it, but the violence is poorly set up and executed dramatically in all cases... abrupt, cheap, repetitive and generally meaningless to the plot other than to broadly justify revenge.Finally, the tactical consulting and special effects are also of the lowest possible grade for a movie released this century. Gun handling never looks professional with any character. You will not believe most of the actors have ever held a gun before. For John Wick Keanu got months of training with world-renowned experts for each movie, seemingly these guys were just handed prop guns the day of the shoot and told Do the best you can. The effects were also atrocious. Some of the muzzle flashes look like they were drawn with Windows Paint.All in this was a terrible experience I don't recommend to anyone. If you like good movies you will not like this film. You should a) wait until this movie is free on your streaming service of choice, then b) only watch the first 30 minutes just to see Shia in all his absurd gangster glory, and then c) turn the movie off because you already know what's going to happen, thus saving yourself from the bloody mess (literally) that is the rest of this movie."}, {"id": 335, "text": "I am going to be concerned about that smoke detector until someone puts the battery back.Is Creeper his Christian name?Shia is an excellent actor. I hope he stops messing up.That is a deep voice he's acting?Nice shoes is cute.As expected this is going to get messy.Is this a test?Face ID is not going to work for that man anymore."}, {"id": 336, "text": "They say imitation is flattery. This movie is like a combination of imitations. Examples: of Pulp Fiction (hardcore gangsters in cars having conversation about not so gangstery-things), of Michael Man-movies (the protection racket money handling montage with the girl riding the motorcycle with the cool song behind it), of Shot Caller (the way the crime organization is organized, even from behind bars), and of Drive (extremely violent behaviour from guys portrayed as being not thát bad).Sadly, while a combination of imitations can work, it just doesn't here, as while watching this you are constantly reminded of those other, better crafted scenes.Also, I can always bring up a little suspension of disbelief, but hey, don't think too little of me, movie making people. When, in the beginning of the movie, a guy gets in a car to drive to work in a tracksuit and suddenly wear a totally different outfit, I'm quickly getting the idea I'm not being taken serious. A continuity error so early on? C'mon.But it's not all bad, even tho' sometimes it cringily written. Just: don't expect too much. Watch this while having a couple beers with friends and you'll have a background movie with some conversation starters."}, {"id": 337, "text": "I feel so bad for David Ayer at this point. The man went from critical acclaim with End of Watch and Fury (both of which I need to rewatch now) to dud after bomb after Dumpster fire. Suicide Squad remains one of the worst superhero movies of late and Bright is still one of the strangest blockbusters I've seen. After hearing about Tax Collector I was hopeful that he could get his career back on track.Unfortunately, that is not the case here. Tax Collector, while not the worst thing ever is yet another skid mark on the career of David Ayer. This is just not the right thing to kick your redemption tour off. Not only is this mafia revenge story played out, but it's also completely incompetent in terms of the execution.It's ugly, poorly edited, and the dialogue is consistently terrible. The editing especially is baffling. Jump cuts and the lack of establishing shots make this utterly jarring and hard to follow. This mainly takes place in the first half, seemingly to rush through the set up. Which is disappointing because I enjoyed the set up.I liked watching Shia and the main character, David, attending to their daily tasks. Collecting money, dealing with people doing stupid things, and planning for a family party. It establishes every major player pretty well and you even come to like some of them. The dynamic between David and Creeper was very reminiscent of End of Watch which I liked.The main story mostly revolves around a new player in the mafia game shaking things up. People get killed, chaoes ensues, and David has to take revenge. It's all quite simplistic. If you liked some of the characters more and gave this more time to breathe then maybe it wouldn't feel so bland. I'm sure it was also disheartening to see Nicholas Winding Refn virtually do the same story with To Old to Die Young. (But with exponentially more skill.)It's saddening to see David Ayer tumble further down the proverbial rabbit hole. Any further down and I fear his career may not recover. If you can't make something good out of a Mexican mafia story starring a committed Shia LeBeouf, then maybe you should take time away from the game. Find a story that hasn't been done to death and put all your passion into it. I'm not saying that this isn't a product of passion but it certainly feels as if many corners were cut. The structure is there, the talent is there, but polish was an after thought in every sense."}, {"id": 338, "text": "Well, the 2020 movie The Tax Collector was what it was; essentially just another generic gang-related action crime movie, for better or worse. But there was something oddly entertaining about the movie though.Sure, if you enjoy watching movies with street gangs and criminal activity, then I believe you will find The Tax Collector rather entertaining. However, this movie had a tendency to feel like just about every other movie based on the same formula.The storyline told in The Tax Collector was pretty straight forward, although it was fairly generic, and with writer and director David Ayer leaving no room for surprises, the movie felt linear to the point of being overly predictable. There just simply were not surprised throughout the course of the movie.I will say, though, that writer and director David Ayer did manage to concoct a movie where it felt like the audience was right there alongside David (played by Bobby Soto) and Creeper (played by Shia LaBeouf), and that definitely added an enjoyable level to the movie.It was also nice to see the likes of George Lopez, Jimmy Smits and Noel Gugliemi show up in the movie.While The Tax Collector was entertaining enough and enjoyable enough for what it turned out to be, it was ultimately just another run-of-the-mill-gangbanger-movie, truth be told. But some pretty convincing acting performances managed to bring the movie up a notch. Which reflects in my rating of the movie, which settles on a six out of ten stars."}, {"id": 339, "text": "This movie boarders on B status and is only saved by the performance of Shia LaBeouf. His character was so believable and makes me want to see a prequel of Creeper. The movie started out well. Although I feel that David wasn't correctly cast, I feel David (director) did a great job of character development on David. Showing his domestic and spiritual side, then the street biz. There was some lag midway into the movie then picked up again.The interaction with the brothers joining as the cavalry at the rear of the film was where it lost plausibility along with the level of acting skill, but I was already hooked and I rode till the wheels fell off.Getting back to Shai. I know he's been through it and we all have to deal with life, but I think we'll look back to see him as one of the greats. He'll have an Oscar before he's done. You can snapshot this prediction. :)"}, {"id": 340, "text": "I can't remember the last time I saw a movie that had so much potential, and just consistently squandered it to this degree. 'The Tax Collector' has some truly excellent scenes sprinkled throughout, it's the stuff in between that is bordering on rubbish. So often the film feels like it is about to take flight and kick it up a gear, only to stall for the next 10-15 minutes with inconsequential nonsense. With about another 5-6 rewrites I could imagine this movie being something truly excellent.Shia LaBeouf really impressed me in this movie. He had a great character, who the script didn't let live up to his full potential, however he hit every note perfectly. His accent was convincing, and he was very cool and menacing. The problem the script found was that the more screen time your characters get, the harder it is to keep them cool. The characters are introduced in a very stylish and compelling way, but then as we get to see more and more of them we realise they are just normal guys, and the mystique is lost.All the ingredients were there for this film to work - good characters, played by capable actors, and a story that should have been a lot more compelling than it ultimately was. Basically 'The Tax Collector' has to go down as a missed opportunity. We know what David Ayer is capable of. When he's good, he's amazing. But when he misses, it can be quite a mess (see also 'Suicide Squad'). Unfortunately this was the latter."}, {"id": 341, "text": "This movie is just so awful it is honestly like something a high school class would put together. Shia never the best actor plays a role that makes absolutely no sense. The acting is awful, the film is full of awful cliches and you know what is going to happen every step of the way because of these cliches. It is definitely a white director thinking he understands the LA gang and minority culture and it fails in every level.If you run across the film while bored like I did don't watch it. If someone tells you it is good call them a liar. If someone says you should watch it cut ties with that person. If any of those actors or director ever get another job after that train wreck movie there should be an investigation in to it. I as sit here I mourn the little Digital 0s And 1s that gave their binary code lives for this movie. It was so bad we may want to consider protesting it. We should all meet in Hollywood and insist that this movie be pulled so innocent people do have to suffer. The only good part of this movie is the first 1/10th of a second when the end credits start because you realize that you'll never be subjected to it again..In fact, I should get money for the pain and suffering I experienced writing this review but I need to warn others. Seriously, I have no idea why they even bothered with Shia's character it ultimately makes no sense. Don't watch this you have been warned."}], "reviews_amount": 342}