{"name": "Kajillionaire", "titleId": "tt08143990", "reviews": [{"id": 0, "text": "I was more than a little sceptical having read the one star reviews. This is not laugh out loud comedy, more of a drama really. I and my wife in our 60's just loved this quirky movie. It was so well acted I think its Oscar worthy. I can understand all those people who need belly laughter humour. But yeah I nearly gave it 10 stars"}, {"id": 1, "text": "I love the individual main actors in this movie, and I had read some stellar reviews (NYT, etc.) from reviewers I respect, so I was very much looking forward to seeing this.OMG (and not in a good way). This felt like one of those experimental student films from the '70s and '80s. All the little mini-episodes are supposed to meld into a coherent story (didn't happen). Slice of life (I guess) type of storytelling. I never really got a feel for any of the characters. Nothing they said or did made any sense whatsoever. The reveal the morning after the birthday party defied even the most generous suspension of disbelief (how could two old people move ALL that stuff out of a second floor apartment without being heard). The final reveal at the end (the $525 1/3 part total) was cute, but not as particularly revelatory as one might expect (and that seemed to be the intent).I found nothing special about the performances (except maybe Gina Rodriguez at her sensual best) nor the direction.Felt kind of robbed of the 100 minutes or so spent in an almost empty theater on a Saturday night. I ALMOST walked out, except for all the stellar reviews. I kept waiting for the one moment that made everything make sense. It never happened."}, {"id": 2, "text": "This is a very bad movie. Bad acting. Senseless plot. Depressing, but not in a cathartic way.I didn't walk out because I kept waiting, waiting for some redeeming aspect to reveal itself. Didn't happen.If I had paid money to see this movie, I would be very angry. Indeed knowing what I know now, if necessary I would pay money to NOT see this movie. Up to $20."}, {"id": 3, "text": "Essentially a lesbian love story, is also a barren comedy mostly populated by unsympathetic characters whose eccentricities are more obnoxious than endearing and resting on underlying ideas about life and death that cannot be harmonized with revealed truth. shoulda 'stayed in the closet'."}, {"id": 4, "text": "I think this is the first time i disagree with the general consensus. The film was slow but it delivers with the plot. The character development was on point and the acting by Evan Rachel wood carried the movie most of the time. It's a bittersweet movie and while not perfect i think it's one lf my favourite to come out this year. Obviously it's not for everyone."}, {"id": 5, "text": "Kajillionaire wanted to be many things - a comedy, a heist film, a drama, a coming-of-age tale, an introspective character piece and more. It failed at being every single one of those things. Gina Rodriguez and the scene at the old man's house were the only good things about it. The parents had one trait shared between them and that was being awful people, whilst the daughter had one trait and that was needing therapy of the psychiatric and speech kind. It was slow, it was pretentious, it was boring. And it shouldn't have been billed as a comedy, let alone released in cinemas. Bad film, bad time."}, {"id": 6, "text": "This film is so wacky that you don't fully appreciate the deep dive into human relationships until the end of the film. The acting, especially from Evan Rachel Wood is unexpectedly brilliant. And the writing from Miranda July is her best yet. I laughed until my heart broke."}, {"id": 7, "text": "This movie was very strange and very slow, not funny, no likeable characters. I don't understand any of the good reviews, they must've reviewed the wrong movie under this title. Don't waste your money. Not even worth a $1.80 at the Redbox. Not sure what the point of it was supposed to be. It's 1:45 you'll never get back."}, {"id": 8, "text": "Greetings again from the darkness. A single month with new releases from both Charlie Kaufman (I'M THINKING OF ENDING THINGS) and Miranda July, is almost enough to make this movie lover forget for a moment that we are suffering through a global pandemic, raging forest fires, and the most obscene presidential campaign of my lifetime. Ms. July is an absurdly talented writer and filmmaker, and it's her first feature length film since THE FUTURE (2011). Prior to that, she served up ME AND YOU AND EVERYONE WE KNOW (2005), and has a unique way of displaying her strange life observations. She and Kaufman are masters of quirk, and excel in twisting our minds.Evan Rachel Wood stars as Old Dolio Dyne, daughter of Robert (Richard Jenkins) and Theresa (an unrecognizable Debra Winger). This is an oddball family of petty crime con artists who live in a run down, unused office next to the Bubbles, Inc. factory. And yes, they make bubbles in the factory ... bubbles that seep through the walls into the office where this family sleeps. One of their scams is on the landlord (a surreal character himself) who has to explain to an always-negotiating Robert that rent is an installment.The first part of the film allows us to get to know the family members. We see them pull off stealing mail from a neighboring post office box, and returning stolen goods for the reward. Ms. Wood stays attired in an oversized green track suit jacket, and has lowered her speaking voice by an octave, adding impact to her monotone liners. She's socially awkward, and likely on the spectrum as she seems to be the smartest of the bunch. Daddy Robert is a control freak and has an emotional disability in regards to California earthquake tremors. He and Theresa show no signs of affection towards each other or Old Dolio.An airline baggage scam results in the family meeting Melanie (Gina Rodriguez), an eager to join the grifters woman, whom Old Dolio sees as her replacement as both a daughter and partner. Jealousy ensues. Melanie is contrasted to Old Dolio by her bubbly personality, and by a wardrobe that is significantly more revealing than a tattered track suit. Old Dolio watches uneasily as Melanie is soon receiving the attention from Robert and Theresa that their own daughter craves.The second half evolves into a film not so much about cons or heists (the film admits it's no OCEANS 11), as about family dynamics. The twists and turns find Melanie helping Old Dolio break free of parental over-control in order to experience independence ... and pancakes. Learning about warmth and affection from normal families is eye-opening for her, and sometimes a little confusing for us to follow. Who is scamming whom, and when are they telling the truth?Miranda July has created a crime-drama-comedy (dark comedy), with plenty of space to let the characters and dialogue breathe. I'm Mr. Lonely by Bobby Vinton kicks in periodically, and the score from Emile Mosseri (THE LAST BLACK MAN IN SAN FRANCISCO) complements it well. On the heels of last year's team of family scamsters in PARASITE, this shaggy group has never met a swindle they wouldn't try. And they never expected it to backfire with their own daughter. The divide between those who like the film and those who don't was pretty clear after Sundance, and Miranda July will likely never be one to appeal to the masses. But for those of us who connect with her oddball way of seeing life, we appreciate the focus on what makes a family of outsiders click ... especially when a superb performance from Evan Rachel Wood drives the film."}, {"id": 9, "text": "Don't bother watching this film, it's boring and of little merit. Stay at home paint a wall and watch the paint dry for a more entertaining evening."}, {"id": 10, "text": "Seriously, this is supposed to be, 'the smartest original comedy of the year' burning garbage is more funny and entertaining than this pure rubbish! The movie was annoying, and really the only reason why I watched this movie was because Jenkins was in it; not even he could save this movie! Just another movie where they must have, 'bought positive reviews', because if any of them were legitimate, they wouldn't be praising this film, they would be condemning this movie! Seriously, don't waste your time with this soulless soul sucking movie! Read a book, watch something else, or something; spare yourself this crap fest movie!"}, {"id": 11, "text": "There is nothing clear in this movie. No point, no explanation, no sense, no logic. The only reason it deserves at least 1 more star than worst rating is because there are bit good good small details like real life locations and experiences, jokes, funny and odd characters, all which look natural and inspirational. For example I liked the joke about phone and internet and sexual encounters with hot dark girl. But besides those few small micro qualities, movie is waste of time. Nothing to see, discover, conclude. Just some content which is useless, boring, and even looking like some nightmare or insanity because of too much odd behaviors and characters. Camera man did a good job tough, because movie at least looks like a movie and not like amateur vlog from camera's perspective. Also the biggest thing besides trying to determine the purpose of the movie was to determine the sex or gender of main character. So, somewhat good experience YES, movie NO."}, {"id": 12, "text": "No.Oh god please no. This is the most boring I've seen this year. Had 5 what the f is goin on? moment.Watched it for Evan Rachel Wood and all the postive reviews. But no.Ugh."}, {"id": 13, "text": "The worst, very slow, have not enjoyed at all unfortunately"}, {"id": 14, "text": "The negative reviews are completely and honestly accurate and well-earned by this ultra-boring waste of time that attempts to excuse its failings by claiming to be quirky....as if anything quirky becomes something of value. Stay away, at your own peril....even if you are yearning to see a movie, with a big box of buttered popcorn, in these Wuhan-virus restricted times. As my wife had so aptly warned....there is a reason this movie is being shown in these times."}, {"id": 15, "text": "SPOILER ALERT:That's exactly what this film felt like, a bait and switch. I read the brief blips about the plot, even the previous users lengthy review trying to find out if it turned into a love interest in any way because I really did not want to see a romance, I wanted a quirky dark comedy with perhaps some table turning with the con artists... there were times when I was looking forward to a friendship helping with a self actualization... but it went to the romantic and if I wanted a dark ROMANTIC comedy I would've gone to see one but this film was not billed as such. Total bait and switch, I want my money back so that I can see a proper dark comedy... oh wait, there's nothing in the theater anyway. :("}, {"id": 16, "text": "Imagine this: A movie following the exploits and scams of a family of scamming low-lifes... that sounds really interesting right? Well, they somehow managed to take that pretty interesting premise and make basically NOTHING out of it... the movie isn't funny, and it has very little intrigue, and extremely little drama, and very little adventure.... so it basically has nothing that a movie should have. The movie just kind of drags its feet for 1hour30minutes and then at the very end exhales a very agonizing and labored last breath... it's not really worth watching tbh, not even once! I wouldn't recommend it to anyone, unless you're a massive Evan Rachel Wood fan."}, {"id": 17, "text": "Unusual, revealing, funny in an enlightening way. A must see for young women especially."}, {"id": 18, "text": "Con movie about con bums. All movie it posed as drama on abused child and then showed it's true artificial shallow nature. Tone deaf. Cringe and cartoonish character of Old Dolio. Cringe story. Cringe ending. It does have something , but the topic of being born into crime families deserved more then this joke."}, {"id": 19, "text": "I have to admit that I really didn't like this film at all. The first few, quite quirky, scenes depict a family of grifters who make their living scamming and stealing from other folks' post office boxes, but when they meet a young woman on a plane and she concocts a plan to upgrade their antics and prey on the lonely and the housebound then the plot becomes cynical - indeed the entire thing is rather unpleasant. There is the germ of a romance between Evan Rachel Wood and Gina Rodriguez, but that just appears a distraction to the whole, rather odious, thing that couldn't end quickly enough. It's a well enough made film, and the performances competent, but it's frankly just horrible to watch...."}, {"id": 20, "text": "I saw Kajillionaire, starring Evan Rachel Wood-Westworld_tv, Across the Universe; Richard Jenkins-Kong:Skull Island, Step Brothers; Debra Winger-The Ranch_tv, Wonder Woman_tv and Gina Rodriguez-Deepwater Horizon, Jane the Virgin_tv. This is a dark comedy that some people may like and others may not-I'm, sad to say, in the latter category. It has some good actors in it but the story was a little off-some might call quirky. Richard &amp; Debra-you might not recognize her-are parents to Evan, and all 3 are con artists that are living from one con to another, just waiting for their big score to come in. The scammers even tell their landlord that they will pay their rent in installments. There are no familiar emotions shown between the 3, either, even between the parents to each other. They just do their jobs as if they were only work friends. Then, during a con, the family runs into-and recruits-Gina, which makes Evan jealous, at first, but she soon starts having feelings that are anything but jealousy. Each person has their own quirks-and I can handle quirky-but sometimes it was as if it was just being quirky for the point of being quirky. Some things just didn't seem to work for me. It's rated R for language and sexual content-including partial nudity-and has a running time of 1 hour &amp; 46 minutes. It's not one that I would buy on DVD but if you really want to see it, I would wait until it comes to cable tv."}, {"id": 21, "text": "Could have been so much better thanks to the great on-screen performances. But I felt it tried too hard. Couldn't care much for the characters after while. And the pace is so slow it feels it's 1h longer than it actually is... Rarely a good sign! There are much better independent quirky movies than this one. So if you can't see the point after 30 mins, just get up and move on!"}, {"id": 22, "text": "All the lacks of life, from start to end,allas birth to death, covered up in a covered up story so that you could cover up your opinion, full stop...its an engaging film for 40 first minutes, youll get a sort of overview in a quirky family life, wher a neighbour bubble factory leaks pink bubbles into the appartment, why??? youll get the answer if you continue watching after 40 minutes, and these are longdrawn, filled with lame and boring moments of twists than end in a cul-de-sac.so its a nay from the grumpy old man. its a film for the real critiques, not for the thrill seeking ,tearsearching grumpy old man, its a no recommend."}, {"id": 23, "text": "This is a story about selfish parents and how they screwed up their daughter with a cult like existence. The sad daughter is brainwashed into believing their way of life is normal. And, that she doesn't deserve love. Until she's sees her parents show appreciation for another young woman. It causes her to rebel against her them. They get revenge by taking everything she has. She clings on to what she is left with, which is the other woman. Not sure of the point of this movie. I gave it a 4 because there are worse films being released right now."}, {"id": 24, "text": "If you're familiar with Miranda July's films and books you will not be disappointed! It's a truly original film with the perfect cast, it's a work of art. The mess of everything that is 2020 desperately needed this remarkable film!"}, {"id": 25, "text": "This movie was damn near flawless. I can't think of many, if any, plot holes, everyone gets fleshed out, the story is fantastically written, and everything MAKES SENSE! People wrote it as bad because they came in for a comedy, but they never stopped to take it for what it is, so they just judged it off that. It was more of a drama, and dammit, a fantastic one at that. HIGHLY RECOMMENDED."}, {"id": 26, "text": "The film is a little strange and often doesn't make a lot of sense but ,none the less, it is watchable and does draw you in.The characters are OK and just about believable but overall the piece of the film is slow and it lacks a bit of direction.Worth a watch but don't have high expectations."}, {"id": 27, "text": "This movie was not worth watching, to me it was a complete waste of time."}, {"id": 28, "text": "The toxic relationship between the daughter and her parents is depressing. Melanie brings some life and hope into that fortunately. I thought this film was rather more tragic than funny. It left me with a mixed impression."}, {"id": 29, "text": "Evan Rachel Wood's cinematic journey to Westworld has been rich and fruitful. Some may have been impressed by her performance in Across the universe (2007), a tribute to The Beatles, in which she brings to the movie audience a fresh face and voice that charms. Others may notice that she seems to be specializing in the role of a young woman (teenager, in fact) forced into maturity in a single-parent family with a child-adult father. Those who have seen King of California (2007) and The wrestler (2008) know what I mean. Then there is Dolores in Westworld that makes her face recognized around the world - the robot that gradually and agonizingly acquires humanity. One critic points out that her character in Kajillionaire bears a degree of similarity to Dolores, an observation that has some merits.Kajillionaire is written and directed my Miranda July, whose debut Me and you and everyone we know (2005), a gem of an indie, demonstrated the magic that creative talent can bring to the movie screen.In Kajillionaire there is a third, equally crucial contribution making the movie a work of wonder that it is. Gina Rodriguez plays a role here that, while a supporting role, makes Wood's character work. I'll elaborate later.Kajillionaire should be a strong contender for best actress, supporting actress and original screenplay for any movie awards competition. For mainstream awards such as Oscar, best picture would not normally go to a small-budget indie, unfortunately.Kajillionaire's running time is one-and-three-quarter hours. If you don't know anything about this movie, you may be wondering, during the first half-hour, where it is heading. You are privy to the day-to-day existence of a family that may be best described as quirky. Perpetually struggling at the edge of poverty, parents Robert (Richard Jenkins) and Teresa (Debra Winger), together with 26-year old daughter Old Dolio (Wood) work as a well-drilled trio team for petty theft and con. They are the polar opposite to Ocean's Eleven. For this trio, nothing is too small. For a while, the narrative does not seem to go anywhere, with July's sense of offbeat humour carrying the day. Then, enters Melanie (Rodriguez), and the movie brightens and deepens.Through a chance meeting, Melanie is co-opted into the group. She has some experiences with the art of conning and is delighted to have the opportunity to work with the trio of old hands. What she brings, however, is her personality: sunshine cheerfulness, irrepressible enthusiasm, thoughtful tenderness, positive confidence. It is through her that what we have seen hitherto (details I deliberately omit lest it spoils you enjoyment of the ride) in Old Dolio is magnified. While it wouldn't be right to compare her to Dolores, Old Dolio does display an unhealthy lacking in emotions. She does not appear to be even interested in things around her. We now begin to wonder why.Do not let me mislead you into thinking that there is some convoluted history of childhood trauma. That would be way beneath July. It is just a case of neglecting and irresponsible parenthood, to such an extent that Melanie quickly senses it and tells Old Dolio plainly that her parents are monsters to whom she is addicted.Kajillionaire is a cinematic journey that makes you feel absurd, hilarious, irritated, despair, ridiculous, heart-broken, warmly touched. It does all that to you. In the end, you leave with a smile on your face, believing that despite all that, there is still hope for humanity."}, {"id": 30, "text": "Oh wow. If you want an indictment of the naval gazing and fragility of generation Y, affectation, blame of others for every problem, and forced, unbearably saccharine and shallow quirkiness -- this film is for you.Artifical and fake quirkiness. Artiical and intentinal bohemianism typcified by gentntrifiers"}, {"id": 31, "text": "Its a good movie if youre looking for a strange story thatll at least make you uncomfortable with the affront of emotion on screen and in the story. its very, very much not a film for everyone, especially those that are after the more hollywood movie experience, but if you like artistic movies, are lgbt, or had emotionally neglectful parents, you may find this movie to be pretty darn good, if not cathartic."}, {"id": 32, "text": "Film like this one is why I stopped watching 95% of the movies that are being released nowadays, being from Hollywood or Independent."}, {"id": 33, "text": "The movie is really as bleak as the lowlife penny pinching beggars it portrays. To call their pathetic schemes 'cons' is an insult to cons. The actors are good, Gina Rodriguez character actually has some life and bounce to her but there's nothing here unless you are entertained by pathetic people being as pathetic as possible. I don't mind that it's basically a vehicle for the message any love is good love especially if you've been deprived of it but the script is just terrible, the pace even worse. I can't really think of anything good to say about it. See it if you must but I'm telling you it's a clunker."}, {"id": 34, "text": "The ONLY reason this 'film' got 2-Stars was for the LBH (Long Blonde Hair)! These characters are so flat that the guys who level pool tables professionally, watch this film for 'inspiration'. Anyone looking for as job in the real world will find this film a treasure trove of tips on how NOT to do it. I may have been overly generous in stating that the film's script took 5 minutes to write; but thankfully, I'm older, so it will take even less time to forget it. Bottom Line: Do not waste your valuable time watching this -- as watching paint dry is more exciting."}, {"id": 35, "text": "There is no nice way to say this; the world is full of idiots that won't get this film (nor any of the great works of art for that matter).I'm not going to discuss the film other than to say I was surprised by low ratings and glad reviews didn't deter me from seeing this quirky poetic masterpiece, I have not seen anything like it since Charlie Kaufmans glory days (Eternal Sunshine, Adaptation etc). While those are clever little creations of quirk as well, they also work on many different (intelligence) levels, this one however, craves your full attention for the entire time, every scene, line and expression tweaks the story to our and characters continuous surprise. I get some of the criticism, the narrative loses its edge towards the end, but you have to see it for what it is, a declaration of love to the universe, the people in it and snack bags that go pop. I definitely hope to see more from Miranda July and hope she will continue to ace herself both in life and on the big screen. Thank you!"}, {"id": 36, "text": "Maybe its me being old just not understanding how this is an art. Slow, slow slow and most important was last minute scene ..... Avoid and save 2h of your life."}, {"id": 37, "text": "Every time I watch a movie and it turns out to be what I believe is the absolute worst I have ever seen I think...'oh well it was a waste of time and horrible but at least I will never see anything close to this bad again'...then something like this comes along.Very slow moving. Waited for something exciting to happen and it didn't. Seemed like little chunks of thoughts that needed to be tied together. Very unlikely situations that could not happen and cannot be explained. The whole movie didn't make a lot of sense. Nothing deep and mysterious, no hidden meaning so don't look for one."}, {"id": 38, "text": "Decent start and interesting story until the second half or so where it goes down hill. The directing is bad in quite a lot of parts including the first half, but the story just goes to complete wack. Please storyboard your movies. Acting is fine, it's just the directing isn't quite there and with a story that isn't mastered.This movie isn't entertainment. And with poor directing, etc. it is impossible to tell the story with all the hardcore messages you hoped to convey."}, {"id": 39, "text": "Parents and their dysfunctional daughter (Evan Rachel Wood ) pull minor scams that appear to be more work than getting a job. They barely make ends meets as grifters and mudlarks. During a job they meet Gina Rodriguez who loved Ocean's 11 and joins the group. The parents seem to like her more than their own daughter which makes things worse.Not sure what the whole point was of the film. Sure it was different, but so was Pink Flamingos and many folks didn't find it entertaining. It was slow and pathetic. I expected some twist or something different to happen in the dark, but it just never does.Guide: F-word. Film nudity."}, {"id": 40, "text": "I read all the negative reviews but looking at the cast and director, I knew it had to have some merit. Having lived in L.A. for a while back in the 80s, I know that there really are people like the characters in this movie there. I met a few of them. They mean no harm, they just have a different way of living and a different worldview. Some of them are actually really good people who just have some difficulty with contemporary America's surveillance capitalism and do not want to participate. Can you blame them? I don't."}, {"id": 41, "text": "Dunno how to feel bout this movie. just felt lost."}, {"id": 42, "text": "Literally nothing happens in this movie, but the actors do a great job showing emotions, if that is sufficient enough for you to watch an entire movie. The plot is complete nonsense."}, {"id": 43, "text": "In summary this is a case of a movie trying to be too many things and failing at all of them. Comedy, Heist Film, Romance, Observation on Life &amp; Death ...... nothing really worked in this movie. The interjection of Ginas character was unnatural and I felt the movie went down hill from that point."}, {"id": 44, "text": "On this occasion, La Salle at SF Chronicle is dead right, Brody at New Yorker is dead wrong.July has an interesting premise, but her screenplay remains too internal to her, and she fails the simple test of engaging the viewer.After one too many twee LA earth tremors, it gets better towards the end, before ruining itself completely with a not-credible hookup.Stuff that July seems to think is insightful or revealing is just excruciating and boring. Mow the lawn, write an email, have a nap, instead."}, {"id": 45, "text": "A beautiful mess of emotions and storytelling that pierces the heart in its way, KAJILLIONAIRE was all of that and some more. in this wacky and frankly out of sync delivery one tend to lose track of time and reality and just enjoy what's on display, this film offers something quite rare, the ability to see yourself and project your own feeling into it, and that is just amazing, it reflects so many aspects of life no matter what you do or where you live, it's quite universal. I believe that no medium except film can offer such a specific feeling or a style of life, I think this film encapsulates the never ending movie magic that leaves you unbelievably fulfilled."}, {"id": 46, "text": "This movie is pure garbage. Don't waste your time. You got better things to do and infinitely better movies to watch."}, {"id": 47, "text": "This movie is unbelievably bad. Please don't waste your time watching it. There are very few movies that I regret wasting the time I spent watching them. This is one of those."}, {"id": 48, "text": "Just run away from this movie. It's a waste of time!"}, {"id": 49, "text": "It looked like the main actors owed the director a favour by going through the motions. Wood is one of my favourite actresses but is totally miscast. A one joke film.The only surprise and relief was right at the end when the cinema lights came on."}, {"id": 50, "text": "It's like those hippie hug a tree draw random shapes , add a blue dot by the corner then get a few people tripping on shrooms to make sophisticated comments about your masterpiece.This movie is that picture. It's 150mins of pure nonsense that keeps you thinking maybe the next thing will join the dots and make sense out of this mess Then when you know it, it gone and the point was nonsense"}, {"id": 51, "text": "Com-mon the movie drags on-and-on and doesn't deliver. Waste of time. I'd rather go to a dentist than keep watching, I gave it a chance, but proved worthless. Actors were great but just another grifter movie with no product. Kept waiting for something to move me but was nothing there. Expected more got less. High ratings should have been saved for a poor third-world movie. After three/fourths of the movie, with no more drama, got sick and quit. Tried to compare other grifter films with no success; that tried to include comedy like this one that lacked no authenticity... this movie fails. This movie is stupid, boring, and lacks common sense. Perhaps a four year-old would enjoy it. Waste of time."}, {"id": 52, "text": "I'm not sure what's more cringey, the filmmakers of this snot rag of a movie or the story itself. It's almost as if they tried to cram in as many cringey oddities as they could, just because. If the goal with this film is to weird an audience out, mission accomplished."}, {"id": 53, "text": "It had promise, but as with many modern movies, it's non stop mumbling and complaining. Panic whispering. There was also a loud drumming over most of the important plot points so you definitely couldn't here what was happening.It would be better if it was just Evan Rachel Wood (being determined) and the film was edited together properly."}, {"id": 54, "text": "It's very hard to sit through. And I liked her other movies. Feel really sad in the end, mainly because the $6 I had paid"}, {"id": 55, "text": "I have to admit that I checked out the girl after I watched this and she is more attractive here than in real life for whatever reason. regardless, she is thin, has a pleasing face and has feminine hair in this film. That is fantastic. She is a mistrusting girl raised by odd parents and she has no idea about love, life or skills beyond the narrow ones her parents decided to teach her. Then another character enters the film... So watch it, but unfortunately no graphic sex scenes..."}, {"id": 56, "text": "I really enjoyed this movie. I don't usually write reviews but I had to for this unusual but quite interesting movie. It is different from the everyday predictable films. Without giving away too much about the movie, there were laughs, moving moments and surprising parts. Apart from the end, I found it flawless with great acting. I highly recommend it for those who are fed up with predictable movies"}, {"id": 57, "text": "To Be honest, This Movie Is Most Certainly not for Everybody, but in my Opinion, it's Very Enjoyable to watch and some of the Symbology was Beautiful to Watch.It is very very Strange at Times and also quite depressing as it Dives into Topics Many People Face.It made me laugh 3 times Loudly but this is definitely not a comedy but it does have Sporadic Comedic Elements within it. Overall, I Enjoyed It."}, {"id": 58, "text": "This movie is powerful and explores many universal themes that will leave you thinking. From family dynamics, to finding yourself, connection, confronting mortality, learning to live, to what people are willing to do to make a living. Most people are a product of their environment but we still have choice if we choose to see. Sometimes someone sees something in us that allows us to rediscover who we are. The characters draw you in, the take on a dysfunctional family is interesting and I think everyone will take away many personal insights if they give this their undivided attention. It's not a comedy per say although I did laugh at moments. Just come in without expectations and enjoy the moment. It's a rollercoaster of emotions. From pain to joy to sadness to hurt and to beauty. A bit of a metaphor for life really. A beautiful movie."}, {"id": 59, "text": "It is more of a satire dark comedy. The acting of Evan Rachel wood never disappoints. I saw the bad reviews and it didn't equate to the worth of the movie at all. Watch for yourself, the theme of loneliness, family, and longing are huge here. I found it funny and quite odd at times but that made me more INTRIGUED!!! If you are feeling low this will bring you high, because it makes you feel like you aren't alone. PLEASE WATCH and form your own opinion!"}, {"id": 60, "text": "Formed fully into the huge stupid moral degrading ending of lesbianism. This movie was so hard to watch. I love you all though and hope you all have a great day and every day forward!"}, {"id": 61, "text": "Fleabag mode: This is a love story. Two girls kissing"}, {"id": 62, "text": "I am amazed it even got released.Good actors feeling the pinch so accepting what they thought was an arty script, but it wasn't.And the lesbian love..... a last minute thought in an attempt to make it interesting.It was not a comedy either, just a joke."}, {"id": 63, "text": "No, obviously, I wasn't raised by a thugs, but psychopaths. And I can imagine my parents acting like this, no mercy, no dialog, no doubts. This movie, as I understood it, trying to show how difficult to cure scars that such kind of treatment leave, how devastating could be parents indifference in a forming of personality and how painful to escape from that awful relationships."}, {"id": 64, "text": "I was hooked from the beginning. Thanks for a wonderful 2 hours. A film that I will never forget. :)"}, {"id": 65, "text": "Definitely not a traditional film, rather an amazing melting pot of subplots. Rarely will you find a show that, can carry so many strings, and leave you sitting pondering before you leave the theater."}, {"id": 66, "text": "Got half way and couldn't do it anymore. Painful to watch! Trailer seemed funny but it was just dumb!!"}, {"id": 67, "text": "Horrible movie! Comedy? Drama? Spoof? Wasn't sure where this train wreck was headed. Waste of a cast and film, for that matter. The people that raved about this at Sundance must have been on drugs or fell asleep during the movie and were too embarrassed to say they did so then claimed the Movie was terrific. Thumbs way down!"}, {"id": 68, "text": "This movie immediately became one of my favorite films of all time. It's pure poetry from Miranda Joy and the cast, especially the two leads Evan Rachel Wood and Gina Rodriguez, who have great chemistry. Starkly deprived of affection and social connection, Wood has grown up in service to emotionally disturbed narcissistic parents living on the fringe and exploiting her for their tenuous survival. Wood embodies both trauma and resiliency, and we get to watch her awakening as she grows aware of her deprivation while developing a chance yet fateful connection with Rodriguez, who becomes witness to the family dysfunction. By turns fascinated, horrified, flirtatiously sexy, and resolute, Rodriguez reaches out of her own lonely disappointments to show Wood the first empathy she has ever known."}, {"id": 69, "text": "For some reason I just couldn't look away...but hey, it was a Saturday night and there was nothing else on and I didn't have to pay the $19 rental price it was going for on a lot of sites."}, {"id": 70, "text": "I tried! Really tried! But had to tap out at 50 minutes!"}, {"id": 71, "text": "Just like Friendsgiving (above), I came into Kajillionaire knowing virtually nothing, other than a 3/4 review from RogerEbert.com. But honestly, the not knowing is what made this film so fantastic. If I could ever describe a film as intelligent and quirky, without rolling my eyes, this would be it. The movie is weird, it's pretty indie, and it tries a lot of new things. This reminds me of the Florida Film Festival, because of how damn unique the whole film is. It's beautiful, and it's nearly impossible to describe, but I can give it a try. Old Dolio (yes, that is actually the main characters name) is an awkward, out of place 20-something living with her stingy, thieving parents. They do whatever they can to scam the people around them, while trying to make ends meet. When Old Dolio meets Melanie along on a heist (I use quotations around it because they aren't really heists, more on that later), she begins to realize that she doesn't belong with her parents, and that she might be living a lie. Mixed within the awkwardness of situations like waiting around an old man's house for him to die so the family can take his checking account hostage is a mellow, deeply thoughtful love story. The relationship between Old Dolio and Melanie is handled so unbelievably well, that it is genuinely one of the greatest romance arcs in recent memory. Something about the quirkiness about the film makes it so much more enjoyable, and it almost feels like the director weaponized the art of unsettling behaviors to make something darkly comedic, thoughtful, invoking, and beautiful. It's fantastic."}, {"id": 72, "text": "I don't know any of the actors in this movie, female lead's performance was exceptionally good. On the other hand the directing and storytelling need lots of work in order to have a better interpretation. Lots of moments were weird, or the message might be hidden too deep.Okay I realize I can't write this without spoilers, so here it comes. The ending was frustrating, the parents knew the money was hidden somewhere and they wanted to have it, but without being too obvious. They probably felt a little sorry for their daughter not being able to have a proper childhood, yeah that doesn't work. So correction *They DON'T feel sorry at all, instead they used the last little bit of trust that the daughter had in them as real parents and stole that money.The first frustrating thing is they didn't use force or wreck the place, instead they clean sweeped it and took everything with them and let their baby daughter have a nice long beautiful sleep until morning to find out. It's guaranteed they'll find the money, and if not the stuff they took would still be worth enough to pay the rent. They probably felt sorry, but as thieves all their lives they didn't want to give without getting any in return, even if it's their own blood. So by giving their daughter a nice birthday, and a peaceful set of mind things are finally going to change, they were actually investing a night of their time so in return they could get on with their usual business.The second thing is the kiss as the end. I never thought the story would lead to any kind of companionship, although there were awkward signs earlier. Unless, it's a way for her to achieve the breast crawling mentioned in the film, finally having someone to lean on. This is the only explanation I can think of.I wouldn't watch it again, it's depressing and filled with negativity. It does make on e think about the importance of having a good childhood and a loving family around when times are hard."}, {"id": 73, "text": "This film blows my mind. So inspiring, touching, absurd and especially so so original. Really love everything about this masterpiece."}, {"id": 74, "text": "Kajillionaire is not cemented as one of my favorite films of all time."}, {"id": 75, "text": "The negative reviews are what you should listen to, there was no actual moments of laughter but numerous spots where I went what the hell am I watching here!? So many small pointless scenes and all led really nowhere."}, {"id": 76, "text": "This movie is not a comedy, i have been reading all the other reviews complaining of how this is a comedy, it is not, and if you are not familiar with miranda july's work and twisted sense of humour, dont judge this beautiful movie under commercial, simplistic labels. In fact i kind of wanted to cry the whole movie."}, {"id": 77, "text": "Don't read any reviews. This is fresh and totally successful, and everyone is going to want to give you hints. Just let the show do it for you. I will only tell you this: it's wonderful."}, {"id": 78, "text": "I really like Miranda July. I like her not only in dress of films maker but also for the person she is, and this film it's very good because it is full of feelings and somehow let us to reconnet for one hour with ours. I don't want to take this review up some more, I think also that this film have a lot of different point of view, different for everyone maybe. I really recommend this film, don't listen to those negative review, if you're here you will like this film and you know. I know, you know and everyone know!"}, {"id": 79, "text": "After a weird beginning that lets you wondering what's next, the story develops in original and unexplored waysit is so refreshing to be able to watch films made by women, I am a 64 years old male, bored of all the same movies everytime, although late in my life, it is great to finally wath movies made by women, they are different to what we are used to, an gives the industry a much needed fresh airI am sure that most negative reviews come from macho militant men, and are mainly based on political positions, and biased prejudictions about women"}, {"id": 80, "text": "Quirky movie. Evan Rachel Wood's performance made it better than it would've been otherwise."}, {"id": 81, "text": "Just what the f? I didnt understand anything. Still liked it!"}, {"id": 82, "text": "Ignore the negate reviews on here. Watch the film and form your own opinion!Personally, I loved it. I really enjoyed the awkward dynamic between the characters. The art direction is nice, with some funky outfits here and there. Very nicely shot. Some creative use of sound and visuals. I thought the ending fitted well. Sad I missed this in theatres as I was busy, but I'll have to check out more of this Director's work!"}, {"id": 83, "text": "I only knew of Miranda July by following her on Instagram, and this is the first feature film of hers I've seen, and I can't wait to see the next. I figured Kajillionaire would be insightful, unique and humorous ... and it was. Miranda is a pure artist - in that she is true to her creative vision; one that is without one iota of pretence. The film probably isn't her best effort, but compared to a majority of films - it's a masterpiece; but then again you shouldn't compare Miranda's films to others, as it is a wonderfully unique experience that only the wonderfully unique Miranda July could have created. Thankfully, Kajillionaire is not a mainstream Hollywood Blockbuster filled with cgi that spoon feeds you everything. Kajillionaire is a thought provoking, unique vision brimming with humanity."}, {"id": 84, "text": "Proud of subsisting with their entire existence through skimming and petty theft, Robert and Theresa indoctrinate Old Dolio with unorthodox ideas (totally disavowing capitalistic and consumerist impulses and obsessions) and treat her as a partner-in-crime rather than their daughter. Thus, Old Dolio is a kooky cookie, sporting a head of straight, long hair like her mother, she seems to be eternally at odds with her surroundings, there is always a question mark hanging aloft her lanky, stiff demeanor. She is physically tense since a phobia of human contact has gelled into a thick carapace. As Old Dolio, Wood finally finds a role so singularly different from previous ones and attempts a lower, more gravelly register, her expression also melds open-faced puzzlement with an air of infantile inscrutability, it is an affectation that befits the immanent awkwardness emanated from an out-and-out oddball.read the full review on my blog: cinema omnivore, thanks"}, {"id": 85, "text": "A little lesbian love story disguised as a thriller...kinda unique and fun... None too cheecky or dramatic, staying true to its characters, an out of oridnary story of hobo thieves yet all felt kinda down to earth, flowing like the ordinary matters in every day life, business is business, no too emotional or climax of thrilling heroism or resolution to suspenses, like a flower of love blossomed at the corner of every day road, none too fancy but kinda nice and enjoyable..."}, {"id": 86, "text": "Then you should watch it.I enjoyed the acting quite a bit. You can say that most of the rating is because of how good it is. If you are someone who can't be entertained by acting alone, this may not be for you (not that its bad if you cant). I did enjoy the story, however it was slow moving. The characters are not overly likeable, which can be another downfall, but that didnt bother me either.Its a bit artsy, a bit long, and very dry. With that said, wicked performances and great chemistry between two perticular people made this enjoyable."}, {"id": 87, "text": "What a wonderful place Miranda July's brain is. I think we are so lucky she is able to share pieces of it with us. I am a fan of July's other work as well, and her latest movie Kajillionaire is probably my favorite of her films so far. Some of the characters' names alone are hilarious. I was able to catch a screening of it at Sundance.Kajillionaire tells the story of a girl and her parents who need to hustle and con people just to get by. Her parents are very odd and jaded by their past lives and the people and government who took part in them. She has grown up in this life of getting by just based on what she is able to steal or find to sell for money. She has learned to mistrust others, and she has never seen her parents showing anyone preference or affection--even her. She is curious about being held, but that makes her feel weak and ashamed. To me, Kajillionaire is one of those movies that made me feel alive. Learning how to love and be loved in return is just beautiful. I found myself laughing out loud one minute, and the next minute I felt quiet or sad. You will be grateful of every good thing you have in your life; not everyone is as fortunate to have a place to live that doesn't leak or even simply someone to hug them."}, {"id": 88, "text": "A sure fire way to know a movie is bad? When you keep checking your watch, doing the math for when the movie will end.Richard Jenkins? Debra Winger? Are you guys in a severe financial crunch and needed some money fast? Did you lose a bet and this was your punishment?As you might have guessed, I found this movie painful to watch. It started out well enough, with some big names portraying a very eccentric family of small-time con artists. But that was it. It all just went slowly downhill after that, grinding slower and slower. At one point, I believe time stood still yet the movie kept going and going, despite my fervent wishes for it to end.Almost left several times, but I stuck it out to see how it would wrap up. It wasn't worth the wait. I wish I indeed had left early. I didn't miss anything.Nary a smile to be seen in the theater as we all somberly filed out. Just a lot of grumbling and people shaking their heads dejectedly."}, {"id": 89, "text": "I was really surprised that I came out of this film really loving it. The trailers didn't do a whole lot to impress me but I checked it out anyway and it was worth it. This has some of the best writing and lead performances of the year although not my favorite. Miranda July definitely knows what she is doing here. Her directing and writing feel so personal and intimate and she is able to craft one of the most unique stories of the year. There were a couple of slow bits but that didn't bug me too much but overall, the story was fascinating and engaging. Mostly because the characters here are very well developed and performed. Evan Rachel Wood and Gina Rodriguez were amazing here and I thought their characters were great. The parents played by Richard Jenkins and Debra Winger were also great too. Each has their own motivations and personality that is separate from everyone else and unique. The film was also very well shot and edited and the humor mostly hits. For a comedy, I didn't get a ton of laughs out of it but there were a lot times where I did chuckle. Even though some of the comedy didn't hit, it succeeded very well at all of its emotional hits. Go check this out when you get the chance because it's not getting enough attention."}, {"id": 90, "text": "Everyone at some point in their life feels that they aren't part of a normal family, whether it be as a result of how you were raised or growing apart as life goes on. I doubt anyone out there would be able to claim being part of such an oddball family as in Miranda July's Kajillionaire, a quirky crime comedy that I typically love getting stuck into.Old Dolio Dyne's (Evan Rachel Wood) life is turned upside down when her parents (Richard Jenkins and Debra Winger) invite outsider, Melanie (Gina Rodriguez), to join them on a major heist they're planning.Kajillionaire opens in such intriguing fashion and maintains a sense of obscurity throughout that I certainly didn't fully connect with but found myself drawn to the deft character work from Miranda July and the film being rather striking visually. July's writing really does capture the desperation of this family and how the constant hustling and new arrival has driven a wedge right through the unnatural bond these parents share with their daughter, the comedy subtle in its execution and suiting the film to a tee.The performances in Kajillionaire are brilliantly nuanced and not so in your face with the obscurity to put people off. They are a weird bunch but the performances from Richard Jenkins and Debra Winger as the parents are really good as their grip on the control of their daughter's life slips away. It's Evan Rachel Wood that really stands out here though, the introduction of Melanie into her life throwing her into an existential crisis that Wood throws herself into fabulously, heartbreaking as it is captivating.Miranda July's Kajillionaire may not make a lot of noise to grab your attention but it's a film that deserves to be sought out, July's filmmaking and the performances leading it to become one of my favourites of the year."}, {"id": 91, "text": "This indie drama about a destitute family of petty thieves living in squalor in Los Angeles might seem predictable at first but is actually a slow-burn take on the steep pitfalls of toxic parenting and co-dependency for young adults. It is a blistering depiction of a family living on the edges of society, holding on by a thread and stubbornly committed to its corrupt ways. By day, they are scrounging and stealing whatever they can. By night, they live together in a dilapidated back office under the roof of a forgiving landlord who meekly enforces the collection of the rent.It's an acting tour de force with Evan Rachel Wood giving a subtly potent performance as a young woman who is starved for any affection or emotional nourishment, but who hardly ever questions the family orthodoxy. Jenkins and Winger are riveting as the scheming parents who, for we all know, never took the straight and narrow but who have no qualms about employing their child in their criminal versatility. Although the parents in this film are dirt poor, their undying selfishness is a trait that makes them so Boomer-esque, for lack of a better word. It is not too early in the least to have a film tackle the parenting style of a generation that has become known for its solopsism. Gina Rodriguez is actually quite good as the third party accomplice that this sketchy family chances to come across. She is the first character I can think of who goes from annoying to sexy in the history of cinema. Wood's role as the helpless adult child in the family is compelling. She has known nothing but the life of co-dependency and petty crime at her parents' behest until she sees the first check made out in her name, her first taste of independence, a dwelling without her parents and a new female friend with a shapely body. It becomes the discovery of a lifetime for someone raised by parasites.The film's quirky feel belies the heart-wrenching material in the story of a young woman seeking to heal from the harmful legacy of toxic parents and find her own way in the world. The immense truths it digs into strike a chord for anyone who knows what a cancer that manipulative parents can be. I've waited a long time for a film like this and here it is. Recommended to the highest degree- even to those who cannot relate to this kind of upbringing."}, {"id": 92, "text": "We can only ever be how we are.Miranda July has won me over with her writing and directing. I haven't seen any of her other works but just from this movie I can tell she's someone I should look out for in the future. As a crime-comedy, this works on all levels. Through it all I was entertained. I found the comedy refreshing and worked around human emotion rather than making dumb jokes. What really invested me is the drama. Coming out of the theater I felt like I went through an existential crisis. Starting around the second act, at a certain moment in fact, things take a turn. Not a twist in the story but rather the tone and theme. I enjoyed the first act but wanted a little more out of it. Initially I thought the film would follow this plot with some drama weaved in there somehow. Well that drama came in the most unexpected way where it felt like a kick in the gut. From that moment on I hoped the film wouldn't end.As a filmmaker, July has a distinct style. She could be categorized under a similar style as Wes Anderson and Taika Waititi. The wide shots showing the uniqueness of the characters early on tell the audience what they're getting into. The camera work in general is well done. There's a scene that everyone will take away after viewing where the cinematography, writing, and directing come hand-in-hand. The way it's done could've been told in a normal fashion, but July makes an awesome decision. I found myself just gawking at the screen.Through the character of Old Dolio, life lessons are told. Evan Rachel Wood has an amazing transformative performance. Had I not known previously that she is the lead, I would've never guessed. There's something about the film that felt off and it took me a few days to figure it out. Throughout the film, Old Dolio is discovering truths about life. They're truths that we all know about, though, so there's a bit of a connection issue with her character and script. Not that you can't connect with her character because there are some really emotional gripping scenes, but since you know more about the real world than her it's a little more difficult to feel exactly what she's feeling. The character that we can (hopefully) relate to most is Gina Rodriguez. One of her better performances since Annihilation and Jane the Virgin, she brings a lot more to the film than expected. What first seems like a cameo from her actually turns out to be a key role. Richard Jenkins always does a great job and that's no exception here. I found him to be comical yet extremely frustrating. And finally Debra Winger has a similar performance to Jenkins. They match each other well as a duo and she has a powerful scene with Evan Rachel Wood.Much like The Favourite and Phantom Thread, Kajillionaire becomes increasingly the intoxicating every day after watching. The great score by Emile Moserri has been on repeat in my head and on Spotify. Scenes have played out when I close my eyes. What started as really good movie has become one of the best of the year for me. I urge you to see Kajillionaire. It won't be everyone's cup of tea but it's a great example of filmmaking and acting."}, {"id": 93, "text": "There's no getting away from it: Kajillionaire is an odd film. At first, it seems like a movie made for the sake of being weird, but as its story unfolds, you begin to see the method to Miranda July's madness, with an ultimately touching, bittersweet tale of personal independence making for a memorable watch.First things first, if you're not party to a little bit of eccentricity and dry humour, you might find Kajillionaire rather inaccessible at first. Undeniably, the film struggles to find its feet in an eye-catching but admittedly dull opening act, as we follow the strange day-to-day exploits of a family of scam artists.Evan Rachel Wood, Debra Winger and Richard Jenkins are fantastic in those roles, but there's very little to their characters early on, and it takes a while for Kajillionaire to really grab you with any real dramatic depth.Fortunately, things take a turn for the better with the arrival of Gina Rodriguez, who brings a little bit of sense to an otherwise totally bizarre world. The film retains its offbeat sense of humour, but to have that grounded perspective with Rodriguez's excellent performance really helps you to find an in with this family, and the story begins to work off that really nicely.Unfolding in thoroughly engaging fashion from then on, Kajillionaire deals with a range of interesting and sobering themes including poverty, neglect, abuse, all with a tinge of odd, dark humour to make it that little bit easier to stomach. Admittedly, the film's stranger side does occasionally undermine some of its more serious ideas, but without that charisma, it would likely have been a far less interesting watch.Kajillionaire really comes good in its final act, however, where it begins to push the boat in terms of weirdness, but also in real, challenging drama. The run to the finish here features some of the movie's oddest moments, but also some of its most affecting and heart-wrenching ones, as we follow Evan Rachel Wood as she begins to discover the world for herself - away from her parents' unique worldview.Along with Rodriguez, Wood is really fantastic and brings an impressive dramatic dynamic to a film that can occasionally feel a little emotionally opaque. Again, its themes aren't quite as hard-hitting because of its oddity, but there is real, affecting drama in the film's final stages, and that really caps it off in impressive fashion.Overall, I liked Kajillionaire. It's not a perfect film, and perhaps doesn't manage to use its capacity for eccentricity to full effect, but there's still a worthy story to be heard here. With great performances, interesting themes and unique humour, it's a memorable, if not undeniably odd watch."}, {"id": 94, "text": "Personally I think that there are women out there, millionaire &amp; billionaire women , who made the money through no effort of theirs like Jeff Bezos' ex-wife or Roman Abramovich's ex-wife, driving around the country, finding random women on the streets and simply handing them millions to make movies and ruin the lives of you and me, the average moviegoer.I am guessing that this movies director, a know-nothing by the name of Miranda July was having a casual stroll in LA right after her Pilates classes when a random expensive Van stopped right next to her. Some lady in the Van decked up from top to bottom simply handed her 10 million to make a movie.So Miranda July then rushed off to Starbucks to have her favourite Pumpkin latte. After she was done she came home and googled 'Best video camera for making a movie' that she then bought off Amazon. She then started searching online for vegan writers. Whether they could write was irrelevant, what was absolutely necessary was that they were vegan.After Miranda July had bought a camera and finalized her vegan writer she decided to start making a movie. But before that she also had to google, ' How to turn on a video camera'.Kajillionaire starts off well even for a Jon Snow know-nothing like Miranda July and for a moment I got some 'Little Miss Sunshine' vibes. Then nothing happens. Literally nothing happens for 1 hour &amp; 45 minutes. Its like someone forgot to tell Miranda July that she has to do stuff with the camera and that the camera wont do it on its own.If you had to summarize Kajillionaire in 2 lines it would be as follows, Small time crook couple train their daughter to be a con artist and then meet another girl who wants to get in the pants of the first girl. The End.I have no idea who Evan Rachel Wood is but she cannot act or maybe she was in no way competent enough to portray the character demanded of her. If I had to describe her acting I would say that she is as good as Tom Hanks in Forrest Gump if Forrest Gump was played by Arnold Schwarzenegger.I watch a lot of movies, a lot of the low-budget kind, a lot of the indie kind but I can honestly say that this is by far one of the worst movies I have watched in 2020.I think we are going through this phase where very incompetent and talentless female directors now have the resources to make movies and even though the final product is no less an embarrassment to movie-making and the senses just because its a movie made by a female ,millions of other women just assume that this so called movie is the greatest thing that ever happened to womankind and they fake prop up the movie with their fake reviews and fake ratings.Dreadful, horrendous waste of film roll that should not even be called a movie."}, {"id": 95, "text": "IN BRIEF: This story about some con artists has too many leaps of logic, despite its fine cast and some compelling odd moments.JIM'S REVIEW: (MILDLY RECOMMENDED) As the saying goes, There's a sucker born every minute. In America, it seems there's one born every second these days and writer/director Miranda July seems to agree with my assessment in her latest film Kajillionaire. This movie about a family of grifters living the lowest rung of poverty is her subject and she wants moviegoers to be taken in by their captivating and illegal survival skills. Many critics were; I wasn't, although I did enjoy the oddity factor.Ms. July has a unique vision of society and creates a bizarre world of characters, none of which seem based on reality. We meet another dysfunctional family, the Dyne clan: scheming patriarch Robert (Richard Jenkins), neglectful mother Theresa (Debra Winger), and their vulnerable daughter named Old Dolio (Evan Rachel Wood) as they con their way to success. They live in a rented office space next to a bubble making company. On one of their many scams, they meet and adopt Melanie (Gina Rodriguez) into the criminal fold and the family dynamics are permanently altered.As the hustles grow bigger and more complicated, the movie loses all credibility. Their rate of success seems unstoppable and untenable. One wonders just how they can physically get by to finance their cons and live in their squalor. One also needs to leave logic at the door when seeing the 30+ year old Ms. Woods playing a young twenty-something, although she nearly puts this off due to her charms and acting skills. Ms. Wood creates a lonely wild child who yearns for the nurturing human touch and accomplishes that feat rather well.In fact, Ms. July's highly capable cast is the film's saving grace. They all bring a dark comic edge to the story, especially Ms. Wood and Ms. Rodriguez. Furthermore, the film is enhanced by Ms. July's strong visual imagery that provides the quirkiness of an early Charlie Kauffman. Some fine surreal moments (pink cotton-candy suds foaming down walls, a bathroom that darkens into a black hole in outer space, earthquake tremors that appear to mostly affect the Dyne clan). Yet where Ms. July fails is mostly in her narrative which has weak legs and collapses from the sheer weight of its storytelling. No backstory is offered to establish the characters' behaviors and lifestyle. The many lapses of reality from a storytelling perspective grow contrived and are inconsistent in tone.Kajillionaire is entertaining but incredulous. It ends up conning itself. (GRADE: C+)"}, {"id": 96, "text": "Kajillionaire (2020 release; 106 min.) brings the story of the Dyne family: Robert, Theresa and their 20-something yr. old daughter Old Dolio. As the movie opens, we are at a Los Angeles US Postal Office and Old Dolio is stealing a package from the post office. Robert is delighted that it contains an expensive looking tie. The three of them then set their sights on their next scamming opportunity, with again Old Dolio having to do all of the work. Back at their apartment (a room that is part of the Bubbles, Inc. manufacturing company), their landlord is demanding payment on their lease, now 3 months overdue. Robert needs to come up with an even grander scamming plan, and quickly... At this point we are 10 min. into the movie but to tell you more of the plot would spoil your viewing experience, you'll just have to see for yourself how it all plays out.Couple of comments: this is the latest from indie writer-director Miranda July (The Future). Here she brings us an original and quirky look at a dysfunctional family that survives (?) by scamming left and right. Some people wanna be kajillionaires, I just want to skim, says Robert. The early part of the movie focuses on their scamming ways, but soon you feel there is more at work, namely the stunted emotional development of the daughter (weirdly named Old Dolio). She doesn't have a notion of love or affection, and her universe is coming under attack altogether when Robert and Theresa welcome a stranger into their world. This film is billed as a comedy-drama, but that is really not reflective of this very indie and very off-center movie. Evan Rachel Wood is wonderful as Old Dolio (purposefully lowering her voice), and Richard Jenkins is his usual weird-yet-loveable. But the big surprise is the Theresa character. I almost fell out of my chair when the end titles started rolling and it is revealed that this role is played by none other than Debra Winger, yes, THE Debra Winger, utterly and completely unrecognizable. Wow, just wow.Kajillionaire premiered to good buzz at this year's Sundance Film Festival. It now feels like January 2020 (hence, pre-coronavirus) might as well be a decade ago. After multiple delays, the film finally opened this weekend in select theaters, including at my local art-house theater here in Cincinnati, fully adhering to all COVID-19 protocols. Not that it mattered, as the Friday early evening screening where I saw this at was attended by exactly 3 people (including myself). All that aside, if you are in the mood for something original and quirky (to say the least), I'd readily suggest you check this out, be it in the theater, on VOD, or eventually on DVD/Blu-ray."}, {"id": 97, "text": "Kajillionaire shows adventurously how poverty sucks especially living in a big city with aging parents without a nest egg whose personality quirks and sense of values seem to span the entire Autistism spectrum with the father and mother exhibiting cult like tendencies as wacky parents with odd habits and priorities as they try to make rent living in a business building.I loved the originality and unique way it mixed scam artist home life with a world that seemed to make reality a nightmare in itself just to survive.Some of the scams are so hilariously thought up and executed as if everyone had ADHD, obsessive compulsive traits and autism as the driving force for planning and stick-to-it-ness that left me laughing quite a bit, and then amazed the convoluted scams were successful.This is a heavily character driven movie portraying a vagabond family raising a single daughter (now in her '20's) who wants attention from her family to know for sure of their motivations for living such a bleak existence. She plays along with these scams to role play as a way to appear as clever and diabolical as her parents much like if they were a band of gypsies where all those involved show who they really are at the end.I'm getting the Blu-ray of this as soon as it comes out. They don't make Indie movies like this any longer which makes Kajillionaire a rare find."}, {"id": 98, "text": "I'm not really sure if this story is a critique of or a result from the pervasive views in American culture on poverty, success and charity, but it is very interesting.I'm leaning towards the later, which would make it less poignant for me, but there are problems with the first interpretation, which of its face does seem to carry some message.If we view it as a critique, the presented main philosophy makes no real sense as these people, who are clearly mad, opt out of the general notion of consumerism that is is standard in the USA though all classes of rich and poor. These people clearly are deluded and not very ethical. It almost seems that the main protagonist needs charity to escape the non US way of living and this is reached with sacrifice.The other view of course takes the position that the general views in the USA on these themes are considered true. So your success if mostly decided by you, poverty is a choice and charity is better than any type of social safety net.There is however a third option, but this seems a bit too.. sophisticated for the intended audience. I could very well be intentional to construct a jarring situation that rides the knife-edge of these American Dream mantras and exposed them by means of pure absurdity. Everybody is flawed in their convictions and your ideals are not necessarily linked to your moral fibre.Who knows. It was interesting."}, {"id": 99, "text": "An EXTREME exaggeration of a realistic situation that might be relatable to something somewhere.. Wh-What did I just watch? I can't say it was pretty, or thoughtfully put. I'm sure this is the sort of thing a class in cinema appreciation would have a field day with it. People feeling like they don't belong to a family, fear of sudden death by natural phenomenon, being stingy or living simply or the contrary, people that don't or can't ever relate to others and the way they lead their lives?? Something, surely. How do you even review something like this? I like both female leads.. I guess. I liked the way it ended, even if I expected it from the beginning. But these people are just too weird, and I would find it hard to believe they exist in our reality. Their interaction and how they even ended together is just..Still, I noticed varying levels of quality in sound recordings, almost as if those lines were ADR'd. The camera work and colors, locations, etc.. it's rather boring. The dialogue was poor as well. I can't recommend it to anyone, and you HAVE to be in the mood for this kind of work (which some would categorize as try hard)."}, {"id": 100, "text": "Miranda July seems to do a very good job of directing this film. I was amazed throughout the film with all the elements in it. A neat combination of character oddities, heart warming feeling, with a crime-comedy dressing, and presenting the reality of the lower class economy. My eyes are always stunned to see every scene and story development that is neat, not rushed, and very interesting.Even though it carries the title kajillionaire, I like it when it is only used as a premise and not continued in the twist, because it will feel cliche if it's done, good job miranda !. The story is funny and entertaining, with the strangeness of each character, in fact it actually supports the story to develop better. Evan Rachel Wood is very exceptional here. The other casts are also very balanced in playing their roles, the problems of each character also support the chemistry and connections that are shown to be more natural. The cinematography that is displayed is very pleasing to the eye, the color palette settings, camera works, and the existing photography-cinema games are amazing, so they bring a light atmosphere with the screenplay that is played. Supported by scoring and background music that add a plus in this film.Overall, it's an amazing mix of all the film elements. I enjoy it so much. And i Love kind of movie like this."}, {"id": 101, "text": "If you enjoy reading my Spoiler-Free reviews, please follow my blog :)This is the first movie I watch from Miranda July. She's been delivering films well-received by critics, but audiences seem to be pretty divisive about her storytelling methodology. Not that many people watch her movies, which doesn't quite allow me to draw a conclusion about what the general public thinks about her, but there's a clear tendency for overall positive feedback when a lot of people put their eyes on one of her pieces instead of just a couple of hundreds. Therefore, I was really intrigued by Kajillionaire's synopsis, and the cast is interesting, to say the least. So, does Miranda conquers one more fan, or am I too stubborn to convince?Her unconventional filmmaking style definitely captures my attention, but it's her incredibly subtle character development that ultimately wins me over. Evan Rachel Wood's Old Dolio doesn't know how to live or what life truly is. She doesn't understand or feels fundamental human interactions due to the loveless parenting that accompanied her throughout her entire life. She only knows how to steal, cheat, and live a life outside of the law. She believes life is meaningless and that a massive earthquake will change everything. So, Old Dolio is an easy character to root for and to connect with when things don't work out as she expects. It's impossible not to feel sorry for her. I constantly felt sad and even uncomfortable when she was emotionally suffering.Evan Rachel Wood (Westworld, Frozen II) offers a unique interpretation of someone with this kind of personality, even changing her voice tone, delivering a notably layered performance. Evan and Gina Rodriguez (Melanie) share impeccable chemistry, a vital component in the main plot. Their characters create such an emotional bond that any sane and educated viewer will understand where their relationship is driving towards. This friendship is treated in such a respectful and realistic manner from Miranda July that I felt extremely pleased by everything surrounding it. It's undoubtedly the primary source of entertainment.However, it's Gina Rodriguez (Annihilation, Scoob!) who genuinely elevates the whole story. Honestly, in my opinion, it's her career-best performance. With tiny, little facial expressions, she's able to clearly transmit to the viewer everything Melanie is feeling. She's introduced at the right time, just when the film needs a push. Richard Jenkins and Debra Winger are also outstanding, especially the former who gives his character a few unexpected, emotionally powerful moments. Both parents are as cold and rigorous as they could be, teaching her daughter how to survive without any affection instead of how to live and be filled with love.Miranda July writes a compelling narrative, packed with dramatic sequences, but also with quite a bit of humor. She employs a somewhat slow pacing, which doesn't always work in favor of the movie. In fact, if it wasn't for Gina and Evan's incredibly captivating interactions, Kajillionaire would suffer much more from the family's scamming business, something that quickly loses my enthusiasm. Sebastian Winterø's cinematography is driven by the characters, lingering on their reactions longer than usual, letting the emotions sink in, and allowing the viewer to connect with the characters. This is impeccable work, aided by seamless editing (Jennifer Vecchiarello).Technically, it's a pretty well-produced film, but I do have an issue with the score by Emile Mosseri. I really enjoy most of the themes, but occasionally the volume is so loud that I had trouble listening to what the characters were saying. Since I had the option of going back a few seconds, I could hear some scenes again, so it didn't exactly hurt my viewing. However, it's still a technical issue that made me stop the movie, something I absolutely dislike, and I don't know how much it could have impacted me had I watched this film at a theater.In the end, Kajillionaire convinces me well enough to add Miranda July to my list of directors to follow closely. Boasting a character-driven narrative and a unique filmmaking style, Evan Rachel Wood and Gina Rodriguez share impressive chemistry, elevating their characters' relationship, which is definitely the most captivating arc of the whole movie. Both Melanie and Old Dolio go through an extremely detailed yet visually subtle character development, which compelled me to root for their success in life. Gina steals the show with a career-best performance, but Evan's bizarre display is also remarkable, as well as Richard Jenkins and Debra Winger's excellent portrayals of the parents. Technically, Sebastian Winterø's camera work and Jennifer Vecchiarello's editing work perfectly together, but Emile Mosseri's beautiful score is occasionally dialed up to a volume that hurts some dialogues. The slow pacing employed doesn't quite work all the time, and the family's swindling business quickly loses interest besides defying logic a couple of times. Overall, I recommend it to everyone, so give it a watch if you can!Rating: B"}, {"id": 102, "text": "Beautifully thought-provoking and altogether unique; Kajillionaire plays on surrealism with an incredible approach from writer/director Miranda July.In this comedy-drama, a young woman's life is turned upside down when her criminal parents invite an outsider to join them on a heist.I'll be dead honest with you all; I didn't think I'd enjoy this film. The trailer was weird and thought it would be too artsy for me. Turns out, I absolutely loved Kajillionaire. I was so moved by the story and by Evan Rachel Wood's performance. The actress deserves tons of recognition for this role. The humour in this film is quirky and dark at times but the story can resonate with anyone. Writer/director Miranda July has penned one of the best films of 2020 that will have you laughing but also questioning the void inside all of us.Follow @snobmedia for all reviews!"}, {"id": 103, "text": "I've been a big fan of Miranda July all the way back to her magnificent debut Me and You and Everyone We Know in 2005 - she's only directed one full length movie since then, The Future (2011), but she's still one of the small handful of filmmakers (along with Wes Anderson, Charlie Kaufman and I guess to a lesser extent Yorgos Lanthimos, Spike Jonze, Paul Thomas Anderson and Quentin Tarantino) that I am continually keeping an eye on to see what they come up with next.I've gotten so used to disappointment in modern movies that I wasn't expecting that much from her new one Kajillionaire - it was being spoken of as a crime drama and I couldn't see how her unique humour and delicate observations on the human condition would translate into, and survive within, some fast-paced, tough-talking, grittily realistic heist movie. It turns out I was completely hoodwinked, and this is no more a true crime drama than, say, Harold &amp; Maude. It's just as funny and strange as every other thing Miranda July has made, and that's all I really would have asked for.The story itself is very simple: a dysfunctional family of hand-to-mouth-living grifters try to come up with some scam to pay off their back rent while involving a stranger they meet by chance, and a relationship of sorts begins to blossom between her and the daughter.It's a small film, the same way PT Anderson's Punch Drunk Love is, with essentially a cast of four and a handful of memorable bit parts, but everyone is perfect. Evan Rachel Wood, as the frumpy, stunted and neglected daughter, was a revelation to me, as I'd only seen her as the Little House On The Prairie-like android in Westworld. Here, she looks like nothing so much as a Jay in search of a Silent Bob, and sounds almost exactly like a Bill &amp; Ted-era Keanu Reeves.But her Old Dolio is still the heart of the story, whose journey and transformation we are following, and I know if I was a lesbian, this is the kind of gay representation I would be wanting to see, and celebrating at every opportunity far more than mediocre trash like Blue Is The Warmest Colour or whatever virtue signalling celebrity project is getting all the media platitudes this week. Here, the lesbian romance is simply presented as two human beings finding each other amid a sea of other human beings, one type of human interaction amongst all the other, equally impactful human interactions one encounters in the course of life. Men are not vilified, and every person we encounter is treated with equal compassion and humanity. This is the kind of artistic vision we desperately need more of, to counteract all the divisive identity politics that have taken over and ruined Hollywood the past 10 years or so, and I'm just so thankful Miranda July exists."}, {"id": 104, "text": "Pleasantly surprised by the ending, felt it was inevitable but at the same time my mind lingered upon the climax being a betrayal. The script is absolutely brilliant and has everything a low budget independent movie requires. Marketing the film as a heist/caper makes sense if you understand the ending but many wouldn't expect something unconventional. Kajillionaire is the exact opposite of Giuseppe Tornatore's The Best Offer in a literal sense.Kajillionaire tells the story about 26 year old Old Dolio (Evan Rachel Wood) who was trained by her parents (Richard Jenkins and Debra Winger) to be con artists from the day she was born, depriving her of a childhood. In the middle of a con, they meet Melissa (Gina Rodriguez) a young enthusiastic woman who is more than happy to be a part of their gang. Old Dolio gets jealous because of the affection her parents show for Melissa but what happens next forms the rest of the story leading to genre changing conclusion.The con in this film is metaphorical in the bigger picture but the literal heist we see appears to just a small loss to make up for the greater good for the affected characters. Miranda July is a strong contender for Best Screenplay and Richard Jenkins for Supporting Actor in the upcoming awards season. Its a shame the pandemic forced this film to release on VOD as it was clearly made for the cinema. Kajillionaire is comfortably one of the best movies of this year and its legacy will vastly improve over time."}, {"id": 105, "text": "It does not surprise me that the reviews are so divisive.Yes, it was slow, and no, there was not a lot of action and thrill in the traditional sense - but if you apply some patience and empathy, I think you might enjoy this film as much as much as I did.If you enjoy films with subtle emotional depth, this will likely be your cup of tea. It has some great character development and makes various implicit remarks on life, society, and relationships.In particular, I felt that Evan Rachel Wood's performance was fantastic, especially with such a bizarre character to present, she expressed her perspectives and actions and the emotional scars these reveal tremendously well.Melanie's (Gina Rodriguez) degree of comfort with getting on board with the family's cons moved a little too easily and was insufficiently explained. However, I found the gradual development of the relationship with her and Old Dolio otherwise believable and tender.I will be looking in to Miranda July's other work."}, {"id": 106, "text": "Maybe it's because I wanted to like this film? Maybe it's because Jenkins is 'well, proper good' maybe it because I think Ms July is dope like November rain, maybe it's because ERW has really begun to win me over, maybe it's because I'm a little Seasonal Affected Disordered at the moment but I rather enjoyed Kajilloonaire.Quirky and oddball but not too esoteric,orginal but not like, blow you away, never been done before. A tale of a dysfunctional family when all said and done and yeah not exactly the most redeeming characters but there is hope within them, there is tragedy behind them and there is growth enough to make me feel better be it only for a afternoon but in todays days any little thing that can make one feel better about their life and like, just let you escape is a beautiful thing.I totally get why people dislike this film, some with a passion, but like, its Maranda July what did you expect? She doesn't do rose tint, nor does she wrap it all up with a bow sacrine trite comedy or hackneyed drama. She's a polarizing writer that you'll either love or hate but seldom be on the fence with, and thats a beautiful thing."}], "reviews_amount": 107}