{"name": "The Wretched", "titleId": "tt08305806", "reviews": [{"id": 0, "text": "This movie had the right pieces including a likeable protagonist, decent practical effects, and a brisk pace. But the plot felt forced by the end and it veered into an average movie. It lacked effective scares and a sense of dread that I like in a witch movie and the antagonist was not as frightening as I would have liked.I don't regret watching it, but I was hoping for more."}, {"id": 1, "text": "Obviously a lower/ smaller budget, but unlike others, it both looks &amp; sounds excellent; there's obviously very competent production in all departments here.Lovely opening &amp; the story skips right along, no annoying teen heavy story here, even though they are present &amp; in lead roles, noticing what the 'stupid' old people aren't.With competent &amp; engaging performances all around from what seems like mostly 'newbies', successful &amp; unusual monster effects, creepy moments &amp; no unnecessary jump scares, you'll find very little to complain about. There is a back story, with the lead discovering our particular witch online, however this could have been expanded, to make a more engaging story. A further improvement would have been to spend a few more dollars on the soundtrack, but it's mostly unobtrusive &amp; effective, if a little generic.The denouement was twist-less but a nice little automotive surprise &amp; the final floral question mark was delicious.Serious gore/ horror fans may find this too light, but it was certainly enough for this devotee of the supernatural."}, {"id": 2, "text": "This movie is actually pretty good, unlike some of the other no-name horror movies popping up around the same time (1BR, The Lodge, The other lamb). This one is hardly original, but it's got a lot of throwbacks - 80's vibe, and is Well shot with above par FX, And convincing no-name actors). It's got it's own, not always welcoming, twist ending, which worked in this case for the better. It's really a pretty decent horror/comedy flick that doesn't take itself too seriously, looks good on screen, and keeps your attention throughout. I enjoyed it."}, {"id": 3, "text": "I really enjoyed this one, the plot is quite simple but intriguing and thoroughly engaging. The visual and sound effects were perfect and the acting was good. Nice little gem this one. Watch it with the lights out at night for added effect 😉"}, {"id": 4, "text": "Almost there. I love a good scare. This one was a great concept. Missed the mark with no real character development. No build up. Needed to be drawn out .. more tense. enjoyed with the 14 year old teenagers that I watched with but for me .. i wanted to be scared but it never happened. 20% more and it would have been great."}, {"id": 5, "text": "I really like this movie its very well made the gore everything the witch is very mean and spares no one.The effects where also very good. There is a lot of horror movies being made theses days and to be honest 99% are really bad but this one was a great surprise and stands out from the pack."}, {"id": 6, "text": "Went in with no hope and it was surprisingly entertaining. Jump scares here and there, story and acting was convincing. Worth a watch."}, {"id": 7, "text": "Pro'sSolid special effects Good twist at the end Nice camera work Nice what is that in the background scares Acting not terribleCon'sI think Hollywood has no idea how High School kids actually act, and I'm getting sick of it. The tough kid who beats everyone up character needs to be retired A few loose ends in the plot No lasting impact Very closing scene, the one setting up a sequal, was a little lame and reminded me of 80's slashers Altogether I enjoyed it and I think you might as well watch it if you are a horror buff. 👍"}, {"id": 8, "text": "The movie is simple keeping horror basics with jump scares and witch tale. The story is good. Though the movie is predictable still it doesn't disappoint. The horror is mild and could have made more scary if attempted rightly."}, {"id": 9, "text": "Was there something missing here or I did not enjoy it? I think the movie is good for audiences who just wanted a good watch (time pass) but not for the true horror fans. Something is missing with the movie it felt empty to me whole time I didn't realize that I am watching a horror movie because it didn't scared me at all. Recommended to those who wanted to watch a movie for good time pass."}, {"id": 10, "text": "Visually entertaining, it might not scare hell out of you, but story is interesting, without big plotholes. Good actors. I waited for this for a long time and it was definitely worth it."}, {"id": 11, "text": "I've been binging many of the classic 80's horror as well as cult classics and this film, The Wretched, gives me a similar feeling. It's your classic I think my neighbor is a ____ with the mix of teen romance and family drama. It isn't an intellectual horror as this is a saturated genre, but it was fun to watch an updated version of the genre movies I love (fright night, the lost boys, etc). Like those films, they aren't perfect but they have there strengths as well as weaknesses. The creepiness was decent, but it was never very scary. It did a good job of slowly introducing the monster and building suspense. One thing I disliked was that the subplots failed to go below surface level so looking back they felt like a waste of energy - should have focused on only one along with the main story. However, the production was fantastic and you could tell they knew what they were doing. Actors were fine, but nothing to write home about.Real rating: 6.3 (given a 7 because I feel the current score of 5.8 is bit too low)"}, {"id": 12, "text": "Didn't expect a lot but this was a solid low budget film with a good twist."}, {"id": 13, "text": "Some creepy moments, a decent enough &amp; intriguing story idea, and likable (albeit standard) characters keep you watching, but too many horror movie cliches, insufficient background on the nature of the creature/ demon/ whatever-it-is, and an uninspired ending knock the wind out of this one. Overall, it doesn't succeed."}, {"id": 14, "text": "Superb acting, great dialogue, perfect pace, and a solid horror tale without the plot holes or antagonists breaking their own world rules as you often see in films like these. It also has a nice twist ... the movie doesn't hang on it, but it further confirms the rules of the world. Just loved it. :)"}, {"id": 15, "text": "Generic,average and full of cliches.The practical fx are pretty good but Fright Night(original and remake)are so much better."}, {"id": 16, "text": "Well well well... I am not certain what to think of this film to be honest. Overall, yes, it is a horror film and a unique story. But I have a thing against what they call a teenage horror film. Somehow these films don't do it for me.Overall, the acting was mediocre as well. The make up person of the monster, you are the reason I don't hate this film. Hats off to you.Would I watch it again? No. Would I make my friends watch it? No."}, {"id": 17, "text": "Wouldn't be fair to score this film as I only gave it 20 min to see if it was worth my time. It wasn't. Perhaps it would work for a Blumhouse kinda crowd but not for this seasoned horror vet. I'll just look at the stack of bills piled up beside me, far more terrifying than this dud."}, {"id": 18, "text": "The Wretched is a very well made horror movie. It's about a teenager called Ben who upon visiting his father during the summer becomes convinced that his next door neighbour has been replaced by a powerful witch who eats children. Getting anyone to believe him is not easy as she has the power to make people do her bidding and also to make them forget their loved ones who have disappeared.Overall the acting is good although some of the characters could have been fleshed out a bit more. Ben as the main character comes across as relatively unlikable in the beginning but then again he is a 17 year old teenage guy so maybe that was on purpose. He does experience character growth though which I feel was best exemplified when he tries to save a little girl that he sees being taken by the witch. There is some blood and gore in certain scenes but it doesn't go overboard like some horrors tend to. Overall The Wretched is a well made suspensful horror with a plot twist that wasn't obvious until the end. It deserves a 6.5-7 out of 10."}, {"id": 19, "text": "Fun ride a couple good scares. Mostly I loved the script. Good Writing. Good story. Couple twist and turns I didn't see coming and I watch a lot of horror. Definitely one to check out."}, {"id": 20, "text": "This movie had potential. It's quite well made with beautiful shots and the special effects are good. Just a little too much teenage drama for my taste. Ditching a family dinner for a party, getting drunk, late night swimming in the pool, bullies pranking the new guy... For a moment there I thought I was watching The O.C. But if you are willing to ignore all the stupid teenageers doing teenagers stuff - it's an alright movie.With that said - I can not get over the fact that the husband next door was so CLUELESS. His wife was a beer-drinking, boots-wearing rocker girl. He comes home one night after work to find his wife standing outside the neighbours house. She is wearing a long summer-dress, perfect make up and high heels with her hair perfectly flowing around her shoulders. His son is hiding in the neighbours house and he is clearly terrified for some (not so) mysterious reason. And what does this clueless man do? He takes his son home and tucks him in bed. A normal person would at least think hey, this is a bit odd. Wifey is acting stranger than usual.And that dog scene at the lake was just uncalled for."}, {"id": 21, "text": "Film was ok but reminded me so much of fright night back in the day"}, {"id": 22, "text": "THE WRETCHED is another example of a low budget digital horror flick with a supernatural plotline. It's similar to many other stories with rural settings, focusing on small scale family drama for much of the running time and as such not being very interesting when it comes to holding the viewer's attention. The film is a little better shot than most and the supernatural elements of the plot, when they do finally emerge, bring to mind the likes of THE EVIL DEAD with a demon hiding inside the skin of a human. In the end, the lack of characters to truly care about sinks this one as it does so many others."}, {"id": 23, "text": "You would never think this movie was a low budget project because the settings and location was perfect. .Just wish the writers would've added more dramatics and suspense besides relying on the edited music to keep viewers awake."}, {"id": 24, "text": "Bad movie. This movie is cursed by bland, wooden mediocrity. Actors are dressed and behave like stolen Old Navy mannequins. Movie doesn't know what it wants to be, but it forgets about ten times like my great grandpa telling a story on Thanksgiving. Feels like a simulation of a horror movie. Soundtrack sounds like a completely royalty-free album called Orchestral Fear and Fright Shiver Tingle #100 The actors should return to their original jobs, which was presumably doing adverts for JC Penney's or camping gear magazines. Watch something worse or something better, but don't waste your time on this gelatinous sour slop"}, {"id": 25, "text": "The Pierce Bros. are clearly fans of the amazing graphic novel Wytches, which they borrowed from quite liberally. That said, they at least did it justice. Great special effects, decently acted for the genre. Overall a solid effort! I look forward to see what else they can do."}, {"id": 26, "text": "I had this movie on my watchlist for almost a year, read about it a while ago. So when I finally saw this film pop up on VOD, my mom and I decided to rent it! It was an ok movie the first half but nothing special, other than 1 or 2 short scary moments. Then the last 20 minutes or so it definitely amped up the horror aspect! I loved the twist that came towards the end with the main character, I didn't see it coming which I really liked. I also thought the witch character got a lot scarier at the end. I'd wished the first half had been less of a free form/abc family teen show and more horror like the last half! If it had followed the scarier tone through the entire movie , like the the last half of the movie, it could have been so amazing and a new horror classic. Overall, still decent horror/thriller."}, {"id": 27, "text": "Slow, I had to fast forward several times .F ound the acting wooden and didnt engage with anyone.The creature effects total maybe 30 seconds divded into 5 second moments through out the over long run time .Nothig new here,and as usual with so many horror today the ending is a scapegoat ."}, {"id": 28, "text": "And then the opening credits start to roll and it's down hill from there. Teen romp with an 80's feel that has a few jump scares. The movie doesn't know what it wants to be, maybe a horror? a teen romance? it's not worth your time."}, {"id": 29, "text": "I don't usually write reviews and think most are stupid or too over analytical like the person is a critic. Anyway, this film was horrific. It was 95 minutes of nothing. There was no plot. Scenes did not last over a minute and did not set the next seen up, so you had no clue of how things happen or where new people came from.. The acting was stale. There was no build up because there was nothing to build up to. I have seen many wretched horror films in my lifetime and this ranks high up there with them. The Pierce brothers should quit before they get further behind. So in conclusion, watched it or don't watch it. I don't care. You can agree with my review or not. I don't care about that either. It's just my opinion."}, {"id": 30, "text": "I had high hopes for this film because it started off well. It wasn't too long though before I was asking myself, did a 12 year old write this ? Why is there minor nudity and some curse words in a movie aimed at children ? It is aimed at children , I assume ? Was this made in Canada because they are known for their mediocre film making ? It could have been a good movie if it just weren't all over the place, with too many characters, too many unexplained and never explained happenings , shots that didn't make sense, entire scenes that were nothing more then filler. I can understand character development and John-Paul Howard is excellent in the lead, but he's given so many nonsense and non-essential scenes to work with that it just kills what's suppose to be a horror movie. On so many levels this movie just does not work. Everything about it is generic horror movie in the worst possible way. It's 2020 and this movie plays like made for TV horror from 1972."}, {"id": 31, "text": "What a snooze. Everything in this movie felt borrowed. No originality to be found, just the same of witch story. I think we've had enough of the twitchy evil girl thing. Characters were dull, and often seemed to have no motivation, even the witch. Story development was terrible. Nothing was explained, just horror trope after horror trope. So many questions left, yet by the end you won't even care. I've seen hundreds of horror movies and this one had little value and was just barely entertaining. I really liked the creature design but was left wanting for more. Camera work was dull, relying constantly on the old out of focus background. Cliche...dull... skip it."}, {"id": 32, "text": "Don't waste your time, watch anything but this garbage. I can relate to any genre, even look past a little bad acting but the story is god awful. A good thriller or horror movie must have some small semblance of reality in it, not a bunch of 30-40 year old tropes! This isn't a horror or a thriller, it's a bad joke. I can't believe anyone rated this above a 1."}, {"id": 33, "text": "This would be a solid horror film of which every part of you have seen already several times, there is nothing unique to be found here, that is marred by a terrible case of characters stopping their conversations immediately, so the plot can continue as it does. It is cheap and completely unrealistic, where obvious and blatant followups should be happening for characters saying statements, followups which would halt the movie's story. But instead, we have abrupt, nonsensical ends to people talking and onto the next scene, which should be a different outcome scene, if they had logically said anything. Otherwise, the cast is great, they have charisma and screen presence, it's a fun horror that will leave you disappointed because it feels and looks good, but it's very half baked, it's the curse of the same people writing AND directing, no different set of eyes on the project. The music is mostly distracting, as it's mildly off and too present in scenes, as if someone suddenly turned a CD on in the scene. It's worth a watch, but frustrating in the end for the missed marks."}, {"id": 34, "text": "Another pseudo horror movie with annoying teen actors. Only a waste of time, a movie that only worsened my depression during these pandemic times."}, {"id": 35, "text": "Many may find this film seen it all before, What sets it apart is quality camera cinematography. The sound was good as well. This is not the norm for low budget movie. The main young male actor was very good, Has a bright future ahead of him if continues as actor. The only awful thing put into this movie is the music score; It was unnecessary, Especially for 2020, Not the decades before.If you are not netflix, amazon etc at moment, support this where available."}, {"id": 36, "text": "Also the only good line in the movie.Dull and needless version of Body Snatchers. No aliens this time though. To be more precise, first the movie is dull, then it gets stupid. Though that would probably sum up just about half of all horror movies.I always moan that there aren't enough horrors about witches, and this has a witch in it. Sort of. Problem is, this witch is just another boring changeling, so not really a witch. So instead of an interesting witch movie we have a standard monster flick. With teens. Annoying teens.The plot is too drawn out, and fairly predictable. I have no issue with slow plots, as long as the movie is stylish. This is nothing of the like; it's a bland, commercial film, completely formulaic. It can't afford to drag. Arty films can drag. (And often not even they.) This is anti-arty. It's piffle. The pace picks up only after the half-way mark by which time I am so bored I have zero interest in any of this.One review says that the protagonist is likable. And that's why you just can't trust reviews that aren't mine. The main character is a thief and fairly thick. But I guess that's who kids identify with nowadays. The Kanye Generation likes their thieves and buffoons.The flick takes plenty of liberties with logic, especially in how it makes things way too convenient and easy for the witch. Like that amazing witch-friendly timing when the protagonist attacks the black woman in the kitchen, then gets interrupted just as she hides her identity. Really dumb. Or the main teen character getting attacked by the generic alpha teen thug just as he is about to try to save a young girl.Essentially, this must be the luckiest witch in the world. With that kind of luck she doesn't even need to be smart; she could literally be Miley Cyrus and still win every battle. Suffice it to say, the last half-hour is just one cheap plot-device after another. The movie actually even lies to us about the teen not having a brother, just to use this as a far-fetched plot-twist later on. One would assume that if the witch had the teen hypnotized all along to forget his own brother that then she'd have also thrown in a slave spell in that empty head of his too, so he doesn't go on a witch hunt, so he doesn't become a nuisance to her. The movie treats the audience like a crab biomass, which is of course logical, now that the horror film audiences consist mostly the Kanye Generation.With the kind of power - and luck - this witch has, how come she didn't become the next Hitler or Stalin or Obama by now?The less said about the teen's love-interest the better. I mean, come on. She could pass off as Pauly Shore's girlfriend, but anything higher than that is really stretching it. Still, how ironic that she utters the legendary line: it seems nepotism is alive and kicking. Yeah, Disney Channel girl: you and your 4 siblings know all about nepotism. You're all in movies."}, {"id": 37, "text": "Don't believe the reviews above 4. This movie is terrible and makes absolutely no sense. It suffers from bad acting and bad screenplay. 80s vibes? - I don't think so.If it had Nicolas Cage starring I would rate it 2."}, {"id": 38, "text": "Although this wasn't set in the 80's ,this film had the same vibe and writing style of horrors made in the 80's , im in my late 40's and was brought up on 80's horror , this reminded me of films like fright night , the lost boys and so on , not that they were similar although there are similarity's to fright night ,its just the vibe and writing style , has a good story, premise and acting and doesnt go down the typical stereotyping and tropes of modern day horrors or the over use of CGI and had good practical effects . one thing i did like was the lack of trying to please all audiences with its characters and had a mix or blend of ethnicity that didn't seem forced, the films did have some flaws and a shift from creepy scary horror to a more PG Spielberg high jinks kid/teen romp towards the 3rd act . Overall i enjoyed this film and would like to see more of this style of writing and feel of the 'old days'"}, {"id": 39, "text": "Advertising marketeers must have scripted this done countless times before plot. We have: (a.) Title makes no sense. (b.) Teen romance so we know who the target audience is. (c.) Teen pool alcohol partying. (d.) Teen good guy/bad guy confrontation. (e.) Strange neighbors. (f.) Strange neighbor is a totally unexplained semi-human that crawls out of once living thingys (e.g. another human; a deer), and somehow also lives in the underground roots of a tree; is acted by a hyper-flexible female with some cheap body paint &amp; nails. (g.) Usual jump scares. (h.) You think it mostly ends up OK; well, not really - as usual, part 2 forthcoming."}, {"id": 40, "text": "Wretched is the best way to describe this unfrightening fright film. C grade writing, direction, acting, etc made this movie a protracted effort for this viewer to finish."}, {"id": 41, "text": "A complete waste of time. A generic boring and not at all horror nor scary"}, {"id": 42, "text": "This movie had a little bit of everything, which resulted in a fairly well-rounded flick. If you're looking for pure scares, you may find it a little lacking, but there was a few creepy moments and plenty of tension. With a nice little twist towards the end, which had some subtle, but insistent foreshadowing throughout, made for a cool little surprise for those watching. The only thing that kept me from rating this an 8, was the very end, which was just a bit of an eye-roll, but maybe that's just me."}, {"id": 43, "text": "Bad actors, Bad plot, Bad twist....Bad movie. Don't waste your time."}, {"id": 44, "text": "-This movie took me by surprise .I was watching it with low expectations but its worth every minute.The plot ,acting and twists were superb .I couldnt take my eyes of even for a snacks break. It has all the elements of a good thriller and decent horror.The witch potrayal by Zahra is very scary and the young hero has lotsof potential .Overall a very satisfying experience.A must watch &amp; highly recommended."}, {"id": 45, "text": "S H I T dont waste your life like I did watching this movie it was absolute waste of my life"}, {"id": 46, "text": "Bad direction bad actor and actress good story low budget"}, {"id": 47, "text": "This movie was not amazing at all, I saw it with my friends and I think the best part was when the movie was over. Just terrible"}, {"id": 48, "text": "This movie is fun. I found myself wishing that it wasn't so clean visually, and that it was a little grittier. The story was good though and the practical monster effects were great. The actress playing Mallory did a great job and I'm looking forward to seeing what she does in the future."}, {"id": 49, "text": "Yup, it's difficult to come up with new horror ideas. Yup, we should bear in mind that making any film is surprisingly hard work. But all the same, this film really isn't worth your time and yet has been wildly overrated by some.You can easily find a better one to waste 90 minutes on. If you insist on seeing it, though, get ready for a tedious set up, a token introduction to the supernatural thing and workaday bloodletting at best. In short, it should have been a lot better."}, {"id": 50, "text": "The Wretched is the kind of horror movie you're hoping to find when you browse through the indie titles on your streaming service. It's well directed, well acted, with great creep factor and some effective scares. We get a cold open set in the mid '80s to give the viewer a solid sense of what kind of monster we're in for, then a fast forward to the present time. There is a clue in this first present day scene that lets you know that (spoiler!) you are watching a rewind. The reason for that is stated fairly early on when Ben, the protagonist, starts investigating the weird neighbor lady next door. It's not until late in the film that you get that picture again and realize why Ben is going through a rewind, and boy was it a good twist. If you're going to try a twist after The Sixth Sense, it should be this good. All of the sudden some eccentric moments earlier in the film make sense. Overall this is a very effective horror movie about a child-eating forest demon thingy. The movie summary calls it a witch, but this creature doesn't seem to have ever been human. It just likes wearing humans when it needs to blend in, which makes for some unsettling moments when you don't know if who you're looking at is really who you're looking at. The characterizations are all frustrating because you like the characters, but they're up against something outside of human ken. For instance, Ben is smart but vulnerable to peer pressure. Mallory is bold but doesn't always think through her actions before committing them. The movie has great pacing and some clever visuals. If anything, it could have used a bit more of a wrap up. We never found out for sure what happened to a few characters. It's implied but not stated. I guess they left a few things open for a sequel."}, {"id": 51, "text": "Well I won't go so far as to say the name of the film is an accurate description for it, but for horror fans, the story is entirely lacking. It certainly wasn't nearly as terrifying or demonic as the title or DVD cover suggests. It borrows elements from a lot of other horror movies like It and Evil Dead, so in that respect, originality and creativity are missing. There was only one semi-jump scare which didn't budge this viewer, and it had a by the numbers feel for getting from start to finish. It was hard to gain any sympathy for the principal characters as well, which when you add up all the negatives, the picture isn't readily recommended unless you're a true completist for this kind of stuff. That ending scene was somewhat ambiguous with Mallory (Piper Curda) vacantly gazing off into the distance while Ben (John-Paul Howard) contemplates the fake flower just prior. Setting up a sequel perhaps, but if so, the film makers need to put a little more thought into the story line."}, {"id": 52, "text": "Pick any aspect of a film you can think of, and I promise you this film does it completely fine. But that's all it does.The one notable thing is that these guys really know how to work with a small budget, I was pretty floored to learn that this only cost $66,000.But that's - I repeat - ALL it does."}, {"id": 53, "text": "I was stoked for The Wretched as it was one of the first mainstream movies released straight to VOD after a month of pandemic lockdown. It started great ... the usual horror-movie prologue was gripping and disturbing. The story was intriguing and mildly original with a Rear Window sub-plot that works well. And the creature effects were outstanding. Unfortunately, the lead protagonist was dull and annoyingly selfish to the point that it dragged most of the movie down with him, redemption arc notwithstanding."}, {"id": 54, "text": "A pretty well done movie. Maybe not as scary as some expected. Didn't quite nail the ending or I would have given it a better score. Worth a watch."}, {"id": 55, "text": "Really, really unoriginal and predictable. If you are a casual moviegoer and not that familiar with horror genre, this one might do the trick and be, in worst case, passable. If you are an experienced genre lover, you will probably know how this will end after 30 minute mark ( I sure did and found no surprises here ). This one is so flat and predictable, it's painful. Oh, and for horror flick, this one is not scary one bit. So for fairly basic movie, my rating is basic and it's 5/10."}, {"id": 56, "text": "The wretched im tired of writing this for almost every new horror film but this one is like many others before a total failure,there is nothing in a film that is worthy of remembering it and if you decide to watch this movie in end you will realise that you wasted your time,characters were completly boring and i found their scares to be uneffective and just plain bad,script was also very weak and it just become like many others were experianced before,wretched was another completly wasted film,idea was on paper solid but execution was bad,i woudnt reccomend to watch this film"}, {"id": 57, "text": "Cheesey script, flat characters, nothing scary at all, story been told a million times, the movie was about 1 hour 35, it could have been 20 minutes tops, nothing at all happens untill 45 minutes in, a proper waste of time"}, {"id": 58, "text": "You might think.. WTD... what is wrong with her... well no.. the only reason I give 10 out of 10 is because I believe horror/suspense/thriller movies should be merited a bit more. They do deserve a bit more of acknowledgement. If you are thinking.. well they do not have character development... then I will say: EXCUSE ME !! look at the character development of the evil ... daaa.... or the person that things ohh well.. everything is ok ...any how... just saying, this movie should have more that what it has..maybe just my opinion"}, {"id": 59, "text": "The Wretched is a great horror film that's gripping, disturbing and atmospheric if a little familiar. John-Paul Howard gives a great lead performance and Piper Curda and Jamison Jones are both really good. It's effectively creepy and unsettling without being reliant on jump scares. The Pierce Brother's direction is fantastic, it's well filmed and well paced. The music by Devin Burrows is really good."}, {"id": 60, "text": "This movie is exactly what you expect , a non-original story but a fun time . This film is scary and sometimes it will make you feel uncomfortable . There is also a twist but it feels unnecessary . The ending was predictable but it didn't matter to me . I would recommend this film to anyone who wants to have a fun time . It's an entertaining little horror movie"}, {"id": 61, "text": "This is an above average horror film with believable characters. It has a good set up for a horror film.In the first scene a teenage girl goes to a house to babysit. She hears some ruckus down in the basement &amp; walks down to investigate. She sees what appears to be a woman cradling a young child. Upon further examination, she discovered that the woman had murdered the child. The teenager runs &amp; attempts to escape but as expected the door is shut just before she can reach it &amp; blood curdling screams ensue.We follow a socially awkward teenager called Ben who works for his dad. He suspects that his neighbour's wife is possessed by some ancient witch. She befriends a girl called, Mallory, who secretly has a crush on him &amp; obviously to which is obvious... The witch has the power to make people forgot their child after they are taken...The film borrows elements from classic horror films like Disturbia, the Vvitch, IT, the Grudge, the Faculty. It has the potential to be classic horror film but like assembling a jigsaw puzzle it ends up with a few missing pieces &amp; in other words it is never truly realised.I would say it is enjoyable and I like the chemistry between the two leads. The film is more of a teenage horror element. The problem with this film is that you see the witch far too early on in this movie rather than showing glimpses of her &amp; have the big reveal at the end. I can honestly say that I did not find it scary at all. It follows the Hollywood Horror formula of the over reliant of jump scares."}, {"id": 62, "text": "This is a typical horror. Once again we are faced with a monster that never dies. Following same storyline in every single horror movie ever, a teenage boy who no one believes is telling the truth until the last 30 minutes of the movie. This film is full of cliche jump scares and a not so scary witch making it all abit dull. Wouldn't really recommend unless your into watching the same thing over again."}, {"id": 63, "text": "This was a bit of Fright Night mixed in with Don't Look Now. I'm surprised, in fact, to see it's current IMDB rating is only 5.8. This deserves nothing less than 7, and perhaps more if you're a fan of 80s Horror.The plot was solid, the acting great and everything made sense. I disagree with a previous reviewer who said the ending was rushed. It was meticulously crafted and all the plot threads came together culminating in a deliciously wicked twist. I highly recommend this to all horror aficionados."}, {"id": 64, "text": "One of the few films to actually play on the big screen in the last few months makes its way to disc this week. Not so much indoor big screens but the drive-ins across the country that have opened allowing people to get out and enjoy a movie while at the same time practicing social distancing. It's only natural that the movie is a horror flick since those have been a staple of drive-ins since they began. Hopefully those screens allowed it to get completely dark before they began running THE WRETCHED.After a short and incredibly creepy set up taking place 35 years ago we fast forward to the present. Teenager Ben (John-Paul Howard) is coming to spend the summer with his father Liam (Jamison Jones). With issues not discussed yet and his parents in the midst of a divorce he ends up working for his father at the marina he manages. There he meets Mallory (Piper Curda) and they become friends. He also notices Sara (Azie Tesfai) getting close with his father.At their house Ben sees the family next door, a young couple with a baby and a young son named Dillon (Blane Crockarell). Dillon and his mother Abbie (Zarah Mahler) hit a deer on the way home and she decides to keep it for the meat, taking care of dressing down the deer. But something isn't quite right about the animal. During the night the deer opens from the incision she made and a pair of slimy strange shaped fingers work their way out from the insides of the deer.As viewers we're aware of what's happening. The creature is the same one seen in the opening segment of the film and Ben later discovers that this is a 1,000 year old witch who comes from beneath a tree. She somehow has the ability to remove all memory of those she takes to her lair to eat leaving those left behind without a clue that their loved ones are even missing.Ben tries to help Dillon but runs afoul of Abbie, now taken over but the witch. After Dillon disappears he can find no one who will believe him that he even existed, including Dillon's own father. With a past history of making poor choices, the reason he is there with his father for the summer as well as wearing a cast, even Liam refuses to listen to him.As his life is placed in danger as well as those he loves around him Ben must do something to solve this problem. With no one believing him, with the witch having he ability to simply whisper in the ear of someone and to control them, this is no easy task. Worse yet is a secret that Ben doesn't even realize until near the end of the film, one that will catch the viewer by surprise as well.The movie is a nice combination of teen film and horror that works on all cylinders. The scares are there and made effectively so by the special effects department that brings this creation to life in the most spine chilling way possible. For me this creation was one of the best creatures I've seen in some time, one that made my skin crawl as well as hoping I never confronted such a thing. Kudos to the effects team behind this.But that's not the only thing that makes the movie work. To find actors, especially young actors, that can make their characters believable is rare. All of them on hand here do an amazing job. They are the focus here rather than the adults with the exception of Mahler. That combination of teen angst, anger at parents in the midst of a divorce and a youthful inquisitiveness makes for perfect performances.Credit also has to go to the directors of this film, brothers Brett and Drew Pierce. Also responsible for the story they've brought out a new nightmare inducing story and creature that ranks up there with the best. One can only wonder what this film would have done business wise in regular theaters with a decent ad campaign. As it is word of mouth from those who watch it should make it a healthy amount back on disc.The movie was one that I rented but after watching it I think I might have to add it to my shelves. I know I could watch it again, in the dark, and still find plenty of moments to enjoy. Better yet have over the niece and nephews that need a good scare and this one might do the trick."}, {"id": 65, "text": "A Well executed classic type horror. But cliché and easily predictable near the end."}, {"id": 66, "text": "Worth a watch maybe, not the best movie in the world but gripped me enough to finnish it!"}, {"id": 67, "text": "Stumbled across this , as I have many, browsing the related videos here, picked up new from the big EB, have to say it was a pretty great find, nice story, good acting, tense atmosphere with some nice creepy atmosphere and camera work. The story kept me engaged and interested. The lead actor played the part well, as did all the supporting cast. I was pleased to see some good horror without crossing the gore porn or Torture Porn lines that so many needlessly do these days. A REAL GOOD QUALITY slasher or horror movie doesn't need those things.The ending act of the film threw me in a good way. I also appreciated the extra little gift of a nice skinny dip shot of the lead actor. LOL I'm very glad to have run across this little gem, it went straight to my indie gems list. So glad I took the chance and picked it up. Very nice creepy little horror film I highly recommend."}, {"id": 68, "text": "I had hesitated before seeing this horror movie given the many bad reviews it had received. Fortunately i was more curious than anything and i finally watched this movie, what can I say ... it's an excellent horror movie, with a plot that follows normally and the movie has its moments of suspense and its moments of intensity, without exaggeration, on the contrary, this film can easily be watched until the end of the plot and finally, we can discover a very good movie of the genre and these days, they are rare and in this very rare genre the good ones, so let's take the time to appreciate the good things and here it was. My mark of 8/10 is by no means usurped. A movie to discover, with a story that follows."}, {"id": 69, "text": "This was a great surprise how it kept me entertained."}, {"id": 70, "text": "The Pierce Brothers's The Wretched to the end of it, is a good horror movie with great practical effects, decent performances with an interesting story and great score and beautiful cinematography. But the the the final 2 twists changed the whole movie from the beginning to the end of it."}, {"id": 71, "text": "'The Wretched' is an ok spooky story, not really a horror film though.The story is there but it's just too predictable but be enjoyable enough.There isn't really much to say about this one, it is a good watch if you have some free time since it's done well, but it's very by the book and there's not that many original ideas in it."}, {"id": 72, "text": "I enjoyed The Wretched. As other reviewers mentioned, it has a nice 80s throwback feel, great practical effects and a nice pace. Really liked the ending twist too, as much as I hoped it wasn't the case! But again, nothing deep about the movie at all, no hidden meanings. Just a good horror movie, something we all need every now and then."}, {"id": 73, "text": "This movie had decent potential, but seemed to run out of steam. There were a fair amount of good scares and creepiness, but they need to rewrite the third act. It was senseless, boring and a lame attempt to make some kind of clever twist to tie things together."}, {"id": 74, "text": "No scares. No chills. Just some good effects. Movie doesn't leave a mark."}, {"id": 75, "text": "Some beautiful shots and scenery. Some shocking catalyst choices in regard to plot. It was like a 2 hour goosebumps episode but made less sense."}, {"id": 76, "text": "Teenager boy (Pierce) is staying with his father helping out at the marina when he notices his next door neighbour is behaving strangely and people around him start for forget things. The ancient witch living under the neighbour's house may have something to do with this of course.Whilst this is a long way from anything original, it is well made with a solid script, believable characters and a few decent scares and avoids turning into schlock or a grisly blood bath, which is the normal route for independent horror. Not bad."}, {"id": 77, "text": "And the horror is interesting enough to keep you watching, but I just can't stand the awful script and soundtracks that are way too cheesy even for goosebumps series, I end up skipping just to see the good bits. The twisty twist was pretty good though."}, {"id": 78, "text": "The movie has nothing special in it but it is a solid witch movie to watch good atmosphere and great fun the movie is a good base."}, {"id": 79, "text": "It was great, it has a good story line and some real spooky scenes. A great selection for a spooky movie night!"}, {"id": 80, "text": "The movie is visually fantastic and the story hooked me but the only qualm I have is that some of the dialogue between the main character and his father during critical points in the plot is not believable. A D+ student with a concussion would know to share the facts with his dad before he got carted away rather than shape what he needs to share so perfectly that his dad ends up thinking he's a nut case. Other than that pivotal moment where his communication skills were criminally bad, the movie was very entertaining."}, {"id": 81, "text": "This one took me by surprise and actually kept my attention all the way through. It's like a much scarier take on disturbia but definitely not the same movie. Great soundtrack, pretty good characters, and it has a nice take on the kid/teen horror/thriller trope(s). If you're into horror, this is worth the watch. This film is not super original but still very well executed and it just stands out to me as one of the better horror movies as of late."}, {"id": 82, "text": "A horror-movie with a witch is a nice change in the nowadays chain of movies with werewolves, vampires, ouija-boards and supernatural ghostly apparitions. The main story was quite good, with a fine amount of decent scares and great special effects; especially seeing the witch crawling out-off some-one's body was awesome. The acting was overall surprisingly good, with John-Paul Howard convincingly playing the endearingly cute but also brave central character Ben.I did have a few reservations though. The pace was a bit uneven: a few very exciting and high-paced scenes were alternated with others where nothing much happened, which brought the movie several times to a bit of a standstill, it even occurred in the middle of the climactic scene in the witches tree-lair.Another of my reservations concerns some of the storylines. The broken arm didn't seem to have any relevance to the story whatsoever, I couldn't help thinking that actor Howard surprised everyone of the crew on the first day of shooting with his plaster cast and they had no choice but to write it into the story. The strange innuendo early in the movie, when dad asks Ben if they maybe can talk about the cause of the broken arm and Ben says: I rather not, didn't really help. The same thing goes for the lame prank that some kids play on Ben, ending up with him naked in the pool - it came a bit out of no-where and didn't lead up to anything.The plot-shift however, pivotal and decisive to the story, was nicely done and a real surprise (anyway, to me), in spite of the - in hindsight - clever foreboding of it in a casual remark of Ben's mother through the telephone. And even the obligatory ending, where we are made aware that the evil isn't over yet, was well done."}, {"id": 83, "text": "It's different than anything I have watched recently and I definitely recommend it. Mom is super creepy and plays her part well, in my opinion. I think the music is phenomenal as well.Likeable main character. Decent story does the most part. I have very few complaints with this one. It's not edge of your seat horror, but it is...gripping."}, {"id": 84, "text": "This film is decent but very clichéd. Also I must be dumb because I didn't get the whole thing of him remembering he had a brother."}, {"id": 85, "text": "It's a nice movie. From the beginning till the end it was joy. - nice for this time. So, i think it's a must see. #enjoy"}, {"id": 86, "text": "Decided to watch the wretched as felt like watching a witch movie we hadn't seen before and found this little gem to be really refreshing. I would say its kind of like summer of 84 without being in the 80s and instead of the neighbour being a creepy kid killing cop its a kid eating witch! Acting isn't the greatest and if you don't take it to seriously you will have fun with this one. It also has a decent ending if some what predictable at times I still highly recommend this for any horror fan looking to get in the halloween spirit."}, {"id": 87, "text": "Why didnt the scary lady just whisper in the neighbor kids ear like she did with literally EVERYBODY else. All the big strong adult men, women, kids but not the 17 yr old kinda whimpy kid?"}, {"id": 88, "text": "Good characters, good story, decent production value equals a close to great horror film. So many horror films sit at 2-5 stars because they don't have three things above. The fourth thing many supernatural horror films fail at is a explanation of how the supernatural began. It just isn't some tragedy or injustice, the explanation has history and the film explains it well. I consider this film hovering at 5.8 to be underrated."}, {"id": 89, "text": "Same old horror plot, same old cliches, a bit of suspension, and the mysterious ending."}, {"id": 90, "text": "Also the progress in horror movie this movie based on very old idea"}, {"id": 91, "text": "I find it ironic that cannibalism is portrayed as a demoic, terrifying, supernatural evil and yet iconic stars like Marina Abramovic get the praise of high status celebrities like Lady Gaga who literally trained under her. Look up Marina's work. There's cannibalism everywhere in it.The movie was truly disturbing. The other reviewers that can tepidly comment on this film are clearly desensitized Americans. It's a terrible sight to behold. It disturbed me in the healthy, clear minded way that it should. I watched this for educational purposes, not to be entertained with it. It was a nauseating effort. Approach with caution."}, {"id": 92, "text": "Besides a couple inconsistencies in the story, just little things that made no sense, The Wretched is an entertaining movie in the witch genre. It isn't the best movie I ever watched in this genre but it's certainly worth a watch. The horror parts are well made and pretty decent in the gore genre. The acting was most of the time good, nothing to really complain about. That said it could all have been better but still there are a couple good creepy parts that will keep you attentive, and in a horror movie that's a bonus."}, {"id": 93, "text": "I found it really boring as Horror movie. Plot was, just say, average, visuals were poor, acting pretty good, can't say anything bad about that. The film could be like a romantic or drama with that boy and girls about feelings between them, then it could be great movie. Now we have something bland movie which gets boring to watch after first 30 or 40minutes. I wouldn't recommend to watch this because this idea about witches is not unique and there are a lot better movie with kind of the same plot."}, {"id": 94, "text": "Randomly pulled this up on TV and saw the rating afterwards and, considering 5.8 is high for a horror, I have to knock it down a peg because it is definitely not that good or great. Set up is generic including the troubled home life teen and side characters who are simply too dumb to live. Visual quality as a film is good, leaps and bounds above some other ones out there, but there is nothing that made it stand out as a good or even above average movie. There are major plotholes but that would take another paragraph to address. Potential for decent scares but overall too mild, like an almost PG take for all but the end. It wasn't a waste of time... but wasn't very enjoyable either."}, {"id": 95, "text": "This is average horror movie. Horror is less and weirdness is more. We have seen many better movies on this subject. Here nothing new. Script is loose. Female characters looks horrified. However acting boy teenage boy is well. Overall movie is not much recommended as me rest is depend on your own."}, {"id": 96, "text": "Visuals, acting, cast, story all kinda ok given all the other movies of this genre coming out lately.. But seriously the music and soundtrack ruins every potential scare or payoff. When are these studios going to learn less is more!?"}, {"id": 97, "text": "Though not the most amazing horror film or original, this film is still enjoyable.It's a nice blend of Rear Window/Disturbia and Invasion of the Body Snatchers/The Thing, and I do recommend giving it a go if you've got nothing else to watch and want a decent horror"}, {"id": 98, "text": "THE WRETCHED (2020) **1/2 John-Paul Howard, Piper Curda, Jamison Jones, Azie Tesfai, Zarah Mahler, Kevin Bigley, Gabriela Quezada Bloomgarden, Richard Ellis, Blane Crockarell, Judah Abner Paul, Ja'layah Washington. Affectively creepy yet disjointed horror film about a teenager (amiable enough Howard), summering with his dad in the throes of an impeding divorce, who discovers some supernatural occurrences with the next door neighbors. While the atmosphere is more or less on target the direction and screenplay by Brett &amp; Drew T. Pierce is somewhat slipshod (namely um not truly introducing characters correctly within the framework of a film). Otherwise entertaining enough."}, {"id": 99, "text": "The Wretched is a low-budget horror movie that has floated under the radar until its sudden rise at drive-in cinemas in these pandemic times. Written and directed by brothers Brett and Drew T. Pierce it follows Ben (Howard) spending time with his father during the summer holidays, when he finds himself fighting a thousand year-old witch. The film is pretty straightforward and without huge twists in terms of storytelling, with clear Stephen King vibes. The Wretched would have benefited from some unexpected plot choices and more intense scenes but works out perfectly as a light summertime horror flick."}, {"id": 100, "text": "The movie is well acted and the effects are good but the story is very bland. The movie is based off of so many old folk tales, but somehow they use none of the mythology and manage to make this slightly boring."}, {"id": 101, "text": "I feel like this is not a witch movie....THIS IS A WENDIGO MOVIE. everything about the lore of it starting with a dead deer, to the mimicking of peoples voices trying to trick them, to the undeniable mythos of the creature taking human form. Watch the movie ravenous for this aspect of the wendigo legend. I NEEDED this movie to come out, since Antlers by Guillermo del Toro got delayed. This movie had great pace, great character development and great acting. Unlike some theatrical releases that totally sucked b@lls like the movie Us last year, this is truely scary and fresh. This movie is not a hard R like a wendigo movie should potentially be like, but this was still creepy, adult, sometimes gory."}, {"id": 102, "text": "Put 9 so can get a little higher cause deserves more recognition. Is a 1 year ago movie and I had never heard about it until few weeks, which is really sad.Mi real rated is 6.5/10, is a good movie, a lot more than I expected tbh. Is a little slow (perfect), and with an unexpected plot. (It will be so much better if you don't see the trailer before watch it)Has some moments of horror and a really good change of stages. I loved the ending and the plot twist.I think is worth it."}, {"id": 103, "text": "There were twists to this movie, but what I enjoyed most was the cinematography and sound design! They were spot-on! I saw influences from Jaws, The Shining, etc. and heard influences from many classic scary movies! There were scenes that shouldn't seem scary that they were able to make really creepy feeling! The story is interesting, but, with the exception of the main character, the other characters did lack depth. Over all, not bad! :) I had fun just identifying the influences from the cinematographer and sound designer! There were some really good pulls!"}, {"id": 104, "text": "I enjoyed this movie a lot, the creepy unsettling first half of this movie was very effective ( mainly due to great effects). The ending got little generic but its still worth a watch in my open."}, {"id": 105, "text": "Watched this on a whim! We have watched most high scoring horror films out there already and saw this on prime. The movie is a good straight forward horror film. Acting is believable, story line is unique in the demon realm. Had a surprise twist that had overlooked details delivered to back it up. Was not necessarily jumpy, but projected an eerie vibe. The story line doesn't go very deep into the demon background, but also doesn't draw out with useless research. Was entertaining the entire time and left a satisfying ending. Would recommend to those that have seen it all, and want something new and entertaining to enjoy!"}, {"id": 106, "text": "Wanted to give 7 - 7,5 but because some rated so low, I gave 8. Definitely not the best horror, even few scenes were a bit like from some B category horror movie. But after all, it was better than I expected and I surprisingly enjoyed it."}, {"id": 107, "text": "This film seems to be the calculated and honest love-child of Disturbia, It, Jeepers Creepers, Get Out, Blair Witch, Invasion of the BodySnatchers etc. all cooked up and seasoned and I'm very much okay with that. I had to watch it twice to really let it sink in, pun intended to appreciate it and digest my thoughts towards it. Yes there's some jarring wishy-washy imperfections and they throw a wtf twist at you from time to time but I couldn't help but enjoy the sheer audacity of it. It trips over itself while it's running but has enough momentum and ingredient to entertain. The third act before the final act was chill-inducing but overall it's strengths wasn't to scare but instead a rather tongue in cheek monologue that was undersold in all the right ways. The film works better under a second view. Yes there's daunting plot holes you can drive a truck through but there's charm, audacity, &amp; fun. The final scene makes this a good tongue in cheek spookhouse thriller chiller that I won't be forgetting anytime soon."}, {"id": 108, "text": "Not bad at all. Of course, I didn't watch the trailer so that must've helped boost the thrill. The title and the post says enough so, thankfully, there was no need to watch the trailer. Also my expectation was very low. There aren't many horror movies out there these days. So anyone who enjoys horror movies is going to enjoy this one. It's not something you would watch over and over or even just for twice but it's enjoyable. I find that to be enough. Oh, don't forget. You never watch a movie during day light. No movie is good then."}, {"id": 109, "text": "Judiciously fast forward this one, especially during suspenseful scenes in the dark. You'll save time &amp; you'll appreciate the film accurately. Watch it all if you're a teenager, though! Some oldd fashioned crap horror. Not terrible, 5-6/10."}, {"id": 110, "text": "Brilliant and well done horror. Amazing, considering the budget, don't let this put you off though, the quality and story were amazing.Due to the pandemic, crap movies seem to be on the loose, this movie definitely doesn't fall into that category. It was refreshing."}, {"id": 111, "text": "Starts off kind of teen drama but gets better and better. Amazing effects and great third third act. If you like pg horror this is well worth your time. Disturbia/rear window meets fright night."}, {"id": 112, "text": "This movie was a little slow but it was really good and had an original plot. Highly recommend this movie."}, {"id": 113, "text": "Decent movie with a nostalgia of the 80s horror movies. It reminds Fright Night since we also have here (a) a teenager thinking that next door neighboor is Evil, (b) nobody believes him although he speaks truth, (c) his love-interest helps him to save the day. There are some plot holes but in a nutshell I think that movie is ok for a popcorn Friday night :-)"}, {"id": 114, "text": "I was expecting another standard modern horror cliche, but the movie is actually very good! I love when a movie uses practical effects instead of relaying on CGI for everything. I really really dislike cgi, I hated It chapter 2 for its crazy the cgi creatures. The Wretched is a lovely looking movie. Nicely acted and shot, with decent, practical special effects. I struggled with the story, which was ultimately a bit Uninteresting. The lead character was one of the least interesting, There just needed to be a scene or two with his background and motivations developed a little more. Other than that, the creature was the real thing! This really felt like a fairy tale come to life. It didn't need to wrap everything up in a tidy bow and explain everything. This could have been a good film but the characters lack delivery on the performance plus the writing media them act stupidly all throughout the film. I mean why did Ben wait so long to call the police on his neighbors. And the girl really didn't really seem to care to much about her little sister. The fact they are teenagers doesn't make them stupid. I rate this as 6.5/10. For an indie film,this is really good.Good video quality,good acting,does not look cheap but very simple and limited suspense scenes"}, {"id": 115, "text": "The plot doesn't make any sense. Not a clever or suspesful movie. Just plain repetative nonsense. Don't waste your time."}, {"id": 116, "text": "This movie was such a good find, I'm not sure why its not rated higher on here?! It was not predictable, and reminded me of a mix between Insideous and Stranger Things. I love the kind of films where a kid/kids get wind of something eery going on in town, and it becomes a story of investigating with scary bumps along the way. I will freely admit I am hard to please when it comes to the horror genre, as I am such a huge fan but this movie honestly pleasantly surprised me and was worth the watch!"}, {"id": 117, "text": "Good acting, story engaging enough but last 20mins goes cliche and missed opportunity. Bad CGI, something more psychological could have worked much better."}, {"id": 118, "text": "Elements combined from other horror movies but the story is told well with nice pacing, plenty of tension and a top shelf production. This is my kind of movie! See it."}, {"id": 119, "text": "I wish that I was told that this is a childrens movie. And the last 20 minutes is a teen movie! When IMDB tells me its a horror movie, I expect to see a horror movie. It should be labeled as a family movie. Most cartoons that children watch are way more scary than this one.As a family movie its well made, but the smallest toddlers should hide themselves in their parents arms the last 20 minutes."}, {"id": 120, "text": "I am very disappointed that the poor raccoon was not credited, he worked hard. Ice the dog got a solid credit for fisherman's dog. Where is raccoon under porch. A tragic oversight. Can't give 10 stars, please correct."}, {"id": 121, "text": "Great story line, where it want to lead but way too easy, an story without need usage of brain also some points they do not explain well. The reason why things happening as it should. Great special effect like the elements of horror they brought in that is not implemented in a standard way.Could bring so much more... The first end is just too easy... but the second one is alright done pretty good.Like horror it is oke"}, {"id": 122, "text": "Great horror show with a nice storyline. Acting was good . The SFX was top drawer. Hope they release a sequel to this show."}, {"id": 123, "text": "I was expecting a lot from this movie, but unfortunately, it failed to deliver. It honestly just seemed like the director was projecting his poor experiences with highschool onto this movie. I mean, the protagonist was absolutely infuriating: I've never disliked a main character as much as this guy. He just seems really arrogant. Not to mention, it kind of seems like women were only in the film to be demonized (pun intended) or sexualized. The plot progression is super jumpy, out-of-place, and slow. The only real scares happen at the beginning and the end. The middle is just the main characters weird love life and peeping on the neighbors having sex. The only reason I gave this movie any stars at all was because of the S-tier makeup and SFX. Honestly, those parts were incredible! It's just... Horror was a very small part of the film. Other than that... Yeah, it's just a weird romance movie. Anyways, this movie is basically Randomly Generated White Man Only Cares For Women He Finds Attractive And Kills The Ones He Doesn't."}, {"id": 124, "text": "Owsome movie worth watching and something new horror i like this type of movies 😍😍😍😍"}, {"id": 125, "text": "I tried to watch this when it initially came out and was turned off by the opening credits- mostly the bubble gum pop song xD But after seeing some decent reviews pile up, I decided to give it my time for Halloween 2020.Commendable acting from no-namers. Cinematography, Directing, Editing - all pretty good but nothing new or defining. Kinda vanilla.The makeup and effects are done well- which is important for a film like this. (òÓ,)_\\,,/I still think the music was a little overdone- but it doesn't soil the final product. 6/10"}, {"id": 126, "text": "Teenager Ben Shaw comes to live with his father who is getting divorced to his mother. There is a creature, spirit, nature god, cult, or something nearby. Ben is concerned about the next door neighbor and their little boy. Something is wrong.This is a really interesting horror premise. It has a bit of Rear Window with the neighbors. I don't care that much about the lead. He's fine but not that charismatic. He could have done more with Mallory. A lot of relationships feel rushed. While not a big deal, the young actors need to give more to the screen. There is another issue. The movie reveals too much too quickly. It would be nice to do more mystery first before revealing everything right away. It even shows the creature too early. A slower build would be more compelling. Still, it's a very compelling horror idea."}, {"id": 127, "text": "It's a good horror film and the acting is fine, it is only a 15 so don't expect loads of limb cutting and torture for no reason (thankfully as I sick of that tired format) and although it follows the usual disturbia route I found it good entertainment for 90 mins."}, {"id": 128, "text": "Overall this was a good horror flick. Nice creepy elements and just a bit of gore thrown in, which I like much more than a gore-fest. I found myself smiling with delight at some of the creepy moments, they were well done. Definitely worth the watch if you enjoy that sort of thing. The acting was well done too. That said, it could have had a stronger showing and a better script. The main protagonist is a bit annoying and self centered in a way that king of feels inconsistent, but overall I quite enjoyed it."}, {"id": 129, "text": "Epic Comedy, laughted throught it all. Had some hope for the Movie but this was a Comedy for an horror Movie. Blowed all their budget on 2 minutts of the Movie and the rest was pure Comedy gold."}, {"id": 130, "text": "Just be glad there aren't really witches like this! Good story, acting, etc. No one I recall ever hearing of acting in it and they pulled it off with excellent production values. Definitely worth a watch."}, {"id": 131, "text": "Don't treat it as a horror movie, it's more of a monster/witch movie. Go with this mindset and you'll definitely enjoy this one. Even with a small budget the effects and cinematography is pretty good. The movie is also well paced so you bored at any time and also I really liked the ending."}, {"id": 132, "text": "I found this movie quite exciting, it's the first movie to ever give me the feeling of when I first watched Fright Night in the 1980's. An adolescent lad notices strange things happening to the neighbours, and starts watching them at all hours.A very nasty, evil witch creature runs amok feeding on people.The effects are great, it flows along nicely, the characters are likeable and there's lots of murder and gore."}, {"id": 133, "text": "The Hole meets The Guardian meets Oculus.They call it a witch but it's an unknown creature. A monster you can't get rid off by screaming bible passages at it. A true horror. The acting and the special effects are equaled by the quality of the script.if you see one horror movie this year, let it be this."}, {"id": 134, "text": "I'm a huge fan of horror and this hit all my buttons. It was gross, scary, confusing, surprising, intriguing, and interesting. The twists and turns got me good and I didn't seem them coming. Well worth the watch!"}, {"id": 135, "text": "Rented this and it was way better than so many of our B horror movies! We were impressed with the creatures and overall acting was quite good. Definitely give it a chance!"}, {"id": 136, "text": "Brett and Drew Pierce's 'The Wretched' is a horror film built out of familiar parts from the likes of Alfred Hitchcock, Steven Spielberg, Stephen King, and a number of other '80s horror films. While the result is a bit vanilla for the lack of focus and bold choices on its storytelling or compelling characters, the movie is well-crafted enough to get under your skin thanks to its good old-fashioned atmosphere and suspense."}, {"id": 137, "text": "This movie is one of the best movies i have ever seen"}, {"id": 138, "text": "This is like a really good 80's horror. Kinda fluff but some good twists and a coming of age tale thrown in. I liked it. The lead is very good. Def worth a peek."}, {"id": 139, "text": "Ah yes, the satisfaction of a horror well worth it. A good story, a scary witch, a skin-crawlingly eerie premise, an atmosphere, this is how it's done. The witch in this story is one of the scariest - her targets are the most innocent, and everyone in her way. She is a creature of the woods but comes into the life of the community nearby. A teen who has joined that community for the summer has seen through her but nobody takes him at his word not only because his accusations are outlandish but because he is a teen who has been acting out just a wee bit. Every part of this is most wonderfully handled except a small false note in the witch's subterranean lair."}, {"id": 140, "text": "Despite such awkward plot the film was surprisingly very gripping. The good pace , likeable characters and a decent setting with some passable effects makes this film a decent one time watch Witch horror movie !!"}, {"id": 141, "text": "The plot felt quite simple but I liked that. It was easy to follow but kept me engaged with a few good twists and turns. The acting was good, the visual and sound effects good too! Definitely a watch for lovers of scary films.."}, {"id": 142, "text": "I don't know if the twist works as good as it is supposed to work. It got me for sure, even with all the hinting. But if feels like a cheat too. Yes they are clever about it and maybe the twist will make this stand out for some. Which is important in these times, when horror movies are a dime a dozen. Maybe not right now, because of Corona, but generally speaking.The movie itself works and the horror gets you, having a lot of elements from other movies mixed into it. From the obscure to the occult to the sort of science fiction. Still well acted and nicely done overall, just don't be bothered by the flaws too much, if you can"}, {"id": 143, "text": "The movie doesn't make you feel scared.. It would be more great if I say it's a suspence thriller"}, {"id": 144, "text": "Best horror film I've seen in years. I wont say much else as I hate spoilers. Beautifully shot. Very well done. Not as cliche and formulaic as most horrors. Fresh and unique. Yes, like all movies it borrows from its predecessors. But I cant recall seeing a movie exactly like this. So for me it was original. Stays away from politics and agenda ( thank God!!!!!!) . Was far less annoying and more interesting than 95% of most horror films. Avoids a lot of the gimmicks and stereotypical tropes as far as screenplay, plot, and pacing, and dialogue. Honestly, for me, this is a classic! I am proud to recommend this high quality, original, engaging horror. Not a cheap jump scare, or by-the-numbers horror. This has heart AND soul. I hope there is a sequel. 8 out of ten stars from me."}, {"id": 145, "text": "Came across this movie on accident great special fx and story.great suspenseful horror flick.a change from super big special fxs."}, {"id": 146, "text": "A ghost kidnapping kids and erase memory of their family members... Worth watchable..!!"}, {"id": 147, "text": "The movie kept me on my toes mainly because movies about children being the victim does it to me. I thought it was pretty good...."}, {"id": 148, "text": "There's nothing demanding about this, it's a little edgier and cleverer than normal teen horror and takes itself seriously. There are some effective moments and it is quite dark at times. Obviously a lot is borrowed from older material (eg. Disturbia) but it's handled well and the run-time is about right."}, {"id": 149, "text": "Nothig spectacularly new here, but a well done teen scare fest. Standard troubled teen is sent to summer with his dad (parents are separated) and work with him on the water side marina of a quaint woodsy town. There is a malevolent force that starts to affect the people around him. Effectively done (those affected have some creepy qualities) but some by the numbers element (i.e. teen's trouble past impacts his father believing him that something's wrong) keep it specifically in the realm of a teen fright film. A little twisty at the end I feel was a means to make it slightly more startling, but that was okay in the long run, not hurting the film overall."}, {"id": 150, "text": "The story is surprisingly engaging and suspenseful. I find myself quite tense from anticipating the worst! It's pretty scary."}, {"id": 151, "text": "This was a good movie. Good ending, good story line and plot twist. Overall I would recommend watching this. Easy to follow and easy to get into."}, {"id": 152, "text": "The opening scene skips five days into the future from the chronological start of the film. So, after this scene, the film jumps back to five days earlier, and progresses the plot with a linear timeline. If this scene was shown in the correct order of events, it would have been more horrific and effective. The audience would have known the stakes involved, making the scene more shocking and emotional. By showing this scene out of order, the audience now knows how most of the plot will progress. This diminishes the stakes and tension from most of the film, and drastically reduces any possible suspense.One scene. Adding that one scene at the beginning of the film really doesn't help the narrative. Was it the directors or editors choice? I suspect it was a producer who wanted to shock the audience right from the first scene. It was a bad choice. Worse than that, it's an obvious bad choice that's been done in film and television for decades. Showing the big bad in the first scene of a horror film is a narrative choice that rarely works out. It's tragic how such a destructive editing choice is in the final cut.For instance, there's a short scene with Abbie, the mother walking down the stairs and standing behind her son, Dillon while he watches TV and eats cereal. It's a tense scene with clever cinematography. It's followed by a cut, and scene transition to a bucket of blood being thrown out at the docks in the following scene. The blood would have been effective foreshadowing, but because of the first scene, it now feels heavy handed. We already know what the mother is, and have a strong suspicion what will happen to Dillon too. So that tense scene with Abbie and Dillon, isn't really that terrifying now. This is just one example of how the opening scene damages most of the film.It's a shame about that opening scene, because the rest of the film is above average in everything else it does. Lots of creative, attention to detail writing and directing techniques are used. It does a good job of show, don't tell. With lots of subtle, but very poignant touches that really flush out the characters, motivations, and plot. Some great examples are the first shot after the credits, the Nathan twist, and the final three scenes including the final shot. The film is really efficient at utilizing visual clues to tell it's story. I also appreciate how serious the film takes itself within it's own universe.Characters act and react in believable ways, adding to the audiences immersion. A few examples of Ben's behaviour just to illustrate the point. When Ben tells Dillon to stay away from the hole in the decks under-skirting. Or how Ben gives Dillon a Popsicle if he promises to tell him if he sees anything weird. And finally, how Ben takes off his shoes to sneak through his house quietly, only to find Dillon hiding in his room. There are dozens of such examples in this film, and having characters take their situation seriously gets the audience to do the same thing too. This is important in any film, but mandatory for a horror film to be effective. Little things matter. I really wish the opening scene wasn't included, because this film does so many other things right."}, {"id": 153, "text": "The Wretched is a Horror movie in which we watch a teenager going to stay at his dad house for a while and he soon finds out that something is wrong with the behavior of his dad neighbor.I liked this movie because it had an interesting plot, it was creepy and it was consisted of plenty of suspense. In addition to this, there were many scenes that made you feel that you are a part of the movie, something that is very difficult to happen. The direction which was made by Brett Pierce and Drew T. Pierce was very good and I believe that they both did a good job. If you are a fan of horror movies I recommend you to watch this movie because I am sure that you will like it a lot."}, {"id": 154, "text": "If you like watching horror movies you would probably have fun. Nothing is special in the movie it's just time pass. But considering this is an indie movie it's beautifully shot so extra points for that."}, {"id": 155, "text": "Movie is predictable and there is nothing special but it is 100% worth watching..."}, {"id": 156, "text": "It's a common horror story with some spiritual demon inside someone. From the neighbors observation and finding strange things had happened. This kind of theme is nothing new. But as the horror side is up to the level and make me feel not non sense, I kinda enjoy it."}, {"id": 157, "text": "I gave the movie an 8 when really I wanted to rate it 7.5. Let me get honest here, I usually shy away from IFC movies. This one was better than others from IFC to me. Plenty of quality dynamics were applied and done well. I thing different generations can enjoy this movie, and it has that kind of spooky vibe from the shows that I used to watch as a kid such as Are You Afraid of the Dark, Erie Indiana and Goosebumps."}, {"id": 158, "text": "A bit long to start but original and overall enjoyable"}, {"id": 159, "text": "I really liked this movie, I had no expectations so I was surprised. And the plot twists at the end, superb! I def recomend this movie to any horror film fans"}, {"id": 160, "text": "I was thrilled to see an original story, and I think overall it's worth watching. However there are dozens of plot holes, some script errors and really really odd directional choices. People dressing different rly all of a sudden, over explaining some things while not explaining others. Ultimately the stakes never feel high because the entirety of what we know about the entity of from witchypedia. The ending especially made no sense. Maybe some crucial scenes were left on the cutting floor?Spoilers: Why did the punk rock mom start wearing floral once she was possessed? How does an ancient elemental have the power to make everyone forget about someone my taking their photo? The fire setting lantern was clearly electric in the first scene walking up the stairs.Ultimately there are just too many plot holes but it's still pretty fun overall."}, {"id": 161, "text": "Really enjoyed this! Can't say a bad word about it! Wasn't the best horror I've seen in a while but it's definitely something I'd watch again."}, {"id": 162, "text": "Well worth a watch. If you liked Midsommar and Hereditary., then you......WONT like this film as it is well-written, directed and generally makes sense. The editing is wonderful, very punchy and nothing that makes you lose interest in the film. Good acting (with some very creepy characters that are well acted) and very good practical body-horror effects. Believable characters and a good score too. There is a fantastic twist that I didnt even see coming (and Ive seen tons of horror films). There are a lot of crap horror films out there - this isnt one of them"}, {"id": 163, "text": "10/10 alls I watch is horror movies and this is a phenomenal movie a definite must see. Very cleverly executed, it's a fun and interesting flick 🔪🦇☠👹🎃"}, {"id": 164, "text": "Awesome movie with a great twist....................................................................."}, {"id": 165, "text": "The story could've been so much scarier! It started out full steam ahead and I was like this is creepy! Then it falls aoart, gets cheesy, plot holes and an ending that doesn't explain half the things that were going on! Kinda disappointed."}, {"id": 166, "text": "Just about worth a watch, pretty slow for the most part but some decent horror taboo breaking"}, {"id": 167, "text": "The Wretched trailer caught my eye a few months back and i thought it looked very intriguing. I then saw it was also receiving some great reviews from people that were at fall festivals it was shown at. I have always been looking for a witch themed film like this but had always been let down by blown potential of past films which I'm sure everyone can guess what those obvious titles were...Honestly this film finally scratched the itch i had for a vicious witch tale with excellent makeup/practical effects and an extremely creepy atmosphere. It also isn't afraid to show viewers actual visuals of the main terrifying entities we've read or heard about for ages. The story also has a relative coming of age kind of feel to it with the main character that reminded me of many horror films of the 80's and made it more charming and fun. There were even some well placed sprinkles of comedy throughout that showed the film didn't have to take itself as serious or pretentious as some other films with same subject matter have.Direction wise the camerawork is also very crisp and very well done, and the SFX add a lot to the experience. What really shines as i already mentioned, is the extreme attention to detail in the makeup/practical effects realm. To make a great creature/feature horror film, these are integral. To see a film in 2020 utilize that good old fashioned practical craft over CGI effects is very commendable and refreshing.There are some moments that many will find cliche, and a few twists that may seem a bit unnecessary, but few and far between when considering how well done this lower budget film ends up finishing. Overall it's a fun throwback and a very straightforward horror film that gives the visual goods and the ominous feel that should come with its subject matter."}, {"id": 168, "text": "I'm not sure was it the buzz going around before the release or what, but right off the bat I can say that, among other emotions, I'm also pretty disappointed. The Wretched is a reasonably well made horror movie, has all the typical makings of one - including a story that's pretty much put together of multiple familiarities, portions of Fright Night, The Witch, Rear Window (or Disturbia, if You will), plus some body horror, and a kind of 80's feeling that seems to have stayed more of a goal than an achievement. Overall, The Wretched comes across as... fundamentally basic.There's a story, and it flows evenly, it entertains, accompanied by a romp of characters, decent gore and cinematography. The problem is, it does so on a surface kind of level. The Pierce brothers utilize a wide selection of familiar tropes, ordinary devices and old tricks, perhaps trying to weave together something new, but ending up just uninspired. The plot follows a teenage boy who's struggling with his parents divorce, and has come to spend some time with the father, but life gets complicated when he notices something weird going on in the neighbor's house. An old, evil witch has come out the forest to mess around. Everything that can happen, will happen, love interest, conflicts with town bullies, conflicts with father and his new girlfriend, and other plotlines go where one would expect to as well. The characters are not the best ones to get behind for, and the evil presented lacks real dread and character Overall there's just no real delving in the psychology of what's happening, fear or mystery. However, everything works, but on a basic level, a kind of a flat line. Performances were okay all around, but some of the characters were given very little to work with. John-Paul Howard as the central hero Ben makes for an okay protagonist, though Ben's got nothing on Charley Brewster. Cinematography and editing can prompt as much critique, though on the background of all that's aforementioned, the visual side of things provided some comfort. Always extra appreciation for good practical effects, gore and such. Lastly, the original score, was, guess what, mostly as uninspiring as the rest.I believe The Wretched is perhaps a better horror movie than I've described, but, personally, I find the best words for it are fundamentally basic, which is why I'm recommending this to those less familiar or accustomed to the horror genre. My rating: 5/10."}, {"id": 169, "text": "This is a fairly run-of-the-mill Goosebumps-style story. A fair assessment would be Fright Night mixed with Friedkin's The Guardian and a bit of Rear Window. The plot is not revolutionary by any means but there are some surprises including a nifty twist at the end involving one of the horror cliches that the film uses repeatedly to signify the presence of evil.It doesn't look cheap or filmed by amateurs. So it does have some production values like proper cinematography, music and effects. The experienced cast is good for what the film is.There is an attempted extended metaphor involving how divorce can affect children. I am not sure it is too clear or even works. But it is something to think about.Overall, it is not mind-numbingly bad or insulting. It worked for me."}, {"id": 170, "text": "The Wretched is a lovely looking movie. Nicely acted and shot, with decent, practical special effects. I struggled with the story, which was ultimately a bit un-interesting.Ben visits his father at a lakeside town. Some kind of demon-thing lives under a tree and has the power to cast a spell on people such that they 'forget' about the existence of loved ones around them. Paranoia sets in for Ben when neighbours are acting strangely ...It's a well-edited mainstream pleaser but hanging off a story which doesn't add up very well. Some elements are great but it feels like another short that has prematurely evolved into a lacking feature, devoid of tension and scares.It was well-received at FrightFest; I felt I was in the minority who didn't quite get it. If you're a fan of spooky, ghost/wraith type horror, it's entirely possible you might enjoy The Wretched. I didn't dislike it but nor did I take much away from it."}, {"id": 171, "text": "Two brothers to team up to write/direct a new horror film. While the lore is rich and designs are great to look at, the story is cliched and matches the tone of trying to be a cool 80's/90's film. While it is trying so hard to do this, it fails spectacularly. The characters are flat and one dimensional with dialogue to match. What is a really great concept fails under the creative hands at play here resulting in a movie to definitely miss.The main story follows Ben (John-Paul Howard) a recent child of divorce who is sent to live with is dad for the summer holiday. Liam (Jamison Jones) owns the marina and puts Ben to work where he meets his summer romance Mallory (Piper Curda). Things seem to be normal in this beachside town when one night Ben hears a noise on the roof. His next door neighbours seem to be acting weird and after the disappearance of their kid (and memory of the incident!) he explores the lore of a witch who emerges to eat children and then make their family forget about them. As Ben gets closer to revealing the witch, the more that things just go off the rails story wise before whipping into a semi-origin tale for the witch and it just ends on a weird note that sets up a sequel.While the film struggles with the story, the visuals are incredible. the design of the witch and the forest she inhabits utilises practical effects and is the best part of the movie by far. There is a creepy skull device that a lot of characters use as they get possessed by the creature. It is definitely effective and works well with the Witch's look. The tone of the film is trying to be a movie of the week horror film from the late 80's/early 90's and while it is trying to pay a homage to this, it just comes off as cheesy and outdated.The performances from the cast can easily be forgiven due to the material they have to work with. It's unfortunate that a diverse cast get lumped with one dimensional characters and throwaway lines. It's a shame that a great concept went to waste, the film probably would have succeeded under a different director and a hefty re-write."}, {"id": 172, "text": "I recently had the choice between going to The Wretched or We Summon The Darkness, so I chose the former because the latter's trailer already seemed to summerize the entire movie, including the dark twist (great job, marketing department!). Since I had heard very little about The Wretched and never saw the trailer, the choice was a no-brainer. Unfortunately, so was the movie.Judging by their IMDb resume, the Pierce brothers got into the trade as story board artists and production assistants. Now some studios make the mistake of immediately putting such novices on a mega-budget blockbuster (Mortal Engines comes to mind) because inexperienced directors can be easily bullied and can't demand final cut. Thankfully, The Wretched is still a small movie, so the fall-out is minimal. I haven't seen their first film, but in their second full theatrical feature, the brothers show little promise.Apparently, we still haven't run out of stories about witches or strange entities that abduct or possess children, but we are arguably running out of talent to do such stories justice. This movie looks, feels and sounds so cheap that it almost seems to have been made directly for television (and I don't mean HBO). The script is badly constructed, full of corny dialogue and horror tropes, and teeming with plot holes. Take the opening scene as an example: it is supposed to set the stage and connect with later events, but it is not even slightly referred to in the rest of the story. Lots of events critical for a coherent story aren't shown, either because of bad plotting or poor editing choices. We are denied a heart-pounding finale because of a few mandatory surprise twists. However, if you think them through, these are mostly twists for the sake of twists: they come out of nowhere (save for some inconsequential foreshadowing), make no sense with what was previously shown, and only reveal a serious lack of internal logic, poor plotting and/or bad editing.However, the Pierce brothers are apparently even worse directors than writers, judging by the absolute inability of this movie to get even remotely scary. The ingredients are all there: creepy monster, nighttime scenes, dark areas, but when the cooks lack talent, all you get are missed opportunities. It's so predictable that I could even see most jumpscares coming from miles away. The problem is that the directors cannot build suspense; because they immediately proceed to the scary part of the scene without any meaningful build-up, it doesn't get scary. Horror doesn't work that way.It doesn't help that the photography is mostly mediocre and unimaginative. Some location shots looking terribly grainy while others do not. Camera angles and motions are often instrumental in building tension, but the director of photography (DP) has clearly never seen a horror movie, judging by the mundane and static shots that look like a holiday home video at best. And when there is finally some excitement near the end, we are treated with nauseating shaky-cam. The only movie sin that isn't made is underexposure, because whenever there is something scary on screen, it is at least well lit.The only person doing a worse job than the writers/directors and the DP is the person responsible for the score. If the photography is uncreative and unable to set the right mood, the music and songs are downright terrible in setting a creepy atmosphere, especially in the first half (it did get better in the second, but I no longer cared by then). The only ones doing somewhat decent work are the actors, especially given what they have to work with. The special effects team also did a hell of a job in creating a convincingly gory monster that has a creative way of assuming identities.This should probably have been Direct-to-VOD here, but lack of competition from big movies was probably the reason it was given a shot in European cinemas. I see this movie even racking up some decent reviews here and there. Now that is the true horror, and perhaps inspiration for a future horror movie: how a disease outbreak creates zombies so starved for entertainment that bad attempts at moviemaking become the standard. Might be a nice companion piece to Idiocracy."}, {"id": 173, "text": "This was a strange movie (not in a good way) that left me empty. Too many loose ends not resolved, and an ending that, if you think about it, makes no sense. I don't like spoilers, but think about what the girl gave the boy at the end, and see if it is remotely logical that she would do that. I mean, the ending isn't original or unexpected, just poorly executed.Overall, the movie just wasn't engaging. The characters weren't developed at all, just superficial, with too little information given about them to make us care about them.In the end, the movie is entirely forgettable. You won't think about it after it is over, because there is nothing to think about. Just a poorly written attempt at combining horror with a teen drama story.Don't bother with this one. If you do, you won't remember it anyway."}, {"id": 174, "text": "A teen moves in with his Dad to take a summer job, but begins to suspect there's something up with the neighbours.As other reviewers have noted, this is well made and produced. Cinematography makes good use of light, the make-up (by Eric Porn?) and effects are stylish, and the experience up to about 40 mins is unsettling, with some well timed jump scares and a creeping fear that made the hair on my arms stand up. Music is elaborate, with plenty of minor keys ever present. The performances are pretty good too, although the bully-boy scenes don't help the story.Overall, though, the experience was middling. There's a phase switch, when the plot self-consciously moves to Rear Window (that's why he's wearing a cast!) with a Body Snatchers vibe, and from there on the fear subsides as I realise everything's gonna be alright. The problem, I think, is the story - a basic quest to slay a monster and rescue the damsel in distress. I think there's a couple of shooting stars in a nod to Spielberg, and he would feel right at home in this world, where a disturbance in the surface of suburban life must be put right even as the uncomprehending adults frustrate the instincts of the insightful hero.There is a strange attempt to enter reverse-domino mode, where a montage reveals a deception in the story telling, so we're forced to re-evaluate everything we've understood so far. But it's so rushed and feels like they're trying to wrench more significance from the story when it isn't there, especially with such simple characters. So, this has lots of resources, but can't get over the fact the premise doesn't have the depth of myth to keep our nightmares alive.In the end, the pointless title sums this up in a way the creators didn't intend. Still watchable."}, {"id": 175, "text": "In fact everything about the films presentation was spot on. The score, cinematography, direction, and practical effects are everything that I want from a horror film. There are good themes of family as well. The Pierce Brothers were definitely going for a old school approach on horror, and I miss that style.As much as I wanna praise the movie for this, it falls flat from the bad script and characters. Everyone is a cliche, from a defiant kid who's had a bad family life, to a generic love interest, and the father who just doesn't understand his kid. I found them very boring and uninteresting. The script was also very conventional at many points in the film. For example the main character does a Google search and now knows nearly everything about the witch. We also have the kid get bullied for no reason, I'm so sick of this trope in these kind of movies.My best advice for the Pierce Brothers is to get a better screenwriter. I think they make much better directors than writers. But because of their awesome skills as directors I'm still interested to see what they do next."}, {"id": 176, "text": "The movie is basically a mix between Stranger Things and Disturbia (?) i guess. It's like these 2 products had a baby and were mixed with a dash of witch spices.I didn't like that it really tries too much to be stranger things (or ride the ST bandwagon) but not like with the cool retro atmosphere more a witch setting this time. And very similar to Disturbia with a kid thinking something wrong with the neighboor.It's very basic, story is kinda unoriginal. I think it will please the casual suspense/horror fan because there are twists and when there are twists i always see people overhyping a movie cause they remember the gotcha! moment.But 90% of the movie is very basic stuff, acting was alright, some scenes went absolutely nowhere (Party scene why so long with the pointless pool scene) brings nothing to the story more than a few lines of exposition. The 35 year before intro scene did i miss something linking the two or that was just pointless filler? Some scenes kinda ripping off Stranger thingsIt's alright pretty sure teens will dig it. I'm not trying to be snobbish but it's too teen drama/casual horror for me."}, {"id": 177, "text": "'The Wretched' is an odd movie. There are times where you could completely forget you are watching a horror movie. At times it feels like you are watching a teen-romance, and then it will cut back to a horror scene and you are reminded of what the movie is actually meant to be about. I feel like that is the thing most holding this film back from being great. The best horror films are relentless. They never let their foot off the pedal. Even when nothing is happening the tone should be ominous and tense. I still liked 'The Wretched', but I feel it could've been a lot better in that respect.The film has a decent opening scene which sets the tone for the movie. It lets us know that no one, no matter their age or gender, is safe and that this witch has no boundaries. All the scenes involving the witch throughout the film are very well done actually. She's genuinely menacing and it feels like no character is safe and no ending is off the cards.The scene near the end that should have been the big finale and packed the biggest punch of the film fell a little short. It was too brief and didn't build up enough to have the impact it should've. There is a scene after that however, the final one in the film, that I really liked. 'The Wretched' is a slightly above average horror movie with a solid beginning and ending. The middle isn't bad either and with a few tweaks could've been something special."}, {"id": 178, "text": "My mother has occasionally used the word wretched to describe me; perhaps due to my penchant for four-letter-words. So, when I found there was a movie called The Wretched, I thought; that's for me. However, The Wretched is neither my biography, nor a scary horror flick.In fact, its title might be describing the central protagonist, rather than the witch, which is the film's first major detriment. Ben (John-Paul Howard) is not the most likable character, who can be unapologetically awful to those closest to him one minute, and downright insensitive the next, while also being an obnoxious flirt. Due to this behavior, it can be challenging to sympathize with his character.For context, Ben returns to his father's (Jamison Jones) home - presumably for the summer holidays - in the midst of his parent's divorce, which he is, understandably, none too pleased about. His father runs a boating dock, which Ben begins to work at, where he demonstrates little appreciation or effort, before bumping into fellow employee Mallory (Piper Curda), one of the film's most entertaining characters, being both plucky and witty. Upset that his father is already moving on with Sara (Azie Tesfai), Ben distracts himself by becoming obsessed with his neighbor, Abbie (Zarah Mahler); or, more appropriately, her peculiar behavior, as he comes to suspect that she has been possessed by a witch.Though the witch in question has powers that have been largely unexplored in previous films, it's never fully explained what the full extent of her abilities are. 'How' and 'why' are never allured to either; even Wizards of Waverly Place explained their magic was derived from dragons. Other than being 'evil', obviously, the witch is not particularly sinister in the way she hunts or tries to shield her true identity, say for a couple of moments on screen. Fright Night this is not. Further contrivances arise when Ben conducts research into the witch and immediately finds lore tailored to his dilemma. Even Twilight had more convincing research done by its protagonist.A subplot, involving bullies, who are in the film for all of four minutes, appears to be shoed in as a mere narrative progression tool, while other characters receive about as much depth as a piece of string, most of whom are characterized by some 'thing'; Ben has a broken arm; Sara is a vegetarian; Abbie's husband (Kevin Bigley) is a city-slicker. Due to this, it should come as no surprise that the narrative is very predictable. That said, the film did succeed with its surprise twist.Furthermore, the second major detriment is the horror, or lack thereof. If you've seen the trailer, you've probably seen the most entertaining 'frightening' moments. All scares are accompanied by generic horror music that takes away from any terror that could have been naturally generated, thus warning the viewer long before anything happens.The Wretched has elements of Disturbia, The Hole in the Ground and The Ritual. These movies are horror/thrillers I remember, and unfortunately, The Wretched is largely forgettable, despite the promise you can occasionally witness. It additionally bares similarity to Under the Bed, in that the movie seems to have an identity crisis as to who its audience is: the central figures are teenagers and children, emphasizing the movie may be targeting a younger demographic, and yet it contains sequences of blood and viscera.All in all, The Wretched is passable, but it has little to offer to truly separate it from the quantity of other horror films out there."}, {"id": 179, "text": "I had not heard about the 2019 horror movie titled The Wretched prior to stumbling upon it by sheer random luck. And being an avid horror fan, of course I picked up a copy and decided to sit down and watch it - even without knowing what the movie was about. The cover of the movie was more than sufficient to get my attention.And I will say that The Wretched was a rather enjoyable and entertaining horror movie. It had that old-school style of horror feel to it. You know, like the way they used to make horror movies back in the mid- to late 80s. And that was definitely something that appealed to me.The Wretched had a good storyline and script to it, and writers and directors Brett Pierce and Drew T. Pierce definitely were on the right track with what they had conjured up here. The Wretched was good in the way of building up the story and slowly revealing more and more of what was going on.The movie also had a nice ensemble of cast to perform the various roles and characters. I can't really claim to be familiar with anyone on the cast list, and that is without a doubt something I enjoy; so the actors and actresses are not associated with previously portrayed characters in other movies.It should be said that the horror elements to The Wretched were perhaps subtle to mild. So if you are expecting an intense movie that will leave you cowering behind a pillow or sitting at the edge of the seat, then The Wretched is not going to do the trick. No, this was more of a slow build up of thrills and a sense of dread, and it worked well in favor of the movie.And also the special effects in the movie were good. I especially liked the make-up on the creature. That was just great and it looked really good.Without ruining the ending, but that was just brilliant. I loved the way that the ending was built up and it totally leads you by the nose. I must admit that I had not expected that turn of event to happen at the end. A stroke of brilliance from writers Brett Pierce and Drew T. Pierce.If you enjoy horror movies, then you shouldn't let The Wretched pass you by. It is a movie well worth the time, money and effort. I am rating it a seven out of ten stars."}, {"id": 180, "text": "Looking at the poster and the set, I expected to be routine horror with some intimate scenes thrown at audience. But it hasn't been the routine horror genre these days. I liked few concepts that put in especially about forgetting the children in their life completely. Never thought it could happen to the main characters itself.Screenplay convinced the audience from the main character view. But the story need some work to do, especially character development. I don't mind even if few scenes are cut down and used for witch flashback or about the kid. Having the extra depth of why and how, would have provided more interest among the audience.One thing still mystery to me is how does witch enter the buck while she was in a woman in 1980s. Didn't the witch had any human interaction all this time and needed an animal only? And how come she comes active and leaves without anyone noticing? Only the family might forget about kids but the neighbours, local community, schools would still remember and get intrigued.A thousand year old witch unnoticed till now at least for that town is fishy."}, {"id": 181, "text": "Negative:The acting is a little too focused on the main Charakter, acting not so well...The suspense and creepy moments are too standardized and are forced upon you with exaggerated musicAffirmative:There is a plot twist that I think works really well in the movie.I really like the locationsBut because it's supposed to be a horror genre I found it a bit too lax regarding the creepy factor."}, {"id": 182, "text": "Now the main problem with this one, is the poster. When I first saw it, it almost made me stay away from it, cause it looks so generic, so simple, even low budget you might say. On the other hand, the movie itself is far better than your usual horror, it is one that takes itself serious, makes a nice premise for itself and delivers a well balanced execution. It relies on more than just 2 or 3 actors, so really all in all, even tho it seems to be a small indie film, it is not, it is a rather darn good one.I liked the plot a lot, the dialogue, the characters, it went strong from the start and finishes with a nice touch, so The Wretched, a movie with a name and poster from the 80's, pays homage to nothing but its own idea. I have to say I had fun with it and it think most people will have the same experience as I did. It doesn't go overboard with gore, torture, mostly mystery, it reminded me of Disturbia, just more scary because the genre is horror after all.So of course I will recommend it, it was a good movie, especially for a late rainy night and everyone should give it a chance. Such productions should get more exposure in order to raise the bar a little more for others to come as well.Cheers!"}, {"id": 183, "text": "A thought provoking thriller that follows in the footsteps of many horror classics before it, The Wretched may not be perfect- but it does certainly prove to be a rather fun and entertaining little horror flick. The acting is decent, which is surprising with such an under the radar horror film, but in the end, no performance really proves itself to be in anyway extraordinary. There really all decent, they all try their best, and in the end, you don't end up caring as much about the characters, instead where the story will take them. The script can vary from clever and smart, to formulaic and tacky. It has more than enough clever moments up its sleeve, and it does do a rather good job at keeping you in the loop all the way through. However, where its flaws lie largely in the earlier moments of the film, largely the setup which can seem incredibly formulaic and predictable at times- a series of circumstances you have seen time and time again- especially when it comes to horror. I also wasn't a huge fan of the final conclusion itself either, at least at the very very end that is, though I won't risk spoiling why that is the case, just that it felt uneven considering all that had happened. In the end, The Wretched is in no means a great horror film, but a surprisingly decent little indie flick that I can't help but appreciate in the end. I would be interested to see if a sequel is ever made to this film, not that its needed necessarily, but I feel they can take the story in a direction that is far more worth telling than other horror follow ups in the past. Or at the very least, a whole lot more unique. My Rating: 8.5/10"}, {"id": 184, "text": "The Wretched is a new horror film directed and written by the Pierce brothers, who co-directed Deadheads.The film is about the teenager Ben (John-Paul Howard), who goes through a tough time after his parents' divorce. Ben decides to go to his father in the summer and work at a marina. Ben only bonds with his new colleague Mallory (Piper Curda). The rest of the teenagers on vacation here only make Ben look a bit strange and they treat him as staff. When Ben sees strange things happening to his father's neighbors, he begins to suspect that something is wrong. He finds out that the neighbor is possessed by a year-old witch. Because no one wants to believe Ben's witch story, Ben must investigate what the witch wants and make sure that no one around the marina is endangered by the witch.With this film it seems as if the Pierce brothers tried to make an old-fashioned horror film. With how they portrayed the film and the design of the witch, they did this well, but unfortunately they paid less attention to their script. It never really becomes clear what the witch wants and can do everything with her magical powers. Sometimes it seems as if they have given her extra random strengths and weaknesses so that the story can continue. They know how to create tension in the story, but the film itself is not really scary.This can be an entertaining film for horror fans, but it can also be somewhat familiar. This film uses elements and storylines, which have been seen in other horror films such as The Blair Witch Project, Fright Night and Rear Window.The effects are well and appropriately done. They put the witch in her monster form to a large extent without CGI as a doll and with other attributes in the film. When the witch is in her human form, they show with good make-up effects that she is not a normal person.Another weak point of the film is the acting, because the lesser script makes the characters seem a bit too simple and sometimes a bit too emotionless. For example, as a viewer you don't care much about the main character. The rest of the cast is not really built up. If the witch threatens to do something to someone, you as a viewer are not worried. Piper Curda tries to do a bit of good acting, but her character is not used enough in the story or she is portrayed a bit too forced as the romantic interest of the main character."}, {"id": 185, "text": "Apologies for the Trancers steal but this is a new twist on the old tale of Hekate the Dark mother and its a rather polished performance all round.Plenty of scares , some great creature effects and good acting make this one a cut, slice and chop above most of the horror films this year.One to add to the spooky forest horror tales - Personally i have always found films centred around nature, the woods , trees and folklore rather disturbing and interesting at the same time - Must be something primeval but this adds to the terror especially the scenes underground, it reminds me of films like the Kevin Costner film The New Mother and The Hollow and many others but I feel this one has spun it well with Hekate the witch instead of the usual goblins and sprites and things that go bump in the night.I don't normally like endings which prepare for a sequel but i did like the cryptic understated ending on this one.A good 7 hatchets out of 10 for this one!"}, {"id": 186, "text": "This was a movie that I saw a bunch of people on podcasts covering and talking about, so I asked Jaime if she wanted to watch this with me. Since she agreed, this is my 2020 release for a podcast so I can keep up with my new horror film watching. Other than that, I came in blind. The synopsis is a defiant teenage boy, struggling with his parent's imminent divorce, believes that something is wrong with his neighbors that might be based in the supernatural.Now I did doctor the synopsis as I think it spoils things and one thing that I really enjoy about this movie is that, we see things going on, but it is also from the point of view of as the synopsis states, a boy that is a bit troubled.We start this all though 35 years ago. Megan (Sydne Mikelle) is going to babysit for a family and it is raining outside. She knocks at the door and no one answers. She goes around to the side door where she calls her mother to let her know where she is and what is doing. There are some flowers that are dead and she finds a picture of the family. The husband's face is crossed out. She hears something in the basement and goes to check it out. This will be the last thing she does.The movie then shifts to someone's face in water and they're moving around back and forth. It then tells us that we're 5 days in the past. Ben (John-Paul Howard) is on a bus to visit his father. His arm is in a cast and an old woman comments on him being an artist. He is dropped off and he goes into the gas station where the proprietor is out fishing. There's an honor system and Ben at first ignores it, but he's growled at by the dog.Ben then meets up with his father. They have dinner while Ben plays Connect-Four. Liam (Jamison Jones) and Ben have tension, but his dad is trying to work through it. When he asks Ben if they want to talk about why his arm in the cast, they don't get anywhere.To fill you in, Ben's parents are going through a divorce. Ben is a bit more upset that his father seems to already have moved on as he's seeing Sara (Azie Tesfai), a young woman who works at the marina that Liam seems to be the harbor master at. Ben is going to work there for the summer where he meets Mallory (Piper Curda), a quirky young woman. He also meets a group of rich kids where one of the young women seems to be making eyes at him.Liam lives next to a young family of Abbie (Zarah Mahler), her husband Ty (Kevin Bigley) and their two children. The elder boy is Dillon (Blane Crockarell). Him and his mother go into the woods to explore where he finds an odd mark on a tree. This is the same mark that was on the door 35 years ago. It is an upside triangle, almost like the anarchy A, but it is probably representing a deer skull. Dillon then hears something and sees a creepy hand coming out of a tree. His mother gets him and they leave. On their way home though, they hit a deer and since Abbie's father was a hunter, she decides to bring it home.Things get weird that night when Ben hears something on his roof. He goes outside to check on it and it moves over to his neighbor's. He thinks it goes under the porch, but he notices something perching on the railing. That's when Ty asks what he's doing. Ben makes up an excuse and the two go to bed. The following day, Abbie gets attacked by something and goes off into the woods. Ben tries to point this out, but he makes a mess of things by not coming to a dinner that he suggested and put on by Sara. We also learn about something he did that caused him to be here for the summer and he isn't the most reliable.Now that recap ran a bit long, but there was a lot I felt I needed to establish before moving into what I thought about the things that we get in the movie. With that out of the way, I thought that the cold open was interesting in giving us what to expect later. This movie really doesn't waste time getting creepy and it never goes too long without giving us something which I can appreciate. Parts of this creature and the story work for me while others don't. The first being that we see what happens to this initial scene, but aside from establishing as I said. It really doesn't come back to that.What I do like here is we aren't messing around whether or not there is a monster. The movie does play with no one really believing Ben, but I like that. It is a cliché to have a flawed character like him. I'm fine with it though, especially with a reveal at the end of the movie. This really confused Jaime and I do think there's a bit of issue with it myself. The movie is making us think that Ben is sent there because he got in trouble, but there's actually more to it which I liked.This is slightly problematic though. Since this gets revealed pretty early on, Ben learns about the entity through a website called 'Witchopedia'. The lore they're using for it seems to be very similar to a Changeling that takes the form of people, but it doesn't use all of the aspects. Using the deer skull also made me think of a Wendingo as well. It really just seems to be borrowing aspects of both for what we get here. I'm fine with that since it is creating something. What it does though is eat the 'forgotten'. My problem here is that Ben seems to remember those that are forgotten where other people don't, but there's something he does forget. It just seems inconsistent in my eyes and really just altering things to progress the story.What I did like though was the acting. I thought that Howard was solid as our lead here. Even though it is a cliché, I like that they make him a flawed character that we can't believe. Plus he does some crappy things to Mallory, Sara and Liam so we don't love him. I like my heroes to be like this. Curda is solid as his quirky counterpart who is more grounded and not really believing him. I think that Mahler does a really good job at being the character. We get a slight baseline of her norm before she changes. There's quite a bit of children actors here which I thought were fine. Overall I'd say no one really had a bad performance and I commend some of them for a reveal as well.The last thing I really wanted to delve into would be the effects. It is movies like this that I get a bit nervous about since they tend to go more CGI heavy. This one does seem to go CGI. I don't want to give the impression that it doesn't. There are some really good aspects though that is done practically. Having The Wretched shown in darkness is good. The glowing eyes are creepy and what they do with the CGI to enhance worked for me. The only issue I really had was a gunshot as I could tell that was done with computers. Cinematography for the movie was also well done.Now with that said, this movie I was glad I gave it a viewing. I think that we have an interesting concept here with a creature that for me borrowed from a couple different things to make it its own. There are some slight issues with logic that I had, but the acting was solid. The effects for the most part are good. I never got bored and the soundtrack fit for what was needed from what I could remember. For me, this is a good movie in my eyes. It also has the potential to be one of my favorites of the year thus far."}, {"id": 187, "text": "In writer/director duo Drew T. Pierce and Brett Pierce's coming of age horror movie The Wretched, 17-year-old Ben (John-Paul Howard) busses into the quaint, boat-slipped town where he and his dad Liam (Jamison Jones) are spending the summer.As Ben tries to acclimate to his new summer digs-complete with the 'warming up to dad's new girlfriend' and 'trying to fit in with the local townies' tropes he begins to observe strange occurrences coming from his next door neighbor's house.Unbeknownst, a witch has made the house its new quarters and begins to cast a spell over the townsfolk, causing them to forget their children so that it can easily devour the forgotten ones without a tussle (smart).When children begin to go missing though, Ben's suspicions turn real and he must devise a plan to stop the witch and save the children. However, with a checkered past including drug use and stupidity-jumping from a second floor window-resulting in a broken arm, Ben is up against a wall as he finds it increasingly difficult to find people who believe in him.With elements of Fright Night and The Lost Boys-meets Invasion of the Body Snatchers-all while on a snoozy summer vacation, The Wretched replaces vampires and aliens with a pagan root-like witch that prowls the woods and makes pit stops into peoples homes and eats their children.There are no bad shots in The Wretched. Kudos to the Pierce Brothers for being natural born purveyors of horror. They know how to tell an effectively scary story. The dialog too, thank god comes off as natural and the acting is good-all of which creates a solid foundation for a decent creepy summer movie.As always, there will be naysayers whom gloss over the accomplishments and only focus on the flaws. And The Wretched is certainly not without flaws. But follow through and you may be pleasantly surprised that more than a little thought went into making this film, and it shows."}], "reviews_amount": 188}