{"name": "No Escape", "titleId": "tt08160834", "reviews": [{"id": 0, "text": "If you enjoy any sort of horror creepy genre, then you'll see this movie coming a mile away. I was sort of excited to see a well filmed horror piece as I hit play, but honestly I knew the ending before the first 20 minutes. Yes it's been done, no it wasn't that great, if you're looking for a better version, try The Game, if you're looking to waste time and be a little entertained, try this."}, {"id": 1, "text": "At the end the main character thinks all his friends have been killed by a sadistic gang so when he runs into the boss of that gang he batters him, naturally. He kills him all while his friends, whose deaths were just part of a big ruse to prank the main character, just stands there watching with their mouths open. At least fifteen people just stands watching while their best friend is in the process of killing an innocent guy. And it is totally their fault that he kills him.Up until the end the movie was quite alright, an ok hostel rip off with a bit of social media thrown in there. Perfectly fine. But oh my god what a stupid ending. They planned this prank so meticulously and yet they didn't think about having someone else than the main antagonist doing the big reveal?? Perhaps one of his best friends would have been a better choice.. Maybe? The ending brought the movie from approx 6/10 down to 3/10.By the way, I recognize the main arc of the story from a great episode of Twilight Zone I saw 30 years ago. It's the one where a woman is secretly planning her husbands birthday party and he thinks she is cheating on him (because of all the secret phone calls and hush-hush). And so he kills her on the day of the celebration and drags her body into a room where all his friends are just waiting to get the party started. Haha. Exactly the same ending. But that episode was so much better than this movie. Thank you for reading this far. All the best /Leif."}, {"id": 2, "text": "The film starts slowly and is not very interesting. Well copied at hostel, saw and escape room. Not a good film, although the film does have some nice moments"}, {"id": 3, "text": "What a friggin bore !!!!!! Do not waste your time. Was so boring &amp; predictable !! You can see whats coming from the start. Badly written &amp; even worst acting. None of the characters are likeable. Keegan Allen can't act his way out of a paper bag. Give this one a big pass !!!"}, {"id": 4, "text": "This movie is nothing worth remembering. I enjoy Holland Rosen as an actress; so I gave it a go. The story is been there, done that 100% nothing new.The lead is absolutely horrible at acting; but that's nothing new either as he was when he had part in Pretty Little Liars as Toby also. 5 years later and zero improvement on acting skills.The story is predictable and the ending is absolutely trash. A whole room of friends that weren't really killed standing around in the dark as they watch their best friend murder the man he thought had killed them all- only top pop up after all surprise; you were pranked only to gasp at the dead man on the ground and then cut to credits.It was a brainless way to fill time but made entirely unbearable by the ending."}, {"id": 5, "text": "I pay to see this crap so you don't have to. I'm doing you a solid on this sequel to Escape Club by saving you both money and precious time. That movie had some merits, but none of these characters have redeemable features and you hope they all die a horrible death. The build up prelude character building for the first 20 minutes is a complete waste of time, just start at the Escape Room and dial it up a notch. Lousy acting, aimed at 12 year olds &amp; predictable script...that sums it up in a nutshell. I'd be surprised if you don't guess the ending in the first half hour. It's a wannabe Saw and Hostel torture fest set in Moscow, Russia with a mindless, selfish Social Media Influencer as the hero. He doesn't get it, but he would if he'd watched Michael Douglas in The Game, because this movie is a bad xerox copy....but the printer ink ran low. Please give me some brain food 'cos this ain't it. First movie I've seen on the big screen since World War C started and cinemas reopened was very disappointing."}, {"id": 6, "text": "The highlight of this film is Keegan Allen's performance. Playing an obnoxious Logan Paul social media influencer type character you can't help but hope he gets killed first. However he ends up being one of the few redeeming qualities of this film.The film takes a while to get going trying to get you to care about the characters but you won't. Once it finally does - you find yourself watching a crossover of Escape Room, Saw and Hostel. All far superior films.My partner was bored and predicted the ending however I was still entertained and was very intrigued as to how it would all end. Once it finally does - you're kind of glad it has. It is not a terrible film though and is still worth a watch for any fan of the horror genre."}, {"id": 7, "text": "A mashup of different horror/thriller movies. Not real expensive to rent, but probably only worth it if you're completely new to watching horror movies. Otherwise you've probably seen similar movies that you might like even more. As far as the movie it got a lot of suspense. I liked the characters and I thought the Russia environment was creepy. I only thought the ending was rushed. It was the opportunity to give some depth and meaning to the story as social media played a big role in the movie. Overall the movie is a bit flat but does have a certain charm to it."}, {"id": 8, "text": "I saw the movie last week. A real waste of time, the trailer created some expectations but it was low, giving me that feeling, yeah I regretted going to see it"}, {"id": 9, "text": "This film was incredibly cringing and had no storyline to it."}, {"id": 10, "text": "Brainless entertainment, that's about it. It tries hard to be a mix of Hostel and Saw. If you can get past the cringingly bad lead actor, and most of the beginning, it's decent."}, {"id": 11, "text": "-------------------------- Spoilers -------------------------------------------- ........ ..... .... ..... .... ... ...... ...... ...... ...... ...... ..... ..... ..... it's 99.9% The Game (1997), amped with unnecessary violence, which is why you see so many reviews here relate it to Hostel (2005), and the Saw films (2004+).It's literally The game all the way through, right up to the same ending where they all show-up, alive and well, to celebrate his anniversary, except he actually kills a guy.That's it, that's the sum total they added 23 years later to David Fincher's masterpiece. None of The Game's finesse, pacing, storytelling, cinematography, camerawork, scripting, dialogue, acting, etc. Nothing.The pitch was literally hey studio guy, wanna re-make 1997's 'The Game' except with an additional twist where he kills a dude?Utterly disgraceful."}, {"id": 12, "text": "It's oretty fun. A little slow but creepy undertones and then some good scares. Definitely watch it we had fun with it! Very watchable"}, {"id": 13, "text": "If Saw, Escape Room and Hostel had a baby. Just a fun little movie. The ending though...."}, {"id": 14, "text": "Actually, the first half of this movie is better than the second half. The second half just wants to be a poor remake of Hostel and Saw. I don't want there to be any spoilers in my review, but let's just say the ending could REALLY have been better. As for the acting, it was mediocre at best. If you're like me, though, and you've absolutely run out of movies to watch, I gave it 5 stars only because everything else that's new sucks worse than this."}, {"id": 15, "text": "The movie starts off a bit hopeful, with a nice suspicious setting and a likeable cast of characters going to the event in Russia. All of that is lost immediately when the escape room part of the movie starts and it becomes an extremely prolonged chain of somewhat scary scenes and random mutilation. Not recommended for anyone."}, {"id": 16, "text": "I told my friends from the first 10 minutes what was going on. What would happened. He asked me how I could know that?! It's easy really, I have seen them all, movies since before 40 years ago. Seen them all. How the angles of the scenes were presented, the layout and all that. It's not a bad movie, it's fun in a way, just a bit to obvious and really lack of terror and mad gore.Nothing surprised me in this movie and the end I saw coming for a looong time. Too bad, could have been more fun with a better cast and budget. But all in all an OK Sunday night movie to watch in the rain. I have seen much worse.Me and my griends agreed on 6.2/10 Give it a go if you get it for free"}, {"id": 17, "text": "And not in a good way. These guys can perform special effects on the spot like it was a movie? This was so stupid. Also in the end, everyone is watching and filming the main actor, but let's just wait until he kills the guy before coming out to tell him it's all fake?"}, {"id": 18, "text": "Everything about this movie feels flat. From the acting, soundtrack, directing it all feels emotionless."}, {"id": 19, "text": "Disappointing to say the least, I don't know why they even bothered to make this film. I watched the trailer and nothing really intrigued me about it except the two well known actors in it. And that is why I went to see it honestly, gave it the benefit of the doubt. If you are here, looking for an honest review to determine whether to watch this movie or not, I HIGHLY ADVISE FOR YOU TO SKIP THIS TRASH and watch another movie or do something else. This film was absolute trash, a waste of my time and money. Dont believe me ? See it for yourself and get back to me."}, {"id": 20, "text": "It wasn't that bad, the 2nd half got more Interesting and gory. Just a enjoyable movie to watch on a boring evening.."}, {"id": 21, "text": "Good follow up to Escape Room. Second half of the film ensures it's not just a repeat of Escape Room and you start to wonder where the story is going. But the final twist is a little too obvious from quite early on.Nevertheless it still has some fun, thrilling moments and is better than most of the movies in this genre.Some questionable Russian accents that make you think the casting director got lazy."}, {"id": 22, "text": "This movie was entertaining; it really was. But in this case I never believed that the group was in any real danger. Usually my wife catches on to this kind of stuff, but in this case it was the other way around. Up to the end she was sceptical about my assumption but in the end I seemed to be right.The conclusion (where Cole kills Aleski) could have been a little different as far as I am concerned, I think a light-hearted fun ending would have done it more good than this ending, but judge for yourself. You will most likely be entertained for 90 minutes or so. I would have liked a Punk'd ending more that this Punk'd gone wrong ending. Why didn't anyone stop him?All in all an fun movie but when you see the ending coming after the first 15 minutes, it takes away the suspense..."}, {"id": 23, "text": "Well i've got to admit beforehand, I only went to see this movie to still my hunger for the new saw movie. And believe me; it did succeed! Even though the first half of the movie is really (and i mean REALLY) boring, it makes up for it afterwards. This movie is just a mix between Escape room, Saw and Hostel, nothing more nothing less. The only thing they added is the 'influencer' part, but it doesn't add much and you'll probably forget it during the movie. The ending is f- up and makes the movie 'better', but you'll probably see it coming from miles away.One of the most annoying things is that this movie is filled with things left unanswered or unexplained, in a way that the whole thing just doesn't maken sense in the end. Saw fans might be used to it but I can believe anyone else will be a bit frustrated afterwards.In the end; a fun movie to watch for a night out with your friends!"}, {"id": 24, "text": "Like a cross between Saw and Catacombs. The main twist is a direct lift from Catacombs so it came as no surprise, which is a shame as it really was the only thing going for the movie."}, {"id": 25, "text": "Story's been told a dozen times before and way better than this. None of the characters are worth caring enough about to invest any emotion like you would a good movie."}, {"id": 26, "text": "What are the haters expecting when they watch a film like this. To me this Hostel-inspired horror film delivers on all levels. The acting is above expectation in a low budget with no-name-actors and the story works well a through.Sure the main character makes some questionable decisions, but that is kind of a part of the concept. Plus, the character isn't portrayed as the smartest kid on the block which makes it even more plausible.I like it a lot and recommend it to anyone who likes the genre."}, {"id": 27, "text": "This super low budget movie is just another imitation of a real horror flick that fails miserably. The main character is so incredibly annoying he made me want to turn it off after the first 10 minutes...but against better judgement I stayed till the end. The movie never gets off the ground. The premise is laughable and the characters have zero depth to them. 92 minutes felt like 300."}, {"id": 28, "text": "I think some of the comments here are too harsh. It was deff worth the watch better than a lot of movies that come out these days."}, {"id": 29, "text": "Absolutely loved this movie!! Great cast and story, reminds me of The Game."}, {"id": 30, "text": "It is a visually nasty movie. Screams and blood all the way. Story itself is boring. I went out after one hour. Could not watch it any more. Why do Russian characters speak broken Russian and good English? Sounds ridiculous. It should be opposite."}, {"id": 31, "text": "Gave it 10/10 just to get the rate a bit up, it is really a good movie, would be a 8/10 from a Big time horror fane! Defiantly a good movie, worth a watch!"}, {"id": 32, "text": "Imagine ripping off 'Hostel', 'The Game' and 'Escape Room'... There is not one original idea in the entire film.It actually gets to the point where you lose all empathy for these characters and don't really care if they make it or not.I'd recommend watching one of the original movies it rips off than waste your time here."}, {"id": 33, "text": "Follow Me turned out to be a highly derivative survival thriller that doesn't boast the chills, thrills, or even the gore. The lead character here is a vlogger, so expect all the baloney that comes with it. The film plays out like a mish-mash of Saw, Hostel, The Game and several other superior thrillers. The familiarity of the traps, dares, and torture chambers put me off. The lack of a strong protagonist (or antagonist, for that matter) can be felt throughout the film. The final twist (which I saw coming a mile away) wasn't good enough to call this perfectly serviceable piece of trash entertaining. Leave your expectations in the bin!"}, {"id": 34, "text": "World class crappy acting with a story that could have been something but unfortunately, it has not. It's a terrible version of a mix of Hostel, Saw, Escape Room, and The Game. Seriously, if you don't get the ending from the very 1st 15 minutes maximum of the movie, then you deserve to watch it! I am very generous for giving it 2, just because I have seen worst movies."}, {"id": 35, "text": "The spirit of Escape Room has risen but this time it is darker and more gruesome. Regardless of any plot deficiencies, it does its job by keeping you on the edge of your seat. Cast including Pretty Little Liars' Keegan Allen portrayed their characters very satisfactorily."}, {"id": 36, "text": "This movie should be R18. Very violent and graphic. Make saw seem like sesame street"}, {"id": 37, "text": "Perfectly cringey in the best ways. Keegan Allen was completely believable as a vapid vlogger. I called the ending, but noooot quite in that spectacular way. This concept was great and I would watch a million more like this. Give me allllll the escape room content. This is 100% worth it and you should totally watch it."}, {"id": 38, "text": "Even I liked movies like Saw, Hostel and Escape Room, this one is by far inferior to all of them. First, it's not original and extremely predictable to Horror fans. Second, acting is pretty weak. Not credible and amateurish. Last, if you're going to copy a movie (The Game) just do it better. So, overall a missed attempt to create something different. Looks like we are living on the era of coly and pasting everything. This means same old script with just a new few likes. Terrible."}, {"id": 39, "text": "I like to think I have decent taste in horror- I really liked Hereditary, Get Out was pretty good, I loved the first 3 Saw movies, The Ring (or Ringu, really was superior), The first Grudge, and I may be in the minority when I say I enjoyed Hostel (mostly). This will definitely make you think it's a lower budget Hostel take off in some parts. That said, it is NOT the 4-or-less star movie most are rating it. I even found the first act engaging enough to keep my attention. The lead was really very good, though I really only found him annoying in the first 10 minutes but after that I forgot I was supposed to consider him a one dimensional influencer vlogger etc-type. The real deal versions of these people are much more soul-sucking. You may find the gore was just right especially if you're like me and don't need much to appreciate horror &amp; some movies just overdo the gore to make up for substance- this movie has enough substance they didn't need to. I won't spoil it. You may understand what's going on but it's worth the watch anyway. Seriously not near as bad as some are saying and kept my interest til the credits."}, {"id": 40, "text": "This is the story of an adventurous boy who tries to do dangerous adventures for his audience. He is preparing for his upcoming adventure which is an escape room experience in Russia. I like the story. The decorations of the scenes were awesome. Background music and sound effects were nice. I liked the ending. In summary, I recommend this movie to horror and thriller genre fans."}, {"id": 41, "text": "Epic i should say, this movie is good. I really didn't expect the ending. It was surprising, horrifying and funny at the same time."}, {"id": 42, "text": "Saw this little gem last night. Originally titled Follow me, No Escape is like a mixture of Escape Room and Hostel as a group of youtubers find themselves in a horrific escape room in Moscow. It's nothing you haven't seen before but it's fun and clever with some insanely suspenseful trap sequences. Plus it stars sexy ass Keegan Allen and Teen Wolf's Holland Roden. The performances are tight and even though it ends up somewhere familiar the journey is refreshing and well executed.***.75/5 Eric: 4.25/5"}, {"id": 43, "text": "I loved the plot, it had some gore, and the acting was good! I'd say this is a great movie because it is a perfect example of how something like this could go wrong. This is the kind of ending I expected while watching the movie The Game. I really thought it was well done; very entertaining!"}, {"id": 44, "text": "The main reason for why I watched this movie was for George Jankos appearance, although it was definitely an interesting concept for the main protagonist being a big social media star. The movie was slightly underwhelming, but had a great plot twist for an ending. The movie itself is definitely heavily influenced by classic and popular horror movies. I definitely think its worth a watch, although many gave it low reviews its really up to the same standards as many horror movies produced in recent years"}, {"id": 45, "text": "It's better than what I thought, idk why it's getting alot of hate but i actually enjoyed it and the end wasn't expected at all. However it was a mix between saw and escape room. Anyways it deserves a solid seven"}, {"id": 46, "text": "If you have a sweet spot for early 00's horror (a la Hostel, Saw, etc) you will like this movie. I have a pretty diverse taste in films.... but I can also appreciate this for what it is - a cheesy horror film. Don't go into this movie expecting anything groundbreaking. But, it is good for what it is. As many have said on here before, it is basically a twist on Hostel/Saw. If you're someone who complains about how overdone that genre is, then just don't even watch it. Otherwise, enjoy!"}, {"id": 47, "text": "After watching The Game Night, I was 98% sure at some point that this all isn't real, even deaths of his friends. His reaction in the end though, is understandable. They needed to think of a better way to explain him first that this wasn't real before he met the guilty man. Didn't like the ending though. Or Alexey should have stay alive or, at least, one post-credit scene with consequences of unintended murder for Cole. The idea that he should have think from time to time what he cares more about: his girl or cool content for the followers; his friends or his own life; can he make decisions by himself, without followers etc. - is great stuff to think about, as bloggers/vloggers are usually even more addictive to followers opinion than it's showed here. At the same time most of them don't even express their opinions anymore, as they need to please their followers or companies paying for ads.Accent of policemen in airport was funny, I mean too obvious it's not Russian people. Nice effort of actors though, Russian was fully understandable. Alexey's my ne hochem problyem in place of my ne hotim problyem was too🤦🏼🤦🏼🤦🏼 I mean, he plays Russian man, his accent even wasn't bad, actor did a good job, but filmmakers should get grammar of such simple phrases straight, it's not that difficult, especially when you have some Russians in cast. Executors were funny with their stupidity at some point."}, {"id": 48, "text": "The characters make the dumbest decisions. The main protagonist is frustrating stupid and irrational. You can see the ending from a mile away. The ending is garbage."}, {"id": 49, "text": "Ideas from Saw,Hostel etc.,just like everybody 's saying...To be a horror .It would have to be waaaaay better , even to compare with above mentioned films...One thing,though, personally,i think the ending was reasonably redeeming. To watch , only ,if like me , you run out of anything worthy to see."}, {"id": 50, "text": "Basically this movie is sort of like The Game with a touch of Escape Room set in Russia about a rather obnoxious social media streamer/influencer who goes on vacation and ends up in a scenario that's more than he signed up for.It's well filmed so as that the things happening would be believable. It's just predictable as can be. It's not really so much horror as a thriller. Watchable enough if you don't expect much out of it. One trick pony once you figure it out."}, {"id": 51, "text": "If there is one thing i hate in today world its social media, wanting an audience, living to get likes and subscribers.... this is how low humanity has sunk.Its always fun to get a movie where low life idiots like that get waked."}, {"id": 52, "text": "I don't normally write reviews but I never saw that coming. I watched it for the actors keegan and Holland. I wasn't expecting much but it blew my mind."}, {"id": 53, "text": "Not sure what all these people on this post were watching but it can't be the movie I just watched. My heart was racing pretty much through the last hour of this movie. I thought the setup was fresh and believable and contrary to what these people in these reviews say, this was A quality acting. The theme was great. The traps were enteresting and even though I kinda toyed with an idea for a twist before it came to pass, you still don't really know until you do. Its a gripping rollercoaster ride of suspense and dread in ways that aren't necessarily familiar or overdone. I gave it 8 stars because I really wanted to see more post resolution but all and all I loved this movie start to finish, and im sure you will to despite all of these cheese and wine critics up in here lol"}, {"id": 54, "text": "Like many of the previous reviews state this is a mash up of saw, hostel and escape room with a sightly different ending. Its perfectly watchable, funny and tense in places. It worked... but for avid horror fans its nothing ground breaking. Then again I must reiterate the watchable part of my review. So many horrors now are abandoned half way through (if that) because they suck! Point added for maintaining the interest to the end!"}, {"id": 55, "text": "I was that plot coming from the start, can someone write a decent horror script please?"}, {"id": 56, "text": "It's not that bad ,but predictable The end was the worst part because (Spoiler) they would have stopped him from killing the boy, so unreal scene ! Scenario was nice ,the idea was nice"}, {"id": 57, "text": "So this is an otherwise pretty mediocre flick that takes some of the better ideas from others in the genre like Hostel, Saw, etc. The biggest rip-off, however is from the 1997's The Game. The difference is that the writers of The Game had a higher IQ than that of a spud, so when everything came together it was an actual surprise ending. This one is so poorly executed and clearly telegraphed that my eyes rolled so hard I nearly snapped my optic nerve. There's even (and I quote) a line in the movie that says hey, what if this is still part of the escape room and it's not over? I guess this movie either thought it was being so clever that nobody would get it or that it's audience is braindead.In any case, the movie is actually not too bad until you get to the ending. Where the audience is supposed to believe that the people who were capable of putting together a scheme so perfect that they can predict where everyone would go, tie up all loose ends, have contingency plans for all possible options...and yet they would not see that putting the main culprit, unarmed, within an arm's reach of a man pushed to the brink of his sanity...could lead to an injury to say the least. After the protagonist has been lead to believe he is in the hands of a sadistic Russian mob who have just dismembered all of his closest friends and now his own life is forfeit, they decide to put the guy who lured them into this mess next to him with just a phone and a smile. Oddly enough during the moment of righteous anger nobody tries to stop him or is near enough to yell something, and yet a few seconds later the room is filled with all the cast of the escape room, alive and well. There is suspending one's disbelief and then there's this utter nonsense.Just go watch The Game. It does everything that this movie attempts, just far far better."}, {"id": 58, "text": "The beginning was rather boring and a bit long, the fake escape room not as thrilling as I expected it to be, but the ending was unexpected but unnecessary, I would never forgive anyone who pulls a stunt like this on me"}, {"id": 59, "text": "Too bad. I was really hopeful that this might have a twist or be more interesting than the ending you can see coming a mile away. But no, the writers chose to just copy many other movies, and make us feel like watching to the end was a waste of time. Minimal gore, minimal interesting contraptions and puzzles, that have all been seen and done before. Sadly, they weren't creative enough to come up with any ideas of their own and even took from Die Hard 3 and Saw, which were much more creative on all counts. The first movie to come up with the same ending back in the 1970's was seen as clever, but unfortunately it's so over done at this point, that it just seems boring by 2020.If you don't mind rewatching the same ideas from many other movies, just done a little more boring, then you may enjoy this film."}, {"id": 60, "text": "You know a film is going to be bad when you hope the main protagonist will be killed as soon as possible. The acting is weak and cringy for the most part, the plot itself on paper is not bad, but wow this was an awful execution. This movie should be nowhere near a 5 star rating."}, {"id": 61, "text": "What a craizy fu..ed up movie!!! I mean.. I have seen it coming but.."}, {"id": 62, "text": "The whole thing is not bad at all, the story is kinda fun to watch, but when you are doing a semi doco or presenting in a live stream situation, you need some really good actors to make it looks nature and real. Sadly it didnt get the better casts, main male and female roles are both not acting that nature or real, thats why christopher nolan had the good scripts and still needed the good actors to play them."}, {"id": 63, "text": "An interesting horror film with an ending that I predicted almost from the beginning ! The acting is so and so, but the idea of the film (internet popularity driven to the extreme) makes this a must watch, especially for the influencers of our days, but also for the people that spend way too much time on social media platforms !"}, {"id": 64, "text": "The first part of the movie is entertaining.. we can see nice places from Moscow and its night life As in hostel In The second half of the film the horror part starts. It is more than evident that everything that happens is a set up for the main actor as he escapes from all the rooms and from the killers very easilyBad effects, poor acting"}, {"id": 65, "text": "I wasn't rooting for any of the characters. They were all so annoying that I couldn't wait for them to be killed.Called the 'twist' right from the bar scene. Too obvious.Few plot holes.The gore at end was nice.Silly film but I've seen far worse so check it out if bored one evening but dont expect anything original."}, {"id": 66, "text": "Too many similar theme when hear the name of this movie and make me huh, should I watch again? With all the YouTuber starting and make me feel, huh, should I watch again? It's kind of terrifying for all the background and the ending quite a good one. I think all the pranks done by YouTuber should watch it. Quite inspiring."}, {"id": 67, "text": "What I appreciated most was the intro to the story and the gang of characters (youtubber and his friends). There is a good mix of things, survival and escape with pieces of Hostel-like atmospheres mixed with an initial Escape Room scenes. It is an ok or also good movie within its horror-slasher category."}, {"id": 68, "text": "Saw the ending a mile off. If you're looking for Something to have on in the background whilst playing with your phone then this is the film for you."}, {"id": 69, "text": "Think 1997's The Game (Michael Douglas), with some variants.Passes my current standard for entertainment- no identity politics, no social agenda message, no pandering to special interest groups, which Hollywood focuses on too often instead of plots"}, {"id": 70, "text": "This concept was done a thousand times more effectively in 1997 when it was called The Game. Adding in Hostel and Saw inspired elements does nothing to help this (mostly) bloodless mess."}, {"id": 71, "text": "This movie is amazing. It's nothing like the other horror movie. The story line keeps you on the edge of your seat untill the last minute of the movie. The acting and the casting is amazing."}, {"id": 72, "text": "This was far more chilling, captivating, creepy and scary than the higher budget Escape Room that came out 2019. It's a total throwback to the old school Hostel movies. The mid-range rating for this I don't understand. One of the better horrors I've watched in a while! Definitely recommend!"}, {"id": 73, "text": "We are avid horror movie buffs and have been since the 80s. (We are in our 50s). We rarely take a chance on VOD movies because of the cost. When we do, we look for reviews from the popular horror movie websites. What we look for are production value, acting, and escapism. Yes, we enjoy campy horror, gore, and don't mind predictability. This movie checked all the boxes and there were twists we did not see coming. It was definitely worth the rental for hard core horror movie buffs. If you want anything else, like Oscar winning material, look somewhere else. This is dedicated to horror movie fans like us."}, {"id": 74, "text": "So fun and exciting. Sitting in the edge of your seat the whole movie. Makes me want to do an escape room. Highly recommend"}, {"id": 75, "text": "This ended up being a lot better than I anticipated. The Characters are written quite well, and the story is well paced &amp; interesting.. The Main two characters resembled Pewdiepie &amp; Marzia imho. I thoroughly enjoyed it."}, {"id": 76, "text": "Hostel rip off but good. Acting not the best. Good story"}, {"id": 77, "text": "Actually an enjoyable movie to watch. Mix of hostel and saw. Althought a lot of flaw and plot hole in the movie, still better than any horror movie nowaday"}, {"id": 78, "text": "Don't really understand all the bad reviews for this, it may not be great , but it's fairly well done and enjoyable. Keegan Allen does a believable job as Cole, a social media star with a huge following and it's nice to see Holland Roden outside of Teen Wolf. There's suspense , a little gore , and the dialogue sounds about right for the type of people who spend all their time on social media. It's well shot, fast paced, never boring and while it's no masterpiece of horror, I enjoyed it more then I expected and more then these reviews led me to believe."}, {"id": 79, "text": "The wife and I found this to be a pretty entertaining escape room flick. This is the director's second escape room project in two years so you have to think he's improved on and amped up what he did before. We found the premise and execution to be pretty pretty good. In fact, the Moscow setting intrigued my wife enough to want to visit, which we may do via Youtube tour. We really liked/appreciated the current/topical over-the-top Instagram-celebrity thing and how that's kind of turned on our protags. The excitement of the escape room and its turnout in the end, hinges on Alexei's admonition that no matter how real it seems, you're always safe."}, {"id": 80, "text": "I was really impressed with this movie, I had low expectations From reading the reviews. I really enjoyed watching it!"}, {"id": 81, "text": "I found this to be really entertaining. It's not a box office Grammy award movie but it had me at the edge of my seat. Give it a go, it's not bad as some other users are saying it to be as everyone has different tastes in movies."}, {"id": 82, "text": "I watched this movie actually with keeping my expectations low but was suprised to see it turned out to be good."}, {"id": 83, "text": "This movie was great, but I almost skipped it because the trailer made it look cheesy...well, this ended up being a hidden little gem...I'll go far enough to say its one of the best horror movies I have seen this year...Recommended"}, {"id": 84, "text": "This is slasher that is actually not a slasher. Why I say so you will understand by the end of the movie.First half is boring, but intentionally so it gets you in lazy mood like meet whatever and than all of sudden starts happening. The holes many see in plot are not plot holes. They are part of the game.Watch the movie. By the end of it you' ll understand why I wrote review like this and will all male sense. Not a bad movie at all. It shows how games we play for fame can lead to devastating conclusions. Movie is exaggerated depiction of game taken to far. Watch it. Not a bit movie. AND I DON'T LIKE GUTS AND BLOOD ALL OVER THE PLACE."}, {"id": 85, "text": "A combination of 1997 to present day. You'll understand once you've watched it.If you're a film junkie like myself then you'll appreciate the time and effort that Will Wernick and everyone else put in to make this happen.I enjoyed it. Not my place to say where it could have been improved. It is what it is.Thank you."}, {"id": 86, "text": "Scary horror movie worth watching. Not bad at all."}, {"id": 87, "text": "I reckon if you do, that is why people would follow you (on Twitter, Instagram or whatever else there is). I might also refer to something else with my summary line. Something that I personally think most viewers will get anyway. So I would file this movie under predictable. Then again, there's only two options anyway, so no extra points for guessing right.More options it seems than our main character has. And a crazy ending to say the least. Something I always think when I hear of the general concept ... but that's just me I reckon and let's be clear it's nothing that people don't do, no matter how crazy it is. Or dangerous for that matter, as one or more can attest to here. Silly, flat, but to a degre entertaining if you let it ..."}, {"id": 88, "text": "The movie is very good and the end is totally unpredictable!!!!! I highly recommend it"}, {"id": 89, "text": "A popular blogger gets invited with his friends to a Russian Escape Room which was 'especially made for him'. Think 'Escape Room' but replace the fancy decors and puzzles with a grey prison and torture devices.If you enjoyed that one or movies like Saw/Hostel you'll probably enjoy this one, I did. Won't win any prizes but it's an entertaining 90 minutes. Even if I could see that one plot twist coming before they even entered the Escape Room."}, {"id": 90, "text": "I was absolutely horrified at how badly written this movie is. It sucked so bad. I watched it without watching the trailer, which is the main reason why I got tricked into watching it by only judging the poster. It was the 2nd worst movie I've ever watched in my entire life, and this isn't a compliment at all. Very predictable and I wasn't having any fun, even the special effects used were $hit. I gave up half way thro and kept talking with my friends I wanted to leave. I regret every single cent I've spent !!! Worst horror movie I've ever seen and 2nd worst movie for me in general. I've watched hundreds and hundreds of movies and this is literally one of the worst I've come across"}, {"id": 91, "text": "This movie ended with a missive twist. Very suspenseful. Dash was hilarious."}, {"id": 92, "text": "While the ideas of this movie are a mash of others, I think it was done well. Think Hostel for this generation of social media influencers and Facebook addicts in an Escape room with a Catacombs twist. The acting is fine, definitely better than most horror movies"}, {"id": 93, "text": "This film start with a man Cole riding a plane, and he watching his video log in the plane scene! As turnout, this film is about Cole been prank to killing people on screen in Russia! Entire film full of boring conversation, and annoying overuse scene! Such as, overuse of the video live scene, overuse of the playing dumb scene, overuse of the hiding scene, overuse of the seeking scene, and overuse of the peeking scene! Make the film unwatchable! Majority killing scene in the film portray by sideways! Make the film quite frustrated to watch! Barely intense scene is, Cole dissect a body to obtain a key! At the end, we found out Cole's friends still alive! He been prank to kill people! Still have a series of video log along with the end credit! That's it! Wasting time to watch!"}, {"id": 94, "text": "High production values, educational, not exactly predictable. And pretty intense at times. I liked it. Don't believe the average, it's definitely not a 5, seldom 6. It's solid 7/10. See it, feel it."}, {"id": 95, "text": "My title says it all.... good solid scary movie. A 7 for sure."}, {"id": 96, "text": "Starts as Hostel, than escape room/saw and ends like the Game Allt those movies in one movie! This movie is just a mix between Escape room, Saw and Hostel, nothing more nothing less. The only thing they added is the 'influencer' part, but it doesn't add much and you'll probably forget it during the movie. The ending is f- up and makes the movie 'better', but you'll probably see it coming from miles away."}, {"id": 97, "text": "I like the plot twist, but the writer should let us know he's being pranked by his friends and make Alexeis not die, maybe just a big damage would do it. I didn't know it wasn't actually real until the eleventh hour..."}, {"id": 98, "text": "A very normal American thriller &amp; survival movie, Looks so low budget, The end is so expected, Just you have some fun watchin' it while chillin' on your bed 👌🏻"}, {"id": 99, "text": "I am glad that a cliche of Americans being kidnapped in Eastern Europe turns out to be a game. Because it felt so irritating. It's not actually happening in a real life. No one kidnaps tourists and tortures them for fun or a show. Hostel was great. But in this movie it felt so cheezy throughout just because, I think, we passed that Hostel area (also they made it cringy on purpose, just so the ending made sense, I feel). I had a feeling of fakeness during the movie and I thought to myself: no way this is actually happening. They used Hostel to direct our expectations but it wasn't hard to figure out, considering that hollywood movies have a tendency to offer twists nowadays. I was relieved that it was an act, otherwise, it would be a horrible remake of a Hostel."}, {"id": 100, "text": "Don't know the accurate way to describe it, but the transition between scenes and plots weren't so smooth, it could use some work. The ending was too fast, I don't know whom I should feel sorry for, the dead guy or the main guy, as I don't even know did he realize what he had done, or that his friends are still alive. What a mixed and unsatisfying feeling at the end."}, {"id": 101, "text": "So I started watching it and was like okay okay so far so good and then I got towards the end and started guessing that ohhh okay maybe it's still the game but what I don't get is... WHY DIDNT THEY COME OUT TO STOP HIM WHEN HE STARTED PUNCHING ALEXI? Cause wtf... Plus I think Cole sucks tbh."}, {"id": 102, "text": "I saw this movie.. Bored and waste of time I suggest not to watch"}, {"id": 103, "text": "Such a good movie and such a bad ending. I was knew all the time that the whole story and everything hapened was fake. But I belived till the end that None will realy die."}, {"id": 104, "text": "Don't know why everyone is hating on the move. I honestly loved everything about it I would so recommend someone to watch it in the future!"}, {"id": 105, "text": "What a wonderful tale and twisted story is this little gem"}, {"id": 106, "text": "Surprisingly good movie, much better than I expected. It is a mix from Saw and The game but I definitely satisfied with this 1.5 hours"}, {"id": 107, "text": "I guessed the ending from the start and so I basically watched the whole movie thinking I knew the ending and was able to see how they baited Keegan's character every step of the way. Still entertaining! Wish they showed more of the setup and how things ended for him. Did he end up going to jail? His mates are idiots for thinking he wouldn't be traumatised and take things too far after witnessing his friends and girlfriend be 'murdered' in a foreign country."}, {"id": 108, "text": "This was a great movie. sure it was influenced by hostel and saw bit great acting and the link to social media was a nice spin. its well worth a watch just for holland roden but that aside its an above average horror flick. ignore the bad reviews, its getting as bad as twitter with the constant hate and enjoy it for what it is."}, {"id": 109, "text": "Okay I watched and I am not joking I am horrified I liked until the end the end is so messed up and I want to know what happened to the guy after the fast. PTSD for sure!! It's pretty realistic the hole time but again the ending is horrible!!!!! 7 out of 10"}, {"id": 110, "text": "The ending was a twist. Not so bad, but for me it did not really got scared enough."}, {"id": 111, "text": "This movie was great and I truly enjoyed it, except the ending irritated me! What did the friend's expect? For him to just walk away thinking his friends died?! I love Keegan Allen and they had great acting but now I feel like the ending messed it up a lot. One of my favorite movies Is Escape Room and this reminded me of it. Except Escape Room would be rated 10/10."}, {"id": 112, "text": "First, the first 20 min were boring.Then the movie has a ot of stupide coincidences that make a little sense at the final revelation, but the end its stupid, like after all that it would be obvious that he would have a reaction like that, and no one helped the guy like they werent there..., then we have the part when the main figure just makes noise by touching the air duct with no sense, like i said, good moments of suspense but i bit stupid."}, {"id": 113, "text": "The concept isn't new. It was done much better in The Game."}, {"id": 114, "text": "Dull, unoriginal and pretentious; No Escape acts more as a rip off of films we've all seen before.In this thriller, a social media celebrity and his team travel to Russia to celebrate his birthday and things get out of control.If you've seen David Fincher's The Game, then please don't watch this movie. The ending of No Escape is almost a copy of that films final few minutes. WTF. Crap acting, a horrible script and and just an all around unoriginal film, makes this one nearly unwatchable. Director Will Wernick, who also directed Escape Room clearly has no better ideas than to make ANOTHER film about a deadly escape room. Pure rubbish.Follow @snobmedia for more reviews!"}, {"id": 115, "text": "US Version is called Follow me. So flipping worth it. Edge of the seat thriller. I promise it did not disappoint, a cross between Saw and Hostel, lots of gore"}, {"id": 116, "text": "It started off slow but second half wasn't bad except Keegan Allen story lines were bad, making stupid decisions and annoying with his live stream channel, just shut up man. A good watch on a rainy day"}, {"id": 117, "text": "What an awful movie , very boring, unlikeable and unwatchable characters, bad acting although it was copied from the movie The Game it could not live up to the glory of the original one . I just wanted to scream and swallow my whole fist not because it was scary but because of the cringe. Don't waste your precious 1.5 hours of your life on this movie, just DON'T."}, {"id": 118, "text": "First off, no I could not guess the ending. That said though I found it very engrossing, the music for instance goes a long way to intensify the ride. I found the acting fine and the characters were as good you would expect in a movie like this. It definitely has that old 'Jaws' edge of you seat vibe going for it which was great too.I really hope they make a sequel, I do. Clearly not everyone's cup of tea, you have to have a bit of stomach for this stuff. I don't know if I would watch it twice though and as such I would not rate it any higher but it's still a very entertaining movie. You have to stick with it till the end, no wimping out guys. All the way to the end, enjoy."}, {"id": 119, "text": "You can honestly just fast forward the whole first hour of the movie. I think it supposed to be character development, and it keeps hinting of things to come, but you honestly could not care less. Everyone is super unlikeable, so when the film finally gets to where you already know it's going, you're totally fine with it. Kill them all please. Boy bye."}, {"id": 120, "text": "Wow this is better than I could have imagined. This is about a YouTube vlogger &amp; his friends going to an escape room in Russia. This film has elements taken from classic horror and thrillers such as Hostel &amp; Michael Douglas' the Game.I had suspicion about the ending &amp; I guessed it right. Nonetheless the acting was decent enough and each character did a convincing portrayal of typical members in a social group. It has humour, thrills and a recent ending."}, {"id": 121, "text": "My earlier review which got more than 100 likes got deleted without containing any abusive or bad stuff. Anyways i am happy that i managed to mess around certain fella's minds. Good to kno that certain irate fellas r monitoring my reviews n i am able to waste their time n energy.I will keep it short as I am writing it again. The film has ample amt of tension n suspense throughout, some beautiful chicks n vibrant locations of Russia. The twist is solid. The director's earlier film Escape Room is bad but somehow he improved. Good to see some lovely locations of Russia compared to the dark n gloomy stuff which they show always.Fans of 1986 April Fool's Day will definitely enjoy this."}, {"id": 122, "text": "Follow Me is a new horror thriller movie directed, written and produced by Will Wernick, the director of the 2017 movie Escape Room.The film is about the popular internet vlogger Cole (Keegan Allen). In his vlogs he undertakes exciting activities that give him and his followers an adrenaline rush. As a surprise, his friends take him to Moscow where they go to a special escape room together. Here he and his friends expect to capture one of his best vlogs. Once in the escape room, Cole and his friends learn that the challenges of the escape room seem to become life-threatening. They must all escape now before it kills them.This movie can be entertaining for people who like horror survival movies, but after a while in the movie, many situations may seem familiar. Many moments like the dangerous tasks the characters have to undergo to stay alive are much like the various traps from the Saw film series. For a better and more creative movie you better watch one of the Saw movies. If you want to see a new kind of similar movie, this movie can be entertaining if you don't go there with high expectations.The acting is done nicely by the cast, but no one else really comes to the fore in the film. Most of the cast are actually more TV actors, which can be seen in some of their acting."}, {"id": 123, "text": "Someone sat down and thought of a bunch of horror movies and ripped off ideas from 3 that I can think of. Hostel and Escape Room being two. A low budget to stick to, which really was painfully apparent.Throw in some extremely egotistical dislikeable characters who most of I really didn't care if they lived or died. I actually zoned out for a good 5 minutes through boredom and thinking about my to do list. Yes, the prospect of housework was more exciting than this movie. Despite zoning out I didn't miss anything.4 stars is being generous, but I'll give the extra star for the twist which was quite good, but didn't make up for the 90 minutes I'd already endured.Go watch Haunt 2019 instead for an exciting and good escape horror movie. Which incidentally is produced by the director of Hostel."}, {"id": 124, "text": "Honestly, I didn't expect to like this movie as much as I did. I've seen a lot of bad horror movies, and I didn't think the writer/director's previous movie Escape Room was all that strong in the script department. I also read almost nothing but negative reviews for this movie and just wasn't expecting much. But I actually enjoyed it quite a bit.The cinematography looks nice, and the acting is really solid all around. Keegan Allen gives a great performance as the lead. That last scene - chills. You can really feel for his character.The dialogue is also good. There were actually a few moments where the dialogue was surprisingly organic, and you really got the sense that these characters have been good friends for a long time. There's a couple of cheesy vlogger lines that are generic and played up, but that's kind of the point, and for the most part those few vlogging scenes work well. The social media overlay was also well done, clean, and easy to digest. Additionally, there are some Easter Eggs if you know what you're looking for. Cole is following several people from the production of the movie like Will Wernick and Jeff and Kelly Delson. I thought that was a fun touch.I saw some critique of the lack of subtitles. There was a significant amount of Russian in this film and not a word is captioned. Personally, I didn't mind. You can basically understand what they're saying just through context - or so it seems at least. I admittedly don't speak Russian.I've also seen people say that the plot is unoriginal and a bad rip off of Saw, Hostel, etc. While some of the escape room torture puzzles are familiar, there's a lot from this movie that I haven't seen done in exactly the same way before. I actually thought the plot for this movie was fairly strong, much better than Wernick's previous Escape Room (to which this movie bears little resemblance, despite involving escape rooms and previously in production being titled Escape Room: Moscow). There's some good twists, and the plot keeps its suspense through most of the movie. The pacing was fine for me.I won't get into spoilers, but there are some logistical plot holes that end up not making much sense. By the end of the movie, you spend a lot of time reflecting and going Wait, how did they know/do/expect that? and that brings my review down a couple stars. But it's nothing egregious as I've seen some people complain about. It's your standard horror movie bad logic, which is seen enough to be tolerable by people who spend a lot of time watching the genre.Overall, this is actually a solid movie. It's not my movie of the year or anything, but it's a decent thriller that put a new spin on the genre and did it pretty well. I'd recommend it."}, {"id": 125, "text": "The start of 'Follow Me' is going to put a lot of people off, and that's a shame because the second half of this movie is brilliant. The first half didn't even bother me that much, but I know it will some other people. We meet our set of characters and the main one is a VLOGGER. So of course he has to turn his camera on and turn into this over the top, unbearable person like so many real-life VLOGGERs are. It's pretty cringey to watch. It didn't bother me because I know that those people are out there in big numbers these days and this is legitimately what they do. The character build-up in this film does go on for a while though and if you don't like these characters then that could be a struggle for you. I would implore you to stick through that though because the second half more than makes up for it.I knew nothing about the plot of this film before seeing it, so when a character mentioned a personalised Escape Room I thought hell yes that sounds like a lot of fun. Then I had to wait patiently another 20-30 minutes before the characters finally get there. But that's fine I'm okay with some character development. When they arrive at the Escape Room though the movie really kicks into life. From that moment on the movie is a non-stop action/horror/thrill fest. It's actually a really well put together sequence that I suspect won't get as much love from critics as it deserves.The final few minutes of the film blew my mind. I won't go anywhere near spoilers, I'll only say I loved it. Only a couple of issues I could really come up with for the film. There is a lot of talk in Russian without subtitles. I understand we are seeing this from the American character's perspective, so the no subtitles makes sense, however there were some quite lengthy conversations that we have to sit and watch with no idea what is being said. That was a little frustrating. Also in hindsight a few things don't entirely make sense. With a film like this that is likely always going to be the case though to be fair. Nevertheless I had a terrific time with 'Follow Me' and couldn't recommend it highly enough. A great horror flick."}, {"id": 126, "text": "Except for the scenario of the ending (not its outcome), the movie is almost perfect. I found the acting decent, and while the characters, especially the main character, are not very likeable, I found them very true-life. There is the main Vlogger, then his sidekick, and then his secondary sidekicks, it's a well-oiled machinery that generates money with needless waste of time. Behind that there are more or less normal people with the right nose for their business. To deliver more thrills, the protagonists agree to an ultimate escape room experience in Moscow, and this seemingly goes very very wrong. I will not spoil the movie, but one who pays attention always gets a little hint what's going on. The pacing after a rather slow but entertaining introduction of what a Vlogger's life would be (I liked this part very much), the thrilling game changes into, what we wcould call it, a Russian version of what was to be expected. Fast and brutal. There is no flaw of any kind to be found until the very end. Which is, as I mentioned, not as carefully arranged as it should be, but aside from that, it is very reasonable, as any other reaction and decision during the whole scenario. Put yourself into such a situation and you may understand some reactions easily. I have a theory that many reviewers here did not really follow or did not want to understand the movie, as it (intentionally) mimics (partially) some mainstream Horror movie series of the near past and makes its own story from their origin, in a way like One Cut of the Dead (which was a bit more funny, I have to concede)."}, {"id": 127, "text": "Thought it was gonna he 1 of those hand held movies &amp; thought about that &amp; a social media star didn't sit well &amp; was so close to turning it off but glad I didn't. Don't get me wrong, it's not like this was a great movie. But I thought I was solid, to actually pretty good. Yes parts had a Hostel vibe while others had more of the movie 'escape room' vibe. But those of us who watched. Understand that there's more to itThe acting wasn't great but it wasn't bad. It wasn't to the point where I was couldn't watch movie cuz I kept thinking, wow this is bad. Matter of fact after a few minutes I didn't even think about the acting so that's my judge of whether it's bad acting or not. Go watch troll 2 if u wanna see bad acting. And even that movie has became 1 of my all time favs for the very fact that they just cast bad actors like they used to sadly. Even tho bad ones can't easily be found if ya look hard enough. The story I thought was good. Idk, u can do a lot worst. The horror genre ain't exactly busting outta the seam with gems. This is about par for the course of your average 2010-2020 horror movie. Nothing great but def worth 1 watch. I would watch other movies first if u have a list but if your searching for a movie without 1 in mind &amp; like the genre &amp; enjoyed movies like hostel or 1 of the many escape room movies made in the last 5 yrs. give it a shot. Doubt you'll love it, but doubt you'd hate that it either. Unless your 1 of the clowns who review movies &amp; hand out 1's on all of em like they burning a hole in your pocket. If that's the case, pick a new hobby &amp; stop watching movies. It's clear you have no substance &amp; lack the ability to immerse yourself in a movie unless it's something u grew up &amp; even that u prob complain about these days. Your hard to please and that's ok. But don't fool yourself by thinking you'll ever be pleased. It's clear that daddy &amp; mommy are never happy"}], "reviews_amount": 128}