{"name": "Kiss the Ground", "titleId": "tt08618654", "reviews": [{"id": 0, "text": "This documentary was informative, eye opening and inspirational. To me, it seems so obvious what needs to be done in terms of our agricultural methods. I get that people want to stick to their tried and true ways but if helping the planet means a healthier humanity, wouldn't you adjust and evolve your methods for that reason alone? The good news is that I believe that a new generation of farmers are coming up and are more interested in these planet/humanity saving methods than the good ole money making, government subsidized methods. Hope is still alive!"}, {"id": 1, "text": "Being surrounded with bad news for so long, and especially with what's been going on in 2020, it would be easy to give up, or, at least feel relatively powerless. This movie shows how powerful we can each actually be, literally, in our own backyard. Well paced with really interesting stories and fascinating NASA satellite imagery showing co2 emissions from space and how they are directly related to how much tillage is going on in the planet. So mind expanding! I'm so happy that a movie like this was made available on Netflix. Highly recommend!"}, {"id": 2, "text": "Exploring the damage caused to the earth through farming with a conservation agronomist et al and how a regenerative approach can reverse the catastrophic climate crisis that casts such a bleak shadow over our planet. Unsurprisingly the message, as is so often the case in all walks of life: let things do what they're good at and the problem can be resolved. In this case, let nature heal the damage, torture and torment our misguided agricultural practices have cursed the planets surface with, live in tune and synchronicity with nature, stop poisoning the lifeforms that maintain and perpetuate life. Probably preaching to the converted but there's no harm reemphasising the message in the hope that a few more pennies drop and habits evolve and ultimately change. That's if it's not too late already."}, {"id": 3, "text": "When I consider a film, one of my criteria is relevance. Reversing climate change has to be at the top of that list. Helping farmers, creating more nutritious food, and reversing chronic lifestyle diseases...also pretty damned relevant.But the story also has to be told well. Does it have flow, is it beautiful? Check!You will enjoy watching this, you will learn while you enjoy, and you will be motivated. All very difficult tasks, but this film was highly successful at accomplishing all of them."}, {"id": 4, "text": "This movie was so inspirational and inspiring! Great job! I love how the movie was educational without shoving it down your throat. Definitely recommend to everyone!"}, {"id": 5, "text": "This is incredible and inspiring for all generations, a film everyone needs to see, an absolute must watch!"}, {"id": 6, "text": "This movie! Great information in a way that people can understand and start to make positive and impactful changes in their behavior. It's the start of something mind blowing! I just might move to California so I can work for this incredible cause!"}, {"id": 7, "text": "I can't remember the last time I saw a film so absolutely breathtaking. The cinematography of Kiss the Ground does an amazing job at capturing the nature of our planet and showing the growth towards restoration. The images this documentary provides are incredibly powerful; even the very last scenes gave me goosebumps. Josh and Rebecca Tickell do a fantastic job at implementing a powerful message and showing that change is possible. I felt incredibly hopeful that we can come together to reverse climate change. After viewing the vivid imagery, data, and graphics in this film, it just motivates me even more to be a part of the movement. Something this beautiful deserves to be watched and appreciated."}, {"id": 8, "text": "This is a must see. It provides an attainable solution that everyone can take part in to help our planet. It is filled with gems of information and a passionate team behind the research. If not now, then when?"}, {"id": 9, "text": "As a livestock rancher, I am leery of documentaries with vegan spokespersons. But this one covers all the bases and gives livestock it's critical role in healing the environment. Excellent job in explaining the science and role of farming in making things right. Would have been nice to have given direction in how the average person can encourage change in farming."}, {"id": 10, "text": "Oh thank god! It's tough to see the state of our world broken down so clearly that there is no denying what is happening to our planet -- but this film shows us where we are and then, through great dialogue, beautiful footage and entertaining characters, walks us out of the depths of fear and into the freedom of YES WE CAN! Thank god this movie was made!"}, {"id": 11, "text": "Finally a movie that gives a solution, a real, unbiased and scientific solution to climate change! I'm so happy this has finally come out. It's explained perfectly so everyone can understand and realize exactly what is going on and what needs to be done in an entertaining and easy to watch way."}, {"id": 12, "text": "A nicely made documentary. First half is great, as it explains the importance of healthy soil. Stuff we all should know about, whether we own the land, a small green patch in the backyard, or we dwell in concrete jungles. But as the movie progresses, it starts to go in a direction I was feared it's going to go - animal farming. We hear phrases grass-fed, free-range, humane killing and other nonsense. It clearly shows the filmmakers don't know the reality of animal agriculture, if they allow those words to be captured. Did they really do their homework in environmentalism? I doesn't seem like it. Numerous studies show that animal agriculture is the most detrimental and destructive to the planet and its inhabitants. It's a shame it came out this way, because there was a chance to sell a positive message."}, {"id": 13, "text": "Kiss the Ground poignantly delivers on its mission to provide a positive and hopeful outlook on the future of our environment, while also keeping me engaged. This inspiring documentary conveys a compassionate drive behind saving the Earth while also breaking down the science behind the solution based approach to the issue at hand.The changes in perspective between Woody Harrelson's wonderful narration, environmental science experts, and other celebrity activists work in harmony to create a potent message that is accessible and informative for all audiences. The vibrant footage of Earth's landscapes effectively displays a stark contrast between environments that have implemented regenerative agriculture and those that have not, which beautifully illustrates the importance of the film's message. Overall, this film is perfectly balanced between an informative and entertaining tone that left me feeling inspired and hopeful for the future of our planet."}, {"id": 14, "text": "I have been learning about and advocating regenerative agriculture and permaculture for years, and seeing how beautifully presented and powerful the message in this movie is brought me to tears. This single film could be the catalyst for massive change, awakening the public to the deep-rooted problems in our agricultural system and demanding change. For the health of bodies, our minds, and our planet."}, {"id": 15, "text": "Where do i start ? Firsty amazing how much of an eye opener it is, the solution is simple yet so amazing and powerful !! I highly suggested more people get on board and kiss the ground. Me personally id give it more than 10 stars if i could. Well done keep up the fantastic work."}, {"id": 16, "text": "Finally, a documentary that not only shows the problem, but gives a solution too."}, {"id": 17, "text": "It's Simply outstanding, beautifully crafted , so much knowledge about  REGENERATIVE AGRICULTURE. This is a really important film for the world ,making us learn how to heal our planet . This Documentary spread a strong message About how we are damaging our planet and how we all can come together and safe the nature earth and climate change . MUST WATCH 😍"}, {"id": 18, "text": "Beautifully done story about this magnificent planet. About how we have hurt it and how we can fix it!"}, {"id": 19, "text": "This film should be compulsory viewing for all school children. A fantastic presentation of the issues we collectively confront."}, {"id": 20, "text": "As a geographer climate change is of high importance and interest to me. This film effortlessly highlights how biosequestration can help with climate change in such a way that absolutely every person on earth can understand. A great and important watch!"}, {"id": 21, "text": "Kiss the Ground truly redefines what it means to release a film surrounding climate change. While most documentaries like this leave its viewers weary and confused about mother earth, this film does the exact opposite. By the closing credits, I was smiling with inspiration about our world's future and the transition to regenerative agriculture. The film presents a feasible solution to overturn climate change by having CO2 emissions going back down into living plants. Through this process, we can regenerate our soil. Directors Rebecca and Josh Tickell's seven years of hard work on this cinematic piece is undeniable, and their unique approach to providing viewers with hope rather than distress made their message that much stronger. Through the beautiful and vibrant imagery and Woody Harrelson's warmth and authentic narration, I was instantaneously immersed in the film's purpose and now wholeheartedly support the Kiss the Ground movement!"}, {"id": 22, "text": "Kiss the Ground takes the viewer on a remarkable journey of environmental positivity and its explanation of why it's essential for humanity to take up the reigns of saving our planet. Long-time activist duo Josh and Rebecca Tickell use this detailed documentary to create a positive discussion around the effects of climate change by recruiting a global team of culturally significant farmers and well-known activists. The varied discission that comes from such team provides plenty of sustainable solutions that can be attainable to any type of person from around the world. Such solutions are amplified by the use of colorful imagery, like the depiction of regeneration through wide shots of greenery and intricate graphics showing the science behind the process. Kiss the Ground motivates me through the reminder that climate change is a global problem we can all come together to help solve it by practicing our individual efforts through a team connected through our humanity."}, {"id": 23, "text": "Movies are important to me because of their unique ability to act as a reflection of the human experience. Kiss the Ground is a moving documentary that helped me understand how important it is to find beauty in our differences and find strength in our similarities. As the film unfolds, there are appearances from people of various backgrounds: celebrities, scientists, farmers, and people who just want to help. I found myself able to connect with each of these perspectives on different levels, and was left feeling inspired because of how important it is we come together and create change. Overall, Kiss the Ground is a powerful movie that has created a space in my heart for compassion, and challenged me to find my role in protecting the planet we all call home."}, {"id": 24, "text": "Beautifully done. Its a film for each and every one of us. The problems of today pertain to and will effect everybody on this planet. I honestly had yet to watch a film on such a widely covered subject that was actually able to give solutions that ANYONE can do to help combat such a massive and deadly threat. The planet has seemed as of it was basically past the point of no return, and films on the subject seldom succeed in painting a full picture of it's true scale. Even more rare, this film could convince the worst skeptics and has the information to motivate all who watch. I'd recommend this be shown in classrooms of all ages. I think if more people saw this, it could actually change the way most people view the importance of our planets health. This begins a progressive conversation to take action, and do it now. And that we all have the ability to make it happen, no matter what challenges one may face. Its not just big organizations that have the power anymore, its me and its you. now go watch!"}, {"id": 25, "text": "Fantastic film. I think it's one of the most important films of my lifetime. I love how it used simple language to explain how regenerative agriculture works and its contribution (necessity, really) in reversing the problems that have led to climate change. It's reenergized me to Get involved in local efforts and I hope it can help bring about the needed mind shift in how we utilize waste, land, and animals."}, {"id": 26, "text": "This movie is life changing. This is a must to watch for everyone. The things you see in this movie should be taught at kindergarten and schools as much as every other lesson and even more. This film is so great explains everything, shows you the problem and provide a simple solution. By far the best movie I've seen this year and im general."}, {"id": 27, "text": "It moved me to tears. The tiniest speck of hope in what seems like a hopeless future."}, {"id": 28, "text": "Well Structured Informative Accessible Enlightening Inspiring"}, {"id": 29, "text": "Directors Josh and Rebecca Tickell are able to provide an uplifting message of hope in their new movie Kiss the Ground. This documentary is able to achieve this sense of hope by providing a feasible solution to one of gravest issues our planet faces, climate change. This solution is through our soil. Although it may seem simple, it is entirely effective, as the filmmakers show through before and after footage of the Loess Plateau in China. Once, this plateau was once completely barren; however, through regenerative growing methods that allow soil to grow and become healthy, the Plateau is now a thriving, green, and beautiful environment. This message of hope inspired me, as I believe that this solution can have a positive impact for our planet."}, {"id": 30, "text": "This is one of the most important films everyone should watch! The future of the Earth and all of us who inhabits her depend on it! How to stop climate change? Let's start here."}, {"id": 31, "text": "It seems like credible material on the surface - no pun intended.But with 300 out of 304 reviews being gushing 10s and all sounding much the same, I have to figure that this is actually a well-financed con. It certainly isn't the sincere umm... grass-roots effort it wants to be seen as. So - 1 star for a hidden agenda."}, {"id": 32, "text": "I am fascinated with soil I thought that soil health was very well explained"}, {"id": 33, "text": "This film outlines a well-researched, credible strategy to effectively curb climate change - it provides hope if we can overcome the political constraints!"}, {"id": 34, "text": "This documentary is incredible! I was in tears watching it and realized that we have to help mother earth NOW The movie portraits how to save mother earth and includes important knowledge that kids should watch in schools! It gives hope and a curing for climate change. Thanks so much for everybody that created this masterpiece!"}, {"id": 35, "text": "I really enjoyed learning about our soil. I did not know most of what was explained. This documentary really got my brain going to see what I can do to help. Excellent platform to use as well!"}, {"id": 36, "text": "I am aware of many of the issues addressed in the film but I was not aware of many of the solutions. Everything was explained so well &amp; in detail in a way that is simple to understand while impossible to argue with or find fault in. I know everyone involved is passionate about making a change, that shines through in every interview and presentation. I started out feeling anxious &amp; a little helpless to all of the conditions we are facing as they were explained but as I watched I became more and more hopeful while also being inspired to find more ways to help. Some simple changes can be implemented in my life right away and others will just take some effort, but I do know they must be done. I think this should be shown in schools too, to all ages. Very important they we really start to get it, because it will not get better on its own. The time to begin action is now, it's clear we cannot wait any longer."}, {"id": 37, "text": "The solution seems that it would be so obvious. The circle of life that we all learned about from lion king put into perspective here (in a slightly different way) Ecosystems know what they are doing. Mother nature has these things down perfectly. We as humans are the ones that messed up the cycle. Up to us to help her heal."}, {"id": 38, "text": "Inspiring roadmap for a sustainable way forward. It's simple and everyone can do it."}, {"id": 39, "text": "This is THE MOST IMPORTANT FILM of our times. We all feel it... that gnawing, ugly feeling inside that things aren't good, and yet we're not sure how or what to do, and if everyone else knows it. This film covers so many different aspects of our worldwide dilemma that hardly anything is left undone. It is totally well-made, compelling, inspirational, depressing (realistic), yet hopeful. A global call to action that SHOULD BE REQUIRED IN EVERY SCHOOL, COLLEGE, AND UNIVERSITY. I'm grateful these people did such a wonderful job at telling this story so well. Thank you!!! WE CAN SIT STILL AND NOT ACT NO LONGER!!!"}, {"id": 40, "text": "It misses a narrative coherence probably because it wants to speak to everyone but it doesn't know how to do it unanimously: sometimes it feels like a commercial, other times like a strong, detailed and committed manifesto; sometimes it's to confusing and ripetitive with too many numbers, charts or statistics at once other times it's too rushed, superficial and dull feeling like a kids show; some interviews are very interesting, well scripted and important, other, less useful, could definitely be avoided. So as a documentary it could have been made better especially because it's extremely important but at the end at least it's there and it inevitably makes you realize a lot of things and think about them, despite all the technical problems, and that's more important."}, {"id": 41, "text": "No where does the film say anything about the vast amounts of herbicides including Roundup, 2-4D, and Paraquat used in no-till agriculture."}, {"id": 42, "text": "For sure this inspired me to start my own small crop in the best way possible."}, {"id": 43, "text": "If you cut out of this movie all the nonsense with happy ranchers holding their hands and the need to breed and humanely kill animals to regenerate the land, then it is a pretty decent documentary about the importance of moving from conventional farming to a sustainable one."}, {"id": 44, "text": "This documentary was a breath of fresh air! The ideas this film discusses are so important to the modern conversation of climate change and how we can restore the planet and hope for all known species on this planet. They show you how, they show you why, they are planting the seeds of education and hope across the world. Together we can still fix this inevitable global disaster, but we must foster these growing seeds within our communities and societies. Our cultures must change toward a sustainable future or our cultures and communities shall have no future at all. We only have sixty more harvests until the devastation is irreversible."}, {"id": 45, "text": "I don't think you can compare forest soil to soil with grass growing, the forest soil is always going to be nice and soft from all the added organic matter. I won't stop tilling but I also won't stop composting and growing organically. The movie explains why so many Americans get diagnosed with cancer. I took off 2 stars for using the cheater, he's irrelevant"}, {"id": 46, "text": "A must watch movie that will change all skeptics. We can all make a difference."}, {"id": 47, "text": "This movie is so inspirational and extremely useful in terms of information on how to help make the world a better place to live in."}, {"id": 48, "text": "Simple a MUST to anyone who thinks there's nothing else to do to change the way we are killing Earth! But also a MUST for those who want to leave a better world to the future generations! THANKS for producing it! Have me hope and energy to keep on working on making a difference!"}, {"id": 49, "text": "Amazing movie full of information and facts. In a understandable language. Watched it with my son, whom had some emotional moments of seeing the possible future if we don't change and seeing our past. We need to do something, not just talking about it or watch movies like the day the earth stood still. Strikes won't help. We need to take action. Stop financing our current food chain, politics,...!!"}, {"id": 50, "text": "This movie leader us to reflect on the importance of soil health, and consequently on our health. We can change things. Inspired by watching the movie, is realistic and interesting."}, {"id": 51, "text": "Shines a light on an intensely debated topic in a hopeful way and lays out a path for the future that's both uplifting and will help save the soil system of the Earth while combating climate change. Highly recommend!"}, {"id": 52, "text": "This movie does such a phenomenal job of educating you, and being realistic, while also giving hope through the practical solutions explained. I feel like there are practical solutions at hand, that we can start implementing now! I especially love that these steps empower farmers and help them become prosperous, while helping to get chemicals out of our food and our planet! I feel so inspired to be a part of the solution now!"}, {"id": 53, "text": "Kiss the Ground does an excellent job of focusing attention on how important soil is to man's existence especially in regards to the role healthy soil can mitigate climate change. Though this means we have to stop treating soil like dirt by either tilling it or dousing it with chemicals. Thus agricultural practices have to drastically change for both how we grow plants and raise livestock. When this occurs, and widespread regenerative agricultural practices are adopted, we can have healthier food and a healthier planet. Kiss the Ground presents the thoughts and knowledge of a wide array of farmers, soil experts and celebrities to discuss this topic...the importance of healthy soil."}, {"id": 54, "text": "This movie is so inspiring and gives me hope about the future but we have to act now and do our part."}, {"id": 55, "text": "Really well done documentary on things we can do today to restore our planet's abundance and secure a sustainable future. Bravo!"}, {"id": 56, "text": "This documentary is most important in our lifetime. With a looming feeling of despair due to global warming this gives us hope! Another way to solve this so our grandchildren can live on earth as we did."}, {"id": 57, "text": "This movie connects everyone to the problem and gives a solution we can all take part in."}, {"id": 58, "text": "This movie connects everyone to the problem and gives a solution we can all take part in. Thank you to the activists that have made it their life work to compel others to join something positive for all and thank you for restoring my hope:)"}, {"id": 59, "text": "A clear and inspiring message to awaken people to the possibility of the earth's regeneration."}, {"id": 60, "text": "Eye opening.This documentary truly depicits climate change and provides effective, realistic solutions.Recommended at the warmest"}, {"id": 61, "text": "Eye opening simple solutions to change our future and to put a stop to our climate crisis and shows us all we can all do our part to help. Very enjoyable, a must see for all."}, {"id": 62, "text": "What we know about global warming and combating it is just the tip of the iceberg. This documentary is such an eye opener! In just simple ways we can restore and preserve our environment. It's a must watch!! We definitely should incorporate it. It's going to benefit no one but us in the future."}, {"id": 63, "text": "The movie is so full of information, different experience, different culture, global issue! Not only is it addressing a huge problem that has a huge influence on all of us, it also explains how it works and how it's solved very simply. It's absolutely spreading awareness to anyone who watches it and is so informative, in a simple way that we can all understand! I love it and watched more than one time when it first premiered!"}, {"id": 64, "text": "Scientific solutions for a healthy sustainable planet. Restorative agriculture provides our soil, our farmers and consumers with methods of farming that can sustain a planet and keep us healthy doing so. Nature has all the answers; this film is nothing short of the miracle we have all been praying for in this planetary pandemic. I'm inspired and hopeful."}, {"id": 65, "text": "A mind-blowing look at the damaging effects of conventional farming on our soil and how toxic it is to our wellbeing and planet. It clearly demonstrates the effects of tillage farming on C02 emissions and explains how regenerative farming sequesters carbon. After watching this, I felt equipped with an understanding of conventional farming and how catastratrophically damaging it is to our planet and why. A wake up call to the industry and will change the way you think about the sorts of veggies and produce you are choosing to buy. It will leave you with something to think about!"}, {"id": 66, "text": "I grateful enjoyed the watch party as well as the documentary of this new film i'm telling everyone in my community to watch with their families. As a new gardener, the information about living soiling was educational and inspiring. I only wish you'd spent more time on the Half Moon Bay rancher and her family; she was so charming and warm and uplifting, she deserves a focus of her own.The midwest farmer and the way he spun his ruined crops into gold through the process of rejeneration was an inspiration. I hope every farmer watches and learns and changes their practice. Musician Jason Mraz' fruit farm and his soundtrack was an added delight! Brava!"}, {"id": 67, "text": "How was this solution hiding under our feet this entire time and why didn't we know about this. So reassuring to see that we can do this, we can fix this problem. Very entertaining, very inspiring."}, {"id": 68, "text": "This is not your ordinary netflix film. I thought this documentary showed regeneration from all sides. It is however very sad that some cannot watch it due to the addition of the new netflix original The Cuties I shares this film with all my friends and family for at least a week before it came out and I cannot wait to watch it with them again!"}, {"id": 69, "text": "I'm not kidding. If you think it's all over for us all, then watch this film. The answer to so many of the world's problems are right here, in front of our noses and under our feet. Beautifully and powerfully conveyed, with visual images that simplify the science, so it's accessible to everyone. This isn't just a film for the USA, it's for everyone, everything, everywhere."}, {"id": 70, "text": "Very well done documentary. The incentives are there, regenerative farming makes more money. It restores our planet to the beautiful vibrancy of past ages. It is healthier food for us and our livestock. So grateful to Kiss the Ground for all the work they do and am incredibly excited to see this take off and change the world!"}, {"id": 71, "text": "This movie lays the groundwork for how we can tackle climate change. Truly. This is the way forward. It almost feels odd to have to write a review for this as if it's a normal movie"}, {"id": 72, "text": "I had this on my Iist to watch since I heard about it. It was very eye opening and inspirational. I hope this movie spreads like wild fire and gets everybody on board. I will do all I can from my home next is compost. That's the only thing I haven't been doing. Thank you to all the actors/actresses involved and all the people involved on changing the world for the better. Thank God for people like you. 🙏🏼"}, {"id": 73, "text": "I am new to this game. The idea of regenerative agriculture has only been on my radar for the past 5 years. Two years ago I started digging in deeper. This movie left me feeling hopeful for our planet, our animals and our species. Everyone can contribute, everyone can make a difference. This is the time for change. Thank you for leading the way and showing us how!"}, {"id": 74, "text": "I want to leave a better planet for my girls, this film really gives hope and practical solutions that most people would be onboard with!"}, {"id": 75, "text": "A great perspective on climate change and agriculture; how we can take actions that will not only feed the people but maintain healthy soil, turn scraps and waste into soil and in turn, capture CO2 and bring it back to the ground."}, {"id": 76, "text": "I believe this film perfectly articulated what the entire world needs to hear right now in 2020. A message of hope for the future and our ability to be part of a solution."}, {"id": 77, "text": "So very grateful for the love poured into this much needed film. We need HOPE that can bring us together right now."}, {"id": 78, "text": "With so much negativity heaped upon us constantly, it's extremely refreshing for a film like this one to give voice to actual people making things happen on and in the ground. Midwestern farmers and ranchers can do so much more for global climate change than what they're led to believe. Agriculture can change so we can heal our home and our bodies. Outstanding film! Thanks for the hope."}, {"id": 79, "text": "Truly simple common sense can lead us to a renaissance in the way we tend our planet.This is doable any where as demonstrated in this documentary.Please pass it along."}, {"id": 80, "text": "This film had my heart aching but also gave me hope, even my young children were amazed by this film. Kiss the ground opened a door of questions from my little ones that I was more than happy to go over with them. Thank you to all at Kiss the Ground for bringing this information and awareness to our homes!"}, {"id": 81, "text": "It is inspirational to feel and hear the choices we all make can make a difference and propel a movement that saves our island home: Earth. Regenerate"}, {"id": 82, "text": "I am into climate change, the health of our food, improving my microbiome, etc. This documentary ties all of our big problems together and provides a possible solution. I wish every person in the world could see it: but at least the US. We could then teach other countries what to do: time is running out folks!!"}, {"id": 83, "text": "This show you a real and complete solution for the most important problem in the world at this moment, is educational and helpful, i think everyone must see this, everyone must help to regenerate our earth."}, {"id": 84, "text": "A very inspiring documentary with lots of great information. It is very educational. it shows that each one of us can help the earth by doing our part and the best of all is that it teaches us how do start."}, {"id": 85, "text": "This title is a must! This film is so inspiring, and the information the give is so much needed right now in our days!"}, {"id": 86, "text": "I thoroughly enjoyed the film and found it to be a fantastic overview on the method of regenerative farming and the inspiring results that can be obtained not just for the farmers, but for the ecosystem as a whole. Everything is connected and highlighting how our past habits have led us into trouble is critical if we're to steer into a better future."}, {"id": 87, "text": "GREAT movie and a true wake up call for humanity. My wish would be for every farmer in America and the world to watch this and find a way to implement the ideas."}, {"id": 88, "text": "Hi my name is John Pisarek and I'm studying agriculture at Missouri State University. This film signifies what I want to try to fix in the future! I lived in a city as I grew up but I remember my first botany class back in high school. What the soil can do for us and the world. It's not just dirt, it's a living thing! So please give this a watch if you dint like it cool. Or if you don't like it cool! But it will make you learn something! That agriculture is relevant! It can help us!"}, {"id": 89, "text": "Great Film. An important message that must reach as many as possible. Regen Ag is the way forward. It seems so simple. Get on board!"}, {"id": 90, "text": "This film has made me so excited for the future. We will save the planet and I will be a huge part of that! Let's do this!"}, {"id": 91, "text": "If this film doesn't open your mind to the fact that our planet is dying, then I don't know what will. This is so important and a great way to educate yourself on climate change and the real solution to it. This incredibly eye opening film is a must watch for everyone. Filled with loads of information, easy to understand, and provides us with a simple solution to a not so simple problem. SOIL!!!!! Soil is the surefire to save our planet. To learn more about just how soil will do that, watch this film right now!!"}, {"id": 92, "text": "Such an inspiring movie! I've been spending the last 5 years really trying to learn how I can lower my carbon footprint and help mother nature go back to her former glory. This film showed me so much then I thought was available and I'm looking forward to use what I learned to make the world a better place to live on."}, {"id": 93, "text": "Everything in this beautiful documentary is so common sense! Simple and clear. If we can only get people to wake up from the pesticide sleep and show them how to do compost and choose to support the local farmers, we are already taking steps for a better planet. This piece of brilliance shows that affecting the climate for the better is STILL possible. So grateful for this educational gem 💎"}, {"id": 94, "text": "An inspirational documentary showing a positive that can be achieved. In a world crying out for governments to do something about CO2 levels Regenerative Agriculture is the answer, bringing Regen animal agriculture and vegans on the same page."}, {"id": 95, "text": "It's mind blowing!! Honestly it's one of the best movies on Netflix. This brings hope for a better future! Let's go and take action! :)"}, {"id": 96, "text": "This documentary explains the science of how and why healthy soil is important in a very clear and basic way that allows average viewer to understand. As solutions to climate change often feel out of our hands and in the hands of corporations and the government, Kiss the Ground reminds us how much power we really do have. This documentary explains how you and I can make simple changes today that helps reverse climate change! I highly highly recommend this documentary to anyone and everyone who is interested in climate change, farming, or who buys food."}, {"id": 97, "text": "This documentary gives hope and sparks motivation to get going, on healthy soil en ecosystems"}, {"id": 98, "text": "The most hopeful I've felt in a long time- there is a way to save our lives, our food, our children, and our earth."}, {"id": 99, "text": "It it should be compulsory to watch this film. Its not only beautiful and well written it is amazingly educational, emotional and empowering. You cant watch this and not feel motivated to find a way to contribute."}, {"id": 100, "text": "This movie is a must watch; for everyone regardless of generation or nationality. Honest and inspiring. Any viewer would be ready for change."}, {"id": 101, "text": "Finally something hopeful and positive and concrete for us to do."}, {"id": 102, "text": "The film takes a holistic look at the hopefulness of regenerative agriculture to quite literally change the fate of our planet. Touches on a lot of different subjects without going into too much detail; lots of discussion about bio-sequestration."}, {"id": 103, "text": "Please please please watch this film, rate this film, share this film and buy regenerative food. We can save our planet. Act now before we can't anymore"}, {"id": 104, "text": "Every person with a piece of land on earth has the obligation to watch it."}, {"id": 105, "text": "This movie was informative in a way that gets you to want to learn more. It just makes plain sense. Changing our ways in the agricultural arena is a must. We are not only destroying our soil, we are poisoning ourselves. I will watch again, just to reinforce all that my eyes were opened to."}, {"id": 106, "text": "One of the most vital films out there on climate change. If we all followed - and got our governments to follow - the soil science and sequestered carbon in the ground we could actually have a fighting chance.A remarkable documentary, with beautiful footage and significant experts who we all need to listen to. Because essentially they're conduits for the ground beneath our feet."}, {"id": 107, "text": "The connection between planetary health and human health has become undeniable. Rather than paint a grim picture, this film offers a message of hope and a powerful call to action. 2020 needed a silver lining, and this is it. We are all in this together."}, {"id": 108, "text": "This documentary is full of misinformation and scientific inaccuracies. Unfortunately, it seems to have been produced and funded by certain special interests, which automatically makes it an untrustworthy source of information. I'm especially disappointed about their take on glyphosate and farm animal grazing since the information they gave contradicts what science actually knows and doesn't know about these subjects. Netflix should not be entertaining productions like this because it just feeds the continually growing void of scientific misinformation plaguing our society. Very disappointed."}, {"id": 109, "text": "Kiss The Ground is the ultimate environmentally rooted cinematic experience. The idea of soil regeneration is so simple yet so powerful, the solution to saving our planet is right underneath our feet. From the food we grow to how we handle the leftover scraps, Kiss The Ground left me feeling informed and empowered as a consumer. From environmental science experts to household names, it's inspiring to see people of all backgrounds coming together for a cause so profound in our everyday lives, and more importantly-- our future. The drive and dedication of those featured on-screen was beautiful to witness and the adoration of those off-screen was prevalent as well, accompanied by some absolutely breathtaking shots I've ever witnessed in documentary. Overall, I am moved by the simplicity of the solution, and grateful for the filmmakers' ability to make it accessible."}, {"id": 110, "text": "The illuminating evidence provided by Kiss the Ground on the topic of climate change, along with the positive effects of regenerative farming, were truly captivating! This film ingeniously proved that there are other ways to go about producing crops that do not harm the soil from which we grow our crops from. The visual representations of these solutions kept my eyes glued to the screen, and celebrity appearances, ranging from Jason Mraz to Patricia Arquette, kept me equally entertained. This film is a perfect example of why we should never give up on the earth that has given so much to humanity!"}, {"id": 111, "text": "This is a film that in the first hand every farmer and politician should see. Positive change for the climate can be done."}, {"id": 112, "text": "The most important conversation we should be having right now. So hopeful and so simple and such a win for everyone. Bravo!"}, {"id": 113, "text": "By the end of this documentary I was heartened and inspired. It's a beautiful piece of film making that tells maybe the most important story on our planet right now. The movie makes it clear how much is connected with healthy soil and gives a vision for how we can regenerate what truly is the stuff of life. Everyone should see it."}, {"id": 114, "text": "As a documentary filmmaker about food and farming myself, I am thrilled to see this film finally hit the screen! I'm the wonk who's read the United Nations reports on food and the environment for the last two decades ... and this continues to be the answer ... feed the soil and it will feed the world."}, {"id": 115, "text": "Solar panels are not going to make the planet more habitable in the coming years. We need to, also, start removing carbon from the atmosphere. Using the ground beneath our feet an vital key to doing just that. This well-done documentary explains why and how we can start to drawdown carbon while providing healthier food at the same time."}, {"id": 116, "text": "Everyone should watch this! I started a community composting program in my town because we don't have municipal collection and I could not have explained the importance of our soils better than this documentary did! Such an important message with well put together information that everyone could benefit from learning. Highly recommend! 10/10 if everyone watched this we could really start to make real positive change."}, {"id": 117, "text": "This documentary provided me with hope for humanity's way to take part &amp; take positive action toward creating a way to THRIVE, not jus survive on this beautiful and amazing Earth. The timing is perfect for bringing some HOPE, HEALTH AND HEALING to our continued existence on this planet. This 2020 pandemic has truly been a time of transformation within all the disruptions of mindless habits &amp; routines. Now IS THE TIME TO MAKE THE NEEDED CHANGES. I'M SO GRATEFUL FOR THE WISDOM OF THE FILM'S FOUNDERS. Let's keep the momentum going."}, {"id": 118, "text": "This is an important story which everyone should know and understand if we are to turn things around for humanity and our planet. Please watch it and share."}, {"id": 119, "text": "Kiss The Ground is an amazing documentary about Climate Change. It tells us a lot on how the soil has affected the amount of CO2 that has been emmited into our Earths atmosphere. With the help of Woody Harrelson and Ian Somehalder, and the other amazing people in this film, I have been inspired. I love learning about the climate and I believe people take notice of this information then climate change will hopefully be reversed and we won't have to worry on how many harvests are left. Congratulations to this amazing cast you guys have worked so hard to get this message across..."}, {"id": 120, "text": "So I watched the film, just out of curiosity, and I have to say I was so inspired. I was sold by its simplicity. Truth often comes in the simplest of forms. At the end I found myself wanting to be a part of a movement that made a difference. I felt for the first time that maybe I actually could. Something so much larger than me suddenly became smaller, more tangible, even in the slightest way. I recommend this film to anyone who has wanted to make a difference in the fight against climate change, or even just to educate yourself about the subject. Who knows what tiny seed it may plant in your heart? ( pun intended) ❤"}, {"id": 121, "text": "Wow I really needed a positive documentary about the state of our world and this was it!!!! Watching this gave me a better understanding of how carbon works, how we can use the earths soil to combat the effects of climate change and start a cooling of our planet ASAP. Regenerative agricultural is music to my ears and I pray for the sake of our world that we start implementing these tactics ! Thank you for showing us direction and giving us some hope for this world!! I loved watching this film, I had tears of happiness!!!"}, {"id": 122, "text": "I had high expectations for this movie and they were totally fulfilled. I found myself getting emotional about the current state of the world portrayed in the movie and then hopeful about the excellent solutions presented. I knew a little bit about regenerative agriculture before but this movie opened my eyes to many things and gave me a unique perspective from the different people portrayed, especially the rancher who converted his land from vulnerable monoculture to sustainable regenerative agriculture."}, {"id": 123, "text": "Finally! Regenerative agriculture is experiencing an exciting and hopeful surge in interest and adoption because it works. Agricultural producers are really interested in testing these ideas out but we live in a market driven world. Watch the movie to learn about the possibility that we can all actually do something about climate change. We all need a little hope right now. Help drive the market toward regenerative ag for a better future!"}, {"id": 124, "text": "This film is entertaining for kids aged 7 to 97. It has beautiful cinematography and well is well edited. The characters are very down to earth and informative. It should be shared by everyone because the earth cannot wait."}, {"id": 125, "text": "After watching Kiss the Ground I felt like it is possible to pull this planet back from the brink! Thoughtful, intelligent an well filmed."}, {"id": 126, "text": "This should be compulsory viewing in every country throughout the world.Something has to change, and this shows a way forward that might just save us all."}, {"id": 127, "text": "This is a vitally important film, well prepared and very well put together in all respects. It explains how we as humans have wreaked havoc on the planet over centuries of agricultural and industrial activity. Blind faith in human progress has put our continuation as a species in danger. Any story like this can ill-afford to focus solely on the negative however and it carefully explains how soils and soils regeneration have the potential to reverse our decline. I want to live long enough to see at least the beginning of change. Well done to these film-makers - this is the film of the century."}, {"id": 128, "text": "What a wonderful, uplifting look at how the way we produce and consume food can literally reverse climate change and feed us better quality foods. Cause for optimism."}, {"id": 129, "text": "How did we not know this before?! Really interesting and we'll put together. Needs to be seen by as many people as possible"}, {"id": 130, "text": "This movie is a real inspiration and call for action to fight against climate change with simple solutions : choose healthy food to promote sustainable agriculture, recyle &amp; compost, etc. I really like the tempo which explains very well the facts, the science behind it and the opportunities we have to change. To watch at 100%"}, {"id": 131, "text": "Thank you so much for making this documentary.I have been thinking a lot about the climat change and I actually did give up.. but after this movie I was reviled. Yes - there is a lot of work to do, but it is possile.What I really liked was how everything wwas excplaned very easy and made so much sence. It actually gave me a deeper understand who I am as a human. I am a part of this world and so are we all.I will gladly spred this documentary to give hope!Thank you again!!"}, {"id": 132, "text": "This film is fantastic. It educates, informs and inspires the audience in how it is made. It shows the reality of our climate crisis whilst offers hope of solutions. Easy to understand and engage with."}, {"id": 133, "text": "I am so moved and excited for the hope I see now for human beings in this planet! I will share this with everyone I know! Feeling so inspired!"}, {"id": 134, "text": "So good to see something coming out that doesn't blame animals (who have always walked the earth) for our planets issue. If you watched conspiracy, and bought that nonsense, you need to see this."}, {"id": 135, "text": "The first time I've felt hopeful in a very long time. I learned so much from the documentary, I truly hope these ideas can be put into action in time to save us all."}, {"id": 136, "text": "So emotional to watch as I as a farmer for 28 years are walking down this road for the last two of them and already know how true this is out of first hand experience!Must watch for the whole world !!!"}, {"id": 137, "text": "People need to hear this and learn how we can move forward we need this!"}, {"id": 138, "text": "We need more people like this. We need these people to lead our countries, to actually help nature, And by so also help animals and humans. We needs everyone to become a green rebel and change. We need our school systems to change and educate our children what is really important and get them outside, work with nature. Documentaries like these bring hope. If you feel inspired, then please act."}, {"id": 139, "text": "This movie will not only educate, inspire and encourage you- it will move you straight into action. This is a film that needs to be watched by every single human!"}, {"id": 140, "text": "This is a fantastic film that I'm going to show my 9th grade Earth Science students. It is both eye-opening and hopeful. Regenerative Agriculture can solve so many problems, from water to food to climate! Thank you, producers, for this film."}, {"id": 141, "text": "This film helps explain how incredibly important - and endangered - our soil is to life on Earth. It's positive because it offers simple solutions to fixing an array of problems."}, {"id": 142, "text": "This is so genuine and gives voice to things have been spoken about in grass roots communities and Permaculture circles like the ones I am part of for a very long time. It is bringing regenerative thinking to new audiences. There is something for everyone: whether living in communities in socially excluded areas of cities like Detroit far from affordable nutrient dense food where Passion makes money and health for her community from waste as compost, or to rural areas where farmers pushed into greater debt and more depleted land are finding that regenerating their soil ecology and ecosystems is regenerating them, their families and their wealth and their communities. There are undercurrents of themes for global social justice as the examples from the Global south show the migration off the poor land by now poor people. It cultivates new love for soil life and compassion at the same time. thanks to all who made it happen!"}, {"id": 143, "text": "As a person who was starting to lose all hope that we could ever turn this climate crisis around, this film is a breath of fresh air. It's not blindly hopeful either.It addresses the reality of the situation, while also showing how easily we could fix this problem if only we could work together to change how the world does agriculture.All in all, really enjoyable. Go watch it!"}, {"id": 144, "text": "The kind of documentary that can literally save the World showing how we can ALL contribute into healing our Planet and turn things around. The clock is ticking."}, {"id": 145, "text": "This is such a wonderful and uplifting movie in a time when it feels the world is crumbling down and there's little hope left. I love how it shows there are simple things we can learn to do to help ourselves (and the planet) through all this. Don't want to reveal too much from the actual movie, but it's definitely worth the watch, even if you think you know the subject matter very well. Peoples stories here are so full of hope!"}, {"id": 146, "text": "What an amazing and informative documentary. Absolutely everyone needs to see this in order for us to start regenerating our poor planet on a much larger scale. Keep sharing!!"}, {"id": 147, "text": "Very inspiritional - there is hope for our planet!"}, {"id": 148, "text": "I am so glad I decided to watch this detrimentally important documentary!! If it wasn't 1am I would be messaging every person I know, telling them to watch it immediately. So enlightening and eye opening. Thank you to every human who is putting in this amazing work, and to those who put this film together to share with all of us. Watch this. Now."}, {"id": 149, "text": "This documentary provides promising solutions to reverse climate change!! A MUST WATCH!"}, {"id": 150, "text": "How long has it been since you felt actual hope about the future of this planet and human life on it? This film offers an incredibly simply and powerful solution to reverse climate change. Watch this film and tell everyone you know to watch it."}, {"id": 151, "text": "Ugly-cried the whole movie. The message is overwhelmingly encouraging, the time has come. Watch the movie, join the movement. We must do better."}, {"id": 152, "text": "Nothing more moving than this documentary. Hope for a better tomorrow. Makes you want to do something now to be apart of this incredible opportunity to heal our planet. To learn from nature."}, {"id": 153, "text": "This movie covers many solutions we can all do to make our planet more able to recover from the damage we've done over the last 100 hundred years. It follows real people who are making a difference. Beautiful photography, a great story, music and all contributing to a better outcome. Give it a watch."}, {"id": 154, "text": "A very inspiring documentary. I'm already following it's ideas, tips and advice to protect the planet, be more conscious about it and start growing my own natural and organic food. I'm also not wasting food, and planting more plants, trees and protecting soil..."}, {"id": 155, "text": "This is wonderful movie - beautifully put together. The people featured in this movie are the pioneers of a movement that, if we support it, can ensure that we will all live into the future surrounded by deep and complex life giving life.Fire up Netflix and watch it!"}, {"id": 156, "text": "Everyone has to watch this movie to truly understand how far deep we are in with battling climate change and so many other issues that can be resolved by using regenerative farming methods. All of the answers lie within our feet. We must make a lifestyle change and this documentary moves you enough to do just that. 100000 times recommend!!"}, {"id": 157, "text": "This is a must see documentary that gives me so much hope about combatting climate change. Share it with your friends and family, and get organizing! We're going to need people power to make regenerative farming the way forward!"}, {"id": 158, "text": "It moved me and I hope it moves you too, and inspire to keep fighting this fight to save our planet earth. Join the movement!"}, {"id": 159, "text": "The film makers and ALL the contributors (scientists, farmers, authors, environmentalists, public figures) presented an easy-to-follow map on what we can each do to reverse the consequences of global warming. The solution is as simple as planting a tree and covering the soil with plants! The graphics which accompanied the various explanations make the information easy to understand. This should be a must-see film for everyone to watch. Even if you don't watch the whole thing (which you really should) the message is clear from the very beginning!"}, {"id": 160, "text": "This is the rare film that communicates truth about our dire ecological disaster alongside a pure, simple, natural solution. It gives me hope and also a clear path of action. Thank you!"}, {"id": 161, "text": "We get our meat from the Markegard family and it's always fabulous."}, {"id": 162, "text": "Very highly recommend this movie. The facts are presented in an accessible way alongside clear actions we can all take. It is empowering."}, {"id": 163, "text": "Finally positive documentary about climate change! That even gives you easy solutions That you could start doing !"}, {"id": 164, "text": "Grateful to have had the opportunity to have seen this &amp; understand that carbon exchange and the biodynamic system that can be created to enhance that overall healthier planet our external &amp; internal environments can evolve progressively in time over time and this doco has given us that much needed KEY to access this information to turn back that downward spiral of extinction or even destruction of Earth. This is the overall Key to our survival. Children from now on need to understand this process, this should be in all school curriculum moving forward."}, {"id": 165, "text": "This film discusses not just the problems facing our planet, but gives us hope, and the solution has always been under our feet! Looking deep inside our planet's biological system can be complex, this film breaks it down in bite-size details so that the whole family can understand that WE CAN ALL DO SOMETHING RIGHT NOW to make a difference. A new kind of film that inspires the heart of anyone who calls planet earth home."}, {"id": 166, "text": "Just a marvelous film that points the way at a very understandable level for anyone of any age to a set of practices and how they work together to regenerate the health of our soils, our ecosystems and our climate."}, {"id": 167, "text": "There's a way fwd, and this movie clearly conveys this hugely important message!!!"}, {"id": 168, "text": "All this movies about the environment are super depressing. This one left me full of hope. Please support regenerative agriculture. The problem is not the meat, it's where the meat is at. I hope that no matter what your nutritional choices are we can all agree that we can not keep taking from Mother Earth without giving back #topsoilmatters"}, {"id": 169, "text": "My climate anxiety has been through the roof and this documentary has given me a rare hope that excites me for the future! Great film."}, {"id": 170, "text": "What a joy to get a thorough, easily accessible perspective and program of action (for nations, individual farmers, me) how to regenerate the world (instead of being distra Ted by debates Ives disposable straws). As a teacher, the non-patronizing but substantive show and tell meant a lot to me because it replaces all the depression and hopelessness and paralysis with understanding and real world actions I / you / they can implement now so that our great great grandchildren can flourish And we can have the satisfaction of doing something real and good and uplifting."}, {"id": 171, "text": "A much needed film right now. It's so hard to find Hope when it comes to Climate Change, but this film is in abundant supply. The film easily explains what needs to happen for us to reverse the effects of climate change and make our world livable for generations to come. And it's all in the soil! Great documentary!"}, {"id": 172, "text": "Thank you for this movie! 🙏🏻 We need an education about our soil, about sustainable agriculture, and more, and this movie takes us in this direction (the good one!)🙏🏻"}, {"id": 173, "text": "Full of real science, and straightforward ideas to make impactful change for all. Highly inspirational! The lack of education and public awareness of soil and carbon cycles is shocking. We need a complete overall of our school curriculums to address this gap in knowledge and address misconceptions."}, {"id": 174, "text": "I cannot imagine watching this movie and it not impacting how one views what feels like the insurmountable challenge of reversing climate change. It makes the solution seem within reach. Thank you for the education, next steps and hope!"}, {"id": 175, "text": "Very interesting, Mr. Harrelson pulls you and keeps your attention thru the film. Shows you how dire our situation is and what an easy fix is offered. I highly recommend for everyone, we only have one Earth and about time we stop killing our home."}, {"id": 176, "text": "An incredible documentary! Worth every second! Everybody in the planet should watch it! It is inspiring and full of good information. What are you going to do? If you have doubts go to the movie website!"}, {"id": 177, "text": "Everyone needs to watch this! A beautiful documentary on what we can do to make aure this amazing planet us healthy and everything in it. It brought tears to my eyes. We have to make change now and this proves we can certainly do that."}, {"id": 178, "text": "This documentary is fantastic and is well worth your time. A way for everyone to win, and future generations to thrive. I've always figured we're just doomed but this documentary lays the groundwork for a future and gives you hope. 10/10"}, {"id": 179, "text": "Informative, exciting, inspiring, a vision to hold and promote, full of hope for our dear Earth and all of us who live here. This is a MUST watch for all those who have given up hope and have become lost in depression and despair. Positive and committed to what i call,Love in Action in the World, let this film touch hearts and change minds and move farming into a force for healing and regeneration. If not now, when!"}, {"id": 180, "text": "Required! this documentary is extremely necessary for everyone. simple, deep! watch"}, {"id": 181, "text": "Awesome documentary, makes me feel hopeful for our future"}, {"id": 182, "text": "Why isn't everyone talking about this? This could change the world, and secure the future of mankind here on earth. Highly recommend watching it!"}, {"id": 183, "text": "Very well put together. Our children need us to do this."}, {"id": 184, "text": "As a college student it's important to learn so much about how to help the earth and preserve it. This was an amazing film! i learned so much and cant wait to apply it to my daily routine"}, {"id": 185, "text": "Brings inspiration and offers solutions. I loved this documentary that gives hope."}, {"id": 186, "text": "Worth your time. More profitable farms, better crops, and removing the CO2 the we put into the atmosphere if we put resources into creating healthier soil.Many, many other benefits to humans mentioned in the documentary."}, {"id": 187, "text": "Great and necessary film. Our planet is deteriorating before our eyes and it's time to do our part. Who knew the answers were so simple."}, {"id": 188, "text": "A film that shows us realistic things we can do to stop climate change TODAY! I'm inspired."}, {"id": 189, "text": "Logical and easy solutions that can heal our Mother Earth. No hunger, poverty, everyone having access to good nutrition. Most importantly it will Green the entire earth if we all follow this example. We can do it! So much bad news out there right now, if you want to be uplifted by realistic possibilities, this is what you want to watch. Another good one is Return to Eden on YouTube. Also the Food Justice Film Festival is going on right now with excellent documentaries. Google it and sign up! Excellent Documentaries going on all week. Today was Gather, which was about Native Americans returning to their natural food sources and healing their communities. Very Inspiring!"}, {"id": 190, "text": "This should be mandatory viewing in every school in the world. Wow!"}, {"id": 191, "text": "This is the real deal way we're going to ensure a future for life on Earth. Whilst we're taking the measures to fix the soil we're inevitably looking after ourselves. This is an awesome message and I hope it reaches as many as possible. Change is need."}, {"id": 192, "text": "This film moved me to tears, tears of joy and of hope. I am so grateful to the makes of this film for the work they are doing and the hope they are delivering. It is informative, inspiring and human. It really is a must see. Watch it and let's all take action."}, {"id": 193, "text": "Amazing information and super interesting! Healthy soil is the future!"}, {"id": 194, "text": "This film was so positive and uplifting. It gives me hope for our future. Everyone should see this."}, {"id": 195, "text": "Convincing about the green solution to the climate crisis. I love that this is not just a about the problem. Most of the narrative is actually about the sweet and in many ways simple solution. By reintroducing biodiversity the soil will store carbon. This can actually reverse the global warming in 20 years. I love the warmth and optimism of Kiss the Ground."}, {"id": 196, "text": "The first documentary to propose a real solution to the most important dilemma facing humanity. Inspiring, interesting and uplifting. Watch it - this is the moment our collective consciousness changes for the better."}, {"id": 197, "text": "I loved how this movie showed us how to heal the soil to reverse climate change. It inspired me to help with changes in my own community to heal the soil. I am going to start in my own backyard as I reach out to local sustainable/regernative leaders to see how I can help. This movie was very informative. I learned so much. I did not realize the planet was 1/3 desertified (soil loss) which causes less rain in those areas, famine, water shortages, and poverty with mass migrations out of those areas."}, {"id": 198, "text": "As a regenerative farmer I wasn't sure if this documentary would cover all of the issues surrounding industrial ag while educating the view on the importance using animals in regenerative agriculture. Boy was I wrong! They did a fantastic job at sticking to the facts and educating the view. Well done!"}, {"id": 199, "text": "Here is a chance to change the world for the better and we can all take part. View this movie and make the right choices in your life to foster the underlying principle and you will also enjoy better health and a happier life. Personally, I feel 10 stars seems a mediocre response to such a pivotal proposition this movie explains..."}, {"id": 200, "text": "This movie provide sound information for the current state of the world, while still providing hope in a valid solution to help us move forward. I wish every person would watch so we can act together to make helpful change!"}, {"id": 201, "text": "Everyone needs to be informed of this movement. We all can take part in some way. For our children and grandchildren please watch this movie and tell someone else about it. So eye opening and transforming. I feel hopeful!"}, {"id": 202, "text": "This film details what we CAN DO to reverse climate change by regenerating the soil. Until I recently learned about Allan Savory's work in holistic livestock management, I felt defeated and hopeless about the future of our planet. Immediately I felt a responsibility to learn all that I can about this method and to do all I can to help realize it. Then I ran across this beautiful film on Netflix, which explains this method and more, that we can use to regenerate the soil and reduce the carbon dioxide in our atmosphere. The soil is the key. Reducing carbon emissions in vehicles and industry can only go so far, and can only slow the growth of climate change. Regenerating our soil can REVERSE the process and save humanity. It's that simple. Let's get to work."}, {"id": 203, "text": "Gave me immense hope in a world that is forever beating that hope to a pulp. Lots of great information and great at making connections for the layman. Phenomenal message and I hope that one day we will finally regenerate Mother Earth."}, {"id": 204, "text": "The solution for making The Earth a better place for us is in this movie."}, {"id": 205, "text": "I love this film! There's so much we can do to help restore our planet."}, {"id": 206, "text": "I tell everyone I know that IT'S THE SOIL and I'm so glad I have an uplifting and digestible film to share with them. I've been following this community for so long I'm glad they have made this film."}, {"id": 207, "text": "Best movie on climate change. This actually gives us hope and a solution to the problem."}, {"id": 208, "text": "This documentary is a fantastic, hopeful, eye opening call to action detailing life never before what is actually possible for our generation, to dramatically improve our entire planet and lives as humans on this Earth. It should be at the epicenter of conversation as we approach the elections. I urge all to watch it and become informed."}, {"id": 209, "text": "Critical viewing for anyone who cares about our planet, children, food, environment, or future. Realistic and optimistic solutions exist that can save our world, improve our lives, and save money in the long run!"}, {"id": 210, "text": "Such an eye opener and it seems so simple. Loved. it!"}, {"id": 211, "text": "This documentary did it all -- and I feel that this should be taught in ALL schools starting in grade school. As someone who has personally been fighting Monsanto/Bayer and their ilk for the last seven years I can attest to the validity that chemical farming is destroying our planet -- and it is the only one we have. And for those of you that aren't farmers and want to support the movement -- buy only organic and support your local farmers. Start a garden and grow some of your own food! I love this documentary and will watch it/marinate in it many times. Thank you Finian and crew!"}, {"id": 212, "text": "This inspiring documentary ties together the work of many of the greatest leaders in the regeneration movement, a simple but powerful notion that restoring the natural function of the earth is the only way that earth will continue to provide us the resources and environments we need for humans to thrive. This is 100% on point and extremely timely. I hope everyone from farmer to politician will watch and learn!"}, {"id": 213, "text": "Wonderful, practical solutions gave me hope for a better world"}, {"id": 214, "text": "This humanistic, deeply affecting film has made me believe ever since the trailer first came out. I've been closely following the movie, the website, the instagrams, ever since and this movie was more than I could've hoped it to be. I seriously can't wait to incorporate everything I learned into my life. This has been one of the most unforgettable ways that climate change has been taught to me and one of the factors that fueled me to want to do something about it."}, {"id": 215, "text": "This documentary as many other environmental films must continue to flood the media so we can all wake up and then take action. beautifully done and documented with science and truth. its truly about opening our eyes to the reality and it has to continue with taking daily actions towards regenerative living - each of us. it takes all of us."}, {"id": 216, "text": "Finally we have action steps we can do! Wonderful movie."}, {"id": 217, "text": "This movie came at the right time as I am learning to become part of the solution. It is a story of hope compared to all of the gloom and doom you see on the news. Even if you don't believe in climate change, this movie is worth your time.Let's be part of the change."}, {"id": 218, "text": "This movie is a must-see for anyone who: 1) cares about the planet, sustainability, and practical climate change solutions, 2) needs a dose of GOOD NEWS, and 3) is is involved in any way with planting or farming. Is it so unfortunate that climate change is so politicized in the US. But farming on dead, desertified land has no political spin and this movie shows just how simple and logical a real solution is. Thank you Kiss the Ground for sharing such an inspirational message!"}, {"id": 219, "text": "This movie is so amazing, I read the book a couple of years ago and the movie did not disappoint! So uplifting and such a simple solution to our problems!"}, {"id": 220, "text": "This is possibly the most positive prescriptive resolution to a large part of global warming/climate crisis that I have ever seen. I was inspired to tears. The desertification of the planet can be stopped.If you haven't seen it yet, do yourself a favor and get inspired. The hope generated by this documentary is healing. The solutions are simple and will require global participation. There are many countries involved in this new way to farm food already. This country, USA, isn't one of them yet. There are places in this film that are magical.Truly &amp; profoundly healing."}, {"id": 221, "text": "Amazing documentary! Whether you're democratic or republican this information is vital if you care about the future of humanity and our children. Fixing the soil is the answer! Education is the answer! Spread the word. This message is vital."}, {"id": 222, "text": "A must watch!!!! I had no idea regenerative farming could reverse the carbon impact that is warming our planet."}, {"id": 223, "text": "I didn't want the documentary to end! I plan on watching it again and sharing with my community."}, {"id": 224, "text": "There is hope, midway through this doc I was flooded with tears. There was a lot of new knowledge I now have because of this film. Everyone on the planet should see this, and remember where we come from, Don't give up and grow something :)"}, {"id": 225, "text": "True life drama depicting the major solutions to overcome climate change, enrich the Earth for feeding the world."}, {"id": 226, "text": "As we are all contemplate how we can help in the fight against climate change this film gives hope - clear action. It is a must see for all human kind."}, {"id": 227, "text": "As an international expert on compost and soil fertility, I know that Kiss the Ground's Regenerative Agriculture Film is the best source for the most important information there is today. I work with famers and ranchers utilizing these methods and having great results. This set of cascading win-win-win-win scenarios is the best and cheapest way to sequester carbon as well as growing healthy food, reducing flooding and many other benefits."}, {"id": 228, "text": "After watching this film, my eyes were opened to the great opportunity we have a society to positively impact the world our children will be living in. I have hope for the future &amp; I am willing to take the pledge to change the world in a regenerative way. This is a must-see!"}, {"id": 229, "text": "What a great movie! Not many films nowadays leave you uplifted with hope for the furture. This is a back to nature, common sense narrative that shows us the way out of the mess the world is in. If you are not aware of the regenerative movement, you will be thoroughly engrossed!"}, {"id": 230, "text": "I watched this last night and was completely blown away. It was very educational, and today has me wanting to change things, to leave as little a carbon footprint as possible, so i am checking my local farmers for my food. I have started composting and will look into other ways I can make a difference."}, {"id": 231, "text": "So inspiring to see a positive spin on climate change and with actual information on how it can be helped/reversed. This movie should be on the curriculum for school children worldwide, hit the next generation up with some positivity and give them the tools to make the changes"}, {"id": 232, "text": "This is a beautifully made film where the passion of everyone involved shines through. It's a wonderful mix of the sobbering assessment of where things stand today and the many great reasons we should have hope and put our hearts and mind into taking action. The film is packed with big-name celebrities, but the true stars of the movie are the men and women practicing regenerative farming or ranching today and evangelizing to encourage others to do the same."}, {"id": 233, "text": "Kiss The Ground is an organization I have been following for a few years. It was thrilling to read the book and then watch THIS documentary. I am absolutely excited to have simple solutions to reverse climate change laid out, now just to get industrial farmers on board. Thank you for releasing this in a way that doesn't stoke fear and doom to it's core, but gives us viable solutions. We can no longer sustain, now we must regenerate the earth. As Gisele Bündchen so put it, and I paraphrase, When the Earth is sick, we are sick."}, {"id": 234, "text": "It was interesting, informative, and hopeful with everything that's going on in the world today we need hope. It was very comforting to know that a lot of farmers are doing the right thing already. I'm looking right now to go to a local sustainable farmer for my produce."}, {"id": 235, "text": "This movie was very well done. It was easy to follow the science and understand the concepts. This could be one of the most important movies at this particular time to help combat soil erosion and global climate change. Everyone needs to watch this movie and hen take some sort of action within their own life to be apart of the solution."}, {"id": 236, "text": "Best animations for explaining the Carbon cycle and its link to the water cycle. Excellent explanations by Gabe Brown who is healing the land by growing cover crops without tillage or chemicals and integrating with various animals! Fostering life! and makes loads of money!"}, {"id": 237, "text": "Essential viewing . Increasing awareness of how we can all contribute to restoring our planet is imperarive"}, {"id": 238, "text": "Core principles explained simply on how to dramatically improve our environment. This documentary should be required viewing and on public broadcast."}, {"id": 239, "text": "We know we have to get things done but how? This movie gives the best explanation of how we can get things done to change this world for the better and solve the climate crisis. Let's get to work!"}, {"id": 240, "text": "Important and educational documentary for people to watch. You will learn how easy it is for all of us to become agents of transformation in creating a healthy environment and planet."}, {"id": 241, "text": "This movie is INCREDIBLE!! For non-climatologists, it gives an easy to understand explanation and solution to help heal the planet. The best part is, it give multiple DOABLE solutions that you can do in your own household/backyard. Love love love this and will be doing more research into regeneration and sustainable agriculture after watching this movie. I already have some books on hold at my local library!"}, {"id": 242, "text": "This is one of the most eye-opening docs I've ever seen on climate change. Before watching this, I considered myself knowledgeable on the issue. But after watching it, I realized that how important soil is and how simple the solution really is. This doc is educational, engaging and inspiring. This should be required viewing in every school across the world."}, {"id": 243, "text": "Loved watching this documentary! It's very informative and inspiring to easily understand how the answer to climate change has been under our feet (literally) all along. Everyone should watch this! 10/10"}, {"id": 244, "text": "Beautiful movie that brings hope for a better future and planet. Everyone can make a change. Small changes lead to big impacts."}, {"id": 245, "text": "There IS hope for the world. Watching the transformation of leaches soil to lush green foliage blew me away. I don't farm, but I intend to talk to farmers in my town about this documentary and encourage them to watch this film. Thank s to all involved with this film for a very eye opening experience. I will watch it again this weekend. God's bless, people."}, {"id": 246, "text": "Powerful. Educational. And absolutely brilliant. This movie is probably one of the 21st Century's most important and interesting documentary, about climate change, the planet and how we can save it."}, {"id": 247, "text": "Absolutely crucial time for this to come out. Everyone needs to watch this and understand the content in this film. 100% recommend to everyone, to learn and pass on the info! EDUCATION!"}, {"id": 248, "text": "This film should be compulsory viewing for everyone on the planet. If we act now global warming can be turned into global cooling in just twenty years, with benefits for the whole of humanity. We cannot recommend this film more highly - the time to take action is now!"}, {"id": 249, "text": "Awesome job on the creativity to tell the farm story! The narration was very well written and explained how Agriculture has decended to a very dismal point in our food production. Showing the contrast between Big Ag farming practices and farming with Mother Nature makes it very clear that we can not continue on this path any longer. The health crisis is continuing to rise. The best news is Regenerative Agriculture! Human health &amp; the environment can be turned around dramatically if consumers will speak with their fork. Farming with Regenerative concepts has brought new life to our family and our farm. #RegenerativeAg #RegenerativeFood #RegenerativeHealth"}, {"id": 250, "text": "With business as usual, we have sixty harvests left. That should be all we need to know in order to be buoyed into action, surely? Apparently not. The 'drawdown' approach to our increasing CO2 emissions, described in detail here, feels as if it has not gained sufficient traction in the general media discourse on the climate crisis. This is strange given that it is promoting a proven method to begin removing excess CO2 from our atmosphere well within our children's lifetimes by natural and readily available methods. This is in stark contrast to carbon capture technologies, which remain unproven in the field and would likely be extremely expensive to upscale. The film is engaging, accessible and earnest, and should be a call to arms."}, {"id": 251, "text": "I could not have imagined how much of a parallel universe we are in. The Great Mother is experiencing the same things as we - humans do with our own personal microbiome and eco system.We could feed ourselves rubbsh and degenerate. In the same breathe, we could learn about the do-hows-why-what-where and regenerate our human bodily system in parallel to this great worj that has been documented.New 2021 goal in the making, personal/ family contribution to what we can do with our own resources... one step at a time, one heart at a time, for the Mother"}, {"id": 252, "text": "This was a great movie! Very informative! Explained everything very well! Loved all the stories it had in it connecting the evidence found! This is a must watch film!"}, {"id": 253, "text": "It's about time someone presented the real solution for climate change. Regenerative agriculture is so critical to our future. We need to start opening people eyes to really understanding what's going on with their food being produced around them. Instead of just blaming cows which seems so popular. They are part of the solution. China, USA and India now need real pressure and consumer demand for them to start changing their production methods on the large scale too."}, {"id": 254, "text": "I want to start off by saying if you don't know much about global warming or about agriculture but are opened to educating yourself about these issues this documentary is it. It provides you with a vast amount of knowledge of how soil is the one of the key answers to our problems. It also shows how different countries, states, and cities have taken in their part to combat global warming. You learn about carbon dioxide and the graphics and narration keeps you at the edge of your seat. The amount of information that is provided to us with different paths we can take in order to take action is incredible. Kiss the Ground is a realistic documentary on the immense issue of global warming and how the way we have been living life whether it involves our agricultural process or our way of eating has affected Mother Earth. It brings to light all these issues that can make you feel like there is no way out of it but it also gives you the hope to not give up. The knowledge and education to keep going and the hope that if we all work together we can combat these issues. In one hour Kiss the Ground provides you all this knowledge without a yawn in between.I HIGHLY recommend it!"}, {"id": 255, "text": "I absolutely loved this documentary. It was heartfelt and it just seems like the good thing to do is to follow there path 🙏🙏🙏👌👌🏝🏝"}, {"id": 256, "text": "This is an eye-opening, heart breaking and also heart regenerating documentary that really hits the spot on. I cried twice; first out of worry and despair, and then out of hope and love.If everyone saw this, I think we could save the world!"}, {"id": 257, "text": "I'm a small scale regenerative farmer and this is the film that the world needs right now. It's inspiring and informative. Loved it."}, {"id": 258, "text": "I have been researching regenerative agricultural practices for around 2 years and this movie sums it all up in less than 2 hours. Kiss the Ground helps you understand the key principles required to reverse climate change YES YOU HEARD THAT RIGHT, REVERSE CLIMATE CHANGE. Just watch it, then vote for the party most likely to support it coming to fruition."}, {"id": 259, "text": "Beautiful film which offers hope in a time of great worry and concern about the fate of our Earth. So grateful for the farmers and activists who are working towards the most beneficial solution for our planet and those who inhabit it. Wishing all farmers see the value (to them, the earth and those who consume their products) and can receive the training and support to make their own farms regenerative! Thank you for the film - and the hope!"}, {"id": 260, "text": "The most important documentary I've seen on climate change. Uplifting, informative and essential viewing. It's slick, beautifully made and I'll be watching it again and again. Woody Harrelson is tremendous as a narrator. Thank you for making this film."}, {"id": 261, "text": "Informative &amp; inspiring film - a must watch for all our futures!"}, {"id": 262, "text": "An excellent film with a positive and hopeful message about The soil and how it might save us (if we save it!). I loved it!"}, {"id": 263, "text": "This movie was a wake up call and every single person out there needs to see this to know there is still hope for our planet. Very powerful film so excited to share this with everyone I know!"}, {"id": 264, "text": "This film has grabbed my heart and ignited my passion!! I'm so grateful that the creators of this film had the stamina and brilliance to create this. EVERYONE should watch this and begin implementing simple life changes. This film is really well done and engaging to watch. I'm excited to continue to learn more. HIGHLY RECOMMEND!!"}, {"id": 265, "text": "Modern agricultural methods have destroyed soils planetwide turning the living matter into lifeless dirt. By turning to regenerative practices such as no till, no chemical inputs, regenerative grazing, the life can be brought back into the soils which will reduce atmospheric carbon, deacidify the oceans, store and clean water, grow more nutritious and delicious food, and be cheaper and safer for farmers. Let's make this change now! A beautiful and convincing exposition of these ideas."}, {"id": 266, "text": "Best i have ever seen you guys did a great job well done keeep up the good work lots of love and success ahead more and more"}, {"id": 267, "text": "This is so good I think it should be used as part of the curriculum in schools. I'm doing a degree in Environmental science and this tied in so well with my current module.That being said you don't need to be an academic to get lots out of this. Very informative and ultimately gives a positive message for the future of our planet."}, {"id": 268, "text": "Very good documentary that we should play in every school class. Only bad thing I can mention is that the movie presents permaculture as an panacea to climate change, which it is not."}, {"id": 269, "text": "It's really a good and inspirational documentary from where we learn such great things and which gives us hope that our world can be better and that we can solve a lot of problems from nowadays and all of that by working together in a traditional and healthy way for both people and our planet."}, {"id": 270, "text": "Expanded my thinking to what else can be... And is done around the world today to combat ecological damage."}, {"id": 271, "text": "This was very informative to me. I love the idea that we can bring life back to our soil."}, {"id": 272, "text": "Powerful and inspiring! Please watch this and share this, it's so very important now and for future generations. An incredible piece of film."}, {"id": 273, "text": "Everyone must watch this documentary. It is in our power to save the planet for our Children and their children. It is in our power to do this and we must."}, {"id": 274, "text": "It's a great movie with a great message! Definitely an important movie for everyone to watch."}, {"id": 275, "text": "I am someone who is recently paying attention to our planet and what we need to do as humans to save our earth. I can not recommend this film enough, this is a must watch. It really changes your whole perspective and puts out a clear message for all to understand and contribute 🌍"}, {"id": 276, "text": "Love love loved it. Very informative and eye opening. Hope more such pieces are made."}, {"id": 277, "text": "Beautiful and inspiring! Please take the time to watch. Changed the way I view things."}, {"id": 278, "text": "This is one of best documentary I've seen in a while and message it conveys is revolutionary. You must see this movie and please make people watch it. Please watch this movie."}, {"id": 279, "text": "I love the movie . Gave me so much hope to make the work a better place. It's an eye opener for us humans."}, {"id": 280, "text": "This film/documentary is such an inspiration for all of us. Congratulations from Italy :)"}, {"id": 281, "text": "This movie should be seen by the whole world. It should be part of everyones corriculum in school. I think it would open the eyes of a lot of people, when it comes to how er treat our world."}, {"id": 282, "text": "It Is a very good production. I love the day they explain the situation and they Also give solutions."}, {"id": 283, "text": "A very powerful and informative film. A must see for everyone on the planet."}, {"id": 284, "text": "Concerned about climate change and what we can do about it? Watch this film. Seriously, who knew this could make such an impact!!!"}, {"id": 285, "text": "I absolutely adored this film and found it extremely informative. I already eat organically, but this film made me want to support organic farming even more! I hope one-day the only food source available is organic so that we can have a cleaner and happier planet."}, {"id": 286, "text": "Ngl didn't seem like a film i would like but as i'm interested and studying geography, it shows a clever understanding on how to stop climate change - i also recommended it to afew friends"}, {"id": 287, "text": "Since watching this our family have been so much more focused on our footprint and what we can do to help. We have since joined Ecology in the UK and contributing to planting trees in Madagascar. We are also looking at growing some of our own vegetables and fruit! Inspiring documentary, very well put together and straight to the point! If this doesn't make you want to do something to help our planet....nothing will!"}, {"id": 288, "text": "Inspirational, positive, actionable hope for the future of the planet. Kiss the Ground is the most inspiring film on climate change solutions I've ever seen... Bravo"}, {"id": 289, "text": "Its super helpful gmfor everyone who really love earth"}, {"id": 290, "text": "An inspiring and important movie! Everyone should watch it!"}, {"id": 291, "text": "This movie is absolutely amazing! It's so informative, teaches us so many things about our soil. These people have definitely put in a lot of efforts in it, I appreciate it so much. So glad this movie was made."}, {"id": 292, "text": "This movie is so inspirational and eye opening and it make me want to change my ways of life"}, {"id": 293, "text": "It's good to see people talking and doing soo much for our nature."}, {"id": 294, "text": "I love nature...when I know about this movie I download Netflix just to see this movie.....this movie is really nice."}, {"id": 295, "text": "I'm from the rural Midwest and went into this with the mindset of oh another environmental movie by a bunch of Hollywood actors... but it was surprisingly eye opening. I've been recommending it to all of my friends and acquaintances.Definitely one that deserves a spot on your must see list!"}, {"id": 296, "text": "This movie was so informative and inspiring as well. The one who didn't watched this documentary, should must watch. I loved this movie. I appreciate the great effort done by Ian somerhalder and all the other members who are involved in creating such an inspiring movie. Everyone should give 10 star for our star Ian somerhalder.😊❤💯"}, {"id": 297, "text": "It is a breathtaking movie. Ian has worked so good. Its really a treat to your eyes."}, {"id": 298, "text": "It's the best movies i've seen in my life about the environment"}, {"id": 299, "text": "Technically, you should have watched this yesterday. This movie is educational and inspiring. We can all make a difference - truly. But it's only possible by educating, sharing and believing it is possible! Watch this film and share it with others, you won't be disappointed."}, {"id": 300, "text": "Watched this documentary and so obvious the solution and yet we just keep overlooking. It's going to be a huge effort but if we each just do our part we can do this! Very informative and a must see for everyone who cares about our future."}, {"id": 301, "text": "The most inspiring movie I've ever watched! This is a hope for our future."}, {"id": 302, "text": "Amazing movie, I'm so happy that my idol (Ian) and amazing people with a big influence are talking about such and important thing. I take notes of facts that were on the movie cause I wanna keep helping the planet, since I was little I wanted to make a change and I'm trying it every day&lt;3 thanks for doing this, it's so important."}, {"id": 303, "text": "You will not be disappointed. This film was so nicely done. I learned a ton and was captivated the entire time."}, {"id": 304, "text": "I have watched many documentaries on the environment and this was one of the most hopeful and practical ones I've seen. Highly recommend"}, {"id": 305, "text": "This is a great film !!! very informative and educational"}, {"id": 306, "text": "You REALLY want to help save Earth and your pathetic little garden is your best effort. Bravo. There are, at last count, 7.6 BILLION humans busy eating, shltting and focking like crazy and the population is projected to climb and climb and climb. So what is REALLY needed instead of inane feel-good documentaries ? LESS PEOPLE."}, {"id": 307, "text": "Its such a beautiful film, with lots of facts and information. I was in grossed and so were my kids. Our house has taken lots from this film and hope other do too."}, {"id": 308, "text": "Modern industrial agriculture destroys the soil. Destroyed soil retains and draws less carbon from the air. That carbon ends up in the atmosphere, which warms the planet.The answer, regenerate the soil.This documentary brings a host of ideas together that gives you a solid basic understanding of why you should try to buy organic produce, grass-finished beef, free range eggs and chicken, etc. And if you're farmer, how to get off welfare(subsidies) and make more money."}, {"id": 309, "text": "Fantastic information! I will be using this to heal wherever I am. Spread love"}, {"id": 310, "text": "I won't give up and neither should you. is this inspirational film's main message about climate change and global warming. Kiss the Ground, from directors and producers Josh and Rebecca Tickell, is an uplifting and heartwarming film about how individual efforts from around the globe can work together to help heal our planet. Various experts and activists contribute their own voices to this message in an attempt to motivate the film's audience to make a change in their own lives. This transformative film left me feeling hopeful that there is something we can still do to help heal our environment."}, {"id": 311, "text": "Incredible to see how these principles work and the modeling that shows we really can save our planet. MUST SEE especially for anyone who has lost hope."}, {"id": 312, "text": "I give it top score not by the quality of the movie but because of the message. I had no idea about this carbon issue we are suffering and it has logic on what they say, hell I just need to see the green field of one and the desert of the neighbor.I also see that cattle is not to blame for itself, but for the way they are fed with.Interesting point of view, and yes I know it is strange all being so perfect to be true but fact is if human kind wiped today, in 50 years all the climatic issues would be solved... so yea we and our fast food, fast cash, fast everything are to blame.More like this movies should come and educate us the 40s that are still on time to do some change because our kids seems to already see the truth."}, {"id": 313, "text": "Please watch and let's help mother earth...we all need to do our part and help get this earth back and healthy once again"}, {"id": 314, "text": "Allan Savory, Kiss the Ground, and many individual activists have been working for years on spreading the word about regenerative agriculture while actively regenerating areas thought to be barren wastelands. And yet, so few people know about this work, the practices behind it, or its potential to be a major driver in mitigating climate change. Further, most people don't know about the other looming catastrophe that is the complete erosion of our soil within 60 years if we continue on with business as usual. Kiss the Ground explains all of this, and it does it in a beautiful and compelling manner. At some points the many celebrity cameos may seem a bit gratuitous, but I also see it as these stars understanding that this work is the most important thing they can be lending their time to now. It touches on all the necessary points: the science, the politics, the people. Please, watch this movie, and get everyone you know to watch it, too."}, {"id": 315, "text": "How much no tilling, no artificial chemicals, cover crops, balanced grazing, can really transform our soil! All we need now is commitment!"}, {"id": 316, "text": "There is a completely attainable solution to the climate instability and desertification that is progressing on our world.. regenerative agriculture can restore health to the soil, draw down atmospheric CO2, and produce great abundance at the same time. This needs to get out to as many people as possible, and I'm so glad to see it here. Such a hopeful film!"}, {"id": 317, "text": "Finally a positive view on what we can all do to solve the biggest problem of our generation."}, {"id": 318, "text": "This is an amazing movie!!! Very inspiring. Special thanks to Ian Somerhalder!!!"}, {"id": 319, "text": "Truly inspirational. I love how they broke everything down the best way possible to understand to importance on how we live and the impact on Mother Nature! This film has made me think and helped me understand what I can do to be part of a change for the sake of our future generations."}, {"id": 320, "text": "Educational, uplifting and invigorating. This movie helps us re-imagine positive possibilities to save us humans by living and growing With our Planet Environment. Please watch and share."}, {"id": 321, "text": "Kiss the Ground beautifully and credibly demonstrates the crucial importance of soil for human and environmental health. It opened my eyes to the connection of soil desertification to all social problems around the world. It spoke truth as to how regenerative agriculture can be THE solution to climate change and world hunger, further solidifying the controversy of economic and political power putting sticks in nature's simplicity wheel. Everyone needs to watch this. Incredible."}, {"id": 322, "text": "There's some simple science to the answers proposed in this film, and it may just be time to respect science and nature to cooperate in bringing about the change. Not denying, neglecting, or whatever else people do with the climate and their own families. But actually respect that something has happened and something can be done about it. An Inconvenient Truth left me hopeless. Kiss the Ground left me hopeful."}, {"id": 323, "text": "With time running out and our options getting fewer and fewer every day, this film presents an easy (comparatively speaking) plan to implement that will have profound positive impacts on our planet. And absolutely wonderful primer if this is an introduction to regenerative agriculture but with enough hope to keep you interested if you've been following this path for a long time."}, {"id": 324, "text": "This covers a highly important factor in the fight against climate change: while also showing there are answers to our questions. We all need to watch this!"}, {"id": 325, "text": "I was so happy after watching this that I wanted to cry tears of joy! We're often given all the negative information about our climate which is all gloom and doom, but Kiss the Ground tells you what the solutions are and how we can implement them! I absolutely love this film and have shared it with everyone I know! Being a meat eater or vegan is not the issue - it's the choices we make!"}, {"id": 326, "text": "I can't even express how much I loved this movie/documentary, I have always been about fixing global warming but this inspired me even more to ty harder, I have been posting about this everywhere and I have been getting my family in on it...absolutely amazing and so well put together, I even cried at the end. #MotherEarth &lt;3 &lt;3"}, {"id": 327, "text": "This film is in informative and empowering. These people are all passionate about healing our planet. They show us the problem and then give us some very pragmatic solutions!!! Often, I feel overwhelmed by the bigness of some oh the problems in the world. This film as re-kindled hope!"}, {"id": 328, "text": "This a beautifully done and hopeful documentary that is simply a must watch for anyone concerned about the future of our planet. I had no idea how much hope there was in our soil and changing the way we farm. Simple and actionable solutions."}, {"id": 329, "text": "So inspiring and motivating. A complete walk through of what regenerative farming is and how to incorporate. Easy to understand. Fingers crossed this truly catches on and we all do our part to get excited about saving our planet!"}, {"id": 330, "text": "Shares the important message of being hopeful and that rejuvenating this world is possible! Educational and feel good for people of all ages and walks of life."}, {"id": 331, "text": "This is incredible. I feel so encouraged that there is actual obtainable solution to climate change. This solution benefits people, animals, farmers and land. I pray that EVERYONE watches this film and we do our parts."}, {"id": 332, "text": "One of the most important films of our time. Educational. Touching. Empowering."}, {"id": 333, "text": "This movie changed the way I look at our world and what needs to be done. It also confirmed what I've known all along, big business is going to have to make changes or our earth is done. The only way they will change is if consumers stand up to them."}, {"id": 334, "text": "I can honestly say Kiss the Ground is the most important movie of our critical time. This beautifully produced film is not only a joy to watch but is a way, one of the most vital ways we can save our planet and restore our broken ecosystems back to health and thriving. Living in an abundant, flourishing world is what any sane person would want for himself, his family and the generations to come. Please watch this magnificent movie and share widely. I am committing myself to this cause. We all need to commit to saving our magnificent world."}, {"id": 335, "text": "Great to see this issue so crucial to our survival presented in a well balanced way!"}, {"id": 336, "text": "At last we have a film that world can watch and realise the destruction that the traditional intensive farming industry is causing. Watch this film....and then react by doing your part. I want a better future for my children and my children's children....and together we can do this!"}, {"id": 337, "text": "This is the only movie I've watched in the last year. We did the kiss the ground advocacy course about a year ago and after the first lesson I almost quit because I didn't want to learn to be a soil advocate, I wanted to learn practical solutions on how I can apply regenerative agriculture on our small farm here in the Philippines. Anyway, I ended up watching another lesson, and another lesson, until the end and was absolutely blown away. It became the reason to farm. Looking after our soil became the main purpose of what we do. Needless to say, we were looking forward to the movie. I'm hoping as many people can see this as possible, especially those that aren't necessarily interested. Maybe they can find a way they can help contribute to saving us from extinction."}, {"id": 338, "text": "Amazing, doable plan to Immediately begin to reverse climate change."}, {"id": 339, "text": "This documentary is a must watch for audiences of all ages. It is informative, easy to digest, and produced very well."}, {"id": 340, "text": "I was waiting for the shoe to drop and hear this huge green house gas lecture or go vegan lecture to save the planet...but not even close. a greatly informative film that's not preachy, but makes us see a culprit we never recognized and solutions that are relatively simple. loved it."}, {"id": 341, "text": "I've never felt so moved and full of hope after watching a documentary. I highly recommend this documentary to anyone feeling like Climate Change is a lost cause."}, {"id": 342, "text": "2020 has been a dire year and like Woody Harellson, I had long since given up although already knowing all the things contained in this film. We may be in the triage stage of the collapse, but we do need hope to carry on even in that sad endeavor of being of service during this time.Despite the writing on the wall, this movie is just what the doctor ordered. I truly hope this film and the warriors it features continues to reach those who have the power to change the course we are with their message. All it takes is a decision to change and perhaps we can begin to shift off the course we are on.Blessings to all those who contributed to this film."}, {"id": 343, "text": "It should be mandatory that every person watch this ! Very informative and insightful! Woody of course is the best commentator as always! I learned alot about soil and agriculture processes i was unaware of. Thank u so much for making this film and i feel lucky to have seen it and spread the knowledge to help mother Earth and ourselves!"}, {"id": 344, "text": "I was never more excited in my life when I started reading about Gabe Brown. Here was a man that was proving you can farm on an industrial scale and actually REGENERATE the environment and improve the resulting food we eat. WOW!! And the icing on the cake....he was making a profit. This will also lead to the regeneration of rural communities. Improving soil is a win, win, win situation. Kiss The Ground did a fantastic job of explaining all these ideas to the general public.In my opinion whether or not you believe in climate change you can't go wrong with the principles of regenerative ag."}, {"id": 345, "text": "It's time to MakeSoil and heal our planet.Finian and the team at Kiss the Ground did an amazing job putting the pieces together for this groundbreaking film."}, {"id": 346, "text": "A great doco. Easy to understand. Very personal stories of folks who have created dramatic positive change"}, {"id": 347, "text": "I am sad to say I have been someone who has closed my eyes and ears to everything about climate change!!!! I have been extremely ignorant! This documentary has changed me and inspired me to make huge positive changes. It seems to be the first documentary that I have come across that is showing us a solution rather than just attacking different industries. It shows us what we can all do and how we can all work together to recreate our Garden of Eden Again. So so beautifully made. Let's hope we can all do a little to make big changes and that the leaders of the world listen too."}, {"id": 348, "text": "It's time to undo our actions towards Mother Nature and the way we treat our soil (source of food)"}, {"id": 349, "text": "Beautiful, absolutely beautiful!!!!!! Smiling from ear to ear, this is the future!!!"}, {"id": 350, "text": "This well articulated and visualized film highlights the single most important area of our global ecological system, soil health, and clearly states and shows which agricultural and cultural practices are destructive and which are regenerative. Regenerating soil health on this planet is our most effective means of sequestering carbon, enriching diversity and resilience in our ecosystem, and positively impacting human health. This is a must watch and a must share film."}, {"id": 351, "text": "This movie shows the shocking state of our conventional food supply system. BUT more importantly it shows us a better way. A way to work with nature to grow an abundance of food for the earth. Please watch and share with friends."}, {"id": 352, "text": "Having personally seen Browns Ranch with my own eyes, I can say this movie shows what's possible if only we take the steps to do so like Gabe Brown did in the 90's. Everyone should watch this movie."}, {"id": 353, "text": "I thought the documentary would be interesting because it concerns soil, a rather neglected subject that I've recently read about in a book called The Hidden Half of Nature. And it's soil, right? The film will be about a relatively neutral subject with science backing every idea in it. Alas, it was not like that. Instead, environmental activist actors narrate and star into something that is painfully progressive and one sided. It felt political, somehow. How does one politicize dirt?! And it's too bad, because what they said was mostly correct: there are cheap ways of farming sustainably, protecting life, earth, the air, sequestering carbon and giving us tasty food. Decoupled agriculture, plowing and artificial fertilizers are the very opposite of that and only serve chemical manufacturers. But they way they said it. Ugh!Using science to determine the best way to handle soil, which is the base of everything which is alive on land, is something relatively new. Understanding the role of microorganisms in everything from farming to medicine is relatively new. These subjects deserve recognition and study. Alas, farmers will never connect to something so painfully Californian. My advice: read about the subject and do your own research and experiments. Get acquainted with the way each piece of nature, from the microscopic to the gigantic, function in unison not in isolation.Bottom line: a fascinating subject, poorly popularized."}, {"id": 354, "text": "This documentary's celebrity charmed message of hope is beautiful and wonderfully put together, that's for sure. But unfortunately its message of holistic grazing is not in alignment with the scientific consensus, the anecdotes (Alan Savory and Gabe Brown) within the film have not had any legitimate scientific testing of their methods and the film cherry picks/misleads findings from the 'Drawdown Report' by Paul Hawken, the report being the core research focus of the documentary.One of the anecdote farmers within the doc is Alan Savory, whose methods have never been successfully repeated and have not had legitimate scientific testing. What's more, If he is the only one that can achieve the carbon sequestration that hes claiming, then that doesn't provide a lot of hope. Especially when you consider this is the same guy who ordered 40,000 African elephants to slaughter because he incorrectly thought they were damaging the land.If they wanted to stay with the scientific consensus, such as oxford university's piece by Joseph Poore, showing the biggest positive impact an individual can have on the planet by analysing 40,000 farms across 119 countries. Or by just simply looking at the Drawdown' Report's outlined solutions, not cherry picking the lesser significant parts. Then they should have said eating a plant based diet is the single biggest thing an individual can do for the planet. This is because a plant based food system had the lowest greenhouse gas emissions, ocean acidification, ocean deadzones, land use , water use, deforestation, habitat destruction and both land and marine biodiversity loss. In the solutions of the Drawdown Report they say that the shift to a vegan diet is twice as powerful as a shift to silvopasture and 4 times as powerful compared as shifting to managed grazing - which are two types of regenerative agriculture involving livestock. Hawkens' of the report also concludes the two biggest effects an individual can have are switching to a plant based diet and reducing food waste.I hope this doc doesn't detriment the required transition to a plant based food system, a part of the climate solution which is supported by the science and not just some damaging celebritised misleading message of hope in the wrong direction."}, {"id": 355, "text": "This documentary will leave you feeling hopeful, is the takeaway of the trailer for Kiss The Ground, and it poignantly succeeds at conveying an environmental message of hope and positivity. Through its wide range of talking heads, from environmental science experts to worldwide superstars, this documentary conveys a universal drive and compassion towards saving the Earth while also expertly unpacking the science behind an optimistic solution to climate change. The linear progression between topics helps keep a comfortable pace, making this an accessible as well as informative documentary regardless of one's background in environmental issues. The sweeping cinematography and colorful, postcard-like transitions of our planet's vibrant landscapes truly captures the beauty and power that soil is capable of, encapsulating a stark contrast between the desolate and lush scenery that our future could hold depending on our course of action. Overall, Kiss The Ground is phenomenal in expressing compassion for a planet worth saving, and skillfully informing audiences of all backgrounds on just how to do so. In a powerful 90 minutes, I felt well-informed, uplifted, and most of all inspired by the beauty of our environment."}, {"id": 356, "text": "Look, you can't say that as humans we aren't ignorant. We are, as a species, we are extremely ignorant.We need to do more to save the Earth from our destructive patterns of society and one of the ways to do that is through soil conservation. But that isn't the only way to do it and that is part of what I think this show missed.Sure, they have a lot of famous people giving their opinion and they have scientists giving their opinion, but there is more to this than just the soil. Our oceans are important also. And what about the industries that pollute the environment? What about the governments that turn a blind eye to the corruption?I think this show is trying its best to point out some of the problems in society, but it much more a world problem that an American problem. So how do we get the rest of the world to work together, with America? The first thing is to get rid of the current leaders and bring back leaders who are leaders of the people and not the industry."}, {"id": 357, "text": "Feels like an attempt by the meat industry to make people feel better about eating animal products. Starts out making a good case about the importance of healthy soil and how pesticides and mechanical damaging by ploughing are very detrimental to that. Then it introduces the farming of grazing animals as some miracle cure. Just let cows trample the fields and drop their feces and all will be well! Their evidence for this is the anecdote by a guy that wanted to have tens of thousands of elephants killed to 'save' the African flora and fauna. It feels like they want to tell people 'just keep eating your beef and you'll save the world (as long as it's grass fed dumdum)!', totally glossing over concerns ranging from practical (how many earths would we need to feed the earth's population?), environmental (these cows still burp methane and wouldn't a dense forest still be a better carbon sink than a field of grass?) and ethical (can you humanely kill an animal?).The docu does tell us that these principles also work for crop farming. However, it doesn't show us how it would work in practice apart from a non-disruptive seeding machine. The showmakers show how a huge, desertified region in China was restored back into a healthy, fertile agricultural land, but they failed to make a connection to the foundational principles presented in the movie."}, {"id": 358, "text": "It starts great, by explaining that the Leftist terrorism, of demonizing carbon and carbon dioxide, was always a lie. It's great for 20 min, with only a couple misleading issues. I thought, wow, this is really good . . . how did Netflix allow this?Then, sitting there, the Leftist toilet bomb explodes . . . the bathroom floods . . . you start drowning as you wash out into the flooded torrent outside your bedroom . . . you start praying for a double rainbow, while you see an ark passing by . . . you scream for Noah to save you . . . he doesn't have space, but he prays for you as you drop below the surface 🤷The movie is 40% Leftist propaganda. Lots of misleading statements, including how big government, and government force, like fines are the best solution to motivate farmers into regenerative practices.But then, the other 60% (even the science) seems to be accurate, by saying that Government subsidies are bad and that farmers that own their own land would be good. They even have private business owners, like Gabe, Doniga, and Pashon, who share the correct path and have succeeded despite government tyranny.There is no question that soil quality is important and that regenerative farming is best. It's been practiced for thousands of years. As government grows, it tends to go by the wayside. American soil does need to be protected, through education and stewardship, not through political entities.The movie leans in the right direction, even with so many Leftist lies in it, and the overall message of regenerative farming is correct."}, {"id": 359, "text": "There is a great need in out society to raise awareness of the gretaest crisi that has ever faced the human race: Climate Change. The film Kiss the Ground directs the viewer to look down - at the ground. That is where one of our most promising solutions to reduction of atmospheric carbon exists, in the sol.The film is educational as it is inspiring. As a farmer who was born and raised in Brooklyn, NY, who began farming in middle age, I've always been keenly aware of the divide between the urban and rural mindsets, and have searched for ways to bridge that gap. Kiss the Ground achieves that consciousness-raising on two levels: It connects us to the concept of healthy food as a natural result of soil health, and then - the major goal of the film - it connects the health of the soil to the restoration of balance in our climate system. That is a brilliant achievement.Everyone - I mean everyone - should watch this film. Then, get to work!"}, {"id": 360, "text": "Buzz words, lovely music, all to emotionally convince you instead of using the real facts.Carbon isn't sequestered like it's evil. Plants use this to build themselves.Today, plant growers have to use greenhouses and physically drag in CO2 Generators, plug it into a power point and wait and measure to make sure it reaches 1000-1500PPM, because that's what plants have evolved for. The atmosphere is only 400PPM, and at 200PPM there's not enough for them to survive.Microorganisms, animals, people, carbon/coal fires all make co2 for plants.It's good to get off fossil fuels (and get onto something like nuclear), but plants seriously need carbon, animals, all breathing and farting nearby. - To the point where CO2 is 3x times what it is now and steady at that point. That's what plants want."}, {"id": 361, "text": "The first third of this documentary is great. It is informative and follows a logical progress from problem to idea to solutions and then implementation. We meet the people trying to present their ideas about soil health and regenerative farming. The potential for humanity is truly staggering... but then we lose the logical coherence and hidden behind the beautiful smiles of well meaning white people, we get an incoherent claim about grassing cattle saving the world.There's so much information missing: 1) How is a few cows moving around huge plains scalable? This could from a soil perspective work for a few rich people... but it simply cannot feed the global population. 2) To which extend is Allan Savory's claims supported by dara/results/science? In fact a quick search shows that this self proclaimed expert has a beautiful vocabulary but very little data and little to no support from scientists in the field. But he happily claims to save both Africa and the meat eaters from having to change their habits. This is simply wishful thinking. 3) So Brady and his beautiful family eat well. That is nice and it could be interesting to hear how a top athlete eats and manages his body... but we don't get any actual information here. 4) At one point some random person (who is just brought in for this quote) claims that if only we kill humanely, then we can eat all the meat we want. In the context of killing creatures who want to live, it is unclear what humanely means (the definition is tenderness, compassion, and sympathy for people and animals). Etc.At the end this program seems to be nothing more than a commercial for the meat industry, so they can put a sticker of a happy cow on the cheap meat from the sad industry that simply cannot be made humane nor a global solution to the current on-going destruction of the planet."}, {"id": 362, "text": "I am a teacher-turned-regenerative-farmer focused on writing and presenting curricula teaching children about the positive impacts regenerative agriculture has on reversing global warming, now operating a nonprofit offering these opportunities to children. I was hopeful that this film would grab the attention of the mainstream to help educate why soil health is essential. The movie does just that! It's presented in a way that children can understand the concepts too. Climate change needs our attention right now, and regenerative agriculture is one of many important ways we can address the problem. If you are interested in learning more, check out Paul Hawken's book, Drawdown: The Most Comprehensive Plan Ever Proposed to Reverse Global Warming, which outlines 99 other ways to collectively make a positive impact on climate change in addition to regeneration. Elaine Ingham's work on the soil-food-web helps us understand the science behind what Indigenous people have known for ages. Allan Savory's work on holistic land management teaches us the importance of paying attention to the whole and investigating how to help nature settle itself into an appropriate place on the brittleness scale. Ronnie Cummins advocacy work presented through his book Grassroots Rising: A Call to Action on Climate, Farming, Food, and a Green New Deal, is an excellent read for those wanting to know how to lobby for change. Richard Perkins' incredible book, Regenerative Agriculture, is a must-read for practical how-to's if you are interested in starting your regenerative farm practices. And, obviously, Josh Tickell's book, Kiss the Ground: How the Food You Eat Can Reverse Climate Change, Heal Your Body &amp; Ultimately Save Our World, is a MUST!"}, {"id": 363, "text": "Many of us feel overwhelmed by what might or might not happen with our climate and quality of life for ourselves and our descendants. It appears very true that humans have impacted earth in a very negative fashion.How? It's explained here.What can we do? It's explained here.Who's culpable? It's explained here.Bottom line, what 'fixes' can we enact as individuals? Explained in this amazing documentary is the impact that grazing animals have on the soil. We can continue to invest in our health and the health of the planet by eating meat from sources that partake in regenerative ranching practices.We can 'vote' with our dollars by supporting businesses and causes that help to sequester carbon and return it to the soil.We cam avoid vegetables that have been raised as mono-crops with 'tilling the soil' practices. We can grow our own gardens. We can plant trees! We can touch the earth (micro-organisms are our friends!). We can learn about regenerative farming, bio-diversity, real recycling and living lightly on our planet.The days of thinking that each of us can't possibly make a dent in the problem are over. This fantastic documentary gives us the 'whys' and the 'hows.' Watch it often and share with others. You'll be glad you did!"}, {"id": 364, "text": "Go Woody!It seems as though most environmental films fall starkly into one of two camps. Dreadful and morose and constructive and focused on solutions. This solidly falls into the latter. What a breath of fresh air.KTG reverses some long standing falsehoods particularly with reference to animal agriculture. It reveals its massive potential to reverse climate change rather then accelerate it, so long as animals are allowed to pasture as they have done since time immemorial. As is so often being said It's not the cow, it's the howGoing back to time tested, conservative methods of food production can feed the planet, heal our nutrient starved bodies and revitalize us economically. This is the hopeful message of Kiss the Ground."}, {"id": 365, "text": "Larger than a reduction in the use of fossil-fuels and toxic gas pollutants that enhance the dangers in our atmosphere, agriculture plays an even greater role in both feeding the population of our world and contributing to climate change.This movie reveals the sad history of the decline of healthy soils and the subsequent rising unsustainable clearing of the land of its native greenery in favor of crops that rely on chemical additives. However, the quality of the soil has declined so much that the nutritional value of those crops is also diminishing at a rapid rate. While chemical corporate giants out for profit alone, continue advocating for poor and unsustainable practices using their chemical fertilizers, insecticides, and herbicides, they play the role of a far greater villian in hastening apocolypic changes in climate. This movie clearly explains the cycle of how healthy soils, teaming with microbes can become the greatest engine to remove CO2 from the air above and stablize climate changes that threaten our planet, returning it to the soil that is used to feed the multitudes. What we risk by not making the necessary changes will surely disrupt populations with human famine and disease as they become refugees from the inarable landscape and flooded coastlines.This movie is a call to action, to rescue the fertility of the earth, to save our unseen species beneath the ground and the greenery above it, to stay the impact of the planet's climate changes.that will most certainly occur all along the food chain. Scientists say we have no more time to waste.In the end, our lives depend on healthy soil and on our agricultural practices. Our vitality, all along the food chain,also depends on maintenance practices that promote healthy soils, a sustainable resource, and less dependence on finite resources, so that we can preserve ourselves. This is a must watch film!"}, {"id": 366, "text": "The first half is a believable theory about how the Earth's top soil is in trouble: pesticides and mono-crops contribute to erosion and desertification, which leads to climate change and lots of social and economical problems. The documentary goes on to present some solutions, and then arrives at the point I was afraid of: how raising cattle can have a great effect on the soil and actually contribute to a solution to climate change. While this is true, the documentary starts using words like 'grass-fed', 'humane' etc. The problem with this is that it neglects to mention that there are very few grazers necessary to keep soil healthy and that it seems to condone eating beef. One might even end up believing that eating beef is good for the environment after seeing this movie, when in actual fact our Earth can not sustain our consumption of meat and dairy and this is one of the biggest contributors to the ecological crisis we are in. At the end of the documentary I was wondering what the true intention was of the filmmakers. Was this documentary meant for the general public, or was this aimed at farmers: a gentler message so they might see the light and change some of their ways? Who knows. I do know I didn't fully trust everything that was said in this documentary.."}, {"id": 367, "text": "This is the most inspiring, informative, and inspirational documentary I have ever seen; and I have seen many.It will speak directly to you: to your common sense, to your rational mind, to your emotions, to your spiritual being, to your heart. With science, arguments, videos, real-life case studies and success stories: all of them coming seamlessly together to tell you that this is our only way forward, if we are to heal this Earth, and us.And it will show you the small steps you can take each day to change-and to make a change. To ensure a nurturing, flourishing Earth for your children's grandchildren, for them to live, laugh, and love in it like it's heaven on Earth.Watch this documentary. It will remind you what it means to Kiss the Ground,and it will make you see the soil for what it is: holy, life-sustaining, the stuff of Life itself. Of you, and I, and everything and everyone we love."}, {"id": 368, "text": "This is the most comprehensive explanation yet, about the harsh and frightening fact that a great percentage of the planet is turning to desert due to the abuses of industrial agriculture, and centuries of ignorance about how to manage grazing so that ruminants fulfill their symbiotic, regenerative role, rather than cause degradation and erosion of the soil.This movie features some of the leading voices in the regenerative agriculture movement, including Zimbabwean Allan Savory, who only about a year ago, was considered too controversial a figure---and who finally is being given his due as a pivotal teacher and leader in soil restoration around the globe.It is deeply tragic that for too long, most of us have heard that the climate crisis is caused by too much CO2 in the atmosphere--completely ignoring the fact that if there is no photosynthesis on billions of acres on the planet--BECAUSE NOTHING IS GROWING ON THE DEGRADED SOILS, then logically CO2 will accumulate exponentially.I only pray that this movie goes viral. If so, then there is hope."}, {"id": 369, "text": "This film was 7 years in the making of an extremely emerging science, soil microbiology! The Soil Food Web's ability to create a Soil Carbon Sponge can grow more nutrient dense foods because the nutrient cycle is in tact when regenerative principals are practiced. This means Farmers have a role to play in ecosystem restoration, human health, and climate change reversal. The Soil Food Web's ability to sequester carbon is enormous because Co2 is going back in the soil where it was when we had balanced climate and it does so by way of the carbon cycle when regenerative principals are practiced. The quickest way this happens is the adaptive management of grazing animals like cows and sheep. Ranchers and meat eaters have an important role in the regeneration of ecosystem function and the reversal of climate chaos. The Soil regulates hydrology(the water cycle). Hydrology governs 95% of the heat dynamics on the planet. The heat dynamics are what we humans experience from climate change. Floods-too much water, drought-too little water. But floods and drought are not weather conditions they are soil infiltration issues. A soil carbon sponge created by the soil food web when humans practice regenerative principals lessens and can even alleviate flooding and drought. EVERY person who owns or lives with a 4'x4' or more piece of land has a role to play by not allowing their land to go bare, but to grow a tree, food, or plants that will cool the surface and sequester carbon. Wildfires spread by wind too are created or at least made worse by bare soil or man made surfaces. Windstorms are created when there is neither trees nor vegetation to attract the precipitation in the atmosphere into a rain drop. Water vapor is the largest green house gas, not CO2. Hydrology governs the heat dynamics responsible for hurricanes. If we cool the surface of the planet by growing green longer, growing more green and treating bare soil as a sin, we as a species have a chance. WE are part of the soil food web, we are part of the carbon cycle, we are part of the water cycle. Let us step into our roles as humans and be good humans. Our role is to make sure life continues. The 6 regenerative principals, CONTEXT, LIVING ROOTS, ANIMAL INTEGRATION, SOIL ARMOR, BIODIVERSITY, LEAST DISTURBANCE."}], "reviews_amount": 370}