{"name": "Go Karts", "titleId": "tt08116640", "reviews": [{"id": 0, "text": "It's a little formulaic and Pc even but it gets the job done and is a nice break from doom and gloom and constant super hero and fantasy movies. There's not many surprises in store but the story is told with good talent and I never got bored. I had difficulty settling on whether this movie was set in the present or in the past. I lived in Busselton WA for a while in the eighties and the cars and homes used in the movie would have been old back then even. Even the computer games shown seem from way back. But smartphones and the 'net seem to exist so I guess it's just a grungy version of the present we're being thrown into. I liked the two young leads a lot and I reckon we can expect to see more of them. It's like old school Disney family entertainment. And it unashamedly owes a lot to 'karate kid', not that the kids this was made for would even know what that was anymore?"}, {"id": 1, "text": "It's a cool movie, even if this story has been repeated in other movies... This movie Is well made, from the cinematic part of the races to how the actors acted..."}, {"id": 2, "text": "I really enjoyed GO! as did my two daughters 15 and 9. Easy viewing, great cinematography, strong acting from the cast includung the younger ones. View it for what it is - fun clean family movie (that is predictable) but has good messages throughout. Great that it was filmed in West Australia - showed off the beautiful South West"}, {"id": 3, "text": "An entertaining family movie full of Oz humour from a great cast which had the cinema in fits of laughter and giggles.Relationships between family and friends were very relatable with a few situations tugging at the heartstrings more than others.Lots of go-karting action with some neat retro Oz tunes to piece it altogether."}, {"id": 4, "text": "This movie is cute but basically Karate Kid with go karts and an Australian accent. Easy watch with kids, but definitely not worth any critical thinking"}, {"id": 5, "text": "Sweet fun movie for all ages. Interesting setting, nice WAustralian old school scenes. Light entertainment. Don't expect to be gripped or surprised"}, {"id": 6, "text": "Just watched this and I must say that I didn't like the outside spin outs all the time, so predictable but overall a very good film."}, {"id": 7, "text": "The family watched this movie and we had fun! I recommend this movie if you're like cars, driving and or you just want to watch a nice heart warming tale. Good clean fun for all. Acting, story, characters directing ...all very well done for this IFC sort of flick."}, {"id": 8, "text": "I've never written a review before. And the only reason I am watching this is because my step daughter is an extra in a few scenes. Turns out the movie is pretty good, I love Aussie movies with authentic Aussie accents and slang and the CARS! Love the HQ pano! Pretty good movie, better than 5.9."}, {"id": 9, "text": "Good light movie. A lot of fun moment, great acting from the actor. Predictable ending but nonetheless good ending with a good moral."}, {"id": 10, "text": "Go karts was a very weak film for me in almost every aspect of film,our lead was completly uninteresting and completly boring and without personality,his realtionship with mom was just to forced to me and to much on the nose,his rivality with his competitor was just so cliched and seen milion times that i become bored most of time when they were together on screen,sideline characters were also just miserable and waste of screentime,expecely that one guy with such annoying laugh that i wanted to punch him,go karts was a lame made film with weak storytelling and plot,and i found this movie to be a wasted time for me"}, {"id": 11, "text": "This film has heart and humor and is very entertaining. Feel free to ignore the negative reviews from the people who actually didn't watch it. Give this a chance."}, {"id": 12, "text": "I took my teenage daughter to see Go and we both really enjoyed it. Great family entertainment and good to see Busselton being featured. Great cast and storyline. Very disappointing that this movie didn't have much publicity and in our area was only being shown in early morning sessions. This is a great film for teenagers to see and not too many teenagers want to be going to the movies early in the morning."}, {"id": 13, "text": "I was pleasantly surprised by this. Was definitely hoping it wasn't a bust, or a waste of time. For me, it wasn't. I smiled at the end, and now I'm here moved enough to give a rating and review. :)There were pleasant, lighthearted, comedic moment, so that was amusing and fun. There were moments of human drama that made it real and moved me. I would watch it again in the future.All the actors were new to me, except the mom. Thumbs up on their performance. :)"}, {"id": 14, "text": "The dog in this film is such a cute boy, steals the show when he's on screen. Can see him going on to do more films"}, {"id": 15, "text": "Yes, the story line may have been done in different formats before and there may not be many surprises but it's a good wholesome family movie which my 7 &amp; 8 year old girls loved."}, {"id": 16, "text": "They took everything from karate kid, even the haircuts and the hair colour. You get the weird trainings, the rivalry between a blond kid (the bad guy) and the karttate kid. He gets defeated and comes back...etc classic formula Not a bad nor a good movie, if you don't know what to watch, that's something to watch"}, {"id": 17, "text": "There's nothing new with this coming of age movie, you seen it all before , It even references The Karate Kid but instead of martial arts you're treated to Kids in Karts. And it is a treat, it's a tried and tested formula and by no means a waste of time watching."}, {"id": 18, "text": "We have to be smart people, be wise people who are kind and brave enough to be honest and honest with others. Even if the big thing comes, don't escape it, and calmly strive for the most reasonable solution for yourself. You must not be a weak person. Those who fall unpleasantly must be eliminated by the society and be flexible. People should be the goals we pursue in life."}, {"id": 19, "text": "It is worth the watch, but the story has been told before. Little bit different spin, packaging, etc. The up and coming cub finds the burned out sage, who trains him up to face the seasoned bully. Throw in a couple of novel romantic situations, the PC side kick team mate, and there you go. As others observed, nice change of pace from the hero films, etc, but still a cookie cutter formula film."}, {"id": 20, "text": "Man, I can't see that boy on kart with his yellow helmet without thinking in Ayrton Senna and yes, I'm Brazilian !! 😀"}, {"id": 21, "text": "Cars without steering wheels bump an ice gate. 35 years later its still happening in the form of Clifford the big red dozy. An old man (involved in film) wants to draw a dog one day. Anyway, eventually the cars develop steering wheels, they levitate downward which causes compression. Clifford sings: love a donut you dead hand. At the beginning of the race someone stalls and kicks the dome with a copper plated hand held foot."}, {"id": 22, "text": "The movie has a good layout with very key aspects to the movies to show the progression of the driver and relationships with others however it was rushed at times. I feel like a lot of things were forced and although they had meaning behind it you didn't feel the connection with the character and the film because there wasn't a good build up of scenes with disappoints you and makes the movie very cliche. I believe they could of made it More original with some plot twist and play out more scenes to set the mood however in general the acting is spot on and a very easy family friendly film to watch"}, {"id": 23, "text": "Good family movie, interesting, and inspired by the karate kid, great throwback to the 80's except the iPhone, internet and streaming lol but yeah give it a watch with the family"}, {"id": 24, "text": "Good family fun movie and the kids loved it too. Good cast and script."}, {"id": 25, "text": "Nothing to do with racing. Not even for fun. I literally got annoyed!!! Speechless. Dont know what to write to express how bad this movie is. The guy went for fun and in 5 days he was champion. Really?????"}, {"id": 26, "text": "Owen Trevor tries his hardest to make this completely unoriginal story something new, but Go Karts hit every single trope possible, making this a real unpleasing film."}, {"id": 27, "text": "Go Karts (2020) is a teen mixed version of Ford v Ferrari (2019) and The Karate Kid (1984). The kids actors here have kind of a natural charm. Though the dialogue is bland and story is watery, surface-level and predictable, the racing action is actually very engaging. If you're looking for a warm heart movie to watch with your family/children, you could do worse than Go Karts.Rating: 6-/5+"}, {"id": 28, "text": "Her bangs are so crooked, I couldn't focus on anything else."}, {"id": 29, "text": "This film start with boy Jack moving to an old house with his mother, and he racing the go kart scene! As turnout, this film is about Jack need to defeat his girlfriend's brother Dean to win the National Go Kart Championship! Entire film full of boring overuse scene! Such as, overuse of the bullying scene, overuse of the cycling scene, overuse of the annoying flashback scene of Jack and his father, and overuse of the play dumb scene! Make the film unwatchable! The racing scene also not intense and bored! At the end, Jack overtake Dean at the last lap, and won the National Go Kart Championship! That's it! Another disappointed film!"}, {"id": 30, "text": "Don't waste your time. That's it, that's the review."}], "reviews_amount": 31}