{"name": "Emperor", "titleId": "tt08354752", "reviews": [{"id": 0, "text": "The one stars given this movie speak more of those reviewers than the quality of the film. I found it interesting and at times humorous. It's by no means one hundred percent historically accurate, but what film is? Ignore the negative reviews and give it a shot."}, {"id": 1, "text": "I went into this movie knowing nothing about it so of course I looked up the characters afterward. It's not at all historically accurate. Hollywood thinks we are morons &amp; can't appreciate a true story to be inspiring or entertaining as is, or they're idiots &amp; cant make it to be so without elaborating &amp; fictionalizing. Disrespects the actual characters too imo."}, {"id": 2, "text": "This is a very well done movie with superb acting. I loved the story which did not venture too far from the factual history of the event.I found the movie authentic in representing this amazing piece oh History."}, {"id": 3, "text": "Decent biopic of Shields Green with the usual Hollywood melodrama and happy ending. Green did get his freedom but was hung along with another slave rebel,"}, {"id": 4, "text": "Great historical untold story, reminiscent of 12 Years a Slave, I wish it could have been longer to focus more historical attributes and heroes ."}, {"id": 5, "text": "GREAT ENSEMBLE CAST ... AND ENDEAVOURS TO STAY AS CLOSE TO THE TRUTH AS POSSIBLE ... OH AND ROCKY DENIS GETS WHAT HE DESERVES THE £$%&amp;*"}, {"id": 6, "text": "While not historically accurate as most movies are not. I found it to be entertaining and a decent story."}, {"id": 7, "text": "An outstanding ensemble cast of up and coming actors relate a good story with some skill and a noticeable dedication to the craft. The story could have meandered into the standard videoed-reenactment stuff of YouTube, but it manages to rise above the commonplace in a number of ways. Bruce Dern is a surprise - 'he's still alive for one thing - playing the part of a hokey , antebellum do-gooder and pulls it off professionally. The hunter-killer bounty hunter is a solid nemesis before 'rising to the stars'. Good solid work! There's credible visitation of the 'Gabby Hayes School of Cowboy Actin'' A comely mulatto wench and a sold cast of everything elses. Great costuming. Only the odd or end to surprise. I'm watching this again and tracking down the possible movie tune of the pandemic year. The Other Side - thought it was Dolly P but this gal might even be better. That alone is worth an audition or three."}, {"id": 8, "text": "Viewers must know up front that Shields Green was an escaped slave. That is the only historically accurate fact in the first half of the movie. The first half of the movie is the writer's imagination. Please don't take it as history. Green's association with F. Douglas is true, as is his association with J. Brown and the Harper's Ferry raid. And the end of the movie doesn't accurately depict Green's final fate. It's too bad that with so much rich Black history that Hollywood chooses to make stuff up. It's a disservice to history and to a people who deserve better. Much better. This is an entertaining movie, with adequate acting albeit mediocre writing. It would have been better if the critical scenes had been shot on location. Maybe the director was looking for Harper's Ferry in Virginia. Watch it, but don't take it seriously. Shields Green deserves better."}, {"id": 9, "text": "Bad script, bad directing and dreadful acting.. Cant think of one good thing to write about it"}, {"id": 10, "text": "A must see! A truly beautiful film about the power of the human spirit!"}, {"id": 11, "text": "Great story and brilliantly played. If you don't like it then you have rocks in your head. Don't trust the bad reviews! Loved it"}, {"id": 12, "text": "Forget about critics. They tend to think with their eyes. I loved it from the beginning to the end. You will too"}, {"id": 13, "text": "Not even close to accurate. Horrible recreation of Harper's Ferry. And the hero rides off into the sunset with his son long after Harpers Ferry was so moving, except he was hung several days after being captured with John Brown. So...just a minor historical liberty of having him ride off into the sunset instead of being hung with John Brown. What's next, a movie where Lincoln gets a third term?"}, {"id": 14, "text": "At best its below average war flick. add to that the factually incorrect disinformation being thrown in viewers faces. add to that the fact that this fictional representation also fails to mention the blackregiments roles in the extermination of hundreds of thousands of indians immediately following the war. but I guess then it wouldnt paint such a good picture and would not suitably fit into the 2020 blm narrative being oushed here now would it. yawn. after wasting an hour of my time on htis, think Ill go watch 'the first 48 for a dose of reality and to purge this fakeness from my being. NEXT"}, {"id": 15, "text": "Bad script, bad directing and dreadful acting.. Cant think of one good thing to write about on this load of rubbish"}, {"id": 16, "text": "It could be a very good movie if the script wont be so nothing. Rush from screen to screen without letting the characters to be deeper. Waste of energy."}, {"id": 17, "text": "Symbolism of perseverance, respect, and leadership. Qualities every individual should maintain. This is an American Story! If you are an proud American add this to your collection."}, {"id": 18, "text": "This is based on a true story of Shields Emperor Green who hails from royalty like every Irishman. You don't need evidence if your mother tells you. Shields was an escaped slave who was wanted for murder. He eventually teams up with John Brown. Brown being white got a song created about him and Green being black didn't get a tune, just a poor screenplay. Harper's Ferry was scarcely enacted and it was the center point of the film.Mark Amin did a quick shoddy job in order to get this feature out quickly. Interesting and timely, but could have been so much better."}, {"id": 19, "text": "This movie stinks. While I appreciate the historical value, the importance was lost by a poorly produced, executed, directed film with poor performances. A well produced movie tries, at a minimum, to film in locations that look similar to the locations where the real story took place. That helps make the story more believable. I enjoy historically based films that are shot in locations that try at a minimum to appear to be historically correct. John Brown was captured at Harpers Ferry, then Virginia, at the arsenal not a fort."}, {"id": 20, "text": "Don't let the haters get you down. I am sure they never give good ratings. This well created movie told a beautiful story. Worth the watch."}, {"id": 21, "text": "Great directing, great story, great suspense from beginning to end. We loved it!"}, {"id": 22, "text": "Feels like a Saturday afternoon action adventure revenge tv show instead of a historical drama. The film has pretty good cinematography, location, settings, wardrobe, and a good cast. But the writing is poor. It never digs deep into the main character and the then political situation of the time. All it does it name drops and ads cameos of historical figures. Unfortunately the film is mostly fluff and little substance. It really had a lot of missed potential."}, {"id": 23, "text": "2 movies came to mind: Harriet &amp; Django. 1 TV show came to mind as well Underground. I'm writing as I'm watching this and it can end with 1 of 3 endings."}, {"id": 24, "text": "See, this is why I love film and writers and directors not afraid to talk about the little guy or untold stories. I didn't even know about Shields Green until I saw this movie. I hear people saying it's not historically accurate, okay cool, well let me go google and hit the library so I can get the correct information about this person. Either way, he sounded brave and any slave during that time that got away from the devils that actually did this to people gets a kudos from me. Only reason I didn't give this movie a 10 is because of the poor editing and like one reviewer said, I wish it was longer. I wish MORE was going on and it wasn't quickly carried out. Honestly as a fiction writer myself I would have added all the little quirks and maybe even MORE stuff that didn't happen, just cus. It's a movie people give the film a break from it being REAL. LOL! Love the actors too!"}, {"id": 25, "text": "They took quite a lot of liberties with the beginning and end of the story, making up details of Shields Greens life and completely changing the outcome of his fight at the armory. But besides all the historical inaccuracies, if you just wanted to watch it for pure entertainment, the script was a bit weak, which made it hard for the actors to shine. Even though their were some big named actors, their performances were average due to the poor script, direction, and sets. It was enjoyable enough but could have been so much better, IMHO! 6.5"}, {"id": 26, "text": "Great premise, poor history. Seems like another attempt at Roots with invented history, famous characters who may have never been involved. The emperor was hanged 2 weeks after Brown. Oops forgot that it of truth. The reality is good enough, no need to embellish. Remember few actually read history and take movies as historical truths. This dream history brings further discredit on true activities muddying the real history with falsehoods. Ok film. Accurate props.Brown fortified The firehouse, not the armory. Let true history speak, and you will get the same effect with the truth!"}, {"id": 27, "text": "Another version of history a bit romanticized but entertaining. Dato Okeniyi has the lead and performs well."}, {"id": 28, "text": "Emperor offers solid story, dramatic consequences, beautifully shot and offers strong performance by Okeniyi."}, {"id": 29, "text": "If you want to watch a good movie based on a true story, well you found it. The acting is good, and the story is great!"}, {"id": 30, "text": "Anyone giving negative reviews for this ,must have some issues IMO . Really enjoyable movie with a real life story"}, {"id": 31, "text": "I love Western movies. Watch whatever I can find. This is Absolutely watchable. May be too much political for US watchers, due to the north/south slavery angle? Anyhow this is well worth spending 1,5 hours on a Friday evening."}, {"id": 32, "text": "Black beauty with an elaborately groomed hairstyle shows the ugly white rat-faces where the iron crosses grow."}, {"id": 33, "text": "Brilliant source material expertly written for to the big screen, fascinating person in the the history of American civil war. Dayo Okeniyi and Kate Graham and are perfectly cast and Bruce Dern nearly steals the movie from them. Very well-crafted film with impressive filmography."}, {"id": 34, "text": "Well, to begin, I cannot remember the last time I could not get up at the end of a movie. The central theme is slavery, and set with high levels of realism in pre-Civil War America. Amazing cast, beautifully shot, overall, highly recommended."}, {"id": 35, "text": "This film is clever, quick-paced, and really well-acted. Certainly worth a watch. You will know within the first 30 minutes if it is not for you. For me, it is a breath of fresh air."}, {"id": 36, "text": "The most things I loved about the movie is the real things in it, what I mean in Real Things is the practical effects and the outdoor locutions all add to the movie. But the weakest thing you can say is the characters, but it's clear the motivations for every character so I was satisfied. Some MAGA Deplorables are heating on the movie and call it The Worst without giving reasons! Just bunch of haters."}, {"id": 37, "text": "I've seen my share of Civil War movies, slave-trading, indentured service movies and all of them are consistent with the same themes. African tribes that won wars against other African tribes sold them into slavery, kept the women and children, and that theme repeated.As slavery grew across Africa, 100's of years ago, it found it's way to Europe. After several decades of slavery growing in Europe it founds it's way to what would become North America, literally the last place slavery got it's foothold, and the place African Americans inaccurately place all of the blame.In fact, what would become the last place slavery had a foothold, would become the place African Americans place all the blame for centuries of wrongdoing. But, that's not the story directors seem to want to tell.Slavery was alive and well in 100's of countries many centuries before the US would ever be named or even discovered. Nobody but the US seems to be held responsible for it though, which is totally unwarranted. Convenient though considering the US is the richest nation on the planet though.Perhaps my white privilege has me not thinking clearly, but I think it's time for all communities to stand up and be proud of who they are and stop blaming current generations for what their ancestors did. If they did, this would be a much better place to live for all of us.I enjoyed the story, the acting, and the actors selected for this movie though and suggest it would be an entertaining 99 minutes of their time."}], "reviews_amount": 38}