{"name": "Words on Bathroom Walls", "titleId": "tt08045906", "reviews": [{"id": 0, "text": "This is a drama about a teenager diagnosed with schizophrenia and his efforts to hide it from a potential girlfriend. No, it is not as maudlin as that sounds, it is very well acted by Charlie Plummer with a good supporting cast including Andy Garcia, Taylor Russell, and Beth Grant. It is fairly realistic portrayal of mental illness and how difficult of a time care givers have dealing with the sufferer. They also show the character being given different drugs that either fail or have terrible side effects. The problem with mental illness is that is so difficult to get measurable results - that is, if your BP is 145/90 and the doctor gives you a pill and is now 120/80 the pill is working. It is not so clear with treating mental illness. And there is a quote (I'm paraphrasing) that really hit home for me: if I had cancer, people would run to help me but if I have mental illness they would run away. I know from personal experience that this line is very true as a close personal friend suffering from mental illness said something eerily similar. Of course there are Hollywood touches and clichés but I recommend that you see it."}, {"id": 1, "text": "I'm not usually a big fan of teen love stories like I thought this was going to be. This movie is SOOOOO much more than that. It's informative, its about family, it's about accepting who you are, its about love its FABULOUS and it was the perfect movie to see on my first trip back to the theaters in 6 months! The acting was amazing, I love how the actors looked like real people and not some social media influencers. I cried I laughed THIS MOVIE WAS JUST WHAT I NEEDED! AND YOU NEED IT TOO JUST GO SEE IT"}, {"id": 2, "text": "Without relying on an A-list cast or a soundtrack of radio hits, this film left me speechless. After listening to one song I decided to drive the rest of the way home from the theatre with no music. I was left in awe of the way this film made me feel so hopeful. Never in my life as an avid movie-goer have I loved or rooted for a character as much as I did watching this. A definite must-see, this is a film I will be sharing, talking about, and returning to for years to come. I always cry in movies, but this was a new level of crying, in the best way. Thank you to all those involved for the powerful acting performances and gripping plot points that made this movie so important to me."}, {"id": 3, "text": "My daughter and I went on our first trip back to the movie theater yesterday for this movie. We had seen the trailer online and were waiting for the chance to see it on the big screen. We were not disappointed. I loved the character of Adam, who is trying his hardest to keep his sanity. I can't speak to the portrayal of schizophrenia and whether or not it's accurate, but it sure was sobering. The characters felt real and sympathetic, even though there were some cliches that I saw coming from a mile away. Yes, it ties everything up in a nice neat little bow at the end, but that's Hollywood. There was a ton of wisdom in this movie about accepting yourself, flaws and all, as well as accepting other people in the same way. I have to say that I think Andy Garcia was my favorite, although Charlie Plummer is a very close second. Go see it. You won't be sorry."}, {"id": 4, "text": "There is nothing like this movie. From the opening scene, this movie will have you hooked onto every second of it. It is such a beautiful story about young love and mental illness -- This movie really captures mental illness in a light I've never seen before and in an educational manner. I would watch this movie again and again, it crushed my heart but yet made my heart feel so full. I was rooting for all of the characters in this film. So beautifully portrayed, there's not enough good words to say about the film. It'll leave an impact on you. GO WATCH IT!!"}, {"id": 5, "text": "Remember this line, I may have this illness, but this disease does not have me. No matter what you may have it does not own you as a person. Please read the book first and then see this movie. (Another one is Sybil starring Sally Field.) Enjoyed this movie."}, {"id": 6, "text": "These lines Chasing the idea of being normal surmises all the shame, pain, embarassment, indifference a mentally ill person faces. this is what a mentally ill person does...he tries to hide, to fit in. He is embarrassed to share what he experiences in his daily life, with the world. A big shout out to the director and all the actors of this movie, you people are going in a right direction."}, {"id": 7, "text": "The trailer convinced me to watch it but oh my gosh the way they portrayed the illness and the acting of this kid!! Ughh I was bawling my eyes out. I'd seen the mom and the girl from Lost in Space they are great. I didnt know itd get so deep..really opens your eyes to the struggle of people who suffer with these things. But great movie!! Loved it"}, {"id": 8, "text": "And therefore every incident has its own story, but if you want to subscribe to an scizhophrenia account or you might find a kegg of levodopa hidden under a staircase you might experience these main symptoms.its a bit confusing in the start but when in the game its a film worth seeing. some overambitioned visual effects and magnetar sped up cgi here and there,overall good tech impression.acting are plain and used with the brain, so i think its well worth a view. 8 from mthe grumpy old man"}, {"id": 9, "text": "I did not want to see this movie but I went because my wife picked it out. I was expecting it to be some kind of chick-flick man was I wrong. It had a great flow and the story line was easy to follow. If we had someone wanting to go back to the theater and watch it. I would definitely go. I will watch it again."}, {"id": 10, "text": "This is a really cool and nice movie. Sure, it has its Hollywood moments, but it is honest and humane. Things we need right now. These days, we are becoming corroded by current events and, in some cases, movies. Words on Bathroom Walls will help that. Treat yourself, go see it."}, {"id": 11, "text": "This is a really great movie. All about acceptance and making the best of things and relationships .This is one of the best movies on 2020, i never expected it to be so good"}, {"id": 12, "text": "A clichè stand by your man teen angst film about a kid with schizophrenia."}, {"id": 13, "text": "Well written film, with great acting by the main actor. Helps to understand the world through a different person. Well done"}, {"id": 14, "text": "I myself have never suffered from schizophrenia, but I did struggle with depression to the point that a voice in my head kept telling me that the world would be better off without me. This movie manages to represent what that is like, it shows the inner darkness and the desperation, it even manages to portray the ones needing help turning on their helpers and their loved ones to defend them from himself. Really just a great and beautiful movie all around. 10/10, would recommend."}, {"id": 15, "text": "Uhhhh that wasn't what I expected at all. This movie is actually kinda nuts, i was not ready for that... very unpredictable, rather entertaining, good messages riddled in there, great believable script. I feel inclined to give it an 8... it's pretty good... not sure id watch again though, it's not very rewatchable. due to the heavy nature of it. Not the greatest of performances either."}, {"id": 16, "text": "I have never watched a move about the struggles of having Schizophrenia. Truly, I knew very little about it. I thought this wonderful and so eye opening to the disease but also so heart warming and hopeful to see how love conquers the negative effects of it. Also this was definitely not the purpose of the movie since it is not a Christian movie, but it shows that when you do as the word of God says, things have to change. They cannot stay they same. I recommend this to everyone. Truly one of the only good movies out right now. Must see."}, {"id": 17, "text": "Entertaining/moving story of a high schooler and his divorced mom trying to cope with a most difficult mental illness. The film plays like an earnest teen network special from the 70s/80s. Interesting they continue to push inter-racial relationships, especially since it's not important to the story, weird."}, {"id": 18, "text": "Personally I Liked the it and thought the movie was really good! It gives some insight to how it must be looking through the eyes of someone with schizophrenia. I know a couple people who have been diagnosed with it and it's nice to see a movie that shows it from that perspective."}, {"id": 19, "text": "Act 1 - 6.7Act 2 - 7.2Act 3 - 8.1 This is an accessible film to most demographics to learn a bit about mental illnessOpens up a dialogue about how mental illness is treated different than other sicknesses like cancerMost important thing is to be open and honest and let people in to discuss mental illness so the general public can understand and help make a changeGood performances by allRussell and Plummer have good chemistry and you believe their complex relationshipLike the use of Adam talking to his therapist that is directed right at the audience to give us his thoughts and emotionsGood climax to the film when Adam realizes that opening himself up to others is the best way to cope and manage his illnessAdam learns to accept himself and the challenges that come with his illness but decides to not let it define himGood supporting cast that all seem to have their moments to shine from Garcia as the priest, Parker as Beth and Goggins as Paul who has the biggest heartfelt moment of the film, emotional climaxFilm hits emotionally but can fall into generic teen movie tropes at times that lessen the experience and well told storyGets a bit generic at times and wish it got a little darker in Adams moments of despair to really hit home how hard his illness isOverall a good film that has an important subject matter perfect for the timesAdam has a mental illness and uses cooking to cope and has dreams of being a chefKeeps his mental illness a secret but things get more out of hand as the voices manifest themselves as peopleAdam has schizophrenia, has hallucinations and morePaul takes his knives and wants to send him away but mom doesn'tMeet the people in Adams head, all different aspects of AdamMom fighting for AdamCatholic school accepts him as long as he maintains good grades and keeps trying to get treatmentMeets Maya who is selling schoolwork to her classmateBad voices and thoughts try to manifest themselves and the others with names try to protect himMeets Maya again and she's going to be the valedictorian and sells work on the sideAdam really likes MayaThe bad voice says all the bad thoughts that Adam feels and thinks about himself and amplifies itThe voices with names are there for his own self protection and a way to copeMaya is the perfect student and meets Adams family and is his new tutorTest trial with new people does seem to be helping him and suppressing the voicesMom is happy to see some good results and her son happyAdam upset that mom is talking to his therapist behind his back so decides to talk in confessional at the school to the priest, seems like a nice guySomebody new he can express his emotions to freelyAdam talks to the cameras as the psychiatristAdam and Maya go out and get into a fight with kid from old school, lies to Maya about what really happened at old schoolMaya caught selling work and gets into troubleAdam not used to the quiet without the voicesAdam finds out Maya isn't well off and lied about where she lived because she is embarrassed, that's why she sells schoolworkMaya does a lot for her family and works after school to support them, father is on medical leave and have past due billsMaya embarrassed and doesn't want anyone to feel sorry for her, feels the whole weight of supporting her family on her shouldersSeems like some side effects are starting to hit Adam pretty hardMom is pregnantSide effects have changed his taste buds for the worse and can't cook well nowStops taking the pills and hides this, voices and hallucinations come backBad voices come back tooGood monologue about mental illness and how they are treated different than people with other illnessesWatch never been kissed together in the park with others, say they are going to prom together and finally kissStill hiding his true self from her, still can't accept his whole selfFight with mom after she finds out he stopped taking the pills, everything blows upAdam is getting suspended temporarily as school knows he stopped taking the pills, fear potential problems he could causeAdam won the essay contestAdams world is crumbling around him and lashes out at everyoneBad voice tells him to take all the pills and goes to room even though he's suspended and meets Maya thereAdam is kicked out of prom and shoves the top nun to the ground then runs and falls of the catwalk to the groundEnds up in the hospital mom told Maya he has schizophreniaTied to the bed in restraints and Maya comes in and sees him at his worstAdam attacks Maya verbally to make her leave, can't be vulnerableAdam is admitted to a psych ward to try and get betterThe priest goes to visit Adam even though he got expelled, speaks some helpful wordsAdam gets to read Paul's letter and it's beautiful, knows they are both fighting for him all the time, this is what he needed to feel like he can fight this illnessThey leave the hospital and go to graduation where he speaks before his class, fights through the bad voices to give his speechThe more he opens up the more the voices go awayMaya tells Adam she loves him and they kissGot his diploma from the school and goes to culinary schoolHappy every after ."}, {"id": 20, "text": "Curious title, it refers to both real words written on school bathroom walls, and even more the imaginary words he sees when he had bouts with his mental illness.Based on the cast I figured this would be another mainly generic teenage rom-com. But it is just the opposite. While Adam (Charlie Plummer) starts a relationship with the bright girl in class after he asks her to tutor him, the story is overwhelmingly about Adam, and his family, and ultimately his school coming to grips with his schizophrenia.Plummer is required to really stretch his acting chops and he does it well. The middle third of the movie is hard to watch at times but fortunately the final third starts to bring some healing.Good movie, my wife and I watched it at home on DVD from our public library."}, {"id": 21, "text": "It made me see the world with new eyes and get in touch with my own feelings"}, {"id": 22, "text": "What a brilliant movie on a often misunderstood illness. A really heartfelt drama/romance that keeps a lot of traditions but pushes all the right messages. Charlie Plummer who plays the lead role of Adam is fantastic &amp; portrays Schizophrenia so well. I was so impressed by Taylor Russell who plays Maya (who I thought looked really familiar but she's not off anything I've seen.. I thought she looked similar to Jenna Ortega at times so maybe that was it) puts in a fantastic performance, a tough front but coming from a struggling home, as the movie goes on you see a more vulnerable side. She delivered one of my favourite moments right near the end when she's talking with Adam &amp; says the only thing that hurt was that he didn't give her the chance to choose. So simple yet so beautifully done, it really pulled at the heart strings. If this sounds like your type of film, I highly recommend it. So well done, one of the best of 2020."}, {"id": 23, "text": "This was one of the most beautiful movies I have ever seen - not just cinematically but the plot, the chemistry, the topics - it was incredibly well done. It's a 10 from me."}, {"id": 24, "text": "This was one of the BEST movies that I've seen in a long time! No Hollywood blockbuster special effects, car chases, or super-hero battles (for a change--thank God!), but a sweet, touching story with lots of thought-provoking issues &amp; situations. This is a great date movie because of its romance &amp; comedy, as well as the fact that it should spark discussion of the subject matter afterwards (especially schizophrenia and how people can or can't learn to live with that disorder). Last, but not least, as a foodie and a former sous-chef, I really enjoyed the cooking &amp; gastronomy aspects of this film."}, {"id": 25, "text": "Has all the cliches of the genre, but the chemistry of leading actors works well and the movie passes the correct messages."}, {"id": 26, "text": "I found this film to tug at all the right heart strings, from the emotional, to the romance. It is both enlightening by demonstrating Of the day to day issues faced by people with mental health issues, however shines hopes to people also with them. That through perseverance one can get where they want to go. I absolutely loved this film."}, {"id": 27, "text": "I'm also struggling with the same illness for years and I cried many times while watching it cuz I can relate so much in the film."}, {"id": 28, "text": "Charlie plummer's performance was really good I believed he was going through schizophrenia.It was a cute coming of age story and romance, with a good message"}, {"id": 29, "text": "Greetings again from the darkness. Very little outside 'the norm' is required for teenagers to ostracize one of their own. Sometimes it's a haircut or a brand of shoes, or even some other minor detail that sets them apart. But when it's a mental illness, the tribe can be merciless. Director Thor Freudenthal (DIARY OF A WIMPY KID, 2010) takes on Julia Walton's 2017 novel, with a screenplay from Nick Naveda. The film features two rising young stars and addresses some of the challenges brought on by the uncertainties associated with a mental illness.Charlie Plummer (so terrific in LEAN ON PETE, 2018) stars as Adam, a high school senior who has dealt with the challenges of undiagnosed mental health issues since he was quite young. His father abandoned the family years ago, and Adam's devoted mother (Molly Parker, House of Cards) is not only patient and loving, but also committed to researching any possible treatment that would lead Adam to a better life. On the other hand, Adam and his mother's new live-in lover Paul (Walton Goggins) don't exactly see eye-to-eye on things, leading to more anxiety for Adam.In an interesting and unique approach, director Freudenthal allows us to not only hear the voices Adam hears, but also see the hallucinations and visions he sees - three of whom are Rebecca (AnnaSophia Robb, THE WAY WAY BACK), a sweet, hippie-ish optimist; The Bodyguard (Lobo Sebastian), a cigar-chomping, bat swinging he-man; and Joaquin (Devon Bostick), an inappropriately horny 'best friend from a 90's move. On top of that, there is a black mist that periodically manifests, enveloping Adam and bringing on crippling fear and isolation. After a years-long stream of drug therapy, Adam is pronounced treatment resistant and diagnosed as schizophrenic. Adam's only mind-calming escape is when he's cooking. He knows his way around the kitchen and his goal is to attend Culinary School after graduation.One day, Adam has a psychotic break during Chemistry class. He gets expelled, which jeopardizes his Culinary School dream. His mother gets him admitted to a Catholic School run by Sister Catherine (Beth Grant) at the same time he is accepted into an experimental drug trial. He's allowed to stay in school as long as he takes his meds and maintains his grades. It's here where he meets the dynamic Maya (Taylor Russell (WAVES, 2019). Maya is smart and ambitious and proud, and the two quickly form a bond - an interesting bond between two smart high school kids carrying their own burdens and holding their own secrets.Sister Catherine is balancing the specific needs of Adam with her responsibility to the school, and then there is also prom and graduation to deal with. With the new drug, the voices and visions disappear, but Adam has some issues with the side effects. A desperate plea for help from Father Patrick (Andy Garcia), the school priest, provides a boost as Adam tells him, It's nice to be listened to and not just observed. That line provides significant insight into what it's like to have this affliction, and that's really where the movie excels ... putting us in the shoes of a schizophrenic and allowing us to experience the good and bad moments. What can Adam trust? His eyes? His ears? His mind?Adam and Maya are both trying to figure out who they are, at the same time learning what it really means to love someone. Adam refers to his illness as his burgeoning insanity, and in fact, schizophrenia does have a history of accelerating over time once it strikes a young person. The movie succeeds in taking away some of the mystique of mental illness, by making it approachable and something we want to better understand. There is a visual reference to Van Gogh's Starry Night that might be a bit too nail on the head, but Freudenthal's movie is profound and features two very talented young actors. The humanity beneath the surface of those society would rather pretend don't exist is effectively compared to those stricken with cancer ... those we would do anything for. I watched this film back-to-back with another teen-drama-romance new release entitled CHEMICAL HEARTS, and it's extremely rare to find two such thought-provoking films centered on a pair of high school students ... but quite a treat (although I believe all 4 actors are long past high school age)."}, {"id": 30, "text": "Inciteful, touching, and at times surprisingly stunning- Words on Bathroom Walls may follow familiar tropes from other coming of age stories, but there is no doubt that what lies here in this film is incredibly and uniquely original. Before I address anything else about this film, I would like to call to attention Charlie Plummer performance. His depth of emotion in his character, and his absolute brilliance playing him I think may go unrecognized, and I could not write this review without saying how truly wrong it is if that were to be the case. The other actors in the film do a very well job too, notably Taylor Russell, Walton Goggins, and Andy Garcia. There is never a dull moment in this film, you will laugh, cry, and be on the edge of your seat throughout. The film does such a good job of putting you in the headspace of this character, that you can't help but feel, as the film goes on, that you may have done the same, were you in that same scenario. It's a breathtaking work, and it's not the best coming of age story I have seen. It takes familiar plot developments as does Hughes films back in the 80's as well as some similar instances from more modern day flicks like Love, Simon and The Fault in Our Stars (both based on books like this one). However noticeable these instances may be, it doesn't take away from what you get from this film, and it certainly doesn't take away from what you feel without. You will leave this film with a smile on your face. It's a clever and unique view into the life of so many stories that haven't been quite recognized yet, or at the very least, not recognized as much as they should have been. It's a sweet and touching tale of growing up and fearing rejection for who you are, and how to get through it when all the odds are against you and more. I couldn't recommend this film enough. One of the best of the year. My Rating: 9.75/10"}, {"id": 31, "text": "Words On Bathroom Walls portrays a wonderful example of schizophrenia in teenagers. It also adds a comedic essence to the illness, but it does not make fun of the disease. This movie is an eye-opener and a powerful phenomenon.The story follows teenager Adam (Charlie Plummer) who is diagnosed with schizophrenia. He transfers to a Catholic school where he meets Maya (Taylor Russell). The two strike up a friendship immediately, and Maya tutors Adam. However, Adam is struggling with keeping the symptoms of his illness to a minimum.Schizophrenia is a mental disorder in which sometimes the person hears voices and has hallucinations. In Words On The Bathroom Walls, we visually see a black cloud that torments Adam's mind. We meet three of the voices in his head which provide comedic relief with their big personalities: Rebecca (AnnaSophia Robb), Joaquin (Devon Bostick), and the Bodyguard (Lobo Sebastian). These comedic voices follow Adam and provide guidance along the way. We also meet Adam's mom and stepfather (Molly Parker and Walton Goggins) who help their son as best as they can.Words On Bathroom Walls, in its portrayal of Adam, definitely opens up a conversation that needs to be had amongst society: mental illnesses in teenagers. Adam feels as if there is no escape from his disease and as if he has to choose his sanity over his future. He feels pressured to be a perfect son, student and friend. He converses with his therapist throughout the movie and at one point he compares cancer and schizophrenic patients. He says when you're schizophrenic people can't wait to make you someone else's problem. Adam feels as though his disease is a burden to himself and to his family.The standout moral of the film is to not let your disease define you. Adam works hard to become a chef and he becomes frightened that he might not be able to graduate or work as a cook. However, he keeps working and overpowers his schizophrenia. He says that once he was a bystander in his own life. In the end we see how he does not have any limits and how he now controls his life. Adam does not want to end up on the bathroom walls, so we see him take the reins on his future. The depiction of this mental disorder might concern some viewers. A mature audience is advised.I give this film 5 out of 5 stars and recommend it for ages 13 to 18. Reviewed by Heather S., KIDS FIRST"}, {"id": 32, "text": "This movie was really appreciated because it normalizes a disease that affects so many and is treatable for many. My son suffered from this disease. I cannot tell you how frustrating it was to get a 21 year plus old person to get treatment. You can not force anyone of that age. He is now free of dilusions and watched with me. He said was not really what he saw (sees) but was sort of his experiences.My 9 year old grandson really enjoyed the movie. As all young people do these days, he immediately googled the disease after the movie finished. He does not know about his uncle as with medication his uncle is one of the smartest and most normal in the family.The story itself became a love story. Made the heart warm. Very well acted. And even a sort of horror story with the visual effects. Something for everyone.We watch many films. My pick so far for Best Movie of 2020.This disease should be treated free for all those less fortunate who end up homeless as a result, or worse.. in prison. The world would be a better place. If that was the intent of the movie (understanding) then the goal was achieved. Plus true enjoyment of a first rate film with good acting on a low budget."}, {"id": 33, "text": "I ended up seeing this film over the weekend, not knowing what to expect, as it is one of the few films that I have gone to see without actually seeing the trailer for it prior, and I was very pleasantly surprised. Words on Bathroom Walls is about a boy, Adam, who gets kicked out of his school for wild behavior, and is diagnosed with schizophrenia shortly after that. He transfers to a Cathlolic school and meets a girl, Maya, who helps him out with school work, and also becomes quite close with him. Throughout the film, Adam tries to maintain a relationship with Maya, while also trying to keep his schizophrenia a secret from her, and has to overcome many other challenges along the way. This film, based on the book that goes by the same name, does a fantastic job at accurately depicting schizophrenia, and all of the complications that come along with it. The film puts the viewers inside of Adam's head for much of the movie, and shows them everything that he hears and sees because of the disease, and really makes the audience think that it is all really there. The actor who plays Adam, Charlie Plummer, also does a fantastic job. The film itself does commit to many of the typical tropes that you would see in a coming of age movie, but it does a much better job than most films do at depicting mental illness. Adams' mom, and step-father, who are played by Molly Parker, and Walton Goggins also do a really great job, delivering some very emotional performances. The thing that surprised me most in this film was the special effects, especially given the film's small budget. A lot of the schizophrenic hallucinations are shown through special effects, and they effectively add a lot of tension and horror elements to the film, which is not something you see very often in a teenage coming of age film. One other thing worth mentioning is the director, Thor Freudenthal, who hadn't really directed any feature films since the early 2010s. Some of his earlier films included, Hotel For Dogs, Percy Jackson: Sea of Monsters, and Diary of a Wimpy Kid, so I would have to say that this is definitely a significant improvement over his previous works. Overall, for a typical coming of age film, this movie does a great job at what it is trying to do. Not only is it a good coming of age film, but it also does an amazing job at depicting mental illness, especially one that is as complex as schizophrenia. The entire cast does a great job in their roles, and the story is very compelling. The only real issues that I had with the film, which are very minor problems, would be that there was some poorly timed humor on a few occasions. Other than that though, a very solid film by Freudenthal."}, {"id": 34, "text": "Films like this really need to be seen with the understanding that it's not a Scorsese film or cinematic masterpiece. It's a young adult drama aimed at young adult audiences or those who appreciate the genre. As a film itself (ignoring the book) some of the acting can be very questionable from the side characters. However Charlie Plummer (probably best known for his other YA series Looking for Alaska) does a very very good job here! He plays that awkward wannabe loved new kid quite well and although it's a positive thing, I can see him getting type cast to the character role very quick. I would also like to just say how Walton Coggins was remarkable in this movie. His character was absolutely well portrayed and Coggins fit the part perfectly.This movie is not perfect. It's not a masterpiece and it isn't an award winning cinematic experience. But it's something for the heart and I think it handles the mental illness topic very well. The story was just so moving and loving too, although that mostly goes to the author of the novel.If you liked Perks of Being a Wallflower, The Fault in Our Stars, Looking for Alaska, and other similar films, you should love this one too!"}], "reviews_amount": 35}