{"name": "The Crumbs", "titleId": "tt08709044", "reviews": [{"id": 0, "text": "Inspired by the mad scientist genre of the fifties this lengthy excursion into horror territory features a bizarre family who entice visitors to their bed and breakfast but only in order to pursue their perverse medical experiments. A fine attempt at a classic gothic horror."}, {"id": 1, "text": "This movie is great. Great acting and love the story line. 👍👍👍👍"}, {"id": 2, "text": "A bold movie that tells it from the perspective of the killers who dare to cross their paths. The characters are captivating and you'll be craving to know more of their story, even though there is plenty here to digest. The dynamics between killers were interesting as we explore each person's stake in the situation and how they bounce off each other. If you're looking for a unique tale to explore the predator instead of the prey, then you need not look any further."}, {"id": 3, "text": "What a perfect movie for 2020. Family is how you describe it. And The Crumbs have an interesting description. You never know what's coming at you next. Proceed with caution!"}, {"id": 4, "text": "Enjoyed it from beginning to end!! Definitely a must watch for anyone .."}, {"id": 5, "text": "This is a great film. It was quirky. I like that in a film. I also liked the twists."}, {"id": 6, "text": "I really enjoyed this movie. Definitely worth watching!"}, {"id": 7, "text": "This is a very raw and granular horror indie film. I decided to take a chance and was pleasantly surprised. It has a unique vintage photography that gives it a disturbing visual atmosphere. Great acting and good plot twists keep you invested till the very end."}, {"id": 8, "text": "** very minor spoilers ** First, I had to say this in response to writers of user reviews who obviously didn't get it: The characters change their accents ON PUPOSE! Dummies. (They're pretending to be locals, but they aren't.) It's quite obvious and the reviewers who attributed the accent switching to 'bad acting' are either morons, or just write reviews without actually paying attention to the film.Now that I got that off my chest...This is not what I would call a true horror film, but it doesn't really fit into any other genres. It's weird, unexpected and fun. A real grind-house film vibe. Creepy, suspenseful and humorous but hits a surprising emotional note once or twice. No big scares or crazy gore, but you'll be waiting to see who's next! The acting from the core characters is uniformly good with one or two amateur performances from ancillary characters. (Just what one would expect from low-budget indie films like this.)Cons: Sound quality is sometimes lacking. Hard to make out bits of dialogue without turning on subtitles! The visual production value is adequate but leaves you wanting in the special effects department. A bit more blood would've made some of the violent moments much more effective! A few afore mentioned performances from the guests/victims were a bit lacking but most were quite good. Some of the plot points/characters don't get paid off (like what was the point of the homeless dude?)Pros: The four main characters were really well acted. The story and characters were crazy original and unexpected. The ending pays off the movie as a whole really well! Final verdict; this was a really groovy little flick for fans of truely independent Grindhouse type films. Recommended!"}, {"id": 9, "text": "Very slow pace snd way too long. Lost interest really quickly. Decent concept but there really wasn't any surprises. Needs an edit job."}, {"id": 10, "text": "You'll enjoy this film not too gruesome like chainsaw massacre but good suspense 👏🏽👏🏽👏🏽"}, {"id": 11, "text": "I don't want to spoil your experience, so just enjoy the ride."}, {"id": 12, "text": "Despite the fake 9 and 10 star reviews being left by everyone who worked on the film, this a an absolute turd. Not scary, not creepy, not funny. Filled with meaningless scenes and dialogue that serve no purpose. Pure amateur film-making at its worst. And of course bad acting and terrible line delivery."}, {"id": 13, "text": "They shouldn't have released this OH GOD my eyes!! MY EYES!!! Awful movie. Torture to watch. Are you people in the comments friends with the team or what???"}, {"id": 14, "text": "Very good movie great cast weird twisted plot I didn't expect I've even watched it twice I loved it"}, {"id": 15, "text": "Old school horror theme. Think Venus fly trap. The victims never suspect what horrors await them inside. Get the popcorn and enjoy.😊"}, {"id": 16, "text": "Living out in the middle of nowhere, a deranged family use a bed-and-breakfast as a cover to attract unwitting guests to the place so they can experiment on their bodies, but when their activities start to draw unwanted attention from outside sources they try to keep their experiments a secret as they carry them out.This was a pretty solid and somewhat enjoyable if slightly flawed effort. One of its stronger elements is the engaging build-up to this one with the slow-burn dynamic that sets everything in order. With an enjoyable start that gives the group a fine reversal on a home invasion attempt which gives an idea of their ruthlessness and criminal ingenuity to take them on and overcome the unprepared group. Since this follows them for a large portion of the film, their strange inner-dynamics come into play rather nicely as the series of attacks that show them seducing, drugging, killing and then experimenting on the rash of victims that show up to make their special age-reversing serum offers up a great deal of fun. The old-school formula here of following along with the family and getting to know them rather than the series of faceless victims is a nice touch which makes the film feel quite fun with the information we get around here. Likewise, the film scores rather nicely with the series of explosive outbursts that occur in the second half. With the rapid succession of guests that are shown being taken out and killed to be used for their experiments, the grand reveal about the nature and process to be utilized here add a dark nature to everything much like the series of familial relationships that are brought up which gives the process itself a much-needed boost. The back-and-forth nature on how to carry it out with the various acquisitions of new bodies to be used and the debates over the timeliness and necessity of the operation at that point which gives this one a rather nice back-and-forth series of twists that help to build the action up nicely. The low-key finale, which might be somewhat less exciting and frenetic than it should be but still manages to get quite a fun reveal included, also manages to work quite nicely with the inclusion of a solid theme on the importance of family that is slowly weaved throughout the film but becomes quite prominent in how much it plays into the action. Overall, these hold the film up for the most part. There are some issues to be had with this one. One of the biggest flaws is an overlong and drawn-out pace which gives this a far longer running time than necessary with this running afoul of either unnecessary scenes or just going way beyond the point of necessity. Most of the meals they share or the luring in of victims who have arrived tend to be quite obvious in the latter part where it serves the film to include them but yet run on more than they should. It's mostly the interactions with the various guests coming into play around the guests who tend to skirt around the unnecessary scenes with the idea about what they're doing quite easily yet running on too long for its own good. This mostly comes about due to the rather clumsy narrative structure where it falls into a repetitive pattern where someone arrives and they tend to it only to have someone else arrive and the process keeps going so it can feel quite unnecessary to keep hammering that point home as many times as it does which is what makes this feel so long. Otherwise, there's a lot to like here.Rated Unrated/R: Graphic Language and Violence."}, {"id": 17, "text": "It was a good show, and had a interesting plot. I enjoyed it."}, {"id": 18, "text": "Frickin weird, but in a good way. Reminds me of the days I would watch a stack of VHS movies looking for the one bizarre gem. Well, here it is - your weird indie horror. The characters definitely grew on me. And yeah, the rub has a wonderful savory flavor. Just right in time for Halloween. Hells yeah!"}, {"id": 19, "text": "Absolutely excellent! Definitely keeps you on the edge of your seat!"}, {"id": 20, "text": "Interesting and quirky. Fun to watch. Take a chance and see what you think."}, {"id": 21, "text": "Engaging, creepy and entertaining. Sometimes our imagination is worse than what you see, and this film gets inside your mind - in the best way. This film will take you on a creepy journey and put you on the edge of your seat. The suspense, intensity and delivery are well done. I look forward to more"}, {"id": 22, "text": "Lots of cool characters, very creepy family. You'll be kept on your toes!"}, {"id": 23, "text": "Terrible acting, wooden and amateur. The British accent would be laughed at here in Britain, it was Americans trying to crucify it, that was the horror aspect to this film. I see the cast and production team have all left high scores and good reviews for this film but was that only to sell it to Amazon? Just dire."}, {"id": 24, "text": "Indie Horror is my favorite genre and it's so rad to see something that's original and hits all the beats you're hoping for - even some lighthearted character moments. Well worth it if you're a fan of the genre!"}, {"id": 25, "text": "The ornate and creepy opening credits give you all you need to know to enjoy this flick. the movie drops you right in the middle of the action. No slow burn here. I was taken right away with Maria Olsen's (I spit on your Grave sequel) performance.The cabin location is appropriately eerie. The whole thing has kind of a western feel. My only real gripe is it sagged a bit in the middle. At 110 mins, they could trimmed 10 or 15 mins out it."}, {"id": 26, "text": "Very original! It was very enjoyable to watch! If you are looking for an original horror movie, The Crumbs is definitely the movie to see!"}, {"id": 27, "text": "The editing, cinematography and acting are awful. The actors accents change every 5 minutes, can't tell where they're supposed to be from. The foley is awful, the choice of angle for certain shots is strange and jarring.I'd stay away from this if you are looking for a comedy or a horror"}, {"id": 28, "text": "Am I the only one who noticed the English accent that switches to American accent back and forth throughout the movie? Very distracting."}, {"id": 29, "text": "Reccomend to watch this movie. I truly found the story line great and different. Strange weird family in a lovely cottage in the middle of nowhere, more you watch the more things start get stranger... It's a must watch with a bucket of popcorn. I'm watching it again on Friday with my BBF and yet ANOTHER bucket of popcorn lol"}, {"id": 30, "text": "A very entertaining movie that I enjoyed tremendously. Looking forward to the next one"}, {"id": 31, "text": "Good. Plot. Fun. David Esonosa is awesome. Twists are good. A must watch! Don't worry about the trash reviews. Watch it!"}, {"id": 32, "text": "I enjoyed the plot, although they could have shortened the film by eliminating some of the visitors that really didn't add to the story. What was the point of the exotic dancing lady, and her beau? They didn't have the internet, but they went to town for supplies (cigarettes, peaches etc...) couldn't Victoria just access the internet in town?Don't get me started on accents. Jeff Hatch was the worst offender. He dropped his accent in at least three scenes, as did Chelsea Jurkiewicz, but the opposite. She used an accent in a few scenes, but dropped it in most of the movie. You have one job. Show up to the days shooting, and stay in character.Otherwise I found it entertaining to a degree. Worth at least one watch."}, {"id": 33, "text": "The Crumbs is a really unique horror/thriller with some really interesting villains and twists that stand out from the typical horror fare. The leads all give good good performances and have good motivations for their actions to make them all interesting. I also like the fact that there are some dramatic elements to it making it not just another horror/thriller but also mixes some of the drama genre in with it. It's well directed and shot with good quality. Looking forward to more projects from this cast and crew. Especially if you're looking for something different from this genre with more character depth, than you'll enjoy The Crumbs."}, {"id": 34, "text": "Some viewers have questioned the family's changing accents from one scene to another, believing it was a continuity error due to the actors making mistakes and coming out of character. If you pay attention, you will realize they only speak in a British accent when speaking privately with one another and in an American accent around their guests and strangers. They tell everyone that they are locals of the area and have lived there their whole lives. Later, it's revealed they are actually much older than anyone could guess, suggesting they are not really from that town. The accent switching is meant to clue the audience in that they are not at all who they claim to be."}, {"id": 35, "text": "Love the story line. Great movie! I love Horror films."}, {"id": 36, "text": "Be sure you make a reservation before staying at this bed and breakfast. The food is hot and the beds are comfortable but what lies between these walls are much more terrifying.Be sure to keep a lookout for Newcomer (Abigail Haunting's) Chelsea Jurkiewicz. She really shines throughout this movie. Highly recommended!! 8/10."}, {"id": 37, "text": "Creepy and unsettling. If you liked Texas Chainsaw Massacre, you'll enjoy this story of a backwoods family that does experiments on unwitting travelers who fall into their den of iniquity. The gore is kept at a minimum but the forboding evil is ever present. Punctuated by quirky and comic characters. Some very good performances. This one could achieve cult status!"}, {"id": 38, "text": "This is quite a strange film, in a charming way. It's got a story that makes you think. I loved the cast, set, and costumes. It took me a while to figure out what was going on with these people. A memorable film, I'd watch it again!"}, {"id": 39, "text": "True Definition Of A Masterpiece, well worth the time, Thumbs up."}, {"id": 40, "text": "I really enjoyed this film, it had me drawn in from start to finish. Great story, and acting. This film is really well done. I highly recommend this one."}, {"id": 41, "text": "Craig Ahren's horror thriller The Crumbs shares some DNA with Psycho and The Texas Chainsaw Massacre but with a slightly more empathetic view towards its killer subjects.The family dynamic was fascinating and I like the little details, such as stealing a cellphone from an unwanted visitor and other mysterious acts. Chelsea Jurkiewicz gives a haunting performance as Victoria, the young daughter of the family who has been sheltered from much of the outside world. Also enjoyed the more off-kilter moments, like the bizarre game of charades and an encounter with some pot-smoking teens. There is also a relationship reveal near the end of the film which is surprisingly sweet. For fans of the genre, The Crumbs is a fresh entry."}, {"id": 42, "text": "If your looking for an original screen play no need to look any further. This movie will take you in a mind ride inside your own head. Not your average horror Movie thought provoking."}, {"id": 43, "text": "A amusing but twisted tale of a wierd group led by the classic mad professor type carrying out hideous procedures on the poor people that are unfortunate enough to stay at their bed and breakfast.Some excellent laughs and screams, si very enjoyable indeed!"}, {"id": 44, "text": "The Crumbs is definitely a throwback to 70s exploitation horror films. Similar to The Texas Chainsaw Massacre in that there's a creepy family isolated in the woods and we don't quite understand what their motivations are.....Hopefully I've piqued your interest!! Check it out!!"}, {"id": 45, "text": "We had a good time watching this movie. It put us in the Halloween spirit. I really like the actors in this. We'll watch this again."}, {"id": 46, "text": "Hadn't seen one like this in a while. Creepy expressions on the actors!! Loved the whole Crumb family. This freaked me out, to be honest! A good new Halloween tradition."}, {"id": 47, "text": "Fantastic movie creepy horror but won't be staying there especially when you are on the menu"}, {"id": 48, "text": "The actors did a great job and the storyline was just superb, if you ask me!"}, {"id": 49, "text": "Amazing movie, I won't say any more then that just watch it and be amazed by this awesome family!"}, {"id": 50, "text": "A horror film that takes its time to build and lets the viewer settle into the world, and fully experience the strange characters as their dark secrets are revealed. It's a twist on a classic, with unique elements that make it feel new."}, {"id": 51, "text": "Creepy without being gory. This film makes me avoid staying at a BnB. Creepy, disturbing yet funny sometimes. Overall well-done movie."}, {"id": 52, "text": "Enjoyed the film with my family. Different kind of horror style. Just in time for Halloween"}, {"id": 53, "text": "I mean, you can tell immediately that these folks who own the out-of-the-way b&amp;b are up to no good, but it turns into a bit more. everyone does their part to convey secrets and hidden agendas, while the guests are completely out of the loop. i liked the menacing character of leonard especially. he really steals the show, in my opinion."}, {"id": 54, "text": "I Loved This Indie - Atmosphere is Nightmarish. Outstandingly performance by Chelsea Jurkiewicz. The Entire Story is Flawless and Riveting. I especially liked the heartfelt moment of the visitor on a motorcycle. Please make a sequel."}, {"id": 55, "text": "A good horror romp. Pretty well acted and good production values. The script does a great job with the family. Give it a watch. I recommend."}, {"id": 56, "text": "This a brilliant film. Delightfully twisted and subversively witty and tense. Is a great roller coaster of a ride through a dark route of the imagination, brilliant horror, great drama, fine acting and directing. Unique, entertaining, thoughtful and totally recommended!"}, {"id": 57, "text": "The movie has a '70s horror vibe that reminds me of the classic horror that I watched on Saturday late night. The ending was an unexpected twist and has me waiting for a sequel. Great job👍🏽"}, {"id": 58, "text": "Highly recommend this movie. Awesome acting, and a creepy, fun story. I didn't see a lot of it coming."}, {"id": 59, "text": "You can tell from the opening credits that this is going to be a wild ride! If you're a fan of eerie, musky, dusky, low-budget horror like The Texas Chain Saw Massacre, or Night of the Living Dead then you'll enjoy this. Great use of atmosphere, sound design, music, and a strong cast. Warning: avoid if you are squeamish!"}, {"id": 60, "text": "So this movie was a gem. And I actually love how it was filmed and almost had the look of unpolished in the best way. I was thoroughly entertained throughout the whole thing and I love movies that make you think. Shout out to Anton!"}, {"id": 61, "text": "This movie was overall very good and I can see this being remade for the big screen with the actors actually. I really did enjoy this and I'm going to watch it with my daughter because it's something different and the storyline actually flowed together and made sense. I am looking forward to more movies from this director; btw the mother was my favorite character, she really embraced that role!!"}, {"id": 62, "text": "Curiously infectious style and performance by all crew telling the story of the macabre and horror. A little trite and predictable in some areas but its as if Motel Hell meets the Beverly Hillbillies and Petticoat Junction. Keeps u on your toes wondering what will happen next."}, {"id": 63, "text": "I'll admit, The Crumbs (2020) brought to us by Indie Rights, is not the genre of horror film that I would typically watch. I'm usually straight up blood, guts and body count. However, this was different.Meet The Crumbs and their extended family. Leonard (Anton Clark), Victoria Crumb (Chelsea Jurkiewicz), Dr. Benjamin Crumb (Jeff Hatch) and The Matriarch, Irene Crumb (Maria Olsen).The opening, at first, reminded me of the classic TCM or Devil Times Five. Clearly, I was not prepared for what I was about to watch. This is TCM, meets David Cronenberg's Dead Ringers, meets Dr. Mirakle In Murders In The Rue Morgue.Anton Clark, whom plays Leonard brings the gore, in a chilling yet humorous fashion. I had seen him before in Penchance, and once again he outdoes himself in this performance. He is absolutely on my rising star list.Chelsea Jurkiewicz, who burst onto to the scene with a stellar performance in The Hunter. She truly becomes her character in Crumbs. Her performance as Victoria Crumb leaves the viewer wondering if she really is the innocent, sheltered, pretty, young lady of the family. Is she completely harmless or delightfully sinister? Ms. Jurkiewicz always brings her A game to the plate and the scenes between she and Mr. Clark were like lightning in a bottle.Jeff Hatch, is the most seasoned of the bunch, and his talent shines through. Mr. Hatch has worked on several TV, film and commercial projects in recent years including lead and supporting roles in independent feature films, a made-for-cable sci-fi/horror movie, several short films, and featured roles on the NBC comedy, The Office and the daytime drama, Days of Our Lives. His Dr. Benjamin Crumb obviously did not take the Hippocratic oath, as he and his family run a Air BnB in the remote woods whereby the family performs experiments on unsuspecting guests in an effort to help Victoria who is suffering with a mysterious illness ( last spoiler I promise).Finally, playing the matriarch of this ferocious clan is Maria Olsen as Irene Crumb. I do have to make a disclaimer here, I did work with Ms. Olsen on Krampus: Origins, Fear Inc. and enjoyed her company while she was on set of Lords of Salem (uncredited) and I was doing background research.Ms. Olsen, is a tour de force, as usual. She absolutely is one of our legendary Scream Queens. I am not giving away anything about her role/ character as her performance is something to see first hand. Keep in mind, however, she has also won four awards (including awards for both acting and directing), had two short films appear at the 2009 Cannes Short Film Program, one at the 2010 Sundance Film Festival, plus others at Fangoria's Weekend of Horrors and HorrorFest.Overall, The Crumbs(2020) on Amazon Prime, is possibly one of Craig Ahrens' and Director David J. Espinosas' best work. The actors did a great job and the storyline was just superb."}, {"id": 64, "text": "Laughably bad dialogue plot lines and acting. Isn't a B movie its an F."}, {"id": 65, "text": "This fun indie film isn't perfect, but it's got a lot going for it! The members of the Crumb family are well cast, the underlying plot and themes are unique and thought-provoking, if not unsettling.It's a fun time and definitely worth checking out!"}, {"id": 66, "text": "Good entertainment. Didnt expect much and wasnt disappointed. Get you snackage, turn off your mind."}, {"id": 67, "text": "I am a big fan of Craig Ahern's work. The Crumbs is fantastic. Great to make one forget about the pandemic and enjoy the show. The killers were interesting Characters and the storyline is very unique, Definitely recommend this film,"}, {"id": 68, "text": "I love scary movies and definitely enjoyed this one."}, {"id": 69, "text": "Visual effects excellent plot good screen play outstanding very well done"}, {"id": 70, "text": "This movie in a nutshell is a Texas chainsaw massacre ripoff and its soo obvious. The movie if filmed pretty badly and the acting in most moments is poor.Overall not a good movie"}, {"id": 71, "text": "Good movie to watch for especially you never know what will happen the movie is creepy and solid entertainer it keeps you guessing all the time."}, {"id": 72, "text": "I watched this film on Amazon Prime about a month ago and if it is still on my mind; it must be worth writing about.The film is pure indie. It is filmed at primarily one location, there is a core group of actors and the idea is not something you would see in main stream media. This is why I loved it so much and why others may have an issue with trying to get behind it.Here is a quick breakdown.1) The story is absolutely fantastic. If you want to compare it to TCSM then you can but, to me, it would be like comparing The Shinning to Amityville Horror. We get the idea of the film but the tone and the way it is executed is entirely different.2) There are some incredibly strong performances.3) It is a slow burn which I love! The film is not an in your face blood squirting maniac piece. It is a unwinding story of a twisted family and their desires. It was paced excellently.4) The characters were people you wanted to root for even though they were not the ones you were suppose to root for!5) There were some hardware issues with lenses and small issues like that but, welcome to indie filmmaking. They did it and it works amazingly.In the end, this was a phenomenal film about the horrors of a family who sticks together through the hard times even if they are the ones creating the hard times. It is fun, the sets are awesome, the production value is there and the cast looks like they had a hell of a time making this film. I truly do think it is worth the watch, maybe even study and I can't wait to see more from the incredible team at CRA!"}], "reviews_amount": 73}