{"name": "Black Beauty", "titleId": "tt08484160", "reviews": [{"id": 0, "text": "I want to start by saying that when it was all said and done, I did end up enjoying the movie. Now on to my critique... Black Beauty was one of my absolute favorite novels when I was a young girl, and I've always loved the 90's movie adaptation. There were A LOT more changes in this new version than I was expecting, and I was not a big fan - especially with the mustang angle. I feel like they did too much to try to modernize the story and to also try to stay close to the novel, it seemed kind of cluttered. I'm a sap for any heart warming story that involves animals, though, so again I did end up enjoying it. But I think it probably would have better if they would have tried to make it more of its own film."}, {"id": 1, "text": "This story makes no sense in parts, poor writing. The original was 1000 x better and the book was better still. At least they knew something about horses the people who made the original. It's just laziness &amp; sloppiness. Everything is so dumber down now in movies. It's supposed to be geared towards horse people yet any decent horse person can see flaws in any scene. Very poor writing, directing &amp; producing. That horse definitely is not a thorobred, colic isn't caused by or have anything to do with the lungs. How do these people get to make movies. Most movies are horribly written now. I didn't go to film school but I can make a better movie than 95% of stuff that comes out now. Where are they getting these people from?"}, {"id": 2, "text": "Could have been a ok film, However calling this Black Beauty when it is so far from the original film/book premise has really annoyed me. So Beauty is now a mare, it's set in the U.S. and the 'posh' British family are so stereotypically 'nasty' upper class it's ridiculous. I love Kate Winslet usually, but even her voice had me irritated."}, {"id": 3, "text": "This movie really is not bad at all. It's very heartwarming and beautiful. A lot of people are just mad because this movie has the title Black Beauty. It's a remake, a re-adaptation, it's not supposed to be EXACTLY like the original. This is the writer and directors own take on their own version of Black Beauty. I think it's a great movie. This Black Beauty portrays the beautiful relationship between a girl who lost her parents and a horse who lost her family. It's sad how people are too focused on the practicality and the realness of these movies instead of the message behind them."}, {"id": 4, "text": "All the negative reviews must be from people who don't like change! Agreed, it's way different than the classic '90s black beauty, but once you get past that it, is a darling film. I absolutely love black beauty, although she is not a mustang...I was confused by this. I like the fact that it was a female led cast. The scenery was breathtaking, I love out west and I love Mr. Manly's New York ranch. Very warm and fuzzy feelings for me as I used to have my own female quarterhorse when I lived with my mom on her ranch! This movie is adorable, the horses are so gorgeous they literally steal the show, especially black beauty! Watch this movie if you love horses!"}, {"id": 5, "text": "It is a very heartwarming story. It is a movie that inspires you to never lose hope, and never give up."}, {"id": 6, "text": "It offers some important lessons for people that love horses but also for those with personal problems."}, {"id": 7, "text": "Obviously being set in the modern day there are differences from the book, but that means that it's not just another remake. It's not the most factual when it comes to horses, but it doesn't need to be, it holds it's own as a horse movie. The biggest problem I had was the unnecessary forced romantic subplot, it would have been a good movie on it's own without the romance. It wasn't the best movie ever, but it was pretty good and a cute family movie."}, {"id": 8, "text": "It annoyed me that they kept trying to pass off a very obviously tall thoroughbred as a mustang...I liked the movie otherwise. It wasn't perfect, but worth the watch."}, {"id": 9, "text": "Sure there might be mistakes in a film, but just watch a fim for the film's sake! I thought it was very thought provoking and beautifully filmed. Well acted by both people and horses. Quite a tear-jerker. Very recommended viewing!"}, {"id": 10, "text": "But Dear Film team, her name is Mackenzie Foy, not Mackenize Foy... never noticed a misspelling of a films leading actor in the CREDIT ROLL before... so that's a first...."}, {"id": 11, "text": "Its a movie to feel, not thing to get yourself entertained. Somewhere its lovely, somewhere its sad, somewhere its smiling."}, {"id": 12, "text": "A wonderful adaption of the book Black Beauty and a beautiful movie. Especially if you love horses."}, {"id": 13, "text": "Enjoyed the story told from the eyes and soul of the horse. Beautiful story and connection between a horse and young girl. Great family film! Brought happy, sad, and happy again tears to my eyes.Just be open to this film as a different view of a classic tale and enjoy it for what it is. If you stop judging things you will see the true beauty in this wonderful Black Beauty tale."}, {"id": 14, "text": "I would prefer to watch once again The Black Stallion Francis Ford Coppola's &amp; Fred Roos produced &amp; Directed by Carroll Ballard.For me it remains the masterpiece ever produced with excellent background music &amp; emotional relationship between a horse and a kid.Please do watch if you haven't yet."}, {"id": 15, "text": "Compared to the 1994 version this movie lacks actors who can ride and a bit more knowledge about horses. It seems like the creators and actors, have seen a couple of horsemanship training videos on YouTube and apart from that have no knowledge of the animal. The dialog is terrible and cringe, I had to fast forward through weird giggling romantic scenes. The classic story of Black Beauty have been turned into the awkward encounter of teenage love. Iain Glee is great and raises the bar a bit overall. Mackenzie C. Foy's seems very Inexperienced, but I do blame dialogue. I give it 3 stars only because the movie puts focus on how city carriage horses are treated, mostly for the sake of tourists."}, {"id": 16, "text": "For a horse that has supposedly never been handled, has shoes on. Ruins the realism"}, {"id": 17, "text": "I was so excited to see this. And was so sadly disappointed. Bland watered down retelling focusing on Jo and Black Beauty. Talks about climate change which is good but nothing even remotely close to the original story. Okay movie for kids if they have never read or seen the others."}, {"id": 18, "text": "I don't really think that comparing movie adaptations with the original one is fair at all, people can stick so much and forget about the beauties that different adaptations from different directors and writers can be, for example, I simply think that this one is a GREAT one that will definitely make you cry, I did the whole movie and that's what really matters I think, getting to break the audience.It may have its own flaws but it is enjoyable after all.Great work here, Disney +"}, {"id": 19, "text": "Should not have called it Black Beauty when there's elements of other horse films throughout it."}, {"id": 20, "text": "I was looking forward to a new Black Beauty movie. But this movie is just awful. Disney has completely ruined the old tale. Disney has turned it into every other horse movie nowadays. Girl that's never ridden a horse forms a bond with a wild, black horse and is somehow able to train and ride it. The horse is supposed to be a Mustang but it looks like an OTTB and comes with shoes on it. Mustangs do not look like that. They switch between western and English tack multiple times. It is not rocket science to tell the difference. Disney obviously has enough money to do some basic research and at least make the horse and story decent. This movie was made out of pure laziness. If that wasn't bad enough they make real equestrians look bad. They make it seem like everyone who uses spurs on their horses must be abusing them which is not true unless they're used incorrectly. Overall a complete waste of money and an abomination of the real Black Beauty."}, {"id": 21, "text": "I love the movie and it's concept. Would love to know the author of the book jo's uncle gives her called two spirits converge the art of the horse can't find this book online at all. Would love to read two spirits converge the art of the horse PLEASE HELP ME FIND!!!"}, {"id": 22, "text": "I don't think Disney streaming is that world-wide yet, so that may effect viewing some. This was colorful movie, of course great horses. The thing that annoyed me was the narration. It needed another person. Until movie over and looked on here was surprised was Kate Winslet and not Sarah Paulson. I am tired of the latter so that was my annoyance."}, {"id": 23, "text": "Well honestly I wanted to see this film just because it's from Disney and because of Kate Winslet's voiceover but it turns out to be really good. It definitely is far away from being a masterpiece but it's still a lovely enjoyable family movie that both kids and adults would like, and that animal lovers would highly enjoy and feel touched. Also it has some really beautiful sceneries. Black Beauty is not flawless but it's definitely worth seeing."}, {"id": 24, "text": "Great movie awesome for the family please see it it really is a must see. Takes your mind off the current world status puts you back in a great mood."}, {"id": 25, "text": "It's essentially like those animal voice over films that you get to see during this past few years like franchise, The Art of racing in the rain, The Call to the windit's mainly focused on the morals of what us human used to use as transportation, that is horses, one of the messages being the horse mustangs are being treated unfairly as do certain other animals do so let's just #StopAnimalCruelty, accept animals as our guardian angels 😊, if I could describe the film with one word that word would be Superb"}, {"id": 26, "text": "Black beauty is a Male horse for one!The actors are annoying the only thing i like were the horses, yet nothing to get the name of black beauty as the movie title!This movie is really bad!! Doesn't even include the black beauty song"}, {"id": 27, "text": "This is an amazing movie about a girl and a horse's relationship I learned a lot about horses and different things it dohes seem like they tried to pack a lot and do it which can be bad at sometimes it was very stereotypical with some of its characters and was sometimes even predictable but at its heart is a fun family film filled with joy and a moral lesson this makes me want to read the book it would have been even better this was a true story story I would definitely recommend this to families who have gone through troubled time families that just want to find a good movie to hang out over and families who have lost their parents also families who have horses and animals in barns the character development and the relationship between all the characters and how it grows is okay the film was way well executed and is a hit or miss depending on which person you are overall I'd give it give it a c+ on the rating scale instead of a percentage because I'm not sure about this one"}, {"id": 28, "text": "2.5 out of 5 stars.Black Beauty could have been better. A story about a mustang horse. From being captured and sold to a stable. Where a guy and his daughter raise the horse. And more events after. Showing the horse travelling from one place to another. It tries to be emotional but fails to with a lackluster script. The story is pretty flat as well. The cast is decent. I did find it kind of boring."}, {"id": 29, "text": "A nice short and simple movie with the story we all know. Nothing wrong how they proceeded with it. And the cast is quite interesting too. Can be watched with family as it doesn't have any gratuitous content. PS : the horse actually looks very beautiful."}, {"id": 30, "text": "So I was scared to see this. But gave in. Black Beauty was one of my favorites growing up. Not 100% upset with it but I got weird Flicka vibes. Was like Black Beauty meets Flicka."}, {"id": 31, "text": "The first half of the movie is pretty good. Feels good, looks good.But once when the troubles occur, there's simply too much cliché. Especially some of the characters are way over the top.All that is left during the separation, is that you long to see the beautiful Mackenzie Foy again, missing her just as much as Black Beauty does.And the (adult) reemergence of Foy is the one highlight this movie has to offer. Interstellar made it clear what potential she offered for the future. The Nutcracker and the Four Realms didn't offer much opportunity to shine, but Black Beauty did. I can't wait to see what's next. Hopefully more than just Disney."}, {"id": 32, "text": "OK, the first annoyance is it's not the classic Black Beauty by Anna Sewell, it's something cobbled together and given the name. The premise of the original novel has been so watered down as to be unrecognisable. Wrong horse, I am a Mustang, no you're a thoroughbred. Wrong setting, set in the USA not England. Different story, I mean completely different. Anna Sewell's estate should sue for misuse of the name. Acting, meh. Mackenzie Foy mumbled her way through the movie so much that I only got about 50% of the dialogue. Kate Winslett, English actress narrating in an american accent, didn't work for me. Stereotypical English upper class family that probably only exists in the American imagination. Why three stars. The horses were good to look at."}, {"id": 33, "text": "Black Beauty is a beautiful remake of an old classic. The power of love between human and animal is so well portrayed in this film. Cinematography is spectacular, and the story is really moving. The world is full of exploitation of living creatures, human and animal and plant, we could all use more kindness."}, {"id": 34, "text": "Black Beauty is a 2020 Disney+ movie starring Mackenzie Foy and the voice of Kate Winslet. The story is told through Black Beauty's point of view (narrated by Kate Winslet)from being abandoned to meeting a teenage girl(Foy) to being sold again. Will Beauty reunite with Jo?.Overall it was a nice film. If you like the original one then do check it out"}, {"id": 35, "text": "I didn't think the film started great, but as it went on I really enjoyed it. Really heartwarming and emotional at times. I would definitely recommend to watch."}, {"id": 36, "text": "This movie is SO far from the book/original movie that it's embarrassing. I should've trusted my gut and stopped watching after the first few minutes. It's barely a skeleton of the original, the writing is horrid, and it plays out terribly. Do yourself a favor and just re-watch the original."}, {"id": 37, "text": "It's completely Americanised in the wrong way possible. Basically they call it a Black Beauty remake but it's more like a Spirit remake with a mare instead of a stallion"}, {"id": 38, "text": "Dear me, this is quite possibly one of the worst films I have ever watched!! The script is lame and the film has no real direction. The budget must have been tiny as from the very start it all looks a bit cheap. It is typical PC Princess Disney rubbish which is what you would expect from a title like this but it is just SO POOR. The acting is dreadful despite the best efforts of Iain Glen to rescue the film (you sold out agreeing to this!) Calam Lynch loses credibility after this as does Fern Deacon. Surely they will look back and ask themselves why oh why ? Mackenzie Foy is a bang average actress so this won't really have harmed her. Avoid this at all costs."}, {"id": 39, "text": "This movie did everything poorly glazing over Jo's grief at losing her family, her relationship with her uncle, her romance, literally everything. In this backwards universe horses are trained by staring deeply into their eyes, coupled with many slow motion shots of golden hour wind blowing through beauty's mane or jos hair. Jo just learn to ride in a few weeks and then by some miracle of a plot device, is hired at an upscale stable with high level riders. The narration is cheesy and most frustrating of all - the horse is CLEARLY a thoroughbred and not remotely similar to a mustang with a badly painted white star in several shots. I mean, it's a family movie but if you're at all a horse lover, prepare to be annoyed"}, {"id": 40, "text": "It is a family movie, but so dense and slow, so bored, I won't never watch this movie twice, never, no idea if this movie had good critic into fans, but on my opinion is too bored"}, {"id": 41, "text": "By taking the name of the cult classic from 1997, which so many grew up with, including myself, and chucking the entire original plot out of the window. They have created a movie that doesn't deserve to carry the same name. The original movie being so much more than just a bond between man and beast, but a story that makes you tear up. This is movie is an atrocity that disrespects the original story and should be srapped and Disney should be shut down for making it."}, {"id": 42, "text": "Before watching this movie I did not care a single bit about horses and this movie was great. This great movie opened my eyes to the fact that they have hearts and emotions like humans do.The videography with the shots made it amazing. The plot was kind of like a roller coaster trying to mess with your emotions, making it just a happy moment and then a good amount of time a really sad moment. It was not sad enough to make me cry though.When I was halfway through the movie I thought that it was over and they were just stretching it out over an hour, but once again it went to a sad part then to the happy ending.This is a perfect movie to watch with people of any age, as they would most likely enjoy it. If you have not seen it you should see it."}, {"id": 43, "text": "I was so looking forward to this movie because Black Beauty was my favorite book as a child. There have been many Black Beauty movies over the years, so I am fine with updating it to modern day, etc., but this movie is *not* Black Beauty.They changed the colt born in a stable to a mustang filly who is afraid of humans! It does follow her life and Kate Winslet's narration is cozy, but basically, this is a movie about a girl and her horse who search for hope together. It is not Black Beauty by any stretch of the imagination, even if they used the character names and a few of the incidents from the book,It's just bits and pieces cobbled together from other stories (Black Beauty, Black Stallion, any Disney princess movie...) instead of coming up with an original idea. I think the performances were mostly fine and it was a very pretty film, but the cinematographer needs to learn that lens flares should be used sparingly."}, {"id": 44, "text": "Animal cruelty finds no sympathy here, and is poo-pooed instantly. EXCELLENT.The good stops there. The horsey aspects of this movie are so wildly off from reality that it truly doesn't come far from fantasy. Disney, you have multiple horse facilities; would it have been difficult to run the technical aspects by someone already on your payroll who actually knows horses?The dialogue is bad, the pacing is off... I couldn't help but laugh at all the ...but I'm a MUSTANG lines. Really. Gag.For everyone watching this movie thinking, I've learned so much about horses! You. Have. Not.Maybe someday someone will make a horse movie that horse people can actually watch without cringing. I'll be showing my kids the original; at least they'll be more prepared for the cruelty that truly exists in horse business and the apathy the general American public has to it.Nice try, Disney. But ask the experts."}, {"id": 45, "text": "LIKES:Beautiful Cinematography Great Coming of Age Approach, at least at the beginning Takes the Horse perspective, so different Poetic and Beautiful, if Sad Hits those heartwarming moments just rightDislikes: Slow No real character development details Simplistic intense moments Very fast progression of the good parts Writing a bit a bland in terms of dialogue and character involvement Extremely Depressing and heartbreaking for much of the movieSummary: I give many movies a hand these days in their ability to capture the beauty of the world through the camera. Black Beauty's opening shot is gorgeous of the wild life of the mustangs and the spirit that Winslet's voice over explains. Disney's crew uses their technology to constantly paint the picture and pull you into the scene, whether it be out on the open plains feeling free, or in some of the stables where each condition brings a different mood that really does affect the audience member if you are like me. This technique fits well with the whole coming of age approach this movie takes, using the simple idea of setting being the paint brush that creates the experience and guiding you through the harsh reality of life. What's different from this though, is that though we have Jo's (Mackenzie Foy) own emotional growth, the movie really is more about Beauty (Winslet) and how she changes over the course of a horse's life. While certainly not the original, this perspective gets points for being different and providing a fresher, more direct take on the horse's life compared to other movies. I did enjoy Winslet's commentary at many times, finding the words poetic, as her philosophical thoughts sprang out through my soundbar. The many metaphors and nods to various cultures, tied with the scenes that were running tandem with it, further brought out the Beauty of the movie, which I think will speak to a lot of audiences with similar looks on life (at least according to my friend's Facebook status they would). And though the movie has many sad moments, the movie has those moments where the alignment of music, shots, and writing is perfect to really give you goosebumps, helping to harbor you in the shores from the storm of depression this movie is.As I'm sure you have already read though, the movie has some shortcoming for me personally I did not enjoy. Starting out, the movie has little character development outside of the mind of Beauty, the rest of the cast, including Jo, sort of diluted down to props that Beauty has to accept. Sure, they make for some interesting and dynamic experiences, but given the previous installments and how the horse affected their lives, I would have loved to have seen more involvement to get that dynamic nature other horse movies have gotten. Throw in that much of the solutions and exciting moments are very simplistic, most of the hurdles leapt without so much as an afterthought during the tense moments made the spectacle less grand given all the buildup they were working towards, teasing you that something spectacular would come. This was especially true for one set of characters I hoped would have gotten the kick in the pants that they really needed, but nope, happened in the background and very lackluster finish for that story arc. I guess going with the coming of age and realism vibe, they kept to their standard, as even the good moments for the other characters was flown over, again much of the human cast's lives being pushed to the background as Beauty's journey progressed. Sadly, I would have liked to stay on these good points a little more to help lighten the mood and energy of the movie, but then again life does have a way of pulling the joyful moments out from under you, so it fits. And despite all this poetic action from the mind of the wild mare, the writing surprisingly is very flat for much of the movie. At times they nail the line, giving you a quote to belt out for future days, or checking that box for proper description of the action (partnering over breaking) that I did quite enjoy. But much of the time was just simplistic dialogue you might have with a teenager, and though again realistic, it's boring given much of the film's already somber tone. Throw in the fact that much of the film is depressing and heartbreaking, and you get a journey that is not easy for people like myself. I can't say much without spoiling, but let's just say seeing some of the treatments in this film, is more than enough to drop your spirits down a notch or too, so go in warned. All of this comes down to a very slow pace for yours truly, and though I'm a bit of an action freak, this pace was certainly slower than I would have liked. It magnifies all the dislikes for me and leads to again a blander experience that really takes the enjoyment out of this film for many when I read their posits. So don't go in there ready for bed, or you might be fighting sleep.The VERDICT:Black Beauty is certainly beautiful on the literary device and cinematography standpoints. The horse's perspective is certainly unique and brings a lot of emotional delight and lessons with it, and just seeing this amazing horse work on camera is a treat to the eyes. Yet, the movie gets lost in realism, beauty, and the life lessons that it loses a bit of the entertainment spectacle and story telling that I enjoy in these movies. The fact that the human partner story is sort of lost midway through the movie and used as merely a motivational saying of the horse did not impress me, and the fact that there are still some poetic justice moments lacking did not deliver on the promise the trailer laid. What is really limiting for me on this movie, is that is a very depressing movie, and though I understand that is the story, but to cut out the parts that help weather the depression was not my favorite choice. And diluting the justice parts to give more of that poetic realism got a little old for me. And when all of this feels a bit slow, well... it only helps to amplify how sad this story really is. Thus, the people who will like this tale the best are those who enjoy the somber nature tales, little girls and those who love horses, and those Disney fanatics who think they do little wrong. As such, this movie is fine for the viewing online should you have Disney+, but again if you miss it, not the biggest blockbuster to grace the small screen. My scores are:Drama/Family: 6.5 Movie Overall: 5.0"}], "reviews_amount": 46}