{"name": "Jallikattu", "titleId": "tt08721556", "reviews": [{"id": 0, "text": "The plot is very simple - Hundreds of people chasing to tame the bull that went amok. But at the end, there is an unanswered question - Who is wild here? Man (or) the animal? Like his earlier movie 'Angamalay Diaries', Lijo Jose has captured the life style of the village town wonderfully. Special mention to the night photography and sound effects team. Though the movie makes you wonder at times - 'Where this movie is heading to?', it is a worthy watch and an unique film."}, {"id": 1, "text": "Such a realistic movie, with gripping storyline and acting."}, {"id": 2, "text": "Super realistic natural movie. Truly a masterpiece. It was a perfect visual treat in every aspects. I wish everyone could watch the movie in its pure form and in theatres"}, {"id": 3, "text": "Everything shown in the name of jallikattu in this malayalam movie is planned to insult the tamil protest against the ban of jallikattu where we tamil people never treat the cow as animal but worship them and jallikattu real meaning is to embrace the ox but not killing or torturing it as shown in this movie.. we protest against the ban of this sport because it's planned by PETA to destroy our indegenious native cows.. one star to insult our traditional sport"}, {"id": 4, "text": "Purposely using the name jallikattu is unnecessary as the movie is showing about hunting a 🐃 buffalo which has no connection with jallikattu. Jallikattu is a remembering tradition of domestication of cows.its respecting cows. Not killing one.. Tamils consider cows and buffaloes as sacred animals and they won't eat them. So this movie is wrongly portraying a tradition. It's filled with racial hate."}, {"id": 5, "text": "This film has nothing to do with jallikattu practice."}, {"id": 6, "text": "Lijo Jose Pallisserry is a trademark in Malayalam cinema now. Audiences will rush into the theatres for movies made by him without a star cast or big budget just like Hollywood directors Quentin Tarantino or Christopher Nolan. We all know he won't disappoint and it will be worth watching in theatres. Jallikattu is the most anticipated movie in his career so far on par with Double Barrell. We all waited for Double Barrell mainly because of the stellar cast and big budget. But for Jallikkattu, all the expectations are for LJP. The film screened in various film festivals and received applauds. Jallilattu is a 91 minute roller-coaster. The movie never slows down. The pacing of the movie increases more and more from start to end. A big salute for Girish Ganagadharan. His cinematography is simply the best in Indian movies in recent times. The bgm was also very good. As for the performances, every cast did an excellent job. Jallikattu proves that LJP is getting more and more good by his every next movies. Highly waiting for his next release."}, {"id": 7, "text": "Its purely fiction made flick from lijo, Not a realistic in nature to catch a Buffalo it don't need 200 people moreover its just a domestic animal not wild animal like lion, tiger or elephant. You are trying to spoil the name of tamil culture &amp; paving way to an extinct of village bulls an animal species used in jallikattu. In jallikattu people don't run to eat the flesh of the bull, Even after the death , cremation process will be done with due respect as of human beings. But here you have shown many illegal affairs like bgrade films and trying to relate with tamil people You should not choose jallikattu as your movie name, u Can take name from your own tradition from kerala where real behaviour of ur people are screened in your movie, not tamil people or tamil culture #Jallikattu should not work @ #Oscars"}, {"id": 8, "text": "Why you chooses the name jallikattu? You are abused our jallikattu festival"}, {"id": 9, "text": "This movie is not about the Tamil traditional sport - Jallikattu. In fact this is misleading and I would not recommend this to anybody who wishes to know more on Jallikattu."}, {"id": 10, "text": "He doesn't know about jallikattu and tamil peoples gutshe teases tamil and tamil peopls"}, {"id": 11, "text": "Typical of what we would like Lijo Jose Pallisery to direct. Dont watch it if u have a weak heart...lol"}, {"id": 12, "text": "Cannot believe that the movie is came by a malayalam director in malayalam industry. Fabulous is not enough to describe the movie Nailed it"}, {"id": 13, "text": "Lijo Jose has gone from brilliant to overdo. Taking his leaf out of Kamal Hassan who went from brilliance to self-glorifcation. Man turning to savage over his need was the motto, good enough. But the way he has portrayed is where the problem lies. Unnecessary loud music and some nonsensical camera angles reminded me of the downfall of RGV. The brilliance of Lijo Jose lies in his witty/ironical dialogues and characters that he builds which we witnessed in Angamaly n ee ma yo. There is no relevant/strong character here in this movie, no sensitive dialogues and a very forgettable plot. I thought of leaving the theatre during the interval but only stayed with the hope that Lijo will come up with something before the climax. But I was utterly disappointed. At the end, I was wondering why I allowed myself to go through this ordeal all the way through. I am sorry to myself."}, {"id": 14, "text": "LJP s' directing in the film was outstanding. The starring Anthony Varghese,Chemban Vinod and Sabumon Abdusamad their acting was great. Overall the movie was amazing."}, {"id": 15, "text": "An over-hyped movie, which is thin on story and relies on strong visual and cinematography to render the message. The acting seems forced and exaggerated, and the characters go overboard to portray their wild side. Overall its a movie which pretends to be on the right side of good cinema, but leaves you with a negative feeling and a bad taste in your mouth. You are going to miss nothing by ignoring this movie."}, {"id": 16, "text": "Visual treat and the politics of the movie is amazing ."}, {"id": 17, "text": "Just watched Malayalam language film Jallikattu today. One of the best cinematic experience. And I'm sure film like this, can't be produced by hindi film industry. Girish Gangadharan, the cinematographer of the film is the main hero of the film. Long takes by director Lijo Jose Pellissery is brilliant. The final sequence of the film provides some of the most haunting and bone - chilling visuals that I've not seen in Indian film. The music by Prashant Pillai and sound design by Renganaath Ravee is the music that will stay with me for a long period of time. I'm highly recommending everyone to catch it on amazon prime."}, {"id": 18, "text": "This film's title is misleading with its content. Tamils never eat or kill Cow meat after Jallikattu Sport. When a foriegner watches this movie they will think Jallikattu is a sport to kill and eat Buffalo meat, which is completely wrong. Jallikattu sport is to find the Healthiest and Strongest Bull, later cows are allowed to mate with the strongest Bull, so that the future cow/bull species will be healthier and stronger."}, {"id": 19, "text": "The title Jallikattu is exemplary Misleading and how on earth a Buffalo is related to Jallikattu... It is no way reflects or relevant to the Tamil's traditional Bull chasing sport which actually helps to preserve and save the variety of country bulls and to select the strong and healthy ones for breeding and most primarily for the milk which contains A2 protein which is super essential for babies and children. A2 protein milk cannot be produced by cross breed or Jersey cows. We Tamils feed the bulls with food which have proteins and carbs all the year, it will grow as our family member, we shower love on it as we do to our children, Whole family erupts in joy and celebrate if it won in jallikattu festival, when it dies we cry as as if our family member dies....We conduct funeral and bury it in our own land with full respect. Tamils never see Jallikattu Bull as a food or animal."}, {"id": 20, "text": "Lijo unleashes a guileful pandemonium. Jallikattu is one of the year's biggest discoveries. The movie is an incredible visceral and sensational journey spanning over 90 minutes which also deals with politics, religion, humanity, morality, revenge, nemesis and basic human emotions. The conflict is not man versus animal here, it is a conflict between the beast and the beast within you.The depiction of Jalikattu through the human point of view would make you wince. A cinematic experience like never before."}, {"id": 21, "text": "I didn't see any movie worst than this by recent time the main draw back of this movie is that it's actors bad acting, bad dialogues very irritating background music looks like stage drama kind of acting very unconvincing type .. also running behind a buffalo an entire village zero logic applied here whatever message he tries to convince us he should have made strong characters with very detailed past and their rivalry he failed to create a god plot around the animal he created to symbolises bad and the good praising this as master piece.is totally misleading ......"}, {"id": 22, "text": "Everything from Cinematography to BGM is magnificent and Direction is just genius. It gets you hooked with very tight screenplay and so much going on at the same time. it doesn't gives you any time to catchup with the characters and event, it just expects you to just jump right into the action. A well worth oscars 2021 entry from India."}, {"id": 23, "text": "The movie from the beginning itself started to make me feel exited with its great quality in editing, sound mixing and that place's beauty letting attracted and later tensed in the human transform to beast. Its really a roller coaster ride for me especially its storytelling through visuals make me feel I'm inside that 3d atmosphere. If you are watching the movie in phone suggesting to wear headset as the exhilarating energy comes to you."}, {"id": 24, "text": "There are so many symbolisms and metophors and inner meaning in this film! The butcher's name is Kalan Varky, In Malayalam, Kalan mean's Yamaraj (He is the lord of death and justice, Buffalo is his vehicle), So basically, the people running behind the buffalo symbolises, the men running towards death. In most of the first half (Daylight is prominent through out the scenes), the buffalo tramples things like fire, vegetation, wheeled cart, bank, and even interfere the politics created by humans, in all these we can see the unity of the people. All these sequences can be a reference to man's Evolution as a Social being The Second half (mostly shows night time) represents the spiralling down of man's unity and his path towards his real inner being that is beast with all his selfish interests, lust, pride, toxic masculinity, machismo, cheating, fighting (mainly shown by the character called Antony), Even law and orders become useless. All these scenes depicts that, man's basic behaviors haven't changed a bit since the olden times, remember that our ancestors were Hunter gatherers, the males of the tribe would do anything to protect their families and children from wild animals, females used to consider the best males are the one who brings meat/ food to their home, Macho behavior in males, competition between other males to become the Alfa male of the tribe, and much more. And finally when they found the buffalo, they literally turns blind and selfish and tries to claim their part , here due to crowd's mob mentality, they starts to behave like sheeps (or like flies who blindly follows each other towards the light and gets killed ). The final scene where the old man meets the buffalo (Yamaraj's buffalo m), may symbolises that it's time for his death, In the film, rope has an important role! The rope is like a paradox, In life on Earth, the rope represents freedom to the old man and confinement to the Buffalo. But in that scene, they both realize that they were wrong about their notions of freedom while they were living on Earth. Towards the end of the movie, you can hear the breath of the old man's and the buffalo's breath merging into one last breath, showing us that there is no difference between humans and animals, And no matter how we see ourselves as civilized and superior to other animals, we still are the same in front of Nature. The last primitive men scene and the tribal theme sound through out the movie, were the Clues for this message. The director in one interview says that The line between man and the beast dissolves throughout the movie. That last primitive men scene turned the whole movie into a completely different perspective and it is that simple scene which explains the whole movie. The animation part showed us how the primitive man, slowly engulfed in flames, the same flames he used to cook other animals,his invention, is now burning his body after his death (as in Hindu funeral) and slowly he disappears back into nothingness! (screen turns into complete black, The End) If you can keep all these in mind and re watch the movie, I bet it's going to be a completely different experience and you may find many more symbolisms which I haven't mentioned here ! This film simultaneously keep you entertained and force us to think, that's what art films like this and Parasite does to you. This is not a normal masala movie that spoon feed you the take away message, that's why most people didn't like this movie. But for critiques and film buffs this movie delivers everything from good cinematography, sound effects, casting, acting, realism, technical aspects to clear public message,which I think is universal!, that's why I think this movie is nothing but a Masterpiece and deserves a shot at the Oscars👌"}, {"id": 25, "text": "A little village where eating beef is a daily priority, one morning the buffalo which was to be butchered ran away and what follows is 90 minutes of awe-inducing pandemonium. From the visionary director Lijo Jose Pellissery comes a technical masterpiece which has a strong message about the animalistic traits of us humans &amp; also the herd mentality &amp; devolution of human beings. This film is not plot driven, instead it deals with events &amp; an army of characters constanty moving from one place to another. The sound design &amp; cinematography is on another level. Only cons are the acting of some characters &amp; the last scene which is basically a spoonfeeding of the message. It deserves to be our Oscar Entry, hopefully it can campaign well enough to have a chance."}, {"id": 26, "text": "Malayali movie at its best. Cinematography, choreography, acting are top notch. Bollywood needs to learn so much from this industry. Hats off to Lijo jose for making this gem of Indian cinema"}, {"id": 27, "text": "Loved the portrayal of how humans unleashe animalistic tendency when desire is at stake"}, {"id": 28, "text": "Think of the movie as if you are recalling in 90 minutes flat, the experience which you had when you were in a village in Kerala, where a bullock/ox had run amok. And how you witnessed, the chaos and turmoil in the comfort of your home tv/theatre, in the most realistic way possible, And to go with that experience was the moral metaphor of human and beast and the various other micro plots, which all tied together with that 90 minute experience, combined with amazing sound effects and cinematography. Hats off, and lots of claps, claps, claps."}, {"id": 29, "text": "This an awsm movie to watch and deserve oscar award..."}, {"id": 30, "text": "Worst movie from Malayalam industry in the purpose of degrade tamils and portrait as tribal. I request director to know the meaning of jallikattu before using it. Looks like it's sponsored by PETA for sure. It's not even worth for one rating. Shame on Malayalam film industry to degrade your neighbour for the peanuts"}, {"id": 31, "text": "The movie created in Malayalam, Kerala as well all casting from Kerala state. But title of movie given in tamil. It's kind of public shaming to Tamil people where jallikattu are way of life for Tamil people. This film not talking anything about jallikattu. This film failed. Title of this film need to be altered. I repeat...title need to be changed."}, {"id": 32, "text": "Director Lijo jose sir done a grate effort for making this movie without any compromise to its quality of making real life films. Camera and art work of this movie was excellent especially some shots put views into films. This is a totally different film in Indian film industry. The sound effect of this movie you can't never compare to any other films from indian industry. Finally the editer of this film done a grate job."}, {"id": 33, "text": "A movie of drama and chaos. A must watch from lijo jose pellissery"}, {"id": 34, "text": "How come its get awards, doesn't resemble anything."}, {"id": 35, "text": "No Idia What is the story and where its going......Nothing in this movie is watchable...jallikattu movie have psychopath characters and dull presentation.....😷😱😱😱Climax scene Copied from beauty &amp; the beast......This is the most Pointless Movie I ever Scene..."}, {"id": 36, "text": "I couldn't be any more disappointed watching this movie. Story or the whole thing was just a whole waste of time. And if it is to say it has anything to do with human behavior, trust me there are other movies which deserves and worth giving our time.Such a disappointment"}, {"id": 37, "text": "Hoping to see the bull fight, but the way the story moved every clock tik brought goosebumps and as the time passed the deeper I fell into the story. Even after not knowing the language it proved the insane, rude and hustle way to win."}, {"id": 38, "text": "Guys don't fall for the positive reviews, there is nothing in the movie, one hole village running behind a bull🐂. That's it, total waste of time..only sound effect, and its too loud, totally irritating.... Really disappointed 😖"}, {"id": 39, "text": "Finished watching this movie just now, observations: 1. This movie doesn't take you anywhere. It just drags on. Not denying movie had potential, but director just couldn't made up his mind to what he wanna present eventually. Is it the greed? revenge? barbarism? 2. I waited and waited for something to happen. Nothing happened. Weak ending. 3. Would have worked as a short film of 30 minutes max. pointless characters. Be it the rowdy drunk group, inspector, church people. 4. Background music is so out of place.Its definitely not going to win at oscars."}, {"id": 40, "text": "The attitude of Humans against all kinds of Meat. The films treats animals/humans as living organisms without any difference. All scenes are nicely choreographed. Difficult to digest for human beings depending on their attitude against animals."}, {"id": 41, "text": "Hat's off for the extraordinary efforts took by DOP Girish Gangadharan..... No words to say."}, {"id": 42, "text": "It is not about real Jalikattu. It is a planned defamatory movie about Tamil culture and people by some brilliant director"}, {"id": 43, "text": "Outstanding cinematograpy and sound design. A must wacht movie in big screen."}, {"id": 44, "text": "Every frames are mindblowing.Hats off to Lijo jose pellissery.such a wonderful film"}, {"id": 45, "text": "As you know how lijo directs, yes it's realistic. The sound the visual it's fabulous ever on a Malayalam movie. Should watch on theatre to feel"}, {"id": 46, "text": "The movie is a masterpiece. The direction, the screenplay, cinematography, everything about this movie is class apart. Jallikattu still had a chance at Oscars. I don't know why would they send Gully boy, when they had such a work of art."}, {"id": 47, "text": "This movie perfectly reflects our contemporary human society. Before you watch the movie let me first warn you about one thing that you are going to find out a lot in this film:- BRUTALITY. This movie is made Raw, Intense, Adrenaline pumped, Action packed, lots of violence and so on. If you are not a fan of violence please skip it 🙏. The BGM of this movie really moves you to edges. Overall l loved it, you will also if you are a true cinema fan."}, {"id": 48, "text": "A unique and thrilled film I ever seen. keeping the audience on the edge of their seats! The background scores, sound design, and the music just pump your adrenaline like never before! An exploration of the beast within man,"}, {"id": 49, "text": "Jallikatu deals with the human atrocities against themself in the form of catching a butcher buffalo which runs from slaughtering. Pillery simply moves the film with his terrific symbols of human behaviour through out the film. Watch this astounding gem from malayalam cinema👍"}, {"id": 50, "text": "Mindblowing movie with brilliant making and screenplay.Another Lijo jose pellisserry masterclass film after Rip and angamaly daires.LJP proves that he is one of best dierctors in India on recent times.The background music in movie used humans voices and the disturbing noices are really awesome.l believes that Lijo can make great films like this and hopes to bring Indian cinima to the level of international cinima."}, {"id": 51, "text": "Was it visually stunning? Yes. Were background score and sound amazing? Yes. Did I get the point it was supposed to make? I am not sure. I enjoyed the film but I don't know what it really wants convey. I am guessing it is about how we humans think of themselves as civilised and superior species but in reality we are no different than greedy, wild and beastly animals. Or something like that.P.S. there is bit too much shouting."}, {"id": 52, "text": "One of the best movies of India cinema, it's saddening to know most people in India only are unaware of this gem. I understand that most of the critically acclaimed movies are complex, layered and very deeply rooted which is mostly appreciated by people who are aware of the diff crafts of filmmaking. However this one is too simple that anyone will enjoy this they just have to sit for 90mins and experience the visual brilliance. Cinematography is mind-blowing, BGM top notch. Don't miss this, if this had been made in Bollywood people would've gone crazy for this."}, {"id": 53, "text": "Finally a good entry from India to the Oscars.This movie shows greed, barbaric nature of humans.Nothing has changed from Stone Age to now despite technology advancement.Human nature is still the same.This should win Oscar"}, {"id": 54, "text": "I watched this movie after hearing a lot of positive reviews and I was unmistakably, utterly, disappointed. I wanted to quit after the first fifteen minutes but assumed that I was prematurely judging the movie. Turns out I was wrong.This movie is a mix of poor acting and poor character development. I would even say that the only good acting was done by the buffalo, which, luckily, opened its mouth only to eat. The movie kept on repeating the same scenarios again and again, boring the hell out of the viewers. The director thinks that if the characters in a movie smokes, drinks and uses foul abusive language with each other, it somehow becomes a good movie.I wish I had listened to my guts and just walked out. But too late, alas."}, {"id": 55, "text": "Just go for the best theater you'll enjoy the technical feast like never before, I've noticed that sound was jumbled from one speaker to another speaker in clockwise and anticlockwise as well like this all over the theater sound designing was brilliant! I was amazed there was no strong plot or play yet so compelling! I'm pretty sure soon or later this dude LJP is gonna be one among greatest directors of all time! Master of chaos for a reason. Movie buffs don't miss this masterpiece!!"}, {"id": 56, "text": "Same dialogues, same repeated incidents and a crap story. This movie although technically brilliant was made only to show its technical brilliance and you will easily love it because of the same. It gives a wrong impression about the nature of humanity utilizing a story which has no logic provided that the film happens in a modern era of vehicles and mobile phones and other technology.Soul-less Film 👎"}, {"id": 57, "text": "I got excited for jallikattu the moment it's screening in TIFF. To watch this, I had to avoid war and joker. Finally got to see the film and it's a different experience. Ljp kept his name as a master of chaos with jallikattu. Girish gangadharan's dop masterfully captures the chaos especially the night sequences. With limited vfx the bull scenes were well captured. The sound mixing and Prasanth pillai's bgm brings a chill on your spine. Coming to performances, nobody had big roles but special mention goes to sabu and jaffer idukki who shines with their characters. The climax was unbelievable seeing everyone jumping on each other. On the whole jallikattu gives us a message that man is the biggest animal."}, {"id": 58, "text": "People of different temperaments have come up with many different issues and have integrated themselves into a single issue then finally brings out the animalistic nature of man....In reality, the human characters in the film are seen as animals.. Jallikattu give such an awesome experience in the theater... Compare to Pulimurugan, Cinematography, Sound effects &amp; Musics of Jallikettu far far better and realistic...Lijo your great Director, &amp; so as Gireesh Gangadharan, &amp; other crews your effort is not waste, you guys give a wonderful and unforgettable theater experience... all the best for the Team....."}, {"id": 59, "text": "The climax fire scene is similar like Beauty &amp; The Beast....Movie is so melodramatic and poor written...this is Just a bunch of copied scene just like Bahubali....Where is Jallikattu this movie Dont have even scene jallikattu sports ...Again A Garbage From South India......i dont know why this movies Characters are like psycho Normal dont do such stupid fights...."}, {"id": 60, "text": "Nothing is there to watch in this movie. Unnecessary noise n crowd. Not worth watching even once."}, {"id": 61, "text": "Too boring. Unnecessary background score in the name of creativity. Just liked couple of shots."}, {"id": 62, "text": "In simple words this is a failed movie. Only crackheads can create movies like this."}, {"id": 63, "text": "There is no subtlety. Things are exaggerated so much that the intended effect is lost. The message is pretty clear but the acting and dialogues are extremely poor. Almost every actor in here overly does their role. The minor actors are a pain to watch. It's like the director just went to the village location and cast some random guys from there. The dialogues are corny. The comedy falls flat. The unconventional background music doesn't help at all. Just because it's new music, doesn't mean it's good.There is some attempt at character development but it fails to keep the interest of the viewers alive for long.The last scenes were cringe worthy. It's like the director is saying, Hey, if you didn't get our allegorical message, here it is. They didn't have to do that. It must be the local flavour, description of food and some drinking which made this disaster look like a masterpiece to some guys. Just giving this one star to balance the score. Watchable if you are bored out of your mind."}, {"id": 64, "text": "This is one of the most idiotic movie I have seen in the recent times. People make anything in the name of art. May be the message was great but it was painful to sit through this movie. I could not relate to any character in the movie. Some stories going in parallel had no significance. I would not recommend this to anyone. Please save youself from wasting your time."}, {"id": 65, "text": "How such a bad taste, movie enter in oscar, showing cruality towards animal were is PETA organizations"}, {"id": 66, "text": "STAY AWAY SUCH A CRAPPY MOVIE...... HIGHLY OVERATED.... THIS HAS NOTHING TO OFFER JUST SOME STUPID CGI SCENES"}, {"id": 67, "text": "This film does not have any thrilled. I don't know which genre it should be called. But this film contains the real character of the real world people."}, {"id": 68, "text": "How can you Tamilans rate 1 star for this masterpiece movie just based on it's title, that too after getting nominated for oscars. I am sure that most of you guys haven't even watched the movie. No movie lovers can give a 1 star rating after seeing the cinematic brilliance showcased by the makers of this movie. Pls, this is a place for movie lovers and not for you narrow minded activists or socialists.I was going to give a rating of 8 but i am giving 10 because of you guys to balance out the damage."}, {"id": 69, "text": "Its a masterpiece by LJP a complete directors movie which leave u on ur edge of ur seats in theatre nd a path breaking movie in malayalam.Am sooooo soooo damn happy tat v got a stanley kubrick in malayalam movie.Full power to tis man LJP."}, {"id": 70, "text": "Obvious propaganda!same festival is celebrated in spain called Running of the bullseveryone enjoys it! it's a native culture. same directors and movie start will eat animals that too using halal method and chant 'we are protector of animals' lol music is lame. dialogues and acting are weak.i want refund. time to increase price of rice and bags"}, {"id": 71, "text": "I have seen this movie by looking at review, it's absolutely baseless movie. No story.. No meaning... Worst screenplay...it's BIG NOOOOOO man, don't waste your time."}, {"id": 72, "text": "Total art kind of movie with a one line story dragged for 90 mins. Not sure how it ended up with 7+ stars. Utter waste of time watching it. Avoid."}, {"id": 73, "text": "Very weak story. Over enthusiastic sound team managed to make the sound effects quickly turn from wow to annoying! A pointless movie."}, {"id": 74, "text": "This film should be named Eruma maadu not jallikattu And this is a senseless film"}, {"id": 75, "text": "Greetings. Name of Jallikattu not match with movie story. Jallikattu is a sports. It is a celebration of bull and human bravery. But in this movie they are hunting the buffalo for food. Both matters are controversial. That's why we are saying name not match with story.They used famous name of Jallikattu for their movie promotional. But they never think about contents."}, {"id": 76, "text": "Fake portraying of true Jallikaattu (Tamil culture)"}, {"id": 77, "text": "I regret not listening to my heart and quitting this torture midway. Spending a minute to even write a review about this, is to save others from this utter waste of time."}, {"id": 78, "text": "The best from the director. How to review this movie is quiet tough coz it's movie where everyone did their best and when you analyse it you'll get different interpretations of life. . From the script writers, cinematographer, music director, editor, actors and even the beast in it has acted perfect. If you're looking out for that usual entertaining movie I'm sorry, it isn't that usual line of movie. This is something entirely different in storytelling and by its story. The movie simply depicts that there is not any further miles to travel for a human to become a beast. . If you want to experience soemthing new. Go on. You won't regret watching it coz the movie guarantees something you have never experienced before."}, {"id": 79, "text": "Kerala only eat beef but not tamils, the total kerala suckers"}, {"id": 80, "text": "One of the most boring movies I have ever seen. In fact I loved the director's earlier works like Angamaly Diaries but this was simply horrible. Pointless story that goes nowhere from start to finish."}, {"id": 81, "text": "No story, pointless screenplay, and psychopath Characters...... Trash Of South Indian Movie."}, {"id": 82, "text": "They should not name this picture title to Jallikattu.. Because it's most tradition way celebrating in Tamilnadu.. Keeping that name as here title is not good.. I don't know how way the director has choosen that name.. Because no matching has found here on NAME JALLIKATTU With this movie.."}, {"id": 83, "text": "Stupid movie ,,,,don't compare this with Jallikattu game,in Jallikattu no one kill our bulls for flesh ,... It promotes killing animals aggressively."}, {"id": 84, "text": "Super Film Background score weird in starting Cinematography level 100"}, {"id": 85, "text": "Splendid film. Begins little slow and once the story picks up it is literally lit. The camera angles is beauty what a cinematography. Bgm gives the whole power to the movie. Climax alone deserve a awards and appreciation to the director Lijo Jose Pellissery."}, {"id": 86, "text": "Best art cinema of india indian jaws best director in india"}, {"id": 87, "text": "Recently watched this movie.Loved it.A great film with lots of technical brilliance.Jallikattu changes the view of Malayalam films .So far the greatest ljp film and the best Malayalam film."}, {"id": 88, "text": "You may or may not like it. But i can assure you, you will never see a movie like it. Technically brilliant, good acting and a nice theme."}, {"id": 89, "text": "There are some movies which will become hit because it delivers according to audience taste but Jalliketu is director's movie. It challenges audience to watch the movie on director perspective and understand the movie concept from his point of view. Story is simple, after all the evolution we are still animals.we think we are civilized people,Are we?If we are civilized people then why are we killing and looting ou own kind.This movie clearly shows us we can turn into animal within seconds,if we lose our thinking ability that may be due to anger, ego, greediness, lust,fame etc.There are several circumstances in this movie which shows us taking decision without any thinking. Technical aspects of movie is great."}, {"id": 90, "text": "It's not only a movie.... It's an experience.... Marvellous cinematic experience......."}, {"id": 91, "text": "Film potrays different sides of humans. A must watch"}, {"id": 92, "text": "Best Cinematography Best Storytelling Best Sound Designing Best Acting Best Direction Best Movie 100% Worth Watching 😍😘"}, {"id": 93, "text": "If you want to know what it truly means to be human in today's society watch this haunting yet brilliant work. Everything is a visual delight. To people who have issue with title. It has got nothing to do with it, the setting and the theme are different. Watch today's grim reality unravel in this cinematic masterpiece. Mr. Ray and Akira Kurosawa will be damn proud."}, {"id": 94, "text": "This one right here is a masterpiece. Cinematography editing. Soundv everything was brilliant"}, {"id": 95, "text": "Captured the Raw man and women! Excellent cinematography, amazing Score! One of the best Movies I have seen in a while. Artsy, theratrical yet approachable and relatable. Great work!"}, {"id": 96, "text": "Movie captures and depicts a realistic panorama of remote south Indian village, lives of it's dwellers in a superb non-linear manner. Movies of this kind is a tight slap on the face of bollywood. Though as the story progresses, it gets a little bit boring just after midway, but the last ten minutes compensates to that absolutely. Might be a troublesome watch to vegan people."}, {"id": 97, "text": "Jallikattu is a Tamil native sports where our cultered bulls are involved. The contents from the movie has nothing to do with the title. Could have named anything but the director wants to name this fictional story as jallikattu."}, {"id": 98, "text": "The movie doesn't match the title.. not even close.. I highly doubt the knowledge of the director on his understanding towards the title."}, {"id": 99, "text": "Change the movie title, this is so disgraceful and hurting tamil people culture and feelings"}, {"id": 100, "text": "Must watch Befor you die Great cinematography Lijo jose pelissery is genius"}, {"id": 101, "text": "One of the best movie I've ever seen. No cliche. Everyone must watch it in theaters to get the feel of the movie."}, {"id": 102, "text": "It is movie presented at its best . The portrayals of characters are done at the best . Director lijo jose have showed the real human not the human who acts in the world . Human is wild as any animal . We in our society always hide our emotions and violence but we are only getting frustrated on doing so . Why we have to behave good for others be ourselves show emotions be violent. Well we human being is a social being we know that .. still why we should hide all our emotions if i go on explaining it would become a spoiler for sure . This is the human i want to be but we are comforted by ethics laws these all just spoils the natures law. The fittest survives"}, {"id": 103, "text": "It scraps and points the misunderstanding of the human about our evolution. We are still in the stone age by our deeds."}, {"id": 104, "text": "Its all about animals and we are those animals .well directed ,camera work was awesome ,outstanding performance ,even a junior artist acted perfectly .MUST WATCH .S great salute to LJP......"}, {"id": 105, "text": "Malayalam movie is in a new way of expressing the story.. Each of the sound effect is mindblowing as well as the visuals. Taken to the next level of movie making other than cliche is a very hopeful thing for mallu audiance . The wholesome effect of the 90 minutes movie remembers of game of thrones series. The beast and a village will make audiance to run behind the buffaloe with the sound effects. The whole cast and crew, locations was more than awesome."}, {"id": 106, "text": "A thrilling,engaging movie Lijo Jose Pellishery.Simply shows the space between man and beast."}, {"id": 107, "text": "LJP filled the vacuum left by Kubrick in human behaviour.This film is indeed a piece in the puzzle Kubrick laid and I felt if this is added into the Space Odyssey, would have gelled well"}, {"id": 108, "text": "Jallikattu plays as an ultimate allegory representing the perpetually inculcated violence in the evolution of human race. It completely erases the boundaries which divide the so-called Civilised people and Animals. This transition takes place gradually, revealing the hypocrisy in developed (again so-called) lifestyle of people. Creating some moral paradoxes, the fable about the savageness lying within the civilisation questions the very progression in human life at all. The music makes Jallikattu what it is. The use of rock-age sounds connect the whole revealation and progression of characters. The irrelevant frames intruding in the narrative are all sub-textual. Jallikuttu, finally, explores the horrors of survival with great depth and idiosyncrasy."}, {"id": 109, "text": "The movie that exposed the despicable face of human being... Hope this movie will make us to think about it and change it"}, {"id": 110, "text": "This movie has got nothing to do with jallikattu. Some random  movie. Waste of my 1.5hrs of time."}, {"id": 111, "text": "Change the movie title - it has no way related with Tamil traditional jallikattu."}, {"id": 112, "text": "The name 'Jallikattu' stands for a game played in Tamil culture. But we Tamil people play this game just only to measure the potency of bulls and by doing this we can easily pass the potential genes to the next generation by selecting the bulls that won in the game for breeding and sending other bulls for agricultural purposes like ploughing, cart pulling etc.... In this game we never hurt or kill the bulls. In fact, Bulls were treated as a fellow human by Tamils. But this film titled 'jallikattu' is completely distorting the Tamils culture and heritage. No scenes in this film is showing the real 'jallikattu' .In fact, bulls were replaced by buffalos in this film. This film portraying Tamils as some brutal barbarians who kills bulls just for food. This film not only dishonours Tamils heritage but also the protest made by Tamil youths demanding to revoke the ban on 'jallikattu' in January 2017. This film and it's title are completely contradictory."}, {"id": 113, "text": "Waste of time, one of the worst movie in the recent time"}, {"id": 114, "text": "The culture of tamils has been humiliated....This is worst film I have ever seen Untill now."}, {"id": 115, "text": "Movie name should be mad buffaloes. Movie makers doesnot even know the meaning of jallikattu"}, {"id": 116, "text": "This movie should name as erumai madu there is no need whole village to catch a buffalo"}, {"id": 117, "text": "This movie confuses everyone jallikattu is not about killing animal it's a game between master n his pet"}, {"id": 118, "text": "The real Jallikattu is Tamil people's tradition to breed the animal to it's highest ability. But this movie picturing like barbarians hunting a buffalo to eat. This title is not appropriate for this movie. It's totally damaging the real meaning of Jallikattu. Buffalo would be the best title for this movie."}, {"id": 119, "text": "I think this director have some mental health issues"}, {"id": 120, "text": "Lying stories throughout the film. Historical distortions. The director has taken the film without collecting even a little bit of details."}, {"id": 121, "text": "Nothing related to jallikattu. Doesn't make sense . Lot of lies and grudge . Don't know why"}, {"id": 122, "text": "Waste movie worthless movie. Time waste, Ino logic in this film"}, {"id": 123, "text": "This film spoil the perception of tamil's traditional game jallikattu. Absolutely absurd title."}, {"id": 124, "text": "Fake info given in this movie...Prabakaran is a leader of LTTE &amp; in jallikattu no animals harmed..all are shown in movie r fake..."}, {"id": 125, "text": "Completly made up story plot. illogically written. is against reallity. inappropriate content in movie. aims defame to the prestigious jallikattu practised on the day of mattu pongal, the day we tamils dedicate for thanking the cows our age old partners from the ages of agricultural development till this moment ,almost one of our family members, the oxes and cows, for their priceless help they have provided us . its completely ironical while jallikattu is backed scientific reasons behind it and praises the greatness of the oxes and cows but this movie carrying its name potrays completely illogical and inhumane activities against them."}, {"id": 126, "text": "Visually good. Story isn't realistic, though length of the movie was only 94 minutes, I couldn't wait for it to end. Climax wasn't bad, but overall it was below average."}, {"id": 127, "text": "The movie is made with by a nut for the nuts. Wrong approach to the Tamils traditional custom. Director is paid by Peta to film against tamil's culture. Malayali brithers and sisters should learn to respect others especially Tamils."}, {"id": 128, "text": "The movie tells lie.. we tamils never did like this. They are trying to criticise tamils"}, {"id": 129, "text": "I watched this movie because of positive reviews but there's nothing in this movie. No story, They fight, They chase, They eat finally end. Totally time waste."}, {"id": 130, "text": "A movie that keep you on the edges ! Well directed and crafted . Must watch !"}, {"id": 131, "text": "Once again it is proved that man is the most disgusting and dangerous creature in this world. Comparing with humans the other creatures and wild animals are nothing just some poor beings wandering earth just for survival. Yet another 'proud to be a malayalee' movie. This is just a director brilliance stuff. Director tries to convey a wonderful message through a brilliant visual+sound experience. A great Indian movie released in 2019."}, {"id": 132, "text": "I'm happy that this movie is finally going for Oscars from India. At least we have a chance. This movie is pure art as you will enjoy the scenes and madness of whole village amazing background music."}, {"id": 133, "text": "Undoubtedly, a Masterpiece, it will catch you, till the very end of the movie, with a simple story...to world class level Cinematography, BGM, Direction, Acting, Screenplay.....can compare with any Hollywood movie ... One of the greatest indian movie , ever made..."}, {"id": 134, "text": "Lijo jose pelliserry pulled out an another brilliant movie in the form of jallikattu, a visual treat where he tries to convey the philosophy, absolutely brilliant"}, {"id": 135, "text": "Such a disgrace to Tollywood! Such a disgrace to Tollywood! Such a disgrace to Tollywood! Such a disgrace to Tollywood!"}, {"id": 136, "text": "It is a complete theatrical experience. Don't look in to racist comments which deliberately meant to degrade such cult classic in the name of film's title. I wish it would win academy award."}, {"id": 137, "text": "Associating the name Jallikattu with animal slaughter is misleading and gives the impression that the makers are deliberately trying to malign the festival of Jallikattu which has nothing to do with animal slaughter or parading animals to kill."}, {"id": 138, "text": "The movie is good if you don't know the backdrop around which it is set. For an indie movie (something which is first of its kind in India) the cinematography, plot and acting looks fine behind a rustic setting. However, since the movie sends out certain message(s) and links up to the actual Tamil Nadu (TN) festival of Jallikattu, one can raise eyebrows about a no. of issues.Firstly, associating the name Jallikattu with animal slaughter is misleading and gives the impression that the makers are deliberately trying to malign the TN festival of Jallikattu which has nothing to do with animal slaughter or parading animals to kill them eventually for meat. This is negative stereotyping of local Indian culture which is unexpected from the makers who happens to hail from South India.Secondly, the movie is centered around the theme of chasing a buffalo for meat which sends the signal that people in Kerala (Indian state where the story unfolds in the movie) are voracious meat-eaters and reduces their eating habits to exclusive meat-eating. It appears from the movie that Keralites are only worried about what to eat during the entire day and are everyday just planning for that from morning to evening, which is of course not the reality. Again, this appears to be an insidious attack on local culture under the pretext of cinematic liberty and creative thinking.Lastly, the exaggerated display of violence and peoples' obsession for killing the buffalo, especially towards the end, reaches a disproportionate amount and doesn't fit into the setting of this movie and it gives the impression that this theme is forced into the movie. The end feels like an anti-climax instead of climax and fails to deliver the message that there is a devil lurking inside every man in a cinematic way.The above POV in watching the movie is important as it displays indigenous culture, which warrants some responsible movie-making which the makers conspicuously fail to deliver. This view becomes more important as the movie is India's entry into this year's Oscar and no Indian will ever want to negatively portray their society that brings bad name for our culture in world arena."}, {"id": 139, "text": "Jallikattu has an interesting theme, is somewhat realistic and reasonably written, and some of its technical aspects like cinematography are praiseworthy. But why didn't the director find better actors among the 30 million+ Malayalam speakers? Most actors come across as first-time amateurs who haven't stepped into an acting studio even once. Some of these actors seem to think that over-the-top shouting and histrionics is what makes actors good. And what's with not using sync sound in the 21st century? I bet among all the films that have been submitted for Oscar consideration this year, Jallikkattu is the only film that doesn't use sync sound. A combination of bad actors with dubbed dialogues makes this film come off as an amateurish effort despite its highbrow themes and ambitions."}, {"id": 140, "text": "You all know that The Jallikattu (Tamil pride sport) protest had a huge impact worldwide.To darken it, a corporates who wanted to destroy the country's cattle did many work .This movie is one of that.The scene is set as the savages brutally bully the buffalo and named this movie as jallikattu.People who watch this movie from abroad will be subjected to the misconception that this is the game of jallikattu.There are many great movies in Malayalam cinema.But Malayalee brothers and sisters need to understand the politics behind this film being nominated for an Oscar.I consider this film to be a funded by corporates.oskar will always be given to a film that denigrates Indian culture eg.slumdog millionaire. So, I strongly condemn this movie."}, {"id": 141, "text": "Without any factual evidence, this movie is an epitome of hatred towards Tamils ancient practice by their ethnic rivals. The whole world knows how Tamils made such a valiant struggle against their centuries old Devine practice of playing and embracing their best companions, the bulls who are nonetheless their saviors of organic agricultural practice for centuries. This movie is a spam and nothing more than that. Resentful!"}, {"id": 142, "text": "Don't spoil the name of jallikattu.... U corporate agent(director)"}, {"id": 143, "text": "Rated 5 stars only for cinematography;Only good thing about this movie.All other things are confusing,exaggerating.One gonna stick(because this movie has this ability to get a hold on audience) to this movie till last minute but at last you going to get nothing!.Movie failed to portray its message.They tried to make intense movie,but they failed!,by doing some absurd things(like unnecessary background music, unnecessary nature shots like capturing insects,creatures)they did it over! That's all!"}, {"id": 144, "text": "Jallikattu relies heavily on visuals and sound. The plotline seems great at first and in the hands of a master director, would have turned out exceptionally brilliant. The film isn't 'bad' but it's nothing great either. Loud music, loud villagers, random references (Naxalism, women's rights etc) sometimes make you feel confused. The character building is minimal as the film focusses mostly on a herd of people rather than individuals. I felt the sound could have been different. The sound design focused on creating animal like grunts, hoots etc and at times felt out of place, making you wonder why was it all necessary. Nevertheless, it's not a great film but if you have 90mins to kill, you can go ahead and watch it and post your own review here."}, {"id": 145, "text": "This movie is a masterpiece! It shows the human nature and the wild within it."}, {"id": 146, "text": "Looking at the reviews, I expected a wonderful movie. Though I like slow moving plot oriented movie, this movie didn't meet expectations. The director wanted to project wilderness of inner-self of men, but the way it was showed is idiotic &amp; incomprehensible. The way characters lost their intelligence in the last 20 minutes is unrealistic and pure stupidity. Camera work, low light capturing &amp; cinematography are to be lauded."}, {"id": 147, "text": "Excellent direction and camera and deserves 10/10 for the making.The shots with the buffalo were excellent and realistic.There are some moments of comedy.Story is weak and acting is also not that great.Unnecessary violence was shown throughout the movie and didn't felt realistic.Final Score - 6.5/10. With a realistic story, it would have been a masterpiece."}, {"id": 148, "text": "Never! I said never saw a movie with this intensity and it all in the 90 mins. With a simple plot Lijo Jose showed raw and dark emotions of being human and it has been captured on the camera with atmost sincerity. While watching it was so raw intense and real that I awe struck to the whole team of Jallikattu. Its visuals are surely a mesmerizing things to watch. I never expected a simple plot like this can be expressed in a way that it will capture attention of whole 90 minutes. Its background score was surely on par with the visuals and I am damn sure it will show audience for what they expected. I don't know how to express but while watching, it made me feel like I was one of them running with them towards it. Thanks&amp;BeHappy"}, {"id": 149, "text": "This movie is a well choreographed Chaos. Layered messages. Who's the real beast here buffalo or human. Did we really evolved? Don't miss it."}, {"id": 150, "text": "Jallikattu is director Lijo Jose Pellissery going berserk with his artistic arsenal, backed by the license to go for the ultimate, which he has earned over years of gutsy film making. Even in all those chaos, he is still the one in control. It's a raw and original portrait of the civilized barbarians that we are. They may move around on two legs but are beasts, says an elderly character. The astounding cinematography by Girish Gangadharan forms the flesh and blood of the film. The unconventionally brilliant background score by Prashant Pillai and the terrific sound design by Renganaath Ravee adds considerably to this outstanding movie-watching experience. This is a treat for cinema lovers and should be experienced ideally at a cinema hall than on any other platforms, not just for the best possible experience but also because it is the ultimate way of respecting the passion and efforts that go into the creation of such priceless contributions to cinema."}, {"id": 151, "text": "First thing u probably notice about this film is its cinematography which i thought was stunning. Sadly that's all there is. You get tired and bored as the film goes on. It doesn't really move. Just repititively shows people running around chasing a buffalo as though they are hunting down Godzilla. I checked this movie out only because it was chosen as entry for Oscars this year from india in best international film category. Totally disappointed."}, {"id": 152, "text": "The film has pointed out a social issues which is not been discussed or familiarised in the society to resolve the problem. Special thanks to Mr. Lijo Jose Pellissery &amp; the crew who made a movie which is a moral to the society that we need to discuss this so that we will be a complete Human. Don't expect a mass Entertainer because the movie itself made a signature in Visualisation &amp; Audio Effects which can only be experienced in Theatres. For a mass story based viewers this won't be a wise choice but the Film need an appreciation for the Hardwork they made to familiarise the topic to the current society. So enjoy the Play .."}, {"id": 153, "text": "Camerawork is excellent and idea is funny but it seem story is developed to help director &amp; other technician can show their skill. As Bombayite or urban indian could not relate to overall behaviour of characters."}, {"id": 154, "text": "Intense movie about indian villagers chasing an escape buffalo for 1hr 30. A representation of a chaotic indian society perhaps. Good sound effects and interesting camera work. The film is chaotic, probably deliberately. Strangely it was uncomfortably loud, at times painfully. Im not sure if this was a cinema choice or intended to be like this for effect."}, {"id": 155, "text": "When someone is highly devoted to Filmmaking and put their heart, soul and blood to tell a story, they deliver a spell bounding movie like 'JALLIKATTU' From Terrific cinematography to Razer sharp editing, from the lead actors to Junior artists, every single person should be highly appreciated for their tremendous contribution for this unbelievable film.."}, {"id": 156, "text": "Since nominated for Oscar, I thought to watch it once and for the first half I was so bored and thinking what was so good about the movie that it went for Oscar but finally the climax had it all, it leaves you spellbound..The last 10 min of the movie tells you so much about the movie and the the lesson it gives, worth a watch!"}, {"id": 157, "text": "There is no good story. Whatever the message it is good or bad. Message is good that human is very bad than animals and humans are bloody giants itself !!! But so much violence in this movie, I can't tolerate this much violence, just disappointing 😣 and frustrating !!! Respect for director sir and Dop they created awesome visuals and frames ! But it doesn't make sense much because this movie can give bad effects to us !"}, {"id": 158, "text": "For all the hype and the accolades from TIFF , the movie fell flat on its face , for me at least. After AD and E M Y i was expecting the moon from LJP. No matter how much i tried i couldn't connect with the movie and ended up as a chaotic exercise by rednecks trying to wrangle a beast on run..on a very limited budget.Tried to find the allegory, tried the PoV angle of the beast , tried the political analysis..result was the same. Some striking visuals , rousing background score.. that's it..LJP is missing"}, {"id": 159, "text": "By the trailor, I assume the movie is all about domination, power, hunger (meat and sex)...It resembles the great human migration... how human ancestors walked out of Africa and dominated Planet Earth...Though we have evolved, we all have that beast still inside us 'cause Sapiens are just another Animal from the Animal Kingdom...Like the trailer say, it's probably human flesh, the tastiest among all..."}, {"id": 160, "text": "Here I don't want to elaborate the plot of this movie scene by scene as it is not worth for it. First of all who has given the rights to the makers of this movie to use the word Jallikattu. The word is a Tamil word which has been given to a cultural sport which has been thriving since many eons. When the Indian government banned the sport from being celebrated on harvest festival Tamils protested and won against the ban imposed the sport. Unexplainable further. The movie is just taken to assasinate the very meaning of the word Jallikattu. There is no relationship between the sport Jallikattu a celebration of Tamil and to this movie's title and the story it depicts. The movies title must be revoked. The movie makers must be striped off from using this exclusive Tamil word."}, {"id": 161, "text": "Name only Jallikattu ... Otherwise This movie has nothing to do with Jallikkattu Planned conspiracy to discredit Jallikkattu"}, {"id": 162, "text": "In the whole movie they only show hate about our culture. I am confuse why they use jallikattu as a title where there is no conection in title and movie. They insult our culture😠😡"}, {"id": 163, "text": "This movie story nowhere related to the actual jallikattu. But i don't know why they have kept?"}, {"id": 164, "text": "This movie is about capturing a bull which was escaped from the butcher shop. But it has nothing to do with India's Traditional Game #Jallikattu Hope it wasn't made to create bad name for a traditional sports. Because this movie shows more Cruelty to that escaped bull. They might have named it as Jallikkattu to reach more audiences. Because, There was a big protest happened to protect the traditional sports from organization like PETA. They did campaign against Jallikkattu to ban it."}, {"id": 165, "text": "This movie is made to show the sport (practice) Jallikattu in bad light.. The team wants to show Tamil people as barbarians(like shown in the movie) Mallu's specially mallu men always have a inferiority complex with the Tamils, that's clearly shown by the director in this movie.. These people are disgrace for the society., Bloody leeches."}, {"id": 166, "text": "The director of this movie doesnt know what is jallikattu and this movie misguide tamil community jallikattu. how does these kind of movie get nominate for oscar."}, {"id": 167, "text": "Disgusting, director doesn't know anything about Jallikattu. Purposely insulting Thamizh people and their culture. You should focus on directing your own cultural movies. Shouldn't poke others nose. Idiotic idiot what do you know about Prabakaran? Don't imagine and make up your own or your cultural stories and title them as Thamizh (culture) name. I am very disgusted and disappointed by your creation."}, {"id": 168, "text": "Jallikattu name is spoiled by malayali buffalo director. This is not tamil Jallikattu totally different. worst movie of not only Malayalam industry all over the world."}, {"id": 169, "text": "This movie has nothing to do with Jalikattu. This is more of a antihindu propaganda.Premise: As idiotic as it gets, 1000 people of a village in Kerala assemble to kill a wild buffalo to feast on it. No logic. That's it....just too much senseless noice and frequent cuts...and 60% of the movie dialogue and imagery comprises of beef cutting scenes, blood and mindless exaggeration of idiocy. Don't know how dumb people can be to give this C grade cartoon cinema 9 or 10. The only saving grace is sound design....but story and direction are a complete disaster.BETTER AVOID THIS TO PRESERVE YOUR SANITY."}, {"id": 170, "text": "It has no links with festival name Jallikatt. Basically Tamil people got hrt with the Title and its story which is not reflects all the elements of festival Jalikattu"}, {"id": 171, "text": "This movie has no with tamil culture and festival still named jallikattu Worst part is that this is India's Oscar entry lol These filmakar are proving itself who pathetic movie india make"}, {"id": 172, "text": "What on earth whole village is doing is running behind a buffalo. I mean another level of crap just to insult Hindus .. Nothing to do with Jallikattu.The director and producers are product of Christian missionaries.. so what do we expect"}, {"id": 173, "text": "It is shown as malayalians worst understanding of tamilans jallikattu.It is not animal cruelty."}, {"id": 174, "text": "Honesty i am so disturbed by the animal cruelty shown in this pathetic, irrelevant movie. A movie must give out a positive message in any way, and not influence audience to do cruelty on animals. A buffelo is a sacred animal in my personal view but am deeply disturbed by absolute inhumanity presented. No compassion, no humanity at all... I am also amused how audience are just going by its technical brilliance. A movie must be judged by its story and it's ability to connect with humans. Just 1 point for human Pyramid in last scene."}, {"id": 175, "text": "This movie is made only to defame the real jallikattu of tamil people by the corporates. There is no story and reality in this movie"}, {"id": 176, "text": "Pretty unrealistic movie's plot, not enough convincing...two experienced butchers are enough to catch that buffalo. In reality it easier to catch an elephant. Moreover, the production should select a bigger sized buffalo. Even the size of the village's people is bigger than that buffalo!"}, {"id": 177, "text": "The makers should know the basic difference between Bull &amp; Buffalos. Insulting others community in any form is unacceptable."}, {"id": 178, "text": "Title of this movie is irrelevant to the movie. Jallikattu is Tamil tradition which is just hugging the bull with bare hands but in this movie they portrayed it as some barbaric rude killing of bulls. This hurts the sentiment of entire Tamil community!!!!!! To the worst, this movie is also nominated for OSCAR which it doesn't deserve."}, {"id": 179, "text": "Full of lies and hatred mind of director shown very very low level thoughts of film maker. Worst behaviour of goons."}, {"id": 180, "text": "👡👞👠👢😠😡We Tamils trash you &amp; warning Lijo Jose Pellissery &amp; crew Bastrads for Degrading our Cultural Identity 🖕"}, {"id": 181, "text": "One animal killed by a village director make it wrongly very worst movie by Malayalam industry's"}, {"id": 182, "text": "A piece of trash made by some mad malayali director with no sense or basic idea about the real Jallikattu . The film is titled as 'Jallikattu' which means Tamil Traditional and Cultural sport, but the director explains about buffalos and barbaric butchers of kerala hunger for meat that has nothing to do with the Real Jallikattu. Still confused why such a worthless concept is funded to make into a film and wonder who are those knucle-heads recommended it to the oscar nomination."}, {"id": 183, "text": "Story is no way related to the movie title Jallikattu and this title is completely misleading to attract audience. Nothing in this movie apart from the title. Worst ever malayalam I seen ever."}, {"id": 184, "text": "This targets an old tradition of 3000 years. Full of False information.Movie is a big lie built upon many lies."}, {"id": 185, "text": "Disrespect Tamil's cultural Jallikattu and Tamils protest for Jallikattu"}, {"id": 186, "text": "This story is not worthy for title.. insulting tamil people and culture.. director please ask us ...what is jallikattu.. don't dream like this.."}, {"id": 187, "text": "Jallikattu is a Traditional event conducted in Tamilnadu, its seen as a Sport between a Bull and the Human, But the movie is showing the struggle between a buffalo and the butcher. The Title and the story is trying to spoil the name and belief of the people in Tamilnadu and portraying different meaning to the Event called Jallikattu.Jallikattu is conducted for some purpose, not for the Meat. As a Tamilan I have to tell this, the Movie is purposefully taken to defame the Tradition and belief of the Tamil People."}, {"id": 188, "text": "I Wont Recommend anyone , who wants to know about Tamil Tradition Jallikattu.Purposely using the name jallikattu is unnecessary as the movie is showing about hunting a 🐃 buffalo which has no connection with jallikattu. Jallikattu is a remembering tradition of domestication of cows.its respecting cows. Not killing one.. Tamils consider cows and buffaloes as sacred animals and they won't eat them. So this movie is wrongly portraying a tradition. It's filled with racial hate."}, {"id": 189, "text": "Thr s no relation between the title and the story. Discriminate other's culture."}, {"id": 190, "text": "This movie Mis leading the concept of actual jallikattu followed by tamil people, i appreciate the making but not by hurting others soulful traditional event."}, {"id": 191, "text": "Director tries to show the wildness of the humans but he took the wrong ideaology and failed it.concept of the plot was absurd and laughable.Overacting and absolute boring chasing scenes.cinematography was exceptional &amp; definitely not worthy for Oscar."}, {"id": 192, "text": "The movie in short shows the nature of man( not the good side ). The editing and sound effects were the only thing that kept me from not leaving the movie halfway. Towards the end you can understand why they dragged it so much."}, {"id": 193, "text": "Realistic. Natural. Good acting. Other than that, I was waiting for the movie to Kik start in the beginning &amp; then I waited to soon end.Realistic but u need to have a story. This is not at all a story."}, {"id": 194, "text": "This is my 1st ever Malayalam Movie, which I watched under recommendations of Tried And Refuse Production (An YouTube Channel). I would like to say I've got an incredible Cinematic Experience with it.. Although I don't know Malayalam language yet the English subtitles helped me to understand the conversation between some cruel animals (humans) in this entire movie... It's a True Example of Human Barbarism on Innocent Animals!/Bejubaan Jaanbar! Now after watching this film you can simply decide who's the Real animal here in this world!"}, {"id": 195, "text": "Very scary dark side of Humans shown. Nicely depicted."}, {"id": 196, "text": "Watching this movie, this looks a very tough movie to shoot with such a huge crowd and create the horror at the same time. This movie is like a dream for any director.The background music creates horror but still wasn't relevant at the same time.This movie gives a strong message with people chasing a bull which is metaphor for money for possession or anything a large people chase. The last scene clearly potrays that actually man is the animal and we haven't evolved yet. This movie also gives a message of 'coexistence' with the nature and how creating a dominance will result nothing but bloodshed."}, {"id": 197, "text": "I saw a Malayalam movie - JallikattuJallikattu.jpg It is directed by Lijo Jose Pallissery. Last year I had seen his another movie Angamaly Diaries, and could not sit through it - because it kept on showing graphic violence of mutton, chicken, meat, beaf cutting and hanging scenes. It was too much for my weak heart.This movie Jallikattu is based on a short story Maoist written by Malayalam Sahitya Academy Award winning author S.Hareesh - from the book Adam -collection of 8 short stories.It was in 2016, Lijo read the story Maoist and met Hareesh with the idea of making a movie.The story is about a capitalist butcher in a small village who serves the rich with best cut of buffalo with envy of other villagers. A newly purchased buffalo runs away and creates havoc in villagers life, who chase to kill him, whereas the butcher wants to catch and save the buffalo for his shop. The one night story and incident brings out the worst of people, in their frenzy in chasing, catching and killing the buffalo - so much so that internal animosity and politics comes into play between different village groups.The original story had two buffaloes but for the movie only one buffalo is used. The screenplay story was developed by S.Hareesh along with R.Jayakumar. The movie was shot in 38 days at night in rubber plantation of Nilgiri forests, with an assembled cast of more than 200 villagers and a budget of INR 40 million.The basic theme of the movie is how human beings becomes beast, worse than an animal.It seems that Lijo made deliberate attempt to make all the ticks on things people may object to - like: showing violation of human rights, animal rights (brutally killing of buffalo, graphic detail of culling chicken by twisting neck and putting in boiling water), women's rights (though only one scene where a girl is forcibly and fiercely kissed on lips), environmental rights (trees are cut, forest is set on fire), plus graphic and violent scenes of cutting mutton, beaf and chicken, and men running with weapons in a mob frenzy to kill each other. mobs torching police jeep on fire etc. etc.Some people have talked of what is the intent to make such a movie - and the intent is clear - to show how human beings are beasts worse than animals.The movie is to rub wrongly to everyone who stands for something or the other. The story, the landscape and the setting gives Lijo liberty and cinematic freedom to depict rural village mob frenzy - shown in ultra exaggerated way just to convey a point across.Does Lijo succeed? Yes, he does to a great extend, by superb camera work and amazing shots.This movie is not for the faint-heart and ends in a grim reminder to our times - where the author of the short story S.Hareesh says something likeThose who live a life of optimism today Have internalized corruption &amp; aggressiveness Into a rationalized sense of impotence They are the real pessimist of doomed futureSpecial mention of breathtaking beautifully cinematography by Gireesh GangadharanThe movie does make a mark of its own with unique story telling.I would go with 7.5 out of 10"}, {"id": 198, "text": "The caveman and us are just separated by the time frame. It doesn't take much time for us to become like them, mentality wise."}, {"id": 199, "text": "Well the plot seems Ridiculous a buffalo causing all those havocBut it's the Filmmaking, that is like u never seen in any indian film,The cinematography is so good, they way the camera moves fast in such uneven places is stunning,And the way pellissery pulled this off with numerous members on screen together it's really breathtaking."}, {"id": 200, "text": "Stunningly photographed, Jallikuttu is all about a Buffalo gone berserk and the beast in the humans who chaise the wild animal. The earlier half of the film suffers from too many jump cuts and looks too jumbled to make out who is who and who is doing what. Extremely loud and noisy chasers of the animal leaves one waiting for some quiet moments which of course comes only when the curtain drops. Still, a film for the art scene."}, {"id": 201, "text": "Love the realism, not the constant screaming men.Intro showed the personality of this village. Acting was great.The flashback of the character wasn't very clear, couldn't tell it was it was a flashback. Also Gaur buffalo which is an Indian bison suites the rage and power for this movie not the anorexic cow looking buffalo they had in here."}, {"id": 202, "text": "Just a different type of movie. Good to watch. Good to see movies coming up with unique subjects in Malayalam"}, {"id": 203, "text": "Sad to see people in rural area are still barbarians. They are less organized when compared to animals. Sad state of rural Kerala is portrayed excellently by Director &amp; cinematographer. Try to explore more such reality in Kerala &amp; its people.. Good portrayal of how a humans should not live is the essence of the movie...Keep exploring reality adventures in Kerala."}, {"id": 204, "text": "LJP shows us the untamable beast within us which can be unleashed at any time given chance. The bull was the real hero never trying to give up till the end, when it realised it needs to end here it surrendered to redneck savages."}, {"id": 205, "text": "Even if i can't understand their language, but, i downloaded the movie after looking its rating and reviews. When i watched the movie it was not worth its rating. Spolers Ahead: In the movie they've overly showed the tension in a village when just one buffalo runs off. Everything was just more than need. Whole Village &amp; Police is looking for just a cow."}, {"id": 206, "text": "This is a 'ROMA' type movie. No storyline or character development. This is a visual experience.Not upto 'Ee Ma yau'. But one time watchable.It's mor artistic and have internal meaning that we human are still at the lvl of early man mentally."}, {"id": 207, "text": "Visuals and night camera work and the how people ar becoming in one moment it's too wild music and the ending of the movie it's tooo crippy but if they will think big means it will be good unique movie"}, {"id": 208, "text": "I don't know how to begin describing Jallikattu (English: a traditional game involving violent bulls), a visceral and technically brilliant take on barbarism where an entire village goes on the prowl to hunt a bull that went rogue from a three-man slaughtershed hours before it was about to be served to 30 guests at an engagement party and wreaks havoc before being confronted by the insidious, brutal effect that humans have on those below it in the food chain that has been told in the most unique way possible with a soundtrack containing haunting a capella howls, masterful long shots of people moving as hunters, and the good old cocky version of the Malayalam language, so I will instead use a single word: grandiose. TN.Alert: Jallikattu has multiple scenes involving animal slaughter and therefore may not be suitable for those who identify as vegetarians or vegans."}, {"id": 209, "text": "A fantastic must watch movie. It tells on the dark side of humans. Where human are chasing behind a wild buffalo which was supposed to be slaughtered by a local meat seller but it escapes.climax part portrayed well Which may not be liked by everyone"}, {"id": 210, "text": "The movie is a realistic one as it is that type of movie,dont go and watch this one for your entertainment.The movie focuses on man and animal in this we cant understand which is man and which is animal.Go for it if you are a realistic movie lover otherwise drop it."}, {"id": 211, "text": "Highly extreme and energetic movie. Awsome visuals and sound effects, real life framed on its extreme level. Not a movie for the people who likes casual movies.. If you are a real movie lover, its a must watch movie."}, {"id": 212, "text": "This is not the Tamil Jallikattu, but a whole different kind of sport - one of savage masculine behaviour inflicted upon a single animal, which makes for disturbing viewing.This is the way I look at this film:'Jallikattu' is an allegorical tale of mankind's eternal struggle to subdue Nature. However it is not possible to control Nature, and when she runs riot, the result is mayhem. In their eagerness to control and consume the beast, the menfolk of the village are themselves reduced to a primal state of savagery symbolized by the human mound that engulfs the buffalo in the end.Are the villagers eating buffalo meat (which I believe is called buff or carabeef) due to the ban on beef? This is not apparent from watching the film, or perhaps I am missing something.That the villagers love meat in their daily diet is established when they incongruously hang their morning meat purchase to a tree before entering the place of worship. When the buffalo runs amok, the villagers' reaction is sharp, which is reflected in their over-the-top acting, and a farcical chase across the village and the forest.Therefore I also see this as a commentary against non-vegetarianism wherein a free-spirited buffalo refuses to be reduced to becoming somebody's meal, and decides to take its fate in its own hands - or hooves, in this case.Either way, in the end, the men appear beastlier and ghastlier than the beast itself.This is a short film that moves at a rapid pace, thanks to the crisp editing and great sound effects.Not easily 'digestible' by all."}, {"id": 213, "text": "9/10Plot: A buffalo escapes from a butcher and all the villagers band together to hunt it.I liked the trailer. Though the film turned out to be different than what I expected from the trailer. I still liked the film. I was hooked from the first scene, I did not know what was going on or how it will turn out but the making is so good that I was glued to my seat. The cinematography is out of this world. The editor has done an amazing job. The film just flows. The pacing is perfect. The background music is oddly perfect. The atmosphere created by the film maker sucked me in. It is an extremely rewarding experience. My heart beat raised in some scenes as if I was there. The rawness is sometime hard to watch.There seems to be a meaning behind the film which I did not quite get. The beast nature of human is pointed out but there are few things that is still making me ponder. I liked the film just fine without getting too deep into the meaning behind it. I don't think I have seen a film like this before. It is an innovative, beautiful, raw, thrilling and thought provoking film."}, {"id": 214, "text": "Lijo Jose Pellissery directed Jallikattu is a splendid movie. It will leave you spellbound. Credit goes to the director and the cameraman. Gireesh Ganagadharan. 🙏🙏🙏 Anthony verghese, Sabumon and Chemban Vinod were outstanding with their acting . Background score by Prashant Pillai was amazing .They largely used acapella-based background score. UFfff😍😍🙏🙏🙏 This movie is insane and well choreographed chaos. What happens if a buffalo who was bought to slaughter runs and creates a chaotic situation in a village in Iddukki. It creates lot of confusion ,havoc ,violence etc. The entire village close to 100 -200 men go out day and night to catch the buffalo and at the end become an animal and starts fighting with each other. The climax is so nicely shot, Hatts off to the director and the cameraman. It's a must watch movie. You have to experience this in theatres especially for the cinematography and music..This movie will stand out for its technical brilliance and I am sure it has taken mollywood movies to a different level.. #oscarcalling."}, {"id": 215, "text": "I am always gave a special attention to some of the filmmaker's new updates all among the country and abroad, and Lijo Jose Pellissery is one among them. I am always keen about to know about everything that associate with their new outcomes. When I heard about Lijo's next movie will deal with a buffalo and initially titled as Pothu, I smelled something epic is going to happen. Then the first look and all others came on the way, it then changed its title as Jallikkattu. After its premier in the prestigious TIFF, I marked in my mind that I am gonna it early on its release here in Kerala. I got that and experienced it. And stunned. Lijo, once again deliberately invites us our attention to a big fantastic product. So simply in my way, Jallikkattu is an extraordinary film. I like it in all the way. Lots of goodness in the film (not in the sense of subject but in way of delivering it). I like the haunting music, that he always prefer Prashant Pillai's composition and DOP from his Agamaly companion Girish Gangadharan. All these factors add that brilliant odor to the film. I love the film and wondered about it. I suggest you to experience it in theatres near to you."}, {"id": 216, "text": "Cinema is a business. So, the mainstream follows the rules - invest, gather a professional technical crew, get bankable and saleable stars, make them entertain the audience and, in the process, ensure that a story, albeit old and hackneyed, is told to the satisfaction of the spectators. A cardinal rule remains not to be violated - Never, ever, disgust the audience or make them uncomfortable. In an interview, one of his many PR exercises, Hindi film superstar Shahrukh Khan told that he is bound by the song and dance routine of the industry as the audience expects him to do it. In the same interview, a few sentences down the line, he said that streaming services provide opportunity to the filmmakers to let go of all the constrains and expectations and be free to make the kind of films they wish to make. OF course, he was promoting Netflix, but somewhere, sitting next to Brad Pitt, he seemed embarrassed to have tried not hard enough to be a memorable part of the world cinema. Jallikattu, a Malayalam film that made its online debut in Amazon Prime, is in that league of Indian films which do not hesitate to make its audience cringe and yet, be at the edge of his seat throughout its 94 minutes. It is a masculine film with no pretext or apology. It's so acutely masculine that it is almost primordial in its depiction of greed, lust, anger and acute apathy. From the opening sequence, in which exaggerated sound of a clock ticking introduces the characters in a close-up, till the last where the hunting masses are shown to have turned Neandarthal, the movie doesn't let you take your eyes off the screen. The close-up visuals of meat being sliced and the satisfaction of the customers forming a queue to buy their share is debilitating. It is a film that after a very long got me mesmerized, as if the storyteller is making me angry, happy or even laugh at his choice. It is a film in which I went back to the credits and found the names who have done Sound, not only the music, and Cinematography (Music: Prashant Pillai, Sound: a bunch of gifted technicians, Cinematography: Gireesh and Gangadharan). It is a film where the credits start with the name of the storywriter (S Hareesh, who has partnered the screenplay as well). It is a film that is apparently about a buffalo running amok in a remote village and the villagers trying to catch it (Hence, Jallikattu, the Tamil tradition in controversy some time back), but juxtaposes with minimal effort and maximum élan unravelling of layers of trained civility that contain humans. It ends with the unnerving show of what happens with those layers have been peeled off. The lead actors (Anthony, Chemban, Sabumon, Santhy) look and act too real to be called actors. But the captain (Director: Lijo Jose Pellissery) ensures that even his tenth and eleventh players are match-winners. The shopkeeper who writes the letter for Paul, Paul himself in the aftermath of his herbal garden being ravaged by the buffalo and the chasing men, the drunk, old man who points out that the beasts often have two feet and not four - one can say that there are no side characters in this film. They are all central. The buffalo's rage is breathtaking and its chase, for the humans and by the humans, leave scars on the audience's complacent sensibility. The scenes are quite gripping and realistic, and one struggles to comprehend the calmness with which the team might have approached the film-making, especially when the disclaimer says, 'No animals were harmed'. Overall, to feel proud and get high on India cinema, please watch more and more of the so-called regional, off-beat ones. That's where the pearls are formed under pressing layers of mainstream mediocrity."}, {"id": 217, "text": "Jallikattu Malayalam movie. Lijo Jose Pallisserry, as a director, has highlighted his credentials in 'Ameen, Ankamaly diaries, Ee. Ma. Yu'. Even the pace of these movies differ, so did the themes. This movie is the screenplay adaption of the book 'Maoist' by late Hareesh.This presentation is all about a small high range village and it's simpletons. The chaos starts as a buffalo escapes from the butcher house of 'Kaalan Varkey'- the butcher and his assistant Antony. The whole village gets involved as the escapee destroys crops and damages properties. Then follows the confusion and frenzy scenes ... leading to the inevitable climax.Each and every character has be measured to perfection and pasted on the presentation by the director. As the chaos starts, audience is introduced to every character in depth and the symbolisation begins. The unity during commotions and the diversification in the name of 'petty sects' is the projection from the community itself. Every character has their own egoistic self interest, to be worked out during the time of confusion.The 'beat' of the presentation is established in the opening shots of the movie itself. That keeps the audience, on the edge of their seats, through the tense moments. Camera work is superb, taking the audience into the depths of the movie. 'Mission impossible, Sahoo' are movies made to thrill us, with car chases and action sequences... Here, similar thrill is presented with the buffalo loose in the village... Action sequences and chases are vividly exposed by the observant camera work.9.5 on 10 for this 'Bull in a China shop'The theme represents the society and it's chaotic life. The characters lose their human nature, bringing out the beast in themselves. Hats off to the director for this chaotic extravaganza, managing his team and battalion of villagers, to give the audience a spell-binding thriller. Audience will be anxious, throughout the 130 minutes of story telling. Blink your eyes, you miss a lot, here... Watch out.. the BUFFALO is aiming for you."}, {"id": 218, "text": "Jallikattu movie reviewThe plot follows a bull that escapes from a slaughterhouse in a hilly remote village and the entire village men gathering to hunt down the animal. The movie is simple yet massive. Opening scenes gives an introduction to the village, its people and their lives in a 10 minutes brilliantly edited sequence that also introduces the world of animals. An entire village on a run to catch the escaped buffalo and true faces of the people are shockingly revealed. LJP's direction is absolutely brilliant and mature, Gireesh Gangadaran's cinematography is just yet symbolic and editing and sound design is over the top. A true collaboration of director, Cinematographer and editor. Finally, in the climax the line between humans and animals fades away leaving us to the edge of seats. The alternate climax reminded me of Stanley Kubrick's 2001 A space odyssey, which symbolises that the humanity is heading back to primitives and more monstrous.Rating : 4.9/5"}, {"id": 219, "text": "I watch Hindi, Kannada, Tamil, Telugu, Malayalam, US, European, Korean, Iranian, Syrian, Nordic, and other world cinema. I say this because it matters what is the palette of the person whose opinion you are reading. Jallikattu is one of the best movies I have watched so far in life.This movie is a mirror to our human nature, our anger, our greed and our barbarism. It's fast-pased and follows constant action.The cinematography is brilliant and makes the visuals that are beautiful while depicting the chaos and violence that is unleashed ensuing the escape of a buffalo before it is being butchered. The music is very unique but apt to the subject &amp; visuals. It seems to have stemmed from the sounds of aboriginals and primitive forest dwelling societies I assume.Thanks to Lijo Jose Pellissery for making this one. Truely one of the best coming from Malayalam, from India, in fact best of world cinema. I am inspired to check out his other works now.I can't recommend this enough for people who enjoy non-formulaic, non-masala, great cinema that affects you, and once in a while we need to be shown our nature."}, {"id": 220, "text": "Adapted from S Hareesh's short story Maoist, the premise of Jallikattu is about a buffalo which escapes from a slaughter house in Idukki and whether the villagers pin it down or not. Though the movie is not about the bull-taming event that is popular in Tamilnadu, where the animal is provoked or even drugged (illegally), here a mere buffalo creates rampage by destructing crops and vegetation on its way. It might sound stupid but the way this stupidity was treated is just surreal.Focusing on the mob-mentality, Jallikattu explores the human nature of dominance and establishing the authority. Though it might sound philosophical, the movie tries to extrapolate our cultured aspect to its breaking point; we, humans, are civilised only to a certain extent until some tyranny is unleashed upon us.Lijo transformed this local feature into something universal with such diverse themes. The people from nearby villages adds fuel to the burning rage, leading to the climatic pyramid formation and this makes one think that we are primitives after all - with tamed beasts within each one of us, ready to be unleashed anytime.Overall, the team of Jallikattu should be appreciated in making such a treat for cinema lovers like me; it was such an intense viewing experience with several orgasmic moments that one fails to notice the tiny pitfalls. Jallikattu , for sure, deserves to be selected as India's entry for the Best International Feature Film at the 93rd Academy Awards (aka Oscars)."}, {"id": 221, "text": "Finally, last week allowed me to see Jallikattu and it left me puzzled, shocked and amazed. Some movies deserve so many good things. Watching #Jallikattu is as exciting and an unusual experience as it may never happen. Lijo Jose Pellissery has utilised a simple story, but it is excruciatingly complex in execution.It is an incredible visceral and sensational journey that also deals with politics, religion, humanity, morality, revenge, nemesis and basic human emotions. The conflict is not man versus animal, it is a conflict between the beast and the beast within us.It is an allegorical tale of mankind's eternal struggle to subdue nature. However, it is not possible to control nature, and when the nature runs riot, the result is mayhem.You don't need a lot of colours or beautiful gardens or even spells for magic. You just need to capture the right moments. #Jallikattu does that. If you already haven't, please do watch it. Do not miss it. It is available on Amazon Prime!😊"}, {"id": 222, "text": "Jallikkattu is a 2019 Malayalam film.The film is about a single day where a buffalo meant to be killed for meat escapes and creates havoc.Despite the disclaimer at the beginning, the movie is violent and gory in terms of treatment of animals and birds, in terms of depicting how they are killed and then ravished by humans.The movie is replete with scenes where the animal is pierced with weapons and should really have been banned or not allowed for mass release.The movie is also heartless in terms of how humans treat each other cruelly and objectification of women.It also gives a very unflattering view of how people are and behave these days in Kerala, which is sadly partly true.Under the garb of carrying a message, the movie is create with a wrong intent.I rated it 2/10 in IMDB. Pls avoid."}, {"id": 223, "text": "I had been following the hype since it's trailer release and I haven't seen any other work of this director. Nor I have seen many Malayalam movies to be honest. I gave this a go thinking it was a horror or supernatural thriller but oh no, this is way worse than anything supernatural horror. This movie takes you inside human psyche. And it does it with finesse.About 80% of the time I was distracted by analysing how he managed to film this. The script is not water tight and this movie can do without getting to know a few characters. Sound design is phenomenal but the choice for a cappella for background score, I couldn't get onboard with.I don't watch Malayalam movies and don't know the language so I can't speak about acting or dialogues but I watched this for the philosophy. This isn't everyone's cup of tea and such tea should be made every once in a while.My only gripe is, it leaves a lot of loose ends after introducing few characters, for some reason. Last but not the least the final showdown turned into an unrealistic 'heap' instead of staying true to the realism as it had previously. I mean, we've seen riots. I know what you're trying to do but it didn't work Mr. Lijo.A must watch for aspiring film makers and social anthropology students."}, {"id": 224, "text": "I watched Jallikattu last night on Amazon Prime. It was a terrible watch, frenzied and brutal. Way too noir a plot for me, especially at night. Having said that, I am sure that many especially men, will love this film.Cinematographically, it is very well made. The sets, the location, the rampaging buffalo, the frenzied BEASTS (not the hapless bull), the tone, the tenor, the acting; all this was good. But personally I could not bear the brutish nature of the film. That's why the 6.I don't know how they managed to shoot the buffalo sequences, is that an animated bull? Whatever, those shots were too realistic for comfort. It horrified me to see the way the frenzied men tortured the hapless animal and ultimately each other, in acts of mindless beastliness. Even for those who enjoy such scenes, the film is stretched and could be shortened by atleast 40mn for better effect.This film is NOT FOR CHILDREN even if they're slyly watching worse!"}, {"id": 225, "text": "This movie completely misleading of JalliKattu Tamil culture.According to Tamil culture, we Tamil peoples don't eat Beef. We don't kill Cow, Buffalo for meat. Apart from that, JalliKattu is a festival for selecting good Male cow for breeding.This movie cinematography were good, So, I can easily understand their motive with this stupid movie.These Malyalees are deliberately trying to malign history and culture of Tamils and also attacking all our forefathers and prominent Tamil leader through their movies.This shows their vengeance against Tamil peoples for absolutely NOTHING. Every time this morons showing their vengeance on their film &amp; the film dialogs.A defamation case should be filed against holding this title and stop using this Title.Apart from the title, I seen some dialogues that discriminates Tamil peoples again.1. Naxal Parabahara dialog. We know Nair, menon contribution against Tamil peoples in Eelam Tamil people genocide. That's why they continusly using Naxal Prabahara, Terrorist parabahara, Calling dog by name Prabahara in their Movie.2. Sandal smugling dialog. Complete fake news against our Veerapan. Yes the police man is Kerala who claims that he killed Veerapan.3. A person shouting a Tamil worker with this dialog  You and your bloody traditions dialog Dear Malayalise your touching our tradition again over again with FAKE &amp; FALSE statements. If we dig before the year 1920 then the God own country will be called as Land of Prostitution.You remind me the English dialog No nair knows their father through your cheap attitudes towards Tamil peoples.Mind your business dump trash!"}, {"id": 226, "text": "Jallikattu completes the Golden trilogy of Visionary filmmaker Lijo Jose Pellissery along with Amgamaly Diaries and Ee. ma. Yau. At the surface Jallikattu tells the story about a Buffalo Enroute to slaughter, which goes haywire at a small sleepy village in the highlands of Kerala, but as one probes a little deeper its much more than what meets the eye. Jallikattu like the other two movies in the trilogy focuses on humans and their emotions under extrodinary ordinary circumstances.Jallikattu is based on a short story, titled Maoist, However, Jallikattu is less of a story and more a situation. With very little dialogues throughout, it works in some places, but also leaves the rest for the audience to decide themselves. Though the story starts with heart tumphing male machismo on display, in the minds of the audiences, it soon goes into a fully blown Man vs Wild frenzy but the tables turn the other way soon enough for the audience to realise its the man who is indeed wild.Beautiful cinematography throughout the entire movie with a very balanced framework and the lighting for the final phase of the movie was just outstanding. Music beautifully kept up to the pace matching the adrenaline packed scenes. Costumes and makeup department really has put in an effort to maintain the rustic look. Actors too have performed very well with Lijo jose pellissery at the helm the entire movie seems to fall in place properly, the last 8-9 minutes is the testament for that. It would be a spoiler to reveal anything more to that.Jallikattu is a visual experience to behold on the big screen. A spectacle at times unnerving, appalling and thrilling at the same time. It is not that much about the story, its about the choice of a methaphor we as audience can use in the place of the poor Buffalo, for example if we put money instead of the buffalo or a woman in the place of the buffalo and see the movie, its a totally different movie each time,"}, {"id": 227, "text": "Jallikattu the title tells us all that it is somehow connected with buffalo's. That is the thing.. here the entire plot runs behind a buffalo which was escaped from a butcher from being slaughtered.. The entire village get united to catch the buffalo.. Jallikattu is name which is derived from a cultural spectacle in Tamil Nadu.. Review The film is completely takes place in a small village in Kerala. First of all, take a bow to the master of chaos LIJO JOSE PELLISERY. He has created such a platform that we exsist in the happenings. HE is also the master f=of taking single shots, and the story line by S. Hareesh was mind blasting.. the film holds some moments where we feel tensed.. the pressure from our minds are released quickly.. the screenplay was perfect.. We should seriously talk about teh background score.. that HOO' and HAAASS' when a serious action takes place.. it is perfectly exceuted and brought up on the screen.. the characters like Anthony Varghese are perfectly sketched, we'll be hooked by their movements in the film.. The cinematography in this film was top notch for sure.. Sometimes there are more than 50 people in a single shot..Final Vedict - IF YOU ARE A FILM LOVER.. YOU SHOULD WATCH IT FOR SURE.."}, {"id": 228, "text": "Jallikattu (2019) : Brief Review -A rapid-fire toasting of a beast and wildness of Humans turned the Realistic film into Mythological tale. Jallijattu is not about one individual human, it's about the entire village (or mankind) and of course only all Men (no women, why? No comments) are involved in the crazy, wild manimal fairytale. A buffalo escapes from slaughterhouse and creates a village-wide hysteria in which we see all men turning even wilder and brutal than animals. So this was the basic idea behind the storyline but was focused occasionally while rest of the time it was about anything but nothing useful and related to the main story. In the runtime of about 95 minutes Jallikattu gets to the main content only when the beast appears, otherwise it has some useless small small segments to tell such as a lady having affairs, politicians thinking about thier future, casteism, a police officer's quarrels with his wife and bla bla. All of it got nothing to do with the storyline yet covers 90% of runtime and the reason and logic behind is still pending. The climax of the film is so unrealistic that it looks like mythological story from a novel or as if we are watching a fantasy action film set in stone-age. How was those man supposed to climb on each other on so high just to kill one man in realistic proportions? Leaving it aside and coming to the positives of the film the first one is, the direction style is different and modern. The use background score is fascinating and innovative. It gives a feel of watching something really new and fresh to eyes. Jallikattu was humanly a very tough film to make yet it delivers spectacular visuals shot amazingly by cinematographer and brilliantly directed by the director. Apart from these three things there is nothing in the film that can be termed Great. The chaotic aspirations of the team to make something different deserves one time viewing.RATING - 6/10*By - #samthebestest"}, {"id": 229, "text": "A wild buffalo escapes a butcher's shop and runs amok, disrupting the routine and dynamics of a bunch of quirky villagers.Now, this storyline in itself is unconventional and at the hands of a brilliant director, becomes the stuff of festival premieres. However, it seems to me that it worked better in the writer's imagination than it finally did on screen. For starters, none of the actors' characters is established well enough. Even though the entire village is running amok, one feels the need to identify and want to follow at least a bunch of people, but there's no one to anchor our curiosity in this film. Even the bull doesn't seem that fierce tbh.Second, there are passing references to various themes like naxalism, women's rights, social hierarchy, etc. but they fail to strike a chord and deliver any impact. Mostly because they are inaptly placed in superficial dialogues or are devoted just a few seconds without any context. Further, the acting is average at best. True, everyone has tried to act natural, but somehow it comes across forced and unconvincing.Overall, it just seems like they tried to force fit an entire screenplay just based on a single promising premise and that shows."}, {"id": 230, "text": "In a village near Idukki, Kerala, at daybreak, a buffalo which is about to be slaughtered escapes and runs amok creating sundry destruction.Thus begins a 90 minute plunge into a seemingly absurd, yet absolutely riveting set of events.Director Lijo Jose Pelissery, with his unique handling of this simple premise, concocts a visual and aural adventure that is a deeply visceral.What appears, on the surface level, as a preposterous, albeit straightforward narrative of a communal chase behind a gentle bovine, there is a subtext of multiple layers which throw a light on toxic masculinity, strong undercurrent of animal spirit that lurks under the thin veneer of thousands of years of civilization and how it could be unleashed at the slightest of provocations, with vignettes of political and social landscape and a healthy sprinkling of dark humour.Director Lijo Jose Pelissery has marshalled technically top notch talents in the form of cinematography by Girish Gangadharan, Prashant Pillai's background score and crisp editing by Deepu Joseph to mount brilliant setpieces suffused with manic energy.Kudos to the director that he could cook up a tense thriller, that is also an one of a kind immersive experience."}, {"id": 231, "text": "Jallikattu is a film about Mallu rednecks - people who live in the hilly regions. But too much style and shouting over character development ruins the film to an extent. It is nowhere as good as Agamaly Diaries.Worth a watch for the crowd scenes. But zero character development and strange background score ruins it a little. A bit of a miss for Lijo. And the final oooh message ..... We might wear clothes and all but we are just animals at the end of the day. Lijo is someone who loves the masculine men and the fight for territory. Here he tried to show it's dark side and sort of fell flat.The supporting cast is full of unremarkable nobodies unlike in Angamay Diaries where every bit player made an impression.A subplot involving an alcoholic Christian patriarch organizing a function and being scared of not getting enough meat was entertaining.So many lost opportunities in Malayalam cinema to capture the lives of the people who live in the hilly regions. Either the director gets carried away with style like in the case of Jallikattu or is some boring blowhard.I wonder whether the final scene is an allegory for overpopulation."}, {"id": 232, "text": "Not the weirdest film I have watched, but maybe the creepiest.The colour and lighting in the film are unique and gives it a scary touch. Dark colours with red shade gives a feeling of uncomfort. Lijo Jose Pellissery took his ability to take long shots to extreme. Infact, I think he made this film only to test his own ability. Many scenes were over 2 minute long without a cut. Background score was poor.It's not what I expected. The focus keeps shifting to it's many sub plots. I feel the connection between them and the real story is missing. I expected it to be almost silent. However, there is a lot of talking in it.It's obvious that there's a commentry on cannibalism. It's more of a propoganda film. Themes are not kept hidden, they are as clear as they can be.It's unique but not truly great. Most of the time is spent in talking and useless fights. Characters are not any good. If you remove one scene and put it somewhere else, it makes no difference."}, {"id": 233, "text": "First, all malayam director s plz do research and put name or write a script. Without knowing nothing u kept the name #JALLIKATTU.And movie name have been given as intentionally by the mindless director Lijo. To promote and getting Monet back, Malayalis are doing this Tamil ppl culture emotion.... This will lead to disaster anyhow.... Its purely fiction made flick from lijo, Not a realistic in nature to catch a Buffalo it don't need 200 people moreover its just a domestic animal not wild animal like lion, tiger or elephant. You are trying to spoil the name of tamil culture &amp; paving way to an extinct of village bulls an animal species used in jallikattu. In jallikattu people don't run to eat the flesh of the bull, Even after the death , cremation process will be done with due respect as of human beings. But here you have shown many illegal affairs like bgrade films and trying to relate with tamil people You should not choose jallikattu as your movie name, u Can take name from your own tradition from kerala where real behaviour of ur people are screened in your movie, not tamil people or tamil culture #Jallikattu should not work @ #Oscars."}, {"id": 234, "text": "The film is set in a remote village surrounded by hills and forests. It looks idyllic enough on the surface. But what lies beneath is anything but conducive. The buffalo flees before it can be slaughtered to provide meat for a feast to mark the engagement of a hard-drinking rubber estate owner's daughter (who, on her part, is not averse to attempting an elopement) The runaway animal sparks absolute bedlam, the magnitude of which is captured by the propulsive original musical score by Prashant Pillai and director of photography Gireesh Gangadharan's phenomenally fluid camerawork. The mayhem unleashed by the beast is, however, no worse than the chaos that is whipped up by the teams of men hurriedly put together to recapture the buffalo.They cannot see eye to eye. Old animosities come to the fore when Kuttachan, a man who has served time for sandalwood smuggling and believes he was betrayed, is summoned to shoot the buffalo dead. Antony the butcher is dead against the use of a firearm to kill the animal. The entire village jumps into the fray, but the animal proves elusive. The race against time sends anger soaring. Overall in my view the film is totally misleading the people who have no idea about the cultural sport Jallikattu, to make them think the sport to be brutal one and being played by uneducated."}, {"id": 235, "text": "To be honest, I had high hopes from this movie after I heard a lot of great reviews. But this movie fails to deliver in all aspects, except the cinematography, which is outstanding and the only saving grace for this unending bull run.The movie's premise is simple. A buffalo has gone rogue, destroying everything in its path. The entire village is after it, with their own reasons for it, some personal, some collective. The villagers try to catch it, but it keeps getting away from them at every moment, with the damage caused increasing multifold from losing crops to losing lives. Finally, they are able to get a hold of it, with the weirdest movie ending I have ever seen. The End.The movie tries to highlight the mob psychology and other factors such as the true nature of humans as beings (read Animals) shown predominantly by the ancient/tribal people. But it lacks conviction. Taking it element by element, the movie manages to score high in the cinematography area, with beautiful shots everywhere from the sunrise scene at the start to amazing visuals in the dark, and who can forget the well scene? It's well-shot, through and through. The background score is interesting, mainly made up of tick-tock or other such sounds on top of cut scenes, setting up the stage for the next scenes. But this is where the positives end, and the downhill journey starts. First up, character-development has completely gone for a toss, with no focus at actually giving time and attention to the characters, to let them grow on you. A few characters have been given small story arcs or a back story told through flashbacks, but the efforts seem shallow. The females are heavily underutilized, with the so-called female lead's most dominant on-screen appearance being an overextended scene in which she is seen standing at the door. What a pity. This is followed by the storyline, which, at first, seems to be somewhat thrilling, but ends up being ultra-simple. And finally, the human pyramid scene! This happens to be the weirdest movie ending I have ever scene, with no words to describe it. Rather go ahead and get a feel of it for yourself.Overall : 4/10."}, {"id": 236, "text": "I expected more from the movie after watching the trailer.I loved the concept a lot and the director's experiments with dialogues and casting of non prime actors. even though at some places the dialogue delivery was mediocore.I liked the touches used the by the crowd of people, but the light setting was very very imperfect that the viewer could feel that the location was lit up.... it never gave a feel of night.. the shadows of the light setup gave a very funny look... that you could easily spot out the placement of lights..The sound design was very very cliche, as if the designer just want to push the fact that he has more than two channels to play with.Leaving off all the unrealistic feel, its a decent entertainer."}, {"id": 237, "text": "An interesting take on exploring the socio-political state of affairs in a small village using the device of a buffalo gone wild and creating chaos. The premise is promising and so is the device. To an extent, the film also does justice to what it intends to.But after a point, the film does get stretched and drags with the repeated attempts to catch the buffalo and moreover by almost similar methods or setups. It starts upfront with the focus on catching the buffalo but soon more layers are explored with the focus shifting from the beast to human side. That essentially is the core of the film which you enjoy. But then the narrative shifts so erratically between the beast and human side that you lose perspective. Also some subplots of human exploration like the police angle or the love angle seem half-baked and hence fall flat.At times the director does shift gears from storytelling to showcasing his technical prowess esp with the background score, sound design and camera angles. No doubt that the film excels in all these departments. But since, at times, the technicalities do not take the story forward, it seems forced and reminds of such shallow attempts by Ram Gopal Varma that seem more gimmicky.Though the film opens with a disclaimer that no animals were harmed and dummies were used instead, the portions with buffalo (which are ample in the second half) look as good as with a real animal. The makers don't shy away to visually explore the manhandling of the beast on hands of human - the climax and end credits are not for the squeamish. The climax sequence certainly goes a little fantastical were the director intends to highlight that humans can be worse than animals. And the epilogue quite literally emphasizes that humans haven't evolved much in their basic instincts since the stone age era."}, {"id": 238, "text": "Allegory, some dilemma, rage, aggression, ethics and more.This movie will construct doubts on believe and instincts. With such aggression on screen this movie became its own enemy. An overcooked masterpiece, delivers an utterly different taste.Name of the movie is Jallikattu, which comes from this popular spectacle in South India. It's a tradition where humans fight the bull to publicize masculinity. And the movie itself falls into the same discipline. Well, not actually. Instead of advertising masculinity it highlights the vulgar and wild caveman side of human beings and the movie does that in such a profound way that it becomes so obvious after a certain time. Like I said before, the movie itself is its own enemy.Now let's talk about some of the technical parts of the movie. For an Indian movie standard it's definitely something. It will even challenge some of the best movies ever made. I like how the movie really coordinates with the Indian weather and produces some of the best scenes with some of the very best lighting. But again if you want to do something out of the box, you have to do it in a certain way to achieve the results you want. And in this process a tiny mistake can derail the whole thing. In Jallikattu, they made a lot of these mistakes which results some amateur works and it's not so pleasing in the eyes of the viewer.Now let's talk about another obvious course i.e. sound. The background score of this movie is amazing and that is also one of the foremost enemies of this movie. The loud nature as the background score was not so natural. It created this mood which is good for a live action theatre, maybe but for a movie it's over dramatic. It created the essence of this wild nature so vividly. But, on the other hand, it's the only thing that killed the same essence, many times.The strongest part of the movie is the acting. Antony Varghese has been just perfect and gave an outspelled performance if not best. This movie had to cast for an entire village and everyone just gave their best performance in the given screen time. The acting is so strong in this movie, it will definitely push this one high on the leaderboard.Rating: 7.2/10."}, {"id": 239, "text": "I am very particular about my sound Remember Lijo Jose Pellissery mention so in an interview. Best recommended to watch in a theatre with well-equipped sound system. Prashanth Pillai's background score is world class. Diegetic sounds were just as sharp as the score.Night visuals were striking. Many extremely difficult looking scenes have been taken really well.Editing work is very impressive.Towards the end, the movie went a bit overboard I felt. The scenes were exceptional and stunning but the narrative did not place it coherently.End Credits presented pretty horrifying animation against horrifying background score. Quite impressive.Antony has acted ok. Sabu seemed to have faltered a bit here and there. There are sprinkles of imperfections as lot of the movie is done using non-professional actors.Animatronix is pretty good. Buffalo is quite convincing.Direction is excellent. World class. Pushing the limits of cinema. Lijo is all in. This is his most challenging work so far."}, {"id": 240, "text": "#JalliKattuDefined the thin line between Man and Beast. He explained Very brilliantly by using the Buffaloes (Threat Living Sympathy). Complete movie (2hrs narration) explores How things are changed and not changed from the decades (He narrated through the old man).Certifiably insane final 15 minutes, As lavish as the execution.It's not that much easy to write and make this kind of art films. Needs full of patience and great passion towards Cinema without that we can't.May you people some where uncomfortable, need bit patience I promise you guy's wait till to the end #Lijo Will Surprise you with his command in crafts (Film making style ). I think writer's and Director job is easy in this case when compared to DOP work. So wanna give Whole credits to #GirishGangadharan will appreciate what he done for the film. He's not able to stay calm and quiet least 3 min....Just Chasing Hunting and Running besides those rivels and Buffalo. Off course #PrashanthPillai sound too He also deserves for the applause and appreciation. And Finally the beast #AV did well !!"}], "reviews_amount": 241}