{"name": "Blood Vessel", "titleId": "tt08009938", "reviews": [{"id": 0, "text": "This movie isn't awful, but it's not good. Its a B-Movie and it doesn't set itself to be a masterpiece, which I can respect.I think that the acting was a bit awkward at times, but passable and some scenes were even good. Also, the plot isn't original, but it isn't also as cliche as many other horror films. I think the setting was interesting and it had potential. Nevertheless, I must say the film fails to reach a good level simply because in many ways the director played it safe and followed cliches and tropes from other films. The ending is worst part of all, it falls under the category of super cliches and it is also the result of a quite big plot-hole. I think they wasted the potential to have an entraining film, the protagonists are luckluster and most of them die in stupid or anticlimactic ways. Therefore, I can't bring myself to rate this more than 5."}, {"id": 1, "text": "Blood Vessel is Mystery - Horror movie in which we watch a group of people being in a life raft after the destruction of their hospital ship by a torpedo. They find an abandoned ship and they take control of it. There some strange events start to occur and everything change when they find the source of them.Since I did not have high expectations from this movie I was not disappointed by it. It had a simple but interesting plot that is combined very well with a nice direction which was made by Justin Dix. The interpretations of the cast were the biggest problem of the movie because they were very poor and they drugged the movie down. Only the interpretations of Alex Cooke who played as Alexander Teplov and Nathan Phillips who played as Nathan Sinclair were good but they were not enough. Finally, I have to say that Blood Vessel is not a horrible movie but not even a masterpiece, it's another average horror movie."}, {"id": 2, "text": "I'm a sucker for a decent vampire movie, (no pun intended), so I decided to give Blood Vessel a shot.The premise is that a group of people is adrift in a liferaft on the Atlantic sometime during WWII. They happen upon a passing ship, which happens to be a German vessel. After some debate, the group decides to board the ship.One of the problems that I did have with this movie was the make-up of the group. We have Americans, Brits, a Russian, and an Australian on the liferaft. Americans and Brits were often in the same areas of campaign in the European Theatre. Americans and Brits, side by side with Russians and Australians was virtually unheard of. In addition to this, two of the Brits are Intelligence operatives; one is a spy, and one is a code breaker. This is THE most unlikely group of Allied Forces to ever find themselves together in a lifeboat in the Atlantic during WWII.The other issue that I have with this movie is the utter predictability of it. There are virtually no surprises, and the characters all fall for the same traps that we've seen a bazillion times in other horror movies. This prevented me from giving the movie a higher rating.Our intrepid band boards the ship, and finds a little girl, a la Ellen Ripley and Newt in Aliens. The little girl even bites the woman who reaches for her, as Newt had bitten Ripley. The difference is, this little girl is a vampire... which should be a surprise to absolutely no one. This is not actually revealed until later in the movie, however.The villains in our group are an ugly, aggressive, offensive, bigoted, greedy American, and the cowardly Brit code breaker. The American, being dull-witted and greedy, ends up breaking open a huge box that is intricately carved with arcane, foreboding symbols. Of course, he's stupid and greedy, so he breaks it open in search of Nazi gold bars. Instead, he finds the vampire patriarch, who promptly kills the dim, greedy American.Our group finds a German Officer who had sealed himself off in one section of the ship. The German officer is terrified at having been found, and despite the group's efforts to avoid bloodshed, the German officer opens fire on them with a pistol. Gunshots are exchanged and the German officer is killed, and a member of the group is mortally wounded.What follows thereafter is the usual trope of the group members being picked off, one-by-one. The ending is one of the most predictable endings that I've ever seen, and will surprise no one. If you are shocked by the ending, you should strike yourself repeatedly about the head with a ballpeen hammer, as you are too stupid to live.Despite these flaws, the movie is at least a decent diversion, and worth a watch if you keep your expectations on the low side"}, {"id": 3, "text": "What a garbage movie to waste my time on. It's always the same problem with Australian films, it's like somebody once wrote a script idea on a napkin and nobody ever thought to improve on that. That, and a guy who fades in and out of an American accent in this film. Top stuff."}, {"id": 4, "text": "Why is Robert Taylor in several horror films for like, five minutes?I saw him and went, Cool, Longmire!Then he fell in the ship's prop.Why??"}, {"id": 5, "text": "This was a fun movie to watch, it really was. I love vampire movies and I'm a big fan of The Lost boys and Fright night from the 80's. I like that this was based back at the end of WW 2. The acting was great and it kept my interest throughout the movie. Make-up for the vampires was also awesome. However, there is ONE little thing that bugged me watching the movie. How...exactly, did the little girl get out? It does not explain that. She's just there, with no explaining how she's out and they're down below. (You'll have to watch the movie to understand what I'm talking about...) For me, it's a serious plot hole. But all in all, I really found this movie to be enjoyable. I'd recommend it. Peace."}, {"id": 6, "text": "Some guys on a boat battle a guy with a bat mask. Skip to the end, maybe you can enjoy an explosion."}, {"id": 7, "text": "Background noises, special effects and music too loud and too annoying throughout the whole movie. I could hardly hear and understand what they were saying but at the end of the day it didn't really matter because they weren't saying anything interesting or important. Usual stuff, dumb decisions. Overall it's not a good movie but watchable if there's nothing else to do."}, {"id": 8, "text": "Not a lot new brought to the table in this slow flick. Its basically Nosferatu goes to sea meets Ghost Ship. It has some pretty decent make-up, but thats about it. Very stereotype characters, and the actors aint going to win any academy awards anytime soon. This movie is, for sure, NOT going to have you check your closet before bedtime."}, {"id": 9, "text": "When a script is this unoriginal, I can't believe the film got made. It's literally ideas pulled from already made films, which is why it feels like it was made in the 90's. The only thing going for it is the prosthetic FX and the production design. Besides that it's a mess."}, {"id": 10, "text": "Yet another horror flick ruined by horrible characters. It blows my mind why these movie writers keep writing such stupid and inept people into these stories. Complete waste of everyones time but the industry keep churning them out. Stupid AF."}, {"id": 11, "text": "My expectations were kind of low, so I was surprised in a good way for a change. The acting was ok and also were the effects, it has a nice atmosphere wich overall made this movie a nice experience as for myself . I enjoyed this hour and a half, way more than I thought I would, so for me is a solid 6, for these quarantine days."}, {"id": 12, "text": "I had really high hopes for this film after reading many comments. This film both worked and failed for me. It worked as a thriller more than a horror film, the acting was good on most parts, not all. The story was good to. The bad, why Tue bickering between characters, this to me fell right from the start and got on my nerves. There was no surprise at the end, so this was a bit of a let down foe me. The main problem I had was the film was slow in some parts and I found myself getting bored waiting for something to happen. Nearly an above average film but not this time."}, {"id": 13, "text": "A very unlikely group of allied forces survivors run into a seemingly deserted Nazi ship in the middle of Atlantic Ocean, only to find... stirgoi. The poster and the name tells you what this is so I don't it is a spoiler when I say vampires.Despite plot holes the size of Donald Trump's ego and budget the size of his.... brain, this movie is campy fun, if you set your expectations low.High production values given the budget, a decent ensemble makes this surprisingly enjoyable, even if the ending is predictable. So, stop complaining and just enjoy watching for Alex Cooke's Teplov steal the show from his higher billed co-stars. A star will be born soon, I think."}, {"id": 14, "text": "This is pretty slow going for the first 50 minutes-no vampires to be seen. Special effects are great once they finally get moving and the few vampires look exceptional. This wasn't everything I was hoping for with the cool setting, unfortunately. 2 minutes of screen time from Longmire-what the hell?"}, {"id": 15, "text": "Yep and that would have saved us all from this pile of dog poo."}, {"id": 16, "text": "Please don't, just dont. Worst vampire's I've ever seen. Just watch 30 days of night again, soooo much better."}, {"id": 17, "text": "It does not have a high budget money dumped or jump scare what it has is something to keep you watching and not bored and that is a + for any movie for me and that's my opinion. it's a mix of emotion,horror,thrill and sacrifice all in one and its good."}, {"id": 18, "text": "Boring slow childish acting i fell asleep several times trying to care. please don't waste your time on this its just garbage."}, {"id": 19, "text": "Because this horror film is like a roller coaster, a slow uphill start and over the top at full speed with corners and loops and a heck of a lot of sound and light, until you reach the end, and the only thing thats true is that everybody is dead.its a film that chats till boredom kingdom come, the cast seems not engaged, and the story starts with a flock of ''wrecked people in a raft, their speaking tounges are of great variation and sound as the german sailer would say gebrockent , that are suddenly surprised by a ghostship, a german vessel. they board the ship, and starts to explore the dead, finds the steering wheel chained, the autopiloto of the medieval ages, everybody shouts and snarl at eachother, they hadnt if they knew what was to come after 45 minutes of searching....well its a film poor on special effects alla' cgi and vfx, they use models, masks and a keg full of makeup to improve the horrors . in the 2nd half they succed pretty good, there are speed, there are zombiism, vampyrism,christianism, satanism, gold,money and other treasures( among them the holy ark) nazism and a lot of shapeshifting that makes the poor souls take the bait and become infected by the ominous creatures that reign this ship. and in the end it goes like all horror movies over the theme small group of people in a cabin or a boat, they dai.well a bad written review from the grumpy old man, its starts at 1, but ends at a 9, i give it a 6 for the efforts done by the mask , makeup and sound departments. its a film where squemishness must be put on hold, otherwise youll dive back in the ocean before the living daylights emenates from the heart of the blood vessel. its a recommend."}, {"id": 20, "text": "It's not too bad as a creepy creature feature on a deserted ship. The movie has similar vibes to Aliens, the Thing, Pitch Black, Underwater but is not better than any of them as it doesn't have a big budget so the movie focuses on character development and creepy atmosphere which is enjoyable for the suspense. Note it's not an action movie. The production and set design is well done. But once the vampire shows up it's just a guy in a Halloween mask so it's old school practical effects as CGI is expensive.So the setup is great but the last half is a bit of a letdown. Still it's a fun creepy watch especially if you're into the Nazi occult thing. Overlord takes the top prize in that genre and Ghosts of War is also very good. I liked both of them a lot. But lower your expectations and this is watchable."}, {"id": 21, "text": "It's not high end production or Hollywood but it does do a good job as I was hooked.The deaths happened pretty quickly with not many of them act dying by the hands of the vamps themselves.The acting was mediocre on a budetike that with the main actor who's meant to be Australian, cutting into American when prompted you Australian he says mate. terrible.Romanian history of the vamps and how they were acquired was a great touch although its very minimal. be cooler if they had discovered this desolate castle or captured them but no they got some coffins and gold.plot was nothing on a jump scare or horror level as the vamps were always on full screen and never mysterious. also it was predictable on how things planned out."}, {"id": 22, "text": "This was a solid horror movie. I wouldn't even say it's a b movie 6. It's not trying to be some masterpiece it's a decent vampire movie. If you like horror give it a shot it's worth a watch."}, {"id": 23, "text": "A mishmash of survivors in a lifeboat encounter an abandoned nazi ship in the ocean, they board it and oops, it's full of vampires... Half the movie I spent trying to figure out if the chick was cheekbones mchottie from Vikings, and spoiler alert, it is... Absolutely nothing about this movie was original and it was all VERY predictable. Almost everyone dies, the main guy and girl escape the boat just as it blows up and kills all the vamps, but surprise surprise, the chick has been turned...so she kills the main guy, then gets picked up by another ship of unsuspecting sailors, which I'm sure she'll enjoy eating. Honestly, the movie was so slow, I almost lost all interest. If you can survive the first 2/3 moving at a slugs pace, the last big is all the action and it's not even that good."}, {"id": 24, "text": "It's a cliche filled horror movie wont give anything away but you've seen most of this before but nevertheless it's worth watching once. Not a bad movie just lots of potential lost when you watch it you'll see what I mean. Overall like I said worth watching has its moments but not worth owning orcseeing again."}, {"id": 25, "text": "More of an action-horror than a straight horror, I really enjoyed this film until the final 20mins.From the moment the final plan is hatched, as long as you think what would be the biggest F-U this film could give to its audience, then you'll probabaly work out exactly how it ends.Absent that predictability, and if they could actually make the characters more likable, relatable (or at least consistent); then I would have rather this film higher."}, {"id": 26, "text": "This is an interesting and well made aussie horror. It's been a while since we've had a good vampire movie and this is above average though perhaps nothing new. The story follows a mixed group of allied shoulders stranded on a life raft who find salvation in a seemingly abandoned Nazi ship. As an Aussie who enjoys reading Australian WWII history I liked the Aussie character and the banter with the other soldiers, especially when contrasted with the stereotypical loud mouth seppo. The Russian character was great too. The use of practical effects was solid and the CGI that was there didn't detract from the action. The use of a real ship as the setting definitely added a lot of value. The cast was generally strong though a few let the team down, though nothing surprising for a b movie like this. To sum up, it's not amazingly original but its a not a bad way to spend an evening."}, {"id": 27, "text": "Stilted dialogue, stereotypical characters, heavy handed direction. This is one vessel that sinks before it ever gets a chance to sail. These characters are so obvious and unrealistic that the fact that they don't look as if they've spent 10 minutes sitting by a pool, much less adrift at sea, that it hurts the brain and makes you seasick just trying to get through it. None of hear people seem at all related to one another. Not even by chance. They simply exist to put forth a plot that itself only exists through contrivances. The costumes don't garner much realism either. They all look rented with a do not age or otherwise use in a manner that makes them look used clause in the rental contract. It's not easy to make a film or to get a film made. So kudos for that. But if you find yourself wanting to both write and direct a film yourself, make sure you've gotten someone you can trust to read it first and give you honest criticism and have some other qualified person watch your dailies. It's too difficult to check yourself before you shipwreck yourself."}, {"id": 28, "text": "I was watching this and trying to go with it, but just found it too annoying and was eventually nodding off. Realizing I would rather be doing anything else I just gave up even though I'm sure I had to be near the end. I didn't care for any of the characters and this is just a poorly done horror movie, extremely fake looking. The masks on the creatures are cheesy, fake and it's distracting. Movies from the 1950s had better make-up jobs. There is no suspense and it all plays like some afternoon soap opera horror , one that hasn't been well shot. Worst of all are the actors, each one who seems to have been given the task of using some awful over-done accent as if this is an international cast. Some characters are so annoying their deaths are a relief. There is no character development ,I couldn't care less who lived or died and turning it off was a pleasure. When your movie creature looks like someone bought a plastic costume at an after- Halloween sale that no one wanted to buy, you're in trouble."}, {"id": 29, "text": "If you're into poor animation and terrible slow movement, than this is for you and if you're not , this is the worst movie I have ever seen. I can't belive they shoot movies like this in 2020 or in 21st century overall"}, {"id": 30, "text": "The movie was terrible. I am a huge horror movie buff and will say the plot was garbage, the acting was garbage, the screenplay was garbage. There were many stolen vampire conceptions from The Strain tv show, which was so much better. Please don't make the same mistake I did and pay $5 to support this mess. I don't know how anyone with even decent taste could rate this even 5/10."}, {"id": 31, "text": "When the monster come out and looks like a Halloween custom.... just make the whole thing screw up. Everything becomes lame right after."}, {"id": 32, "text": "Had me relatively entertained for the first half (despite terrible acting and effects), as I knew what this was. But then they showed the vampires. And I just laughed out load and shut it off... just absolutely lazy and cliche."}, {"id": 33, "text": "Reasonably entertaining little film.Nothing really special,but not a bad way to kill some extra time)))"}, {"id": 34, "text": "SpoilersVampires on a boat... 7 crew serving on a boat during WW2 that is torpedoed find themselves adrift on a lifeboat. They come upon a nazi ship and have no choice to board..even once they have boarded there is only 6 left... There is a mystery on the ship burned and mutilated nazi officers litter the ship only two survivors a little girl and a man scared to death of her... the characters are all given a bit to do but are all very bland. The Captain is killed getting on the ship and most of the others are around for a while. We have the annoying ships cook, his assistant, a nurse, a Russian officer, an Australian who takes charge and an annoying English special ops chap who is mainly used for comedy. All in all a good way to spend a hour or so. Just don't expect it to be your next fav movie."}, {"id": 35, "text": "I was pleasantly surprised by this movie. Blood Vessel is well put together, with a good cast and pretty interesting story. It's admittedly not the most original, but it's a decent variant on a common trope. The movie is an enjoyable watch. The only real failing is the very predictable ending."}, {"id": 36, "text": "The accents were not very good and the ending was way to predictable. The movie experience itself was very enjoyable and it wasn't until the last 10 or so minutes that I felt the need to hit the fast forward button. It was amateur in some areas and well done in others, mostly it was the directing and acting that needed development. It's a real pity about the ending though otherwise it was great."}, {"id": 37, "text": "This film start with a bunch of people in a raft entering a ship, and their captain fell into the water and die scene! As turnout, this film is about a bunch of people need to survive in a abandon German ship full of vampires! Entire film full of boring conversation, and annoying overuse scene! Such as, overuse of the jump scare scene, overuse of the searching things scene, overuse of the hallucinate scene, overuse of the arguing scene, and overuse of the talking to radio scene! Make the film unwatchable! All the killing scene have blood at certain point, but overall portray by sideways, and quite messy! Barely intense scene is, the wife of a vampire's head been chop off! At the end, the German ship explode by Teplov! The human turn vampire Prescott biting Sinclair to kill him! Prescott been save at the very end! That's it! Predictable ending and wasting time to watch!"}, {"id": 38, "text": "What is this latest fad for making films in the dark, is it so we will not see the cheap sets, or bad makeup, I quite enjoyed what I could see of this film as I like a good vampire film, but quite a lot of the time you could not tell what was going on as you could not see what was going on, this is happening in more and more films and it is annoying."}, {"id": 39, "text": "Very good acting and story. Original. Vampires , the actual cool scary kind. Well, strigoi actually."}, {"id": 40, "text": "Really liked the movie up until the pretty predictable cheesy end of the movie. Enjoyed the Vampires but unfortunately most of the movie is predictable. I like that Shudder is going back to the old 90 minute movie standard, so there isn't much filler. No unnecessary back stories like most made for stream movies, just shipwrecked victims, some nazis, and vampires."}, {"id": 41, "text": "I was enjoying it until the vampires were introduced, and then it was like watching a B rated movie version of The Strain."}, {"id": 42, "text": "At first glance this movie looked to me like one of those bad and silly, low budget titles, it really starts like an old joke: russian, englishman and australian enter a nazi ship... Yes, the story is trivial. But as it developed, it turned out to be more entertaining and good than I expected. Sometimes simple is good, I guess, this is the case. I absolutely loved how they used costumes and makeup for the monsters, instead of CGI, this is a major plus. And the ending is nice. I mean, I went in having no expectetions, I would've turn this movie off at any moment, if I didn't like it, but somehow I watched it all through and didn't even fast-forward. I did like it. So I suggest you give it a shot, if you're doubtful."}, {"id": 43, "text": "Blood Vessel is one of those films you really want to like, but it's constantly trying to upset you in some way.The film looks low-budget, but the production was fine, it was immersive enough and it was obvious that the people who made this film cared.The premise was interesting, and even though the story itself was shallow and eventless, the production design and the Romanian mythology setting were enough to keep me invested up until the anticlimactic ending.Creature designs were great, but the Strigoi themselves were so boring and incredibly non-menacing. They were never scary or dangerous, and they barely even do anything in the film. If you're paying homage to The Thing, and if your creatures can shapeshift - why not play around that, fool the viewer, make us guess. Why make the story so predictable and lifeless.My biggest complaint is the characters though. They are very one-dimensional and mostly either annoying or straight-up obnoxious. They introduced a suspiciously diverse set of characters (in terms of their backgrounds), but besides a couple of good line exchanges, this never really comes into play. There is no one to root for, except for the Soviet guy probably, but again, he's a one-dimensional good-guy hero with no flaws. The woman's character was never a character. Other characters just try to beat each other in being the most unlikeable, but the Faraday character always wins.I didn't really care about the goofs, like the Germans using a British ship, the German soldier locking himself up from inside but later when the Strigoi were locked there they needed to be unlocked from the outside, whatever...I can appreciate the production quality and care put into the film, but it makes me really sad that in a film about a group of survivors I have absolutely no one I can care about."}, {"id": 44, "text": "I do not watch much modern horrors, as they tend to be very gory and with real bad story lines and/or characters. Especially most vampire movies tend to be so dumb, that when I see vampire in a movie description or something similar to a vampire creature in a trailer and I skip the movie. However decided to give this one a try.It is a vampire movie with a Nazi theme, set during the end of World War II. One bad thing to say about the movie is that it is basically a rip-off of Aliens (1986) story line. We have a warship, with few war survivors and some monsters to fight and nobody have nowhere else to go. And there is also a little girl with a doll. Sure, they twisted it a bit, so it's not a complete rip-off, but basically this is what it is.With that being said, it does not mean it is not worth watching. The characters are cool, the make-up is real good, special effects and costumes are real good too. On top of that, it is not real scary, but the entire time is feels really entertaining. Honestly I've been enjoying it. It was a nice fresh cup of a fairy-tale with a dark twist. And of course, don't get me wrong, with my Aliens comparison, it is very far from Ridley Scott's tale, there is not a pinch of that much suspense or horror, but still - I liked it.I won't reveal spoilers, so you will have something to watch for, but it is a nice movie to watch for the evening."}, {"id": 45, "text": "Locally made horror thriller Blood Vessel embraces its concept and kookiness to deliver a fun throwback like experience that is sure to have genre fans excited about the proposition of seeing World War 2 citizens take it to a ship full of bloodthirsty nazi vampires.Directed by Australian special effects/props guru Justin Dix, Blood Vessel overcomes its low-budget origins and DIY nature to end up as a final product that is both proficient as a spectacle piece and as a moody atmospheric horror that will entertain anyone willing to go along with its insanely over the top and schlocky premise.Everything about the film is no fuss, Dix wastes little time in introducing us to a group of sea-stranded survivors that includes Nathan Philipp's Australian soldier Nathan Sinclair and Alyssa Sutherland's kindly Jane Prescott as they and their fellow raft members find potential rescue aboard a seemingly deserted Nazi minesweeper, that just so happens to be host to some extra-ordinary cargo that would rather suck your blood than say hello.Taking it slow for the first part of the survivors searching of the ship and quest to uncover why a ship such as the one they find themselves on is devoid of human life bar a young girl, Blood Vessel eventually goes all out as we and the films group come face to face with the true horrors of what lays in store for them becomes increasingly more apparent.With some great visual effects and make-up work, a committed cast who all bite into their roles, a great set courtesy of a real-life docked ship and an atmospheric score from Brian Cachia, Blood Vessel is a well-rounded package that never tries to do anything outside of its reach and while it fails to go to insanely creative levels of B-grade goodness, it remains a home grown affair that horror buffs can be proud of.Final Say -A fun and entertaining Australian made horror, Blood Vessel delivers exactly what its premise promises and has a lot of fun along the way in doing so.3 neck bites out of 5"}, {"id": 46, "text": "Australian movie industry seems to have enjoyed its involvement in a cult Finnish sci-fi satire Iron Sky so there's no wonder they ultimately decided to solely shoot their own 'alternate history' flick. Blood Vessel is a fun thrill ride fueled with nations conflict ('...and Australia? I ain't even know you people were in the war', desperately shouts Bigelow, an American cook stuck on the Nazi ship) and ancient East Europe evil (no, it's not Teplov, perhaps the finest film's character of Russian descent).The screenplay doesn't offer much to reflect on and instead fully relies on visuals and actors. Both are indeed solid for an indie level. Nathan Phillips and Alex Cooke had some chemistry which was exteremy important when there's nothing but people talking (more often arguing, truth be told), the rest of the cast, excluding Robert Taylor's unnecessary cameo, also did their best to make their dull characters looks as alive as possible until they're dead. The aforenamed evil also lacks any signs of premise but doesn't make it a big deal when it's finally on loose. We've seen 'Nazis love occult stuff' trope for so many times that there's even no time to ask what the hell does it do here in the first place.Summing it up, Justin Dix and Jordan Prosser had made a decent B-movie that works in its own cheap way and doesn't leave the prepared audience expecting more than Blood Vessel is capable to give."}, {"id": 47, "text": "The offerings of the considerably small niche of horror movies set during a war or another are always welcome in my world, despite most of them being lacklusters - Blood Vessel, for the most part, is exactly that. Coming from Justin Dix, a special effects aficionado turned writer and director, Blood Vessel offers entertainment in the form of 80's best aesthetical traditions, and very little besides that. For extra bonus points, one must take this shlock horror not seriously.It is 1945 and the middle of the ocean. A real ragtag team - including a tough but righteous Russian sniper, a moronic Englishman, an American cook, an Australian soldier, a useless captain, an all-motherly Alyssa Sutherland, and more - are hopelessly drifting on a raft to a certain death, but a chance at survival presents itself in a form of an eerie, silently drifting German minesweeper. As we tag along our indubitably stereotypical team of heroes on the mysterious Nazi ship, the excursion takes us through ~40 minutes of slow building of a shallow story that has frequent issues, before it kicks the gear into ~40 minutes of a tad bit more entertaining horror feast - none of which is scary. Frankly, Blood Vessel is almost entirely void of tension, and the turns of the plot are more likely to elicit a dry response rather than a surprising one.One thing that Blood Vessel has going for it, is the fact that its maker knows and loves practical special effects. Though a low budget feature and playing out as such, among a little confusing action scenes there are mildly satisfying 80's kind of gore and make-up galore. Set designs are also quite fine, but cinematography's uneven and the original score - a highly typical one, not counting the chanting Nazi occult jingles. However, perhaps the most awesome part of Blood Vessel is comedy value. Some of it is intentional, some is not, but either way Teplov (Alex Cooke), Sinclair (Nathan Philipps), and even the villain will make up for some amusement, especially if You're not watching it alone.The lovers of modern shlocks reminiscent of the 80's, and fans of horror movies set in wartimes, such as myself, can try and find some fun in Blood Vessel, preferably with a friend and a beer. My rating: 4/10."}, {"id": 48, "text": "I really had high hopes for this. I love Nazi horror movies and shelled out $5 to rent this on-demand.Five minutes in, I started having doubts and an hour in, I just wanted it to be over.It starts with some text about how at the end of the war, the Nazis tried to sink allied vessels and kill all survivors. It then cuts to a life raft full of... survivors. Sigh.Said life raft is floating on completely calm and flat water (the North Atlantic should be really rough). The survivors have no exposure damage from sun, salt, and look like they were told to fall asleep by the director. There's a woman, a black guy, an Australian, an even a Russian. LOL yeah, as if a ship would have been carrying one of everything... so bad.The Russian soldier speaks perfect English. Because clearly Russian peasant soldiers are very worldly. He just omits a and an for extra-dramatic effect. Wow!The black guy mouths off the white guys, because clearly that's what people did back in 1945.I can go on and on, but that's just the first 10 minutes. The dialogue is cringe-worthy and painful.Clearly this isn't a high-budget production, but the vampires look like Mickey Mouse with comically stupid fangs.Don't waste your time. Go watch Dead Snow 2, Shock Waves, our Outpost instead."}, {"id": 49, "text": "Blood Vessel would have worked a lot better, if it had played more openly and candidly, to its comedic horror vibe.Its very title sets up a lot of comedic potential, as does its casting, with a rag tag mob made up of Soviet, Australian, British and American characters who board a German ship. It almost sounds like material for a bad Friday night joke, down at the pub.Its basic setting, awkward characterisations and rubbery special effects, would have been brilliantly complemented by a decent injection of dark humour.Regrettably, the script takes a more serious turn for the first half of this flick. The few moments of comedy that are offered up are not enough, in what is a rather disappointing, final product.By no means unwatchable but less than it could have been, had it turned its weaknesses into strengths.4/10."}, {"id": 50, "text": "The title, 'Blood Vessel' is a pun. One, the film is set on a ship, and two, on board are monsters that like their drinks served fresh from the jugular. Unfortunately, this is the smartest thing about this cheesy horror flick, which could be described as the Australian equivalent of Ghost Ship meets Evil Dead.The film begins with seven people on a boat. How did they get there? Don't know. Did I mention this was WWII? Awaiting rescue, and embracing death, the band come across a Nazi ship and see this as an opportunity to trade up. Clambering aboard, they discover the original crew have mysteriously vanished. What ensues is a talk-fest, broken up with short scenes of exploration and discovery, for over half of the film's run-time. To say this is a slow-burn would be an understatement. The major addendum with this is our merry band...Robert Taylor joins us for no longer than a minute as the titular captain. I hope it was worth it, mate. Next is Sinclair (Nathan Phillips), a dinkum Aussie bloke, who has suffered as a POW the last three years, with a high tolerance for pain and genuine leadership skills. Alex (Alex Cooke) is the Russian sniper, who is as suave as he is tough, swallowing back pain like it's a shot of tequila. Jackson (Christopher Kirby) is a former engineer, forced to enlist as a cook because the color of his skin, who has had a hard time trying to be taken seriously by his superiors. And that ladies and gentleman, rounds out the only likable members of the crew.The remaining half of the characters are unlikable. The fact we spend so much time with them, does not help matters. Prescott (Alyssa Sutherland) is a nurse with a dark past, who is a bit too formal and polite for my tastes, whilst hypocritically harboring biases against others. Bigelow (Mark Diaco) is arrogant and obnoxious, with a strong desire to live, no matter the cost. Diaco's occasional fake American accent was passable, but half of the time he sounded Australian. Then there's Faraday (John Lloyd Fillingham), an antiquities dealer and code-breaker, with a penchant for cowardice and lying.The audience's ability to like a character is usually traced back to how the film treats death. In the case of Blood Vessel, there is usually no empathy at all. In fact, often death is just followed by a joke. The humor isn't awful, nor is the dialogue cringe-inducing, but it sure is cheesy, and contains enough cliched one-liners, I wouldn't have been surprised if it had been penned by Skip Woods. This silliness would be almost charming, if the film didn't take itself so seriously.As the group continue to explore the ship, tension builds, as issues of trust, rank and racism take their toll. None of these themes however are given the attention they deserve. Not long into the narrative, the band come across a little girl (Ruby Isobel Hall), alongside a collection of artefacts. These in particular were well crafted by the film's design department. When the group finally realize what happened to the Nazis, chances are, they'll wish they never left their little dinghy.The movie is potentially at its best when it really leans into its stylistic design. In one scene, the lens is coated by the blood of a monster. In another, the screen changes color as evil is unleashed. True, both have been done before in other, more competent horror flicks (Dog Soldiers, Dead Birds, etc), but Blood Vessel needed to do more to separate it from similarly innumerable C-grade schlock. Other times, the movie is incredibly predictable, recreating scenes from other movies. There is one moment that will have you reminiscing of James Cameron's Aliens.Perhaps Blood Vessel was designed as a homage to '80s horror. If so, it ought to have reveled more in the violence; this is a movie that should have had a Tarantino level of gore; to really embrace a sensationalistic aesthetic. It could have equally been a homage to classic movie monsters, and if so, a greater level of subtlety was required. This is one of the issues I have with the movie; there seems to be so many inspirations that are literally pulling the feature in all directions, and yet it never seems to really embrace any one of them. As for the creature designs, one of them, literally, looks like a combination of a pig and a fan-boy, cosplaying his favorite Buffy antagonist. Despite the almost laughable design choices, again, the film needed to lean into this goofiness and provide more screen time for the monsters, rather than instead being so somber.Creature lore is briefly explored for the audience's benefit, while the diegetic sounds are nothing to rave home about. There is a score, but to be honest; I didn't notice it until over an hour in, which either means it was innocuous, or my brain tuned it out for safety reasons. The combination of violins and drums does add an almost gothic tone to the movie, increasing the sense of mystery.Moreover, the way the film was framed works against the narrative at times, with details, that may be considered pivotal or interesting, partially out of sight or out of focus. Other times, something happens off screen that we are not made aware of. If this were done to hide budgetary constraints, it is acceptable, though it often seems to have been added to cheaply raise tension, which is unsatisfactory.At the end of the day, Blood Vessel is a sponge, that has absorbed plenty of inspiration from elsewhere, but has not appropriately learned from any of it. The film's tone is all over the place. Unable to strike a balance between dead serious and silly, this is a movie that really needed more humor and insanity to truly stand out. Instead, it is largely forgettable, because we've seen this too many times before."}, {"id": 51, "text": "It's really about a 5 to 6.5 star film, but due to the fact that people will rate it 1-4 ...I feel a duty to raise that..If you're a horror fan, you're aware that anything above 4.5 on IMDB is very decent, and 5-6 is gonna be pretty good.The film was done well! Budget, &amp; effects were great. The setting was fantastic, though the ship wasn't explored much, which gave a sense of it being small. The movie with with physical props/monsters over CGI which was a great move, the monsters looked pretty solid! Not all cheesy or anything.The cast was a bit odd, how an Aussie, American, Brit, &amp; a Soviet ended up in the same raft...no clue. Also, why does it seem the black fella has so much pull...? He would've been a cook, so I'm gonna chalk this up to some SJW nonsense.I do fully agree with another reviewer that this would've been really waaaay better as a horror comedy, it had the perfect set up for one too!!!All in all, it was a solid hour and a half! And I really wish people would stop being movie snobs with these films...why??1) It's an ORIGINAL concept (you know what I mean...) &amp; the reason these are rarely ever made is because when someone takes the risk of making one, everyone bashes it and doesn't support it!!! So why do you keep asking why we only see remakes and Marvel films...? Because you people walk all over anything different.2) it's a lower budget horror film about vampire/zombies. What do you EXPECT? I'm asking honestly...what do you expect? Plot holes? Really!? Yes there's gonna be plot holes...how about the fact that these monsters don't exist for a plot hole...? Just enjoy the film!!!With all this said I believe it is really a 6.5 star film, but I believe it deserves the 8 due to my thoughts above.If you enjoy monster horror...give it a go."}, {"id": 52, "text": "A very basic, even formulaic horror movie that feels like something you'd have seen back in the 80's or early 90's. It's even got such classic character cliches as arrogant upper class coward who tries to sell out the group to save himself and shady troublemaker who ruins it for everyone by trying to steal the treasure for himself. You've seen it all before, but this movie knows what it is. It doesn't try to be overly clever or ironic about it, it's just an old-timey creature feature and it does that well.The actors are decent and the script is solid enough that even though the creatures don't fully appear until the last third of the movie, it never felt like it was just killing time. The conversations and actions leading up to that point felt natural and relevant to the situation and weren't just nonsense thrown in the pad out the time. The setting and creature effects were pretty good for a low budget movie.Just keep your expectations realistic. Don't expect to be scared or have any deep thoughts provoked. It's just a simple story of some people on a boat vs some vampires that has a natural retro feel to it, and if you like that kind of thing you'll have fun here.7/10"}, {"id": 53, "text": "This was one that I heard about a few months back after it hit Shudder, but this one didn't seem to get the buzz those other movies that were heading to this streaming service was getting. There were some aspects to it that caught my attention like vampires, Nazis and during WWII that really peaked my interest to give this a viewing. I won't waste time here, so the synopsis is lifeboat survivors board a German boat that's crawling with vampires during World War II.We learn early on that we're in 1945 at the end of the war. The German U-boats are now targeting pretty much everything which includes medical boats and merchant vessels. As the synopsis states, we're in a lifeboat where the survivors look like they've been having a rough go at it. This was a bit confusing here are the survivors. Nathan Sinclair (Nathan Phillips) is Australian. Jane Prescott (Aylssa Sutherland) is a nurse from the United Kingdom. Along with her is a British code breaker of Gerard Faraday (John Lloyd Fillingham). They're led by Captain Malone (Robert Taylor) who is American along with Lydell Jackson (Christopher Kirby) and Jimmy Bigelow (Mark Diaco). They are also joined by a Russian solider of Alexander Teplov (Alex Cooke).This group is down as a storm rolls in, but they think their plight could be looking up. There is a German ship that is approaching. It appears that no one is on board as they near; no one calls out or tries to attack. One of them sees a girl in white, but when he looks back, she's gone. They have to make a daring attempt to get onto the ship with Captain Malone not making it.It is indeed a ghost ship. They go about exploring to see what they're working with. In the bridge, they find a dead body. It has dark, funky looking veins and the neck is bent weird. The wheel is also chained for a set course. Bigelow, Jackson and Teplov go to the engine room to see that it is running hot and could explode at any moment. Jackson elects to shut it down where Bigelow disagrees. We see there is some animosity between them that is coming to a head here. It is shut down to prevent destruction of the ship and them.They also realize they aren't alone on this ship. They discover a young girl of Mya (Ruby Isobel Hall). There is something off about her. Bigelow also finds Nazi gold where Sinclair finds an odd box with what looks like vials of a liquid, a cross and a dagger. The Nazis on board are mostly dead and much of it looks like suicide. They were after something dark and scarier than humanity can imagine. The problem though is that it is still alive or to be more specific, undead.That should get you up to speed with the story that this movie is giving to us. As I was alluding to in opening paragraph is that I love movies that are set with Nazis as the backdrop. A lot of that is that I've learned throughout the years that they were really into the occult and trying to find a way to ensure the 3rd Reich could last for a thousand years and those in power to live that long, if possible. What is interesting here is that they've found a vampire. I'm assuming they want to bring it back to Germany. This could be a way of turning the tide. It also feels a bit like the video game BloodRayne.Taking this, we set it on the boat. This is interesting is that the ship they get on to gives them a bit more protection than the lifeboat they were on. The lifeboats on this one have been sabotaged so at this stage, they're trapped and that gives it a bit of a contained feel. I really enjoy that. They're also on a German ship where everyone is a member of the allies, so they have to be careful when calling for help. There is a timeless feel while also feeling like it is WWII. They're subtle with the clothing, technology and weaponry, so that all works in its favor from what I could tell as well.Where I want to go next would be the creatures themselves. I can see why we have Teplov in the movie as he can recognize that Mya is speaking Romanian which I didn't realize was a combination of Russian, Italian and some other languages as well. He also gives us the back-story of the vampires. He refers to them as Strigoli which means undead. When we finally see the Patriarch of them, Troy Larkin, he looks like Count Orlac from Nosferatu, just amping up the bat like features. I thought that was fine. There's a good touch with glowing red eyes. Teplov also states that they can control animals and insects as an army. We also they can also control people.Going along with the look then, I'll shift to the effects. I think that all of the practical stuff is good. The look of the vampires to the veins as someone is infected with this like a virus. There is a bit of CGI that goes with this as well, but to be honest, I really didn't have any issues with any of that. There is some CGI/green screen that was done in this movie that really didn't hold up for me. Thankfully this isn't a major issue, but something that did take me out slightly. Aside from that I would say that the cinematography was good and I had no issues there.The last thing that I'll go over would be the acting which I thought was good in general. Phillips and Cooke to me are interesting. The former is an Aussie while the latter is supposed to be Russian. Not that where they're from really effects their character, but I think they work well off each other. Both try to keep their head down and do the right thing. They're strong as our leads in my opinion. Sutherland is solid as this nurse. What works for her is that we learn there is darkness in her past that she has to contend with and it works for where her character ends up. Aside from that, I thought the rest of the cast was distinct and I can appreciate that. If I have an issue with the survivors it is with the writing and how they ended up on this lifeboat together. The vampires were all good as well to help round this out for what was needed.So with that said, I thought this was a pretty solid movie. It isn't one that blew me away, but it knows what it wants to do. For me it ticks a lot of boxes of things that I find interesting like the supernatural, Nazis and containing it on a ship. The setting really works for me and giving it that contained feel. I don't have any issues with the acting and really the only question there is more with the writing. I thought the effects were good for the most part, just some issues with green screen/CGI. What they did for the look of the vampires I was a fan of. The soundtrack to the movie worked with a combination of the music and ambient noise worked there. I don't think this is a great movie, but one that I enjoyed. For me this is an above average movie, just shy of being good.My Rating: 7.5 out of 10"}, {"id": 54, "text": "So, an English man, an Australian, an American, a Russian, a woman and a black man are in a boat when they come across a deserted Nazi warship. The Englishman says...Yes, the basis for this film sounds like the setup for a rather bad joke. It does not end there, the film is awash with cliches, stereotypes and recycled plot elements.How many times have we done the lone surviving girl or the supernatural Nazi super-weapon or the cowardly backstabber? About a billion.But all that said, this is pretty good for what it is. The settings and camera work are pretty good and the actors are committed and competent.The characters are instantly accessible and their predictability adds a sense of foreboding that helps build the tension. I found myself wondering when character x was going to screw up by making the obviously bad choice he was destined to make. It cuts in around the classic 90 minute mark so things don't have a chance to get stale.This is not the best film I have seen all year but I am very glad it exists. It shows that films can still be made that are about fun and the simple enjoyment of a cheap scare and are not afraid of critics beating them with their Media Studies degree.If you like tune-out, shlocky, horror films then you should enjoy this."}, {"id": 55, "text": "You have to be able to overlook the improbability of the situation: a nice diverse selection of veterans all on one raft that made it out of a Nazi attack, rode along for some period of time on a glass pane ocean, and found a boat that somehow grows and shrinks as we cut from scene to scene, which just happens to have the cargo that it does. But given what that cargo is, this isn't reality anyway, so go with it.With this little bit of reality denial, I think this turns out to be a relatively solid psychological thriller. This isn't a horror - the main villain comes off as too campy, too low budget (actually pulling away from Mya, which was a much better presentation.) Thinking about the attempt to develop the characters and backstories as I watched, there were a few points of pleasing character tension that I could hold on to.Overall, with relatively good acting, a good attempt at s character developing script, and a satisfying ending, I can overlook the Halloween masks and get to a 6."}, {"id": 56, "text": "I had the chance to see BLOOD VESSEL at 2019's Monsterfest screening in Melbourne with cast and crew Q&amp;A afterwards which was a pleasure to see director Justin Dix and crew showing just how much heart and love they have for genre content which shows in every frame of the film. Newcomers to genre film will be both entertained by the creepy premise, location and characters and amazed by some extremely cool visuals and practical make-up effects. I would have loved this film as a 15 year old newcomer to horror, but enjoyed it just as much now as a hardened 45 year old genre fan! Dix's influences and in particular homages to 70's and 80's action and horror film are very much on display here without blatently ripping off any one film, rather appearing as fun easter eggs for more seasoned horror veterans. As eluded to in the title of my review this film really does have something for everyone. An ensemble cast reminisent of films like THE THING or ALIENS, a fantastic mix of some old mythology with fresh new twists, excellent lighting, cinematography and score all topped off with genuinely exciting and gruesome special make-up effects. This film deserves to be seen by as many genre fans as possible and Dix and crew need to be offered some very high praise for going above and beyond with the concept of the film instead of just another tired exercise in 'slice'n'dice' slasher film territory as we've come to see in recent years time and again. Dix's background in prosthetics and practical make-up effects with his company Wicked of Oz studios in Melbourne, Australia obviously served the film well, showcasing loads of talent from Oz artists with some fantastic horror character work on display too! Atmospheric, creepy and jam packed with action and suprises. A horror fan's dream film. Dix's enthusiasm for the genre is helping to raise the bar for Australian horror. I'll be revisiting BLOOD VESSEL upon it's streaming and hard copy release."}, {"id": 57, "text": "Adrift in the North Atlantic, survivors of a torpedoed hospital ship are forced to board a Nazi freighter for sanctuary only to find the ship entirely deserted save for a few seared and burned corpses, and the longer they stay there come to find the vampire being transported was responsible and must try to get off the ship alive.This was a rather enjoyable and fun genre outing. Among it's more enjoyable elements is the slowly-engrossing build-up that has some nicely chilling and suspenseful work here. The way of getting onto the ship and the way they begin to disperse throughout finding the derelict remains left behind makes for some fun times as the eeriness of the situation and the ship itself creates some fine atmospheric touches. The situation being stuck in the war with the need for covertness and secrecy is a fine touch as well as the series of discoveries made involving the items and people onboard which keep this one chilling. The other element that works here is the strong second half where all the action in here comes from. Realizing that the strange events have been responsible from a vampire stowed away in the cargo hold to be transported back to Germany, this one really picks up the action as the loose creatures start attacking and knocking off their numbers while inflating their own bringing the sleeping coven back to life. With their devilish appearance, brutal killing methods and an impressive tactic where they feel pain whenever one of theirs is killed or injured to make for a lot to like here. This one does have a few minor drawbacks. One of the biggest issues is the fact that the beginning is incredibly slow-going and doesn't have much going on here. The group would not be in the middle of the ocean as long as they are and still be sniping and fighting with each other, as this seems wholly unrealistic and designed to instill a sense of distrust in them for later. Those are just as problematic with scenes seemingly out-of-context for this distrust angle which is unusual and feels like nothing but cliches to drive this along where no one trusts each other only to make for an unappealing start to things. The other issue here is that brought up due to the sluggish first half, things take way too long before they get interesting and the vampires are loose. It's almost an hour into this before the coffins are found and they're fully discovered as the culprits all along, they seem to come out of nowhere with the first hour preparing this to be about a haunted vessel rather than a demonic vampire clan as their true threat. With that slow-going build-up in place here, it can come off rather dull in addition to all the unrealistic group dynamics for a tough beginning and it's real flaws to hold it down.Rated Unrated/R: Graphic Violence, Graphic Language and children-in-jeopardy."}, {"id": 58, "text": "I had not even heard about this 2019 movie titled Blood Vessel prior to sitting down here late in 2020 to watch it. I happened to stumble upon the movie by random chance, and I was intrigued by the movie's cover. So of course I gave the movie a chance.And I will say that Blood Vessel actually turned out to be a nice surprise of a movie. Sure, it was predictable, but that didn't really play much of a factor, because the overall storyline was good and provided wholesome entertainment.The storyline is one that draws you in right from the very beginning as writers Justin Dix and Jordan Prosser actually managed to churn out something that had that old school classic horror feel to it, and at the same time managing to be something up to date.Not only was the storyline interesting and entertaining, but the movie also had an interesting character gallery to play out the movie's storyline on the screen. And it definitely helped that they had great talents to portray these characters.I was impressed with the special effects, especially the Strigoi creature effects, because they definitely looked nice. There was a very bestial aura to the way these shapeshifting creatures were brought to life on the screen.While the events portrayed in the movie took place aboard a boat only, and the movie had a relatively small cast, then it was actually pulled off quite nicely. The setting worked quite well in favor of the movie, and you definitely feel right there alongside with the characters aboard the boat.As it turned out, then I was actually more than surprised with Blood Vessel; I was genuinely entertained. This was a much welcomed addition to the horror genre. So thumbs up to director Justin Dix for his accomplishments here.My rating of Blood Vessel is a six out of ten stars."}], "reviews_amount": 59}