{"name": "Tony: My Mentor the Serial Killer", "titleId": "tt08017136", "reviews": [{"id": 0, "text": "Nice, tight little masterpiece.good thriller and always maintains the intensity."}, {"id": 1, "text": "What can be said about this film? Like many other films made recently, this one is different from the typical Hindi masala flicks (nothing against them, I think they're wonderful), there are no songs, there is no combination of different genres in one film, it is not a three-hour film, but a tautly woven story that keeps the audience hooked to their seats. Even though there were hardly 30 people in the audience, none of them were looking at their phones or chatting. They all were glued to the screen. This is called story telling. Hats off to the entire team."}, {"id": 2, "text": "Great Movie, Good thriller and always maintains the intensity. There is no part in the movie which gets you bored.Technically very correct and the movie has a lot of logic. The Direction is superb..."}, {"id": 3, "text": "Better watch this kind of sensible movies than watching some commercial non sense movies."}, {"id": 4, "text": "I had accidentally watched this movie and i was expecting nothing but i was blown away by this movie,this movie is great in so many ways,screenplay is very good"}, {"id": 5, "text": "Finally Indian Cinema is maturing. Finally Indian Cinema is maturing."}, {"id": 6, "text": "Tony is one such movie. It starts out not so spectacularly, but the director builds up the storyline admirably, and brings it to a great climax, one that is bound to leave you stunned or surprised."}, {"id": 7, "text": "All charecter doing best of best job.. specially (aashish) i love to watch, suprb movie i suggest all of you go and watch... pasia vasool ho gya😍😍"}, {"id": 8, "text": "I gave an extra point just for the fact that this is relevant cinema. Instead of churning out the next round of mindlessness that earns 140 crores due to the multiplexed masses.."}, {"id": 9, "text": "BEST BOLLYWOOD MOVIE OF 2019. MUST WATCH. COMPLETE VALUE FOR MONEY"}, {"id": 10, "text": "I went to see this movie by mistake as I was under the impression that I was going to watch COMMANDO. Trust me guys, I was pleasantly surprised to see this gem of a movie. I didn't recognise a single name in the film and I was very curious to know who has made this movie and hence I googled the director's name in Interval. To my utter surprise, it was Vipul K Rawal who has previously written Iqbal, Rustom and a short film named Mumbai Varanasi express. I swear, I have seen all these three films and they have made a lasting impact on me. Coming to TONY, it is a brilliantly written film, acted by new comers who look their part and act perfectly. Great background score but more importantly, not a single dull moment. The story moves in a fluid manner and glues you to your seats till the last scene. Too good."}, {"id": 11, "text": "Nice movie!!! kudos to the casting director of the film for finding such fresh talent.. Movie is good , but shows and theaters are less.."}, {"id": 12, "text": "Firstly lets talk about performances every actor/actress lived their roles did 100% justification and cinematography is very natural brings us a realistic feeling while watching, background music is good, an intriguing &amp; subtle writing executed outstandingly!"}, {"id": 13, "text": "Very few movies are so good in all departments.Script - Engaging, real, entertainingDirection - FlawlessPerformance - Outstanding from all actors. It never looks like acting. So real"}, {"id": 14, "text": "Decent Thriller with a Clever Plot. Truly a gem from bollywood"}, {"id": 15, "text": "The first thing that comes to mind when one thinks of Bollywood movies, are the big musical productions complete with choreographed dance number, or the glycerin tears that run for days. This movie, thankfully, had neither of those things. Characterized by a strong script, a fantastic cast, The fact that this was the director's debut movie makes it an even bigger accomplishment."}, {"id": 16, "text": "One of the very best movies I have watched recently."}, {"id": 17, "text": "Awesome plot and pace. ..thrilling to the core. Awesome plot and pace. ..thrilling to the core"}, {"id": 18, "text": "Its excellent,outstanding,superb,mind blowing ...,After long time I watched movie with good script, equally efficient direction.Its ideal example of gripping thriller,on simple storyline without commercial routine big stars."}, {"id": 19, "text": "The acting is top class throughout and the cinematography is exquisite."}, {"id": 20, "text": "But there are also these movies that shine through on the might of their basic premise."}, {"id": 21, "text": "A movie can be great in many ways - Some movies have great screenplay, others have stellar performances, some others have great cinematography or technical brilliance."}, {"id": 22, "text": "Story is well chosen. Screen play is excellent. Movie has tight impact on viewers, and doesn't allow them to blink for a second. Flow of movies is great, and it gives a sustained injection of adrenalin in your body."}, {"id": 23, "text": "Kudos to the fresh talent with new thoughts in Indian Cinema."}, {"id": 24, "text": "A superb story and direction makes this thriller a refreshing change from the regular action hero bollywood movies.The movie is very fast-paced, and keeps you glued to your seat the entire time. The story unfolds brilliantly."}, {"id": 25, "text": "Right from the beginning, the movie is gripping. Keeps the audience guessing by fantastic story and great screenplay. The credit should go to each and every one associated with this !! Thank you so much for creating such a great movie !!"}, {"id": 26, "text": "The film flows as a great thriller as time passes by..."}, {"id": 27, "text": "TONY , is among the best - and bravest - films to come out in 2019 Only one word to describe it: remarkable. No known faces, No songs, No crap, pure story telling and fabulous direction. Each and every department performed perfectly. This movie will surely become a cult movie in the coming times. Mark my words."}, {"id": 28, "text": "We have people blaming #Bollywood movies for content all year long and when a good film releases there's no one to watch it. Intentionally watched #Tony with 50% occupancy and what a film it is!!"}, {"id": 29, "text": "Story is very nice , Newcomers acting reall nice.Good Story with Good casting"}, {"id": 30, "text": "What a movie dude. When first trailer was out I wasn't sure if I gonna Watch it; but 2nd trailer was very good. You guys should watch it; ignore all the bad reviews."}, {"id": 31, "text": "Jabardast story acting direction screenplay everyone actor doing fabulous acting.."}, {"id": 32, "text": "The directorial touch of the movie was pretty good.Like satyameva jayate this movie could have been a cult if some scenes weren't additionally added."}, {"id": 33, "text": "Enough good things can't be said about this movie. It is undoubtedly one of the best and most moving films ever made!"}, {"id": 34, "text": "I am a great movie buff, one of the greatest around. A great proclivity for cinema"}, {"id": 35, "text": "Brilliant...just brilliant. An exhilarating movie experience which demands to be seen only on big screen for its rustic visuals which takes you straight into raw and rugged heartland"}, {"id": 36, "text": "Everyone has done a splendid job. This one is not loose even for a minute. The most important aspect of its appreciation is its star-cast. A lot of new faces and still it doesn't disappoint.."}, {"id": 37, "text": "Its definitely one of the best Hindi movies ever made. Direction, screenplay, narration, acting, music, cinematography, everything about this movie is top notch.Not one scene is out of order and everything is properly explained with no questions unanswered. Dialogues are very sharp and as close to reality as it can get."}, {"id": 38, "text": "Most modern-day thriller films make the killer to be an absolutely inhuman in order to scare the audience out of its wits. Most of the time, however, these stereotypes create a generic murderer a raving, ranting, clearly demented psychopath.Tony is so exact that it chills the viewer, all without the unnecessary disturbing images prevalent in more modern films .Actors fine performances , a tight script and screenplay make Tony a film that is now and will always be remembered as one of the pinnacles of the thriller genre."}, {"id": 39, "text": "This film is something different and unique. something new to watch and i must say it was an experience. Story is good, screenplay is excellent. thankfully there are no songs.."}, {"id": 40, "text": "Outstanding and Unconventional Psychological Thriller"}, {"id": 41, "text": "Absolutely brilliant..The camera work, editing and screenplay is fantastic. This is one of the best Indian thrillers made. By far my favourite film of 2019.."}, {"id": 42, "text": "This movie is like a book with different chapters dealing with different situations and characters. It displays emotions like never seen before. Each scene says something, nothing is redundant or useless. No one in the movie performed below my satisfaction level. But most of all, I like the way it ended. It is really an example of unconventional cinema."}, {"id": 43, "text": "Ignite the fire within and light the way for communities around the world."}, {"id": 44, "text": "This film looks more real cos of the star cast , if it had known faces it wdnt have left impact... The guy who played TONY was simply awesome, It's not easy to play a psycho killer also MARTIN, he performed his part of the oversmart student and a rich spoilt brat perfectly..very natural."}, {"id": 45, "text": "The story of the movie is out of the box.. I hadn't watched an Indian movie in years because I was unable to relate to the film and the stories were somewhat weak. when I finally watched it, I was amazed!"}, {"id": 46, "text": "One of the best movies of the year! The performances are all excellent. Direction is excellent..Don't miss it. Never heard a cinema audience give a round of applause. People were actually clapping."}, {"id": 47, "text": "It is a very intelligent film... I am surprised why the director didn't send the film to international film festivals.. I bet if sent , this film wd have won many awards .. It is a film before time..I really liked it.. After reading abt the director i came to know he is the writer of Rustom.. I really like this genre.. Plus points - A thriller with a fresh cast makes the film look Real. Neg points - Very less shows and theatres.."}, {"id": 48, "text": "Dont go for critics Just go for the film .... One of the best screenplays.. Go watch if you like thriller Movies. I'll give 8 stars..."}, {"id": 49, "text": "Very engaging and brilliant movie It's really sad cuz it got limited theatrical release.Everyone must watch this gem."}, {"id": 50, "text": "Amazing climax super wala movie, I love all the moments of the movie ..loved it amazing acting ,hats ofto all the characters."}, {"id": 51, "text": "Thats great cinema...i just love this cinema Dialogue and movies is awesome till 1st half and in 2nd its get little disturbed but overall good movie."}, {"id": 52, "text": "#PowerpackedBang on!It can become cult if promoted properly...Will keep u at the edge of your seats till the end. So go for it !! Worth for Money."}, {"id": 53, "text": "In one word Mind blowing well written and directed"}, {"id": 54, "text": "Wish more theatres for the film.. cos it deserve it. wish more theatres for the film.. cos it deserve it."}, {"id": 55, "text": "After Many years we get a chance to see this kind of thriller story again in Bollywood. Really Loved the Movie with Amazing Action suspence."}, {"id": 56, "text": "This movie is the PERFECT movie and will certainly be held as an all time classic in the coming years. Concept 100% Direction- 200% must watch this movie to know how to make a film ans what is filmmaking.."}, {"id": 57, "text": "If you have not watched this movie than i will say that Why You Are Alive, Go and watch this Masterpiece of Indian Cinema. I recommend this to every true cinema lover. Worldclass Direction"}, {"id": 58, "text": "Movie starts from first frame,director never wasted any time,as story unfolds it takes complete control of your mind within few moments.It keeps you on edge,thinking what next than again what next.. It ends with pleasant surprise."}, {"id": 59, "text": "Bollywood should learn from this film how to make genuine world class cinema. No songs, no skin show, no glamour shots but simply a gripping storyline. That is all that is needed to make an interesting film. The only drawback was the production value, but that is understood considering the shoestring budget. However, nowhere did it look compromised or cliched. What I liked was the church set that was made with a lot of detailing. Rest all locations looked real. Also, Martin's wardrobe. Funky t-shirts with the satanic designs and his house, looked like the house of some phsyco genius. WATCH THIS FILM YOU LOVE THE THRILLER GENRE AND IGNORE IT IF YOU ARE THOSE EMPTY VESSELS WHO LOVE KARAN JOHAR AND YASH RAJ CINEMA."}, {"id": 60, "text": "Just after the opening titles, a student is caught at a roadblock with an unlicensed pistol. The first five minutes ensure that you are glued to your seat. From then till the end, you have no choice but to stay glued to your seat because one after the another, skeletons start tumbling out (literally). The murders are brilliantly executed and makes you frightened. The two corrupt cops Dighe and Vilas mote are brilliant as are Tony and Martin, one catholic and another Protestant. And between all this is the orphan Ashish. The film ends with a brilliant climax and the last piece of jigsaw falls in place in the last two minutes. Trust me, no once can guess the ending. Masterpiece and brilliant storytelling."}, {"id": 61, "text": "I usually do not write feedback, but for this movie I had to. This one of the best stories in India Movies. Excellent writing and direction. Acting is also good. Start is little slow but after 30 mins movie really picks up and maintain great suspense till the end. Script is very strong. Its most realistic story and flawless movie. Usually Indian movies are never realistic, there will be lot of spice and fiction, songs, crazy emotional melodrama etc. But this one is a master piece and it has the perfection of Hollywood level."}, {"id": 62, "text": "First the Acting. The Actors did terrific acting that lifted my mood. Without good acting movie viewing is not pleasurable. Secondly the music. The music adds spice to the movie. It takes your mind inside the movie. You feel like you are a part of the movie. Thirdly the direction. The director narrated the movie in such a way that I did not even took a pee break during the interval. The direction made the film interesting. And finally and most importantly, THE STORY. The story is awesome. The story is the soul of every film. If the story is bad, nothing can save a film. It will surely die. This film's story is brilliant. It stays strong in the first half and also in the second half. The unexpected and surprising climax stole the show. Finally only one thing to say. Outsanding"}, {"id": 63, "text": "Unpredictable Plot, Excellent screenplay and overall excellent acting by everyone. The only downside was the fight scenes. They could have been much better, but I am assuming these were done by the crew themselves without the help of a professional fight master. Though everyone performed brilliantly, this is without any doubt the Writer/Director's film. He creates the magic through his fluid storytelling on the celluloid with such ease that you wonder if he is a genius or simply a man who knows his craft. No pretentious shots, no fancy camera movements, raw storytelling. This is how film should be made."}, {"id": 64, "text": "What a spectacle of a movie. Story is too good and each character is well cast. Please watch and make these kind of movies the biggest hits so that Indian film industry makes more of this kind of cinema. You won't regret it and you will fall in love with Director. The unique plot of students placing a camera in a church's confession box is both thrilling at the same time scary. More so when they hear the confessions of a serial killer. Goose bumps at many points in the film especially when Tony's secret is revealed. Mind boggling acting by Yashodhan Rana and the guy who plays Martin. What characterisation by the writer. Simply Awesome."}, {"id": 65, "text": "The screenplay is awesome. The writing team n the director did a fantastic job n successfully made this film on a shoestring budget that costs less than what these big banners spend on the costumes of the heroine. The script never loosens its grip on the nerves. You are always fearful to take your eyes off the screen lest you miss something. Indian cinema has truly come of age."}, {"id": 66, "text": "I will be very honest, no one has the Aukat to review this movie. At the most, one can analyse it. Such is the brilliance of the fluid writing and equally good direction. Hard to believe that most of the actors are first timers and so is the director. KUDOS !!!!"}, {"id": 67, "text": "Simply WOW !! Watch it, it's unmissable. It Just hits you and blows you away. Will not reveal anything about it, it's best if you don't know much about it and just watch it and be blown away."}, {"id": 68, "text": "Hell yeah, just watched the Masterpiece, gem of thriller. Wow is the only word is in mouth now for this movie. A rare thriller which was made to look realistic only not as filmy masala content. First half takes time to set platform, sets movie plot then 2nd half blows you away with its masterclass planning and scenes. Writer has done an extraordinary job, people will not forget this story in lifetime. Kudos to the writer and director who I believe are the same person. MARK MY WORDS, SOUTH INDIAN PRODUCERS WILL BE LINING UP AT HIS DOORSTEPS FOR REMAKE RIGHTS !!!!!"}, {"id": 69, "text": "A friend recommended my this film that was recently uploaded on you tube. I watched it without any expectations and trust me, I was blown away. No gimmicks, no cliched clap traps, no skin show, no known faces just plain story telling that bound me to my seat for two hours. This is how films should be made."}, {"id": 70, "text": "Very inspirational and a well made film. Great work. Keep it up. Thumbs down corrupt Bollywood, thumbs up talented independent filmmakers like you. Salute to the actors. Each of them was brilliant!!! P.S: BGM was fantastic."}, {"id": 71, "text": "Amazing concept ...whole team worked very hard ... congratulation team tony..speciallyVipul Rawal sir...👍👍👍👍well done . What great direction and intelligent storytelling"}, {"id": 72, "text": "Awesome movie, awesome story, awesome efforts put by all. Far better than big shot movies in which we see arrogant fake actors."}, {"id": 73, "text": "If the Indian audience stops watching crap from Dharma Productions and Yashraj, movies like these will get a chance to flourish. The Director instead of giving away his film on OTT channels, boldly uploaded it on you tube under a daring scheme. PAY ONLY IF YOU LIKE THE FILM. What confidence in the craft and truly justified. The film is fantastic even though made on a shoestring budget without a single known face. KUDOS TO MR RAWAL. WHAT A FILM SIRJEE !!!"}, {"id": 74, "text": "Fantastic movie. The end made my cry. Fantastic Direction, Superb Story and Screenplay and overall a good watch."}, {"id": 75, "text": "Masterclass!! Plz watch it, I am am sure you Will enjoy each &amp; every minutes"}, {"id": 76, "text": "This movie is the best bollywood thriller, I have seen in a while. outclass movie. the cast is new but every actor did his/her job brilliantly. the suspense and thrill kept me on the edge of seat the whole time. just watch this movie. recommended to a true thriller lover"}, {"id": 77, "text": "The direction is low standard how could he make such á mess. This is insult of Thriller movie. The actors are not upto the marks. The ratings must be decreased."}, {"id": 78, "text": "Finally, we get to see our Cinema experimenting outside traditional boundaries.People who didn't like this movie will probably hate iconic films such as good bad and ugly, taxi driver or raging bull, but these films are showcased as examples of fine film making around the world.TONY is an extremely well made film that deserves it's recognition in our industry. Indian cinema needs more creative projects like this, or else we will be stuck with another four installments of mindless Dhoom's AND  Housefulls"}, {"id": 79, "text": "Left me speechless!! Amazed by the actors Everything is just perfect you should watch this for sure... Intelligent film... Writing is really good... just thought if it had a better look... it wd have worked commercially aswell... but good attempt I must say..."}, {"id": 80, "text": "Another meaningful movie of this year.The story telling of the movie is good . Admist, to all bollywood movie, this movie show the reality at ground level with little fast pacing. I think it is much better than all movie coming nowadays."}, {"id": 81, "text": "This movie was one of the most powerful by Bollywood in 5-10 years. It was jam packed with Powerful dialogues, excellent background score and mind blowing acting and direction."}, {"id": 82, "text": "Great combination of direction and acting and also background music. The whole movie has been crafted so beautifully. Screenplay,direction,Script everything are in sync. Music is also very good.Transition between scenes could have been improved."}, {"id": 83, "text": "This film may not earn the money which is expected due to obvious reasons and its violent content and language of course but I am sure it will surely be in your list when you recommend a film to someone."}, {"id": 84, "text": "A masterpiece that was made a few years earlier than it's time. The current views on the movie shows that this masterpiece was made earlier than it's time...Extremely well directed film .. Not boring for a minute ."}, {"id": 85, "text": "A good concept for a web series but not for a feature film unless u have a big Star or Producer..."}, {"id": 86, "text": "Only Psycho people can make and watch such films....just a one time watch that also cos concept was different.."}, {"id": 87, "text": "Poor Production value , background music is offdated . Camerawork too shaky , Boring locations... dont know what was good in the film... Script was good , i wish it was made with proper budget.."}, {"id": 88, "text": "This film is over rated, liked only by those with low intelligence. As an intelligent man I can make out that the director has used all cliched filmy traps to impress the gullible audience. This movie is nothing but an attempt to discredit Christians and the Lord !!!"}, {"id": 89, "text": "The state of this nation is such that film makers now targeting Christians in India are being lauded as geniuses. This is what happens when you vote the wrong guy from the wrong party."}, {"id": 90, "text": "Let me start by talking about the background music of this film. Outstanding. Mindboggling. The film starts with a high octane title track that sets the mood of the film. The first scene sets the pace of the film and that pace dosent diminish till the last scene. The major characters have performed very well, but it is also the characters with barely a few lines, that make an impact and are noticed. For example, Kartik's mother, when she adjusts her saree and says 'Sochna bhi Mut' to the inspector when he wants to search her is brilliant and evokes a laughter even in the tense situation. The scene where the ruthlessly corrupt Dighe is leaving his house and talks to his mentally retarted son makes you wonder how could the writer have inserted such a small and brilliant cut that shows the ironies of life. The old Octogenarian couple who are surprised that the police visited their place and finally the college professor who indirectly challenges Martin to come up with a project worthy of her class. All these cameo artists lifted the film to a different leval. Even the crusty Head constable Sheikh when asks the guys their names and the way he talks to the girl is hilarious."}, {"id": 91, "text": "What are the necessary requirements for making a good movie? I guess strong acting, realistic judgments made by characters, complementary music and tight pacing are essential elements in achieving this. In all these departments, TONY stands head and shoulders over every other Bollywood movie that has come out in this year. The essence of the movie is that due to some unexpected turn of events, an orphan student gets itself involved in in a bizzare case involving a serial killer and two corrupt cops. Life will never be the same again. All the actors in the film performed brilliantly. Tony as the psychotic serial killer is brilliant and so is Ashish as the orphan student. The movie explores several elements of Indian life such as the rampant corruption of police officers, unyielding devotion to family, and the longing for revenge. All the actions that the characters made were justifiable and any other person in that situation would have done the same. I have not revealed much about the movie in this review because you have to see it to understand the power of this movie. HATS OFF TO THE WRITER/DIRECTOR VIPUL RAWAL FOR CREATING THIS MASTERPEICE."}, {"id": 92, "text": "Edge of the seat thriller !!! Simply WOW !!!Casting - 4/5Acting - 4.5/5Story - 5/5Screenplay - 5/5Editing - 5/5Cinematography - 4/5Background Score - 4/5Direction - 5/5Finally a good thriller movie after a long time. The movie has multiple twists arousing the curiosity of the audience culminating into a superb climax. Even though the film is nearly 2 hours long, it binds the audience to their seats till the very last scene.I strongly recommend this film, especially to the thriller genre lovers."}], "reviews_amount": 93}