{"name": "John Henry", "titleId": "tt08170298", "reviews": [{"id": 0, "text": "I love all the Terry Crews movies, but this was the most boring and terrible movie i have ever seen."}, {"id": 1, "text": "I love Terry Crews. Even his amazing draw and enthusiasm could not save this awful script with a $10k budget. Story is about drug war with a victim caught in the middle who seeks refuge with Crews and his dad. Pretty straight forward but just a bad script. Wouldn't recommend it."}, {"id": 2, "text": "You would think that Ludacris and Terry Crews are established enough that they would no longer participate in substandard movies. It had to have been evident at the time that they read the script that no matter what editing was done, it could not produce any level of quality work.No back story, but a young Honduran brother and sister manage to illegally cross into the US, fine. Sister is kidnapped and rescued, however the brother is shot. How was he alive at the end of the movie with no visible sign of injury.Terry Crews acting was idk, was his intention to be depressed, lonely, sedated?The screenplay music was terrible and didn't fit with the sequences.The action was horrible.How did the cousin charge a cop who had his pistol drawn escape?The dialogue with the cop at the house was garbage.I could keep mentioning different sequences from the movie that all are just as bad as what I have done already but I am not spending another moment with this terribly written, filmed, and acted out movie.Guys, do better next time."}, {"id": 3, "text": "Everyone involved in this film should be embarrassed. It has a terrible story line, unnecessary extreme profanity, and is overall a two-thumbs-down candidate for worst film ever made. It is an atrocious assault and assassination of the character of John Henry who was deemed a legendary hero and this movie is so awful it seems like it is a deliberate attempt to do so.Terry Crews should be much more selective about the movie roles he chooses in the future or his career is going in the toilet where this movie belongs."}, {"id": 4, "text": "I never once could figure out what this movie was really about. Didnt get the theme. Didnt get any of my questions answered like the woman who helped him buy tampons and danced in the store. Who are these random Hispanic kids. Why are they jumping from scene to scene. Cant understand why we are being shown videos from Feb of 1994, they never explain it. Some lady at the end decided to help john. I'm just confused. It turned from a movie of all dialogue to straight gore and western music. The music never once fit the scene, the music over powered the dialogue. I kept having to turn up the volume to hear what they were saying then turn it down because some loud obnoxious music came on. I want my money back. That was dumb."}, {"id": 5, "text": "30 minutes into the film and I am on IMDB for a plot because I don't know what I have just watched the half an hour. Even after reading the plot, it doesn't relate to what I have been trying to watch. The camera work is terrible, some footage is obviously from a mobile phone! The editing is atrocious, the editor should have been clued up on the plot! Thankfully I did not have to watch this in a cinema. Let me try get through the last hour!"}, {"id": 6, "text": "Quite Posse the dumbest and most incoherent movie ever made. Not sure how anyone could have read this script and said yeah this seems good, I'm in?"}, {"id": 7, "text": "Was like a music video and wannabe Tarantino movie rolled into one. Pacing was awful. The scene with the two gang members talking about The Human Centipede was an attempt at the Royal with Cheese dialogue from Pulp Fiction. Just a waste of Terry Crews and Chris Bridges' talents."}, {"id": 8, "text": "The plot of this film moves at a snail's pace, and ultimately doesn't go anywhere. It really makes very little sense. The concept isn't a terrible idea, but what really confuses me is that the writer also directed this film, and couldn't bring it together any better than this. Confusing flashbacks that are uninteresting at best, and gunfights with people standing around, looking down gun barrels just waiting to get shot. The only excitement came from my anger at the wasted potential of this film."}, {"id": 9, "text": "Don't even attempt it! I loveTerry but this movie shouldn't even be on Netflix. The plot is ridiculous, the movie is just all round horrible! Some scenes were surely shot on a low budget flip cellphone! It's not good!"}, {"id": 10, "text": "The whole movie is a complete mess. I can't believe this made it to theaters. I'm so glad I waited to watch it for free and even then I wanted my time back."}, {"id": 11, "text": "Extremely awful , it deserve to be put in the nearest trash!"}, {"id": 12, "text": "I don't know how this movie got made it was that bad. In this age of countless things to watch I can't believe this was able to be made and pass for entertainment. Save yourself some time and give this a big miss."}, {"id": 13, "text": "Terry Crews and Ludicrous should be ashamed and embarrassed . How desperate can you be to act in such a terrible low budget movie? I'm sure they don't NEED the money.( Which was probably very little). So why??? I don't get it. This movie was so crappy. I feel like I could have directed it better and written better lines. Good grief:((I love Terry Crews ....but this??!!"}, {"id": 14, "text": "Terry Crews as folklore hero, John Henry. Unfortunately, this film is far from a steel driving man character type. A silly story, with silly characters. It felt like an 8 year old wrote this story, and script. Lousy dialogue, lousy characters, and lacking a cohesive story. I did enjoy Ken Foree's performance, but it wasn't enough to save this crappy film. Anything for a buck filmmaking."}, {"id": 15, "text": "Im sorry to say this but it was awfully week and bad. Bad movie. I should re watch a Nicolas cages movie it would be better"}, {"id": 16, "text": "Only thing good in the whole move was...DJ Quick Straight to CityEverything else was a zero!"}, {"id": 17, "text": "Big Terry Crews fan as well as Chris Bridges. The under motivated writing was drowned out by the soundtrack, which seemed to have a new tune every 5 lines or two minutes. I couldn't tell if this was a movie or a music video, noting the overwhelming music. The audio didn't help either. I spent 90 minutes with the volume controller in my hand between the ominous music tones and the low muttering lines spit. Just because something is in the top 10 on Netflix doesn't mean it's good, it's trending and those props go to the two aforementioned actors alone. Without Terry and Chris, no one would have watched this film. Disappointed to say the least. There are no spoilers to report because the movie itself is spoiled."}, {"id": 18, "text": "Movie tries to copy the style of a classic revenge tarantino film... but, fails completely in every aspect. very corny script and terrible writing. i feel like this script wouldnt even do well in an 8th grade english class.terry crews needs to stop taking whatever roll lands in front of him. and as for ludacris i expect nothing less!don't waste ur time folks."}, {"id": 19, "text": "Where did the Hispanic girl come from? What about the old school mate what happens between them? Why is the music so loud you can't hear them speak? Why is there videos from 1994 popping up here and there? I understand the basic point of the movie but it's a hot confusing mess."}, {"id": 20, "text": "Terry Crews goes after his former gang members and family to save a couple of Honduran kids. In the end, he uses the sledgehammer you see on the DVD cover because he does not like guns.Would have been better as the graphic novel they showed during the credits. Lots of blood. You knew where it was going and who cared? Never got to know the characters as half spoke Spanish and John didn't speak much.Guide: F-word. No sex or nudity."}, {"id": 21, "text": "Let get this straight onky reason I've rented this cz of Terry Crews, Ken Foree and Luda. With this kind of decent starcast you ought to make a decent John Henry adaptation. But it went downhill from the very start. Bad acting, horrendous screenplay and mediocre script. 15mins into the movie you will loose interest and after 30mins you are not missing anything. Its just plain boring. By the time they introduced Hell ( Luda ) you are not invested anymore. Only if you are a Terry Crews or Ken Foree fan you can give it a watch."}, {"id": 22, "text": "&amp; I don't mean this in a good way. Acting wasn't terrible b/ the script was craptacular! I can't even imagine the actors were paid a lot to make this sulfuric poot of a rotten egg! It's so bad you just have to laugh!"}, {"id": 23, "text": "I love TC he's so great and everything but whoever wrote and directed this film really screwed up bad! They had one job!! The actors did well, but they would have done so much better with a good plot. There's so many switch ups to the plot that it really just doesn't make any sense! I'm black and puerto rican and it was still not good. Has nothing to do about race or where you're from..... Uh... this was just blatantly bad..... Have I mentioned that it was bad? What a let down."}, {"id": 24, "text": "Seriously, this is simply not worth your time! This was one boring flick, was hoping there was atleast something decent, guess only place hope is ment to be is in church."}, {"id": 25, "text": "I think it's understandable why many people might think John Henry might deliver the goods - there is its title, the setting being gang territory in Los Angeles, and the fact that Terry Crews is the central protagonist. However, I think just about anyone who sits down to watch this movie will be very disappointed. If you think that there would be non-stop brutal action, think again - after the opening action sequence, there isn't another action sequence for about an hour. And when the action does come, it isn't particularly well done, mainly due to the fact that it's pretty poorly directed and edited at times. The overall amateurish feel of this movie no doubt comes from the limited budget; while the movie never becomes incredibly cheap and tacky, it's obvious that the filmmakers were working with some severe limitations. Terry Crews can't do much with his role, possibly because of a screenplay that doesn't explore his character much, as well as making a number of other characters and plot details murky. This could have been a great update to the blaxploitation movies of the 1970s, but it's pretty much a misfire."}, {"id": 26, "text": "I really wanted to like this movie. The movie was so boring &amp; dumb Throughout it I had a urge to just turn it off but I didn't and tried to give it a chance but it was terrible! The whole story line was stupid! The acting was bad! The music was annoying! Tge music was terrible &amp; it would play the spanish music at the wrong time! Whoever made this movie need to quit!"}, {"id": 27, "text": "At some point, I thought like I was watching Luke Cage. Not much action beside the scene at the beginning of the movie. Not recommended."}, {"id": 28, "text": "This movie doesn't even know what a plot is. Utter waist of time. Go watch grass grow."}, {"id": 29, "text": "I'm a huge fan of Ludacris. This movie has been the worst he has ever been in. This movie had a lot of great stars, it still flopped. Each person in this movie I've seen you in other movies, come on you can do better than this! Whomever the director, writer or producer was - shame on you!. I' so glad I didn't pay no more than $7 to see this movie. #Backyardmovie"}, {"id": 30, "text": "That was just terrible.Watch the first five minutes for a laugh at how bad a movie can be."}, {"id": 31, "text": "That is if you are some film critic looking for the top 10 worst films"}, {"id": 32, "text": "Storyline vague and inconsistent. Over acted, corny and a terrible waste of time. Music didn't fit, none of the characters had any depth and massive continuity issues. Storyline was only surprising in that i couldn't believe it was quite as bad is it was. Everything about the film is low budget and poorly thought out."}, {"id": 33, "text": "Omg, what is up with that tampon purchasing scene?? The acting was so bad and the CGI bullet strikes were proven low budget effects. Let's not forget to mention the amateur acting, I expected more out of Crews and Luda....my bad."}, {"id": 34, "text": "Nothing in this movie is sensible, it's all over the place and just corny. From the dry acting to every single song/score choice, its just utter garbage..... not one redeeming quality in this film, not to mention the horrific effects, i get it they spent all their budget on terry crews and ludacris, but really a student can produce better vfx then whoever edited this film........"}, {"id": 35, "text": "1. This is what happens when you have producers, writers and directors trying to tell a story that doesn't culturally belong to/ resonate with them AT ALL .2. Its gore over actual story (in a cop out way) and I LOVE Tarentino! So thats saying something!3. This was excruciating to watch all the way around"}, {"id": 36, "text": "Ok, like everyone else, I saw Terry Crews and Luda. So I say to myself, This is great quarantine tv. Holy. Sh*+. This movie is plotless, erratic, Needlessly loud, full of random characters with no backstory, and to top if off, creepy dancing in front of panty liners in a local pharmacy. This is a 7th grade mocking of a Tarantino movie on a $4000 budget. I swear to God, i was waiting for the credits to say Shot on my iphone 5. The big names in this movie had to have lost a bet, or had some strange clause in a studio contract they had to follow. I finished it, only as a shear test of mental toughness. Which provided the only entertainment for the 90 minute playtime. Id rather be in a NY subway 4 weeks ago while getting coughed on and licking hand rails, before I watched this again. DONT DO IT. But at least I can say, I have a new worst movie Ive ever seen."}, {"id": 37, "text": "It isn't terrible but far from good as well. I think the director may have watched too many Tarantino and John Wick movies, And old western movies.It's a weird movie to review, the whole 1 and a half hours went by quickly without any boredom induced as such, it's just there seemed to be nothing really done in that 1 and a half hours. Even the cast were fine, the Déjà vu felt throughout is clearly been overdone with John Wick and as said Tarantino as a whole."}, {"id": 38, "text": "What they should have done in this movie was use the N word a few times more, as it would have contributed immensely to it's less than mediocrity. Absolutely disgusting, between both the dialogue and the sound track. But, I watched it to the end so I could honestly say this. Riots have been created over using that word, and the director THREW it out there like it was OK. IT'S NOT!"}, {"id": 39, "text": "There have been more interesting music videos than this"}, {"id": 40, "text": "I decided to watch this after a few drinks one Sunday and I was entertained. It's a decent direct to video release which offers an interesting take on the John Henry story. Terry plays the role fairly straightforward but it works well and there are a few decent comedic moments in the film. Overall it works well for a direct to video movie."}, {"id": 41, "text": "Awful movie, i will never recover from this!Crikets most of the movie, very easy to figure out that they produced this movie on a very small budget."}, {"id": 42, "text": "I'm a big Terry Crews fan and went into this wanting to like it even if it was a b-grade action. Sadly this was terrible from the opening credits, I persisted for about 10mins of the movie but it was unwatchable. Honestly hope Crews didn't loose to much money on this one."}, {"id": 43, "text": "It soaks it at the end but I totally love this film. It's a perfect homage to the black exploitation era. Very slow drive but worth it. Terry Crews gets to play a super hero from the streets. Makes me feel like he needs to get in one of those comic book costumes and get real with the superhero thing. Lucdaris plays the perfect street villains. Just really perfect. The music perfectly fit the vibe and the tone of the film. I think I actually was expecting Terry Crews to play the actually John Henry but what I got here was just as good. If you are a fan of 1970s black cinema get yourself in that headset to watch."}, {"id": 44, "text": "I always thought Under the Cherry Moon was the worst movie ever!!!! But I think John Henry has it beat..."}, {"id": 45, "text": "Absolutely no idea what this movie was about. Easily the worst movie I ever watched."}, {"id": 46, "text": "I don't know if the director was trying to do a gangland movie in the style of an old western or what but this is a total fail. I kept waiting for the action to pick up onto a good old action flick but the pace was so slow it was putting me to sleep."}, {"id": 47, "text": "What a waste of time!!!! The entire movie makes no sense... confusing, just stupid, and horrible end!! Don't waste your time! I would give 0 stars if I could!!!"}, {"id": 48, "text": "Funny when I told one of my friends about this movie they told me they can't imagine terry in a role that's not comedy. His acting wasn't good at all along with the other casts who look like this might have been their first movie. Who would risk their life for kids they don't know? How he got shot in the head and shot then shot like 2 times in the body and still survive? Some of the scenes made no sense. And some of the people that show up in the first shoot out scene didn't they die? how did the brother get away from the cops?"}, {"id": 49, "text": "Tons of foul language for have no reason to contain in this movie. Not a comedy by Terry Cruise at all. Makes no sense. While I like him as an actor this movie tries too hard to be a monster type film. Don't recommend to watch."}, {"id": 50, "text": "I love terry crews but this movie was by far the worst movie i have ever seen, script made no sense and the music was unnecessarily loud this is 90 minutes of my life that i will never get back"}, {"id": 51, "text": "OK first off this has nothing to do with the main character (supposedly) being very strong, absolutely nothing. The story that can only be loosely termed a story is the usual about drugs, hoods and poverty. There are whole parts of the movie that don't do anything but play some sort of pointless scenes that add nothing. I can only think that the director was consuming large amounts of illicit chemicals and that in his haze the whole movie made sense to him and was a masterpiece , that any audience would also have to be out of their box to enjoy it or to make any sense of it is apparent."}, {"id": 52, "text": "Trying to think of one redeeming factor - and nope, I've got nothing - truly awful movie."}, {"id": 53, "text": "This garbage tries hard to be some kind of spaghetti Western with a bit of tarrantino chucked in for good measure. But instead it's slow, got no story or pace or style so fails on all counts I have seen TV movies better written."}, {"id": 54, "text": "First of all I'm a big fan of Terry Crews, he is brilliant and so entertaining to watch, but what the hell was this pile of junk? I turned it off half way through, it was so slow and so bad, I'd rather watch paint dry.What a terrible film."}, {"id": 55, "text": "There are some films that are so badly made that at some point you just start to laugh, or cringe, which provides some sort of comical saving grace at least. This one just stays dire, with no comic relief to temporarily avail the awfulness. Shocking in every department (special mention goes to the tone-deaf sound crew) it's hard to believe that somebody approved this excrement before it was released, as surely if they had done, it would have tossed it in the bin, or the project restarted from scratch. We live in a world where too many things are rushed, with little thought. Let this pitiful excuse for a movie serve as a warning of what can happen as a result of this."}, {"id": 56, "text": "Sometimes before you even start a film,you just already know what am I doing? This was painful, the acting was garbage. The plot non existent. The soundtrack was confusing and not up to scratch. The production and direction was as if they had just come off the street and done the job. I hope this helps others to avoid at all costs, if you read this review and still watch. Then that's a form of self harm"}, {"id": 57, "text": "I love Terry but this film is diabolical, like all other reviews (which I wished I'd read prior to watching) I cant understand what the movie wants to be, its more confusing with the added clips from 1994. Its a dont watch from me."}, {"id": 58, "text": "I wonder if Terry Crews had any idea how badly the director would let him down in this one. Hard to imagine he would be happy with the final cut of this film."}, {"id": 59, "text": "Everything is wrong with this movie, down to the most basic things. in the interest of not wasting more of my time, i won't say any more... except that there is a short music video randomly in the middle of the movie. baffling. (1 viewing, 7/4/2020)"}, {"id": 60, "text": "This piece of waste management property belongs in a dumpster. We made it 30 minutes in and it's terrible. Total garbage, don't waste your time. I feel embarrassed for the actors. Poor terry, they did him dirty on this one."}, {"id": 61, "text": "John Henry is a man, that according to legend, physically races a machine designed to replace him in the railroad industry. He wins against the machine, but pays the price due to his exertions and dies.When I saw the ad... I thought it could be good. Then I read the synopsis. Not even close to the legend. They did however show a fit black man with sledgehammer. Which really makes it more disleading.Shame on you Terry, and shame on Netflix."}, {"id": 62, "text": "Just plain bad. Big Terry Crews fan but just failed on many levels. Ludacrous as the main bad guy was ridiculous.Dammit Terry, you're better than this!!!!"}, {"id": 63, "text": "What started off as a slow driving movie with a decent story. Turns into a snail trying to scratch with no direction. It was a waste of talent and time. That's is all"}, {"id": 64, "text": "So bad! And I'm a big Terry Crews fan. This movie is just so bad. Had so much potential but just fell short."}, {"id": 65, "text": "The premise of the movie was good, but they did nothing with it. The storyline was bland, had little drama, and no real pacing. An opportunity wasted in my opinion, where a better story could have made it much better."}, {"id": 66, "text": "I like Terri Crews it's the only reason I watched it. I will say it was weird and I get what they were trying to do and I finished it so I gave it a 3."}, {"id": 67, "text": "This is literally one of the worst movies I've ever seen. Ludacris, how could you put your name on this??"}, {"id": 68, "text": "The first 20-30 minutes didn't make any sense. The plot? I was confused just about the entire time. The scenes are all way too unnecessarily long. I mean, I see where they were going with the movie, but it really was all over the place."}, {"id": 69, "text": "This film is absurd, the script is all over the place and makes little sense. The dialogue is terrible. It's unfortunate because I like Terry Crews quite a bit but he had nothing to work with here. Maybe a 4 rating if you're stoned, but sober it's a 2."}, {"id": 70, "text": "This movie is a confused mish-mash of story telling styles....It's start of with a dog being run over by a gangster...so I think ; ahhh John Wick revenge style movie .....and NOPE not at all.Then it goes into a save the girl action movie, like Denzel's movie, the equalizer, all the while the pacing is all over the place. You end up with comic book esque story, gangster crime drama and over the top action that just don't go together. With each style clashing horribly. Here is what I mean, most crime dramas have to feel realistic to appreciate it's impact emotionally, that tone is undermined by goofy comic book style action that's smashes realism into bits......In the end it's a disconnected mess and writers and directors take note of how NOT to make a movie."}, {"id": 71, "text": "I decided to watch this movie because Joseph Julian Soria and Terry Crews was in it. After the 5 minutes, I was disappointed and I fast forward most of this terrible movie. I wasted 90 minutes of my time watching this crap."}, {"id": 72, "text": "I had higher expectations for this film. It had a decent cast and although the acting wasn't horrible - the script and editing just didn't allow any real flow. It is Tarantino-esque but for the most part fails."}, {"id": 73, "text": "This movie reminds me so much of Hobo with a Shotgun, as in it had potential, and with a great lead, but it falls flat with a terrible, boring over talkative storyline that slowly lulls you to sleep.Not worth the time or the effort to watch this one folks."}, {"id": 74, "text": "I saw a quick ad that said this was a good movie on fbook. The next day, I happened to be bored so I decided to give it a shot. At the beginning, it feels like it's going to be like The Equalizer or John Wick. I was sadly disappointed. This movie turned out to be a ton of filler. It feels like this movie is 75% shots of palm trees. It's about 25 minutes worth of movie dragged out by slow-mo shots and long breaks where they try to showcase the rather mediocre soundtrack. Terry Crews barely even acts in it. Mostly his character is stationary with an uncomfortable look on his face. The one bright spot was Ken Foree. His scenes were quite entertaining."}, {"id": 75, "text": "Terry Crews did a good job for the most part for a serious role when he normally plays a comedic role. There wasn't much of a plot in the movie other than vengeance. The time of vengeance was maybe 20 mins of the movie. It is kind of slow, and I couldn't find a theme. I gave it a three though because the My name is John Henry meant more than as it was said to be."}, {"id": 76, "text": "Plot was weak if it was an actual plot at all. Wouldn't watch this ever again."}, {"id": 77, "text": "This movie shouldn't have been made , Didn't make no sense at all .. Because John Henry is a legendary person ."}, {"id": 78, "text": "Sometimes, you need to ignore the reviews cos once its outside the norm of the white society, it gets peddled with poor reviews. That being said, its a movie that is relevant to certain demographics, me included."}, {"id": 79, "text": "This movie has some of the worst music I've ever heard in a movie. Why so many different genres. Makes no sense. And neither does the music.This is waste of talent for both Ludacris and Terry"}, {"id": 80, "text": "Sometimes it seems like there isn't much original cinema these days, and although this movie is based off of the folktale, it's unique. Terry Crews proves once again that his talent and ability to convey the sensitivity and vulnerability of his characters is as impressive as his musculature. Ken Foree is also great, as well as the rest of the cast. The music and cinematography are fantastic, and it showcases South Central LA with reverence. Cool movie if you can get in the right frame of mind."}, {"id": 81, "text": "Poor Acting Poor storyline Poorly made.Dreadful movie."}, {"id": 82, "text": "My motto in life is if you're going to rip off Tarantino at least make the movie watchable. A forced style, poor script and equally as poor direction make the 90 minutes run-time feel like a day. Avoid this film like your life depended on it."}, {"id": 83, "text": "There's no coherent plot, the characters are dull and one-dimensional and I stopped watching after about thirty minutes because I just had no interest in finishing this film. Turned it off after seeing a guest washing the pots, because for some reason two grown adult men left it to a poor Honduran woman who had just escaped from human traffickers to do them.I wouldn't waste your time even starting to watch this."}, {"id": 84, "text": "Terry Crews is great but this movie definitely isn't. It's a waste of time"}, {"id": 85, "text": "Love big TC and liked the look of this. Awful plot, awful script and awful acting.Very very slow and coupled with the above makes this movie a hard watch. No the worst I've ever seen but it is in the basement.Yes it's a low budget movie bit after watching I'd assume the director is a keen tarantino and John wick fan. And the random wild west music!?Only watch if there's literally NOTHING else to do"}, {"id": 86, "text": "I was left so confused by this movie I don't even know what to say about it. What a waste of time. Wanted to stop it so many times but I thought it will get better and continued watching ... big mistake!"}, {"id": 87, "text": "Absolutely dreadful film. Dont waste time watching it. Terry crews let down big time with such rubbish!!"}, {"id": 88, "text": "This movies is simply annoying. Don't bother to watch"}, {"id": 89, "text": "If you've got nothing else to watch this film is worth a try. Some really stupid bits, but also some really fun parts too. The only thing I wasn't happy with was the racism towards white people. I'm with the BLM, but come on, let's use films to promote equality for everyone"}, {"id": 90, "text": "If I could give it half a star I would. It's absolutely awful."}, {"id": 91, "text": "Seriously terry? What are you doing? You are miles better than this movie. I honestly think a home made movie would be better than this crap. Avoid it."}, {"id": 92, "text": "Honestly, the movie artwork and cast are the only good thing. This is the kinda movie you play (not watch) when you need to tidy up the house. Absolutely disappointed 😔"}, {"id": 93, "text": "I have no idea how this is in the top ten on Netflix. Possibly one of the slowest paced, most boring films I have ever seen. Terrible film."}, {"id": 94, "text": "Saturday night looking for a film to watch, I see the image of John Henry and its terry crews stood with a sledgehammer. I'm sold I'll watch this, wish I'd never bothered so many times I wanted to switch it off but thought it'll get better, it never does by the way. Slow boring and when the microsecond of action comes you don't see anything. As another reviewer said like watching Luke cage something else I wish I'd never bothered with due to its slow pace. Netflix should be embarrassed to show this"}, {"id": 95, "text": "If this is the best black content Netflix intend to put out then I'll cancel my subscription. This is the one of the worst movies I've watched. Terry Crews WTH are you doing in this tripe. Terrible acting all round."}, {"id": 96, "text": "What a load of rubbish, I can't believe I have watched this to the end If you watch this you will never get that time back"}, {"id": 97, "text": "So just for the comment to much white in the world already it gets 1.Can't wait for movies to comment the same in reverse. O wait....."}, {"id": 98, "text": "Move over Gigli, there is a new sheriff in town - John Henry is without question the worst movie I have ever seen. The story line, the acting and the cinematography are all a master piece of crap. The storyline is too pathetic to go into. But it just goes to show that using a good actor doesn't necessarily yiled a good result."}, {"id": 99, "text": "The first page of reviews are all extremely negative, and I get it that they were disappointed, but the truth is that there are way worse movies than John Henry. That said it wasn't great. I'm pretty sure Will Forbes watched a lot of good movies from famous directors (I'm not going to mention them, we all know them), and he tried to make something similar but he totally failed doing that. The soundtrack wasn't really in synch with the action, another poor choice in my opinion. Not that the songs were bad, they just didn't fit in the action sometimes. As for the acting, that was to me the weakest point, with a lot of actors that normally do better. I think Terry Crews is better in comedies like Brooklyn Nine-Nine. In John Henry he was out of his element, mediocre at times. I wished I liked it more, there was potential, but in the end it's not worth your time."}, {"id": 100, "text": "Honestly, only reason I watched was because of the star power in this film. However, don't waste your time. What's sad is it really had potential to be a good film. I saw it almost as a graphic novel. However, some scenes were done so poorly it looked like an amateur film done by an freshman kid at film school. But then, some scenes were so beautifully shot. Very weird. I did like the old Camcorder scenes that were thrown in. It just felt like there were different directors. I think all the actors tried their hardest given the circumstances. Honestly, the best acting came from Berta. Terry Crews and Chris Bridges are good actors, but it just felt forced ... like it didn't fit right. Almost like they signed on the film to help a friend out or something."}, {"id": 101, "text": "Felt like Tarantino but slow. I like Terry Crews and nice to see him cast in a different roll. An important message of choice, hope, redemption and justice."}, {"id": 102, "text": "Didn't get the concept of this movie. It was so bad I feel bad for terry crews to take part in it"}, {"id": 103, "text": "Wow what a awful film this was,it was so awful that i just coudnt finished watching it and i turn off my computer 30 minutes before movie ending,honestly im surprised and shocked how was able to watch this film for a hour before turning it off,everything in this so called film was awful,performances and acting was horrible,story was so over the place and messy that i was starting to get headache ,action scenes were so ugly and disgusting looking that i had to turn my head of it,seriously im wondering how can movies like this one be made and realeased on streaming,if i were some guy in charge who watches films and decides what film will go on streaming or cinema,i would throw this film in a garbage or even burn it so i never watch it again,for the love of god dont waste your time on this crap"}, {"id": 104, "text": "I never write reviews but I felt if I could help anyone make a decision not to watch this I have done my job!"}, {"id": 105, "text": "I've seen some really bad movies from Tougher than Leather to Radio w/ Cuba Gooding Jr. John Henry has to be close to top 3 on the list. To be honest, Eric Roberts has a few movies better than John Henry. The plot doesn't make any sense, the acting is plain terrible, and the score is way too loud and doesn't blend with the movie scenes. Did I mention that the music was so damn loud?! Lastly, there was litteraly a music video embedded in the middle of the flick. Why? The only redeeming thing about the movie is that if you watch it tipsy or high, you'll get a laugh from the obsurdity. Other than that, you're better off watching paint dry!"}, {"id": 106, "text": "Damn. Had soooo much potential. Terry crews was solid. Luda was his usual self, not sure he's totally convincing as a kingpin. That being said the movie made no sense. It was completely useless. John Henry could have been the hoods John wick. Last 25 minutes were kind of cool but just confusing. Solid graphics and the only thing that saved this movie was the directing. The directing was solid but the story and script were fairly weak. Way to much Useless dialogue in each Scene. Even though The ending was descent it just made zero sense. There was no meaning"}, {"id": 107, "text": "I'm not sure why this movie gets so much hate. Yes the plot is simple, but not confusing. Acting is fine, action is ok. The complaints about the bad cinematography Is invalid. I think people just don't remember that cam corders in the mid 90's were that bad. It's supposed to be grainy, that's the point. Yes the director is going for a Tarantino vibe, but isn't as talented, but overall still an enjoyable movie. I was going to rate it a 5, but ultimately the ending was actually pretty good, so gave it a 6. Go in watching with lower expectations and you'll actually enjoy it."}, {"id": 108, "text": "Expect more from Chris Bridges and Terry Crews as both are great actors, but this story was terrible. Kept waiting for it to get going, get better, and even at the bitter end I was left feeling, WTF was that. 90 minutes wasted."}, {"id": 109, "text": "Likable characters decent story line but muddled, protracted, confusing, and in the end just poorly constructed. The young lady is a decent actress actually. Believe the reviews people y'all did a terrible job. Straight up their it is."}, {"id": 110, "text": "🤣🤣🤣 tertible just wooow terrible. If they stuck to the orginal story n made this back when michael clark duncan was alive u might have something. But this was just stupid not even hilariously bad where u have a few laughs (not even that....what ever that was strapped to ludacris face was funny) just...swing and a miss netflix!."}, {"id": 111, "text": "I am a huge Ludacris &amp; Terry Crews fan along with DJ Quik. With them as executive producers, I thought it would be worth a watch. I wanted to support the brothers. Despite having the usual L.A. gang theme. I thought why not I like everyone involved in the project. Maybe they teamed up for a good movie. It was not worth the hour and 32 mins of my life. It hurts to say that. I was hoping that it would have some redeeming quality. But that never happened. Crews and Luda were subpar. Horrible character development and just bad writing all the way around. Too many holes in the story and how DJ Quik came up with bad music and music that had no connection to many of the scenes. One song out of the whole movie was decent. Other than that as much as I hate to say it. I would not waste your time with this one. It won't even have a cult following. Yes, it is that bad. I hope that maybe the team up with a better script. Ludacris and Crews have decent past rolls so hopefully, they team up again for something much better."}, {"id": 112, "text": "I mean.... I don't even... But.. just.... There are so many things happening that it is difficult to pick apart all of the problems. We get an opening scene that was made by someone who has seen a few too many Tarantino movies, random clips of a vhs tape that don't lead to anything, just so much about nothing. Terry Crews, I love you in everything you do; Ludacris, I appreciate you wanting to flex your swagger as a villain..... This movie ain't it...."}, {"id": 113, "text": "05/23/2020 The lack of reality in the storyline really hurts this all black cast movie. Couple that with an excess of cliché's throughout and it makes this movie almost funny at times. If you expect little going in, you won't be disappointed. Bon Appetit'"}, {"id": 114, "text": "Love Terry Cruise and love Ludacris in movies but this movie is a hard miss."}, {"id": 115, "text": "I'm thinking this was about the John Henry I grew up knowing about not this new person they got. Messed up my history I'm not happy about this."}, {"id": 116, "text": "Honestly and truly, the worst movie I've ever seen. I've seen a lot of bad movies but this one takes the cake. The writers of this movie need to reconsider their career path. If you value your time... well even if you don't, it's still not worth it. 0/10, would not recommend."}, {"id": 117, "text": "I was very skeptical of the usual silly acting Crews in this low budget drama. Surprisingly he played a decent serious role dealing with realistic violence in our inner cities. Contrary to some of these negative reviews the story was very straightforward and easy to follow. The acting while not Oscars worthy was good. The throwback video of John's past was very cleverly done. Recommended watching!"}, {"id": 118, "text": "I don't understand the low rating on this film, its a decent watch, a film of 2 halves goes from hideout to blood and guts but worthy of a late night watch."}, {"id": 119, "text": "Too many white liberals and black people in the comments with a chip on their shoulder. The bad reviews were not from white people who dont like the truth about society, but rather the movie being extremely mediocre and offering nothing.It amazing me how white liberals and black people still think white people like or dislike a movie based on the skin of the actors - you seem to forget how popular eddie murphey, wesley snipes, terry crews, will smith, martin lawrence, densel washington, samual jackson, jamie fox, morgan freeman, laurence fishburne, richard pryor and hundreds more are extremely popular with white people, and they liked them because the acting, story and personalities were great and enjoyable."}, {"id": 120, "text": "It is QUITE CLEARLY a modern-day retelling of the American Folktale of the legend of 'John Henry'.People can't be that stupid to give this movie 1's and 2's because they don't get it. What a JOKE you people are.This movie was very well done and I very much enjoyed it - in fact I think I will be rewatching it again quite a few times - I saw it about a week ago now and just happened upon this page again to see what people were saying as I know this is NO hollyweird production. The script/story kept me gripped into the movie and I absolutely loved the ending. Lot's of emotions evoked. Not a giant race-baiting show, thankfully (there is ONE single line I did not like, total)."}, {"id": 121, "text": "This movie is refreshing, and unfiltered. I loved every second of it."}, {"id": 122, "text": "Life isn't fair for anybody in first-time writer &amp; director Will Forbes' John Henry, a simple but savage thug-life thriller with brawny Terry Crews tangling with Chris 'Ludacris' Bridges. Clocking in at 91-minutes, this predictable but entertaining, R-rated melodrama concerns an interesting relationship between the heroic Crews and the utterly depraved Bridges set against the real-life setting of contemporary Los Angeles. As much a character study about the titular titan as it is a bullet-blasting B-movie, John Henry delivers exactly what its audience yearns for without being cheated with ridiculous lectures about morality. An undocumented Hispanic brother and sister, who have escaped the devastating terror of Honduras for the freedom of America discover that nothing is perfect in the land of Uncle Sam. No sooner have these Central American refugees crossed the border than surprising complications separate them. An African-American gang with its tentacles deep in the sexual slavery racket abducts the naïve heroine Berta (Jamila Velazquez) when she and her brother Oscar (Tyler Alvarez) are walking the mean streets of Los Angeles.During its opening fifteen minutes, John Henry introduces us to its hero and villain and depicts how these two cousins have drifted apart as adults during the intervening years. One emerges as a ruthless gangster chieftain desperate for 'respect,' while the other resides in apparent anonymity after he had committed an act of violence that traumatized him. Little about John Henry has anything to do with the legendary, steel-driving African-American folk hero, except for Terry Crews' mesomorphic physique and a sledgehammer. Just when you think you have this modest, low-budget thriller figured out, Forbes and freshman writer Doug Skinner sling in some surprises which will catch you off-guard.John Henry opens at a gangster hideout where four African-Americans garbed in white outfits, like the villains in the recent SuperFly remake, are bragging about their exploits over a friendly game of cards. Gangster slang and profuse profanity riddle the dialogue as these three hard-boiled goons and one tough gal gamble away the evening. Suddenly, one of the four gets the shock of his short life when a slug smashes into his stomach. Four Central American females that the primary villain, Hell (Chris 'Ludacris' Bridges of Gamer), has ordered kidnapped dive for the floor. Two masked Hispanics burst into the house, their bullets punching holes in the walls as they shoot at anybody who moves. Emilo (Joseph Julian Soria of The Purge: Election Year) and Oscar storm into the house with automatic pistols and rescue Berta and her friends. Police sirens are howling as the Hispanics flee from the house. Berta scrambles over a fence, into a yard, and crawls under the wheelchair ramp at the front door which effectively conceals her from the uniformed L.A.P.D. patrolman who rattles the front door with his fist. The homeowner, John Henry (Terry Crews), refuses to let the black cop search hid premises for the runaway illegal immigrants. Reluctantly, the cop relents then leaves John Henry alone. No sooner has the patrolman left than John Henry stares down through a gash in the ramp and asks if the terrified girl is hungry.Writer &amp; director Will Forbes intersperses VHS flashbacks of our title character as a teen as well as straightforward dramatic flashbacks later that suggest why our hero shuns guns. During a scuffle outside a convenience store, our youthful protagonist clobbers a pistol-packing hood with a pile-driving swing that puts his opponent face down on the pavement for the count. John Henry's cousin Hellen stole the surveillance tape that recorded the memorable event. Unlike everybody else in his neighborhood, John Henry doesn't rely on a locked and loaded 9mm automatic. Meantime, John's old-time gangster father, B.J. Henry (Ken Foree of Brotherhood of Blood), insists that he himself is God's gift to women. Unfortunately, life hasn't been fair to B.J. since a stroke landed him in a wheelchair. Nevertheless, confined as he is to a wheelchair, B.J. still packs his pistol and lives with his adult son. Indeed, the wheelchair ramp saved Berta from being taken into custody by the cops. Although John Henry invites Berta to dine with them, he realizes that communication between the two of them is strained by his lack of Spanish as a second language. B.J. salvages this predicament because he can understand and converse with her. Berta is upset because she escaped from captivity without a scratch, but Emilo left her brother behind. Later, Emilo tracks Berta down to John Henry's abode.Terry Crews delivers a laid-back, low-key performance as the sympathetic protagonist. He is nothing like his happy-go-luck mercenary in The Expendables franchise. John Henry lives a simple, easy-going life until a gangsta hits his pet dog with his vehicle and gripes about the dent the dog put into his ride. The bragging thugster brandishes a pistol to intimidate John Henry, but our grief-stricken hero ignores the gunman's threats and cradles his dead pet in his arms. Sadly, we're neither told enough about John Henry's reclusive life nor how he pays his bills. The saving grace of John Henry is Forbes never lets anything interfere with the plot and the inevitable showdown between the two cousins. Ludacris's demented villain presents an interesting contrast to John Henry, particularly about his weapon of choice. Rather than wield an automatic like his trigger-happy hoodlums, Ludacris prefers a blow-torch to maintain discipline within the ranks of his henchmen. Furthermore, he wears a gold-plated jaw that genuinely sets him apart from any other character.The violence in John Henry isn't extreme enough to qualify as gratuitous, but its verbose profanity landed it an R-rating. Our hero bashes the brains out of his opponents with a sledgehammer, but Forbes never depicts the impact of that hammer on flesh and bone. Largely, we see only splashes of gore when John Henry's sinks his hammer off-camera into somebody's noggin. Any way you look at it, Will Forbes makes a slam-bang directorial debut with John Henry."}, {"id": 123, "text": "It was a little slow at the beginning &amp; music a little loud. The movie was different , not what we used to seeing. I thought Crews did a good super hero role. Luda &amp; the whole case did good! Thanks Netflix!"}, {"id": 124, "text": "It's a classic good vs evil movie told from a different cultural and social economic point of view; very entertaining. If you are from Bellaire you just might not get this movie! Think about it...."}, {"id": 125, "text": "This is the second worst movie I've ever seen. Sorry terry your awesome"}, {"id": 126, "text": "The storyline is horrible, they get you with the preview (it makes the movie look good). It's very confusing to follow and understand."}, {"id": 127, "text": "John Henry, starring Terry Crews and Chris Ludacris Bridges is not your average movie. First off, if you are offended by the uses of the N word this film may not be for you. This movie is a B rated movie, it looks like it was a film project for a community college class. Writer and Director Will Forbes was complaining about not being allowed to direct a movie, it seems to me that once he was given the opportunity, he blows it. Just by adding Terry Crews, Ludacris, and D.J. Quik doesn't mean you'll have an inspiring movie, which it should have been, there are people in the world that are good samaritans and will help even if it means putting their own life at risk. The problem with this film and the actors are you expose their weakness as actors, not being able to act out the emotions of the characters, everyone notices that. There are some oneliners in this movie that are hilarious and will be attached to memes forever. I believe if the director was different then the movie would have been at least a 4.5 on the IMDB scale."}, {"id": 128, "text": "I love a Terry Crews and Luda. I had high expectations for this movie but it is a discombobulated mess. Bad camera work, VHS video flashbacks with incomprehensible dialog, and a messy timeline made this almost painful to watch."}, {"id": 129, "text": "Let me start off by saying that I only watched about 30 minutes of this movie. In that short amount of it was easy to see that this movie wasn't put together very well. The acting is bad, the storyline is bad and the dialogue is terrible. I don't really have any positives to give you other than Terry Crews is in it but even that did nothing to help the quality."}, {"id": 130, "text": "Too much irrelevant music and scenes... Luda and Crews must have lost a betThe chance the director had to make a good film was loss in script and poor camera work and even worse sound track"}, {"id": 131, "text": "Quite possibly the worst movie I've ever seen. And I've seen mac and me.Seen terry crews and honestly expected it to be awesome. Was severely disappointed.P.s. the very few reviews reviews that are calling this abomination amazing I'm truly terrified to see what you consider a bad movie. I'd probly gouge my eyes out."}, {"id": 132, "text": "Reopened my IMDb account for this. This movie is 2020 in a nutshell. Just plain bad. I'm so thoroughly disappointed in everyone who took part in this movie. It was ideas of what a movie should be, just very poorly scripted and put together. Still love you Terry"}, {"id": 133, "text": "This is hands down a 10/10. terry crews is the next dwayne johnson. absolutely phenomenal film."}, {"id": 134, "text": "What's up with his Dad saying, the way I see it there's already too much white in the world and then in this bathroom while TC is shaving there's the framed sign on the wall that says Colored only, no whites allowed! I don't care for any form of racism and if that was reversed there would be all kinds of hell to pay for those involved in the movie. This movie is slow, the acting is terrible and it just makes no sense. Avoid this mess..."}, {"id": 135, "text": "John Henry is a blaxploitation comedy. It's not a high budget Star Wars film, or political Joker thriller, or iconic as White Girls. It's a cheap fun story riffing on the old tale John Henry. Acting is subpar, characters have no depth, story feels choppy. But that's what a B Film is - it's meant for enjoyment. I will say my roomie and I loved pointing out the shenanigans calling them 3.5s in reference to the movie rating. There are few scenes I was dying of laughter (no spoilers, but favorite scene was the dialog between two characters in a car). Some scenes I think could have had minor fixes for a full 5/10, but this household agreed for the 4/10. Enjoy it!"}, {"id": 136, "text": "Without spoiling the movie, Terry Crews plays a gentle giant who after a taste of gang life, decided to be non violent. Crews barely changes his facial expression throughout the film to show how passive John Henry is and the story is basically slow. There are a few scattered bits of extreme violence with people's heads being exploded and a few torture scenes but overall a slow movie."}, {"id": 137, "text": "Title of my post says it all... This movie is complete garbage. It was listed #4 on Netflix so I watched it. I endured15 minutes before I regretted my decision. Acting is atrocious, storyline is atrocious, leftist propaganda is abundant. I love Terry Crews and really wanted to love this movie, but I couldn't be more disappointed"}, {"id": 138, "text": "It had some funny scenes in the movie especially with the two lookouts at the end when John walks up on them their conversation before was good and all the action sequences looked like an old spaghetti western especially the final showdown between John and hell (Luda) the ending kinda left a little too be desired. I wanted to know what happened to Berta and Oscar because I don't believe their will be a sequel unfortunately because I would watch it too but that being said I wouldn't have paid to see this in the theater's but it's worthy of a rental. All in all it a pretty good flick imo and if your a fan or Terry Crew's or Ludacris more so Terry Crews you'll enjoy this one too"}, {"id": 139, "text": "This was a dope movie if you get the massage of it, I love it tear me up we all need redemption if we have a dark pass and if you can right a wrong do it, its about the the embodiment of the real John Henry and what it meant, I love it for the story line the acting wasn't the best on ludacris side with that fake thing as a jaw a missing side jaw would have hit more to his character acting as bad guy and a snake like the person he betrayed. It's movie that you don't even notce until the end you be like dang I actually sit through the whole movie."}, {"id": 140, "text": "I had no problems with soundtrack, or anything else. It's a different movie. It was a bit too slow at times, and by 1st half I realized it wasn't going to be another J.Wick movie. I didn't understand who some of the characters were or what their relationship to JH was, but it didn't really matter.It was a bit clumsy but overall it was pretty good. Had kind of an indie feel to it."}, {"id": 141, "text": "I anticipated this being good because of the name of the stars in it. This movie was a build up for a let down. It had potential to be better than what it ended up being. I was disappointed with a lot that occurred in the movie. It feels like they rushed the movie and didn't really watch it before allowing the final cut to be released."}, {"id": 142, "text": "You're not watching this for oscar buzz, you're watching this because you want to see Terry take out his anger with a hammer. The script is crap, the actors are stiff, but you don't care about that. What's wrong with watching a movie to fulfill a basic need? It's the same need that has us watching bruce willis and nicolas cage movies 10 years after their careers went south."}, {"id": 143, "text": "Arguably Terry Crews best work including solid acting, was surprised to Ludacris AKA Chris Bridges playing the villain."}, {"id": 144, "text": "All the negative reviews are from people who take themselves way too serious. It's supposed to be a semi spoof, semi Sin City Compton version, semi lock stock and two smoking barrels (i.e. gangsters talking about recidivism without knowing the meaning) on a low budget. It's hilarious. I mean the protagonist bonds over a teenage girl 'Drawing his dawg right'. Good movie, agree it's worth a good late night watch."}, {"id": 145, "text": "Its a film that is easy to get into. Enjoyed it and if your after something easy going this is the film for you. Acting is suspect but it's easily passed."}, {"id": 146, "text": "This movie is not Best Picture.Good vs evil, revenge tail, made by someone who loves movies.Enjoyable watch. Good music."}, {"id": 147, "text": "John Henry (played with solid screen presence by Terry Crews) is a reserved man living in ghetto-bird Compton, California. When two immigrants flee the clutches of a street gang and wind up on his doorstep, John tries to protect them in any way he can (you gotta love the power of a good old sledgehammer). That's the gist of 2020's bloodstained and callous, John Henry. At a running time of 91 small-scale minutes that teeter into art film territory, it's my latest review.Distributed by Saban Films, referencing The Human Centipede, and shot almost two years ago in palm treed LA, John Henry comes off as a sort of B-movie with a torrid, grindhouse effect. It's also like watching a lowly commercialized version of Menace II Society (or Baby Boy) mixed with a little Taxi Driver (I'm God's lonely man).John Henry has rookie director Will Forbes using various camera angles (and POV shots) with an over-stylized flavor. He's ambitious, he's a bit of a show-off, and he commits his whole, mannered shtick to the background sounds of basement tape rap songs (which I kinda liked).Will's editor (Joe Rosenbloom of 2018's Monster Party) fashions John Henry as choppy, random, and askew. Characters you think are dead wind up alive, various shootouts seemed squeamish yet ill-choreographed, and I didn't quite comprehend the use of VHS recorded flashbacks circa 1994.Oh well. John Henry has some decent casting (I liked the villain named Hell with part of his face cut off) and despite its shortcomings, possesses an effective way of making the viewer feel unsafe. Henry is overly violent, overly mean-spirited, slang-ed in dialogue, and bruised to the gills. I just wish helmer Forbes had tried to settle down and tell his story more systematically. Oh Henry! Rating: 2 and a half stars."}, {"id": 148, "text": "You can enjoy this movie even if its not perfect. If you want to see hoodrat subhuman getting killed with style this is the movie for you. Jamila also does a good job in this. Her presence can light up anything.... The only negative with this is that it has parts filmed with 90's camcorder fitler....... those parts are annoying..."}, {"id": 149, "text": "Is it original? Is it deep? Will it change society? No. Is the old western influences a little on the nose? Maybe. I think people complaining about the film expect it to be more than what it was meant to be. It's a short film with a straightforward plot. Side characters back stories aren't really explored. But I'm fine with that. The movie is not about them. I did not find it boring as some of the other reviews. I thought there was plenty of action and a plot just interesting enough to keep me engaged. I am also glad it did not fall into the tired trope of the townspeople rising up against the town baddie. It's a fine enough film to waste a little time. If you look at it as an urban spaghetti western the movie works. Stop trying to make it into something it is not."}, {"id": 150, "text": "The movie is not that great but it's something i would definitely recommend that you watch it."}, {"id": 151, "text": "I wasn't going to watch this as looked like it was going to be more Americana sugar coated sensationalised violence. Then I read some of the reviews and it quickly became apparent that the usual audience who tuned in for what I am bored with were massively disappointed. I've never seen so many 1 star reviews! Instead of the popcorn, glamorous gangster/revenge tale this appeared to be something quite different. So I gave it a go and I'm so glad I did. This was a very grown up movie. The violence was brief and to the point, just like in most real life situations. It acted as a punctuation mark throughout the film (in flashback and present day). This is a story of redemption, not revenge. It played out like a spaghetti western but had a bit of a dragged across concrete vibe. This was a great attempt to tell a story of emotions rather than just churning out narrative for the sake of making a few bucks. I'm so glad Terry crews made this as it showed a serious side I'm not used to seeing."}, {"id": 152, "text": "Terry crews is too good for this movie. Based on his individual performance in this B grade film, I can see him in more serious roles."}, {"id": 153, "text": "This was the most well made movie ever! Terry Crews you are an amazing actor and made this film what it is 😁 Definitely a contender for 2020's movie of the year!"}, {"id": 154, "text": "One of the best films of the year. Was like watching a ghetto western. Please let there be a sequel. I think John Wick could learn a lot here."}, {"id": 155, "text": "I watched this strictly for Terry Crews and regret wasting the time and electricity. It was so poorly put together and pathetic that I could almost overlook the anti-white racism out of pity."}, {"id": 156, "text": "This movie wasn't good at all. Couldn't grab what it was about. Too much nonsense going on. I would've given it a 1 star except the fact that I'm a Terry Crews and Luda Fan. Waste of time."}, {"id": 157, "text": "I am not rating this like a Warner Bros., Universal, or as I would any big movie production companies film. I am rating it is an independent film. The writer and director, and producer did an amazing job. The filmmakers could have been out of film school recently, and knew how to make an indy film. The acting was amazing. There is a lot talking scenes, to feel the realness of the character. With that kind of writing the film could even be a stage play. I have seen other Indy films, even made from other countries and this is one of the better films. It's a tough call but I would have liked this more as a play. I would like to see more of this tems efforts."}, {"id": 158, "text": "I almost turned it off halfway thru but I was curious as to WHY 'stars' like Terry Crews and Ludacris who have mad money already would even do it. Then I figured it out... more social engineering to influence ADOS Black people into helping illegals from Honduras, Nicaragua and other Latin American countries when they come to the US. Even if it means giving them large sums of money to help them get settled comfortably in the country that WE BUILT, protecting them from danger, sheltering and feeding them, fighting for them against your own people when necessary, getting your home shot up, having your parent(s) risk their lives and die for them and ultimately, YOU TOO SHOULD DIE protecting illegal immigrants to America.That was the point of the entire movie. The girl's entire contribution to the two ADOS men that protected her was this: she drew a picture of their dog."}, {"id": 159, "text": "Sorry, this review is only for the first 40 mins, couldn't make it any further. Characters don't make any sense, lots of sound level changes with the music and dialogue and reminded me of late night wake up commercials. Still wasn't sure of the exact plot and bailed."}, {"id": 160, "text": "10 stars for Terry Crews he's an amazing actor. Its not as bad as these reviews gibe it a chance."}, {"id": 161, "text": "I don't know why this film has so low rate. Firstly, the story is simple, it uses flashbacks from past if main character. The end of film is a little bit disappointing, it's illogical. Secondly, the cast is good, but all attention is taken by Terry Crews. So, it's average film for one time."}, {"id": 162, "text": "I have to say I just finished this movie and when I saw the ratings to this film I couldnt believe it. This is a under rated film and I enjoyed every moment of it and I regret not seeing it in theaters."}, {"id": 163, "text": "I just read about this film in Variety, because it's doing so well on Netflix. It's full of creativity and this is a team that we will see a lot more of, and with significantly bigger budgets. I particularly love the bringing together of Black and Latino cultures in L.A. And some revisions of cliches and tropes we are used to seeing in gangster movies and Westerns which is what this turns out to be. Enjoy!"}, {"id": 164, "text": "What all the good actors and actresses in this movie. It should've been a lot better"}, {"id": 165, "text": "It was so raw and real! This is getting too much hate. I loved it. Terry Crews really showed us some acting on this one."}, {"id": 166, "text": "This film had a lot of potential, we know that because it's an idea we've seen executed well many times before. It could have been so much more, it wanted to be so much more. Unfortunately amateur camera work/blocking, poor script and horrendous sound design really rob this film.When will sound designers learn, if you make the score significantly louder than the delivery of the script, foley, etc, through volume, pitch or otherwise, you destroy the film. In John Henry the score which pops up regularly and randomly (often out of context) is at least double the loudness of everything else going on. That means you either listen at a volume that makes speech inaudible or you blow out your ear drums when trumpets suddenly start blasting.That leads to much of the speech being inaudible. Not that it really matters with such a basic plot, but it definitely is frustrating. The John Wick dead dog scene is ridiculous, and at no point is there emotional attachment to any of the characters. Heck, for most of the movie you won't even really know who the characters even really are.Better to save your money and watch Shaft or John Wick instead."}, {"id": 167, "text": "Where to even begin with a movie like this. Between the absolutely nonsensical plot, lack of action, cringe worthy line delivery, and just pure boredom, this move really doesn't have anything going for it. We have terry cruz somehow being blackmailed into starring in this, and he plays a ptsd-ridden ex gang member who is currently living in Compton with his wheelchair bound father. So aside from watching an emotionless terry cruz do nothing except talk with caveman-like speach, you'd hope to at least see some action right? Nope. Pretty much goreless movie aside from some cgi blood splatter during the 3 minutes of actual action in this. Don't even get me started on the plot which is so nonsensical that you will be constantly questioning what is even going on. Literally so many plot holes coupled with random dream sequences make for a story that really does go nowhere. So don't be fooled by Terry and Ludicrous being in this. Seriously wondering what compelled them to even make this movie. It really is a The Room situation where the making of this would be more interesting than the actual movie itself. The worst part is, it's not even fun or action packed. And not only that, I can't even tell if this is paying homage to classic exploitation movies or what exactly. It's just an utter mess, unfortunately."}, {"id": 168, "text": "I've seen some bad movies in my time. Battlefield: Earth; Natural Born Killers; Any movie Uwe Boll directs, but nothing comes remotely close to the atrocity that is John Henry.It started off ok, a flashback to a simpler time. However, it quickly devolved into an attempt at a Tarantino flick, John Woo action, to just a jumbled mess that was more comedy than serious.The characters are reading scripts, they don't believe in their roles. Terry Crews has never done anything as bad as this, not even Damon in Friday After Next was this bad.The character development was so scattered I've seen confetti fall from rafters that was more organized.There were times, I kid you not, where the musical score (which was also overly emotional for the sort of film this was) was louder than the dialogue.The redeeming factor of this movie was it was only 90 minutes. Other than that, I swear I should sue Netflix for pain and suffering."}, {"id": 169, "text": "This movie is not complete garbage but it is far from great.I am a Terry Crews fan since 2001 unlike most of the people reviewing this movie that only know him from Brooklyn Nine-Nine. It is nice to see Terry outside of comedy which has been most of his recent career. I miss the old Terry from Gamer, Expendables, and Street Kings. It also has Gerald 'Slink' Johnson from Black Jesus...if you don't know, look it up. Ludacris has always been a hit or miss in movies, this movie being one of his worst acting jobs ever plus his character is super weak talking about his empire. Joseph Julian Soria always does a good job (Crank, Purge, and Gentefied on Netflix) and Jamila Velazquez was also good in the movie.The story itself is just rough, dragging on in some scenes while still feeling overall rushed as a movie. I see complaints about the music being too loud overpowering scenes and it does in some of them. However, I did overall enjoy the older west coast sound from DJ Quik.Simply put, I didn't hate the movie just can't rave about it either. I think with better writers, a bigger budget, and a better actor to replace Luda it would be a much better movie."}, {"id": 170, "text": "I saw this movie on sale to buy for 7$ digitally on Xbox and pass, then i regreted it. I like Terry Crews, i enjoy low budget action flick most of the time... Couple weeks later i see it in a rental sale for 2$. I jump on it and rent. Well... glad i only paid 2$.The synopsis is simple. A kid on the run take refuge at John Henry's (Crews) house and he decide to protect that kid even tough the person's who's after her is someone he has a pass with. This has been done a million time before but hey i like these simple stories.The issue is here its done very badly. First the score that pop up of nowhere all the time over padding scenes do not fit. Speaking of padding scenes, oh my is there a lot of them involving unimportant side characters (using the term lousely). Its either a combo of music/imagery or random unimportant characters speaking while using ghetto profanities that is really not needed for the advancement of the plot.The built between the main characters is fine at first but there is not enough of a payoff (action) to justify it so the movie end up very slow pace and well...boring.I get that this is no John Wick and the budget is very small but even with that in mind it could had been a very simple protector's flick and be fun. Crews and his father's character BJ actor do a very decent acting job but its the only bright spot in the movie.Maybe i was expecting more of an action flick based on the trailer and the artwork of Terry Crews with a sledgehammer but since it turned out some kind of artistic drama more than anything else it just left me disapointed.I hesitated between 3 and 4 out of 10. I ultimately decided to go with 3 because it did bored/disapointed me and i sure know i don't want to watch it again. But its not an horrendous movie by any means. 35% would had been apropriate of a score."}, {"id": 171, "text": "I'm a big TC fan, so when I saw this pop up on Netflix, I was intrigued, especially since I hadn't heard anything about the film. The brief synopsis lead me to think it was going to be a gang-themed movie, and while the deep plot involves gangs, it was definitely not what i would consider a gang movie. If you're looking for a gang movie (a la Boyz In The Hood, Menace II Society, etc), look elsewhere. This is more a drama than anything, and the pace is painfully slow.The acting wasn't bad, but OMG...the script is terrible. Using the name John Henry felt like a stretch too, and almost felt like an insult to the folk hero John Henry, especially with a few loose and unsuccessful references to the namesake.More than anything, the dialog between actual plot points drags on for minutes at a time, with nothing to add to the plot, the characters, or the film. I'm not sure when this story was submitted for funding, or how long the script took to develop, but everything about this movie felt like a rough draft, with no attention to flow or story.Sadly, this movie is a complete bust. Had it not been for the fact that I like TC, and a couple other actors, it would have ranked even lower. It's certainly not the worst movie in the world, but I can not find a single reason to recommend it. Even for fans of TC, it's just a bust. Bummer."}, {"id": 172, "text": "Let me mention I made an account after watching the movie and seeing that many people gave poor reviews, after hearing it was low budget movie, I was definitely more interested.Yes the story is slow to build, it made mad sense midway through when it finally made the connection between characters played by luda and Terry.No there isn't 99 minutes of straight gangster action, why should there be? Characters were introduced and interacted each other well, (although I shoulda watched with subtitles I don't know Spanish -_- )It was a slow building movie, it ultimately built up to the ending, it was awesome, it was awesome to wait for.Was it over dramatic sometimes? Yes, was it worth it? YES. I just don't understand why people are downvoting a movie that 2 big hearted people made to entertain folk, a lot of these reviewers are probably really shallow people cause this was a heart felt movie, I really felt the scenes and anguish between the characters, and it diddnt take $100,000 to do it, and if that doesn't please you, you probably shouldn't be online reviewing movies.If anything im certain most of these *critics* are just mad cause of the sign in the bathroom, (I thought it was funny)I really loved this movie, yes it was a slow build, but if you actually watch movies and not peanut scan see them than you will find a good heartfelt movie in this of a triumph over a younger aged dispute between two friends who were brought face to face by random chance.and if luda or terry see this. THANK YOU! it doesn't take ridiculous comedy or over the top scenes to appeal to people, mfers are just dense!"}], "reviews_amount": 173}