{"name": "Fearless", "titleId": "tt08675288", "reviews": [{"id": 0, "text": "Total waste of time...I always get excited when I see that a movie is a Netflix original. But this, this was a total disappointment...Very poor dialogue...very dry jokes....In summary a huge disappointment...I hope this won't be repeated in subsequent Netflix Originals"}, {"id": 1, "text": "Very boring story . good usa army and cant shoot bad robot army . hero kids . i watched better than this ."}, {"id": 2, "text": "It's like they spun a wheel of random celebs to voice the characters and then made them pick what character they wanted to voice out of a hat. Plot and writing was terrible as well but still got 3 stars because it was a good background sound while I stared at my phone"}, {"id": 3, "text": "The movie seems to be simple and predictable but at the same time enjoyable and funny, it will be an awesome family night movie."}, {"id": 4, "text": "This is not a super original story of animation, and neither a complex storyplot for a grumpy old man to cry hooray for. its made as safe and borderviolent as the aa stamp demands, therefore no more nerve than need to be for a feature animation. ican assure you youve seen better than this."}, {"id": 5, "text": "If it weren't for the cute babies, it would be just another animation of gamers and ets, but that tender trio just melted my butter, and the sweet and charismatic protagonists helped too... Cute cute..."}, {"id": 6, "text": "Fun and inclusive movie. Great animation and our type of hair was portrayed beautifully!! My kids were absolutely into it, they sat and watch the whole movie quietly, LOVE IT! We will definitely be watching again."}, {"id": 7, "text": "The babies are cute, the movie is wholesome and I didn't feel like I was forced to watch another terrible kids movie."}, {"id": 8, "text": "Bright colors, cute voices, typical story line but it won't bore you to tears especially since the movie is only 90 minutes long. I enjoyed it without the kids LOL"}, {"id": 9, "text": "Most didn't.Felt like somebody's vanity project rather than a well structured and thought out concept.Younger kids will be entertained."}, {"id": 10, "text": "A great all around family movie, cute characters, some really cool music as well!"}, {"id": 11, "text": "Only two stars ....... and those are for the animation. The storyline is just awful. Acting is terrible. No discernable humour. The whole film totally failed to grab my attention."}, {"id": 12, "text": "Vanguard has some of the worst movies ever released (with a few paltry exceptions)... why Netflix thought it was a good idea to 'recruit' them is beyond all rational thought. The animation is below subpar and lifeless with no use or knowledge of lighting/shadows and the backgrounds are terrible! EVERYTHING about this screams bland and juvenile, bad fat jokes delivered by even worse timing and acting. Yes, I realize that this is an animated film, but even children deserve standards. So, Reid is about everything you'd expect from stereotypical high school kid that plays video games ALL DAY- bumbling and awkwardly flippant. As for the girl, another stale and shallow role involving a kid too future-focused on grades and college and red lobster crabfest, as if a single bad group/partner assignment will bring a teachers' pet's perfect gpa crashing down - so long collegiate career- just so she can make a difference in the world. Additionally, WHO schedules TWO BATHROOM BREAKS an HOUR?? Does she have Crohn's or ibs? Maybe just cursed with a baby's bladder? She certainly has no maternal instincts, as she NEVER spends time with the babies. At least the government doesn't have a clipboard-toting, loud-mouth, hnic to make sure nothing goes wrong! Wait, I spoke too soon... maybe they should switch back to having a narcissistic general with a southern accent in charge! The only bearable figures here are the characters that have zero speaking parts. Nonetheless, despite the danskin-wear, the babies are still only borderline endearing... AND WILL SOMEONE FEED THEM ALREADY??!!"}, {"id": 13, "text": "Good-enough story (I'm a sucker for kids with super powers), and the art style and color schemes really clicked for me. I really enjoyed the texturing used on the smoke/explosions - even though they were kinda cartoony, and I thought Melanie's hair was noticeably well-done. I'm looking forward to the sequel!"}, {"id": 14, "text": "A gamer named Reid, who is a good gamer, but does not feel he is too good at anything else, but soon the world of a video game and reality are about to collide together.Great animation, like The Incredibles 1 and 2, everything is very colorful. The story is also great, for anybody that has love for video games and superhero films. Characters are also great also. This film is for the whole family to enjoy."}, {"id": 15, "text": "Very cute Netflix movie. My kids actually sat still long enough to watch and laughed at the jokes. Finally, something appropriate and original for little ones."}, {"id": 16, "text": "I'm not sure why this film has so many negative reviews. We watched this for family movie night and thoroughly enjoyed it. It's funny and lighthearted, with a great cast. We are hoping they come out with a sequel."}, {"id": 17, "text": "I literally seen this on my tv screen everyday for 6 months. No lie. My 10month old son loves this movie and literally watches it like he never seen it. It brings him so much joy. No movie catches his attention but he will sit and watch the whole thing."}, {"id": 18, "text": "The animation seemed absolutely fine. It was the voice acting / cast that I couldn't get past. I really tried. But they seemed so out of place, lifeless (read from a script rather than acted out), and almost out sync (due to its lifelessness).Halfway through, the coulourless dialogue + voice acting were too prominent for me to enjoy the movie."}, {"id": 19, "text": "Fearless is the gamer name of Reid who plays Planet Master. It is Captain Lightspeed vs Dr. Arcannis. Fearless takes the game to the top level when he is suppose to be working on a science project with Melanie. Reid becomes part of the game as the three infants of Captain Lightspeed arrive at his door with Dr. Arcannis close behind.If is a cartoon that has its moments. Not really adult catching. Maybe 9-11."}, {"id": 20, "text": "Me and my children loved this movie!!!!! Great kid movie. It should of got more press than what it did."}, {"id": 21, "text": "The movie had action scenes, jokes, good uses of animation. Perfect movie for movie night! It kept my 5 and 3 year old entertained and engaged."}, {"id": 22, "text": "It's great movie, I mean storyline could've been better. The movie was a little similar to Incredibles but not totally, the superpowers like laser from eyes, and bubbles seems kinda repeated. But it's good, would recommend for kids, as they wouldn't care for storyline. Overall is 5⭐'s but for the concept of video game into real life gets 2 more ⭐'s so there you go fearless_ you've got 7⭐'s from me for completing the game successfully😂."}, {"id": 23, "text": "I started watching this, then just got bored. I am getting to the point that I will stop watching television altogether... why? Because apparently all white males are dim-witted and need an ethnic 'friend' to keep them in check. Don't believe me? Just watch that other Netflix animated drivel of Jurassic Park: Invincible Kids (not quite the title, but if you've seen it, you will know what I mean). Do not get me wrong, I am all for diversity, but when white people are made to be the dumber part of a duo, what message does that send? Oh no, we cannot do that the other way around, as that is unacceptable. So it is acceptable the other way around? The world has gone down the bog... I think I will turn back to keeping myself entertained playing video games..."}, {"id": 24, "text": "Your better off watching other animated movies, this wasn't a good movie."}, {"id": 25, "text": "We have young kids and this movie fit the bill for all ages and likes. Family movie night was a hit with this one! Good clean fun. Wish more movies now were like this!"}, {"id": 26, "text": "My 4 yr old daughter has respected Fearless everyday.We Love Jadakiss and the cast of this movie."}, {"id": 27, "text": "The bad reviews on this site are probably coming from young gamers who don't like the message of less screen time is better. :-)The movie's cover photo didn't strike me as something I'd like--I have to admit, my proclivity to respectability politics caused me to prejudge the movie based on the superhero's hair style alone. lol.Still, as the movie got going, I couldn't help but to be taken in by the well crafted humor and the story itself. The screenplay and animation are second to none, and those babies were awesome.Two thumbs up to everyone involved in this film."}, {"id": 28, "text": "I watched this with my daughter and we loved it. The animation is absolutely fantastic and beautiful. The movie was hilarious. My daughter was in awe over the animation. Overall - it's a great family movie."}, {"id": 29, "text": "I'd love to start talking about what I did like about this movie, well I didn't like anything about this movie. The movie is really bad, it has totally messed up, I didn't laugh a single time, I didn't smile neither. The movie is full of bad jokes with bad timing, characters be in a middle of a fight and they say a joke, and it's not even funny! Also was full of babies' jokes they were bad and they repeated the same jokes for only god knows how much. You can consider the babies' sequences is the low quality version of the baby's sequences in (Incredibles), they duplicated some scenes from it.Beside all that bad jokes, the movie was trying to force the message of (You should be in the real life and stop playing video games) and all that stuff, the movie was putting this message in any sentence in the dialogue instead of showing us this morale in right context. As it was in (Ready Player One) by Steven Spielberg, this idea was represented in a beautiful funny story in (Ready Player One)The dialogue was bad, super cringe and full of cliches (What could is it being fearless in a fake world, it's time to start being fearless out here) that poetic sentence would come from a kid? it was so cringe hearing sentences and speeches like thisAll the characters were bad for their own reasons. The villain was ridiculous and not frightening at all, He doesn't even have any power! General Blazerhatch was annoying, you know that military caricature character with all its cliches? yeah exactly like what did come in your mind now. That hero in the poster, Light whatever, it was the most useless character I have ever seen in an animated movie.The movie is really time-wasting, I didn't like it at all."}, {"id": 30, "text": "Its ok. Its 5.5 at best.It has an interesting story going with poor execution.Voice work is decent to it can be better.The cast is ok i guess. Its featuring people you'd never suspect. The characters are good but they aren't freshed out any better.The animation looks cheap or at least not good enough for 2020 when your on Netflix. The scenery in some scenes look very incomplete.Its like Toy story Aliens meet 3 Jacks from Incredibles.The flim has a maroon-purpleish color feel all over it.Verdict: I'm not into the swirling or White Savior Movies. Its over done for the wrong reasons. Overall its a good movie that is barely passable."}], "reviews_amount": 31}