{"name": "KD (A) Karuppudurai", "titleId": "tt08747560", "reviews": [{"id": 0, "text": "The movie is simply astounding as it is saturated with messages from the beginning to the end. I did not expect a movie with such a different story in an industry which is laden with generic stories of hope, love and themes alike.The story was also eye-opening as I was not aware of the concept of 'honor killing' (Not too sure if this is the right term) within the community of the elderly. I am really saddened to learn that this actually happens in India and I hope people would change their perception of the elders. This movie paves the path towards this as it presents the elderly in a new light.Indians praise the Korean movie scene which has loads of movies with unusual stories. Guess what? We have an excellent candidate to contend now!I only have one problem with the movie. The opening scene has a small logic flaw whereby the elderly person actually managed to walk immediately after waking up from his coma. This is technically not possible at all. However, bear in mind that this DOES NOT affect my opinion of the movie as it is still a masterpiece!"}, {"id": 1, "text": "A Gem for tamil cinema Ramasamy sir and master Nagavishal lived as Karupudurai and Kutty... Songs , Camera and all technical aspects are good... Hatsoff Madumita mam are giving a wonderful film... Each and every frame was Interesting... A must watch feel good adventure Don't miss"}, {"id": 2, "text": "Freah air at end of the movie. U guys won't disappoint at any moment , bcuz u see and remember that HARD WORK NEVER FAILS  . It's not a tale for particular one , it's a tale for everyone 'one day everyone need to reach that situation in life '. LIFE TIME MOMENT WHEN U SEE THIS LIFE TIME ACHIEVEMENT WHEN U GET THISEVERYONE WATCH AND SUPPORT IT GUYS ."}, {"id": 3, "text": "A simple yet an important deep rooted issue with an esscence of life ToDos list charters out with an old man having a great fun filled emotions with a grandson alike kid to enjoy the flow of life as it goes.Camera, Music and dialogues Elevate and engage the audience and it connects easily.Brings memories of my grandfather and days enjoyed with him. Also, the kid is phenomenal , Eyes to expressions to way he protrayed his own self is awesome.Must watch!!"}, {"id": 4, "text": "Such a heart warming story. Very well written, executed and performed."}, {"id": 5, "text": "This is a movie I enjoyed immensely.Mu Ramaswamy as KD alias Karuppudurai and Nagavishal as Kutty were outstanding. I see a National award for Nagavishal this year. Brilliant dialogues and excellent presentation from the director Madhumita. Background score was perfect encore. Sarcasm aplenty, this will keep you hooked.This is a story about the old man KD who is wanted dead by his children for monetary gain and the orphan child Kutty who was left to die at a temple. The kid like old man and the mature Kutty form an outstanding combination. The story treatment is absolutely fabulous and poetic.This movie is more than the checklist that some keep referring to."}, {"id": 6, "text": "This beautiful movie comes in a time where movies r filled with mysogyny n loads of fitments just for commercialisation to cater to the business of cinema ignoring the Art n craft of story telling in a natural way. Kudos to the director and team for the hardwork and uncompromising authenticity in bringing out the best out of all in this lovable movie. The cast has been brilliant delivering what is expected of them. The chemistry between kutty n KD just went straight to my heart leaving a great impact on me. These movies have to be lauded for the purity in it. The team has done a great job and I wish Director Madhumita makes more such pure movies with great art n craft. The story, screenplay, music, picturisation casting everything is flawless n just brilliant. Best wishes to the team for all their future ventures. U have stolen our hearts."}, {"id": 7, "text": "Kd karupu durai revolves around old man with family in a village in his death bed and an orphan boy .How they meet ,what happen when two contrast lives coincide .how long thier journey continue.There are no big cast in this movie yet seem to be matured one.I watched in inox in madurai,audience where of couples and oldies . I saw those oldies enjoying this movie.Hope it gets more audience."}, {"id": 8, "text": "A well made movie - a rare friendship between a young-Oldie and an Old-Youth!!! 😊 congrats to Madhumita the director for a sincere effort to portray this rarity!!!"}, {"id": 9, "text": "I don't understand Tamil, but let you tell you.. this movie doesn't need you be fluent in a language to understand it. True &amp; pure emotions is what i felt through out the movie. Beautiful locations, brilliant acting by both the protagonists. Absolute love"}, {"id": 10, "text": "KD (a) KaruppuDurai Beautiful short story. Every scene is a poem. Madhumita such a gifted director to Tamil cinema. She has compiled emotions, nativity &amp; delivered a solid one in her debut. Mu Ramasamy,Naga Vishal Great performances. Sabari dialogues and Karthikeyamurthy's music great addition"}, {"id": 11, "text": "Must watch for all cinema lovers 👌🏼👌🏼👌🏼Don't miss !!!!"}, {"id": 12, "text": "I watched this movie as a random pick without knowing any information or plot about this movie. As the movie gets moving, I was so hooked to it. The Thatha and Kutti lived their characters👌👌 Nice sentiments and neat dialogues!! Wish the movie was a little longer to see more of Thatha and Kutti. Hats off to the director for making such a novel-like feel good movie. Would love to watch this movie a few more times."}, {"id": 13, "text": "One of the best movies I've watched recently. Simple, sweet and awesome film making. I'm deeply disappointed that this film didn't make much in the box office."}, {"id": 14, "text": "Every one should watch the movie ... Awesome- acting each character, Specially locations super ..."}, {"id": 15, "text": "A simple but a powerful theme portrayed brilliantly by Madhumitha. Ageing is not a curse but an experience and it varies person to person. KD's simple aspirations gets fulfilled with the help of Kutty. Both characters are intense and they have done a commendable job. I loved the expression on Valli when she meets KD. Interesting observations made by Hitler to find KD is more than Sherlock Holmes. Muthu plays a key role. EQ of Kutty is beyond imagination and hope the society matures to nurture such kids like the HRC person. It's a treat from beginning to end without any nonsense. Songs are very meaningful. Great movie not to be missed. Congratulations to Madhumitha"}, {"id": 16, "text": "K.d Ramaswamy as kd alias karuppudurai and nagavishal as kutty were outstanding. Big applause to director madumita.A simple yet an important deep rooted issue with an essence of life to-do list charters out with an old -man having a great fun filled with emotions with grandson alike kid to enjoy the flow of life as it goes.The story was also eye- opening as I was not aware of the concept of Thalaikoothal. With in the community of the elderly. When I searched about this in Google, I really saddened to learn that this actually happens in india. I hope people would change their perception of the elders.Amazing movie, must watchable."}, {"id": 17, "text": "What a wonderful and heart warming film. Easily amongst one of the best movies of the decade. Its movie Rajinikant must see to know what he has missed in his life. Doing such a film should be in his bucket list ! Madhumita and team, standing ovation !"}, {"id": 18, "text": "KD karuppu durai is bliss to cinema. Remarkable kd and kutty wont be forgetten."}, {"id": 19, "text": "We giggled and laughed thru the movie.. I'm gonna watch it again just so I can get all the little jokes I missed. My 8 year old was so invested, we went on to discuss family relationships, old age et al. There were many portions he didn't understand the dialogue (still not very proficient in Tamil), but, the screenplay and body language kept him engrossed. Mu Ramaswamy and Naga Vishal were excellent in their roles. We eagerly await Madhumita's next film..."}, {"id": 20, "text": "Great storyline, excellent screenplay, wonderful acting, these are kind of cultural heritage. More movies should be taken."}, {"id": 21, "text": "I watched this movie based on the imdb ratings and I was absolutely amazed. This movie is a must watch in a long time and that includes Indian cinemas and Hollywood alike. The performance of the leading two roles is so natural and real. The story is very interesting too. I also have to condemn the practice of Thalaikoothal. This is one of the most despicable things I have ever heard and I couldn't believe this is happening in modern India. What a monster would kill their parents? Disgusting."}, {"id": 22, "text": "Niceee movieeeee A good movie Nice shotting A Good animation"}, {"id": 23, "text": "This is storytelling in its finest form. Simple story of bed ridden oldie breaking away from his family coupled with an orphan kid on a journey to fulfil his bucket list. Seems like a regular plot for Jack Nicholson movie but first one for Indians..:) Definitely worth a watch."}, {"id": 24, "text": "The movie was written well without any glitch and keeps you engaged throughout. There are good laugh-out moments in the film. What makes this movie work is the transposition of the characters - the old man looking for pleasures like a young child and the kid acting like a matured man. Must watch if you are looking for something new in Tamil cinema!!"}, {"id": 25, "text": "It's a nice series, waiting for the next part. Thankyou"}, {"id": 26, "text": "A Gem for tamil cinema Ramasamy sir and master Nagavishal lived as Karupudurai and Kutty... Songs , Camera and all technical aspects are good... Hatsoff Madumita mam are giving a wonderful film... Each and every frame was Interesting... A must watch"}, {"id": 27, "text": "Live ur life to the fullest and don't expect from everyone this the mantra of this movie"}, {"id": 28, "text": "Such a great movie with great cast and everyone keeping up their character so greatly. Wanna watch more movie like this."}, {"id": 29, "text": "Awesome movie with great storyline excellent acting and good direction"}, {"id": 30, "text": "The cast The acting The story Everything is just perfect"}, {"id": 31, "text": "I generally don't really watch south Indian movies but this is a good one"}, {"id": 32, "text": "The movie is good.go watch and maybe you'll find it worth your tym too"}, {"id": 33, "text": "Amazing movie. Must watch. One of the best. Brilliant acting and cinematography."}, {"id": 34, "text": "Such a great movie with great cast and everyone keeping up their character so greatly. Wanna watch more movie like this."}, {"id": 35, "text": "Such a great movie with great cast and everyone keeping up their character so greatly. Wanna watch more movie like this."}, {"id": 36, "text": "It is all about the life how u haven't lived all ur life for ur self"}, {"id": 37, "text": "It's a great movie with commendable screenplay and dialogue writing . The actors did a great job . This movie inspires and motivates you alot . Loved it . Must watch"}, {"id": 38, "text": "Awesome script and title. I love the actors specially the main one. Keep it up, keep entertaining us from these awesome shows"}, {"id": 39, "text": "It was pretty good. Relatable Enjoyed a lot..it was fun as well as emotional.."}, {"id": 40, "text": "Great short story movie..😊 Love this.. Everyone must see movie like this .. Great work done and with great casting."}, {"id": 41, "text": "Such a great movie with great cast and everyone keeping up their character so greatly. Wanna watch more movie like this."}, {"id": 42, "text": "Such a great movie with great cast and everyone keeping up their character so greatly. Wanna watch more movie like this."}, {"id": 43, "text": "Such a great movie with great cast and everyone keeping up their character so greatly. Wanna watch more movie like this."}, {"id": 44, "text": "Such a great movie with great cast and everyone keeping up their character so greatly. Wanna watch more movie like this."}, {"id": 45, "text": "Such a great movie with great cast and everyone keeping up their character so greatly. Wanna watch more movie like this."}, {"id": 46, "text": "Such a great movie with great cast and everyone keeping up their character so greatly. Wanna watch more movie like this."}, {"id": 47, "text": "Such a great movie with great cast and everyone keeping up their character so greatly. Wanna watch more movie like this."}, {"id": 48, "text": "Such a great movie with great cast and everyone keeping up their character so greatly. Wanna watch more movie like this."}, {"id": 49, "text": "Such a great movie with great cast and everyone keeping up their character so greatly. Wanna watch more movie like this."}, {"id": 50, "text": "Such a great movie with great cast and everyone keeping up their character so greatly. Wanna watch more movie like this."}, {"id": 51, "text": "Such a great movie with great cast and everyone keeping up their character so greatly. Wanna watch more movie like this."}, {"id": 52, "text": "This is a nice movie with a story of 80 years old guy"}, {"id": 53, "text": "Such a brilliant performance by my favourite actor. Highly recommended and would suggest others to watch it during family time"}, {"id": 54, "text": "Such an interesting movie. Don't miss!! Must watch!!"}, {"id": 55, "text": "Highly recommended show. Must watch for brilliant performance."}, {"id": 56, "text": "This industry never fails to entertain at best. Worth watch and they are always best while having midnight munching."}, {"id": 57, "text": "Such a great movie with great cast and everyone keeping up their character so greatly. Wanna watch more movie like this."}, {"id": 58, "text": "Such a great movie with great cast and everyone keeping up their character so greatly. Wanna watch more movie like this."}, {"id": 59, "text": "Such a great movie with great cast and everyone keeping up their character so greatly. Wanna watch more movie like this."}, {"id": 60, "text": "Such a great movie with great cast and everyone keeping up their character so greatly. Wanna watch more movie like this."}, {"id": 61, "text": "I really loved the movie its amazing. Its a must watch. I really suggest this movie"}, {"id": 62, "text": "Such a great movie with great cast and everyone keeping up their character so greatly. Wanna watch more movie like this."}, {"id": 63, "text": "Such a great movie with great cast and everyone keeping up their character so greatly. Wanna watch more movie like this.."}, {"id": 64, "text": "Such a great movie with great cast and everyone keeping up their character so greatly. Wanna watch more movie like this."}, {"id": 65, "text": "LIFE TIME MOMENT WHEN U SEE THIS LIFE TIME ACHIEVEMENT WHEN U GET THISEVERYONE WATCH AND SUPPORT IT GUYS ."}, {"id": 66, "text": "Wow what an amazing movie, star cast also played a good role in movie."}, {"id": 67, "text": "Wow what an amazing movie, star cast also played a good role in movie."}, {"id": 68, "text": "It makes u realise the that u never lived for ur self but for the expectations of others. And now u want to live for ur slef forever. With no expectation"}, {"id": 69, "text": "Wow what an amazing movie, star cast also played a good role in movie."}, {"id": 70, "text": "It is one hell of a movie.Lifestyle of people of kanpur is incredibly shown. Must watch."}, {"id": 71, "text": "One of my favorite movie which I really like to watch again and again"}, {"id": 72, "text": "Wow what an amazing movie, star cast also played a good role in movie."}, {"id": 73, "text": "With lots of humor and excellent casting definately deserve ur 2 hour time. Show will not disappoint you rather give you what in actual life happens with people"}, {"id": 74, "text": "Such a great movie with great cast and everyone keeping up their character so greatly. Wanna watch more movie like this."}, {"id": 75, "text": "With lots of humor and excellent casting definately deserve ur 2 hour time. Show will not disappoint you rather give you what in actual life happens with peopl"}, {"id": 76, "text": "Such a great movie with great cast and everyone keeping up their character so greatly. Wanna watch more movie like this."}, {"id": 77, "text": "Such a great movie with great cast and everyone keeping up their character so greatly. Wanna watch more movie like this."}, {"id": 78, "text": "Such a great movie with great cast and everyone keeping up their character so greatly. Wanna watch more movie like this."}, {"id": 79, "text": "Such a great movie with great cast and everyone keeping up their character so greatly. Wanna watch more movie like this."}, {"id": 80, "text": "Such a great movie with great cast and everyone keeping up their character so greatly. Wanna watch more movie like this."}, {"id": 81, "text": "Such a great movie with great cast and everyone keeping up their character so greatly. Wanna watch more movie like this."}, {"id": 82, "text": "The best I have seen. I love the show. The best show ever seen. Waiting for the next season."}, {"id": 83, "text": "The actors have done a great job. I liked the way movie proceeded. Above all, I felt good after watching it, that matters more than anything."}, {"id": 84, "text": "Throughout the film it speaks the reality of the life in our culture that circles around us how we treat the elders and decide to become more selfish we become good story."}, {"id": 85, "text": "Good Movie. Everybody acted very well in the movie. BGM in the movie was good. The movie was not so interesting at the beginning but later it was so interesting. The movie was not so boring. This is one of the Best Tamil Movie of 2019. Good Movie."}, {"id": 86, "text": "Watched this on Netflix today. The whole movie was awesome. I generally watch tamil movies with subtitles as my partner doesn't speak tamil. I have never watched a tamil movie with subtitles this bad. I hope someone makes sure the person responsible never works in the industry again!"}, {"id": 87, "text": "A gem from tamil movie industry. Amazing performance from KD &amp; Kutty. Almost made me cry in many scenes.... The ending is so good."}, {"id": 88, "text": "Recommend everyone to watch it,an amazing experience."}, {"id": 89, "text": "I'm not crying, you're crying :^(I didn't watched the movie for long time because I knew I would cry and I don't like sentimental movies, I usually watch casual movies for time pass, but I'm happy that I watched it atlast!!"}, {"id": 90, "text": "Nice direction and the actors in the movie were amazing. Storyline was good too, it's a funny and family movie."}, {"id": 91, "text": "A good movie. Can watch with family. Would love to watch it again. Had a nice time"}, {"id": 92, "text": "Nice direction and the actors in the movie were amazing. Storyline was good too, it's a funny and family movie."}, {"id": 93, "text": "I loved this movie very much. I just absolutely loved the acting skills. You can watch it with your friends, family and even alone ! Over and over again"}, {"id": 94, "text": "Complete delight to watch. A perfect blend of all emotions. I really loved it, please watch it asap"}, {"id": 95, "text": "I watched this movie 2 times with my family 🙈. It tells you a great deal about family, friends, and friendship. Great acting and direction. Too"}, {"id": 96, "text": "Gives one of the best inspiration and shows character transformation in a way it gives passion for a soul to live through redefining bonds along the journey."}, {"id": 97, "text": "Very well written and executed, the performance and overall presentation of the characters props and various other aspects in the movie are quite impressive!!"}, {"id": 98, "text": "THERE IS NO BOUNDARY FOR A HUMAN TO TRAVEL . ITS OUR OWN DECISION WHEN WE HAVE TO MAKE THE RIGHT MOVE .IN THIS MOVIE AN OLD MAN TRAVELS AND EXPLORE WHAT HE ALL DESIRES IN HIS LIFE."}, {"id": 99, "text": "This movie is such a masterpiece. They have tried to show nothing extraordinary but today's truth itself, how a father spends all his life sacrificing everything for his children just so he could enjoy all he has with them during his old age. Instead, what his children does is pray that he dies fast so that he could enjoy it with his wife and children. Would make your heart ache a bit sometimes for sure"}, {"id": 100, "text": "This movie is such a masterpiece. They have tried to show nothing extraordinary but today's truth itself, how a father spends all his life sacrificing everything for his children just so he could enjoy all he has with them during his old age. Instead, what his children does is pray that he dies fast so that he could enjoy it with his wife and children. Would make your heart ache a bit sometimes for sure"}, {"id": 101, "text": "Nice movie loved it ba lot...🤓🤗 You all should see it"}, {"id": 102, "text": "I liked this very much.....People will enjoy it a lot and it will go viral and huge hit hopefully."}, {"id": 103, "text": "Nice direction and the actors in the movie were amazing. Storyline was good too, it's a funny and family movie.😀"}, {"id": 104, "text": "Nice direction and the actors in the movie were amazing. Storyline was good too, it's a funny and family movie."}, {"id": 105, "text": "Nice direction and the actors in the movie were amazing. Storyline was good too, it's a funny and family movie."}, {"id": 106, "text": "Nice direction and the actors in the movie were amazing. Storyline was good too, it's a funny and family movie."}, {"id": 107, "text": "One of the best movies I've watched recently. Simple, sweet and very well defining the bond of friendship. Would recommend"}, {"id": 108, "text": "Such a heart warming story. Very well written, executed and performed. A rare friendship between a young-oldie and an old youth. Would recommend"}, {"id": 109, "text": "One of the best movies I've watched recently. Such a beautiful story and direction. Applauds."}, {"id": 110, "text": "Nice direction and the actors in the movie were amazing. Storyline was good too, it's a funny and family movie."}, {"id": 111, "text": "Nice direction and the actors in the movie were amazing. Storyline was good too, it's a funny and family movie."}, {"id": 112, "text": "Nice direction and the actors in the movie were amazing. Storyline was good too, it's a funny and family movie."}, {"id": 113, "text": "Nice direction and the actors in the movie were amazing. Storyline was good too, it's a funny and family movie."}, {"id": 114, "text": "Had a really great time watching this wait for the end.."}, {"id": 115, "text": "Acting was amazing and well directed movie it was and will suggest everyone to watch"}, {"id": 116, "text": "South Indian movies include drama, comedy all in one package movie super duper hit blockbuster movie i kinda like it..."}, {"id": 117, "text": "Rediscovering the real meaning of life and friendship along the way. Very good movie along with good story mindset. And theme Must watch all."}, {"id": 118, "text": "This is a movie. I enjoyed immensely. Story line was very good, entertainning. A movie with brillant mindset. A story with the taste of honesty and dignity. Must watch ."}, {"id": 119, "text": "Great cast and everyone keeping up their character so greatly."}, {"id": 120, "text": "Wonderful movie, Once you learn how to live the life in a happy and unconditional way, you will be happy ever after. every scene in this movie is so meticulously written and directed that you won't feel like forwarding it even for 10sec."}, {"id": 121, "text": "This movie is mind blowing.. And it was too much fun to watch this movie. You will never get bore while watching 😍"}, {"id": 122, "text": "Such a great movie with great cast and everyone keeping up their character so greatly."}, {"id": 123, "text": "This one is a must watch a movie for friends and family nd try not to miss the beautiful journey of kD and kutty."}, {"id": 124, "text": "Very well written. Great work by the actors. must watch"}, {"id": 125, "text": "Nice direction and the actors in the movie were amazing. Storyline was good too, it's a funny and family movie."}, {"id": 126, "text": "This movie is good, also the concept of the movie is good. Nice direction and the actors in the movie were amazing. Storyline was good too, it's a funny and family movie."}, {"id": 127, "text": "Initially it was boring, but later on picked up, very nice"}, {"id": 128, "text": "I don't know tamil but the way they have used the language one can watch it easily. IT'S not necessary that you should know this language"}, {"id": 129, "text": "Definitely worth a watch. I loved watching this movie. The plot is very interesting."}, {"id": 130, "text": "Such a great movie with great cast and everyone keeping up their character so greatly. Wanna watch more movie like this."}, {"id": 131, "text": "Such a heart warming story , well written and execution"}, {"id": 132, "text": "This movie teaches us why it is important to live life to the fullest while enjoying it"}, {"id": 133, "text": "This movie will be the best thing in your day. Trust me."}, {"id": 134, "text": "Loved the cast... ! The main lead actor is upcoming nawazuddin siddiqui"}, {"id": 135, "text": "Clearly masterpiece of art. The actors have done a great job and the story is soo good."}, {"id": 136, "text": "This movie is such a masterpiece. They have tried to show nothing extraordinary but today's truth itself, how a father spends all his life sacrificing everything for his children just so he could enjoy all he has with them during his old age. Instead, what his children does is pray that he dies fast so that he could enjoy it with his wife and children. Would make your heart ache a bit sometimes for sure. I loved the old man and his acting was on point"}, {"id": 137, "text": "KD Karuupu Durai is a stunningly beautiful craft. Regret not watching it on the big screen. Make your Sunday pleasant and laugh your hearts out.For me there are so many but this paatti has quite a charm. Kudos to the director for the brilliant cast and attention to details esp about the village life. And unpretentious too"}, {"id": 138, "text": "We should encourage such movies as audience. Nicely crafted.. The bond age between two humans is so naturally described. The child's over do dialogues didn't look awkward. Heavy bacground score. It was a pleasnd surprise for the viewers"}, {"id": 139, "text": "We should encourage such movies as audience. Nicely crafted.. The bond age between two humans is so naturally described. The child's over do dialogues didn't look awkward. Heavy bacground score. It was a pleasnd surprise for the viewers"}, {"id": 140, "text": "We should encourage such movies as audience. Nicely crafted.. The bond age between two humans is so naturally described. The child's over do dialogues didn't look awkward. Heavy bacground score. It was a pleasnd surprise for the viewers"}, {"id": 141, "text": "We should encourage such movies as audience. Nicely crafted.. The bond age between two humans is so naturally described. The child's over do dialogues didn't look awkward. Heavy bacground score. It was a pleasnd surprise for the viewers"}, {"id": 142, "text": "We should encourage such movies as audience. Nicely crafted.. The bond age between two humans is so naturally described. The child's over do dialogues didn't look awkward. Heavy bacground score. It was a pleasnd surprise for the viewers"}, {"id": 143, "text": "We should encourage such movies as audience. Nicely crafted.. The bond age between two humans is so naturally described. The child's over do dialogues didn't look awkward. Heavy bacground score. It was a pleasnd surprise for the viewers"}, {"id": 144, "text": "Really a very nice one after a long time. Good story, perfect direction, perfect chouce of actors, excellent acting . You feel that you are a part of each and every scene.Hats off to Madhumitha and team. We expect to see many more such films from you. You are Satyajeet Ray of present time ."}, {"id": 145, "text": "KD- We should encourage such movies as audience. Nicely crafted.. The bond age between two humans is so naturally described. The child's over do dialogues didn't look awkward. Heavy bacground score. It was a pleasnd surprise for the viewers"}, {"id": 146, "text": "We should encourage such movies as audience. Nicely crafted.. The bond age between two humans is so naturally described. The child's over do dialogues didn't look awkward. Heavy bacground score. It was a pleasnd surprise for the viewers"}, {"id": 147, "text": "A beautiful heartfelt story. A lovely and sensible watch."}, {"id": 148, "text": "Wonderful movie with great acting skills of all the actors. Story line is very strong which will keep you entangled with it. There is no point where I feel bored or thought scene to be overstretched."}, {"id": 149, "text": "A vey unique and sweet movie. Watch it with your family to enjoy it."}, {"id": 150, "text": "We should encourage such movies as audience. Nicely crafted.. The bond age between two humans is so naturally described. The child's over do dialogues didn't look awkward. Heavy bacground score. It was a pleasnd surprise for the viewers"}, {"id": 151, "text": "KD- We should encourage such movies as audience. Nicely crafted.. The bond age between two humans is so naturally described. The child's over do dialogues didn't look awkward. Heavy bacground score. It was a pleasnd surprise for the viewers"}, {"id": 152, "text": "We should encourage such movies as audience. Nicely crafted.. The bond age between two humans is so naturally described. The child's over do dialogues didn't look awkward. Heavy bacground score. It was a pleasnd surprise for the viewers"}, {"id": 153, "text": "The movie is a short poem and every scene is like a poem. Enjoyed watching the movie."}, {"id": 154, "text": "KD- We should encourage such movies as audience. Nicely crafted.. The bond age between two humans is so naturally described. The child's over do dialogues didn't look awkward. Heavy bacground score. It was a pleasnd surprise for the viewers"}, {"id": 155, "text": "The language may be Tamil but emotions know no language! A must watch movie this quarantine!"}, {"id": 156, "text": "We should encourage such movies as audience. Nicely crafted.. The bond age between two humans is so naturally described. The child's over do dialogues didn't look awkward. Heavy background score. It was a pleasnd surprise for the viewers"}, {"id": 157, "text": "It was amazing! Worth my time. Wanna give it an another watch. I really had fun."}, {"id": 158, "text": "Such a great movie! Actors have performed very well. Story written was exceptional! Direction has also been to the point."}, {"id": 159, "text": "Once you learn how to live the life in a happy and unconditional way, you will be happy ever after. An amazing heart warming story. Everyone must watch. It showed how cheerful the relationships can be converted."}, {"id": 160, "text": "Its great and a heartwarming movie.quality movie. Everyone must watch. It showed how cheerful the relationships can be converted. Once you learn how to live the life in a happy and unconditional way, you will be happy ever after."}, {"id": 161, "text": "Unique story line. Great acting and also such a heart warming story."}, {"id": 162, "text": "Hope u all watch this movie 🎥🍿.its a great movie it shows a lovely bond of friendship between a oldie and a youngster.Hope u enjoy this movie I enjoyed it a lot ."}, {"id": 163, "text": "Such a heart warming story. Very well written and performed."}, {"id": 164, "text": "One of the best movie i've watched till now. Treat for the viewers."}, {"id": 165, "text": "The child's over do dialouges didn't look awkward. Pleasant surprise for the viewers."}, {"id": 166, "text": "A very unique and sweet movie. Go and watch it with your family. You'll enjoy it."}, {"id": 167, "text": "This movie was great. I saw this movie on the second day of release and i actually want to say it was a great decision."}, {"id": 168, "text": "Nicely crafted. Heavy background score. A treat for that section of audience who love quality movies."}, {"id": 169, "text": "One of the best movie i've watched till now as it has a very new element added to it."}, {"id": 170, "text": "KD- We should encourage such movies as audience. Nicely crafted.. The bond age between two humans is so naturally described. The child's over do dialogues didn't look awkward. Heavy bacground score. It was a pleasnd surprise for the viewers"}, {"id": 171, "text": "Awesome film 👌 like it very much and have a great experience"}, {"id": 172, "text": "A bittersweet cross between second-childhood and coming-of-age, director Madhumita's Tamil dramedy KD packs both side-splitting laughs and emotional punches. On one hand, it presents an absconding octogenarian trying to live life to the fullest; on the other, an orphaned ten-year-old biting off far more than he can chew. They meet in the middle, as do the stylistic approaches Madhumita takes to each of their stories; the rhythm of youth re-discovered meshes surprisingly well with the volatile snark of adolescence."}, {"id": 173, "text": "Gripping plot and an unique storyline justified well by the cast. Good movie."}, {"id": 174, "text": "We should encourage such movies as audience. Nicely crafted.. The bond age between two humans is so naturally described. The child's over do dialogues didn't look awkward. Heavy bacground score. It was a pleasnd surprise for the viewers"}, {"id": 175, "text": "We should encourage such movies as audience. Nicely crafted.. The bond age between two humans is so naturally described. The child's over do dialogues didn't look awkward. Heavy bacground score. It was a pleasnd surprise for the viewers"}, {"id": 176, "text": "Enjoyed a lot watching this short story .. it has a nice story over all"}, {"id": 177, "text": "We should encourage such movies as audience. Nicely crafted.. The bond age between two humans is so naturally described. The child's over do dialogues didn't look awkward. Heavy bacground score. It was a pleasnd surprise for the viewers"}, {"id": 178, "text": "We should encourage such movies as audience. Nicely crafted.. The bond age between two humans is so naturally described. The child's over do dialogues didn't look awkward. Heavy bacground score. It was a pleasnd surprise for the viewers"}, {"id": 179, "text": "We should encourage such movies as audience. Nicely crafted.. The bond age between two humans is so naturally described. The child's over do dialogues didn't look awkward. Heavy bacground score. It was a pleasnd surprise for the viewers"}, {"id": 180, "text": "Watching and old man realising how he has not really lived his life to the fullest makes a viewer check upon themselves. It makes you appreciate a little more and makes u realise one should live their life to the fullest while we still have time."}, {"id": 181, "text": "We should encourage such movies as audience. Nicely crafted.. The bond age between two humans is so naturally described. The child's over do dialogues didn't look awkward. Heavy bacground score. It was a pleasnd surprise for the viewers"}, {"id": 182, "text": "How an oldman too has desires and dreams in his life... There's always a kid inside a human being. Perfect portrayal of the same. Do watch it once."}, {"id": 183, "text": "Its a very wonderful movie......i think everybody should watch this .......i love it.....thank you"}, {"id": 184, "text": "Soulful movie, must watchable K.d Ramaswamy as kd alias karuppudurai and nagavishal as kutty were outstanding. Big applause to director madumita.A simple yet an important deep rooted issue with an essence of life to-do list charters out with an old -man having a great fun filled with emotions with grandson alike kid to enjoy the flow of life as it goes."}, {"id": 185, "text": "This movie was great. Wish to see this again.. The cast was great with the wonderful lead charecter."}, {"id": 186, "text": "It was so entertaining that i couldnt blink my eyes for a second. Loved the story line , concept and the acting."}, {"id": 187, "text": "Such an excellent movie. Well written executed and performed. Loved it"}, {"id": 188, "text": "A beautiful tale filled with humour in between. It's a good movie."}, {"id": 189, "text": "Amazing movie, everyone must watch! Good story line, and amazing acting! Lovely!"}, {"id": 190, "text": "It's a very nice movie. I will recommend this movie to everyone. I just love it."}, {"id": 191, "text": "Very heart touching and deep movie that captures attention from the first minute. Amazing work!!"}, {"id": 192, "text": "The movie is based on a father who wants to fulfil his bucketlist whereas his sons wants to kill him."}, {"id": 193, "text": "A rare plot portraying life and relationships, with a lot of laughter and emotional punches. The film also imparts quiet a few important messages like not treating our elders as burdens, or its never to late to live upto our dreams. The bittersweet and feel-good plot makes it a must watch."}, {"id": 194, "text": "KD was unexpectedly good. I found the plot intresting but the movie was surprisingly overwhelming in a good way."}, {"id": 195, "text": "This movie is basically a person who wants to fulfil his bucketlist before dying. The comical element being his sons want to kill him"}, {"id": 196, "text": "Great movie after a long long time. Perfect blend of everything. Keep it on your wishlist"}, {"id": 197, "text": "Unique script. It was a light hearted movie with a touching plot. Indian families do go through issues like this, and making a movie on a light note on a serious topic like this was commendable."}, {"id": 198, "text": "This movie has an amazing storyline as its lockdown i really enjoyed this movie with my family and everyone should watch such an amazing movie."}, {"id": 199, "text": "I loved how the uniqueness of the plot was done justice by the entire cast and also the director. The plot is intriguing, but the movie lived up to the expectations. Didn't get cliche still stayed lighthearted. Good one."}, {"id": 200, "text": "An upward moving plot. Never will you be bored, full of humour and moments of joy. A heart touching story of a common man."}, {"id": 201, "text": "Nice movie. Really loved it. Really nice concept. Amazing movie."}, {"id": 202, "text": "From perfect framing of the movie till the acting by the cast, the movie is a masterpiece and deserve a lot of appreciation."}, {"id": 203, "text": "I'm searching the words to say about this film... I just say one sentence This film made tear in my eyes automatically"}, {"id": 204, "text": "As i said in headlines, Never late to start living your life or dreams to the fullest. Enjoyable movie with perfect blend of emotions....🙏🙏🙏"}, {"id": 205, "text": "If you love relationship with anybody watching this film will give you sweet memories."}, {"id": 206, "text": "I'm sure Madhumita shot a lot more film but had to chop it off! I'm sure she took more time to transform a thug too."}, {"id": 207, "text": "A must watch movie which tells us about the cruel customs followed in Tamilnadu rural areas regarding old people! Dnt miss it!"}, {"id": 208, "text": "A light-hearted movie that shows how happiness could be found in simpler things and gives out positive vibes. The child character is potrayed so beautifully; he shows us how to stop complaining and to accept and appreciate our lives for what it is. Thanks to the director Madhumitha for making this film."}, {"id": 209, "text": "After long time watched best movie. Tears in my eyes, from today I will be watching low budget movie like this, no action hero, no item songs. Scene by scene I was enjoyed, what a screen play and direction. Omg! 100% Best Movie."}, {"id": 210, "text": "*SPOILERS* KD is such a heartwarming movie. This is such film that lifts you from rock bottom. The movie starts with the 'mind-voice' of 70-year old KD aka Karuppu Durai who is in a comatose state, while his children plot to get him euthanized. How KD evades this blasphemous act and join hands with a quirky but kind-hearted kid on a journey of wishful thinking! The emotions are played our real and pure. The scene where KD transforms into a kid acting restless for a candy (Biryani in his case), and when he gets it, the way he eats, sure want the viewers to get their own plate."}, {"id": 211, "text": "Loved every spec of this movie..It's meaningful, touchy and a delight to watch. KD and kutty - A perfect energy balance. Also shows the importance of how a pure hearted soul of a kid can bring joy to old people.. Hope no one ( old or young) have to go through phase of getting dejected by their own."}, {"id": 212, "text": "Simple movie makes you believe in the age old art of story telling"}, {"id": 213, "text": "What a beautiful and poignant movie! One of those rare movies that exhibit lovely portrayal of relationship between an old man and young orphaned child. The director takes us on a beautiful journey with well chosen village landscapes, local dialect, and perfect castings. Each one of these casts make you like them so much; KD and Kutty are bound to steal your heart! Background score by Imman is top class and is very apt for the genre. Cinematography was exceptional, showcasing the rustic beauty of the southern countryside. Dialogues and story writing were too good. Climax is too good! One negative aspect is that the subtitles were pathetic! Movies like this give you hope that there are directors with wonderful story telling skills, and that the Thamizh movie industry is still safe, despite producing run of the mill mass hero movies that blunt audiences' minds.Please watch!"}, {"id": 214, "text": "#KDEngiraKaruppuDurai Absolute gem from #Madhumita Meet Mr Kutty and Mr #KD At the end Your tied up with emotional journey !"}, {"id": 215, "text": "Watched it without even watching trailer...what an awesome movie !! Set in rural areas of India, this movie will touch your heart ! The kid and the old man will set an example par excellence to all how life should be lived !! P.s I immediately ordered a biriyani post movie !"}, {"id": 216, "text": "What an amazing work! Direction, cinematography, acting, screenplay were excellent enough to alleviate a simple yet beautiful story and turn it into a brilliant movie. Hats off to all, specially to the young Nagavishal."}, {"id": 217, "text": "A lovely little film with a big heart. Movies of these sort should be loved, appreciated and shared to the maximum extent. #TamilFilm #MustWatch"}, {"id": 218, "text": "It was all positive people portrayed in the movie except for few greedy children, it would have been a little more natural if it had some more real life scenarios. Life is definitely not too smooth. Amazing acting by the Duo and kudos to the entire team both production and technical. Keep it up, don't lose hope if there are few viewers and ratings, wishing you only the best in your next venture.Good Luck and God Bless !"}, {"id": 219, "text": "This story reminds me of the many stories that I discussed with my fellow partner-in-crime in the not so distant past. Quite many a time, seriously ill patients with advancing age with the myriad of medical illnesses that complements the geriatric population often gets admitted to his unit. Invariably, the patient's children would insist that their moribundly ill elders get all the best treatment that money can buy. The oft-repeated dialogue would be, money is not a problem. My friend knows it is no use flogging a dead horse but like a good servant he is, he obliges, every time.The tide would be going against the acutely ill patient. The next of kins would, however, stay hopeful. The life is literally hanging on a thread, living on a prayer. But hope lies eternal in the human heart.Days move ever so slowly but the patient's condition did not improve. Slowly, the number of visitors hanging around the visitors' lounge becomes thin. People have to go back to their daily routine. One has to live for the living. Occasionally, the nurses can hear arguments amongst siblings. One busybody nurse overheard one relative threatening to stop contributing to the family coffers. Then another would butt in to say that the treatment is the least the family offer to the patient. And yet another would throw in the towel citing economic reasons. Collectively they all would agree that the successful one amongst them take the tab.Soon it would be a single relative hanging around to get daily updates on the patient's progress. Then the Universe will speak and lead to an amicable curtain call so as to give a suitable closure to the whole brouhaha. Nobody gives what the patient wants. The living decides what is best for the dying.Everyone says that there is an absence of sufferings on the other side. One can enjoy of all kinds, eternally satiating all the senses at a divine but first, one has to die. That is the problem. Nobody wants to die no matter how much one is convinced of life after death. This offbeat but entertaining drama tells of an unconventional bond between an 80-year-old man, KD, and young orphan boy, Kutty. This octagenarian was in a coma for three months. Lying in his daughter's home, given up by doctors, he holds on his life. Refusing to die, he becomes a burden to his 5 kids. They just want to go on with their lives. One sibling wants to marry off her daughter. Another is waiting for his inference to settle his debt. The youngest child, however, does not like the idea but relents anyway when collectively the family members decide to terminate the old man miseries by performing euthanasia using traditional village methods. By a twist of fate, the 80-year-old came around at the precise moment, overheard the conversation, and scooted off the scene on a local bus. He paid the fare for the last stop but the bus broke down in the middle of nowhere. KD decided to hang around a small temple, help around the temple, and make acquaintance with Kutty.His friendship with Kutty gives KD a new lease of life. Kutty, an orphan, a street smart boy, was left at the doorstep of the temple at infancy. For the first time in his life, Kutty found love in an adult. Kutty made KD's bucket list and together they try to fulfil the list. The family, upon realising KD's disappearance, assigns a private investigator who is hot on the old man's trail. Another entertaining story with a picturesque spread of the Indian countryside. It has its fair share of quirky moments as two members of different generations try to find commonality.A lesson to learn: Do not let your family members decide the fate of your life. When your faculties are no longer yours to make a decision, they will make decisions that suit them or what is expected of them by society. Your suffering will be their bargaining chip. Write a legally binding declaration of refusing resuscitation when the situation arises. Have a difficult but necessary discussion of opting to turn off the plug when things do not look promising. Let people remember you as the ambulant and cheery person you are; not as the pain with tubes that drained half of the family heirloom, if there is any left."}, {"id": 220, "text": "A charming small movie about the relationship between brave Kutty and solely Karuppu durai (later he names him Kd). Madhumita narrates the heartwarming story of an old man, who leaves his house as he hears a plan of killing him after waking up from Coma.He meets a stubborn orphan Kutty who lives in a temple.Kutty shows no respect for Kd ,argues with him but Kd loves to be with him. Madhumita places beautifully designed scenes to make the journey smooth.The scenes where they discusses and finishes all wish list is truly a treat to watch and it stays with you. Bgm aptly switched mood from humour to intense emotions and switching seems to be quite natural and organic. Mu ramasamy-Naga Vishal combo provides an engaging flow to the movie and On screen,they share wonderful individual performance too.Ramasamy really amazes in emotional scenes when kd hears the conversation initially and when he says to Kutty about his school admission. Dialogues too were funny enough and spot on . The only drawback I found was the lack of clarity towards the climax . Kd in short is a journey of pure joy."}, {"id": 221, "text": "Karuppu Durai (Mu. Ramaswamy) is a bedridden old man. One day,his children (except his daughter) plot to perform a traditional ritual of euthanasia on him as they think he will be a long term burden to them. They are also eyeing his property. Karuppu overhears this,and summons as much energy as he can to escape from the house. He takes a bus to a nearby locality and spends the night at a temple there. In the morning,he is greeted by a cheeky young boy (Nagavishal) of about 7 or 8 years of age who scolds him for sleeping at the spot which he has reserved for himself. KD soon finds out that the boy is an orphan who was adopted by the temple pandit. From then on, the old man keeps getting into trouble with the boy, but soon enough, circumstances change and both of them become close buddies. The boy creates a bucket list for KD,as he's already in his twilight years. In the meantime,Karuppu Durai's children enlist the help of a guy to track him down. This is a heart touching tale of an unusually close bond between two people,one whose life is almost ending,and of a child whose future is just about to unfold. How long will this friendship last? Will KD's family find him and put him to involuntary death? The director must be appreciated for injecting lots of humour into what could possibly have been a depressing story. Nagavishal, in his debut role, wins hearts with his cheeky mannerisms and toothy smile, while Mu. Ramaswamy warms hearts with his frequent bursts of laughter. All in all, this story is about making the most of what we have, even under pressing circumstances."}, {"id": 222, "text": "Have never witnessed such a poetic travel with an orphaned boy and an old man who is deserted by his family.. The boy acting as Kutti is a fire cracker. The whole movie is a beautiful portrayal of love woven between the grandson and the grandfather. . The savviness with which kutty (the grandson) capitalizes grandpa's unsatiable desire for Biryani, his sincerity in teaching grandpa how to whistle, the admiring glances he makes at the grandpa immensely enjoying the MGR movies.....Wow...we can keep elaborating .Every Frame is worth elaborating. The Back ground score is a story teller by itself.The Pulse of the movie is its nativity, In most of such village based stories, while the entire cast is native looking and dark, the heroines are mostly the calendar girls of Vijay Mallaya who are pathetic in their roles. But in this movie the heroine is a 70 year old lady with wrinkles in the face who comes in for just 2 shots. But the shyness that she brings in that face in a split second just by itself is worth watching this movie. If Ramasamy , Nag Vishal, MAdhumita and the rest of the cast do not bag the national awards then it is a disgrace for the awards."}, {"id": 223, "text": "The last two calendar years saw a sagging downfall of Tamizh Cinema and this film definitely breaks those shackles to emerge as a fresh breath of air. A movie that manages to portray the negativity of superstition in the most humorous way possible.Commendable Performances: Kutty / Nagavishal : Amazing find but need to make sure he continues this dedication towards each roleMu. Ramaswamy : Great expressions and body language. Carried the movie along with easeMu.Ra's yester-year love interest : What an expressive artiste..WOW !Music / Lyrics : Amazing tempo and tapping yet soothing numbers by Karthikeya MurthyEasy on the ears lyrics by SabariEditing : Great Attention to Detail and finesseDirection : Carefully crafted to capture audience and to made sure audience can relate to each scene.Overall : Crafted to perfection !"}], "reviews_amount": 224}