{"name": "Nishabdham", "titleId": "tt09605894", "reviews": [{"id": 0, "text": "This is just my opinion about the movie **Spoiler alert** Focusing on just the story of the movie I really liked the way it put to us, especially the cause for such brutality But I feel the antagonist took pretty extremes measures rather than taking other alternatives, I know that it's pretty devastating to find out that your significant other is cheating on you, Just the thought is pretty disturbing, but the decision to take up justice into one's hand isn't correct We are none to decide who gets to live and who doesn't, There are other logical options to be taken like Courts or just a conversation about it would be more meaningful to be frank I feel someone who's rage driven are the ones who take up such drastic measures, I mean how long were they even planning to go on their killing spree, I especially liked the question the movies leaves us with Is it really fine to let the protagonist go with her crime? I mean she at last did take up justice into her hand by killing the antagonist, isn't it the same reason the antagonist was killed for? That's a really good question to be asked"}, {"id": 1, "text": "Good movie,cast acting is mind blowing undoubtly anushka is best is this film ,the suspence ,twists are good but climax not upto mark overall a good one time watvh movie"}, {"id": 2, "text": "Great movie. Anushka acting nailed the show. Madhavan acting is the horrible. we can say.... perfectly it's a family entertainer BGM score is superb...twists are interesting.There is no lag of story. Perfect timing and Anushka acting and screen presentation is simply superb. Shalini Pandey acting is good and most of the story ruled by Shalini Pandey is the captain character is the most interesting character in this film. Anjali nailed the performance as a police officer..1st half all about investigation....2nd half all about her past story. Finally the movie is super with a great ending ."}, {"id": 3, "text": "It was nice, interesting movie! How they presented the movie and created the story was good👏😊"}, {"id": 4, "text": "Amazing Twists and turns the movie is made very well. Don't want to spoil it in any manner so I'll keep it short. It is magnificentely produced and directed particularly well and I don't know for what reason political or for what it is getting rated this badly but I loved this movie truly a great watch. Enjoy It 🎥🍿"}, {"id": 5, "text": "Director Hemant Madhukar did great job, the direction was amazing and our Anushka did always sweet. Everything is good and the movie looks like hollywood movie, Thank you for giving best movie in this situation."}, {"id": 6, "text": "Don't know why this movie has received such a poor rating! It's an excellent thriller that keeps you engaged from the very beginning! Do not go by the rating....watch it for an outstanding performance from Sweety Anushka! Also the plot is interesting and not far-fetched as many reviews have claimed! Beautiful locations add to the thriller quotient:) Don't miss this one looking at the ratings:) Go for it for Sweety's performance, locales, and plot!"}, {"id": 7, "text": "I watched this film today... Sakshi's &amp; Sonali's friendship is so beautiful..such a great bond...sonali was so protective abt sakshi... I wish I had that kind of friend..In real life, even though we have family...v feel alone...I feel ppl in orphanage are so lucky to hv friends those who stay with them life long... How beautiful it would be if i was brought up in an orphanage n I had a frnd like sonali..."}, {"id": 8, "text": "Its very impressive, any physically handicapped type acting can do but except deaf and dumb with a sign language is a toughest one. One of my fav actress, she proved her efforts and her talents taking it to the next level and nobody can perform the way she has done. Ofcourse how can I not even appreciate the acting of madhavan too, and other actors as well. Kudos to the team. This movie isn't regular mystery murder, but a way unique than any other films out there, with a twist and tale. Hats off everyone!!"}, {"id": 9, "text": "Queen U Never Fail To Impress Us Doing A Total Silent Film It's Not Easy For Other Actor/Actress But U Did This Hats Of To Your Hardwork &amp; Dedication Queen Last Twist One Word It's Awsm Each &amp; Every Cast Did A Awsm JOB... It's Really A Hollywood Crossover Film..... Me &amp; My Family Enjoyed Alot... Specially Sweety My Sweetheart #AnushkaShetty U Did A Wonderful Job I Loved It Honest review : The film was beautifully carried throughout with the suspense, making us think in all the angles. Silence was broken but the reason wasn't convincing. #AnushkaShetty carried the whole film on her shoulders. They tried out an different angle, not an usual film &amp; Maddy &amp; Anushka. Feel So Good To See U Both Again' U Guys Did A Wonderful Job And Also Shared A Great Chemistry Hoping To See U Both Again On-screen. A One Women Show"}, {"id": 10, "text": "Very good movie. Thriller. Its time to watch and appreciate movies of this type. Indian people are blindfolded by the age-old common template of thriller, horror, masala and blockbuster films. Not every film has to adapt the template. If any movie crosses the common template, people go crazy and start giving reviews as its not nice or waste f time movie. Nishabdham is a fantastic movie for Indian cinema. Story and screenplay is giving edge-of-seat experience. Every character holds a value or story or lesson to understand here. Way to go for more awesome movies AnushkaShetty.Acting superb and all characters in this movie acted very well to the story. Shalini pandey, you have performed your part superbb."}, {"id": 11, "text": "Ecstatic screenplay, spellbound plot, perfect cast. Worth watching!!! What a cast man!!!! Credit goes to director Hemant Madhukar who did a phenomenal job in elevating the characters and showed his expertise in presenting them on screen. I did not feel disappointed or useless about any character unlike some films where the cast will be used only for screen presence. Songs are so adapted into film and elevated the plot. Anjali, Michael Madsen, Madhavan, Subbaraju, Shalini, Avasarala Srinivas perfectly fitted to their assigned roles. And their characters added value to the film. After long time, subbaraju got such a good role and he deserves it. Most beautiful actress Anushka killed it!!!!!"}, {"id": 12, "text": "An amazing attempt at a Hollywood style murder/ mystery/ thriller. Anushka's underplayed character is so lovable. Again happy to see Madhavan on screen after so long. Great work Maddy. Just wished that he had more depth in the dialogues when he is confronted by his wife.. Subbaraju put in a pretty decent performance. 100% delivered.Anjali, looks her part as a police officer. Impressed with her outfits and the way she carries herself. We shud see more of u Anjali in these type of outfits. Just too good.Overall a team that had worked together to deliver this awesome movie. Can watch it few more times. :) congrats🎊🎉 to all of u on this project. 100/100. 🙏"}, {"id": 13, "text": "Nice movie for ott release. Don't expect much.One can understand at the movie beginning who the villain is it's shouldn't be like that director should have take care about this. While watching the thrillers the first question should be for the viewers was who the villain is? Atleast upto to interval viewer shouldn't find the answer for that question but in this film we will easily find out the the villain at the very beginning and the only question and purpose to watch the full film is just why he done that? When u find why? In the climax it might bring you some dissatisfaction so that's why don't watch the movie with high expectations it's not a edge of the seat thriller one type. And rest of the actors done well as usual Anushka shetty fave her 💯 percent output only for her acting iam giving 10 director tried to show a new kind but he should have been more careful about the story and screenplay. Rest all was good......"}, {"id": 14, "text": "Good movie nice suspense can watch it once anushka acting superb"}, {"id": 15, "text": "Watched it in Tamil and right from beginning anjali's narration was so lifeless! Damn alger acting and stupidity! i mean She seems too happy to hold toy gun in crime scene where its not necessary. It doesnt stop there, Virudhunagar visaranai was ultimate facepalm!! Watch it to troll!!"}, {"id": 16, "text": "Pathetic to the core !! Don't ppl read the script or watch the movie before releasing...OTT has become a dumpster !!"}, {"id": 17, "text": "Storyline is weak. The amount of gaffs is astounding. 13 shots from a 6 shot revolverpolice not using gloves to handle evidencecrucification drawing appearing in a dead woman's roomcoroner enquiry of Anthony's wife not finding any head injuries, but alcohol intoxicationdead girls in black bags not weighing anythingmolten lava appearing from nowhereAnd so many more!"}, {"id": 18, "text": "Firstly, just by looking at the cast this seemed like a great movie.But OMG, I COULDN'T BE MORE WRONG!Everything in this film was in one word LAZYThe acting, the narration, the story. I have seen C grade movies with more emotions and common sense. Makes me wonder do these characters live in an alternate world where their main hobby is CRINGE?!!!Just watch it for the laughs guys. If you take it serious, you might become mental!"}, {"id": 19, "text": "Worst Editing and Storytelling with Lazy Performances Felt like Shalini Pandey is a Daughter of Anushka ShettyWasted Time of Viewers/Public"}, {"id": 20, "text": "Every thing in this movie is predictable and mother the twist in the end seems very engaging. One time watch only for the actors performances and good music."}, {"id": 21, "text": "I literally sacrificed my sleep to watch this movie as soon as it drops on Prime Video. But alas, I regret my decision! A plot that is so shallow that even the potholes present in Bengaluru's road has more depth, tbh! R Madhavan was really good in this movie, yet his character's motivations were totally one dimensional. Also, no explanation as to how Michael Madsen's character became friends with Madhavan's or what history they shared with each other. If the writers had worked on this, probably some semblance of logic and clarity could have been obtained. Anushka Shetty was ok types, Shalini Pandey literally irritates me in every frame she's present. Subbaraju was ok, Anjali and company were another group of useless ingredients to an already badly cooked plot. I would have given this movie 1.5 star, but out of respect for Madhavan and great singing by Sid Sriram, I have given it 5."}, {"id": 22, "text": "Totally predictable and wasted chance by the director..shortfilm director can write better story and casting is worst... shalini pandey looks like anushka elder daughter in the film but turns out to be best friend...first half is suspense and second half is absolutely predictable and story is dragged too much overall hardly one time watch and you can skip this"}, {"id": 23, "text": "What a terrible of a movie.. Seriously.. NARRATION SUCKS.. SCREENPLAY IS EVEN WORSE.. Ankusha is happy to be mute in this nonsense movie.. Anjali as a Seattle PD officer is a joke.. Why her.. She doesn't fit to be a homocide detective nor she has the looks or body language.. god knows what the director was thinking..."}, {"id": 24, "text": "Very boring, predictable movie don't waste your time by watching this movie acting is pathetic by all the actors penguin was 100 times better"}, {"id": 25, "text": "Anushka and Maddy does their job. Anjali wrong option."}, {"id": 26, "text": "It's not as terrible as the other reviewers make it seem. Not as engaging as it should have been. Anjali is miscast, Amy Jackson would have been better. Story was decent but screenplay and background music could have been better."}, {"id": 27, "text": "This whole movie is about honor killing , and good to watch it over all a decent movie about love, revenge and suspense."}, {"id": 28, "text": "First ten minutes, I guessed the plot. So many non relevant dialogues"}, {"id": 29, "text": "Nishabdham had huge expectation due to the horror mystery triller which was the actual.ploy when the movie starts but after interval we could find the movie has missed and deviated from the story. The movie is all about investigation of Missing Friend, Murder. There is no big suspense which is the base of any action mystery triller which will be Engaging. The Movie has missed proper story and Screenplay. It's a average film and director had confusion and what the film will deliver for audience. My Rating is 2.5 out of 5. Music was at the best. Score by Girishh and Music Sound Track by Gopi Sundar and Vishwajeet Jeykar"}, {"id": 30, "text": "I believe 60's suspense movies were directed much better than this, director was clueless in connecting past and present story, background music was terrible, saved by not watching this in theatres."}, {"id": 31, "text": "Good movie in 2K20...🤗Anushka did a great job and direction was awesome."}, {"id": 32, "text": "Nishabdham movie the best 2020 black bhastar movie hollywood renj movie 100stars review movie"}, {"id": 33, "text": "It was not a good movie. The plot started with a horror movie and ended on a different note altogether. If a wife cheats in a relationship does that mean all apples are rotten ??? Does the lead actor take upon the task of cleansing the society like God. The director chose to make a movie on infedility when already dozens of movies have been made. The lead actor kills his wife and wife of the captain too in a motel without arousing any suspicion of the police and law enforcement agencies. Very poor script and in a couple of scenes it looked as if the face of Madhavan was digitally remastered. The title song was good and opening scene was good, rest of the movie did not make any sense. The lead actor needed to visit a psychiatrist instead of going on a killing spree. The movie can be skipped except for acting by Anushka."}, {"id": 34, "text": "Better not to watch this movie. Waste of time. Director and writer completely failed in all aspects. They should have watched the movie themselves. Complete waste of brilliant cast like Madhavan, Anushka, Anjali..."}, {"id": 35, "text": "Acting is terrible from all actors specially the lead, the detective, and they have wasted brilliant actors like Madhawan and Michael Madsen and a good story, Do your self a favour and skip this movie, don't make the same mistake I did."}, {"id": 36, "text": "It can be made in INDIA. I really didn't understand such a worst movie carry out shooting in USAnushka character as DUMB is clearly useless and unsensible."}, {"id": 37, "text": "Cons- 1. The movie is a musical as out of the 120 minutes runtime some 100 minutes have a background score. A few songs don't hurt but excessive playback drains the thrill out of it. 2. Around the half time, an officer is strangulated by the chief in front of dozens of people but no one sees him. Since the death was unnatural there must have been an autopsy which would have shown the officer died not because of falling down. Plus there must have been marks on the victim's neck which was ignored. 3. Maha turns out to be a know-it-all cop who can decide the killer just by finding a piece of yarn in the victim's hand 4. Maha is a terrible spy yet is never caught. A bunch of times she is real close to being busted but is saved predictably . I mean who talks on phone during a spying mission 5. There are some small predictable sub plots but nothing that will deter your experience. Overall the cinematography could have been better.Pros- 1. It has anushka shetty. 2. A good script and you will never feel that the story is unnecessarily stretched. 3. The cello playback will keep you engrossed. 4.Most of the major questions get answers by the end. 5. Most of the actors have aced their roleOverall it's a good movie and you will feel satisfied at the end"}, {"id": 38, "text": "The movie is gritty in moments and scattered in others. But some of the characters don't have depth in their acting. One time watch."}, {"id": 39, "text": "Story is good. But could have been better with better screen play. Give a try"}, {"id": 40, "text": "Nowadays anticipation for movie lovers was too high even when theatres are not yet opened. This movie was one among them for me. The story line was just solving a murder case, but the way they started it was like watching a horror movie. But then the story was changed. From finding a murder to solving a long lasted issue. Though the narration was not great but the mysterious moments make you to the seat edges watch. All the suspicious moments were got broke on the last few minutes. Though they tried to get you thrilled enough, they lost it when it comes to story. The story was not too impressive, Madhavan and anushka does the great work in the pre climax scenes. A clean and neat murder mystery movie with some logical and story flaws. You can give a try!"}, {"id": 41, "text": "Having the Horror plot and connecting with it was never in the story, story become too predictable and missed its core concept"}, {"id": 42, "text": "The movie has one of the stupidest plots I've seen in a while! Pls donate money for the psychiatric treatment of the producer, director and writer!!"}, {"id": 43, "text": "10-15 minutes into the movie, you will realise how bad the direction is. Story line, screenplay, acting, nothing is good! A bad choice for the lead to have accepted a movie like this"}, {"id": 44, "text": "It is a story about Antony(a cello artist), Sakshi (a painter), Richard D.. something (a cop whose last name the the movie makers were too lazy to make up their minds about), Maha(a detective in Seattle PD it seems) and Sonali (God knows what she does). This movie has too many problems! I'll go one by one1.Lack of Relatability None of these characters have any backstory except Antonys which mind you is so superficial, but at least he had one. All the others just exist out of nowhere..for example Sakshi and Sonali are orphans who were both raised in an orphanage in US and for some extremely random reason, have Indian names and know Tamil/ Telugu/Malayalam!! And one wonders why the detective in Seattle PD speaks with an Indian accent, if she's a migrant who recently went to the US and has not learnt to speak the way they do, how did she get a job in the Police Department?? In fact this movie has no relevance in being set in the US! Could have just been set in any city in India without altering anything- that could have made the movie more bearable, since they could have avoided subjecting the audience to the cringe worthy acting of all the foreigners in this movie (yes! Including Madsen.. I don't know what he thought while signing up for this). No movie could not be more unrelatable than this one!I rest my case by saying this, there is a scene in the movie where an American cop translates the Tamil into sign language for Sakshi (she is mute). Seriously?? Are we unaware of some kind of Tamil education the people of US receive to become cops?Plot Its rubbish, it seems like the writers just wanted to add a few twists, thought out what they were and came up with most lazy and underwhelming story to connect the twists.Characters *Spoilers* Don't even get me started on the backstory of Antony (Madhavan), it's absolute nonsense - he starts killing women who cheat because his wife cheated on him? I understand it if they showed that he had some mental issues and that his wife cheating on him, somehow triggered his psychosis..but noo, this movie wants to show him as the victim, poor guy only mangles women's heads because he thinks they want to cheat ..That's just super shallow, ridiculous and a dangerous message!!! Also the glorified relationship between Sonali and Sakshi is just so toxic. Sonali does not like it when anything good happens in Sakshis life (when she gets s new job, or a boyfriend)? And they're best friends it seems, they show it like it's just so normal.All in all the movie sucks big time! Don't waste your time or brain space on it. I have already wasted too much, watching it, writing a review on it, all so that you don't subject yourself to this torture."}, {"id": 45, "text": "I wonder how Maddy and Anushka accepted to play their respective roles OMG. Anyways trollers can pick a lot for their content."}, {"id": 46, "text": "Don't bother watching this movies. Major plot holes in the entire movie. Acting, editing, story, dialogues were all horrible."}, {"id": 47, "text": "Honestly, the only good thing was Madhavan smashing the super annoying weird pyscho friend of Sakshi onto the floor. The director surely could have found a better script. Waste of talent."}, {"id": 48, "text": "Best to skip this movie and find something else. Not worth to even go through any review."}, {"id": 49, "text": "Please watch your favorite movie for 20th time instead of watching this absurd movie once. Not sure which department I should call worst among screenplay and direction. Both sucks anyway. Only three words that came to my mind while watching the movie were irrational, illogical and of course pointless."}, {"id": 50, "text": "A low quality direction with high quality cast. I wonder how actors like Madavan and Anushka gave this director a chance to make this low grade movie. Waste of time I would say."}, {"id": 51, "text": "Watch this movie if you want to waste 3 hours of your time. Logicless story and narration will make you go nuts."}, {"id": 52, "text": "I am so glad this didn't release in the theatres. I am not sure what was the point of this movie. The story has no backbone, editing is pathetic, most of the actors are like zombies, music is OK but no point or context. Please stay away from this, this is neither horror nor thriller nor drama it's just bad."}, {"id": 53, "text": "I being a huge fan of murder mystery / Suspense thrillers, never miss a movie with these words in them. This movie is an insult to all of these.. forced justification..This is one of the most ridiculous movie I have ever seen, The narration and plot is very bad, and Anjali acting is the worst. Looks to me like the Director was clueless. And seriously hated the plot where killing madavan even after hearing his version of story was Justified as Good is prejiduce. According to me both sonali and madavan were having a mental disorder and both needed treatment..Stupidest climax ever...!!! Dont watch it..!"}, {"id": 54, "text": "Anshuka acted well and over all movie taken in nice way.you won't get bored anywhere."}, {"id": 55, "text": "Super engaging screenplay and I don't know why it's rated low Please watch it without getting influence by the rating"}, {"id": 56, "text": "Bad story, Bad Screenplay, Madhavan and Shalini gave some good performances. Anjali is ok, Anushka is not even ok. Cinematography is decent, Artificial sets, dull music."}, {"id": 57, "text": "Madhavan rocked as a Hero again but movie scenes are predictable."}, {"id": 58, "text": "The worst movie in OTT I watched till now A pathetic movie . No proper story"}, {"id": 59, "text": "How they can release this type of dirty and waste movie, by giving big promotion, there is no story no emotions, no script everything ther is nothing, only the thing that movie can watch one time , because of the music composed by the gopi sundar, I request the director go and clean bathrooms, better than doing this type of films , dirty fellow and die all the actors who acted in this movies"}, {"id": 60, "text": "Nice movie and nice concept, good movie enjoyed it well👍🏻👍🏻👍🏻👍🏻"}, {"id": 61, "text": "Anushka's performance was awesome, She did wonderful job and I'm become a fan of hemanth madhukar after watching this film."}, {"id": 62, "text": "Thrilling movie, don't forget guys.......watch this movie each and everyone......."}, {"id": 63, "text": "Good film i liked it But how did the two couples in the beginning died"}, {"id": 64, "text": "Amazing and horror spiky suspense, I love anushka's performance."}, {"id": 65, "text": "Acting of Anushka is marvellous, very cute acting."}, {"id": 66, "text": "Madhavan roll was awesome 💯 hands of 💥💥 good stuff included."}, {"id": 67, "text": "Good suspens , Anushka's new style awesome and direction was good."}, {"id": 68, "text": "Excellent acting by queen Anushka Shetty. Best suspense thriller movie ever."}, {"id": 69, "text": "Really horrible movie. Good set of Actors and director don't know what to do with them. Don't know why in this movie Anushka's charactor is Deaf and dumb. If you have 2hours to waste then watch it."}, {"id": 70, "text": "Excellent acting, all stuff was good and Anushka's performance day by day increased ."}, {"id": 71, "text": "Awesome, Great Acting, Good locations and finally direction was awesome."}, {"id": 72, "text": "It is good and trilling movie. All actors performance was good."}, {"id": 73, "text": "Amazing movie and one of the anuahka's best performance movie."}, {"id": 74, "text": "Nice film and some of the Suspense scenes...excellent"}, {"id": 75, "text": "Movie Is Average Just For Entertaining Nothing Much We Get From The Movie. Cast Is Good And Making Also Good"}, {"id": 76, "text": "Other than Madhavan's character everything was poor. Everything looks / sounds fake in the movie like tiger roaming in Seattle, billionaire Cello player etc. Lmao!"}, {"id": 77, "text": "None can raise finger on Madhavan and Anushka Shetty's acting skills. But the movie does not do justice or unravels their true potential. The trailer made me see the movie so bad, but the storyline is very disappointing. Imagine how much thrill, twist and exciting a story can be when the lead character is deaf and mute, plus the other lead actor dies as soon as the movie starts. Unfortunately, the story becomes confusing, made me raise my eyebrows at every new scene; such as why a Crime Detective would want to discuss the case with the family? And why a Crime Detective will call her husband when following a lead and not someone from the team? And so much others.In short, the story disappoints a lot."}, {"id": 78, "text": "Suspense carried thruout the movie and its not at all boring.. liked the caption love creates lovers and also can create criminals. All actors did decent job."}, {"id": 79, "text": "Simple n decent story but feels let down by the hype and the heavy starcast."}, {"id": 80, "text": "It's a big let down.. Very kiddish story line.. Movie drags.. Gets boring"}, {"id": 81, "text": "Worse movie in the cast's career No ghost first of all They told it's a thriller there is no such type of thriller. It's psych movie afterall. They didn't tell y the Peter and his wife were killed at first scene."}, {"id": 82, "text": "Due to COVID Pandemic, all the theatres were shut down and many big movies were deferred for release. Out of these movies NISHABDHAM has created lot of buzz and increased expectations of the audience mainly because of the cast.But after watching the movie, All the anxiety and the anticipation seemed useless. Good story but BAD narration and Direction. Screenplay is very predictable and acting is without soul. Most of the scenes are artificial which conveys the immaturity of the director. None of the songs fit in the movie. never expected such kind of a movie from actors like Anushka &amp; Madhavan."}, {"id": 83, "text": "Well, The first 5 minutes of the movies will give it away that this movie is an absolute disaster. The extra loud sound, the usual sudden (flash) scare tactics, poor story telling and using the obvious rules in the book for a horror movie - all of them being used in the first 5 minutes of the movie will tell anyone that this is going to be a painful movie to watch.I have avoided this movie after the first 5-10 minutes as I did not want to ruin my Friday night, I quickly switched to The Boys. Avoid an headache and switch to a different show/movie !"}, {"id": 84, "text": "Having Madhavan and Anushka shetty I was in impression that it would be a must watch movie but ohh god really it turns out other way around.Very boring and slow plot, many loop holes and weak acting of foreign stars.Verdict - Avoid Watching"}, {"id": 85, "text": "The story have all the elements for a good and enjoyable suspense thriller. Good plot, Good actors but all of these elements fail to impress because of sloppy screenplay, poor direction and songs on unwanted places. Main question is if that house was haunted, why it did not kill Anushka and Subbaraju. Another issue was dubbing of english actors. Many times the audio is not sync with lips. All actors looked like they are being forced to act.."}, {"id": 86, "text": "Movie is not that much intersting....just one time watchable.....actors did their job well..songs are average..background music was fantastic which adds little bit anxiety..."}, {"id": 87, "text": "Movie is directed very well and there is no boring moment's.. music is average and the acting of all the lead actors were good but felt anjali as cop didn't suit well. Madhavan and Anushka as usual performed par excellence. Movie content had good twist and turns but needed a still solid content to keep audience glued to the movie."}, {"id": 88, "text": "With cast like Madhavan and Anushka, we expect a decent movie but will disappoint almost everyone. Poor screenplay and illogical characters will make us squirm with impatience and feeling sorry for waiting so eagerly."}, {"id": 89, "text": "Below average movie, disappointed😞😞😞😞😞😞😞😞😞😞😞"}, {"id": 90, "text": "The movie casts a high profile high talented actors but all of them are wasted. The plot is almost like old Kamal Hassan starrer Sigappu rojakkal. The screen play and dialogue delivery is very poor. In total it's a waste of time watching it."}, {"id": 91, "text": "2 hours waste of time. Thanks to Corona, it's not released in theatres. Lazy writing. Dumbest story. Worst acting. Low class music. Disastrous direction. Best example of how to not make a good movie and waste money and efforts."}, {"id": 92, "text": "Worthless performance by all lead actors and poor script with predictable events👎🏻👎🏻"}, {"id": 93, "text": "Waste of time watching this movie. All the actors talent has been wasted and the story line had no stand. Anjali acting was unbearable."}, {"id": 94, "text": "This is worst movie I have seen recently in any language. Movie will bore you right from the first scene till the end. Story/Casting/Dialogues/Screenplay/Direction/Music everything played equal part to make your watching experience worse. First of all the story could have been made more interesting by making it locally in any Indian city with native actors. Adding to the worst story the US casting, locations and dubbing make you feel, you are watching a C grade foreign movie dubbed in telugu. I dont know why they dubbed Madhavan's voice with some rubbish dubbing artist. I felt irritated everytime i hear his voice. Anjali who acted as a US police make you laugh everytime when she speaks in English, the accent nowhere matches with US accent. Except Anushka performances of all the actors are at their worst. Clearly Director has idea what how to make a movie. The story nor the story telling will impress you even for a minute in whole movie."}, {"id": 95, "text": "A nice movie to watch on weekend not the best but still you gonna like it, they plot is predictable but still you will get engaged with the acting"}, {"id": 96, "text": "Poor direction. Director, at least get basics correct. Story line, I would say not horrible, but very very poor execution. Scene where Anushka moves from orphanage to museum, she gets into a red cab, the driver seats has head rest , when shot from outside, when it's a closed shot headrest is removed. There are so many such mistakes.No comments on story line, but why does Indian movie, shot in Seattle, with Hollywood actor amongst main cast , with very good Indian actors, should end in such a poor taste ?"}, {"id": 97, "text": "Disappoint This Movie....poor Direction Watch it half Movie You Know the murderer .....Good Story But Nt Making Gd movie ...."}, {"id": 98, "text": "So many flaws in the movie. The direction and acting in our daily tv crime serials are a lot better than this. The lead actors are wasted. There is no silence no horror, no thrill. Just stale bread."}, {"id": 99, "text": "I don't personally look for logic in the movie to an extent and fine as far as the movie serves justice to its own logic. But seriously, the movie just rips you apart and suck your soul into the abyss of boredom. In the end, I was kind of calm, consciously allowing the idiocy to take over me and it did. To be honest I tried my best to enjoy it and really wanted it to be at-least 'fair'. But it was unconvincing, Boring and above all, it makes you wonder about the sense of logic of the people who wrote the script. There is nothing to miss and its a skip if you ask me. I am very disappointed with the explosion of uninspiring dumb movies like this. It not only wastes our time and energy but it also kills mood and make people dumb in the long run.Peace ."}, {"id": 100, "text": "First 30 min really I felt bored Rest was engaging until pre climax From then again routine flash back Cinematographer did good job BGM and music ok Konavenkat and madhavan not expecting this kind of stories from you If these releases in theater definitely flop So better avoid it"}, {"id": 101, "text": "First of all, Thank you Because, It hard to sleep everyday for me, Some of the intrusive thoughts sucks my brain.Thank You so much for making a Comfortable sleep for me.Ok! Good bye"}, {"id": 102, "text": "Many members are spreading mixed reviews, but the movie is good"}, {"id": 103, "text": "Movie is best, nowadays any cant become the best but it is best and V is also good"}, {"id": 104, "text": "What a waste of time. Absolutely poor direction and pathetic acting !!!! Even the Hollywood actor was so amateurish. Worst movie I've ever seen"}, {"id": 105, "text": "I watched this only for Anushka and was very sorry she signed this up.Anjali is atrocious as a cop. Which detective shows up to work in short skirts and high heels? There is DCI who has 2 bottles of whisky on his table in police station! Really which US police station will allow that.All the while you think the photographer is in love with Anushka then suddenly he proposes her friend.What was happening there? And the so-called friend of Anushka was creepy and nothing normal in that relationship. And the main killer kills for the silliest reason - flirtation and I have not even gone to the main story. Anushka still manages to do very well with what she is given but I want to her pick directors who can showcase her better, even her costumes sucked!"}, {"id": 106, "text": "A painful feeling all along. A great cast under used with a half baked script. There is nothing thrilling about this movie or script or performances."}, {"id": 107, "text": "Pathetic Screenplay Poor Editing Anjali as a cop is the ultimate joke Already wasted 2 hrs of my time on watching this movie so dont want to write a long review and waste my time even further."}, {"id": 108, "text": "I mean seriously????? My first question was why on earth was the movie shot in the US???? Cheesy acting and very bad screenplay , direction and unnecessary drama. Don't waste your time by watching it!!!"}, {"id": 109, "text": "Did not expect a movie with Madhavan and Michael Madsen to fall so flat in acting. Poor research too, there was a dude photographing tigers in a jungle in Seattle in the movie 🙄"}, {"id": 110, "text": "Dont think anyone were serious with this film. The actors showed no commitment to their role.The plot was sloppy. The narration was hillarious. BGM had no impact. Some films are really bad but have atleast one saving grace in them. Nishabdam has none of it."}, {"id": 111, "text": "Anushka, Madhavan and Anjali are very good actors. But absolute waste of talents. We should have felt for Sonali instead at the end, felt deeply sorry for Antony.We never connected with the characters at any point. The possessiveness shown by the girl seems wired and pathetic. It should be more realistic which was absolutely missing. She must be killed! LOL!! Kudos to Antony!!!Antony does all kills with a help of police officer by having a CCTV at home. Police officer didn't noticed the Chevrolet Volt parked at the entrance of the Form house when he reached after Antony kills Sonali. Oh come on! Pathetic writing!Production did good job, good casting but all gone for none."}, {"id": 112, "text": "The star cast is wasted..very poor execution.. Unnecessary dialogues referring to caste of Charecters..like Iyer etc.,. Don't waste your time.."}, {"id": 113, "text": "The director and the screen play writer thought the audience will accept any non sense. It is just a punishment during this already pathetic covid-19 situration"}, {"id": 114, "text": "No clue how these wonderful actors came and acted to this weird and meaningless movie I have watched till date .. its neither horror nor thrilling but a flop movie..Humble request to u all ..plss dont watch 😑"}, {"id": 115, "text": "Instead of making a movie they should have made a pod cast. Never taught that Anushka can give such an emotional less boring performance. If you are able to withstand Anjali's action and narration you can survive anything in this world."}, {"id": 116, "text": "This is such a Lame movie. From it's plot to acting and direction, everything feels like a cheap B grade movie with cheap graphics and cheap jump scares. Funniest part is that female cop acting like a cute kid and trying her best to look very hard in front of Michael Madsen. Yes Michael Madesn from all the great Quentin movies. I don't know how they fetched him in this stupid movie. Such a wastage of talent like Michael Madsen."}, {"id": 117, "text": "You can easily ignore the movie.. One of the waste movie I have ever seen. No suspense... No thriller moments... No emotion.... Just 😐"}, {"id": 118, "text": "*Pros * Maddy (1 star only for him)Cons: * Beefed up Anushka * Anjali's pathetic English * All the American junior artists * Kona Venkat's story * Direction * Plot * The team's misjudgement that audience are mindless like them."}, {"id": 119, "text": "I did watched the first half of the movie and then left the movie due to a severe headache The movie is all over a disaster and if there was 0 rating for this movie I would give 0 but the least is 1 My final review is if you want to watch the film pls take zandubalm with you🙏"}, {"id": 120, "text": "Save your self from wasting your time, the movie fails to impress on all fronts, the Star cast of the movie is completely wasted. The mute lead character makes no sense considering the sloppy narration from multiple characters through out the movie. Overall disappointing movie."}, {"id": 121, "text": "I dont give review. But this movie is so bad that i feel like to guve bad rating to it. Worst ever movie i saw. This movie shudnt get 1 star also."}, {"id": 122, "text": "Worst direction ..... Poor story and no conclusion for introduction murder in the film ...finally unexperienced direction .... Big loss to madhavan sir ..."}, {"id": 123, "text": "This movie is so much predictable. And u won't find anything interesting in watching it. Storyline is so messed up that u'll get frustrated and will cancel ur prime membership 😂😂"}, {"id": 124, "text": "I seriously dont understand how these directors think...totally stupid movie with childish plot and hopeless direction....i dont want to use bad words but hope the director will never direct again..."}, {"id": 125, "text": "Terrible Terrible Terrible!! Poor direction, story. Waste of such a gr8 talent (Madhavan). He should opt for better movie choices."}, {"id": 126, "text": "Nishabdham / Silence a pathetic movie. Had lot of expectations. Surprised to see how Actor like Madhavan accepted this crap script! Poor Screenplay, Uninteresting Plot, 3rd Class Editing, Poor BGM Placement, Listless Director. Yawn fest movie throughout, no interesting moments at all. All actors were sleepwalking. BIG AVOID!"}, {"id": 127, "text": "Poor script, weak characters and overall a very boring movie! You can gladly miss this movie and you won't regret!"}, {"id": 128, "text": "As the genre says it's a horror, mystery, thriller yes it's a horror as the Audience will be tortured throughout the 2nd half, yes it's a mystery because we will not know when the movie gets over and how the director convinced actors like Madhavan and Anushka, no it's not a thriller it's the opposite of that. Kudos to the director for wasting my time. Special mention- Huge round of applause to the writer for the awesome screenplay, it's so gripping so that you can watch any youtube videos or ipl matches while the movie is playing, the moment vivek tells the whole story everyone will get goosebumps on knowing that Anjali's investigation has nothing to do with this movie."}, {"id": 129, "text": "Poor direction and screenplay. Im giving one star due to Madhavan and Anushka. Poor acting skills by anjali. Casting is worst. Bakwaas."}, {"id": 130, "text": "Watching this garbage movie with talented stars was more scary than the plot itself. Please telll me who's the idiot that came up with the scene in the woods with lions, bears and tigers?! That makes no sense what so ever. Also the cops , this story takes place in the US, why do they have a British accent ? I'm so glad this movie was not released because I would've asked for a refund."}, {"id": 131, "text": "Positive 1.nice locations 2.keeps the suspense till end 3.no BoringNegative 1.poor investigation logics 2.routine concept 3.no gripping twists"}, {"id": 132, "text": "Good suspense, was an enjoyable watch for OTT content. Anjali acting is monotone. Bad reviews seem to be spam accounts. It doesn't deserve these multiple 1 star ratings."}, {"id": 133, "text": "Ok ok movie, Not boring though. Just an ordinary movie with not much mistery"}, {"id": 134, "text": "A decent crime thriller. Good music, and screenplay. Good performance by Maddy and anushka.. others not so good"}, {"id": 135, "text": "For all those who cherish a breathtaking mystery thriller watch this,but not with great expectation.. 1st half is engaging and fast paced 2nd half is predictable"}, {"id": 136, "text": "A perfect story. Great performance from Madhvan and Anushka. Not sure why so many Negative review but I enjoyed a lot."}, {"id": 137, "text": "The movie was so engaging. But the climax was predictable."}, {"id": 138, "text": "Right from the start. It's a desperation got horror with a side of monster whom you never see. And who has even heard of let alone Indian, but a Telugu detective? Lol. And a telgu victim? Lol. Not to forget all the support cast whose acting is as just terrible. This movie feels like a forced story wich is so terrible you'll hate wanting to watch it."}, {"id": 139, "text": "Routine storyline poor screen play director didn't utilize the cast"}, {"id": 140, "text": "Unnecessary is the word. This movie shouldn't exist. Poor story, poor execution. Do not waste your time, money, patience or even data on this wannabe crime thriller."}, {"id": 141, "text": "The movie is utter flop when you see first 15 min. 3 main reasons. Felt like watching a B grade low budget movie. 1. Madhavan original voice not there. 2. Anjali as cop- worst choice ever in the history of film making. 3. Anushka can't talk."}, {"id": 142, "text": "With a usual plot, bad acting, casting choices and convenient situations this makes an example of a movie that should not be made. Youngsters making short films these days are way better than this movie."}, {"id": 143, "text": "The movie was so subpar in respect to the star cast that even a B Grade Movie would look good. Absolutely dissapointed by the Direction and actually all the department. Only saving grace is Anushka, even Madhavan stooped to a new low with his performance. I am gonna give an earful to the friend who recommended it. Don't waste your time on this pathetic Movie."}, {"id": 144, "text": "Why to make stupid movies like this? By making the movie in Seattle the director might have thought it is Hollywood standard. Bad story telling, worse screenplay, worst acting."}, {"id": 145, "text": "I was tempted to watch this movie looking at the cast.Immediately it was apparent this movie is a joke. I watched it till the end in awe of how someone could have imagined such an immature storyline, made a joke of this mature cast and talented actors like Madhavan and Anushka . There is no mystery in the movie but Big mystery is what convinced them to act in this movie ."}, {"id": 146, "text": "Terrible story line and horrible narration of Anjali which is quite irritating and the sound mixing ... standard of the movie will go up only if Telugu movies try to mix their music and voice recording at some good post production houses. Dubbing are voices are terrible. Horrible"}, {"id": 147, "text": "Not at all interesting, worst casting and silly story .such a waste of time ."}, {"id": 148, "text": "Wtf boring,garbage, movie.. please do not watch the movie"}, {"id": 149, "text": "I've just wasted 3 hours of my life from this sexually frustrated mediocre movie. DONT WATCH AND DO YOURSELF A FAVOR!!"}, {"id": 150, "text": "We eagerly awaited the release of this movie on Amazon Prime as the cast and the storyline seemed really promising. After watching this movie I only want those two hours of my life back and I promise to make better use of it. I mean a 15 year old with a mobile phone can make a better movie using his friends to act and trust me they will do a much better job."}, {"id": 151, "text": "Anushka Shetty was quite great in this one. Michael Madsen and R Madhavan were terribly miscast but still did their best with what they had. Screenplay was illogical, torturous and boring. The music was quite aesthetic, that I must admit. They even made the opening scene chilling, so that nobody would walk away from this mess."}, {"id": 152, "text": "I literally able to watch only 30min and the movie is unbearable. Pathetic direction and screenplay. Even flop movie has some dignity but i dint felt anything with this movie."}, {"id": 153, "text": "Well Madhavan / Anushka need to pick projects with more care. The plot is weak and predictable. What makes a mediocre movie unbearable is ridiculous all around...topped by the acting by Anjali ( Maha) who struggles to even walk like a cop leave alone emote. Close competition in overacting by Shalini ( Sonali) leaves you aghast by the midway. This is a masterclass in bad acting and poor directing. Beat avoided."}, {"id": 154, "text": "Bad screen play and acting. Poor movie. Much hyped, but in the end one of the worst movie made."}, {"id": 155, "text": "It felt more like watching an ugly amalgamation of 3-4 movies, on likes of Manmadhan+Baagimathi+KadaaramKondan. Except Anushka's acting which could be perception due to her dialogue-less characterisation, there was nothing that was convincing enough including Madhavan's acting/characterisation. In the end, it again feels like should stop watching Telugu movies altogether as the majority of them are nothing but craps, especially the ones that come with less masala in it. Nowadays, I'm drawing more towards a 'Don't fall for known faces trap in movies'. It is mainly because of the known/popular faces which we use to decide to watch a movie to start with and mostly end up with watching craps, most of the time, like this one."}, {"id": 156, "text": "I wish this movie was a silent movie because most of the cast just can't act. Absolute garbage of a movie. Save yourselves 2 hours and watch something else instead."}, {"id": 157, "text": "1.english orphanage brought up.since police said she understands telugu only. 2.sonali room searching with a flashlight.ridiculous 3.tiger photography on foot.hilarious 4.the captain had to cross Sakshi car to come to the farm house. 5.antony did not kill all the people in the farm house Hard disk proves what Flawed logic"}, {"id": 158, "text": "Terrible movie. Terrible plot, terrible screenplay and terrible acting Nishabdham is a scream in agony for the unsuspecting audience. The buck should stop at the director Hemanth Madhukar for making such an horrible mess. Though the trailer looked so promising, this is yet another 'penguin'. Amazon Prime needs to get better Indian scripts!Anjali, the main female cop from whose perspective the whole movie has such a wooden face and her voice / dialogue delivery if anything kills the mood and suspense of the movie. Couldn't they have found someone else whose voice is more expressive as the narrator?Anushka looks old and haggard and her hay days as a heroine seem to be over. She looks and acts middle aged and her hair, dress, demeanour looks as if she has just stepped out of Covid-19 quarantine! Though she is a mute orphan raised in Washington, US but somehow she can only speak telegu/tamil/malayalam and needs someone to translate all english dialogues to her (when the cops interrogate her). What's even more bizarre is the American cop translates everything spoken in the regional language back and forth! Her depiction of sign language is so bad that sums the lack of effort portrayed by the actor. Madhavan is a terrible misfit for this movie. A terrible Michael Madsen adds no value to this movie.The plot twist at the climax is so predictable or rather hinted right at the start of the movie it is tiresome to watch how they connect the dots, and they did a very shoddy job of that. Isn't this serial killer topic so overdone? Also, how does one get away after so many murders? Why is there no investigation or evidence when Anushka can simply find stuff with a google search? Do not waste your time watching this extremely boring and predictable movie."}, {"id": 159, "text": "Wasted my time watching this movie. How can Madavan act in this .. unbelievable"}, {"id": 160, "text": "Every actor performed well. Actually it's a thriller but convincing audience like it's a horror is a mistake, killing madhavan is unfair, actually aubbaraju and anushka became criminals by killing madhavan. Lot of scenes are there for keeping suspenseful but those are logic less and no answer for them."}, {"id": 161, "text": "8 reasons for 2/10 1) Amateur director 2) Good caste but worst acting. Especially Anjali, madhavan and Anushka. 3) Anushka can't act like a dumb. 4) Dumbest decision ever which clearly shows Anushka can't act like dumb, Madhavan can't act like a billionaire and Anjali can't act like the best officer. She looks so dumb in her role 5) Weak plot 6) Slow narrative which acts like a slow poison 7) Possessiveness of Arjun Reddy fame actress my god. 8) Bad music"}, {"id": 162, "text": "Watched Telugu version. Poor script, waste of time -- 2+ hours, waste of talent -- Anushka Shetty and Madhavan.Very boring after 20 minutes. Not a good storySince it is Amazon Prime it worked out to almost free else if in talkies it would have been another waste of money.Don't watch it."}, {"id": 163, "text": "Poor direction. Cinematography is good. Loads of mistakes. Save yourself two hours of your precious life."}, {"id": 164, "text": "This movie lacks on so many levels starting from direction, acting, background music, dubbing, camera work and mostly importantly logic."}, {"id": 165, "text": "Totally disappointed. Direction, screenplay, editing and music completely spoiled the movie. Talented big actors like Maddy and sweet are not used properly. Anjali- not at all fitted to the cop character.Ppl who watched Tamil movies like Sigappu Rojakal and manmadhan Can easily find the story plot within 25mins from the film beginning.The only plus is cinematography, he really did his work neatly and makes the film live somewhere."}, {"id": 166, "text": "The performance was too artificial and the film making was too amateurish. Don't understand why Madhavaram even accepted to act in this one.."}, {"id": 167, "text": "Talented actors got wasted in this life less movie script. Anjali is just overacting as a police officer. This movie story is made by mixing every thing like horror, murder mystery suspense and psycho villan story lines in this movie. Which makes the movie look very bad."}, {"id": 168, "text": "I want to give negative points for this movie. Such a wastage of time, money and talent. 😫😫😫"}, {"id": 169, "text": "Story is good - though its a typical revenge masala, the way the plot was written seems good. However the screenplay has several loopholes which makes the movie a not so enjoyable watch. Also, unnecessary profanity - when will people understand that using swear words is not cool even in western countries. For some reason there is a background narration by different characters at different point of the movie, when Anjali is telling the story her voice and the plot doesn't seem to connect much. May be it would have been better to have let just one guy (Vivek) to narrate the entire movie or have it told in Madhavan's voice in a third person narrative. Whatever it is - may be one time watch or some may find it not even worth watching once just because of the loopholes in screenplay."}, {"id": 170, "text": "When I saw the trailer, I had predicted two possible ways the movie could go and I was right about the second way. The trailer did gave away too much. What's good: 1. The performances of Anushka Shetty, R Madhavan and Subbaraju are great. 2. There are few good scenes in the movie that entertain. What's bad: 1. The story is predictable. A lot of situations in the movie are way too convenient. I will use Deadpool's dialogue for the story That's just lazy writing. 2. The director gives way too many hints and that spoils the film. 3. Logic is killed multiple times in the movie. Overall, it will be liked by the fans of Anushka Shetty and R Madhavan."}, {"id": 171, "text": "Seemed interesting in the start but then later on as the story went ahead you will start realising it's not that good, acting is average by all the actors including Madhavan which I didn't expect and to spoil it more the foreigners, very poor story line and a poorly written script making it an overall below average thriller movie. You can skip this movie not worth it."}, {"id": 172, "text": "Looked average movie from the start and went worst at the end. Madhavan one of the finest actors in India ,don't know why he gets such worst role in this movie.Anushka too doesn't do nothing much.Hollywood actor Madsen doesn't even seems to know why he is in film himself?"}, {"id": 173, "text": "Not any special content mixing of both yevaru and forensic movie stories . Routine Pysco Story"}, {"id": 174, "text": "This movie is worst, Bad screenplay and Bad story, too slow, only positive thing is Anushka, But movie is waste, I had an great expectations on it, It doesn't reach expectations, Movie is a huge flop, disappointed"}, {"id": 175, "text": "Movie started with the good expectation but fails the audience to connect with the movie as the movie revolves around the same area through the movie."}, {"id": 176, "text": "Must watch. Such a beautiful film ruined by a Cast such as Anjali. Firstly, she doesn't fit a Westernised role. Right from her appearance until her expressions and language, everything ruins the beauty of a such a classy Truly, I was spellbound by the most classy, and beautiful presence -- Anushka, Madavan! I don't think anybody ever would do justice to such roles. Beautiful and versatile Anushka nailed it again. These two people live the characters. May it be costumes and makeup, an eye for detail, surely they uphold the screenplay with their very presence. Alas, South Indian cinema has created story with nuance, naturalism that sweeps us of the floor.P.S. I am not a showbusiness soul, but as an audience I could say it's the casting that upholds the screenplay on which you people work so hard. Please don't cast actors as Anjali in Westernised roles. On the contrary, she fits traditional, rustic , Tamil roles. Indeed she did justice to roles as 'Angadi Theru' and 'Galagalappu'. De Facto, the beauty of a classy 'Psycho-thriller' as Silence is pulled down by her very presence ."}, {"id": 177, "text": "There is a word, impossible to spell, that describes the alignment of solar bodies like the planets when they all fall into place together. a similar word would describe this film. everything about it is right. all actors be it Anushka or subbaraju down to the lowest atmosphere person, are superb. the editing, the score, the sound, locations, the dialog, all are just about flawless. The photography is superb. the green tinted like film, the gardens and forest roads and Seattle weather are all painted with a faint matrix green, golden color of the film, when showing Buddha temple where subbaraju kneels to pray, when Anushka desperately stops speeding car. the spellbinding way that reveal and utterly layered mysterious story unfolds. I certainly agree. The plot is great, and thoroughly interesting and involving. The pacing, while not fast all the time, is more than acceptable. There are sequences that are really intense and exciting. The acting is great... like I said earlier....keeps our interest through interesting angles and sequences. I liked that there was often something subtle going on in the background, like a parallel storyline running while we're focusing on what's directly in front of us. you slowly notice the subtle and dark side of madhavan's character....this is one of the best films ever made, and it deserves your attention and patience."}, {"id": 178, "text": "Well, honestly tollywood tried something different, director tried to project western kind of screen play and style, but it is unfortunate that our actors or story didn't suit well enough. The characters are not exactly suited for their roles, for example Mrs.Anjali. I am not saying they are not talented but not every one can suit in every role. I watch hollywood movies too, but after watching many of such revenge stories and all, the story is pretty normal and though twists are there, due to the screen play, you won't get excited beacuse it is not a kind of screen play telugu audience used to watch or perhaps indians used to watch. All are terrific and talented actors but there was not much scope for acting. I don't know why but the narration felt lazy for me. If you watch this movie before sleeping, you will definetely go to sleep contradicting to its generes that is mystery, horror, thriller. They have a decent story but trying to mimic western style of narration and screen play kind of made everything not suitable. Honestly, it may be directors opinion to showcase western style but, end of the day, indian people have to decide whether its a good movie or not because its not a hollywood movie. I am a mad fan of Mrs.Anushka Shetty which made me to write this review as I felt bit disappointed. No offense. This is just my opinion."}, {"id": 179, "text": "Nishabdham turns out to be another lacklustre thriller film from Tollywood. The first half of the film starts on a promising note, as it has a haunting villa and mysterious murder. But the terrible writing, dull narration, and the poor direction make it an unimpressive watch.The screenplay is poorly written and the editing is done in an inept way. The makers are failed to deliver the story in an engaging way. The music is just passable, the cinematography is neat and the background score by Girishh Gopalakrishnan is good.The performances by the lead are unsatisfactory. Anushka Shetty gave a mediocre performance and Madhavan manages to do justice to his role. Anjali, Shalini Panday, Subbaraju and Srinivas Avasarala looked unconvincing in their roles. Hollywood actor Michael Madsen looked improbable and he has nothing much to offer.Direction 1.5/5 Acting 2/5 Cinematography 3/5 Story 2/5 Screenplay 1.5/5"}, {"id": 180, "text": "To be honest, I decided to watch this movie just because of Madhavan. But even he couldn't save this disaster of a movie. Anjali is, as they said, top crime detective but is as squeamish as a 11 year old child. Her body language, narration, wardrobe all looked out of place for someone who is a detective. I mean, tight short skirts and heels and blow-dried long hair do not really scream 'hardcore cop'. Also, the detectives in this movie do not believe in wearing gloves while handling evidences at the crime scene. In some scenes, the characters tried to look serious but they had hilarious expressions plastered on their faces. It all looked like a badly directed low grade play. There is sudden and abrupt change in scenes and characters many times which leads to a lot of confusion. I did not understand the point of basing the story out of US when almost everyone is speaking Telugu only. And if the house wasn't haunted, who the hell killed the earlier couple? What happened to them? Where did they go? There was no mention of them after the first scene. The twists are cringeworthy. Overall, I was really disappointed by this badly directed movie with such big names but lousy acting and atrocious dialogue delivery. Please avoid at any cost."}, {"id": 181, "text": "I can't believe that in 2020, there are still people out there who direct movies like this. There are too many issues with this movie. 1. The detective Anjali is supposed to be a top detective but can't stand blood 2. She stores her boss's telephone number as Detective Richard 3. Pretty much everyone is some how from Vishakapatam and everyone knows sign language 4. The detective discusses all the major crime issue with her husband and he actually guides her and he is with her while following up with cases 5. Michael Madsen's acting is terrible 6. In one seen, Anjali fires nearly 20 bullets from her pistol 7. Anushka Shetty googles around and in 5 minutes she is able to connect how many murders are happening. However, the detectives are not able to solve this since last 20 years. 8. Most scenes are in parks, or parking areas, bus stops, etc. 9. if Madhavan and Anushka have signed up for this movie shows that they might have been impacted due to recession with no other movies.I never had IMDB account and I was so frustrated with this movie that I created the account mostly to write this review :-)"}, {"id": 182, "text": "Nishabdham, the name says it all. Keep this movie quiet. Watching it is wasting three things; time, money and data.Madhavan in his role has done what he always does. He is is a class act and he has maintained it.Anushka Shetty as a deaf and mute, no complaints. What more can one do when they have been offered dirt to convert into gold.The story starts with -0 story telling. (Sorry I will not call it narration and demean the word). It is story telling. The moment you see a few scenes in the very beginning you the plot of the story. Where in God's name is the twist or the thrill? Anjali has had her 2 secs of fame in many a thriller plots but a Seattle PD officer is not her forte. She doesn't have it in her to pull off the role of a Dharmapuri PC let alone a lead detective in the US.There is a very important question. Why does every story have to have revenge and anger in them. When you chose to make the story abt a serial killer keep it that way. Then there is the storytelling again. It starts with one person speaking and with no explanation shifts to another. Director sir forgot it is a thriller and started serving everything to on a platinum platter.The worst part of this story is how the director has ised a deaf and mute character. When a character is speaking in sign language why not put a couple of lines down for the audience to read. Imagine this Character 1 - (sign language) Character 2 - are you saying the you will go there and get settled and then take me there? Character 1 - (sign language) Character 2 - are you saying yes? What is this?? If this is the llkind of storyline and direction we get from a director. I have one word for him. SILENCE(NISHABDHAM)OH!!! Sorry honorary mention. Mr.Madsen!!! He didn't want to be a part of this movie or if he did he wanted to do it drunk and out of his mind. He is sleep walking thru the movie and not acting."}], "reviews_amount": 183}