{"name": "On the Rocks", "titleId": "tt09606374", "reviews": [{"id": 0, "text": "I actually made an effort to open the account here to warn others not to waste their time. I really love her Lost in translation and Marrie Antoinette and after the trailer I was expecting something more than this boring and pointless movie. I started browsing the internet 15min into the movie which never happened to me. The story begins quite ok but it goes absolutely nowhere making the whole movie pointless. There are red herrings all over but they all come to nothing. Almost every character is boring. Some shots are nice but that's it. Also upper class setting is kind of annoying. Most of us are living in a different world now and this is even more striking."}, {"id": 1, "text": "When you know how a film is going to end from the beginning, it doesn't make for an exciting journey. Nothing happens in this film. There isn't a plot. It's void of tension and humor. It's got a couple good actors but that's not enough to justify making a film without an arc."}, {"id": 2, "text": "This is exceedingly slow paced without payoff or even engaging me emotionally throughout. Love the actors and actresses. That is it!"}, {"id": 3, "text": "Bill Murray and Rashida Jones work very well together but unfortunately the clichè ending really brought it down for me. There was great potential for a classic Father/Daughter dramedy but I think the studios must have demanded a typical happy ending which ruined the whole film."}, {"id": 4, "text": "I really loved this film. The chemistry of Jones and Murray was a real driving force, and both characters were, to me at least, very well rounded, interesting and funny. I think it was shot beautifully, and all of the short scenes really conveyed the mundanity of her life, and the monotony of adulthood. I loved the semi redemption of Murray's character, with some people unable to forgive his actions, but his relationship with his daughter struggling through. I just found the whole thing very real, and affecting, and overall I loved it."}, {"id": 5, "text": "Previews are better than the movie, with the ending a complete letdown after what seemed like three hours of nothing. Murray's character is cliche. The womanizer who knows everyone, or relative of, thus talking himself through every situation, makes the movie lack any sense urgency or conflict. The only conflict is whether Wayans is cheating or not. In the end, there's zero fallout from a wasted agenda. Unless you love these actors when they're not funny, skip it. Wayans, Jones, Murray and Coppola are so much better than this money grab."}, {"id": 6, "text": "A pointless bore fest, Bill Murray adds some sparkle and humour, Jones gives a solid performance but, it's dull dull dull, and utterly pointless. What a waste of 96 minutes."}, {"id": 7, "text": "Sofia Coppola teams up with Bill Murray for the first time since their 2003 masterpiece. The film has him leading his daughter around NYC on a mission to catch her husband having an affair. It all feels very slight -- like a caper comedy about rich people problems. Murray's charisma carries the bulk of the running time, and there are some good scenes. However, it lacks any and all profundity... settling for mild chuckles and forgoing the sting in the tail that the film so desperately needed."}, {"id": 8, "text": "Ninety or so minutes of shallow, unrealistic dialogue between a retired, rich, philanderer and his pathetic house mom/struggling writer daughter. Trust me, save your money, take a nap instead."}, {"id": 9, "text": "The film reminded me of some 60's remake, with all the patriarchal clichés of the era: a bored/tired/unwanted wealthy housewife lamenting with her even wealthier (adulterer) father over fancy cocktails if the husband cheats on her or not. At least they had a nice screen chemistry and share couple of nice moments together.Sadly I can't say the same about the couple. Their conversations are dull and superficially written, I am wondering why they got together the first place. But the cheesy and utterly moralistic ending saved the day (irony) and we learned that women can still be comforted with pricy jewelry.I'm asking the creators: is this very schematic marriage approach set in the circles of the untouchable High Society really relevant in 2020? With everything going on?"}, {"id": 10, "text": "The most captivating moment of this movie was the preview. I really wanted to like it."}, {"id": 11, "text": "Pointless film, absolutely unwatchable. No story. Just waiting for something to happen."}, {"id": 12, "text": "Why make a movie if you have nothing to add or to say really? An artist needs to have urgency for a story to be told, if not greed ensues. It's making a film for the sake of making a film, and Sophia has the power to do so and so she does. Doing it because she can. There is way too much output from those that already have a huge voice. I say stop shouting your voidness unto the world! No matter how much you colour it with expensive cast and locations..It still is empty."}, {"id": 13, "text": "This movie seems likes its been made 1,000 times before. Nothing new really. Technically, I was very surprised at the constant sound issues. There are more than a few times when dialogue was added to a scene and it is obvious to the audience. Quite surprising from a well respected director. One thing that got tired quickly was the stereotypical notion that men cheat. Every 5 minutes, we are reminded that men cheat. They have no choice. This is a lie that keeps being told over and over. Today one is not supposed to stereotype any group, but apparently it is still ok to stereotype men. The truth is that just as many married women cheat as much as men, if not more, and studies reflect this. Ironically, this movie makes such an effort to be politically correct, but decides its perfectly ok to have the most ugly and baseless stereotype around apply to men."}, {"id": 14, "text": "I REALLY don't understand the good reviews. My wife and I both agree this was basically a wasted 1.5 hrs out of our lives. We were looking for a comedy and it was only able to provide a few short chuckles. Perhaps the worst comedy we've seen in years!Spoiler Alert: The drama part of the movie also sucked, it leads you to believe the husband is cheating on his wife, and then you find out he isn't, but they never explained why on one night that started all her doubts he went from seemingly wanting to make passionate love with her to suddenly losing interest in her at all. At a minimum, at the end, when she was becoming convinced he had not cheated, SHE SHOULD HAVE ASKED WHAT HAPPENED THAT NIGHT! I still want to know the answer and feel the movie did NOT realize a good conclusion that was convincing as to why he acted that way on that night. I'm still left with the unfulfilled feeling that maybe he was cheating and got away with it because he just happened to come home early from one business trip!Also, the drama wasn't very good at the drama part, the interactions with the kids were Boring, and Bill Murray cracked a few laughs at his sexist stupidity and moronic comments about how all men are hardwired to cheat, but it was a talking role, he never had to actually act and or change his facial expressions!"}, {"id": 15, "text": "Bill Murray was cute, endearing. Rashida Jones is so blah. She legit had one emotion that carried through the whole thing it was uncomfortable and agitating to watch her just be. Yuck. I would hate for others to waste a night on this pointless movie.I have never written a review for any movie before and loved Rashida as Ann Perkins but this was so bad and boring."}, {"id": 16, "text": "What a disappointment. Bill Murry is interesting to watch but his character never really takes hold. Rashida Jones has about two facial expressions throughout. Marlon Wayans and Jenny Slate's talents are wasted in this script. I'm mat at myself for watching it all the way through, expecting it to get better!"}, {"id": 17, "text": "Bill Couldn't save this one. Slow, boring, Predictable. It reminded me of a fourth season episode of a bad sitcom."}, {"id": 18, "text": "No arc, no chemistry, no story, blank dialogues. Unbeliavebl borring."}, {"id": 19, "text": "Possibly the worst movie in living memory , nothing happens, the acting is non existent and looks like it was shot on an iPhone, don't waste your time !"}, {"id": 20, "text": "Still yawning. Lost in translation brilliance is still shining over this"}, {"id": 21, "text": "I came with high expectations based on a movie review I heard on the radio. I was duped! A boring movie from beginning to end. I gave it the benefit of the doubt, hoping it would improve after 10 minutes, how wrong was I. Never was a big fan of Murray and he didn't endear me any further. I think I may have laughed twice with some effort, but when you have an audience of only 15 (COVID) and there was not a single burst of laughter throughout the movie, it really sums it up. Give it a miss people, it was bad."}, {"id": 22, "text": "She does the no script, go be funny thing poorly again. She'll get another Razzy and another Oscar because ugh. An old man has a group of crazy daughters, hilarity doesn't ensue."}, {"id": 23, "text": "It was like going on a trip with no destination. Felt like it was a waste of talent :( had the pace of watching paint dry maybe that was the goal. Watched it till the end to see it wrap up.... I will never get that time back"}, {"id": 24, "text": "Agonizingly boring story about a young upscale wife who suspects her husband is cheating. Encouraged by her wacko Dad, played by Bill Murray she tries to catch her husband in flagrante delicto on a business trip to Mexico.i'M GLAD I DOWNLOADED THIS FILM. It insulted my intelligence with its tedious dialogue, cookie-cutter trendy rich people situations and product placements. I deleted it off my computer once I finished watching it."}, {"id": 25, "text": "Dreadful film. Don't waste your time on it. Father persuades daughter her husband is cheating on her. He isn't . End of."}, {"id": 26, "text": "To have a great photo on a great location doesn't make a great movie, story and storytelling it's an 80% of a movie and this one lacks of it at all. I even find insulting try to repeat the lost in translation formula. Save your time, skip this terrible movie!"}, {"id": 27, "text": "This movie kept going on and on and on....you kept waiting for something to happen....but nothing did....after it was over, my wife and I both said what was the point of the movie....much to do about nothing"}, {"id": 28, "text": "A complete waste of time. Flat story, flat characters. I kept waiting for something to happen but it never did."}, {"id": 29, "text": "This is just fun. Don't expect any deep multi-layered story. It's just fun. I smiled from beginning to end. There's an old-hollywood love letter to NY vibe which is great. I'm done rambling on. Just watch it if you wanna have a good time."}, {"id": 30, "text": "If you've navigated the jagged coastline, the habits, the repetition, the banality of a relationship losing its limerence, the chances are you wont have had a Bill Murray character to amplify your concerns when your partner becomes distracted. Here he becomes a canvass to paint upon, facilitating a stylus to sketch familiar territories and outlines encountered by many a maturing relationship, albeit with a significant bias founded in his own infidelity. Beautifully performed and full of wit, the dialogue between Laura and her father is a delight to be savoured."}, {"id": 31, "text": "Sweet characters, but a pretty flat movie overall. Also, if you're thinking they're comedians, there was no comedy."}, {"id": 32, "text": "I was interested in watching with the cast selected for this movie. 22 minutes in and I was nearly asleep. Everything about this movie seems out of touch and unrealistic. This embarrassment should have never been thought of in the first place, let alone brought to film."}, {"id": 33, "text": "Poor Americans still struggling with the complex of women and black men trying to emancipate from white males. Just get over it and start making real scenarios again !"}, {"id": 34, "text": "Trite cliche dialogue. Can't even call what Bill did acting. It is just an old rerun of his usual. Not charming.. Not engaging. Not entertaining. Not insightful. Not worth the time!"}, {"id": 35, "text": "I love quiet, drama-free films that are more a reflection of a relationship than necessarily a start to finish story but this was boring, boring, boring. But my biggest issue with it was the acting felt forced and there was zero chemistry between husband and wife. Zero.I was so looking forward to it."}, {"id": 36, "text": "Bill's opus. These days, this kind of movie is not produced. Unfortunately. This movie - like a sip of good wine. After 20 years from now, no one will remember the Marvel actors. But everyone will remember Bill Murray. Thank you very much to the whole group for the pleasure."}, {"id": 37, "text": "This movie was awful. Didn't find any comedy in it. That storyline? How can you even call this a story? So not creative. There's usually a bit, which saves the movie, but this..I can't even describe it really. I watched it because of the okayish reviews and of course Bill Murray, but not even him could save it.. What happened in 2020 with movies? So sad"}, {"id": 38, "text": "This looks more like a suspense movie. Please, don't waste your time. Nothing happens"}, {"id": 39, "text": "No chemistry between Wayans and Jones, very dissapointing movie, i had great expectation....what a shame, worst movie of Sofia Coppola😫"}, {"id": 40, "text": "Half the movie gone: nothing happening. Two thirds of the movie: nothing happening. Oh, wait, we learn that Bill Murray can't sing; surprise? Almost the end: nothing happening. The end: nothing happened. It's like being at a boring dinner party with only people you don't know, and they're all talking to each other about people they have in common. Smile, yawn, be polite. There's just no there, there."}, {"id": 41, "text": "As a fan of the duo of Bill Murray and Sofia Coppola and sad alternative soundtracks, I was severely disappointed by this movie. I find that unlike most family drama's I've seen, this films characters aren't unique enough so the writing is witty but not super interesting. Also the story is usually very slow and a lot of the time it doesn't have much of a purpose.The film also doesn't really have much of genre in a bad way, I can't tell if its a rom-com, a comedy or a drama.I dunno, I can't find myself rewatching this.But if your excited for this, watch it."}, {"id": 42, "text": "Once upon a time there was a little girl with a famous dad who made a decent film with very big movie stars that name droppers and sycophants praised to the heavens. Daddy after all was being ballyhooed for the overlong and execrable GF 3 so why not the kid? Did the US finally have its answer for Leni Riefenstahl? Nope. Seventeen years later the well budgeted banal filmography says otherwise as she returns to the crutch (Bill Murray) that started the rumor around her talent. It's a sorry full circle with Murray continuing the career deadpan unabated and Rashida Jones ably subbing for Scarlett in auteur Coppola's ongoing investigation into the older male, younger female dynamic. Murray does his aging best to keep things buoyant but as in previous works (Somewhere being the best example) Sofia's tedious buzz killer deadpan ambience brings on the disinterest in no time and the girl that would be Leni is once again minor Nora Ephron without the funny bone."}, {"id": 43, "text": "No chemistry between the actors. Seems like they are trying to play stereotyped characters; old rich playboy, writer bogged down by home chores etc. You can recognize the scenes from other movies.Doesn't feel real, and didn't address the real issues of why the husband didn't helped out more at home, the father didn't regret the wrong he did, she blamed her father for her own suspicion and insecurity and didn't sort out what needs to change in her marriage.Overall it feels pretentious..."}, {"id": 44, "text": "The movie is so slow paced. All the scares witty jokes and funny moments have already been in the trailer. What a waste of time. +1 star in respect to Bill Murray"}, {"id": 45, "text": "It's not Noah Baumbach but it has a similar tone and very unique ring to story and this is the most Sofia Coppola get to recreating that lost in translation vibe. When character starts enjoying their little tour it gets exciting to see father daughter bonding like any other movie. But Bill Murray tops it all, you can only watch this movie for his performance as always effortless and the most enjoyable in every decade of his performance. But watch it when it feels right not for the sake of just watching, Indie drama only works that way otherwise you'll ruin it."}, {"id": 46, "text": "While there are some interesting dynamics between Felix and Laura, the only comedy is the nonstop gag about Felix as womanizer and the babbling woman at daycare.Perhaps they lie about the genre to get us to watch it, but I was extremely disappointed and will likely cancel Apple+ if this is the kind of content they create."}, {"id": 47, "text": "I understand that Hollywood wants to be politically correct, but sometimes it's just too much. Especially when it ruins the plot because you know from the beginning how the movie is going to end. The only thing that saved this movie from a one star rating was Bill Murray, but even he couldn't rescue a terrible script."}, {"id": 48, "text": "Seems like Sofia Coppola was told to tell her story from the point of view of a contemporary woman her own age (unlike her previous women) and do it with non-whites (ditto), since she's gotten flack for both. No problem - except that she's need a solid storyline and strong script, which this isn't. I was cringing most of the time, even during the Bill Murray scenes which are more or less the only not so bad ones. But mostly, everyone except the kids comes off awful here, as if they can barely act, and without any chemistry between them - in fact, I never for one minute believed Rashida Jones' marriage to Dean or her relationship to Dad Murray. And since I've seen all these actors in other things and know for a fact how good they can be elsewhere, I can only conclude that the problem is Sofia Coppola herself. Really sad because I loved her first 3 movies and thought she's a true descendant of her own brilliant father. Now, my feeling is that all these film critics are throwing accolades her way simply because she is Coppola's daughter."}, {"id": 49, "text": "Bill Murray is the ONLY it doesn't get a one... Rest of the cast is good but NOT worth it. Anyone giving over a 5 rating is nuts!"}, {"id": 50, "text": "Huh? What did I miss? How does this film just end like that? Is there a part 2? I was kind of interested and hanging in there even though it is mind-numbingly slow Bill Murray's acting holds it all together.It's kind of a nothing story though. Lead female character wondering if hubby is cheating...hmmm ok...The movie strolls along in her crusade to prove yes or no is he or isn't he, she gets an answer and bang up roll the credits??I have debates with fellow movie fans over films like this. Lost In Translation was a similar pace, style but soooo much better!The debate is whether films need a defined conclusion or a beginning middle and end OR some will debate are movies like this just an exploration into life and sneak peak into someone's private struggle??"}, {"id": 51, "text": "Loved Lost in translation. I watched 15 minutes of this and I almost fell asleep."}, {"id": 52, "text": "I thoroughly enjoyed this movie! I don't think the reviews describing it as slow and boring are fair. It isn't an action adventure film. It was perfectly paced and extremely well written and acted. Both the acting and dialogue were very natural and not contrived. I never felt like they were reading a script, it felt more like how real people would respond given their situations. Bill Murray's character was quirky and loveable. Rashida Jones's was grumpy and frumpy which made perfect sense for a busy working mother who thinks her marriage is in jeopardy. It was different, creative, and thoroughly entertaining."}, {"id": 53, "text": "Lost In Translation and On the Rocks are two forays into middle aged first world self indulgence and over inflated self importance.It's as if art, martinis and Bill Murray will provide enough to hold an audience and whilst Bill Murray is, the rest won't.Whilst on the subject special mention goes to Rashida Jones - who does a good Scarlet Johansson in this latest installment of Sophia's modern Gatsby.Except it's not Gatsby it's hollow, boring and dull. It looks like everyone had a great time except the audience."}, {"id": 54, "text": "But there are some really amazing scenes in this movie. More than worth the wait. Both leads are great."}, {"id": 55, "text": "It's smart, funny, well acted, quirky and real ...... ignore the bad reviews make your own mind up"}, {"id": 56, "text": "Loved seeing Bill Murray Great father and daughter relationship story."}, {"id": 57, "text": "Slow. Pretty dull. Just blah tbh. This is definitely the most boring A24 film I've seen."}, {"id": 58, "text": "Female victim, white male bad, black male good. The end."}, {"id": 59, "text": "I can't express how disappointed I am by this very trivial story! The end is as predictable as a 3. class Hollywood movie."}, {"id": 60, "text": "Made for tv cheese fest! Avoid and save yourself 90mins of your life! The ending made me want to rip my own plums off!!"}, {"id": 61, "text": "Very few laughs, a seemingly pointless journey, and misused atmospheric lighting :-(. Waste of good talent."}, {"id": 62, "text": "First world problems: Having everything and being bored to death. Poor story, poor characters, nothing interesting."}, {"id": 63, "text": "Charming movie for the first hour or so. Good acting from Rashida Jones. Character created by Bill Murray is memorable (funny and despicable at the same time).Downward spiral close to the end. Improbable scenes and dialogues, and at least one key event is not properly explained (plot hole). Completely messed up movie with otherwise good potential."}, {"id": 64, "text": "It's a film about a father wanting to reconnect with his daughter, but the whole movie has this fake mask pulled over it which is only revealed at the end... it's honestly not a fun movie to watch and it has ZERO comedy as well. I honestly can't recommend that anyone watch this, unless Bill Murray, Rashida Jones or Marlon Wayans are like your FAVORITE actors... it's just not good and I honestly would have preferred to spend my time watching this movie just doing literally anything else."}, {"id": 65, "text": "Nothing. Soooo slow. Lazy, predictable story. No connection with any of the characters, who were mostly unlikeable and self absorbed elites, complete with Bernie endorsement. No laughs or emotion for the audience. Outdated stereotypes (but whyyyy can't men just be faithful).Just bad. Don't waste your time."}, {"id": 66, "text": "Do not waste your time watching this. Very slow, no storyline, average acting and bland ending."}, {"id": 67, "text": "There's nothing comedic about this dull meander through an excuse for a plot. Bill Murray is fabulous as always and is the only reason we made it to the end. Nothing happens. There's no emotional investment in this couple and...it's just plain boring. Don't waste your time watching it"}, {"id": 68, "text": "Billed as a comedy but where are the laughs, this film is so slow and boring and after about 30 minutes you could predict the ending, give it a miss and use the 90 minutes to do something worth while, Bill Murray is so better than this. If Apple think offerings like this are going to keep people subscribing they are mistaken, also why do directors keep filming so much of their films and shows in near darkness, when they're outside it's night time with very little lighting and when inside I think they either forget to turn on the lights or use 10 watt bulbs to save power, this makes some scenes very difficult to see what is going on."}, {"id": 69, "text": "There are so many problems with this film, but I want to point out one big flaw which is Rashida Jones's character. So two-dimensional, she has everything yet she is unfullfiled. BANAL! Whole movie she gets gifts and presents, one after another, after another ... but what she gives? Nothing! That is a message nowdays, only recieve - nothing to give! And the moment when she confronts her father was so stupid I couldn't believe they played it like that. On top of that, they made her appearance deliberatetly hillbillishly plainly unattractive! WHY? Rashida Jones is a beautiful woman with a character and to make her look like this! For what? Argh... Even Bill Murray can't save this pic."}, {"id": 70, "text": "Its always fun the see Bill Murray, but heis not enough to save this movie.. Acting is great, but movie is without any highlights"}, {"id": 71, "text": "Great cast and potential, but overall it was an unenjoyable movie. It was hardly a comedy, even though it was painted as a bittersweet one.It was just a letdown when it could've been great. Not worth watching."}, {"id": 72, "text": "MURRAY SHOULD BE BANNED FROM MOVIES IN FUTURE. HE IS A NO TALENT GERIATRIC HAS BEEN . CAN'T SING, CANT ACT AND HAS A DUCKS BUT FOR A WHISTLE. AN OVERBEARING BORE."}, {"id": 73, "text": "A story of a family in which dad's always out working successful and mum takes care of the kids and is an average writer. She is also ok with the fact that husband regularly has late night drinks with a female colleague. Very much masculine and cliche!"}, {"id": 74, "text": "Without Murray this just be an ordinary average rom-com with some social engineering throw in. Murray makes the film . Murray is truly a unique comedian and actor."}, {"id": 75, "text": "It's sadly obvious from the get go that the husband is innocent of cheating as they have cast a black guy - the woke would cry out in dismay thinking it would be stereotyping if they would actually treat a black person as a human being, and not a saint devoid of flaws and personal prejudices, like the rest of the races are treated. The problem with this is it becomes predictable, and sometimes you cannot talk about the human issues that humans made stories for, truth delivered with surprise to have impact, because ideology gets in the way. All this work of reversing gender and race stereotypes has instead brought in new formulaic stereotypes that is just as truthless as they were before. Stories are about human truth, not ideology. Apart from that the film is plain boring."}, {"id": 76, "text": "Was totally disappointed with this movie. I had high hopes as it was on the Apple plus network. I hope they didn't pay too much for it."}, {"id": 77, "text": "Ninety minutes of my life that I'm never getting back.Slow and underwhelming with the moral of the story being 'don't jump to conclusions'. Are our entertainment expectations really so low these days that this is what passes for worthy of investment?"}, {"id": 78, "text": "You can tell he want's to be anywhere but on that set."}, {"id": 79, "text": "Well meaning comedy drama, but not a great deal of comedy, but to be honest, it's quite slow and boring. Is he or isn't it is the question, with Bill Murray leading his daughter through a series of plodding scenarios. It's acted well enough, and well made, but it didn't do it for me. Not really enough of a story to keep me that interested."}, {"id": 80, "text": "Uninteresting journey to an uninteresting end. Not well thought through not interesting characters and very slow. The lack of plot and any substance makes the watch dull and would be unwatchable a second time"}, {"id": 81, "text": "I'd like to preface my review by saying that Lost In Translation is one of my all time favourite movies. That said, On The Rocks is beyond bland. Acting, directing, cinematography, production values are all very very credible. The script however is anything BUT credible.I won't suggest not watching this but I will suggest that you might keep staring at your watch."}, {"id": 82, "text": "Depth-wise, not even comparable to Lost In Translation. Nice father - daughter relationship study though thanks to the marvelous Bill Murray. Total lack of chemistry between Rashida Jones and... what's his name? Let me see... Marlon Wayans. Who the heck is he? A football player? Not an actor, at any rate. Totally miscast. Oh, maybe it's the quota thing (you know what I mean). Sofia, I used to love your filmmaking. Get your act together, please."}, {"id": 83, "text": "Bill Murray was perfect as the flawed but nurturing father. He clearly loved his daughter and wanted to do everything within his power to help her. However, he had also clearly let her and her mother down earlier in their lives. The scene in Mexico where the daughter asked him why was one of the best in the film.Because this movie was a new release from Sofa Coppola and Bill Murray, I compared it to Lost in Translation which was a much better film. Lost in Translation was deeper and more honest about loneliness and life in its many phases.On the Rocks was filmed beautifully, New York looked great and some of the conversations between Bill Murray and Rashida Jones were quite funny and true to live. However, I'd give this film a 2 and would have rated Lost in Translation an 8.The character Rashida Jones played was unsympathetic. It was hard to really care what happened to her. She was cruel to her dad on a number of occasions. When she visited her mother, grandmother and sister, their behavior didn't justify her frustration at having to deal with them. She was a self absorbed character who whined and bitched through most of the film. I couldn't bring myself to feel as sorry for her as I normally would for the victim of a cheating husband. Bill Murray's character had more charm and more honesty about his own failings in life to balance out his womanizing ways while Rashida's character behaved more like an adolescent. She was a good mother, so perhaps the idea was that her growth was limited in certain ways by her father issues specifically and uncertainty about the nature of men generally.I was glad in the end to find out her husband hadn't cheated on her and that they stayed together, but I think my frustrations had to with feeling like I kept waiting for the film to begin, that it was quite shallow and that the plot twists were forced. It is hard to put my finger on exactly why I was so disappointed in this film. Perhaps it was in part that it seemed like a marginal extended film trailer compared to the masterpiece of honesty and emotion that Lost in Translation was."}, {"id": 84, "text": "This is not comedy. Is it left wing narrative. Always I waited for a plot twist but nothing happens. If you look with a left wing perspective you gonna love it"}, {"id": 85, "text": "Can't give you a summary because I fell asleep about 20 minutes in. Imagine an empty room that smells like an oriental carpet. That's what this movie is."}, {"id": 86, "text": "Anyone who couldn't appreciate the nuances and themes in this movie is a complete philistine. I don't need sex and explosions to be titillated and intrigued by a movie unlike some reviewers. This script was entertaining and the story was unique and fun to watch unravel. Rashida Jones is a fabulous actress and watching her is always a pleasure. I especially loved Jenny Slate's character - very comical! Coppola was able to make Bill Murray shine in this film in a way I haven't seen for a while."}, {"id": 87, "text": "Sophia Coppola directed what for years was my favorite film, Lost In Translation. I knew from the pathetically horrible title, On the Rocks would probably not be good but I'm 57 minutes into it, was about to shut it off and finally saw the first decent scene. Since this is my first movie (not a film) I'm watching on Apple+ TV I'm trying to watch the whole thing but it's like staring at the Bernie Sanders 2016 sticker on the door which they subject us to. Nauseating, I didn't know she was a Commie. Okay, thank G@D it's an hour forty, it just seems like a four hour movie. What a shock, Bill Murray sings, badly, many times. Why make this? There are no redeeming aspects to this UNWATCHABLE thing."}, {"id": 88, "text": "Well shot and competently acted but let down by a very weak and uninspiring storyline / plot. The film looks beautiful but everything else about it is dull. If you want something on in the background whilst you finally reply to those irritating work emails, this is perfect. You won't miss a thing."}, {"id": 89, "text": "'On The Rocks' is a romantic comedy-drama movie to watch!I absolutely love the performances of Bill Murray and Rashida Jones; the casting is very talented; the story is great; the cinematography is great; and Sofia Coppola's direction is wonderful.'On The Rocks' will make you laugh and have your hearts melted for a mixture of romance and comedy!"}, {"id": 90, "text": "Maybe I had too high expectations. I am pretty disappointed, especially the ending is extremely lame."}, {"id": 91, "text": "This is Woody Allen-isk type film that sure to put you to sleep. Bill Murray (Felix) plays a obnoxious rich father trolling his daughter's insecurities by insisting her hubby (Marlon Wayans) is cheating, with his work assistant. Instead of keeping his suspicions to himself until he finds concrete evidence on his own, He takes his daughter, Jessica Henwick (Fiona), on a stalking adventure snooping on her husband's business dinners and trips in the hopes to catch the hubby red handed and uncovering the truth. Meanwhile rich daddy flaunts his wealth and connections throughout the story.I usually like Bill Murray films, but this film is contemptible."}, {"id": 92, "text": "The characters, the dialogs, the plot, everything felt off, forced, and unnatural, the Father-Daughter dynamic is ok but not great.This is clearly not a Lost In Translation level movie, I was bored for the most part of the movie and some dialogs were just pointless or even annoying.Sofia Coppola can do better !"}, {"id": 93, "text": "It has been 17 years since Sofia wrote and directed Lost in Translation which also starred Bill but that film is far superior to this film. The Bill character in this film, Felix, greatly benefits from Bill's talents. In fact if anyone else had portrayed the role I would have likely given this film 5 stars versus 7. That being said even Bill's charm cannot save a weak scrip with every other character in the film being poorly developed. Additionally it is hard to like Felix when he presents a concept that all men are or want to be non-monogamous. This is potentially true for some men and women but not all. I think Bill is a talented actor and in fact I watched this film specifically because he was in it. I respect his body of work and typically like even his most quirky performances but again the above basic premise makes it hard to like Felix despite Bill's talent."}, {"id": 94, "text": "On the Rocks was a solid attempt on to make a cool father daughter storyline to which many people can relate to ,and in some ways Sofia was able to do that and give us one watchable film that can teach us some valauble lessons about life and relationships and how we cant take them for granted cause they can be broken at first sign of trouble.Bill Murray and Rashida Jones were good together as father and daughter and they good solid chemistry between them,but Marlon Wayans was unfortunetly the weakest part ,he didnt had any sign of chemistry with his love interest and end of film was little to on the nose with a happy ending,On the Rocks was a solid story"}, {"id": 95, "text": "On the Rocks doesn't have a lot of teeth. I love Bill Murray in most of his work but this felt more like him showcasing some bits. From his first scene I felt like he was rehashing his old lounge singer character from SNL and his smarminess from those days made an appearance as well. We don't get to see a lot of depth from him which is a shame because some of his recent work has shown he has the acting chops to show us multi dimensional characters. In fact this movie didn't flesh out the characters at all. I like Rashida Jones enough but she seemed as if she was here just to be an audience for Bill while he hammed it up. I wouldn't call this a bittersweet comedy because it was far too predictable to elicit such feelings. It was flat and underwhelming in my opinion. If you are looking for a good Bill Murray movie that shows off his talent I would just rewatch St. Vincent."}, {"id": 96, "text": "So many crabby reviewers for this great opportunity to bask in Bill Murray's brilliance. He is on fire with wit and charm and he's singing like he's got nothin left to prove. Love him!"}, {"id": 97, "text": "The actors struggle to show acting...very slow paced with no great story..the movie just struggles"}, {"id": 98, "text": "I put 5 because it looks good and there are some good scenes and acting at times. It feels like a late woody Allen movie at times. The husband character is weak though and that breaks it for me. Neither the expected outcome nor the other other characters' reactions are that plausible. Lacks the depth I was hoping/expecting."}, {"id": 99, "text": "A sad, uninteresting film with a dull plot and horrible representation of relationships."}, {"id": 100, "text": "Absolutely a waste of 90 minutes, characters are a yawn, the plot is slow to develop and is very predictable... waste of a good cast"}, {"id": 101, "text": "If this is the garbage they are going to produce... There share price is going to plummet... Bill Murray couldn't save this"}, {"id": 102, "text": "I thought when I was looking for a new comedy movie and seen bill Murray I would be pleased. Turned it off 15 min in."}, {"id": 103, "text": "Put every Bill Murray film role into a Bill Murray Film Festival and even the worst insomniacs would be cured. The totally boring blank-faced actor has a great ability to mumble his lines in a coma-inducing monotone. Just looking at him induces boredom. This is the perfect Bill Murray movie. Nothing happens. It is just like sitting at a bar with Bill Murray."}, {"id": 104, "text": "I liked it. It was a pleasant 100 minutes. A movie is watchable if it has Bill Murray in it and if he's in good form. Rashida Jones also gave a very good performance. Watching this made me remind of Cappola's Lost in Translation many times. Eventhough this is nowhere near it, it's good."}, {"id": 105, "text": "I don't get why some people like Sofia Coppola's work. Everything she has done has been boring AF. And this is by far the most boring of all. Zzzzzz"}, {"id": 106, "text": "While I Loved the chemistry between the 3 lead characters felt like it was Rushed to the Editing Room to soon. The ending came abruptly ? Plus you had both Kelly Lynch and Barbara Bain in Cast and they had one line each ? Also i am sure they got professional whistlers in Hollywood but none of them can whistle with me. Sorry Sofia i am writing at The Crown &amp; Anchor in Monterey and they carry your Sparkling Wine 😊"}, {"id": 107, "text": "Really enjoyed this movie, ignore the negative reviews. In my opinion because it says a comedy and Bill Murray is in it, it attracted people expecting to see old SNL style movie, that's why they were Disappointed. This is a quality movie beautifully directed and acted."}, {"id": 108, "text": "Yes, this movie was a cliché, you know. Wife thinks husbands cheating turns out he's not, she has daddy issues near the end of the story, her dad wasn't the best husband as a kid that whole spiel. Looking past that, we have a pretty good movie. I really was interested in this movie when I saw Bill Murray starring in it and Sophia Coppola Was directing it. and They did another movie together called Lost in Translation which I absolutely love. Even though the film is a cliché, I feel like we don't get a ton of movies like this anymore. Rashida Jones was good, Bill Murray is always shining. I love the chemistry between these two. Almost as if they were actually father and daughter. the lighting in this film was probably my favorite. something about the color yellow in film always makes me sad or anxious. overall this movie was very good, I feel like this may have sparked a new joy for Rashida Jones, I sure hope so, she showed true potential. definitely watch this movie if you are able to."}, {"id": 109, "text": "I guess Sofia Coppola thinks lighting can strike twice.Well, it didn't. Lost in Translation 2 it isn't. This movie is a disaster from beginning to end. The plot, whatever little there is, is brought to a still-life birth and we're half way into the movie before anything actually happens. I am thinking Get on with the story already!. But there is no story. We already know the ending and don't care one bit about any of the characters. There is no story arc.The Bill Murray character is a lot like an educated Trump. Knows everybody, is liked because of his money, and yet has no real friends, except maybe his driver.I really don't need to see how the rich can beat a reckless driving citation because the cops treat the Murray character so tenderly. C 'mon. Cops aren't that nice, even to other cops. No cop is going to help push start your car. Murray is so rich, he can call a tow truck. After 4 years of Trump, I have had enough of wealthy characters getting away with all sorts of bad behavior and avoiding responsibility.Murray is rich and buys art, but he was also a cop? No explanation.Not one single actual laugh is this snooze-fest. No even a chuckle. I really don't care how the wealthy live in New York, even if they have an inter-racial marriage. It feels like the male lead was just cast as a token black, as there is nothing of black life and black culture in the film. All the other black characters are servers in restaurants.How the heck did this couple ever meet? No explanation.What is the purpose of the character at the school running a boring stream of consciousness monologue about her privileged life that even bores the lead character?I don't think I have ever given a movie 1 star out of ten that was produced by a major studio and written and directed by someone who should know better.Do not waste 94 minutes out of your life watching this drivel. Probably the worst movie I have ever seen. It is so bad, the studio should recall it as spoiled goods and just pretend it never existed.Sofia Coppola probably had a single film remaining on her contract and called this one in from the beach. Coppola was so lazy, she didn't even bother to research if the QE II was still in service. A 5 minutes Google search that Coppola couldn't be bothered to perform.If Coppola got paid for this bomb, the investors deserve a refund.A BOMB."}, {"id": 110, "text": "When I opened my Apple Tv app and saw a movie with Bill Murray and Rashida Jones I thought: what could go wrong?...well...Sofia Coppola and her pretentious filmmaking that's what! The movie is about the relationship of Laura (Rashida Jones) a 30 something old woman, married with two girls, that all of the sudden finds herself lonely because her husband Dean (a wasted Marlon Wayans) travels a lot for work. One night, after arriving from one of his trips, Dean kisses Laura then suddenly stops and go to sleep, prompting the suspicious of his bored and insecure wife that he is cheating on her. After inquiring a little, she decides to take advice from her dad (the always amazing Bill Murray) who says that her husband is obviously cheating and all Laura has to do is caught him on action. Contrary to all common sense, Laura decides to believe her father and becomes more and more suspicious of Dean. Of course, after a series of cheap tricks, the audience is lead to believe that maybe Dean is actually cheating. If you are experienced in this kind of movie, the ending is pretty obvious and the real deal here is the fragile self-estime of a woman who's father cheated on her mother - deep down she believes that sooner or later her husband will cheat on her. She is insecure because she finds herself boring, she is experiencing a writer's block and can progress with her work while her husband's career is blooming. Against all odds she keeps a close and beautiful relationship with his father, close enough to say that they are actually friends.The chemistry between Rashida and Bill as daughter and father is rather believable since it's the only solid relationship in the movie (actually it is the only one that it's truly explored). I couldn't understand the angst of Laura regarding Dean's cheating because we are not showed anything about their relationship: he works a lot, she takes care of the kids and tries to write and that's it. Their interaction is rather dull, they lacked chemistry, to me it was unbelievable that they were husband and wife. Very good looking couple, but it was missing an important piece... Bill Murray played his usual self, were he blabs dialogues and he is funny without even trying. We can see he spill words full of misogyny, hit on women younger than his daughter, patronise his son-in-law and police officers but hey, it's Bill Murray so he gets a free pass on being an awful human being - he actually says to his granddaughters that they should wear their hair long and pretty because men liked. The movie was supposed to be a comedy with hints of reality but fails to it because in my opinion, Sofia Coppola tried to posh it up a simple story and sucked all the fun. The rhythm was very slow, the action sold at the trailer (father and daughter acting as detectives) it's only 1% of the movie. I believe the real point of this story was to show how a betrayal of a parent can damage a kid's future relationship. One amazing scene, to me, and very well acted by both leads was when they were in Mexico and Laura inquires her father if it was worth-it for him to leave her mother and cause all of that pain to be with a woman that he never ended up with. Bill Murray answers it was heartbreaking and says no more, he only stares at Rashida who slowly understands what he meant. The movie had potential to be a great drama or a great comedy, but I think Sofia couldn't carry both genres and got lost translating the emotions into the screen and to the audience."}, {"id": 111, "text": "I couldn't disagree more with the bad reviews.This is a quiet film about a woman losing herself in her various roles as mother, wife, daughter, writer. It is also about communication (much like Lost in translation) and misunderstanding, about growing up and finding the confidence to define oneself as a woman apart from your father's shadow. In the end it is about love and relationships (also New York looks great). This is not a shallow film as some would have it, it is just not pretentious or full of pseudo-intellectual dialogue like most Baumbach or Ethan Hawke films. It's light -weight, real, tender and feminine and we need more of these. You can always rely on Bill Murray's charisma but Rashida Jones' sensitive performance is still the focus here."}, {"id": 112, "text": "The guy who has spent fifty years reading his lines in a monotone, and adding nothing but his smirk to any scene, lingers on in this movie. Pock-marked dead-pan face staring blankly straight ahead, Bill Murray delivers boring like nobody else can do."}, {"id": 113, "text": "This movie is a slow burn but it is a character story. Its about their lives and interactions. It's possible that the story only relates to some people. If you have a family and know the day to day grind, there is some real amusing reflections in this movie; and it's all really accurate.The actors were all great together. Murray does steal the show, but isn't that why he was hired. He is great with Jones and I was fully entertained by their pairing.Sometimes you have to sit into a movie and enjoy the pacing and try to understand what the characters are feeling or growing through. This movie did this in a smart and funny way. The exchange of watches scene at the end said a lot without much dialogue, but is a statement that rounds out the story. Good film, not great, but not as bad as the negative reviews."}, {"id": 114, "text": "I like all of Sophia's movies but this one was a puzzler.The way the movie was going and how it ended I really thought it was supposed to be a show series.It like almost like this movie was created when Sophia was really bored one day and had absolutely nothing to do.All the actors in this movie were fine and I had no issues, but the story? Not sure there was one there at all."}, {"id": 115, "text": "Always a joy to watch Bill Murray play Bill Murray. But switch Tokyo for New York and Scarlett Johansson for Rashida Jones, and you've essentially got On the Rocks. New York City and Jones' opulent (but not too extra) SoHo apartment are the stars, and the plot was so cliched you could see the punchlines coming 20 minutes from the start. Still, lovely to see people walking around Manhattan without masks; hope we can get back there again soon."}, {"id": 116, "text": "She makes pretty, bordering on twee, visuals and that is the full extent of her range. She completely lacks any Directing capabilities. No matter what film of hers you watch - it's the same old schtick, so if you've seen one of her films, you really have seen them all. No substance to her films at all. Maybe she might make a better Cinematographer or a Fashion Photographer, as she certainly has a great eye but not a Writer or Director. I had hoped that with time, On The Rocks would show us a Director who has evolved, grown, matured. Alas not, no plot, no character development, no arc. Bill Murray is the only decent thing about this film - so he gets the 1 star I'm giving this film."}, {"id": 117, "text": "Ok, the movie is not a hit but I love the easiness of the movie. It's clear and it's deliberately going nowhere. That's the power. It's an easy story which everyone can relate. Bill Murray as always is incredible. Also I absolutely love the portrait of NYC. Of course is not on the same level of Lost in Transaltion but still a very decent movie"}, {"id": 118, "text": "Honestly, I did. It is just one of those movies with no real script and big names that drew the money to make it. Plus, throw in a bernie 2016 sticker and a pic of BHO and we're all caught up on our virtue signaling. Honestly, if this is the best Hollywood has, what's the point anymore?"}, {"id": 119, "text": "Expected a lot more from this director, not so much from Murray as I think he is past his best. Won't get the 70 odd mins back when I turned it off. Avoid and find something else"}, {"id": 120, "text": "How could Metacritic give this a 73! Totally misleading."}, {"id": 121, "text": "If you scan the reviews the consensus seems to be this is no Lost in Translation, and that pretty much says it all. You want to give everyone benefit of the doubt here, but slow &amp; boring is still slow &amp; boring, regardless of the effort. Maybe it's as simple as not relating to the characters - Ms Jones is great, but comes off as a whiney #firstworldproblem victim, and everything that made Bill Murray great with Scarlett Johansson in Lost was more or less duplicated here, but in a tired &amp; phoned-in way. I dunno.I did wonder if seeing this in a real theater would have made a difference, hard to tell. It just plodded on so much it felt like a film school thesis on How to make a Woody Allen film. Some good moments in New York, but without the charm or wit. Aye."}, {"id": 122, "text": "The script makes no sense. The background music is annoying. Even Bill Murray cant charm his way out of this one!"}, {"id": 123, "text": "I gave 2 stars because of Bill Murray. The movie itself was a real go nowhere movie. Maybe my hopes were high because of Lost In Translation. From start to finish it just went nowhere. I felt like I ate a bowl of whipped cream."}, {"id": 124, "text": "TL:DR: Don't waste your time. It's 99 or so minutes you Keith have spent watching something good and well made. Big disappointment with the script, editing and Apple.Movie is slow to start and worse yet, after the climatic conflict things rapidly change. It seems like too much of the movie was left on the cutting room floor."}, {"id": 125, "text": "What an amazing cast, but an absolutely terrible movie! I had such high hopes for this movie, but now I'm here an hour and a half later feeling like my time was stolen from me. This really should have been on Netflix, it's that bad."}, {"id": 126, "text": "It's such a delight to watch a film shot on 35mm. The 4K intermediate also makes sense to keep the dynamic colour range and the properties of the film intact. The shots driving in the red car have natural motion blur. The film has that natural processed film look that is wonderful. Watching it took me back to Tokyo with Murray. The film doesn't quite hit the high notes of Lost in Translation but it's still definitely worth a watch"}, {"id": 127, "text": "I love Bill Murray &amp; Rashida Jones were perfect as the father and daughter duo. Jenny slate is a funny supporting actor &amp; marlon Williams is good too. I really liked it"}, {"id": 128, "text": "Really good cast, but a dreadful film that's wastes Mr Bill Murray's skills. It's like a poor attempt to make another lost in translation by Coppola. 3 stars for the cast but it would have been a 1 without Murray."}, {"id": 129, "text": "Snooze fest! Couldn't get through it. The beginning is so slow, but I wasted my time watching half before I gave up. I expected so much more from Bill Murray."}, {"id": 130, "text": "It's a typical Sophia Coppola Film in that the finished story is gentle and sedate (a pace &amp; tone very similar to Lost in Translation) but that's it. That's all you get. The story is not really one worth telling &amp; therefore not worth watching. (In my opinion only, of course). The only saving grace is Bill Murray. He delivers standard comedy 'Bill' and so without him this film really deflates to a well made waste of time I'm sorry to say."}, {"id": 131, "text": "This was a great feel good film ! A different kind of romantic comedy and Bill Murray was terrific as the dad with all the answers and party man. I feel this is one of Bill Murray's best film and I see Oscar noms in the future for him with this."}, {"id": 132, "text": "Whilst I did enjoy this film for the most part, I feel like it didn't quite have the substance to hold the weight of a 90 minute movie. It would have made for a great short. All in all it was a nice watch, but not something that will stay with me past the rolling credits. Rashida Jones is flawless as usual, so raw, real and she always has a way of breaking straight into you. I will always be here for anything she's in.Oh and Jenny Slate adds such value with her few scenes alone."}, {"id": 133, "text": "The color correction is horrible. I checked on both my tv and phone to make sure it wasn't my settings. They completely ruined the brilliant colors of Kodak film. How do you do that?Although I adore Bill Murray and Rashida Jones, this film was very slow and boring with a few funny moments.Maybe if the film wasn't so desaturated it would feel more alive?"}, {"id": 134, "text": "Murray is great in this film, as he always is in every film he is in, but the movie felt unfinished to me. There were a lot of tired cliches in the film, which I didn't like. I guess jewelry and some reassuring words was all it took to convince Laura her husband wasn't cheating on her. I would have liked the ending to be less of a happy ending and more of a realistic ending. For example, after Dean tells Laura that nothing is going on, I would have liked to see Laura catch her husband doing another thing that makes her think he's cheating. Then, Felix, her father, convinces Laura to continue to follow Dean around with him, where they go on more crazy adventures to do so, until the catch Laura's husband smooching another woman. Laura then eventually confronts Dean, and the couple decides to separate and eventually divorce. While following Dean around, Laura meets a man, who she befriends, who helps them follow Dead. This man befriends Laura and eventually becomes her husband. The man is a son of her father's friend, who they run into. The movie ends with the marriage between the Rashida and the new man. However, behind the scenes, Felix suspects this new man is cheating on her and is having him followed. The movie ends with that cliff hanger, and the sequel will follow from there. Although, I'm not the writer or director of this film and unfortunately, the studio maybe decided how the movie would end, which made the film feel unfinished and made the movie seem like something we've seen a million times before. Why is Laura so quick to believe there's nothing going on with her husband and another woman? Why does Laura and Dean have to be such boring characters in the movie? They aren't interesting at all. Rashida and Marlon don't have a lot of chemistry and I wish Rashida was put with an actor she had more chemistry with. I wish there was a lot more drama and excitement in this film. I live Sofia's films and I love Bill Murray in anything, so of course I had to watch this film, but this film just wasn't very good. I have seen worse, though. I did enjoyed the music used in this film at least."}, {"id": 135, "text": "Pretty much no plot. No twist. Nothing to engage, and no surprises. There's a couple of funny parts, but ultimately a slow-paced film with little redeem it.The idea that somehow there is something in plot of woman thinks her husband is unfaithful but actually he really is just at work is ludicrous.A great cast and fantastic director are wasted in this snooze-fest."}, {"id": 136, "text": "Will someone tell the father that he needs to apologise to his son--in-law for nearly wrecking his maritial life?No big deal was made over race in 'On The Rocks', which seemed realistic within the context of the film.Curiously, the interactions between father-in-law and son-in-law are minimal. (I think they only had one short scene together.)With a daughter in mixed-race marriage, you'd think the father would have gone out of his way to not step on toes or do anything that might be construed as racial stereotyping. Once the ridiculous tempest-in-a-teacup that forms the basis of the film had blown itself out, apologies were in order to all parties. But, given what the film tells us about the father, it wasn't surprisiing that expressing regret was beyond him."}, {"id": 137, "text": "Another pointless movie from Sophia Coppola..Do yourself a favor and skip this movie. You won't miss anything."}, {"id": 138, "text": "On the Rocks is a comedy-drama film of Sofia Coppola, the film was made in her style, when I started watching this film I did not pay attention to the name of the director, but after watching, I immediately realized that this was her film. The film is rather boring and protracted, there are a couple of funny moments, but they pass quickly and you again get bored, besides, the film is full of unnecessary and empty dialogues, for example, a woman who always talked abot her life with Laura at school, why the film needs her? is not clear, is it funny? maybe a little, but not more... I was pleased with the good acting of Bill Murray and Rashida Jones, the two of them look very good on the screen and their characters have not bad chemistry. Marlon Wayans is pretty good too, but I didn't care about his character. A film about a banal topic of relationships between different generations and about misunderstandings between husband and wife. We have already seen enough films on this topic, and besides, the film does not bring anything new."}, {"id": 139, "text": "Murray and Jones are brilliant. This is a slow player and sides a cynic against someone who is hopeful. A bit like Emily in Paris this is an uplifting piece with no nasty twists or surprises. Life CAN turn out ok even if we think the worst is going to happen- I think we really need this message these days. I think those who dislike this really are so hardened and lifeless they may actually be beyond hope and have no escape from their  I hate everything and everying sucks ways. I pity you."}, {"id": 140, "text": "More conventional and modest than Sofia Coppola's other films, but 'On the Rocks' is no less entertaining or profound. It is light-hearted and sweet, capturing an energetic relationship between a daughter and her father thanks to the fantastic on-screen chemistry between Bill Murray and Rashida Jones."}, {"id": 141, "text": "This movie is only worth it for Bill Murray. He is the only one with charm and charisma. All the other actors are utterly forgettable.Lost in Translation reimagining failed because New York not even slightly has the vibe of Tokyo and the movie is filled with unnecessary / forced drama that just irritates.Something tells me that Apple demanded some forced political messages because there were more than a few."}, {"id": 142, "text": "This is a nice little film that more than likely caps a trilogy of collaboration between Coppola and Murray. The characters are far more relatable in this Coppola film despite their elite New York status. This film is about family and connection and communication. It's also a live letter to NYC in the same vein as Woody Allen in the 70s. This film requires a thoughtful viewer who can appreciate that real life drama may not always contain explosions and gameshow hosts. While In the Rocks is by no means perfect, the characters reveal imperfections on every level and so I can't expect the impossible from the art which contains these ideas."}, {"id": 143, "text": "The relationship between Jones &amp; Murray is perfect. They are very believable as a functioning dysfunctional father-daughter. There are so many great one liners and as always Bill Murray delivers 'Bill Murray'. The plot is fine and believable however, the execution of the ending lacked and let down the overall movie. Should you watch this? If you like Bill, then absolutely and who doesn't like Bill?"}, {"id": 144, "text": "This movie reflects the Identification with her father, not of her own and her identity. Hiding behind of her fathers fame or using a talented band for film songs is definitely not a creating mind or soul. It is not real and this reflects the movie indeed. For me. Please try to find yourself Sofia and make a movie that awakens the souls. This is very poor and the only attraction for me was to hear the extended version of Phoenix's Identical song. Best, soulmate Mars, Ayça"}, {"id": 145, "text": "While this movie is not Lost In Translation, it finds similar moments and magic. Part of that is Coppola's patient willingness to find laughter without forcing things. Part of that is Murray's chemistry with his co-star (he and Rashida Jones really feel like family here). This story started a bit slowly and tried a bit hard at times, but there were still so many great scenes along the way. So it may not have been an instant classic, but there were more peaks than valleys nonetheless."}, {"id": 146, "text": "I thought this was a little predictable yet was still a good watch. Murray showing his class"}, {"id": 147, "text": "I love it. Smart, witty, funny, great casting, great acting, perfect story arc. It's great to see normal people put in wierd situations and just stand back and watch from a safe distance without judgement. I really like the relationship between the father and the daughter the stuff that's not stated. I wasn't expecting much when I saw it on Apple+ plus but Ive come back to bits of it several times now. Okay its not as good as Lost in translation but its still really nice to watch. Recommended."}, {"id": 148, "text": "On the Rocks is one film that just stays simple as it's a tale of dad and daughter and their relationship. Laura(Rashida Jones) is a successful married lady with kids living in New York city as she tries to write out her next best selling book. Only she starts to have insecure thoughts thinking that her working and often traveling husband has a wondering eye. Now enter her grown and sharp dressed playboy like dad Felix(the wonderful and super good Bill Murray) who visits and starts to play dad in charge and be like a P.I. and do his own work for Lauren. And Felix is witty and smart as he has a movie quoting mouth and knows his stuff plus he provides plenty of laughs and daddy like comfort. And all live happily ever after that pretty much sums up the film nothing great just a comfort feel dad and daughter break like comedy."}, {"id": 149, "text": "Movie with excellent performers and wonderful direction and photography. Beautiful story and ending. Well done Apple TV +"}, {"id": 150, "text": "Essentially this is just an outing for Bill Murray (Felix) who decides to help his daughter Laura (Rashida Jones) when she begins to think that husband Dean (Marlon Wayans) is up to no good on his frequent business trips with a work colleague. Murray is on top form as the debonaire, flashy, man-about-town who has all sorts of cunning wheezes to get to the bottom of the mystery (assuming, that is, that there actually is one) and his performance lights up this otherwise rather humdrum tale of martial wobbles. Jones has her moments, too, though mainly her role is to provide an effective foil for her on-screen Dad, and together they create quite an enjoyable series of escapades that passes for an enjoyable 95 minutes."}, {"id": 151, "text": "Acting and storyline is great. Unpredictable outcome."}, {"id": 152, "text": "NOT a great movie, I like Bill Murray and he does provide some amusement, but the best part of the movie is the little girls, they are sooooo cute!!!!! lol, I knew he wasn't cheating, so stupid."}, {"id": 153, "text": "I can't say much without giving anything away! It has a lot of twist and turns. It looks at different relationships from different perspectives. There are some really fun parts and some really serious parts. It is a movie about love with very talented actors who don't give anything away. I was glad I got to watch it on tv so I could rewind parts. I think it is best to remember that everyone is doing the best that they can, even if they don't realize it themselves."}, {"id": 154, "text": "Quirky and old-fashioned; On The Rocks offers signature Sofia Coppola trademarks and one of Bill Murray's most charming performances.In this comedy-drama, a father and daughter team up to tail the young lady's husband, whom she thinks is having an affair.Bill Murray and Rashida Jones are a fine and elegant pairing, but Murray's charms steals the whole show. Filled with clever dialogue and some laugh out loud moments, On The Rocks is a fitting addition to Coppola's filmography. An easy-going and all around entertaining dramedy that you're bound to enjoy.Follow @snobmedia for more reviews!"}, {"id": 155, "text": "Having seen THE VIRGIN SUICIDES for the first time lately, I was naturally looking forward to Sofia Coppola's new A24-produced film, starring good old Bill Murray.Overall, ON THE ROCKS is an enjoyable experience with some charming New York-based scenes and a tight runtime. Unfortunately, that's already everything there is to say about it, since Coppola's newest basically turns out to be a witty, yet unremarkable rom-com: not bad by any means, but definitely too easy to forget given the talent involved. The acting here is surprisingly mediocre, especially since it cannot benefit from the dialogue, which feels stiff and non-dynamic in too many scenes.ON THE ROCKS is a charming little film, but ultimately unremarkable when compared to Coppola's previous work. It's not my least favourite film of hers, but definitely the least exciting thing she has done so far."}, {"id": 156, "text": "This isn't something new you haven't seen before but there are some good scenes and jokes in the film which makes it worthwhile. Sofia went back to her Lost In Translation roots after her last outing The Beguiled, a psychological drama. The movie is quite dull until Bill Murray enters which is 18 minutes after the opening credits. The writing is too simplistic most of the times and only 3 actors have some scope to perform, we totally miss things from Dean's (Marlon Wayans) perspective which made the ending way too predictable."}, {"id": 157, "text": "There were some very bad reviews for this movie latest from Sofia Coppola and then there were some very good reviews for this movie latest from Sofia Coppola ....I am completely with the later ones.... i.e. the good reviews.Just go with the good reviews and forget about the bad reviews.That above, is all I can say in most plain, simple, English."}, {"id": 158, "text": "I've seen a lot of users take issue with some factors which simply aren't true, for example the characters being apparently wealthy does not mean they have no valid point of view, and Comedic actors in a drama does not equal failed comedy...With that said...There is very little to this movie. Bill Murray is quite good as one would expect, but other than that there is nothing impressive (Nothing terrible either) from the acting. The plot is fine, but the execution leaves some to be desired, and the movie would have strongly benefitted from a better ending wherein a lesson is learned from the events of the story.If you are a Bill Murray fan, particularly his dramatic performances, then you will enjoy this to some extent. Otherwise it is not going to be a memorable film, but perhaps not a waste of time."}, {"id": 159, "text": "Frankly I really really enjoyed this very simple and beautifully directed film.Shot totally in Manhattan,great dialogue and father/daughter relationship.Reminded me of the Woody Allen masterpieces...Simple and very watchable"}, {"id": 160, "text": "This film was about what I expected, but I was going for more. Rashida and Bill were on point with the script they were given. Jenny Slate delivered comic relief.The script was flat. I hoped for more but, but enjoyed the film non-the-less."}, {"id": 161, "text": "Sofia Coppola did something magical with Virgin Suicides and Lost in Translation.This film, however, is dull and conventional. There's Bill Murray playing a rich, perfect version of himself that everyone likes. He has a few fun scenes, but that's it. The story has nothing new to say and doesn't even have the wide-eyed magical glow of Lost in Translation to say it with.On the Rocks is not a bad film. It's just very average, about marriage problems, so it gets an average score, and I guarantee you'll forget most everything about it soon after you watch it."}, {"id": 162, "text": "I may be biased, but... Bill Murray is like wine, getting better and better with age... Combine this and the incredibly-clicking collaboration with Sofia Coppola, and you get an effortless display of excellent acting, subtle cinematography and sound, with great blending from the rest of the cast (Rashida Jones &amp; co), and thus, another great movie-telling."}, {"id": 163, "text": "It's not a romance. It's about a woman separating from her once charismatic boundary-crossing urbanely needy father, who still has charm and tricks in him. It's not a comedy. You can't build the first 30 minutes out of making the main character more and more worried, with zero laughs, and then try to counterweight the balance back into comedic. No way. But Murray's entry into the film did make it feel more pleasant. Has R. Jones done any comedy? It was a relief when she revealed how much hurt she had, all caused by father and she let him have it. I'm giving at 6/10 because I met my now-wife at random while living in Manhattan, and I love seeing the various parts of town. (in Australia now.)"}, {"id": 164, "text": "It's a portray of when you have a rich daddy and help you to solve your problems but indeed a mess at the end. Enjoy watching all the stars who I love. Story is different from many marriage topic ones."}, {"id": 165, "text": "Bill Murray is charming and New York is beautiful but overall this could be Sophia Coppola's take on a Seinfeld episode."}, {"id": 166, "text": "Hmmmm.... I am sceptical about the gender politics of this movie. I understand that it revolves around a fin de siécle around certain masculinities, while showing showing a female protagonist caught in dilemma. I was really bothered and slightly offended by the female character played by Jenny Slate. What was that all about? I was more bothered by the protagonist's reaction to her, or maybe by the depiction of a single mother as a self-absorbed chatterbox whom the character disregards every single time, whilst on the cusp of finding herself in the same exaact situation. Maybe this is a new york stereotype I am unaware of, but it made me cringe."}, {"id": 167, "text": "Big fan of Bill Murray and loved lost in translation, was holding out some hope this could be as good. I really enjoyed the storyline,and the father daughter relationship was fine,but it missed the mark along the way, there were some good laughs to be had and didn't find it as bad as some of the reviews on here! As in any film make up your own mind ."}, {"id": 168, "text": "Very very little depth. An extremely miniscule amount of depth given to the characters. I did love how father and daughter tried (in their own ways) to reconcile their relationship with each another, and in general I love Rashida in most things. But this film was largely forgettable."}, {"id": 169, "text": "Great cast. Boring movie. There was not much humor or anything else interesting in this movie"}, {"id": 170, "text": "At first watch, I didn't think much of this movie and I could see why people are turned off about it, but the more I thought about it, the more it started to grow on me. I watched it a second time.I think the main theme of this film is mending your relationships and connections. We so often get lost within ourselves that we forget the people most important to us, including ourselves, and are unable to see clearly. You lose trust with yourself and others, which Laura struggles with throughout. And shrugs it off too often.Bill Murray adds a lot of life in this film. His role could be looked at as overzealous, but he is a man that deals with a horde amount of painful nostalgia, mostly because of women. And the parallels with him and what is thought of with Dean is no surprise why he wants to pull this incognito mission with his daughter. He is also brilliant as always.I thought the movie was slow, of course. But atmospheric might be a better word, especially in those outdoor scenes in New York. I viewed the movie the same way I viewed Lost in Translation, and after it made the viewing more enjoyable.Monogamy is often brought up. Sometimes forced, but it does play off well and makes you think by the end of the film. Whether people want to be playboys or settled in, the point is to keep things fun, keep things fresh. Don't be boring.8/10."}, {"id": 171, "text": "I don't know how, but the movie maker succeeded to create a very engaging story. I guess it's through the art of dialogue mixed with superb characterization and utmost setting management. Or maybe i can so relate to the main character, i cried at the almost-end part of it."}, {"id": 172, "text": "Ho-hum ending to a movie that had my mind spinning trying to guess the ending. There were many clues left that went nowhere. Like the husband wanting to say more about the real birthday gift interrupted by her dad. Then there was the odd behavior by the office girls when meeting the wife. One of the girls even wore a tiny heart necklace which matched the heart covered bathroom bag the wife found in her husband's suitcase. Finally the unexplained taxi ride with his partner as described in the Goofs. So many possible endings in my mind only to get the most likely boring ending expected."}, {"id": 173, "text": "~A bit of a spoiler Alert~So yes... it gave me a scare at the beginning... Was this going to make me cry? Was this another story of a man with unfaithful ways? At the middle of the movie, when she was with her dad in that hilarious beautiful car with the noisy end... I had to laugh anyway.... and laugh... and laugh... A laugh that I truly needed. One of those right in your belly laughs and every time you think of the hilarity of it all... you laugh again... Even though the scene is done. I've had that belly laugh before. A laugh only a daughter can know. It was then that I realized what the movie was all about.You will too!Enjoy!"}, {"id": 174, "text": "Well, I was expecting to see a Sofia Coppola movie, but I ended up watching a Nora Ephron movie. Not a bad movie, we spend 90 pleasant minutes, but it's a bit like finding ourselves in a good steak house when we had planned a fine gourmet restaurant. A film that does not go beyond what it offers: an hour and a half of relaxation then oblivion. In the end, it's still better than nothing, and probably the intention was not higher."}, {"id": 175, "text": "If you are expecting any action or high octane drama this movie is not for you. The tone and pace is laid back throughout. It's a movie to calmly watch and then absorb its understated emotional impact. The story is pedestrian but it is brought to life by Rashida Jones and especially Bill Murray. He is the star and this film would fail without him. The plot is almost irrelevant. The idea is to engage your feelings through observing a couple of interesting characters. Sofia Coppola's direction is solid and the film looks great. I cared about the people in this movie and enjoyed the ride. Enough said."}, {"id": 176, "text": "Laura never stands a chance to better herself as an independent individual, in the end, she is just passed from one man to another, with the symbolic watch switch, that message doesn't quite swim with our current tide of woman-empowerment. Sofia, being a female and a member of the Coppola Dynasty, has been wearing a Teflon armor for too long, and the father issue she tries to come to terms with is more personal and regressive than we can give its credits for. Since many other budding women directors are finally thick on the ground, perhaps it is high time that we look elsewhere for the next auteur-to-be from the distaff side.read my full review on my blog: cinema omnivore, thanks"}, {"id": 177, "text": "I didnt love movie, and here is why. The story is leading you one way, and then last second they are like sorry not so much w/o developing that storyline at all. It's not believeable. Bill Murray always great and Rashida I love, but the story is weak."}, {"id": 178, "text": "The trailer makes this look like it is going to be some fun, whimsical movie centered around Bill Murray's character and Rashida Jones character going around NYC trying to catch her husband in the act of cheating on herIn reality, that part of the movie last about 10mins and goes absolutely nowhere !The rest of the movie has a few laughs from Bill Murray, but that's itThe plot, if you can call it that, leads up to a got cha moment and then falls completely FLAT on its face, and then the movie just endsHonestly, Coppola has gone so down hill from her beginnings with Virgin Suicides, Lost in Translation &amp; Marie AntoinetteWhen her and spike jones were together, she was brilliant, because he was helping her with everything; screenwriting, Premise, soundtrackEver since she left him for the singer in Phoenix, all she does is make boring movies that have no real substance or actual character and then adds phoenix's music somewhere in the movie, which is so cliche &amp; kitchyJust sad because she had so much potential, given the family she comes from and all the connections she has because of itI do not recommend this movie at all."}, {"id": 179, "text": "From all low reviews, none of them mentioned the fact that Apple produced this movie, which I think is pretty essential for the poor quality it has resulted in. Why would a large electronics company be the blame? Exactly. Because they have more to lose than to gain. In my opinion, this causes a narrow-minded, unrealistic portrayel that comes nowhere near real-world drama that they try to convey. There is no risk, no edge, no emotional message. If there are any messages, they smell pretentious and out of date. For some reason they like to think they created some legitimate cause for spreading cliches about pretty much any topic they choose and reformatting them using their own narrow-minded, conservative style they would use for an Apple ad. Multi-racial relationship without any real difficulties or emotional depth, new york coffee cups and big appartments, creating start-ups, writing books and raising children (or rather have baby sitters), all pretty much stress free. Where is that crucial moment that shows that they actually care for people and have looked into the ways people behave and interact with one another in the real world. A world that is dominated by much larger and more important things than silly relational misunderstandings with happy endings? One might wonder: why would you put that much thought in just another romantic comedy (if you can call it that)? Well, it's because it's movies like these that send out the wrong morals and values in a way that simply does not comply with today's expectations and ideals. It does the complete opposite of what feel-good movies should deliver in times like these. Apple has delivered a movie that is just as plain and dull as their products: lifeless, unempathic and simply oversimplified in order to please the esthetic part, which is not as important as the soul..."}, {"id": 180, "text": "Bill Murray is astonishing. Not just in On the Rocks, but generally in life. Some actors - Johnny Depp, Mark Rylance, Gary Oldman, for instance - disappear completely into their characters so it takes a while to see who they are. Whereas with others - Bill Nighy, Tom Cruise, John Wayne, for instance - it's Oh, there's the famous actor xxxx in a new movie. If we were grading on a scale, Bill Murray would be at the far right of the latter category. In every movie, he IS Bill Murray! In Ghostbusters he was the dry, laconic, wisecracking ghost hunter. In Groundhog Day he was the dry, laconic, wisecracking weatherman. In The Monuments Men he was the dry, laconic, wisecracking art historian. (In the Zombieland movies, he excelled himself by playing the dry, laconic, wisecracking Bill Murray!)For many actors, that would be a problem. But Bill Murray gets away with it, because - - he's Bill freakin' Murray!! And being him is so awesome that however many times you've seen the character, you always want more.Here's a case in point. In On the Rocks, a chaffeured car with tinted windows rolls up. You brace yourself as the window winds slowly down. And there he is... the star. This happens quite a way into Sofia Coppola's new film. First up, we get a leisurely, but intelligent, set-up to the plot. The Parks and Recreation actress, Rashida Jones, plays Laura; a successful writer (currently with writer's block) married to successful businessman Dean (Marlon Wayans). The couple seem to have it all: high income; large New York apartment; two lovely young children. But Dean is always away, travelling on business - and always with his attractive co-worker with the legs Fiona (Jessica Henwick). Is Dean scratching the seven-year itch?Laura's rich, art-dealing father Felix (Bill Murray) arrives, and won't take no for an answer in sniffing out the truth.Love, love, love this movie! The pacing, the humour, the witty dialogue (it's Sofia Coppola's script) and - above all - Murray's triumphant performance all fire this well and truly into my Top 10 for the year.Bill Murray's acting is astounding... is there an actor who spends more time in his deep in thought mode, with eyeballs looking at the ceiling? You could quite well believe that none of it is scripted, and he's pausing in deep thought because he really is trying to compose the next best line! A scene where, through appropriate name-dropping, he charms his way out of a traffic infringement with two New York cops is utterly absorbing.Behind every embarrassing father is a grown-up daughter rolling her eyes. (I should know!) And Rashida Jones is perfect in the role. I'm not familiar with Jones's previous work, but she was just perfect as the foil for Murray's humour.There's dry comedy to be had throughout On the Rocks which I found delightful. A running joke is Laura's drop-off and pick-ups from the local kindergarten, where she is repeatedly pinned against the wall by single-mum Vanessa (Jenny Slate) and bored to death with her moans about boyfriend-hunting on the New York scene! It's an insight that the project is led by a female writer/director, reminiscing about personal experiences!Coppola's script also buzzes with politically incorrect views of the playboy Felix. (He reminds me strongly of an ex-work colleague: the life and soul of any party and with a charisma that is naturally attractive to women!)For me, there was just one misstep in the movie. There's a sub-plot about the estranged relationship between Felix and Laura's mother, and the unspoken tension that lies there. This all comes to a head in a hotel bedroom, and for me personally it brought the mood of the movie down and wasn't necessary. It's a relatively minor thing. But the result was that it just took the edge off things for me in declaring it a classic.This is one of those flicks produced for Apple, in cinemas only while en-route to their streaming service to make it eligible for Oscar consideration. And it's actually available now. This is Coppola's third outing with Murray, with the most famous being the Oscar winner Lost in Translation. I'm actually not a mad fan of that film. But this one comes with a Highly recommended.(For the full graphical review, please check out the bob the movie man review on the internet, or One Mann's Movies on Facebook. Thanks)"}, {"id": 181, "text": "This movie is a tone-deaf failure with a boring sitcom plot and actors who don't gel. Even though it reunites Bill Murray and Sofia Coppola, it has none of the charm and atmosphere of Lost in Translation.Murray looks like he's doing it as a favor for Coppola, but would actually rather be somewhere else. His delivery is strangely affectless and his character is utterly unlikeable. The main character is written to be deliberately uninteresting and charmless - I actually felt a bit bad for the actress who had to portray her that way. She has no chemistry with the actor who portrays her husband, and every time they're together it seems more like an awkward first date than a scene from a marriage. Their two children are super cute but have almost no dramatic role and spend most of the movie with babysitters while the main characters are drinking and eating at fancy restaurants and parties.The plot is totally pedestrian and can be summed up as: I think my husband is having an affair. Let's follow him and see if we can catch him in the act! And then, uh oh, now Lucy has a lot of splainin' to do. Fortunately, the characters are all rich, so they don't have to worry much about the consequences of bad decisions. Viewers are left with little more than an off-putting taste of life in the bubble of New York City privilege and wealth."}, {"id": 182, "text": "I'll admit that I've never been the biggest fan of Sofia Coppola's films, but On The Rocks is a completely different story. A funny, charming and clever comedy-drama with great performances across the board, this is a lot of fun, and still has the same emotional depth as some of the director's more serious works.At first, the movie seems like a sweet albeit unoriginal look at a woman stuck in a rut, with the story relying too heavily on quirky genre tropes to let Coppola's style really run free.Rashida Jones is wonderful from the first minute, but we see surprisingly little of her character's real personality until the arrival of her father, played by Bill Murray. Once Murray enters the picture, both he and Jones are absolute dynamite, and writer-director is really able to stretch her legs.The overarching story follows Jones as she reluctantly begins to suspect her husband of having an affair, while her father excitedly gets in on the investigation. However, more than that, the film's real heart lies in its assessment of family through a complex but thoroughly entertaining father-daughter relationship.Murray plays a confident, charismatic and manipulative older man whose charm is impossible to resist. As he enchants everybody in his sight, Jones rolls her eyes, in the knowledge of his true character.Not only charismatic, but a caring father too, the illusion of Murray's charm is only shattered when you realise what his real angle is - meddling in other people's lives and trying to project his own worldview onto everyone else.The back-and-forth between father and daughter as they become deeper embroiled in a bizarre spy game is what really makes On The Rocks, and Sofia Coppola is able to deliver that story with such great humour and emotional worth.There's something of a Woody Allen movie about On The Rocks, except Coppola plumps for more timely, real-world themes about marriage, female independence and the generation gap instead of Allen's full-blown existentialism.But it's the film's humour that proves the real icing on the cake, as Coppola delivers a sumptuously sweet story that will make you laugh all the way through. Sometimes it's more serious humour, and sometimes it's a little more silly, but it's always grounded brilliantly on the film's characters and central ideas.Overall, I really enjoyed On The Rocks. Though it gets off to a lukewarm start, the film bursts into life when Rashida Jones and Bill Murray combine, as Sofia Coppola's excellent screenplay finally begins to show what it's made of. Funny, insightful, clever and emotional, On The Rocks is right on the money from start to finish."}, {"id": 183, "text": "Greetings again from the darkness. Sofia Coppola cemented her place among top filmmakers with the instant classic LOST IN TRANSLATION (2003). Sure, she's had other successes with THE VIRGIN SUICIDES (1999), MARIE ANTOINETTE (2006), and SOMEWHERE (2010), but it's her thought-provoking and self-analytical film with Bill Murray and Scarlet Johansson that struck an emotional nerve for so many. This time, she reunites with Murray in what could easily be a companion piece, as it's both familiar and not.Rashida Jones (Parks and Recreation) stars as Laura, who is trying to find herself as a writer amidst the fatiguing responsibilities that go with being a mother and wife, and having age 40 staring her in the face. Marlon Wayans (WHITE CHICKS, 2004) plays her charming, just-started-a-new-business husband Dean, who may or may not be cheating on her. Whether it's Laura's concern over how boring she has become, or the little clues she finds ... well, it's probably nothing ... but doubt grows into suspicion.It's at this point when Felix, Laura's father, enters the story. Felix is a likable cad (probably an archaic word, but it fits), who has never been much of a father to Laura. Instead he chases fun and skirts, and begins convincing Laura that all men are like him. Director Coppola examines contemporary relationships, and the insecurities that come with a long-term commitment. Can one person be enough? Can men be trusted?What follows is an offbeat father-daughter husband-spying adventure, and an ill-advised one at that. Felix pulls up in his Alpha Romeo, and the two enjoy caviar on their stakeout - with the top down on the convertible. This leads to a scene clearly written to take advantage of Bill Murray's talents. As he zips the sports car through the city, he gets stopped by New York's finest. Depending on your perspective, you'll either view this as a prime example of white privilege, or as the benefits of spending one's life being a good listener, attentive to others - a people person making connections.There is a great line from Felix that carries a great deal of weight, although it's easy to treat it as a 'throw away line. He advises Laura, You need to start thinking like a man. Spending time with her dad makes her wonder if he's right - do all men think like him? This plays well against the non-stop yapping mother Laura gets regularly cornered by when dropping her daughter for school. Jenny Slate is perfectly annoying as the mother who not only still thinks the world revolves around her, but also that the world is still interested.Of course, we know, and Laura figures it out: her father worships her. He may gallivant around the globe looking for his next notch, but he absolutely realizes what a beautiful soul his daughter is, and what a better person she is than him. Probably the best lesson Ms. Coppola offers is that communication is key ... or lack of communication can cause a thought to spin out of control.Sofia Coppola and Rashida Jones are both daughters of giants in their field, and likely could relate to having a larger-than-life figure cast a shadow. Eagle-eyed viewers will spot Barbara Bain as Gran. Ms. Bain rose to fame as Cinnamon Carter in the 1960's TV series Mission: Impossible. She's now 89 years old and still working! Sofia Coppola has delivered yet another film that's interesting and provides terrific conversation after watching."}, {"id": 184, "text": "Female protagonist (Rashida Jones) is a writer with first-world problems who has boring, shallow friends. She's trying to write a book but apparently does not have any idea what to write about or why. Hubby (Marlon Wayans) does something in social media, meaning he started a company that seems to be mainly about getting followers and/or likes, no mention of any relevant product or service. Daddy (Bill Murray) is a rich art dealer who, while travelling across and being acquainted to half the planet, has a life void of meaning and therefore meddles with his daughter's. Even though no-one is producing anything tangible or worthwhile, they're all loaded. There's some children too but they are basically extras.There is hardly a story arc and no character development to speak of. There was one moment where I expected some drama to enfold at last, but that fell completely flat. Each and every character is a cardboard cutout, disengaging, entitled and ultimately boring. The cinematography is only so-so, there is no sound design that I could discern.I went to see this mainly because of Bill Murray, but his natural charm and screen presence do not even come close to saving this dud. Most of his acting in this is pretty pedestrian, it did not feel like he had his heart in it. I'm sorry to say it, but it appears he went for the pay check above all else. The dialog is so cringeworthy, it would have been hard to deliver it though.Just like with Song to Song (2017), I did wonder if the shallowness of the whole affair is a statement it itself, a comment on the navel-gazing self-absorbedness of modern urban life. Alas, I fear that with both films that is not the case, the lack of substance is not meaningful, it's simply the absence of a good story.Bottom line, it has a few good moments but is like a fast-food snack, quickly digested and providing zero sustenance."}, {"id": 185, "text": "I suppose it is just a pet peeve but I always find movies about movies, writing, theatre, improv, etc self indulgent and out of touch. The set of New York or California also puts me off... it's just too lazy and out of touch with the rest of the world audience. This movie almost feels like it's a commercial for hotels, restaurants, artists and resorts. All things way out of most of our price ranges, decidedly not bougie but elitist. Do I seem jealous? Enough about me. The kids were absolutely adorable and the little ones' activities were natural but like most kids in movies they are a furniture. I really appreciated the interracial relationships between all the characters being a non-issue. Finally- now we're getting somewhere!!! Like the kids, Marlon, Jenny, and everyone else we'd just accessories without mush substance. Rashida's character perfectly captured the essence of a worn-out, uninspired, insecure, unfulfilled, uninterested and frankly, uninteresting mom. Honestly based off of the bit of her personality I don't know how she was a writer. She needed attention and an unwanted adventure, with intrigue, and a touch of danger with a sexist older man and her dad delivered. In usual Bill Murray fashion, he carried the movie. I couldn't wait to hear what he would say next; my favorite being allusions to Desmond Morris. I wonder if Sofia wrote his whole character. If she did, kudos... he was wonderfully compelling. It was a bit hard to reconcile a man in power being such a flirt but there was some redemption in that he wasn't chauvinistic. His daughter constantly reminded him how inappropriate he was but I guess some men can't be be tamed, certainly not in their 70's. I grew up long enough ago to know to accept the nature of it and recently enough ago to know women need to take power and speak up, without it being a flirtatious slap on the arm saying you're bad. They already know that. Anyways... I loved 2 of Sofia's films with all of my heart. Virgin Suicides is top 20 and Lost in Translation top 5. The soundtracks alone made them worth watching and the choices were absolute movie making magic. Perfect movies in every way, color, characters, cinematography. This movie, not so much. A close-up of a tear in a martini is hardly redemption. Was there any music in this other than crappy jazz and Murray singing (which I would have preferred to jazz)? I guess there was... I just checked the playlist. I'm a worn out mom and used to be more perceptive. Not many actors could have made Bill Murray's character endearing and without him I would have turned it off... no disrespect Rashida, you did a fine job with what you were given. Sofia... what happened to you? You used to be fun."}, {"id": 186, "text": "When a mother suddenly begins to have doubts about her marriage, her larger than life playboy Father (the one and only Bill Murray) helps her find out whether he is being disloyal or not.I've noticed this film is getting pretty mediocre reviews and I can kind of get why but I also personally found it so charming and witty and sweet. Firstly I have to mention the bold colour palette and how perfectly everything was captured. A real beauty in the mundane was found here in such a simplistic effortless way, even Laura just sitting at the table in her New York Apartment caught your eye. It's similar to Lost in Translation in how very simplistic shots became so eye-capturing, aesthetics wise. That is however the only comparison I am going to make to Lost in Translation because that is literally the only similarity. I remember posting a picture from Lost in Translation on my Instagram feed and somebody commenting saying that On the Rocks is going to be the unofficial sequel, I don't know if that is/was the general viewpoint on the film that people have, but if so then that might explain the muted reaction to this, but I can confirm On the Rocks is very much it's own film and story. I just loved how plainly everything was shown, you fell in love with the mundanity of the given time and place. Not only that but I think this film makes a really nice comment on the meaning of family, love and trust. One would think love and trust come with the topic of family but these topics feel separate and then seamlessly all together into that one topic at the end: family. All of these very important things are put on the line yet none are lost by the end, if anything they're even stronger and when the credits rolled i realised that and I did just smile to myself for a moment.Considering I titled my review referencing the father and daughter relationship it probably seems odd I haven't actually gone until detail about it. That's because it does just speak for itself, from Laura and her Father's first interaction you know exactly what their relationship is and you just get to see it blossom even more as the film goes on and it's just so encapsulating, Bill Murray shines in this role, I might be as bold to say it's his best performance.Heart-warming in a brilliantly subtle way, Sofia Coppola continues to shine in her directing."}, {"id": 187, "text": "For this dross of a film where absolutely nothing happens. Or that venerable producer Mitch Glazer let slip through his fingers as is. I haven't liked a Sofia Coppola film since Lost in Translation, which this film sadly tries to emulate. But Bill Murray only does Bill Murray Shtick in this and there are none of the other bright lights, or even much of a script. Perhaps Murray is doing hasty improv, as if he is really reading his text msgs under the table? He can be a great dramatic actor but there's nothing for him in this script and not funny.The older man senior crisis thing, where he tries to be wise but turns out to be just a regular human (perhaps after Francis Ford?) doesn't work this time. Then there's the silly homage to the movie 10, thrown in for who knows what, maybe so we can compare Blake Edward's genius to her wannabe? Cough. The same blandness that was in her failed acting attempt, which seemed original in an ingenue director, now kills her films. She also needs to look past her own affluent life and outdated upper class views on women, men, dads, marriage and fancy jewelry. Adding diversity, while laudable, here is just lazy, clueless fashion. Buh bye."}, {"id": 188, "text": "I remember when Bill Murray replaced Chevy Chase on Saturday Night Live. I never got what was funny about him. He just talks at the camera with his pock-marked expressionless face. Like some kind of a talking mannequin.On Caddy Shack, the Bill Murry scenes with the gopher are the dumbest and least funny parts of that great movie. Bill Murray and the gopher brought the funny pace down.In Ground Hog Day, Murray made an easy movie where the same scenes were re-done for 90 minutes of Bill Murray over and over again. Never got what was funny about it. I honestly did not see any growth in his character. Bill Murray cannot act. It was the same drunken bum, 90 minutes later.The Razor's Edge was another movie about personal transformation. Bill Murray never pulled off any transformation. It is always the same untalented and boring guy, staring straight at the camera, and reading his lines in a monotone.Bland, boring, Bill Murray. Nothing funny, no punch lines, no funny jokes, just his pock-marked ugly face staring blankly as he reads his lines. That is the Bill Murray Story. Mediocrity sucking itself into a great career just because he has lingered on for fifty years of blankness."}, {"id": 189, "text": "Mumblecore is a term used for a film that uses an excess amount of dialogue to carry a viewer from start to finish. Whether you're talking about a Richard Linklater film like Dazed and Confused (which is what he's best known for) or an indie comedy like Drinking Buddies, this term is thrown around a lot. Sometimes used to dive deep into a character's psyche or simply because the writer wanted to have a lengthy conversation linger on for a while, there are many ways of explaining mumblecore films. The reason I felt the need to explain that term for those who haven't heard it before, is due to the fact that I'm obsessed with this type of filmmaking/writing and loved watching On the Rocks for that reason alone. Here's why I believe On the Rocks, although pretty bare-bones in terms of complexity, is one of the better films of 2020 so far.After thinking her husband Dean (Marlon Wayans) is acting suspiciously with one of his co-workers, Laura (Rashida Jones) decides to reconnect with her father (Bill Murray). He then sides with her and makes a huge effort to prove whether or not her husband is being loyal to her. At its core, On the Rocks is a fun little New York City adventure flick that has Rashida Jones and Bill Murray stalking Marlon Wayans. From lengthy conversations to heartfelt moments between spouses and family, this film had me invested from the very beginning. It also doesn't hurt that this film is all about the performances of Jones and Murray because their chemistry here is terrific.Written and directed by Sofia Coppola, this isn't her first outing that included Bill Murray in a significant role. Lost in Translation is easily my favourite film she has ever done and that film involved Bill Murray, so it only seems natural that I think her second-best film might just be On the Rocks. I enjoyed her efforts in both Somewhere and The Bling Ring very much, but nothing ever seemed to come close to the precision that came from her in Lost in Translation. I think that's why I enjoyed On the Rocks so much. I felt hints of Lost in Translation trying to come out, but this overall film was too restrained for it to be as thought-provoking as that one.Look, this film is predictable from start to finish and for that reason, it may seem like the film went nowhere to some viewers, but I just loved spending time with these characters. If a film can suck you in with the characters on-screen, it's already done a great job. The stuck in his ways lines of dialogue that Bill Murray is given only deepened my love for the character and made him more authentic to a man of his age in today's day. On top of that, Rashida Jones played off his quips with easy and I completely bought her rendition of an overly stressed woman with a father like this. Even though some of the dialogue might feel overwritten due to how much of it there truly is, I just enjoyed the short little journey this film took me on.Overall, On the Rocks isn't going to win any awards, but if there was an Oscars category for movies that make you smile, this film might just take that one for 2020. I was grinning from ear to ear throughout the majority of the run time. I would almost say that the core story is about a father reconnecting with his daughter, even though the film suggests on multiple occasions that it's about whether or not Laura's husband is cheating on her. I also just want to add that I have really enjoyed Marlon Wayans lately. His last few performances have been outside of his wacky comedic routes and I feel that he actually has some really strong dramatic talents lingering around somewhere. I thoroughly, thoroughly enjoyed On the Rocks and if you're interested in checking it out too, it's now streaming on Apple TV+."}, {"id": 190, "text": "Try as you might to find a better almost two-hander about the father-daughter dynamic, you'll still might end up thinking Sofia Coppola's On the Rocks is as good as it gets today. While Coppola explores the differences between heroine Laura (Rashida Jones) and playboy, art dealer dad, Felix (Bill Murray), Coppola also brings clarity to the pressures on modern women as they juggle motherhood and romance.Murray is at his best with what one critic called his deadpan anarchy (remember his turn in Lost in Translation as an aging, engaging celebrity). Jones is a foil to perfection, bringing a tense but loving concern to Murray's relaxed care. The thriller aspect, whether or not her husband, Dean (Marlon Wayans), is unfaithful, is a confection to make the comedy more edgy, but unnecessary given the layers of challenge in the father-daughter motif.Speaking of which, it's possible to see this film as a partial reconciliation of Coppola's talent with her colossal director dad's. I'd say she has done quite well given Francis's considerable shadow.Although Felix goes immediately into detective mode to search for clues to Dean's infidelity (no one could know better than Felix on that subject), Laura is a reluctant partner hoping for Dean's exoneration although the evidence in mounting. Coppola's quiet exposition, lacking jolts and surprises, brings home to viewers the cultural hostilities tied to men's infidelity, which Felix exemplifies during his conversations with Laura: The bangle is a reminder that women were once men's property.In a moment of unknowing candor, Felix comments on his growing deafness that reveals his male dominating mode: I can hear everything fine except women's voices. I think it's the pitch. If you look for the vintage Murray charm, look no further than Felix's rendition of Mexicali Rose at a resort-he fashions himself a crooner but really is just exercising his charm of indifference and self-absorption.On the Rocks is a must see for Coppola devotees, for Murray worshipers, and for sane people searching for the answer to the men-women dynamic. At least for Laura, this ancient saying on an old tin plate I saw in an antique shop provides a brief answer: I know what men like. I just don't think they deserve it.See it at the Gateway Film Center. List about it on Oct 16 It's Movie Time."}, {"id": 191, "text": "On the Rocks brings the story of Lauran and Dean, and Lauren's relationship with her dad. As the movie opens, we are in today's Manhattan and we get to know Laura, a writer working from home while also taking care of the couple's 2 young daughters, and Dean, whose company is growing rapidly, requiring him to travel extensively. Laura doesn't feel wanted anymore, not to mention that Dean spends an inordinate amount of time with Fiona, a co-worker. Is he having an affair? Steps into the picture Laura's dad Felix, a guy with too much time and money on his hands. Felix convinces Laura to spy on Dean... At this point we are 15 min. into the movie but to tell you more of the plot would spoil your viewing experience, you'll just have to see for yourself how it all plays out.Couple of comments: this is the latest from Oscar-winning writer-director Sofia Coppola. Here she looks at a marriage that may or may not be in big trouble, and how the wife looks at her dad for moral support. Laura is insecure and her dad is overly secure. This makes for a potential marriage-destructing mix. The joy in watching the film is not really the overall plot (which is quite predictable), but the everyday scenes that play out and are very much relatable to us the viewer. It helps that Bill Murray as the doting father (and grandfather) is in top form. Murray is now 70, if you can believe it, and still gracious and yes, funny. Rashida Jones in more than capable in the role of Lauren. As with many of her other film, Coppola brings On the Rocks with a wistful tone that is never outright sentimental. What a contrast to another New York City-centric I saw this weekend, A Rainy Day In New York, the latest Woody Allen flick that feels just awkward how out of touch Woody Allen has become, as if the movie arrives beyond its expiration date.On the Rocks opened in select movie theaters this weekend, including at my art-house theater here in Cincinnati, and will start streaming on Apple+ TV later this month. The Saturday early evening screening where I saw this at was attended nicely: about 15 people in total, which is more than any other movie screening I've been to in the last 2 months (including for Christopher Nolan's excellent Tenet, I'm sorry to say). If you are a long time fan of either Sofia Coppola or of Bill Murray, I'd readily suggest you check this out, be it in the theater, on VOD, or eventually on DVD/Blu-ray, and draw your own conclusion."}, {"id": 192, "text": "While I wanted to like this a bit more than I did, and left the theatre a little disappointed, I can't deny that some of the movie was quite enjoyable, and I certainly wouldn't call it terrible overall.Perhaps that's on me for getting excited that this movie represented Bill Murray and Sofia Coppola re-teaming, and given how solid Lost In Translation was, maybe part of me wanted something that good. Unfortunately, I doubt this one will be as remembered or celebrated the same way Lost In Translation has been. The only other Sofia Coppola movie I've seen besides those two is The Virgin Suicides, and that was quite a bit better than On the Rocks too.One of the main areas this one is lacking is its visuals. Both Lost In Translation and The Virgin Suicides are extremely well shot, and very visually appealing movies. This one has its moments, and certainly isn't unpleasant to look at. It's just that much of the time, it's a bit drab and flat, looking more like a relatively standard episode of a modern TV show than a movie, unfortunately.While the script provides some good comedy, it also might be another one of the film's main issues. It doesn't have enough fun with the fairly out there premise to be a great comedy, but it also doesn't delve deep enough into the characters to make for much hard-hitting, compelling drama. There was the potential to go dark at moments here, if the filmmakers didn't want the comedy to be zany, but the movie lacks bite and genuine emotion at the opportunities where it could inset some. There are funny moments and there are somewhat serious moments, but sometimes it finds itself floundering in the Emotional No-Man's-Land that some dramedies regrettably find themselves in.With that negativity aside, I can say that at least Bill Murray redeems much of this film. He's not in the movie as much as you might hope, but when he is, he's genuinely very funny, and gives what might be one of his best performances in a while. Rashida Jones is also good, but I feel like she's wasted a little, given that her character is a little dull at times. Marlon Wayans is alright too, but Jenny Slate is honestly fairly annoying, and it doesn't help that her character doesn't feel necessary to the overall movie. Her brief scenes every now and then may have only been there to get the fairly small-scale and simple movie to a runtime of over 90 minutes.It's a good movie to watch one night at home, when you can't decide on anything else I guess. I saw it at a cinema, and it really didn't feel necessary, given how it's a relatively small movie, and also not particularly impressive from a visual standpoint. See it for Bill Murray and his unique, signature style of humour, if you're interested, but otherwise, this film is more or less average at best, and an overall disappointment, given some of Sophia Coppola's other films."}, {"id": 193, "text": "I didn't even know Coppola directed this when I started watching it. I selected it from one of my online subscriptions only because Murray was in it.Twenty minutes into it I was totally uninterested in Dean, Laura's hubby, alleged infidelity and Laura's boring and stressing life as an upper class NewYorker with two young kids.Enters Murray, as Felix, Laura's eccentric father, bringing some sparkles to the stale story. Yes, Felix is a womaniser but he's also charming and sophisticated and basically the only interesting character of the whole movie.Felix forces Laura to go into a private investigation on Dean and the two share some bizarre conversations about the eternal male-female struggle.Half way through, I got a hunch of how this was going to end and caught the bull's eye, so I lost interest because the whole chase is just an excuse to debate trite issues about relationships, with a politically correct twist.On the positive side, the photography is nice, with some beautiful settings but that's all and even Murray cannot save this boring and predictable truckload of cliches.It is now final: Sofia Coppola has nothing left say. She's even started pilfering from Bridget Jones' story line..."}, {"id": 194, "text": "17 years ago, Sofia Coppola released Lost in Translation a critical hit, but a divisive film for the audience who ether adored or hated it's mix of pathos, character exploration and lack of narrative. Everyone loved Bill Murray though, as everyone should. Coppola and Murray reunite for On The Rocks, released on Apple TV because of the Covid lockdown, which became the first feature film I've ever watched entirely on my phone.Laura (Rashida Jones) comes to suspect that her husband, Dean (Marlon Wayans) is having an affair. The evidence is circumstantial, but the notion fits with her feelings that her professional and personal lives are in somewhat of a rut. Back into that life comes her father Felix (Bill Murray) a gregarious raconteur and playboy who knows every Maître d and Concierge worth knowing. Together the pair explore their relationship and discuss life, whilst monitoring Dean's actions.I didn't like it as much as Lost in Translation, would be my one sentence review. It's hard to say why, Murray is on fine form again - perhaps even better here than he was then, as Felix has most of the amusing lines in this one and his appearances usually mark an upturn in the film. But that might suggest that the fault lies with Rashida Jones, and that wouldn't be fair either - everybody pails in comparison with Murray, so Jones makes Laura into a realistic character who is just easily led into flights of fancy by her father.I think the trouble is, just like Felix's car, the film is stuck in second gear. There are moments when it feels like it might amount to something, but the relationship between Felix and Laura never feel so far apart that it really needs putting back together. She snipes at him about his affairs, he justifies them with pseudobabble about men and women. There's a moment when Felix acknowledges another characters death, that might have been that reconciliation point - but it plays flat, or perhaps realistic would be a better term, which is fine - except this is supposed to be a form of entertainment.There are decent performances, and the film has occasional moments, but ultimately not enough of them."}, {"id": 195, "text": "If you enjoy reading my Spoiler-Free reviews, please follow my blog :)Before jumping into the movie itself, I need to offer my appreciation for Sofia Coppola's career so far. With such a renowned filmmaker as a father (Francis Ford Coppola, the famous director behind the classic The Godfather trilogy, Apocalypse Now, and much more), Sofia was able to create a distinct career, avoiding condescending comparisons with her father's success. Most people in her situation would crumble to the pressure and succumb to a total failure. Fortunately, Sofia started showing her own unique talent early by delivering one of the best rom-coms of the 2000s, Lost in Translation (only her second feature film). Therefore, I was actually pretty interested in the simple premise of On the Rocks.This latest installment in Sofia's filmography continues one of her trademark characteristics: a light movie that addresses not-that-light themes. The main narrative follows the answer to a binary question: is Laura's (Rashida Jones) husband, Dean (Marlon Wayans), having an affair? The two possible outcomes don't allow the film to carry any impactful surprises regarding this storyline, but Sofia writes a screenplay filled with astonishingly captivating character interactions, mostly between Laura and her father, Felix (Bill Murray). The movie's beginning focuses on demonstrating Laura's day-to-day basis, developing this character in an exceptionally smooth manner.These first minutes without Felix in the picture establish Laura's mental state perfectly. Her feelings, thoughts, doubts, everything is shared with the viewer either through clean exposition or subtle expressions from the remarkable Rashida Jones, who delivers a nuanced, extremely rich performance. Then, enter the phenomenal Bill Murray. Felix is a charming yet complicated old man who can't be around a woman without hitting on her or stating dumb things like, I think I'm getting deaf to women's voices. His relationship with her daughter seems quite close to the point of Laura trusting his crazy conspiracy theories based on exaggerated facts.Here lies my number one issue with the film. Until the third act, I could describe On the Rocks in one word: real. Every scene, conversation, or action is displayed in such a realistic way that I struggle to find a single sequence that didn't need to be in the movie. At the end of each scene, the viewer always learns something new, whether about a character, an event, or merely a detail of someone's life. However, the last half-an-hour takes the main characters (father and daughter, to be clear) through a path that crosses the line of common sense and makes me doubt if Laura would truly do such a thing, based on what the film showed of her personality until then.Nevertheless, that's not the problem. The real issue is the revelation that comes with this final act that raises a few questions concerning the father-daughter connection. I can't get into spoilers, but Sofia develops Felix as a fun, entertaining, not-to-be-taken-seriously old guy who makes a few too many jokes that maybe he shouldn't. However, after discovering a certain part of his life and how it affected his family, I partially lost empathy. The revelation is probably the only slightly surprising aspect of the movie, not because it's shocking (the film clearly points in that direction), but due to the viewer's focus being on finding out if Dean is cheating on Laura.This new development makes me question how Laura can be so close to her father without ever showing on-screen how she dealt with this situation, especially at the very end where the subject matter is brought back into her life. Don't be mistaken by this extensive explanation, I still enjoyed the movie! I can't deny the impact of this negative issue, but it's far from destroying the film. It's beautifully produced, with every technical aspect complementing each other. Sofia controls both the pacing and the tone of the movie in a flawless fashion.Still, Rashida Jones and Bill Murray steal the spotlight. Both deliver outstanding performances, carrying the dialogues effortlessly and fully embracing their characters' personas. Marlon Wayans is also pretty good, even though he doesn't have that much screentime. With a short runtime, the premise gets surprisingly more captivating than what I thought it was going to be. I felt significantly invested in the process of finding out the answer to the big question, and despite the partially disappointing third act, this storyline is brilliantly executed.In the end, On the Rocks is yet another success for A24 and Apple TV+. Sofia Coppola continues her already remarkable, distinct career with another film defined by one of her trademark attributes. A serious subject depicted through a lighter perspective, possessing fascinating character interactions, and a premise that ends up being a lot more engaging (yet still somewhat predictable and formulaic) than what's expected from it. Rashida Jones and Bill Murray are genuinely impressive, sharing palpable chemistry, ultimately carrying the whole narrative on their shoulders. It doesn't feel like a movie. It feels like a real story with real people... at least until the third act, where an over-the-top, hard-to-accept sequence leads to a revelation that questions the father-daughter bond, as well as the rushed resolution of such declaration. I still recommend it as a weekend's evening pick due to its short runtime and overall enjoyable story.Rating: B-"}, {"id": 196, "text": "3 out of 5 stars.On the Rocks is a fair comedy drama film that has a charming cast but lacks in laughs, humor, and a direction to make this comedy drama worth watching.The plot follows Laura (Rashida Jones) who suspects that her husband is having an affair with a coworker. After being distant, discovering another womans belongings in his travel case, and how close he is with his workers. Her father Felix (Bill Murray) and her try to do a stake out. Hoping to catch him on the act. Until they follow him to a business trip in Mexico. Which her and her estranged father catch up with what they missed out on life.The plot is decent. About a father and daughter relationship which has disappeared through the years. Which they catch up on while trying to catch her husband in the act. The script is flat with its drama. Also lacking in humor and laughs.The film is saved by a wonderful cast. Rashida Jones is lovable and charming with her performance as a mother who is suffering from a writers block. Bill Murray is also charming as her father. Who tries to be that wisecracking attitude. Marlon Wayans is also good as her husband who barely has time with his family cause of his business.It is a drama that is entertaining but very forgettable."}, {"id": 197, "text": "A beautiful re teaming of Bill Murray and Sofia Coppola and a fest for fans of Lost in Translation. The film offers some parallels besides the famous actor/director reunion. Both films handle roughly about a young woman finding her place in her life and relationship, fearing of betrayal, an odyssey through a major metropole and a man, while age wise beyond, but still being in his midlife crisis. But its still different because it also portrays a very difficult father daughter relationship. Rashida Jones is fantastic and it is good to see her in a leading role, she really carries this film. Bill Murray is very good too and for sure has some of his 2002 spirits. Its more of a supporting role here, but still offers many scene stealing moments and Murray once again manages the balance between comedy and character driven drama. Marlon Wayans was also good in a rather serious role ( compared to his usual portfolio). A calm little film of ordinary and extraordinary people. Very intimate. A nice look at love and human relationships. Beautiful soundtrack. Possibly the best Sofia Coppola since Lost in Translation (although not difficult as I was never a big fan of her films that came after)."}, {"id": 198, "text": "A womanizer with a heart of gold tries to help his daughter find out the truth behind her husbands strange behavior, learning a lot more about himself and his relationships in the process.I've had an extremely mixed relationship with Sofia Coppola's films. Lost In Translation is a masterpiece to me, but most of her other films just didn't click with me. So going into this one and seeing Bill Murray as one of the leads definitely gave me high hopes. It delivered. It's much more purposefully comedic and goofy than Lost In Translation, but it still holds that extremely strong emotional core. One scene had me shedding a tear, only to be laughing my ass off in the very next scene.Bill Murray may be second billing to Rashida Jones, but make no mistake, his character is central to the whole film. His performance is so charming and hilarious, but also hits those deeper and more introspective moments so perfectly. He's just a joy to watch every goddamn second he's on screen. His character is flawed, but the way he's written and the way Murray portrays him makes him feel so realistic.The reviews on here seem to be a lot less enthusiastic than mine, so perhaps this is no guarantee... but I would say that if you love Lost In Translation, this should do something for you. It connects to certain emotions and feelings that feel so true to life, and it's not often that I really feel that in an authentic way from a film.And to top it all off, there's a brand new track by Phoenix during the credits."}, {"id": 199, "text": "Lost in Translation is my favorite movie of al time, I have re-watched it over and over countless times and basically grown up with it. (I was 17 when I first watched it). Nothing quite hit this hard from Coppola's repertoire since this wonderful gem from 2003.On the Rocks is not as polarizing of course, not as deep or emotional. But it is some sort of a continuation, at least as long as Bill Murray's character goes, plus Rashida Jones as his wonderful heart-felt realistic partner in crime. You can feel a similarity in Charlotte's character from LIT to Laura, but It's much more grown up this time around, maybe the problems seem also more trivial, but that's life I guess, as it goes on your dreams are not as big anymore. Or maybe that's just Sofia's experience?I liked the movie, I enjoyed it thoroughly, as one of my film director friend's put it Sofia can do no wrong. I agree with that - in On the Rocks you can feel the atmosphere of the city Sofia lives in - she seems to have had a similar life in NYC, although her kids are already older that the one depicted in the movie (also 2 daughters btw!). A similar (real life) situation was illustrated in Lost in Translation, a sequel to Sofia's frequent travels to Japan. Drawn by her feelings and observations of certain moments in life, her new movie isn't to be liked by everyone, but it is, dare I say it? Honest.Honest about the long lost melancholy a the time long gone, of NYC social clubs, rich gentlemen, hanging out at the Carlyle and driving around in convertibles. For me the highlight of the movie is the slow-mo martini glass moment with I get along without you very well playing softly in the background. A true Sofia Coppola moment.I watched this movie several times, once with a more critical and cynical attitude, with my bf, and for a second time with my mother, which sparked a lively conversation around the topic, if men CAN actually be faithful. Never expected such afterthoughts after such a seemingly, simple-scripted movie.All in all, this movie isn't for everyone, a certain love for NYC and Sofia's peculiar style might be needed here and there to enjoy it. Murray is wonderfully himself, not always ultra funny, but truly him, I love him singing like in LIT, and spying on Laura's husband like in Broken Flowers. (one of my favs too)To me, all in all, On the Rocks is a beautifully paced slow burner reminding me of how quickly time passes and that Sofia's style is truly one of a kind."}, {"id": 200, "text": "There are elements of LOST IN TRANSLATION here (absentee husband working in a 'glamour' business) and SCENT OF A WOMAN (an older very charming man who loves women). Add to that the wonderful 'Woody Allen tribute-type photos' of New York. The device driving the plot is Rashida's ('Laura') mate and his new business venture which is turning him into an absentee husband, too busy to spend much time with his beautiful wife and 2 little girls.Enter Bill Murray, Laura's dad, a wealthy savour-faire man-about-town, who suspects that the husband is philandering of course (he may have written a book on the subject). He offers to assist his daughter in finding out the truth, with a little surveillance ( shades of Woody Allen's MANHATTAN MURDER MYSTERY).I found the film quite charming. The critics here at IMDB appear too harsh, or they just don't appreciate the same elements I do.9/10"}, {"id": 201, "text": "On The Rocks is a new movie from Sofia Coppola. She has previously made Lost In Translation. This film isn't on the same level of excellence but it is still of good movie.On The Rocks is about Laura (Rashida Jones) suspecting that her husband Dean (Marlon Wayans) is cheating on her after he got back from London. She tells her father Felix (Bill Murray) about this and he suggests that they both do a full fledged investigation while Laura doesn't want to make it a big deal.On The Rocks is a new Apple TV film from Sofia Coppola. I bought Apple TV just to watch this film and I felt like I used my money well. It was a funny and investing film. The story was marvelous. There were many funny bits in this film that got a chuckle. If you are looking for a comedy I wouldn't really say this is one to watch though. The comedy just sort of comes with the package you get with this film. The story is pretty well structured though. You feel for Rashida Jones character, you have a mutual respect for Marlon Wayans character, and you developed a liking for Bill Murray's. There was also a side character played by Jenny Slate. She was pretty funny in this film. She didn't really add much to the story but she was pretty funny. The only thing I didn't like about the story was the start to the film. I thought that it didn't really have the amount of energy that the rest of the film did. It felt out of the place from the rest of the film. Otherwise the story in this film is one the better stories of the year.The acting is the best part of the film. I wouldn't say the acting carries the film but it does add a lot to the film. Rashida Jones has the best performance. I haven't seen her do much serious roles so that might be why I really liked her performance but she had many emotional scenes that started to make your nose twitch. Bill Murray also played his character well. Although I thought that he was playing his typical character. He always is the guy who is sort of larger than life. He is still good with that type of character but he just plays his typical character. Marlon Wayans is pretty good in the film too. This is the first film that I have seen him in so I don't really have anything to compare his performance to. As I said earlier Jenny Slate was in this film but she didn't really have much screen time. She was sort of there for comedic relief. Jessica Henpeck played the character that was suspected to be the person that Dean was having an affair with. She also didn't have much time on screen. Although she did make you feel hatred for her character. The acting in this film was fantastic though.The score was something I didn't think I would be saying was that good. You even heard it in the trailer for the film so you should have known what it was going to sound like. Although in the moments of the film, the score added so much needed depth. The score was done by the group Phoenix who also did some music for Lost In Translation. They have also been on Jimmy Kimmel, Jay Leno, Conan and many more talk shows. So they are a band mainly but the score for this film was pretty good. Especially at the end of the film.On The Rocks was a film that had marvelous acting and the score added to the film in many ways but the start to the movie just didn't feel like the rest of the picture. I would recommend this movie to anybody who has Apple TV and anybody who likes Sofia Coppola movies or the sort sort of comedy/drama movies."}, {"id": 202, "text": "Sofia Coppola ain't no Woody Allan. Unfortunately Woody ain't allowed to be Woody too in woke Hollywood. Definitely not in the new woke synthetic Dotcom Nuevo Northern Californium IT created Hollywood.Is the old premise that a woman or a man whom suddenly makes a startling discovery, potentially exposing betrayal by the other half still valid? No it isn't. It is well worn and a tired plot basis.This movie is paper thin in dialogue, plot and character development. Even wokeness missing out. We have a modern day blended marriage, a black male and white female (which seems the Hollywood norm if they aren't gay), but hardly a black guest turns up when the couple has joint friends over for a get together. I am not included those in the cast, Murray included, seeming to have stayed under the tanning lights for far too long.Bill Murray pushes his character on you and the support cast around him seem to just go through the motions.It does convey a modern theme about how everyone needs to know someone else's business or get involved in it, but that ain't no theme for a movie."}, {"id": 203, "text": "On the Rocks is probably the most simple film I have watched this year. Everything about it feels so normal and casual. There isn't much to it and, at times, it feels very hollow. But the simplicity and pleasantness of it make it an easy, and surprisingly enjoyable, watch.This is exactly the kind of movie that you want to put on after a long day. On the Rocks is incredibly easy to watch, and it will, without a doubt, make you relaxed. Very little happens, and there isn't any underlying message to be found. All it is is an overly stylized piece of, quite frankly, nothing. The story is spectacularly simple. But it also feels real. It's easy to fall into this film and the lives of the characters since they feel genuine. Since the story is so plain, it also leaves a lot of time for all these little things. Things that probably shouldn't be put into a movie. But somehow, they end up feeling just right in a movie like this. Indeed, the plot could've been covered in about half the time. But thankfully it's not. Although On the Rocks feels very much style over substance, I didn't mind it too much. Sometimes all I want is to have an easy and pleasant time with a film, and I had exactly that with On the Rocks.The story puts us into the life of Laura, who, lately, hasn't been feeling like herself. She is stuck with her writing and has started to believe that her husband might be cheating on her. She goes to her dad for advice, and the pair are thrown into what becomes a sort of spy story to uncover the truth behind whether her husband is indeed cheating on her. And it's that spy story that keeps this movie going. In fact, it's the only thing that keeps this movie going. Apart from it, very little happens. Outside of the time with Laura and her dad, this movie could be a look into almost anyone's life. It's so ordinary. And while it might make it boring for some, I quite enjoyed it. Certainly, the best part is Bill Murray and his ridiculous character, but I also really enjoyed the simplicity of On the Rocks.But that simplicity is also the worst part of the film. It's was really difficult for me to care about what was going on. And while that kind of approach might have worked, had there been something beneath the surface, there's nothing there. No matter how hard you dig, you won't find any deeper meaning in On the Rocks. It is exactly what you see. It feels like someone just decided to follow a random person for a couple of weeks and film all the interesting bits. And while this random person happened to have a rather unusual father, it's still just her life. It's the type of life that most of us can relate to because we are living very similar ones. And while that sounds boring on paper, it ends up being a surprisingly fun and enjoyable time.Probably the best way to describe On the Rocks is average. There is nothing special about this film. For the most part, it's overly simple and can, at times, even feel a little boring. But as a result, it's wonderfully easy to watch. It's pleasant, it made me laugh, and it's gorgeous to look at. And sometimes, that's all I want from a movie."}, {"id": 204, "text": "Adventure, comedy, drama... We've got to have our little boxes with labels... This movie is really just a drama, with one element of comedy (the natural persona of Bill Murray) and as much adventure as can be fit-in while the babysitter's watching the kids... There's a reason there have been hundreds of movies like this, both better and worse, it's because everyone should be able to relate. This is just a movie about life. Everyone has experienced something like this. It's not Mission impossible, it's not The hangover, it's not Sophie's choice... It's an overworked husband, an insecure wife, and an aging father, in an all too common scenario. Bill Murray and Rashida Jones have a great chemistry in their father/daughter dynamic and basically carry the whole thing in a basket (as I'm sure was the plan.) Marlon Wayans played the work-a-holic, neglectful husband well, but never was able to convince me that he really loved her. The little girls were adorable, and the scenery nice and appropriate. The camera-work was clean, with cuts that helped move the story along. The dialogue was well-paced and fairly insightful and profound in an every-day way, asking some questions people just don't like to deal with. This is a good rainy Sunday movie. It's really a 5 star, but I give one extra for Bill."}, {"id": 205, "text": "One of Sofia's strengths as a director and storyteller has been her ability to capture unique and dreamy moments in time. In the past they've often been haunting, painting a surreal piece of art that leaves an indelible impression long after the film has ended. Over her last several films, she has often focused on father, daughter relationships; in Lost in Translation, Bill Murray plays a father figure to Scarlett Johansen's lost and lonely ex-pat in Japan. In Somewhere, Stephen Dorff is a well intentioned, but misguided bad-boy, actor, father to his young and impressionable daughter played by Elle Fanning. Even in the Beguiled, Colin Farrell's male presence stirs a bevy of Electra like emotions within an all-female boarding school. In each case, the female protagonist arguably helps her male counterpart correct his path and often his character in an almost Freudian like capacity.On the Rocks is a film along the same vein with Bill Murray returning (an obvious Coppola favourite) as Felix, the philandering father of Laura, played by Rashida Jones, a woman suddenly worried that her marriage may be in jeopardy and unknowingly in need of marital advice and as Felix sees it, some egregiously terrible fatherly wisdom. Bill Murray immediately kicks into overdrive with his notorious charm and zany antics while Rashida plays it safe and demure - to an almost invisible on screen inducing effect. When the film focuses on Felix concocting ill conceived adventures and doling out horrible mansplained advice, the film is entirely engaging and even quite humorous. When the rest of the cast appear, they move through their dialog and the carefully curated New York set locations with competence but the film loses traction. Beyond Bill, the remainder of the cast feel as though they have been handsomely assembled to act as a comic foil against Murray's legendary presence. Sofia's dreamlike magic also feels missing, the New York set locations are iconic but there is a lack of ethereal moodiness and no real soundtrack; the film feels mostly conventional. While the tension between Felix and Laura is believable, well acted and important, I found most of the film a forgettable folly of scenes strung together waiting for Bill to make another Murray-like appearance. He zooms in, does his thing and then he's gone with everything else wilting a bit. This is a good film, not a great one and won't appeal to a large audience. An example of why Apple TV+ will need a much larger and diverse film catalog to become a viable streaming alternative to compete with the likes of Prime, Hulu and Netflix."}, {"id": 206, "text": "I love stories and watch a lot of film and TV. (So much so that I have an MFA in screenwriting.) Creators frequently spoon feed their audience because they don't trust them to be able to see depth and subtext. Not Coppola. This is an expertly crafted script. The direction is tight and incredibly focused. I'm flummoxed as to why the reviews aren't more praiseworthy. From costume choice to subtext to the right amount of emotion, this film presents subtleties and nuance often lost in modern films. It's beautiful and artistic. Kudos to Coppola for telling a story about the parts of relationships, both romantic and familial, that often get lost with other filmmakers. Murray and Jones sparkle while Wayans walks the fine line between villain and heartthrob. And the enigmatic Jenny Slate is a welcomed surprise. The emotional transitions are natural and impactful at the same time. Overall, this has gone on the Rewatch List. I'm sure I'll continue to find more depth to it in the many viewings yet to come. Do yourself a favor, step out of the adrenaline soaked visual assaults of modern films and give this story a try. If you give it your full attention, you'll reap the rewards."}, {"id": 207, "text": "It might not be Lost in Translation or The Virgin Suicides but On the Rocks sees director Sofia Coppola return to some type of solid form as she uses the star power of her two leads to elevate a simple but effective story that will sit well with anyone not in a rush and anyone willing to be taken on a dreamlike ride through rich New York citizen's lives.After the misguided The Bling Ring and the so-so The Beguiled, Rocks is Coppola's most enjoyable film since the lauded Somewhere way back in 2010, dialling things way back to a bare bones story that is deeper than one first expects, Coppola manages to create both a nicely observed father and daughter comedy and a rumination on love and marriage that will hit home with anyone that has been a part of a long term relationship with either partner or parent.Following Rashida Jone's struggling author and mother/wife Laura whose marriage to up and coming businessman Dean (a softly spoken Marlon Wayans) appears to be reaching a tipping point when it seems possible that he is enacting upon a hidden affair, with Laura seeking helping from Bill Murray as her father Felix, a man who has experience when it comes to matters of affairs, Rocks doesn't attempt to rewrite any type of genre rule-book but thanks to its well-handled direction from Coppola and great chemistry between its two leads, this is a constantly delightful little romp.After a few years of more supportive roles its great to see Jones used to great effect here by Coppola and her turn as the likeable and relatable Laura is one of her best lead turns that is joyously enhanced by Murray whose having the absolute time of his life as the extroverted Felix, a role that is extremely different to the last time we saw him in a Coppola film.Many of the films best scenes are simple little slice of life moments between the father and daughter as they talk about life's big issues, relationship matters or wine and dine across the well-filmed cityscape of New York and then the beach-side surrounds of a small Mexican hotel and as the two learn more about each other and come to terms with their flaws and vulnerabilities, Rocks touches on some heartfelt messaging that ensures this is a film that teaches us life lessons, even if we never feel as though they will stick with us too long after the credits have passed.Final Say -Never attempting anything of a grand nature or anything by way of outlandish delivery, On the Rocks is a quiet but effective dramedy from Sofia Coppola who also manages to draw out some of the best work of Murray and Jones in quite some time.3 1/2 poker faces out of 5"}, {"id": 208, "text": "It must be very nice to be you.Sofia Coppola never fails to make a good movie if Bill Murray is in the cast. On the Rocks follows a young mother reconnecting with her larger-than-life playboy father on an adventure through New York when she believes her husband may be having an affair. I had some high hopes with this one. Ever since the project was announced everyone kind of freaked out. First off, it's Sofia Coppola. Secondly, an all-star cast with Bill Murray. And thirdly, the timing of release and it being an A24 movie suggested greatness. After watching, however, I do have to admit I was a little underwhelmed. The movie is good and all, but it suffers from the story. The story is good and has some exceptional writing. Mainly the story is too simple. I kept thinking that something greater would come but it stayed on the same level. That becomes evident about 45 minutes in. Luckily, all other aspects make up for it. Sofia Coppola is a great director. She works well with the actors and crew on set. One thing I typically notice in her movies is the set design. It's never over the top or noticeable. In this case it's a scene in a restaurant. The wallpaper and everything just complemented each other so I well. She just had an eye for everything.Bill Murray steals the show despite only being in a supporting role. His character is reminiscent of his past roles and a typical character we've seen. That doesn't stop him from being great. And Rashida Jones might just make her way to becoming more of a movie star and not just known for her TV roles. She handles the drama aspects well and Murray has the comedy. They are literally the perfect duo. The writing really works in their favor. Coppola makes the humor not laugh-out-loud but just has it flow into conversations. I prefer that than this being a full-on comedy. It's just a real shame that it doesn't get to greater levels. On the Rocks isn't going to work for everyone. It's tame, simplistic plot will turn some away and the ending sort of fizzles out since it's not what we were looking for. I like the end but at that point it just felt like an ending. Not a good or bad ending but it's just an ending. Anyway that didn't stop me from enjoying it. If you have AppleTV+ this is a good afternoon watch."}, {"id": 209, "text": "ON THE ROCKS MICRO REVIEW - --- On The Rocks is a comedy with a light touch exploring relationships and their infidelities. Laura Keane (Rashida Jones) suspects her husband (Marlon Wayans) of cheating on her while having an interjecting father (Bill Murray) who was himself a ladies man. Sofia Coppola presents an honest self-portrait or an artist dealing with domesticity bringing a charm that shines the brightest through Murray and Jones's exchanges.Coppola constructs an authentic and complex version of masculinity through Bill Murray - one that is deeply flawed through his desire to be loved, his opinions of femininity beauty, and desire to fix in others what he has done wrong. The flavorful overlaying eccentricity of the character withstanding. However, I wish more conversation time was spent between Wayans and Jones which would have solidified the juxtaposition of Murray and Wayans variations on masculinity with Jones being caught in the middle.On The Rocks is everything you think it will be but the journey to get there is charmingly enjoyable and always engaging. Especially from the always charismatic, charming and eccentric Bill Murray."}, {"id": 210, "text": "When I saw that this movie has Sofia Coppola as director and it stars Bill Murray, what comes to mind? The fabulous Lost in Translation. So naturally I was drawn into this.Think of this movie as a mixture between LIT and Broken Flowers.The first 30 mins starts out pretty slow but once Murray gets into the fold then the movie picks up. He plays a quirky father to Rashida Jones' character, who is lost deep down and maybe hasn't been there for his kids as much as he should be.Jones plays a writer who is losing motivation to write since she stresses the single mother role since her husband travels a lot, played by Marlon Wayans. The whole thing is taking a tol on her mental health and it shows.Once she connects with Murray he assumes that Wayans might be cheating on her so they go on this quest to find the answers. This is when the plot caught my attention and could've gone either way, whether he is cheating on her or not. During all this Murray and Jones still aren't really connecting, she feels embarrassed of her Dad's off the wall personality and assumptions and Murray complains that Jones isn't fun anymore after they get the answer they were together looking for. The ending puts everything back together, though it did feel a bit rushed, but it was satisfying.The layout is a nice touch. You have the beautiful city scenery and then you have the fancy resort in Mexico. Both really fit in well with the movies tone.I liked Murray a lot in this movie. I liked his character and I think he will decide your rating. If you like him in Translation and in Broken Flowers and even in other drama movies he's been in, then you will want to watch this."}, {"id": 211, "text": "Sofia Coppola is always on my radar as her movies are often relaxing and at the same time offer a learning opportunity without being pushy. On The Rocks might not be her best work and yet it gave me exactly what I was looking for which is a laid back drama to enjoy with my dinner.The story deals with a family where a wife begins to suspect her husband of cheating but is not sure how to act as she doesn't have any concrete evidence. Her father, played by Bill Murray, makes a proposal to do a certain investigation and spend some quality time together while they are at it.To an extent, On The Rocks could be classified as a dry film as it is essentially a journey of human interactions, regrets and feelings. Bill Murray is undoubtedly the best part of the entire experience as his chilled out acting with occasional insights on human evolution make the story flow. The film's seeming lack of a meaty narrative is balanced by it's light nature which is aided by pleasant cinematography. If you want a mellow movie to calm your nerves, this could be your choice."}, {"id": 212, "text": "Really hope Bill Murray finally gets that Oscar. He really deserves it for this movie, where he gives such a charming, funny, but also in incredibly emotional performance.The plot of the movie is nothing special. But that's really not the driving factor here. Its the relationship between daughter (Rashida Jones), and father (Murray). And gosh their chemistry is great. The movie is much more of a character study of their relationship, which i found very charming, real and relatable, with some really good performances as well, especially by Murray. I was highly entertained, and charmed by their interactions throughout the whole movie.I found the ending a little anticlimactic, and i must admit to be a little disappointing of the end, cause i was so invested up until that point. With that said, i remember that this movie is much more about relations than plotting, and therefore i'm going 4/5. And i genuinely believes Murray deserves the best supporting actor for this, and that hes long overdue."}, {"id": 213, "text": "You know what's great about her? She doesn't talk. She just listens. That sounds perfect for you.Life is full of unexpected turns. As an 18-year-old, I rented the adult cartoon Tarzoon: Shame of the Jungle just for fun. Probably because of the titillating vamp on the cover, lying naked on a huge platter and carried by figures that looked like penises. No one could suspect that a voice actor in this cartoon would become one of my most popular actors. If there's one comedian who manages to make me chuckle without any problem, it's Bill Murray. Like in Stripes and Ghostbusters. Or the incomparable film Groundhog Day. However small his role may be in a feature film, he always manages to create an unforgettable scene, such as in Zombieland for example. Put Murray in a horror, and his typical way of acting makes it a completely different experience. Just watch The dead don't die and you'll know what I mean. In short, a versatile actor who takes a film to a higher level with his contribution.This year I came to the conclusion that I had never seen the movie Lost in translation. A film directed by Sofia Coppola (daughter of) with Bill Murray and the very young Scarlett Johansson in the leading roles. Even though there was something slightly comical lurking beneath the surface of this film, the subject matter was far from comical. A film about two individuals who are right in the middle of an identity crisis. A film about love and loneliness. Loneliness not only because of the life situation they both find themselves in, but also because of the fact that they are in a country where they don't understand the language, culture, and general way of life. Two lost souls who discover, sense, and encourage each other. I admit, I was moved after seeing this masterful film. Finally, after a long time a film that rocked my socks off. A thought-provoking film that'll resonate for a pretty long time. Yes, some movies do that to me.And then 17 years after the release of this magisterial film, we get a renewed collaboration between Sofia Coppola and Bill Murray. On the Rocks is not as magical as Lost in Translation. But somewhere deeply hidden it does have points of contact with the latter. Here, too, Laura (Rashida Jones) is in the middle of a crisis. Both in terms of her marriage and her writing career. The suspicion that her husband Dean (Marlon Wayans) just pretends to have lots of work since starting his own company, just to cover up an affair, grows stronger. And writing a new book isn't easy either. The day she tells her father Felix (Bill Murray), a charismatic wealthy art dealer with an untameable flirtation habit, about her suspicions, he throws himself wholeheartedly into the case with full dedication. Before Laura realizes it, she is embroiled in a wild search for the truth.On the rocks isn't such a depressing and melancholic story as Lost in translation. There's more humor in it. How another mother at school tells Laura every morning about her love life. The interesting facts about human behavior and the evolution of relationships between men and women Felix tells about every time unexpectedly. The wild chase in a not so suspicious-looking red, noisy convertible through the streets of New York. Perhaps it's rather light, uncomplicated humor. Still, it's subtle at the same time. The chemistry between Laura and her father feels unforced and authentic. And this won't come as a surprise: Bill Murray nailed it once more. He demands full attention every time he comes into the picture. His characteristic acting and the way in which he can charm random people with his smooth talk is simply superb. And it's not just the female population that falls for his smooth-talking. The way he manages to turn a police officer's mood from being reprimanding to being helpful is just sublime.On the rocks is about marital troubles, a complicated father-daughter relationship, and also about how people get lost in the turbulent and chaotic society in which they live. It's not another masterpiece of Coppola, but surely it's another successful cooperation between Coppola and Murray. I quietly hope that they will work together again in the future.More reviews here: movie-freak.be"}, {"id": 214, "text": "It seems every creator who goes streaming gets to be a few degrees simpler. Maybe they're told to do so or it's instinctive but the end result is the same: we get more accessible works the general audience would be more likely to consume without difficulties in digestion.Certainly not easy for us to decipher the original artistic intent after gone through a wringer like these providers. Is this work just a lazy soap or a smart commentary on other, similarly pedestrian works, or on real life itself? Either way, the literal representation of ideas is surely a major stepping stone in the dumbing down process, and when all remnants of mystery are eliminated then the process is complete.The streamers don't have credit limit because the whole point is to devalue any true sign of artistic expression. The age old battle for the soul, reheated constantly. The greater the artist the greater their price will be, and the viewer must be cautious what to fill their brain cells with because eventually, like Pavlov's dog, the subject instantly starts salivating when a yummy new trailer containing the right ingredients, drops.A great actor said once, when there's a 35mm camera on set, somehow everybody makes better work. It takes one to realize that his sentence is not about the camera at all, it's about aiming higher than what is considered 'real'."}, {"id": 215, "text": "Oscar nominations prediction: (5) Film; Leading Actor; Director; Cinematography; Original ScreenplayIf you liked: Marriage Story Lost in TranslationThis is the latest film by Sofia Coppola (Lost in Translation; Virgin Suicides; The Beguiled), the already long-established daughter of a cinematic giant Francis Ford Coppola (the director of The Godfather 1-3; and Apocalypse Now). It is a classic dramedy with beautiful cinematography and a radiant performance by Bill Murray.Laura, a self-employed writer and a mother of two, discovers that she is in a marriage where the waters have become just a bit too calm for the people swimming in them to feel safe. She starts casting some panicked looks to the shore after her husband Dean comes home from one of his constant business trips all clouded on Xanax and seems to confuse her for someone else as they kiss. The next morning, she finds another woman's perfume in his toiletries. Hmmm.It's probably nothing, but this is one of those marriages where there's just enough distance between two people for a little imagination to fill the empty spaces. You get carried away by the constant rush that comes with having 2 little kids and a full-day job; and you just seem to not be able to spend time with your spouse anymore. At the same time Laura happens to reconnect with her charismatic, playboy, ever young and flirty father (Bill Murray), who helps her fill in all the gaps she was afraid to fill in herself. Her dad assumes that, like himself, every man is defined by his natural urges for reproduction; that we all are hardwired like this. And although Coppola clearly disagrees with that idea, the great strength of On the Rocks is that it doesn't ask the dad to change but is rather interested in exploring what it is he clings to.Now, despite the films seemingly grim topic it is a very nice balance between drama and comedy. The father-daughter duo drives around New-York playing spies while we discover the intricacies of themselves and their peculiar relationship in an amusing and sweet way. It is also very atmospheric; noticeably great camerawork and cinematography will surely bring this film an Oscar nomination. Overall a very enjoyable experience, and SO FAR definitely in my top 10 of 2020."}, {"id": 216, "text": "Not a great film. The dialogue makes in quite difficult to remain interested even for the relatively short duration. There's no chemistry between the couple, so their entire marriage is hard to believe right from the off. Murray is his usual charming self but has very little to work with and it feels he is going through the motions a bit. It's hard to ignore what feels like a left wing analogy for old white men and as a result it becomes pretty obvious how it is going to turn out in the end.Old white mans views outdated and his lack of trust of the young black man just out there trying to earn an honest living. Hollywood really is laying it on a bit thick these days with the politics.How about some escapism, telling some good stories with a strong script and good plot? A lost artform it seems."}, {"id": 217, "text": "Much lighter when compared with Sofia Coppola's earlier works, On The Rocks is a case of a simple story well told. Kudos to the casting choices - a terrific Bill Murray, a warm Rashida Jones, and a restrained Marlon Wayans - all fit into their respective roles with ease. Rashida Jones plays Laura, a doting stay-at-home mom to her two kids and a writer. Wayans plays Laura's husband Dean, who's mostly busy with his newfound company. Murray plays Laura's dad Felix, a wealthy (read: playboy) businessman who re-enters Laura's life at a somewhat crucial juncture.Coppola's writing, while not as layered as some of the other works, lends enough credibility to Laura's suspicion that Dean may be cheating on her with his attractive secretary. Felix adds fuel to the fire by implying that men (just like himself) are more likely to feel attracted to more than one woman. This leads to a rather unusual father-daughter adventure wherein they learn more about each other while Coppola makes gentle statements on relationships, marriages, and men-being-men. Some of the humor seems to have been added on-the-go. You get an amusing stakeout scene featuring Laura and Felix, on a suave Alfa Romeo chomping down caviar.Even when we see Felix's womanizing ways and how he urges Laura into doing things she otherwise wouldn't, his charm (of course, it's Bill Murray!) is undeniable. And Coppola's script fully acknowledges that. Laura is safe in Rashida Jones' hands, who exhibits just the right amount of fragility. Wayans is surprisingly good, proving that he can comfortably handle sober, straightforward roles. The ending may seem a little too simplistic (for an A24 film), nonetheless, it'll make you smile. I really enjoyed it!"}, {"id": 218, "text": "This very recently became available on Apple TV so my wife and I watched it as soon as it did, streaming via Roku.This is your basic dad and adult daughter caper, she is happily married with two kids in New York but feeling a bit underappreciated by her hard working husband. When she shares an incident with her dad he decides the husband must be cheating and sets out to have him followed. The two of them even follow him to Mexico where he is traveling for business.The dad is wealthy playboy Felix, played by 70-ish Bill Murray and he does it well. The daughter is 44-ish Rashida Jones as Laura, an author unable to get unstuck. Her husband is played well by 48-ish Marlon Wayans as Dean. While the movie in general is executed well and the acting appropriate, I found the story a bit too far-fetched and thus had trouble getting into it. My reaction when it was over was sort of so what?Just a very inconsequential movie that is somewhat entertaining."}], "reviews_amount": 219}