{"name": "The Roads Not Taken", "titleId": "tt09411866", "reviews": [{"id": 0, "text": "This acting tour de force is joyless. Nor is it entirely art-house, although quite close to it. The story recounts a day in the life of protagonist Leo (Javier Bardem), a divorced, lonely man living by himself in a dumpy part of Brooklyn. The plot, summed up in his daughter Molly's (Elle Fanning) words, We visited the dentist, the stupid optometrist, with a minor detour to emergency when you hit your head. Accompanied by his devoted daughter, Leo moves through things happening around him and to him as if he is walking in a perpetual trance. Twice during the day, we hear people questioning if he is really there, first his divorced wife (Laura Linney) at the emergency ward, then later the optometrist. At the end, returning his desolate apartment, even Molly asks Where have you been, dad? It is easy (and lazy) to attribute Leo's conditions to dementia, but clearly there is more. The title The roads not taken proclaims as much. Imbedded in Leo's simple day's existence are two parallel existences in his mind. Before getting to that, however, here's the life story of Leo, pieced together through various dialogues throughout the movie. A Mexican by birth, he came to New York (possibly illegally initially) and made a reasonable living as a writer. When still in Mexico, he had a passionate love affair with Dolores (Salma Hayek, NOT Evan Rachel Wood), but the pair was a co- dependence disaster. In New York he married Rita (Laura Linney), had Molly, and soon deserted his family to go to Greece to write. Missing the little girl, he soon came back. But as the couple's fortune in their respective careers headed in opposite directions, the marriage ended in divorce and Rita got married again. As Leo sinks lower and lower, Rita remains a friend and Molly is absolutely devoted. The movie, however, was nowhere near to unfolding in clear linear narrative. What it looks like I would call video snapshots (oxymoron, I know). Anchoring on the reality of a day during which Molly struggles to chaperon her father through ordinary stuff (dental appointment, eye examination visit, plus a few other chores) the scenes jump all over the map (quite literally) with visions in Leo's mind, some memories, some hallucination. The Mexico montages on the stormy relationship with Dolores are probably mostly true memories. There are also some scanty, almost surreal references to losing a son he had with her in accident. The effect of the trauma may even be the cause of his mental condition today. The other series of montages, imaginary, show him staying in Greece pursuing his writing. The key event in this segment is his conversation with a young tourist, telling her that she reminds him of his daughter. Rita's appearance is in the real world, present-day. Successful, pragmatic and cheerful, she rushes to the hospital in answering to Molly's call to see how she can help. The focus of the movie is the father-and-daughter story. Unfortunately, there is almost nothing to shed any light on the emotional dependence of the father and the utter devotion of the daughter. Fortunately, the riveting performance of Fanning and Barden is sufficient to carry the movie. Hayek and Linney are good too but neither has been given any screen time to speak of. As this is my first experience with the work of auteur director Sally Potter, I should wisely refrain from commenting."}, {"id": 1, "text": "Absolutely breathtaking performance from Javier Bardem and the whole cast, and incredibly moving storyline, which is merging the boundaries of reality and imaginary world. The level of dramaturgy in this film is just astonishing, and perhaps each of us will make our own conclusions to the plot, draw certain parallels, and reflect on our own experiences. This film is much more than you actually see in the picture, the level of trauma and sadness is totally overwhelming. One of the best dramas that has been produced recently. Underestimated masterpiece, and a hidden gem."}, {"id": 2, "text": "Javier Bardem gives a terrific performance of a dementia patient, and Elle Fanning is really good as a daughter trying super hard to cope. It is a heart wrenching story, but the diversions are just very distracting. The subplot with Selma Hayek is just very confusing, I don't even know if it is a flashback or an alternate reality in the man's mind. Then the scenes involving the sea are confusing, and out of place as well. I don't really understand these parallel subplots."}, {"id": 3, "text": "Not a typical everyday movie but has intense acting from the main characters. The screenplay was good in depicting the pain but not good in telling a great story that could have been told effortlessly"}, {"id": 4, "text": "The acting performances for the most part were good, but the narrative slips in and out of flashbacks most of the time too quickly to give you a position to take. The film is mostly about a child caring for a parent with dementia. The only problem it's hard to believe she even knew him much less loved him as much as shown. It's basically almost two hours of watching how well the main actor can act being ill like that. The story shows a little complexity toward the end giving reason to all the pain the father was going through. You're not at all sure he didn't dream up his initial relationship. He had an apparent second with whom he married and had a child who is the other main character as daughter. There is a lot of wasted footage with him going back talking about a book he was writing with young women in supposedly Greece he met. Talking to them gives a little more background to an ultimately sketchy story. Some will review this title, and say it was well crafted with everything having meaning, but to me, even considering that, it lacked cohesiveness to make it a good film. I did, however, think about the dementia reality and sadness, but nothing like the film synopsis says it should be where I've read about it. The roads less taken as a title barely scratch anything meaningful in this drearily made flick."}, {"id": 5, "text": "I should be giving this one a one star rating, for putting us through what it puts us... But then I would just be a neo-nazi ape, setting boundries on art. So it's a well deserved tenner! Warning: if you are slightly above monkey level brain-wise this will hit you right in the guts and it will take you quite a bit to catch your breath back... You'll relive and review your life from the very first piece of memory you can recall. Same idea in a totally different fashion as a screenplay I meant to write some 15 years ago, gave up after an amateur writer discouraged me. Thank you Sally for doing this and proving the naysayers wrong! The cast does not need my praise, they are all heavy hitters and they perform as such. This gem is a piece of intellectual delight, which I do not recommend to everyone."}, {"id": 6, "text": "Contrary to many negative reviews published by various critics of world renown, watching Sally Potter's latest feature The Roads Not Taken, with its name borrowed from a Robert Frost poem of relevant nature, struck me deep to my soul's core. As a person currently dealing with and witnessing a loved one go through dementia, I daresay this portrayal of a life fallen apart and the performances delivered by the actors could not have been more realistic and convincing."}, {"id": 7, "text": "Another legendary performance from bardem.... brilliant movie"}, {"id": 8, "text": "A sad story about being human. Well shot and an enjoyable tale. Recomended."}, {"id": 9, "text": "Not bad not good just fine , very slow rythem and this the main problem ,otherwise the actors are great all of them act really good and real ."}, {"id": 10, "text": "This film truly brings such a heartfelt feeling as the story takes on what is seems to be a man living in multiple lives. There is no doubt Javier shows one of his many and fine performances to date. Along with Elle Fanning who just proves in each of her films that she is by far the best of her generation. If one likes a movie that doesn't need a like of dialog then this film is just for you. The music and cinema photography is really pulls the viewer in and just wanting to know more and more as it unfolds. A story of unconditional love, life and finding where one belongs, a little gem not to miss out on."}, {"id": 11, "text": "Some really solid performances coupled with a good story."}, {"id": 12, "text": "The roads not taken was a film that had great cast and one on paper great idea but even if cast worked well,that idea wasnt able to be made in a better way or to be made with more precise and direction,dialogue in a film was getting repipative after some time and story was in mess in some scenes that were suppose to explain better and deeper plot that they are trying to showcase,bardem didnt get a lot of lines in this film but he was able to showcase pain and other emotions just from his facial expressions,elle was also very good in a film but selma felt wasted a lot ,i think that she didnt really belonged in a film or they could used some more unknown actress for that role and not someone big as her,the roads not taken was a very directorial film to me and there were many thing that should have been more better"}, {"id": 13, "text": "A cop and a bag of sleeping pills team up. Ounce the sleeping pills kick in the front door, both the sleeping pills and the cop start a trail of dialogue (side by side). They turn on a dime (walking swiftly, yet robotic like throughout a structure that looks like a combined 2 cubes). Ounce they get to the kitchen the pills put the cop into the sink for a bath. Cops wet arm slamms the counter and it make a foam cube fly out the window and onto the floor. A woman hiding under an umbrella walks over the cube (in doing so, concentrates all body weight from one of her foot bottoms to the cubes surface. There is a slight hidden smile on the woman."}, {"id": 14, "text": "I loved it. Indie Cinema at its very best. The film is raw and real. The characters are raw and real. It doesnt try to make anything spectacular or romantisice its Topic and characters. Almost felt like a documentary. It is also the birth of two very talented Young actresses who will go a Long way. Sidney Flanagan and Talia Ryder, who already is set up in Steven Spielbergs West Side Story Remake. Flanagan has the lead and the more complicated role. She really put a lot of effort into it and you never see this as a Performance but a real human being. Ryder might not have had the more complicated role but this makes her Performance more complicated as she isnt as Showy as Flanagan. But she still puts so much heart and Soul into it. I also loved the dynamic between the two Girls. There is actually not much dialogue exhange between both. Often you think they are strangers but still they stick together and stand by each other. Eliza Hittman nailed it again and invites us into the Soul of two teenage Girls of the new millenium. A strong film."}, {"id": 15, "text": "I have seen a lot of movies this year. Hundreds and hundreds. This by far is the worst so far.I see what they were trying to do, and the acting was not that bad so I give it a 3. But the actual story and the way it was told was so amateurish and slow and all over the place that I can understand why this movie is gettting such bad ratings.3.1"}, {"id": 16, "text": "Did you see homeless people walking somewhere without destination and talking to themselves? That's basically the story. Good actors, real life setting, this all could easily happen in one's day life in one's head. But as a movie it lacks of... something is not enough, it's like... incomplete."}, {"id": 17, "text": "I don't want to give the story away other than to mention that it is impossible to follow, too slow in many parts, and that this probably worked better in the writer's head. Good actors, but...."}, {"id": 18, "text": "All Roads not taken 2020 15 Director: Sally Potter Starring: Javier Bardem, Elle Fanning, Salma Hayek, Laura Linney etcOverall rating 71/100The roads not taken follows a mentally ill father called Leo (Javier Bardem) and his daughter Molly (Elle Fanning) as he floats through different lives he has lived. The roads not taken was a well done and well acted movie with a message but not good enough to be watched again or watched at the cinema, so let's talk about this more in detail.First of all I liked the unique plot points, performances and chemistry between the actors/characters. I liked the concept of the main character living through multiple different stages of his life, I have rarely seen this in film, and it was done cleverly here for development of the main character and kept the plot interesting. The performances here were also fantastic. Elle Fanning was fantastic, delivering a charming, passionate, and heart-breaking performance, she really portrayed this kind of character very well, Havier Bardem was also, as expected fantastic. He portrayed his role so authentically and with such raw emotion, he did a fantastic job at portraying what mental illness can do to a person in a sensitive and impactful way. The chemistry between Elle Fanning and Javier Bardem was also great, there relationship was beautiful to watch, as the love that Molly had for her father despite him slipping further and further away from her was heart-breaking and handled very well.My next couple of positives would be the emotional weight and deep themes. The movie was very emotional in parts, due to it handling mental health in such a professional and sensitive way, the emotional elements felt well earnt and were very well done as you saw the slow deterioration of Leo's health. The movie also handled deep themes based on mental health very well, the theme of peoples prejudices and treatment of people with mental illnesses was handled very well and raised a big issue that still happens in todays society, which hopefully will change some peoples mind when watching.My few negatives for the movie would be the pacing issues, unclear plot points and the lack of depth to the other characters within the movie. The movie was very slow in a lot places, and despite the themes and performances was sometimes slightly bland and I did lose interest in parts, I also found it strange that that the movies plot points of Leo living three different lives was always confusing as to whether he actually lived them or was imagining these different lives he could live. I would of also liked if they had also had more depth to the other characters within the movie besides Leo. All the other characters even his daughter were very one dimensional and didn't have much to their characters beyond surface level which was a shame and effected the movie slightly for me.My final few positives would be how the plot developed and progressed, the set pieces and the satisfying ending. I loved how the story progressed through Leo's different past lives and how that further developed and expanded on the plot, also the progression and growth with him and his daughter was also great. The set pieces were also very good, the movie was shot in some beautiful and captivating locations that fit the different tonal aspects of Leo's life so this was great. And finally the ending was very satisfying, the character arc between Leo and Molly was ended in a great way that solidified the relationship that was developed throughout and left me somewhat feeling good about the movie when walking out.Overall The roads not taken is a brilliantly acted, emotional film that handles it's mental health subject matter sensitively and professionally, but is never good enough to be recommendable and falls short with it's use of the cast and confusing plot points."}, {"id": 19, "text": "Despite having heard about it for a few years, I've somehow have never got round to visiting the indie cinema venue HOME in Manchester. Very happy to find out it has recently re-opened after the Lockdown, I got set to finally take the road and go HOME.View on the film:Spending the majority of the film saying garbled, broken dialogue, Javier Bardem gives a harrowing performance as Leo, whose suffering from dementia is expressed by Bardem in disconnected, far-off glances, with only brief glimpses of recognition towards those around him. Caring for Leo on her own,Elle Fanning gives a excellent, measured performance as Molly, whose love and compassion for her dad is played by Fanning with increased sorry from seeing the increased deteriorating state of Leo.Having cared for her brother Nic Potter during the last two years of his life as Nic suffered from Pick's disease, composer/writer/director Sally Potter &amp; cinematographer of Slow West and The Favourite (2015/2018-both also reviewed)Robbie Ryan sail into a intimate, raw atmosphere of grainy, partially obscured close-ups on Molly attempting to hold the relationship together,with Potter wisely deciding to play with no score the moments when all the pressure is cast across Molly's face.Taking place over one day, the screenplay by Potter keeps the drama between father and daughter neatly understated and grounded, following Molly having to change Leo out of his clothes, and the sudden shock of fear, as Molly takes her eye off him for one moment whilst out shopping, to be met with the sight of Leo having wandered off.Initially appearing to be fragments of Leo's memories, Potter increasingly makes clear that the flashbacks are actually several parallel lives Leo is living through, which comes off as poorly judged, due to how delicate and up close and personal the drama with Molly and Leo is, leading to a sudden jolt of a abrupt ending on the road not taken."}, {"id": 20, "text": "The Road Not Taken: A day in the life of Leo (Javier Bardem) who is suffering from dementia. As his daughter Molly (Elle Fanning) brings him to various medical appointments he tries to escape from a taxi and ends up in hospital but is soon released to inflict yet more mayhem on Molly. In his head he is experiencing differing scenarios where he was abandoned by his first love, Dolores (Salma Hayek) but might have gotten her to stay; in another he is on a Greek island. These visions morph together eventually, even though they take place decades in the past, his age remains the same.An interesting exploration of what dementia entails, not just for the sufferer but also their loved ones. Molly is fiercely defensive of Leo, feeling that he is being denied agency, his ex-wife Rita (Laura Linney) is more cynical. Some disturbing scenes but the film also shows how confused people, especially those who appear to be immigrants, can fall foul of the law. Good performances all round and writer/director Sally Potter delivers a moving tale of love, loss and what might have been. 7/10."}, {"id": 21, "text": "It's typical sad story especially parts the daughter take care of him. Cannot give up him and live with him just miserable. But that's what family does, too real of life."}, {"id": 22, "text": "The worst movie I have ever seen... It is shame for Bardem"}, {"id": 23, "text": "Saw it 19 Sept expecting it to be a gritty or surreal drama that is atypical of Javier Bardem - it was neither. From the start it was incoherent mumbling with flashbacks where the main character was speaking in Spanish (no subtitles) in unnamed countries. Elle Fanning tried to inject a little bit of life into the movie but it slid into outright boredom with a story that could've been told in 5 minutes.It took half the film to work out where it was set even especially with the camerawork focusing too close to Bardem's face thus filling the entire screen.If you want an expensive sleep this is for you but otherwise give it a miss"}, {"id": 24, "text": "Both my friend and I found it hard to follow and left feeling like we had wasted our time. Acting was very good and the portrayal of a person who has mental health difficulties was great to see but for me it needed more substance and a clearer picture of the roads not taken or roads he did take. It just kept on jumping from one scene to another leaving me a bit baffled as to what was happening. The pace was very slow."}, {"id": 25, "text": "The Roads Not Taken is a new 2020 movie that is actually not long at all, even under 1.5 hours and the writer and director is Sally Potter from England. And not only that. Apparently, this project is/was really close to her heart as she also worked as an editor here and contributed to the score/soundtrack. It is not the very first time for her in both departments, but still unusual. Potter has been making films since the late 1960s already, so for over 50 years now. Massively long career and she started with short films of course as they usually do. She is also 70 noww, almost 71, so almost relatively young still if we look at how long she has been in the industry. She also has not been the most prolific filmmaker and there are occasional breaks of sevveral years in her body of work. Anyway, experience pays off for her and so she gets Oscar winner Javier Bardem to play the lead role here. I will get to him later. His inclusion as well as the inclusion of young actress Elle Fanning made this an interesting project for me as I like both actors quite a bit and was always more Team Elle than Team Dakota, if you can even say that. Still good for the latter to have worked with Tarantino recently. Both their careers seem to be going well right now. And seriously, how can you not love Bardem, even if you maybe have not seen his Spanish-languiage films. This film here also has Spanish on some occasions, namely when he talks to Selma Hayek's character. Yep, another big name, but I must say her character and the story linked to said character were not among the film's highlights for me, even if I don't mind her as an actress, actually probably like her more than I did ten years ago or so. Another Oscar-nominated actress in here is Laura Linney. Fanning's character is occasionally on the phone with her, but she only has really one scene when she is seen, even if that is an okay scene and I was a bit surprised that I liked it because honestly Linney as an actress I have never been too fond of by any means and I feel she has a tendency to play the same character in every movie. Briefly back to Hayek, she plays the protagonist's childhood love if I understood correctly and I found it a bit difficult to understand if her character is just a spirit and maybe deceased or actually there, but this could also just be me. It made me wonder though with her connection to this celebration for the dead that Bardem's character goes to. It is also a but unclear which of the stwo story lines she is a part of. Maybe I would have to rewatch to understand 100% and also understand a little more. As for the title, I like it and I knew that there is a poem with a similar title. But not a book this is based on apparently, even if I think i read people saying something like they are not too happy with the adaptation, but I may just be erring here too. Maybe not with the execution. And I am not sure if the film is linked to this really old poem that I know from the title. Not too important anyway. What counts is the film as a stand-alone achievement. And there I would say it is not too bad. Yes, it may not be entirely smooth from beginning to end and especially the back and forth from the two stories is a bit uneven here and there, but like I said in the title of my review, I felt that Bardem carried it fairly nicely overall. Then again, like I also said, I am a bit biased when it comes to this actor for sure because I like him quite a bit.So this film is all about the what if. How would his life gone forward had he left his wife and daughter when the latter as still very young and sacrificed his family for his craft. He is a writer. This is the second scenario, the one that has consideraly less screen time. There he stayed on a Greek island and actually wrote a book that is also closely connection with the question What if? And he seeks help from a duo of girls, one of them attracted to him, the other creeped out. That was fairly funny. He also seeks much more from them. At least from one of them and you know what I mean with that. But there is also tragedy because in the end he dies all alone on his boat. In the other reality, he does not die, but he is very sick and not there mentally 100% anymore. However, the one thing he is not is alone. He has the most loving and caring daughter who sacrifices pretty much everything, most of all her professional life to be there for her struggling ailing father. To help him when it's about visiting doctors, dentists etc. no matter what happens. And him swallowing the liquid that is there to clean his mouth after analysis is still among the more harmless things. When he pees all over his pants in this stressful situation at the dentis is among the harsher things and it was pretty sad to watch, also because it has a lot to do with dignity. But even there, his daughter (played by Fanning of course) knows no disgust and is there for him helping him with changing his trousers. And she keeps defending him when he is attacked by security personnel after taking somebody else's dog. Or she is there to speak up for him when people keep talking as if he is not in the room, although he understands them. So yeah, with the dog scene and this being linked with Hayek's character in her final scene, Hayek's character is probably also from the string of events with Bardem's character struggling mentally. Also fits that she is mentioned by Linney's character once and also that she comes to his bed early on, spirit/apparition or not. She is there. And how he calls his dog his son is a bit on the heartbreaking side, even if sadly the film never delivered as much on an emotional level for me as I would have hoped it could. But yeah, how he talks about his dog there, he seems to be pretty clean mentally and also speaks in a way where you can understand him well, whcih wasn't the case all before that and fittingly we hear Fanning's character complain and worry about the same issue. Not Bardem's fault though that it came a bit short emotionally for me. Not at all. Maybe it was just me anyway because honestly I think some of the other audience members in my showing had tears in their faces when the closing credits rolled in. I would have liked too. The one thing I struggled with honestly was near the end how Bardem's character in the key story line remembers or imagines his existence and death in the other story line. That did not fit in my opinion and also made no sense, especially because this life never existed. Only we know about it and are we supposed to believe that he in his struggling mental state can really make such a clear imagination and connection? Or maybe all we see in greece is really all he imagined and not how things really would have turned out. There is no clean explanation or solution there. Honestly before realizing these strings are parallels to each other i kinda felt that maybe these are just scenes from the past, from when he was still healthy, but it becomes clear pretty quickly that this is not the case. Still an interesting idea, even if the editing wwas not always top-notch. I am surprised there aren't really (m)any other films who take such an approach. Okay, what else is there to say. Unfortunately, I must also say that, as much as I liked Bardem, I was not always too fond of Fanning's portrayal. Once or twice, she went a bit over the top and also did not nail the emotional moments as much as I hoped she could. She still isn't bad, don't get me wrong, she is still among the most talented under 30 in my opinion. Oh well, she is barely over 20 and should have a bright career ahead of her hopefully. I will be cheering for her for sure. And she also has a few good moments, like when she cries from joy when he remembers her name at the end. There we also see that we never really found out her name before that, so of course it is a special moment for her character and he also feels her joy and is happy with her. Bardem acted this scene very nicely, just like everything else. And yeah, you cannot really blame Fanning for not (yet) being on par with an acting power house like Bardem. She still held her own pretty well next to him most of the time. So yes, I think it is a bit disappointing that this film has received almost no awards recognition, especially for Bardem, but the project's overall poor reception hurt his chances too. Still, it is not bad and I give it a thumbs-up and I say that you should not be kept away by the negative reviews and give this film a chance, especially if you are as much of a fan of the two lead actors here. Go see it! Also pretty wild to see all these European countries listed as producers here. That I did not expect. Okay, enough now. In short: Go watch this movie please. By the way, as for Bardem and his character, I sometimes had to think of how different paths would have resulted in major life changes here and coincidence and choices are also a huge thing for Bardem's Chigurh, so as different as the characters may be, there are also parallels. Maybe just me paying attention to that. That is all now though."}, {"id": 26, "text": "If you like your movies action packed you are going to dislike this movie. If you like light and uplifting stories you are going to positively loathe this one! For everyone else, The Roads Not Taken is a very thought-provoking piece of film-making from writer/director Sally Potter that I have a lot of respect for. Even more so, since I learned that the film is based on the director's time caring for her now deceased brother Nic, diagnosed with early onset dementia in 2010.It's not a promising premise. The Roads Not Taken concerns a New Yorker with dementia being taking to the dentist and the opticians. Gripped yet? Nope... didn't think so. But stay with me here.Elle Fanning plays Molly, daughter of the almost catatonic Leo (Javier Bardem) who is receiving a lot of support to stay in his own home. As his daughter assists him on his trip to his medical appointments, he is only about 10% 'there'. Glassy-eyed and almost incomprehensible, his utterances are often taken to refer to his present experiences. But actually, he's 90% somewhere else, revisiting two key episodes in his past life and reacting in the real world to what's happening in his dreams.As he relives 'the roads not taken' we can piece together the elements of a life that's lived and - perhaps - lay out some elements that might have contributed to his mental decline in later life.Before we plunge into the doom and gloom of the story, there was one moment of levity for me in the opening titles. I commented in my review of The Farewell that the company 'dog-tags' at the start of the film reminded me of a famous Family Guy comic moment. But this is kindergarten level compared to this movie. I assume Sally Potter must have tapped her complete phone contacts list to raise the funding for this one! Since I counted FOURTEEN different production companies referenced! Is this a record?As you enter later life, it's common for many of us to suffer a significant source of stress. Sometimes - if you're lucky - four sources of stress. The reason? You stop worrying about your kids as much and start worrying about your aged parents and in-laws. Like heating up a frog in water, it's often imperceptible how much stress you are actually carrying with that until the last of the relatives 'shuffles off this mortal coil'. Within the grief, there's also a source of guilty relief in there somewhere. Such is the maelstrom that young Molly is in - with knobs on - given the disability of Leo. As a professional in her 20's, she is also having the juggle this responsibility with progressing her career.It's a bit early in this turbulent year to talk of Oscar nominations. But for me, there are three standout performances in this movie:1) Javier Bardem: what an acting masterclass! As with Daniel Day-Lewis's win in 1990 for My Left Foot, the Academy loves a disability-based performance. I haven't seen much Oscar-buzz about this performance, but I'd personally throw his hat into the ring, for at least my long-list;2) Elle Fanning: this young lady has been in movies since the age of 2, but rose to stardom with Super 8. She's building a formidable filmography behind her. Here she matches Bardem shot-for-shot in the acting stakes: a caring daughter being emotionally torn apart; always needing to be in two places at the same time (as nicely positioned by the cryptic ending). A first Oscar-nomination perhaps?3) Robbie Ryan: with an Oscar-nom previously for The Favourite, could another one follow for this? For this is a beautiful film to look at, despite its downbeat story. There are some drop-dead gorgeous shots. One in particular is where a sun-lit Fanning has a Marilyn Monroe subway skirt moment at a window (with her hair being blown, I should add). Glorious. And all of the Mexican/Greek scenes (all Spain I believe) are deliciously lit and coloured.The Roads Not Taken is an intelligent watch for sure, and reminiscent to me of Almodovar's Pain and Glory: another artist's life lived again in flashback. If anything, this one is more unstructured in setting out a box of jigsaw pieces that you need to piece together through the unreliable narrator's random memories. (Ooh, look - here's a bit with Laura Linney on it... ah, that goes there; So that's who Selma Hayek is; etc.) But, as with a jigsaw, staying the course and putting the last pieces in is a very satisfying experience.There's also a really feelgood scene in a taxi rank that restores your faith in the underlying goodness of people.... and a rant by a Trump-voter that gives you quite the opposite view!Where I found some frustration was in the lack of backstory for Molly. She seems to be painted rather two-dimensionally. Yes - young with job, but of her personal life we see nothing. Adding another dimension (a young family for example) would have added yet another set of stresses to the mix. Leo's flashbacks are also focused on just two time periods. More wide-ranging reminiscences might have broadened the drama.But I personally found The Roads Not Taken intensely moving. I'm not sure I could say I enjoyed it, but it is a worthy watch and has left me with thought-provoking images to chew on.(For the full graphical review, please check out One Mann's Movies on t'interweb and Facebook. Thanks.)"}, {"id": 27, "text": "You know when you sometimes play a movie without knowing anything about it? Well, that's the chance I took with The Roads Not Taken and it was a real surprise movie for me. Some days you are driven by emotions rather than logic. And this is a story that won't give you all the full answers, but will present puzzle pieces that you can connect upon reflection. There are three narratives that the filmmakers intercut between. Leaving it up to the viewer to interpret wether what you are seeing are partly dreams or memories. Javier Bardem plays the main character, and that man never seizes to amaze me. The way he changes the body language, the way he expresses a glimpse of life in his eyes - It's like he is playing three different characters all together in the three narratives. It's a performance that stroke me to the core since it reminded me so much of my grandfather. In some scenes completely mimicking him, which brought so many memories back to me. I understood the dilemma of the film and what it wanted to give a beautiful perspective to - Which almost broke me emotionally at the end.I've been there next to a person who's wandered off in his mind and returning to be present in fragments. I would find myself asking Where did you go? Have you been with us all day?. The questions were always left unanswered. Director and writer Sally Potter offers with this film a view into that mind. Perhaps giving you some answers and in earnest, a sense of hope. Also, this is the best acting I've seen from Elle Fanning. She truly impressed me. Her scenes with Bardem brought tears to me eyes. There was a strong connection that was performed beautifully by everyone involved. I'm so glad I took that chance and watched this movie. It gave peace to some unhealed thoughts I had looming in the back of my mind."}, {"id": 28, "text": "I was initially attracted to this film by the solid cast, featuring such players as Javier Bardem, Elle Fanning, Salma Hayek and Laura Linney. While I found the acting to be overall representative of such talent, neither the plot nor the created characters struck much of a chord with me.For a very basic summary, The Roads Not Taken tells the story of Leo (Bardem), an older man experiencing some form of senile dementia or other cognitive impairment. While being shepherded to various appointments over the course of a day by his daughter Molly (Fanning), Leo flashes back to a series of pivot-point moments in his life where things may have turned out differently.The underlying concept of this film is solid and intriguing. That being, the notion that someone could live out certain what ifs? in their life and see the results of those roads not taken (hence the title). The problem with this specific film, however, is two-fold:First, it waits far too long to clue the viewer in on what is happening in Leo's mental flashbacks. Had I known what those were, I could have better appreciated them in the moment. As it stands, however, those scenes serve as odd non-sequiturs for almost two thirds of the film before the audience will understanding what is happening.That above failing wouldn't be so bad if the characters in the moment gave viewers something to become invested in, but sadly this isn't the case either. The entire story is very dour and gives little to no semblance of hope throughout the proceedings. I wanted to become emotionally invested in the characters, but it only felt like I was continually being pummeled with depressing material scene after scene.As I mentioned, the acting purely on its own merit is very good here. This is especially true for Fanning, who gives her all (as usual) and provides the only true emotion of the entire picture that viewers may care about or latch on to. That being said, it was a little sad seeing her give 100% in the acting department for a story that simply didn't live up to such a performance.Overall, The Roads Not Taken is a great nugget of an idea that is largely rendered inert by a confusing narrative and lack of context to care about the characters. I wanted to get on board with the idea, but the film never truly inspired me to do so."}, {"id": 29, "text": "The Roads Not Taken begins with a ringing phone over the opening credits. The credits are synced to the ringing. It took me years to get past the beginning of Once Upon a Time in America, beginning as it did with an incessantly ringing telephone. Every time I'd just throw my hands up and say not today, Sergio!But eventually I got over that hump and was richly rewarded. Which is why I simply dug my fingernails into my palms and waited this one out. I'm glad I did. For whatever reason, there's always a good movie on the other side of an interminably ringing phone.(It has a point, the ringing. It's thematic.)The movie is hypnotically paced. Somewhere in the back of my mind I imagined myself glancing at my watch, stopping the film, and doing something else with my time. But I never glanced at my watch. Not once. OK, there was the one time I checked how much longer the film had to go, but not because I was bored -- it was because I was worried it would end too soon.The performances are -- let me say this. It's not fantasy. I thought the premise (or at least my initial interpretation of the title) was going to go in more of a whimsical About Time-ish direction. Like this is a man who is experiencing a supernatural event in which he must choose which path to take. It's not that. It's very much a man with dementia existing in different places in his memories, envisioning different choices, while his daughter tries to connect with him in the present.So the performances are brilliant. There was a moment in a cab early in the movie when I was afraid Sally Potter was going to do like what Terrence Malick did with those three little weird movies of his. You know the ones I mean. Where he just got his video camera and followed actors around. They were like, So where's the script, Terry? And he was like, JUST DO WHATEVER YOU WANT, I'LL FIGURE IT OUT IN POST.There's a bit in a Costco parking garage that's just perfect.Lastly, I want to talk about the music. It's the best thing about the movie. I will be buying the soundtrack. I haven't bought a film soundtrack since The Mission.Oh and one more thing, with regards to phones ringing in films -- there's a limit. It's two. Two rings! That's all you get! If you need more you gotta use silent film intertitles. Them's the rules."}, {"id": 30, "text": "Sadly, three errors undermine the reality of this film which otherwise had great pathos.The first glaring error was when the opthalmologist became frustrated with Bardem who understandably because of his condition/illness could not understand or take instruction as a normal person, the error being that his daughter clearly did not explain before the exam that her father had dementia as shown by the opthalmologist asking her if her father was 'all there'. How could a caring person (the daughter) not warn anyone dealing with a parent with dementia be so unthinking as to not do this? The second error is a repeat of this, when in the clothes warehouse the security guard tackles Bardem to the floor and all the daughter can say is 'my father is confused'. That doesn't help her father or those dealing with his unusual behaviour--anyone with a bit of sense would make it abundantly clear that Bardem was suffering from dementia, so that others would then treat him more sensitively. The third error concerns the daughter repeatedly excusing herself from an important meeting at her work which involved an important project she had undertaken. It seems that because she didn't make it into work that day, someone else or their work was chosen above her(s). At no point does she explain the truth about why she couldn't get into work ie that she was having to deal with her very ill father; instead she gave mumbled, ineffectual excuses which most likely sounded very lame to her boss or whoever was calling her from her work. Why the hell wouldn't she convey the gravity of her situation when she might then get some understanding and sympathy from her workplace? These are clearly errors in the script, odd that neither the director nor anyone else picked up on them. For em there were jarring, unrealistic moments in the film which accordingly undermined its plausibility."}], "reviews_amount": 31}