{"name": "Palm Springs", "titleId": "tt09484998", "reviews": [{"id": 0, "text": "Films that revolve around characters repeating the same day over and over again has grown very tired in my mind. Groundhog Day perfected it and it really wasn't until more recently with Edge of Tomorrow that I really found a film that seemed to stand out among the rest. Well, I'm glad that I can now add Palm Springs to the list of films to put a clever spin on this concept. This film was originally supposed to play at more film festivals around the world and eventually receive a theatrical release, but things being the way they are, Hulu has now released it. Although this may be a film that's hard to find for some right now, here's why Palm Springs is one of the very best movies to come out of this bare year of 2020 so far.Nyles (Andy Samberg) and Sarah (Cristin Milioti) find themselves sort of bonding over the fact that they both really don't want to be at the wedding they're at. He's the date of someone who cheats on him and she is the sister of the bride, who clearly has many issues. Stumbling across a strange cave after the wedding, they both find themselves caught in a time loop that has them reliving the same day over and over again. Certain things are revealed about each of these characters that add a lot more depth to the story and I found myself incredibly engaged from beginning to end.Where this film shines the most is in the fact that it completely commits to the whole time loop concept, even giving a few winks at the audience. It never once makes any huge mistakes logically, which felt refreshing, especially in the ways it would subvert expectations and most importantly in the way that they choose to conclude the story. The way Palm Springs wraps up was a very entertaining and emotionally earned finale. Now, I feel like I say this about a lot of movies that focus so much of their time on very few characters, but I truly mean that if Samberg and Milioti didn't have any fun chemistry together, this film would've been a disaster. This is probably the most laid back and comfortable I've ever seen Andy Samberg be in a film and it made the entire experience that much better.Only having written and directed a few short films and a documentary before tackling Palm Springs, director Max Barbakow has honestly blown me away here. With a small budget, a small number of characters, and a small scope, this film felt much bigger than it was. I can honestly see a big future for him in the coming years. I will gladly seek out his next project. On top of his stellar work on this film, writer Andy Siara (who also doesn't have a huge filmography as of yet) added a very funny and clever tone to the whole concept. It was clear that the performers were very comfortable with the dialogue because their acting lept off the screen and that just seemed to be a nice mixture of everything coming together nicely behind the scenes.In the end, Palm Springs is a film that I was very much looking forward to, but was wary of due to the concept itself. Thankfully, this is one of the best movies that I've seen accomplish this concept in years. I'm not calling it a masterpiece by any means, but for a fun time loop movie, I really couldn't find many issues. At a mere 90 minutes, this movie flies by and has just enough clever surprises for those who may not have been completely engaged. While the idea itself has grown tired for me, this movie is undeniably hard to dislike. Everything about this movie put a huge smile on my face and if that isn't what the world needs right now, I don't know what is."}, {"id": 1, "text": "I was expecting a conventional rom-com where the guy meets the girl, but this one has a little twist. It's smart-funny, well written some of the shots are gorgeous and very wholesome. It's a fresh take for this type of genre."}, {"id": 2, "text": "Groundhog Day gave us some pretty realistic scenarios about life but still Bill Murray was grumpy as we saw the beginning of his character's curse. Here we don't. We meet Andy aka Nyles when he has already lived the same day for years and have had made peace with it. Cristin aka Sarah, on the other hand is new and starts out grumpy but becomes the adventurous one.J.K. Simmons is also beautiful in his character, although a short storyline. They took Groundhog Day and added some stoner existencial crisis type feels and added a beautiful romantic angle with an appropriate cinematography. This movie works on multiple levels, a weekend watch, a romantic watch and a fun watch. Although, there are some explicit scenes but in all they just add to the overall amusement.It opened with a bang in Sundance and is surely worth a watch.Cheers."}, {"id": 3, "text": "This movie is utterly wonderful. It's heartfelt, romantic, real, and topical. It made me think, laugh, and cry.The Groundhog Day setup may seem stale, but they get so many fresh ideas out of the concept that it solidifies this film as a future cult classic.I was never really a Samberg fan. I am now!"}, {"id": 4, "text": "... but re-dimensioned in such a way that the films it copies will look a little less appealing next time it comes to replaying them - whether it be in the past, the present or the future."}, {"id": 5, "text": "I really wasn't expecting a ton from this movie, I expected a pretty decent romantic comedy and I also love Andy so I was excited to give it a shot. But WOW was I very very pleasantly surprised!! I literally started it over immediately after finishing it cause I liked it so much. Completely not what I was expecting but I thoroughly enjoyed this movie. I laughed out loud multiple times, and the story is completely amazing in my opinion. Highly recommend if you're wanting a quirky comedy, but it also has very cute moments. LOVED it. I hope it gets the recognition it deserves."}, {"id": 6, "text": "I'm a huge fan of time loop movies and this one might be in the top 5 of those I've seen.The first half is fun and enjoyable. Samberg and Milioti are great and work well together, and the use of multiple people experiencing the time loop - something that's surprisingly rare for time loop movies - works well. Samberg's usual over-the-top schtick is turned down to 25% here, which made the movie more enjoyable for me, as it meant the humour meshed well with the somewhat more serious vibe of the movie.Where the movie faltered for me was around half way through the movie where it switches from fun to drama. As with a lot of stories, this is when the world falls apart for our protagonist(s) and they need to fix things to get back on top and come out stronger than before. But here the resolution is not greatly satisfying, so it's not really worth the switch from fun. The ending itself is not the worst they could have gone with, but even that feels somewhat underwhelming. In fact, despite the movie having a somewhat unique premise, the last act of the movie feels like the generic final act that a lot of rom-coms movies use. I also didn't find Samberg's acting to be fantastic when he needed to act more serious, although that issue only stood out to me a few times in the film.Overall, though, the movie was good. It did something a little different with the time loop concept, the good parts of the movie were really enjoyable, and even if the second half wasn't fantastic it didn't ruin the entire film. So I'd recommend this to anyone who likes the sound of a semi-serious rom-com time loop flick. (And now that those 90 minutes have come and gone for me, I wish they'd actually made it an 8-10 episode miniseries instead.)"}, {"id": 7, "text": "I was flipping through Hulu one night and saw this movie pop up, I saw it was Andy Sanberg and the cute chick from HIMYM, I thought hey maybe it'll be good for a chuckle, and if not, eh who cares. But it was a perfect late night gem, I love coming across movies or shows that I genuinely like by accident and with no expectations going in."}, {"id": 8, "text": "A good thing about movie is that it doesn't last long, it has a story and a beautiful message. You will laugh, I promise."}, {"id": 9, "text": "Palm Springs is One of those infinite time-loop situations you might have heard about. Palm Springs is a Rom-Com about Nyles (Andy Samberg) and Sarah (Cristin Milioti) two wedding guests stuck in a time-loop forced to relive the same day over and over again. Samberg and Milioti are great together as Nyles and Sarah. The CGI may not have been great, but that didn't take away from the many laughs I had during the movie. Palm Springs is a great movie, and if you haven't yet watched it, watch it."}, {"id": 10, "text": "Movie was okayish at best. Definitely not worth 9/10 rating people are giving it. Good for a one time watch."}, {"id": 11, "text": "While Groundhog day was much more inspiring and transformational for it's main character, the characters in this movie seem to end more or less in the same place they started - being sarcastic and superficial. The first half of the movie was better, had some funny moments and interesting scenarios. But the 2nd half just turned into a very generic rom com and the end result was flat and uninspiring."}, {"id": 12, "text": "Im not gonna spoil anything or say anything else about the movie, if you've watched the trailer your just thinking to yourself oh another groundhog day. This movie goes beyond what it is intended and leaves you laughing and feeling better than before you watched it. HIGHLY RECOMMENDED"}, {"id": 13, "text": "Palm Springs was an okay movie. Script vice, the movie doesn't really offer anything new. The characters find themselves into a time loop and they just follow every classic rom com trop until the final ending. We don't get to know them, we don't get to understand them, or to understand the whole time loop concept really. The whole thing can be described as generic at best, with some odd touches here and there. The performances, in addition, were okay but nothing special. For all it's worth, it is not a waste of time, but nothing special either."}, {"id": 14, "text": "The time loop shtick has been done a number of times but this new film takes it and puts a great romantic comedy spin on it. Andy Samberg and Cristin Milioti are great and their chemistry is off the walls. Watch it for a great time."}, {"id": 15, "text": "I'm impressed that people are still able to find new, original spins on the classic Groundhog Day premise of repeating the same day over and over. Palm Springs is a unique and compelling film that blends so many genres together into a dazzling package. It's slightly absurd at times, but that just adds to the charm of it. Andy Samberg is hilariously goofy and Cristin Milioti does a lot of the dramatic heavy lifting. This is just a really enjoyable, wonderful film that deserves to be seen and will undoubtedly make you happy."}, {"id": 16, "text": "Gorgeous movie with a great premise, time loop movies are something that I will never get enough of! This movie certainly met my expectations. The twists were subtle and surprising which is hard to come by considering the fact that the same day kept happening over and over. All in all, a fun film!"}, {"id": 17, "text": "Why all the buzz on this movie? Yes, it's a new and creative spin on the November 9 version of Groundhog Day, but it is nowhere near better. Except for some moments of JK, the repeat of nihilism day after day is not fun, nor is it entertaining. At least we weren't subjected to the first five minutes being played out each waking day. I so wanted to like this. I so didn't."}, {"id": 18, "text": "Thought I was not the rom com type, but this flick takes the cake. Such a refreshing and original premise and bombshell ending."}, {"id": 19, "text": "A weak-sauce rip-off of Groundhog Day, but with particularly unlikable characters who never really show the growth that Bill Murray did in that 1993 classic. It is all so slight and insignificant. I chuckled twice."}, {"id": 20, "text": "There's something about time loop movies that are pretty cool, though I guess it probably has to do with Groundhog Day simply being one of those classic films that spur people on to adapt it to different situations. This one is certainly no different, and it does have some uniqueness about it that I particularly enjoyed. The difference with this one is that multiple people are actually trapped in the time loop, and they are able to interact with each other, which I thought was quite cool. The other thing is that while we know who is trapped in the loop, we don't know how long they have been in the loop, namely because they have been caught in it for so long.So, basically have this guy Nyles, who as you can guess, has been living this day over and over again. Like, it's a wedding where his girlfriend is a bridesmaid, and it is located out in the desert, Palms Springs to be precise. Obviously, he has used the opportunity to, well, pretty much try everything, and he also discovers and awful lot of secrets as well, such as his girlfriend being unfaithful to him. However, the catch comes when one night he is out in the desert with the maid of honour, and is attacked, and he flees into the cave, the one that originally started the time loop, and she follows him in.It's pretty cool actually, and while I'd suggest that it is slightly different to Groundhog Day, it still has a lot of the elements. It's pretty funny as well, especially with a lot of the shennanigans that he gets up to. In fact, it seems as if he has been in this loop for so long that he no longer cares, and it has just become part of his life. Not so with Sarah, who is looking for a way out, and decides that the only way to do it is through quantum physics. Actually, it's quite interesting how these days quantum physics is thrown around with the idea of time loops, but that is probably because despite having been around for about a hundred years, there is still a lot we really don't know about it. In fact, it is just another one of those 'new frontier' type of things film makers and such that is probably why it appears so often.Anyway, this is a pretty cool film, and quite funny as well. While it doesn't really break new ground, it's stull quite fun to watch."}, {"id": 21, "text": "I absolutely love this movie. It's such a cool plot and cast. I love he pacing and resolution of the movie very much. Great job Andy, you played Niles perfectly."}, {"id": 22, "text": "My husband and I rarely agree on anything tv show and movie wise especially since we have two kids and our only time to watch is after they've gone down which doesn't leave much time before we got the hay too. We browsed through Hulu I wanted horror he wanted anime *eye roll* I actually accidentally clicked Palm Prints without looking at the synopsis. I thought since rated R it would be a horror movie...it is not it is a comedy that both my husband and I watched together there were laughs there was romantic drama it was good a solid 8 outta 10 I'd say and we both enjoyed it the actors worked really well together and gave it a real feel. Give it a chance."}, {"id": 23, "text": "Palm Springs works on just about every level. It has some genuinely funny moments, its heartwarming at times, and Andy Samberg/Cristin Milioti are fantastic and have great chemistry together. It's a romcom with a twist (which you should try to not know going into it) and it executes on its premise as effectively, if not moreso, as many other movies/TV shows with the same twist. Overall, I'd highly recommend this movie and would say that just about anyone can enjoy it."}, {"id": 24, "text": "If you'd suggested that I could like a fantasy romantic comedy, I'd have said you were off your meds.But I'd have been wrong, because this is a beautiful movie. It's so simple and fun and heartfelt and funny, it's just a joy to watch.Go in without reading anything about it, and just enjoy it."}, {"id": 25, "text": "This movie now is one of my favourite time loop movies. Funny, hilarious, enjoyable and romantic. ❤❤ Do not think twice and watch it !!"}, {"id": 26, "text": "Cute story. Obviously, like 95% of the movies, you already know what's going to happen and how it's going to end. It's the journey that matters and all the jokes along the way. This movie made me seriously laugh out loud a few times at least (which doesn't happen that often these days) and I really enjoyed watching these two characters go through the story. Definitely recommend this but if you are going into this expecting something new or a masterpiece then... well, you need help."}, {"id": 27, "text": "Pleasantly enjoyable comedy movie. It was so casual. I liked it. Just lay back and let the drama flow. Oh, one crucial thing though; Do not get serious at this one tiny science part. That's a comedy too, in a big way. You should know that by now. I mean, didn't we watch this movie for eons? 'Woaaaaaht? (lol)'"}, {"id": 28, "text": "If you watch this with an open mind, no knowledge of what it's about and no expectations, it's refreshingly surprising and heartwarming. Much needed distraction from all the nonsense that is going on in the world. Some parts are a bit inappropriate, but what else would you expect from Andy?! Give it a try!"}, {"id": 29, "text": "Call me an old fashioned bore, but they really suck at making movies these days. How on Earth is this a 84/100 on Metacritic is beyond me, even by their laughable standards. This is absolute pedestrian drivel. Out of the many recurring day themes in movies and TV (Groundhog Day, 50 First dates, Supernatural), this is definitely the worst. This made an 85 minute runtime seem unwatchable and never ending. Probably because Samberg is such a third rate version of Sandler, with none of likeability of the latter. Even my girl who can consume modern BS with more tolerance than me, was found fast forwarding this annoyance multiple times."}, {"id": 30, "text": "Answer is: Most people already do. You wake up in the morning, go to a job, get back home, hang out with your family, maybe do something in between and go to sleep. Living one day over and over is one movie concept that gets used every once in a while, and usually those movies are very enjoyable to watch. Why? It's a mix of how are they going to get out of this, character development and finding new ways to enjoy life. Palm Springs is similar to Groundhog Day because of the repeating days concept, but they don't have much else in common. If you like movies like About Time, Groundhog Day or even Edge Of Tomorrow, this is a movie for you. It is really a great combination of romance, comedy and sci-fi and if you like a good laugh and a good romantic story, I would definitely recommend it. Really well done by Hulu, everything from acting to directing was done professionally and superbly. Netflix/Hulu movies have not been famous so far for their cinematic/entertainment quality so I was really surprised by Palm Springs."}, {"id": 31, "text": "I honestly thought this would be just another Groundhog Day ripoff, but it ended up being considerably more. The acting was well done, the casting was on point, and it was funnier than I had even hoped it would be. Very happy I decided to see it."}, {"id": 32, "text": "Palm Springs is a fresh take on an established concept. Inspired from Groundhog Day, it's one of those infinite time-loop situations you would've heard about. A very fun movie that's perfect when you want to unwind and just chill. Grab your snacks and enjoy this movie!"}, {"id": 33, "text": "After watching the trailer, I thought it'll be the same time travelling thing again like GroundHog Day or any other time loop movies but this was much more.Even the feels and how I felt that it's more than a venue but a comfort zone and what do you do with it.By the end, I was smiling so wide due to everything that happened and what the characters represented."}, {"id": 34, "text": "If you are not familiar; with the concept; basically a person keeps living the same day again and again until finding a way to get out of the loop. Basically is that happens to Sarah (an outstanding and lovable Cristin Milioti) when by accident gets trapped in the same time loop with Nyles (Adam Samberg ) and Roy (J.K. Simmons). The movie portraits three depressed, frustrated and immature in funny and sweet way making really care for the lot. Giving too much will be to spoil the surprise; but let's just say that the movie is able to be sweet, entertaining but with a very deep message about what we make of our lives and understand for happiness. In brief; it is really worth seeing it."}, {"id": 35, "text": "Well I love samberg,love their chemistry and like the Groundhog Day happy death day premise as I find it interesting in terms of things you'd do as your technically invincible and immortal. This film explored bits of it.He met her a lot so I get the love for her, her reciprocating felt more forced but needed I guess, wasn't a fan of her sleeping with the sisters fella as no matter what the narrative says she's pretty damn horrible. The goat killing and learning physics to that level to the dinosaurs seemed a bit mental to meI think I enjoyed it until, I thought too much about it if you try and explain it or pick it apart it feels bad"}, {"id": 36, "text": "Surprisingly good! May even watch again. Samburg is hilarious, the leads chemistry is good, and the movie was altogether engaging and heart-felt. Ending was a little lackluster, but I still came away from the movie with a smile on my face."}, {"id": 37, "text": "This very funny movie involves two people eternally reliving someone's wedding day.From the trailer I expected a level of wackiness commensurate with that of co-star Andy Samberg's Brooklyn-99 series, but while this is often very silly and very thoughtful, it's also existential, thoughtful, and increasingly romantic. Cristin Milioti is great as the one who can't adjust to her strange reality, and she and Samberg have great chemistry as they flirt and fight under extraordinary circumstances.This is just really fun and you should definitely watch it."}, {"id": 38, "text": "For a time looping movie, Palm Springs came out tops! Fun, funny, smart and a fresh take on the tired worn out start your day over and over again concept.Some very decent writing, acting and directing takes this film to a high level that lately many other films fail to reach.A must watch - a good laugh and an ending that works!This film scores a very well deserved looping 8 out of 10."}, {"id": 39, "text": "I watched this because I love Andy Samberg, and I genuinely thought it would be a mindless rom com that was must meh, but boy was I wrong! This is such a fun modern day take on the Groundhog Day, time warp plot. I was actually on the edge of the couch most of the movie. Full of laughs, plot twists and genuine moments. So glad I found this gem."}, {"id": 40, "text": "At the beginning of the movie, I had a feeling I'll enjoy this one a lot. Really had a promising start. Actors are fine, color is fine, setup is good. Then the next morning came. I've recently finished the superb third season of Dark and after I noticed Groundhog day style trick, honestly I felt it's going to be a bad rip off. Yet surprisingly it turned out pretty good. At least until up to a moment that the girl realized about that bad morning she wakes.It's totally understandable she wakes up on a terrible mistake and can't take it anymore. But taking it out on the guy just didn't make sense. At first, movie tried to lean on the idea of we're here because we've done a mistake in our lives and we should fix it. Once this higher purpose idea didn't work out, she comes up with the ridiculous idea ever to get out : exploding yourself with a c4 in that special place (I won't even ask how did she found c4 since this is a romcom). The worst part was she didn't even care about the guy, she just wanted to end it. Basically her own personal mistake or dilemma has become his problem. All that chemistry (if ever there was) was gone afterwards. I don't know if making a huge explosion would break a time loop but messing up the chemistry between main characters definitely breaks the consistency.Once that connection is lost, the rest wasn't funny, romantic or whatever you call it. If they would handle the second half more delicately, this could have been 8 even 8.5 easily. And it could have stand on its own instead of calling it a Groundhog day style movie and it means you can re-watch it countless times.In the end this is a nice flick. But I don't imagine I would like to see this again."}, {"id": 41, "text": "Nothing new, nothing unique, nothing original, I have seen it so many times before. Not really funny, somewhat entertaining but gets boring pretty fast."}, {"id": 42, "text": "While it's not ground-breaking or revolutionnary by any means, Palm Springs provides a fun and heart-warming viewing experience.It's not perfect, the resolution and the ending feel a little bit rushed in my opinion and certain plot points remain a bit of a mystery (especially how Andy Samberg's character ended up in this situation in the first place) but overall, I do not regret spending one hour and a half watching this movie. 7,5/10"}, {"id": 43, "text": "Not the deepest movie in the world, but fun with echos of Groundhog Day with new twists."}, {"id": 44, "text": "Time loop has always been a recurrent theme on movies but few times has a movie about the topic achieved this amount of entertainment and fun. Simple but entertaining movie. This is another proof that imagination is better than big budgets. This movie is about having a good time watching it and it delivers. One of those little gems we find from time to time."}, {"id": 45, "text": "But instead of some actual growth, we just have to wait until one of them decides to become a quantum physicist and brute force their way out of it.More plot holes than time loops, completely silly, derivative and not worth your time... even if you are stuck in a time loop."}, {"id": 46, "text": "A good movie to watch if you want to kill a couple hours. The two leads are pleasant and I liked their chemistry but the movie was just not as well crafted as Groundhog Day which includes the attention to detail. Admittedly GD is one of my all time favorites so it's a high bar. The lead often doesn't act like a guy stuck in a loop for a long time. Also they didn't tell Roy what they discovered near the end which is a big loose end. They could have don't without the cheesy effects used to demonstrate traveling through dimensions or whatever."}, {"id": 47, "text": "What a fun movie about quantum physics! I had fun watching this movie and enjoyed every minute of it. It combines Groundhog Day, Happy Death Day but it's still unique...a fun love story!"}, {"id": 48, "text": "A woman followns a man into a cave after she had a romantic moments with him when he woowed her at a party with his speech. The man tells the girl not to enter the cave but she refuses to listen and goes after him until they both get spagettified an wake up the morning of the wedding. The man appears to have been living in this loop of today,tomorrow,yesterday is the same and now the girl,to her surprise shares this fate with him getting stuck in the same day forever no matter how many times she tries to kill herself. They fall in love and become close with the passing of days and they learn a lot about themselves in the process. The girl studies quantum mehanics to find a way out and succeds when she comes up with a theory that they are stuck in an energy bubble of which the inly way out is by blowing themselves up during the time of the time traveling zone. The music in the film is cool. The relationship building between the two is cool too but other than that it is nothing more than a groundhog day"}, {"id": 49, "text": "While the basic thread is borrowed from films such as 'Groundhog Day' (Harold Ramis, 1993) and the recent 'Happy Death Day' (Christopher Landon, 2017), 'Palm Springs' benefits from the clever treatment of its core concept, the quirky writings, energetic and infectious chemistry between Andy Samberg and Cristin Milioti, a solid supporting act from J.K. Simmons, and a brisk runtime of 90 minutes. Enormous and exhilarating fun."}, {"id": 50, "text": "This film could have been much better, like possibly an 8.5 or 9 film if it was just longer and funnier. Throughout the entire film I laughed twice, so it's certainly not a 'laugh-a-minute' type film. The plot/story is a good one, and not one that I've EVER seen done before, which is great, since you see the same plot/story used OVER and OVER again so often, but this film's plot is truly original.Samberg and Cristin Milioti deliver good performances. The film is a little short though... I would have loved it if the film was about 20-30minutes longer, so that some time could be spent on showing the various 'loops' that the main characters have previously experienced. With a plot/story like this, you could have SO MUCH fun, with the various crazy and wacky things that the characters could be shown doing (like robbing a bank, jumping into a volcano, wrestling a bear, etc.) but alas this film's short runtime leaves very little time for such antics, and thus results in only a 7.5 film."}, {"id": 51, "text": "I planned to watch Gladiator tonight but I honestly couldn't be bothered as it's around 3 hours and quite heavy. So I remembered that Andy Samberg had a new film out so I thought I'd watch it for the How I met your mother , Judd Appatow feel I was looking for. I watched it and was pleasantly surprised at how clever what could've been a very simple rom-com turned out to be."}, {"id": 52, "text": "Good fun entertaining. It is almost impossible to make a good movie with an happy ending. Disney spoiled happy ending for the most of us."}, {"id": 53, "text": "Though it was better when it was called Groundhog Day, it still was a decent movie! That said, it's a one-time only viewing. Modernized version of the Bill Murray classic, but mirror image on the premise."}, {"id": 54, "text": "New twist on living each day over again. Made me think Would I really want to be immortal? I really liked this movie. It's all about the mood your in. Just go with the flow and enjoy. Peace."}, {"id": 55, "text": "Comedy, romance and sci-fi! Very cute funny movie, well acted, original story"}, {"id": 56, "text": "First came Groundhog Day. Then came Edge of Tomorrow. Now here comes Palm Springs, a time loops movie for the quarantine era that's now on Hulu and playing in drive ins to critical acclaim and record viewings for a movie on Hulu set previously by Parasite. The movie stars Andy Samberg from The Lonely Island, who produced the movie, and Chrstin Miloti, best known for playing the mom on How I Met Your Mother's series finale, as a boyfriend girlfriend who live die and repeat through several scenes. Made for a budget of $5 million and making a small profit, this quirky film is worth watching."}, {"id": 57, "text": "Palm Springs is great romantic comedy that answers what if? A movie that is worth repeating."}, {"id": 58, "text": "A nice surprise. Had some great laughs, with heart and despair thrown in for good measure. Was just a really nice balance you don't often see in movies these days. Recommend watching it if you get the chance"}, {"id": 59, "text": "This is the story of a boy who is stuck in a day. I remember the first movie that I watched with this kind of story was Groundhog Day 1993. I like these movies since they show us how valuable is each day of our life. We grow up we have kids. Our kids grow up. You see time is passing and so many good things come with it. I liked the innovative story of this movie. The movie is filmed in different locations like a wedding venue, a desert, and a bar. Andy Samberg and Cristin Milioti played well in this movie. I liked the special effects. I enjoyed the music during watching this movie. In summary, I recommend watching this movie to comedy fans especially fans of multi-verse and time loops."}, {"id": 60, "text": "Great twist on the OG Groundhog. The chemistry between the 2 is real. The range of the acting and witty humor makes it a refreshing watch. Grinned for most of the movie."}, {"id": 61, "text": "It's hard to see the wrong in this movie. It really seems like the people who work on this movie tries really hard to make the movie plot hole proof."}, {"id": 62, "text": "This movie is exciting. The story is unique and about how to enjoy your life in any situation you are in. You will wish that this movie never ends..."}, {"id": 63, "text": "It´s not the best movie I´ve ever seen but it´s one of the best I´ve recently viewed. It´s original so you don´t know what´s going to happen and it has depth to it. I really enjoyed it."}, {"id": 64, "text": "It's honestly hard for me to sit through a full movie without breaking multiple times out of boredom. I only paused Spring Break because I needed to catch my breathe from laughing so hard. I don't know the last time I had such a good time watching a movie. I can't wait to watch it again.Andy Samberg's best anything he's ever done!"}, {"id": 65, "text": "Yes, this is an extremely enjoyable movie to watch! I haven't come across such romantic comedies in a long time, they are not even my favorite genre, but I watched this one with pleasure :)I highly recommend it to everyone."}, {"id": 66, "text": "It's a good and fun movie. Definitely a one time watch."}, {"id": 67, "text": "As I've said in previous reviews and for many years, the modern day rom-com is nearly dead. There are outliers a few times a year typically but the formula was incredibly overdone back in the 1990's-2000's, that I think we began to grow numb of what a great rom-com can actually be. Palm Springs is a GREAT rom-com and it's also one of the best films of 2020, if not the best. Not to mention how perfect it is for the summer season and current quarantine most of the world is stuck in. What better than a rom-com about two characters stuck in a time-loop of never ending death at the end of their day? Even more impressively, Andy Samberg &amp; Cristin Milioti have wonderful chemistry, enough to melt even the most cynical of movie-going audience's hearts. Palm Springs is nothing short of excellent.9.5/10"}, {"id": 68, "text": "I have never left a movie review. This movie made me feel so many emotions. Andy Samberg is so talented that it felt like really watching someone fall in love. I am so happy about the character arc that Sarah was given. I think that even though the living the day over again concept is played out, but this story gave it an interesting spin, and a solution. I am so happy I watched this."}, {"id": 69, "text": "I dont like and tend to watch rom-com movies, but i ended up enjoying it so much, bought joy to my heart. Christin milioti is great. Definitely should be on your watch list"}, {"id": 70, "text": "Modern take on Groundhog day. That's how i'd describe this film to anyone that initially asks what it's about. The story is very different and the decision to ground it (Slightly) in some science was cool.All in all... it was a fun flick that I'd recommend."}, {"id": 71, "text": "Amazing movie, very well-written and smart. What elsa can I say, watch it."}, {"id": 72, "text": "do uh, you think you could kill me one more time, you know, so I can beat the traffic?"}, {"id": 73, "text": "Just shows you that millions don't need to be spend to make a good movie. This movie has that amazing feel about it where you wished you were in the movie itself. Definitely one of the best movies of the year."}, {"id": 74, "text": "Cristin Milioti makes this movie! A great heroine, imperfect, flawed and perfect at the same time! I've always been an Andy Samberg fan and this quirky Groundhog Day on crack is a good fit for his quirky personality. I like the couple's chemistry and J.K. Simmons is perfectly cast, too, as the protagonist. The ending kind of surprised me as I expected credits before the very last pool scene. A cliffhanger ending would have suited this movie with the shaky science perfectly. That's the only reason I gave it an 8. It was a great escape for 1.5 hours."}, {"id": 75, "text": "After the credits, Did Roy just get Niles to go back to the mountain coz they forgot him?"}, {"id": 76, "text": "Fun mashup of the time loop rom com Groundhog Day and the more sophisticated time loop sitcom Russian Doll. But the title is so wrong - this movie was neither shot in nor bears any resemblance to the actual desert city of Palm Springs, which features stunning architecture and really nice hotels. This looks like it was made in some ratchet desert area near Joshua Tree. It's like if Woody Allen had shot the movie Manhattan in the Bronx and kept the title."}, {"id": 77, "text": "Finally a true successor to Groundhog Day! Cristin Milioti gives the breakout performance she has been waiting for. Script is wry and sly and continually engaging. Also the best romcom in years."}, {"id": 78, "text": "Palm Springs is one film as you watch you will enjoy it's hard not to like as it blends connection and romance with some fun laughs. It involves Nyles(Andy Samberg) a lonely down on his luck guy who after attending a wedding meets and becomes attracted to the brides sister Sarah(the wonderful Cristin Milioti) and all of a sudden it's like magic as both of their lives have changed forever. It's like the same day each day they live over.Maybe your thinking Back to the Future still each day the characters have new adventures and grow each time though thru each repeat they learn to take chances and the courage is unmatched to explore people and places. Love and laughs is filled along the way. Really call it a journey adventure or an escape from the norm Palm Springs is a thumbs up winner that travels quick and pleases. As much love, sex appeal, and learning is felt by watching the film."}, {"id": 79, "text": "We do get a lot of these time loop movies now a days but trust me, this one does have a unique approach.I was actually really surprised with this one. Great chemistry/performances from both Andy Sandberg and Cristin Millotti, plus its always good seeing J.K. Simmons whenever he shows up in a movie. Funny dialog and does keep things engaging throughout. It is not an average RomCom and rewards those who are giving their full attention. The pacing does slow down a little bit compared to the first act but still keeps things pretty interesting. Dont let it slide under your radar and check it out! My actual rating is an 8.2/10"}, {"id": 80, "text": "Palm Springs is incredibly original, thoroughly inventive and the feel-good movie we need right now. . In this comedy, two strangers who meet at a Palm Springs wedding, get stuck in a time loop. . The script is fun and sharp and the performances from Andy Samberg and Cristin Milioti are really great. The duo has a quirky chemistry that is almost impossible to resist. The film itself is seriously irresistible; if you don't have a good time watching Palm Springs maybe get yourself checked. The use of the premise and the time loop are done with precision that even if certain scenes are contradictive, it still feels refreshing to see these characters go through what they're going through. I really enjoyed this film. . Follow @snobmedia for more reviews!"}, {"id": 81, "text": "This is not a movie that will change the world, but it was a very pleasant diversion. It has some great performances and a watchable, if not recognizable, plot line. It was a very nice way to kill part of a morning."}, {"id": 82, "text": "I didn't go in to this movie with much expectation other than knowing I enjoy The cast.It's got some plot holes but overall is a great laugh."}, {"id": 83, "text": "This one is imaginative ,creative,fun, romantic and craziest entertainment.Brilliant screenplay from andysiara and assured direction from maxbarbakow.what a making ,tiny budget movie ,a lots of fun and excitementSparkling hilarious chemistry between andysamberg &amp;Cristinmilioti ,they ruled,special mention to merdithhagner and JK Simmons is perfect.Overall palmsprings is amusement to enjoy at home"}, {"id": 84, "text": "Pure fun, good times and really happy kinda movie."}, {"id": 85, "text": "Andy Samburg is hilarious in this movie and shows his acting chops, I think Bill Murray would be proud. Christin Milioti really helps to bring an original take on an idea that has been done over and over again. JK Simmons is always a welcome addition to a movie. I'd watch it again tomorrow."}, {"id": 86, "text": "What a refreshing, sweet, hilarious heartwarming movie. Absolutely loved it! Andy is so great and shows some range ans depth. Absolutely will watch multiple times"}, {"id": 87, "text": "This is a six...barely. The start of the film is actually pretty good and you 'd think that this will get funnier and funnier but halfway through it gets closer to romance than comedy and loses it's pace. Also, for Andy's style, this is not a raunchy film. Acting is ok, storyline is cool...but for about 40 minutes. Then the script changes tone and becomes a neo-melo-dramatic hipster-esque conversational piece. 6/10"}, {"id": 88, "text": "I have this feeling that this movie will be very adored by cinephiles (now and) in the future. You can really feel the heart that they puto into this."}, {"id": 89, "text": "The two lead performers and their chemistry elevate this take on the Groundhog Day formula even though the story leaves plenty to be desired. There are some funny gags but the overwhelming sense was that I had already seen this movie. You get all of the standard rom-com beats plus a retread of every joke in Groundhog Day. It is a nice movie overall and there is nothing expressly bad or offensive about it (besides one groan inducing science montage), it just isn't very new or innovative."}, {"id": 90, "text": "If you like a great giggle. A good laugh. A super bit of creative thinking and writing...then watch this film. Enjoy it. Experience it for what it is...which is something very different to the normal mundane BS that exists out there. Thank goodness certain people are willing to take risks and do things differently. Thank goodness. Because, this is FUN. This is ENJOYABLE. This is MEMORABLE. This is GREAT. 10/10."}, {"id": 91, "text": "This movie was a feel good great time . The plot is pretty simple but overall I very much enjoyed it. Andy gives a great performance , nothing over the top , just right . Worth a watch!"}, {"id": 92, "text": "Similar attempts are made to avoid the repetition and monotony by Phil (Bill Murray) in 1993's GROUNDHOG DAY and Nyles (Andy Samberg) in PALM SPRINGS, and both leading men are SNL alumni. Both have sweet, hilarious, poignant and life-changing moments executed with a tight, intriguing script. But SPOILER ALERT the difference is how they are able to stop the Déjà vu. I encourage you to watch both films if you enjoy an esoteric and entirely entertaining departure from the typical rom-com."}, {"id": 93, "text": "First of all,, camila mendez is hot.. beautiful lady.. i wished she could do the lead character... but she wasnt..anyhow .. christine did very good job.. well performed movie..Even its low budget movie. 5 million $ .. most AAA movies cost start from 50+ million $. still its well written , performed and directed."}, {"id": 94, "text": "This film surprised me a lot. Hoping for another solid Andy Samberg film and got something even better. Tons of laughs great story and great acting by both Andy and and Cristin Milioti."}, {"id": 95, "text": "Novel twist on the same old story with a love interest thrown in. Well done, well written, loved JK Simmon's character. Not what I was expecting at all."}, {"id": 96, "text": "I found this romantic comedy, a great watch. The cast is awesome, the story line stays in focus throughout, the comedy is free flowing and abundant while not becoming over bearing. Both Samberg and Miloti show their assertive wit and then give us just enough charm to wrap this piece into a nice present worthy of your opening. J.K. Simmons is the bow on top, completing the ensemble."}, {"id": 97, "text": "The writing, acting and directing are great. It's a very well done spin on a commonly used trope. This is definitely Andy Sandberg's best movie."}, {"id": 98, "text": "Loved it but it was predictable. Really enjoyed the way it got to the ending. The female lead is great and easy on the eye too"}, {"id": 99, "text": "I love romantic comedies and this is one of the best. Right parts mystical and sweet. Also enjoyed the throw backs to Groundhog Day and Russian Doll. Acting is great, script is fun, story is magic. Watch it."}, {"id": 100, "text": "If you like Groundhog day then this is up your alley. This was even better than it in my opinion.Not much of a review I know.Make your own opinion about this movie. I am not your parents.You may or may not like it. I am not the one to make your decision."}, {"id": 101, "text": "Its great art, just go enjoy it. It will bend time upon love and live. This program tells me my text is to short but good reviews should not spoil and make you want to watch it. Anything other is besides the point. The art is in the work Palm Spring watch it. The art is in the work Palm Spring watch it. The art is in the work Palm Spring watch it. The art is in the work Palm Spring watch it."}, {"id": 102, "text": "I really enjoyed this movie... Great chemistry among the cast. I could watch this movie again, and it would still make me laugh. So the premise has been done before... So What... Great writing and comical timing..."}, {"id": 103, "text": "Watch volition then this. Two new films released on same day. Had no idea what either were about prior to watching, but the two are a perfect pair."}, {"id": 104, "text": "Perfect 10. A very good feeling movie. A must see humorous, romantically, emotional movie."}, {"id": 105, "text": "Palm Springs Released July 10th, 2020 Hulu OriginalStarring: Andy Samberg, Christin Milioti, J.K. Simmons Directed: Max BarbakowThis may well be one of the most enjoyable movie watching experiences I have all year. Palm Springs is just simple and fun with its fresh approach to a time loop romantic comedy. This Hulu Original film produced by the one and only Lonely Island and helmed by first time director Max Barbakow definitely took a risk of falling into the standard formula or template films like these tend to fall into. Although it does become fairly predictable as we enter into the third act of the film (which honestly didn't bother me at all), I did appreciate how Barbakow told this story from many different perspectives. Editing in a smart way, and made sure to reveal shocking aspects of each characters arch perfectly as to make sure not to turn the screenplay in a repetitive and dull mess. You'll understand what I mean as each time the day repeats, we are shown that much more of each of our main characters that will have you being more and more invested.By far the best part of this film is the instant and palpitating chemistry between Nyles &amp; Sarah. Films like this sink and fall flat if the audience does not truly believe the genuine performances of the actors - this was absolutely not the case in Palm Springs. It was honestly such a treat to watch when they were both on screen together as they completely stole every scene - one in particular in the second act in a bar (you'll know!).Now, is this the funniest film I've ever seen (most definitely in 2020)...no. It's doesn't change the game with hilarious out loud laughter but it does have its moments. And we've established how amazing the film is having Andy and Christin occupy most its key scenes, BUT the supporting cast - most notably the presence of J.K. Simmons - is just icing on the cake. As I mentioned in one of my previous posts, J.K. Simmons is one of my favourite actors working today and if you don't agree, simply watch 2014's Oscar nominated Whiplash - it will change your opinion.One thing I should mention in case some of you may be thinking of watching this film with your younger children or even your parents - Palm Springs is a HARD R rating! And by no means is this a bad thing - look at some of Judd Apatow films - just wanted to give you all a heads up. Drug and alcohol abuse, and some heavy sexual content are present throughout - you'll see in the opening scene of the film. I believe this is done intentionally to let the audience know then tone of the film and nature of some of the humour and that it doesn't hold back any punches!As of right now, Palm Springs has easily cracked my top ten favourite films of 2020 and it is most definitely a must watch in my opinion. If you're not particularly fond of romantic comedies, you may miss why I love this film so much. But if you're like me, and can appreciate a light-hearted 90 minute time-loop journey to happy-town - you are going to enjoy this film as much as I did.Sorry, there are no cameos or performance from Loney Island - disappointing I know and a huge SPOILER ALERT!"}, {"id": 106, "text": "This is the kind of movie that just puts you in a good mood. As long as you're not one of these grumpy, wanna-be critics that can't enjoy a movie for what it is. Every movie doesn't need to be ground breaking, cinematic gold."}, {"id": 107, "text": "Watching it for the 3rd time in ONE day! I probably haven't done this since 101 Dalmatians circa '93. I'm addicted to this movie! I also really appreciate the soundtrack- Especially great in headphones. Thank you to all who created this movie- it's perfect and I'll love it forever!"}, {"id": 108, "text": "Palm Springs is a worthy movie to mention alongside Groundhog Day. It's got a lot of similarities. It's funny, more a vulgar type of humor which is great because it gives the movie it's own identity. The characters feel like they're real people who act like you would think a lot of people would do if there really was 'no tomorrow'. Exploring both the good and bad feelings the characters have about their unique reality. The love story also feels genuine. Honestly I didn't expect this movie to be any good but it far exceeded my expectations. One of the best movies of the year."}, {"id": 109, "text": "Uses the time loop trope in creative ways and is both funny and emotional."}, {"id": 110, "text": "Yes, the time-loop premise has been done over and over again. However, this still was funny, interesting, and well written. Also, it did keep me guessing, and ofc the acting was terrific. A feel good, perfect amount of cheese Rom-com."}, {"id": 111, "text": "Yes, it's an indie rom-com, which is the worse combo of genres imaginable. But with ingenuity, humor, sincerity &amp; as many surprises as a clip show of Shyamalan endings, Palm Springs should be the sleeper of the summer. With Samberg &amp; Milioti soaring, it's an honest look at a relationship from every side, what it looks like when people grow apart, and is it worth ending a relationship for the promise of comfort. A beautiful capsule of what marriage should be."}, {"id": 112, "text": "I've long decried the quality of streaming-only platform films, which are usually high budget but low quality. The expensive mistakes bought up by streaming services from big studios desperate for any new content, or made by the streaming studio itself.This movie is not those movies. I really enjoyed this film! It was entertaining throughout, I cared about the main characters, I dug it.I actually watched it two times, I haven't said that about a film in ages, let alone a Hulu film.It has minor, forgivable flaws. I'd probably normally rate it 7-8 / 10, but compared to what's out there right now in the film world? This is a solid 9 all the way."}, {"id": 113, "text": "Such a fun and entertaining movie. Great chemistry between Andy and Cristin. I highly recommend. This was a much needed movie in these crazy times."}, {"id": 114, "text": "Somebody finally reinvented Groundhog Day. I sat through Edge of Tomorrow, Love, Wedcing, and Repeat and Before I Fall only to realize it was for the Lonely Island to master. Milotti and Samberg play off another beautifully while the amazing JK Simmons is great as usual. Also this screenplay was ridiculously clever."}, {"id": 115, "text": "Great movie. Funny and creative. Great acting though"}, {"id": 116, "text": "As many of us have been stuck in quarantine over the past three months, reliving the same boring day over and over, Palm Springs couldn't come at a better time. What makes film work is that it's a blend of the familiar and the new. Basically, movie is just another Groundhog Day, but tonally, the comedy here is much more in line with a more Millennial, crass brand of humor than the Boomer-produced Groundhog Day. At the end, Palm Springs is entertaining enough no mater there are some slower moments. For me, it wasn't the best time loop movie ever made, but my wife and I did enjoy it on a lazy afternoon during 2020 pandemic.Rating: 7"}, {"id": 117, "text": "What will happen if two wedding guests get stuck inside a time loop?! Hulu's Palm Springs delivers that answer perfectly in it's beautifully written and thoroughly engaging rom com that shows you how endless the possibilities can be along with the powerful performance from both the actors and the director."}, {"id": 118, "text": "I kept waiting for this movie to shyte the bed, and it just refused. I REALLY enjoyed this ride.As I neared the end, I was almost anxious wondering how they were going to wrap it all up. I realized immediately that ending a movie like this was always going to be problematic, but they did a good job, and it did not take away from an otherwise great experience.I watch movies with the intention of laughing, crying, and laugh-crying, and this movie delivered on all counts.A final quick note, I absolutely love Groundhog Day-ish movies, but so rarely are they done well. This one delivered."}, {"id": 119, "text": "After watching the trailer, I thought it'll be the same time travelling thing again like GroundHog Day or any other time loop movies but this was much more.Even the feels and how I felt that it's more than a venue but a comfort zone and what do you do with it.By the end, I was smiling so wide due to everything that happened and what the characters represented."}, {"id": 120, "text": "This movie is sheer happiness! First of all, Samberg and Milioti's chemistry was impeccable. Their team up was so genuine that I'd love to see them more in projects.This is perfect for casual viewings, or even movie marathons (just not with your parents). There are several movies with the idea of being stuck in an infinite loop timeline but none of them can compare to how this movie delivered itself."}, {"id": 121, "text": "This was a tremendous film that I expected to enjoy, but certainly not this much. It is a time loop film, similar to Groundhog Day, if he had someone to spend eternity with. The wonderful aspect of this plot is that they expand more on the rules of the time loop and its capabilities. While full of comedy and laugh-out-loud moments, I found the romance and drama realistic and relatable. Some parts hit hard and made me feel extreme happiness or sadness. Lastly, Samberg and Milioti are tremendous leads, but JK Simmons blew me away with his surprisingly zany comedic role. This film is full of pleasant surprises and from what I thought would be just a fun summer comedy, turned into my favorite film of the year."}, {"id": 122, "text": "The time loop genre has had plenty of submissions since Bill Murray kept waking up in the same cold northeastern town on the morning of the same cliché day. Palm Springs and Groundhog Day share very little except for the core concept, and each are classics in their own way. Samberg and Milioti stuck in the loop together gives us laughs, great energy, and thought-provoking scenes, and while it's not the perfect movie, it's destined to be a repeat watch for fans of the genre. And it's also unintentionally a visual anthem for the time in which we're living, so you might as well watch it over and over and over."}, {"id": 123, "text": "Let me just say that this movie was ok at best. But it is no where a 7.5 rating film. It's a 5 at best. There was nothing outstanding about the story, the cast or the climax. The over the top positive reviews are nothing but possible Samberg groupees flooding IMBD with delusions of grandeur fake reviews. The best time loop film of all times is and always will be Groundhog Day. And let me just add, not to give the only African American any lines in the scenes (except for about three words) he was in is just the absolute worst."}, {"id": 124, "text": "Yes we've seen the premise before, but the 2 main characters had a pretty decent chemistry during the lunacy of the first half and the rom-com genre of the movie was following a logical path. Then all of a sudden the female has a split personality attack and becomes a real party pooper with any connection between her and the guy completely lost from that point. She just behaves like she couldn't give a rat's about him. Then right near the end, split personality flips back and she says she loves him too, but it just doesn't work in the storyline because of her ambivalence towards him in the previous half hour. It just sounds odd. Surely they could have written a better script. Did the writers just run out of ideas?"}, {"id": 125, "text": "I'm a big fan of both Cristin Milioti &amp; Andy Samberg to start with so this was an easy choice for me to watch... While I enjoyed the film, it just felt like I was watching a rehashed version of Groundhog Day.The chemistry between the two leads was good and it certainly had its funny moments along with great side characters especially in Roy (J.K. Simmons).I just couldn't help but compare it to Groundhog Day. I wouldn't buy it on DVD/BRay but if it was TV I'd probably watch it again."}, {"id": 126, "text": "Modern comedy that lives between fantasy and mystery. During the movie the viewer remains intrigued and amused at the same time. It is strong the awareness in the plot that we live in a world dominated by lies both by those who govern us and by the members of our communities to which we belong. The plot mocks the lives of its participants, and in order to be saved, they have to be themselves totally. The main actors are excellent like the other members of cast. Photography and images are perfects, the lights are wonderful and the music hypnotizes. This product represents one of the best messages of love in recent years. Not to be missed."}, {"id": 127, "text": "I gotta admit, when I got to the point of the movie when the time loop was revealed, I was so frustrated. Seriously? Another one of these? but I kept watching it because I love Andy Samberg, and I was pleasantly surprised! Funny, sweet, honest, existential, this movie had my eyes glued to the screen. Each scene adds another layer of excitement and the writing of this film definitely keeps audience satisfaction in mind! If you're a Samberg fan, you won't be disappointed! And if you're not, I still say give it a go!"}, {"id": 128, "text": "Long time I didn't have fun watching a movie. This one far from perfect is pure entertainment. First, even the story is weird and not original, the execution is almost perfect. The setting and scenarios are fantastic. Second, two main actors are great. I didn't know much about them but they do a great job. Last, the movie is quite funny even sometimes cheesy. So, overall a pretty good option to have a good time."}, {"id": 129, "text": "First, I had no idea how good Samberg was. The guy is an incredible actor.Hollywood, take note: 99% of the woke trash you've been putting out would be Straight to DVD without streaming. This, on the other hand, was original, clever, funny, tight, and just plain entertaining af. 100% MEMORABLE QUALITY."}, {"id": 130, "text": "This picture is a masterpiece. Every thing in this movie is amazing. I liked it a lot"}, {"id": 131, "text": "Wonderful, loved every minute - and have already watched it again. Don't tune in if you need to be depressed, it will disappoint."}, {"id": 132, "text": "Great movie wish it was longer, i thought it was going to be a TV series"}, {"id": 133, "text": "I loved this movie, it was really funny and the story was tolerable. I was expecting a corny movie because most Sandberg movies are pretty corny, but I enjoyed it."}, {"id": 134, "text": "Not what you might think. Give it a shot. If you don't laugh or smile during this experience, you're a monster."}, {"id": 135, "text": "I don't usually love these kinds of movies and I am snobby about comedies, but this movie was fun and heartwarming, with a lot of funny parts. The actors had such great chemistry and it was creative. It was a nice surprise."}, {"id": 136, "text": "I'll keep this short. tl;dr: Its great. Its funny, its relatable, easy to watch but still packs a punch in the message department.*MAY BE SPOILERS BELOW*Palm Springs is an incredibly funny and human movie. The main characters are two broken down and flawed individuals who click through cynicism. Essentially, these appear to be actual people and not idealized lovers. What follows is an interesting take on the age-old question of the meaning of life.The creators' answer is not delivered in some ultra-cheesy and in-your-face package as per usual. Instead, what is realized is that little else matters outside of the relationship of the characters."}, {"id": 137, "text": "It's like an updated version of Groundhog Day. But it didn't feel like a half assed rehash.Adam and Cristin are fantastic. This is a great rom-com too. Music brought me in but didn't seem forced. Felt at times like Donnie Darko too, which I liked. Beautifully shot and paced too.My only gripes are too much swearing and ocassionally unoriginal swearing or contrived swearing, and the animals at the end. The only way they could've been there is if they went through and they are WAY too big. But the animals were so awesome an affectation I didn't care that much.Watch this twice in a row and get twice the movie."}, {"id": 138, "text": "Good performances from Andy Samberg, Cristin Milioti and J.K. Simmons, the pacing is great never once wastes its' 90 minutes, but the overall premise is not as clever as the film thinks nor it is not as clever other reviews make it out to be."}, {"id": 139, "text": "This was an ok movie An ok movie to spend time if you are watching it for the first time ! it is a groundhog day in a different perspective, you could and would watch groundhog day anytime again but not this movie ! good enough to enjoy but not good enough to watch again !"}, {"id": 140, "text": "A purified blast that I totally didn't expect! I love time loop stories especially when they are as well done and captivating as Palm Springs. This movie makes me appreciate Andy Samburg more. I'm glad this wasn't as bland as others with similarities, it's quite enjoyable and bizarre! Quantum physics involved as well which is my jam as a aspie!"}, {"id": 141, "text": "Palm Springs is an incredible comedy that's heartwarming, emotional and extremely enjoyable whilst also managing to put a fresh spin on the Groundhog Day premise. Andy Samberg and Cristin Milioti are both perfect with phenomenal chemistry and J.K. Simmons is an absolute scene stealer. It's consistently really funny and inventive. Max Barbakow's direction is fantastic, it's well filmed and expertly paced. The music by Matthew Compton is excellent and the soundtrack is great."}, {"id": 142, "text": "Okay, if you clicked for spoilers, I'm going to assume that you've seen the movie already, that's who this is meant for.You really can't talk about Palm Springs without at least mentioning Groundhog's Day. The premise is undeniably borrowed, but by the time you find that out it is already clear that Palm Springs is on its own trip through the scenic loop.The actors are pitch perfect, but the story is where the real magic is. The not-unique premise gives rise to some very intriguing philosophical exploration. If there is not, and can never be any ultimate consequence for anything one does, what does one choose to do?You party like there's no tomorrow ('cause, well, there isn't). You enjoy the time you spend, even in the face of knowing that your time is not limited, but it is still precious. You don't bring about harm. Pain is real.Also, there is nothing worse than dying slowly in the ICU. I feel that message is not intended only for time-loopers.This film is so much fun on its face that it's easy to look no deeper, but if deeper you look, deeper you go.On second viewing, I became almost certain that there was a CRUCIAL plot-point that was never exposed. Ready? Sarah didn't just get caught in the loop. Nyles did that, very deliberately, although it's not entirely clear that he knows it.Watch the wedding toast, and tell me Nyles isn't saying every word for Sarah alone, to welcome her into his world where she (and Roy, I guess) will be the only other real person for Nyles. At a level so deep that the actual wedding is utterly trivial in comparison, Nyles and Sarah are entering a partnership that is more exclusive and more enduring than any marriage.And here's the kicker. When Nyles says to Sarah, Don't you kiss me! it's cute and playful, and he knows better than anyone that she's for sure going to kiss him as a result. But then five minutes later he's shouting to Sarah, Don't come in the cave! Again, she defiantly does the opposite. Is Nyles *actually* surprised by this? Is Nyles surprised by *anything*?There's room to read it either way, but that's some very convincing evidence."}, {"id": 143, "text": "I was hoping this was going to be good but was worried that Andy Samberg may have been one bad movie away from becoming thought of as another Adam Sandler. Luckily he's had the opportunity to consistently show his range on Brooklyn Nine-Nine since 2013 and completely delivered in this film. With a really effective opening showcasing the type of humor and emotional journey he would find himself on and a female lead who did a perfect job showcasing the character's multidimensional and realistic personality. I was taken on an emotional journey with a familiar rom-com formula but fresh and enough character development to keep it interesting. I was also a fan of the shifting perspectives as it was not overdone and happened at the perfect times to give the characters time to breath and let us empathize and understand both. It took a sub-genre and familiar premise and was able to stand on its own as an outrageous comedy and emotionally driven sci-fi flick."}, {"id": 144, "text": "This movie really blew my mind the moment I realised the actors and the story behind the screen. The title is a really misleading common name, making you think it's a B or C movie. But this was a total A+. In a moment where you have nothing at all to see at theaters, to have something that would be awesome even if it was filled with other blockbusters, is an extra surprise. But whoever came up with the the title needs to get a better job."}, {"id": 145, "text": "The plot is about a man and a woman falling in love while living the same day over and over again, but really- it's about depression and loneliness in the modern age.. the feeling you can't escape who you are, and the love that can help you through it. Andy Samberg was never better: sad but hopeful, depressed but ok with it.. I loved this movie and its message about being alone and together.."}, {"id": 146, "text": "Palm Springs was a surprising comedy that had a succesfull watch,i mean i didnt laughed once but it was still a good watch,that is due great chemistry between our leads and some interesting take on a story that we saw being played in a lot of films,the most famous one is defienetly Groundhog day but there are also Edge of Tomorrow and Happy Death Day and even if i liked that films more then this one,Palm Springs was still a satisfaying watch,Adam Sandberg was good here and his character was corky and fun to watch,J.K.Simmons was also very good in his small role but he was still able to steal show,Palm Springs was one of better romantic comedies that i saw entire year"}, {"id": 147, "text": "The movie was good but I couldn't help but notice the similarity between this movie and the movie Happy Death Day."}, {"id": 148, "text": "Watched this not knowing the story line. After five minutes, I thought damn, another poor Groundhog Day rehash. Lucky for me I stayed with it, and it turned out to be a really good movie. Funny, romantic and sad, this movie has a lot going for it. A Definite thumbs up from me."}, {"id": 149, "text": "Really good movie, It was really fun and the concept was interesting, you might think that there are a lot of movies like this already out there but this was unique and i really loved it. I would say it's a waste of time if you don't watch it."}, {"id": 150, "text": "I just watched this with my friends. It's a great movie to just let go of all of your struggles. It has a lot of funny moments that actually get you to laugh instead of make you hmm that's funny like some movies do. Goes into a bit of philosophy and nihilism which was nice. Overall a good time"}, {"id": 151, "text": "During the movie you constantly think why aren't these people doing bad things? Crazy bad things? But at the end of the day Miles is a good dude , his nihilistic demeanor is a defence mechanism and he genuinely doesn't want to hurt anyway to be happy. I think throughout the movie you're gonna get jealous of how lighthearted and genuinely nice niles is , because I did and I know I'll never bebas happy or as genuine as he is but watching him felt good. I'm not one for happy endings but man , this won my heart. The soundtrack is great and the cast is too. HIMYM really deprived us od more Cristina milloti. Cami mendes was one of the reasons I saw it too and she was great. Roy was amazing. Watch this for a genuinely good rom com , your hearts gonna feel full finally."}, {"id": 152, "text": "You think it is going to be Groundhogs Day and then, BOOM, it is anything but. This is a fun story, and doesn't run outta steam, which is a huge accomplishment given the premise of rinse and repeat. Great story. Super fun to watch. Please don't do a sequel. It will ruin it."}, {"id": 153, "text": "This movie is the most inventive Romcom that's ever been made and I want more like it from The Lonely Island. They avoid tropes altogether, the conflict makes sense and it's a twist when you find out what the female leads issue is, the reason behind the loop makes sense from sci Fi standpoint and the ending is sooooo satisfying. The characters are well written and well acted and their reaction to the situation they are in makes sense. You should watch this movie, my fiancee and I are watching it for the second time in 24 hours."}, {"id": 154, "text": "I enjoyed it. Lots of fun. My wife watched a sci-fi movie and I watched a rom-com. We both suffered just a little bit. Win win. Kind've like Passengers meets Groundhog Day."}, {"id": 155, "text": "Watching Andy Samberg dance over to Cristin Miloti sets up a Groundhog Day inspired film where you know there's going to be plenty of chemistry between the 2 stars. This particular flavour of quantum mechanics stuck on repeat brings plenty of its own ideas that makes for a fun love story that is well written and highly entertaining."}, {"id": 156, "text": "We have already seen all this before in another movies such as, Happy Death Day and Groundhog day. As well as Netflix's original TV Series titled Russian Doll. However, watching Palm Springs was an enjoyable and an entertaining experience. Despite the fact that the plot of the movie is similar to the ones mentioned above, it is unique in the way of presenting a very unusual love story that I really loved."}, {"id": 157, "text": "I laughed!!! I cried!! Kept me in suspense... kept me engaged!!! Such a good movie!!"}, {"id": 158, "text": "My friend recommended watching it without looking it up and she was right. I think it would have taken from it if I had some idea what it was about; if nothing else because I would have thought it would be just a repeat of something that has been done too many times. So this came as a good surprise as the clever writing and great acting is making this a super fun ride I highly recommend if you're in need of some good entertainment!"}, {"id": 159, "text": "It's December 2020, and I finally got around to watching Palm Springs. It was released earlier this year and has been on my radar, but because of the pandemic; time has lost all meaning...it's the perfect movie for this year. (Hard period)If you've reached the end of all shows you've ever wanted to watch and still haven't seen this one, you won't regret giving it a try."}, {"id": 160, "text": "Because Lonely Island is involved the comedic moments hit hard, accurately and often. But it also takes you unawares when it asks the question. What would you do if you were stuck in Groundhog Day? What would you do if life lost all meaning but you could not die?"}, {"id": 161, "text": "Palm Springs is a good sit down watch movie. If your bored, drunk or even high this is perfect to watch. The actors do a great job and Andy samberg and J.K Simmons really work well together. It was funny and heart warming. The ending did feel a bit underwhelming But it was fine. Overall a fun film"}, {"id": 162, "text": "I don't know if it's just me but apart from the story it had such relevance. Beautiful depiction of reality in a fascination."}, {"id": 163, "text": "The story, script, acting and message are amazing! This is my new all time favorite. It's best to watch not knowing anything about it. This is a spiritual film without being one. So much thought and intelligence went into this movie to express what really matters in this life. Bravo!"}, {"id": 164, "text": "One of the year's best romances. Seamlessly blends romance, comedy, science fiction, and heart-wrenching emotional drama."}, {"id": 165, "text": "The movie's idea is so clever , amazing and so simple. It's fun and hilarious. It's got great acting. It has FANTASTIC story line. The movie is just done so well. LOVE IT !!!!!!!!!!! 💯💯💯💯💯💯💯"}, {"id": 166, "text": "Everything about this movie worked for me. From the way it handles the time loop premise to the chemistry between the two leads, this movie just works. It also packs a surprising emotional punch that I didn't expect going in. Palm Springs definitely lives up to the hype."}, {"id": 167, "text": "I've never been a huge fan of movies like Groundhog Day or Happy Death Day where the characters are caught in a time loop of the same day. I like both of those movies just fine, but I do find the repetition a bit tedious. This movie has that same theme of characters stuck in the same day, except it never felt overly repetitious. It's very funny, and it's actually a pretty sweet romance. Highly recommend."}, {"id": 168, "text": "Actually never wrote a review for a movie. So, basically, the concept is kinda like Groundhog Day, BUT, with a twist! It's very entertaining in a ADULT way, without the stereotypical American style (like supermuch sex and cringe lines). It's actually sofisticated, somehow, and makes you realize the importance of your own relationship (maybe) and also concider the fact that you're no longer 16 years old and that the world is different now."}, {"id": 169, "text": "Great time loop movie. Such a good plot. The ending was perfect."}, {"id": 170, "text": "A unique rom-com with a fun premise and great performances all around."}, {"id": 171, "text": "Loved this movie! A must see!That's all there is to say."}, {"id": 172, "text": "It's perfectly light hearted, funny, sweet, creative but still makes you think. Definitely 1.5 hours well spent. I enjoyed the colour scheme of the filming, very bright and fun.Andy and Cristin have really good chemistry. They are such a joy to watch (and Andy Samberg looks so cute in it!).However, some character's transition is so sudden and unexplained. For example when Sarah suddenly gets angry at Nyles and becomes a physics expert. Or when Roy suddenly becomes this wise forgiving man (He's so good in it!). Also would love to see more of their life after the loop. I guess I just wish the movie was longer to give the story justice (or I just wanna see more of them)."}, {"id": 173, "text": "It was just a mind blowing concept and I loved it."}, {"id": 174, "text": "It's not the funniest movie but at least it's unique. Effective for what it is."}, {"id": 175, "text": "I really enjoyed it. Great pacing and kept my interest. It was fun. Decent quarantine movie."}, {"id": 176, "text": "I shut it off after 20 mins. Obviously the makers of this movie don't realize that you need to hook in the viewer early if you want to keep their attention. Maybe if the actors were better I would of stuck it out."}, {"id": 177, "text": "This movie was a lot of fun!!! I laughed and smiled throughout the entire film. It was a nice surprise."}, {"id": 178, "text": "There were some likable scenes scattered throughout, but the overall premise was.... who knows? The repeated day thing has been done before, we all know that. Here, they drop into the loop for some mystical reason, but physically blast there way out -- meaning there was no higher power or test involved, just random hardship. Some good acting but as they say, hampered by a weak script."}, {"id": 179, "text": "IMDB lists this film as a comedy romance. Well, I can see the romance part but a comedy? No. In fact, the film, despite starring Andy Samberg, is certainly NOT a comedy nor is it funny....and I really don't think it was intended to be.The film is a reworking of the basic concept in Groundhog Day...a guy (Samberg) keeps repeating the same day again and again and again. The big differences are that others CAN get stuck in this same time loop as him and it's just not funny nor sweet like Groundhog Day. In fact, although most reviews are very, very favorable and it has an overall score of 7.5, I didn't enjoy it very much. Part of it was that I never liked the characters and part of it was that the film, at times, was dark and bleak...and unnecessarily crude. Overall, a film many like...but I felt underwhelmed."}, {"id": 180, "text": "Very meh. Maybe a laugh or two. Terrible people get to continue doing terrible things without lasting consequences. Wash, rinse, repeat."}, {"id": 181, "text": "This movie is the combination of my favorite actor Andy Samberg, time science, and my favorite movie. I really enjoyed it. It's simply a great movie."}, {"id": 182, "text": "Although its formula and plot isn't incredibly original, Palm Springs more than proves itself to be a lively, hilarious, and surprisingly deep dramedy to follow up the likes of Groundhog Day and repeating day films of the past. Andy Samberg and Cristin Milioti lead the cast for this wonderful film, and both provide quite excellent performances in their roles, and honestly perfect casting for them. The film doesn't seem short, but seems to use its time to the best of its advantage, and it truly feels like you are in the journey along with these characters, even with the film only clocking in at about 1hr30min. The film is written quite well surprisingly, and never feels tedious, or boring, or in anyway repetitive. It makes the best out of its familiar formula, and provides quite an interesting story and interesting characters to follow. Never would I have expected so much from a Hulu Original film, and I'm hoping that Hulu continues its streak of brilliant dramedy like films for its service. My Rating: 9.5/10"}, {"id": 183, "text": "Such a fun and interesting movie. Andy Samberg absolutely nails it and Cristin Milioti is incredible. 10/10"}, {"id": 184, "text": "Has classic template for Rom-com which I am not a huge fan of but the other stuff glows in this film.The chemistry between the 2 is so great, that night scene with dinosaurs felt very real and emotional, I actually cared about their relationship. But the ending of classic Boy-Girl separates and boy confesses for happy ending was a let down, too cliché for me.I like they went straight into the time-loop, didn't show us the beginning of time-loop madness but gave some flashbacks of more crazy things happening, 'tell not show', audience imagination is more horror.The movie doesn't explains a lot stuffs that I liked, where did the dinosaurs come from?? no one knows, the cast also never questioned and everyone went along with it. Even there are theories of that Nani also being in the timeloop.I liked that they told the story from multiple perspective of similar situation. The idea of Time-loop life with no consequences was executed greatly with montages of them just living the best versions of themselves.As a science nerd I was disappointed that there was longer expositions scene of the actress explaining how they get out, I know some of the scientists in the laptop scene. The actress was sad it was cut down, she tried her best to understand quantum mechanics. Thinking about it more, the goat disappeared from bomb blast but Nyles stayed for JK Simmons scene at end. Time travel movies always have these inconsistencies.JK Simmons was a great addition, the other cast were also great.The story kept somethings hidden from audience which was later revealed and I was really shocked, rewatching would be great as I did feel there was a lot of foreshadowing at the beginning.Comedy was fine, didn't laughed out loud majority of times, kept a smile on my face throughout the small runtime."}, {"id": 185, "text": "Keeps you watching with a unique, untold plot line."}, {"id": 186, "text": "Two types of people - one is having everyday the same and stable, another one is adventurous and live differently everyday. What if these two kinds of person encounter? The routine one never think of change until meet the another one. It's quite a thoughtful movie with all the sci fic elements included. Such repeating days theme been seen since 90s til recent happy death day but something special from this movie, and the level of meaning way better than those I watched."}, {"id": 187, "text": "Love the jokes and the acting was like good old american pie movies and the good old stuff, its was original emotional and funny at the same time, wish it would be longer. Dint watch the trailer and because of that was superbly surprised, the first 2 mins already i was laughing my ass off, the jokes where right my style, and the story had some strong twists. long haven't iv seen a comedy as good as this."}, {"id": 188, "text": "Boring, uninventive, loss of time. Done many times before without the boring philosophy around a white thread. Better watch again Groundhog day or Happy death day 1, 2"}, {"id": 189, "text": "I thought this would be a little like Ground Hog day but, it wasn't. If you want a movie about day repeating itself Go watch the Edge of Tomorrow or Ground Hog Day."}, {"id": 190, "text": "Even though the concept is nothing new, the approach had some potential. It might have been a better film, especially considering the cast, with a more clever screenplay. Instead, most of the lines fall flat and the story is forgettable, especially during the 2nd half. Chemistry never really takes off for the two main actors. Entertaining at best, if you have absolutely nothing else to do, on a weeknight."}, {"id": 191, "text": "It's puerile, but I guess 13yo boys might like it."}, {"id": 192, "text": "This is truly the most garbage movie I've ever seen. As a film student, I have no idea what this director was doing as he put this maseceure together. The shots are random and unmotivated, even for a comedy. I love comedies and Andy Samberg, but the writing is so awful. I don't see how a writer could be happy showing this to anyone, and the producers must of been so eager for a script that they couldn't recognize how terrible it is. The editing and sound mixing look like they've been done by amateurs. Besides the few creative cinematic shots and the three or four decent lines of dialogue, there's absolutely nothing good about this film and anyone who things this is great must have a very low intellect and appreciation of good films."}, {"id": 193, "text": "I thought it was really funny w samberg and that chick, the story was also intersting and made u think a little bit. BUT i wish they would have taken the old guy w/ them in the end."}, {"id": 194, "text": "The ideas, the love they share, most of the movie is what everyone has already seen a billion times. The acts are quite good, and some of the fun parts may make you laugh, yet I wouldn't waste the time to watch it again ever."}, {"id": 195, "text": "Talented cast but pointless, unoriginal, and truly uninspiring. I don't think anyone had fun making it, and no one has fun watching it. The epic amount of fake reviews on this one is shocking. The average for this in time will be 4.3, not 7.5. No one I know likes it or could get thru 15 minutes, and it's all industry people. Who is the exact audience for garbage like this??? Awful. Waste of Andy and Christina's time."}, {"id": 196, "text": "Ge can't act either and there is nothing funny or original about this movie. Waste of time."}, {"id": 197, "text": "...except without a hint of charm or humor. There wasn't a single joke in this, unless you call a man constantly drinking a can of beer a joke. I defy anyone to tell me one line from this movie that was noteworthy in the least. I think the writers thought that the protagonist wearing yellow surf trunks and a Hawaiian shirt during the entire film would be funny. It wasn't. Not even a little.Andy Samburg looks like he needed a vacation and just sleep-walked through this movie that appeared to be ad-libbed.I'm surprised that Andy Samburg made such a lackluster movie as he seems to be on top of the world in the entertainment business. Hire some decent writers. The writers couldn't even write a decent wedding speech, or a funny wedding speech. Cringe-worthy wedding speeches they can do. Once again, it just seemed that it was written by dudes who do nothing but watch TV. Find people who have read a book or two or who have travel. Someone with a bit of life experience.Where Groundhog Day had the clock hit 06:00 and the Sonny and Cher tune on the radio, this one just has a voice whispering Wake up. It is impossible not to compare this with Groundhog Day as this movie completely plagiarized that now-classic film from 1993.There is nothing they could explain about a character to excuse the fact that she slept with her sister's husband-to-be the night before the marriage. I can't think of many things worse and more psychopathic. Maybe the Green River killer. Hannibal Lector would shudder at the thought of such a horrible crime.P.S. On a side note, weddings are all horrible, at least in my culture, and by my culture I mean America, and Europe. Maybe there is a culture in which getting married doesn't come along with a ton of misguided traditions reflecting something from out medieval past and women as chattel or whatever."}, {"id": 198, "text": "These kinds of movies where its all filmed in on elocation and drags on and on about nothing that matters to anyone or thing. yawn yawn and yawney yawn yawn. dat girl is smokin though"}, {"id": 199, "text": "What if someone else had been stuck repeating the same day with Bill Murray? This is the premise behind Palm Springs, which adds a fresh perspective and allows some interesting emotional themes to be explored, making for a funny and sweet film."}, {"id": 200, "text": "Or is it? Sometimes you can't tell. Also while this is reminiscent of a Bill Murray classic, it does not contain the moral lesson. At least it is not meant to be taken that way. Doesn't mean there is not good things happening and characters developing. It just not as attached to the story or rather resolution as the Murray movie was.Having said that, this also is more in the R-rated territory. So while it has some nice moments, it also isn't afraid of pulling punches. This is really funny and the two leads give it their all. Even JK Simmons who's barely in it, is as grounded (no pun intended) as he always is. But it is about the chemistry of the two lead actors and it really translates more than well. Brooklyn 99 fans and/or Lonely Island fans don't need me to tell them this anyway. Yes he also did SNL, which seems ages away ... comedy is his thing, no doubt about it."}, {"id": 201, "text": "Palm Springs is the latest from Andy Samberg and I just can't get exactly what it is the makes him and his roles so charming and relatable. I've been a fan of his work since the Lonely Island music videos and continue to love his work in Brooklyn nine-nine, Samberg has an aura about him that's so 'ordinarily friendly', making you care about his character no matter his role. In Palm Springs we get to see him in a film that is a joke overdone, the 'Groundhog day' trope isn't the first of its kind and won't be the last, we've seen this again and again in cinemas and on TV, yet somehow they've pulled it out of the bag with this one. All the pieces just fall into place with this one, rendering the premise much less important because of just how well it executes on the jokes and heartfelt moments alike. While the film doesn't do anything unexpected it simply brings a smile to your face as you reminisce in the charm and lightheartedness of the film."}, {"id": 202, "text": "Great cast, neat idea. It was entertaining for sure."}, {"id": 203, "text": "This movie was just fun. Andy Samberg always has really funny, crazy entertaining movies. Palm Springs had some depth to it. It's a modern day Groundhogs Day. I really like the movie, I feel like both lead roles played perfect off each other. 8.4"}, {"id": 204, "text": "I don't like rom coms that much, but this stands out to me since it doesn't use the same recycled garbage.The lead actors have chemistry together in this film. They're not some cliche hot couple but a couple normal people.It's got some good humor, I laughed a few times."}, {"id": 205, "text": "Honestly one of the best movies I've seen in a long time. The writing is fantastic! I loved every minute of this movie and the color palette is amazing. Perfectly cast. I can't think of any way this movie could be better. It really takes you on a full journey. Recommend this to any rom com lover"}, {"id": 206, "text": "If you liked Groundhog Day, Edge of Tomorrow, or Star Trek - Cause and Effect, you will like this.Other reviews have praised the movie so do not want to repeat that."}, {"id": 207, "text": "This movie is a good watch. The style is a little different to what I was expecting and more in the art house style, but it's done well and I really enjoyed it."}, {"id": 208, "text": "Just watch it! Just enjoy it! A breath of fresh air in a time where we grasp at any piece of good entertainment we can."}, {"id": 209, "text": "Love this movie so much and was anticipating it since I love the lonely island but was amazed by how funny their writing was and also by how much it differs from their usual work, which consists of crude jokes and punch lines involving swear words (although there is still a huge amount of swearing in this movie)Highly Recommend to anyone 14+"}, {"id": 210, "text": "There are some scenes which could have been done better (important reaction scenes involving emotion) where Andy flat lines it, but there are also some scenes where he does better than most current actors... Andy Samberg, Cristin Milioti, and JK Simmons all carry the film with charm. Directed and cut together energetically."}, {"id": 211, "text": "Groundhog Day redone just right. .............................................................."}, {"id": 212, "text": "At first I was worried that it would be just like previous films that have the concept of repeating days. I felt like this was a fresh take on the concept with two people going through it together and finding love. It's a new fresh romantic comedy which is really nice to watch. The dialogue is super face paced and the characters are super endearing. It takes on a ride and doesn't ever question itself about what's going on or how things are. The style is really fun and chemistry between Andy Samberg and Cristin Millotti is great. My complaint is would've liked more setup of Andy Samberg's lifestyle before she comes into his loop. Also more development of the relationship between the two that doesn't involve just a montage and why he falls in love with her. All and all a great film. One of the best of the year."}, {"id": 213, "text": "I certainly am not a fan of the generic romantic comedy, and the resolution to Palm Springs feels inevitable within the genre trappings, but along the way the film is clearly aware of its predecessors. It's not spoiling much to say that it's a Groundhog Day movie, which isn't a premise I find particularly interesting, but it recognizes our familiarity with the notion and thankfully speeds through the learning curve. Both leads are good, but it is Milioti who steals the show. Their comedic chemistry is excellent, and the script has some excellent moments playing off of their knowledge of the day and everyone else living it once. There are still some interesting existential questions in the purpose of life, repetition, and the depth of relationships. Some of the ups and downs, particularly in the third act, felt a little less fresh and more tropey than I like, but if you don't mind a generic easy resolution, you'll definitely enjoy Palm Springs. Snappy and funny, this is a good example of a strong romantic comedy."}, {"id": 214, "text": "I was very sceptical to watch another groundhog day. As i saw what is « needed » to be seen with this concept. But i gave it a try after seeing the trailer (funny details), and i wanted to watch a comedy. I loved it. Funny and also beautiful story.I really vibrated sometimes. I found the screenplay very good (still one bugging detail at the marriage but hey...). Acting overall is very good (essentially by the 2 mains of course). Best movie i saw with Andy Samberg. I love when science-fiction is a mean to a humane « morale ». This one was light and good. Give it a try if you hesitate."}, {"id": 215, "text": "I was smiling through the whole movie. Such an gem!"}, {"id": 216, "text": "I won't tell you how it ends, but I will say that #andysamberg and #cristinmilioti are delightful together."}, {"id": 217, "text": "Palm Springs is a kind of film that you don't need to be very technical in order to appreciate it. Palm Springs simply relied on a plain plot that everybody won't expect to be engaging and extraordinary but the film managed to add flavors to the time loop conflict so the viewers can have a mesmerizing experience for 1 hour and 30 minutes. The application of romantic-comedy element was nicely done and a very little touch of sci-fi made the turning point more interesting. Palm Springs is one of the few good things happened in 2020 cinema and everybody may find hard to not like the film."}, {"id": 218, "text": "Fun and entertaining. I very much enjoyed it. Science in the movie was not bad, fun stuff. Has some good morels in there if you catch them"}, {"id": 219, "text": "Okay, some funny lines and twists, if you enjoy it watch Russian Doll, that does the Groundhog Day theme best."}, {"id": 220, "text": "Where there is Andy Samberg, there is laughter. Loved the chemistry between him and Cristin. Beautifully shot movie. Very enjoyable and fun to watch if you don't try to dissect everything prodigiously. Pleasantly surprised by how good this turned out to be."}, {"id": 221, "text": "The movie is unpredictable and doesn't give into tropes, the cinematography was good nothing really to say about the acting, I love the stylization in this movie, I'm surprised this movie isn't labeled a romance movie because it pretty much is, I would recommend"}, {"id": 222, "text": "With the blend of slight comedy, love story, brokenness, sci-fi and a funny loop, 'Palm Springs' is a treat to a summer movie night/day."}, {"id": 223, "text": "Palm Springs doesnt do a lot of things he havent seen before, but at least it doesnt take itself too seriously. The chemistry between the leads is great and the oscar winning J.K. Simmons is a great addition too.The theme of time traveling will probably never get old and its also the engine of Christopher Nolans blockbuster that everyone hope is going to save the cinematic 2020. Here we see a cardboard version of the scale and action in Tenet. For everyone that thought its too fast paced and demanding here's a more laid back and unassuming movie to pass the time."}, {"id": 224, "text": "I'd suggest watching this movie without any clue about its plot (avoid the trailer). It feels like the classic movie to watch on a summer night as it is a rom-com. It's been a fun vision with a lot of interesting things like directing style, hilarious scenes, soundtrack (!!!) and main plot. Also, chemistry between main actors is very good and you can tell that by watching the inverviews they had in various festivals. Overall I think this can be a solid candidate as the best comedy movie of the year. Watch it and have some fun :)"}, {"id": 225, "text": "One of my favorite movies was Groundhog Day. I was unaware that this was a time loop movie going into it. I was about to turn it off but something stopped me . It was when Adam Samberg seem to know every move of everyone else's actions before it happened. I thought to myself, wait a second,  is this a time loop movie?  So I stuck around. And it was definitely worth it. I laughed, I danced, I even shed a tear hear and there. I wish they would of spent a bit more time developing the characters as they did in Ground Hog Day. Or dug deeper into a back story of how this loop started in the first place. At least The Edge Of Tommorow had Alien spooge that creates a mysterious time continuum. I think Adam Samberg should've Sharpened his axe just like Bill Murray Learn to play the piano, learned how to dance, and improved his game. At least make a reference to G.H.D like for instance....We're not In Punxsutawney. All in all, it's a pretty good movie and I recommend it. Piet Hoebeke 616.264.4214 A&amp;P Digital Media"}, {"id": 226, "text": "One of the absolute great movies that I have watched in 2020 Great characters and a very unique story Not funny hilarious, but good kind of funny"}, {"id": 227, "text": "A very refreshing take on the romantic comedy. The leads here are excellent. Andy Samberg and Cristin Milioti do an excellent job portraying these characters with imperfections who learn to love each other through a weird situation. They both have excellent chemistry as well which really contributes to romances in general. The other performances are all right except J.K. Simmons who I also felt was excellent here. The film has some issues in pacing and some of the effects but it's so investing and entertaining. Most time loop movies take themselves seriously sometimes with the exception of this and Groundhogs Day. Palm Springs understands how dumb these movies can be and goes out of its way to be funny and most of the time, the humor works. For a first feature, Max Barbakow knocks it out of the park with his direction. It's well written and well shot with plenty of interesting ideas about how we live our life and love. Check this out on Hulu when you get the chance."}, {"id": 228, "text": "I watched this movie twice and plan on watching it again. I recommend it to everyone. It is one of the best comedy's with heart I've seen in years. Even better than King of Staten Island, which was expected to be similar. But it's not. Thia movie is worth your time. Period. Watch it now."}, {"id": 229, "text": "Palm Springs is an enjoyable movie. But despite some delectable moments, It is more than just a fun movie. It tells us about the importance of accepting anything we have and make us laugh at life without making meaningless jokes out of it. Also, If you like Andy Samberg or Cristin Milioti, You will love this film."}, {"id": 230, "text": "The girl gets whammed and the other girl get her guy"}, {"id": 231, "text": "I thought this movie had a great twist on Groundhog Day to which I am sure it is an ode to. When multiple characters are caught up in the Back to the Future Time Space Continuum it really adds to the story. I really enjoyed the ride and thought it was a great movie. I am really not too sure what the dinosaurs added, maybe new beginnings perhaps! Bit overall a really fun movie."}, {"id": 232, "text": "This is the ole Groundhog Day film done again but they did it well. If you like Andy Samberg you'll like this, this is classic him. If you don't like him skip this. His co-star does a good job as well. It's not laugh out loud hilarious but I enjoyed it and I think most people would, good effort."}, {"id": 233, "text": "I loved this film from start to finish. Adam Sandberg is not one of my favourite comedy actors but in this he made me laugh with a stitch. First of all the story was written brilliantly, as well as having great actors to play the parts. Couldn't give it a 10/10 as it's not perfect but certainly a funny and enjoyable movie."}, {"id": 234, "text": "This movie isn't going to invoke any crazy emotions or change your life, but you 100% will not regret watching it. I'm not a huge romantic comedy person but I really enjoyed this one. It was a fun take on the genre, with plenty of funny and heartwarming moments. They could've done a better job with explaining the whole time loop situation, but that's not really what the movie is about. At the end of the day, it's a love story- but a fun one."}, {"id": 235, "text": "I honestly thought this movie was great and I would totally watch it again! I love both Andy (Brooklyn Nine-Nine) and Cristi (HIMYM) and was so excited to see them in a movie together. So glad I watched it!"}, {"id": 236, "text": "I will not talk about cast, acting, direction or cinematography because Rom-Com is all about mess. Coming straight to the point I didn't expect it to be a good film but it left me numb at the end. What a gem! Go people watch it! It's worth a shot! Thank you."}, {"id": 237, "text": "Yeah, this was pretty good. Had enough of a new twist on the time loop concept to keep it fresh. While at the same time using those twists (physics!) to force you to catch up, as in the Harry subplot, and Nyles' and Sara encounters. In that respect, I still don't get why Sara goes away for awhile after their arrest, then comes back. One minor complaint: when they do mushrooms. and Nyles sees... something. I could barely make it out. They should have made that clearer, increasing the effectiveness. Loved Samberg already. Miloti is a big-eyed beauty, makes the jump to lead. JK Simmons nails it again. Totally entertaining and fun. Big questions: Was this intended for theaters? (I think it would have done OK as a date nite movie.) And of course they can make a sequel out of anything, but will there be one? (I would like to explore the origins of that cave / time warp. Just please, anything but Palm Springs Too.)"}, {"id": 238, "text": "Always annoying when fans or film makers stuff the reviews with fake ones awarding it 9 or many times even a 10. Really...are the film makers so worried baout the movie ? Let it go. If it's good it'll stand the test. Particularly annoying are these guys who have never reviewed a movie in their life suddenly turn up to write one and award it a 9. No doubt soon, they'll hire established members to leave fake reviews - it's only a step away. The movie has good pre-release buzz...let it stand the test now.Don't muck it up guys!"}, {"id": 239, "text": "Boring as can be. I felt like I got stuck in two time loops watching this. Nothing exciting or original happened. Cristin milioti is cute though. I didnt plan on watching the whole thing but I wanted to see how they got out. Pretty underwhelming. I hate that I hate everything. The main character's name is Nyles which I think is short for Nyles-ism. Heheh get it? That's a better joke than most of them in the movie."}, {"id": 240, "text": "Story line of Happy death day movie with some crispy jolly Love.. Two times watchable for sure."}, {"id": 241, "text": "Perfect. Perfeito. Muito bom. Really good. Love it. Amei."}, {"id": 242, "text": "I had picked this for my daughter based on its sterling Metacritic (85) rating, well I suppose we can write off Metacritic as nothing but paid shills for Hollywood now. By far and away one of the worst movies I've seen in recent memory, all these glowing reviews should qualify their authors for an intense psychological evaluation.Boring, tedious, redundant, obnoxious, and amateurish snoozefest... I actually don't remember one single funny scene unless you count somebody being flattened by an 18 wheeler but I'd just call that karma. This is one to avoid at all costs, and no it doesn't work on a younger crowd either... maybe a much much younger crowd like under 10."}, {"id": 243, "text": "Was very excited about this movies because it features two of my favourite actors from TV...B99 and Himym...i thin they did perfect justice to their roles and made me laugh and smile at many different moments. The storyline was a fascinating concept and it was handled pretty great. I just thoroughly enjoyed the movie."}, {"id": 244, "text": "I love Nyles with all my heart, Sarah is OMG. The characters are perfection, the plot is enough to keep my interested and engaged without ever getting confusing. My new favourite movie, definitely a 10/10"}, {"id": 245, "text": "Can you believe this is the same guy who used to be funny on SNL? Parenthood has changed him for the worse."}, {"id": 246, "text": "But how in the world can anyone justify them not taking Roy (J. K. Simmons) with them when they leave? He had a light monologue about how he is stuck never having the opportunity to watch his children grow up, so they dont take him with them? I have to give this movie a thumbs down for that major plot hole in my opinion"}, {"id": 247, "text": "Very boring and unfunny movie, I couldn't watch it for more than 30 minutes. Probably for the younger audience."}, {"id": 248, "text": "Unfortunately the reviews don't do justice to this movie. It is just a spin to the classic Groundhog Day. Absolutely nothing new to offer. I'm astounded why people are liking it. Please tell me there are people out there who actually did not like it."}, {"id": 249, "text": "Don't waste your time..Do urself a favor .do anything but don't watch this shi....y movie"}, {"id": 250, "text": "The chemistry between Andy and the actress was good.The topic was interesting and funny.🙃🙃🙃"}, {"id": 251, "text": "It's rare to get a time loop film that is not repetitive, but full of fresh scenes from beginning to the end. The story is fun and it's enjoyable to watch."}, {"id": 252, "text": "I loved this movie. It is very original.not gonna spoil it for you so that's all I will say."}, {"id": 253, "text": "This 2020 comedy stars Andy Samberg and Cristin Milioti. Samberg (Hot Rod) plays Nyles, a slacker who lives in Palm Springs. Soon, he meets Sarah (Milioti), a beautiful woman who attends her sister's wedding and they find romance with each other while stuck in a time loop. This is a good flick, Samberg is amusing as usual and he &amp; Milioti have good chemistry. The film obviously imitates Groundhog Day with humorous, dramatic and bizarre moments. If you like romantic comedies, check this out."}, {"id": 254, "text": "Just like everyone has different taste and preference... I know that some will agree with me that Cristin Milioti is not straight up leading lady material even in HIMYM. Since most has seen this plot and twists before, it's really the lead cast that will give meaning to the journey of the story."}, {"id": 255, "text": "I saw the advertising on HULU and such and to be honest really paid it no mind. Just thought, uh that looks interesting. So after a long day of work I needed to relax so I watched Greyhound, which I'll write about later. Once that was finished, I ordered some Pizza Pipeline Cinnamon Tricky Stix and some Zestee Cheesy Bread. Upon arrival I thought, it'll be fun to see what that Andy Samberg and Cristin Milioti Palm Springs and OH MY GOSH! Right off the bat, this film delivers. You really think you know where it's going to lead, but it doesn't. It's such a refreshing and thoughtful film. In my top 5 favorite of the year."}, {"id": 256, "text": "Very mediocre copy of groundhog day. Bad humor is the biggest fail though."}, {"id": 257, "text": "A fun movie to watch, with a little bit of Groundhog Day mixed in, but why was it called Palm Springs? It wasn't filmed there. Palm Springs was never mentioned. And it didn't seem to have a feel for the old or current Palm Springs. I was waiting but it never popped up. :("}, {"id": 258, "text": "I read somewhere that Samberg and his other nihilist friends tried to make this film look like the wonderful Leaving Las Vegas. If you're attempting to watch it for this reason please don't.Samberg made me laugh once that was in Hot Rod when he said Whiskey in a funny way. Otherwise, he is a disgusting unfunny actor. Like most people of his generation he is without talent, well connected in the industry, and vile. And shame on you J.K. Simmons for allowing yourself to be in this I lost a lot of respect for you. Are you that desperate to involve yourself in this trash?I recommend watching real acting, stories, and directing by the likes of Leaving Las Vegas, Factotum, or Days of Wine and Roses, which show the actual truth of what happens when you walk down the dark road of alcoholism."}, {"id": 259, "text": "Saw the 7.5 rate here, thought it would actually be good, but it actually made me fall asleep before the mid of the movie. Cheap cast, dumb action, full of non-sense. The 7.5 rate is a total LIE. Don't waste your time with this movie!"}, {"id": 260, "text": "It may be well made but knowing that it is not original but plagiarised from Groundhog Day kills the joy."}, {"id": 261, "text": "Palm Strings is a comedy romance movie, in which you can see a combo of romance and comedy. it's storyline be like While stuck at a wedding in Palm Springs, Nyles (Andy Samberg) meets Sarah (Cristin Milioti), the maid of honor and family black sheep. After he rescues her from a disastrous toast, Sarah becomes drawn to Nyles and his offbeat nihilism. But when their impromptu tryst is thwarted by a surreal interruption, Sarah must join Nyles in embracing the idea that nothing really matters, and they begin wreaking spirited havoc on the wedding celebration."}, {"id": 262, "text": "Good popcorn movie. Just to watch when you don't really know what to watch. Nothing wow, not funny. It's a capable movie. And it has Andy."}, {"id": 263, "text": "I'm not a big Andy Samberg fan, but he was really enjoyable in this movie. Nice light watch for some time pass. Cute love story. I was delightfully surprised with this. Definitely a one time watch."}, {"id": 264, "text": "Another Groundhog Day kind of movie. Not a lot of difference between the two. It is funny in some parts, mostly early on in the movie. A little bit of cute romance, but not really. The ending was a complete disappointment."}, {"id": 265, "text": "You could compare Palm Springs with Groundhog Day (1993), this version is just a modern take of that classic movie but it's certainly as funny if not funnier. I liked both of the movies but I prefer Andy Samberg to Bill Murray. Bill Murray was more of a grumpy unsastified character whilst Andy Samberg has a more laidback-not-giving-a-toss character. It's not completely the same story though. Palm Springs has a lot of good humorous scenes, and Andy Sambergs usual funny face and expressions are contributing to that. Since Brooklyn Nine-Nine I'm a fan of Andy Samberg, he has everything to become the new star comedian. And even if his previous movie Popstar: Never Stop Never Stopping didn't leave me with a great impression this one is certainly a step forward. Palm Springs is for the fans of silly comedies, with a touch of romance, but it's not the typical romcom as for that the plot is also interesting to watch. There are elements that make it intriguing, things you have to think about. A comedy that I will for sure watch again in the future."}, {"id": 266, "text": "Such a good film, in a groudhog-esque style, great humour and great acting"}, {"id": 267, "text": "The first half of this movie is great lighthearted fun. It was the funniest / most fun first half of a movie I've seen in a while. However, it unfortunately falls into the trope of adding drama for the sake of conflict. This movie would've easily been a 9/10 had it kept up the fun of the first half and had the two main characters trying to figure out how to get out all while dealing with Roy. I also found that the dramatic portions were not as well written and had some questionable character development. I don't think the ending even made sense. So Nyles and Sarah make it out of the time loop and are chilling in the pool after having gone through so much together. Ok, that's nice. But then we get a scene where Roy shows up and Nyles doesn't recognize him? Why does he remember Sarah and not Roy?"}, {"id": 268, "text": "Absolutely love this movie. so funny and worth watching. Will not disappoint!!!"}, {"id": 269, "text": "I was not expecting this movie to be that fun but it passed the vibe check :)"}, {"id": 270, "text": "The author expresses his meaning by using an event over time. If we are to look at this very scientifically, there may be many drawbacks. However, this time cycle is just an excuse to say something. It seemed to be used well."}, {"id": 271, "text": "This film start with the ground cracking, and a man Nyles wake up scene! As turnout, this film is about Nyles and Sarah caught in the time loop, and they eventually decide to break the time loop by blow up the cave! Entire film full of boring conversation, and annoying overuse scene! Such as, overuse of the waking up scene, overuse of the staring scene, overuse of the song playing at the background scene, overuse of the blackout scene, and overuse of the dancing scene! Make the film unwatchable! Barely intense scene is, Nyles stab Abe with a fork! At the end, Nyles and Sarah blow up the cave! They wake up at the swimming pool! Still have a post credit scene! Nyles saying he don't know Roy! That's it! Wasting time to watch!"}, {"id": 272, "text": "The worst movie of this summer. Don't waste your time."}, {"id": 273, "text": "I only watched this because everyone was raving about it, so I was intrigued. I liked it, but I thought it would be funnier. I thought the supporting cast were quite dull. You have 2 well known actors like Tyler H and Camilla M, and they hardly have any lines. Could have used the supporting cast better than that and integrated way more jokes into this. An explanation about the cave might have been nice. And how mean of them to not involve the uncle in the end? So he's just still stuck in the loop while they got out? Anyway, worth a watch but nothing to write home about"}, {"id": 274, "text": "This movie uses the by now well-worn formula of the classic Groundhog Day. (Used in Edge of Tomorrow, Russian Doll etc.) This theme by its nature raises a number of interesting philosophical and existential questions. Palm Springs presupposes the viewer is already familiar with the formula and the main character is already well on his way into his groundhog journey. How many days exactly isn't quite clear at the start and the movie treats it as a bit of a joke and plot twist. But this sabotages viewer identification with Samberg's character, as it would make quite a difference in his attitude and degree of resignation, if it's his 1000th or 1000000th dayBy having the character already well on his way into his journey the movie skims over the by now familiar parts but it also robs the audience of a chance to grow together with the character's experiences.There is some innovation to the formula by adding more people to the loop, most significantly Cristin Milioti who almost saves the movie with her performance.At one point she uses her infinite time to learn quantum mechanics to attempt to break out of time loop. (Of course!) But the movie completely glosses over the complications that would arise by only having only a few hours each day to learn until it resets again.Another difference is that there's a way for other people to also get stuck in a loop. But wouldnt the ability of adding people to the loop, given infinite loops, eventually lead to everyone within 1 day traveling radius of the cave getting added to the loop. Thus negating one of the fundamentals of the loop? But this isn't really explored in any detail.Maybe I'm being too harsh since the opening half hour setting up the wedding day is pretty funny actually. You see Andy Samberg already operating at Bill Murray post-caring god-mode, unknown to the viewer at that time, owning at a wedding with a weird but charming impromptu speech.But the movie can't really make up it's mind between playing with groundhog days viewers expectations, or making a more sincere movie in the vein of it's precursor. And these two goals are fundamentally opposed.Moments of sincerity are undercut by the Lonely Island trademark irreverent tone and Samberg's light-weight comedic performance."}, {"id": 275, "text": "The two main characters have great chemistry and are extremely likable. I wasn't expecting such a corky and fun movie. The movie truly has some hilarious scenes. I've never quite seen a take on this on the whole time loop concept. Overall the vibe of the movie is chill with an intriguing perspective about romance. It's a solid story with good writing and easy on the eyes....not bad for Hulu."}, {"id": 276, "text": "I really enjoyed the premise of this movie and the acting is great."}, {"id": 277, "text": "Andy Samberg is at his best. Amazing story. Great acting. Makes you want to laugh and cry at the same time. Extremely entertaining. Do not watch the trailer to avoid any spoilers. This is a must watch regardless."}, {"id": 278, "text": "It's a pleasure to fall in love with the work of Samberg &amp; Milioti again. They're both loveable &amp; charm you in B99 &amp; HIMYM and as a team you've no hope but to be enchanted by there performances together &amp; apart.The script, the cast &amp; the direction have such an amazing aesthetic that moves you,makes you laugh and think. Hasn't even been out a day and have already rewatched it."}, {"id": 279, "text": "I love the story telling and how the story shifts between the characters. the comedy can be so much better the characters and actors have the potential to do a lot of jokes like more ways of Roy killing Nyles or more wedding crashing. the worst thing is how Nyles fall in love with Sarah this didn't make any sense and it surely needed a lot of scenes to clear why he will fall in love her."}, {"id": 280, "text": "It's not that it's a bad movie, on the contrary. BUT. we ve been there a lot of times and the revival of eternal love day by day can't be the same after the Groundhogs day or the eternal sunshine of a spotless mind...even when the plot is different we can't stay out of the comparison. We just can't! Or maybe it wasn't fort  enough to keep us out of it. Maybe it should be better to leave the love aside and try something different!"}, {"id": 281, "text": "A film from Americans for Americans to laugh only Americans. I couldn't laugh almost in the entire film."}, {"id": 282, "text": "Here is the dumbest way to play with the lollipop of the idea of having an infinite day. So many cussing and swearing instead of something decent and intelligent. Everything the people in this sh** can dream of is getting drunk and getting laid. Period. Don't watch."}, {"id": 283, "text": "I enjoyed the movie but it would have been so much better if the gratuitous sexual references that gave it an R rating were omitted. Absolutely none of the story would have been lost"}, {"id": 284, "text": "Obviously the total rip-off Groundhog Day. Just adding another person to the time loop doesn't make it different enough to make it good.Plus, the acting was so atrocious. Everything was so over the top and forced trying to be funny. Can actors just act like they mean it? The lead actress was uninteresting.Then they had the extremely lazy exposition of how everything works. I have so many questions to why it made no sense. He hates his wife, but he still has sex with her?I could go on and on.Skip this...I am with the other negative reviews.."}, {"id": 285, "text": "Thank God for women! Otherwise men would be forever lost in a not-growing-only-sex-searching-self-thinking-lazy eternal loop.Really?Too bad. 'Cause it is a funny theme. Groundhog Day gotta be one of the movies you just never get tired of watching."}, {"id": 286, "text": "I barely watch any new movies because everything has a political agenda, or needs to be woke. I don't want any politics even if I agree with the politics.Palm Springs has ZERO politics in the movie, nothing woke, just overall a really funny movie.I highly suggest this movie."}, {"id": 287, "text": "Look at little Andy pretending he is anywhere near Bill Murray. ROFL Well that attempt was worth a nickel and in 2020 Hollywood standards its a lot apparently. great female lead. horrible male lead. meh movie. verdict: could be worse"}, {"id": 288, "text": "It was a very enjoyable movie until the tired, worn out trope, that is used in almost every romance movie, reared it's ugly head. I'm sure you know the one I'm talking about? It's the narrative in which the break down (the conflict) of the relationship solely stems from the male protagonists bad actions, even though he hasn't actually done anything wrong, and he grovels, apologises and prostrates himself to mend the relationship while she is annoyed and inconvenienced by his display of beta submission.Meanwhile what the female protagonist did was actually far worse, (she was effectively going to abandon him forever) yet the movie doesn't acknowledge her utterly selfish and hateful behaviour, let alone make her accountable for her actions.Still it was a well made narrative with good performances and good pacing, it's just a pity the sexist trope put a very sour taste in my mouth near the end."}, {"id": 289, "text": "Not a bad movie, but also not great or that original at all. Fine for hanging out and don't want to commit to a serious film"}, {"id": 290, "text": "4/10 - rom-com in the vain of Groundhog Day, Before I Fall, &amp; Happy Death Day is overhyped and not all that funny"}, {"id": 291, "text": "The dumbest movie I've ever seen in my life,I'm sorry I spent time on this movie"}, {"id": 292, "text": "How does he not remember roy but he remembers everything else?? Why didnt they bring roy with them so he could be able to walk his daughter down the aisle and see his kids grow up? How did he originally get stuck in the time loop in the first place..."}, {"id": 293, "text": "I didn't laugh once in this awful movie. Andy Samberg a pre cringe guy on the low. But most importantly Cristin Milioti literally the least likeable character in a movie ever, I hated her and hoped she would die for real. And OMG the cringe lord all mighty the cringe was unbearable I felt it running down my spine it was actually painful !"}, {"id": 294, "text": "I won't try to explain the plot or the Groundhog Day similarities, I'll just try to rate it. I think its rated a bit too high. Its ok, but not that funny. I guess I'd give it a look but don't expect anything great to happen. Most of the humor is in the first 15 minutes."}, {"id": 295, "text": "I don't recall them addressing how Nyles got stuck in the loop to begin with. At the reception, before Sarah gets stuck in the loop, we can assume that Nyles has been in the day perhaps a hundred times or more. He tries to lure Sarah away, saying that her dad and mom were going to sing a song. She quickly corrects him, saying it's her stepmom, and that her mom is dead. There's no way Nyles wouldn't already know that it's her stepmom, why would he bother making such an error, that Sarah would think nothing of him knowing it was her stepmom?"}, {"id": 296, "text": "Warning: spoilers for this movie and groundhogs day belowThis movie is basically a remake of groundhog day with a few twists here and there. The good parts of the movie for me was the comedy which I thought was very good and I had some pretty good laughs. The part where the movie falters for me was that it was too similair to groundhogs day. The movie goes through everything groundhog's day does: romance, suicide, helping others, having sex, doing fun stuff. The only two things it really does different is using science to escape the loop and having two people get stuck. For me this movie would have been much better if it started with the groundhog's day loop but took a different twist on it with different results instead of ending up in the same ending of them falling in love and continuing their lives. I still believe there is much room for uniqueness with the groundhogs day concept as shown in the edge of tomorrow (for example you could have the couple stay in the loop) but this film didn't make it unique enough to make it super interesting."}, {"id": 297, "text": "The movie was great and its very original even there are so many good precedents before it.One thing I couldn't get myself over with is that they should have also saved JK simmons with them!!!!! Now all I am thinking is that poor guy can't see his daughters' grow up and weddings and shits. Thats very sadddddddddd"}, {"id": 298, "text": "So me and my boyfriend decided to watch this movie as we expected it would be a classic Rom-com. However we were wrong , the first half an hour of the film was okay , we then rolled a joint and smoked , and when we started to get high , the movie was becoming more and more confusing , and we honestly started to get paranoid and terrified. I think it put us both in such a weird head space , where we both felt like we were hallucinating. It might be a good movie but I don't recommend to watch it when your high as it will make you paranoid. We are both scared to rewatch this movie now after what happened to us and I think I won't watch it again 😭"}, {"id": 299, "text": "In my universe things never happens like this, therefore weve made ourselves novel and the ability to make movies about things that can and will hopefully never happen again and so on.i think you might have taken the bait, yes its another of those groundhogian day films, in periods its not so bad, its fun and shifting extremely fast in emotion and temper, to go into details will be a chore far to big for a grumpy old man, so have a look for yourself its a recommend."}, {"id": 300, "text": "I enjoyed the show a lot. But I have to take a few points off for vulgarity and heavy swearing. Those aren't entertaining to me."}, {"id": 301, "text": "This movie drags hardcore but its extremely interesting. I love that she used ger time to learn thats what id do."}, {"id": 302, "text": "I just find her annoying and I bet she's a b*tch in real life. The movies decent though"}, {"id": 303, "text": "Well so are so many things these days including ex-President Trump but this film truly insulted me. The fifteen minutes I spent hating this film would have been better spent stabbing my scrotum with a fork but I didn't have one at hand. I think a monkey on Rohypnol could have written a better script but again I didn't have one around."}, {"id": 304, "text": "Needed more of a spin this has been done by andy macdowell and bill murray far better. But this was it's own spin on the whole romantic one day time loop story, so was ok"}, {"id": 305, "text": "Andy Sandberg's innate charisma, a smart and fun screenplay and an undoubted connection between the two leading character make Palm Springs definitely an enjoyable, light and even surprising movie but the saturated genre and the fact that it doesn't actually try or want to be a game-changer for it lead the movie to feel a bit already-seen."}, {"id": 306, "text": "This movie is very good, it is not the common stereotype of a romantic movie, which in my opinion is very good. It has its comic scenes too, as you couldn't expect anything else from jake peralta :P . I recommend it!"}, {"id": 307, "text": "Movie has every ingredient to not be disliked. So its good work. But they brought material from few old movies like Groundhog day and a tv show named Dark. Its decent unoriginal work."}, {"id": 308, "text": "I think this movie is really overhyped. Not really that funny and not enough drama. It's beautifully filmed but that's about it."}, {"id": 309, "text": "Simple and sweet. Fantastic ending. Truly, whatever your expectations are thoughts going into this light romcom, stick around until the end. It'll make you smile. I guarantee it."}, {"id": 310, "text": "Let me start by saying... this film has now taken the place of Ground Hog Day, as my pick me up movie, when I'm sick or feeling down. The character that blew me away was Cristin Milioti's Sarah. I had never paid attention to her before. She was amazing. Sarah and Nyles chemistry was much more believable than Rita and Phil in Ground Hog Day. Roy was an added bonus to give the movie some additional excitement. I will put the movie on an endless time loop (emphatic period)."}, {"id": 311, "text": "I could write screeds but really all that needs to be said is 'watch this movie'! It took me by surprise and I'm so pleased it did. Enjoy, laugh, love and feel good."}, {"id": 312, "text": "Fabulous soundtrack on this 'inventive' time loop comedy drama that is funny in parts and philosophical in other areas. It did get dull for me in the middle but the performances by charming Samberg and Milioti made up for it and I eventually finished it with a smile on my face. Still, not great. TN."}, {"id": 313, "text": "I really enjoyed this different take on traditional rom coms. It was sllightly more raunchy than most and of course the sci-fi twist. I'm glad I watched this not having known about the fantasy aspect because I truly believe that's what set this apart from other similar films."}, {"id": 314, "text": "I am not sure that time loop movies should be an entire movie genre. I am not sure that we needed another version of Groundhog's Day. I am not sure this movie should have attempted to explain the quantum physics involved in its plot. But I am 100% sure that I enjoyed watching it. I was genuinely amused, surprised, and touched thanks to some pretty great writing and performances. I walked in thinking the movie should not exist, and I walked away glad that it happened anyway. That's a pretty big compliment."}, {"id": 315, "text": "Occasionally I watch a movie where I literally want to watch it again when it's over. A very funny, existential, and human movie. Andy Samberg absolutely nails both the drama and comedy of this absurd premise. He's having so much fun in the time loop you're not sure you want to leave it either."}, {"id": 316, "text": "Seriously I laughed all the way through at the two people trying to get out of the time warp Esp at the random stuff like the kid watering dog poop the rock dinosaurs and the pizza floats in the pool.i hope andy and cristin get more work."}, {"id": 317, "text": "Palm Springs is a wild takeoff on Groundhog Day with some interesting moments, but ultimately it never delivers the belly laughs that the promo promised. I like that they started the movie with Andy Samberg's character already caught in the time loop. But Samburg has little to any acting ability. His character just kind of exists. Blah. Cristin Milioti is absolutely fantastic though. Every little nuance and every huge delivery is spot on perfect. Hand her the phone book and you would have a hit just watching her read it. The guy from Law and Order and the insurance commercials is good to. One thing that most people missed is how towards the end Nana hints that she is also stuck in the loop!"}, {"id": 318, "text": "So, this movie is like a Groundhog Day deprived of the moral of the story. It's kind of fun in the first half still and you CAN derive profound reflections out of it if you want to though. But it get's really cringe-y towards the end"}, {"id": 319, "text": "There is a certain type of person that loves Andy sanburg. That is not us but if it is you, you will love this movie. The girl was super annoying but the plot was pretty good."}, {"id": 320, "text": "I'm only giving this as many stars as 6, because of the bizarre revisionist plot premise is just far enough left of Groundhog Day to give it a boost. Otherwise, all the millennial-fueled angst wears real thin (think a next generation Singles) and despite the cute likability of leads Andy Samberg and Cristin Milioti, they're still not anybody I particularly grew to care about. Okay, I did laugh out loud at Nyles' initial approach toward Sarah on the dance floor (the wedding held all the best interest), but everything else just kept unfolding as a whaaa...? In GHD, Bill Murray's character found humility, mended fences, and even learned how to tickle the ivories in his pursuit of Andie McDowell's approval. Our Nyles balks likes a shallow child right up to the last act, yet in the same timeframe, Sarah manages to learn quantum physics in her pursuit of paranormal freedom (?!) ...and still doesn't care what Nyles does! In a whirlwind of loose-end resolution, they just end up blissfully floating in a swimming pool of sudden happiness? Even that was just too big a leap into the abyss for any and all the plot devices to save themselves! I still wanna know what happened to the goat!"}, {"id": 321, "text": "Don't think it was really worth the watch but I didn't dislike it. Andy feels out of place in the character he plays. Just didn't work. Other actors were great. The plot line was predictable and pretty basic with typical tropes. It was a cool concept in general I wish was explored more than it was, felt like a knock off version of Groundhog Day."}, {"id": 322, "text": "It's pretty obvious the makers of this film used the great Groundhog Day as their roadmap but who knew a follow up could be equally brilliant?I'm almost 59. I had a stint as a film reviewer (hint: be consistent so the people who love you and the people who hate you can trust you). And I've never been particularly enamored of Andy Samberg or Lonely Planet (okay fine, Dick in a Box THE great comedic video touchstone) But this film is in every way: direction, script, performances, cinematography and score, perfect.Just watch it. If you haven't seen Groundhog Day, watch it first."}, {"id": 323, "text": "I just loved it. Honestly I had no idea what the movie was about, didn't watch any trailers, nothing. I watched it purely because of Andy Samberg and I was NOT disappointed!!"}, {"id": 324, "text": "Palm Springs is just such a good time of a movie, i was smiling for just about the entire runtime. Andy Samberg kills as always, and so did Cristin Milioti, they are both extremely likeable and have great chemistry together.I liked happy death day a lot, and I am very much not unhappy with the trend of Groundhog Day genre movies. This is now my favorite one. It's so inventive with it's story I couldn't predict what was gonna happen at nearly any point. So many clever twists to a story that could get tiresome quickly if not done right.Props for casting Connor O'Malley and Jenna Friedman in smaller parts, they both rule. #MinionSquadThis is a greatly enjoyable and fun movie, that I would recommend to just about anyone. Watch it"}, {"id": 325, "text": "Ha! This movie is bold, sweet, and funny!I'm 65 years old and generally a prude when it comes to sex and violence. But this was a charmingly-delightful experience into a clever time-loop snafu, so I got over the cartoon sex and cartoon violence.Andy Samberg captures some of Bill Murray's frustration in Groundhog Day but then makes it charmingly his own. Andy is exhausted but then added into the mix is the captivating Cristin Milioti. And then things just take off in a bizarre way.The bar dance was mesmerizing and hilarious. Bonus points for the great J.K Simmons who stole every scene he was in. Bonus points for the amazing chemistry of Samberg and Milioti.I'll let the rest of the reviewers discuss direction, set design, editing, and cinematography - but all were perfect.In a normal year, this film would've garnered many academy award nominations. Maybe Best Picture would've gone to such a unique comedy. Who knows how the 2020 AA will shake out but this movie is just charming and delightful. Watch and enjoy! It's laugh-out-loud fun and just so sweet."}, {"id": 326, "text": "* There is 1 mid-end credit scene *Max Barbakow in his feature directional debut and crew brought a lively time loop film. The story is about two strangers who meet at a wedding and they are stuck on a time loop. There are many genres with that concept, some of them are good and some of them aren't and this one was an interesting comedy-romantic version. It wasn't hilarious like I thought it would be but I still enjoyed it. The narrative was fun, odd and it all clicked fantastically. I loved the scene where the lead male character did a calculated dance at the wedding to impress her, sadly there weren't enough scenes like that. The ending felt cliché and it could have been better. They should have left it open to interpret and have the mid-end credit scene its only ending making an exciting interpretation.The composer Matthew Compton brought great music but I preferred he stuck with a pattern. His main music was basic in this kind of genre and it did fit with the film. He also had a few of them that were like in a synthwave tone and those were magnificent. How I wish the whole movie would have that same pattern instead of having a mixed one.The cast was fantastic, Andy Samberg's vibe was so electric and exhilarating. Cristin Milioti was more centered and loved her solo mission scene. Both of them had undeniable chemistry and never a dull moment."}, {"id": 327, "text": "I turned on Palm Springs last night since everyone is talking about it, and it has gotten rave reviews from both audiences and critics, which is kind of a rarity these days, and it also has Andy Samberg in it. It really sounds like it can't go wrong... but, it does.Throughout its run-time, I don't think I laughed even one time. Its trailer advertises it as a comedy, and everyone on here calls it hilarious, but seriously I didn't even laugh once. It starts off as almost like a sci-fi horror movie ala You're Next meets Happy Death Day, but after those first 15 minutes, it becomes to drab and mundane.I really don't think I've seen more people cry in a supposed comedy. Every 5 minutes someone is either crying or teary-eyed. And there is no comedy at all to be found. It's not darkly funny, it's not silly funny, it's just overall not funny. At all. But it's also not sad either.It's not a total waste because it is beautifully shot and well acted, but those are about the only two good things I can say about this. I just don't get it. Not sure what all the hype and ranting and raving is about."}, {"id": 328, "text": "For a film that rips its premise off the ultimate time loop movie, Groundhog Day, Palm Springs is surprisingly unpredictable and exceedingly charming. It's got an anarchic anything goes vibe and a pair of vibrant actors, Andy Samberg and Cristin Milioti, who also happen to have a ton of chemistry together. It's a movie for our very troubled times and seems tailor made for a quarantined audience, where day bleeds into day and the repetition of the weekly grind is sending many of us to the loony bin. The sweet message at the center of this otherwise naughty film is that it's not the what we do that keeps us happy but rather the who we do it with. It's all about appreciating the little things that make life worth living moment to moment rather than focusing all of our energies on the big things that we chase at the risk of letting peace and contentment pass us right on by.This message is most effectively encapsulated in the character played by J.K. Simmons, who spends the first half of the movie trying to kill Andy Samberg and then has a great scene toward the end that makes the most mundane situation imaginable seem like a little piece of heaven. How I can relate to that right now.....Grade: A-"}, {"id": 329, "text": "Wow! This film was such a breath of fresh air. It's exactly the kind of film you need more of, during difficult times like these. The basic thread is borrowed from films such as Groundhog Day and Happy Death Day. However, thanks to the clever treatment of its core concept, the infectious chemistry between the leads Andy Samberg and Cristin Milioti, a solid supporting act from the ever-dependable J.K Simmons, and a brisk runtime of 90 minutes, Palm Springs is a winner all the way.Palm Springs will now be looked upon as one of the ingenious entries among films that deal with infinite time loops. More than being just a romantic comedy (which it is damn good at!), it also succeeds in putting forward relevant questions about life, relationships, routines, happy moments, and realizations. And most of them get answered too, within the film's context.Nyles (Samberg) and Sarah (Milioti) forge an unlikely connection on the latter's sister's wedding day. As Nyles and Sarah hook up, Roy (Simmons) shows up trying to murder Nyles and all 3 of them are drawn to a vortex that makes them relive the same day over and over. Palm Springs doesn't try to dig deep into the tedious scientific details of a time loop; writer Andy Siara and director Max Barbakow clearly know what they want to extract out of this idea.As a result, you get a rom-com that works well as a character study (Milioti is awesome; why don't we get to see her in more films?). Nyles has been in the loop longer and has grown to accept this repetition of events. Sarah, on the other hand, clearly was going through a lot (in terms of how she's perceived by her own family) and wants out of the loop. Roy is seen to be out occasionally seeking revenge against Nyles for bringing him into the loop. Do these characters attain closure the way they want? The film has some interesting tricks and laughs up its sleeve.Some of the humor stems from situations when the lead duo is trying to live it up while in time captivity but is not restricted to just that. Sarah is a well-written character as is Nyles, and the film benefits a lot from its quirky writing and energetic performances. Palm Springs is definitely a film that I'll watch again and I know I'll like it a lot more each time."}, {"id": 330, "text": "If you enjoy reading my Spoiler-Free reviews, please follow my blog :)If you've been following me for a while, you know I'm not the biggest fan of rom-coms. It's not that I don't like the genre (I appreciate and enjoy every single one), but I find its movies tremendously difficult to *really* love. The massive majority follow the genre's formulas and cliches to such an extent that I rarely end up truly loving one of these films. Some are way too cheesy. Others are way too unrealistic and dream-like. But the aspect that throws me off the most is the lack of originality. I can't remember the last rom-com I watched that didn't borrow from countless other installments. I didn't know a thing about Palm Springs: no trailers, no knowledge of critics/audience's opinion, nothing... And I'm extremely happy about that!I usually watch the main trailer for every film I review *after* I've seen the actual movie. I ignore all other trailers, clips, images, and so on. I do this so I can have some sort of knowledge regarding how far I can take my spoiler-free reviews. This way, I'm sure that I don't write about something I shouldn't. The official trailer for this film doesn't ruin the experience in any way, but it does tell its viewers the most relevant aspect of its screenplay. So, I could address it in this review, but I won't... because I enjoyed this movie a lot more, not knowing a thing about it than if I knew how it developed its story.Therefore, I'll keep it really vague, and just write that Andy Siara's first feature-film screenplay can easily snatch a couple of nominations when the awards season comes around. This is a rom-com like no other due to its refreshingly unique concept. It's true that it's not an entirely new method of storytelling. Many other movies also employ this idea, but Siara holds so many surprises within his narrative and so few of the genre's common traits that the whole film is elevated by his outstanding writing.It's one of the most entertaining movies of the year. With a short runtime and a fast pace, Palm Springs is constantly being genuinely fun, engaging, and even mysteriously intriguing. Its original plot makes the viewer think and remember previous lines that take a whole different meaning a few minutes later. There are no predictably dumb narrative decisions, and its characters escape the cheesy and forced relationships that these films usually insert them in. The dialogues are hilariously captivating. Almost every single plot point packs an emotional punch, a jaw-dropping revelation that never crossed the viewer's mind.Andy Samberg and Cristin Milioti share such great chemistry. Their characters are exceptionally developed, and their relationship feels incredibly real. I'm rarely that viewer who requires the main characters to be together, kiss, fall in love, and all that, but Nyles and Sarah are two wonderful protagonists I can definitely root for. Both carry an interesting baggage, which is also explored at a deep level. They deal very differently with the situation that the story puts them in, and it's so much fun to watch them go through it and evolve as characters. Oh, and J.K. Simmons (Roy)... this man doesn't know how not to be utterly remarkable!Max Barbakow (directorial debut) demonstrates his talents as well, by allowing Siara's screenplay to shine under impeccable direction. Tonally, it never loses its balance. It keeps its comedy pretty grounded, considering the craziness of its premise. It never relies on the genre's formulas, cliches, and cheesy outcomes. It really separates itself from the majority of modern rom-coms. I don't really have any flaws to point out... The ending does have a just accept it narrative component, and there are a couple of unnecessary scenes, but I'm nitpicking here.I can't believe I'm going to write this, but Palm Springs is not only one of the best rom-coms I've ever seen, but it's also one of the best (if not *the* best) movies of 2020, so far. With the help of their first-time director (Max Barbakow), Andy Samberg and Cristin Milioti spread their extraordinary chemistry all over the innovative, original narrative, written by the also debutant, Andy Siara. The latter is undoubtedly the main responsible for such an entertaining film. Siara takes an imaginative concept and develops it in the most captivating, fun, hilarious, and even intriguing way possible. A surprising screenplay packed with emotionally impactful plot points, revelations, and twists that keep the enjoyment levels extremely high. The two protagonists are exceptionally developed, as well as their compelling relationship. With a fast pace and a perfect balance of its tone, Palm Springs sets itself apart from the other movies of the genre, staying away from all of the cliches, formulas, and stereotypes associated with it. J.K. Simmons also lends his awesomeness because why not? Whether you're a fan of rom-coms or not, I definitely suggest giving this one a look. You won't be disappointed!Rating: A"}, {"id": 331, "text": "I'm thankful to everyone for saying this was surprisingly good, because I don't think I would have given it a shot otherwise.Maybe the Groundhog Day formula will always be entertaining, because I'm yet to see a movie use the premise in a truly bad way (I'm sure there exist examples though). It's good enough that you almost wish it was longer, but I guess the 90-minute run time does help keep the movie fast and entertaining and never boring.I'm not sure it would exist without Groundhog Day, but it does a decent enough job at combining the premise with the genre of romantic comedy, leading to something that feels fresh enough.And it's just hugely entertaining to boot. If you sometimes have problems paying 100% attention to a movie you're watching at home (hate to admit it but that's me sometimes), then give this one a shot because it is super engaging. If we don't count Hamilton as a proper movie (apparently the Oscars aren't going to, as a sidenote), then I'd say Palm Springs is probably the best release of the year so far."}, {"id": 332, "text": "#MovieReview #PalmSprings #CristinMilioti #AndySamberg #Hollywood #SpoilerFree #RomComApart from the obvious similarities and their collaboration as a father-son pair in That's My Boy (2012), Andy Samberg is the new Adam Sandler in one more respect-they are such goofballs that their acting chops often go unnoticed.Samberg is a revelation in Palm Springs in what is easily his career-best role. The Brooklyn Nine-Nine star alongside Cristin Milioti (The Mother from HIMYM) dazzle as a pair of cynical wedding guests stuck in a time loop.Riding on the legendary coattails of Groundhog Day (1993), Director Max Barbakow still manages to surprise you with some amazing twists and dollops of laugh-out-loud moments, springing up at the places you least expect them to.Oscar-winner JK Simmons is brilliant as usual in a role that has very little screen time but makes a powerful impact.A perfect romantic comedy during these tough times. Highly recommended."}, {"id": 333, "text": "This movie was a fun and intriguing watch that was able to pull you in from the start. I've loved many of Andy Sambergs previous works, as well as Cristin Milioti, and the chemistry between them was undeniable.There were many things I loved such as the 80s themed music, beautiful cinematography, sarcastic comments between Samberg and Milioti, as well as the tender moments between the leads and the supporting cast. While this movie was great I did find certain scenes didn't flow as well, and there were a couple plot points that were easy to figure out early on, but I think those things are able to be overlooked with this type of movie.Overall, if you have Hulu (or even a drive in nearby that might be showing it) I highly recommend it. It has laughs, a likeable cast, and is a well done movie that should be watched during a year when movies have almost ceased to exist."}, {"id": 334, "text": "It's like I said, I love Groundhog Day (1993). I've seen it over a hundred times.... But, I enjoy time-travel movies in general, including the time-loop variety in the vein of that Bill Murray-Harold Ramis classic, such as Edge of Tomorrow (2014) and Netflix's Russian Doll series. Time travel is an inherently cinematic notion, of an art form that literally consists of moments in time--still images, shots and scenes--along a continuum--what used to be the film strip--that may be edited, rearranged and begun again, reviewed by the spectator ad infinitum. The main difference of Palm Springs, although it's partially a continuation of a thread from Russian Doll, is that it places multiple characters in the time loop instead of just the usual lone (and usually male) protagonist--to wake up in the same place on the same day every day, always at a wedding in Palm Springs. Thus, there are shifts in perspective running concurrent with the temporal repetition of events and place. Besides offering a greater gender balance to the rom-com formula, this opens up an array of possibilities in montage and storytelling.In this case, the bifurcated narrative is largely exploited for efficiency. I'd be fine lingering in such a scenario, a sense Murray gives us in Groundhog Day, with his various schemes and explorations of his situation. It's a fantasy that's well suited to the episodic format of Russian Doll. Unlike these prior efforts, however, Palm Springs rushes through and is able to do so because Andy Samberg's Nyles has been living this repeated plot for long before we caught up with him in the movie, and so he is able to quickly get Cristin Milioti's Sarah up to speed when she joins him in the repetition. Interestingly, the idea of beginning the picture with the male character having already re-lived the same day untold times was a feature of Danny Rubin's original screenplay for Groundhog Day, but Ramis altered this rather arthouse notion to an easier and more commercially-friendly beginning where we enter the time loop at the same moment with Murray. Palm Springs is able to have it both ways.Neither does Palm Spring afford much space to philosophical or religious musings. Indeed, Nyles declares on the first night we meet him that there's no god. Even the supposed quantum physics within the picture doesn't rise above the sophistication of an installment from the Marvel Cinematic Universe. Ultimately, Palm Springs is merely a place we're meant to inhabit fleetingly, for some laughs and the cliché love story conquering all. Some critics are surely tempted to analogize this version with the unraveling of habit and structure making days seemingly run into each other--losing track of time--for many in the real world of 2020 by isolating themselves or otherwise limiting their activities due to the pandemic, but the timing here is as accidental as that for the characters within the movie. No, Palm Springs is a lovely fantasy, where death is a reset button and where one feels more freedom than ever without the threat of tomorrow, as well as to experience it safely with others. There's no meaning underlying this romp beyond the hackneyed wholesomeness of family life provided by J.K. Simmons's Roy and romantic coupling that's the foundation of the entire premise. That's fine; fun need not always be wrapped in layers of existential profundity--a shaggy dog story will do. Some days are well enough by just enjoying the slight variations to the same format. I'll see Palm Springs again."}, {"id": 335, "text": "I'm a sucker for time-loop / time-travel type movies, and so was always going to enjoy this. But this movie gets extra marks for making an effort to add some originality.CHARACTERS: They're great in this. Very likeable. The chemistry between the two leads is very good.ROMANCE: It's got the right level of cheese to it. Not over the top or cliched. It's very believable / relatable.COMEDY: Gets full marks in this department. Not over-the-top or annoying. Jokes are well paced (spread out) - and strike a fine balance between seriousness and laughter.STORY/PLOT: It's a time-loop film. Not much else to it. But the events in it are entertaining. And it's content with being a very simple plot (doesn't try to overcomplicate anything)There are a few drawbacks (like the rushed ending). But all in all, a very good, heart-warming movie that keeps your interest over a respectable duration. Definitely worth the watch."}, {"id": 336, "text": "The first thing come to my mind when I watched this movie is that Groundhog Day (1993) time lopping where Bill Murray's character got stuck in. But in here there's a way of going further with the idea of being inmortal. Discovering the meaning of life through days gone by is a get off well technical goosebump, followed by a bunch of unnecessary time-travel resolutions we don't need to. Same as Back In the Future (1985) when Doc tries to explain what is going on a blackboard. Of course this is a reference. The last thing I have to say is the exploitation of Simons' character as a man who is tired of living his life but at least has to raised? two little childs cause of one Mai Thai left condom. The relationship between Nyles and Roy could be the same Alan Parrish and Van Pelt in Jumanji (1995). Just because we don't know what happened between the last two. It came randomly to my mind but I think it's another cinematic reference so filling more scenes with them. And you? How many did you find?The positive vibe is somehow on the dialogue comes from Sarah when she asks Nyles: Well, then what's the point of living?. Or Roy's best meta quote: At least you have each other. Nothing worse than going through this s**t alone referring to life itself. It's a comedy but it take it seriously to the frame"}, {"id": 337, "text": "Now this is a pretty fine film, that came in a time where movie audiences want to watch something good - mostly because there isn't as many offer as it's usual in a regular year. i haven't seen more than 3 or 4 movies from this year, this one is the best so far, from my very little sample.Samberg and Milioti have a very good chemistry that definitely carries this and it makes a very watchable piece. samberg isn't far from his usual, even though he's more contrived here. the characters go through a journey of self acceptance and caring, through a time-loop. there's a lot of dialogue concerning nihilism and how far they have to go until they start to actually care.now i'm a fan of time loop movies. everytime i see there's one i want to check it. groundhog day is probably still the best, but here they do a creative approach to this.with the editing for example that i think it was smart. or on the different stages they positioned the characters at the beggining. there are a few variations from the theme that actually work here.the script makes two likeable leads and creates a good pace too. i'm not a big fan of two things: first i think this could have been funnier. it has some nice jokes, but i think it could have been a bit more tailored. the style...well i like the music and the editing, but i don't find the cinematography or the colours very attractive. there are some parts where this definitely wants to make an indie vibe and i didn't feel it.it is still a fun watch and an emotional journey. the pace is also cool, never gets boring. i understand also why some people loved this. i don't think it's a great film, but it's a very nice one, that is engaging, interesting and has heroes we actually care for."}, {"id": 338, "text": "Palm Springs (4.5 out of 5 stars)Palm Springs is a lot of fun romantic comedy film that delivers a Groundhog Day like scenario with a romantic comedy twist. The plot follows Nyles (Adam Samberg) who is stuck in a time loop, reliving the same wedding day over and over. Stuck with an unfaitful girlfriend. Sarah (Cristin Millioti) who is living with regret and follows Nyles and gets stuck in a time loop with him. They both try to make a time of there lives.Fun plot. The movie does turn a lot of fun when Nyles and Sarah try to make most of it with there repetitive time. Like having fun and doing things differently. Having like a 1980s retro dance in a bar. Interrupting there girlfriends hook up. Ect. The film does leave you smiling and has a few laughs. Which does get a little few in between throughout.Adam Samberg is great with the role. Cristin Millioti is also perfect with the role. The music score was decent. Trying to be like a 1980s score. Yes, its a romantic comedy that does have a predictable ending. But it is a lot of fun throughout that makes the movie worth watching."}, {"id": 339, "text": "The Groundhog Day formula for film is something that has become extremely popular. The day repeats over and over for a character until they do something profound and change their life or an event to break the loop. When I started watching Palm Springs I didn't initially sense that it was that type of film but when it was I was hoping for something that would use the aforementioned formula will. With its twists and sharp writing, Palm Springs absolutely works and remains fresh the entire 90 minutes of its running length. The film is about a wedding and two guests of the wedding that find themselves in a magical cave, once they go near the light in the cave they are doomed to repeat the day over and over. Anyone who interacts with this cave find themselves knowing about their predicament. The pair find out secrets about themselves and have fun with their situation but ultimately need to find a way out of their repetitive situation. The film stars Andy Samberg and Cristin Milioti. The film takes the Groundhog Day formula of the never ending day and twists it. Now instead of following one person who has to deal with being the only one who knows about what happens on the repetitive day, we have multiple characters. This brings a lot of fun and the script can have fun with this unique test on a tried formula. That's what makes it fun. There's enough light twists and turns that make it worthwhile and the chemistry of the leading pair really does help with the quality of the film. Palm Springs does a good job of taking something we know and changing it just enough to keep you guessing and having fun with itself and its characters. I like Andy Samberg as a lead in films, he has a humorous charm that can make a bad film worth watching. Palm Springs is a strong Hulu original film and the best one I've seen so far on this streaming platform. 7.5/10"}, {"id": 340, "text": "I'll be honest, I've been getting a little burned out on the resurgence of the Groundhog Day style movies. It's not that they're all bad, I've actually enjoyed a few of them but there's been such an influx of them lately I'm just... Not super into it. That said, really enjoy Samberg and the Lonely Island guys and Brooklyn 99, so I was a bit conflicted on this one.Absolutely surprised me with how good it was. It plays with hilarious comedy and moving somber notes so well throughout. It embraces and challenges the Groundhog Day theme wonderfully. Samberg even plays a more toned down character and it's still exceptional. Oh, and J.K. Simmons? Even more wonderful than usual.For me, the only down note is Cristin Milioti. I didn't feel like she struck the right balance with her character. With Samberg playing more reserved, I would have loved for her to be the crazy one or maybe even the super nice one, something to work with Samberg's performance and instead I feel like she lands right in the middle and... She's not bad but doesn't quite shine either. There's a possibility that she's just not for me though, because I didn't love her in How I Met Your Mother either.They were also clearly on a weird budget because some of the locations look pretty fancy, but the few special effects looked dreadful to me. I don't expect blockbuster effects from a movie like this but we've been doing CGI fire for a while now and I feel like it should be possible to make that look half-decent on a budget. Still, that's a small thing.This is an absolute recommend for me. This was a lot of fun and even my negatives aren't a huge detractor here. Throw in the fact that it's streaming right now on Hulu and this is a readily available movie that everyone should check out."}, {"id": 341, "text": "Great watch, will watch again, and can recommend, especially for fans of time shifting tropes.Time shifting is where your mind goes back in time, but not your body. Essentially everything resets like a save point, except your have all this knowledge.Time shifting was made popular by Groundhog's Day and there have been several movies that mainly consist of dying / sleeping and repeating like a video game, and this isn't THAT different with a few exceptions that make all the difference in the experience.Andy Samberg (Brooklyn Nine-Nine) finally steps up and shows everyone that he can do a somewhat serious role, and not just a straight man. Cristin Milioti (How I Met Your Mother) does an excellent job in her lead role, with a great supporting cast, to include J.K. Simmons (Cave Johnson) leading a wonderful supporting cast, except for Tyler Hoechlin (CW Superman: Supergirl, Flash, etc.), who I might just not like because he was Superman, but it's supposed to be an disliked character...so....good job?The medium of the transfer being shown is an interesting option as we saw in the Happy Death Day movies, but it does allow for a reasoning of how it works, can it be broken / manipulated as opposed to divine will. Most importantly, it allows for more than just one subject being affected, which is really where it gets set apart.The trope bleeds a little when you have multiple people trapped in the loop: you have multiple people trapped in a thing: you have multiple people trapped in a prison. When multiple people are trapped in a environment together, they tend to get a little strange, and we get that sort of thing a plenty. Because we have multiple story threads to follow, we're almost seeing 3 stories all overlapping, and the movie does a great job of showing those, whether or not their in chronological order, or happening at the same time.Whether you see it as a prison break movie, or a time loop movie, this movie has a lot of fun in it, along with deep metaphysical philosophy, so there is something for everyone."}, {"id": 342, "text": "The 'Groundhog Day' scenario is starting to be used in films more and more I've noticed. 'Happy Death Day' took a crack at - and it went extremely well. 'Before I Fall' also used it - with slightly less successful results. And now 'Palm Springs' has used it. Ironically the only one of those films I haven't seen is 'Groundhog Day'. I absolutely loved 'Palm Springs'. The concept worked perfectly here, and they worked the concept perfectly. It was funny, touching, thought-provoking and inventive. It never felt like it was stepping on anyone's toes either. It just worked.The cast are a big part of what made this so great. Andy Samberg for starters nailed the lead role. He was endlessly likeable, relatable and hilarious (without turning it into a full-blown comedy). It's hard to imagine many actors playing this role as well as he did. Also Cristin Milioti deserves almost an equal amount of credit. She had to make us fall in love with her (despite being quite a flawed character in a lot of ways) so that we would buy Samberg's character falling for her. And she pulled it off and then some. Finally, J.K. Simmons was a great addition to the film. He actually isn't given a whole lot to do, but what he is given to work with he utilises extremely well.I love that the film made you question yourself over whether the scenario would be good to have happen to you or not. Personally, I would absolutely love every minute of it. I could live the same day over and over for 1000 years quite happily. But I understand why a lot of people wouldn't like that too. 'Palm Springs' was an incredibly enjoyable film to watch and one I would highly recommend you check out if you haven't already."}, {"id": 343, "text": "That's it. I don't think there is a better complement to give here, is insane. They've managed to re shaped, and tell such a refreshing story, in a genre that can be so repetitive most of times. Don't get me wrong, some of my favorite movies of all time are rom-coms, but this is different from everything I have ever seen. A movie doesn't need to be completely different from everything that came before in order to be great, but when they are, it feels... fulfilling (if that makes sense).If you've seen the trailer for the movie, you know what the movie is about. Basically, two people, getting to know each other, in ridiculously stupid situations while stuck in a time loop (actually, it would be at least interesting the experience of seen this movie without any previous knowledge, just thinking is a regular romantic comedy).And well, they delivered, Andy Samberg is my man, I love the guy, I love Brooklyn 9-9, and I've been closely watching almost everything he does for the past few years, and he rocks, always funny, a great comedian and actor. Cristin Milioti is also great here, some of my biggest laughs in the film were on her scenes (like the first scene in the desert, when Nyles gets shot and she goes wtf?! wtf!?, is so genuine! J.K. Simmons, is also here, he isn't in the movie that much, but when he is, he's great, as always.Anyway, to sum up, the movie is great, is refreshing, is so damn funny, the story is great, the dialogue is great, the direction, everything about it is great. Sure, you could point out that their way out isn't that believable, but c'mon, they've earned cause of how innovative, and smart the whole storyline of the movie is. So, that's it, Palm Springs is an amazingly funny rom-com that takes place in a time loop, and that's a phrase I never thought I would say, but I'm glad I'm saying now.Before I forget: One other good thing I thought about it, is that I thought cause I already knew about the time loop thing, that the first third of the movie or something would be useless, and boring, but it wasn't! They go almost instantaneously straight to the point, and the story moves fast (after all, the movie has just 90 minutes)."}, {"id": 344, "text": "Palm Springs Micro Review -When Palm Springs premiered in January at the Sundance Film Festival it never could have predicted it would be the cinematic manifestation of the year 2020. While the film is built upon traditional romcom scaffolding its characters and their balancing of hilarious moments with honest and authentic underlying feelings of loneliness elevates the genre. Palm Springs is near perfect at accomplishing what it set out to be.Andy Samberg (Nyles) has been stuck in a repeating wedding day time loop for an eternity, when by chance, Cristin Milioti (Sarah) becomes unknowingly trapped with him. Samberg uses his comedic background as a well executed shield for Nyle's nihilism for the situation he has found himself in. Miloti faces her own challenges and plays off of Samberg's quirkiness acceptance of this bizarre situation fantastically. But Samberg and Milioti's back and forth is more than well executed hilarious moments, they punch upwards towards exploring our interconnections.While I did not care for how the time loop was addressed, Palm Springs is not a film about escaping a never ending repeating day. Palm Springs authentically addresses the feelings of loneliness in a world we sometimes feel we have no control over with leviety. One of the best films 0f 2020."}, {"id": 345, "text": "Palm Springs isn't the best film of 2020 so far, but it's one of the most purely entertaining experiences I have had in quite some time.It's labelled as a comedy, but one of my problems with the film is that it's not as consistently funny as I would have liked. There are some humorous moments, and most of them land, but there weren't as many gut-busters as a film like this could have done with.However, this didn't bother me too much because it was replaced with deep, complex questions, and a narrative that was far too clever than a film like this had any right to be.The script was sharp, and the characters were fleshed-out. Andy Samberg, Cristin Milioti, and J.K. Simmons were fantastic in their roles, and the film is carried on their shoulders and the predicaments they find themselves in.The pacing wasn't the strongest, which is a little concerning for a film which clocks in at less than 90 minutes, but there was a section in the middle which I could have done without. There was some nice development of the Roy character, but I still felt like everything else ground to a halt for a while.Fortunately, the film picked up again and the last act was incredible exciting. It challenges the audience with complex questions, whilst being entertaining and powerful at the same time.Although we have seen films using time-loop elements before, including classics such as Groundhog Day, I still felt like Palm Springs was an original take on this formula and it gets a strong recommendation from me.SCORE: 90%"}, {"id": 346, "text": "In the genre of rom-coms, Palm Springs stimulates an atypical arousal, satisfying even the most strongest skeptics. Andy Samberg, a national treasure, delightfully and whimsically whisks you away into a journey worth repeating.Most rom-coms have a familar recipe: boy and girl meet through a circumstance. Followed by a chase of sorts filled with infatuation, frustration, sadness, acceptance, and ultimately relief. Viewers pray and hope for a happy ending. There is nothing wrong with this recipe except for the torture of cheesy dialogue, lack of chemistry, and unfulfilling plotlines. Nyles (the boy) and Sarah (the girl) achieve remarkable chemistry; hilariously wrestling with the past, present, and future.For any couple struggling to find a Thursday night rom-com, we recommend Palm Springs, paired with a favorite offering of aged boxed wine and sliced American cheese. Cheers!"}, {"id": 347, "text": "Palm Springs is the typical romantic comedy meets Groundhog Day. The trailer is very indicative of the tone and style of the movie. Yet it is not overtly explicit and leaves out some nice surprises.It is hard not to love this movie. Not only because it is funny but also because it is sweet. The movie operates on a Groundhog Day(GD), time-loop, premise. Andy Samberg relives the same day over and over. Then, things become complicated when Cristin Milioti is dragged with him to live on the same day forever.It is interesting that GD has become the canon of time-loop movies. Not that it is a bad movie, but it feels very quaint. It works more as a modern day fairytale than anything. And it revolves entirely on Bill Murray and on his own desires and impulses. Bill Murray breaks the spell when he grows out of being a jerk. Obviously it is a movie from another decade, but you can see the same mechanics in Edge of Tomorrow.Palm Springs starts almost where GD ends. Andy Samberg has already mastered the world and himself too, to a certain extent. He starts with the nihilistic hedonistic worldview. This leads me to consider actually Milioti as the protagonist. This movie is GD from a woman's perspective. But not in a hacky Oceans Eight way. It takes the absurdity seriously, and builds on it to deliver a powerful story. I loved that the first thing she does is trying to get out of the situation. And later on her whole character arc is not dependent on the actions of someone else, but it her willpower to fix the situation herself. Her arc is that she actually does get out of the time-loop. It is refreshing to see that dynamic in these types of movies.Of course, for all the movie's psychological and meta-physical themes it does stay firmly in the rom-com genre, with a light emphasis on comedy. The topics of the purpose of life are secondary to the tropes: they meet, they fight, they go back together after having learned something. Yet, I don't necessarily hate that . It makes for a charming movie. My only complaint is that there is not enough JK Simmons. He ends up having a smaller role than the trailer suggested. But it is not all that bad, in return the movie focuses on the romance between the two leads.And I think that is the charm of the movie. It is smart, but it is not heavy. The story is character driven but it also allows for gags and funny setups. It is similar to Love Wedding Repeat, premise-wise. However, it left me with an even better feeling, which might be result of a more focused story, more out-loud comedic tone and some of the greatest comedy actors. Not that they had bad actors, but hey were mostly unknown and British. Here Samberg and Milioti carry the movie to the highest levels."}, {"id": 348, "text": "Once you've seen one time loop movie, in many ways you have seen them all but this years Sundance Film Festival hit Palm Springs, where the film was bought by streaming service Hulu for a mind-blowing 17,500 000 (a Sundance record), is an extremely enjoyable ride that makes a star out of its co-star Cristin Milioti in the process.Directed by debut feature film director Max Barbakow, Springs is a sun-soaked romantic comedy with a sci-fi/time loop twist as Andy Samberg's long-suffering and carefree Nyles finds himself living out a particular day in Palm Springs over and over, an experience that leads him to find solace in drink, the threat of being hunted by J.K Simmons jaded fellow loop sufferer Roy and most importantly the friendship he strikes up with Milioti's newly looped Sarah.There's lots of instances where Springs feels familiar and lots of beats it plays out that are to be expected from such an affair but Barbakow (working off a great script by Andy Siara) and his two lead performers inject a hearty dosage of soul and charm into much of the films elements ensuring that we as an audience are constantly given laughs and even in many ways emotionally resonate feelings as Nyles and Sarah's relationships grows.In what's by far his best lead turn in anything outside of the likes of the great but low-brow Lonely Island backed Hot Rod and Popstar and his work in TV hit Brooklyn 99, Samberg shows there is more to the man than objects in boxes and pants mishaps as he brings Nyles to life.The real joy however is his interplay with Milioti who shines as the flawed but affable Sarah.A long serving performer in TV and movie parts, Milioti is a revelation as Sarah. She shares great comedic timing with Samberg and as the two begin to explore their repetitive new lives and decide to live it up, the film really hits a strong groove that while culminating in a little bit of a so-so final stretch, is extremely entertaining while it lasts in the films particularly memorable middle section.There's no doubt that we will be seeing a lot of Milioti from now on in, with Hollywood sure to be knocking down her door.Final Say -It doesn't reinvent the time loop wheel and has moments where it coasts along but Palm Springs is a mightily enjoyable ride when everything clicks and will work wonders for the futures of its two on fire lead performers.3 1/2 dinosaurs out of 5"}, {"id": 349, "text": "In the times when there's a renewed wish to read Orwell's dystopian novel 1984, or watch that movie or other movies like clockwork orange that depict complete pandemonium (Infact whats also a part of sentiments these days are sci-fi movies on contagion), I chose to watch Palm Springs. Nothing to do with the international film festival, the movie turned out to be an insanely clever romantic comedy!It made me fall in love wild the idea / concept / theory / scheme / feeling of Love again. I wanted it to be longer so that I could just watch more of it and more of Andy Samberg &amp; Cristin Milioti. Their conversations are engaging &amp; the sparks between the 2 of them were galvanic.'The life of Brooklyn 99', Jake Perolta has turned out to be sucha fine actor! And I did not watch HIMYM till the end to see the ancillary character - Cristin Milioti's (The Mother's) introduction unfold and that's why I underrated her as an actor all uptill now. Both of them deliver super sassy performances!Borrowing the idea of time loop from other artworks, yet Palm Springs contains shades of originality &amp; weaves a fresh spin on the subject.With the journey, starting with a wedding reception in Palm Springs, that goes through multiple wake up shots in bed everyday to live in a world of no consequences, the protagonists hitting the beers while lounging on the pool floats, they spotting the mystical dinosaurs together on a starry night, thumping on the EDM in a bar while performing a crazy badass duet, the iconic kissing scene in the cave, going for long drives only to take a different turn each time; the movie was infinite miles far away from humdrum. It wasn't dull even for a split second. A very well written story is metamorphed into a feel good movie with flamboyant colors and it exceeded its own elements of expression as it kept me glued for the entire time.Palm Springs is an incredibly fun &amp; a whacky chase movie!It's a must watch for anyone who's in love or hopes to be in love."}, {"id": 350, "text": "I was a bit skeptical after watching the trailer, but surprisingly Palm Springs (2020) is satisfying, entertaining and has no dull moments, its absurdly funny throughout the movie. My rating 6.5/10.Director: Max Barbakow Cast: Andy Samberg, Cristin Milioti, J.K. Simmons Genre: Comedy, Mystery, RomancePremise: A wedding at palm springs, a city in California. Two strangers Nyles (Andy Samberg) and Sarah (Cristin Milioti) stuck in a time loop, repeating the wedding day over and over...Palm Springs is about this two strangers how they fall in love in this bizarre scenario and finding ways to escape the time loop. Will they succeed or they will be stuck for eternity?Review: Premise of palm springs is nothing new its  one of those infinite time loop situations you might have heard of and maybe you saw a couple of movies similar to it. Whats interesting in this movie is the two witty characters Nyles and Sarah, their absurd comedy, weird moments, and how they find joy rather than suffering on the wedding day that they both hate to live in, because of (Spoiler) past. And eventually they falls in love.Nyles is a carefree guy, he gave up escaping after many many time loops and then masters the several ways to entertain himself, enjoys his life like there is no tomorrow (literally for him there is no tomorrow, so he had no choice). On the other hand sarah, she is the sister of the bride and has some issues... somehow, when she dragged into the mess of this time loop, where the fun begins in the movie. She tries to escape this time loop numerous times, failing every time. Such as driving back to her hometown and still waking up in palm springs the same wedding day. Slowly she sees logic in nyles philosophy of enjoying life. And as seen in the trailer they party, dance, drinks tries all sorts of fun happy stuff. The bond and chemistry between Andy Samberg and Cristin Milioti is really good, definitely carries this movie and makes a very watchable. Even with the little screen time J.K. Simmons stole scenes he in it, he was hilarious. progression of the story and the characterization through the same day makes us curious and interesting in every loop.Cons: The main problem i had is that it skips the pivotal moments like the character transformation and the resolution for change is not that believable. Palm springs plays in the safe side, it never takes risks, it never gets serious it sticks to the cheesy comedy (which is great in first 40 minutes, after that, it didn't work for me). the ending could have been better. And off course the horrible CGI.Verdict: With a low budget 5 million US dollars and with just 90 minutes of fast-paced comedy in the genre of the time loop that we all love about, i think its hard to hate Palm Springs its quite entertaining. I had a good time watching this movie. Don't expect too much just lay back and enjoy the movie. My Rating 6.5/10Other movie recommendations: If you liked this movie then definitely check Groundhog day (1993) movie, a classic which started this whole time loop genre. If you're into sci-fi action want to see some bullets , then Check Edge of Tomorrow (2014). or try experiment with your taste by Source Code (2011). (Thanks for reading) For more check (topbestmovie.com)"}, {"id": 351, "text": "I didn't really know anything about this movie before I watched it. I hadn't seen any trailers or read any summaries. All I knew was that Andy Samberg and Cristin Milioti were in it, so I decided to give it a watch. I expected some sort of raunchy, maybe bland, comedy with these two as romantic leads. While that was partially correct, this movie proved to be so much more.First of all, the time loop shtick. I didn't know that was what was gonna happen, and I was slightly apprehensive at first, but it was great. After movies like Groundhog Day, Edge of Tomorrow and Happy Death Day, you'd think this trope was played out, but far from it.This movie works extremely well, and I just have to repeat how much better it was than I expected. Samberg and Milioti work well off each other, and their comedic scenes are but one of the highlights in the movie. What impressed me the most, were the philosophical questions the movie threw in without expectation. In between the comedic scenes, acted out by two characters who literally live without consequences, there are deep questions about living, death, love and the very difficult matter of having to live in the same day on a loop...All in all, this movie is just so much more than what it appeared to be on its surface. It's a blast from start to finish, easy to love, and very mature in its handling of its highly original subject matter."}, {"id": 352, "text": "As a Brooklyn 99 and HIMYM fan I couldn't miss this opportunity to see Andy and Christin playin' out of their iconic roles. And the result is absolutely great!The story follows Nyles (a funny yet melancholic Samberg) as he prepares to attend a wedding as the boyfriend of one the bride's maids. During the ceremony he starts behaving weirdly and connects physically and emotionally with Sarah (Milioti), the bride's sister. From then the story unravels showing its funniest, weirdest and supernatural side. I won't share any detail about the plot twist, which by the way happens at the very beginning of the movie and gets spoiled by the trailer anyway if I remember correctly, so you'll just have to trust me on this one. Watch this movie and enjoy it till the end! You'll laugh a lot and you'll also feel for the characters, whose great writing is outstandingly portrayed by Samberg and Milioti as they struggle to connect one to another in a world they don't actually belong to.Oh, almost forgot! J.K. Simmons is in the movie too, if you ever needed any other reason to watch it, and his character is crazy and hilarious. So come on, stream it now!"}, {"id": 353, "text": "Cheerful, charming &amp; compelling throughout, Palm Springs brings the Groundhog Day formula to its romantic comedy premise and adds a few tweaks that only end up providing some welcome upgrades to the time loop subgenre. The film doesn't bother itself with what's causing the time reset and simply takes the idea and runs with it.Directed by Max Barbakow, the film is crafted with so much heart, verve &amp; passion that it has no trouble whatsoever in bringing the audience into its repetitive world and make them navigate it with our protagonists. What also makes the ride such a fun, breezy &amp; captivating delight are the wonderfully scripted characters and their witty interactions &amp; evolving relationships.Each reset allows the characters to play with the possibilities and it is amusing to watch no doubt but it is in the intimate moments shared by them where the film finds its finest highlights. At the end of the day, none of it would've mattered if it wasn't for Andy Samberg &amp; Cristin Milioti who are excellent individually but even better when together, for the chemistry they share is both heartfelt &amp; infectious.Overall, Palm Springs is a hilarious &amp; heartwarming romantic comedy that brims with life and expertly balances its genre elements to provide a refreshing delight that's gripping from the get-go and remains an enjoyable &amp; entertaining fare for the entirety of its runtime. Steered by Andy Siara's flavourful script &amp; Barbakow's energetic direction and bolstered by Samberg &amp; Milioti's spot-on chemistry, Palm Springs is one of the best films of the year."}, {"id": 354, "text": "Palm Springs is one of those films that has so much to it. If you are looking for a really fun and fast paced romantic comedy this is for you. If you are looking for a deep and philosophical film that makes you think this is for you. If you want to be sitting on the edge of your seat this film is for you. If you like a fun science fiction adventure this film is for you. Palm Springs is one of those hidden gems that blends so many genres in one film while flowing perfectly. The story is so relatable with the days in the quarantine but also what is most relatable is our two main characters aren't perfect people. They have to learn to become better people from how they have lived their lives in the past. There are so many ways to look at this film but I will leave that up to you. The acting from Sandberg and Milioti is top-notch. The direction is fresh with a blend of beautiful cinematography. What really got me the most though is the music. The blend of old alternative music with a beautiful and almost euphoric score. This film is just an overall wave of emotions while being a roller coaster ride of fun! When the Oscar season is upon us they need to remember this flick!"}, {"id": 355, "text": "I'm not sure what brought me here, I think it was a random mention on a podcast or something. Nyles (Andy Samberg) is dragged to a wedding by his annoyingly perky girlfriend Misty (Meredith Hagner). He's not suited to either her or weddings, Nyles is a glass half full guy, a nihilist, a grump. Nyles though is also an awesome drunk, an activity he indulges in marvellously and one that helps him meet Sarah (Cristin Milioti). They hit it off, nearly hook up, then he gets shot by a dude in army fatigues with a crossbow! This is not your average romcom. The guy with the bow is Roy (JK Simmons), a guy from Nyles' past who is not too pleased with him cursing him to a repetitive world reminiscent of Groundhog Day. See, not average. Y'see Nyles is trapped in a loop, living the same day over and over. He's done all the things Bill Murray did, but we're not witness to that and this film isn't really about redemption. This is about Nyles dragging Sarah into the loop. Now it's not super original, but it is fun and both Samberg and Milioti are great to watch. He's the old pro, she's the novice. It's largely stupid, switch your brain off stuff as the two find humourous and frivolous ways to pass the endless day(s), but there's an obvious event coming in their future. Falling for one another. Something that throws them both off what had become a comfortable path. It's still a bit derivative, but it's well constructed and despite a dodgy montage where Sarah learns quantum mechanics it's really quite engaging. Considering what it's trying to do, it's very simple, but that's okay. As is all the silliness and the finale that made my eyes roll. I enjoyed a romcom fantasy, who'd have thunk it."}, {"id": 356, "text": "First, if you don't think this movie took an idea from Groundhog Day (the movie) then it's obvious you never watched that movie. As bad as it is to rip an idea of an already popular film, the twists added to this one make it worthy to watch, albeit once and never again.I like Andy and he's decent in this role but the whole movie is more melancholy than funny and while other actors can pull it off he doesn't. He should stick to being funny and not serious but I get he would want to show some range in acting. The rest of the cast is okay. Nothing special (except Simmons of course) and nothing memorable from the acting perspective.It's a perfect length at about 90 minutes. Unless it's a masterpiece, spending more than 90 minutes on a movie is hard to justify. It's about 1 hour 24 minutes or there abouts after the intro and end credits so it's not a lot of time invested.I would recommend watching it once just to say you watched and think of all the things they could have done in the movie. When I see a movie like this or Groundhog Day (with this one being rated R ) I imagine they could do far worse things with all the time they spend in the universe. They may say they have done things but doesn't bode well for the imagination. I hope if there's another movie like this in the future they will make it more of a sadistic type thriller instead of a rom com."}, {"id": 357, "text": "Palm Springs seemed promising to start off, but ultimately wound up kind of a let down. Part of that effect may have been caused by the rave reviews it received (at present, the film holds a 94% rating on Rotten Tomatoes), but I can't quite figure out what all the fuss was about.Things start off well enough. There are plenty of funny bits, including a brilliant sight gag in which Samberg's Nyles (boyfriend to a bridesmaid) threads his way across the dance floor to first approach Milioti's Sarah (the maid of honor), but where Palm Springs falls short is in the substance category.The two protagonists aren't particularly fleshed out - we never really learn if Nyles became disaffected before winding up in one of those infinite time loop situations you might have heard of or because of it - nevermind the rest of the characters, almost none of which I can remember with the clarity I can picture, say, Ned Ryerson from Groundhog Day. Samberg succeeds at making Nyles's go-with-the-flow nihilism charming; Milioti makes you feel Sarah's emotional baggage but also spends a lot of time just looking incredulous or overacting.The film falls short in the humanity department, which makes its saccharine ending feel particularly vacuous. Since nothing is taken seriously, the narrative just ends up feeling like an obligatory frame for the admittedly funny time loop gags."}, {"id": 358, "text": "GRADE: BTHIS FILM IS RECOMMENDED.IN BRIEF: A comedy about time loops and romance with much to say and it says it well.JIM'S REVIEW: Palm Springs is a far from original idea that is original in its execution. It take that well-used sci-fi trope of time loops and becomes a clever send-up of a rom/com. This date movie would have been a huge box-office hit had it premiered in movie theaters. Instead, it becomes another victim of the Coronavirus outbreak and is demoted to the small screen streamed to subscribers who can view it repeatedly in their homes at their own enjoyment and pace. It is a delightful modern-day romp in any format.Having more than a passing acquittance to Howard Ramis' 1993 comedy classic, Groundhog Day, we first meet Nyles (Andy Samburg, channeling his best Bill Murray's cynicism). He has been caught in this time warp after being drawn into a cave's mysterious vortex that carries him into another time dimension in which he is doomed to repeat daily events. This quantum anomaly brings Nyles into a never-ending wedding setting that also introduces us to Sarah (a delightful Cristin Milioti), the maid-of-honor. Sarah is the always the unhappy bridesmaid type. She get entangled in the time fold as these two misfit strangers slowly become a couple. Trapped together, they unite to try to escape the drudgery of their frequent recurrences.Solidly directed by Max Barbakow, in an impressive debut, the film adeptly sets in motion a series of incidents that replay with some slight variations. The screenplay by Andy Siara gets a bit too existential in its philosophic debate about the meaningless of life and its little things that make up our days. Still the script is smart and more intelligent than your average rom/com as it plays with the high level concepts of quantum physics, time loops, and screwball comedy. One wishes the script had given the supporting characters more depth and interaction rather than only serving them up as plot devices to advance the central love story.Adding to the pleasure of this sweet story of two aimless people who suddenly discover a purpose in life are the film's two lead actors. They are totally charming and completely convincing in their funny roles. Mr. Samberg has played this man-child character before, but he has never been this endearing. He plays Nyles as an insufferable and sarcastic chump, a beer-guzzling and self-defeating dupe unaware of life's subtle lessons. Early on in the movie, there is a lovely well-stage dance number that clearly shows the endless repeats of his daily existence as he makes his way across the dance floor with a series of rote moves that quickly establishes his dilemma. His callous attitude counteracts with Sarah's bumbling disregard of her own self-worth. She is the black sheep of the family, more interested in surviving the hours than truly living them. Ms Milioti's is a delightful foil, generating charisma and star wattage in her role as the hapless loser.Mr. Barbakow has assembled a deft cast to tell his tale which includes such fine veteran performers as Peter Gallagher, Dale Dickey, and June Scribb, all who need more screen time with their under-developed characters. J. K. Simmons does become an interesting third-wheel as Roy, a resentful old codger who is also trapped in the loop, but again, his character remains too disposable and sketchy.Palm Springs celebrates the perfect and the imperfect things of life with gentle authority and a great deal of humor. How many films can serve up this much fun during these COVID days when we ourselves are destined to repeat our own daily actions as well?"}, {"id": 359, "text": "I have always been a sucker for infinite time loop movies such as Groundhog Day and Edge of Tomorrow. So I was already thrilled to see this movie and it was getting a lot of praise from all the critics. There was just one problem I've had when thinking of watching this movie. I am not a big fan of romcoms...Let's start with some of the praises I have with this movie. Firstly, one of the important aspects of a romcom is the chemistry between the two leads. In this case, Nyles (Andy Samberg) and Sarah Wilder (Cristin Millioti) have great chemistry that is charming and effective. There are so many great moments between the two and seeing both of them perform silly antics such as a well-choreographed dance number is funny yet heartwarming. There are also strong performances from the supporting cast who play annoying over the top people to the point you can sort of see where the main leads point come from. Roy (JK Simmons) is the most relevant supporting cast as he is the third time looper and it is great to see him give a more wacky performance but I do feel he is sort of underutilised. Although, the main focus is on the main leads and in that case the lack of focus on supporting characters works in the movie's favour.Another praise is that they found a unique way to tackle the time loop genre that differentiates itself from the other time loop comedy Groundhog Day. Right from the get-go, it is obvious to us the audience that Nyles (Andy Samberg) has been in a long time loop and we are not learning about the loop with him but from him. Additionally, having multiple individuals in the time loop together allows for it to go in a unique direction. The director and writers utilising the time loop to show the relationship between the main leads developing and growing as individuals is fun to watch and sincere. They also use the time loop to as a plot device for surprise twist and revelations and the film certainly has a lot of great twists.Now onto flaws of the movie and the first comes straight away in the first 10 minutes and it is how raunchy it is. The trailer for the movie made it seem like a sincere and heartwarming time loop romcom, which it is to be fair it is, but this movie is extremely R Rated with it's over the top sex scenes that made me question if I was even watching the movie that was advertised. It gives a wrong first impression of the movie and I honestly wouldn't be surprised if someone stopped watching after the first 5 minutes because of how stupid and unnecessary these scenes are. I finished the movie and I still didn't get what these added to the movie. The answer is that it didn't and I question why they thought it was a great idea.The second flaw I have got to say is that this movie is defined as a romantic comedy and there are a lot of great romantic moments but honestly no moments that made me laugh out loud. They do a fair amount of The Lonely Island raunchy sex jokes but even then I still didn't find it funny. I got a couple of chuckles in some moments but none stuck out as memorable in the comedy department.Overall, it is a surprisingly very good movie and I thoroughly enjoyed it but not to the extent of how everyone in the media felt about the movie. The most important aspect in a romance movie is to get the audience to root for the main couple and this movie succeeds in this case. The movie is a great time if you ignore the first 10 minutes and you will no doubt come out enjoying it."}, {"id": 360, "text": "Starts off strong and kinda works itself into a romcom corner that it never really pulls out of or makes proper use of.As weird and disjointed as the actual... backdrop for the whole thing is, they mostly make it work for them. It's fun. Loved the bit with the bomb and the cake and the bow and arrow...At some point it's like they decided, ok the story has gone on long enough, we've made our jokes and milked this goat, let's just paste together some kind of ending and walk away. 3.2 seconds whaaaaat?...Despite this, I still give it a relatively high rating of 7, and that's because well, great acting, a lot of the jokes are good, and there's even some wisdom at odd moments.Also, while the romantic component felt well forced to me, it was thankfully not dominant and once it really got going was quick to... conclude..."}, {"id": 361, "text": "It is hard to write about Palm Springs, without comparing it to the classic 1993 Harald Ramis film Groundhog Day. I don't think the comparison is unfair - I have no doubt that the Palm Springs script writers watched Groundhog Day and realized there was still a lot of unexplored potential in the main plot device. The characters are stuck in a time loop. Whatever they do, when they sleep or die they just wake up at the beginning of the same day.The main innovation in Palm Springs is that when Sarah (Cristin Milioti) gets trapped in the time loop, she has Nyles (Andy Samburg) to act as her guide. Nyles has been trapped in the loop for a long time, and he is able to show Sarah how to pleasurably frit away her unlimited time. Having two people in the loop allows for both new hijinx, hilarious banter, and more characters to development. In the time loop genre, only the characters who repeat days can really grow.Palm Springs succeeds as a fun, unassuming comedy film, but it doesn't have the lasting impact of Groundhog Day. What made Groundhog Day memorable was the growth of Bill Murray's character from a self-obsessed misanthrope into a generous community man. Groundhog Day is a funny movie, but the movie isn't really about the laughs.Palm Springs is the opposite. There is some character growth, some minor plot twists, and a Deus-ex-machina ending to tie things up. But the story is secondary to the comic set pieces. There are some great gags in Palm Springs. I laughed out loud several times. Both Samburg and Milioti shine during the zaniest moments. Both are natural comic actors, and both their acting and the script provide lots of entertainment.The humor is also much raunchier than in Groundhog Day. Sex and drugs are major elements, and the language is definitely adult. It was the perfect film for a date night with my wife. It was light and funny, and made for a fun end to our evening. Then we went home, and fell asleep, and in a year I'm sure we won't remember a thing about it."}, {"id": 362, "text": "I was worried this would be another oh no! This groundhog day syndrome is making me feel crazy movie. I'm happy to say that it's not. It still falls into a few of the same beats, however. The characters predict events and words before they happen and eventually want to find a way out of the loop. But the bulk of the movie feels fresh.It takes a spin on the concept by letting the characters mess with all other people at the wedding, which is hilarious. And by the end it seems to be even more thoughtful than most other movies with the same premise. It touches on hedonism and love as a life motivator in a way that may be fairly shallow, but is still sweet and appreciated.Andy Sandberg and Cristin Milioti are funny as hell and work well together as a comedy duo. They really pull the whole thing together. Without them this whole movie probably wouldn't have been as good. The way the film is shot is a little dull apart from a few interesting aerial shots and the cave scenes. What really kept me interested was the chemistry between the leads and the fun script."}, {"id": 363, "text": "This is legitimately one of the best comedies I've ever seen. Andy Samberg is always a favorite for me. I love Brooklyn Nine-Nine, I love Lonely Island, I loved his run on SNL. Still, I walked in with some skepticism. Groundhog Day is hardly the road less traveled, so I had modest hopes. I wasn't prepared.I'll start with this: chemistry. The one thing that will keep me interested when all else fails is the cast's chemistry. If I'm engrossed in two characters sitting and talking with naught else happening, there's something there.Also, the movie managed to get something fresh into the mix: multiple loopers. I'm not going to say it's never happened, but I haven't seen it yet. I liked it.I would throw some shade at the protagonists fight before the climax cliche, but... if I knocked points off for that, there'd only be three movies in the world.9.8/10"}, {"id": 364, "text": "HOLY CRAP DID I LOVE THIS MOVIE. That one sentenced was the only thing that was going through my head after I finished watching this movie tonight at my local drive in theater with a couple of friends. My excitement for this movie I would say was very high because of how original and fresh the concept looked, yes the time loop concept has been beat to death but I don't think I have ever seen a time loop love story before which was very unique. But the story isn't the only positive thing this movie has to offer. The whole cast is extremely good and funny, yes samberg is good as usual but the main standout here is cristian Milioti who steals every scene she is in. The movie is also extremely fun and had me laughing out loud many times and honestly had me close to tears. The music is also very good. The twist and turns this movie also takes are also very unpredictable and had me Quite shocked a couple times. I honestly have no cons with this movie at all. Overall, I loved Palm Springs and it's a movie I can see me watching again and again, if this movie looked at all interesting to you I would say for sure give it a try because it's for sure worth your time."}, {"id": 365, "text": "'Palm Springs' directed by Max Barbakow (incredibly at his first feature film) is for me the good surprise of the end of this strange cinematic year 2020. It is also a film that proves once again, if necessary, to skeptics and cynics that there are entertainment films and romantic comedies that do not insult the intelligence of viewers, and that 'feel good' movies can contain a dose of fantastic (and even references to quantum mechanics). The premiere of 'Palm Springs' took place at the Sundance Film Festival, after which the movie was supposed to be screened in theaters, but then the world froze and same as many other productions Barbakow's film had to find a streaming platform as its main broadcast channel. I'm so sorry for their missed opportunity, because this funny movie would have had good chances to be the big surprise and maybe even one of the blockbusters of the summer of 2020. Unfortunately, COVID-19 had other plans.The film begins with the awakening of Nyles (Andy Samberg), on a sunny morning in a resort in the middle of the desert, where he accompanies his (not very committed) girlfriend to the wedding where she is the bridesmaid. Nyles, a rather non-conformist guy, almost ruins the party with an impromptu speech influenced by intense drinking at the bar, and later in the nighr he he meets Sarah (Cristin Milioti), the bride's sister and the family's 'black sheep'. The two seem to have a 'click' that will take them to the desert at night where the beginning of a sexual encounter is interrupted by an event ... and here I stop telling more about the story so as to avoid falling into the sin of spoiling.What happens next is a combination of crazy and romantic, fantasy and clever comedy. Many comments on the film mention that the inspiration comes from 'Groundhog Day', a film I have not seen. What I can say is that I did not find any logical flaw in the script written by Andy Siara, who manages to give credibility to the pretext and substance of the characters, makes us viewers care about them, and even adds a touch of science with which the heroes will come out from a complicated situation. I didn't know the two lead actors or I don't remember them from other movies, but they both manage to win our empathy. J.K. Simmons, an actor we know from countless television series, is distributed here in a very different and original role. 'Palm Springs' is one of the best entertainments of the year, a kind and smart movie that I warmly recommend. It's fun."}, {"id": 366, "text": "I'm not a huge fan of romantic comedy genre, but Palm Springs is something extraordinary in this genre, especially because of implementation of ''soft'' sci-fi elements. I didn't expect that I will be so much impressed by this film. I thought it will be typical romantic comedy, with classic drama made by main characters, but I was positively surprised it wasn't something like that.Story is interesting right away from the start, and it keeps you interested until the end, which is quite rare for me to find in this genre. It doesn't use any cliché, and makes new, positive and funny elements into the story. All of actors deliver amazing performance and casting is very fitting to the roles. Setting and scenery is also good, I doubt it would have similiar impact if they changed it to some other location. Direction and pacing are well done, I never felt that movie looks weird or it is very fast or very slow.In conclusion, Palm Springs is a romantic comedy movie that you definitely should watch, it has everything that you need to enjoy: good story with refreshing elements added to it, beautiful setting, amazing actors, it keeps you interested and delivers fitting end, all of that with enjoyable pacing."}, {"id": 367, "text": "Time to come clean, I've never been an Andy Sanberg fan. Almost every time he's involved in something he's been unlikable in one way or another. Here though, he may be my favorite part. He gives a surprisingly restrained performance, only doing his normal loud guy schtick a few times. I like his character on the whole. The film is basically another ground hogs day where he is trapped in a time loop before another girl gets stuck with him. So he's incredibly jaded and nihilistic having spent an eternity in this time loop. Almost everything else though, is kinda blah. His love interest is, of course, the girl he gets stuck with, Sarah. Which is a stupid obvious plot point even if it's mostly well done. The worst part about this romance is, unfortunately, Sarah. Her character almost exclusively is a childish baby that can't deal with her problems. She's attractive but that's sorta it for her. However, there's another person stuck in this time loop, JK Simmons. Who wants to take revenge on Sandberg for trapping him in this loop. He isn't exactly a compelling character and only exists to have a nice little moment of clarity with Sandberg to explain the themes to him. Which encapsulates the story as whole honestly. It isn't breaking new ground or really trying anything new at all. The majority is just the romance plot until the inevitable, 3rd act low point that is meant to throw these characters apart. It really isn't that well developed and the twist that leads to it is painfully obvious. Then there's a whole plot that comes up directly at the end where the characters attempt to leave the time loop using science. It's just another thing that feels tacked onto this story. The humor too is something I can't say I liked. I got a few laughs from this, that's about it. The rest feels a bit low brow. I can't say I disliked this on the whole, but I enjoyed the character driven story. Especially the Sandberg character. Other then that I found it rather bland. It's not particularly well made or shot, in fact some parts are kinda ugly. I was constantly wishing for more out of the story and every plot point feels forced or obvious in one way or another. I didn't hate it, but ima forget it pretty soon. Better then that awful Marlon Waynes Naked movie everyone has already forgotten about."}, {"id": 368, "text": "This movie steals on a large scale from another movie called Happy Death Day 2U . It even without guilt relate the reason behind this time loop to the Quantum theory (Where Hollywood decided blaming every thing lately on it despite being irrelevant just because it's some vague theory and few people understand it) which is exactly what Happy Death Day 2U established to justify time loops .I could have marked dozens of other similarity but yet I like sticking to my format of reviews of minimal to no spoilers .As for the movie itself , the pace is not boring , it did not play on being repetitive as all time loops movies like to , but still , you do not get quite engaged enough nor care what happens next as a result of all characters being developed so you hate them .So bottom line if you haven't watched Happy Death Day 2U this one might seem okey , but if you did , then the value of entertainment this one gives becomes minimal .P.S Deus Ex Quantum is a claimed propitiatory by me , do not abuse it or else ."}, {"id": 369, "text": "I watched many stuff by Andy Samberg, and I personally think that through the years he was always able to bring on screen fresh and funny stuff on screen, Palm Springs is no exception, but in this case his role feel more complex and complete, compared to other characters that he played. Sure, there are funny moments and Andy will make you laugh with his typical comedy, but at the same time he will have some dramatic scenes, where he will be more serious. I really appreciated this and I liked how the movie developed the story. Palm Springs feel really balanced, there is always the right amount of comedy, and the right amount of drama. Special effects are well made and not too invasive. The result is a really enjoyable movie, it has the right length and it manages to be entertaining and engaging for the whole one hour and a half.Unfortunately, I cannot give more than six stars, because the plot is not original at all, and it is a movie that I will soon forget. It is a really nice flick if you just want to relax by watching a light-hearted comedy, but that's it. There is nothing peculiar that make this movie stand out from the genre. Even if the relationship between the two main characters is very solid, is not enough to create a memorable movie."}, {"id": 370, "text": "When you feel the editing is the best thing about a movie, something's gone wrong. The main problem here is the script, which fires out volleys of would-be wisecracks, one-liners and diversions, only to succumb to icky sentimentality. On the plus side, the obvious derivativeness of the piece is shamelessly displayed for all to see, so let's give it full marks for honesty, at least.The actors do what they can to keep us entertained. For my taste, Christin Milioti succeeds, Andy Samberg doesn't. The supporting cast includes a nice turn from Meredith Hagner, some welcome warmth from J.K. Simmonds, Peter Gallagher and, in a sweet cameo, June Squibb.Rom-coms are not my thing, I admit. This merry-mawkish offering goes a long way to explaining why. But it's by no means the most offensive of its kind. You literally could do worse."}, {"id": 371, "text": "Palm Springs was directed by Max Barbakow and stars Andy Samberg, Cristin Milioti, J. K. Simmons, Camila Mendes, Tyler Hoechlin, Meredith Hagner and Dale DickeyPalm Springs tells the story of Niels (Andy Samburg) who bumbs into and falls for Sarah (Cristin Milioti) at his girlfriends sisters wedding. But things get a lot more complicated, when Sarah wakes up in the same exact day again.Going into this picture I had high expectations, because people who saw it when it originally premiered at sundance back in January all loved it.Firstly I taught the chemistry between the two leads was great. I like how at first Nyles was a mentor to Sarah but they slowly start to grow a relationship with each other. I know that sounds really cliche, but the relationship is so well paced that it makes it work to a tee.I also liked how this film took inspresation from groundhog day but didn't overdo it and because of which, makes this film feel fresh.Also the preformances are great here. For the time he's in the movie Jk Simons is of cource as always is brilliant here and the exact same can be said for... and... honesty everyone is superb here.As far as complaints go I felt that Niels's wife was just there to cheat on him and also to be used as awful overused comic relief.Finally I didn't like the ending because it felt like if they cut it by fife minutes it just would have left the ending up for interpretation, which would have hit home the message better.Overall despite a few annoyances I taught Palm Springs was a great movie. With fantastic performances and a great debut by Max Barbakowand. For me it is one of 2020's best movies (so far) so I would certainly say see this movie at all costs."}, {"id": 372, "text": "It's one of those heartfelt indie movies that you can appreciate. I also like how they give Andy Samberg a serious side in this movie with a comedic role while introducing other low-key brilliant actors and actresses in this film, even giving Cristin Milioti a movie to show how excellent and underrated of an actress she is also why she deserves more big roles going forward into the future; JK Simmons is also a fabulous actor that knows how to portray antagonizing characters very well -- but today I say he was born to play J. Jonah Jamieson as I believe it's his best role before his in Whiplash. If you as me today, deserves an Oscar nomination for best original screenplay.It has the same premise as Groundhog Day with Bill Murray, but what I love about it is that there are hidden clues within the movie that gives more for you to think about. But what I think I would've liked to have seen get added within is more of a story as to why Andy Samberg's character of Nyles went into the cave in the first place, I have a strong and wise idea as to what lead him there."}, {"id": 373, "text": "There's a reason people don't copy Groundhog Day despite the premise being something so tempting to repeat; like time travel or body swapping. Groundhog Day is it's almost a perfect movie, to invite comparison is to risk being inferior. Edge of Tomorrow was the last quasi successful movie to try.Palm Springs is NOT a success. The setup is familiar. Niles is stuck in a single day loop and has already accepted his fate in a kind of nihilistic defeatism. That is until someone else is sucked into the loop with him. Now, this would be like being stranded on a deserted island and finding on day that someone else has washed ashore. It would literally be the most world changing event in your otherwise purgatorial existence. You would think finding a kindred spirit would give his life purpose, but the even is treat so blasse as if it's just another rerun for Niles.So if we're not supposed to take this seriously then it's just a big dumb romantic comedy without any of the existentialism or deeper meaning we get in Groundhog Day. Ok fine, Edge of Tomorrow pulled that off. But that mean it has to be funny. This is not. There's lots of yelling, swearing, ridiculous drug usage, constant drinking, and pithy one liners and quips. Turning the craziness up to 11 isn't going to work. It has none of the comedic timing of Bill Murray and certainly not the more natural character arc. The jokes all so obvious and so disappointing coming from Andy Sandberg's often brilliant Lonely Island.JK Simmons feels like a throwaway. His plot relevance could have been any other character spouting the same wisdom, but I guess that wasn't zany enough for the director. There's a brief moment in the middle where they try to get to something deeper but it doesn't amount to enough. That the movie starts and ends on bad wedding speeches may be the most fitting thing about the movie. It's derivative, tries to be funny and fails, is longer than it feels, and you really just want the whole thing to be over."}, {"id": 374, "text": "As many others have already pinpointed, this is literally the third millenium Groundhog Day. We have Nyles (Andy Samberg) who is trapped in a time loop for 40 years (not mentioned in the film) and is forced to live the same day over and over again. He is soon to be joined by the cute Sarah (Cristin Milioti) by some accident and the duo will share this time loop business together.For the first half of the film, the two leads make some great, original fun on the curtain. They banter, do stupid stuff and bring us a lot of chuckes and laughs. What is inevitable though, is that they fall in love and suddenly we are drawn into the same old same old rom-com which we've seen a billion times before for the rest of the movie. I personally don't know how different I would write/make this film or which direction I would lead my story, but I found myself to be wanting more and more time loop, chit-chat and ridiculious nonsense and less and less rom-com, those old, cliched formulas too familiar and too tiresome to care about.Nevertheless, I've had a good time watching this, especially in the first half. It's a solid chill-out and relax film that has some originality to offer as well."}], "reviews_amount": 375}