{"name": "The Big Ugly", "titleId": "tt09441638", "reviews": [{"id": 0, "text": "Loved this film! Ignore the bad reviews and the critics who think they know what they are talking about. A super talented cast with an excellent storyline. Would recommend for sure! A great ending also btw."}, {"id": 1, "text": "Everything you expect and more. Brilliant movie, phenomenal cast and a great story, alongside well shot action scenes. Would definitely recommend."}, {"id": 2, "text": "First, the cast is good for a cheap action B movie. Vinnie, Ron and Malcolm do an acceptable job here. Second, the script itself it's simple but well executed. Last, Vinnie here looks more human than ever. Remembered me sometimes a cheap Clint Eastwood in Gran Torino. So, overall an acceptable B-action movie from the old Vinnie."}, {"id": 3, "text": "Any movie with Vinnie Jones it it, you know it's good. I love his natural gangster style appearance and demeanor in his movies. Given his reputation of the toughest football player ever... he is perfect in playing the villain. Good to see legendary actor Malcolm McDowell still going strong. (Calligula, Clockwork Orange)This movie is a bit of a change to other Vinnie Jones movies... here he plays an aging gangster with a compassionate heart. A very good performance.This is not the best of this genre movie I have watched, but I do rank it up pretty high. I enjoyed it."}, {"id": 4, "text": "The film loses points with me on the basis of Vinnie Jones' character. By all accounts he looks and acts the part of a bruiser, but in the pair of scenes in which he goes against Junior Crawford (Brandon Sklenar), the guy who's visibly about half his size works him over without much trouble. And he's nominally the bodyguard for London mob boss Harris (Malcolm McDowell), who consistently berates the guy for not attending to business where his girlfriend is concerned. What's odd and different about the story is that by the time the principal players get done doing away with each other, the ones left standing to make a quick getaway are a couple of ancillary characters who didn't figure prominently in the initial proceedings. Which is OK I guess because it makes for an unconventional resolution to the picture, about as exciting as Preston Lawford's (Ron Perlman) showdown with Harris, done from a sitting position because let's face it, after all the booze they consumed, they probably couldn't stand up."}, {"id": 5, "text": "This movie was a lot of fun to watch. Great characters. Perlman, McDowell, and Jones do the heavy lifting, and fighting, as expected. But there is also an awesome supporting cast of characters that help color the plot and provide some great eye candy."}, {"id": 6, "text": "From the beginning there's lazy narration, lazy character introductions, nothing really happening.. the women are reduced to objects, the men just kinda grunt and barely do much. Some guy gets shot in a barn for seems like no reason at all. A movie is supposed to be visual/ moving... but the characters just sit around the whole time talking to each other about the same thing over and over. There's no real character goals. Who is the hero? Vinnie Jones or Nicholas Braun? Who is the villain? Junior or Ron Perlman? Really didn't know who to root for or against. Leven Rambin was very underutilized. I was expecting an awesome Vinnie Jones vs deliverance backcountry Appalachia, violent, action packed and instead got a snooze fest. Also I feel like The Gentlemen is basically the same movie idea but done much better and with way more clever dialogue and scenes."}, {"id": 7, "text": "Great movie. Watched it 2x's already! Fighting scenes were awesome! JUNOIR and NEELEYN'S fights where excellent as well as each characters relationship with each other. Everyone hurts on some level. Very relatable. I was sad for Junoir and Preston's relationship. Both hurting. Ron Perlman was excellent in every scene he did. Junior ( Brandon Sklenar) puts on a stellar proformance. Vinny Jones was excellent also. I can't say enough about The Big Ugly Its a must see movie."}, {"id": 8, "text": "It's just good now stop posting random bad reviews that don't have anything to do with the film"}, {"id": 9, "text": "The Big Ugly is about an English crime enforcer looking for vengeance after the love of his life is killed in West Virginia. The fact that she was drugged and killed by the son of an oil man who happens to be best friend with the enforcers English boss complicates matters as do the 25 million pounds which one has given as a loan to the other.This movie is not as bad as one could expect and the actors including Ron Pearlman as the Oil Man and Malcom McDowell as the British Crime Boss are decent in their supporting roles. Vinnie Jones as the aggrieved enforcer is not bad either. The fact that all three had a hand in producing the film probably had them act as well as they could. The actors in the smaller roles are all ok as well. The biggest problem here is the bad story which feels like it is dragging way too much and gets too slow and at times repetitive. Most of the characters also feel either like too much of a cliche or do very dumb things to advance the plot. Overall, this was not very exciting or engaging although everyone tries their best to produce a decent film. It could have been much better had the story been better written."}, {"id": 10, "text": "This movie starts off slow and kinda boring but if you are a real movie fan, you can spot a movie that will not disappoint. the characters are top class,btw the plot is not about junior,the ending is classic, makes you forget about the begining."}, {"id": 11, "text": "Loved the action, however need to see it again to fully understand the story behind it... not so much the plot."}, {"id": 12, "text": "Hard-Guy Vinney, soccer-player-turned-actor just about acquits himself here. The W. Virginia location looked good, as did the contributions of his screen-partners Ron Perlman, as aged London gang-leader, Harris , and Malcolm McDowell, red-neck oilman's-leader, Preston. The clash of culture between limey metropolitan gangster and backwoods oil-man, with an unexpected ecological &amp; ideological tinge was always going to be a pretty difficult one - as it proved. The real disappointment here was the Plot, which started OK enough, but really was grasping for straws a long time before the last reel of film."}, {"id": 13, "text": "I must admit when i saw the casting i was expecting at least some great moments of acting between the Trio Mac Dowell, Pearlman and Jones and i'm sorry to say i didn't have that.... This movie is bad from the core : the script is poorly written, there's is no good dialogue so no good acting moment possible between protagonists. Lots of useless scenes. The editing is lazy. The music choice is lame most of the time (all the time!). I watched it to the end hoping for something good happen to save it a little bit but it didn't come.... Very disappointing and very Boring... i put 3 stars for the 3 stars in it...."}, {"id": 14, "text": "This movie has EVERYTHING! Friendship, romance, betrayal, and redemption. And a lot of action."}, {"id": 15, "text": "Don't expect another Lock Stock type film and don't expect too much. The story line was pretty good but sad to say some of the acting was not. Watched it till the end and never once thought about turning it off."}, {"id": 16, "text": "Hey, there were 3 of my favorite actors - Vinnie Jones, Malcolm McDowell and Ron Perlman. In a gangster movie. How cool, I thought. In the end, it was not cool, a bit tepid. Started out well, the premise and the set up. Then it fell flat all the way, meandering through the plot, until the final shoot out. And even then, for those expecting a brutal, bullets flying, blood splattering violence between a vengeful hard man Vinnie and a badass Perlman, you're gonna be disappointed."}, {"id": 17, "text": "The film had a good plot but was unfortunately butchered by the lack of character profiles and terrible script writing, the action scenes sucked, it was like the producer was a fan of sons of anarchy and snatch and thought  ooo that would be a good film!"}, {"id": 18, "text": "The plot fell apart, it had holes in it and was easy to see through. The acting by Ron Perlman and Malcolm McDowell was as is it has come to be expected, very well done. I've seen Vinnie Jones as a bad guy in many movies, but in this movie as a vengeance seeking man, he has performed his best work yet."}, {"id": 19, "text": "... but a very solid 4. I *wanted* to like the film but Vinnie going off on a lengthy, philosophical, big word-laden rant finished it for me. I could have spewed. It was already shïte at that point &amp; got progressively worse. Only gave it a 4 because it was dedicated to Mr Jones's late wife who died recently."}, {"id": 20, "text": "Another pile of woke, politicaly correct horse manure. The cast should be ashamed of themselves."}, {"id": 21, "text": "I only got this because i like Ron Perlman but he was wasted in this boring trash!!! Vinnie Jones can't act is horrendous here &amp; everything about the film was crappy &amp; all characters are scum. Absolutely No redeeming Qualities at all"}, {"id": 22, "text": "A truly awful movie. Avoid at all costs. You'll never get the 1hr 45mins back"}, {"id": 23, "text": "This film start with the narrator talking about oil and god, and the introduction of three main character(Neelyn, Harris, and Preston) scene! As turnout, this film is about Neelyn need to take revenge on Preston's son Junior, after Junior causing his lover Fiona death! Entire film full of boring conversation, and annoying overuse scene! Such as, overuse of the drinking scene, overuse of the smoking scene, overuse of the song playing at the background scene, overuse of the flashback scene, overuse of the searching scene, and overuse of the flirting scene! Make the film unwatchable! All the action scene in the film have blood at certain point, but overall portray by sideways! Barely intense scene is, Will blow up a truck! At the end, Neelyn kill Junior! Harris, Preston shot at each other and die! Will and Kara escape with a plane! That's it! Another disappointed film!"}, {"id": 24, "text": "The film sees Vinnie Jones in a role that you imagine could be Big Chris from 'Lock Stock', 20+ years on. Older, more world weary and finally in touch with his emotions.A standard revenge story set within an Anglo American gangster setting, the film isn't bad, but could have been much better, given the onscreen talent"}, {"id": 25, "text": "Where to start with this nonsense! With real heavy weights like McDowell and Perlman, I thought we would have some substance, but it looks like a cheap payday was on offer. Jones can't act, so when he appears as the main character, you know the film will struggle!. I am two thirds finished, it's so poor I'm thinking of switching off! I can't think of one positive from this film, cheap,nasty film, with no plaudits!."}, {"id": 26, "text": "Well you'd expect a film with Malcolm McDowell and Ron Perlman in it, to be halfway decent. It was just about watchable really. Formula revenge movie. Not interesting, poor script, and it didn't always make sense. It had actors, just needed a decent script, a plot that flowed and made more sense, and some twists and surprises to give it some interest."}, {"id": 27, "text": "No character backgrounds confusing. Just really boring. Great cast of good actors but lacking any real purpose in the story. Just awful"}, {"id": 28, "text": "What an utter waste of acting talent. Shoddy storyline, weak script adaptation and terrible production. Good soundtrack but wasted on the film. The Lock, Stock style film has been been done 20 years ago so it's time to stop using its style in the new real eases 'cos it does not have the same impact now."}, {"id": 29, "text": "Wasted 97 mins an 15 secs of my life on this. bad script. awful acting. anybody giving more than 4 stars is connected to movie. spoilers:everything about this movie us terrible"}, {"id": 30, "text": "This movie is just wow. A whole package of entertainment itself+The plot is good too. Just Incredible!!!!"}, {"id": 31, "text": "Thank you to everyone in the Movie studios who worked hard to make this movie."}, {"id": 32, "text": "This movie is super great and awesome everyone should see it...."}, {"id": 33, "text": "Awesome movie! Great action, acting, and story line. A must see on the big screen!!"}, {"id": 34, "text": "Beautiful visuals, really colorful movie, costumes are amazing. Great acting!"}, {"id": 35, "text": "Vinnie Jones best performance since Snatch!!! Loved this crime drama!"}, {"id": 36, "text": "Perlman is awesome! Everything you want in a revenge-action flick"}, {"id": 37, "text": "This movie is one of the best live performances. I like it so much"}, {"id": 38, "text": "I enjoyed every minute of this movie.Great job! It's a must watch."}, {"id": 39, "text": "Visuals and graphics are eye candy and music is wonderful."}, {"id": 40, "text": "This is a great movie and the three main actors were amazing!"}, {"id": 41, "text": "Underneath the slick production and lush green background of the eastern woodlands of the United States lies a Hell of a story! This movie has lived in the Top Movie section of iTunes and other at home providers for a REASON. Ron Perlman and Malcolm McDowell fans will not be disappointed at their supporting roles which transport Vinnie Jones to an absolute break out performance as a lead actor. I will be watching this again😃"}, {"id": 42, "text": "Just fantastic all around, and I really enjoyed the way it was told, the past and present and how it flowed so well."}, {"id": 43, "text": "Those who gave it a bad review made up there mind before the movie came out. I 100% reccomend it you will not be disappointed."}, {"id": 44, "text": "The Big Ugly is a typical story you can expect with Vinnie Jones. Vinnie Jones was as a footballer (soccer player for the Americans) already one of the meanest player there could be and in his movie career he's just playing that same character over and over. I guess he has the face for it, but it would be nice to see him playing something different in the future. Vinnie Jones, Malcolm McDowell and Ron Perlman did a fairly good job playing their characters, the story on the other hand is one of those stories we've seen before, macho against macho seeking revenge. It's all déjà-vu but it's entertaining if you like that kind of stuff. Good enough to watch once."}, {"id": 45, "text": "I really tried, but the story is paper thin and the pace is just boring. This movie could've been a 44min episode in a series and it would've been fine. But as a movie Zzzzzzzz"}, {"id": 46, "text": "I would love to see a good Appalachian noir, but this turkey ain't it. Vinnie Jones, Ron Perleman, Malcolm McDowell, that woman who was in Justified...god bless 'em, they all try real hard, but the material is very weak and the direction is half-assed at best. Unconvincing on every conceivable level."}, {"id": 47, "text": "A hodge podge mixture of unconvincing, unrelated interactions between respected actors to delude prospective viewers from watching intelligent movies. A job creation effort for good and not so good actors."}, {"id": 48, "text": "Terrible. It's just awful. Embarrassing.Dreadful pacing, terrible dialogue. Holier than Swiss cheese. The story line is so dull. It's not even so bad it's good.One assumes Perlman, Jones and mcdowell are all short on funds"}, {"id": 49, "text": "I had serious misgivings about this film and figured it'll just be another run-of-the-mill sort of gangster revenge movie that's probably not very good - I was dead right.Its a pretty good cast and to be honest they do an okayish job of it in the main but its all downhill from there. Abysmal storyline, lame score, poor editing and camerawork - don't waste your time on this trash."}, {"id": 50, "text": "This is an ok movie at best. The cast is actually quite good but sadly under utilized. For this type of movie there needed to be a lot more action than the film ultimately delivers.Hats off to the villain, he really does deliver but its not enough without the moments of combativeness to capitalise on the heat that's been generated.Passable."}, {"id": 51, "text": "If you are having trouble sleeping, put this film on. If you don't have trouble sleeping this will send you to sleep anyway. Ok to have on in background while on phone, in fact watch the trailer and that's the best bits."}, {"id": 52, "text": "THE BIG UGLY is a trashy little production that attempts to tie together East End gangster hijinks with some hillbilly trash drug running. The two genres are unwieldy at best and at worse they never really gel at all. An aged Vinnie Jones - an actor I don't mind at all, actually - doesn't really get going in this one and his imposing nature has diminished over the years. Malcolm McDowell and Ron Perlman are relegated to sitting-in-the-chair type scenes for name value alone. There are a few fight scenes and shoot-outs but they're staged in unremarkable ways, and unremarkable is a good word to describe this film overall."}, {"id": 53, "text": "You're looking for answers. Aren't we all. Me, I'm looking to watch a movie. I'm looking to take in something where lock, stock meets the greasy underbellies of a Waffle House. And yup, Vinnie antihero Jones and his scowl better be there.Anyway, The Big Ugly is my latest review. Released by way of Internet in July of this year, Ugly is a shambled, southern-fried noir that's produced by almost everyone starring in it (Jones, Ron Perlman, Malcolm McDowell). Billed as a straight action spectacle, The Big Ugly is anything but.So yeah, Ugly was shot in Kentucky, wanted to be shot in Ohio, and takes place in the Appalachians of the Mountain State. Either way you slice it, you're getting a full onslaught of baddie shenanigans and double crosses in Middle America. Characters get beaten, drunk, and/or plugged, 70's pop tunes show up in various scenes, women are objective cogs, and a cocktail called bourbon and milk is dutifully introduced (or at least it was to me). Ugly indeed.Filmed about two years ago and featuring a closing credits montage set to Exile's Kiss You All Over (this gag felt more warranted in 1993's Dazed and Confused), Ugly's story hinges around a London mob outfit that gets involved with some West Virginia oilmen in hopes of getting rich via some dirty laundering money. When a girlfriend of one of the mob bosses gets murdered unexpectedly, revenge is carried out and all heck breaks loose.With some shoddy editing, some recycled machismo line readings, and some out of place narration, Ugly's all over the place account doesn't really help move things along. By the end of Ugly, the dramatis personae involved are meant to feel more important than the viewer that is watching them. Bottom line: A mixed review for The Big Ugly was big easy."}, {"id": 54, "text": "They did this one really really good, amazing movie"}, {"id": 55, "text": "We loved it! The cinematography &amp; actors were brilliant. We were hanging onto the edge of our seats until the very end. We will definitely watch it again!"}, {"id": 56, "text": "For me personally, this movie is about the internal struggles we all have to deal with at some point in life. This movie was real life for me and not overly dramatic. Worth watching."}, {"id": 57, "text": "You will enjoy this gangster movie, with twist and turns, interesting plot, with humor ,mystery and excitement. The choice of actors were perfect. Love Ron Pearlman and all the actresses and actors characters portrayed the personalities they needed to be in this type of mobster culture.. very precisely. I am thrilled to see a awesome movie during this stressful time in the world. Tune into this superb movie, deep messages and have an escape. ENJOY!"}, {"id": 58, "text": "The script is awesome the execution is awesome and the actors too."}, {"id": 59, "text": "This movie is absolutely hilarious, and perhaps that comes partly from how relatable it is."}, {"id": 60, "text": "Let's be honest, this film has a strong list of character actors that normally fill a supporting role. Vinnie Jones does a good job as the lead character played with depth and subtle charm. This is unexpected, as he's normally the heavy. The writing is ok, the filming is well done. Overall, it's a good job for an indie film shot on a small budget. I give good credit to the filmmakers as they seemingly did the best with what they had. I was happy to see this in a theater."}, {"id": 61, "text": "Harris (Malcolm McDowell ) is a London mobster who needs to have some money laundered. His good friend Preston (Ron Perlman ) is an oilman in West Virginia. Harris invests 25 Million quid through a local bank. Neelyn (Vinnie Jones) is Harris's muscle. Neelyn's girlfriend turns up dead and all roads lead to Preston's only son (Brandon Sklenar ).The title refers to a location in West Virginia and not Vinnie Jones, Ron Perlman, or Mookie Wilson. The plot was horrible but the characters and dialogue kept me interested.Guide: F-word. Sex. No Nudity."}, {"id": 62, "text": "Possibly because my expectations were so low I liked it more than it deserved, but I don't think so. I like the actors, the story sounded good and the price was right, so I bought for my collection. Happily, I liked it a lot. Why? Well, to begin with, it portrayed several somewhat complex relationships; Neelyn and Fiona, Neelyn and Harris, Harris and Preston, Preston and Milt, Junior and pretty much everyone. Point is, there were many varied and unique character connections. The characters themselves were well fleshed out, most with a back story.The amount and degree of action was appropriate and entertaining. Killing may have been a bit overdone (a bunch of people killed a bunch of people).I feel that the production elements like photography, settings, fight choreography, directing, etc. were all above average.Unlike some other reviewers, I thought the acting was top notch.Bottom line, give it a chance... you may like it."}, {"id": 63, "text": "I was initially interested in this because of an article about it being filmed in the area of Morehead, KY. Malcolm McDowell's son was so bored spending time in Morehead that he requested to go home rather than spend another night walking around in the local Walmart. I don't blame him.I started out watching out of morbid B movie curiosity, but eventually warmed up to the story. I've known guys like Junior IRL and in many movies. Immediately upon meeting Junior, I knew this movie version would probably be getting his comeuppance in the end. However, I didn't know how everyone else's story would play out. There were a lot of small stories being woven into the picture and those are what kept me around. I don't feel it was time wasted.I think this is my first review. I only wrote it because I thought some of the others were much too harsh."}, {"id": 64, "text": "Everyone knows Vinnie Jones's acting ability is limited . After all he is a footballer by trade but what Vinnie does do on screen , he does well and this performance in The Big Ugly is no exception.Neeyln is a loyal enforcer for crime boss Harris back in London, taking care of problems and people that disrupt his illicit business. When Harris strikes a deal with an old friend - American oilman Preston they find themselves in the wild hills of West Virginia. Neelyn's girlfriend disappears, last seen with Preston's wayward son Junior. Lines are drawn between family and friends, but nothing will stop Neelyn from getting retribution.Cockney gangsters v Redneck Americans . What's not to like ? Sure , this is never going to win any awards but I liked it . The poster will put a lot of people off because it makes it look terrible but it's certainly not the case .There are some good actors on display . Malcolm McDowell , Ron Perlman and Nicholson Braun to name a few and what this lacks in substance it certainly makes up for in heart ."}, {"id": 65, "text": "I actually quite liked it in many ways. The acting is pretty good. Ron Perlman is always awesome, and Malcolm McDowell is also great in the part of the old governor past his prime.Where it really works well is in their characters interaction towards the end. There's a real sense of people with their own honor and ties of friendship who are at odds suddenly. Honor, blind commitment, and ideals of justice are all tested.The problem with the movie as a whole is the plot falls apart after the first half, especially in the last 20 minutes. There are quite a few earlier scenes where I had to suspend disbelief as to how people would act in those situations, but the ending is pretty much unbelievable and tested that suspension too far.Good acting and cinematography, but not enough plot ideas unfortunately to prevent the holes showing."}, {"id": 66, "text": "The Big Ugly Micro Review -First and most importantly Ron Perlman is absolutely fantastic. Vinnie Jones, Malcolm McDowell, and Bruce McGill are also all wonderful. Unfortunately, the film's positives end with its cast. The Big Ugly features a great setting with intriguing character relationships but fails to deliver on its promise of West Virginia Gangster Shakespeare.The Big Ugly has numerous questionable production choices. Interior bar scenes are filmed against bright large front windows blowing out the shot. The editing is extremely overworked bouncing around the room without motivation other than to give the appearance that talking about events is fast paced. The action that is portrayed in this genre gangster film is generic and forgettable lacking any personality.Perlman, Jones and McDowell elevate the quality of a film that would have been a complete disaster without their natural talent, charisma, and excitement. That's the disappointment aspect of The Big Ugly. The story idea is actually interesting with an upper class West Virgina Gangster family dispute. Unfortunately, the talent of the Big Ugly's actors are miles above the quality of the film."}, {"id": 67, "text": "London gangsters in West Virginia: that's what this movie is about. Malcolm McDowall has twenty-five million quid he wants to launder; Ron Perlman has oil in West Virginia he wants to get out of the ground, and the banks won't make him a loan, despite his insistence he can do it and leave the land in good shape. So they strike a deal. But McDowall has his goonish associates out of a Guy Ritchie movie, including Vinnie Jones; while Perlman has a son who is not the brightest bulb in the socket, played by Nicholas Braun; and the woman around this town are very pretty.Sothey clash, with increasing violence throughout. And the men are thoroughly unlikeable, except for McDowall and Perlman, who want to be businesslike, and the women seem to think that it has nothing to do with them; and so a bunch of people who show neither wit nor character are fighting it out, and why should I care?Cinematographer Jerry Osbern shoots the movie very well."}], "reviews_amount": 68}