{"name": "The Stalker", "titleId": "tt09363342", "reviews": [{"id": 0, "text": "Obviously all those who gave good reviews must be on the director's payroll. There should be some guidelines by IMDb for fake misleading reviews. Absolutely crap on all levels!"}, {"id": 1, "text": "A great indie thriller with solid performances. Everybody is a suspect and you just don't know whom you can trust. The parents' plight is relatable as someone stalks their family. The kids get a little lost in the dilemma but that's okay as the main focus is with the parents anyway and how they are going to deal with a stalker coming for their family. And fortunately the parents are very relatable. It definitely has twists and enough thrills to be entertaining."}, {"id": 2, "text": "I believe I stumbled upon the movie on prime video. This movie is filled with amazing actors who truly make the film, and there was never a dull moment while watching it. Very compelling!"}, {"id": 3, "text": "Watching this film with some friends on the weekend, we thought it was pretty well creepy just because it felt realistic in how the stalker would infiltrate the lives of his prey.Interesting cinematography too because it would seem all scenes were filmed with the ambient lighting that existed in each setting. For example a hallway of the home where the characters would congregate to talk about something that happened would be more so dimly lit, which seemed realistic to me.I'd say check this out!"}, {"id": 4, "text": "I really enjoyed this thriller. It was suspenseful and had a good soundtrack!"}, {"id": 5, "text": "The Stalker is a campy throwback of a ride from the plot to the music and soundtrack. It's a kind of slasher movie (older 80s-ish?) that is well-paced, fun, and strictly what the movie poster promises. Bring out the popcorn and get ready for some stalking action."}, {"id": 6, "text": "Anyone giving this more than 1/10 is taking the pìss. This was an absolute low budget low grade shocker."}, {"id": 7, "text": "Oh my god, I wasted an hour of my life watching this. The most terrible acting I have ever seen. I gave it 2 stars as I am sure there are worse films out there that I haven't seen."}, {"id": 8, "text": "This is a Lifetime original movie dressed up as an unstoppable psycho killer movie with a Carpenter-like soundtrack. Unintentionally hilarious lipstick on a pig. 5 donuts out of 10."}, {"id": 9, "text": "Suspension of disbelief is a great tool when you're watching a flick like this but there is always one blatant misuse that has you rolling your eyes. In The Stalker it's the creep factor. Aside from the villain in this, we have the pizza guy, the cable guy, and even the teen that wouldn't mind mom showing up to the party in the woods was a little creepy. Honestly, how many real Creepy Creepersons do you actually run into? They all showed up for this movie, but all for no reason, because The Stalker was revealed in the first scene. We all knew it.The acting wasn't the worst I've seen, and the pace was just rapid enough to fill the 60 minutes. I don't know how you could have made this film last any longer."}, {"id": 10, "text": "By the poster you can probably tell that this film draws influence from the horror flicks of the 70's and 80's and does so in the best way possible. I kept waiting for the late Sid Haig to pop up in a cameo. I think if he were still around he probably would. That being said, it's an indie horror film with legit suspense a creepy vibe and actual scares. Definitely work a watch."}, {"id": 11, "text": "Fast paced horror thriller flick with a vintage feel and a very hypnotic sound track John Giorgio will be one director to follow."}, {"id": 12, "text": "The Stalker has a great understanding and takes a lot of inspiration from 80's Slasher films, and notably stands out for its great acting and cinematic shooting. However what the film lacks is a cohesive glue that binds the movie together. Watching the film it felt like the writing was rushed and not well thought out, but makes up for it with some pretty amazing actors. I think that a reproduction of this film with a better outline and clear objective would raise the rating I would give it to a seven, and the film shows its potential well. Kudos to the team for taking a (I'm assuming) minimal budget and producing a pretty decent film. 😊"}, {"id": 13, "text": "This movie legitimately gave me the creeps. It's cut lean with all the fat trimmed off for a streamlined intense ride. Great score and titling as well!"}, {"id": 14, "text": "If the camera man had not got camera shake and zoomed out a bit would be a great film but the videography is appalling nothing worse than jumpy camera work"}, {"id": 15, "text": "The Stalker keeps you guessing till the last min. Great creepy factor and solid movie."}, {"id": 16, "text": "This has to be one of the worst movies ever. Total waste of time and makes no sense. The stalker kills a bunch of people while on his mission for revenge - though why he kills innocent people is not clear. Then - spoiler alert - he gets killed by the lady witch 2 stabs to the shoulder blade with a pocket knife? And then to cap it all off... they dispose the body in a lake instead of calling the authorities. Bad acting, bad story line. Don't waste your life."}, {"id": 17, "text": "One of the best independant movies I've see. The movie is an homage to the classic 80s horror movies we all know and love. Lots of suspense that keeps you guessing till the end. Written by up and-coming writer Michelle Lewis who does an excellent job of keeping you on the edge of your seat and caring for the family. Along with great performances by Troy Froman(star of many classic 80s horror), Virginia Vogt( Fox's Sleepy Hollow), Matthew Ewald ( Galidor),and rising star Jimmy Ace Lewis (Pointman). This is a must see movie perfect for date night!"}, {"id": 18, "text": "A nice throwback to 80's horror. It's got some great chilling moments and really dug the pacing. Well done overall."}, {"id": 19, "text": "Great for date night! Popcorn, fruits snacks, and a heavy blanket. Screaming in your love ones arms. Definitely will he added to our Halloween classics."}, {"id": 20, "text": "This Movie is a solid indie thriller. Jimmy Lewis puts his all in the role"}, {"id": 21, "text": "Great job to all the cast and crew on an amazing flick hope to see a part 2 😊"}, {"id": 22, "text": "What a little gem of a film! I thoroughly enjoyed it from beginning to end. It was well acted and had a good storyline. Great job in directing. The movie moved along at a good pace and I never found myself drifting off! Well done folks! A thumbs up from me on this one!!"}, {"id": 23, "text": "Then The Stalker is for you. There's some well done suspense sequences and excellent location photography. The Stalker is worth your time."}, {"id": 24, "text": "This is a neat little thriller. Tautly plotted from the first scene to the final climax. Lots of red herrings and good suspense. A terrific ensemble cast of characters. Recommended."}, {"id": 25, "text": "Set in the dark woods of a lake front home this fast moving suspense thriller will keep you entertained with its classic screenplay. The edgy sound design, which reminded me of Halloween, will keep you tuned in to its storyline. Well done with an attractive cast of characters and solid production design. A simply told story that entertains with the purist form of filmmaking."}, {"id": 26, "text": "Add in one part surreal and two parts suspenseful and you get this taut throwback to 80's slasher flicks - if that's your thing, you'll definitely enjoy the ride."}, {"id": 27, "text": "Follows in the footsteps of stalker/revenge thrillers like Cape Fear and Scream. Decent performances overall (especially from the father/husband who's resemblance to Nick Cave was oddly captivating). Good effort for a very low-budget film."}, {"id": 28, "text": "This is unapologetically a low budget indie, but the acting and production value are solid and it has a simple old school vibe that is executed well! The boys do exceptionally well in roles that could have easily fallen into parody. It kept my attention the entire time and had some truly disturbing moments - definitely recommend it!"}, {"id": 29, "text": "This 1980s-inspired thriller gets your attention right away and moves quickly. The excellent and uneasy camera work and great score push the pace as the action and stakes heighten. A good and quick rush."}, {"id": 30, "text": "This movie is well-acted with a strong script. There are many scary twists and turns to keep you at the edge of your seat. I really enjoyed the part of the Mother and thought it was great to see a Mom character in this role. This movie is thoroughly entertaining and I highly recommend it."}, {"id": 31, "text": "The Stalker has a lot of the 80s horror vibe. Good premise, some good acting, Dario Argento type of music. Too bad it's only one hour, I would have loved to see it unfold slower."}, {"id": 32, "text": "Loved this movie. Such a great thriller that kept me on the edge of my seat. Great acting, kept me guessing."}, {"id": 33, "text": "A nostalgic throwback to campy 80s horror films, complete with a lake setting and creepy score. A fun watch."}, {"id": 34, "text": "The movie was spectacular 1 of the best. Hoping 2 see a sequel."}, {"id": 35, "text": "A fun, vengeance-driven stalker film. A scorned employee returns to wreak havoc on the family he blames for his misfortune. He stops at nothing to rip the family apart and nothing is off limits including children. An interesting plot twist, is the family itself winds up commiting a serious crime in the process of defending themselves.With a name like The Stalker you know what you are getting. A fun, kill or be killed suspense film that keeps you guessing."}, {"id": 36, "text": "Draws you in and doesn't let go. Wonderful throwback to the low budget thrillers of the 80's. A businesman fires an undeserving employee to save money and the employee stalks him and his family. A highly enjoyable romp that doesn't take itself too seriously. Full of quirky characters and sendups of tropes. Very entertaining and can be watched by all ages with no gratuitous violence."}, {"id": 37, "text": "The film want horrible, but not the best. It's obvious no one had to audition for their parts. A lot of questions left unanswered."}, {"id": 38, "text": "Very reminiscent of an 80s thriller movie, which are my favorite movies. Kept me guessing the whole time. Loved the surprise ending. Very well acted. Excellent script. Very professionally filmed. Hope there is a Part 2."}, {"id": 39, "text": "From the clever writing to the phenomenal writing, this movie will keep you on the edge of your seat from start to finish! Definitely worth the watch. But a warning: you'll be looking over your shoulder when walking alone."}, {"id": 40, "text": "Straight off the bat, the score puts you in this suspenseful world. You can really feel the nod to horror films of the 80s. This film kept me guessing about who the stalker was the whole time. It was really interesting to see them play with the cinematography and add to the creepy air of mystery. Well acted and fast-paced. Definitely worth a watch!"}, {"id": 41, "text": "John Giorgio and Michelle Lewis The Stalker has a lot of fun with the genre, offering up a fast-moving, bulldozer of a story, with style and humor to spare. I enjoyed the way it plays with perspective, especially in the beginning, using POV effectively to establish an air of mystery of who the stalker could be. The brisk runtime adds a unique layer to the plotting and pace of the narrative, making everything feel just a little more urgent. Scenes with the stalker (which could apply to a number of characters before the reveal) also strike the right balance between creepy and humorous, like an awkward run-in at a donut shop. Also really liked the family dynamic. The ending is terrific, bookending the beginning scenes perfectly, and bringing a whole new meaning to family bonding time."}, {"id": 42, "text": "This film was well done. A plot that keeps you guessing with enough twists for even the most ardent genre fan. It is well acted and well presented. The cast worked well together and pace was good. I recommend."}, {"id": 43, "text": "This film really reminds me of my favorite eighties horror movies like The Lost Boys and Lady Terminator. The score is really good -- pulsing electronic. And i love the retro title graphic. If you love exploitation and grindhouse, this is the movie for you. I really appreciated all it's nuances in the genre!"}, {"id": 44, "text": "If you're like me you and have a deep affinity for 80's horror films you will love this. Horror films from this era are the best in my opinion and this loving homage serves up everything you might expect from a whodunnit slasher film. The score is a standout and The Stalker himself is the perfect foil as he terrorises a family who may not be entirely innocent. Lots of nostalgic fun!"}, {"id": 45, "text": "I don't usually watch horror but my friend recommended it. It was so well done, with a great score and cast. The ending had a really nice twist. If you like this genre you will love this horror film."}, {"id": 46, "text": "Amazing thriller movie, well written kept me in suspense and loved how well the cast was cohesive! Can't wait for a sequel, please tell me there will be!"}, {"id": 47, "text": "Great movie to watch. Had me guessing from start to finish. Enjoyed the performance by all involved. Hoping for a second one!!"}, {"id": 48, "text": "If you took the film Falling Down and put it in the blender with Michael from Halloween you would have The Stalker. The movie keeps you guessing as there are so many creepy characters for you to watch. While somewhat of a slasher movie, it does not dwell on gore. A fun film with much of the feel of classic horror slasher movies."}, {"id": 49, "text": "WELL ! That is the time I would never get back🤦 with the bad acting .and a plot that made no sense From the beginning. Of why.to start with. It made no difference. This was not the worst movie but..... Oh my...Why..?"}, {"id": 50, "text": "Total 80's flash back so wrong its right. Eploitation Grindhouse (look it up kids...so you know where you are gonna go!). The music is excellent...really good era perfect. It's an excellent 2 beer fun fest. It's predictable and unpredictable as it should be. Some excellent outrageous moments. (yes...stay around after the credits! tee hee hee)"}, {"id": 51, "text": "This indie horror has a good premise and is well executed from the writing to the acting and direction. It plays on real fears that everyone can relate to as a mysterious stalker seeks revenge on the Hamilton family. The filmmakers did a good job with a limited budget and if you're in the mood for a fun 80's throwback indie thriller then sit back, relax, and enjoy the ride."}, {"id": 52, "text": "The film has all the horror and thriller elements audiences want - blood, suspense, edge of your seat, scares. The cinematography is creative and draws you into the story and suspense. An entertaining watch. Good job by these indie filmmakers"}, {"id": 53, "text": "One of the best parts of suspense / horror are the score. This one is well done! Lots of other great elements add to the thrill from story, pace and acting. Check it out if you want a throw back to the 80's horror night!"}, {"id": 54, "text": "If you love the 80's style horror films you'll like this. It's an indie film but I think they pulled it off. It's a fun movie."}, {"id": 55, "text": "The Stalker was a great suspenseful indie film. Director John Giorgio did a great job transferring Michelle Lewis's screenplay to the big screen. He was also successful in bringing out the best performance from all of his actors. Lead actors Chad Ayers (Steve Hamilton) &amp; Virginia Vogt (Wendy Hamilton) were instrumental in leading the audience through his compelling film. A family who find themselves stalked by an ambiguous character ultimately do what it takes to survive. This film was shot is a style reminiscent of the 1980's slasher horror films. The music, editing, &amp; camerawork were all on point."}, {"id": 56, "text": "The Stalker is a new release indie horror film that is a bit of a throwback within the genre. Suitably, the film is about a stalker who is very mysterious and will stop at nothing when coming after the Hamilton family. I like these kinds of more believable horror setups because the threat of a stalker is something many people have experienced in real life and would be enough to haunt anyone. Solid work on this indie film and I particularly liked the retro score. This would be an enjoyable watch for anyone looking for an indie horror film this Halloween season."}, {"id": 57, "text": "For the most part, THE STALKER takes place in real time. You are right there with this family through their ordeal, over a period of days. The climax is massively tense and stressful, which is due to the performance by the stalker once he is revealed. Great cast and performances. Well done."}, {"id": 58, "text": "So for an indy film this is an awesome time. at least twice it had me wonder whodunnit it was a great job on every ones parts and since yesterday Ive now watched it twice and am waiting for a sequel!"}, {"id": 59, "text": "The Stalker plays well with how fear can be misleading. The tension grows exponentially in the nice mystery thriller that reminded me of John Carpenter's work. I love the use of the music, it really helip adding to the tension. The plot gets more and more complexe as the movie keeps inroducing more creepy characters. You end up having suspicions on everybody before you know who is the stalker...and who he's actually stalking."}, {"id": 60, "text": "Predictable. AWFUL. BAD ACTING. Poorly written. Please don't waste your time"}, {"id": 61, "text": "Apparently most of these reviews were written by the cast and crew, especially since they use the same phrases. If this had been longer than an hour I wouldn't have finished it. It felt like this was the first film job for any of the cast and crew. There's low budget and then there's no budget. None of this movie made sense, except for the identity of the stalker, which was rather obvious. To compare this to the campy horror movies of the 80's is an insult to those classic films because campy suggests kind of a dumb but fun self-awareness and this movie lacked any of that. Do not waste your time. Go re-watch a classic instead."}, {"id": 62, "text": "First of all, we all knew who the stalker is from start. They just didnt reveal his face. Then they throw in a bunch of creepy characters to try to make you guess which of them is the stalker. Thats not even brilliant."}, {"id": 63, "text": "Just wow, that has to be one of the worst movies I ever seen how does the smallest knife in Home Depot kill a guy."}, {"id": 64, "text": "This was a very bad movie. I've never reviewed a movie on IMDB before but I had to for this one. Poor acting &amp; very predictable plot. Hard to watch..."}], "reviews_amount": 65}