{"name": "The Vanished", "titleId": "tt09794630", "reviews": [{"id": 0, "text": "This movie turned out to be fairly decent. Some of the acting wasn't the greatest, but I did enjoy the film. I've got to admit I didn't expect the twist in the end. Worth a watch."}, {"id": 1, "text": "I'm still not sure if I actually liked this movie or not.....there was so much going on, odd subplots, and unresolved non-issues that made it all confusing. For starters, it was at least 45 minutes too long, several times I thought it was gonna wrap up, then off they went again in a new direction. A lot of character behavior that didn't seem terribly believable; I found myself laughing at parts that weren't supposed to be funny. And they made darn sure you knew that EVERY minor character could be the bad guy by giving them all exaggerated creepy habits, tics, and secrets that were quite over the top.It was plenty suspenseful in many places but at times again ventured into is-that-supposed-to-be-funny....?I give it a resounding meh."}, {"id": 2, "text": "The most creepy part is to read reviews from people who actually watched 10 mins or who watched till the very end and still didn't get it. I wonder why do they have this urge to leave a comment the most?I started to watch with absolutely no expectations but it turned out to be quite entertaining. There were few holes but all in all it's a pretty decent thriller with good twists. Good job!"}, {"id": 3, "text": "So many twists and turns that all makes sense in the end. Watch it! This movie deserves a better rating than its getting here."}, {"id": 4, "text": "I knew nothing before watching this movie. Thought it would be bland but turns out quite engaging and powerful once it portrays how a couple has to handle marriage life with gone kid. Twisted ending which I never saw it coming at all."}, {"id": 5, "text": "I found this movie very interesting. I liked all the twists and turns, and the ending is very surprising and satiating. Sure there are several misdirects that other reviews site as plot holes. But if you think about it later each subplot has a thread tying it back to the main story of the missing daughter."}, {"id": 6, "text": "It was not too bad and certainly held my attention as it tries to solve a missing daughter story. I was hoping it might be like Taken but it's mostly a psychological drama similar to Prisoners but not nearly as good. But still it was tense suspenseful watch with twists and turns. But the unreliable narrator storytelling has been done before but still never gets old."}, {"id": 7, "text": "Okay, so there's a lot going on in this movie the plot rambles around a bit. The acting is only ok, with good turns from Jason Patric (Sheriff) and Thomas (Paul). It's hitchcockian in its style and the ending threw me BIG TIME (no spoilers). It's no classic and has more holes than Swiss cheese, but stick with this one and you'll be glad you did!"}, {"id": 8, "text": "Starting 2 favorites Tomas Jane and Ann Heche. I had not see Ann in a long time, I always thought of her as a very good actress.Going in I thought was going to be just a formula kidnapping or lost in the woods film. Boy was I surprised. The suspense was gripping many twists and turns. I didn't get it till the end then it all made sense. Heche was just great. Tomas played that role so well, it throws you such a curve. How can it be only a 5.6 here. I give it an 8 and that is too low. Jason Patrick kills his role as the Sheriff. All the characters are very complex. I might have to watch it again to see more. It's hard to review with out spoilers.I really loved it, writing first rate. Thank you."}, {"id": 9, "text": "Really good film, and good twists. Superb acting by the wife, reminded me of my ex who suffered paranoia and was on meds. Similar behaviour. Those who wrote bad reviews haven't experienced someone with mental health problems. Very good movie. Realistic."}, {"id": 10, "text": "In a time where 90% of so called A-rated movies turn out to be a complete waste of time starring oscar winning actors, this movie stands out above the rest. Good story, keeps you guessing and is very enjoyable. Ignore the bad reviews, acting was excellent."}, {"id": 11, "text": "Original,creepy and excellent credible acting from Heche and Jane with an solid storyline and a twist in the ending I did not see coming.A 9 out of 10 from me"}, {"id": 12, "text": "Okay, I have to admit after 27 minutes of bad acting I said enough. I've never seen Anne Heche or Thomas Jame act so badly. Jason Patric was a joke as the sheriff IMO. I was rolling my eyes way too much to stick with what I consider a hot mess. I mean, really...those two were acting in a forced way. Like some amateur B movie stuff. I just couldn't stomach this one. ugh. Wasn't for me but maybe some will like it?"}, {"id": 13, "text": "Ann Heche has to be the most stupid Actress from Soap Operas to Silver Screens if anyone can screw up a script or Movie she can that for sure."}, {"id": 14, "text": "A couple takes their 10-year-old daughter camping on Thanksgiving in a sparsely populated campground and no deer hunters. Within minutes the daughter disappears. there is an extensive manhunt. Is it the creepy groundskeeper? The rough landlord? The couple that wants a child? Or the escaped convict? Unable to find answers, our couple venture on their own investigation of self-destruction.Interesting film. I didn't see it coming and I normally figure out this kind of twist. Decent acting.Guide: sex. near nudity. Don't recall any swearing."}, {"id": 15, "text": "The opening header and first 10 minutes are enough for a genre sleuth to figure out the ending, which is a shame. Lots of attempted twists and turns, so worth a free streaming watch - but was really hoping the plot would have gone a different direction. Love the leading actors in other films, but the direction on this one felt forced and too overdone for the story."}, {"id": 16, "text": "I don't blame the actors. The screenplay and director are solely responsible for this garbage. Hard to believe just how bad it is. The one star is for the scenery."}, {"id": 17, "text": "Though the acting could be not constantly perfect (that could be said about any given movie), the story keeps going quite fast and the end is an absolute masterpiece from cinematographical point of view, wow!"}, {"id": 18, "text": "I really liked this movie. The start was a little questionable but it got much better. Great story line, great suspense and very unpredictable."}, {"id": 19, "text": "This movie is a great thriller... you are constantly shocked by each twist! And the Park owner, Tom is supper hott! ; )"}, {"id": 20, "text": "Interesting premise. Terrible script. Horrible acting. I mean horrible. Every time someone speaks it reminds you how terrible the film is."}, {"id": 21, "text": "There was nothing wrong with this movie! Suspense, action, thriller, psychological - it was all these things. Acting was on point - if this happened to you, wouldn't you be hysterical and all over the place? Both lead actors did great! Supporting staff, most were great too. 5.6/10? NO WAY! Not a solid 10 but definitely a 9!"}, {"id": 22, "text": "At 00:47 a female seen having an orgasm while intentionally been watched by a man at another RV, one of the main character.Uncomfortable to watch with a 15 year old, and should avoid to watch with a 15 y/o girl."}, {"id": 23, "text": "This is a very strange story, with plenty of suspense and an element of horror.The Anne Heche character is very unlikable and isn't easy to watch by times, but in the end I realized she was the right person for the role.The story is well-written and keeps you guessing until the end."}, {"id": 24, "text": "It comes in at an hour and 54 minutes. Take off 25 minutes and you've got a solid thriller. Lots of padded, boring dialog is what kills it. Tighten it up and it's not bad.Good first time writing and directing from Peter F, who also plays a sheriff. I remember back in the 90s when he was supposed to be the next Tom Cruise. That never happened but he's built a solid career for himself and will get other directing jobs in the future."}, {"id": 25, "text": "Wow Anne Heche does a great job acting in this movie. I am not a big fan but certainly impressed on this one. Didn't expect a lot but it was very engaging suspense. Some great one liners such as it's a fine line between denial and hope."}, {"id": 26, "text": "Some of the acting was a bit questionable but I actually thought the story was quite good if you're a bit confused with the 'distraught parents' it'll all make sense in the end"}, {"id": 27, "text": "When you expected plot-twisted thriller kind of movie, i think this will be good for you.."}, {"id": 28, "text": "This is psychological thriller a bit too long for my taste but kept my attention at all times."}, {"id": 29, "text": "Just watched this and really enjoyed it.... Pretty clever and tense.... Give it a go...."}, {"id": 30, "text": "It's not an original tale, but it has a different ending. It does what it is supposed to do. It keeps you entertained and guessing. Also, I thought the run time was fine. A good, popcorn munching film. I liked it."}, {"id": 31, "text": "Easy to figure out but it kept my attention. I enjoyed all the twist and turns. Not the best but definitely not the worst."}, {"id": 32, "text": "I liked it a lot This thriller for me is so much good And the end ahhhhhhhhhh super super I will watched it again for sure"}, {"id": 33, "text": "Soooo...this movie left me very confused! They're grieving parents &amp; the girl was a figment of their imagination? Did they have the cops looking for their imaginary daughter?! What about the grounds keeper? The couple? Were they good people? Bad people? UGGHHH!! I don't know if this was a good movie or a bad one! A great thriller...I guess..."}, {"id": 34, "text": "With a stellar cast a beautiful setting and a pretty decent plot - somehow this movie becomes a tangled depressing mess. It should come with a warning: this movie WILL suck the life out of you."}, {"id": 35, "text": "As tension filled as a bowl of goldfish. Predictable....bad acting"}, {"id": 36, "text": "Watch this rubbish at your own expense. The acting is just awful. I can't say anymore."}, {"id": 37, "text": "I liked it, it doesn't have to be the best performance or An Oscar movie to enjoy it. A mystery with multiple twists that worth watching and will keep you on your toes in a couple of scenes."}, {"id": 38, "text": "The acting - there are no words about how awful the acting is.The script - there are plenty of words here though. Waaaaay too many. Endless amounts of words.The ending - it explains things and you still don't understand everything, which is not fun. Not even a little.I like Anne Heche because she seems truly certifiable - even when she's not in a movie - but this is crazier than even she is."}, {"id": 39, "text": "The Vanished is an interesting missing girl mystery whose end you don't really see coming. Peter Facinelli, an actor new to writing/directing, leads you down a bunch of rabbit holes so you think almost anyone on scene could've done the thing. But in doing that he stretches some situations/circumstances to aw c'mon places. Anne Heche delivers a fine performance among an cast of unknowns. The reveal is kind of interesting but pretty far fetched and you don't get the conclusive, satisfying click of the handcuffs at the end, either."}, {"id": 40, "text": "Idiotic writing and acting ruins what could be a promising movie. The lead female character was frustratingly stupid. The actress's acting of said character was bad too. Male lead was terrible but not as bad as the female lead. The sheriff was the most likeable character but the movie wants you to hate him so poor direction acting and writing all around."}, {"id": 41, "text": "One of the best thriller movies I have seen in a while. We need more cinema like this. Well done to Peter. The actors also did an incredible performance. RV thrillers are so edgy. A sequel would not hurt my feelings one bit. A MUST SEE!"}, {"id": 42, "text": "Its a movie about every parents and guardians greatest fears, when a child disappears. your shocked and merely helpless, and youll never forget it.the story and plot for this movie had the opportunity but they manage to wreck the whole story with an additional murder and a coincidental deaddrunk sheriff managing the whole case. the acting goes on low gear, the plot speed are deafening slow and without intensity at all.its a derailed crimedrama, made for the lifetime and tvshow crowds, its not a blockduster by all means and quite painful to watch, so its not a recommend from the grumpy old man"}, {"id": 43, "text": "Without a doubt the worst movie ever made.Bad plot, bad acting"}, {"id": 44, "text": "I just watched the movie. It kept me watching. To be honest, after half of the movie I knew it that both were delusional! That's why, ending wasn't a surprise for me! Peter Facinelli's 1st directing and writing movie. Script was really good. I must say, he did a great job! Unfortunate choices when it comes choosing the actors!!! I hope he chooses better actors! If there would have been great acting, it would have been top notch movie!"}, {"id": 45, "text": "This movie good have been very good, with a better writer some better direction and better acting. The story had potential but failed to hit its mark because of weaknesses in these areas."}, {"id": 46, "text": "It's a new take on the vanishing genre and for that it gets some original points. However the acting and dialogue is indeed as poor as the other reviews say it is. Lots of scenes to hate on with this one but a decent first effort from a new director, which at times is frustrating to watch. Hopefully he can build on this and keep getting better with experience."}, {"id": 47, "text": "You will wonder what level of hell you've wandered into when you first start watching this. The acting is dire. The editing is terrible. There are so many utterly baffling decisions made that you will find it very hard to sympathise with anyone at all. But, hang on...the last 10 minutes suddenly makes it all (almost) worth it, and with the benefit of hindsight you'll find yourself going...ohhhh...NOW I see... 6 stars because it's actually not awful and the ending is actually quite surprising and a little heartbreaking."}, {"id": 48, "text": "It's just come down to the point of not trusting any reviews. The movie is definitely worth a watch. Anne Hesch is great as always... this one leaves you guessing until the end. We enjoyed it."}, {"id": 49, "text": "I am glad I did not listen to the poor reviews on this one. Is the movie realistic, no not really and yes there are some questionable plot points, but overall this movie is entertaining from start to finish, pulls you in on a great ride and has so many twists and turns it is fascinating. Ultimately too, you feel for the characters, which is an accomplishment . Peter Facinelli has done a fine job with writing and directing and only given himself a tiny role in the movie, which is what someone should do , write, direct and then step out of the way. Never boring, keeps you guessing, this does not deserve it's bad reviews."}, {"id": 50, "text": "This sleeper is quite a surprise. One of the best low budget films I've seen. Some of the acting reveals the budget and drops it to a 9, but wow...what a story."}, {"id": 51, "text": "I read the mixed reviews and not sure what to make of it but I watched it anyway. It held my interest the whole movie. It was not predictable. I did have a few questions while watching it but the ending kinda explains it for me. Im not sure if I missed it but I dont know what happened to the female neighbour, is she dead or did she survive? I saw what happened to her husband when the boat tipped. Who killed the dog or is he imaginary? What's with the mention of the FBI if they're not even in the movie? I appreciate the mixture of weird characters to make the viewers guessing if they have anything to do with the disappearance of the young girl. Peter Faccinelli's role is almost useless as if he's just squeezed his character to be in the movie while directing it. The dialogues could have been improved as some are questionable. All in all I enjoyed the movie, I like being surprised with the twist."}, {"id": 52, "text": "This is a movie you must see. It is drama and you won't believe the ending! Jason Patric is great as the Sheriff!"}, {"id": 53, "text": "Me and my husband really enjoyed it I thought it was a aswsome movie has me at the edge of the bed!"}, {"id": 54, "text": "I was entertained by it for the most part, I liked the atmosphere too.I feel like there were many side plot holes tbqh. And without them the movie would've lasted less than an hour. They lost me. The ending was good for a mystery thriller.Kind of a meh mystery thriller for me. Liked the twist though."}, {"id": 55, "text": "Decent movie IMO. Kept me entertained and invested all the way through. Had me laugh out loud a few times just from the awkwardness. Good ol fashioned who-dun-it film."}, {"id": 56, "text": "We should be out there searching. I was. I hit the local Redbox because I had a need to write and wanted to check out a wilderness thriller.Anyway, 2020's The Vanished is my latest write-up. Don't try to confuse it with that movie from the nineties starring Jeff Bridges and Kiefer Sutherland. Vanished rather features Anne Heche and journeyman actor Thomas Jane. As a flustered married couple who appear to be on the outs, these kooky spouses do strong work here.Released on DVD in October, reigning in some Kubrickian overhead shots, and filmed mostly on a camping site (Alabama perhaps?), The Vanished is deftly directed by Peter Facinelli. Weaving many characters, a few plot lines, and a few whodunits, Facinelli fashions what looks like a modern day version of 1998's A Simple Plan. Sam Raimi well, he would be mildly dazzled.Along with Heche and Jane, Vanished also stars a subdued Jason Patric and Facinelli himself. They appear in a film that keeps you guessing until the very end (even though it's not too hard to follow). The Vanished while all too high-flown for its own good, contains a doozy of a conclusion and enough twists and turns to occupy Lombard Street. The movie as a near two-hour mark, registers as its own, reared red herring.With an original title of Hour of Lead and distributed by Saban Films, Vanished is just what it aspires to be. It's a flick about a husband and wife who try to find their daughter who was abducted on an RV family vacay. People get murdered in the process, everyone's a person of interest, and it all takes place during the Thanksgiving holiday (which is readily approaching). I'm gonna recommend The Vanished despite its yearn to project broad, look at me film-making. It's a decent rental and an up to snuff vanishing act."}, {"id": 57, "text": "I just finished this movie. Wow. This has to be Ann Heche's best role! If you blink or go to rest room. You could miss a important part in solving this psychological Thriller.I will definitely watch again!!!!! 👀😎🤓👍🏿👁👥"}, {"id": 58, "text": "The reason i gave it a shot was because of Jason Patric (Lost Boys, NARC, Sleepers). Very perplexed at why he took the role after watching it. The film is just awful, one of the worst i've seen in a long time and full of holes, for example why the police didn't search the campsite owners house or the other trailers; something that would've 100% been done in a missing child case. The acting is deplorable. I watched until the end out of sheer curiosity. The 'twist' if you can call it that, had little impact, given the film up to that point was dreary and an absolute chore to watch. It's the kind of film that kills careers. If i could give it -1 i would. If you know what a good film is, you'll definitely not enjoy this."}, {"id": 59, "text": "Within the first 10 minutes it is clear this is not going to entertain . To be honest the kids winey voice was so irritating that the first thought was thank the lord that the story is about her going missing least I won't have to hear her winey voice for long! The script is so dreadful and totally nonsensical that as far as I am concerned the parents are so bizzarly crazy in their actions her approaching and shooting a camper ransacking a neighbours camper because the wife was young pretty etc I could go on an on listing the bizarre actions of these so called parents but to be honest watch the first 20 mins and you will understand!To recap Bad script Bad story Bad acting = 💩 film"}, {"id": 60, "text": "I was hyped to see Thomas Jane and Jason Patric but I got over it real fast. Horrible horrible acting. Horrible story. Just a big fat mess. Thomas Jane even flubbed a line and they didn't even redo the line. Whoever wrote this needs to take a writing course or 2. I knew 10 minutes into this it was going to stink. I struggled to give it the 1 star but no other options were available. And Anne Heche? That was a real brilliant piece of casting. Now I need to go watch the Lost Boys so I can regain my respect for Jason Patric."}, {"id": 61, "text": "I had this impression that Anne Heche was a way better actress. I was wrong. The screenplay was so off, the main characters (the parents) were off, no flow, no chemistry between them. The only moments I enjoyed this movie, was the few minutes Peter Facinelli was in it. Question: if Tay went missing when she was 3yo, how come they have a video of her from when she was obviously older? I'm sorry Dr. Cullen, but this was painful to watch."}, {"id": 62, "text": "How does such an awful movie even get made. Terrible acting by good actors. The most implausible script. Awful dialogue. Not even a twist at the end. Truly a terrible movie."}, {"id": 63, "text": "This wasn't a bad B movie all together. I agree with most of the other reviews, the acting was the worst part but on the other hand the story kept me interested most of the time but somewhere around after 1 hour or so I felt the movie was dragging too long and I had to fast forward a bit the last 30 min to get to the ending which had a nice twist.Overall quite forgettable."}, {"id": 64, "text": "There is a HUGE twist that I never saw coming. It was suspenseful, but the acting was awful."}, {"id": 65, "text": "Would love to tell you exactly where this movie failed but i'll make it real easy....everywhere. One star for the location only."}, {"id": 66, "text": "Don't waste your time, acting is terrible. The plot is hopeless. I stopped watching 10mins into the movie."}, {"id": 67, "text": "The writing is soooo bad!!!! Acting is sooo bad. It's all sooooo bad"}, {"id": 68, "text": "Somehow no one else reviewed this title yet. it is alright. the suspense is true, and the follow trough is legit. The big poppa is a big let down, one sequestration is anothers flap dinger. Who knows, this movie makes sense. Where did she go? Is adrenochrome the answer? Not bloody likely. BUt let the imaginations run wild, they will anyway. 5/10"}, {"id": 69, "text": "One of.the worst movies I have ever seen. The acting was.awful. Very vague movie. Did parents kill dsufhter?"}, {"id": 70, "text": "Can't believe how bad this movie is! Cheerfully offering coffee to the sheriff after his daughter is missing ! Don't waste your time on this movie!"}, {"id": 71, "text": "The premise is exactly the kind of movie I would be into. However, most of it made no sense and a waste of good actors. Peter Facinelli should stick to acting and not writing."}, {"id": 72, "text": "Choosing a Friday night pizza-movie in these covid-19 times ain't all that easy. But we ended up choosing this one. And it turned out to be a pretty good choice. It had suspense, that creepy little feeling of a lost child, everybody is a suspect and it kept us guessing. Nice little turns and twists here and there. It's not a fantastic movie, but it gave us here at home what we were looking for. Kept us entertained and interested. If I should be a bit more picky, it could maybe have been 20 minutes shorter.Let me also add that Thomas Jane have made mostly bad movies these late few years, but this was a bit of a level up from them.Sweet Friday pizza-movie worth a watch. 6.7/10"}, {"id": 73, "text": "It totally has the 90s thriller feeling but not tacky. It's bit long but worth every minute. The creepiest you think is but it's not....."}, {"id": 74, "text": "Maybe this movie should have been a mini series. Too much was going on in less than two hours."}, {"id": 75, "text": "An unexpected end after nerve-racking events! Good movie."}, {"id": 76, "text": "I haven't written a review in forever, but this is so bad, I want to spare you the rental fee."}, {"id": 77, "text": "I feel sorry for the actors. They had to work with an awful script. Tom Jane and Anne Heche did a good job playing a somewhat deranged and bizarre couple. But the story and the theme is somewhat off putting. This is a film that leaves a bad taste in one's mouth. I do not get what goes inside the heads of people who maks films like The Vaninsehd"}, {"id": 78, "text": "Quite possibly the worst film I've ever seen in my 51 years. Do not waste 2 hours of your life with this."}, {"id": 79, "text": "The worst movie I've ever seen in my 43 years of living it made no sense the acting was horrible I laughed through most of it and wanted to cry and break my TV through the other I wish this movie could be burned so nobody else has to waste 115 minutes of their life ever the acting was see movie at best the plotline was even worse please please do yourself a favour and watch grass grow that is way better"}, {"id": 80, "text": "I have to admit that final twists defends the whole plot a little bit and makes actions of the main characters more credible. But still you need to waste 90 mins watching it in total desbelief to get there. Not worth it."}, {"id": 81, "text": "So couple lose their daughter and then engage in highly erratic and suspect behaviors. And there are creepy or suspicious folks everywhere as red herrings in an isolated camp ground. Boy. Crappy acting, muddled plot, bad script and lines. Even the resolution is hackneyed and that is the only original part of the film. Rented for $1. 2 hour film. I feel I wasted so much."}, {"id": 82, "text": "It doesnt make any sense i thought would be better.its a wired movie they could have done better"}, {"id": 83, "text": "Not bad story line but the acting was shocking, if you can stick with it its not to bad. Just get plenty of popcorn"}, {"id": 84, "text": "One of the worst movies I've ever seen. Don't waste your time and money. Horrible acting, Horrible cheap film"}, {"id": 85, "text": "I read the reviews, so I kept watching beyond the terrible first hour. But the payoff wasn't worth sitting through Ann Heche's terrible acting. This film was badly edited, acted and directed. And it's too long. And they kill a dog for no reason whatsoever. Yes, there's a twist but anyone who reads or watches psychological thrillers will see it coming."}, {"id": 86, "text": "Too many unbelievable situations and because of this the acting was not very good. If you have time to kill then this is your movie."}, {"id": 87, "text": "Good story, good acting, good twists in the plot but what the hec is the lip sync voice overall about!!??? Terrible! Like watching a foreign movie lip sync in English."}, {"id": 88, "text": "Can't believe I paid money to rent this movie. Horrible acting. Not only that but the behavior of the parents would not be as in real life if their child went missing. So bad!!!"}, {"id": 89, "text": "Story could have been much better, but acting in general is bad. This movie is like a car that is stalling, but never quite stops and you keep trying the gas to see if it will pick up - but never does. A bit if a twist for most, but we figured it out early on. Pretty much a waste of time not entertaining."}, {"id": 90, "text": "Very ridiculous and crazy story line. Hard to believe anything like this would happen in real life."}, {"id": 91, "text": "Was interested to watch this because of the cast but unfortunately the end result was a muddled mess. The writing was wonky, with subplots that were completely unecessary.The acting was subpar to say the least, which was disappointing considering the cast.But, the story itself, the idea of it, I thought was very interesting, so what could have been a fantastic movie, was/is very much in need of refinement.I can't say I would recommened this movie to anyone, if you're curious enough to watch, then I would suggest watching the first 15 minutes and then the last 15 minutes, will give you everything you need to know."}, {"id": 92, "text": "Extremely poor acting, especially the female lead. Idiotic and cringeworthy plot. Main characters are incredibly dumb and illogical. I was very infuriating and painful to watch. Avoid at all costs, unless you want to suffer on purpose."}, {"id": 93, "text": "When humans are at their most broken, we feel and experience things that no others can even contemplate.That being said... I understood ( although be grudengly) why, at a critical scene, when I thought the plot was about a serial killer type dude, why things were happening the way they were. But I have absolutely no understanding what so ever, as the plot changes, do I understand why she killed that dog...I wish humans would leave animals out of killing. Stupid and upsetting, and I was actually enjoying it up until that point."}, {"id": 94, "text": "Always liked the genre of mystery movies but this one was a bit dull and not able to hold the viewers attention fully. Still its not a waste one, it can be called as a decent movie.Though the movie has all the setting which could be turned into a great thriller. Good locations, even a good plot but it all got wasted becasuse of the poor execution"}, {"id": 95, "text": "Some good moments of taught suspense sandwiched around multiple cliches, weak acting and a contrived storyline that's been done several times over. Truly not a satisfying experience for any long-time movie buff. Perhaps these writers can get more original next time.Gave it a #2 rating due to some nice static scenery in the background and the young actor played the drug addict."}, {"id": 96, "text": "Although the plot of the film is interesting, in the end we are faced with an absurd script, where the actors act crazy and you don't know if it is because the whole thing is misdirected, because the story is that strange or because during the the making of the film, drugs were dealt between the cast and crew. In other people hands, this could have been a good movie."}, {"id": 97, "text": "I'm not leaving a spoiler but this has to be the dumbest and most unrealistic storyline I've ever seen. Everything isn't what it seems to be because the story is so ridiculous and awful, the end will leave you wishing you would of never watched it."}, {"id": 98, "text": "Not as clever or suspenseful as it thinks it is.Some plot points are just completely random and never pay off or have any effect on how the film unfolds.It really drags in the second half, maybe because you've already figured it all out,"}, {"id": 99, "text": "Like everyone else I was about to close the movie down after ten minutes. The acting was horrendous and when I read the user reviews it didnt seem to get any better. But, thnx to some reviews stating it was worth the watch I pushed through and actually got stuck. The acting is over the top but after you´ve watched the whole movie and rewatch the first scenes, it makes more sence and actually fits. I cant say much more without spoiling.The ending is what does the movie. If I had stoped watching after twenty minutes I would have given a one-star review but after seeing all of it I give it a six.Its not a bad start for first time director but the writers and director made this one to hard on us. They should have realed in the acting so more of us saw the whole thing. They would have benefited greatly from that.In short; Its a decent thriller with weird acting, that kinda gets explained, and a great ending. Actually worth a watch./MrZinz"}, {"id": 100, "text": "And I don't think you will be hungry after this as it fills the moviegoer belly to the brim and more than satisfies the celluloid taste buds into the bargain.It is a story that has been done a fair few times but it keeps you guessing right until the final denouement which is a rare thing in movies these days and throws in some really odd sub-plots which unlike other viewers I found just added more flavour to the cinematic soup!Unfortunately, the only thing that lets the movie down is the awful acting of Anne Heche; I wish she would just give up and retire as every role she takes is the same old same old tedious, zero emotion, zero expression acting style. I don't know if it is because she is a lesbian but she just cannot play the wife and mother role in any movie be it the sci-fi series Aftermath which she also ruined or virtually any other role she has taken; she is miserable to look at and has a sour and deeply tedious acting style. Thomas Jane is one of my favourite actors but even he seemed to have a hard time in this film working with her on this movie and it shows. I also like Jason Patric but he does not shine in this unfortunately and gives a somewhat lacklustre performance but for me the story is all and it had me glued to the screen which is unusual as most of the movies I have seen this year have warranted nothing more than a 5 or 6 out of 10.Apart from these minor niggles, the first time director does a splendid job; bearing in mind he has to work with Heche and put up with her tantrums on set and so the story winds its way slowly; but never boringly to its riveting conclusion.A very good 7/10 from me on this one and it would have been an 8 if the acting had been better!"}, {"id": 101, "text": "Actor turned newb writer and director Peter Facinelli, wore all three hats in this B-grade film, and although flawed, it was still enjoyable. New filmmakers have to start somewhere, right? This was his 3rd full length feature film, and I've seen much worse from seasoned filmmakers lately. My biggest issue was the terrible acting by Anne Heche and especially Thomas Jane and his changing weird voice, but some of that blame also falls on the inexperience of the newb director not directing his cast and scenes effectively. Overall though, the directing was fairly decent as was the camera work. The cinematography and score were on point. The writing did have some plot and technical issues, and the pacing needed to be faster and/or the films 115 min runtime edited or cut down to around 90 mins. But the overall story with its twists and turns and surprise ending was conceived very well - it was worth the slow pacing and long runtime. If you enjoy mystery thrillers with some scary moments, you will enjoy this one. Watching it a second time knowing the ending is like watching a different movie, which is well put together. Ignore the wannabe critics and their ridiculously low ratings... it's a solid and well deserved 7/10 from me."}, {"id": 102, "text": "Wendy (Anne Heche) and Paul Michaelson (Thomas Jane) go on a camping trip with their daughter Taylor (Kk Heim). After arrival at the camp, they notice that Taylor is no where to be found. Sheriff Baker (Jason Patric) tries to calm them down and says he will find Taylor, but cautions them to stay put by their RV because there is an escaped convict in the area.Wendy and Paul feel the Sheriff isn't doing enough and they decide to look around for Taylor themselves.. They come across a camper who is asleep and Wendy sees the gun by the man and reaches for it and startles the man who wakes up and Wendy is startled also and shoots and kills the man. Wendy wants to tell the Sheriff what happened, but Paul nixes that because he doesn't want to lose both Taylor and her.They meet Eric (Kristopher Wente) and his wife Miranda (Aleksei Archer) who agree to take them out in their boat and search around the lake. Wendy believes Eric and Miranda took Taylor because they can't have a baby themselves.We see Wendy and Paul get upset with each other. Later a Grief Counselor administers to Wendy.Notables: Alex Haydon as Justin, a suspicious person who works at the campsite and does drugs; Twin sisters KK Heim and Sadie Heim play the daughter Taylor; John D. Hickman as Tom, the owner of the campsite.All in all this was engaging because you never knew where it would lead. Well, just wait until you see the twist. I was shocked and surprised at the very big twist that may shock and surprise you, too. (7/10)Violence: Yes. Sex: No. Nudity: No. Humor: No. Langjuage: Yes, but brief.(21 October 2020)"}, {"id": 103, "text": "In an age where theatrical releases seem to be a thing of the past except for comic book movies, we see more and more A list names like Thomas Jane doing these low budget indie thrillers shot in the woods. This particular outing is a bit more ambitious than most, in that not everything is as it seems, and the usual formula is inverted. Kudos for that. What many will have noticed is the atrocious acting in several scenes, especially by the leads. While this is explained later on in the film, it still makes for a grating viewing experience. However, the overacting is interspersed with good acting, especially by Thomas Jane, Jason Patric and actor who plays the disturbed teenager. The direction is quite confident in some scenes. Thomas Jane's nightmare in particular features a very clever overhead shot. There are some tense moments here, elevated by the score. The one major weakness is Anne Heche. Her acting is painful to watch. Also the movie is about 30 minutes too long.Overall, this is barely a 5 star film, but i'll give it one extra star for the clever concept and a rarity when it comes to thriller movies: where they usually get worse and lose tension as they go on until a letdown ending, this one is the reverse. It gets better as the stakes rise, and the ending (almost) makes it all worth it. Worth watching on a rainy day."}, {"id": 104, "text": "This is a first rate thriller/black comedy which had me engrossed throughout.A camping trip for a couple is soon turned from holiday to horror when their young daughter disappears.Every single character in this play is deeply flawed with all sorts of hidden secrets and agendas. Indeed the only sane one in the picture seems to be the dog called Lucky'....The story line goes from panic to absurdity, but the convincing acting and strong story line still held my attention.At the climax when all is revealed the earlier dramatic twists and turns make more sense ..Excellent thriller!8/10."}, {"id": 105, "text": "This movie is not at all what you think it would be, and it can be confusing at times...but in a good way! Its gripping and will keep you on the edge of your seat the whole way through..amazing set and an incredible cast of talented actors and actresses.It's an almost interactive experience, as you get to do your own detective work and make up your own theories while you watch the actors do the same. Every character in this movie is interesting and have their own mini storyline. The cinematography is beautiful and sets the scene of the movie very well.It is very easy to become emotionally invested in the movie and the range of emotions that this movie brings forth is staggering.I love everything about this movie, from the set to the cast and every twist and turn in-between! And of course the plot too! Its original and an amazing thriller!"}, {"id": 106, "text": "There was lot of it really unrealistic. Probably worst was that shooting in woods. Or whole shop in camp. I see, this move got 1 award - must be for most unlikable characters - all important ones were it.I can not blame actors, with this material really nobody couldn't much better. Some reviews here say that Wendy was so detracting (or even that Anne Heche made here such), but for me husband was even worse. And played by action movies star ?? Character was real wussy, and practically did nothing intelligent whole time.What authors wanted with this at all ? To make viewers to feel bad ? Indeed managed it. But it would work better without overdone darkness - junkie boy, wife abandoning in hard time ...Now, as it is clear that movie quality, at least made in USA goes down this years, should I go thru in movie mentioned 5 phases ? Yeah, I was in denial phase previous year. But not in blaming others phase. And now in acceptance phase. Luckily, not same as with child loss - I can still dig out good, older ones. Even sad story well presented can make man to feel if not good, but optimistic, learning something ... With this all what I feel is vanished trust in today movie making."}, {"id": 107, "text": "I knew I was sitting down for a thriller when I sat down to watch the 2020 movie Hour of Lead (aka The Vanished), and I knew that it had Thomas Jane and Anne Heche on the cast list. And that is essentially all I knew about the movie when I decided to watch it.However, I must say that writer and director Peter Facinelli definitely managed to come up with a movie that was quite entertaining. And the storyline was very compelling and drew me in right away. I will admit that the movie wasn't as predictable as many thrillers tend to be, and the twists to the storyline were quite interesting and nicely executed.The storyline was good, and it was a nicely told storyline from writer and director Peter Facinelli. It was definitely a very entertaining story and one that brings the audience right in there with the grieving parents.Hour of Lead has some good performances from Thomas Jane and Anne Heche. But it also have a memorable performance by Jason Patric. All in all, the acting in the movie was good, and people were doing great jobs in bringing their characters to life on the screen.Normally I don't watch a lot of thrillers, but Hour of Lead is definitely well worth the time, money and effort. So if you get the chance to watch it, I can strongly recommend that you do so.My rating of Hour of Lead (or The Vanished) is a strong seven out of ten stars."}, {"id": 108, "text": "2.5 out of 5 stars.The Vanished is a child abduction thriller that has substance with its story but lacks a direction to keep your attention and iffy acting and script. The plots follows a couple played by Thomas Jane and Anne Heche who went to a rv camp by the lake with there 10 year old daughter. After being greeted by an unpleasant camp supervisor. There daughter goes missing. Sheriff played by Jason Patric keeps an alert out and has a search party out. Warning the couple that there was an escaped convict out nearby. While Thomas Jane and Anne Heche obsessively searches the camp with others. While there desperation gets worse.There is a twist that i did not see coming which paid off with its ending. Sadly, the films direction is dull and boring. The performances also were not that good. The script is filled with atrocious and cringing dialogue from these characters.It is a film that lacks the thrills and a direction to make this worth watching."}, {"id": 109, "text": "The Vanished was directed and written by Peter Facinelli, and stars Thomas Jane, Anne Heche, Jason Patric, Aleksei Archer, John D. Hickman, Kristopher Wente, Alex Haydon, KK Heim, Sadie Heim, and Facinelli himself. It follows a married couple who lose their daughter during a camping trip as they take the search and investigation into their own hands.Plotting is fine, but has some seriously flawed moments; on the upside, the movie wastes little time in getting to the mystery while still providing a decent amount of setup. Paul (Jane) and Wendy (Heche) are taking their daughter Taylor (KK/Sadie Heim) on a camping trip at a lakeside park. initial impressions of the people there are not good, the owner, Tom (Hickman) is rude and standoffish, as is Justin (Haydon), the groundskeeper. While Paul meets Miranda (Archer) and Wendy is paying, Taylor goes missing. Sheriff Baker and deputy Rakes (Facinelli), along with other officers are called to the scene. There happens to be an escaped convict on the loose in the area and Baker tells the couple to stay inside. They elect not to and find a man who they think is the con, accidentally shooting him. After this, the couple can't come clean, so they work parallel to the police, trying to hide what they've done and get their daughter back.Characters are well set up, but where they go is more curious. Paul is a straight-laced father with a military background and a love for fishing, although he has run into problems romantically, much to Wendy's chagrin. Wendy is the caring mother who interacts well with her daughter and will do anything to get her back, legal and advised or not, to an absurd degree; and will manipulate Paul into whatever she plans too. Baker is a relatively standard policeman character, he has been on the force for a long time and takes pride in what he does; although does have some trouble with honesty. Miranda and husband Eric (Wente) are well-meaning bystanders that are trying for a child and have sympathy to their situation. Performances are passable for the most part, Jane does well with showing stress, sadness, and curiosity. Patric is good as the sheriff, bringing some gruffness to the role, and the supporting actors are good enough, but it's Heche that struggles; frequently going wide-eyed and angry at the drop of a hat, but she does have believable chemistry with Jane.Criminal actions are kept in focus, although the movie does deviate from the kidnapping a lot. The first 40 minutes are very well done, showing what lengths people will go to to find their loved ones; it is after this point that the movie starts to wobble and cross the line of absurdity. It is conceivable that Paul and Wendy would have kept quiet about what Wendy did, but her actions following make her seem just as bad as the kidnapper; from breaking and entering to interrogation, to guilt tripping Paul into joining her. Baker, upon meeting the couple tells Rakes not to let them know about the escapee, but they already knew, effectively planting a seed of doubt in the audience. This by itself would have been fine, but red herrings are thrown around left and right and leads to the movie becoming more and more implausible.Technically the movie is mixed. Facinelli made some good choices with the cinematography, and DoP Cory Geryak does a strong job of presenting locations with beauty and flair. Some of the tracks on the score are downright great, but others are generic and borderline inane. Sound design does have signs of a struggle, when characters shout or argue at each other (which is frequent) the audio can get a bit fuzzy. And as mentioned, the writing starts strong but drops off a cliff in quality and proceeds to fluctuate from then on. It's best when it actually focuses in on the kidnapping, and not the miscellaneous red herrings and side plots.Peter Facinelli's directorial debut shows some potential; his suspense and shots are well crafted, but his writing leaves a lot to be desired. The core of the movie is interesting, as are the characters and the performances from Jane and Patric; but during the many times The Vanished strays from the plot it feels like the visualization of an identity crisis.57/100"}], "reviews_amount": 110}