{"name": "Breaking Fast", "titleId": "tt09112712", "reviews": [{"id": 0, "text": "Only one type works You are destroying the picture of islam"}, {"id": 1, "text": "It's not worth it, there's plenty of good movies out there, this is ain't."}, {"id": 2, "text": "Very bad acting and story! I wish they didn't make the movie"}, {"id": 3, "text": "Why? Just why??? This is unacceptable 😡😡 why did they make this movie"}, {"id": 4, "text": "I dont now why that movie in here he just give you so bad thing about Muslims and , I am so angry because that movie"}, {"id": 5, "text": "They have gone too far and Islam is not really like that that' s a terrible thing to see"}, {"id": 6, "text": "Islam ist Not what in this movie this unacceptable"}, {"id": 7, "text": "Why did they do that ... Did they though about what Muslim people say's ??"}, {"id": 8, "text": "Bad story Bad title Bad poster Finally trying to distorting the image of IslamIf there is less than 1 I would be happy to give it to this movie"}, {"id": 9, "text": "This not islam, you guys are denigrating islam, the Muslim Community is very angry about it, and for the cast and writers you shouldn't do a movie like this"}, {"id": 10, "text": "Very bad and disgusting movie . . . ... . ... . . .. . .."}, {"id": 11, "text": "It's said by Prophet Mohammed that such a thing is not acceptable also Lot's people got punished for doing such a thing. Not realistic in any way, bad portrait of Muslims. Don't ever try to disrespect us. BS."}, {"id": 12, "text": "Trying to force a certain ideology on Islam, this is unacceptable and sad"}, {"id": 13, "text": "These are not acts of Islam. Islam forbids these filthy things"}, {"id": 14, "text": "Qaisijjahwhwjwjsjsjsjjsjsjjjsjsjsjsjsjsjsjdhahzhzhzhjajahahajsjsjsjsjs"}, {"id": 15, "text": "Dear Western societies, here's the thing, you can't change a whole religion just because you want to push your adeas and agenda. It's embarrasing"}, {"id": 16, "text": "This is not islam this is not islam this is not islam"}, {"id": 17, "text": "Great movie and a very touching story one of my favs this year"}, {"id": 18, "text": "Worst movie ever , its even offensive . didnt like it at all . do not watch the movie"}, {"id": 19, "text": "This movie is trying to destroy the picture of islam it's absolutely insulting. Please don't watch it just rate 1"}, {"id": 20, "text": "Bad storyline and waste of time dont watch it!!!!!!!!!"}, {"id": 21, "text": "(God damn men who imitate women and women who imitate men)"}, {"id": 22, "text": "Why are they trying to distort the image of Islam? Why are we what have we done to hurt us"}, {"id": 23, "text": "JeiwjwejsjsxhxjsjsjbxxiwibsiwzjSbusbisbibsibsisbisibsibsihisbsibdibdibdibdibsibdibdibdibd"}, {"id": 24, "text": "One of the most boring and disgusting movies ever , Leave Islam out of your disgusting agenda ."}, {"id": 25, "text": "The film openly insulted the Islamic religion and Islamic civilization and did not respect it. I would not recommend watching it at all. The reason for obtaining a rating of 100 from the site of rotten tomatoes and receiving a large number of film awards is that the site is very supportive of the political left. This film greatly supports the left, so do not waste your valuable time on a bad film. From a story or directing to an acceptable acting, everything is bad in this movie"}, {"id": 26, "text": "No, it wasn't needed at all, how did they even come up with this ?"}, {"id": 27, "text": "This is a distortion of Islam. We cannot be silent. The movie isn't worth watching, and without watching it we'll give it a rating of 1 out of ten.😡"}, {"id": 28, "text": "This is what I call a nice Direction and not to mention the great acting of the main Cast. These 2 guys really made the script believable, full of good conversations, scenes and full of REAL LIFE. Also the work that put his best friend being so feminine and queer brought some salsa to this Film! Way To Go With This Romantic Gay Movie! Also Shows a new way where the Islam can see Gays in this new Century!"}, {"id": 29, "text": "Imposing there view over Islam. You are free to be Muslim or not but not to change Islam or promote your lies about Islam"}, {"id": 30, "text": "Breaking Fast (2020) was written and directed by Mike Mosallam. The title is a pun, because it's not the action that's breaking fast. It's the fast that Muslims are breaking each evening during Ramadan.Haaz Sleiman plays Mo, a sincere gay Muslim who breaks up with his long-term Muslim partner. He then meets Kal, portrayed by Michael Cassidy .The plot of the movie is not whether Mo's family knows that he's gay. They know and accept this. The plot is whether Mo's family will accept a non-Muslim as Mo's partner.We saw this movie as part of Rochester's outstanding ImageOut LGBTQ Film Festival. It has a solid IMDb rating of 7.6. I agreed, and rated it 8."}, {"id": 31, "text": "WTF Did I just watch! This is the worst and most disgusting movie I have ever watched.Save your time and don't even think to watch this cheap crap."}, {"id": 32, "text": "And I say this as a compliment. Really enjoyed the interracial play between the main characters"}, {"id": 33, "text": "Saw this movie during the Chicago Reeling Virtual Film Festival. The chemistry between the two lead actors is good and their dialogue flows easily. The gay best friend is cliche over the top camp but the actor did a good job of making it original to him. There's no sex scenes, no stolen breathy kisses, no remorse the day after - just good old fashion romance and courtship like the time before Grindr made everyone a one nighter. Total gem of a movie, made me laugh in unexpected places, the music was fun. Highly recommend!!"}, {"id": 34, "text": "Technically a well made film and good acting too, but nothing new. The level headed slightly cranky guy who has an annoying effeminate best friend that always gives him advice and asks about him but is shown no interest in return meets the only other normal guy in the whole film and almost by the end they have an unexpected argument that puts in jeopardy their relationship... And don't want to give up the ending... But I think it's not hard to figure it out.New is that some main characters are gay Islamics but I think the film would have been much more interesting if they had explored that side more than the typical straight acting guy with queeny best friend meets straight acting guy part. Overall, a no brainer but well shot and acted."}, {"id": 35, "text": "The central character is Mo (Mohammed), an Arab-American doctor living in West Hollywood. He is a devout Muslim, but also gay, hangs around the gay community, and is out to his accepting family.The main action happens over the month of Ramadan, often centered around Iftar, the evening meal that breaks the day's fast. One year ago, Mo's boyfriend Hassan broke up with him, bowing to his father's pressure for him to marry a woman. Skipping the 1st night's Iftar to go to his best friend's birthday party, Mo meets Kal (Kal-el), a white actor who grew up on an army base in Jordan, and so speaks Arabic and can cook Arabic food better than Mo. They have an immediate bond over a shared love for Superman.There is no sex and little nudity in this rom-com, since it is Ramadan, when even an impure thought during the day can spoil the day's fast. But they gradually learn about each other. A highlight is an argument over whether Allah is responsible for homophobic acts in His name, even if that is not in the Koran.A minor quibble is that not all the Arabic spoken is translated / subtitled. These are probably bits of little consequence, but curious minds would still like to know."}], "reviews_amount": 36}