{"name": "Safeguard", "titleId": "tt09916190", "reviews": [{"id": 0, "text": "Not your typical action thriller but was nice to see something different. Good combination with the English / Japanese interconnection and plot. Music was pretty epic and the actors did the characters justice. Could have seen more fights or conflict but guess the budget didn't allow for that. Understandable in the indie world but would have enhanced the story big time. Liked the family element and protecting at all costs. Recommend this to anyone wanting an escape from all the negativity in the world."}, {"id": 1, "text": "OK so I don't need to be an expert film geek or choreographer to know this wasn't the best movie in the world. But on a serious note, this wasn't bad at all. If anything, it could have done with a bit more action. Comedy was good, cast was average bar the funny brits. I don't need to watch the greatest movie in the world every time I sit down with my dog and put something on. Sometimes the better the movie the harder it is to follow. And seriously, what was Tenet all about. Way too confusing and way too much. Keep it simple dudes. Check this one out if you want that."}, {"id": 2, "text": "Don't believe any of the negative reviews. I went into this flick expecting an average/so-so plot. Boy, was I WRONG! It's a great debut by director Fraser Precious who also shines in his role as a British gangster. It's not a perfect movie, but it's engaging and also has its funny moments, for me it's a solid 8."}, {"id": 3, "text": "This was by no means the shawshank redemption, but definitely worth watching for it's independent nature. If all the good reviews are from actors and friends in the movie then good for them standing up for there film. More people should do that for their films and there should be less hate in this world. This was a nice and original story with a well acted ensemble cast. Too many over paid high budget movies cramming the market. Nice to see something different here."}, {"id": 4, "text": "Overambitious? Yes. Under budgeted? Yes. Completely enjoyable? Yes!Not everything is designed to be scrutinised, dissected and critiqued to its dying breath. This movie is exciting, ominous, endearing and, at times, intriguing and even confusing. That's good! I was glued to the screen and enjoyed the ride, comedy and all. Just feel sorry for all the trolls and haters shaming every indie film out there. Shame on you. Find something better to do with your time or something else to butcher. Maybe your neighbour, if they aren't freaked out already by your demonic plague polluting this planet."}, {"id": 5, "text": "Entertaining film, not as bad as some of the reviews are making out. If you got nothing better to do it'll pass an evening. Not sure what to make of the ending but served a purpose. I don't look for any deep meaning in a pop song written by a 15 year old and the plot of a film don't gotta be water tight for me to enjoy it. And this film has a fair amount of action and comedy moments which is what I watched it for. Hater's always gonna hate."}, {"id": 6, "text": "I can't figure out why this movie's got a score under 6... it's a good action thriller movie with drama and comedy elements. It has good twists, good acting, good music and some funny moments. Al in all it's at least a solid 7. Watch it!"}, {"id": 7, "text": "Fraser Precious is on his way. I liked this one for sure."}, {"id": 8, "text": "I watched this expecting an action thriller and it's mostly that. After watching it last night I must say I very much enjoyed it, and I dont understand why some whine over a film thats so subjective. If its not your taste, move on. It has a good storyline, solid acting, a well-designed set, and technically it doesnt fall short at all. Original and not too bad. As for the people who are unable to comprehend anything except a cliche typical black-and-white hollywood movie, please skip ahead and go watch a marvel movie or something. A well deserved 7 stars for Safeguard !!"}, {"id": 9, "text": "Like some guy here in the comments I saw this movie without knowing anything about it. I liked it. Not completely predictable. Easy to follow. Good ending."}, {"id": 10, "text": "I'll jump straight to it. Good start, action packed then it kinda drifted a little and lost me around the whole family stuff. I ain't got a family no more so can't relate as they would never have looked out for me like that. It's a cruel world so whatever. Anyways, I think it needed to focus on just the baddies cos I kinda liked them. More of the spy stuff and knocking down doors for me. Too much soft soppy 'are you ok?' goose bosh that makes me cringe. But hey, that's just me. Maybe you like that emotional stuff and lets look out for the family kinda movie. Just the ending needed to go on a bit, you know, like lead somewhere. Maybe we find out that the Dad guy was in on it with the baddies. Who knows, who cares. I never like movie endings. Don't care if you disagree. I gotta beat. Peace."}, {"id": 11, "text": "Explosive start followed by a slow build up which could have pushed on a bit. I agree with the need for more action overall but it wasn't that bad. Ending was unexpected and acting was pleasantly refreshing from relatively unknown actors. It was not a waste of time like the troll reviews suggest."}, {"id": 12, "text": "I enjoyed the movie... as I enjoy most indie action thrillers. Have to admit got a little confusing at the end but aside from that, it was a well shot indie film with generally credible acting. Would have liked to seen more of Vincent and his boys as they were by far the best characters. Russian baddies were pretty entertaining. All in all, not bad for an indie flick but could have done with a bigger budget to do the action justice."}, {"id": 13, "text": "Great flick if you've seen a ton of movies in your life... you're 30 odd years old... and you have a well educated and informed background with a comprehensive understanding of human existence. Otherwise, for any negative critic or troll, nevermind being a serious low life, you'll find reading the back of a cereal box the way to start with your education and the riveting experience you've been looking for with all that time on your hands. Downright brilliant. Don't let the egocentric, low life, loser trolls fool you."}, {"id": 14, "text": "I really don't know what people think they're entitled to see every time they choose a movie. Whoever was responsible for this movie gave it their best shot with the budget they were given. Great care was clearly taken in the cinematography and set design along with a decent cast to lift the storyline. A story that's a little different with actors who gave it their all."}, {"id": 15, "text": "If you like indie films with a bit of action and british humour you will be OK with this. It's competently acted. Actually the british baddies in this do their job well. They are a good fit and its worth watching just for them. Could have done with a few more action sequences and the ending felt a bit too cliche but there is a reason for that. The movie has a decent story and for that reason I urge you to stop reading the negative reviews and just watch the movie, as people are throwing too many unfounded remarks around here."}, {"id": 16, "text": "Thanks to all the credible reviews that gave an honest assessment of this great little independent film. LOVE it when trolls like to ruin a movie with terrible reviews because it makes you realise how many idiots there are out there reviewing movies! This film deserves its merits. Its a great example of stripped back, inexpensive filmmaking that has a heart, soul and some good old fashioned humour. Super cast and great cinematography!"}, {"id": 17, "text": "There's too many people out there criticising independent cinema because they simply don't understand the process involved and what exactly it takes to even make a film. This is a prime example of a well executed, independent film that had heart, humour and was entertaining. Regardless of production value and famous faces, it was quirky and enjoyable. To all those who put down indie cinema, go and spend a day in the life of an independent filmmaker trying to pursue their dreams on minimal budgets. I can't imagine what the production team went through to get this made, but it's testament to those of us in the industry still trying to make a name for ourselves. Well done to the Precious Life Films production team and everyone involved in this fantastic film. Can't wait for the next one!"}, {"id": 18, "text": "Got nothing to pick at with this film. Solid all round and nothing short of entertaining. Who cares if its made on a low budget or doesnt have prima donna movie stars in it. Good for the guys that put this together and gave it their best shot. Would definitely watch again."}, {"id": 19, "text": "Hats off to those behind making this film as I know first hand the challenges faced with a small budget and the limitations associated. Very well executed and acted! Great cinematography and music too."}, {"id": 20, "text": "Worth a watch. Well shot and a good showcase of independent cinema. Despite not knowing many of the cast, I thought they did a great job."}, {"id": 21, "text": "Perfect escapism. An engaging story plot mixed with some quirky British humour and well shot sequences. If anything, I would have liked to see what happened next! Possible sequel? Really, well done and congrats to independent filmmakers for bringing us something different. A lovely ensemble cast too. Great to see emerging talent making their mark."}, {"id": 22, "text": "Thoroughly enjoyed this film and was looking for something without all the usual blockbuster money thrown all over it. Sometimes its nice to watch something that isn't over the top and gets the basics of storytelling right. Although the pacing took me out of it sometimes, I found the actors did a great job and there was some quality cinematography to be recognised.Ignore the critics, if they deserve to be called that. They've got nothing better to do than be nasty to independent filmmakers.All in all a great watch and something different."}, {"id": 23, "text": "Wasn't expecting to enjoy this one, but after a killer start I really got into it."}, {"id": 24, "text": "Thoroughly enjoyable and engaging from start to finish."}, {"id": 25, "text": "Forget the naysayers, this one was top notch for what it was. Solid across the board and definitely got me chuckling at times. You can't compare it to a 100 million studio film so there's no point even critiquing it the same way you would one of those because of all the money they waste on them. They deserve to be shut down. This was clearly made on the ultra low budget spectrum of films and it certainly didn't disappoint."}, {"id": 26, "text": "Top notch indie action eat your heart out. Loved it.Get in there, well done and great film!"}, {"id": 27, "text": "Really liked the Japanese / British dynamic, don't see much of that nowadays. Normally just Chinese or Russian. Quite liked the acting, definitely more into the British gangsters than the others. Family element was believable, know of a few that have been extorted like this so can relate. Not a bad effort overall so would recommend if you like this kind of film."}, {"id": 28, "text": "Don't need to say much more than I enjoyed it. Lots of interesting reflections and reviews here. Agree with the positive ones. Give it a chance and you'll be pleasantly surprised. Solid acting, solid film."}, {"id": 29, "text": "When my son asked me what I wanted to watch tonight I told him I wanted to see something different that wasn't your normal action packed mind blowing film. I told him I couldn't handle any more head spinning films that made me dizzy from all the choppy camera work. So he came across this film on Amazon Prime and said it looked different. After a big opening I was pleased to see the story focus on family and protecting each other, no matter what. This was what I wanted to watch with my son. Something with a soul to it. Doesn't need to be the greatest film in the world, but to me it was perfect for a Saturday night piece of entertainment. Few too many naughty words for me but thoroughly enjoyed it! Those Japanese boys are definitely quite the lookers..."}, {"id": 30, "text": "The wife and I watched this on Amazon Prime. While the ending could have been played out a little better, I felt like we enjoyed the movie."}, {"id": 31, "text": "Can't complain with this one, kept me watching all the way through. Clearly didn't have a huge budget behind it but not all movies need one. This was a great example of independent cinema showing it's got some muscle."}, {"id": 32, "text": "Not your every day action film which is why I tuned in. Good to see something different. Would watch again."}, {"id": 33, "text": "I enjoyed this movie. This was nothing more than a simple storyline effectively enhanced by some quirky british humour and some entertaining action scenes. Solid cast and really nicely shot. Worth the watch. Ignore the trolls."}, {"id": 34, "text": "Really enjoyed this understated film! Definitely a great mix of action, drama and comedy all in a short space of time. Engaged from start to finish and appreciated the independent nature to the production. Hats off to a stellar cast, especially the baddies! Loved the British / Japanese theme and the music was on point."}, {"id": 35, "text": "Have to say, really enjoyed this one. Some great action sequences and comedy moments definitely kept me entertained. Nice to see some quality London shots in there too. British and Russian baddies teaming up to take down the Yakuuza is always entertaining!"}, {"id": 36, "text": "So refreshing to see a non blockbuster action thriller that engages the audience and provides some great comedy and entertaining moments! Loved the opening action sequence and found the story to be compelling. Hope to see more of these surfacing!"}, {"id": 37, "text": "Great cast, loved the music and some hilarious scenes with Vincent and his boys! Definitely a hidden gem and worth watching. Gotta support the indie movies!"}, {"id": 38, "text": "Enjoyed the drama of the story, but have to say some of those comedy scenes got me cracking up! Great little indie movie with some cool action sequences. Well done team!"}, {"id": 39, "text": "So nice to watch a film with a meaningful storyline that has several layers to it you don't usually see in the big blockbusters! Perfectly balanced with elements of action and comedy that keeps you engaged from start to finish. Highly recommended and ignore all the trolls who have nothing better to do than criticise others because they couldn't understand or comprehend what goes into making a film let alone critiquing a film. Ignore the armchair negative critics who wouldn't know a storyline if it smacked them in the face. Safeguard is everything you hope to see in a low budget indie movie with a great cast!"}, {"id": 40, "text": "An enjoyable 84 minutes. To the producer, hats off to how you managed to pull this one off on such a small budget. Congratulations: the mixture of action, thrills (accompanied by notable soundtrack) and humour (some wry British lines here) worked thoughtfully."}, {"id": 41, "text": "This film has a lot going for it, and deserves a lot more than 3/10. The characters are believable, and it's nice to see some comedy thrown in there! It's low budget, but it's much better than many bigger budget, star laden affairs. Well worth a watch if you get the chance, definitely better than average."}, {"id": 42, "text": "If they made this for minimal budget, then my first thought is wtf do they do with the millions they spend on some other films. This is a great example of what you can do with an incredibly small budget.Sure the special effects aren't award winning, but if you watch low budget cinema for the special effects, you probably have made some questionable decisions in your life time.The plot was easy to follow, the dialogue funny and the premise entertaining. A really fun film that entertains throughout."}, {"id": 43, "text": "I have no idea why some reviews on here are criticising this film, maybe they are not used to watching Indy films and expect a big blockbuster film. The budget does show in the film but I think they make the most of it. The film makers have a lot of talent and let's hope it further supports the independent filmmaking scene."}, {"id": 44, "text": "Good little indie movie. Admittedly I didnt know the budget was so tiny until looking at some other reviews. Story is something a bit different if unfortunately not able to be fully realised. Acting from all on board was solid, script was surprisingly entertaining and direction / score etc largely worked well. Worth a look in to see what can be done with small backing or even just for a bit of fun, though dont approach with expectations of blockbuster effects as it would be foolish."}, {"id": 45, "text": "I'm scoring this based on my personal opinion, and classed it as a low budget. I'm not comparing it to any other type of movie to give an accurate reflection. I watched it because it was fun. Do I regret it... no. Will it win Oscars also no. This is down to earth fun, solid acting and solid plot. They've seemed to make the best with what they had and the end result is a high end low budget movie. I would recommend for sure but don't pull it apart and try to make it something its not... just sit back and appreciate the ride."}, {"id": 46, "text": "This was pure indie filmmaking at its best with a bit of action, comedy and some entertaining plot points that kept you engaged until the end."}, {"id": 47, "text": "This is how you make a low budget indie film pop. Respect to everyone involved as know too well the challenges that go into making a film on this level."}, {"id": 48, "text": "Reason why I enjoyed this film is because it wasn't the normal garbage that you see in overated overbudgeted studio produced films. It was simple and effective with a nice cast of quality actors."}, {"id": 49, "text": "Great to see something a bit different with a solid cast and decent acting."}, {"id": 50, "text": "Engaging and entertaining from start to finish. Would recommend this one."}, {"id": 51, "text": "Well I might be biased being British, but wish there were more understated indie flicks like this being made without the over the top malarkey that tinsel town sprinkles over its films. Simple, effective and well executed. Enjoyed this for its low key but intense action, dry comedy and wait... decent acting."}, {"id": 52, "text": "No need for massive budgets and overpaid a listers when you can find little gems hidden in the rough with this action thriller with a bit of comedy thrown in for the mix."}, {"id": 53, "text": "Pure and simple saturday night action. Easy to watch, simple story, kept me engaged."}, {"id": 54, "text": "Solid 8 for this one because it deserves its credit. Not sure why the ratings so low, but found this one amongst the rough and enjoyed it."}, {"id": 55, "text": "This was a decent effort on the indie scale, great acting, solid story and nice cinematography. 8/10 for entertainment."}, {"id": 56, "text": "Well this wasn't what I was expecting but after an action packed start I really got into it and enjoyed the story."}, {"id": 57, "text": "Hell yeah this was decent and something different to all the other trash out there."}, {"id": 58, "text": "This was an entertaining film and something I would recommend for easy watching."}, {"id": 59, "text": "Good action, solid cast and something original. Keep them coming"}, {"id": 60, "text": "Definitely worth a watch and an enjoyable movie for what it is."}, {"id": 61, "text": "Well I'm just surprised by the low rating Safeguard has got. It may be slow at times but it's really quite a good and entertaining film and it also has its funny moments. For me it's a solid 9."}, {"id": 62, "text": "Supporting independent cinema is just as important as those big blockbusters that prop up the industry with over budgeted, overrated actors!"}, {"id": 63, "text": "Don't understand the rating on this one, this deserves a much higher rating and why I've given it a 9/10. Other than production value and unknown actors, this was a quality independent film that I really enjoyed."}, {"id": 64, "text": "The thing I liked about this film was that it kept things simple and wasn't overcomplicated to follow, which a lot of films are nowadays. This had a great story and I thought the cinematography was equally as special."}, {"id": 65, "text": "Aside from a low budget (which you can't count against the film) it was thoroughly entertaining and engaging. Great action sequences and good acting!"}, {"id": 66, "text": "Can't believe the score on this one, was much better than I anticipated."}, {"id": 67, "text": "This was a nice change from the other trash saturating the market!"}, {"id": 68, "text": "Definitely enjoyed this film, had a unique style with the Japanese / British crossover and can highly recommend!"}, {"id": 69, "text": "Lots of reviews spend time nit piking here and there and never really make a point that matters. Of course this isn't a big budget block buster. It isn't one with a bunch of money folks behind it. But what it is is a mid level movie with a director who knew the area he was making his movie about, actors who were enjoying their roles and were talented enough to show it. This movie is well done on all levels, makes food use of its limited budget and produces a thoroughly enjoyable movie. That is all you can ask for."}, {"id": 70, "text": "Always nice to see something where a family stops at nothing to protect each other. Enjoyed this one, although could have done with a bit more action to balance it out."}, {"id": 71, "text": "A fun, entertaining movie I'd happily watch again."}, {"id": 72, "text": "Thanks for this one, a nice change from all the clutter saturating the market at the moment. Too many hollywood overbudgeted movies stealing the limelight from the indie gems. Would have loved to seen this one on the big screen if it wasn't for all the blockbusters that 'keep the cinemas open'. Good to see some British talent coming through the ranks along with some solid Japanese actors making a name for themselves. An enjoyable watch."}, {"id": 73, "text": "The reason I found this different to all the other action films out there is because it wasn't over the top. It was classy, well paced and enjoyable from start to finish."}, {"id": 74, "text": "Good flick if you've only seen 2 movies your entire life ... you're 9 years old ... or you have amnesia and you've forgot all human existence. Otherwise, for any regular movie watcher, nevermind serious movie buff, reading the back of a cereal box is a higher-quality experience. Downright awful. Don't let the friendly reviewers fool you either."}, {"id": 75, "text": "Kinji (Akie Kotabe) takes a device from the Yakuza and now must run and hide in London with his family. He operates a successful restaurant that the Russians want a piece of. The Yakuza locate Kinji and come after him along with the English thugs as we have three factions all behaving in an unreasonable fashion spewing out tough guy talk for the hell of it. Very poorly scripted and how the heck did he get that device through airport security? A desperate watch for a crime thriller.Guide; F-word. No sex or nudity."}, {"id": 76, "text": "This is a film that centres on a Japanese man and his new in restaurant in London. Gangsters from Russia, English, &amp; Yakuza are all drawn to him....This has been done before &amp; it is watchable. It is predictable but not offensive. The characters are very generic &amp; I think Guy Ritchie already perfected this genre so any imitators are up against it."}, {"id": 77, "text": "Failed due to a lot of it being in Japanese. I thought i would give this indie film a watch. Sadly i do not speak Japanese and there were no subtitles. Some of the acting was so hammy they should have brought in Peppa Pig. It actually looked like a decent movie but not being able to understand Japanese was annoying andi felt you missed a good bit of the story because of this. Maybe when there are subtitles i will give it another go. So if its on tv that is when it will have subs. Good luck."}, {"id": 78, "text": "Firstly, I imagine the reason why the main actor Akie Kotabe was dubbed, was because he actually can't speak fluent Japanese, on top of being a pretty average actor to hold a lead in a film. His Japanese is terrible and is embarassing to Japanese audiences who would never take it seriously.Secondly, the person who wrote and directed this did an amazing job with what I can only tell was a tiny budget. Thirdly, Yuriri Naka was in fact the worst actor in this entire film.Anyone that gave positive reviews to this film was either an independent filmmaker, a decent human being or understands the filmmaking process and is an impartial audience member, not a troll.This film was entertaining and funny with great little nuances planted all the way through. This is exactly the reason why directors and actors should combine their work if they have the ability to do so and their should be more of them out there that take the risks, be bold and are brave enough to stand up to all the negative critics and trolls out there."}, {"id": 79, "text": "Thriller, min other words a thriller that suffocates itself on bad story and plot, a one man score, a cast that mustve been picked out of a queue on a saturday afternoon championship football match somewhere in hooliganistan, where the shadows of the crew and equipment is seen more than nescesarry ,almost like a shadow ghost like horror movie, and the diving in nd out of japanese/english language spoken seems so inconsistent and near the end its quite irritating. usually immigrants, and thats done survey on, shows that 88% of them use their birth/home language when at home, so the mingling of languitudinal use becomes a mess. for a person that is not english, its difficult to watch this film and all spoken words shouldve been subtitled due to broken russian and dead flat hockney cokcney dialects that sounds like a talking dog to me.no , its not a good film, its stringent and cliched brit crimeaction like 99 percent of british crimefilms these days, with a whole lot of japanese, that couldve been a nice opportunity, but when the going gets tough the tough get going they say and this is a long kiss goodnight from the grumpy old man.its daft and a no-how flick"}], "reviews_amount": 80}