{"name": "Kaithi", "titleId": "tt09900782", "reviews": [{"id": 0, "text": "A drug burst, an injured cop and a Convicted Criminal who wants to meet her Daughter for First time in Life. Karthi is back as seen in Paruthiveeran. A seat edge thriller without masala."}, {"id": 1, "text": "No words... Outstanding job by the director and actor karthi... Lovely to see karthi with a wonderful film after Dev..worth to watch in teatre.. Great story... Please watch it in teatres.."}, {"id": 2, "text": "Karthi is one of the Best and underrated actor in Tamil Cinema. He did different roles in different movies. He did a very good job in this movie too. Camera work is another plus for this movie. Sam CS done a very good work in Background score!. Direction and screenplay are 💥. Definitely a worth movie to watch."}, {"id": 3, "text": "Karthi feels very raw and rugged in this movie.i feel nowadays the entire story doesn't have to be good, but some really good scenes make you feel the movie is good. kaithi has some ridiculously enjoyable scenes and a good story too.there might be some logical flaws, but who cares if the stunts are that good. All the supporting cast fit their roles to perfection. The best aspect of the movie is the bgm from sam c.s . Brilliant guy but not recognised as much. The cinematography of the movie was one to talk about. Provided the lighting of the movie should be dark ,they have done a fantastic job at that. Overall a very enjoyable movie"}, {"id": 4, "text": "Kaidhi is one of the best finest movie from Karthi what film after name shiva.kaki.this film in is career cinematography is next level no words bgm extraordinary direction unbelievable"}, {"id": 5, "text": "Kaithi pure 24K Gold...Crown Jewel of 2019 Deepavali, Can take the viewer to a sense of curiosity, leave them in Awe &amp; leaves one disturbingly inspiring with its soul. Magnanimous Director. No Fanfare No Bandha No Hyped Propaganda"}, {"id": 6, "text": "Exceptional story telling with some good camera works and music pretty much sums up kaithi"}, {"id": 7, "text": "Fantastic movie...recommended...👍👍👍👏👏Part 2 most expected... hats off to the director!"}, {"id": 8, "text": "This movie proves us that no heroine no songs or not even glamour needed to make a movie commercial. Hats off to the director. The writing was really great it doesn't make a lag and few humourous scenes makes us smile. Overall it's a grippy fun and mass entertainer. This movie could be released on other dates than with Bigil. Since it's an centre of attraction people may miss this in theatres. Bgm was lit 🔥🔥🔥."}, {"id": 9, "text": "Extraordinary action film and daughter sentiment was awesome.thriller and drama works terrific"}, {"id": 10, "text": "This flim is compared to very comfort than bigileeeey"}, {"id": 11, "text": "Oh man..... this one was splendid. Speechless, edge of the seat. As i am watching this late, i was waiting for the hero's entry and boy, did the movie deliver it! Throughout the movie you want the hero to win, the director has somehow found a way to make us feel that way. My heart was pounding throughout the duration of the movie. It is definitely going to glue your eye to the screen. The direction and screenplay is out of the world. He has even managed to capture the father daughter sentiments in this all round action movie. The cast is wonderful. Everybody did justice to their role. The story is fantastic. Its like desi version of John Wick. I would definitely love to see a sequel. Overall its an outstanding movie."}, {"id": 12, "text": "The movie is intense from the word go. Dinesh kanagaraj has Managed to Keep us at the edge of the seat till the end. Every character has done Justice to their role so much so that you can't imagine others doing it. Big kudos to Karthi for donning the role of Kaithi thereby giving a big premise for this great action film. This movie is sound in all aspects starting from cinematography at night, editing, stunts, art direction, BGM and what not. One of the best movies ever released for Diwali."}, {"id": 13, "text": "What a Authentic Acting by Karthi. Best Thriller and What a Masterpiece!!! Incredibly Brilliant!"}, {"id": 14, "text": "I don't know Tamil, yet watched with subtitles. Man, it's an edge of the seat movie. Many scenes were jaw dropping. Great direction, great background music. Actor Karthi was great. Even between the serious scenes, director has perfectly added emotional scenes. Girl's role was very cute.And its a family movie. No adult scene.Do Watch."}, {"id": 15, "text": "Each &amp; every small characters also have the depth in performance. Not a hero base movie all characters in positive roll are heros in this movie. No songs, no heroin, no flash back is the best think. BGM &amp; lighting was mind-blowing."}, {"id": 16, "text": "Suberb movie, congrats to whole team and Actor karthik for best action ..."}, {"id": 17, "text": "U will Definitely Enjoy.. Avoid Bigil (Trash bin) .. Go with Kaithi Pakka mass ... Diwali Winner Kaithi... With Family .. croud pullerr...."}, {"id": 18, "text": "The movie is very entertaining but tosses all common sense out of the window. Suh a huge gang whose single consignment loss will be 840 crores but no one in the whole gang has a gun even when they seize a huge gun from the gang arrest. But no one has a handgun all henchmen just have knives. What a stupid logic that no one Carries a gun and just knives. And even 30 people are unable to break even windows and if they had guns they could just shoot the lock on the grill but no they dont have guns so the whole night is wasted in breaking in"}, {"id": 19, "text": "I'm from Northeast India but I'm a fan of Tamil industry. After Vada Chennai this is what I loved a lot. Wonderful screenplay by Lokesh kanagaraj sir. This is the first movie of Karthi I've watched and really loved his performance, Wonderful actor. Overall a must watch movie."}, {"id": 20, "text": "Although the director has put his heart and soul in this movie, most of the sequences in this movie looks unrealistic. The protagonist more or less looks like a immortal being sent into this plot who could survive infinite amount of melee attacks and could also survive several stone attacks on the back of head.One part of the plot that revolves around the police station was too good to be true. When a bunch of youngsters who are detained in police station for drunken driving in a normal world wouldn't involve themselves in acts that could potentially prove to be fatal. But, the director defies the norm here. The detained group of youngsters (read as good samaritans) decide to help a old cop who has been transferred to that police station that night keep vigil until the protagonist along with the senior cop arrive there. As one would expect, the police station that has rogues filled in it and parasitic thugs who try to jail break the police station from the outside finally butcher one of the detainees.Just like his previous film, maanagaram, lokesh kanagaraj has made this movie with logic defying stunts that are absurd to say the least. In spite of all this, the emotional bond between the protagonist who waits for 10 years to see his daughter for the first time lifts the spirits of the entire movie which is otherwise pulled down by the trite sequences."}, {"id": 21, "text": "An engaging one! No songs, no heroine, no romance but emotionally charged actions and twists &amp; turns kept us engaged throughout the film."}, {"id": 22, "text": "Good movie, bit over done at the end. Acting is good, story could have been little bit better, because it's more of an action movie rather than a story as such. Entertainment for sure"}, {"id": 23, "text": "The movie is too good! The entire film takes place over the course of one night. From establishing a drug crime to bringing different, unrelated characters into it, building the pace and finally resolving it, there is never a moment when one is bored. And between all this, the writer manages to include some good humor and emotion. There were so many scenes when the director manages to switch from a nail biting sequence to a light hearted one within a scene. Lovely acting by everyone and awesome music! No time wasted in unnecessary romance or flash back. If I had to point out flaws, maybe it would be some over the top heroism and slightly unbelievable action sequences in the second half."}, {"id": 24, "text": "What a painfully long movie....try making movies under 90mins.....bad editing ..too many bad guys....miserable and fake fight scenes ...totally unbelievable ...unrealistic cop functioning .... Sad reviews were exaggerated beyond imagination...let's get ideas from Bruce Willis die hard series ...sorry just 3/10 buddy"}, {"id": 25, "text": "Big fan of karthi and south indian movies ... But I'm which chase against time are the central plot has to be tight and filled with adrenaline.. this one feels like actors are not even in zone of understanding time sensitivity.... This cop advices to keep those students along with girl in the police station knowing that there will be mob attack how lame .... Karthi emotional quotient irritates more than feeling sad for him ... I still don't know why they pushed the truck in jungle than ran to it and stopped ... 80 km distanced felt like 800 miles also the fished that college kid with stick and 4 idiots were watching them until he got killed ... Lame ... Direction script acting all were really really bad.... Am writing this while I am watching climax ...."}, {"id": 26, "text": "Painfully long and nothing meaningful happened. Repeated bs and total trash. I was confused throughout and nothing made sense. Fights were trash and the story could not be more predictable."}, {"id": 27, "text": "Without a mad or psycho or date expired drug addicted person no one can makes a movie like this.totally illogical. plz Karthi u r one of my most favourate actor so i request to u that don't make this kinda mistake again."}, {"id": 28, "text": "It is the same themes that kills every good storytelling And this time it is the number of bad guys the hero have to battle against 😣. A very nice plot with no unnecessary comedy and especially songs - BUT - why did the story has to involve a herd of thugs for the hero to overcome - just by himself?! If this was addressed in a reasonable way then this would have been one of my favorite for sure. The best 2 scenes are - when Karthi shares his past And Karthi and the other guy shooting their way out if a mob - very practical and don't know why the same wasn't applied for most of the good vs bad encounters?? The machine gun scenario reminds of a few Hollywood movies for sure.Other than that this is not a bad movie to watch. In certain respects a bit better than Bigil"}, {"id": 29, "text": "Fantastic Tamil movie after so long!Well-executed action thriller that follows a great script, moves at a fast pace, keeps us guessing and actually develops characters enough to make us care (the latter being where most films in this genre fails).Cast, director &amp; namely the editor have done a great job. Can't wait for the sequel!"}, {"id": 30, "text": "If you're a Hollywood movies lover definitely you don't like it. Don't waste your time"}, {"id": 31, "text": "It's a shame that when Tamil movies are doing so well, this sorta mess of a movie gets such high ratings. Absolutely illogical from start to finish with action scenes that hurts the brain. People keep saying it's on par with John Wick, but that had style, substance and a story. This is just a waste of time."}, {"id": 32, "text": "How people can give above 1 point . I couldnt understand. Its just not valuable even for one minute.."}, {"id": 33, "text": "Its a good film. Just a 1 time watch. Before watching the film i thought like it will be super good. but after watching, its a good one time watch. I wonder why this film had so much of hype. this movie lacks something."}, {"id": 34, "text": "After theeran this film was so engaging to watch karthi acting was soul for this movie and the story plot and screenplay is too different it's a new film for tamil industry all the cinema lovers must watch logesh kanagaraj made a great job special appreciation to him all the actors are performed well in this movie sam C. S bgm is truely magical and creates a goosebumps overall it's a nice entertaining film"}, {"id": 35, "text": "The action is good and nail-biting; but it is too much to expect the audience to believe that a gang which can procure a Rs. 900 crore drug consignment has no guns and just fight with knives and sickles.Even the top man Anbu doesn't have a gun. They are powerful and influential enough to slip drugs in the drinks of entire police force including the retiring commissioner but they don't bring along any guns or sophisticated equipment to barge into the police station. No metal cutters, electric saws etc; not even when there is 900 crores worth of drugs at stake. They spend the whole night hammering at the gates with their bare hands and just at the last hour, they hit upon the brilliant idea of using their vehicle to smash down the gates.And the police station doesn't seem to have any guns in the armoury, so the old cop waits to face them with a sickle in his hand.Worst still is the fact that even when the key gang members (Anbu and Adaikalam) are both in the custody of the old cop, it still doesn't occur to him to tell the goons to back off by threatening to shoot them down."}, {"id": 36, "text": "All after it is a such a thrilling horror emotional movie. The movie direction and story making was awsome and the actors had given their utmost performances."}, {"id": 37, "text": "The actions scenes of these films are so nicely and clearly executed . A good story line mixed with good action and starcast was best . Performance was good .Direction and camera work are another highlights of this movie .."}, {"id": 38, "text": "No Heroine, No songs but the best movie released in the year 2019.Those who have not seen this movie in theatres has simply missed the effect that they would have got if they would have watched this movie in theatres.I saw this movie the first day itselt when it was released. Oh My God this movie had put me on the edge of my seat till the end. Not even a single scene in this movie was felt unnecessary and not only that all the scenes were extremely wonderful.The action sequences were placed beautifully in this movie. Director Lokesh Kanagaraj has done a fantabulous job by writing the story of this movie and directing this movie.I don't have any words to say about Karthi's Performance in this movie he just lived through the character till the end of this movie.Narein's Performance in this movie was also wonderful in this movie. Hareesh Perrady has done justice to his role. Almost every actors in the movie has done justice to their roles.Altogether Kaithi is a visual treat made by Director Lokesh Kanagaraj."}, {"id": 39, "text": "This movie is really a masterpiece. The action sequels, karthi's performance, the storyline everything was outstanding. I am out of words to describe this ultimate movie. Dear Bollywood this is how a movie should be done, truly a masterpiece."}, {"id": 40, "text": "First thing I like d about the movie is that the characters are well written and very real. Every character thinks for their own first then for others so it is obviously makes it more interesting in this way."}, {"id": 41, "text": "One of the best movie i ever see 10 stars best story and action"}, {"id": 42, "text": "It's one of the best blockbuster movies in India, Some movies will redefine the filmmaking style, it's one of those movies"}, {"id": 43, "text": "But when will these people get realistic. Movie has a very good script. But the fights. How maahn . Even that could be accepted. But after getying stabbed.. And hit so many times. Still they stand up. When will these people grow up. If those fights weren't exaggerated. This could have been one of the classic thrillers."}, {"id": 44, "text": "The picture was very good. The whole picture was exciting. Full of action and thriller movies. I am giving the picture a 10/10 rating. There is nothing boring in the whole picture."}, {"id": 45, "text": "I don't know why such a hype created by this movie.story is simple the protagonist in this film can kill hundreds for saving the city from drug mafia.no suspense,no thrill."}, {"id": 46, "text": "You never expect this from kaithi..what a brilliant performance....and idea the director is best of this..no songs no heroine no comedy but op"}, {"id": 47, "text": "Unbelievable one once again from South.Vikram Vedha Thani Oruvan Memories Asuran Ratsasan Theeran Drishyam Agent Srinivas Athreya Vada Chennai Dhurvangul Rangitaranga 96All these movies of recent times will be cult classics after another generation; like we have Nayagan, Thalapathy, Ambe Sivam now.Kaithi will definitely find a place somewhere in top 5."}, {"id": 48, "text": "This Karthi and Lokesh film is good one. Very well written, one of the best background score, camera work is awesome. Action sequences are good a little tiachi style. Arjun Das was a big surprise as Villian, he convinently played a mass villian. And Karthi another super one,"}, {"id": 49, "text": "No songs... One night story movie... No heroine.... It's just amazing"}, {"id": 50, "text": "Boy Oh Boy! What a movie 2hrs 30mins of pure madness. Loved this movie. Karthi did justice to the character of Dilli his action scenes as well as emotional scene when he explained why he was in the prison to kamatchi was too good. At a time you will feel action scene is too much but there are very few scenes. BGM is awesome specially the Dilli theme. STORY IS THE KING."}, {"id": 51, "text": "Although action and emotional drama is good but what about rational things of movie. The thing in this movie which i enjoyed machine gun scene and emotional scene But i have some questions. 1. How dilli know the underground basement rout at commissioner's office. 2 how lockup villain know about dilli. 3. Why after getting hit by so many stones on head and deep cut at back by knife.. He survived? 4. At commissioner's office all thugs have no guns against dilli. How could it be possible. 5.why dilli, inspector n the truck boy pushed the truck when they can drive it and nearly made truck to go in vain if dilli could not controlled it.Answer pls someone..."}, {"id": 52, "text": "It's an no nonsense movie.It takes guts to have an original script in this unprecedented times.Hatsoff to the Team for doing an excellent Job."}, {"id": 53, "text": "A no nonsense out &amp; out thriller. Extraordinary direction...every frame you will see the riches in editing &amp; direction. Great cast!!!"}, {"id": 54, "text": "Amazing direction and screenplay ,karthi is outstanding in this movie and police officer character is well played ,"}, {"id": 55, "text": "This is the type of movie every movie lover expects to watch. -No unwanted songs -No stupid Heroine -No double meaning comedies All out action from the start till the end. Keeps you on the edge till the last scene. Excellent acting by all the characters. Big life ahead for the new villain Arjun Das."}, {"id": 56, "text": "Too good.. Karthi's best ever.. Perfect placement of characters.. Amazing script and excellent BGM.. Can't ask for more!"}, {"id": 57, "text": "From the beginning, the movie is so Gripping.. You will absolutely enjoy till the end.. My eyes were full of tears, completely crying as if I was that main character.. This movies sucks you in whole next level.. 💯💯💯💯💯💯💯💯"}, {"id": 58, "text": "Must watch movie. Karthi did phenomenal performance Music and cinematography great"}, {"id": 59, "text": "Was a bit skeptical because there is low gravity in South India and the normal theme with the hero, villain and the girl. But this movie was fantastic. great acting by Karthi, and great directing. Effects were good too. Would hope to see more movies like this in future from Kollywood."}, {"id": 60, "text": "Movie is good for the first 2 hours and goes into typical masala style and unnecessary killing of cop. All that students had to was threaten to kill Amar and ask others to not step inside."}, {"id": 61, "text": "No nonsense masala like dummy heroine, songs and build ups, yet grippy screenplay. Kudos to Logesh Kanagaraj. Karthi as Kaithi aced the role, watch climax performance you will know what I mean. BGM and cinematography are elevating the action sequences to the next level. I enjoyed it even more while watching it second time."}, {"id": 62, "text": "A top class crime drama with a tinch of varied emotions of a longing father who is eager to see his daughter for the first time after 10 years. The screenplay, Cinematography and the spinechilling BGM helps me to classify this film as a Great Work. However, many mysteries are yet to be revealed since the end is kept open. The actual interpretation of the character of the protagonist seems to be have many Strings which are yet to be opened. I personally loved the film especially the reaction of a daughter who is meeting her father for the first time. Do give it a watch to experience realistic crime Drama."}, {"id": 63, "text": "Story is good and you won't feel bored at all. The feeling of thrill is there thorought the movie."}, {"id": 64, "text": "Acting, screenplay, bgm, fight all are superb. I really liked the movie and Karthi's acting."}, {"id": 65, "text": "Gripping storyline with awesome casting. Every character is there for a reason. I can go on and on. Just don't miss this one. It's on hotstar."}, {"id": 66, "text": "Do you all remember Managaram movie, the same director Lokesh is back with a single day story that will blow your mind with the execution of screenplay and BGM. Events unfold in a single day and the tension around it and nail biting thriller scenes make this movie a must watch."}, {"id": 67, "text": "With such a thrilling first half and crazier second half, the movie keeps you hooked from start to end. I've watched this twice in the theater already and the movie only gets better with each watch. You notice all the breathtaking shots, the way the camera pans from one scene to the next, the kickass BDM, everything! Especially love how you're laughing in one scene and the very next one is emotional. Brilliant performance by Karthi and clearly the best Tamil movie I've ever watched."}, {"id": 68, "text": "Technically strong / Sreenplay / Action and amazing BGM ✌🏼"}, {"id": 69, "text": "Engaging screenplay..! Haunting BGM..! memorable characters"}, {"id": 70, "text": "It was a full meals feast for Diwali 2019. Well written script with power packed action blocks. Big round of applause to the director and the entire crew. Perfect example for the perfect film making. Director kept us at the seat edge and made us stunned from the beginning till the end. Filling up the box office collection. I hope it will receive more awards.Must watchable film. Enjoy the theatrical experience. Don't miss it, Do watch it!Waiting for Kaithi 2!"}, {"id": 71, "text": "What a movie. ..just one night story and everyone played their amazingly. Karthi stole everyone's heart when he started eating briyani. no introduction songs. No unnecessary dialogs. .no masala. . everything fitted just for story .."}, {"id": 72, "text": "It's been a while, since I witnessed such an Intense thriller filled with humour, emotion and action, tightly knitted together. Kaidhi is a racy-step ahead in terms of quality filmmaking. LokeshKanagaraj is a master of screenplay indeed! I never expected that one can bring in a seriously emotional scene, right next to a heavy holly-style action block.Karthi surrendered himself as Dilli, which will be remembered as one of the kick-ass characters in recent times.Kaidhi - surrender to screenplay ! Get the real experience in theatres!"}, {"id": 73, "text": "A must watch movie with right ingredients keeping everyone cling on to the screen. Flabbergasted plot gives us feeling of suspense from start to end. The script is of extreme high quality stock with added barbaric fight scenes. The direction has taken breathaway. Kaithi is the best release of 2019."}, {"id": 74, "text": "This is a very good addition to karthi hits. Very well executed with stunning performances from every actor. Background music is an another addition for the success as it suits perfectly for every scene."}, {"id": 75, "text": "Mind blowing, extraordinary, masterpiece, !!!!!"}, {"id": 76, "text": "Thugs are hunting down helpless cops.. By sheer luck.. the circumstantial presence of thug-n-cop-fearing-civilians with their limited resources and abilities do their best to rescue.Starting with a chaotic bunch of random seemingly unrelated phone conversations.. the storyteller quickly ties the necessary knots and establishes at least 6 strings that he can pull anytime to intensify a scene create a stir in the audience.The technical aspect like the bird-view shots and zooming drone cinematography shows the directors perspective and his ability to harness it to custom serve a specific feeling to the audience. Example - In the bamboo forest attack, true audience feel the same discomfort the victim in the lorry experience.Beautifully presented. Perfect conjunction of Intelligence, perseverance and flair."}, {"id": 77, "text": "No female lead , no songs(as an Indian movie) but still attracts, entertains , awestruck the audience by its sheer engaging screenplay. Karthi does it flawlessly with utmost sincerity, keeping director's vision at top. Setting a new standard for tamil/Indian cinema, this masterpiece will definitely a entertaining movie beyond language. Cinematography by Sathyan Sooryan &amp; background music by Sam.C.S is as apt &amp; a fortifying factor to the entire movie. Kudos to them for fantastic job."}, {"id": 78, "text": "A nice action packed movie in Tamil film industry with all theoretical elements"}, {"id": 79, "text": "Kaithi is one of the best movie Tamil cinema seen in 20 th century.you never get bored even for 10 seconds.everyone must watch this movie."}, {"id": 80, "text": "Kaithi is quiet gud thriller but overratted movie there is better thriller are there but this one is totally overratted"}, {"id": 81, "text": "One night, lots of lives and the single daylight shot at the end this is the totality of Kaithi. Lokesh did a brilliant top notch screenplay and direction and along with that Karthi stunned us through that action oriented performance. From the beginning to the end it was a thrilling experience. What I stuck when I watched Maanagaram, always haunts me going through kaithi. Superb piece of work."}, {"id": 82, "text": "Mother Teresa India charity home 'sold babies'!yes it's factual! watch hells angel by christopher hitchens if you don't believe it.movie is just a propaganda to do push the rice bag conversions.let's talk about the plot. drug,crimminal. BORING stuff. movie is slower than the moon cycle. i took 4 power naps the movie was still going on!"}, {"id": 83, "text": "Amazing movie, great direction, great actingmust watch movie,"}, {"id": 84, "text": "This is an unique film in Tamil cinema without any songs (or) lead actress. The plot happens in a night when the protagonist agrees to be the lorry driver to safely land the cops in the Commissioner office. The action sequences are realistic and carry forward the narration. Karthi was brilliant in his acting and stunt sequences. The narration jumps back and forth between the gangsters, lorry drive and the police station. A brilliant film that will not disappoint you!!! Do watch it!!"}, {"id": 85, "text": "A good emotional action thriller with massive actors and their awesomatic performance. Karthi's acting was literally awesome he just pulled of his total weightage to his role. BGM is truely international. Director just nailed with the screenplay and writting. Visuals are stunning. Totally a worth watch movie for your penny."}, {"id": 86, "text": "Never beloved that this kind of movie can be made in India. It's no nonsense movie with pure action."}, {"id": 87, "text": "First time in my life I didn't find any words to appreciate this movie, this movie is so big, so huge, it makes me so small to write a review for it, but I want to share my thoughts and want to appreciate the team.A recently released prisoner has to drive poisoned cops so he can meet with his daughter and it happens in the one night, FANTASTIC, what a concept they have, I mean the thrill they created for it makes you attach to the seat, you can't escape from it. What a direction, not a single second is being flown away, I was screaming in the entire movie.Karthi Sir has done phenomenal job, each and every expression, right from talking with cops, eating bucket full biryani, when he hear his daughter's voice first time, crying, his craziness, each and everything, and the most loved scene is GUNNING DOWN WITH MI34 IN LUNGI - JUST BLASTING EVERYTHING I LOVE IT VERY MUCH.I love the Anubu also, I love his voice, he is the real terror in the movie.What makes this movie more interesting is the emotional part WITHOUT ANY FLASBACK, WITHOUT ANY VOICE OVERS, just from start to end it is having each and every thing and completed in one night. The struggle inside the commissioner office by the single constable and the college student, creates intense moments which makes you bite your nails.I really loved it, and I am very damn sure Remake of this movie would be very tough."}, {"id": 88, "text": "This is Awesome Movie.i have cried for this movie.love of father and daughter. The Action is Super."}, {"id": 89, "text": "Kaidhi was the best movie of 2019! *The one night story. * Without any Songs and heroines. * Father and Daughter Bonding. It's one of those films which has a terrific setup with no-nonsense approach! Director Lokesh is so confident of his skills that he doesn't hold back any Twists and he puts out his entire plot and characters in the first 20 minutes itself! Kudos to Action Choreographers and Cinematographer for making it look soo stunning! Karthi Scores high again with his intense and emotional act after Paruthiveeran! Now Lokesh is one director that I'm eagerly looking out for all of his films! BGM by Sam CS was apt and took the movie to another level! FINAL WORD - It's a bang for the bucks and a must watch for all the Movie -Buffs!"}, {"id": 90, "text": "Karthi career best performance , awesome story, Loves the film alot. Lokesh kanakaraj extraordinary direction."}, {"id": 91, "text": "Karthis Raw Performance , the amazing Story , impeccable naration and most importantly the emotinal connect makes this movie Hollywood Worth.A perfect 10/10."}, {"id": 92, "text": "Kaithi is an engaging Crime thriller which gives you a completely new experience. The Director Lokesh has put a great effort , The Music Composed by Sam was terrific , The Production Values Were also Fantastic. Emotional Scenes Between the protagonist and his daughter were greatly written . The Screenplay Was Completely appreciable . Stunts were So Good . The Story Was Extraordinary with a Great Plot and Karthi Nailed his Role . All the Cast and Crew have done a great job . This Film Gives You a terrific experience and it was completely engaging. It was a very good crime drama . It also has enough Commercial elements so all the audience can enjoy it . So, Don't Miss this One !!!"}, {"id": 93, "text": "Except the fight sequences that are bit illogical the story, screenplay, acting everything is awesome and interesting till the end and definitely Worth watching movie"}, {"id": 94, "text": "Will make you sit on the edge while leaving few open questions"}, {"id": 95, "text": "Lokesh proved that he is a hard core fan of Dr.Kamal Haasan. He enhanced the quality of the tamil cinema. I hope he will reach more heights soon."}, {"id": 96, "text": "Are you get boared at watching South Indian movie like me?Then you have to watch it. Usually, physics is by SI movie. But this movie is totally different. Plot, acting, action, emotions whatever you say is appreciatable."}, {"id": 97, "text": "The best Tamil film you will ever in 2019. 'Kaithi' is a must watch film and Mr. Lokesh Kanagaraj has done an amazing and fantastic work in this film in order to meet his success and accomplish his goals."}, {"id": 98, "text": "Nowadays, making a film like this and being successful is not easy .It requires great patience and dedication.Moreover, its story and casting hold a great role. the full story that happens overnight, the director shows the audience without hesitation . because of that .the story passed through many different situations in that movie . A nightmare encounter between a gangster group and a policeman force is shown in the form of a 'masala' 'Dilli' (Karthi) is one of the main character in the movie is engaging us through his emotions and past . Add a little 'masala' and make a successful movie or make a natural award film which is better?.."}, {"id": 99, "text": "Amazing screenplay and editing. Created interest every second.climax gun scene is the hilght of the movie."}, {"id": 100, "text": "I love this movie and climax is wonderful. You must watch this movie. I am not fan karthi but I am became a fan of from now onwards. I am waiting for kaithi part 2 movie"}, {"id": 101, "text": "Despite of all other thrillers, in this movie the storyline itself is an excellent one, not other thrillers like in which they add some scenes to make it thriller. But in this film the plot of the story will make the movie look more exciting and thrilling. Hero(Karthi) gave one of his best performances in recent times, background score is one of the major asset to the film as the entire film carry-on with an exciting scenes. On the whole one can definitely watch this film with out any hesitation (or) doubt. You will definitely enjoy every bit of the movie."}, {"id": 102, "text": "Excellent Movie. Everybody acted very well in the movie. The movie was very interesting and thrilling. There were no boring scenes or songs. The main highlight in the movie is that everybody had an equal scope to perform and that made the movie excellent. The movie had many thrilling scenes. This movie is one of the Best Movie of Karthi and one of the Best Tamil Movie of 2019. Excellent Movie."}, {"id": 103, "text": "Excellent Action Thriller. One of the best in Tamil. Great music and cinematography!"}, {"id": 104, "text": "The direction of Kaithi is stunning. The level of story and choreography is a triumph .all the action were incredible. Such a interesting and thrilling movie. Narain and Karthi performed very well 👌"}, {"id": 105, "text": "This movie kept us in our seats right from the word go. Acting of Karthi, Naren &amp; George Maryan was way too good and you would only seem as characters. Background music also very good. Only thing we did not like much was violence, which was very much and could have been avoided, so you cannot watch this movie with your kids!"}, {"id": 106, "text": "The movie was one hell of a ride. It gave the satisfaction of watching a full length non stop entertainer after a very long time. Kudos to all the artists who have given very good performances especially Narain and the lorry owner guy, who was humourous in between the exasperating thrill ride.On the downside is the absence of few logical loopholes.1. How is that when an entire police station is being brought down by the drug peddling thugs no police force arrives to neutralise the situation.2. Karthi is at times portrayed as someone who is superhuman who rides again and again bashing the villains.I understand that these movies are to be enjoyed without us dwelling deep into the details, but given that Lokesh is really talented and a director with a mesmerising craft, he could have made the story even more believable which could have propelled the film to an even more higher standard.Nevertheless the film on the whole is a blast and is not to be missed and we need more and more of these kind of films and more directors like Lokesh."}, {"id": 107, "text": "I have to say this is one of the finest Tamil cinema produced in this decade. Kudos to director lokesh. This movie is the closest to John wick. I seriously wish second part comes sooner. And it has to start right where it left on the first part."}, {"id": 108, "text": "Wow wow just wow wot a movie, simply superb outstanding movie, really hats off to the makers and especially karthi wot an actor take a bow👌👌👌outstanding performance!! Kudos👌👌"}, {"id": 109, "text": "Excellent acting from karthi and naren Lokesh kanagaraj did better than managaram"}, {"id": 110, "text": "One of the finest film.You cant find anything wrong in this film..it was pictured clearly.the screen play is the best.."}, {"id": 111, "text": "One night story of a 1)cop and his case of drug smugglers 2)prisoner and his night before the visit of his daughter he never saw before. Both cross line does cop succeed. Does Dilli saw his daughter. This movie has a little of unreality In which dilli stands to fight even after lot of damage to him ,also necessary for a Tamil movie to get commercial success. If you can just get on with it, you are in for good action crime movie .Now this director it's his 2nd movie after managaram which was also a review acclaimed movie. Hope he gets on with his work this way and have lot of success"}, {"id": 112, "text": "Full Energy packed Thriller and Emotion movie...From Starting to Ending the Screenplay was Amazing and so engaged...Lots and Lots of Positive points in this Movie... Fully Story Based-Technically very Stronged-Amazing Screenplay- Stunning Action sequences-Terrifying BGM- Mass Acting etc etc... It's a great visual Treat for Action lovers...Such an Amazing must watch movie"}, {"id": 113, "text": "Such a wonderful movie.. fantastic cinemotagraphy.. Karthik doing very well..wonderful screenplay.. I love kaithi I'm watching 3 times"}, {"id": 114, "text": "It's surely one of the best movies of 2k19.Story: The police officer seeks the help of a Prisoner to safeguard the drugged police force from the Drug Mafia. This storyline is new to the Tamil cinema and the entire movie runs in a night.Acting: Karthi's acting is lit and it's natural as a real prisoner. The role of Narain and every other supporting actors are well made.Action and stunts: Action scenes are well framed. Each and every fights are engaging and has its moments.Cinematography: Cinematography is awesome, eventhough the entire movie is set in night time. Camera work was well made.Screenplay:There is no lag anywhere. The screenplay is too intense and perfectly matched with the storyline.Direction: Direction part is well made. The emotion shared between Karthi and his daughter is awesome. It can bring us tears at the last scene.Overall, it is an intense movie with a unique storyline you can enjoy this diwali. My rating:4.5/5"}, {"id": 115, "text": "MOVIE WAS NICELY CRAFTED EVERY SINGLE FRAME KAITHI WILL NOT DISAPPOINT YOU AND MAINLY IN THIS MOVIE NO LOOSU HEROINS AND NO SONGS EVER HATS OFF TO DIRECTOR AND I M WAITING FOR HIS NEXT THALAPATHY MOVIE WAITHING VERITTHANAM"}, {"id": 116, "text": "This year was fathers year after viswasam, asuran kaithi joins the list. and tamil actors now trying to go story based movies like asuran,nerkonda paarvai,vellai pookal, thadam and now kaithi instead of doing entirely commercial movies doing story based movies will reach audiences. but still some actors doing the commercial stories actors want to realize that audiences mentality has been changed they only like see new stories from the industries"}, {"id": 117, "text": "Kaithi simply pakka mass , best screenplay BGM therikudu aprm karthi's acting extraordinary vera level special thanks to the director"}, {"id": 118, "text": "The Movie is one of a kind .The original experience is watching it in Theaters .This movie definite space and explaination for every character and his actions. This is Karthi's one of the career best performances .And all other Actors were also fantastic .Last but not least ,about director Sir you are a promise to the growth of South Industry.Overall a nice movie!#promote such movies"}, {"id": 119, "text": "It's one of the best, from Karthi !!! uplifting and encouraging action pack !!! @Lokesh kanagaraj you ROCKS !!!!"}, {"id": 120, "text": "Best Movie Of Karthi till date. Full &amp; Fully Action Packed Emotional Thriller. Lokesh's Direction &amp; Sam CS BGM is Top Notch. Absolutely Gem of a Movie and Must Watch in Theatres."}, {"id": 121, "text": "Newly Paroled convict, who gets convicted for killing in the process of defending his pregnant wife and with the hope of seeing his daughter for the first time gets caught in a situation where he has to help the Police. (Poe bought a stuffed Bunny for his daughter: Dilli bought Earrings) The was his daughter hides when she see her father for the first time is also similar. At least they should've given a different back story for the lead. I wanted to enjoy this movie but these similarities kept bothering me"}, {"id": 122, "text": "Lokesh direction Karthi acting and Sam c s music ....top notch"}, {"id": 123, "text": "Emotional action thrill, entertaining to watch. Not the kind of movie to watch in theaters."}, {"id": 124, "text": "I came to know about this movie after coming across a list of Top South Movies. I really expected something like Drishyam but it turned out to be another overhyped movie like Ratsasan with no good script, annoying acting and useless characters. Totally wasted 2 hours 15 minutes on this movie."}, {"id": 125, "text": "One of the best storytelling movie i ever seen in tamil industry. Very good acting."}, {"id": 126, "text": "This is it. What is there not to like in here. Music is one of the biggest plus point. Perfect timing of each and everything. Goosebumps itself got bumps. I ended up watching the trailer after watching the entire movie just to get that boost again in a different way. Film ended up with a big question mark as to who actually Dilli is ? Tollywood industry in itself is a different level altogether."}, {"id": 127, "text": "An absolute blast of a film. The action sequence, the cinematography, acting and the amazing bgm.Everything was at its finest. One of the best thing that came out in 2019."}, {"id": 128, "text": "Very well crafted storyline. Maybe a little stretched at certain times, but overall good movie. Karthi never fails to impress me with his emotions. Beautiful!The gatling gun at the climax scene was pretty cool for a Tamil film!"}, {"id": 129, "text": "Intense action scenes gripping story and screenplay became a fan of lokesh"}, {"id": 130, "text": "I am from North east and I like only realistic type movies be it from Bollywood or South Industry. In short, i don't like movies like Temper, Dabangg etc etc. But something told me I should give this movie a try and I am so glad I did. This is by far the best action South Movie i have ever seen. And I am so glad i watched it with subtitles. Otherwise, hindi dubbed mostly ruins the feel in original audio. A one night story and so many adrenelin rush. Woo! I just want to erase my memory so that I could watch this movie again. My next stop will be Thambi and Asuran."}, {"id": 131, "text": "Superb engaging, entertaining, thrilling screenplay. Don't miss it."}, {"id": 132, "text": "Director Lokesh Kanagaraj presented another movie with his unique pattern with a different formula.Doesn't seem to be second film for director and minute detailings are super in this movie.A turning point movie for some artistes acted in this movie and it's a clear blockbuster for Karthi.Apart from Karthi's character adapted performance,actors like Dheena, George Maryan and ArjunDoss scored well in their provided screenspace.Good movie debut for Blacksheep Deepthi too.Sam's BGM worked out very good in this movie and had been used according to the requirements.Stunt Choreographic work by Anbariv is good and it doesn't seem odd and unrealistic in any places.Handling of emotion,action,comedy and powerful dialogues at the required rate was really a laudable effort.A big congrats for producers who were financially successful in making this movie.Good plot available for sequel in this movie."}, {"id": 133, "text": "Could not have found a better movie to watch this year, wait this entire decade. Just amazing. Tip of the seat throughout the movie. What a gem."}, {"id": 134, "text": "This movie is almost perfect . The cinematography and editing and choreography of action are top-notch. Director did a good job performing and executing the shots . the whole movie was just epic. I love the emotional aspect with his daughter that was very beautiful to see on big screen"}, {"id": 135, "text": "My one of the favourite actor in South industr..... Heartily love from Banglades..... Big fan 😎😎😎"}, {"id": 136, "text": "Very intense and raw thriller! 2018 ku Ratsasan, 2019 ku Kaithi. Oru nalla theatre la ticket vaangitu poi family or friends oda poi paarunga, kaas ku worth aana film. The whole crew of this film did a tremondous job. Waiting for Kaithi-2!"}, {"id": 137, "text": "Film based on cocane smuggling between cops and goons...one of the good cop seeking help for a man who has been recently released from jail sentence...great screenplay with lot of twists and interesting facts...cold blood scenes also there...director indicts for part 2 of this movie... Cast was soo good...especially from Karthi and naren..."}, {"id": 138, "text": "Awesome unbelievable. What ah movie. . !!!👌👌👌 👏👏👏"}, {"id": 139, "text": "Director made his best in this film and doesn't compromise on the usual songs &amp; heroines..He only do what the story needs..These kind of films need to watch..."}, {"id": 140, "text": "Kaithi is an amazing movie vfx is super lokesh s direction was also super bit karthi was the best this is better than bigil watch kaithi for sure you have to watch this thriller the screenplay vera level even narain did a very good job waiting for kaithi part 2"}, {"id": 141, "text": "Just the kind of movie we have been waiting for someone to make in tamil! once again an original from Lokesh Kanagaraj!. an interesting storyline?, or may be I can put it this way...a sequence of thrilling scenes with a simple story stitched tightly one after another just to keep us engaged throughout!. No unnecessary scenes!, no songs! no female lead!. Its a dream come true for action thrillers!. No spoilers here!. the director wrote something that is so apt for Karthi with some interesting touches to it!. Oh! and there are some surprises that truly deserves claps! and it did!. Unpredictable. Top-notch cinematography!. BGM in certain portions are so well done, even if not throughout. It's the writing that kept us glued to the screen!. What a ride! Go for this one!"}, {"id": 142, "text": "Simple , KAIDHI is 100 times more than BIGIL Lokesh kanagaraj's perfect film making defeat copycat atlee"}, {"id": 143, "text": "In this movie powerfull character scored the movie the name is the dilli (Karthik) such a versatile acting he deserves the every scene like a kaithi The movie every sequence is thrill and the movie is the best of 2019 best movie tamil"}, {"id": 144, "text": "Guys,I hate tamil movies for their template movie making..... 5 songs, 5 fights, a lunatic heroine who falls in love at the drop of a hat, a larger than life protogonist.... no story and bad comedies...Well, I have just seen a movie which is all original, a genuine thriller wih edge of the seat movie telling from the very begining till the very end....The story telling is par excellence.The story happens during one night where all senior cops are sedated and all gangsters are enticed to kill 5 cops for a very large payment. Thus begins the cat and mouse game with moles in both police and gangsters activated.The whole movie is shot in night as the story happens over a night. The cinematography and background score are superb and mesmerizes you.Spoiler alert: In order to stop two gangsters from communicating, a loud music is played. The music belongs to different genres like romance. All the actors have emoted anger and frustration while the background score is romantic. I have never seen such a superb film making to date.Hats off to the team for doing such a wonderful film. Do not miss this one, this movie sets a new benchmark for tamil movie making."}, {"id": 145, "text": "The movie is entertaining but without any logic ...I mean where on earth such dangerous gangs exist that don't have guns ... a single person fights with 80 people and then in the end gets out of ambulance without any treatment and walks away"}, {"id": 146, "text": "Everything happened in 1 night. Dark theme was filmed nicely. Acting was done superbly. Good story and scene making. Why soith movies are best because they followed are tradition like clothes of main lead which society he is belongs from."}, {"id": 147, "text": "What a fantastic Movie #karthi Act Was Unbelievable Perfect Every Scene Was Mind Blowing... what a Direction Story ....Can't World Fr This Movie...Unexpected..........Describe One World Masterpiece.."}, {"id": 148, "text": "Kaithi is the best crime action movie, I have ever watched till now. Lokesh Kanagaraj's direction at the top a very very well direction, music ,bgm,Writing, story everything happened in just one night. Karthi's acting in this movie at the top of his career's best performance.he just nailed it in every second of the movie."}, {"id": 149, "text": "I was lookig forward to see this movie since release and finally today I watched in hindi dubbed, Thanx to Goldmines films to dubbed this awesome movie. Each character has perfome very well, cinematography, music, direction every thing is superb... this is a movie. A real movie which has shown love, emotional, action, duty, students, Police, criminal, feelings, aerage people to khalnayak everyone is in the story, what a great story written by film writer. Hats off..."}, {"id": 150, "text": "Ek number movie,must watch Please watch once 100 entertainment"}, {"id": 151, "text": "It's like Hollywood movie mad Max Fury toad, if u can start watching"}, {"id": 152, "text": "Kaithi.directed by lokesh kanagaraj is undoubtedly the best action thriller in India and one of the best in the world. The climax is just masterpiece!!! Watch for karthi's genuine performance and Lokesh Kanagaraj's Hollywood level direction."}, {"id": 153, "text": "Wonderful film. Action like reality. There should be second part after seeing last seen."}, {"id": 154, "text": "The basic premise of this movie was heavily copied from the movie Swat-Under Siege (2017) even that iconic machine gun scene"}, {"id": 155, "text": "Had seen this movie with zero expectation and turned out to be fantastic. Keeps you on the edge. Love the action. Heard this would be made in Hindi with Ajay D. Hope it too turns out to be excellent Ajay has that intensity needed for this role. But original would be original none can meet the brilliance hope I am wrong 😀👍"}, {"id": 156, "text": "I watched this movie in a theatre without any expectation. To my surprise, this was really a unexpected thrilling experience with outstanding background score. Karthi is apt for this role. Thoroughly enjoyed it! 10/10 without a doubt."}, {"id": 157, "text": "Must watch, everyone should see, this movie very special for action lover."}, {"id": 158, "text": "The story presented in such a manner that u can feel ur hearts rhythm up and down. Director Lokesh Kanagaraj make u feel satisfied after watching this movie. Each scene and frame of this movie is applauding. The Director, the hero , the villain and remaining cast will hook u throughout the movie. Its a feast to watch"}, {"id": 159, "text": "This movie has everything, great story line,taking and humor.i enjoyed karthi's acting very much. I recommend highly to watch this movie"}, {"id": 160, "text": "I have created  account at 11 pm to just applause this movie... Really awesome... Karthi semma thala unexpected.. Lokesh worthu bro..."}, {"id": 161, "text": "This movie won't disappoint you.... hat's off to director nice movie seen after long year"}, {"id": 162, "text": "Can't express in words how much I love this movie. One of the best Tamil movie this year (2019). Acting, Bgm,plot, stunt etc etc.. everything is in the top notch.. Try to watch in better qaulity.. Waiting for Kaithi 2 💓💓.."}, {"id": 163, "text": "Very few indian movie can be this engaging. Extremely suspenseful and every minute is must watch. We will either love or hate every characters. Kudos to the director. Background score is pretty good. Karthi , Naraine, Lorry kid, College kids and constable in commissioner office is really good. Little off logic in attacking commissioner office but i do not care."}, {"id": 164, "text": "Amazing nail biting thriller after a long time in tamil cinema . Great screen play ... story is very simple and its directors art to take this story in an unforgettable journey . A great mix of thriller / action / sentiments . Totally love it ."}, {"id": 165, "text": "Kaithi by Lokesh Kanagaraj is one of the best action thrillers ever produced in Indian cinema. The movie is unabatedly true to its genre and is totally void of cliches . The is no eye candy heroine, no double entendre spewing comedian, no time wasting song numbers. Just the story. And what a thrill ride it is. Being a great fan of vetrimaran I must admit this director come close to his greatest works , if not better. Karthi as the protagonist gives a spellbinding performance. Take a bow. He has come of age while his elder sibling is fading into twilight. Background score by Sam c.s elevated the scenes to a different level. The sound design was great. Cinematography was excellent and the action choreography was outstanding. Pls support these kind of non commercial projects which will catapult Tamil cinema to a different level in world stage."}, {"id": 166, "text": "I believe if prequel or even if sequel...is made ....then also the tempo of this movie will remain same.."}, {"id": 167, "text": "Such a great movie. That anyone won't disappointed. Excellent cinematography. more over Karthi and Naren both my favorite actors. showed a great performance through out in the movie. can't find any lag in this movie at least 1 second, can only say a bad comments for college girls performance, but still its good. all the best for them too. what will be in second part...eagerly waiting.....!!!!!!!"}, {"id": 168, "text": "While Karthi can be credited as central character to the movie, the narration is fantastic with you tend to get involved with all the side plots which are joined to main plot... Truck carrying druged Cops, Police Station surrounded by goons and Undercover Cops... fantastic. All the supporting cast have played their roles superbly which makes this movie Gr8..."}, {"id": 169, "text": "Excellent movie with excellent screenplay! Karthi and Narein combo super!"}, {"id": 170, "text": "#KaithiLokesh Kanagaraj 's another gripping thriller, He has once again showcased his potential to become one of the best filmmakers of Tamil cinema. cinematography is the biggest highlight of the film and it works big time. Equally good are Sam CS's music and the crisp editing of the Editor. #Kaithi is simply one of the best action thrillers that we have had in the recent times."}, {"id": 171, "text": "Awesome movie... good performance by narine and Karthi but the director steals the show completely...go and watch the movie in the theater....."}, {"id": 172, "text": "Super script and screen play by the director and Karthi's action is super.. sentimental and thrilling to watch..."}, {"id": 173, "text": "I can't imagine this film i watched in Tamil.. and I swear guys I don't understand Tamil language but I have no words for this film.. totally realistic.. superb superb superb"}, {"id": 174, "text": "Story - Edge gripping Stunning Acting - Karthik, Naren , Villain, Karthik daughter, police constable, three College students,Sheena Direction - Lokesh kanagaraj made justice for his story. Background &amp; Bgm - superb... Cinematography - well pre-planned work.My rating is 10/10"}, {"id": 175, "text": "It satisfied me fully in action, sentiment, crime, thriller.people who like action can definitely can watch on theater. Worth of money to see in theater"}, {"id": 176, "text": "Without a Song, Heroin the movie goes really fantastic and there's nothing boring scenes in the picture. The Director created comedy scenes even in such a serious concept.Coming to Karthi his excitement, enthusiasm to meet his daughter for the first time and his commitment to his promise to the police and his naturality of acting were really fabulous and plus to the movie. Remaining also very good. I can recommend this will be one of the best movie to watch."}, {"id": 177, "text": "It's a very indulging movie with great cinematography. It's a action packed movie with captivating performances."}, {"id": 178, "text": "I would say that I'm glad that I've watched this movie and it is worth to watch. Worth your money. No song nor heroine. You have to watch it."}, {"id": 179, "text": "Karthi and Lokesh Kanagaraj manage to create magic with this intriguing action-drama. A must watch!"}, {"id": 180, "text": "Must watched movie karthi acting is awasome Promising director"}, {"id": 181, "text": "What a awsome movie after so long . Simple story but the script is excellent .. karthi awsome acting .. not even a single minute you feel bored .. worth watching in theatre . Dont waste money for diwali release bigil . Just go and watch this movie"}, {"id": 182, "text": "Lokesh kanagaraj made a such thriller...dont miss it"}, {"id": 183, "text": "Superb just love it every scene is top quality mad love for the team"}, {"id": 184, "text": "One of the best movies from Karthi. Excellent making and direction from Lokesh Kanagaraj. Beautiful camera work. Slick storyline. Action packed scenes and the icing on the cake is Karthi's performance.P.S: The BGM by Sam CS was on an other level.Kaithi deserves a 10/10."}, {"id": 185, "text": "This Is A Seat Edge Thriller.Don't Miss If You're Mass And Thriller Fan.Script And Direction Of The Movie By Lokesh Is Outstanding."}, {"id": 186, "text": "I don't remember the last time I saw a Tamil movie which was a mass movie and a good thriller. Petta fits the part as mass movie but it was not a thriller. Kaithi has some high voltage scenes. The film is full action from start to end. There is no hero flashback scenes or romantic dance number with leading couples. There's not even an female lead because there's no need for it. I liked all these elements in Kaithi. Karthi did an excellent job and carries the film on his shoulders. The direction and screenplay was also very good and the movie will not bore you anytime even though its full action. The bgm was also cool. Overall, Kaithi is a must watch movie in theatres and everyone should watch it than Bigil. Waiting for a sequel."}, {"id": 187, "text": "One of the karthi's best performances and music director did his part well and director contributed to fine thriller and mass climax"}, {"id": 188, "text": "An absolutely gripping nail-biting thriller.Another fantastic movie by Mr. Lokesh Kanagaraj"}, {"id": 189, "text": "How can i explain the theatre experience of this film i have no words to explain. this is marvelous absolutly brilliant creation from Lokesh👌fantastic in every ways...goosbump cclimax ufff👌heavy making👌stunning cinematography👌superb direction👌bgm is on fire..totaly a cinematic masterpiece👌"}, {"id": 190, "text": "Please watch it in theater's... U will not regret ...it's a pure and finely crafted film for cinema lovers...."}, {"id": 191, "text": "Graphics, sound,Camara effort super machi it's amazing"}, {"id": 192, "text": "The story line and the character is amazing. All the characters have given their 💯 . No fillers .. perfect punch lines. Overall the Movie is good."}, {"id": 193, "text": "Glad this movie happened which can keep you sticked to the seats all time. Can't wait for the Kaithi 2. Karthi deserves every award that is considered for acting"}, {"id": 194, "text": "Must watch for film lovers, excellent acting by all actors And good direction."}, {"id": 195, "text": "@Dir_Lokeshwt a show man written,Directed in a unique emotional manner with strong action. Content speaks what's his caliber. Needed guts to write this kind of plots without #Actress and Songs. Congratulations for the success.#Karthi most promising wild, raw performance after Parudhi veeran@SamCSmusic BGM was terrifying#SathyaSooran Cinematography too"}, {"id": 196, "text": "One of the best film in karthi's carrier.First of all the big man of this film is LOKESH KANAGARAJ. After MAANAGARAM , he done a perfect one-night action thriller film. Lighting - Best lighting done in this movie , this movie fully took in night only . Without this perfect lighting team KAIDHI can not be released.Impressive lightings are used, there is no unnecessary lights. 10/10 for lighting. Cinematography- The perfect cinematography done.SATHYAN SOORYAN already proved him in Dheeran,maya,yudham sei such films. This is one of the best film in his carrier. You can see his hardwork in this movie. 10/10 for cinematography. Music - SAM CS done great job. His situation handled music is surprising.There is no songs in this movie , but his BGM is very effective.9.5/10 for music Cast - Dheena - Nice humour , in a action thriller film , some fun is need.His fun worked out nicely George maryan - He done a small, important and brave character.Everyone will like his character and his acting . Ramana - Acted well , he is also small and important character. But he is used for fight only. This is not a mistake , but small disappointment. But it may be turning point of his carrier. He did not acted long time. By this film , may be he will get any chances Narain - Nice actor , Already he proved him in Anjaadhey film. In this film also he done an important role and he done very well , acted also very well Last but not least KARTHI - We know him very well from paruthiveeran.His previous movie DEV is not worked out for him . But definitely this KAITHI will be evergreen film and will be a blockbuster. Because the character of Karthi is very strong. Moreover he acted very very well . Perfectly he match for that character. In every scene he proved , frame by frame he lived as DILLI character. As angerman , as father , as accused , as man who tell his story, in every angle , he changes his reactions and acting. Hatsoff to him. Once again he proved as an actor 4 STUDENTS - There is four college students involved in this movie. All of them acted very well , their characters gives fun and emotions Cast 10/10 Editing - Philomin raj edited this movie nicely . He gives us what we need and what the movie contain.There is no unnecessary scene in this KAiTHI 9/10 for editing Story and Direction - LOKESH KANAGARAJ The name LOKESH KANAGARAJ is enough to watch KAIDHI . Everything is done perfectly. Amazing direction . He wrote every character effectively. Every character have weight . There is no unnecessary character in this KAIDHI . Nice narration . I think he is specialist of one-night action thriller.Because MAANAGARAM also one night thriller.There is no mistake in his narration and direction PERFECT js only one word match for him 10/10 is not enough. PERFECT FILM FOR THIS DIWALI. MUST WATCH IN THEATRE.MUST WATCH WITH FAMiLy"}, {"id": 197, "text": "A truck load of drugs is seized by a crack team of cops in what appears to be the biggest drug bust ever. The desperate drug gang wants the consignment back at any cost.Thus begins a narrative that is a thrill ride of events unfolding over a night with well placed moles on each side and safety of the cache as well as the lives of some top cops hanging by a slender thread resting on the shoulders of a recently released convict.Karthi brings a simmering intensity to the part of the protagonist, Dilli - both as a father yearning to see his daughter for the first time after spending a decade in prison as well as the titular macho convict rescuing the cops. Sam CS throttles the proceedings onwards with his pulsating score.After a stellar debut with Maanagaram, director Lokesh Kanagaraj (LK) delivers an above average action flick that is fairly engaging and entertaining.Overall, while it may not match Maanagaram in its audacity, Kaithi, despite its flaws, is a neat action entertainer."}, {"id": 198, "text": "It's fairly impossible to craft an action-thriller suited to the Tamil sensibilities without acknowledging its audience. Lokesh Kanagaraj does a pretty amazing job of staying true to the pure action genre in Kaithi. It's that action thriller with a lot of heart. As we saw in Kanagaraj's earlier venture Maanagaram, Kaithi too has interweaving storylines. But the treatment is what renders it engaging throughout. It's a long film (153 minutes or so) yes, but the story moves at such a rapid pace that the audience remains consistently hooked. To put it across in a funny way, Kaithi is the kind of film where there's so much happening at breakneck speed that a viewer who's about to open the lid of a water bottle to hydrate himself/herself may hold back from doing so, till the end of another elaborate set-piece.And when we talk about set-pieces, their crafting is stunning (though exaggerated at times). Anbariv is the man behind these well-thought-out sequences that often raise the levels of adrenaline in the audience. Sathyan Sooryan (the DOP of Theeran Adhigaaram Ondru) handles the cinematography - Kaithi has been shot entirely in the night (except for the last few frames) and yet, everything that unravels in artificial light looks good on screen. The background score by Sam CS definitely ups the style element of the film, and it's one soundtrack you'll want to check up on YouTube or SoundCloud immediately once you're done watching.There are no songs or sappy romances in Kaithi - well, that's how an action thriller ought to be. I appreciate Kanagaraj for doing away with these unnecessary commercial elements, even when there are numerous 'invincible mass hero' moments. It's wonderful how Kanagaraj has given emphasis to characters other than that of Karthi's Dilli. George Maryan, who is relegated to comical roles in most films, gets a meaty character with a fair bit of action - he does a brilliantly memorable job of it! Narain, whom we're seeing in movies after a while, is wonderfully restrained and lets Karthi shine in the scenes that are for the whistling fans. Dheena offers some comic relief in the form of pop-culture references and lightens the tone of the otherwise serious flick.At the core, there's also a story about a father who's travelling to meet his daughter for the first time. While this amps up the sentimental quotient, certain scenes such as the one featuring the crushed earrings, could have been written better (or completely subverted). There isn't any suspense as the important twisty bits are given away in the opening (half) itself, but Kanagaraj's packaging works wonders here. The action bits are strongly done, and that's a more-than-good reason to watch Kaithi. Well, how often do you see a lungi-clad hero using a Gatling gun?"}, {"id": 199, "text": "Kaithi (2019) : Brief Review -A Hollywood Remake converted into a 'Blockbuster A Grade Action Drama' in Tamil Cinema. Among all the South Action films i have seen till date whether it is on Television or on Mobile, most of them had insensible and unreasonable action sequences to please masses therefore i don't have much interest to watch such films. Somehow, Kaithi made it to my watchlist because of High Rating in IMDb and Bollywood Remake announcement. Now i can say that, Yes, South can make Sensible Action Films with right contect, well executed Action sequences and perfect emotional touch. Kaithi is a fine example of A Grade Action Film (not a thriller at all) which is far far away from those unrealistic and non sense action flicks where any thin hero could take on 40 healthy villains and make them fly high with unseen hidden punches. Apart from Action Kaithi also takes care of proper plotting from the start to the end having all the conflicts at right places. The leading role is amazingly portrayed by Karthi. He was into the character from the first scene and never took it out of him whether it is action sequence or emotional scene. It would be hard for me to forget his image and see Ajay Devgn in Bollywood Remake even though Ajay Devgn is a Great Actor. Rest of the cast is okay but no effective impact from anyone. Lokesh Kanagraj direction is matured which is rare in this genre because he kept the essence and content alive. He did not fall apart for adding comedy and make it just another masala film, rather he made it thrilling which is rare. And despite little dark tone the film became a Blockbuster success which proves that Director's vision to make an original flick in an unoriginal genre was right. Finally a relief from senseless Action flicks in South Indian cinema since Bahubali and KGF.RATING - 7/10*By - #samthebestest"}, {"id": 200, "text": "It takes serious guts to lock horns with a movie like BIGIL and release your movie on the same day. The guts can only come from tremendous confidence in the output and Lokesh Kanagaraj emerges successful once again with his Karthi-starrer , Kaithi. Similar to the screenplay style of Maanagaram, Kaithi also has multiple plots running in parallel, where all gets connected towards one common cause.The movie opens with a big drug bust operation led by Bejoy (Narain) where the lower level mafia group is detained. Irked by this operation, the mafia leader's brother fixes a huge ransom in return to decapitating the 5 police officers involved. Unaware of the insiders from the drug mafia, the entire police force is in a party where drinks are mixed with harmful sedatives. Bejoy now has the task of transporting the entire unconscious police force to a safe medical facility without alerting media, other officials or the mafia. His only option is Dilli (Karthi) who is brought into custody for an anonymous investigation, since he alone can drive the lorry to carry the officials. Whether Bejoy-Dilli were successful in carrying out the operation or did the mafia get hold of the drugs is the remaining plot.The movie holds the audience under its clutch right from the first frame. What is surprising to see is Karthi, an otherwise experienced actor in dialogue deliveries, has been given very little dialogues and yet he manages to steal the show by his mere body language and rustic attitude. Each time Dilli manages to escape the ploy of the mafia, it is literally a case of our blood pressure shooting up. Sam CS has terrified the audience with his BGM score. Another notable highlight is George Maryan along with the college students guarding the IG office forte from the mafia. While his comedy roles in movies such as Kalakalappu made him famous, this for sure will show him in a different light.Well, the ending definitely suggests there could be a sequel/prequel to this. We can't be more excited!"}, {"id": 201, "text": "147 minutes! Does it sound longer to sit and witness a single night's event? If you are an indian movies follower, does it sound boring to watch a movie which doesn't have a female lead or any songs to tap our feet? Huh. If you have any more of such doubts, take my answer. This movie is utterly impressive and absolutely worthy of your time and money. Lokesh Kanagaraj who made Managaram which again was a thrilling tale of few characters in one night. It was perfectly casted and made as a complete film and hence all eyes were on Kaithi. Lokesh had just arrested me with his screen writing and treating every scene with so much conviction to blow audience's mind completely. The cast again was topnotch. The constable Napolean (Maryan), Anbu (Arjun das), Inspector (Naren) and every little character was so tailor made for everyone respectively. It gave a fresh sense of viewing the movie as the buzz it creates right from scene one was perfectly fitting. Except for a slight (very minimal) slump in second half which was actually unavoidable to have the story completed, the movie was amazingly well crafted to it true genre. Loved this movie and look forward to next avenues of Lokesh as he seem to be one of the greatest asset to Indian cinema already."}, {"id": 202, "text": "STORY A prisoner on parole, who's on his way to meet his daughter, is enlisted by an injured police officer to protect a few cops. With the entire lot of gangsters in the place after them, can the prisoner save the day? REVIEW The film revolves around a prisoner which is released from the jail.. who is named Dilli. The entire film runs in one night.. CAN YOU BELIEVE IT it runs in one night just like Lokesh kankaragan Managaram. It's a very gripping and action thriller which hooks us completely.. Karthi shoulders the film where no actor in the movie does.. ONE MAN SHOW. Like most of the Indian Films do.. there is no any type of masala added in this film.. it's completely different from other films.. in terms of cinematography and the music. The cinematography was very good and engaging throughout the movie.. the cinematographer painted the film perfectly with his tools. THE music by Sam c.s was excellent and stupendous. It elevated the film and the hero. The technical aspects of the movie was good. The director grabs the attention through his art of taking movies.. The emotions which Karthi potrays in this film is heart touching. You can see different Karthi through this film.. OVERALL VERDICT - YOU HAVE TO GIVE A TRY.. OTHERWISE YOU'LL MISS SOME WONDERS.."}, {"id": 203, "text": "In cinema across the world, when the story revolves around mafia, corruption, police and a common man striving to help the right and be just, we have always seen that it never goes wrong. In Kaithi, we witness the same.In a gripping story on how the police lay their hands on multi-crore drugs and what ensues henceforth till the audience is left with a cue when the end credits roll that something more will happen, Kaithi is a power packed film which grips you for 2.5 hrs not allowing you to rest. It is an edge of the seat thriller where you cheer and root for the protagonist to be successful in whatever he has set out to accomplish.#Karthi is powerful in the role as Delhi, a screen name and role that will not be forgotten in the near future. He is rustic, raw, and convinces you easily as a convict who has been released from prison a good four years before he completes his life imprisonment sentence. Who knows why did that happen and if at all that was the reason. You will be left with this question when the true motive of the protagonist is left for the audiences to guess. And we just smelt a second part with that last dialogue.Karthi is that star who is an actor too and understands what works with the audience. It is very evident with the kind of scripts he selects and ensures that the message reaches the audiences without fail.The second hero of this movie is the terrific background score which keeps you restless and at the edge of your seat throughout. It is that nail biting tension of what will happen next, which makes this movie even more enjoyable.Kudos to the director for not succumbing to the usual pressure of committing to song and dance sequences trying to give the hero a role that suits his image. This song-less thriller will do wonders with the sole reason that the thriller genre has actually got one solid candidate in a very long time in the form of KAITHI.While other departments like action and stunts, cinematography, and art direction are also commendable, I wish the screenplay and writing was a little more crisp and avoided few glaring mistakes which could added more depth to this thriller. Since the audience have already smelt a sequel, I hope these are addressed well enough in the next part.Be prepared folks... Karthi is going to be back with a sequel and I cannot wait for that.Go and watch it now, else you would regret later for having missed watching this thriller in a cinematic atmosphere."}, {"id": 204, "text": "Lokesh Kanagaraj's script writing is fresh, intense and unique., Director's spl talent to convey a single line story telling over a night with good characters and direction made this kaithi a blockbuster.,Undoubtedly one of the best theater experience movie for the flawless gripping screenplay with a action packed thriller after a long time without a song and heroine.Karthi's top notch acting shows how a versatile actor he is either in a emotion or a action genre .,Sathyan sooriyan cinematography is crystal clear even the entire movie is shooted in night.Sam C S - Terrific BGM.,"}, {"id": 205, "text": "The title of the film is not kaithi because its the story of a prisoner but because when one starts watching it you will be locked up and won't move until the film ends. Initially, I was not interested at all in this film. I didn't even see its trailer. But the super strong positive word of mouth made me curious to watch it. Finally, I have got to see it and everything said about it is true. It keeps you glued on the seat from start to finish. The best thing of the film is its bgm which helps the film to not become dull and makes it worth a theatre experience. Screenplay of the film is watertight despite many things happening around. Performances of everyone is perfect. Karthi once again proves his versatility as dilli. His acting in emotional scenes were amazing. I loved the voice of anbu character (not sure whether its dubbed). Special mention goes to that police constable character who can be called as the second hero of the film. Tamil cinema is famous for family sentiments. Kaithi too has a daughter sentiment and it was very touching. Kudos to karthi and the child. And finally the action sequences. Though unrealistic and bit over the top it was very powerful. Film ends with a cliffhanger making you eager to know about dilli. On the whole, kaithi is a must watch for its interesting plot, tight screenplay and many thrilling moments. Waiting for its sequel. Hats off to lokesh kanakarajan and all the best for thalapathy 64."}, {"id": 206, "text": "Karthi delivers yet another blockbuster after Theeran adhigaaram ondru and Thozha with a performance in Kaithi that is subtle and nuanced in parts with big helpings of masala and action when needed. Although the movie is overstretched at 2 hours 26 minutes, a heartwarming climax makes up for it.Right from his introduction sequence, you can feel the pain and longing felt by Karthi's character 'Dilli' for the life he has lost behind bars and how much he misses his family. Director Logesh Kanagaraj has mixed in the right amounts of stunts and fight sequences without going overboard like most masala Tamil movies, keeping the script in focus. Especially loved the restraint the director showed in not going into Karthi's backstory with any elaborate, action-infused flashback sequences (as is the norm), but instead revealing it in pieces in well-enacted conversations that Dilli (Karthi) has with a fantastic Dheena as the hapless lorry-owner/caterer Kamatchi. A definite must watch!Karthi has an ability of picking good scripts, something his brother should learn from."}, {"id": 207, "text": "Ok, we are all exposed to all kinds of Tamil masala movies.One hero battling against an entire battalion is not something very new. But, KAITHI (Prisoner) has definitely a fresh approach among Tamil movies. Since the happenings are of single night events, the hero wears the same costume (that too very dirty) and with more of believable scenes.Towards the end, possibly the director is lured by typical (cliched) scenes, too familiar in most of the Tamil movies. Surprisingly, the important segment of the hero's life is told in words from the mouth of the hero, without flashback scenes. No melodrama (but for the very last scene, which is required to show the bond between the father and his beloved daughter), no songs and no stupid comedy scenes.The attack on the police station, though reminds us of old Hollywood movies, the director has modified the scenes suitable for a Tamil movie. Karthi, a main stream hero of Tamil film industry, is to be certainly appreciated for his selection of this role. Director Lokesh Kanagaraj definitely deserves to be appreciated for his overall presentation. Apart from Karthi, other actors like Narain,George Mariyan and the boy who acts as the cook and tags along Karthi, are to be definitely appreciated for their performance.Overall, a neat thriller for your weekend."}, {"id": 208, "text": "Slightly spooo, don't worry, ignoring.Script - 8/10 Story - 6/10 Direction - 7/10 Cinematography - 7/10 Acting - 7/10 Editing - 9/10 Genre - Suspense/Action/Thriller Flaw - severalOverall 7 but it deserve 8+ only because of its mood, non-unnecessary scenes songs comedy heroin etc. A compelling &amp; tensed environment from the very beginning, not a single second to ignore. A milestone in south cinema industry. It can be compared with another thriller A Wednesday. Though Kaithi have some flaws where A Wednesday is greater one.80 KM, takes time of 800 KM. Karthi's fatherhood is just fine where his overall expression doesn't fit the compelling situation. His story remains mystery. His expression towards his daughter is just show off emotion, as if not much serious about anything. In some points, Karthi's acting is worst, some expressions and actions make no sense. In fine, Karthi is one of the most flaw of this movie. If I say more about why it is, it will be spoiler. Just a clue, he needed some serious health checkups but he didn't care.btw most of all, highly enjoyable."}, {"id": 209, "text": "A group of five narcotics officers (1 superior &amp; 4 training) seizing the cocaine which is worth of 840 crores and arresting the some low level workers who have been caught during the seizing. The arrested people and drug has been kept in the commissioner office. The superior officer gets wounded in his hand. At the same time the gang which lost its goods tries to recover it from the police and kill those five officers to create fear of the gang. The leader's brother announce a huge amount as prize for those who those 5 officers. A commissioner who going to be retire in few days arranged a party. These five men are attending the party. A double agent in the same department who manages to faint all these officers in the party and only one superior officer who caught cocaine manages to escape from it. At that time he gets in the situation to protect the others officers and commissioner who requested him to protect others. As things goes wrong the superior seeks the help of the prisoner who has been jailed for 10 years who wishes to see his daughter for the first time in his life and he also accepts to move to the hospital safely in lorry. In commissioner office, a head constable who has been transferred to the city reports in the office as he wants to take charge on the next day. He also gets to a situation to protect the office with the five college students who got arrested in public nuisance case. Did the prisoner with officer and the boy who tells the route to the hospital in shortest way manages to protect the officers? Did the constable with the help of students manages to withstand the attack from the gang?The director LOKESH KANAGARAJ manages to provide an gripping screenplay and provided a film which is true to its genre. The actors KARTHI, NARAIN, GEORGE MARIAN provided an brilliant acting. The film which stands strong in technical wise strong. Stunts - National award winner for Stunts in KGF1 ANBARIV Music - SAM.C.S DoP - SATHYAN SURIYAN Sound mixing is good. Totally the film stands to its mark in providing an action thriller."}, {"id": 210, "text": "Man, what a movie.This movie begins with a little girl at an Orphanage, wondering who's going to come see her, and then cuts to the seizing of drugs that are beings transported by a drug lord, by inspector Bejoy (Narain) and team. When the drug lord takes revenge by poisoning the alcohol of a gathering of the police-inspectors, Bejoy has to take the responsibility to transport the fainted inspectors to a clinic that's in a nearby town, while also facing the threat of the drug lord to return back the seized drugs which will kill the guarding humans, who guard the police station which stores the drugs. A lorry is needed to transport the inspectors, which is where Dilli, played by Karthi, comes in to the picture with a swag, who desperately wants to meet his long-lost daughter. To do that, Dilli has to drive the lorry containing the bodies with Bejoy (who vows him his daughter), and the owner of the lorry (who exists for comic relief) to the clinic and then to the police station to stop chaos. That is the main plot of this thrilling film filled with well-choreographed action. To say more is to just destroy the thrill.To be frank, this is probably one of the best Indian films to come out this year, and probably the best career choice which actor Karthi has ever made. Talking about the acting, Karthi's screen presence is so good that you want more of that pump-into-the-lungs kind of heroism, and George Maryan, as the newly transferred police officer, is the true hero of this story, no doubt. The cinematography, man, is praiseworthy. The mood and tension that is set by various obstacles that these trio encounter is pure cinematic awesomeness. Though, the fight scene involving many people being fist-punched by Dilli in the second-half is kinda unbelievable, I had to give in to the motivation that gives him the strength. And the climax is Diwali Dhamaka, which I will not describe it, just watch it.10/10 for the attempt to do a Mass-Action film with no masala elements or songs. Only Police and Prisoner working together to save the day."}, {"id": 211, "text": "Kaithi - Diwali GiftKaithi is a one of a kind , different, perfect diwali entertainer. The story is never seen in Indian film history. Its intriguing , thrilling till the end.I cannot say much about the story as it is complicated and perfectly gripping through out.LOkesh Kanagaraj crafted a perfect story and its direction for us. The casting is just perfect. Karthi rocks as hero role. Narain's best comeback after a while. The best performer in the movie is George Maryan. Till now he only got comic role which presents himself as a silly guy, in this movie even with that attitude, he just took the audience 's applause fully. Sathyan Sooryan's Cinematography is bloody beautiful. I loved his works in Yuddham sei, Mugamoodi, Theeran etc.You shouldn't miss this movie and please watch it in theater as you wont regret. There are not much negative things in this movie, however i felt the sentimental scenes of karthi and dramatic falling-getting up cliche fight irrelevant. But that doesn't even stand in the entertainment which this movie gives."}], "reviews_amount": 212}