{"name": "Sher Dil", "titleId": "tt09129166", "reviews": [{"id": 0, "text": "A fantastic film that shows the reality of the world we live in today, but at the same time a message for humanity, where people of all religions and creeds can live in together in peace. Also character Haris is outstanding and He is absolutely fit! A new heroic for all alongside the likes of Tomb Raider :)Action, romance, story is very good. Performance of Mikaal Zulfiqar , Armeena Rana Khan and all supported cast is very good. A very well entertainer movie for all kind of public. Like small members to aged also. Perfect family entertainer."}, {"id": 1, "text": "I expected more out of this movie. A movie written by PFA should inspire the youth towards them and create a sense of pride. But unfortunately our Pakistani writers lack the creation of creative writing skills. The story had no links. It was jumping into different scenes one after the other. The love story made no sense, supporting actors had no role, family felt out of place and the dialogues; stolen from Facebook quotes. This movie could've been so much better if they removed love story, marriage and songs for every single actor in the movie!!"}, {"id": 2, "text": "This was an execellant movie. Overall production is fascinating. I really enjoyed it"}, {"id": 3, "text": "I had mixed feelings about the trailer, so I decided to wait for reviews which also turned out to be mixed, but finally I saw the movie last night and yet again I've mixed feelings about the movie, the movie had a few Top Gun references and it makes you realize why Top Gun is a classic, Top Gun is possibly only aviation movie that blends romance, bromance, rivalry, style, heroism, music perfectly well, Sherdil too tries to be all in one but succeeds on few aspects and fails on some, the songs were few and were short in length which is good, the movie had some fun moments but some of the comedy was unnecessary, locations were very good, fight scene was enjoyable but aerial sequences could've been better but still good try, we Pakistanis have grown up watching Bollywood movies and their culture, this movie celebrates Pakistan and its Pride so watch it for the Patriosim feeling and definetly show it to your kids so they can grow up with Pakistan and its culture unlike us who had to do it with Bollywood movies because Pakistan wasn't producing good movies. Overall there's a 50% chance you'll like the movie and 50% chance you won't. Take the chance, Pakistani film industry is taking a chance by making these movies, so should you."}, {"id": 4, "text": "Super cool cast, excellent directions, super excellent/ flawless and realistic visual effects. A must watch movie that will invigorate patriotism. Timely release in cinema at the time of Indian Airforce's international humiliation. Story is very much realistic in contrast to over exaggerated biased Bollywood movies. Gives message of peace"}, {"id": 5, "text": "I have got to be honest. As I was going to watch Sherdil I had my expectations really high. I had watched Parwaaz hai Junoon, which I absolutely loved and since Sherdil was a similar genre, I expected the same output from it too.However just when the movie started, I saw my expectations fading away. From the sudden skip to 5 years to the unnecessary dance numbers, it was all a total waste of time. And just when the movie could have gotten a bit better the random kidnapping scene lost all my interest and I saw quite a few people leaving the theatre, which showed that just like me others had had enough too.Something which I did like about the movie were the graphics in the Ariel fights as they seemed very real. Additionally, I also thought comedy was on point too, especially the scene where the cadets go to watch a movie at night.In conclusion, although the movie was bearable, I have seen much better Pakistani Movies."}, {"id": 6, "text": "It was fine until the interval came up. After the interval it turned out to be Mission Impossible pakistani version. And the ending ofcourse was really good! Waiting for sherdil 2"}, {"id": 7, "text": "Really surprised for us in Pakistan have a talent to production of sherdil movie, I appreciate sherdil movie team first time watch this kind of movie in Urdu language our best wishes for producer and team"}, {"id": 8, "text": "Being a Pakistani we are proud of our soldiers. A perfect movie full of actions and patriotism. Specially the soldiers love with their country is appreciable."}, {"id": 9, "text": "This movie is awesome. This movie is about Pakistani Army and how they work to achieve their goals."}, {"id": 10, "text": "The movie portrays a moral message of courage, extravagance and excellence to promote self awareness and vigilance. In the movie, the Pakistan army is profound of their excellence as they march forth achievement of their goals and accommodations. I personally found the movie to be a self explanatory model of courage and strength that centralizes the Pakistani Army ro be an asset of impending doom for the enemy."}, {"id": 11, "text": "It is a wonderful movie with its all the scenes of love , emotions comedy and especially patriotism. The most important important thing is the characterization especially of Don."}, {"id": 12, "text": "Sherdil is one of the best movies in so many ways. It's a good mixture of Wit and emotional scenes , valour, patriotism. One feels proud of our armed forces and country. The movie pictures a very vivid image of young cadets and gives us some major throw back goals...The element of romanticism is also well presented."}, {"id": 13, "text": "This movie is about how pakistan army defense their pride and honour ,and this gives us a message to trust in your moves and stay vigilence"}, {"id": 14, "text": "It's such a nice movie. When I started this movie I stayed in front of phone until movie finished. There is everything love, action, emotional scene, comedy and most important love for country. Every one should watch this movie."}, {"id": 15, "text": "Very nice patriotic inspirational movie a must see one. Very well directed and the photography is superb. Outdoor locations are superb. The acting very mature specially moved by the new actors who acted so well ie junaid instructor and the foreigner villan....the cute one......its a family movie I would recommend every Pakistani should watch this movie. Thank you and good luck shairdil team."}, {"id": 16, "text": "Best movie it is....The dialogues are relate with real life.A person who is making movie first time has done outstanding job.clap for him.."}, {"id": 17, "text": "For every movie lover its worth watching thriller .The movie creates a patriotic feeling while watching it . Highly recommended ."}, {"id": 18, "text": "Well balanced performance graphics, action everything was up to the mark"}, {"id": 19, "text": "An Excelent debut by Nomaan Khan. Movie is Indeed one of it's kind ever made by Lollywood. A must match"}, {"id": 20, "text": "I love the movie, I would suggest everyone to support Pakistani cinema, as all our Pakistani brother and sisters are working hard towards it. Sherdil is a veryyyyyy nice movie. Everyone should watch this movie. Best actors and our Pakistani Airforce is the best"}, {"id": 21, "text": "Balle balle film, i feel like I am a SHERDIL as well now. Yaro jao and watch the film you will thank me. Hehe kya action hai boss. I feel like joining the airforce 😘😘😘😍🇵🇰🇵🇰🎥"}, {"id": 22, "text": "Great fun for the family i love the dog fights such a superb movie and worth to watch."}, {"id": 23, "text": "Every once in a while the conversation will turn to favorite movies. I'll mention SherDil, and at least a couple people will snicker. I pay them no mind because I know that five years ago, these same people were moved to tears by that very movie. And they're too embarrassed now to admit it.I just rewatched SherDil for the first time in a long time. Expecting to simply enjoy the story again,"}, {"id": 24, "text": "One of the best Pakistani war film. Thrilling and the best part was the climax of the movie"}, {"id": 25, "text": "Without any coherent plot and a nonsensical script, the movie is boring, random and a cringy mess from start to finish. A sorry state of affairs for this industry of these straight-to-dvds type of films take up screens in our cinemas. Writing, production are all reflected in 'çharacters' of the movie; non existant.A spectacular waste of time and screen."}, {"id": 26, "text": "Horrible movie. It has hardly two three things which is related to PAF while the rest seems like an ordinary love story. Poor Story line, do not waste your money and time watching it."}, {"id": 27, "text": "From TOP GUN to SHERDIL, Pakistan film industry has proved itself that it can bring joy and fun to the audience. Action based thrilling movie keeps you on the edge of your seats, and hilarious / comedy scenes brings laughter to your face. Songs have a great impact. I am amazed by the Pakistani talent. ONE LINE COMMENT: Pakistan film industry has really nailed the success with SHERDIL!!!"}, {"id": 28, "text": "The story was great, it showed the hard ships of a pilot. Family problems, how they never give up. They are on duty when their loved ones die. It is a must watch"}, {"id": 29, "text": "SherDil movie is the best Pakistani movie I've watched yet. It was complete in all aspects. It makes you laugh, it makes you cry, it keeps your patriotism high but most of all, it'll make you fall in love with the character of Haris Mustafa. So girls, hold on to your hearts. Another thing I appreciated was the message of friendship the writer tries to offer.The acting was amazing by all characters. The new faces, especially the Sikh did an amazing job. The cinematography, vfx were phenomenal. I loved the songs. The actresses looked absolutely breathtakingWELL DONE PRODUCER, ACTORS AND THE WHOLE OF SHERDIL TEAM.You won our hearts"}, {"id": 30, "text": "Producers might have realized that as the ongoing tensions between India and Pakistan are all time high since the IAF bombing of terrorist camps inside Pakistan and clash on the very next day which resulted in shootdown of F-16 and Mig-21, of which F-16 wreckage was sealed while MiG-21 was shown to the public, the film could convert war vibes into its equivalent cash inside Pakistani domestic industry especially when High Quality bollywood movies are banned in the country. But again even in the absence of High quality bollywood films to be compared with, and get thrashed in public perceptions, the film bored the audience with overacting and lack of a good script according to many Pakistan media outlets. Overall it was a nice gamble played at a right time but failed to deliver."}, {"id": 31, "text": "Amazing movie, everyone should watch this movie this is true and pakistan airforce is number one when it becomes on live or die"}, {"id": 32, "text": "Sherdil is a decent try but lacks attention to detail. Editing is one of the worst I have ever seen. If the director would have taken another 6 months and ironed out all the issues, it could have been a great movie. Seems rushed and awkward especially during the middle."}, {"id": 33, "text": "Excellent movie best acting especially herjeet please keep it up to make more amazing movies to entertain us"}, {"id": 34, "text": "Its highly recommended movie....best of all the time the effects of the movie reminds me Hollywood's movie top gum.... Worth watching n a best family entertainer"}, {"id": 35, "text": "Sherdil is the best movie of Pakistan.The dialogues of this movie are related to real life .This movie is based on the bravery of armed forces.This movie is full of emotions,humour and sentiments.The selection of hero and villan are nice.The person who is making the movie first time ,we appreciate that person and I also mention the name of person who produced a movie 'Noman khan'.Must watch this movie because overall movie there is no over acting and it's not a boring movie.Every scene of this movie is perfect .And as a Pakistani we must appreciate our movies .Welcome a new person who made a movie for the very first time must appreciate him.Go and watch this movie in cinema👍"}, {"id": 36, "text": "It's the best And purly family movie worth watching.... Will enhance the love of arm forces in heart. I recommend to everyone to see this movie."}, {"id": 37, "text": "It's very interesting to see the couple Maakail and armeena working together.The movie showed that doing what you love will not be worth..Sherdil is the first ever movie in Pakistan that was completely different..but i personally think every next scene of this movie is interesting it's covering all type of scenes.I recommend this movie to everyone really the characters are loveable,the story, the vfx effects👍the scenes of the movie is far better than fast n furious effects..and i must say that the character development and story progression was absolutely outstanding and after watching this movie the first think you would do is to call your family for the movie..#yaroon aj raat😍 song.... This was a tribute to PAF and i cant forget the funny scenes of cadets😉 Best of luck sherdil team!!!"}, {"id": 38, "text": "So finally after a long wait we have something like Top gun best production best script. The dog fight sequences are up to the mark and we have never seen such a best dogfights sequences in any pakistani movie before. This movie gives me taste of Top Gun. Mekaal were looking very nice and funny characters like Harijeet. Tohfa.. excellent work."}, {"id": 39, "text": "Best movie it is....The dialogues are relate with real life.A person who is making movie first time has done outstanding job.clap for him.."}, {"id": 40, "text": "An excellent movie which is not only entertaining but has a message of our coming generations..."}, {"id": 41, "text": "Really enjoyed the story. The chemistry between the characters is great."}, {"id": 42, "text": "Beautiful cinematography and directions and good efforts put in by the director."}, {"id": 43, "text": "Not expected what i saw. Couldn't believe on my eyes , what an action and patriotism and great direction and efforts behind this masterpiece. My Fav movie After John Wick series"}, {"id": 44, "text": "Great movie and highly recommended to everyone. the story line and acting was amazing. must watch!!👍"}, {"id": 45, "text": "Awesome work. Top class doc fight scenes. Lovey story"}, {"id": 46, "text": "A must watch patriotic movie which can give u adrenaline rush"}, {"id": 47, "text": "Definitely a must watch movie. Fun to watch and keeps you entertained 100/100."}, {"id": 48, "text": "I must say that this was a great Pakistani effort. The dogfight were of the international. The storyline was international. I love the dialogues. It's a must watch."}, {"id": 49, "text": "This movie deliver a great massage regarding Courage and excellence. In the movie, pak army defence their pride and honour."}, {"id": 50, "text": "Can anyone help me here..??? Ive tried everything to watch this movie but unable to watch when ever im trying to open this movie it only shows the trailer. Hope anyone can assist me with this"}, {"id": 51, "text": "I already sign in n Why cannot play the movies? Did anyone know how to play the movies tq."}, {"id": 52, "text": "Loved the movie from the first scene until the last one."}, {"id": 53, "text": "It's the best Pakistani movie I've watched, it's has everything starting from comedy to romance and action. And what a movie. I just love it. It is a must watch movie Rating is 10/10"}, {"id": 54, "text": "Very nice film. Thank God they didn't kill the hero in the end. Everyone performed well. Hassan Niazi was too good."}, {"id": 55, "text": "This was the best Pakistani movie....i have ever watched....Tribute given to PAF was excellent...we can watch this movie with family....it was full of fun emotions... From the start of movie till end chain factor was strong....Selection of Hero and villan was good....Deliverance of dialogues were fantastic.....A new person came in the industry with good work.....Guys must watch this movie and appreciate"}, {"id": 56, "text": "Sher dil is one of the best Pakistani movie I have seen.. Surprisingly the graphics were amazing..The story line is fab. It has its moments. Comedy. Romance. Drama action. A great family movie... 💯"}, {"id": 57, "text": "Sherdil was an excellent movie especially the dogfight it was full of suspense and horror this movie showed me how much our army sacrifices for us"}, {"id": 58, "text": "Only if the director paid some attention to some details...an airforce officer is shown with unshaved face and long side burns through out the movie which is quite unrealistic...the dog fight scenes are incredible...the story is just okay... most actors lacked acting skills including the lead actress..."}, {"id": 59, "text": "Don't watch if you don't want to waste your money. Really bad!"}, {"id": 60, "text": "Best pakistani movie i loved it full of fun. Mikaal acting was outstanding and the dog fights were really good."}, {"id": 61, "text": "I love the funny scenes and the dog fights were excellent."}, {"id": 62, "text": "It is unbelievable to start with how ISPR approved the script of this movie. Poorly directed with terrible acting, it doesn't show at all the truth about a cadet's life at the academy and later as an officer. Cheap acting and screenplay with poor storyline makes this movie a joke and a cringing experience."}, {"id": 63, "text": "I missed Sherdil in cinemas and was desperately waiting for it to be released on a streaming service. Finally got a chance to watch it on prime and what a disappointing experience it was. Poor acting, poor direction and a typicall story line. Whoever thought that playing Spirit Background score on cheap casio keyboard is a good idea for Background music must me tied to the rear end of a jet engine with AB engaged. Fomedy was predictable and the actors couldn't hide their discomfort in whats expected to be a relax sitcom situation. The only saving grace were the CG shots and cinematography which is top class and seems to be wasted on a very poor movie."}, {"id": 64, "text": "It was amazing experience to watch sherdil.The whole cast done superb job.Well wriiten and well picturised.I hope sherdil 2 comes up soon."}, {"id": 65, "text": "Though not great a PHJ but a good watch. They should have shown more air force story rather then love story. A nice effort. Support Pakistani cinema"}, {"id": 66, "text": "Although the movie starts with a rather impressively convincing dog fight especially if one considers that it's been made by a very young and recently revived Pakistani cinema with a very limited budget, yet ironically, the real problem is in the first half of the movie. The first half of the movie has all sorts of issues starting from storytelling, editing to acting and even casting. Add to that the rather weak musical numbers which otherwise can save the day for a movie much like they did for JPNA2 (not saying that JPNA2 was as weak a movie rather it relied heavily on its musical numbers). The worst actors in the movie would have to be the hero's father accompanied by some extras and the weakest casting choice ironically would have to be the heroin of the movie as she never looked inspiring enough on the silver screen and therefore the chemistry between the protagonists was missing to say the least. However, if you are able to make it through the first half then the second half of the movie surprisingly truly picks up. So much so I was beginning to wonder as to whether the first half of the movie was made by another team altogether, but no, perhaps it's due to the fact that in the first half PAF was trying to make a love story and unsurprisingly failed badly at it while in the second half they get to the real point and the focus of the movie naturally build's up. It was sad to see only 5 people watching the movie and from that number a couple left after watching the first half leaving only the three of us to enjoy the second half. Had the movie not been so weak in the first half, it wouldn't have met such a sad and gloomy fate in the cinema house.Note: The spoiler paragraph along with the alert has been moved to the bottom from here for the reader's convenience.To wrap it up I wish someone could make an edited version of the movie to reduce the burden of the first half cause then it could get a really good score but for now I am forced to give it 6/10 (and that too could be considered generous from certain point of views) with a heavy heart as the movie isn't bad in totality. In fact the main reason for all of the above may have been due to the budget constraints that were probably eaten up by the dog fight scenes. Please if you can, then do wait for the second half to start and you may not regret watching it as much. We came out very happy after watching the movie perhaps also due to the fact that we have all the claims in the movie to back up in the real life in the light of the recent incidents that have taken place in the ongoing tension between India and Pakistan. Hope we learn our lessons sooner and learn to give and earn respect. Pakistan Zindabad.SPOILER ALERT!!!The hero's acting (Mikal Zulfiqar) too improves with the introduction of one of the finer actors Hassan Niazi who is playing the Indian Pilot and has previously proven his mettle in the movie Malik. With his introduction the level of acting goes considerably higher. The best thing about the movie is that it didn't follow the mellow drama and didn't run down on the adversary in the endeavor to highlight the hero. A critical mistake that even Richard Attenborough made in the movie Gandhi (1982). In fact the Indian pilot is depicted as a very professional and composed officer who wouldn't lose focus on the mission or play it dirty when the time comes. While the Pakistani pilot on the other hand, though very capable, is shown to be aggressive and someone who needs to learn a few lessons in order to become a greater fighter pilot. Those lessons he learns indirectly from the adversary. The movie also very nicely touches on some poking things and doesn't take typical route towards explaining or justifying them and by the way, these are the places where one begins to wonder if the second half of the movie was made by another team. Another thing that failed to fully establish a point is the hero's rich family background, though it may have made a greater impact if he was shown to be coming from a rather humble middle class family, the reason why they probably did it was to show that the hero is willing to leave all the luxuries of a wealthy life in favor of his passion for flying and for his motherland which, as mentioned before, didn't make the impact it was supposed to leave."}, {"id": 67, "text": "I watched this movie with my family recently and they loved it. My little one wants to watch it again he enjoyed it so much. This movie has all to offer esp the amazing ariel dogfights scenes, courtesy of PAF Pilots. The song Kudi da thumka will give you the feel to listen or watch it again. I'm going to give this movie 8/10. This movie could've been perfect but guess the editors, writer or the director went little lazy at some parts. Overall Sherdil is a must see movie"}, {"id": 68, "text": "Truly a treat to watch, it will revive the film industry and bring back the audience to the Cinema, great work team Sherdil."}, {"id": 69, "text": "OMG, It is such a good movie. So Patriotic and Glamourous. Kudos to Producer, Writer, Actors and supporting staff for making such an exemplary Movie. Love the songs as well.Do not Miss this Movie 🎥"}, {"id": 70, "text": "Sher Dil really made my day. For the first time, a proper movie based on PakistAir Force. The way Noman Khan portrayed the Pak Indo relationship was outstanding. Very few writers and directors aim for a positive message and Noman Khan was able to execute this with perfection. Hats off to the gentleman and not only Noman Khan completed a beautiful movie, his acting was to perfection and natural. I adored Noman Khans amazing choice of wordings and dog fights scenes.I want to see more movies by Noman Khan and congrats to all the people behind the movie.I would recommend everyone to go watch this fantastic movie."}, {"id": 71, "text": "Rite from the start Noman captures the audience with the starting of the movie which couldn't have been betterThe movie then goes about to portray about the friendship of India and Pakistan and gives an overall positive message to our Desi peopleThe selection of songs, romance and comedy was top quality and the acting carried out was fantasticFinally I would like to conclude that Pakistani movies are picking up and I hope to see more movies directed from NOMAN KHAN and more movies from NK pictures"}, {"id": 72, "text": "I loved the movie. Amazing Ariel shots, gave goosebumps to me. I would definitely everyone recommend to watch it."}, {"id": 73, "text": "This movie not only based on fake incidents but includes very poor choreography and filmography."}, {"id": 74, "text": "I must say this is the best movie worth to watch it."}, {"id": 75, "text": "Superb achievement by pakistani film industry its look like a hollywood work i must recommend all of you to watch the movie at once. Worth to watch."}, {"id": 76, "text": "SHERDIL, watching sherdil was an absolute delight it was a proud moment to watch a Pakistani movie full of thrilling moments beautiful visuals I would say a pretty movie with a Positive message of a civilised nation like Pakistan, everyone must watch it and support the entire team of Sherdil which made a great effort. Loved the songs , the action , the comedy, the thrill. Super dog fights. Hats off to SHERDIL"}, {"id": 77, "text": "SherDil is a film that will definitely be memorable purely because of the turning point it will turn out as for the visual effects and CGI in the Pakistani Industry. Other than that, the film also hits all the right spots as a masala entertainer, and while it's not the best film out there, it's definitely a fun popcorn watch and to me that's what a costly ticket price should be worth, the grandeur.The timing really helps as the story and many scenes reflect upon the recent Pak-India conflict. Let's break down the technicalities:Story: I must admit that it is not something i'd purely enjoy on a laptop screen, the film is purely made for the big screen, hence why I didn't mind the script which had alot of flaws. It's very inconsistent, and goes haywire at times. The first half is great, after that there's just too much unnecessary stuff going on that's both dull and unnecessary. The Dubai scene could've been cut short ALOT and that random Don scene was just not needed. If you can look past that, it's very engaging as the ending is definitely satisfying. Dialogues are well written and had the script had a better direction or proper character development tau this would have been a revolutionary product. 5/10VFX/Cinematography : Scott Newman and Muqeem Khan have done a fantastic job. Riki Butland has also brought his magic to the screen. You can tell the budget was huge. looks expensive and at points I could barely tell if it was CGI or real. The dog fights are fantastic, cinematography is breathtaking and these combined are the saving grace for the film. 9/10Direction: Azfar Jaffri i feel didn't have much creative control because the tone feels like it's not his. I'm a fan of his previous work so this could've been better. Direction is not perfect, but it ties up the lazy script as best as it can and Jaffri deserves a credit for that. 7/10Acting: overall the acting is very good with the exception of minor characters or extras who felt like were dubbed by random people. as for the whole cast, here's a breakdown: Mikaal: while he looks the part and commands good presence, his acting is hit or miss. in the start he's overdoing it and then his transition in five years isn't visible. his performance is decent but could've been much better. Armeena: i don't know if i can comment much as her voice was dubbed horribly. whatever differences the makers of the film had with her, it felt like they purposely had a bad voice actress do her dub. her expressions were fine, the tone of her voice ruined it all. Hassan Niazi: what a performance! he completely overshadowed Mikaal and brought his A game to the table. we need to see more of him. Sabeeka Imam: her accent was believable, although not accurate. her performance was slightly stiff but not bad at all. her scene with Hassan felt very natural and she definitely commanded presence for the limited time she was in. Samina Ahmed: as always, she rocks it. undoubtedly the best, i'm your biggest fan Samina ji! Additionally Leyla Zubairi gives a mediocre performance, where as Dr Uppal struggles to deliver his lines, clearly not an actor. I think however the breaking point in this cast are the new faces. Malik Aqeel has great comic timing and does justice to his character. Belal Shahid gives an impressive performance as he not only is able to play a backward character with perfection but does what Mikaal fails to do; his 5 year transition is spot on. Ibrahim Alavi is out of the three given more screen time and relevance and it is all deserved. He has the most natural delivery in the whole cast. He being a first timer completely outshines Mikaal and Armeena in all their scenes. Despite the lazy writing, he makes the scenes work with his subtle yet impactful performance. 7.5/10Music: the soundtrack is well done and adds alot to the dogfights. at some parts the music is added to the scenes in a weird manner which it could've done without. 8/10Songs: The military song is perhaps the best one as it not only sounds good but goes well with the training montage, i can definitely jam to it. The rest of the songs are decent but nothing special. Ho Jania is shot beautifully but it could have been choreographed better. The Club song is just weird and feels out of place and has very tacky lyrics, nor is it shot well with the both Hassan and Sabeeka giving dancing awkwardly. Ibrahim should've been given more space as he brings somewhat life to it. The film could've done without it honestly. Lastly, Kuri da Jhumka is a decent wedding number that people will definitely be playing at their Mehndi. All the boys carry it well and the choreography is good, although it could've been shot better. My only problem is the weird random chinese girl. What the hell was that? 7/10Overall: the film has problems with the way it's excuted. Script was inconsistent and editing was very sloppy. However, decent performances by the cast, beautiful visuals, intense and well animated dog fights, an extremely funny first half and a very satisfying ending make up for decent cinematic experience. Overall i give the film an 8/10 as the pros outweigh the cons.SherDil is an entertaining flight that has some flaws but you still have a lot of fun!"}, {"id": 78, "text": "And, when you want something, all the universe conspires in helping you to achieve it. If not before but now Mr. Nomaan Khan the writer &amp; producer of recently released Pakistani film SherDil would have started believing in this famous quote from The Alchemist. Nomaan Khan started working on this film project couple of years ago but events shown in SherDil has startling resemblance with recent Indo-Pak tension. SherDil is one of the most anticipated Pakistani films of this year and timely tribute to Pakistan Air Force.SherDil has been directed by Azfar Jafri who is known for films like Siyaah, Janaan and Parchi. Though he has been associated with films from different genre but with SherDil he has added one more feather in his cap. Directing war film is not a child's play in Pakistan but Jafri has pulled it off with an ease. There are certain dull moments in SherDil but ignorable due to some witty dialogues and situations which maintain audience's interest in the film till the end.The main offering of SherDil is its visual effects and cinematography of aerial combats which have been shot magnificently. Arguably such dogfights we have never seen in any film from subcontinent. There should be no doubt that SherDil will always be remembered for combat scenes between JF-17 Thunder and Mirage 2000. We must thank Scott Newman for providing believable visual effects and Riki Butland for unbelievable cinematography. Prior SherDil Riki Butland has been associated with Hollywood blockbusters like Star Trek Byond and Fast &amp; Furious 7. Services rendered by Scott Newman and Riki Butland for SherDil has raised the bar of Pakistani films to the next level.Mikaal Zulfiqar is one of the main heartthrobs of Pakistani dramas and films, shines in SherDil. There is always a low opportunity to show acting prowess in an out and out action film but still Mikaal Zulfiqar has done satisfactory job as a main lead and he looks believable in uniform. Hassan Niazi as nemesis of Mikaal Zulfiqar justifies his selection in SherDil. His verbal confrontations with Mikaal Zulfiqar are one of the main features of SherDil which does not only provide entertainment but also shows glimpses of irk between Pakistan and India.Writer and director of SherDil should be commended for not doing mud sledging while showing confrontation between a Pakistani and Indian fighter pilot. Though SherDil is an effort to boost patriotic and nationalistic feelings but same time refrains from spreading jingoism and war hysteria. Armeena Rana Khan and Sabeeka Imam are completely wasted in the film. May be storyline does not require their extended roles but one thing is certain their importance in SherDil is not more than the props. Music is completely irrelevant and forgettable, only drags the pacing of the film.On the whole, SherDil is refined cinematic product from Pakistan which does not only entertain but also explain the current Pakistani standpoint towards India. One may brag to claim that SherDil has a power to convert the happenings of 26-27 February into mere its promotion. On positive note SherDil seems like Prime Minister Imran Khan's message to India in cinematic form which is nothing but Peace and Mutual Respect."}, {"id": 79, "text": "While everyone watches any given movie their own way I would STRONGLY suggest you watch Sherdil a couple of times to grasp the true essence of this masterpiece. I watched it twice in the theatre two days in a row and I was blown away by some of the key elements I completely missed the first day. I know this might sound crazy but this is the kind of power some of the biggest Hollywood movies like Inception and Interstellar have. For me a strong cast makes or breaks a film. Loved all the stars perfect for the characters even the debutantes. The only reason I ended up rating it 9/10 is Armeenah Rana Khan. She was just a pretty face with zero expressions. But I am glad at least she was good in the songs. Saving grace. Nomaan Khan is a maestro of his crafts. Well written and produced and the direction of Azfar Jaffery is the icing on the cake. Dog fights are the BEST part of the movie, followed by very intelligent comedy and emotional connect/patriotism shown by the AirForce. Lovely family movie. Five thumbs up. Can't wait to watch it again."}, {"id": 80, "text": "Since March 22nd, Sherdil is just continuing to stamp its aura on audience with nothing but overwhelming appreciation and applause for providing a complete entertainment to every segment of society. The dogfight sequence cannot be explained in words and the only true review anyone can make is to ask the reader to watch it and feel it. Everyone watching feels being siting in the cockpit and making moves. Your nerves would sync with the buzz and trust me your expressions would tell you how real the action is! Scott has done probably the most accomplished work for these VFX effects. The music is amazing, songs are worth falling in love with and the best part is that in 5 songs you will listen, every song is mastering a particular cord! The movie is offering some of the most melodious songs Pakistan Cinema has ever offered. The story is household and realistic from start to end. Producer and Director have really gotten best out of cast and crew, and this is the strength of this movie. The performance of debutants or that of the seasoned divas, the out come is super professional and you can't miss to appreciate the work put in by Producer and Director. While the country is proudly celebrating a strong National response recently handed down to invading aggressor, the movie is not letting the momentum break. I am proud member of the cast and in the role of Sqn Ldr Sikander I open the inning in the first scene which set the tone for showing best action sequences any dogfight has ever been filmed and shown, later mastered by Mikaal and Hassan. Nomaan Khan and Azfar Jafri has done a wonderful work. It is a must watch masterpiece. Even the critics are saying, no better action can be filmed. Sherdil has left everyone behind, carrying the bat, unbeaten!"}], "reviews_amount": 81}