{"name": "3022", "titleId": "tt09465600", "reviews": [{"id": 0, "text": "It had a lot of potential but was wasted on stupid plot decisions.The premise was great, the actors were great, the potential was there, and they basically blew it. They tried to recoup it by making it mainly about the man and the woman getting back together after all that time, that really it is about relationships, but it was ultimately a big let down. On the most simplistic level, we did not even get to see them hug or cry together or anything, just the looks of shock, apparently to be artsy. Come on!Instead of making the situation with the additional 3 crew into the usual story of the battle to decide who will die - so predictable - they could have made the rest of the film about the journey to Europa and getting there and finding out that other crew had survived from other places, etc.I think there was a major flaw in the plot and that it must have been changed midway through, since the story starts with the idea of the creation of a habitable world on Europa and then retracts to just Pangea Station and no one ever even sees Europa. It sounds like they felt they couldn't manage the story of going to Europa, somehow, and cut it off - I suppose its cheaper set wise to never leave the station. But they sacrificed the film ultimately then, for the small amount of creativity to have had the characters move past just the two people and their own relationship, which was never fathomable anyway.Finally, I have more faith in humanity that if faced with an inevitable end of the human race, not everyone will melt down into a monster except for 2 people. The stupid predictable ploy of the haunted house space station where everyone has to kill everyone else really tanks films at this point. We've seen that so many times and it's so 2nd grade to just retreat to that. I'd rather they never had the other 3 appear if they have to turn it into that."}, {"id": 1, "text": "Right from the beginning. Plagued with bad writing throughout a lame story, it is (probably) supposed to be a study of the effects of long term deep space exposure on the human psyche or some such nonsense.The long, silent opening sequence was meant to fast-forward the viewers through the first 5 years. In 2190, a 4 person crew start a 10 year mission on a space station in deep space near a colony that is on one of Jupiter's moons (Europa). The station is supposed to be some kind of refuelling stop for people travelling between Earth and the colony (though they don't explain that or show anyone coming anywhere near them in the first 5 years).5 years later the captain is losing his marbles and the crew doctor is ready to scrub the mission and have them all sent home for psychological reasons. Then the event happens (conveniently of course).The station is (mysteriously) damaged and a crew member dies. Then the doctor decides to take a one way space walk. The remaining (2) crew try to save him by extending a mechanical arm towards him. Naturally, just as its within reach the Doc decides he wants to live - and as he reaches to grab the mechanical arm, the last section of it - just - falls - off, drifting off into space along with the Doc.Then, just as the last 2 crew members are about to take some kind of suicide pill - literally about to put them in their mouths - miraculously they spot a shuttle drifting outside the station. Inside they find 3 crew who had been on the International Space Station orbiting Earth and find out that the event was actually the Earth exploding for some unknown reason. Despite being right next to it, apparently they weren't as damaged as the space station that was hundreds of millions of miles away from the explosion. Their shuttle was damaged but still somehow made it to the station.(More plot holes. The shuttle crew are revived and told that there was enough life support to keep them all alive until the shuttle can be repaired and they can fly to Europa. So what do they do ? Have a party. Smoking and drinking. Without explaining what had happened until the next day (because of course, why would you bother mentioning some trivial detail like how you watched the Earth explode from 400(ish) kms away).Then they find out that the station, which had enough life support to keep 4(+) people going for 10(+) years, will only support 2 people for 3 years. Or 5 people for 1 month. (But apparently there's enough cigarettes to keep everyone going forever !) And supposedly the shuttle (now) can't be fixed at all !One thing leads to another and the damaged station ends up broken into 2 parts and apparently each half has enough life support to last 1 person indefinitely. Good thing too as each of the last 2 from the original station crew are in different parts of the station and the 3 from the shuttle are dead.And somehow, despite the unfixable shuttle being damaged even further in the explosion that broke the station apart, the captain is able to repair it and - roughly 22 years after the station broke apart - in the year 3022 he is able to pilot it and literally fly straight to the other half of the station (despite not having any communication with it the entire time and no way to calculate where it may have drifted to in the preceding 22+ years). And, naturally, his partner is still alive.The movie ends with the 2 crew members reunited on the one half of the station, drifting off into space. The same 2 who, 27 years earlier, were going to kill themselves back when things seemed hopeless. Somehow I don't think there'll be a sequel where some intrepid explorer finds them still drifting through space - and still alive.(Did I mention that during this whole time - they had NO communication with the colony on Europa who apparently couldn't be bothered to check on them or try to figure out why they couldn't communicate with Earth either.)The entire movie was poorly lit (perhaps to disguise cheap sets). The plot holes were big enough to fly planets through. The story line was lame.The acting was OK. I only watched it to the end to see what they'd do with the last 2 (you knew he'd find her, somehow, and that she'd still be alive, somehow, but I wanted to see what happened after that). Nothing.And literally everyone smokes ! On space ships/stations in deep space 180+ years in the future !I mean WTF ! Why is it that half the space movies I see these days have crews smoking like chimneys ? NOBODY SMOKES IN SPACE morons ! Not now and sure as **** not 170 years from now (let alone even further in the future for some movies).Blame that on the poor scripting and directing as well..I would not recommend this to anyone unless you are on a very long flight where you can't sleep and there are no other choices. Even then I'd suggest watching something else. Or reading the in-flight magazine. Or the Emergency card. Or count the hairs on the back of the head of the person sitting in front of you."}, {"id": 2, "text": "Brilliant premise for a film BUT. Even with some robust parts, these mofos are smoking and complaining about life support failing... is it 1950?!"}, {"id": 3, "text": "I'm not sure where this movie came from or where it wanted to go but it never made it. I don't have a problem with the acting. The effects were pretty good for a straight to video movie. There were just too many unanswered questions. It started out okay, then the disaster happened and they try to figure it out. My question: Where do these people come up with this endless supply of cigarettes 5 years into a 10 year mission? Notwithstanding the fact that it would prove disastrous to any air recycling equipment they had. Oh my God what have we done? We may be pretty good but we don't have the technology to break up a planet into pieces. Yet. At the end, what the hell is going on? Do they get out safe? Do they head to Europa? That was an hour and a half of my live I will never get back."}, {"id": 4, "text": "It's incredibly frustrating to follow the story when you can only see 20% of what's happening on screen. Low light sets to me = low budget special effects. We have LED lights now. I'd go crazy too if I had to live in a dark space station. And smoking? Really?"}, {"id": 5, "text": "Just finished watching the movie, only reason i watched to the end was to see how it ended, i could have turned it of after 30 minutes. 4 astronauts on a refuelling ship get stranded after earth explodes, sounds like it could be a good story, wrong, the crew are more like a bunch of office workers than trained astronauts, going to pieces easily, smoking on a space station???, must be sponsored by the tobacco industry, the movie jumps scenes and leaves you feeling like you don't care what happens to them. the special effects are good, camera work and props are good, but the movie falls flat because of the script but not as weird as Ad Astra at least"}, {"id": 6, "text": "Director John Suits said, I was attracted to this story because of the huge stakes and scale and because it's ultimately a very intimate human story. Ryan Binaco, the writer, is incredibly gifted and was able to write a script that felt emotionally honest. Well, Binaco may (or may not) be able to write an emotionally honest film, but when it comes to spaceflight realism, Suits and Binaco are hopelessly clueless.The year is 2190. Earth's first space colony is on Jupiter's moon Europa. So they just skipped the Moon and Mars and went straight for Europa? The space station Pangea refuels ships bound for Europa. What kind of fuel? Nuclear? Storage batteries? Where do they keep it? Because the station's far too small to store fuel. If it's liquid fuel, where does it come from? Earth? So space missions have to come out to Pangea to deliver fuel and then turn around and go home? There are far easier ways to get a manned space mission out to Europa than stopping for gas. And if you still wanted to refuel spaceships, then you'd put Pangea station on an asteroid and mine the asteroid for the raw materials with which to manufacture fuel.Both Earth and Jupiter orbit the Sun in elliptical paths; the distance between them changes constantly: From closest approach at 365 million miles to maximum separation 601 million miles. So where IS Pangea, anyway? Does it orbit the Sun? A Lagrange point? It seems to be out in the middle of absolutely nowhere. The station would be lined up with both Earth and Jupiter only for a couple of weeks a year. Or is it in a solar orbit that keeps it always the same distance from Jupiter? Earth is visible to the naked eye from Pangea. So it must be awfully close to Earth. Why do you need a refueling station that close to Earth for ships going out to Jupiter? To any station far enough out there to serve as a refueling stop, Earth would be invisible without a telescope.Rotating crews from different countries maintain Pangea in 10-year shifts. Four American astronauts arrive to begin their term: Captain John Laine, engineer Jackie Miller, doctor Richard Valin, and Lisa Brown. Would you REALLY select crew members like Jackie, a loving mother who is LEAVING BEHIND her 10-year-old daughter on Earth, or Richard, a loving husband who is LEAVING BEHIND his wife? Where are these crew members' priorities? Ten days, maybe, ten weeks, even ten months; but ten YEARS?Pangea consists of two Stations, each of which is a rotating ring to create artificial gravity. But the rings rotate far too slowly to provide Earth's 1-G gravity. You'd expect that it would be about the same as the Moon, i.e., about 1/6-G. But it doesn't really matter, because a space shuttle docked to Pangea also has gravity although it shouldn't, and then later on, after the two Stations have been separated (to allow oxygen supplies aboard one Station to replenish adequately), Station Two is found, adrift in space and not rotating, but there is STILL GRAVITY aboard.With each passing year, the crew, amicable at first, drifts apart. By the fifth year, isolation takes a toll. There are tired old shopworn physical correlates of the psychological toll: Laine having annoying and totally uncompelling facial twitches and Miller has some minor and equally uncompelling tremors of the right hand. Laine also experiences night terrors. Valin is forced to deem the crew mentally unfit to continue the mission. As the crew comes to terms with failing their mission, shock-waves from a massive explosion damage Pangea. It's Earth exploding from some ground-based experiment gone awry; exactly what will never be known. We see the explosion through the eyes of someone on the International Space Station. The explosion is far too fast; to explode completely like that would take many minutes or even hours. And the ISS is only damaged, which is also ridiculous. The shock-waves were felt out at Pangea; an explosion like that would have obliterated everything around the Earth, including, most likely, the Moon. Fragments of the Earth, from small to asteroid-size, would be blown out into the solar system and travel for years, either hitting other planets and moons or being knocked completely out of the solar system.Eventually, Miller and Laine are the only two people left. When the Station is separated (using timed charges), Miller is accidentally stuck on Station Two. Station Two drifts away into space. Laine then alters the mission of Pangea from fuel station to a search for Station Two. How is he going to do that? Pangea isn't a spaceship, it's a space station. It can't maneuver in space under its own power. But no matter; the film has already committed so many goofs that what's one more? And what do you know, 3 years later, he DOES find it. And what do you know, Miller is aboard and STILL ALIVE. And although Laine has gone all gray, Miller still has a full head of completely red hair, with not one single strand of gray. At that point, the film doesn't so much end as just stops. John Suits also said, I hope people engage with the film in a way where they ask themselves, 'If I were in this scenario, what would I do?' Well, most of the time, the characters' motivations and behavior did NOT ring true to me.Concerning the acting: Omar Epps and Kate Walsh have decent chemistry, but nothing special. Why they cast Jorja Fox as a Frenchwoman I'll never understand: I don't speak French, but even I can tell her accent is atrocious. Is France short of actresses?In summary, this is a relationship movie poorly disguised as a sci-fi movie. If you prefer movies that are more about relationships and don't care that the entire premise of the film is ludicrous, maybe you'll like it."}, {"id": 7, "text": "I knew I wasn't going to enjoy this movie when I realized the expository text at the beginning was very poorly written. I'm pretty sure Humankind didn't construct Jupiter's third moon. If they meant it's near the third moon of Jupiter, are they suggesting Europa is the third moon? That's not right no matter how you classify them. Then we get some pretentious shots of people doing something, followed by a low-res 3D shuttle flying to a space station, apparently to attend a funeral judging by the depressing music. When we finally see the station we are told, again, the station is between Earth and Europa One, but is clearly in Earth orbit. It doesn't appear any research (or God forbid math) was performed since the size and angular velocity of the habitation rings isn't close to being accurate for the Centripetal Acceleration depicted. Also, why are the solar arrays rotating and never angled to maximize exposure? After some shots inside we see the exterior and are shown another card repeating the date, but this time with the Anno Domini incorrectly added after the date instead of before. Next is a boring montage advancing year by year from one to five (told via cards), ending with some mildly interesting images followed by the title (3022). When we return to the story another card again tells us it's year Five, followed by another card that says 'Year Unknown. Really? Smoking on a space station? Stop getting your technical data from other movies or trying to be Alien! No one smokes in space. Ever. From there the writing continues to make no sense and the editing is choppy. Significant events happen off screen while boring shots of nothing linger as the crew falls apart for no reason. This movie is an incoherent mess that feels as though they went into production with only an outline or rough first draft of the script."}, {"id": 8, "text": "All they do is smoke. Literally all they do. I wanted to like this so much but I couldn't get past the utmost stupidity of Smoking on a space station, especially when they're short of oxygen. None of the characters acted like astronauts; they acted like idiots. Too bad, as I really like the actors. I did laugh out loud when Kate Walsh's character said, I don't know; I'm not a doctor as I'm used to seeing her play Addison Montgomery, lol."}, {"id": 9, "text": "Different than your usual space thrill fest. It's simple a 'lost at see/last man standing' kind of plot but it moves along well. The acting is above average and the camera, lighting &amp; sound are all solid. This isn't a multi-million dollar Hollywood blockbuster but it is an enjoyable piece of independent cinema with a sci-fi flavour."}, {"id": 10, "text": "The people saying that the year of the movie is 3022 did not pay attention to the beginning or the end. I thought this was a decent low budget sci-fi movie. I thought the acting was great, and I consider it a star-studded cast. People should make sure to mark spoilers when they are spoiling the plot of the movie. Paraphrasing the plot is not a review."}, {"id": 11, "text": "The one thing that completely destroys this movies credibility within the first few minutes is the smoking of cigarettes on a space craft laden no doubt with Hydrogen and Oxygen, where does the polluted air go - utter nonsense - whoever wrote this travesty has not got a clue about the Sci-Fi genre or the technical realities of life in space.Sadly that is what destroys this film from the off - terrible script and story that has been done to death before and this film gives us nothing new!Dreary , boring and lifeless. I wanted to switch off within the first 15 mins but made it to the end in the hope it would get better - sadly not!"}, {"id": 12, "text": "This movie is a somewhat realistic view of what humans could do and resort to in an apocalyptic sort of way. The CGA was very good BUT smoking in space OMG really?! The ending was a 'OMG' moment but guessing the cavalry wasn't coming so you guess what happens. I just don't want to take my head down this path too far as it's truly a depressing and scary thing to delve into. End of humanity is kind of where this ends up I guess. Definitely it's a one timer but worth the time."}, {"id": 13, "text": "This isn't a bad film, but viewers shouldn't go into it expecting action. I thought it was an interesting look at how people might respond to tragedy and being isolated for long periods."}, {"id": 14, "text": "A whole lot of nothing over something. 91 minutes a soap opera drama that should have been a 20 min short film. Acting was decent, especially Epps, and directing ok, but this is amateur writer Ryan Binaco's first screenplay, and it was atrocious. All over the place, convoluted, extended and unnecessary scenes... a 5th grader could've written it better. I get filmmakers have to start somewhere, but at least have a seasoned writer have a look at it and make the many edits it needed. Great story concept, poor screenplay execution. Sadly, it's only a 3/10 from me."}, {"id": 15, "text": "I liked the idea of this, a bit of event horizon suspense.The actual story was intriguing, the concept was intriguing, great suspense, was enjoyable.I normally go nuts about the obvious logical failings like why would anyone waste fuel stopping midway in space, why would 3 years turn to 1 months of supplies, how did a lone guy fix the shuttle, why did they not try communicating with Europa, how did John find the other part of the ship, how come radio coms fail so quick, why did the earth just explode, why a ten year mission etc etc etc"}, {"id": 16, "text": "I started this last night and haven't finished the whole thing yet, but the only thing I've seen in this movie happens in the first minute. I thought to myself I would never do this, willingly leaving my kids for 10 years?After that, everything jumbled together and just went. There was no other plot to speak of. Omar Epps was horrible in this movie. He was either calm or half yelling, and everything he said had an attitude.But yes, I do plan to finish and at least see how bad the end is."}, {"id": 17, "text": "I will give it a average score for some decent commendable performance by the actors. Some deep space travellers get stranded in space after Earth mysteriously vaporises. Though having a cliched storyline in the the similar vein of movies like Sunshine ( 2007) and Event Horizon (1996), the suspense is decently maintained throughout the duration of the film. Well , do not just go in expecting Ridley scott's Alien and u will be fine.Despite the flawed first half, the second half picks u some juice . Overall could have been a better movie if there was better set design and production values. The special effects and props so are reminiscent of the 1990s that u will feel a dash of nostalgia . The story could have been better as the element of unpredictability is missing. The film falls flat in its script, plays more like family drama in space. My only gripe is that there is not enough Scifi-ness going on as u would find in movies in this genre."}, {"id": 18, "text": "Basically the starting montage explains how the movie will be. Lost, confused, wandering, grateful, patronising, with a dash of fear. In the scenes immediately after the montage, the cinematographer focuses on small objects like they're masterpieces, and treats the viewer like an easily amused child. There's no story, no action, no success, no one doing their job.. you're just treated like a dog."}, {"id": 19, "text": "This entire movie was a confusing mess. It was so hard to watch, because I had no clue what was going on. Terrible script for a terrible movie."}, {"id": 20, "text": "I for one am getting sick and tired of movies being produced that you are missing half of what's going on because you can't see. I made it about 3/4 of the way through this but I was so annoyed by the darkness that I gave up."}, {"id": 21, "text": "Typical cheap budget movie. There seems to be a real shortage of light bulbs in the future. Everything is very dark. Hard to make out what is happening. Weak plot. And worst of all everyone is a chain smoker! Really on a space ship in the future! Not bloody likely! Angy people constantly fighting and can't get along. Don't waste your time with this tripe!"}, {"id": 22, "text": "Not good, acting soso.womem complaining she wants to see her daughter. Really who want to leave earth for 5 years when you have kids. Unrealistic. Same women saying the shortage of oxygen when she smoking a cigarette, reallly! Maybe stop smoking to save O2. Ridiculois movie"}, {"id": 23, "text": "I gave this a 2 specifically because of the asinine use of cigarettes on a space station in the year 3022, by a medical doctor no less. Every writer who thinks that cigarette use makes characters more interesting or cooler should be fired. If that's the best they can do they are not creative enough to do their jobs."}, {"id": 24, "text": "I agree with most of the reviews here. For 2198, technology was pretty weak. Story was slow, but can't imagine going through that either. Biggest issue is smoking in space and in 2198. I thought smoking was supposed to be out of all shows unless historically necessary. I don't see it being around in 10 years, much less 1000. Anyway, if you have time to kill during quarantine, it's not the worst movie to watch to pass some time."}, {"id": 25, "text": "I can't find anything good about it. I feel bad for the actors. I don't think it was there fault. The script and the direction was awful. Really awful. I was bored in the first ten minutes. I struggled to make it to the end even with skipping around. Thank goodness for fast forward."}, {"id": 26, "text": "A woman who left her young daughter to live on a space station 500 million miles away for 10 years wants to get back really really bad when she can't skype her anymore. Ongoing technical difficulties make everyone sad. Their sadness and pessimism fail to fix the issues. At the climax, something goes right and they smile, but then 5 seconds later, just kidding no it didn't and they're sadder than ever. If you're wondering what happened to Earth or what will happen to the crew, the answer to both questions is nothing interesting.By the way, the title is misleading - the movie takes place in 2190. It ends on day 3022 of them being on the station, which seems totally insignificant but for some reason that's the title."}, {"id": 27, "text": "Whoever got paid for this cr@p sold their artistic soul to the tobacco and liquor lobbies.This is the future of Hollywood unless something serious happens. Seriously, smoking and drinking (alcohol will not (and should not) happen in a spacecraft. It's totally illogical, and an astronaut would never do it (especially on a 10 year mission??)Hollywood glitz sold for crack. My new lowest movie of all time. (It beat Warriors of the Wasteland, the previous titleholder for junk, and WotW was men wrapped in tinfoil!) A new low."}, {"id": 28, "text": "This is basically an endless and pointless spiral into depression brought on by being the only 4 remaining humans in the universe, it's the sci-fi version of watching paint dry with the exception being that watching paint dry would be less depressing.... AVOID!!!"}, {"id": 29, "text": "If your idea of sci-fi is Marvel then this one is not for you. But if you enjoy thought provoking movies and enjoy watching how complex situations being dealt with from an interesting psychological perspective then this title might appeal to you. throughout the movie I was constantly asking myself what I would've done and the answer quite surprised me since it was practically what I saw on the screen in front of me. I think the acting was good, Omar Epps gave a solid performance and did a good job, he managed to pull me into his character. I gave it a 7 since I think somethings could've been done better, but overall it was an enjoyable and thought provoking run and I would deferentially recommend it."}, {"id": 30, "text": "It's well worth the watch and I would do exactly the same thing put in that situation."}, {"id": 31, "text": "Nice movie for those interested in the psychological aspect of human beings deserted in the dark, cold, vacuum of space while vital resources are being depleted. If you have an attention span of more than 20 seconds and are more interested in dialogue and the human condition rather than non-stop shoot-em-up and gratuitous violence, then I recommend this movie with a stellar performance by Epps and the rest of the cast."}, {"id": 32, "text": "A low budget character driven space flick...just what I like!Its not the best out there, but I felt the suspension of reality that lets you enjoy a flick. Worth watching, as long as you aren't expecting a action packed summer blockbuster."}, {"id": 33, "text": "I don't know why this is rated below 5. This is clearly a low budget sci-fi, my guess why it's rated so low is because inevitably sci-fi's get judged by the sfx... and I'll admit the cg in this is not good. But for the most part the drama takes place inside the station and other then a few establishing shots and long shots, they don't rely on the cg.**SPOILERS BELOW**At it's core it's a movie about a group of people and how they deal with the end of the world and the inevitability of their own imminent deaths. A group of astronauts on a refueling station used by ships on their way to the currently being built colony on IO witness the destruction of earth. The movie is about them coming to the realization and dealing with the fact that they are likely the last living human beings in the universe. Some can't handle it and break, others grasp for survival. Not a new idea, reminds me at times of Approaching the Unknown, another (imo) underrated sci-fi. Yes this movie can get a bit tropy and the ending seemed rushed and somewhat tacked on, but all in all if you like real sci-fi driven by drama and character and not alien gun battles on the moon then I'd recommend this."}, {"id": 34, "text": "The premise sounded interesting but the characters did not have interesting lines. The dialog seemed forced. Movie started weak with a fast forward type initial timeline. Then it ended with some weird issues between the crew. Very bleak view of humanity . Needs a better worldview. Send it back to the new writers and fix the dialog and create a believable story out of the premise."}, {"id": 35, "text": "Watching this movie felt like a commercial for the Tobacco industry. Which is why I give it only 2 stars."}, {"id": 36, "text": "Really disappointed with this film. Very weak plot and very puerile acting. This is supposed to be 200 years in the future and the spacecraft looks like something from an abandoned camp in the Antarctica. Many errors in the film such as the people constantly smoking and drinking, and I mean, constantly smoking and constantly drinking! Surely this would not be allowed!The technology of the ship was current and the psychological profile of the people manning the craft was bad. They simply would not have been allowed to man it. The choice of actors, especially the main guy was wrong. No acting skills and his animalistic shuffling and hunching about severely added to the overall third-rate quality of the film.I would definitely give this a miss."}, {"id": 37, "text": "Its apparent that there was little budget while making this film. There are no real FX except those you can do with a good video editor at home. The actors do get some credit. Several performances were good though the plot was pretty well predictable as the movie ran from one event to another. Pretty much a movie to put on when you need one running but dont really want to watch every second."}, {"id": 38, "text": "*SPOILER*I just watched this movie and it was so bad. 1.You don't get any information about the characters. 2. I'm a big Miranda Cosgrove fan and she died too early (that's personal). 3.When Miranda's character died the others didn't react to this much. 4.The story-line is really weird.I think the idea of the movie was great but it looks like they didn't had enough time to think about great scenes. The end was just really weird. :("}, {"id": 39, "text": "Boring AF. Another film in a storage container floating in space with a ton of cut scenes of a space craft. No character development."}, {"id": 40, "text": "*No spoilers* This is hands down one of the better movies I've seen. It's surely not perfect, (see the technological differences and the fact that it could've been set in the present day and would've been the same movie instead of being fAR iN tHe fUTuRe) but this is definitely a good watch. The ending was great, and I'm not afraid to say that some tears were shed. The main acting was great (although some secondary actors were a little stiff, but that's fine). I'm more of the movie watcher than the movie lemme see exactly what's wrong and pick apart ever plot hole, so take this with a grain of salt if you must, but I do believe that my rating is completely accurate. I totally appreciate the cut-off ending, and the questions left unanswered (in my opinion) make this movie far more interesting. All in all, an absolute 8/10 for me. Definitely would watch again, and recommend it to fellow peers."}, {"id": 41, "text": "While aboard a space station between Earth and Europa the crew witnesses Earths destruction through some type of ELE (Extinction Level Event). From there on the story concentrates on the mental and moral battles faced by the final survivors of humanity while trying to decide whether they can find a way to survive or not.Omar Epps, Katy Walsh, Miranda Cosgrove, and Angus Macfadyen are the primary characters and are very believable as lost souls dealing with an potentially unsurviveable predicament.This movie is for those who like stories that require thinking about the situations and consequences."}, {"id": 42, "text": "Since I don't like explaining. I'm just gonna do this in points 1. Didn't have time to like any of the other characters. 2. Didn't get to see the bond they had really at all. 3. To watch this movie you don't even have to be looking at the screen. I was on my phone for most of it. Only glanced up every few minutes. 4. You don't like the characters all that much, so you don't care if they die or get punched. 5. You don't really find out why they were in space in the first place. 6. And last but not least. I felt nothing. Not one emotion while watching it. Not sad, mad, happy, confused or even betrayed. There was no emotion."}, {"id": 43, "text": "I don't mind a low budget sci-fi with bad acting and poorly written plots but this one was just some 20 IQ level of writing.So the premise is that a 4 member crew on a the most advanced refueling station for a Jupiter moon colonization project become the only remaining survivors after earth gets destroyed. Interesting concept. Acting was decent, animation was good enough, and camera work was decent as well. A few of the scenes could have been moved around to give better chronological flow though.What gets me is that this all takes place in the 2190's and the characters are nowhere as adept as they should be for their given position!My biggest gripe by far is that for some reason 170 years into the future, the technology they have in space is actually worse than they do now. The consoles are a weird mix of touch screens, 70's nasa style buttons, and an an operating system that's tells you absolutely nothing useful like one of those programs cloned off a better program that only does 80% of the work but took 20% of the effort.The station is dimly lit despite having solar panels all around and seems like the crew is all experiencing major depression. Gee I wonder why? You'd think in 170 years LED and solar technology would get good enough to make the place look like a flash bang but no the place looks like a cold war era submarine. On top of that smoking is allowed (and somehow still a thing) as well as hard liquor but not video games/board games, TV or VR on a 10 year mission. These guys share a pack of cards and a ball between them and are expected to not go crazy. Yea okay makes perfect sense.While we're on the topic of modern technology, the supposedly super advanced station isn't equipped with a 3D printer/fabricator despite the ISS currently having one and the smoking guy has to walk around with tape holding his glasses together instead of being able to print a new one.The last thing that makes no sense about the station is that the mission terms are 10 years long but they said it takes 3 years if I recall correctly to get from earth to the station. If that's the case why aren't the terms 3 years each to prevent all these people from getting depressed from the isolation? On top of that why Europa? They never explain why this freezing cold moon which might be able to support life was somehow chosen to be terraformed before Mars.Now let's talk about the crew. Why are these guys so stupid? Captain barely has anymore foresight than the rest of the crew and seems uncertain about any call he makes, the older lady is an emotional wreck, icarly just died before doing anything, and the doctor is out of shape (aren't astronauts expected to workout a lot to maintain good physical form and dexterity?) and very nonchalant about people flat-lining. I mean seriously that scene was just stupid. Icarly just flat-lined and no attempts to resuscitate and no one really showed any emotion despite them living together for 5 years.Radio silence from earth and they all start losing their minds and acting like there's no protocol they have to follow. Then they all act irrationally by themselves instead of thinking ahead together like a bunch of super smart scientists who've undergone rigorous training should. Like some other person said, they're just a bunch of office workers on a space ship.Then the french ISS crew shows up which strains their resources and they all figure they're the last of the human race but for some reason they're still thinking about individual survival instead of species survival. The chiseled jaw french guy decides it would be a good idea to kill them but their captain who is a woman opposes the idea and he kills her leaving presumably only 1 woman left in the entirety of the human race. The 2 french guys then decide it would be a good idea to kill off the remaining 2 members of the station so they could fix their ship and go live on uncolonized Europa together like somehow the 2 guys would be able to continue the human race together. Then instead of going for a surprise attack they come to the meeting room with the other 2 and pretend like they don't know what happened to the french captain and then allow the station captain to find her to they finally decide it would be a good time to attack them.Chiseled jaw french guy then decides to try and blow up the station to kill everyone by igniting the oxygen lines in what can only be described as the slowing burning gas mix ever when that should have been an instantaneous engulfment of the station.After all of that bs, I could live with the ending. Satisfying enough for what I just endured but because they've been building Europa up as the next settlement and safe haven it definitely felt like it was missing somethingOverall, interesting premise, decent actors and camerawork but very poor writing and space seems to just be a creative backdrop as the writer(s) don't seem to have a clue as to how NASA runs currently let alone 170 years in the future."}, {"id": 44, "text": "Nothing happens... i mean nothing. Just a lot of talking and a little dancing. No real Sci-fi. The plot might as well take place on earth in a reality show. And a boring one at that"}, {"id": 45, "text": "Expected so much more. Bad acting, bad science, plot almost impossible to follow with all of the out of time sequencing."}, {"id": 46, "text": "First off, the film takes place in the year 2190 and never 3022. Plot Spoiler 3022 refers to the number of days John Laine was captain of the ship Pangea. I found it confusing. The entire film takes place on a four-person refueling station located between Earth and Europa One. John is having mental issues after being out there for five years or the ten-year assignment. The medical officer recommends he return to Earth, killing everyone's career. Then something happens. Comet? They lose all contact with Earth and the ship has mechanical issues too.All happening inside the ship, occasional spacesuit jump. People bicker back and forth until the numbers are crunched when they realize how much longer they could survive with fewer people.I liked ARQ more. This science fiction was too much character-based and not enough sci-fi plot. It was how do you come to terms with being the last people alive with not much time to live? Aniara had better characters and at least more of them.Guide: F-word. No sex or nudity."}, {"id": 47, "text": "Lower budget movie with people interrelating with each other on a ship during a crisis. Very similar to the other move Watching Oil based Paint Dry on a Wall. "}, {"id": 48, "text": "Not a bad movie but I got a laugh when they showed the captain examining a huge circuit board that had discreet components, transistors, resistors, and a transformer?!?!Electronic boards we use today are 1/10 the size with most discrete parts smaller than a grain of rice. At least the board didn't have vacuum tubes.Not a happy time flick."}, {"id": 49, "text": "This movie is suppose to be in the 3022, one thousand three years (1003) into the future, yet nothing has changed in all that time, again, I ask, who are the Nimrods giving people money to make this garbage, kids in pre-school could have written a better script. So if I wanted to make a trashy movie about the future, who can I contact for financing? Let me again save you a lot of time, this movie SUCKS beyond belief. AVOID THIS MOVIE AS IF IT'S SPREADING STDs to everyone who watches it. They had no imagination for what the future might look like in 1003 into the future, they believed that filming in partial darkness who hide all the screw ups, it just made it worst. This whole movie is a spoiler."}, {"id": 50, "text": "This movie was pretty terrible. The entire movie is just about people going insane on a space station. They never go into any actual detail about what happened to earth. They never say what happened to the survivors at the end. All of the horror/thriller elements involving people going crazy feel way too forced."}, {"id": 51, "text": "I couldn't get past the cigarettes - utterly ridiculous! They were stupid 50 years ago, they are stupid today, and in 3022 they'll still be stupid. I suspect that a major sponsor of the movie was a manufacture of cancer sticks.One star is all the movie deserves, and that's for the poster that sucked me in."}, {"id": 52, "text": "I wish i could go back in time and tell my past self not to watch that movie. I do lot recommend this movie."}, {"id": 53, "text": "I am a great lover of space movies and I did my best to like this one but there really wasn't much To cling to"}, {"id": 54, "text": "One of the worst sci-fi's ive ever seen. Netflix somehow has the ability to put out turds and these IMBD idiots give it a 4 or 5 out of 10. This movie is pure trash. Im quarantined but i got corornavirus watching this. Please dont ever make movie like this again. Id rather live in days of BlockBuster than watch another Netflix original."}, {"id": 55, "text": "Guess all movies achieve something. This movie achieved the utter crap award. The actors are beyond bad, the script is non-existent, the effects are 3rd rate. Why are people spending their lives creating this nonsense? There are so many good science fiction books and stories worth making a movie of, but hell no, let's buy some dumb script of an author who probably never even picked up a science book. What a complete and utter waste of people's energy! Please do not watch this movie, it doesn't even come close to science fiction. It's a sad attempt made by sad people."}, {"id": 56, "text": "This movie has no direction. It's all over the place and goes back and forth with no real telling on what is actually happening. So many plot holes."}, {"id": 57, "text": "I hope something more from this movie but its never coming till the end"}, {"id": 58, "text": "Man, movies have no leading actors any more and that is why they all fail but the 1% now. What are these companies going to do when Pitt, Reeves, and the likes retire and get too old to carry movies? Epps, LOL."}, {"id": 59, "text": "Why do you movie people NOT finish movies. Stop leaving us hanging. Finish it!"}, {"id": 60, "text": "Although the story is good, bad acting turned the movie a time stealing. Nothing seems to belong 3022 and very limited creativity makes it worse. If acting was good enough with some atmosphere like moon and the martian I believe may get some credit and people my not turn it off. If you have some time to spend for nothing this movie may be a good one."}, {"id": 61, "text": "For a movie that's supposedly hard science fiction I find it hard to believe everyone would be a smoker. Did Big Tobacco fund this movie? Literally everyone in this movie is smoking cigarettes. It's very distracting. It may have ok before the 90s but no space agency would allow for smokers let alone smoking on a space ship. Other than that the movie was ok I guess."}, {"id": 62, "text": "How about a broken story line, cheap graphics, put in some big talk, bad lighting, and then we have a movie!"}, {"id": 63, "text": "The movie premise had potential, but the bad acting by washed up irrelevant actors made this unbearable."}, {"id": 64, "text": "Yes, Contrary the many terrible reviews, I found this movie to be pretty good. But as I watched it on Sky, I was able to fast-forward about 20% of it. Which meansThe acting was pretty good for the most part. Liked the main actor, actress and one or two others.The Story was really good.It drew you in, I believed these well trained astronauts were breaking because well I guess you never know how you would act until you lived in a small space for 5 years plus - don't think any sort of training actually covers that in Astro 101.Where it fell shortAt times the pacing fell short, somethings just didn't need to be strung out as long as they were.There wasn't much that was 'consistently Interesting' so it dragged at times.The whole 'The earth just blew up and no one knows why' gig, was yes I understand the earth blowing up adds an important aspect to the story - but left too many questions to be believable.Nevertheless, at the end I found I was really vested in the story, in the suspense at times, in the feel of living in space for so long on your own clutching at the hope you are not the last one left.Great effort."}, {"id": 65, "text": "I loved the realism of the movie - the way humans can disintegrate, and make the most illogical of decisions when faced with catastrophe. It takes the what if space disaster movie premise to its extreme. It also questions what it takes to survive; to keep going, and how we react when what we take for granted, or what we love is, taken away from us."}, {"id": 66, "text": "We all read those little one paragraph descriptions of a movie before watching it. In this case, that one sentence reveals the grounding premise of the story (spoiler alert!), making the actual event dull and of no surprise. Add to this countless holes in logic and science (one example: apparently about 80% of astronauts on deep space missions are smokers, and have been given an ample stock pile of cigarettes) and an inexcusably awful ending, and you have a film that just isn't very good. The premise and acting are solid, and it kept my attention, but the overall story is just a hot mess."}, {"id": 67, "text": "If you are a lover of film, literature and understand platonic elements of drama - this is for you. Pivotal to film is not whether or not people would smoke cigarettes in space.Film is art. And, as we know, art imitates life: it's a sci-fi cloaked descent into an inner, interpersonal and cosmic battle for self-fulfillment and survival.The acting is great, the writing is rich in character and character motivation. The story is written in a flashback style that really works, and it has that atmospheric element of set-in-space sci-fi that makes this sub-genre so uniquely enjoyable.Ignore the naysayers, strap into your seat and enjoy!"}, {"id": 68, "text": "Not sure about all the negative ratings. This movie was good. It's a 7 to my thinking, which is the minimum rating I usually look for in watching a movie. This was the exception, but I was willing to ignore the 4.9. Glad I did.Dark, suspenseful. Just what I like. A good movie shouldn't have to rely on special effects but rather a true-to-life story line. The special effects weren't bad at all--though the ship's screen's view of earth was a bit odd. The story had twists until the end. Very satisfying ending, but what about Europa base?Glad to see Miranda Cosgrove continuing her career as an adult. She was a favorite of my kids on iCarly.Worth the watch."}, {"id": 69, "text": "(Flash Review)Five years into a ten year mission four people are stationed at a space station named Pangea and dealing with the mental effects the distant isolation. When something unexpectedly terrible happens to Earth, will that destabilize their already fragile mental states or will they rally together to make it to an outpost planet named Europa? This had an appropriately gloomy and dank atmosphere to echo their mental condition; perhaps a bit much for a critical space station? Why is the space station so grimy, dark and grungy? Why are the characters chain smoking? Please don't fall into the Prometheus zone with idiotic characters! Ha! There are a few intriguing events that occur, perhaps not enough even to sustain the 90 minute run-time but the longer this film went the more interest I lost as the story intrigue gets a bit more amateurish. It did a nice job hiding it's small budget. It's worth a viewing."}, {"id": 70, "text": "If you like your science fiction without science with warp drive, wormhole travel, aliens and unexplained powers then this is NOT the movie for you. If you like a movie that tries to stay within the limits of human knowledge then this could fit the bill.The movie follows a fairly clean chronology although the scenes are not necessarily chronological. While we know the older captain survives and is seeking something, we're not sure what and not sure why until near the end of the movie. The movie starts off quickly but then becomes very slow paced. This is a closed set kind of movie. It could have been on a submarine or sinking ship although in those cases there is always the hope for a rescue. Not here. The plotline is fairly depressing although there continues to be the will to live in some of the characters right up to the end of the movie. The end brings one type of closure but we are left wondering about another type of closure.The acting is fairly good throughout. At one point three new characters enter the story-line for a short while and that weakens things a little.It's a slow movie but a reasonable scenario if the plot actually happened."}, {"id": 71, "text": "It had all the makings ok a decent movie. They just don't finish the story. Very aggravating to get involved with characters and then have the story end with no real ending. The whole movie is about the fate of the crew and they didn't resolve this. My advice is to skip this one."}, {"id": 72, "text": "This movie wasnt horrible, but kate walsh FKIN pissed me off BIGTIME....When the two bad guys were trying to take over the ship, and the one guy was strangling her, but then he stopped cold, and realized he wasnt' a bad guy and couldnt murder someone, and got offer her and recanted pretty much, BUT THEN that btch takes a pipe and smashes the poor guy over the head? THEN when she knocks him out she bashes him another 5-6 times to make sure hes dead? WTF ? And shes the protaganist in the movie? the good guy so to say? I'd mess that btch up if i was there......Really pissed me off when the guy gave her a chance, then she turned around arrogantly like she fought him off and then won?? i dont think so KATE !..PS...hollywood wanted to remind us that ALL white women in the future only want black guys....Washed up, older, ugly, but white women still only want black guys....Well, if you live in the hollywood universe anyway"}, {"id": 73, "text": "I wasn't expecting much from 3022, a low budget sci-fi thriller set entirely on a spaceship in the deep reaches of outer space, but it's not too poor and certainly better than I was expecting. Omar Epps leads a crew who discover they are the only survivors of mankind in the whole universe, but they're soon affected by all manner of psychological problems and breakdowns. It's an ALIEN type film but with a more realistic flavour that doesn't resort to simple man-in-a-monster-suit antics. The film is hardly amazing but isn't not too bad as a time waster, and the cast are certainly committed."}, {"id": 74, "text": "Definitely worth a watch, enjoy the story line instead of looking too closely at the special effects and scientific inaccuracies, this is a low budget movie so best not to overthink it. Really enjoyed the ending and a lot of side plots to keep the emotions on a knife edge. In many ways this raises questions on the huge emotional challenge which will come with deep space travel and how humanity will cope with that."}, {"id": 75, "text": "This movie had potential--but it is a bad movie. First--the lighting is horrible, like they live in a cave! Second--smoking! Give me a break! Third-- people on a 10 year space mission sit around and twiddle their fingers, not a Monopoly game in site!! Four--the romance between the couple is pretty much not there. Again--it had potential but it never got to the screen. Should have had decent acting--they tried but it's a miss. People die (some quickly) but it never makes sense as to why some of them die--so many plot holes! I hope the actors got paid up front cause this movie needs to be erased from film! And the title is NOT the year."}, {"id": 76, "text": "To the other reviewers. It's not the year 3022. The movie started in the year 2190. 3022 represents how many days the captain was in command. Watch the entire movie before you review. I had a number of problems with this movie but I still gave it a barely 5. Acting was good. Special effects, meh at best. I've seen better fan made films with special effects than this one. I had a problem with several things. 1. Smoking in space? I saw others had the same complaint. What writer thinks this is a good thing? Wish I could find that out. It's 2190 and people are still smoking?? Seriously?? It's not cool...or important to the plot line...at all!! The writer(s) must have been burnouts in school and carried what they thought was cool to the screenplay. Who seriously funded this? 2. The circuit board John was working on. Again....it's 2190. That circuit board should be the size of a 9 volt battery...probably smaller. For pete's sake I saw a huge transformer on it. A computer board from the 90's was smaller than that thing. 3. Again....the year is 2190. No touch screens? They are still rocking buttons and monochrome screens like it was something from the 80's or 90's. 4. OH....and don't even get me started on the space suits. How where they maneuvering around in space?? 5. What the hell happened to Vincent' eye?? I don't remember it getting gouged out. How'd it happen?? Anyone?Despite all those distractions, the plot line was decent enough but was marred by the technical inconsistencies that all us geeks caught immediately. The producers and directors should have known we'd shred it despite a good story.I'm almost ready to drop my rating to a 4 instead of a 5 but will leave it as is. Wish I read the reviews before I nosedived into this menthol ridden, nicotine smelling space station of a movie.You've been warned viewers."}, {"id": 77, "text": "I'm giving it a 6 simple because of the efforts made by the two leads (Omar Epps and Kate Walsh). They carry this film, if somewhat heavy handed given the topic of it and the script. Tropes exist, and while they propel the plot, it leaves the hollowness of the script evident and the viewer emotionally empty within the bleak confines of the film."}, {"id": 78, "text": "This movie reveals the hypocrisy of the modern society. Had this movie been shot by Ridley Scott it would be a top runner. It's got tons of phschodramatic content in it. Would make you question tons of matters about life.If you are an average person like the shallow voters don't watch it."}, {"id": 79, "text": "I gave it a solid 20 minutes before shutting it off. It was a mess before that. Space craft was from 1960 when it was supposed to be in the future unwatchable"}, {"id": 80, "text": "I watched about 26 minutes of it &amp; saw that it was going nowhere. I couldn't take much more."}, {"id": 81, "text": "They tried and miserably missed the mark, it's a total waste of time unentertaining piece of crap and I wouldn't recommend this to anyone"}, {"id": 82, "text": "This put me to sleep. total suck. /////jdjdjdd bdjdjjd"}, {"id": 83, "text": "I have had farts with a better storyline than this movie. You will never get these 90 minutes of your life back."}, {"id": 84, "text": "Unnecessary time jumps, you would also think a movie set 1000 years in the future would have way better looking technology, no imagination at all."}, {"id": 85, "text": "Did I finish watching. No. Why? Because for the first time in, well forever I realized this was a movie that just is so badly done it didn't deserve any more of my time. The continuity is non existent. The suspension of disbelief never happened even for a moment. Bad acting. Bad directing. Bad story. Waste of time. I include no spoilers because this movie is like rotten food. No need to smell it when you can see it's bad."}, {"id": 86, "text": "Some number of good actors trapped in a totally incoherent self indulgence by the idiot Producers, Director, and the Proto-Literate, Faux Writers. It would be more interesting and make more sense, to simply have the actors read-in-turn from the NYC telephone directory. What I want to know is if utterly lousy movies like this one are some form of elaborate tax dodge for the investors?"}, {"id": 87, "text": "Three words sum up what stuck with me after watching this film. Smoking in Space? Was a French company involved in the making of this movie? The French love to smoke and just couldn't see the stupidity of showing space travellers dependent on limited life support having a drag on a cigarette. This could've been a decent sci-fi flic."}, {"id": 88, "text": "The worst CGI I've seen in a long time. The premise is interesting, however the characters are shallow, the acting is marginal (despite a decent cast), and the plot makes no sense. Possibly the worst movie I have watched this decade."}, {"id": 89, "text": "You're telling me that by the year 3022 the human race hasn't kicked the cigarette habit yet? Who in their right mind would use precious cargo space to bring along decades worth of cigarettes? Most smokers smoke a pack a day, there are two crew members on this ship that smoke, there are ten packs in a carton, so every ten days the two crew members each smoke a carton, that is 36.5 cartons each a year, each carton measures 2x4x12, and just in the first two minutes of the movie 6 years pass. Imagine how much cargo space was wasted for just cigarettes for two people. And furthermore, I can't imagine any captain allowing people to smoke on a space ship where your oxygen is a finite resource. Why do they let actors smoke in these kind of movies, it truly ruins the premise. Take Water World for example, enough time pace with the planet completely covered in water for humans to evolve to the point where they had gills yet there were still cigarettes and bullets and gasoline? Yeah right. If you are going to make a futuristic sci fi, especially one where they are trapped on a space ship for decades, leave the cigarettes out."}, {"id": 90, "text": "This movie was pretty good. Solid acting I thought. Filmed Well. I didn't notice a lot of plot errors.I wanted more detail as to what actually happened. And the movie could have added more really.Overall a good 6 to 7 movie."}, {"id": 91, "text": "Its not that bad, but its not that good either. The smoking is not as werid as others are saying. The Russian Federation cosmonauts did smoke aboard Mir and received packets of cigarettes aboard the resupply capsules. So if the filters are ok its not a big problem."}, {"id": 92, "text": "I kept hoping it would make sense, but it defies logic and reason. I could take it at face value as pure entertainment, but it's not even entertaining. The only interesting character is portrayed by Kate and it takes an hour to reach some clarity."}, {"id": 93, "text": "Well acted drama with an engaging characters. The premise for the science fiction is existential, not the special effects. And the relationships and perspectives held my attention."}, {"id": 94, "text": "In Short Low to mid buget movie that lends from 2 other movies mainly; Sunshine (2007) and Event Horizon (1997). Due to the budget the CGI isn't aced and neither is the staging always good. The writing is allright thought with alot of logical misses and scientific inaccuracies. This movie does not try to function within established scientific borders. The acting is what you will remember this for, the full cast makes well above ancticipated performances and Omar Epps delivers a pretty much aced performance. The smoking advertising is disturbing though, possibly the only way to finance the movie - act and give others cancer or not to act, that is the question..?Pro's Acting Alot of bang for the buck Some effect - the space station cgiCon's Smoking in space Huge logical gaps Detracting staging and cgi at times To clear out the name: At one point he mentions the 3022 - it is the time spent on the station at that point in time 3022 days - this plays in in keeping the viewer guessing if what you are shown is his disillusions, if the whole thing is the scientific test they are there for or if it is their reality."}, {"id": 95, "text": "Why do they start out in 2190 add 5+ years and finally 22 years in the future they date is 3022? Shouldn't it be around 2222? What am I missing?"}, {"id": 96, "text": "The movie has potential. But was handicapped by under-acting from the antagonist and the occasional 'snap you out of immersion' inexplicable occurrences, behavior and coincidences. The movie never quite reaches the atmosphere of the likes of Moon, the martian and others because of creative and financial limitations. Just a bit 'off'. But not enough to turn off the movie. Fun if you want some 90s sci-fi and don't expect a deep plot."}, {"id": 97, "text": "This movie is heavy apocaliptic story. I wish director had more budget - it would blow cinemas all over the Planet.Apocalips never felt closer. The heavy feeling of Earth being gone while you are on soace station is brought to us by this amazing cast and their devltion to the story. It feels real.Sad movie. One that sits on your chest and feels heavy. But the ending is beautiful... Sad, but beautiful.Cast, crew, director - Please don't YOU be discouraged by the low rating - These young people today don't understand anything but batman and comics. Emotional people will find this movie great."}, {"id": 98, "text": "This is a *really* decent film. Spaceship setting, terrible events, interesting characters who are well-developed, and totally believable. The thing about this movie is that it is brushed almost gently, and subtly, flowing beautifully; so well-crafted. There are reviews here which say it is about relationships, about human behaviour in such a situation, and I suppose that is true enough. What I felt is that it's about human spirit, an exploration of the human will to live, without being tediously naval-gazing (as one might find in so-called 'intellectual' or 'arthouse' films. (It's funny that the crew from the other ship is French, I feel like that is a sly wink.) This film avoids that trap admirably. At the end of the film I felt that we have hope that we are not all savages. I felt that message even before the final scene, it would have been enough of a message, no matter the ending. It is not space opera, not hard-hitting sci-fi, or whatever it is the people who need to have their hands held through a movie wanted it to be in order to satisfy their movie-watching desires. This is a terrific film."}, {"id": 99, "text": "I still can't figure out why this movie exists. The setting is cool and the premise is great, but it's just 4 people sitting around talking with some sleep disorders."}, {"id": 100, "text": "So let me get this straight... it's 3022, we have the technology to allow humans to live in space for 10 years ( in space for two and your body systems start to die, your muscles become limp, and all sorts of important components like sodium , calcium etc aren't stored or metabolized correctly In space ) of course a lot of those health issues that humans start to have is because of a lack of gravity- but here we have gravity. So that means that the technology is super super awesome. They have a CT scan in space ( nice) so we are talking some high tech space technology. BUT- when there is a crack in the hull - there is no alert - there is no alert to tell them where the damage is or if there is damage at all! That doesn't make any bit of sense to me at all. They lost me at the crack. Now the responses the team had .. to the event were .... unbelievable at best. They do so much testing for Astronauts psychologically speaking that basically if you're going up in space - you're the best the human race has to offer. These guys are astronauts and soldiers and I just don't suspect that first of all- any of them would ever be in space for a ten year trip at all, if PTSD was an issue for example. The Ten Yard stare happens yes, when you're in shock- or more like when you're recovering from the shock. But to bring on that response you've got to have a severe flood of fight or flight hormones... and the response to those hormones isn't silent ( to say the least) Idk.... just too many things like that. Also none of these people would smoke. Smoke in space is just too stupid- beyond the extremely dangerous and life threatening ( they obviously have 02 pumped at all times ) and to think of the technology that they might be using - just highly explosive all around. Probably the worst part was when she tried to escape and the captain is exposed to deep space without a suit or oxygen and survives without a scrape. I mean he is able to pull her back in and all is well. Just doesn't happen like that. Besides his lungs exploding - he would be frozen and frost bitten at the least. Deep coma if he survived with extreme cold burns. What also makes this part hilarious is when he IS outside in space in a suit and she says you only have a few moments before you risk exposure Are we just supposed to pretend like one makes sense and the other doesnt ? Or what. I also thought that going insane was a poor choice for what would happen... we assume so much and don't really invest too much thought into whatever it is. Americans are terribly bad at that.. and America is probably the only audience that could watch this film and not laugh out loud. But really? Last people on earth and they go insane? There are so many more interesting options... but we have probably seen them all. Yeah? The Martian? Anyone? The truth about people is that the will to survive is programmed in all of us and it's a biological reflex. Stronger than a drive or will. It's something we don't have any control over. We will survive ... at all costs. ESP if we were brilliant , mentally strong and healthy. Overall- very stupid."}, {"id": 101, "text": "I am so mad that I wasted time watching this. It's as if the filmmaker got tired of the project and just threw something together. And that something could have been great.The first several years are whizzed by with no depth or getting to know the characters. I almost stopped watching but had nothing better to do at the moment. Once the movie starts moving and I was engaging with the characters, the film lost direction again. Too many good moments skipped over and I was left confused about a couple of very important pieces.SPOILER: The movie basically ends without really ending. Nothing is actually resolved enough for the viewer to even speculate further. The one character (who I thought was dead a while before) shows up again but I'm not sure if she was alive or just a hallucination of the other character. This would have been great to speculate on if other parts of the movie had been done better."}, {"id": 102, "text": "Well, it's bad. But I sat here like a statue and watched it to the end. SOMEHTING caused me to do that. I do like Foreman from House and Sara from CSI. Some minor plot changes could have helped a lot."}, {"id": 103, "text": "Yes it may be slow but there is a story! Decent sci fi movie about hope when there is very little in reality."}, {"id": 104, "text": "Amazingly strong cast for a low budget film. Great performances by all. Premise is good, script ok, plot flow full of holes, production okay for the budget. Fun flick but don't expect a blockbuster."}, {"id": 105, "text": "TERRIBLE MOVIE, DON'T WASTE YOUR TIME! While ripping off some of the tropes of Alien and other great films, this movie is a total disappointment!! Hard to follow, confusing plot and script, BORING AND WE DON'T CARE! Ok just go die all of you and spare us!! Jeez!"}, {"id": 106, "text": "I can't believe I watched the whole thing. I kept holding out hope that something would happen. Nothing did. There is literally no story. For 90 minutes. And then it just ends."}, {"id": 107, "text": "Good premise but factually it is just so bad. In one scene Omar is exposed to the vacuum of space while the bay doors are open and he's not wearing a spacesuit and he is just totally fine. He would of froze/suffocated almost instantly."}, {"id": 108, "text": "So.... This film is far from perfect. They get a few things wrong like constant gravity where there should be none... A shuttle that mysteriously drifts from side to side in space... Stuff like that. What they do get right though are certain human aspects that really make this film enjoyable to watch. There's no dumb character. Everyone makes choices that are believable for the circumstances. That's what's most important. That's a great testament to the script that was written. Considering the small budget I have to give it to the director also. He created something that was I'm sure a challenge but made a mountain out of a molehil. Props to him sincerely. Again, the scientist in me was laughing at certain things (special effects... Oof) &amp; applauding others (no sound in space! Yay!) But all in all, the well written characters (which lead to great performances) &amp; story was the main draw of this film. Well worth the watch."}, {"id": 109, "text": "I don't know why it got such low ratings. it was a little bit slow and disjointed at first because they make you wait for answers. Give it a chance. It ends up being really good. It kept my attention which is hard to do. I usually pause 4 or 5 times to do something during a movie but I didn't pause even once."}, {"id": 110, "text": "Better than Ad Astra and that's not saying much. Netflix is full of crap movies like this."}, {"id": 111, "text": "Instead of days. Okay, not that bad. It held my interest only because the actors are first class. Good story that is missing an ending. I would rather have the writer or director take a chance and tell me what happened rather than let me make up my own ending. It needed about 5 more minutes to wrap up all that happened and then we could debate."}, {"id": 112, "text": "In the future (where this film is supposed to take place but kind of doesnt) a man drives a ford f 150 next to the moon. Writtin (to him) on the wind shied is the message: 'go ahead and strive.' humans are motivated to limit each others weaknesses so more infints can be created. If you turn on the news youll probably see the news guy talking about the corona virus with a worried look. He does it to breed."}, {"id": 113, "text": "What a shame...not a bad idea really, cast let themselves down really....and the writing was OTT (over the top)Absolutely awful. ."}, {"id": 114, "text": "Put you pyjamas on when watching this as I guarantee you will fall asleep within 40 minutes, that's if you haven't already turned it off by then. Acting is good but a Poor storyline ."}, {"id": 115, "text": "It's a bit pointless from the start. Once you ask yourself why a mother with a young child would go on a 10 year mission you realise the whole concept is weak. It it was a 50's B movie you would say it was interesting but given its now 2020 and it's set in the future it fails to deliver on all levels. Depressing."}, {"id": 116, "text": "Smoking in space,absolutely love it,if they had of got drunk as well,would have defo give it a 10 stars"}, {"id": 117, "text": "Biggest black borders on my TV I have ever seen, should have been black to cover the whole screen. In the future we are still smoking and phoning people !! Waste of time and just a depressing crap movie !!!"}, {"id": 118, "text": "A ridiculous storyline that couldn't even be saved by decent actors. The story plods from one ridiculous plot line to the next with no continuity. And realistically, who hires a complete moron as a space station captain? Don't waste your time on this clunker."}, {"id": 119, "text": "Only 5 years into a mission and we are led to believe that these 'astronauts' can't even keep it together.Badly written 'coronation' street affair set in space with great special effects, but a dull plot that crawls along with no sense of purpose.Avoid."}, {"id": 120, "text": "04/29/2020 Any score above three (3) stars can't be true.? This mess of a movie falls somewhere between terrible, awful, and this thing really SUKS? Omar and his fellow crumbumbly actors lack any excitement necessary to draw the viewers into this crummy, outdated storyline. The movie/script/storyline lack everything necessary that movies are supposed to present to viewers for entertainment purposes. This movie is an absolute drudge to endure/watch. Skip, ship, skip ahead some more. I'm glad this mess is over and hope I never accidentally watch it or anything like it again. Watch it only if you dare (a movie hungry Starvin Marvin), but remember you were warned that you'll be sorry if you do. Bon Appetit'"}, {"id": 121, "text": "I wasnt too sure abt trying this one, but I'll give a scifi movie a solid try before making judgment. The cast was great, they really put forth alot of effort. The plot was great, i loved the whole thing, the ending- wow! Smoking in space- takes me back to the Alien franchise- classic! I'll recommend this one. Truly a hidden gem."}, {"id": 122, "text": "This is worth a watch as many other reviewers have said. As the movie played, there were definitely some things I thought could have been better, and missed the mark. However, overall, an ok movie."}, {"id": 123, "text": "This movie is laughably stupid. Smoking in space (maybe that's why you have an O2 shortage), parents leaving their child on earth while they head off for the unknown, plenty of improvised weapons handy if you decide to take space law into your own hands."}, {"id": 124, "text": "If you like drama onboard a ship, without the technical knowhow, where rations dwindles and it hits the fan, then this is it for you. If you like sci-fi this is a never-ending let down.. Nice props, horrible everything else.. why is this story put in space in the first place?"}, {"id": 125, "text": "Moronic film. How can you take a film seriously when it is shot entirely in darkness? Are lights for some unknown reason going to be banned in the future? Or are humans about to adapt and be able to work and live without artificial light? All I can say is that this reviewer developed eyestrain and gave up. It could have been a good film but never mind...."}, {"id": 126, "text": "I was drawn to this film because of Miranda Cosgrove who I really hope can catch a break post iCarly because she is just a nice person, but I couldn't help thinking that if her on screen brother Spencer from iCarly would have been there, he would have done a better job than all of these pro astronauts that only seem to be great at failing to make the correct decision. The film painted the picture that they barely made it four years into the mission before they started going loopy, anyway I watched till the end and was left feeling like it was all for nowt."}, {"id": 127, "text": "It actually not bad, it may don't have wow effect, seems low budget, slightly shaggy camera, but this unusual idea of space movie is actually OK."}, {"id": 128, "text": "What a pointless and full of errors from the very start, too dark to see what really is going on, I've seen some bad films and this one is right at the top of the list."}, {"id": 129, "text": "Do not watch this. like a 16y old infats writh this story. who has no idea about psyhe, space, phisics, or human mentality. astronauts complaining live support oxigen running out, while smoking a cigarett. where he get that anyway. thay have there a tobbaco shop? 10+ year food thay have for 4 people, but after 5 year thay left only 1 month? there is no sense here. same as the human psyche. all the caracter mentaly instable. hallucinating after 5 years, or killing each other by evil. ok. one. nasa can have a mistake. but all???do not watch this."}, {"id": 130, "text": "Seriously, in this film they smoked more in 90 minutes than the characters in the Chernobyl mini-series did and that was 6 episodes and set in 1986!"}, {"id": 131, "text": "A thousand lens flares was never going to save this movie, you have to get the fundamentals right and even then, spare the flares.The CGI was done by someone who works for Fiverr. The lighting was dark to hide the rubbish sets, three-ply and black paint. The space helmets fogged up and smoking on a space station with limited resources, I suspect it was the actors saying, We're smoking deal with it. Miranda did the right thing and bailed early. Work must be hard to find for forgotten actors, what a life, who'd sign up for that?Not worth your time, learn to code instead."}, {"id": 132, "text": "I literally stopped watching when the guy was starting to perform brain surgery, om an enclosed spaceship while smoking --My guess is that actor said i'f U want me in the movie I smoke, hey its no big deal'--this is the usa where IQs are dropping yealry"}, {"id": 133, "text": "Just wasted 20 bugs for this crap. bad story, veeeeery bad VFX (windows movie maker level max), bad acting. dear movie lover. just move on, nothing to miss here."}, {"id": 134, "text": "I enjoyed this movie, seeing a lot of negativity on here but I think it's a solid Sci-fi film! P.s yes they're smoking in space have you not seen alien??"}, {"id": 135, "text": "This movie was great it had believable characters and some tense moments, ninety minutes well spent in my opinion"}, {"id": 136, "text": "Predictable..... Abrupt end.... Really could have been so much better.. Great acting... Crap predictable storyline"}, {"id": 137, "text": "The concept is good and universal- small group far away from home for a long time, finding out there is no home (could be a space ship or a sail ship from Atlantis for example, in 2000 BC). Interesting twists about Acting and some space cinema scenery work OK. What make a it a bad movie is most of the screenplay and director's execution. Lots of confusing and unexplainable details, why sending small group for 10 years? Any group of 4 cooped up for that long will certainly go bonkers in any circumstance. Whats up with a space pod from ISS, if it takes 3 months to get from ISS to Pangea, why send Pangea team for 10 years?. The film is unnecessary long and frustrating to watch, a lot of unintelligible mumbling, confusing details , anachronisms and SMOKING of all things !! I tolerated watching it on the airplane, if nothing else hoping that something redeeming will happen. It didn't."}, {"id": 138, "text": "Its just nothing, literally nothing. a space station with space workers, earth blows up, they die. end. it is without doubt the most pointless film i have ever had the misfortune to come across. do not waste your time with this dross"}, {"id": 139, "text": "Smoking in space is stupid. We get it. The acting wasn't bad...but the actors don't write the script. I appreciate it for being slightly interesting, but the ending left you with nothing bc Earth was destroyed. Nowhere to go from there. The end."}, {"id": 140, "text": "Who did they refuel? The premise is that they were all alone for years on a refueling station but they never refueled anyone. Ships should have been coming and going on a regular basis, they would have had lots of contact with other people. They lost me after they overlooked this fact. Bad idea all around. OK acting but when no real plot nothing they can do."}, {"id": 141, "text": "I don't understand all the poor ratings. The only weakness in the film is below average CG. Otherwise, a compelling storyline driven by excellent acting by Epps, Walsh and Macfadyen make this a must see. The depth of madness created by solitude is captured beautifully by the actors and the director. As Bane said, 'There can be no true despair without hope.' Forget the poor reviews. Decide for yourself."}, {"id": 142, "text": "As other reviews say, the acting was good. And the elicited feeling of loneliness, also done well. I didn't get bored, which is saying something. It filled the time and was not predictable. The title is not the year; it's referenced near the end. Sure, why not give it a try."}, {"id": 143, "text": "The plot and idea were good. The science was terrible. Really? A claw hammer in the space station? The creators should have open sourced the technical aspects. The user reviewers here seem to know more about the realities of space, and could have helped with the revisions."}, {"id": 144, "text": "Ok, the title of this review is a bit confusing but for good reason. It's a movie based well into the future, in space, but the realism comes from the psychological effects experienced in this movie. It starts off with the usual excitement but descends into real paranoia and the bitter feelings of longing not to mention the morose of being only 4 persons locked up in a tin can for years. Add to that a catastrophe that shakes everyone to their core and you have one heck of a recipe for a good movie. Good, not great. Still, I never turned away once. I was glued to this movie. I'm glad it never had a bigger budget because I loved the isolation and darkness the movie projected. A big budget would have added too many effects, blinking lights and other of the usual sci fi accruments that muddle things whilst burying the narrative. No, the story is the thing here. The bleak hopelessness this movie projected along with just the right dash of hope. A delicious combination."}, {"id": 145, "text": "It's sad that this movie's creators think we're done evolving. I don't know why this movie is titled 3022 because all the science in it is 2022. The movie is hardly enthralling - maybe because we've seen some version of it a dozen or more times already - so if you want to half watch it while you're doing something else, then go for it. Considering that it's low budget-ish, it's not a bad movie. But it ain't good either. The concept is good, but it just doesn't live up to its potential."}, {"id": 146, "text": "There is always hopeInteresting psychological thriller An advice If you expect an action pack horror you might disappointed Some action and blood is there thoughWorth a watch on my opinion"}, {"id": 147, "text": "I liked the cast interactions when they weren't struggling with the shoddier parts (as in 95% of it) of the story. I really wasn't sure what the motivation for anyone was other than the mom who wanted to see her daughter... that she blew out and left on earth five years ago, but hey, take what the script gives you. I guess the director came in every day with Okay this is where you are at on your crazy level today.And what was with the life countdown clocks? 91 percent then 55 percent. The computer knows when each is going to die? The ridiculous escape pod scene with the computer counting down how long to station collapse. Of course it reaches 1 and then, whew, the door closes and it's all better now. Golly instafix by plot armor is awsome!I guess Netflix bought this one so when they show one of their crappy home made movies they can always point at this one and say. Hey it's not as bad as 3022 is it?Seriously do yourself a favor and pass this one up. Even if you are the last person on half a space station with your girlfriend on the other half."}, {"id": 148, "text": "Such potential. Long term isolation and travel should have been a successful template. Good casting. Good visuals. I point the failure at writing and directing.The story never developed to bring us viewers along. Without the story going anywhere tgeceas no where for the viewers to go.Loss of signal only detected when they looked? Surely there would have been constant communications. A more obvious error was the laziness to show cigarette smoking. These are but two examples of multiple scientific gaps. Almost like the science was missing from science fiction. Seriously how lazy is it for a director to throw in cigarettes in multiplier scenes. Were they paid for smoking placements? In space on a constrained system?Missing purpose in writing and lazy directing. I tried and just couldn't finish. Petered our"}, {"id": 149, "text": "Did NASA discover smoking is good for you so ALL 4 ASTRONAUTS could smoke on their mission?!?! They really loaded ten years worth of cigarettes on a spacecraft made with precious space that could only haul necessities?!?! Really?! Was this screenplay written in 1974?!?! You know, when everybody smoked unlike in 2020 when only stupid people smoke?Obviously Big Tobacco threw a fat stack of cash at Netflix for product placement but why would a mega rich company choose to wreck the image of a film to help advertise poison?The smoking here was such a distraction I could never get a chance to start liking it. It also was pretty dry and mediocre so that didn't help.STOP WITH #+!=?*% CIGARETTES! It looks terrible and ITS KILLING PEOPLE!Adam White"}, {"id": 150, "text": "Let me just say that the scenario described here is one of sheer terror. You wake up one day and the entire planet Earth is gone. There is no one to get back to, there is no reason to do anything anymore. Not even keep living?The characters in the movie reflect this mind-shattering scenario and its gripping dilemmas in realistic ways. People who complain this was dull, or pessimistic, or depressive, or grim... Yes, it is. Do you expect people to entertain you after all they've ever known got simply snuffed out? After all meaning in their life was taken away? This is a movie about the tenacity of the will to live against the darkness, the nonexistence, the death that permeates the cosmos. It is about starting anew, about throwing everything away and finding new reasons to live. The actors did an awesome job, and the movie itself is brimming with philosophical questions. If you are a brave soul that wants to stare into the void once in a while and test your mettle, and love great acting - then this is a movie for you.I also think it captures, perfectly, the poem by Dylan Thomas:Do not go gentle into that good nightDo not go gentle into that good night, Old age should burn and rave at close of day; Rage, rage against the dying of the light.Though wise men at their end know dark is right, Because their words had forked no lightning they Do not go gentle into that good night.Good men, the last wave by, crying how bright Their frail deeds might have danced in a green bay, Rage, rage against the dying of the light.Wild men who caught and sang the sun in flight, And learn, too late, they grieved it on its way, Do not go gentle into that good night.Grave men, near death, who see with blinding sight Blind eyes could blaze like meteors and be gay, Rage, rage against the dying of the light.And you, my father, there on the sad height, Curse, bless, me now with your fierce tears, I pray. Do not go gentle into that good night. Rage, rage against the dying of the light."}, {"id": 151, "text": "As a huge Sci-Fi fan I've watched a fair share of disasterous movies and this is just another drop in the sea. Let's keep this review spoiler-free, but I don't recommend watching it unless you admire some of the actors, who were good as much as they could be.So, astronauts of future. You would expect a bit more sophisticated equipment in 2190, or at least as sophisticated equipment as it is today. Instead of that, we've seen some mix of everything, really confusing and illogical, from Cold war era like computers to futuristic screens.Visual effects were below average, story was confusing, jumping back and forth without any logic, with some of the most interesting questions being left unanswered. Some important parts were too short, while some totally insignificant fragments had much longer duration. Total mess.Acting of most was decent, couple of scenes had strong emotions but nothing spectacular. The worst part of movie, although almost everything is bad, is definitely Gjokaj's performance. Felt like I was watching some eastern European parody actor.To summarize, I think this one had a lot of potential, but it was wasted beyond any salvation. Saved from grade 1 just because of main actors who gave their best."}, {"id": 152, "text": "For many it will be (quoted in title) Bowie's surreal Space Oddity at times brutally (un)humane sci-fi. So, I'll stick to more scientific aspects. In which the movie is quite satisfying.It is not unknown nor uncertain theory in past decades that the huge problem in long-term space traveling and missions is of psychological nature (Crew/Time). With a plentiful spectrum of elements that can be stratified in various ways (character profile, profession, age, communication, sex, etc.) There are indefinite combinations in mind, perception, imagination and other more subtle mental functions in play. Decent acting for that part.As I see it, the movie carefully depicts many, above mentioned and more, combinations and particularities. Slowly rising from moment ticks to serious pathology. That's why for good part of audience it will be slow or boring in parts. But, exactly for it's realism in temporal and spatial pace and it's ambient claustrophobic tight space (that was actually always a case in space probes and vehicles; hence obvious detail of E. Musk's spacious design of crew interior in the x-spaceship for future Mars missions). Photography and colors were managed well to support atmosphere and ambience.The real problem of the kind are not the ones we can imagine, test and simulate, but the ones that we can't. Those that eerily remain hidden and the movie exploits surreal psychosis from. Like profoundly social human being staying all alone in vastness of deep space. Also showing the bitter truth of one of the oldest univ. proverbs: The biggest enemy of a human is another human. All this is a reason why today the space-mission scientists do a lot of testing in small, closed/isolated groups in confined spaces. Beside the horror side depicted in the movie, there are positive moments. Scenarios also for positive univ. proverbs like: The darkest nights produce brightest stars. One must be strong and try, at least for not ending all alone unlike before mentioned."}, {"id": 153, "text": "I wanted to enjoy this movie. As always, I went in with an open mind. Here's what you can expect (no spoilers here) :Sadly, less than 7 minutes into the film, you (the viewer) have already come across an equal amount of time periods displayed on the screen.I may sound a bit harsh on this one, but it's clear from (quite literally) the VERY beginning of this movie that the director has absolutely NO idea what he's doing.For a film with a promising plot synopsis, and halfway decent actors, I was sadly let down in its execution.People tend to enjoy movies which they can follow.Sadly, this movie tries to jump all over WAAAYY too soon, in an effort to grip you early on- and miserably misses its mark.This leaves you thinking for the remainder of the movie, What the hell were THEY thinking?That question should not be lingering in your mind at all- ESPECIALLY when you're halfway through a film...Still, that's the cause and effect of poor execution.The only reason it got four and not one was for the previously mentioned plot and acting.Otherwise, it's a disappointing scifi which you should sidestep if possible."}, {"id": 154, "text": "I could have given it a ten stars for the principle idea, the story and the acting. For some stupid flaws in details I take 2 stars off. Unnecessary to set this movie so far in the future, nothing looked like that and, honestly, smoking regular cigarettes in 2190, seriously? Point is, it absolutely does not matter when these events happen, so why attach a date to it in the first place? I guess some of the audience got disappointed by the movie just based on this fact. And maybe because they expected the typical action based or horror alien whatsoever nonsense story, which does not happen here. And that is a great plus of the movie for me. I actually really like the subtle use of dramatic and hallucinating elements. I also liked the subtext of the ending, what is it that really matters when (almost) everything is gone. Quite a lot of reviews did not like that, I guess because they are used to the typical plots of most current SciFi movies and books (survival beyond any matters). This movie has a different, and I guess much more humane story to tell and that is why I would highly recommend it to anyone who is is interested in more psychological drama and what life at the end comes down to if you can ignore some stupid, easily avoidable, flaws and a few stereotypes."}, {"id": 155, "text": "It's more so about a man, humans rather, losing their humanity. The science fiction aspect of the entire movie is only a medium in which the message is being conveyed. The message itself, I believe, is of humanity being lost between a battle of hope and despair.It's a deep movie, if you don't take it for face value. It's definitely a low budget film, with scientific inaccuracies from A to Z. Trust me, it gets to me too, coming from a doctor - it's a shame to watch an amazing idea get penalized for horrible science. Even if it is an incredibly low budget film, it takes a medium-leveled Bachelors in science to understand the utter basics of both medicine and space travel (namely, basic physics). Character development is subpar as well. In the end, what can ya do?Regardless, if you decide to watch, please just watch it for the message itself about humans valuing time of life over quality of life. I do believe it's very accurate and I like the message, you can never give up hope."}, {"id": 156, "text": "The concept sounds good, 'let's examine how people behave when faced with humanities destruction.' We have seen this before with apocalypse movies such as Sunshine or The Road before, but where those movies have something that stands out to make them memorable - be it dialogue, character development, action or interesting moral choices - 3022 fails at being any thing more than a unevenly paced, boring, depressing story that isn't held together by anything memorable.The plot is basic, the world gets destroyed and the only people left alive are on a space ship bound for Jupiter's moon Europa. Then the audience is left to... well we are not sure. Is it a journey to find the true meaning in life now that humanity is extinct? No. Do we see the best in humanity dealing with insurmountable loss and a struggle for survival? Nope. Maybe it is about a slow slide into madness? Not so much.Continuing to plague the film are numerous obvious plot holes and shockingly poor set design. The original Apollo space craft looks more advanced than whatever rickety craft they are flying. There is no modern technology (and this film takes place 150 years from the present day!). There are times that the simplest of iphone apps would solve problems the characters are baffled by.There are some saving graces. The acting, especially Epps and Walsh, are solid. They make the most out of confusing dialogue. The movie is also very depressing (yes a saving grace I guess), with not one light hearted moment or comment - which may appeal to some - so I guess the mood is consistent.So, should you watch it? Short answer is no. The longer answer is probably not. It is clearly a low budget film that is stretched thin and can't make up for it's short comings. I mean, they don't even make the destruction of Earth interesting. But this film does/could hit a very narrow sliver of audience that appreciates a dark, depressing often boring, depressing (oops, did I say that already?) story about the destruction of all life and the end of humanity.5/10"}, {"id": 157, "text": "Some of the production values of this film are weak. In particular, the editing leaves much to be desired. There are many scenes that are so poorly cut that it's hard to decipher what's being said or what's happening.And if you're looking for a realistic vision of the future, move on. There's very little in this movie that's much different from today's world, other than people being aboard spaceships floating in space far from Earth, and the implausibility of some of its ploys.I could go on criticizing, but there's something I really liked about this movie. I enjoy edgy movies, relentlessly oppressive and impossible situations exploring the negative limits of human experience. This movie certainly delivers on that front.This movie isn't about the future; it's about the timeless human predicament, the fragility of our attempts to find meaning in a world where alienation and distrust are the norm, and our tragic predilection for self-destruction in the face of it.Every single character in this movie is deeply flawed, every relationship deeply dysfunctional, every possibility for hope dangling on a thread. The logic of the plot is one of inexorable self-destruction, as each character alternates between glimmers of hope, surrender to despair, and narcissistic betrayals, always out of joint with each other. If that sounds depressing, it is. But I credit the movie with moving my emotions while not becoming cheap."}, {"id": 158, "text": "All I knew about 3022 when I sat down to watch it was that it was a sci-fi movie of sorts. I had no idea what the story was about, nor whom was in it. Normally, I am not overly keen on sci-fi movies, but was given the chance to watch it, so I did.First I have to say that 3022 is not an overly interesting movie. In fact, it was sort of boring and very uneventful. More than once was I tempted to get up and go watch something else. But I endured and stuck with it to the end - to the boring, unsatisfactory end.For a sci-fi movie then this 2019 movie from writer Ryan Binaco and director John Suits was mundane, generic and downright boring. There was simply way too little of any interest going on to keep the movie going and keep it interesting.I will say, though, that the acting performances were good, despite of the actors and actresses having very little to work with. Most memorable in the movie was Angus Macfadyen, without a doubt, given his strong performance.The movie is dark, a bit too dark if you ask me. It makes no sense that there was so little illumination about a space station. Sure, it sets the mood for a thriller or a horror movie, but it makes absolutely no common sense whatsoever.I endured 3022 to the end, and can honestly say that this is not a movie that I will be returning to watch a second time. My rating of the movie lands of a less than mediocre four out of ten stars."}, {"id": 159, "text": "The Trailer looks damn fine to me. To say, that the FX don´t look like AVATAR or an installment in the TERMINATOR-Franchise doesn´t say anything about the quality of the entire movie.The Cast is well chosen (Omar Epps is a guarantee for an intensive Charakter) and Kate Walsh did a fine job in FARGO (series) and DEAD GIRLS DON´t LIE.I give it a 10/10 because I really have no Idea how this thing could end, so I just hope, that John Suits can prove his talent in filmmaking, like he did in THE SCRIBBLER, which was truly fun to watch.To me its like the message Jordan Peele is doing the TWILIGHT ZONE-Reboot - great news - this is similiar with John Suits is doing an apocalyptic, claustrophobic Space-Survival-Sci-Fi-Movie - also, great News."}, {"id": 160, "text": "'3022' is a horrendous film.The writing is atrocious, almost every scientific element is butchered like it was written by someone with no general education (and someone who has probably never read a sci-fi story or watched a film).Literally from the first scene, nothing makes sense, the existence of the station, the rules of spaceflights, the personalities of the crew, the design of the station, their purpose of being there, NOTHING.Why have this huge fueling station? Why the 10year shifts? Who are these people (since they clearly are not astronauts or scientists), why the ship looks like a sewer and is barely lit? Why are they not doing anything for 5 years but just killing time? Why this specific number of crew members? What are they supposed to be doing? How can they communicate instantly in space? How can the Earth blow up from the inside AND NOONE IS ABLE TO NOTICE THIS (the physician probably noticed that, but it's unclear)? You'd think that such an impossible implosion of a planet would be noticeable. What was up with that light? Why is the crew celebrating when they are low on food and oxygen? Why are they smoking on a space station with faulty vents? Why does the station have terminals with buttons when they have a fully functional AI in control of the ship? Why are they losing oxygen faster than producing it if the station is supplied to handle at least 4 grown adults?I mean, ok, I get the low budget thing, CGI spaceships that look like they were outsourced and made by a freelancer for like 500 bucks, 2-3 sets, crewmembers bleeding ketchup from their ears, explosions in space, fine. But this is science fiction, can you at least try to have an interesting idea? No something that has been done to death? At least one thing that would make sense and not be insultingly stupid? Have you ever read a book? Have you ever heard about space? (talking to the writer obviously).To be fair there is a spark of a good idea here and there, but when you look at it it's just like a dead star, you can still see it, but it's probably dead already and you're just seeing the light that still travels from it.I really feel for the actors since in a horribly written film like this one, some of them still cared, and their performance heavily contrasted with everything else.4.6/10 is extremely overrated, no one should have the right to violate the concepts of science and common sense with this level of writing."}, {"id": 161, "text": "So many low reviews for this movie! They are pretty much in the mark if they are between 3-7. This movie is definitely a stinker! They managed to find some actors with some decent talent, which is where the entire budget for this movie was clearly spent because there are very few CGI moments worth discussing.Plot Holes: Galore! Ok so according to the Earth the continents in the future have reformed into Pangea, or one large continent like it used to be millions of years ago. This is a statistical impossibility I am afraid. The continent's reforming like that occurs over millions of years, not over a thousand of them. So y'a it's a massive plot hole. There are many other holes in the plot, you will have to trust me on that one.Acting: All the best acting in the world couldn't save this stinker from its own bad writing. That said, the actors did what they could with what they had. It's not like we have Brad Pitt and Anthony Hopkins either....but the actors we do have are all experienced professionals and di their parts for what must have been a particularly small payday on this one.Direction: Very poor. It's like if you had Ridley Scott Directing this movie, would it have been better? To be honest yes, Scott is a master who probably would have rewritten it as he went along. Anyways, poor direction! Omar Epps first crack at direction, and prolly his last. Lighting was terrible, soundtrack and sounds were poor. The sound was just bad having to keep it turned up to hear them talk, but when action happened I had to turn it down because it was far too loudDID YOU KNOW: IMDB, in an effort to restrict angry reviews and angry user scores purposely removes all scores below 3/10. Its true! So many dollars ride on big movies and a movie that has been purposely sunk by review snipers can lose millions as moviegoers still use movie scores to decide if a movie is worth watching. IMDB also closely watches reviews as they are all screened.Overall 4/10. It was good enough to leave running in the background while I read the news on my iPad."}], "reviews_amount": 162}