{"name": "Lost Heart", "titleId": "tt09640414", "reviews": [{"id": 0, "text": "What an amazing story that shares how even people farthest from God can be redeemed and forgiven. The cast has a way to pull you into the story and connect with them on their personal struggles and growth throughout the film!"}, {"id": 1, "text": "This movie has amazing actors that really embrace realistic qualities that we all can relate to. Each character has traits that show that ,despite overcoming obstacles, they care for one another and have a strong will to endure trials. Forgiveness is an overlooked topic that we all need to come back to and keep in our hearts.This movie brings that idea home. And forgiveness is a gift....a miracle..it's supernatural. May we all be ready to forgive. Thank you for the bringing this movie to life and sharing a message that the world needs right now."}, {"id": 2, "text": "This was a wonderful movie. It was very touching and could make you laugh and cry. The acting was excellent and the production was great.The story is about a Country Singer who is an alcoholic because of the way she was treated as a child and young woman by her father. She left home as a teenager and never went back. Her father dies, and she has to go home for her mother and aunt. That's when she finds out her father had changed.Watch the movie to find out what happens!!"}, {"id": 3, "text": "One of the best movies I have ever seen. Cried laughed loved it"}, {"id": 4, "text": "This movie will touch your heart and bring smiles and laughter..shows us how sometimes forgivness does help you heal your heart and mind...and that faith helps to ease life's pain ...the cast was perfectly blended...glad I watched...."}, {"id": 5, "text": "I found the movie heartwarming and a good lesson on forgiveness. Nice to see Donny Most back on the screen. He plays a great preacher. Also loved newcomer Taylor DuPuis. She's so pretty and talented and loved her music in the background. That really gave the movie the class it deserved. Music can really make or break a movie, in my opinion. The Michigan scenery was also wonderful. I'll be watching this again."}, {"id": 6, "text": "Great movie with great message. Love the music from Roanoke. Great acting and singing from newcomer Taylor Dupuis."}, {"id": 7, "text": "The title caught my attention but wasn't sure what to expect. Watching the movie I was drawn in to the characters and their journey through the story. Sometimes you watch a movie you never heard of and it was totally worth it. The personalities, the story, the journey. This was one of those times. Enjoy"}, {"id": 8, "text": "Lost Heart is a funny movie that will pull at your heart strings. The cast was exemplary. Put it on your list, must see movie."}, {"id": 9, "text": "If you were hoping for a Hallmark type movie, this kinda comes close, but not quite. It does have the typical combo of cloying sweetness and dark secrets that those kind of straight to TV movies have, but it severely lacks in areas like acting, story, and the all important lessons to be learned. Not even the epic talents of Don Most and Victoria Jackson can save this mediocre production. The story is so predictable and simplistic that there is very little room for the actors to play it subtle or sophisticated. Not only do you know right from the start where this is all going, it begins to feel like you're being beaten over the head with a big sign that says Here's the message! You know you've missed the mark when you can't even compete with Hallmark movie level refinement."}, {"id": 10, "text": "Lost Heart is a wonderful story about redemption and the mystery of forgiveness. Actress Melissa Anschutz delivers a magnificent performance as Hannah Sweet, a disillusioned (bitter) country music superstar on a downhill roll. When Hannah learns of her abusive father's passing, she returns to her hometown to face the music from her haunted past.With the help of a caring pastor (Donny Most) and a loving, supportive mother (Victoria Jackson), she is able to begin the healing process from her abused childhood. Watch for Melissa Anschutz and Victoria Jackson turn in terrific performances that will certainly touch you, The elements of an excellent screenplay and breathtaking cinematography round out this splendid story that is sure to steal YOUR heart!"}, {"id": 11, "text": "With Hollywood sinking to such depths of depravity (promoting an anti-Christian agenda), it is great to see quality films with a good plot that one can watch without feeling attacked. This film offers hope (that people can change) and emphasizes the importance of forgiviness."}, {"id": 12, "text": "This movie is touching, hilarious, and extremely entertaining! We were fully engaged from the moment the film began to it's unexpected ending. Each actor did an amazing job immersing us with each of their character's very human story. Josh Perry had us chuckling throughout and Melissa Anschutz delivered a strong characterization of someone who struggles with her demons from her past. We fell in love of Victoria Jackson's portrayal of Hannah Sweet's hippy mom. She had us both laughing and crying. Everyone should see this movie as it shows the viewer what it means to be human and to move on with forgiveness in your lost heart."}, {"id": 13, "text": "What a beautiful movie that shows that you everyone has issues . Game and fortune do not guarantee you joy in life but through the teachings of God and repentance you can find a truly joy filled life. Absolutely loved this story and all the wonderful characters that brought the story to life. Congratulations on a well done film!!! I look forward to seeing this again."}, {"id": 14, "text": "Beautiful story with timeless life lessons about forgiveness, hope, and love."}, {"id": 15, "text": "Such a beautiful story. The music performed by Roanoke was incredible and I can't wait to download! Taylor Dupuis was a natural as Elsie and no doubt is a rising star!!"}, {"id": 16, "text": "I had some time Friday evening and I was looking up new films to watch that were trending. I stumbled into this one and I am SO happy I did. First of all, the lead role Melissa Anschutz is absolutely incredible. Her ability to make you feel the emotion shes going through is so real and authentic. Secondly, the story line is great and keeps you entertained every step of they way. Lastly, the way the directors and producers chose the characters was brilliant. This is a must see and I encourage anyone to watch this. You will not be disappointed."}, {"id": 17, "text": "This latest faith offering is a perfect example of why, as Pastor Jared C. Wilson argues, Christian/faith movies are so terrible. Lost heart, like so many others, is more a piece of propaganda than art. The faith message is all important, relegating the story, characters, and motivation as secondary importance.This movie also suffers from what Wilson calls Christian sentimentalism. The good faith filled characters are far too earnest, gifted with inspirational dialogue that is so divorced from real life as to make the whole effort trite and implausible. This, in turn, creates a far too scripted feeling about the whole story. Every message, every platitude, is carefully placed, perfectly timed, giving the whole production a sweet cheesy soft sledgehammer feel.You know from the first scene you are going to be taught an important message of faith that with be served to you without any ambiguity, subtlety, or nuance. Lost Heart has all the earmarks that make it, in Wilson's own words, a terrible movie."}, {"id": 18, "text": "Thanks to the writers and producers of this film, the public has the opportunity to watch a film that has great acting (especially Melissa Anschutz), great character development (the honesty of the characters are brought to life and you get to know them on a personal basis), and a wholesome movie with real-life situations and a great theme!"}, {"id": 19, "text": "Love the way each individual in this movie interacted with each other! They inspired each other, though they all experienced personal challenges in their own unique ways, each were willing to move beyond their issues of the past, and make differences in their own lives as well as the lives of each other... Not a perfect world, but the perfection is in their connections with each other in the most positive ways! Loved the movie, especially in these times...let's support this movie to become the classic it already is!"}, {"id": 20, "text": "I have already watched this twice! I am not a Hallmark movie watcher. They all have the same plots. The Lost Heart was a great combo. I love mysteries and emotional, poignant movies. The music was a plus! I am a huge fan of Don Most so seeing him in a more meaty role different from other characters was a bonus. The whole ensemble worked well together. Great movie!! I know I will probably watch again."}, {"id": 21, "text": "I really enjoyed this movie. The storyline was entertaining. There were cute and funny anecdotes throughout. Movie was wholesome and had a good message"}, {"id": 22, "text": "This is a very riveting movie. Showing how you can overcome obstacles. It's a tearjerker that will touch your heart. A very moving cast with a beautiful show of strength and resilience. To never give up that you can overcome all things. When you have God to strengthen you and help you make it through. I highly recommend this movie to everyone to watch it."}, {"id": 23, "text": "Very well executed. Don Most's performance was outstanding. I was also impressed with the character Chip. My wife and I loved it so much we watched it twice. We knew Don from Happy Days, his singing career, and directing, but this was an Emmy quality performance. A must see."}, {"id": 24, "text": "If you're looking for a special effects type of film this one isn't going to be your cup of tea, however if you're looking for a story driven film, rich with characters, depth and heart, look no more! This is a beautiful feel-good story, with laughs and tears! We are always searching for a film that is comfortable for our entire family to watch together and we found this gem!"}, {"id": 25, "text": "This movie is heartwarming with a beautiful message about living for others and looking past our own selfish needs. It is so refreshing to watch a movie that is not riddled with nudity and violence which is so rare these days. It has a wonderful message, wonderful acting, and leaves you feeling there is hope for humanity and always room for forgiveness!! Definitely recommend!!!"}, {"id": 26, "text": "DJ's writing talent is beyond comprehension! The roles were expertly cast to the right people!"}, {"id": 27, "text": "What a fantastic movie. I highly recommend it!! The entire cast was amazing, representing so many different life styles. Josh Perry is absolutely my favorite. I wanted to jump through the screen and hang out with him. To me, the best movies are the ones that can be amazing without adding nudity and swearing to get ratings. None of that here and we got to see the Love of Jesus 💙. Excellent job Lost Heart writers, cast, and crew. It was beautifully written and filmed!"}, {"id": 28, "text": "Watched this movie on 11-7-20 on Encouragetv. I know DJ Perry and his acting is great. Josh Ponceman Perry does an outstanding job with his character, adds so much to this movie. Filmed in my home sate of Michigan. I cannot recommend this movie enough. Watch it and be amazed."}, {"id": 29, "text": "Wonderfully written story with very likeable characters. ALL of the actors were charming and fit their roles perfectly to help tie this story together. Chip (Josh Perry) will have you chuckling out loud delivering his witty and straight-forward lines laced throughout the movie. The wise Milo (Don Most) with his warm and calming lines to help Hannah (Melissa Anschutz) deal with her anger towards her abusive father's past. This movie is family friendly and tells a beautiful story of how with a little bit of love and help from our friends, we can learn to move past the things that hold us back."}, {"id": 30, "text": "Lost Heart restored so much faith in my own heart on how relationships, even at their lowest point, can be redeemed and built again in the most unexpected ways. Thank you to the whole cast and crew for creating this work of art that touches all of our souls in the deepest, most personal ways. Thank you. &lt;3"}, {"id": 31, "text": "Great movie! This movie speaks to everyone. The cast and crew did an amazing job."}, {"id": 32, "text": "This is a feel-good movie that is uplifting without trying too hard.Hannah Sweet, whose real name is Hannah Howard, is right at the point of a drunken career meltdown when she hears of her father's death. Reluctantly but having nowhere else to go, she returns to her northern Michigan hometown of Lost Heart to confront her past. As if the situation were not hard enough as it is, she finds that her abusive, alcoholic father had in her absence become a much loved and respected member of the tight knit community.Melissa Anshutz is so believable as a burned out country singer that one watches the whole movie before realizing she hasn't sung a note in the whole thing. The singing instead is done by her young niece Elsie (beautifully played by Taylor Dupuis, who also co-wrote the heart-tugging country song that voices the theme of the story). Don Most plays a somewhat unconventional minister whose gentle spirit provides a counterbalance to Hannah's unquenchable anger.It could all descend into maudlin melodrama, but the script by DJ Perry is filled with a gentle, character driven humor, and director Jesse Low keeps the emotional level honest without getting too heavy. One of the real jewels in this production is Josh Perry, an actor with Downs Syndrome whose character is integral to the storyline and is a delight to watch. Another jewel is SNL alum Victoria Jackson in a role far from her comedic persona, who gives a surprisingly touching performance as Hannah's mother.The small town vibe hasn't been constructed on a back lot. The location is real and fresh and displays the love the filmmakers have for their native state of Michigan. But while the look of this movie may be vintage, rustic Hallmark, this is not a formulaic film of contrived plot twists. The surprises that emerge come out of the humanness of the characters honestly played.Lost Heart is a movie about the soul and there are spiritual and religious themes at work, but in line with CDI's customary approach, these themes are broached in ways that make the viewer think and not cringe. While it never gets preachy, it does carry a note of uplifting faith. Might just have a tiny touch of the supernatural? Depends. Do you believe in UFA's--Unidentified Flying Angels?"}, {"id": 33, "text": "After seeing close to 200 2020 films, I had the honor of watching Lost Heart starring Melissa Anschutz and Don Most. This is a religious Dramedy with tons of heart and humor. Hannah (Melissa Anschutz) is a burnt out music star, who returns to her hometown Lost Heart, Michigan due to the death of her father. Her father wasn't the nicest man during her upbringing, little does she know he turned into a caring man taking in Chip (Josh Perry). Hannah has not forgiven her father, but after she confronts the demons and ghost of her past, can she forgive her father and regain her happiness. We also get a side plot with Elise who wants to be a singer that makes it big just like Hannah. However her boyfriend isn't happy with her dreams, which could lead to the end of their relationship.The only problem I had with Lost Heart was some of the side plot. I felt that the screenplay focused too much on Elise and her boyfriend, but that's a minor problem. Melissa delivers a fabulous performance as does Don Most. The filmmakers know how to balance Drama and Comedy. We get some emotional scenes with Chip as well as some really funny comedic moments the weigh each other out perfectly. The cinematography isn't anything groundbreaking,but it's well done, with pristine editing and lighting techniques. Lost Heart is not one to miss this year."}, {"id": 34, "text": "Director Jesse Low brings us Lost Heart. Lost Heart is about Hannah Sweet (Melissa Anschutz) a country music star. She is spiraling out of control and on a destructive path. Hannah returns home for her father's funeral. A father that's been out of her life for awhile. She had run away as a teenager and hasn't been back home since. Her father supposedly died after a UFO encounter. She befriends Milo (Don Most) the local pastor. He is a fun loving kind spirit who is into conspiracy theories and offers his help towards Hannah. He tries to get her back in her families life and even a seemingly impossible task of getting back in her mother Alma (Victoria Jackson) life. Hannah has no desire and just wants to pay her respects and not get involved with her family that she has fled from. Because of the circumstances she tries to pacify her true feelings and get along with everyone. Like her father she abuses alcohol and continuously drinks. Her father's drinking led to abuse of her. She keeps fighting it but her family and people around offer her love and condolences. They offer her guidance and she soon starts looking in the mirror and learns a lot about herself and what has put her were she is. Lost Heart is a great heartwarming movie perfect for the season. Everyone excellently performs there roles with such dedication and warmth you really feel the story that unfolds. What could be a very depressing sad story is delivered with such warmth that you will smile, cry and laugh out throughout. Don Most has a chance to show his versatility of his acting abilities. In my opinion one of his best and surely memorable performances. He commands in every scene he is and proved what a great actor he is. His smile warms you and his delivery really has you listening to every word he says. Josh Perry, who plays Chip is an amazing actor and really does a fine job here. He just makes you want to hug and hang out with him. What a gifted young man which I hope we see a lot more of him. Melissa Anschutz has a difficult and very demanding role but played it with such authenticity you really felt for her. Sometimes sorrow, sometimes anger. But always respectful of her brilliant convincing performance. The cinematography is beautifully executed throughout the charming town which is not only a back drop but brilliantly shot to get the feeling of the story. While a religious message is apparently the message it's not preachy but evenly played out so this can attract a wide audience. This movie overall is a feel good movie. It shows that no matter how far you wander and loss faith. If you have people that love and keep the door open you can always come home. While not a Christmas movie this is perfect for the season and a family oriented movie. Pop some corn and gather your loved ones for this wonderful movie."}], "reviews_amount": 35}