{"name": "Jiu Jitsu", "titleId": "tt09624766", "reviews": [{"id": 0, "text": "While everybody complains about the lousy action, the terrible state of Cage, I want to point out another reason NOT to see this movie. The camerawork, it's awful, then there is shaky cam (a lot of it), then they glued the camera to the guns, then unnecessary closeups, it's terrible."}, {"id": 1, "text": "I saw a short clip of this movie a few weeks back and it looked great, so I was really looking forward to it.Note: they scripted the lead actor to have memory loss to hide the lack of acting talent. He did great at nailing the confused dumb look though. The only one who could act was cage, and the plot and script sucked big time. The fight scenes felt like watching the power ranger series. Major let down"}, {"id": 2, "text": "Someone did it, they made a movie actually worse than the new mutants. You figured that someone who makes a movie about a fighting style will make it youknow action, Japanese, etc idk instead some big brain at holy wood made this a uh predator movie ripoff i think? It makes no sense, I read the plot this morning on imdb but when I actually watched the movie itself, I still didn't even get the whole plot of this movie. The effects are laughably bad, they even copied Ang Lee's Hulk out of all things and used the comic transitions (at least Hulk was a comic book character so I could see what they were doing but they added it here FOR NO REASON AT ALL). The camera work for the action is AWFUL, it even spins completely and reminds you the time when you were a kid and you were spinning the thingy at the playground super fast then you layed on it. I remember one time it was even first person out of nowhere! That predator creature is literally the predator who has healing powers but looks more like Yoshimitsu from Tekken 7 who comes out every 6 years (why its 6 years i guess doesn't matter, maybe he gets a 6 year break) and we don't even know his motivations or his endgame at all. The final fight of the movie even reminds me of mortal kombat Annihilation (which is funny because an actor in this movie was a stunt double for liu kang in MKA) and it's ridiculous, you're telling me that no one EVER tried destroying the portal or guarding it or blocking it or sending the predator ripoff back into the portal? The acting is also terrible and Nicholas Cage shows up like 40 minutes in the movie then gets killed off after knowing the creature for years and doing nothing. Conveniently, a drink that literally mutes pain is just in time so this love interest (the way she was introduced literally shows her popping out of nowhere) doesn't die but oh no like any of the other characters needed that. The new mutants (while very bad, don't even deny it) at least had a tone which was horror or teen drama in a way, fit the characters that were in the movie but this movie shows in characters that for the most part don't even fit. I'm surprised this was even made, i wonder what the budget was. It says a lot when your movie is lower than Batman &amp; Robin on IMDB"}, {"id": 3, "text": "The effects are ridiculous, the story disjointed and making no sense, the acting is horrible. I mean, I would love to be able to say except Nicholas Cage, but he is also really bad. And the cast is filled with actors you've seen before and respected for their work: Cage, Rick Yune, Tony Jaa, Frank Grillo, Juju Chan. I mean, they were never Shakespearean thespians, but they did action well. Guess what: the fight scenes are bad! I mean, this is like someone made efforts to mess this movie up! The only way one can enjoy this is being drunk out of their minds and laughing all the time."}, {"id": 4, "text": "Writer's inspiration was Alien, Ninja Turtles, Mortal Kombat, Guyver. However, for some twisted reason, he decide to put all that into one movie. There is no story line, no motivation for main characters' actions, no cinematography. The only beautiful shot was when two of the characters were walking across a field, shot from above. No acting, despite Cage's honorable attempts.I would forgive all of the above, if, atleast there was real Jiu Jitsu. As the name states, this movei is about the martial art. However, most of the fighting was the regular, Holywood style, flashy fighting. Here and there there were some Jiu Jitsu specific moves and that it.Please avoid wasting your time."}, {"id": 5, "text": ".. I'm still waitingI can disregard the lame sci-fi and Predator look-alike stuff.I can live with the lousy sound and scoreI'm okay with the blood being painted on afterwardsI just want to see some nice well choreographed Jiu Jitsu.But alas - the camera crew has apparently never filmed martial arts before. And - the stunt choreographer didn't get the memo that the style should be Jiu-Jitsu."}, {"id": 6, "text": "I don't mind hokey, contrived plots if the action's good. But the action isn't good.This movie is a complete waste of time. Go watch some old Jackie Chan movies if you want great fights, or old John Woo flicks for brilliant, original fight choreography. Don't waste your time on this garbage."}, {"id": 7, "text": "When I decided to watch this movie I knew it was going to be bad, but I thought the script/story would be bad, not the action and cgi as well. This looked like a low budget, fanmade cgi. The action scenes, besides being unrealistic and excessively long, gets boring to the point where you actually want to skip them. I couldn't finish the movie, is that bad."}, {"id": 8, "text": "Some of Nicholas Cage's movies are so weird that they are worth watching (like Color out of Space) this is not one of them. It is weird but almost to the point where there was no though behind it at all. Aliens? Video Game? Comic-book heroes? I'm not sure, but the result is laughable. Nothing here for martial arts fans, nothing for sci-fi lovers absolute facepalm this one. It's cringe from start titles to end credits. Bad acting, fights choreography is horrid, story? non-existent. I don't think you'd even get a good laugh out of it, I sure didn't.Don't waste your time on this one. Exact score: 32 / 100"}, {"id": 9, "text": "One of the worst movies ever!!! We all know Cage´s movies are a straight-to-DVD and this is just another cheap Cage movie. I couldn´t give it a zero rating because there is no choice for that. I wanted to see it because of Tony Jaa´s martial arts talents but the movie does not let you enjoy Jaa´s fights unlike his own movies like Ong-Bak or Tom Yum Goong (a.k.a. The Protector). This movie also reminded me of another awful movie Beyond Skyline which I also wanted to watch because Iko Uwais´martial arts talents but these two movies have the same bad script, bad acting (Frank Grillo in both,btw),bad cinematography,bad sound, etc. You better stick to Tony Jaa´s and Iko Uwais´ previous movies (The Raid 1 &amp;2) which are awesomely choreographed."}, {"id": 10, "text": "Watch this ONLY if you like martial arts films! Story sucks big time, acting kinda sucks and movie is kinda boring. But, the fight scenes are well made. And thats about it..."}, {"id": 11, "text": "OmG there is not even a single thing good about this film .terrible story ,worst direction even a bunch of worst actors along with Nicolas cage who again proved that he is becoming worst actor day by day.Tony Jaa what a waste .terrible screen presence, terrible action .maybe the issue with the direction but still .come on man how can you be so dumb an actor Please don't waste your time or money on this film .not at all recommended"}, {"id": 12, "text": "Nicolas Cage and Frank Grillo are in this movie, but it ain't a guarantee this is a good movie. In fact, this is a bad one! DO NOT waste your time watching this movie!"}, {"id": 13, "text": "The action is bad, Frank Grillo is wasted, Cage Rage is absent, the plot absurd but this one is Nic Cage's those kinda films where u know that it's gonna be bad. Sometimes Nic Cage's films r like jackpots, especially when his Cage Rage n wide eyeballs r present (Mom n Dad, Mandy). The film becomes a double jackpot when Nic Cage is beaten or tortured (Wicker Man). So viewers shud be careful before watching Nic Cage's films. My earlier review which got more than 50 likes got deleted without it containing any spoiler, abusive or irrelevant stuff. This shows that there r many Nic Cage haters. Its agreeable if people hate Mel Gibson for his racist comments but leave the poor Cage alone man.Coming back to the film, the acting is atrocious. The lead actor cannot act, the editing is lousy, the action choreography is duds n one of my fav actor, Frank Grillo is not given enuff screen footage."}, {"id": 14, "text": "I would not recommend this movie. The story line and the SGI are not enough to hide the cheesy acting and bad directing"}, {"id": 15, "text": "I don't know why Nick Cage keeps doing these cheezy movie roles... this is the worst on yet... Hope he works on getting his quality up... no more national tresure or face off 2, con-air 2? he used to be my favorite actor... good thing Bruce Wills didn't do it... Up your game Nick! Get Uncle Francis to help you!"}, {"id": 16, "text": "Cage is again stuck in a crappy film . His acting is good but the script directing cgi all suck And a list of no name actors to boot If your going to hire Nick Cage make it worth the audience's time !"}, {"id": 17, "text": "Only watched it for Marie Avgeropoulos, but there was no point to her character and then she was just killed off. The first half of the movie implied that she would be a main character and then she died a background character death. Also everything else was trash and made no sense."}, {"id": 18, "text": "So 'The Predator', dressed in 'Necromonger' garms dukes it out with 'The Assassins Creed', every 6 years in a 'Battle Royale' for the 'fate of the world'. The 'Last man standing' is a 'Kickboxer'. Sound familiar?"}, {"id": 19, "text": "To chevolek: way too harsh and this film is no way a 1* effort. You're just mad for some reason or you simply haven't seen enough actual trash 1* films.This movie is at least a competently executed popcorn guilty pleasure romp.Yes, excessive stylized comic book martial arts.Yes, cheesy but not vomit-inducing CGI.Yes, there are about a million better martial arts or sci fi films out there.But really...how many actual sci-fi/martial arts mashups? The One? Timecop? The Golden Child? The Last Dragon? Big Trouble In Little China?OK, those last few are more fantasy/martial arts, but still....Nice to see Nic, Grillo, Jaa and Yune all the same.Arnie's not sweating but this one is digestable fare with the right mindset.An OK 6....YMMV...."}, {"id": 20, "text": "I don't know were to start with this. Horrible writing. Laughable script and a plot you would expect from a juvenile film maker. This was green lighted because Nicolas Cage was in it."}, {"id": 21, "text": "So much potential. I mean Tony Jaa which was awesome in Ong Bak, The Protector,in this movie, his talent is wasted. With a title like Jiu Jitsu, the choreography of the fights should have been close to perfection. Well... far from that. The fights don't have impact, don't have fluidity, don't have any intensity. The fx are extremely bad (why would you add fx blood, if is not needed!?!) There's Nick Cage playing this crazy\\ excentric martial arts master. ( I ve read all theses articles that say Nick Cage can fight ; in this movie, his fighting skill are atrocious). If you want to watch a really good martial arts movie stick to : The Raid, Blood and Bone, Legendary Assassin."}, {"id": 22, "text": "Camera work shocking, holes in the so called story. Watched due to Tony jaa being in it but that was disappointing. Shame"}, {"id": 23, "text": "I achieved to watch for half an hour...Couldnt swatch it any more,its bad and it obvious..."}, {"id": 24, "text": "I don't like reviewing any movie that I haven't watched fully, but this one was just too awful to stick with, I think it was 10-15 mins before I had to turn it off.Felt like the budget was blown on the actors and they didn't have any money left for the multiple takes to get a scene right or a proper special effects team (looks like it was done by a couple of high schoolers). The issues were further magnified by some odd/experimental camera work choices that did little to hide mistakes."}, {"id": 25, "text": "Predictable storyline, Messy editing, Terrible direction and no real story. In short, it's 100 minutes of my life that I will never get back."}, {"id": 26, "text": "I can't understand why anyone would take the trouble to make such a terrible movie. The acting is bad the story is worse and there is no logic in dialogues at all. Don't waste your time."}, {"id": 27, "text": "If it was 1986, this would have been fine, hell, Even if 1991, definitely would fit in with all the cheesy martial arts films of that area. but in 2020, wow. The special effects are hilarious. And the big name cast too? surprising."}, {"id": 28, "text": "This is the worst movie of all times, I don't know why Nicolas Cage doesn't just give it up and find something else to do that would be good for him. What I hated the most was that Frank Grillo was in it, such a great actor brought down like that and to drag him into it to make it better was really a low and a cheap move from the director whomever he is."}, {"id": 29, "text": "How can you go about making an entire movie called Jiu Jitsu without actually knowing what jiu jitsu is..."}, {"id": 30, "text": "Theres nothing positive about this movie Story, fights, the music.. all was really badIt's really a bad plot, nothing makes senseI dont give it 1 for the sci of the alien guy"}, {"id": 31, "text": "The huge problem with the movie is the title there is at max 1min of jujitsu, lots of Kung fu and even sword fighting. The title drew me in, the low budget alien and terrible story that has no reference to the title and terrible acting settled this as a bad movie. Nicholas Cage is one dimensional and honestly an actor getting worse with age. I love Frank Grillo such ashame he signed on for this movie, no doubt from the promise of good fight scenes. Those scene lacked real world style and took more From Asain stylisted fighting. DONT WASTE YOUR TIME."}, {"id": 32, "text": "Was ready and excited to watch a film with Nic Cage and Tony Jaa, Unfortunately after 25 minutes I realised it was low budget and wasn't 'grabbing' whatsoever. I sat through til the end and I wouldn't advise anyone watching this."}, {"id": 33, "text": "This is a step up from the normal straight-to-DVD sci fi schlock I was expecting. It's not great by any means, but my popcorn certainly tasted better while I was watching it.Nic Cage was a supporting role, and really toned down while still being Cage enough to meet some expectations.I did like the premise, but it borrowed a lot from movies that have come before it. Enough of its own thing not to be insulting, but not original enough to disguise the stolen bits."}, {"id": 34, "text": "Yup, CRAP! A cheap, stupid clone of Predator, with a Jiu jitsu twist. What can i say more. Watch it only if you belive that an unarmed man cat beat the crap out of 10-15 men ARMED with firearms."}, {"id": 35, "text": "Safe yourself from 2 hours of pain. I love Sci-Fi, but this movie has absolutely nothing redeeming about it. Horrible acting - like............ I thought the lead was mentally handicapped until he spoke about 10 minutes into the movie. Seriously.I have NO IDEA why the alien comes to Earth - they never explained any of the backstory so it's basically confusing throughout.Stay away from this movie."}, {"id": 36, "text": "This is a movie where all the costs including cast and marketing did not exceed 1$ as a budget. It is so bad to the point that in one fighting scene they started punching the camera man and shoot him with fake bullets."}, {"id": 37, "text": "Try storylines of which are not stereotypical and perpetuating divisive racial motives! Where is your honour in real life! I can only imagine the type of individual that enjoys this lacking...."}, {"id": 38, "text": "I really understand they're tryin to make kind of martial art as a maincourse, but heading a bunch of special forces with barehand, in a daylight, unless you're bullletprof, just dont get my logic. even i cant stand watching more than the first 10 minutes. poor script, wasting a lot of good stars"}, {"id": 39, "text": "Can someone explain how the first 15 minutes of this film contain 6 hours of fight sequences?Couldn't take any more, switched off after about 20 minutes...way too much fighting!One for the die hard fans of whoever these MMA stars were."}, {"id": 40, "text": "This film start with a man Jake running away from the comets shooting at him, he fell into the water, and hitting his head at a rock scene! As turnout, this film is about Jake need to defeat the alien warrior Brax, who appear every six years, to save his world and his comrade! Entire film full of boring conversation, and annoying overuse scene! Such as, overuse of the treatment scene, overuse of the slow motion somersault scene, overuse if the spinning scene, overuse of the changing POV scene, and overuse of the heat detector view scene! Make the film unwatchable! All the action scene have blood at certain point, but overall portray by sideways, shaky, and messy! Make the film dizzy to watch! At the end, Jake put a grenade inside Brax body and kick him into the portal to kill him! That's it! Another disappointed film!"}, {"id": 41, "text": "This movie is just bad really really bad. What ever happened to Tony jaa? Goes from 'ong bak' and 'warrior king' to america and goes completely down hill. Has some good actors that I actually like naming Frank grillo as one, but wow this is just laughable bad."}, {"id": 42, "text": "I was out after 20 minutes, when I saw guy outrunning automatic rifle bullets, and fake punches so bad that it's the first time in a movie that I have seen them that bad."}, {"id": 43, "text": "What just happened ?To say something positive, the cast is suprisingly decent for a B-movie. And at least they tried to put some style (POV, comic-style transitions...etc). But everything is sooooo awkward !Camera work : The shaky-cam, the slo-mos...The fight scenes : I've seen dozens of one-man army martial arts movies (John Wick style) in the last few years. I can say, without a doubt, that this one has the worst goons I've ever seen. I don't exagerate, there's a scene where some unarmed dudes fight a dozen armed soldiers in an open field. I'm not kidding, the soldiers run towards the dudes, as if their machine-guns were freaking swords. It happens many times in the first act of the movie, totally insane !!Alain Moussi has no acting skills, like... not at all.The fight scenes with Nicholas Cage are hilarious. They barely try to hide the stuntman lol.The editing is terrible.The story is insane.It's not even a so-bad-it's-good-movie. It can be enjoyable if you're half drunk."}, {"id": 44, "text": "Right from the beginning it's bad acting. All fight scenes are over rehearsed and really cheesy. Guy stands there while getting beat up like a punching bad until the kick to the torso finally happens. Guys falls really slowly to the ground with silly facial expressions. Overacting galore. Very similar to early martial arts movies that are dubbed. Awful awful movie."}, {"id": 45, "text": "Basically Nicholas Cage is the modern day Steven Segal :("}, {"id": 46, "text": "Seriously don't bother watching this movie. The story line is ridiculous, the changing camera view is distracting and has no purpose and it's reminiscent of Predator without the awesomeness."}, {"id": 47, "text": "Stopped watching after the first fight scene as it looked like it was filmed on a go pro following every jump actually made me feel sick. Maybe 10pints might make the eyes focus better"}, {"id": 48, "text": "It would be a 10 star movie if they had taken every decision and done the opposite"}, {"id": 49, "text": "Pure garbage. What are nicholas cage and tony jaa doin here? They deserve a better movie."}, {"id": 50, "text": "I don't normally write reviews... In fact this is my first time doing so... And i am gonna warn anybody that sees this,not to waste your data on this movie it ain't worth it. Everything in the movie is poorly done. Thank you"}, {"id": 51, "text": "Absolutely non sense, all about fighting an army that has every skills apart weapons and a plot. If are cooking and you feel lonely.. This movie ain't good even for that. It might ruin your cooking."}, {"id": 52, "text": "Agreed with the last reviewer. Total waste of time. Not expected from a movie that had Nick Cage in it."}, {"id": 53, "text": "This movie is Predator soaked in dusky clouds of marijuana, gagging on mouthfuls of hash brownies gumming up the dialogue, floating face-down in the light-leak swimming pool of a cesspool plot."}, {"id": 54, "text": "Since the days of Predator, they are coming with any genre for fight against aliens. Nic Cage has caged himself with so many budget flicks (must be desperate for $) to make himself c rate actors. plot and actions are so boring.....hard to keep it interested in finishing it. Where is that 6 pack I ordered?"}, {"id": 55, "text": "I have wasted valuable time that can not be returned.. I am a fan of Cage movies but this is Bad... The acting, the dialog hell they even managed to mess up the scenery."}, {"id": 56, "text": "Gave it 20 mins and had to turn it off.Seems to me that any Cage film these days is this way, no plot or character building. simply a waste of time. DO NOT BOTHER!"}, {"id": 57, "text": "I love martial arts films, but this was the pits! Every single fight had cheesy slo-mo shots every few moves! Story line was choppy, not strung along very well at all &amp; left you with more questions than were answered by the story line. Acting was bad &amp; after 15 minutes of starting the movie I started to skip though but it didn't get any better!"}, {"id": 58, "text": "33 minutes in and it still fails to captivate me. This is NOT an A or a B movie... hell it's not even in the A - G category. Disappointing and a waste of time/money, that's all i can say!"}, {"id": 59, "text": "No story ,full of fight scenes, poor acting .I expected much from this movie and i was disappointed"}, {"id": 60, "text": "Dire acting. Worse CGI effects Stupid story (forgivable if everything else was fun) Too much slow-motion. Shaky cameraThis film is an embarrassment and not even Nic Cage in a less crazy mode than normal can save this. It is simply atrocious."}, {"id": 61, "text": "How did this movie suck... let me count the ways. To infinity and beyond It was all bad... Stunts, acting, camera angles, choreography music score. cheap ass comic book page throw ins. I gave it 15 minutes and winced the whole time. This is what fever dreams are made of. Wait.. i was wrong, fever dreams are better."}, {"id": 62, "text": "For the scenes involving Cage - he simply looks bored. When bothering to act he reverts to the manic face he has used so many times before. From the premise - aliens come to our world to fight the best fighter and if the best fighter looses we all loose -- to the lack of even basic acting capabilities of the fighters (including the lead) this is a very bad production. It is rare in movies of this kind that the fight scenes are poor -- in this case you can see the planned missed hits and the faked reaction of those supposedly hit. Yes money was spent on special effects - but these do not matter if the plt is weak and the acting appalling. However, I agree with other reviewers the DP and his crew did a poor job -- making the whole thing very far from believable. For the bulk of his career Alain Moussi has been a stunt guy -- perhaps we would all have been better served if he had stayed in that role. While Marie Avgeropoulos is more than pretty enough, she too comes from a stunt background and adds little to this poor film."}, {"id": 63, "text": "Full, of clichés, poor timing, horrible dialog, mediocre fighting and a paper thin storyline. I'm embarrassed for Nicolas Cage sake."}, {"id": 64, "text": "A shoddy storyline, with useless script, delivered poorly and acted terribly. I wasn't expecting much from this film, with Nicholas Cage as one of its stars and I definitely wasn't disappointed. From start to finish you're hoping for some sort of drive to keep watching, but with the action scenes so obviously choreographed and weak, you're never going to get your reward. How films like this get the production costs is beyond me. Maybe on paper this looked like a good idea, but surely someone saw this post production and thought, good god this is awful. Even Tony Jaa couldn't safe this utter pile of crap."}, {"id": 65, "text": "Oh Nick Nick Nick, bruh, how low can you go? I can almost forgive the crappy CG, wooden acting and long pauses between spoken lines almost had me pulling my hairs out. Yikes! this is really really bad, even for Nick's recent movies. LOL. Where is Cher when you need her. Nick (HAND SLAP), snap out of it Nick!"}, {"id": 66, "text": "The acting was just brutal to watch. Everyone was super stiff and the storyline went nowhere. It tried to be a Predators/Fighting Action movie/RomCom all in one. Pick your lane! If they really wanted to be Predator Lite and failed miserably. The red flags were there when I saw Nicholas Cage was in it. You know there are just red flags that you know a film will be bad. Nick Cage if one of those flags!!! What of waste of martial arts talent in Tony Jaa."}, {"id": 67, "text": "Which is a crying shame since since Jiu Jitsu was a uniquely modified form of judo that Japan popularized after WW2, and it would have been nice to finally give it a movie all its own. Speaking of missing things, ditto for the plot, the acting, the audience interest and the entertainment value. Nice to see that Tony Jaa is still working, though."}, {"id": 68, "text": "The trailer looked good but don't be fooled by that, this movie is a lame predator look alike rip off and they keep talking about having jiu jitsu but don't explain what it is and and make it out to just be martial arts but even people that dont have jiu jitsu have martial arts. They couldn't decied how to film the movie they kept filming in first person then going back to the camera sitting still and the having the camera fallow the action it was just jarring. The choreographer seemed like they never seen any martial arts movie before cause the fights seemed like they were between preschoolers and the fight between the alien and the humans could of ended in the first 30 mins of the movie cause they noticed it took some time for the alien to heal after taking a life ending wound but they just stood there and let the alien heal instead of cutting his head off, they also said the alien wanted to have a honorable fight but since he could heal from any wound even when the fighter defeated him in a fair fight he would just heal and use a cheap move to kill the human and win the fight that way."}, {"id": 69, "text": "I recently got infected with Covid and had to be hospitalized. For weeks, I laid in a comatose state, struggling to breathe. I was plugged to a machine that kept me alive while I suffocated and worried my next breath would be my last. Around me, anonymous people died, their lives snuffed as though they had never even existed.Watching Jiu Jitsu is the worst thing that ever happened to me."}, {"id": 70, "text": "....it's picking the right projects he lacks education in. Sometimes he sides on the Eric Roberts, Val Kilmer, Michael Madsen side. Then he becomes the real Nic Cage once in a while in films like Mandy and Color Out Of Space. He's a conundrum. This movie is not. All I can say is it's a cash grab. All that does is make you look worse. Do another Lovecraftian film or something mainstream (ugh!) I suggest you skip this one. It's worse than bad."}, {"id": 71, "text": "I'll start by saying it was awful for martial arts movie fans , i felt like i was dying when i watched it , full of garbage fight scenes , terrible acting , poor directing and bad cinematography. I don't even think that pot or booze will help you go through it . This movie hurt my eyes"}, {"id": 72, "text": "3 stars because Nicolas Cage is in it.... he's like the grinch of action movies...."}, {"id": 73, "text": "What was that?Was there a contest on the worst 2020 movie?Speechless..."}, {"id": 74, "text": "Everyone is mentioning Nicholas cage he is not a bad actor but he took the direct to video path a few years back.The rest of the cast are your usual rejects, a part from Tony Jaa who still gets into theatre movies, and Frank Grillo who is great the rest are pretty damn awful.Its called acting for a quick paycheck. The creature looks terrible too."}, {"id": 75, "text": "Behold, the very first film shot by feet in the history of cinematography. The script was written using the legs. Legs starring. But if you're thinking of Sharon Stone's feet from Basic Instinct or Julia Roberts's from Erin Brockovich's feet, you're wrong. These are hairy rough legs of progress, stamping into our souls with greed."}, {"id": 76, "text": "So it's a great, fun idea for a movie but the director is crap. Lots of first person viewing like from the actors eyes. But it moves so fast it's stupid. Then just as quickly you jump from the body and are viewing from outside. All I felt was a lot of jumping around with no good continuity. Not horrible as it's a great concept. But executed like crap. I won't be watching watching what this director does again."}, {"id": 77, "text": "I've seen a lot of movies, i always give movies the benefit of the doubt.So i watched, i think, meh, maybe the fighting is.....That's it. i'm not going to spend more words on it. When you watch it, you'll understand this review."}, {"id": 78, "text": "Even for Nicholas Cages standard this is just awful. Couldn´t finish it"}, {"id": 79, "text": "Why this movie was made??? Better go to sleep rather than wasting time on this movie. Sloppy is the word. Nothing good about this movie. Any one reading this review please skip this movie."}, {"id": 80, "text": "I swear to God I can't believe that someone thought to collect all the garbage scripts,actors,photographers in the world and made this rubbish Unbelievable!!!!"}, {"id": 81, "text": "Jaa in Muay Boran, Muay Thai, Aikido, Judo, Wushu is truly a credit, 1 Donnie IP Man Yen 2Jaa 3 the Grandmaster Zhang Jin all somewhat different disciplines! FRANK Grillo?? Can't wait for Monster Hunter..Jaa does his native Thai discipline proud and put it on the map!"}, {"id": 82, "text": "Burn your money and sit in a chair for two hours. You will be much better off than watching two hours of predator + kungfu + GI Joe + buddhist monks. I do not think the director knew what Jiu Jitsu is. I expected nicolas cage to save this mess of bad acting and cheap hollywood stunts, well he only added to this mess."}, {"id": 83, "text": "The ending credits is a list of people who should be banned from making another movie again. What a waste of resources...."}, {"id": 84, "text": "One of the worst movie of Nicolas.. Never thought he will do such movie.. If you don't wana regret then don't watch this movie..."}, {"id": 85, "text": "Can't begin to explain how terrible this movie is, no redeeming facets at all. Nic Cage must be desperate for money."}, {"id": 86, "text": "I do not know why Tony Jaa has acted in this low-level film, from the director and so on. Too bad the cost and time spent on this movie. Maybe this movie will entertain the pet with full respect. I do not recommend watching this movie to anyone. Just a star because of Tony Jaa I hope Tony Jaa Do not end up with Nicholas Cage acting."}, {"id": 87, "text": "This is my 2nd try of the review - first one was declined citing unspecified violation. I guess it was about a... well, I'd rather not say. I decided to write it again to warn people off. I think this is the worst movie I have ever seen. I am not saying that lightly. Nothing here makes sense - plot is just ridiculous, which might have been some excuse if it was just a {censored} movie - you'd be here not for the dialogue but for the action. But even the action scenes were... Oh boy. They were simply bad. Add bad camera. Add bad slo-mo. Add some Predator-ripoff. Add obligatory unfunny comedic element. No. This move is not even so bad it's good. Avoid. Really."}, {"id": 88, "text": "Where to begin? Bad camera work, the story was absurd, and the costume of the alien was very poorly made. An ancient order of jiu-jitsu fighters? There was little to no ju-jitsu in the movie. I think Frank Grillo is a great actor and quite versatile, however he should pass on projects like this in the future."}, {"id": 89, "text": "It was a junk movie. I do not know why Nicholas Cage and Bruce Willis accept acting in these films? Is it just a financial issue?"}, {"id": 90, "text": "Remember the great movies from Nicholas Cage and when all.his movies were hits? Well this isn't that. Another in a string of bad low budget movies makes you think is Nicholas doing favours for the mafia to make low budget movies to help them wash money. Bad acting bad director bad predictable dialogue bad cinematographer almost sophomorish quality.... watch high or drunk or if you cant sleep at night because this movie is better than Valium. It will put an elephant to sleep."}, {"id": 91, "text": "This is as bad as that Joker movie but at least that had acting in it, no jiu jitsu , no acting all predator and mortal combat rip off for my god an army intelligence officer doesn't have intelligence officer on a tag under their name tag they definitely cast cage so they could call it a write off that could be the only reason to make this trash. Im still angry that this dumpster fire was even conceived.... I literally want to kill my self now..."}, {"id": 92, "text": "Nicholas Cage must be really getting desperate to star in these B movies..... when you see him and Frank Grillo in a movie together you know that's a formula for a craptastic movie experience! This formula did not let me down for this movie was really awful. Easily one of the worst movies I have ever seen... poor story, wacky one dimensional characters, shaky cam, poor acting, bad lighting .... really half the time you just wondering WTF is going on! This movie was really a patchwork of poor choreographed fight sequences strung together with some comic book panel interludes. You have been warned!"}, {"id": 93, "text": "They must have spent all of the money on Cage because they sure didn't spend it on editing. It gave me new appreciation for good editing because this wasn't it. It really could have bean a fare story and the plot was fun but the Tech SUCKED! I really feel bad for Marie Avgeropoulos being attached to this. Cage not so much, He's Cage and will always be Cage an America Popcon. He always lands on his feet. I am surprised he didn't make them produce a better product actually. He knows the good stuff. I am actually very upset because this could have been a good movie with a couple mores hours in the production room."}, {"id": 94, "text": "Love Cage, Tony, Grillo however this movie is absolutely horrible and unwatchable"}, {"id": 95, "text": "I still cant believe that Nicolas Cage agree to star in this movie"}, {"id": 96, "text": "Terrible directing , no story... watch it only when you have nothing else to watch or do"}, {"id": 97, "text": "Ok lets be clear, this is a really bad movie that only people who enjoyed watching Steven Segal movies because they were so stupid. It's a Predator X Mortal Kombat of some kind, with a scenario that makes no sense at all, poor acting, and bad sfx. The director is actualy experimenting some things, like the change of point of view during a fight, (an interesting idea, but it doesn't work at all for the movie), or the very strange first fight where the sound effects seemed completely off. To me, this enters the category so bad it's good in the way that if this was a drawing, it would have been done by an autistic 8yo after you'd have given him 20 coffees (oh, and he has no pencil, he is using mud to draw). If you don't take it seriously, expect something bad, take it to the second degree, this should be quite entertaining !Oh and I have no idea why they picked the name Jiu Jitsu for this movie, there is absolutely no jiu jitsu here."}, {"id": 98, "text": "Definately cage, jaa, gerillo and many big stars in this movie just being display for sale"}, {"id": 99, "text": "Watch the movie ten minutes in, I knew it was going to be a stupid movie ever, Cage what is wrong with you"}, {"id": 100, "text": "The trailer for this movie gave me so much hope for it. Nope. Not even a couple of big name action stars could save this movie. Alain Moussi has one, maybe two emotions in his acting range. To make him the main character over Tony Jaa or Nicholas Cage is a joke. The fighting scenes looked like a round of playfight on the schoolyard, it didn't even seem like the people getting punched and kicked even felt anything. The CGI.......wow. The first scene of the movie says it all...expect awful CGI work right from the get go and for the rest of the movie. The blood, bad CGI. The alien, bad CGI. Not to mention the thousands of camera techniques used to shoot the movie. It's like the director came fresh out of college and was like You know what? I'm going to use every single camera trick I learned and apply it all into one movie. If you get nauseous easily, don't watch this movie. There are at least 5 instances of the camera going 360 for no reason at all. First person to third person to omnipotent person in the same scene also gets annoying really fast. And as for the story itself.........NOPE! There are so many plot holes in this movie it doesn't make any sense. Plus good luck trying to figure out what's going on until at least a third into the movie. At no point do you ever get invested into a character, except for MAYBE Nic Cage's death, but you only feel bad because you like him as an actor. The only saving grace of this movie was Eddie Steeples' character. Trust me, save your money, or at least wait until it is free on a streaming service. I wish I could get my $7 back."}, {"id": 101, "text": "Since I like to watch martial arts movie I still enjoy it. It's 50/50 for me"}, {"id": 102, "text": "This movie is a generic predator rip off (Some scenes are a complete copy) with some comic book, then some inexplicable first person shooter with what can only be described as mid 1980s effects. The acting is amateur at best. With no continuity or actual story... Sounds confusing? It is. Its like click bait for the action fan. I failed to watch the whole movie and think I got about 20 mins in. Otherwise its a great movie if you want to tie someone to a chair and do a clockwork orange on them and torture them. Nick Cage's franchise takes another hit of many bad hits."}, {"id": 103, "text": "It was so bad that almost all the way thru I came to read reviews to see if I had a unpopular opinion. I wish I would of read the reviews first. This movie sucks, filmed like the cut scenes from a video game , acting is about as good too . They got the lighting right. That's about it"}, {"id": 104, "text": "Movie is as BAD as it could be:Awfully scripted conversations; Bad CGI; Bad Acting; Bad Plot; Bad comics-inspired visuals; Bad fight choreography; No Jiu Jitsu AT ALL; Worst Antagonist - Mix of Karate Kid, Predator, Master Chief, Snake-Eyes and God knows what more...Couldn't find anything in the movie that can be called normally done.Though it is soooooo bad, was 100% enjoyable to watch in a company, while drinking bear and commenting God Its really BAD :))))))))))))"}, {"id": 105, "text": "Can't get worst than this.... Graphics- 3rd class Acting- like not interested Choreography- like they want it to be a flop Plot- Predator, mortal Kombat and many more are with same story but better movies."}, {"id": 106, "text": "I do avoid nic cage movies but after seeing a couple of decent reviews for some of his latest goings decided to give this a go as it was a action martial arts with Tony jaa. Oh boy, definitely new low for cage and really unwatchable, terrible acting, but for me the camera work was the last straw after the second fight scene, just unwatchable."}, {"id": 107, "text": "Awful movie, tried to watch this as it was a martial arts action movie with Tony Jaa. Normally avoid nic cage movies but I read a few of his recent films got okay reviews so tried this one and definitely a new low for him. Couldn't last 15 minutes."}, {"id": 108, "text": "Its just 1st Predator movie scripted little longer on a chinese version. Predator vs Kungfu fighters. Even The same predator scanning methods are used"}, {"id": 109, "text": "No, really. Who was drunk when this idea came up?Cage and some Jason Bourne wannabe (watch the 1st 5 minutes) battle some Predator knockoff...Filled with typical Cage-esque moments. Even a slight Face-Off reference.All in all it reminded me of 10thbgrade Drama class. But with better martial arts."}, {"id": 110, "text": "Sh#t actors: checkSh#t direction: checkSh#t plot: checkSh#t camera work: checkAbsolute sh#t movie: CHECK!!!!"}, {"id": 111, "text": "Wow this film rips off or pay too much homage to Predator but with hand to hand combat. Nicholas cage gives his usual neurotic Nicholas Cage's performance. He is watchable as ever. The fight scenes (pov) are the highlight of this film but the plotline is stolen and cannot rate this higher than what I gave it. Ps I do agree with the reviewer that wrote this is best watched under the influence of alcohol."}, {"id": 112, "text": "The action scenes are impressive. We can see that the actors know how to fight. The problem with the movie is the visual. The action scenes do not seem realistic. I got bored watching some scenes. I have seen Eddie Steeples deliver pretty jokes on other shows, but the jokes from the movie suck!! They also failed on bringing comedy."}, {"id": 113, "text": "This only gets 3 stars from me for some of the Tony Jaa fight scenes, and the funny black dude with the afro who reminded me of Mike Epps. Not sure how they got Tony.. and Frank Grillo + Nic Cage had small roles they looked like they didn't want to do in the 1st place but wanted a quick paycheck. The movie itself didnt make much sense and the Predator samurai was poorly done. Not sure why the 9 or so warriors just didn't team up, and could've killed him within 5mins. It clearly didn't have to be 1 on 1 battles since there were scenes of 3 of them fighting the robotic alien samurai. An old lady with a shotgun almost even killed him. Not sure how i finished the overly long 1hr 40min movie, or why it is distributed by a big company like Paramount... At least i saw it free."}, {"id": 114, "text": "Real shame, expected way more. Promising cast but......everything sucks. DP did a good job, at least it looks cinematic. Loved the animation transition from cartoon to the movie. Other than that..watched about 10 min then got really bored and decided to stop. FYI I rarely stop the movie and love martial arts but this....so bad. Story sucks, Alien looks stupid, effects are obvious After Effects, Martial arts is just too much and really boring..seen before. Total waste of time."}, {"id": 115, "text": "This movie is the worst movie ever, and if you must watch it then please, pirate the move because it does not deserve your hard-earned money, especially in a time like this when no one has any. (but thats Illegal so just don't watch it) so please, if you must watch it then you must pirate it because everything about it is terrible.(but thats Illegal so just don't watch it) in fact, who ever made this movie should have made it available to stream for free. and Nicolas cage does not deserve to act in cinema in 2020 because he is terrible!!!!!!!! It dose not even deserve the one star rating."}, {"id": 116, "text": "I for one enjoyed this film. I don't know why people have to moan and rant about it, if you don't like the film after the first half hour or so, watch something else you get me!? I love martial arts films!!! Cannot wait for the next Kickboxing and a possible Jiu Jitsu sequel."}, {"id": 117, "text": "This movie was good Nicolas cage and the rest of the cast did awesome, nothing but a good martial arts flick"}, {"id": 118, "text": "Since i saw the trailer of this movie is was pretty happy! i really liked the cast and thought this would have great potential. Also the story was kinda like Predator it still gave me something to look forward to! But when i started watching the movie i honestly didnt get fat, from the moment the first fight scence start you can see how fake the punches are, and they put way to much slow motions in the fights so you can see they arent hitting each other. And the fake blood and bullets just made it even worse in my opinion. I was honestly disapointed after 20 minutes and just stopped watching because it was to awefull to continue, but if they would take out all the fake blood and bad cgi, and also allot of slowmo's during the fights it would be allot better!! This gotta say i love the casting!! i really do, but the director just went a little overboard with his work on this one !"}, {"id": 119, "text": "While I like Alain Moussi and Tony Jaa, I really didn't enjoy this movie. Convoluted story, Cage Cabrit raise the bar. I should have waited fir the movie to be online and free."}, {"id": 120, "text": "To say this movie has some well known actors, i was expecting more. The fights were ok for a bit of action but camera work was shocking! I usually judge a film in first 20 minutes but it intrigued me as to where the storyline was going. I won't be recommending as a movie to watch it was just too all over the place. Really disappointing"}, {"id": 121, "text": "I lasted 15mins , the director must be twelve .The acting (where do I start).Cant believe there is a great cast and the camera man should get a new career.This is the lowest rating I have ever added.What a disappointment!!!!"}, {"id": 122, "text": "Watch it like a great 90s B-movie. First of all the fight choreography is fantastic. I don't care what anyone says the movie is full of jiu jitsu. The characters are charicaturish because they are supposed to be. This is like a cross between an early Steven Seagal movie mixed with Mandalorian. The characters are not well developed and they don't have to be. If you think about it like a 90s B-movie based on a graphic novel, it will be more enjoyable than you think. Nicolas Cage does a great job to the extent that Nicolas Cage does a great job. I really don't understand how this movie gets hated on so much. This is not a 3 movie. It's between a 4 and a 5. Set your expectations appropriately and it's worth a watch."}, {"id": 123, "text": "The content is not that bad. But the title does not reflect the content at all. This is no way related to any sort of Jiu Jitsu. I know there are many in the world, but none of them looks like this. This is more of Kung Fu style martial arts."}, {"id": 124, "text": "Someone in drugs decided to cross Predator with Space Jam. And they decided to put Nicolas Cage in the midle. I'm really sorry to realize that is getting difficult to found good martial arts movies. Tony Jaa talent was waste, ad the visual effects are sad. Don't waste your time on it. (I just watched the movie cos I want to see how deep Nicolas can go. I though Primal was the end of the road, but this one is 2 degrees lower)."}, {"id": 125, "text": "Great cast amazing fight choreography, terrible, script, delivery, plot, cgi, camera work, editing &amp; story... how did they have a massive budget for this utter trash with such big names. The directors editors and and writers need to hang their heads in shame. 3/10 just for the fight scenes and what it took the actors and stuntmen."}, {"id": 126, "text": "First of all, this movie is a 5.0 for me, but i gave 10 stars to help justify the ratings.This is one of those low budget B grade movies with some talent that you won't enjoy with high expectations. there's some good moments and stupid moments in it as well, but overall, it's kinda fun and entertaining. The non-stop action and fighting from the martial artists is the best part of the movie, and I appreciat that.As for nic cage, he is not that superstar that he used to be, so what else do you expect from a broken actor? Your complains about him are timeworn. So, move on, people, move on."}, {"id": 127, "text": "Unfortunately the movie fails to use Frank Grillo and Tony Jaa while Nic Cage gets to be Nic Cage which is always good but it's just an extended cameo and obviously he wasn't on the set at the time as Grillo and Jaa and they fix that with bad editing and using doubles. 90% of the movie we stuck with the lead a handsome man who can fight but with no acting skills once he stops fighting he is very boring. As expected the story doesn't make sense and the director keeps you busy with the action which was fine . This movie is so much of a mess it's watchable but it wasted the chance to be a real cult classic."}, {"id": 128, "text": "I loved the movie! The cast is great! Nicholas Cage brings his sardonic humor and impressive acting to the film. The stunts are massive and all the action sequences are so well choreographed. Jiu Jitsu is insanely entertaining! Absolute Must See!"}, {"id": 129, "text": "Nota a simp but I gave 10 for this flim just because of Marie Avgeropoulos"}, {"id": 130, "text": "PLOT revealed: This is a Predator type film. Every six years an alien comes here through a portal in the Valley of the Temples in Burma or Myanmar. He will fight 9 Jiu Jitsu experts and come again in 6 years. The film centers on Jake (Alain Moussi) the main fighter who can knock people out with a back flip, so there Scott Adkins.The alien is called Brox and he gave us jujitsu so he could fight us. Why an alien who heal within moments of being shot or cut needs to learn to fight was not explained. The comet approaches Earth, but the alien travels millions of light years through a portal. The plot was as foggy as Jake's amnesia. Cage is also an expert fighter whose back flip off the wall and piano are shot from a distant.The film had potential part when Arnold was in it. Guide: No swearing, sex, or nudity."}, {"id": 131, "text": "Firstly I want to say that the antagonist Alien Warrior thing is bad-ass , yes it is like Predator but one thing that has always left me with a bad taste in my mouth with the Predator story-line is how the Predator kills his best adversaries while they have their backs turned, I mean come on look at Predator 1987 and see how Jessie The Body Ventura got it, yeah it looked cool, but for the sake of honor and dignity there was none, he shot him with his back turned from above Jessie never had a chance, pe-lease!Here this thing at least let gave the other fighters a chance by challenging them face to face which I thought gave this whole premise a cut way above the original Predator and I'm a huge of anything Predator that is why I loved this thing, yes I thought it was magnificent - IT JUST NEEDED a lil' tweaking...Like a mechanic goes in to get a tune up the script , (Because its all about the writing) not to mention the effects here were cool and everyone did a fantastic job with their lines and at the end if I may add was a fantastic line , very funny about Mamma Aliens and baby aliens!)But in the end, if the script would have gone through another set of eyes and gotten it all sealed up with a lil' bit of proper explanations around the timeline of the thing then IMO, I think this could of been as good if not better than Alien and Predator! I truly believe that from the heart and I'm not a shill trust me on this!That being said this , although a lil' off, and not much, it is way fun to watch, the beginning is cool, has a cool video -game feel to it that explains a lot of the fighting with guns being blasted at the protagonist from every angle and yet coming out of it unscathed! Very imo very very cool directing as well! Cause the fight sequences were spread out enough in specific takes to make you see just how cool all the punches and kicking and stabbing unfolded before your eyes! I loved it!Like I said , perhaps if they could of explained a lil' bit of how the first team with Jake and Nick Cage were going to take on Brax without any hint of understanding how to destroy an immortal alien would of been pretty nice because they seemed to know a lot about the infernal space monster so , that being said once Jake (the Protagonist) procured the information on how to eliminate Brax on the Quest, he never really passed down this very crucial sensitive intelligence to any of his team-mates, and watching his not yet non-descript father Nick Cage die a miserable death while Jake and his pretty Asian cutie watch cruelly and weirdly off to the side, that was strange! lol.But that being said, I absolutely loved it, it was a marvel to watch and I highly recommend it for someone who is looking for something fun to watch, I would of saved the pretty white girl from departing before her character could redeem herself but those are just lil' subjective particulars, anyway, trust me, put it on and enjoy it, it is very cool, everyone involved in the thing should be very very proud of themselves, fine fine job! cool! imo!"}, {"id": 132, "text": "I watched all of it so that says a lot. Usually I will turn off a bad movie within 5-20 minutes. Its different in many ways. Even the greats get old. Tony Jaa isnt as fast as he was 10 years ago. Nic Cage still seems ok tho."}, {"id": 133, "text": "It's based on a comic book so of course it's very over the top but for being a Predator vs Mortal Kombat rip off you will enjoy it if like me, that's your thing. Can't wait for Mystery Science Theater to do this movie."}, {"id": 134, "text": "This is actually an 8/10 movie, but you know, want to increase the rating.It's not quite good as i expected it would be, i watched the trailer and i was like this is great mayb i hoped to much.But its great though to action lovers, and the cameo of Nicholas Cage and Tony Jaa makes it great. Hope you like it."}, {"id": 135, "text": "The movie is about martial arts And there is an abundance of fighting scenes in it. It is not for people who do not like martial art movies. I loved watching all the fight scenes. They were intense. Now the plot is a bit absurd and not realistic BUT it compensates you with great martial art scenes and that is what I wanted to watch."}, {"id": 136, "text": "Getting past the silly idea of an alien martial artist, Jiu Jitsu is a really good martial arts action movie I've seen in a long time, and having Nicolas Cage and Frank Grillo is icing on the cake. The film is essentially a knockoff of The Bourne Identity and Predator. The fight scenes are exceptionally well done, and even Cage gets in on some of the fight action. Jiu Jitsu is certainly worth checking out."}, {"id": 137, "text": "Nice movie good movie please support movie maker in times of pandemic"}, {"id": 138, "text": "As an martial art film fan, I love this movie. Jiu Jitsu definitely is a mindless, fun, silly, crazy film with great action scenes. My favorites are JuJu Chan and Tony Jaa's fights. Honestly, it's time for a female lead action film with JuJu. Only complaint, I wanted more of her and Tony in the film..."}, {"id": 139, "text": "Some might like this movie some may not. Low budget but does the job for me"}, {"id": 140, "text": "Bad writing, bad acting, bad visual effects, and bad fight sequences! Not sure why some of these decent actors signed up for this embarrassment :-("}, {"id": 141, "text": "A movie deserving a direct to video touch. A shallow Comic half-action flick with weak screenplay, hilarious logic, terrible development, hollow acting and a cheesy trashy ending. Some good VFX and special effects which crack under the heavy load of ...Nicolas Cage should ask himself what he was doing in this movie. Cash or destruction of prestige?!"}, {"id": 142, "text": "Being a massive Nicholas Cage fan, I was sincerely looking forward to this movie. But I cannot tell how bad this movie was. I was waiting for 39 minutes through the movie telling myself that it might turn out to be okay when Cage appears but there was nothing redeeming this movie from its extremely bad direction. Don't get me wrong here. I still love Nicholas Cage but this just isn't my favorite one of his.Despite having a great pool of cast members, this movie goes on to show that every element of a production is important to make a successful movie.1. The action scenes were way too amateurish. 2. I've seen better CG done by tiktokers. 3. The pauses were way too long. 4. The bgm is basically the same throughout the entire movie and sounded like it was from the 60s. 5. The story cuts were seriously disconnected and hard (boring) to follow. 6. The camera angles for some action shots were all wrong.I would have given this 0 stars if I could. Still can't believe I've watched this in 2020."}, {"id": 143, "text": "You know those b-movies of the old, like Bad Taste? Which are so tacky and bad they are entertaining? This is not such a movie. It's just straight out bad and even the outlandish theme can't save it.The acting is bad. It's not entertainingly awkward bad, it's just bad with dialogue that has no pacing, makes no sense and leaves you wonder if it's a college student's first attempt at writing.The camera work tries something new by at times mixing hand-held with static and sometimes even first person, leaving just a confused impression.And the effects.. They are in that uncanny valley of looking too bad for realistic effects, but looking too good to be goofy.There's no redemption to this movie, it is just straight out boredom."}, {"id": 144, "text": "Jiu Jitsu (2020), not surprisingly, offers a lot of scenes of martial arts combat which are well choreographed and well executed by performers who are experts in their own right, including Tony Jaa, Alain Moussi, and JuJu Chan. However, it does not deliver on what Blake Snyder would have called the promise of the premise. It feels more like a cinematic version of a video game than a martial arts film. No novice acquires skills under the tutelage of a martial arts master, as in films ranging from The Karate Kid to Kill Bill. The protagonist doesn't really use jiu jitsu to defeat the villain. Many confrontations are not one-on-one or hand-to-hand. There is no real discussion of the philosophical or spiritual aspects. Nobody spends much time training. None of the characters seem to grow. The romantic B-story is flimsy and unconvincing.Instead, we are given a team of elite martial arts experts, each of whom uses a different weapon: tonfa, sword, nunchaku, shuriken, staff, throwing knives, et cetera, except for the protagonist, who occasionally uses an opponent's firearm or other weapon, but quickly discards it.The movie has aliens, space portals, a CIA plot, radiation levels, and an alien with some sort of Predator-like cloaking. However, the plot is somewhere between incoherent and nonexistent. Production values are more than adequate. The actors do as well as can be expected with the roles and dialogue they're given. The fight choreography is good and boosted by exemplary execution. Yet the film is not very satisfying and certainly not cathartic."}, {"id": 145, "text": "Jiu Jitsu is the worst film I've seen in a long time. It completely rips off the plot of Predator and tries to be clever by adding a time portal subplot. The point of view shots of the Alien stalking these people in the woods clearly steals from Predator too (there is nothing original in this garbage)When I watched the trailer I was hoping for a Mortal Kombat/Street Fighter style film, but it takes itself too seriously. The sound effects are loud and over the top and the music score is repetitive rubbish that belongs in a Sharknado film. The 'acting' is awful from everyone but it's no surprise as most of these people are clearly fighters of some kind. Frank Grillo and Tony Jaa have had acting experience in previous movies but they were completely wasted here. I DO NOT know why Nicholas Cage was in this... He's in it for 30 minutes and his action scenes were clearly performed by stunt doubles. This man just says yes to anything these days, I suppose a man's gotta eat though.It's not a long film, it's just over 90 minutes but I had to pause it for 30 minutes and take a nap because it literally bored me. I don't usually take naps and I've sat through much longer films. It didn't engage me much at all. The only redeeming thing in this film is one or two fight scenes at the start which had good choreography (particularly from Tony Jaa) It didn't feel like a film though, it felt like a showcase for stuntmen to show off their skills.All in all it has a boring plot. Forgettable repetitive action scenes which were clearly stagged. Terrible camera work. Uneven tone. Sloppy pace. Rubbish CGI blood splatters. Lightning that makes the whole film look dull. I've made better movies in school. I don't know who wrote the script for this but it wasn't an adult, it was probably written by a 9 year old with a crayon."}, {"id": 146, "text": "Aside from the horrible acting by Alain Moussi as Jake, that constant dumbfounded duhhh facial expression he had, was the same face I had throughout this film.This film is basically Predator meets Mortal Kombat, but without the budget or imagination of either, and seemingly written and directed by an amateur filmmaker. For starters, the screenplay was atrocious. It's not like this is Logothetis' first rodeo, but a 5th grader could've written a better screenplay. It was convoluted with plot and technical issues, dragged out scenes, and choppy editing. The 102 min runtime felt like 3 plus hours with terrible pacing and too much filler for the little substance this film had. These errors could've so easily been rectified if Logothetis had consulted with a seasoned writer - or at least watched the entire film with a few friends before releasing it to see how terribly it was put together.What I did like, was the score, which was surprisingly fitting and not loud and obnoxious like most B films. The cinematography was great as was the S/VFX. Some of the choreography for the fight and action scenes were awesome, especially in the beginning with the POV shots. Casting was good with mostly decent performances, especially from Nicolas Cage, who was his usually awesome crazy self that stole the show. It was great to see Tony Jaa, Frank Grillo, and Eddie Steeples, who was a hoot.If you enjoy non stop fights and action scenes with excellent visuals, but without a great store, you'll enjoy this one. It's no 10/10, but certainly not worthy of any 1's and 2's. It's a 5/10 from me."}, {"id": 147, "text": "This was bad, oh it was bad.Initially I must admit that given the fact that Tony Jaa was in the movie, then I had hoped for a semi-adequate action movie at least, even with the likes of Nicolas Cage on the cast list. But Jiu Jitsu was not a good movie, not even a half-decent action and martial arts movie. Not in the least.The storyline was just a blatant rip off of the Predator story, except it was lacking the Yautja (predator) creature, and it was also lacking a proper storyline. In fact, Jiu Jitsu was fully and completely devoid of anything even resembling a storyline. It was just people running around fighting, dodging bullets and shooting at one another. And get this, because it gets better. The martial arts and action sequences were so poorly choreographed and executed that it made the early 1980s ninja movies look good.Jiu Jitsu is a blemish on Tony Jaa's otherwise fairly good track record of proper action and martial arts movies. But it was, as expected, just another mass-produced run-of-the-mill movie for Nicolas Cage.The special effects in Jiu Jitsu were, actually, not all that bad, though having special effects of that kind hardly mattered in the movie, because of the horrible action sequences and the total lack of storyline. The movie was just a sinking pile.My rating of Jiu Jitsu lands on a more than generous three out of ten stars. This movie is one that you shouldn't really bother with, don't waste your time, money and effort on this one. Some of us did, so you don't have to."}, {"id": 148, "text": "From fake fighting scenes to visible padding of stunt men to fake uniforms to nonsense let's use fists instead of guns to bad camerawork. The script is 1/10. If they adjusted the script to make it more realistic, it would've propelled the movie to a better review and a better script just needed some common sense in some areas, like the beginning of the movie as an example. (no spoiler) translator scene didn't make any sense. A US army base of all white men with no translators yet when it came to fighting, they were all Asian men... Where's common sense? Why was it so hard to adjust the story just a tiny bit?! Then the horrible shaky camerawork in most fighting scenes. You know, my 4 year old camera can do much better. Ever heard of steadycam? Nobody like a shaky camera during intense scenes, gee, after a minute, you just want to vomit of all the motion sickness. 1/10 for directing!!I had low exceptions and just wanted some Mortal combat fights and little story, but the movie just failed it. Even the fighting was so fake, I was literally laughing during a number of scenes. If you like WWE WWF fake wrestling fighting, you may like this movie.It almost looks like a few people got together, put some money in and decided to make a movie to see where it bring them, All money went to set and stunts and little to everything else. The editing of the movie is actually not bad. Bad CGI would've been ok if the script was at least somewhat decent."}, {"id": 149, "text": "Seriously, never in my life I've started watching a movie and not finish it, I've always endured through pain in some movies to go all the way till the end, but this movie made it impossible!The total wrongness begins with the title! Nowhere in this movie (or in the 20 mins I saw) is the combat form of jiu-jitsu seen! We see kung-fu and other martial arts that include the use of swords, but never the traditional grasping of jiu-jitsu!I'm not sure what's worst, if the acting, the special effects, the sound mix or the video editing, but all together make up the worst movie I've ever tried to see, and the only one in my 42 years of existence that I did not see, nor want to see, the ending!If you value your brain, please skip this movie, you will thank me, but if you are keen to let your brain die a little, go ahead, and unfortunately I'll have to say I told you so!"}, {"id": 150, "text": "Nicolas Cage isn't a bad actor, he played in some really good movies but he also has the gift to play in real stinkers. You wonder if he even reads the scripts, or does he just takes whatever pays him? In this case he did it again, another stinker on his wide palmares. There is absolutely nothing good about Jiu Jitsu. With a title like that you obviously think about a movie with a lot fight scenes, and that's basically all there is but they're so bad it just become painful to watch. It's so obvious they hold back in every fight scene you wonder if those are real actors and not just some local martial art practisers they found at the fight club next door. It's all very badly choreographed. It's also one of those movies where everybody waits for his turn to get beaten instead of jumping the bad guy all at once and secure an easy victory. I hate this kind of dumb action. But it's not only that that is wrong with this piece of garbage. Highly trained military people that can't hit a target whilst shooting from one meter distance, you think it couldn't get more ridiculous. The CGI's are also painful to watch as they look to be made by a six year old computer geek in his basement, just awful. And then you have the story, or more the lacking of a story, with so many plotholes you wonder if they even had that script proofread by someone else before they started shooting this movie. Everything is a total mess in Jiu Jitsu. You can only feel sorry for Nicolas Cage, again he managed to be in a movie not worth being called a movie. I hope he gets paid really well for that as by now his name is just better known for playing in very bad movies than for his actual acting talent. Do something about that Nicolas before you lose all credibility!"}, {"id": 151, "text": "It was one thing to find out that Nicolas Cage was in a movie called Jiu Jitsu, that was enough for me to buy the movie on Amazon Prime. It sounds just bonkers enough to be up my alley. Then I discover that Tony Jaa's also in this movie. I could not wait!!Unfortunately Cage and Jaa are supporting actors in a movie designed to show what a guy named Alain Moussi can do. I don't know if he's doing Jiujitsu on camera but he does have a pretty awesome flip kick. He's no Scott Adkins but we possibly caught this guy at he beginning of his b-marshal arts action movie career, but what what a way to start.Ii is kind of string (and a little racist) that Jaa is not just staring in the movie. They asked Jaa to toned down his cinematic greatest to a 10 rather than the usual 11 so that they could add a bunch of cool camera angles, special effects and slow-motion to Americanize it. Yet still watching Tony Jaa fight is amazing.Not much of a story but more like a series of really great action sequences that feel greatly influenced by video games more than marshal arts movies of the past (the filmmaker also seems to enjoy comics as I gathered from the all the comic book art being used to transition form scene to scene). The story has something to do with a group of warriors who must defend the planet from alien invaders but one of the warriors (played by Moussi) forgets who he is endangering the mission. The fact that this invasion happens every six years kind of reminds me of Mortal Kombat, but the game these filmmakers are trying to make seems to be a 1st person open world thing.There are other cool people in the cast. Frank Grillo who played Crossbones in Captain America the winter soldier. I just binged watched his show Kingdom which is good. Rick Yune, who is yet another victim of Hollywood's tendency to favor White Boys with marshal arts skills. Check out his film the 5h Commandment for proof of that. The film also stars Marrese Crump, a more handsome version of Billy Banks (the Tae Bo guy) who has faced Tony Jaa in a film with Jaa at 11 (The Protector 2). Watch that movie and tell me Hollywood has not slept on this dude's skills.Despite its lame story the movie is perfect. it just keeps going with so much kinetic energy that it does not stop long enough for you to complain about how weak the plot is. Worth checking out."}, {"id": 152, "text": "One of the affiliated companies for the movie that is presented before the film starts was called Loredo Investments Limited. As I think this movie is a bad investment of time, I do not envy anyone who made the decision to invest money into it. Though the plot seems like it could be kind of neat, it is just executed so terribly... It literally looks like it was made as a SyFy original movie in like 2002.The special effects are pretty much what killed it for me. I couldn't make it past 30 minutes, to be quite honest. There was an action fighting scene at that point if you wanna call it that in which when someone got punched or kicked, there was like a poof of dust or something where they were struck. For no reason what so ever, sparks even flew out of the one dude where he was kicked. Mind you, these are just dudes in military uniforms. No armor to speak of. It baffles me that this thing even earned an R rating. I mean, it looks like you're watching a T rated fighting game with the blood option turned off...Yeah, I don't know. If you like the SyFy channel's old B movies, you might enjoy it for some nostalgia or something. At the end of the day though, this is my spin on it. New video games that come out using the old retro style graphics from the 90's are usually pretty fun. New movies that come out using special effects CGI editing from the 90's however are not as well received, and for good reason."}, {"id": 153, "text": "I knew it was going to be bad, but I made a decision and have no regrets, but if you still fight doubts, I can confirm this for You - it is indeed an all-around mess of a movie. It might have B budget and the fight scenes might be (are) their main selling point, but as a movie, usually an imaginative, artful construct, right, it's some real D grade stuff. Thankfully, Nicolas Cage does not belong to any of the guilty parties, he did what he does well as good as he could've with this paper thin and muddled script - he had a bit of fun. To make a note, I like Nicolas Cage a lot, both when he's serious and high-tier, and also when he's just him. Doesn't matter the movie, Cage has never disappointed me enough. Fun fact: this is Nic's lowest rated movie to date.So, Jiu Jitsu absolute worst flaw is most definitely the story. Is there even one? Till the last act, it continuously segues from one action scene into another, as the unimpressive group of warriors fight that one Jiu Jitsu Alien Futuristic Demonic Superhero Uninspired Shiny Ninja Guy. The last act pours some belated exposition and random previously unconnected/unexistent details in our eyes, and it feels as if the viewers are seen by the writers of Jiu Jitsu as dumb and naive. Like, for real. It's nearly impossible to care for most of what goes on in this unreasonably shaky, unreasonably long and unreasonably empty of any emotion piece of art. After understanding that, all that's left is to try and feast on the endless action scenes and those couple funny Nic Cage moments. Of course, the man arrives to stay only like half-way through the film. Action scenes are good, some of them really are, well choreographed and special effects do not always get on the nose. However, it all gets old pretty fast because the fighting styles don't really get shuffled or updated throughout and the situations (fight scenes) are technically not that different from each other. Acting's accordingly void of anything truly charming, cinematography's kind of okay, too shaky, original score's whack, what else... Just the fact that this should've been a 15-minute short film.I in good conscience cannot recommend this film to the people seeking a quality evening with a cool martial arts fantasy adventure, only to those who feel like they eventually have to see every Nicolas Cage movie in existence. My rating: 3/10."}, {"id": 154, "text": "Anybody who saw the trailer to this expecting a new Predator/The Raid, or a quality movie, must have been willfully ignorant.That's not to excuse this movies shortcomings, of which there hell of a lot, but it feels like a lot of people are missing the point of how its camped up and cheesy for camp and cheese sake.The CGI is mostly horrible bad except for a few composite environmental shots that look okay. The acting goes from bad to really bad and Cage sadly never goes the full distance.There are a couple of lines/moments that made me chuckle, fight scenes sadly had a lot of I'm gonna stand here and wait for my turn to be punched, a couple of cool looking moves in there, but nothing that makes one really go Wow, I have never seen something like that!.It tries to do some interesting things like First Person camera action ala Hardcore or continuous shot action scenes ala Daredevil Hallway fight scene, it generally borrows a lot from other movies like that, but that never gets even close to the execution of what it borrows from.The people who made this seem to have had a lot of fun doing it and it shows in places.Overall it's still entertaining enough to kill some time if you know what you are getting into and don't expect some kind of groundbreaking master piece with an elaborate/realistic story and setting."}, {"id": 155, "text": "Calling this film the funniest film of the year is not a positive review. Do not be fooled by the 7/10 star rating above, this a 6.5/10 at best. Why the high rating you ask? Because its an artful film that isn't too original but its got Nicolas Cage and Eddie Steeples (My Name is Earl, Hey Crabman).The film, at first, is hard to follow and the camera shooting is terrible. At times it is shot in first person (for no apparent reason) and other times it is third person. It is like watching someone play a first person version of Street Fighter, which changes to a samurai based graphic novel with little or no warning at all. What makes the film good is its ability to tell a story without much dialogue, it is like watching a graphic novel come to life. Most importantly, Nicolas Cage has a fair amount of screen time for being a supporting actor. But it is well worth the wait to see him his whole ten minute part is the best part of the film.This is very much a film that would be on Mystery Science Theater 3000, but hey its got Nicolas Cage! The riffing would enhance the movie a lot. The writing of the film most likely started out as a synopsis like: Nicolas Cage fights an Alien Invasion using Martial Arts -sounds like a good pitch, right?"}, {"id": 156, "text": "Jiu Jitsu is a straight to direct television sci fi martial arts film.It is basically a Predator rip off with a dose of Terminator and plenty of martial arts.Every six years a comet passes over Earth. It opens a portal in some temple in Burma where an alien emerges. Expert Jiu Jitsu warriors must fight it one on one in a honourable battle.Jake Barnes (Alain Moussi) is the chosen one although when he first appears. He has been severely injured and has amnesia until his friends find him.Nicolas Cage plays a paper hat wearing mentor of Jake.The film is pure hokum. You can tell in the opening minutes with the terrible interpreter who is meant to be comic relief but it verges on racism.There is a lot of martial arts but it is rather routine. It lacks style and excitement.There are several familiar faces even though people might only recognise them as the villain from a Bond movie or a Marvel movie.Then there is Cage. It pains me to say this about someone who won a best actor Oscar. The quality of the acting goes down when he appears."}, {"id": 157, "text": "Bad movies are not all the same, shame on you cinephiles, voting down a near masterpiece. You do not get it? Let me badxplain it to you... easy with a comparison: take A wrinkle in time, an Oprah vanity project infused with mountains of Disney cash, horrible acting paired with pretentious nonsense script and a woke director that is in way over her head. Journalists and sites artificially maintaining the vote high because of spineless conformism. THAT is a 3 or 4 out of 10, only because the technical departments did their job. The viewers pay full price and believe the hype and ultimately are the victim.Now, only now, let's have a look at JIU JITSU, the cash is bare minimum, camera is terrible, sound is barely decent, the acting is either desperate attempt to save face or straight horrible: the production is cutting so many corners that they end up with a sphere, the perfect solid. It's sooooo bad that it goes straight to the other side. This film is a monster, in the latin original sense: monstrum, itself derived from the verb moneo (to remind, warn, instruct, or foretell), and denotes anything strange or singular, contrary to the usual course of nature. A marvel of nature, you cannot plan for this stuff: is the collective result of C-List actors desperate for cash and an improvised crew, improbable production standards and a weird 3rd rewrite of the script for a grand total of 7 (!) bucks ticket. That would be enough for a 6,5/7 but... it's got (Oscar winner) Nicolas Cage, the myth. It's a straight 8!!! (and if you stiff upper lips fake connoisseurs don't get it, rewatch some of your beloved pretentious crap and stick to that).PS It's not perfect because nobody died during production as far as we know."}], "reviews_amount": 158}