{"name": "Hosts", "titleId": "tt09543062", "reviews": [{"id": 0, "text": "This movie is past ridiculous. Nothing make sense. The dialogue is low effort. You dont care about anyone in this movie. The decisions made by both protagonists and antagonists make no sense, and there is no direction as to where things are going. Are they killing people? possessing them? why? who is spared, who is killed, etc, ...just no sense whatsoever. If you need the bodies to posses them, why kill them or weaken them. If you want to kill them, why don't do it soon enough?, etc, etc, etc. This is a good movie to learn what NOT TO DO as a filmmaker. My guess is, someone had a cool idea of how creepy peoples pupils look when lit up in a dark alley. The plot was made around that 1 drawing or scene.Hosts deals with a couple that goes to visit a family for dinner either before, during or after Christmas, ...its not important. It just goes down hill from then on. Both in a narrative sense and movie quality.The acting is bad but, you have to put context on the actors. They were not given enough to even work with, so I honestly don't know if it was their fault or the script. But I highly blame the script/Screenwriters.Plot is completely non existent, I would say. It starts with a mysterious possession, that is kept mysterious throughout the movie, without rhyme or reason. The movie finishes and you have no idea what has happened, or why!But I think the worst part of this movie are motivations and actions throughout:----SPOILERS AHEAD---- Where do these lights come?, and then it turns out is a video signal that possesses the victims via a tv screen. That's all you will know about the bad guys. A woman's head is smashed in a dinner christmas by the 2 strangers that are not eating and just staring blankly throughout the whole dinner, but that I assume is just normal where they live. Then the demons decide to torture, but not kill their hostages/victims, because.... reasons. A protagonist(which is never stablished who really is the main protagonist here) gets a cell phone and decides to call her fiancée, not the police(that would be too easy), and explain to him in detail for like 5 minutes of dialogue and crying about what happened in her house, ...oh the horror. And then she is taken upstairs to fake shot her whiny brother(adult) in his face(with an unloaded shotgun). Her father is locked in his room, and cant get out because, for convenience sake, all the doors in the house can only be opened from the hall, ...nope, not from inside the room(fire safety reasons? I assume or they bought an old mental asylum and decided to live in there). And in this houses, I am assuming the windows are bulletproof, because no one tries to escape through the blatantly big windows in this 1 floor home. When she fails to kill her brother, shes is dragged down again from the attic to the ........some room, that has a TV. And oh, these demons are so slick, they can slip under your bed undetected but they cant her or see a tied grown woman that escapes in front of their faces. And you are finally, ..like well s***'s about to get real!, She escapes and runs, and runs through the forest that is more lit than a stadium in superbowl, and keeps running and finally stops, outside of the house where the murderers where, tired, huggin a tree in desperation. And she ends up 10 feet away from the main door of the house where family is kept. What? She is standing in full blown light, right outside the door where her mom was killed and her family is being tortured. What does she do next? why, wait of course! For like 10 more minutes just there. Finally the devils catch up with her which turns out, are way more than just the 2 in her house. blah blah blah, she gets her brother or son out of the house, just to find that there will be Hosts 2: the AirBNB revenge because those lights are all over the sky."}, {"id": 1, "text": "It has an amateur feel to it. A bit like a high school play. It's slow and boring. It's over the top in places just to try and get the shock factor. Story line is silly and nothing is explained. Ending is very disappointing and totally what I predicted. It's like watching Eastenders but far less entertaining. I wish other reviews would be more realistic as I wouldn't have wasted my time with this."}, {"id": 2, "text": "Truly unbelievable and bizarre character choices throughout the film. Acting that could end careers. And an underdeveloped idea that ultimately goes nowhere."}, {"id": 3, "text": "Don't be fooled by the 10 STAR ratings. What a load of manure. I wasted 48 minutes of the time I have left on this earth to watch this tripe. The acting was horrible. Even after 48 minutes I still had no clue what was going on. I think I'd rather have Coranavirus than sit through the remainder of this movie. For those of you who decide to watch this, I won't ruin the first 48 minutes by telling you what happens."}, {"id": 4, "text": "Weak and nonsense. Awful literally awful script bad role playing. The location, the shooting was all bad and awful. Score 1 was the highest score given to this film. Meaningless and aimless scenes. The actors shouted uncontrollably to raise the excitement of the film, which was mostly on the brain."}, {"id": 5, "text": "So, it's not the greatest film you'll ever see, however HOSTS will keep you entertained and keep you guessing. Another review of this film stated the acting was poor, but in my opinion, most performances were fantastic considering the script. In saying that too, the story was unique and creative.I popped in on, sort of as a background movie while I was working, and got sucked right in. I'd recommend to any horror fan."}, {"id": 6, "text": "Not all are welcome in the Father's house. Some are cast out and lurk in the darkness waiting for revenge. Good and bloody."}, {"id": 7, "text": "Unbelievably bad acting. Very poor story line. Directors and writers need to count this as a loss of their possible talent, improve and move on. The actors/actresses will never make it big unless they take more lessons. It was like watching a Junior school play in every way."}, {"id": 8, "text": "Imagine someone writing a script, having a fairly good idea for a horror movie , getting it only 25% done but then having it turned into a film anyway. At first I thought this was going along OK, if not great, with the usual horror film mistakes. The obvious stupidity of characters, the non-reactions when there should be a reaction and scenes that add nothing to the plot. One great scene, well planned out made me think this film might be something exceptional and then just as quickly fell apart as if there were no script at all. More idiot moves on the part of the characters, random scenes that make no sense, many scenes that just go on way too long. You'll be sitting there asking yourself just how stupid any one character can be, or even worse, why is this even happening ? The movie jumps the tracks, crashes and burns until you'll be wishing for it to end. Some of the acting is very bad, but there is nothing to the script after a certain point in the film as if they decided they just needed to finish it and release it without it even making any sense. Awful !"}, {"id": 9, "text": "Absolutely shocking film. Never got going. People running round with light bulbs in their mouths. Just typical of 2020 with the way it's all gone. I'm %100 sure this has got to be the worst film I have ever seen. Some of the effects look like they have been drawn up by a Nokia 3310...."}, {"id": 10, "text": "Biggest load of rubbish ever .typical british film , flooded with music from start to finish and acting from two or three like a 7 year old would .. who ever wrote directed and recruited such rubbish .. bizarre trash ."}, {"id": 11, "text": "Terribly bad acting, directing, everything This about it"}, {"id": 12, "text": "I like to watch movies with few actors but they have to be well written and well acted. I like British humor, but it has to be humor and not gratuitous violence without content. I like Horror movies, nor do they need to have a big budget if well written. , I do not like films that put a lot of hemoglobin without real meaning and horrible performances with artists of third order, with scripts of dubious taste, there is no patience. this movie sucks."}, {"id": 13, "text": "Acting's ok. script was overstretch time wise. had potential. you may like it. Needed to feel more thrilling , images and sound track ...."}, {"id": 14, "text": "I really feel this may be on of the most ferocious horror movies of the year. The acting if first rate, the story feels a little familiar in that it's sort of home invasion movie, but like most interesting indies they make it seem new. This movie is terrifying and there is one scene that is going to blow your mind. It's little indie gem that I feel I've unearthed.......definitely recommend!"}, {"id": 15, "text": "Poor scenario and also too much cliche acts from actors, not interested"}, {"id": 16, "text": "Well done to the cast and crew. Excellent work across the board. Nick and Samantha are phenomenal as the guests from Hell and the dynamics between the cast members are strong and believable.From the first hammer stroke to the last swing of a knife, horror fans will truly enjoy this well-acted and well-crafted flick!Can't wait to see what they come up with next."}, {"id": 17, "text": "This film is ridiculously good! Original, dark as hell and shook me to my core. for fans of strangers and funny games with a twist! a must watch for any true horror fans!"}, {"id": 18, "text": "Directors Adam Leader and Richard Oakes set out to create panic and disorder (because we need more panic and disorder in 2020 - right?) with this film and hit the mark dead center. The high level of violence stoked by familiar family members is what makes moviegoers of this film squirm in their seats. This movie is not for those with weak stomachs. In two words - bloody beautiful."}, {"id": 19, "text": "This is one of the most accomplished indie horror films I have ever seen. It's very easy to watch part of a film and judge it against blockbusters with £££££ budget without any concept of the love and dedication poured into something of this size. There are some really complex themes, interesting allegory and shocking moments. Among that, there is warmth, humanity and occasional humour. All the while, a rhythm is maintain that keeps the viewer engaged. The cherry on the top of the blood-drenched cake is the sophisticated and thoughtful score. An excellent combination for a modern horror film."}, {"id": 20, "text": "Seriously....this movie was bloody, gory and amazingly creepy!!! I love when new horror sneaks up on you like this!!! Boom!!!"}, {"id": 21, "text": "With so many horror films out there, it's great when you find one that really stands out. HOSTS is indeed one of those films. Directors Adam Leader and Richard Oakes have expertly crafted a gripping and often intense new film that you cannot possibly be prepared for. It pulls you in at a deliberate pace which does not let you go and believe us, you won't want to go anywhere! We would be remiss to not mention the absolutely incredible cast with standout and simply mind-blowing performances from Neal Ward (Jack), Nadia Lamin (Lauren) and Samantha Loxley (Lucy). While there's so much we would love to discuss about this film, it would be difficult to do so without spoiling it - and this is one film you will want to experience to it's fullest. Don't miss the film that horror fans will be talking about for a long time!"}, {"id": 22, "text": "This movie moves quick and it is gory af! It is a must watch 🖤 get yourself some popcorn 🍿 and watch it."}, {"id": 23, "text": "This film had me floating in suspense and shock throughout like a blue plastic bag!! Absolutely amazing work from an incredible lot of talent!!"}, {"id": 24, "text": "Great fun film, not to be taken too seriously. Me and my Wife had so much fun watching this and made a great addition to our 31 days of horror list. Warning not for the squeamish tho."}, {"id": 25, "text": "This is a really exciting debut feature from these filmmakers. The directing from the opening shots gets you hooked. Beautifully crafted and a continued sense of dred in mood in every single shot. All the actors but in wonderful performances and it leaves you wanting more. Well done to all involved."}, {"id": 26, "text": "This movie is a must watch! Story hides a deep, philosophical meaning behind a simple family story, all wrapped up in a hybrid possession/home invasion movie. Great performances by Neal Ward and Samantha Loxley. A Christmas dinner you will never forget!"}, {"id": 27, "text": "The movie started off strong and the possessed characters were creepy. However, there wasnt much of a story and the movie devolved into a confusing violence fest with no real substance. I was indifferent to the family and having violence for the sake of violence didnt help the plot. If there was more of a story, then the scares would have been more effective.I think this could have been better with a bit more plot and better character dialogue and development. Bonus points for the ominous music score and a few decent scares.An average movie that serves it's purpose when you have nothing better to watch[5/10]"}, {"id": 28, "text": "I picked this out on Google Play as something to watch while my wife was on a night out with the girls.... watching alone was a big mistake!!! Christmas dinner will never be the same again... might pass on the cranberry sauce from now on.There are two things you frequently come to expect in Indie Horror: poor production value and corny acting. Not so here! The quality of the cinematography could easily go toe-to-toe with any A-List horror. And solid acting from the whole cast. Particular note goes to the genial old patriarch.If you looking for a fun gore fest that looks beautiful; go for this.Let me just end by saying, practical effects rule! Ha ha. Squish! I'll say no more."}, {"id": 29, "text": "This is a fun movie...and there's one particular scene I can't stop thinking about. (you'll know it when you see it). Superb acting, great script, strong directing and awesome cinematography makes this low-budget horror flick a must-watch."}, {"id": 30, "text": "This indie horror had me glued from beginning to end. I was amazed at how brilliant the cinematography was and its ability to set the tone throughout the entire film. The acting was convincing and downright creepy. Casting choices were superb! Well done!"}, {"id": 31, "text": "Amazing acting. Great setup for the story and amazing execution once the climax hit!This whole team is amazing!"}, {"id": 32, "text": "There are a few critics on here who wouldn't know good acting if it slapped them not to mention I'm always suspicious of the one movie review critics. 'Host's' is a well acted invasion movie with an element of psychological horror and plenty of gore that all takes place in one house. With just a half dozen exceptions over the years I usually find British horror tedious and difficult to watch with terrible acting but I will definatly be adding 'Host's' to my exceptions even with it's very predictable ending as this movie will grab you from the beginning and hold you until the end."}, {"id": 33, "text": "I love horror movies, and I think that, with only a few exceptions, I haven't watched a non-horror film for 3 years. Some of them were absolutely tremendous, some of them were decent and others were quite poor.But none of them was absolute garbage. Well, Hosts it is.The directing, writing, dialogue, cinematography, plot, sound mixing are disgustingly bad. You are sitting in front of your TV hoping that something will happen that will reedem this movie. Maybe one coherent plot point, maybe a decent piece of writing, maybe a good shot. Anything, really. It never happens.I saw some people bashing the acting, but with this kind of incredibly idiotic directing and writing, you can't really blame them. The had absolutely nothing to work with.The directors, writers and producers should be ashamed of themselves. In this times, when the movie industry is crashing and talented directors are scraping for a minimal budget, they just insult them by making this sorry excuse of a film.The fact that this has 5.6 (actually a decent rating for a horror movie) is an absolute joke. If you're thinking of paying money for this, don't, just don't. Just drink them away or gamble.2* just because I feel bad for the actors. Hope this doesn't end their careers."}, {"id": 34, "text": "There has definitely been a major marketing push to make this film out to be something it's not.I'm usually happy to take a low budget into account when watching a film and look for what was done well, but there was very little here to appreciate. Read a five star review and then prepare to be disappointed.The script was full of waffle and didn't go anywhere - characters stood/sat about giving tedious monolgues supposed to inject meaning.The directing was mainly static shots that didn't even allow characters to move - a woman tries to direct her boyfriend (after a massive dialogue that should have been left on the cutting room floor) to lights in the garden whilst rooted to the sofa. A family watch a murder, rooted to their chairs.I liked the actors - though they had to squirm for what felt like hours in every scene to show their terror.The whole thing should have been done as a short. There's nothing original about the film and there was not enough story to make a film of this length. And not enough money to make it look even that half-decent.Then the money could have been spent on some polish and the writer would have been forced to consider what the point of the whole thing was.So bad it's bad!"}, {"id": 35, "text": "It's Welcome to Dinner meets Invasion of the Body Snatchers with new British Indy horror Hosts and this film deserves your time - Young Couple Jack (Neal Ward) &amp; Lauren (Nadia Lamin) are looking forward to sharing their Christmas Dinner with their local friendly neighbours, the family who live close by, consisting of Mum and Dad (Frank Jakeman &amp; Jennifer Preston) Sons Eric &amp; Ben (Lee Hunter &amp; Buddy Skelton) and daughter Cassie (Samantha Loxley) but when some strange lights are seen in the couples garden and Mum has some heavy news to break to the family, you just know things are going to go from Turkey to Tits Up in a matter of a heartbeat over the Yorkshire Pudding.I won't say any more about the story itself, as we don't want to get into spoilers here.HOSTS began its life as an on-line Crowd Funding Campaign, via the Youtube channel of its creators, and while it might not be the next Saw of the Horror Genre (Nor should it need to be) it's an extremely well made, tightly directed, film with a number of well thought out camera shots and clever design concepts.Any indy film without exception always has a more challenging road from script to screen than most and the team behind this movie put it out on line for all to see, so you could follow their journey from day one. While films must always be ultimately reviewed on the final result on the screen (because ultimately that's all your viewing audience cares about) the team of Oakes and Leader are among a small number of the new generation of film-makers, to have made their journey of getting this film out there so transparent. So even if I hated the film, which I didn't, I still wouldn't be dishing out some bell end of a one star review.HOSTS, yes, was made on a tiny budget, (I think it was 20k?) and is shot around incredible limitations, but the fact that up and coming talents and entertaining comedy duo Leader &amp; Oakes (Check out their amusing and informative channel Dark Fable Media on Youtube) have been able to deliver with a film this polished is a testament to their creativity, passion, drive and skill behind the camera. Few would dare to try such an enterprise with so few resources and such a punishing and extremely short shooting window, let alone those who thoughtlessly would see fit to dismissively give this film a one day star review. (Doing so makes those reviews have absolutely no value and they should be ignored and only underscores the fact that these reviewers have no concept of what makes the genre of horror great in the first place.)I'm not going to shower the film with endless false praise because it's not a movie without some issues. While occasionally the lack of an adequate budget betrays itself and some moments of the story do jar briefly, the many strengths of the film allow these, for the most part, to be overlooked.The acting is a mixed bag, but all the roles are competently played, with some notable stand out performances (Especially from Samantha Loxley &amp; Buddy Skelton) But from the creepy opening, you know this film will be a little bit different and deliver in the right boxes for it's well worn genre. It's not a film for the faint hearted and probably not one to have on during Christmas Dinner either and what you make of the ending, will depend on how you like to digest your entertainment at the end of your meal.Oakes and Leader are both self taught at their trade and you can see their numerous informative videos regarding film making on their channel, and they have put everything they've learned to good use here. As a first outing, this product is impressive and they should, quite rightly, be proud and pleased with the result and its well deserving of distribution the film had been searching for. .Overall, this is a solid indy film, made by a duo of determined and extremely talented filmmakers, who instead of procrastinating from the sofa, got up and made their first feature, allowed us to follow their journey and produced a very worthy product. It would appear many horror critics agree with my assessment, so fans of the genre, check out this film out and STUDIOS, give these guys a shot at something with the proper financial support they deserve. For even the smallest but decent budget I am certain they will deliver an absolute corker for the normally difficult second album. Recommended."}, {"id": 36, "text": "If you want some shock horror with a house invasion style, then go ahead.Some scenes are well shot and acting is pretty good from the cast; particularly Samantha Loxley. The scare factor was there but it was mostly gore that turned me away.In any case there were plot holes and things that didn't add up in what little story there was. So if you want to watch over an hour of gore, violence, and people crying a lot without much story I guess this is for you.In the end it was a pretty average showing, I was expecting more from the demonic possession angle; some more lore or plot would have been welcome to flesh this out into something really good.5/10 average story with excellent and horrifying visuals."}, {"id": 37, "text": "Oooh I just love a good Home Invasion movie and this is right up there with the rest of the best!10/10!Superb acting is all I can say really. The cast are just brilliant throughout the entire movie and I can't really say I recognise any of the stars of this film, but who who knew a British film like this could turn out to be a fantastic horror!Other than that the film is gruesome with a few good scares here and there but then again, I'm the most jumpiest person when it comes to horror movies, even when I know something is about to happen.Give this a watch, you will love it! But there's one important message I will leave with you...... Lock your doors &amp; be careful who you invite into your home."}, {"id": 38, "text": "Saw a nice blurb about this movie in the NY Times the other day, as recommended Halloween fare. And I was not disappointed.The set up: it's Christmas and a loving family of five in the English countryside has invited the young couple down the road to join them for a festive dinner. We're only past the starters when the the physical mayhem and psychological terror begin!Apparently this is a super-low budget movie. I thought it was more of a professional production, so kudos to the producers!. Every minute raises more questions, and creates more suspense, and mystery. And now that I think about it, the writers raise some pretty serious, and yeah, sometimes superficial, questions about life and relationships and the randomness, capriciousness of evil.My feel throughout: what horrible, surprising thing is going to happen next? How will that 1960s-era cabinet TV play into things? The paring knife and the chaotic attempt by the guest to chop an onion? What does the empty antique train symbolize on its journey to the end of the line? And the partridges that the family's patriarch just killed?It reminds me of another, and even more disturbing Christmas day British horror/ sci-fi: 2016's Await Further Instructions. It has the same cramped, claustrophobic feel -- why do British homes have such small rooms? -- and the same family-with-secrets undertones. Sort of a kitchen sink drama meshed with Twilight Zone or Black Mirror.I give it an 8. Minus two stars for some plot holes worthy of a teen slasher movie. And the acting can be hammy at times -- deliciously so, and campy occasionally -- but again this is apparently a semi-pro production. Well worth the Amazon charge and my hour and 48 minutes."}, {"id": 39, "text": "Hosts is a very welcome and needed breath of fresh air for the horror genre. I used to be a big horror fan but in latter years I'd grown bored with the generic jump scare formula that many of these films seemed to use. Hosts is bold enough to set an unnerving undertone and lets it build. The tension gets going from the first scene and let's you know something isn't right. There's a sense of foreshadowing and this keeps building up until a pivotal point of the film. From here the film takes an overtly darker tone with plenty of gore. Instead of gore for gores sake, Hosts delivers this in an intelligent way and the contrast with the earlier scenes make for an even bigger impact. The story is very well thought out and is delivered with a very clever balance, maintaining a great story and script whilst also giving us overt blood and guts which is sat on a hidden bed of sub text and tones of foreshadowing. The cast are all very strong throughout and show a great range in their acting skills. The overall experience offers complete immersion from start to finish. What this small team of cast and crew have achieved is incredible and I can't wait to see more from them."}, {"id": 40, "text": "As you can tell by the huge spread in scores for this movie, you will either love this or hate it.For myself, I enjoyed it a lot and here is why.This movie is beautifully shot, creepy as hell and has some seriously extreme violence thy I was not expecting.The initial 25 minutes sets the scene and for me was a little slow however once the neighbours arrive the movie picks up fast with lots of tension and gore. I am sure everyone who watches this film will remember that one scene that just hits you out of nowhere with glorious brutal violence.I personally found the acting to be pretty decent with excellent performances by the Dad and the female neighbour.While not perfect, this movie is one of the best horrors I have seen in a while and if the $25k budget is true then this is an outstanding effort.Overall I give it a 7. Enjoyable with room for improvementI hope to see more from these debut directors and next time with a decent budget."}], "reviews_amount": 41}