{"name": "What Lies Below", "titleId": "tt09264728", "reviews": [{"id": 0, "text": "1) Yes, the film drags quite a bit. 2) Yes, the guy's really hot. Great casting choices. Good to see Mena Suvari again. 3) Weird cinematography and color pallette wehich adds to the bizarro vibe here 4) It has shaded of absolute brilliance, and shades of silly garbage too. So, all in all a mixed bag that definitely scores above the Conjuring franchise themed horror motif that's flooding the scene these days."}, {"id": 1, "text": "Creepy, low budget movie that was fun to watch. It figures, if it seems to good to be true it probably is. LOL The guy is handsome, charming, intelligent in the beginning, then it got super GROSS and creepy. Wish they had the budget for better creature FX. Overall, not gonna win an Oscar, but it's a fun and bizarre popcorn movie for people that don't wanna see BUCKETS of Blood and body parts flying around the screen for 90+ minutes."}, {"id": 2, "text": "I thought it was quite good even though it's a lower budget movie. It's creepy and unsettling with an unexpected ending."}, {"id": 3, "text": "The film starts off well but descends into chaos like it does not know how to end the story. We also never find out who he was or what they wanted and I hope they don´t think the ending could lead to a sequel.Why did the mother suddenly get sick? no explanation.She sent her friend to tell her mother the boyfriend touched her and then went to sleep. She didn't wait to see what happened, the friend didn't say goodbye, we know she died but still makes no sense, and then mother did not confront her about it and just started watching television.As the trivia says, one hour 27 minutes you will never get back."}, {"id": 4, "text": "First off, ignore the upset Trump supporters giving this movie a bad rating. There is nothing political about this movie so they just have alterior motives with their ratings and insane political projections. As for the movie, it moves at a decent pace and the acting is ok. It was very creepy to begin with and you could tell where the story was going. I enjoyed the ending because is wasn't as predictable as the middle of the movie. I would give it a solid 7/10.... I gave it a 10/10 only to offset the bad ratings from the people that can't get past their delusional mindset that everything is political. Smh."}, {"id": 5, "text": "Amazing thriller! If you're into Sci-fi, mystery, and horror this film has it all. It is definitely a must see. It was well produced."}, {"id": 6, "text": "Exciting thriller that was an unexpected ride from beginning to end. A lot of movies these days don't use camera angles, color and lighting to contribute to the story. Literally it was like the setting was another actor in the film. Great job and really looking forward to more from this film maker."}, {"id": 7, "text": "Don't waste your time - it lacks plot and it's gross but not in a scary way"}, {"id": 8, "text": "Kept me on the edge of my seat the whole time. If you give less than 8 stars, you don't know movies. The director was in touch with actors, cinematographer executed vision perfectly. Can't wait for this directors next film!"}, {"id": 9, "text": "For starters the bad reviews on here should not be taken seriously. Thi si an all around great movie that turned out really well for what seemed like was going to be a low budget horror film. It has solid cinematography, decent acting (The reviewer that complained the actress mostly spoke in one word responses has clearly never had a teenage daughter lol), and well done practical effects. The story albeit predictable at least for someone who has watched thousands of movies like I have, still was fresh and fun. I don't want to say much without spoiling the movie but it is a great suspenseful movie that keeps tension building nicely. If you appreciate horror thrillers that aren't big budget Hollywood movies with crappy CG effects than you will likely enjoy this film. I am so glad I watched it.Do yourself a favor and watch this movie."}, {"id": 10, "text": "Dammit that man!!! Who cares what else went on in the movie..."}, {"id": 11, "text": "When I watch a horror film, I expect characters to do dumb stuff, but this one just reeked of absolute idiocy. While there are spoilers in this review, I'll try to keep them minimal.At one point, a character is trying to escape from an area she knows very well, takes a wrong turn out of the driveway in front of her house and ends up driving her car into a lake. No good explanation for this at all. At another point, this same character walks across a room to get a bucket so she can carry it back and stand on it when there is a chair much closer to her.The acting was medicore at best, but the characters weren't really given much to do that came off as genuine. Mena Suvari is given a whiny, annoying caricature of a 'concerned mother' archetype who treats her teenage daughter like she's 5. Trey Tucker was ok, but really didn't have anything else to do but be eye candy and odd. I could imagine his stilted line delivery was part of his character's awkwardness. Ema Horvath's character was more of an introvert so was able to convey more through her face and eyes, but once things took a turn, her character became less and less interesting. The dialogue was cringe-worthy throughout.There is no real payoff to this film, especially in terms of any kind of monster reveal. Just shots of its feet. I'm usually good at using my imagination when the budget doesn't allow for more detailed effects or makeup, but this really came off as cheap.Lighting and atmosphere did help create some sense of creepiness, hence me giving it at least 3 stars, but most of the really creepy parts were in the trailer as well. I was hoping for things to take a far darker turn in the end, which I've seen PG-13 films be able to do, but it was really just a lame ending to a very boring, tedious film."}, {"id": 12, "text": "Has some suspense but really slow and doesn't go anywhere. The only words Mena Suvari seems to say through the whole thing are 'baby girl' fifteen million times."}, {"id": 13, "text": "Well, if their intent was to make ever inch of my body contort with creepiness vibes - they were successful! The horror component of this film is definitely more the psychological. It taps into those primal fears that most of us ladies don't like to think about, being sexually targeted by a man we are suppose to be able to trust. He's like the male version of siren, so beautiful and is leading us to our death.(Spoiler alert) That shower scene was probably one of the most uncomfortable scenes I've EVER witnessed in a film, which was preceded by a scene on a boat that I -omgeee -I don't even want to think about. I audibly gasped. Umm, John licks something, that I've NEVER seen in cinema.Then there's that ending. WHAT?! That's all I get? What happens? I. Need. More. I then went looking for answers, and I read this Q&amp;A with the director. He said , the final scene was one of the earliest shots in my head. For me it answers the who, what, where, and why of our mystery. Part of the why, for instance, is distinguished by a physical trait shared by all the subjects in the shot. Then I watched the film again - and this movie is really nuanced. Once you see that detail and a few others you finally get what John is doing, and where Libby is headed. I'll let you see it for yourself.Overall, great acting and a visually beautiful film. Ahhhh - Give me a sequel!!"}, {"id": 14, "text": "Did not expect much from this movie - knew absolutely nothing about it and thought it would be another mindless, b-movie, cheap horror. Wow, was I surprised. Very much a worthy watch - from the red lighting creating a sense of atmospheric doom, to the body horror homage paying respect to the 70's/80's whilst adding to the genre, to the overall slow build culminating in one terror filled, crazy ending. A real gem of a movie - so glad I came across it. The acting was a little campy, but considering what it was going for (70's/80's horror vibe) I think it was (probably, hopefully) deliberate. If the cinematography was a little more slick this could have been even better - loved the sound mixing/editing though. More like a 7.5 - closer to an 8 but just not quite there. Really enjoyed it."}, {"id": 15, "text": "Dont read the  10/10 reviews they are just some crazy lonely women who fantasy on that dude The movie was boring and pervy as hell"}, {"id": 16, "text": "Two hours of build up for that.Spoiler alert: It's garbage."}, {"id": 17, "text": "A teen girl feels sexual urges for the mothers new perfect boyfriend and that leads to the discover that he is not human, as he is a killer beeing close to leaches, the blood sucking ones. The horror works."}, {"id": 18, "text": "A great movie ema horvath does a great job in the lead role"}, {"id": 19, "text": "This movie started out very intriguing and then it just dives. You have a creature that is never really verified, not seen except for his foot, could of did better than a foot. At the end your asking questions like what was this really about, what was his purpose, how did he get here, what does the light signify or mean, are the women for giving birth which is why he has replica's or are they used for a water source, just waaaaay too many questions at the end???? My advice don't watch unless you like scratching your head after?"}, {"id": 20, "text": "Shot really well, the time and attention to build the character's stories was well done. I'm still thinking about the ending!"}, {"id": 21, "text": "Was interesting enough in the beginning but it was very slow moving and then very strange and odd and weird!"}, {"id": 22, "text": "SEVERAL of the positive reviews here are specifically about the lead actor in the film. Is that all it takes for good ratings these days? Really...?The acting was god awful. There were so many things not explained in this movie that it just makes it infuriating. Seemed like an over the top CGI Lifetime movie. What a waste of time."}, {"id": 23, "text": "Click on their name and what it tells you is the account was freshly made and it's their only post. Bought!! Don't waste your time. A lot of missed opportunities for scares and thrills. Really lame. Also, the lead girl is supposed to be believable at 16?! She's 26! I was hoping for some crazy ending, but this was too predictable!"}, {"id": 24, "text": "This was the strangest movie ever, even for Sci-fi!! The coming attractions showed a handsome, buffed man walking out of the lake as the mother's new boyfriend!!! I definitely thought it was going to be a fatal attraction kind of movie definitely nothing involving mutants!!! HORRIBLE AND DISAPPOINTED"}, {"id": 25, "text": "OK!We get it: men are bad, white men are monsters. And we need to convince people of this using any means possible. Since the direct depiction of men as real monsters has been done ad nauseam, now people resort to allegories, fables and whatever can be used. What Lies Below is pseudo-scifi-ish horror film showing the terror that is to interact with men. Yes, women's lives become worse than Lovecraftian nightmares, they are imprisoned in horrific conditions , eternally damned. Women are used as nothing more than a procreation vessel, to generate more and more monsters...A suggestion: watch I Married a Monster from Outer Space. It is from the 50's and is much more entertaining than What Lies Below"}, {"id": 26, "text": "Absolutely horrible. The only thing good about this movie was looking at the hot guy without a shirt. Other than that this movie was crap."}, {"id": 27, "text": "Great work from an an exciting new director. beautifully shot and scored."}, {"id": 28, "text": "What Lies Below, on a formal level, is incredibly impressive and pleasing to the eye, from its camera work to its coloring, and of course, it is all pulled together with convincing dialogue, and a strong character performance. Don't miss out on this gem. It'll definitely be a movie to watch twice, three times, four times, and more... We want more from new dir. Braden Duemmler!"}, {"id": 29, "text": "Whatever you do, do not waste your time on this other garbage! I agree with the other reviewer, Mena Only seems to say 'baby girl' and not much other dialogue! The acting is terrible, the script is terrible, the screenplay is terrible.. it's a pity we Can't rate movies like this lower than one star"}, {"id": 30, "text": "I've never watched anything so bad or even close to this movie !!! Everything is just trash! Acting....I have no comments at all about this bad acting... No communication at all just single words yes oh wow great congrats  and nothing else !!!!!0/10!!!!"}, {"id": 31, "text": "What were they thinking while making this movie? Who are the idiots who decided to fund this film? It is lame. It is a stinking piece of trash. I can't believe an actress like Mena Suvari decided to do this movie. Please avoid it. There's already a lot going on in this world right now, this movie is no less than a pandemic.."}, {"id": 32, "text": "My five stars were for the first half of the movie which was building consistent tension and curiosity. I was kinda enjoying it until the SECOND HALF! It was like they had really decent writers who went on strike at the halfway point. Come on, my dog could have come up with a better half than this one! And it was a terrific cast doing the best they could in a very disappointing situation. Awww what MIGHT have been! Such a pity!"}, {"id": 33, "text": "Unfortunately very disappointing with poor acting and stroyline, eventually if you make it to the end its even worse"}, {"id": 34, "text": "I am usually do not like scary movies, but this one was well done. Great cast and acting. I didn't see the twist coming from the beginning and the ending left me and my friends debating on what really happened. I don't want to give it away, so just trust me and give it a watch. I don't think you will be disappointed."}, {"id": 35, "text": "This film start with a man marking the attendance, and a mother Michelle talking with her daughter Liberty in the car scene! As turnout, this film is about Liberty need to survive from a male monster John, who try to impregnate all the female seduce by him! Entire film full of boring conversation, and super annoying overuse scene! Such as, overuse of the driving scene, overuse of the taking shirt off scene, overuse of the searching scene, overuse of the flirting scene, overuse of the staring scene, overuse of the peeking scene, and overuse of the dining scene! Make the film unwatchable! Not a single killing scene show in the film! Pathetic! At the end, we found out a bunch of girls hidden in the basement's wall impregnate by John! That's it! Wasting time to watch!"}, {"id": 36, "text": "Time between boyfriend is introduced to realization what's happening is WAY too long. Movie lacks a plot and moves really slow, and not slow in a good suspenseful way. Slow as in this movie sucks."}, {"id": 37, "text": "Not bad but this is a very what you see is what you get sort of film. There just isn't much depth, detail or much character building involved. Aside from a few subtle insight and foreshadowing, you just watch what is happening.They story isn't overly creative but it will hold your attention. Makeup and effects are passable. It was a bit basic syfy horror but I liked the ending.It's not going to blow you away but it was fine for my rainy day."}, {"id": 38, "text": "Wierd movie. Couldn't get what is message in it. End i didn't like it at all"}, {"id": 39, "text": "Movie started off great about halfway through the writers just got lazy made the female lead do the dumbest things towards the end of the movie to try and escape movie didn't explain much so you don't even really know what it's exactly about very disappointing"}, {"id": 40, "text": "This was by far one of if not the worst film I have ever watched...OMG. A stupid mother, an idiot boyfriend and a daughter by no stretch of the imagination played the dumbest science student role for a sci-fi horrorABLE fim. Believe every last negative review about this film because they are all right. This film was garbage to the 10,000th power."}, {"id": 41, "text": "The film certainly lives up to the title as you are left wondering and trying to figure out what is going on the whole time! Creep factor to the max and a surprise ending leaves you throwing pillows at the TV in delight."}, {"id": 42, "text": "This film is all over the place. The girl being at camp plays zero part in the plot. We have no back story on the mom, or John. The pacing goes from 1mph to 100mph in an instant. No explanation on why John is non-human. It was more like an episode of 'The Twilight Zone'."}, {"id": 43, "text": "Edge of the seat thriller! An exciting ride, beautifully and sensitively written, unafraid of the dark edges, and pushing us to ask the bigger questions."}, {"id": 44, "text": "Overall there was a lot that I enjoyed about this movie! The atmosphere, pacing, and acting were all enjoyable. The story unfolded in a suspenseful, tantalizingly creepy way. But as the story neared its ending, it just didn't have the payoff I would have hoped for. And reading various ending explained on google searches was less than helpful. John clearly was a creature that was searching for a way for his species to adapt and overcome their aversion to salt water (hence his species' attempts are cross breeding). Fine, that's all well and good. And I appreciated the glimpses of his alien arms and legs every so often. But then they show his alien tongue and I was like ...is that all they're gonna give us? They didn't even give us the satisfaction of the crazy alien birth! Definitely a let down. But then it picks back up a little when he finally traps Liberty and forces her to swallow the blue light. However, the setting was quite confusing and I didn't understand why other Johns came in and started punching the walls to reveal other women? It didn't seem like a coherent manner in which to explain what was happening. Other folks online are asking is Liberty dead or alive? but I think the movie is obviously showing us that yes, she's alive but will go into a catatonic state like the other women. (And apparently the director discloses more information in an interview). Finally, I came across a site that explained the significance of the red hair, which actually was interesting, but.....had to dig to find that. There are some interesting parallels and inferences that can be made throughout this movie. But...something about it didn't quite hit its intended mark. I teeter on rating it a 6.5-7/10"}, {"id": 45, "text": "Just wow! I didn't expect that kind of performance. A very suspenseful movie with a good picture and acting! I'm impressed!"}, {"id": 46, "text": "Its a 5 star movie .. only if they end it well it could be 6.5 .. overall one time watch. watchable but forgettable."}, {"id": 47, "text": "Fun watch that kept me on my toes. It's definitely one of those movies that your thinking about for days after. Crazy ending--hoping to see a sequel!!"}, {"id": 48, "text": "If you like slow burn horror, were no one survives, you will love this. So bad , no reason to root for any one, . Invasion of the body snatchers, was another well acted, doom laden film. Not a date movie."}, {"id": 49, "text": "The ending is so weak it ruins anything that happened before it. The main characters make completely stupid nonsense decisions throughout the movie... Then they throw in some politics and take a shot at Trump. I know surprise right. Don't water your time on this one. Watch Session 9 instead."}, {"id": 50, "text": "This was pretty bad. Started out okay, but then it seemed the writers just didn't care anymore"}, {"id": 51, "text": "Wow, just wow! I started watching this movie and for the first 30 mins, it seemed good. But let me tell you, that it took a turn for the worse! That movie was H O R R I B L E! Absolutely atrocious! I think that the idea for the movie was there but the execution was awful! Do NOT waste your time!"}, {"id": 52, "text": "Okay, let's see ... all men are evil and all white men especially. so let's just use any and every screwy thing we can think of to stress the point.. man these so called actors must've really really really been in debt."}, {"id": 53, "text": "This is surprisingly good. It has that made in 1990s type feel in terms of horror style.What starts out as a teenager struggles to accept her mum's new boyfriend turns into something else...The acting is decent enough and the ending is very old school."}, {"id": 54, "text": "Not your average sci-fi thriller. This movie is extremely well shot with an intense soundtrack that kept up the suspense. Super creepy, I'll be thinking about the twist at the end!"}, {"id": 55, "text": "The different clues as the teenager Liberty tries to figure out the new man in her mother's life that's not normal &amp; the twist at the end is terrifying, not knowing if she survives along with others... It's the kind of movie you have to watch more than once."}, {"id": 56, "text": "I thought this movie was pretty interesting and just all around exciting to watch.."}, {"id": 57, "text": "This film is creepy and thrilling and keeps you on the edge the whole time . Dam that guy is hot even though he is creepy!! Great film must see !! We needed a film to distract us during these crazy times . Bravo !!!"}, {"id": 58, "text": "What Lies Below is a kind of a flick that could end up being a total trash filled with so-bad-it-hurts CGI and nonsense screenplay. You know, like the most of Syfy made-for-TV creature features. But this one doesn't deserve all the rage. Yes, the dialogues are pretty basic and bland but it doesn't kill the creepy vibe going throughout the whole film length. The acting is decent - Ema Horvath is good as an estranged daughter and Mena Suvari finally stars in a horror movie that is not a garbage (although it's still too hard to forgive her for Carrie 2 and Don't Blink).The best part of the movie is its visuals and lore. Lovecraft-esque fear of chtonic entities, hypnotic enigmatic lights coming out of nowhere and minimalistic synth soundtrack are making What Lies Below a thrilling eye-candy which is pretty much enough for a one-off horror movie. It doesn't reinvent the genre or offers any real plot twist (I mean, we all know John is going to be a bad guy, and effective Trey Tucker's performance convinced us right after we see him) but definitely worth a watch for its atmosphere and its actors that probably did better that the script could offer them."}, {"id": 59, "text": "In a time where quick answers are far too often handed to us, What Lies Below provides some MUCH needed suspense and thrill. Not only does this movie have an incredible soundtrack and keen cinematography but it also tells a story that will leave you feeling chilled and uneasy. It will leave you asking questions. It will leave you wondering. And, most importantly, it will leave you talking!On the surface, this movie is an eerie thriller. As it's name so aptly tells, however, far more lies below. Watch this movie more than once and you will find more clues that help you understand the underlying mystery that much more. Talk about it with a friend and you'll start to make connections between some of the numerous symbols sprinkled throughout this film. Like any iconic thriller, the suspense this film creates will follow you long after you see the final scene!Watch this movie! Then watch it again! If you are anything like me, you won't stop thinking about this movie until you think you've solved the whole puzzle."}, {"id": 60, "text": "A creature feature starring lampreys. Certainly one of the nastiest aquatic animals out there, both in looks and lifestyle. Perfect for a tale of horror, but What Lies Below also has science fiction and supernatural elements, which adds to the punch - or more accurately suction power.Ema Horvath does an outstanding job in the lead role. Although actually 25, she is quite believable as Liberty, a 16-year old dealing with major monster issues. Not only is she a fine actress, but her hair style adds to the illusion of a high school girl home from summer camp. Mena Suvari also turns in a great performance as Liberty's mom. The two interact really well on screen.Kudos for this movie would not be complete without mentioning the excellent lighting effects, creepy background music, and totally unexpected ending.Two stars deducted because several times the story went from horror to horribly gross, but all in all this movie is definitely worth a watch."}, {"id": 61, "text": "Sure, I will admit that I was suckered in by the movie's cover/poster, as it had some appeal and actually sold the movie well enough. And as I hadn't even heard about What Lies Below prior to sitting down to watching it, I had no idea what to expect from writer and director Braden R. Duemmler.Yet, I managed to endure and sit through the movie. I should say that the movie definitely starts out rather well and proves to be interesting enough, as director manages to maintain a good atmospheric sense of suspense to the movie.But about halfway through the movie the air started to seep out of the balloon rather quickly, and the movie slipped down a slippery downward slope, one from which it never recovered.What started out as being interesting and suspenseful ended up being a somewhat befuddling heap of nonsense and predictability. And that was something the movie suffered from really bad.The acting in the movie was adequate, taking into consideration the limitation imposed upon them by the script and storyline. Actor Trey Tucker, playing John, was actually putting on a great performance and stood out as the most memorable performer in this 2020 movie.For a horror movie than I have to admit that What Lies Below just failed on many levels. Writer and director Braden R. Duemmler just failed to deliver a movie that secured a spot in the horror genre as a memorable movie. And just as What Lies Below snuck in under the radar, it is a movie that will just as quietly and unnoticed disappear into oblivion.The effects in the movie were adequate, though. Yet it is simply beyond me why the lampreys in the jars were not utilized more and put into the movie in a more usable manner. They could have added so much more to the movie as a whole, had they been released and allowed to wreak havoc.The ending of the movie, though, was interesting. I will credit that much to writer and director Braden R. Duemmler. This was definitely not an ending I had seen coming, and it was one that surprised me. I liked the ending, but I will not spoil it for you. But it just wasn't sufficient to make up for the rest of the movie between the beginning and the ending.My rating of What Lies Below settles on a generous three out of ten stars. There was just simply too much wasted potential here in the hands of writer and director Braden R. Duemmler."}], "reviews_amount": 62}