{"name": "Arkansas", "titleId": "tt09139586", "reviews": [{"id": 0, "text": "Don't believe any of the negative reviews. I went into this flick expecting an average/so-so plot. Boy, was I WRONG! It's a great debut by director Clark Duke and Vince Vaughn, Liam Hemsworth and John Malkovich really shine in their roles."}, {"id": 1, "text": "Clark duke is on his way. I liked this one for sure."}, {"id": 2, "text": "Its not a perfect movie,but it dont deserve the ratings that people are giving to this title,a 6*It may be slow sometimes,but its a quite good and entertaining and it also has his funny moments,for me its a solid 8******** You wont regret it."}, {"id": 3, "text": "That's it. An intelligently written, well directed and well produced, greatly acted and tastefully photographed movie. Stylish and clear headed. Arkansas deserves at least a 7 on IMDB, like a lot of quite slow and clever little gems stuck around the 6. If you love cinema, do not miss this little jewel. Characters are graciously sketched in their lovely, human weirdness. You do not know a lot about them, but you can sense their past in their words, faces and actions. Liam Hemsworth is a little affected in a couple of scenes, but everyone else is credible even when exaggeratedly over the top, like Malkovich. Watch this movie if you want to watch a good, well-narrated and entertaining story. Cinema really needs this kind of productions, even if the ratings tell us that people need less quality."}, {"id": 4, "text": "Loved every minute of it.....intense, dark, witty, introspective,. Kudos to direction and screenplay."}, {"id": 5, "text": "This movie is based on the novel Arkansas by John Brandon and ids the directorial debut of Clark Duke. Kyle Ribb (played by Liam Hemsworth) is a small time drug dealer, working in a big time organisation ran by drug Kingpin Frog. We see Kyle about his business, then he is seen sat in a house, the house seemingly his, where he is seen watching TV. Then there is a knock at the door, to which Kyle ignores, other that a quick look. Then there is a noise of someone trying to pick the lock. These leads Kyle to get up from his chair and check out the perpetrator through the spy hole, then waiting. As the guy manages to open the door, Kyle is ready behind the door to take him to the floor and restrain him. Next scene is the burglar tied up and gagged in the cupboard, Kyle then gets a visitor, someone he knows from the gang. He is very impressed that Kyle has managed to do what he has done in restraining the guy, saving him a job. This leads to Kyle getting a promotion. The promotion involves moving to Arkansas to move wholesale. He then is seen meeting Swin Horn (played by Clark Duke himself), Swin is a very talkative and confident character, which seems to annoy the placid, quieter Kyle. Their first assignment is to drive a flat bed lorry with the wholesale product hidden by an assortment of boxes with pictures of sinks on them. While on their journey to Corpus Christi, the rope holding down the tarpaulin breaks, forcing them to stop off to try and get something to assist in keeping it down. This is where they run into park ranger Bright (played by John Malkovich). He inspects the truck and the two think that they are caught. As it happens, Bright also works for Frog, and has been trailing them all the way from their journey's start. This then sets up the story-line and shows the journey that they have. Vince Vaughn also stars in this movie, i will not go into detail about that as i do not what to give away any spoilers. Vivica Fox and Eden Brolin (the daughter of Josh Brolin and Alice Adair) also appear. The movie is split into chapters, some of present and some that go back to past times to give you the insight into the characters. I will say that the movie is very slow to build, i know you have to character build, but at times it seemed to drag. There are very good points that happen to, so please continue and don't give up on it. The black comedy elements are funny and will bring a smile to your face, if you like that, it also has some violent scenes too. Clark has elements in this movie that would not be out of place in a Quentin Tarantino movie. The guy has talent and i think will be one to watch for in the future as this will be no doubt a learning curve. I think that due to the pandemic, this movie has been wrongly chosen to be streamed, and released before a cinema audience saw it. I think that the big screen may have helped to launch the movie, rather than being a movie on TV that you can just turn off before it gets to the good bits."}, {"id": 6, "text": "I saw this movie without watching the trailer, without reading anything bah it. Sometimes I do this like a blind buy. The film is slow at times n tries hard to be a cool slick flick. Vince Vaughn saved this film from being a disaster. He once again played a drug dealer like the one from True Detectives, who wants to start afresh but..... The star cast is good, Eden Brolin's got a very different n attractive face. All in all, this one will not leave any impact."}, {"id": 7, "text": "Starts so bad but gets sooooo good You gotta stay in there and let the low budget beginning play out. Then, ZINGA!"}, {"id": 8, "text": "The film runs with two plots that have already come together. We are first introduced to Kyle (Liam Hemsworth) and Swin Horn (Clark Duke writer/director). They work running wholesale drugs out of a park ran by Bright (John Malkovich). They all work for Frog (Vince Vaughn) whose rise in the drug business is the second plot line.The plot is not spectacular. It is your basic drug crime without there ever being any cops. What makes the film such a joy to watch are the characters. Overall the film reveals a Tarantino influence. Good Job Mr. Duke.Guide: F-word. No sex or nudity."}, {"id": 9, "text": "I liked it. Not completely predictable. Easy to follow. Good ending."}, {"id": 10, "text": "Like some guy here in the comments I saw this movie without knowing that was Duke's debut and this was a good surprise when I saw it, He showed some maturity that I wasn't expecting from him. Of curse it's not a Tarantino's movie, but he showed talent. Sometimes the movie is slow, but it's tense. I think it's more like a No country for old man than Pulp Fiction (not getting close to any of these) But if you want to see a good movie, enjoyable and good acting (Vaungh and Malkovich) this is one of them."}, {"id": 11, "text": "The beginning of this film was abit slow but its really enjoyable after you brush past it, even the cast work well together surpised to even see liam Hemsworth &amp; Clark Duke in the same movie as the main protagonists two totally different actors but somehow the pair work well within the film and really enjoy the chapter cutslides some work with a film e.g Kill Bill and others but some dont work but this jelled well but I can understand some people don't really like these type of movies but if your open its worth a watch"}, {"id": 12, "text": "I can't figure why this movie's got a score under 6.... It's a good road-action movie with drama and comedy elements. It has good twists, good acting., good music and some funny moments. All in all it's at least a solid 7. Watch it!"}, {"id": 13, "text": "Loved this film for so many reasons I didn't expect. There was comedy that caught you off guard, important moments that you felt deeply, conversations between the eyes of the characters and tension that you could read. I did not realize how much could be said with the two words: I know. but these small details are what make up characters that you learn to love. John Malkovich plays a wonderfully, strangely unique character; alongside Clark Dukes quick-witted one liners you find yourself laughing during circumstances of a crime story you would not normally laugh at. I appreciate the colors and costumes used - bright unique pieces in a retro dreariness of a small town. I feel that this speaks to the overall feeling of the story - that this isn't just a normal crime story, that there's something more, bright, funny, odd that you wouldn't expect. This film made me want to buy track pants and I will wear them while I watch it again."}, {"id": 14, "text": "Some people over judge or get caught up in saying it it's obviously influenced by such and such, HEY LISTEN we all are!!! Yes it had a Tarantino feel to it but I think Tarantino is overrated, he uses violence instead of acting, hateful 8 was his best by far because of kurt Russell and the cast. His movies have way to much dialogue as well!!, back to Arkansas it has a decent pace just the right amount of action and violence and a great moral to the story. I've never seen or heard of a drug dealers life ending well it always ends in a extremely negative way. This movie seems real and its probably the 1st of its genre to not have the f bomb every 2 seconds or the c word . Which shows excellent writing. Swearing is a cop out, a short cut I'm no preacher I swear a LOT but it's not always needed but is always used and to much!! Drake 9 stars on your 1st movie, hats off keep with it you'll only get better. Oh and p.s. Vince Vaughn is an extremely underrated actor!!"}, {"id": 15, "text": "Wish the soundtrack was available. Watched it 3 times for the music alone"}, {"id": 16, "text": "While the subject matter wasn't always relatable, Duke managed to create a perfect depiction of life in Arkansas and beyond. The cinematography was excellent and the score was an absolute treat. I'm not sure why so many people have such negative things to say. The only way this movie resembled Tarantino was in good ways. A chapter format or focusing on the antagonist are just elements of an interesting movie. Y'all should chill."}, {"id": 17, "text": "This is a well-paced and entertaining thriller, but also has a great feel. The direction, acting, music and the whole look and atmosphere of the movie are superb. It might not be to everyone's taste as it is quite original, but I really enjoyed it."}, {"id": 18, "text": "Arkansas is a great drug dealers movie showing how easy drugs are moved across this country and from state to state. While watching, I felt as though I was watching a Tarantino movie. They even broke it down by chapters with numbers and names. John Malkovich lived up to his stellar acting roles in the past days. Vince Vaughn actually did a good job on acting in this movie and not just some comedic role. The director and actor Clark duke was a surprisingly refreshing role. All the actors did a good job. With a mix of action, comedy, and mystery I highly recommend this movie you will enjoy it. 🌈😎"}, {"id": 19, "text": "I'm going to keep this review short and simple.'Arkansas' is a great movie with an original story, and suprises in every scene. The ending (and a big part of the movie) is tense, and emotional. Even though it might not be like the 'Tarantino' movie people had hoped it would be, it is a very good, enjoyable movie."}, {"id": 20, "text": "Ok..yes im from Arkansas so I felt like I had to watch and was actually surprised by this movie. The cast was great and pretty good movie!"}, {"id": 21, "text": "Arkansas is not an original, well developed or interesting movie. First, even the casting is good, acting is pretty weak. Second, movie's pace is extremely slow. So consequently it is difficult to be interested for almost 2 hours without getting bored. Lack of action does not help either. Last, it could have been far better with just a more risky script. Looks like the director just copied several cliches from other movies. So, overall I do not recommend this movie."}, {"id": 22, "text": "Lots of reviews spend time nit piking here and there and never really make a point that matters. Of course this isn't a big budget block buster. It isn't one with a bunch of big money folks behind it. But what it is is a mid level movie with a director who new the area he was making his movie about, actors who were enjoying their roles and were talented enough to show it and a script taken from a book that was written by a man who understood Elmore Leonard. This movie is well down on all levels, makes good use of its limited budget and produces a thoroughly enjoyable movie. That is all you can ask for."}, {"id": 23, "text": "Duke's full directorial debut took place.Obviously, the kid is a fan of Tarantino movies. The film is a replica of Pulp Fiction, and not very successful. The plot is unclear. Incomprehensible gluing of a plot (events change on each other it is not clear how).The acting is also not perfect, the image of Swin rages throughout the film.It should be added that the film is very long. It seems that the plot of 3 pages was simply stretched for no apparent reason for such timing.4/10. Boring."}, {"id": 24, "text": "Wow, how was this mess dragged out to 117 mins? This screenplay was all over the place, convoluted with major plot and technical issues. Actor turned-newb-writer-director Clark Duke was awesome in his role alongside the stellar cast of Hemsworth, Malkovich, Fox and Vaughn, but his failure to direct his actors was evident. His camera work was actually decent, but the long dragged out and some unnecessary scenes that were also all over the place, needed major editing/cuts to bring his screenplay - jointly written with amateur writer Andrew Boonkrong, down to at most an 80-90 min runtime - with faster pacing. The score, sets, location and cinematography were great, but I feel if this screenplay was reviewed and corrected by a seasoned writer, I would've enjoyed it much better. I feel that great talent was mostly wasted in its runtime. Sadly it's only a 6/10 from me."}, {"id": 25, "text": "An accurate depiction of what I'll loosely call organized crime in the part of the country immigrants avoid. A self proclaimed criminal mastermind is paired with Lenny to go eastbound and down. Their boss tries too hard to correct the mistakes of his mentor, whom he betrayed like Palpatine. While buffers are useful in the drug business it would be just as useful to know who your boss is. If Tarantino has taught us anything, it's that you can bail out and then dispose of subordinates (Jackie Brown). But that would be too much like right. The business is full of scumbags these days; scumbags who can never quit and who are too proud to ask for help. Before you get promoted to Oklahoma, you gotta go to Arkansas."}, {"id": 26, "text": "If you like movies like Sweet Virginia or Message from the King you will like this film a lot. Great writing, noir-like story and simple but effective directing."}, {"id": 27, "text": "Really good movie. Would have like a better wrap at the end, but it didn't destroy the film. Maybe too much content for two hours, but great flick nonetheless."}, {"id": 28, "text": "Best film I've seen in years. Vaughn proves he is still money, baby."}, {"id": 29, "text": "This is another movie I was expecting to be just kinda meh, but I read some of the reviews on here and some of them are really good, so I gave it a shot. Almost 2 hours long and I loved every minute of it! Theres not a dull moment. I'd be wildly surprised if you got bored at all during it. I didn't even realize the guy who plays Swin directed the film as well until the end credits, but he did an outstanding job! 10/10. I highly recommend it!"}, {"id": 30, "text": "For This cast how highly disappointing! Average plot, it wasn't grabbing my attention. Quentin Tarantino wannabe esque. Idk just not worth a watch."}, {"id": 31, "text": "Not much to add to the title of my review really . Great cast and nicely shot deliberately slow I enjoyed it ."}, {"id": 32, "text": "It was a great cast in this movie. Story was simple and very slow and it continues with the same pace untl the end. Its likeable."}, {"id": 33, "text": "It is great to see famous faces in this film. The plot is slightly confusing. Though it still interests me, I don't particularly find it gripping or intense."}, {"id": 34, "text": "Just bad all around. Sad to see Vince have to go this low. Director tried so hard to give the film a Quentin vibe and it just didn't work"}, {"id": 35, "text": "Arkansas, symbol of morality, great premise for gangster movie, showing rise of rookie drug-kingpin and his zany side-kick. But there's apparently trouble in paradise, at Deep-South Underworld HQ, unable to resolve daily problems as would organized, CEO-led Op. Leads to some plot incoherence, where story-line becomes victim of small-time decisions and reactions. Who's to say it's not the true Underworld, but it makes for a brooding sort of movie with slightly balked-at Finale."}, {"id": 36, "text": "Came across this title in the never ending search for something to watch. It was great! Took it at face value - no comparison to other films, directors -just something to watch and glad I hit play. Loved the quirkiness as well as how the pieces came together. Definitely enjoyed it!"}, {"id": 37, "text": "Slow, burn, dark crime. One of Vince Vaughn best roles i ever watched."}, {"id": 38, "text": "Awesome movie!!! Being from the South myself, the accent and southern knowledge was perfect! Great watch! It kept my interest throughout.. ⭐⭐⭐⭐⭐"}, {"id": 39, "text": "I watched this cold - just an amazon grab - and found it quite good. One description I later saw was dark comedy, and to me it is not that - quirky - off beat, perhaps, but it's not a comedy. It is a very cleverly written story of the madness and unpredictability of the outlaw life of middle level drug dealing. Well cast - nice performances - really great period musical score - nicely paced - well filmed. An excellent effort by a first-time director. If you go for interesting gritty crime stories, I recommend giving this one a try."}, {"id": 40, "text": "Well written and a hoot to watch. I wish there could of been some action between frog (Vaugn) and Bright (Malcovich) as these are two of my favorites. Overall some people might find it Shakey, but the performances are solid and the quirky characters believable and enduring. I wish more of this style of noir-fantasy fair was out there."}, {"id": 41, "text": "A great cast that needed a paycheck. Alimony and child support was due! Laughable lines with a corny music score. Somebody owed somebody a favor!"}, {"id": 42, "text": "Very good movie with interesting plot. Such a shame it didn't go to Theater but I would recommend for sure."}, {"id": 43, "text": "The main characters including Hemsworth and Vaughn are lacking depth. Hemsworth's character and his deliverance of lines was dry. Vince Vaughn was less than convincing in his role as a ranger.. The story was told in chapters, and from different perspectives and times, thus making an attempt at Tarantino style editing. Overall it was still kinda fun, if you like drugs and the crime scene. Skip this one if you are looking for a meaningful plot and/or characters with depth and development."}, {"id": 44, "text": "A film about drug dealers with a difference .... I have no idea how anyone with a brain can say this movie is no good. Really enjoyed it and surpassed my expectations. A"}, {"id": 45, "text": "Loved it, Vaughn as the Antagonist is always spectacular. Would have been a 10 if Hemsworth's character had more background to relate to."}, {"id": 46, "text": "I really wanted to like this movie but I had a difficult time getting through it. It was my husband's idea to rent it on Prime Video &amp; I agreed to watch with him even though I thought $5.99 was too much. I was correct! He nodded off several times so that's what he thought of it. The only reason I gave it 3 stars is because I liked Liam Helmsworth &amp; thought he did a great job despite what he had to work with. I'm also from Arkansas so hey had to give it a star for that! Liam was the only character &amp; actor in the movie I liked. I usually love John Malkovich &amp; Vince Vaughn but not in this film. Vince Vaughn's accent was from where I don't know but definitely not Arkansas &amp; his acting was over the top in a bad way. Could be he was trying to make up for the boring content but nothing could help with that. If it's on cable or Netflix &amp; you have absolutely nothing else to watch then maybe. Otherwise...not worth your time or money."}, {"id": 47, "text": "Drug dealers Kyle (Helmsworth) and Swin (Clark Duke) now work as Junior Rangers under the eye of Top Ranger Bright (John Malkovich) and all work for Drug Lord Frog ( Vince Vaughn) who Kyle and Swin have never seen. There are two murders, Bright and Nick (Chandler Duke), and are buried by Kyle and Swin. The murders were not done by Kyle and Swin and they stay put so as to not be believed guilty by running away.There is basically no story here. Kyle and Swin stay put like nothing has happened telling all who want to know that Bright went to Oklahoma with an Indian girl.Footage of how Frog became a big drug lord is of no consequence and we didn't need to see this footage. Like I said there is no story here. Frog sends Barry (uncredited) to find out about Bright but he gets killed by Kyle. After a long time Frog sends a couple of his men to take Kyle and Swin out.And that's it. No story. Just a slice of life blown up into a nothing movie. We kept waiting for things to happen and, well, they didn't. This is bland, but some may consider it watchable, and , of course, I don't. I will say that Vince Vaughn was completely miscast here. He always looked like an open book .... like an ordinary person in loud Cowboy Western shirts. He never had the calculating look of a drug lord. He just looked like an innocent person at all times.Oh, Arkansas as the title also made no sense at all.Notables: Michael Kenneth Williams as Almond who Frog goes to work for and ends up betraying him; Vivica A. Fox as Her, who gives the orders from Frog for Kyle and Swin to make drug runs; Eden Brolin as Johnna, Swin's girlfriend.The acting is good for this no story, and some may consider some of the banter funny and, of course, I didn't. (5/10)Violence: Yes. Sex: No. Nudity: No. Humor: Questionable. Language: Yes, but not oftenRating: C"}, {"id": 48, "text": "Great movie for a quiet night. Did not have much expectation but was happily surprised."}, {"id": 49, "text": "I figured with the cast this movie would be good or decent. The movie was terrible I could only watch about 30 minutes of it the acting was so bad. I feel sorry for Hemsworth....."}, {"id": 50, "text": "Vince and Liam deserved better! The movie had spurts that were interesting. The last 10 minutes were the best part. Better 5han seeing reruns and movies older than 10 years though! Vivica was good in her role."}, {"id": 51, "text": "Great directorial debut from Duke can clearly see his film making is influenced by Tarantino and the Coen brothers. This is a classic example of Hollywood influencing how people rate movies this is better and more enjoyable than Once upon a time in Hollywood but because Hollywood likes it, and it's directed by Tarantino is a  cinematic masterpiece . Lastly I really think people who rate movies on IMDB need to understand how to rate movies with context applied ,weather you liked it or not, again with context applied is it a 1/10 really ? Ridiculous!!!"}, {"id": 52, "text": "This is one of the most incoherent movies I've seen in years. Shot to dark. Looks like the long night from game of thrones. A waste of two hours."}, {"id": 53, "text": "Every three months since 1968 we went to my grandparents in SE Arkansas(Bradley County). My dad talked about running the stuff(likely alcohol) in the 50's until Vietnam and when his dad wanted his Coors beer. The DFW area was the source for it. I was told to stick to the black top and not venture out after I could drive when visiting my grandmother. Coming from Dallas, I felt the eyes and ears upon me. Little did I know my last name gave me a little carte blanche in the county. Decades later I find my great grandparents home was a historical period home and up for historical designation and our name was the reason. It's no longer alcohol but chemical concoctions. Not my path in life."}, {"id": 54, "text": "This movie won't be for everyone but shows the less glamorous side of drug dealing in the south. Not a movie that has predictable outcomes like others in the genre. The music is good and fits in well with what's going on in the plot. The pace of the movie is slow but not in a bad way. Give this movie a watch."}, {"id": 55, "text": "Great read on the source material, an engaging and confident piece of cinema akin to No Country For Old Men, shot with the patience of David Robert Mitchell. I particularly love the atmosphere and exploration of the old-westernized outlaw spin on southern crime, as rich in character as the Ozark series."}, {"id": 56, "text": "Had funny moments but lacks an entertaining story. World recommend but won't watch twice"}, {"id": 57, "text": "This film start with a man Kyle watching TV, an unknown man break in his house, and another man Colin tell him to go to Arkansas scene! As turnout, this film is about Kyle and Swin work as a drug dealer under a boss Frog, who disguise as a used items buyer! And eventually Frog want to eliminate them for stealing his money! Entire film too long, slow, and full of boring conversation! The narration voice in the film, also make the film unwatchable! Barely intense scene is, Kyle stabbing one of the twin brothers' eyes in the toilet! At the end, Swin died! Kyle give a bag of money for Swin's girlfriend Johnna, and tell her go to Swin's sister house! Kyle kill Frog to take over his drug business! Still have a post credit scene! Johnna driving the car along the road! That's it! Another disappointed film!"}, {"id": 58, "text": "Arkansas was another fine and solid film that was realeased this year and it had some good moments and performances in it,Vince Vaughn was by far the best actor in this film and he showed that he has great range as a actor and to me he is better in more dramatic roles and movies then in some disposable comedies,story is on paper very simple but that is why i liked it ,it doesnt try to be something big or enormous but it takes a nice easy going story and turns it into a good time in front of screen,rest of cast was solid,Luke Hemsworth was good here,but he lacked personality and he felt lifeless in some moments,script was engaging in moments and it reminded me of some Tarantino films,Arkansas was a solid time in front of small screen"}, {"id": 59, "text": "If you love action then this is not for you but there are a few violent scenes, this is a crime, drama movie. it's for your story lovers. im not sure if it's based on a true story but it's of those actual events stories. I like it. it was entertaining."}, {"id": 60, "text": "This was a nice hidden gem. Not action packed but a good story, a good cast, with a good performance from the two lead actors. I don't think this is going to be on any top 10 lists but it's enjoyable if you're looking for something to watch. I'd say this is a drama with some tense scenes and comedic tones."}, {"id": 61, "text": "Went into this movie not knowing much and was tempted to turn it off twenty minutes in but I'm glad I didn't. Not a predictable movie and kept me interested. A very good watch."}, {"id": 62, "text": "I don't think it deserves such a low rating. I had no expectations when I hit the play button, cause I came across it by a coincidence. I loved the noir feeling about it. This could very well be worth a second view. Hemsworth best role yet."}, {"id": 63, "text": "It kept my intrigue the whole time. I liked the characters.. acting was great.. nice soundtrack.. decent unique story.. no way this deserves a 5.9. I have seen worse movies rated 7 or higher. Nice one Clark Duke, this is a strong debut movie. I look forward to seeing your future works 👍"}, {"id": 64, "text": "Think In Bruges, Seven Psychopaths and Fargo and you've nailed it. This film is much better than the current 5.9 rating and has a great cast and intricate storyline. Needs two viewings to master the ins and outs.I'll watch it again."}, {"id": 65, "text": "..movie.. not to many loose ends and great play.. u want to be a friend of Swinn when the movie ends 😂"}, {"id": 66, "text": "The storyline is actually exciting, weird that the movie has such a bad overall score."}, {"id": 67, "text": "For most of straight-to-Netflix movies, lately we have come to expect nothing but five lines for a semi-retired blockbuster actor to utter in the trailer - and that was more or less it.This one is great. John Brandon's novel is the movie. All the great lines and the wisdom is at the center of the movie. The plot in Arkansas (a twist and turn crime story about small, medium and kind of big-fish drug dealers down south) is just a vehicle to transport viewers from one great insight of existence to the next.Best movie on Netflix for a while."}, {"id": 68, "text": "Love the way it was filmed. Loved the cast. Acting was spot on."}, {"id": 69, "text": "Solid debut movie from Clarke Duke, not perfect but well worth your time. A well deserved 7 stars!"}, {"id": 70, "text": "Not a blockbuster, but a gripping and well directed film following a pair of low life drug dealers as they progress. Enjoyed this one"}, {"id": 71, "text": "At time of writing this has a 5.9 rating which seems far too low. Whilst not without its flaws I found it an enjoyable watch. Just goes to show, you can't always trust the ratings."}, {"id": 72, "text": "This was a fun to watch film if you enjoy neo-noir crime movies. The pace was a bit on the slow side, but I found the characters believable and interesting. The cast was outstanding with Vaughn, Malkovich and writer director Duke. There were a few issues with the plot or sometimes lack of one, but it didn't ruin the film for me. It won't be every viewers cup of tea, but fans of neo=noir should like it."}, {"id": 73, "text": "A long, slow, torturous, Tarantino wannabe wreck. I suffered through the whole depressing, miserable affair. Complete with bland acting and a terrible soundtrack. I think I'm being generous by giving 3 stars.👌"}, {"id": 74, "text": "Glad I stumbled upon this gem!! Disregard low ratings from reviews stating that this is a wannabe Lynch or Tarantino knock off as if no other director is allowed to make a dark drama with comedic overtones. Congratulations to Clark Duke on his excellent directorial debut. Arkansas is very good and ultimately all loose ends come full circle and tie together nicely. Reminiscent of the great movies Misery, Fargo, A Simple Plan and No Country For Old Men."}, {"id": 75, "text": "Solid directorial debut. Witty. Good characters, well paced. Reminds me of The Comedy with Tim Heidecker. Really don't get the low reviews. People need patience."}, {"id": 76, "text": "So slow, I ended up reading the news to get more drama.This is the poor studio's version of True Romance. Definitely not worth your time."}, {"id": 77, "text": "A laughably bad film. This is the second recent horrible film I've seen with Malkovich. He used to be a highly respected actor, now he does dreck like this. I watched it because I like Vince Vaugh, but he cannot redeem a film as bad as this."}, {"id": 78, "text": "Its ok, the kind of movie that you probably wont rewatch again. Slow but never boring. I understand the straight to video part, the movie was really nothing special but still a good time waster while at home during lockdown."}, {"id": 79, "text": "I had trouble following this movie. I wanted to like it but it was terrible."}, {"id": 80, "text": "Its not boring, it is a relaxed and light movie. No unnessecary drama. Nice cast and acting, decent soundtrack. The story is nothing special but it does not want to be anything unique at all. I really liked the nihilistic vibe. Whats the meaning of life? The movie does not care. If you like drug dealer movies, watch it. If not, watch it anyways."}, {"id": 81, "text": "People saying this is Tarantino-esc are either working for the Films PR agency or have the serious eye and ear issues. This film looks and feels like a feature length school project. It looks like it was graded by a 5 year old and is badly lit, nothing matches up, everything feels stilted and is so slow it hurts. As you may have guessed I'm not a fan, I didn't finish it, it was as beyond painful"}, {"id": 82, "text": "A dramatic film about the drug trafficking mafia. Contact in chapters as if it were a book. It tells in two moments the story of a drug trafficker who acts as a marksman to the boss. And also about shooters who make specific mistakes that complete their simple tasks. And both stories intersect at one point. Interesting Quality performances. Some grotesque violent scenes. The beginning is quite parsimonious and even meaningless but the story is worth watching."}, {"id": 83, "text": "Clarek Duke proves to be solid and capable in this enjoyable crime romp. Though it is lacking, this is one of the better films of the firs half of 2020. Looking forward to more from this talent writer/director/actor."}, {"id": 84, "text": "Arkansas as slow burn, droning incarnate, is my latest review. It is based on a novel of the same name by John Brandon. The cast of Arkansas is like a bunch of recognizable actors going unrecognizable. Case in point: Co-star and Illinois native Vince Vaughn wears a St. Louis Cardinals hat while listening to their games on an old radio. Oh and director-slash-star Clark Duke sports an adult film mustache and kinda looks like a chick (oxymoron alert).Anyway, 2020's Arkansas is not a bad feature debut for the 35-year-old Duke. Filmed at a snail's pace with zoom shots, whip pans, and a time setting that feels mostly 80's and 90's, Arkansas appears like something Quentin Tarantino would have done pre-Reservoir Dogs.In regards to Arkansas, you get a country-fried rock soundtrack, acts of brutal violence minus the action, and stories with chapters attached a la Pulp Fiction. Clark Duke, who was obviously influenced by directors such as S. Craig Zahler, Steven Soderbergh, and Tarantino (mentioned earlier), is a visual and camera hot dog helmer. Unfortunately, his bitty storytelling sensibilities in Arkansas don't quite catch up to his keen eye behind the lens.The performances in Arkansas are underplayed yet solid with Vaughn, Duke, and Liam Hemsworth being the standouts. Their dialogue readings are slow, philosophical, and drawn-out. Yup, Arkansas may have a running time under two hours but hey, it kinda feels like three.With music mostly from The Flaming Lips, a distributor by the name of Lionsgate, and a knack for having Johnny Lee's Lookin' for Love never sounding the same way again, Arkansas is about two drug dealers who take orders from a callous kingpin who they have never seen or met. In 2018, the normally fast-talking Vince Vaughn starred in the glacially-paced Dragged Across Concrete. Expect the same results here. Call it Arkan-drawl. Rating: 2 and a half stars."}, {"id": 85, "text": "If you compare this movie to the junk released these days it's a SOLID 10/10! Especially if you were expecting an average movie. I was shocked by this one. I totally loved it! If you compare this movie to 80's and 90's movies, it's about an 8.5/10.This is my first review, and I only ended up here because I wanted to see if it was directed by Tarantino. I'm pleased that it wasn't directed by Tarantino because the industry direly needs more talent."}, {"id": 86, "text": "Really strong characters. Good, complex plot. Clever, funny dialogue."}, {"id": 87, "text": "Excellent casting, the South is true to life - in general, kinda hard to truly capture it. I don't want to ruin anything, so I'm not gonna say anything else. But 5.9 rating? On this movie? This is why I don't let ratings stop me from watching movies."}, {"id": 88, "text": "Very tarantino in its direction. The plot is good and keeps you on edge untill the end. Thought it was just a great film to watch."}, {"id": 89, "text": "Movie starts good, like a black comedy with clumsy criminals, after Bright (John Malkovich got killed) the story is like going to nowhere and get stuck with no gas. I didn't like it Clark Duke directional debut, I didn't hate it either. The thing I hate is the family leverage 'cause his brother is worst actor than Jaden Smith. And that's saying a lot."}, {"id": 90, "text": "A little slow, not much of a plot but I thought Vince Vaughan was cool in it."}, {"id": 91, "text": "Average crime film, has some Tarantino feels to it in terms of the chapters the story is split into. some good acting from the cast mainly Vince Vaughn. kinda got bored from the tracking shots and montages just to fill in the 90 minute runtime, but some decent action, acting and music made up for it."}, {"id": 92, "text": "I ve just seen this movie and I can say it is one of the best movies seen in the last 6 months. It is in the style of Tarantino yes, but you can't rate it so low just for this. I really apreciate Clark Duke for directing and acting surprisingly good at the same time, I thought isn't easy to act and direct in the same movie, plus he is a young talented guy at the beginning of directing world. This movies was a succes!"}, {"id": 93, "text": "The most difficult thing in film to convey is intent, to say one thing and act one way is one thing but to think differently to harbour misgivings, to walk around with jangled nerves, to walk around terrified much to the audience's purview make the whys and wherefores in character development the utmost in priority; that is, you must explain what is unfolding before us one way or another, there is no one perfect way, but that said it must be done.Now that being said, the film is a fine film, a very artistic film by artists all the way around including surely the novelist although I did not read it, if the novels are analogous to the adaptation then yes this is a creative. And I know he knows what I am about to say because the author probably in the book tried many times to explain the character intent throughout the film, BUT , how the hell can two characters one with evidently evincing a high acumen can go along as a foist to an utterly unpractical idea like somehow , magically everything is just going to be OK. To this I say no way, there is no way two people can be in league to something that cannot be explained, especially by two supposedly drug dealing aficionados that assume that breaking the number one rule in the drug business is somehow OK, WHAT? So you are telling me , robbing the big boss, never ever giving your boss the money for an illicit high pecuniary transaction does not come with serious repercussions is somehow OK with our two protagonist. And worst, they never even discuss this matter and collude with an innocent girl-friend as if they are going on a picnic with all their newfound fortune, oh cool, we just came up on all this free money, what a joyous day, a windfall, god is good!'Hell no, there is no way this would ever get this far without these people at least tripping really hard every single time they leave the house or start their car let alone go to another drug run , give me a serious break!That is a major plot-hole I'm sorry but that' s just how it is, and although they tried to explain it with lil' slices of character development a long the way in the way of psychological idiosyncrasies, it just doesn't make any sense, even Ol' girl, the gf suddenly fell under the spell, they weren't even in some drug induced stupor!But I did give it a ten because the thing is way cool to watch, and fun and creative!"}, {"id": 94, "text": "An enjoyable film to watch on a Saturday evening. I wanted an easy watch, where I didn't have to think much and I could be entertained and this film did just that.Good acting and you can empathise with how the characters got into the situations that they did.Give it a go! I didn't read any reviews nor did I watch any trailers before I saw the film and that was probably a good thing!I think people rating this low, is somewhat not fair, but I didn't inflate my rating either, I think it should be a solid 6."}, {"id": 95, "text": "Well, first to say, I don' think the movie goes slow, it's just not tense, but for its genre there is nothing wrong with that. It's an interesting small town drug players story with good characters. Goes rough as for rednecks. I find it a nice touch for a scenario and well played, well screened, so I'd say go for it."}, {"id": 96, "text": "This one is best watched without looking at the score"}, {"id": 97, "text": "At time of writing, the IMDB RATING WAS 5.9 - so unfair. It is a witty, gritty story of likeable but immoral gangsters who rise up the food chain and almost have their cake and eat The great script is matched by great acting by all the top billed cast, In particular, Vince Vaughan has taken a major step towards the Oscar league."}, {"id": 98, "text": "This movie is good! The people who rated this movie bad, probably eats up everything marvel and all the other Hollywood crap, puts out every year. An entertaining story, fun characters. Sure it's not a Tarantino classic, but much better than all the other crap that gets put out there all the time."}, {"id": 99, "text": "I knew Clark Duke as more of a supporting role in comedies so when I saw that he directed and written this, I was pretty impressed. I mean, the movie lacks some structure, its way far from an Oscar winner, but its not bad. I think the first half was pretty good actually, the second was the one lacking... he clearly has a lot to learn. And the ending... didn't liked that."}, {"id": 100, "text": "I mean I kinda watched it and was waiting for something to happen, but it really didn't. It wasn't horrendous but the whole story felt a little bit lacking in substance. It's worth a watch if your stuck for something watch, but it sure won't blow your mind"}, {"id": 101, "text": "I enjoyed it. It somehow got me to think of the Cohen brothers earlier movies. I'm usually not to keen on Vince Vaughn but he put on a faceted character. Also nice to see John Malkovich and Michael Kenneth Williams in here too. I won't give away any spoilers, but it you like a slow driven crime drama with some flair of existentialism this one might be for you."}, {"id": 102, "text": "Debut piece of the director, hands down a great job. Nflix is rampacked with objectifying, gory, lazy stuff. Genuinely enjoyed the film - nothing is perfect. I did hope malkovich would have had a massive role as he was just divine. Tarantino comparisons are justified, but at least for me in a good way, it's more about creating characters that are all somehow the protagonist. The (almost complete) lack of terrible stereotyped sexist female characters and cheap appeal of sex and graphic violence felt like a welcome break. I don't understand the hate - my expectations watching this totally blindly were exceeded. Maybe I enjoy a slower pace. Give it a go, 100%"}, {"id": 103, "text": "The IMDb rating (5.9 at the time), put me off at first, but hey Vince Vaughn, John Malkovich, so I gave it a go. Glad I did, really enjoyed it. I get the criticism of lack of character development, but great performances throughout and well scripted. If you like gritty movies you won't be disappointed."}, {"id": 104, "text": "Quite a quirky film that I found worth the effort of watching to the conclusion.Echoes of the Coen Brothers and that type of dark, gallows humour, which may account for some low scores from watchers who may not appreciate it."}, {"id": 105, "text": "Not quite as bad as the trash that Wes Anderson gets away with but pretty damn close! I was buzzing when I started watching this piece of crap and it killed my buzz. Can't stand that fat kid that plays Swin! This movie sucks!"}, {"id": 106, "text": "I had considered turning this off after 20 minutes but I thought I'd give it a chance. Big mistake, this movie is pointless, the acting is subpar and the soundtrack is full of obscure tracks that neither fit or compliment the film. Talk about miscasting, none of the characters are likable, The story line just doesn't add up, and the chapter titles are just so cliche'd. This movie is just numb with no redeeming features, even John Malkovich is awful, and Vince Vaughan?! Cliche hipster garbage!"}, {"id": 107, "text": "Watch it. Backwood-noir, Tarantino-esq, dark comedy. A refreshing spin on an over played genre. Very nice directorial debut, Clark Duke is awesome."}, {"id": 108, "text": "Of course if Hollywood makes a movie about rural America, it has to use the opportunity to make all the white people look like low IQ morons, weirdos, degenerates and backstabbing scumbags. But okay, it's a movie about drug dealers and for that it's fairly entertaining and there is some funny and clever dialogue. Despite their unflattering roles, some of the actors are still kind of naturally charming and the music is nice music so it's got that going for it I guess."}, {"id": 109, "text": "I watched the whole movie just hoping it would get better as there were hints it would, but it just got progressively worse as it went along. The dialogue seemed like it was written by a high school drama student, and the plot was terribly uninteresting with minimal character development outside of Frog (played by Vince Vaughn).You could tell the movie was trying really hard to put forth a gritty Tarantino-like vibe, but the lines that were supposed to be serious and thought-provoking were just overwhelmingly campy and ruined the whole atmosphere. Combine that with the uninspired acting and a plot that was straight up boring, and you have a complete waste of 2 hours. I would have been upset had I paid to see this in the theatre.I'll give it 3 stars because there was actually some nice cinematography and a few interesting tunes on the soundtrack."}, {"id": 110, "text": "Very good movie... Great cast, but did I get Keyser Söze'd?The film starts out with an interesting premise, stays interesting, not hard to follow, and we find ourselves wondering how the cast is going to work together. They all seem to be too way different at the core to create cohesiveness, but it was great.Give it a look!"}, {"id": 111, "text": "I'd rate this a solid 8 especially coming from first time director Clark Duke but these reviewers are skewing the rating far too low so I give it a 9. Clark known for his typical smart-ass roles does a good job putting this movie together which he also acts in. Has it's own noir style and moves well. All the big name actors do a good job on top of a seemingly nice touch of underground southern scenery. Overall entertaining movie for an afternoon or Saturday watch."}, {"id": 112, "text": "Usually a movie is about the characters or the plot. This movie is has nothing. The characters are nothing and the plot is nothing. The movie is trying so hard to be cool and indie but the dialogue sits somewhere between Tarantino and Napoleon Dynamite.I read that this crap was shot on a Red camera with 17 stops of dynamic range but it looks like it was shot on a iPhone 5. The skies are blown out in every outdoor shot. Ever heard about ND-filters?"}, {"id": 113, "text": "A Tarantinesque crime-drama portraying the troubling subculture of Arkansas with much less body, excitement, or originality to even consider crediting Duke's cinematic debut any type of replay value."}, {"id": 114, "text": "Great cast and 1st effort by Clark. It reminded me of the movie A Better Place that was as gritty."}, {"id": 115, "text": "This is not a slow burn.... come on people! Vince you are classic in this movie. very nostalgic feel and realism. you feel for the characters as they gain and lose perspective. Also very real how only the viewer knows exactly what's unfolding and the characters make their own assumptions which is how it should work (in some cases)... I loved it and was glued to my screen... Well done"}, {"id": 116, "text": "This is a solid movie. It is very slow but it's an easy watch. The cast is stacked and Vince does a great job in a different role. The movie utilizes chapters to explain the story and how the characters got to where they are. This definitely slows the movie down as climax will be building and the movie will seemingly cut to a different point in time.Long, slow watch but I still enjoyed it."}, {"id": 117, "text": "This movie is the very reason I don't do Trailers, synopsis' or reviews. Had I known the vibe of this story going in I wouldn't have enjoyed it nearly as much.For lack of a better way of explaining it, I'd call this Reservoir dogs meets the Beverly hillbillies. The kind of movie that keeps you engaged throughout. The lead actors are phenomenal; the secondary cast is splendid and the plot is amazing."}, {"id": 118, "text": "This movie had potential but was awful. A complete and total waste of 2 hours."}, {"id": 119, "text": "I am a fan of both Vaughan and Hemsworth, but even they could not save this film. Awful script and even worse musical score.There is basically little to no story in this movie and I found it very hard no to be bored. It was so boring I watched over 2 nights .For a movie about drug dealers the was very little action and even when it did appear it was very short and subdued.Only watch this movie if you are desperate for some thing to watch."}, {"id": 120, "text": "Initially, it seemed like it was going to be a really intriguing movie the quality performances from the actors couldn't carry the script. There were some good scenes but there were also some that drug on then failed to deliver. The final 10 minutes left us confused more than anything. Despite the great acting and interesting concept, It is not something I recommend paying to view."}, {"id": 121, "text": "So many have already said it, but this movie is severely underrated. I'm not even giving a ten to adjust the numbers. I think it's a ten."}, {"id": 122, "text": "Interesting and fun story line. I enjoyed the characters. Some parts are unbelievable. But as long as you don't think to hard about it it's good. I'd watch it again in the future."}, {"id": 123, "text": "Let me explain. When The Shining first came out in 1980, it was hit with mediocre to poor reviews. Yet, look at what it has become today. It is the absolute epitome of horror movies and has sparked a sequel and a remake in 1997 by Mr. King himself, along with MANY, MANY blood elevator and Come Play with us spoofs. It is now a classic. That being said, this movie has been hit with mediocre reviews. This is so far the best movie of 2020. It is a great, fun, twisty, violent ride through a crime ring in the South. One of Vince Vaughn's best roles. I love Tarantino, and this film is not a Tarantino film, but it resembles a Tarantino film VERY closely but you also never get the sense that it is a straight up wannabe. It is totally it's own movie. Seriously, go watch it. I have never really seen anything like it, but I have also. It is a MUST SEE! Trust me. Just when you think you know exactly where the movie is going, BOOM your wrong. Watch it. 10/10. This movie is going to be a classic. Don't listen to any negative reviews, The Shining was met with criticism when it first came out, but look where it is at now."}, {"id": 124, "text": "Michael Cera, Derek Waters, and Simon Helberg are the talent of these four guys. Duke is the weird one out. Unremarkable, passable, and a shame my hipster Aura he seems to cling to even as an actor. If he gets past his inner child, I can see some creativity there. It just hasn't happened yet. A screenplay, a role, and a soundtrack all aged way out of his ourvre, makes a bring film."}, {"id": 125, "text": "C'monI have seen this movie 100 times. It is well done but...cmonIf the ending had been around 180 different this would have been memoriable. Now anyone saw the ending a mile away and no one cared."}, {"id": 126, "text": "Arkansas has the potential to be a fully original film but chooses to take the easy way out offering viewers something they've already seen. . In this crime film, two men live by the orders of an Arkansas-based drug kingpin, whom they've never met. But when a deal goes horribly wrong, the consequences are deadly. . Hear me out; although Arkansas is clichéd, I didn't dislike the film. I thought first-time writer/director Clark Duke brought to life interesting characters and a decent plot but the execution is where I hoped it would be different. Who's made a crime film about the Arkansas mob before?! I can't think of anyone. I just wished the payout would've been more memorable and less genre basic. The cast was solid and the overall feel of Arkansas was gritty and darkly funny but I wanted more. . Follow @snobmedia for more reviews!"}, {"id": 127, "text": "Gave it a solid 7. For the director's young efforts and Liam's acting. All very solid. Good cast."}, {"id": 128, "text": "This was a most haphazard movie, with a seemingless less than understandable goal on the horizon. With that being said, I did enjoy wasting two hours watching this rambling flick. So take this as a fair warning, leave all expectations at the door, sit down with a cold drink and maybe even a few snacks, and enjoy the movie, it'll all come together in the end."}, {"id": 129, "text": "It has the style, it has the wit, it has the solid acting, it has a pretty average cast. The story is way too overstretched. I feel as if Clarke Duke wanted to go for a gangster epic western flick with a goodfellas feel to it. I appreciate what the direction he was going for, however the approach just didn't mesh well at all for the plot of the story. You have characters that you can't really care for that much. Stretched out scenes to try and push a compelling story but it really comes off as redundant and completely one dimensional. I feel the message and themes are all ignored by its own director. Very average but below the radar at best."}, {"id": 130, "text": "MFs sleepin on this film. Will prolly be a cult classic. It was good from the jump as long you don't have ADHD. Clark Duke kills it as an actor/director. Vince Vaughn is ruthless. Don't sleep on this film. Easily one of the best I've seen all year."}, {"id": 131, "text": "It's like Clark Duke says himself in the movie, the story is complicated, but boring. There's some good parts that make it worth it, but a lot of it just drolls on. The parts with Vince Vaughn, and with a music background, are kind of cool."}, {"id": 132, "text": "With such a great cast I would have expected a better movie. It lags in lots of places, with the story searching for meaning. In the end it comes to a close with the holes filled but I still felt empty."}, {"id": 133, "text": "Great movie, just needed a better soundtrack, very generic music, could have been great"}, {"id": 134, "text": "I'll tell you this movie is mediocre.. bad acting, destroyed the old music of George Jones , Hank Williams jr ... definitley does not capture the feeling of the south but wasn't completely bad .. if there's nothing else to watch I'd watch this ."}, {"id": 135, "text": "This film, had no substance. I only watched it a week ago, and couldn't tell you much about its plot. I enjoyed the dynamic of Liam Hemsworth and Clarke Duke (actors I both admire and enjoy watching) but I think they were wasted in this film. The plot is very absent, there isn't really a way to describe it. It's about two guys who get involved in drug running, then some events cause them to get in a situation they don't know how to escape, it interludes with the backstory of another characters played by Vince Vaughn (who I think finally played a character he doesn't usually). I felt it was an effort to finish this film as everything happened so slowly. I guess it's worth a watch, but for me I wouldn't recommend."}, {"id": 136, "text": "This film is not terrible but it's dialogue tries to be more intelligent than the film content. The 90's retro feel is good but clearly put together by people who don't remember the 90's very well which just distracts. The cast is great but the director's own casting in this is probably its downfall, if you can just tune out and not need a real plot to follow watch on."}, {"id": 137, "text": "But it had some good scenes in it. The acting was fine. It had a querky feel to it."}, {"id": 138, "text": "It is a slow but watchable drama of rural drug dealing. Could easily be 6 stars but movie slows down to a crawl in certain places for not purpose(like hearing the entire 4 minute song when 30 seconds will convey the same message.There is definitely some Pulp Fiction vibes."}, {"id": 139, "text": "This is one of those movies that are so bad that they're good. I got some pretty good laughs out of the hysterically bad acting and inappropriate soundtrack choices.For some reason this movie is categorised as a thriller drama, so I don't know what's going on there. But if you feel like having a few good laughs, then I do recommend it."}, {"id": 140, "text": "You know how you can buy an iPhone for $50 which looks like the actual thing but doesn't work like that? Well this movie is the movie equivalent of that phone. I've seen quite a few of Tarantino copycats but this one is amongst worst ones on that list. Which is a shame, the topic is very good, there aren't many movies about Dixie mafia, so there's a lot of potential but unfortunately it remains completely unused. Quirky characters-check, sarcasm-check, nonsequential timeline-check, distinctive soundtrack-check, director who's also an actor in his own movie-check, but the only difference is that all of these points are a 100 times weaker than in the original Tarantino movies"}, {"id": 141, "text": "This could have been good but sadly it just missed. The script wasn't quite there. There were moments of cardboard / forced dialogue and forced storylines that took me out of the experience. When you start questioning the story of a film, you know the script is a tad off. It has a good cast, it's filmed and mostly acted well, but overall, it just wasn't quite there. It's one of those frustrating films where you can see the potential but sadly it ends up bland. 5.5/10"}, {"id": 142, "text": "Well I'm just surprised by the low rating Arkansas gets. I read a lot of negative reviews, stating Clark Duke wants to be like Quentin Tarantino but failing in doing so. I can't agree with that. Tarantino is Tarantino, he's the master in this genre and almost everybody loves him for that, me first as I'm a big fan of all the movies he directed yet. Clark Duke on the other hand did a pretty good job with Arkansas. For his directing debut I thought it was more than convincing. Sure he must be a big fan of Tarantino, but then again who isn't? But also as an actor he gave a good performance, his character was a delight to watch, and so were the characters of Vince Vaughn and Liam Hemsworth. Each character adds something special to the plot, a story that is well written, a sometimes intriguing story but most of the time a very enjoyable story to watch. So yes I'm very surprised Arkansas doesn't get higher ratings. It's a mystery to me what those one star reviewers are trying to achieve, is that really the worst movie they ever watched? I guess they don't watch much movies then because I've seen thousands worse movies than this one. Anyway, if you really like this genre of movies just give this one a fair chance, I did and was surely not disappointed."}, {"id": 143, "text": "A lot of reviewers seem to reference Quentin Tarantino to express how this film's aspirations are out of its reach. And they may be right, insofar as this movie dialogue and action are quite the same as say Pulp Fiction. The question is: was it the director's intention to actually try to equate Tarantino's film? I'm not so sure.Yes, Tarantino's influence is quite obvious. It is gangster flick with quirky characters and where things slowly get out of hand. But are those elements Tarantino's exclusive domain? Don't other films make use of such tools in their narrative toolbox? Of course they do! My point is no film is made in a vacuum and the fact that one of the critics' main arguments is the similarities with Tarantino's work, is a testimony to the director's work.My opinion is Arkansas uses some of Tarantino's themes to tell an original story, all the while creating a mood of its own. Liam's character is an interesting portrait of a smart outcast who struggles to find meaning in life. His partner offers a funny, self-deprecating look at hipster culture while never completely muting its relevant criticism on our society. It's not overdone, and it's there to make dialogue interesting and thoughtful, sparing us constant comedic or cool-sounding dialogue. The overall restrain that permeates the movie, in the rhythm, the setting as well as the acting is a very welcome change from oftentimes overly dramatic crime movies I see trying to grab my attention.A solid 8/10 for me. I will watch it again, as soon as I get a better display (some scenes are indeed a little dark)."}, {"id": 144, "text": "This movie is NOT hard to follow, but it is a little hard to pay attention at first to unless you give it your undivided attention.The opening scene was good, for example, but they should've slowed it down just a notch (I had to replay it to even realize what happened, but the second time I couldn't understand why I didn't get it the first time). And if you miss this scene, you're gonna be lost the rest of the movie. That's the only reason I comment on this.This movie has a few nice schools of thought (the character's own words), which I found kind of refreshing but depressing, even though I already knew them myself. Good movies have unique elements, and I consider this one of them. If this movie was just about drug dealer revenge and double-crossing (*rolls eyes*), we've definitely got enough of those movies, but this one is different. I'm kind of interested to see how Rotten Tomatoes will rate this movie, actually.Overall, it's a good movie, especially for the summer (I wonder why I think this, though. Maybe because it takes place in the summer in the south? No idea). .Was actually gonna buy it before it went on sale for $1, since it was only $2 more to buy it than rent it. Movie prices should always be so cheap. I'd buy a lot more of them instead of rent."}, {"id": 145, "text": "I'd guess that for a lot of people Clark Duke is a face seen in a comedy or another, be it any of the Kick-Ass or Hot Tub Time Machine films or perhaps the last season of The Office. Arkansas is his very own first full feature, a debut in both directing and writing plus performing one of the main characters, and I'm quite frankly wholesomely surprised. Based on Josh Brandon's novel of the same name, Arkansas is an engaging, grimy and subtly funny Coen-esque neo-noir tragedy in five chapters.By the time I even noticed there's a trailer out, the release of the movie was just a week away, so I went in quite blind. Not to repeat myself, but I truly am pleasantly surprised, I get a lot of kicks out of the modern neo-noirs, small town crime shenanigans, simple folks in way over their head - a vibey sub-genre that I believe Coen Brothers kickstarted, providing endless inspiration with their unique writing and characters who think they're smarter than they actually are.Kyle (Liam Hemsworth) and Swin (Clark Duke) are the footsoldiers of an Arkansas-based drug empire, trying to work their way up the ladder where on top sits a drug kingpin named Frog, whom Kyle and Swin have never seen. Naturally, one day a particular deal goes wrong for the two boys &amp; the consequences are increasingly deadly. Arkansas is split in five chapters, each tells either a portion of the story of Kyle and Swin, or introduces the other characters in the whole wide drug scheme and its history, ultimately weaving together a web which's entirety only the viewer can see. Drug smuggling, drug dealing, schemes, the crime world hierarchy, murder, love, so on... I think it's sure to say some will call it a pointless movie, perhaps a plotless one, or just a tedious experience. Yeah, it's a slow-burn, there's attention to detail, to plot-irrelevant conversations and a lot of it is as aimless as the lives of the two main characters, but it's often where the charm of Arkansas lies. Having said that, perhaps it could've done better with a more fueled climax.The cinematography was kind of a conflictive experience for me. It would seem that Arkansas is not a big budgeted movie, despite having such a stellar cast. Speaking of that, great performances all around, if a little too little of John Malkovich. Plot might not relate to that, but the overall atmosphere felt somewhat realistic, and so did the characters and the performances carrying them. For a long time I've hoped Vince Vaughn will stay in the crime genre, for True Detective, Cell Block 99 and Dragged Across the Concrete were an awesome fit for him, now accompanied by Arkansas. Fingers crossed for more. So, the cinematography, far from exceptional, but overall great camera work, but a little drab color grading... I craved for a crisper, more elegant aesthetical look. Ears, though, were pleased with an interesting original score and soundtrack, country-like and fitting the atmosphere like a glove.Arkansas is not a very original tale and outfit, but it's a great exercise in its genre, a pleasant experience for fans of such vibes &amp; a highly commendable directional debut. My rating: 8/10. To end it with a quote, May You Dream of offered tits."}, {"id": 146, "text": "Will we learn about the limp?Ooo, I like chapters.Someone's got to ask him about his pants sometime.He already looks creepy. May as well lean into it.Did John ad lib some of this weirdness or do they write this for him at this point?This is very day in the life.A laugh track and this could be a a Seinfeld episode.Nick is going to be trouble.I am settling in to this nice and quiet. It can't last much longer.I suspect John is smart enough to have prepared for this. There is something unexpected waiting.Critters and thing... good line.I keep my gun in the same draw as my condoms too :)A Waffle House was bound to happen.That was vicious, but once in the business.I guess this is a gun friendly fireworks store!Don't tell them you've seen it before.Beer in a donut shop :)"}, {"id": 147, "text": "John Brandon's book Arkansas is a little gem not widely known. When I saw that Clark Duke was making a film version, I hoped for the best but expecting nothing. I remember Clark Duke from Clark and Michael back when that was being released weekly online. I know he's done a few other things since then, but it seemed like a good move to direct, and his choice of source material seemed cool.I think Clark could be a good director. Someday. Putting himself in the movie (in a role where his love interest is waaaaay out of his league and is so unbelievable) was a huge mistake. Watching the film, I realized that was part of the bigger problem- Everything, from the opening scene to the casting to the music to the pacing to the credits scene, this is the most pretentious hipster cringe p.o.s. I've seen in a while. This is the work of a young, immature, very self-satisfied person.Imagine: you're a 5 foot 2 fat balding hipster (do hipsters even exist anymore!? this character wears ugly clothes ironically...) annoying voice and you've just booked your first directing job. Who should I cast in the main roles? you ask yourself... Well, obviously ME for one of them!!! Which one? The one that gets the hot chick, of course!!! You're not Clooney. You're not Warren Beatty. This is your first film as a director. WHY WOULD YOU DO THAT!?and of course the music is obsure old country tunes that only the coolest vinyl collector would know about, and Duke uses them like a crutch. he didn't know how to transition between scenes so he just put songs and shots of driving all over the place. Which is exactly my point. This movie isn't saying anything. The decisions that Duke makes as a director seem to serve only his own ego. Even Vince Vaughn is flat and awkward. There's just enough of a story here to keep things moving, but it's like that's all Duke cared about- he wanted to have made a movie, rather than make a movie.I think Clark Duke could make a good film, maybe many. For that to happen however, he'd have to lose a lot of ego and take it back to basics. Learn to be a director before attempting writer/director/actor all on your first film. Avoid the (lame) stylistic choices and just tell an interesting story clearly. I'm not a filmmaker myself, so I'm speaking as a film lover. I went into the movie thinking oh wow Clark Duke is starting to direct, good for him. Strangely, I still kind of feel that way, and though I felt Arkansas was a waste of my time, I'll be rooting for his next film."}, {"id": 148, "text": "I could not stop watching this film. I judge films by the watch theory. Do I keep looking at my watch during the film.. In this film I never looked at my watch. It mystified me why people think this film reflects Tarentino, it never occurred to me at all. What did occur to me was that I was looking at another Fargo or that the film could have been done by the Cohen Brothers, that is what saw, the quirky characters, the droll dialogue, the casual violence that seemed almost nonviolent.... if that makes any sense. It had a mid-80's quality to it and they carried it off very well. I thought Vince Vaughn was tremendous as a bad guy too. And I will say that I had never even heard of Clark Duke before. Never seen anything he had done before at all. I was amazed he had written and directed it. Now, was the film perfect, no. Some rewriting and some editing might have helped the continuity of it but the overall package overcame those deficiencies. I posit that if you can get Noah Hawley and Clark Duke together you might have a real continuation of the Fargo quality screenplays many people find appealing. I enjoyed this film a lot."}, {"id": 149, "text": "Overall, the movie would have been a 5/10 if it didn't include Clark Duke. But with Clark Duke in this movie, it dropped down to a 1/10. Not sure who lied to Clark telling him that his mustache and outfits looked good along with his acting skills. It was sickening to watch a real actor like Liam Hemsworth have to act in the same scenes as Clark. Liam has natural talent, Clark doesn't even have enough natural talent to be an extra on this movie.Watched the first hour with the family, in the family room, and then we all voted to turn this movie off to watch something better. Later that evening in bed, the wife begged to just watch the last hour promising it would get better. An hour later, she apologized.Do yourself a favor and watch paint dry. That would be more entertaining and less cringe worthy (Clarks acting skills).Never again."}, {"id": 150, "text": "2 small time criminals accidentally get the chance of running a drugs dealing business. Will they succeed in running it successfully or die trying?I liked this movies' laidback, slowburning feel, but I guess the regular crime fans wont like this movie, because the focus of this movie is first most about the characters instead of cool poses and shootouts, although there are still a few pretty cruel murder scenes to be seen.Acting is terrific. Even Liam Hemsworth is good and Vince Vaughn plays one of his best serious acting performances ever. Supporting roles are good as well.Any bad? Not really, but this movie was based upon a novel and the director followed that novel structure with many jumps in time, which dont really work for the movie. The story structure is somewhat disjointed. What works in a book often does not work well in a movie. Other than that minor criticism, I would recommend this movie to any arthouse movie fan of subtle, slowburning crime dramas. It mesmerized me and I will start paying attention to other works of this great director called Clark Duke."}, {"id": 151, "text": "Oh boredom is a beautiful thing. No because a bored criminal is a good criminal. So if you boys ever catch yourself starting to complain about boredom. Just remember; it's better to have to look for something to do, than have something to do, looking for you - Bright.A pretty apt quote for this film. Providing you with something to do during a time of boredom in a second lockdown. Truthfully this film found me (thanks Netflix) and I'm happy to say it was a fun ride!Arkansas tells us the tale of an unlikely pair of drug dealers, Kyle (Liam Hemsworth) and Swin (Clarke Duke) and follows them on their journey into the underbelly, whilst avoiding the wrath of Kingpin, Frog (Vince Vaughn), after a deal gone wrong.As is expected from the area of Arkansas, the story takes place in an Ozark-esque surrounding, showing a different form of drug dealing, with unusual players, customers and problems along the way. A far cry from what we usually expect to see in films and shows such as Narcos, Blow, Wolf of Wall Street or Scarface, where drugs are the epicenter. Here, in thousands of square miles of dense green forest, our drug dealing pair, conversing with each other with laugh out loud moments similar to that of RDJ and Galifinakis in Due Date, can even make themselves an extra buck.With standout performances from supporting characters such as Bright (John Malkowich), Frog (Vince Vaughn), Johnna (Eden Brolin) and the Twins (Brad William Henke and Jeff Chase); Arkansas provides us with rich, funny and intelligent dialogues similar to that of Pulp Fiction.Clarke Duke not only plays Swin, but directs this film too, setting the scene with Chapter Titles to break down the story, mirroring Kill Bill whilst also using shots and music similar to Once Upon a Time in Hollywood. Along with a shocking torture seen early on, resulting in unfortunate events for the pair, reminding us of the infamous Egg Plant torture seen in True Romance. If you can't tell already. My guess would be that Duke has taken a lot of inspiration from Quentin Tarantino. And a little from Taxi Driver with a motivational mirror speech in the end of the final act. But you'll have to see for yourself.A simple tale of a drug deal gone wrong and the misfortune that awaits two friends. A story that we have seen in one way or another man times, isnt perfect, but well worth the watch if it appears in your recommendations.I hear he has a pool shaped like a Lily Pad. Unfortunately not. But he does own a ton of terrible rodeo shirts!6/10. One time viewing at best."}, {"id": 152, "text": "I watched the movie on 24th April, but imdb incorrectly had the release date as 5 May so I couldn't even review it when I watched it, but anyway...I liked the movie and it could easily have been an 8/10 movie, if only the choices and actions of the characters were a bit more logical/realistic. All throughout the movie, lots of characters make very illogical choices, and whenever a character makes a choice which a normal intelligent human WOULDN'T, then that creates a plot-hole as far as I'm concerned. I mean, these are drug dealers, and that lots of money apart from being in a very dangerous profession, any sensible drug dealer of this size and scale would always do 2 things: They'd always wear body armor, and they'd always be armed. Yet that isn't the case in this movie, and it creates plot-holes.Anyway, the acting in the movie is very good all round. I did however find the presence of Liam Hemsworth in this movie distracting... I mean, he's a fine actor, but I just don't think he is 'drug dealer material' if you know what I mean... I just think they could have cast a different actor in his place that could have LOOKED more like a drug dealer, since all the other actors in the movie play the drug dealer parts well, but he just looks like a lost underwear model in a drug movie...Anyway, it's an 8/10 movie, that was brought down by the plot-holes to a 6/10. You can go ahead and watch it, but only if you don't mind a very slow paced film with very little action, almost like 'No Country for Old Men' or 'GoodFellas' but just slower and with worse acting."}, {"id": 153, "text": "Anyone who remembers Clark Duke as the brash, young intern on the popular tv series, The Office, knows his voice and will never forget it. I certainly didn't and it drove me crazy trying to figure out who was playing the short, dark-haired, bearded guy called Swin.Yes, Duke wrote the screenplay and directed the film but he should have stayed behind the camera and never cast himself in the lead role. His voice doesn't blend well with most movie characters and he lacks the kind of talent that allows other actors with similar, unforgettable voices like Morgan Freeman to act, narrate, and speak for cartoon characters.Liam Hemsworth gave a decent performance as Kyle, a young man capable of getting any dirty job done without leaving a mess behind but his acting needs improvement because the movie was carried by the great screenplay, not his character.The only important actor in Arkansas was Vince Vaughn (Frog) who looked so good in his expensive Western shirts and bolo ties that I'm going shopping for one myself, a bolo tie that is, not a two hundred dollar Western shirt.But Frog also had that unique ability to rub shoulders with the common man yet still conduct his business with financial prudence and executive leadership. This made him appear more successful as a crime boss and made his criminal organization seem larger than life. No one conveys these business traits any better than Vince Vaughn.I gave this movie a low rating because Clark Duke changed his appearance for the film but did nothing to change his acting voice. True, Swin was a young man fresh out of college and naturally needed a voice filled with optimism and fearlessly vigor but if Duke cast himself in this role because he played a similar character in The Office, he should have at least worn a white dress shirt and cheap tie so fans of the show who didn't recognize his name wouldn't have to search IMDb looking for his bio pic as soon as they heard him speak."}, {"id": 154, "text": "Arkansas is Clark Duke's first time directing a movie and he did an overall good job with the visual storytelling but I think he wasn't as good at giving direction, he also co-wrote the screenplay. The movie is about Kyle and Swin who lives by the orders of a drug kingpin named Frog, whom they've never met. But when a deal goes horribly wrong, the consequences are deadly.The writing was mostly bad but at times okey, I liked the dialogue a lot though as it was at times funny in a black comedic way. There's some plot points that I just wonder why they were there, it's like they wanted to have a more boring and longer movie than a good film. But after you finish the movie, you get why some of those bad scenes are there, character development but honestly it could have been better written. But the storytelling for Frog is the good parts of the movie, Vince Vaughn does a terrific job.The ensemble cast is full of well known actors, and most of them bring good performances to the movie, I found Vince Vaughn and Michael K Williams to be the best and Clark Duke brought some comedic moments. Liam Hemsworth wasn't the right choice but I think it was the direction he got that made it feel a bit wooden, he didn't really have any scenes that were good or great but only okey.One thing I didn't really like was the saturation and weird lightning, some visual effects were a bit off. I didn't like the I really liked the music, it was fitting right into the tone of the movie and also the setting. This movie is slow paced and that's something you need to know, the story is quite simple but it works. There's better movies out there but it's a solid 5/10."}, {"id": 155, "text": "I had absolutely no idea what to expect when I chose this film to watch. It was trending on Netflix so gave it a go and it's actually pretty decent on the whole.As the title says, the first half an hour wasn't great. It was slow, choppy and just didn't fish me in as a viewer. I was sat there thinking this is going to be a stinker. But as it progresses it gets better and the story becomes so much more engaging. The use of chapters was done very well also.I have a soft spot for Vince Vaughn and this film showed me why, I thought he was stand out and did his character really well.Ending a little underwhelming in my opinion, expected a touch more but overall I enjoyed watching this movie and seeing this is Clark Duke's directorial debut I think he can be pleased with himself. 7/10."}, {"id": 156, "text": "I know nothing about this movie before I watched it, never even seen the trailer.I am a Vince Vaughn fan so I decided to watch it. The pace is slow, actually boring. But its that type of movie. No CGI, no special effects, this is all talk and some fighting with a lot of kicking when someones down (must be Dukes imagination of how a fight should be...or how he got bullied, in his actual past?)So these two guys get into a small circle of semi organized crime, drugs. There isnt much show of how powerful this group is but its a given, not cartel level. The two guys are forced into a friendship and they soon become promoted unexpectedly. Their sort of redneck-ish and not the brightest, so they make a lot of mistakes. Which leads to their downfall. History, character build up and flashbacks make up half the film. Director does himself a obvious favor by giving himself the hot girl (Eden Brolin) in the movie, good move for a dorky nerdy looking dude.Overall, decent to watch. As my review title says, and this is absolutely honest, its a good movie, not great not awful. People at work wont be saying, Hey have you seen the movie called Arkansas? Well, you should! &lt;-- not going to happen."}, {"id": 157, "text": "Arkansas was a good movie, and I would definitely call it unique as a whole. It has a common plotline but with some fun characters. I was entertained and interested enough to finish and want to see what happens with the story. As some have said there are some slow parts, which I was hoping would be culminated in the final chapter, but personally felt a little let down in that regard. I thought there was definitely room for more background on the characters and parts of the plot. Also, although I love a good dialogue film, which I would say this one is, I thought there was some room for a little more action in this story.Based on movie alone I'd give it a 6/10, but with the fact that this was written and directed by Clark Duke as his debut, it's pretty impressive and for that I bump it up a star.Final thought: I don't really see myself ever watching this again, but it was worth the watch."}, {"id": 158, "text": "I'm usually quite easy to please when it comes to movies. I'm easily entertained and rarely do I find a film that I genuinely dislike. Arkansas, however, was that rare film.It really is quite unfortunate. The film clearly had a very strong vision, but I just found the execution to be lacking in every way imaginable. It felt like the movie was trying way too hard to be something that it never could've been. It was filled with choices that might've been cool had they been in some other movie.One of the things that bothered me the most was the way the film looked. I don't know why, but almost every shot seemed to be horrendously overexposed, and it looked like someone had taken the saturation filter and cranked it all the way. Especially outside shots in the sun were horrible. I'd assume that it was an artistic choice, but I really don't see the appeal of it. I also don't understand why it was made in the first place. These kinds of things should be used to enhance the story and its impact. Here, this choice adds absolutely nothing to the film.Another thing that sort of bothered me was the dialogue. Especially early on, it felt completely unnatural. People were saying things that I feel like no human being would ever actually say. It really threw me off in the beginning. The dialogue did, however, improve towards the end, or maybe I just got used to it. Either way, the experience improved. Another thing sort of relating to the dialogue were these monologues that a couple of the characters had. It seemed like they were supposed to be deep and meaningful, but all they ended up doing was slowing the film down without giving much in return.I also found this movie to be quite boring. It felt like it was constantly trying to build up into some grand finale and the finale just never arrived. Indeed, the end was really anticlimactic and ended the film on a flat note. That ending could've been a redeeming factor had it been more impactful. In many ways, the film improved as it chugged along, but the way it ended, just left me feeling absolutely nothing.It really is quite unfortunate that I disliked this film as much as I did. Arkansas tried to be cool and different, and the story it was trying to tell seemed interesting. However, I feel like it was trying a little too hard. And as a result, the film ended up being full of ideas that never really connected into a meaningful experience."}, {"id": 159, "text": "'Arkansas' is a very strange movie. It's missing a lot of the polish and cohesion of your typical larger budget film, yet the story is so much fun that you find yourself not really caring. The film starts out with some very clunky and out of place narration before we meet our two lead characters. Then John Malkovich is thrown into the mix and you realise this film could go literally anywhere. I always remember Matt Damon's story about Malkovich telling him he was a terrible actor. I genuinely don't know whether the man can act or not (is this the performance he was trying to put forward? - perhaps), but what I do know is that he is never dull to watch.Writer, director and star Clark Duke is behind this film. It's his debut effort on the writing and directing front. It does admittedly show a little, but I would also suggest it isn't a bad first up effort. It is an ambitious project to begin your career with. The story is based on a novel, so he had a little help there. The directing side of things just needs some scenes to be polished a little more and maybe some characters reigned in a little. Otherwise though it is reasonably hard to fault.The biggest crime a film can commit is to be boring, and 'Arkansas' can be called a lot of things, but certainly not boring. It has a strong cast that help guide things along and pave over the cracks. There is a lot going on in the film too and so it never really lags or loses its pacing. I enjoyed 'Arkansas' and look forward to seeing what project Duke decides to take on next."}, {"id": 160, "text": "Arkansas is a surprisingly low-key film. The success of series in a similar vein on TV - Ozark &amp; Fargo are one of the best examples - lurks in the back of your mind as you watch this one. For an indie flick, the surprisingly good cast (John Malkovich, Liam Hemsworth, Vince Vaughn, Vivica A. Fox) works well together, but all of them deserved a much better vehicle to showcase their talents than this. I can not help but worry that L. Hemsworth has already tried an awful lot of lanes and none of them seems to have elevated his work. Also, despite his admirable effort, co-writer/director/actor Clark Duke fails to capture the intensity of the pulp fiction novel, falling into the trap an over-eager first-time film-makers. At the end, Arkansas takes itself too seriously, undercutting its strengths of cast and does not feel complete yet. Film just keeps rambling on and on and ends up feeling slight by a half. To conclude, my standards are higher than this, but I must admit I did like the poster and soundtrack :)Rating: 5+/6-"}, {"id": 161, "text": "A loose affiliation of deadbeats and scumbags Kyle (Liam Hemsworth)Dixie noir takes front and center in a drug scenario that could have used Coen Brothers coherence or Tarantino simplicity. Yet the film Arkansas is a complex web of wannabe hoodlums, seasoned bosses, innocent ladies. and very few outsiders. It's a sealed world that moves drugs while its operatives figure out just who boss Frog is and who will survive.The odd couple, Kyle and Swin (Clark Duke, who also directs), is doing a job orchestrated by the absent and unknown Frog (Vince Vaughn). Because Dixie Mafia Kyle is cool and Swin dorky (miscast Clark, who's a better director than actor), their fates can be guessed as they maneuver the hoods inevitably attached to the dangerous business.The brainy segment of the audience will delight determining who knows what and where the cash is, and the plot will tickle their detective skills. The rest of the audience can be relaxed like Kyle, remote and fearless, letting fate take its course while he figures out his life's arc. Only once are we given a sassy smart character, Bright (John Malkovich), who takes over from Frog. Even Malkovich with his genetic sneer has dialogue unworthy of the master ironist.The dark humor of the script is what keeps it all lighter than you'd think but never Tarantino comedic with its homely menace. When Her (Vivica A. Fox) says she likes boys like Kyle and Swin, who don't get hung up on having a long life, the dark noir peeks through with an unfulfilled promise of bright banter to come.Arkansas characters are not that witty or casually bright. Yet, when Vaughn appears the story crackles, and when Hemsworth gets a chance to philosophize, the better story gleams, but only for moments.Clark is a talented director and writer. Whenever he again tells a dark tale of his home state, he should be ready to stand proudly by the Coens and Tarantino as his own voice, not just theirs in echo."}], "reviews_amount": 162}