{"name": "A Feral World", "titleId": "tt09542116", "reviews": [{"id": 0, "text": "This was a bad movie from top to bottom. Remember the ABC Afterschool Specials. Well, this movie was like an Afterschool Special based on the Apocalypse. Bad acting, dumb story, crappy cinematogrophy.....The special effects were the old CGI technology from the 2000s. I was like no way this movie was made in 2020. Grade D"}, {"id": 1, "text": "I saw the movie A feral world and I really liked it. The post-apocalyptic worldview is very good. I liked the locations and the character progression.It seems that the budget and the banalities matter more to the wise of cinema than other aspects. What laziness.Good job."}, {"id": 2, "text": "David Liban, the filmmaker behind this indie movie epic, was my film school teacher and I couldn't be prouder of him for what he's created here. This is a sprawling epic, taking place over numerous years and hundreds of miles in a richly textured post apocalyptic world. As someone who makes small scale movies that take place inside of houses, I can't imagine tackling something like this with the limited resources he had available. And bravo to the cast and crew who not only did a great job as well, but stuck with the project for the years it was shooting. I really enjoyed this movie and hope others will too!"}, {"id": 3, "text": "Inspired by films like The Road, Book of Eli, and Mad Max Liban wrote a script that pays homage to the post-apocalyptic genre. Also I was inspired by Richard Linklater's film, Boyhood, we decided to embark on a similar process. We shot the film over four years, to make our coming-of-age story and show the actors age over the course of the film."}, {"id": 4, "text": "The kid had braces in the first half until the recoil from his pistol knocked them out"}, {"id": 5, "text": "Very entertaining watch. I found the whole cast to be very watchable and the real time aging adds a wonderful element. It is an intriguing plot that doesn't give too much away.The pacing is excellent and I would recommend to anyone who enjoys a good story about struggle, friendship and a power hungry villan."}, {"id": 6, "text": "A hopeful glance at humanity in dark times. The usual gritty realism is there in this apocalyptic setting, but it doesn't dampen the light shining on young Liban's performance portraying the seemingly impossible feat of coming of age in a world without guardrails."}, {"id": 7, "text": "Please go shell some eggs or do the dishes , this uninspired film is Not what you are searching for - A mash up between TWD , Mad Max, without the wheels, with Snow White and a lot of dwarfs . An A for effort but that's it ."}, {"id": 8, "text": "Enjoyed this film and liked the strategy of the way it was filmed.Good acting and good filming.Maybe I would have liked more special effects (or none at all... can't decide), but overall, it was very watchable.Liked the idea of filming over several years and watching the kids (and the adults) change over the years."}, {"id": 9, "text": "Feral World is a gem of a movie. A thoughtful young boy making his way through a post-apocalyptic world encounters various characters along the way. Most are just trying to survive, but some are pure evil. The Road meets Lord of the Flies meets Boyhood. Beautiful scenery, cool locations (are they real or staged?), loads of young talent I expect to see more of on the big screen. Outstanding effects too, though some scenes are not for the faint of heart."}, {"id": 10, "text": "What a realistic depiction of the potential fallout from a particular technology gone awry. Bleak and dystopian but believable!"}, {"id": 11, "text": "Good plot, good story, good music, and good artists. It might not be the most expensive movie production, but it's sincere, genuine, and a piece of art."}, {"id": 12, "text": "While the pace of the film and the cinematography pull you deep into this post-apocalyptic world, it is both an escape from and a parallel to our current reality. The acting is astonishingly effective, even the dog."}, {"id": 13, "text": "Never heard nor seen so many deadpan actions and readings of script in such a dreary tale. The sci-fi elements brought nothing to the story, and sadly that is what was supposed to be the big catch."}, {"id": 14, "text": "First, this is not a horror movie. I'd put it in the category of sci-fi and coming-of-age post apocalyptic. The characters will draw you in and you can't wait to see what happens next. And let us not forget Lips! This deserving movie is up for and winning many awards. Don't miss it!"}, {"id": 15, "text": "What stood out most to me in my viewing of A Feral World was the director and his crews work being executed so well as to create a living, breathing world with characters that exist comfortably in the space. In no way is the title recognizable as your standard fare post apocalyptic saga we've seen before. There are no hoards of zombies, or needles, preachy sermons about the ills of society/the darkness of humanity having caused the catastrophe through which we see Sonny and Emma survive. Instead, Liban gives his viewer a rich character study wrapped in themes of friendship, loyalty and literally coming-of-age (the actor portraying Sonny ages a few real time years throughout the film).A thoroughly enjoyable watch."}, {"id": 16, "text": "This indie-film is a must watch! Excellent actors, intense plot that keeps you on your toes, as well as a very high production value. Highly recommend!"}, {"id": 17, "text": "Solid, beautiful, engrossing film.Beautiful Colorado landscape shots, post-apocalyptic industrial shots, music, and evolving relationship between main characters - Emma, Sonny and Lips.(Warning Spoilers!) Most engrossing part of the film is the villain - Jasper. Someone with that amount of power over the kids could have gone in a number of predicable and cliched ways - unhinged madman (Crazy Eight of Breaking Bad), evil torturer (Viet Cong of The Deer Hunter) and of course pedophile.Liban doesn't succumb to an easy, one-dimensional villain, but instead gives Jasper depth to an extent that he has convinced himself that he is truly a good guy - the protector and provider for the kids.He could have raped all the kids, kept Janey as his personal sex slave, or killed off Emma or Sonny at any time. The fact that he doesn't take complete advantage of his absolute power made him all the more creepy and believable.Beautiful work."}, {"id": 18, "text": "While viewing A Feral World the post apocalyptic realm the film introduces is intriguing, yet gives a creeping sense of sadness. We see this new existence through the eyes of the children who survived the mass change that occurred.The child characters are written with purpose and their demeanor is convincing for their situation. The interactions between the characters range wonderfully from charming to terrifying. The audience experiences the emotional shifts from playful, to sad, to encountering those who wish to use the children. From the acting to the design of the film it remained cohesive and focused.It is clear the film was done with care, and while bringing in elements from other post apocalyptic aesthetics, keeps its unique qualities."}, {"id": 19, "text": "I really enjoyed this movie! Check it out if you're a fan of The Road."}, {"id": 20, "text": "WOW. My initial reaction. Absolutely incredible. I loved this! Crazy, action-packed and violent, and amazing cgi effects everything a Post-apocalyptic film should be. A Feral World is Perfect in every way. 10/10"}, {"id": 21, "text": "Feral world was an amazing post-apocalyptic film and really emraced the world that it was filmed in. David Liban, not only has talent for writing, directing, and filming but has an amazing way of granting film students the opportunity to work on this film and gain the experience they need to take their own film career paths. His son, Caleb, did an amazing job as Sonny. The ability to watch the characters grow as the time passed in the film was a brilliant way to really allow the audience to feel invested in the reality of the film and how time passes with their endless searching."}, {"id": 22, "text": "Great film! Unique and fresh take on the post-apocalyptic tale. Well worth watching."}, {"id": 23, "text": "Movie had a very slick dystopian look and feel. Solid storyline and acting. Definitely recommend."}, {"id": 24, "text": "I really did not know what expect from this movie when I started watching. It did not fail to surprise me. This is a really good drama set in a post-Apocalyptic world. At first it seemed slow and would be similar to other stories of this genre but the dialogue and scene settings quickly pulled me in and found me loving - or hating - the characters. I really recommend this as an addition to your easy-to-watch indie sci-fi/horror collection."}, {"id": 25, "text": "I really enjoyed this film. The story was very compelling. Beautiful cinematography. I formed a real emotional connection to the characters. While there were occasional violent scenes, I would not consider this an Action or Horror film. More of a drama in a post-apocalyptic setting with a Sci-Fi element. None of it felt gratuitous."}, {"id": 26, "text": "A Feral World takes a similar approach to 2014's Boyhood by following a young boy's coming of age by sprawling the narrative over years. In this movie you get to see the feral boy Sonny grow from a lost young child to a confident young adult in the throws of an apocalypse. Like the film, Boyhood, the actor who plays Sonny ages with the roll as this movie was shot over several years. As Sonny grows he grapples with a feral post apocalyptic world as he tries to make sense of his past and his future, meeting friends and foes along the way. This is a coming of age story like no other as it merges dystopian sci fi themes with grounded existential drama. The sprawling undertaking of years of filmmaking following the growth of Sonny is worth a watch alone, but the true treasure of this film is the story about a lone feral child learning the value of community, compassion and sacrifice: a poignant message as our world today looks more and more feral."}, {"id": 27, "text": "The movie has a great focus on the character, great story line."}, {"id": 28, "text": "Wonderful movie! I really liked the dog and it's action.. Good movie overall.."}, {"id": 29, "text": "In the days of a pandemic and an inability to go to a movie theater, I was looking forward to watching a new release movie. I wasn't sure what to expect and was not disappointed. This film is delightfully dark and entertaining while giving the viewer a satisfying ending. The story with it's building suspense as the movie progresses, as well as the acting and sets are well done without having the benefits of a high budget Hollywood production. Highly recommend!"}, {"id": 30, "text": "If you are looking for a gripping and scenic post-apocalyptic dystopia, then A Feral World is a nonstop indie movie that does not disappoint. The progression of innocence, Sonny, played by Caleb Liban, created a character appropriately set within a broken world. The intersection of the incredible scenery and the technology melds into a beautiful symphony of despair. Director David Liban has created a thought-provoking and masterful indie film."}, {"id": 31, "text": "Even though I'm not a fan of post-apocalyptic movies, creating that world is very difficult and challenging! David Liban tackles this challenge with patience, commitment, and focus on detail to create a compelling story!"}, {"id": 32, "text": "This film made me think of Lord of the Flies set in post Mad Max's world. It starts out with a young boy lost in his imagination that stumbled upon a lady and her dog. They bond &amp; their blossoming adult-Child relationship gives it heart &amp; carries the film. It is not action packed so don't want it if that want you expect or want from a film. They meet some other lost boys/children &amp; then finally meet a man that may responsible for the disappearance of her daughter...It is kind of the reverse lord of the flies in that the boy meets an adult from the beginning and then the kids towards the end. The director captures the authenticity of a mother and adopted son's relationship &amp; the kids that learn to defend themselves.The ending is bitter sweet but it leaves the viewer with some hope for the future."}, {"id": 33, "text": "It takes a lot of classical post apocalyptic movie hallmarks and pairs them with new ideas that create a really interesting world to explore."}, {"id": 34, "text": "This is the story of an orphaned boy Sonny and a mother Emma who looks for her daughter Janey. They team up and start to bond. They eventually find Janey in the hands of Jasper, a despotic warlord who uses kids as scavengers searching for food, technology or tools. Jasper has access to a robotic insect swarm which can kill and also is used to control the kids. The movie ends with a partly happy ending which is nice especially when watching this during the pandemic which is depressive enough. Ignore the bad reviews. Yes, it has not the Hollywood power of ''Mad Max Fury road, ''Road warrior or ''Blade runner, but the characters are well developed. Especially the teen age and kid actors are amazing. Also, it certainly does not have the depth of ''Lord of the flies (which is also a set-up in which kids have to survive in a dystopian setting) but there are certainly links as the kids have to make tough decisions. Similarly as in ''Hardware (a movie from 1990), the movie might grow over time and gain more fans. Quite unique and hardly seen anywhere else (with the exception of the movie ''Boyhood which did such a thing over a longer period), the movie had been filmed over several years. So, the characters grew and changed realistically. No cosmetic trick could have done that as well. Also unique is that this is a film project by students, graduates, faculty and staff at US Denver. Caleb, who played Sonny well is the son of the director David Liban."}, {"id": 35, "text": "I knew I was going to like this film, I just didn't know how much I'd like it.I absolutely loved this passion project from David Liban. It hooked me in when I learned that it featured his son(s) as they are roughly the same age as my children and I was very curious to see how they were portrayed in a post-apocalyptic story. When I learned that it was shot over the course of four years, I was fascinated in seeing the actor age accordingly. Caleb (Sonny) did a great job and I hope he continues to pursue a career in film.Beautiful camera work and sound. I really enjoyed the relationship between Sonny and the mother. The sets were wonderfully run-down and gave a sense of a post-apocalyptic landscape. A great story, one that's worthy of a lazy Saturday afternoon and a bucket of popcorn.I hope to see more projects from Mr. Liban!"}], "reviews_amount": 36}