{"name": "The King of Staten Island", "titleId": "tt09686708", "reviews": [{"id": 0, "text": "This film is a true gem. I went into it not expecting much, but I was disappointed when the movie was over. Not many films I've seen recently left me feeling that way; especially Davidson's previous film Big Time Adolescence. The King of Staten Island was funny, heartfelt, and raw at times. Personally, I've always felt like Pete Davidson was the least funny member of SNL, but this film opened my eyes to what he was about as a person and where his comedy stemmed from. I appreciate that the film doesn't pretend to be something different than what it is - Pete's semi-biographical story brought to life by a comedy directing/producing pro, Judd Apatow. The supporting cast of Marisa Tomei, Bill Burr, and Steve Buscemi bring some pretty great performances to the table as well. Great story about that weird part of life in your early twenties where you're still not really sure what you're doing or where you're going on life's journey. It deals with living through loss, growing up and finding out your purpose in the world. I will recommend this to friends!"}, {"id": 1, "text": "The film is unapologetically introspective and raw. It feels amateurish at times, but overall it really works for the story that is being told. More of a drama than a comedy, but with some truly funny moments."}, {"id": 2, "text": "Bill Burr and Pete Davidson are an amazing duo. I know this is not a type of movie where they would have a part 2. But I would throughly enjoying watching this story continue on with all these characters. It was a little long but you would really feel the emotion between Bill and Pete."}, {"id": 3, "text": "King of Staten Island is a deeper dive into Pete Davidson, a mostly autobiographical look at why he is the way he is. Well done and well written and a great supporting cast from Bill Burr, Marissa Tomei and Steve Buscemi all were steller in supporting roles.Be prepared, it is dark and not funny ha-ha, but definitely uses humor to deflect uncomfortable situations. Pete's always been an intriguing character to me, so this was a great way to pull the layers back, it's not always pretty, but I think it is definitely worth the price."}, {"id": 4, "text": "A great addition to the Judd Apatow's comedy and sentimental work. Happy to see Pete Davidson succeed in this role. Really happy with this movie!!"}, {"id": 5, "text": "I love this! One thing I didn't like tho tho was they never showed if he fed his friends cat sprinkles if he did I missed it or much else about that situation the fate of his friends for such a crime n him getting off Scott free &amp; him seeming not to feel bad about his friends at all...,"}, {"id": 6, "text": "Original,sincere,relatable,painful &amp; funny at same time.This slice-of-life comedy is about self-discovery,abt not judging a book by its cover &amp; chronicle of life.Pete davidson as the unemployed drug addict youth whose firefighter father died at work is brilliant alongwith every other cast members.Director takes his sweet time to buildup but after staying till end u will find a good execution with huge transformation in storyline &amp; character development.Its not without flaws as it might be 5-10 minutes shorter,needed better editing.Music is good.Camerawork is ok.But Overall it's a really great movie with life lessons."}, {"id": 7, "text": "I'll be honest...I liked this movie way more than I expected I possibly could. Pete Davidson is great in this and the film is well-written, funny, and touching. Highly recommended weekend viewing."}, {"id": 8, "text": "This films intention, is to take you on a journey. It presents itself initially, as a simple character study. As it divulges though. You begin to see that it's actually an examination of the people that interact with the lead and how they effect and are effected by his actions.The quick cuts and edits are a perfect representation, of the ebb and flow of real life and are in no way unintentional or a mistake.The premise and subject matter is not easily digested but at the core is a story of a young man stricken by grief who wants to contribute and find where he belongs.Funny, heartwarming, original and will leave you satisfied after viewing"}, {"id": 9, "text": "What a fantastic feel good film ! It's a movie about hope and a second chance at life ! It's funny and heartfelt and the entire cast is fantastic! I can't wait to see Pete Davidson in more films !"}, {"id": 10, "text": "If you're in any way a fan of Pete Davidson or Bill Burr, see this movie. Both absolute crush it by pretty much playing themselves. If you're not a fan of Pete, see this movie. He'll completely change your mind. The anorexic panda that he is."}, {"id": 11, "text": "I was excited about this movie simply because it's an Apatow product, AND, I'm a somewhat, new, fan of Davidson. I cried through the first viewing, laughed more, but still cried, through the second viewing of my 48hr rental. Well done. Thank you for sharing your story in such a cerebral, human way. I will purchase it as soon as it's available for purchase."}, {"id": 12, "text": "I enjoyed the cast and was mildly looking forward to this film. But it was way too long and didn't really achieve anything. The love interest. The father and son thing. Living at home. And the mums new boyfriend. But I didn't care about any of it.There are some funny lines in this. Some caring interactions. And an attempt to do things different. But it was a long slog to get to the end. Then when the end did come it really wasn't worth the wait.This is watchable but you won't get too much from it. I suspect a lot of the high ratings here are PR campaign boosters. This is not a high scoring film at all. Disappointing."}, {"id": 13, "text": "Three big problems: 1) Pete Davidson's acting was very distracting - Everyone else was great, but his reactions didn't match their actions. 2) Pete's character was way too much of a self-pity cliche - Meh, I'm broken, please feel bad for me. 3) Forgettable - Nothing deep, special, or very interesting happens, and there's not enough funny to make up for it."}, {"id": 14, "text": "Seriously Mr. Apatow... 136 minutes of too much filler, not enough substance? This was way too long and way too slow. The only reason I didn't fall asleep, was Davidson's fine balance of pathos and humor throughout the film. His story was very relatable and he performed/portrayed it quite well. The supporting cast was great as well. Had this film been cut/edited down to approx 90 mins with better pacing, and some crazier and funnier moments, it would've been a real hit. Still, mad props to Davidson for telling his story so well. Too bad Apatow didn't write and direct it better."}, {"id": 15, "text": "It's watchable when you have nothing to do, but it's wayyyyy too long. I feel like they lost themselves in totally unnecessary sub plots."}, {"id": 16, "text": "Proper regally good film and story, genuinely engaging characters, outstanding performances all round. You have to learn to live and grow around your circumstances no matter how old or who you are - and that's what happens here."}, {"id": 17, "text": "Hard to sit through this film in its entirety. Ineffective one liners. Grungy looking characters. What a waste of time. I should have been paid to watch."}, {"id": 18, "text": "Loved this movie, funny,sad,happy, serious and more. Never knowing how it might end, so it left you wanting more. Great characters and enjoyable experience and left me with a great sense of humanity and chilled out feeling."}, {"id": 19, "text": "Wow did this movie drag. I kept waiting for it to get funny and engaging...but nope. On top of that, Pete was incredibly unlikeable. I kept waiting for his character to morph and learn...but it just didn't happen. Too bad though, I was really hopeful for this movie."}, {"id": 20, "text": "I get the direction in which this movie was trying to go, but it missed horribly. I'm not going to blame any of the actors, but someone is to blame for this swing and miss. Under funded, and a completely unrealistic story... tried twice to watch it and couldn't do it. Really bad."}, {"id": 21, "text": "Really enjoy this it's easy watching but not boring! I thought it wouldn't be great so I would now say give it a watch"}, {"id": 22, "text": "A very well made film by Judd Apatow with a series of excellent performances by all the actors, especially Pete Davidson, Marisa Tomei, Bill Burr, Bel Powley and Steve Buscemi.This coming of age story has a lot of heart at its centre, and it explores the protagonist's feelings towards his late father very beautifully. Especially the scene where the firefighters exchange stories at the bar is wonderfully acted, directed and written.This is a definite breakthrough into films for Davidson, and he fully delivers in the role. Some great work done by everyone involved."}, {"id": 23, "text": "I've liked some of Judd Apatow's films. I have not seen one thing that Pete Davidson has done that is good OR funny. Even on SNL his humor is sophomoric and imbecillic. Casting him in this feels like it was done more out of sympathy rather than talent. And this was not one of Mr. Apatow's finer writing efforts. Once Pete's tattoos start fading along with his 'career,' you'll likely catch him manning the fry station at Burger King."}, {"id": 24, "text": "Pete is the King of Animal Farm, where all the animals are equal, but some animals are more equal than others. Nobody gets more sympathy, love, pity, adulation, and money than King Swine, but it is never enough. Watch him feel sorry for himself for two hours. Feel his pain. Undeserved stardom and popularity. Millions of dollars. Worse than being a bank robber.Feel sorry for King Swine. He is very sad. Only your praise and applause can make him feel better, but only for a little while."}, {"id": 25, "text": "God this movie is garbage! Pete should be on his knees thanking ALL the SNL alum that made it possible for him to make this piece of crap. Pete can't act, he's not funny and he's really just a big goofy loser. He needs to go back and watch Chevy, Bill, Belushi and Akroyd to learn how comedy is done. Whatta maroon."}, {"id": 26, "text": "Why is this being marketed as a comedy? It's over two hours of disgusting, meaningless banter, none of which is remotely humorous or entertaining, performed by perhaps the ugliest bunch of wannabe actors (or over the hill, as with poor Steve Buscemi, who has never said No to being on screen) ever assembled.I made I through the extended scene involving the abuse of a nine-year-old child, lost in the forest looking for a friend, but lured by a bunch of lowlife stoners into submitting to having his arm tattooed. That action sets the plot in motion, and by calling it a plot I am giving it undue credit for its totally unnecessary existence.Once that was cleared up - after about 37 minutes - I began to fast-forward. I never found anything on which to linger, but I gave it its rightful chance until the credits started to roll.I have enjoyed some of Apatow's work, but then he had some excellent actors: Steve Carrell and Seth Rogen at the top of the list. Unfortunately, there is nothing in this overlong slop to even make you consider smiling or caring about anyone. Utterly repulsive on every conceivable level."}, {"id": 27, "text": "It's as if every actor here is in a different movie. They are different levels and you can feel it. The writing and story are okay, but there is such a lack of cohesiveness. It's very strange and the effect is a very uneven, unwatchable movie."}, {"id": 28, "text": "Don't listen to some of the trolls who reviewed this film. Writing, acting, and directing were phenomenal. Very memorable movie. It's been a while since I've rooted for a main character so much. Great movie."}, {"id": 29, "text": "I'm conflicted because it was a truly likable movie. On the other hand the editing seemed rushed and all over the place. I really liked the idea of the film and I wish it was better executed. Regardless it was enjoyable"}, {"id": 30, "text": "Typical American family. been seeing this for the past 30 years and still the same. Dad died or having and affair. Divorced, kid can't accept it. Do drugs and blah blah blah....shut boring"}, {"id": 31, "text": "Just going off of the previews, I thought this was going to have a gritty, indie vibe. Way wrong, just a neutered PG film not worth your time or money. A lot of good acting from the support characters, especially Bill Burr, but the lead tall goofy actor (don't know his name, was told he's from SNL), is not a good actor. Someone with more talent might have been able to save this movie from being so dull. Tim Dillon probably could have pulled it off."}, {"id": 32, "text": "I admit, only about 40min in before I just turned it off. Maybe good for someone from the area, but damn this movie was slow and boring, I think I smiled once, but other than that, this just felt very depressing without any real 'focus'If it cannot snag your attention in the first 10-15minutes, its likely not going to get a full view. Maybe next time?"}, {"id": 33, "text": "Steve Buscemi is a True American Hero. Pete Davidson and Judd Apatow are the exact opposite"}, {"id": 34, "text": "I feel that I should receive a check for making it through the first 20 minutes. Awful"}, {"id": 35, "text": "This movie actually made me laugh in several places which almost never happens.Really an excellent comedy slash drama."}, {"id": 36, "text": "There's a lot of heart and humor put into this movie. Just knowing Pete Davidson was one of the writers on this semi-autobiographical film makes everything seem a lot more real and wholesome. Well directed and unlike any other film Judd Apatow has directed in the past, I think people will enjoy the sappy and meaningful moments throughout it. If your a fan of Pete Davidson or Judd Apatow this'll be a rewatch able movie by the time it's placed on a stream. Overall score 84/100"}, {"id": 37, "text": "Judd Apatow strikes again. He's evidently very good at writing juvenile humor (I can't stand most of his work, but lots of people seem to think it's hilarious, for some reason, so I'll give him that.) In this movie, he seems to be trying to write something serious, and his apparent internal-struggle is painful to watch. Unlikeable characters, A near-meaningless plot, and a lead actor character that you just want to punch in the face. Seriously, I wanted to punch this guy in the face even more than I want to punch Shia LaBouf in the face, every time he's on screen, and I REALL want to punch Shia in the face. Avoid this movie, unless you just need background noise while you do your taxes, or the laundry. It's meaningless, depressing, and immediately forgettable."}, {"id": 38, "text": "Okay so the ending of this movie isn't so bad. It's supposed to be a feel-good movie where you learn something valuable about life, right? Well over half the movie you just sit there being pissed off and annoyed, not really understanding where the movie is supposed to go. What is the storyline here? The script is all over the place, and seems like it's just half-puzzled together to get somewhere by the end. I only give it any stars at all because it made me smile at the end, after spending the rest of the movie annoyed. That and because Bill Burr is awesome."}, {"id": 39, "text": "The King of Staten Island is just one of the freshest movie of these years. It comes with a soft / balanced story, intense, written and directed with dedication and intention, without going outside the edges. Pete Davidson stole the whole scene with his semi-serious acting (in a massive potive way) and regardless the movie is all around him, the cast, little by little craft a strong narrative building, creating all togheter something unforgettable. The king has just arised."}, {"id": 40, "text": "If Pete never does another movie he should be really proud of what he's accomplished. As someone who lost his father young &amp; has his own mental health issues, this movie really hit home with me. It might not be for everyone but it was fantastic to me. Bill Burr, Marisa Tomei, Steve Buscemi &amp; the others were really good too. Great movie!"}, {"id": 41, "text": "Sadly, the story went nowhere for me. Tells about the lives of a few that do nothing and have no ambitions. These stories have been told a million times before. Not something I'll watch again. I already wasted time viewing this film. I did enjoy the acting and the actors, they did well."}, {"id": 42, "text": "Urgh what is with Judd making these semi self auto biographical rubbish movies? Train wreck was 5/10 funny (max) this is 0/10 funny. Avoid."}, {"id": 43, "text": "Judd Apatow's silly type of comedy was juxtaposed with dark content haphazardly and didn't work. Pete's acting was distracting. Bill Burr was incredible and it was great to see him in a bigger role. I felt bad for Marisa Tomei because she really tried but suffered from lack of investment in a compelling story arch. There were way too many sub stories that exist for one moment and gone forever the next and they didn't add any greater meaning or have impactful resolution. Pete's character really could have had a moment that would have pulled everything in but instead he is basically the same as he was from the beginning. It seems like at the end, the movie wanted you to cheer for him, but his character remains unlikable throughout. After two hours you're still wondering what the movie is really focusing on. Music choices were cheesy and outdated. Writing was not memorable or ever laugh out loud funny. Cinematography was apathetic and straightforward. I basically am giving all of my stars to Burr, Tomei, and supporting cast for effort."}, {"id": 44, "text": "Remember that guy from HS who smoked dope and did his own tattoos. This is that loser at 30, living in mama's basement, playing video games all day and smoking weed. Two-hour pity parry"}, {"id": 45, "text": "This is the story of Scott who has no direction for his future. He is kind of lost in ordinary life with his friends. I saw a lot of good acting from Pete Davidson, Bel Powley, and Marisa Tomei. However, the story could have a single flow. Don't get me wrong. This movie worth watching. However, the story is changing direction and you become lost in which direction it goes next. The story is happening in different locations. I liked the background music. There are lessons to learn from the story. In summary, I recommend watching this movie to comedy and drama fans."}, {"id": 46, "text": "Ok, so this movie is like 4 hours long. It has no clear plot. It's not funny, jokes don't hit. No endearing qualities, I literally hate everyone by the end. Just meanders along, like why am I still here? It feels as though the film was finished by 5 zoom meetings, it's unfinished. Don't waste your time. Completely embarrassed I forked over $20 to rent this garbage pile. Wait to watch it for free on tv in 20 years. I'm serious, it's that bad. The fact that it has a collective rating over 7 right now is mind boggling. Girls was Judd apatow's demise, very sad."}, {"id": 47, "text": "I didn't pay for the movie...and i STILL want my money back ! I had such high hopes for this too ! A Judd Apatow movie with Pete Davidson, Bill Burr and Steve Buscemi.....it HAS to be funny right ??? NOPE ! 2 hours and 17 mins of complete blahhhhhh."}, {"id": 48, "text": "It was okay. it is extremely mediocre. almost as if they are normalize being a bum. that too is not done well :/"}, {"id": 49, "text": "This felt as if each scene was more interested in serving a singular punchline than moving any characters, plot, or story forward. The collections of punchlines were then strung together to formulate a narrative."}, {"id": 50, "text": "Had to switch it off quite early on, literally no comedy in this what so ever, unlikeable characters, not a clue as to how it has such a high rating."}, {"id": 51, "text": "I started into this movie feeling ambivalent about Pete Davidson as an actor. I watched mostly out of curiosity; to see if it lived up to the expectations set by the trailers. I was pleasantly surprised by the combination of the storyline, scriptwork, and acting. A movie well worth watching."}, {"id": 52, "text": "I have no explanation for the good reviews that appear for this movie. Pete is a 24 year-old who acts more like he's 14. This movie did a good job in making me hate his character and wish the movie would end already. The ending feels false and doesn't nearly make up for the agony of sitting through what came before it."}, {"id": 53, "text": "Did not work.I like Pete Davison, but he is not a leading man.The character in this and his friends are all idiots which I guess is the point but there is no redemption. Just as the resolution was coming due the film ended."}, {"id": 54, "text": "I wonder why he doesn't do a movie about frogs? Remember Hell Comes to Frogtown with Roddy Piper? Pete Davidson can do the sequel, King of Frogtown. Depressed Canadian frogs visit Staten Island to start a new depressing town, and they pick King Peter as their depressing leader, the King of Frogtown."}, {"id": 55, "text": "In short if you like Pete from SN' chances are you'll like this if you like him enough for 20$ and it was a lot longer and sadder then i thought it was gonna be but the trailer was pretty sad so should have seen that coming someone should also check in on Pete cause this isint a documentary but Pete Davidson In real life has his dad die and is a drug addict I give a solid recommendation for this support Davidson's first big movie directed by comedy director longed Judd apatow solid recommendation"}, {"id": 56, "text": "After 45 mins of remorseless stoney silence, we binned this comedy drama(?). Main guy is such an arse that even if he redeems himself in the second half, you don't care.Would rather watch a movie about Marisa Tomei's character than this idiot. He is just too annoying for any audience outside his comedy circle, definitely shows no ability as a film actor."}, {"id": 57, "text": "What an hilarious waste of a solid script-Davidson, despite his confidence in his abilities-is not strong enough to carry a movie.This could have been great with Andy Samberg in the lead. Stop inflating Pete's ego, he's neither good or relevant."}, {"id": 58, "text": "One of the most entertaining movies for years. Drama doesnt take the fun out of it. Small touches make this movie a real work of art. Must see"}, {"id": 59, "text": "This is insane. This is a 6 at best if you really like everything about this movie and laugh at unfunny jokes and punchlines etc.I do get through Covid we're all bored but this move is not good. So-so at best. Even my girl said she would watch it on the lifetime Chanel but not recommend anyone to pay for it.I tried to rent a movie we both can like because we have fairly dissimilar taste in movies. She didn't like it. I didn't like it.Stale acting. Unbelievable characters and choices. 4/10 in my book. Hard pass"}, {"id": 60, "text": "Ok film, that's painfully long. Funny at times and good characters. But boring at times due to bad editing. In saying that, check it out if your prepared to watch it while your pain is drying."}, {"id": 61, "text": "This movie had me laughing so hard that I probably missed some important parts. The jokes are definitely current, new, and inventive. I guess some people might just not have the same sense of humor as me, but I loved it. It was also a pretty engaging film on and emotional level. As a 24 year old myself, this movie was spot on with a lot of things in my own life. Bravo jud apatow and pete Davidson!"}, {"id": 62, "text": "Great performance from Pete Davidson's and Billy freckles."}, {"id": 63, "text": "And ended up watching the rest a few days later just to finish it, but I wasn't greatly looking forward to it, and the feeling was justified when I finally did finish it. Others are saying to stick it out and that the ending is worth it. So, basically 2 hours of crap for a 5 minute ending is worth it in others' opinions. Pete Davidson is so freaking annoying, he is this generations' David Schwimmer... everything he says or does is just idiotic and you want to punch him every time you see him. Frankly, I just don't see the positives in this one that the others seem to have found. Many other choices out there where the first 2 hrs are more watchable and enjoyable. There really were no surprises here."}, {"id": 64, "text": "What a wonderful crazy movie! Didn't know what to expect but I like Pete on SNL so I was determined to see this one. Great portrayal of firefighters and their families with the stress and issues that affect them. Well done Pete and Judd. Thanks for sharing this experience"}, {"id": 65, "text": "An Apatow Classic! This is a way for you to look at life from a different perspective. Change your prospective, change your world."}, {"id": 66, "text": "I am very impressed with this movie. From minute one it makes you smile non-stop. The characters and never stereotypical, very well rounded! Great writing for sure. The cinematography ist beautiful as well and coupled with the music it really lets you know this is not just a silly comedy, but a story about real (fictional) people. The casting is also very well done and the actors really disappear into their performance (despite some popular faces). Also out of all of Judd's movies this one is the most genuine. Who knew Pete was his muse all along. Talking about Pete, he is doing a fantastic job. He is very talented and by telling this story in this way not only has he shed light on the brave but he filled us with empathy and understanding for those who struggle. The movie does by no means glamorize sacrifice but is certainly does emphasize the need for compassion."}, {"id": 67, "text": "The King of Staten Island is A LOT better than I thought it was going to be, being one of the biggest surprises of 2020 so far. The King of Staten Island had great emotions, having a few deep, heartfelt moments, as well as being just so damn entertaining! The soundtrack was super fitting, having greatly placed pop culture music. All of the characters were big fun, putting on genuine performances with charming character development. The coming of age script was so free, doing and saying whatever they wanted, but keeping everything as tight as possible, not just shooting out aimless, subjective comedy."}, {"id": 68, "text": "Everyone else worked, and this guy comes with his sad story as an excuse to be the horrible person he is around everyone. Like atleast give people with same bad lack but with talent the same chances, he has received! Worst Judd Apatow movie and how can with world function with a horrible human being like Pete Davidson taking roles from talented people"}, {"id": 69, "text": "The King of Staten Island is a sweet and relatable coming of age story. We can all relate in one way or another to Pete Davidson's character struggling to let go of the past as life forces him to grow up, even if he's already an adult. The subtle and natural comedy sprinkled throughout enhances the dramatic themes of the film, which make for an at times melancholy, yet ultimately uplifting story."}, {"id": 70, "text": "The King of Staten Island was boring, depressing and reaching with its comedy. I didn't think they could take two comedians (Pete Davidson and Bill Burr) and make them so unfunny, I love comedians moving into drama as they seem to have enough pain in their lives to evoke emotions. This movie however, conveyed a drought of emotion, leaving only a wallowing of nothing.One to be missed."}, {"id": 71, "text": "I'll tell you why... because they are well meaning with solid core stories, but incessantly meander to the point that any good story telling is marred by how far the filmmaker takes us from the central plot. Clean it up, Judd, accept help from editors. You don't weave stories as masterfully as you think you do.Aside from that, this film contains wonderful performances from its cast, in particular Mr. Davidson who despite portraying an out of control character who makes bad choices over and over again keeps his place in the viewers heart. Marissa Tomei turns in a strong performance, though the writers of the film seem to let her down about three quarters of the way through."}, {"id": 72, "text": "I liked this film it had a good script I liked the constant flow of the dialogue and the actors bouncing off each other. There is a lot of good characters and actors in this film and I liked the story too. Overall a enjoyable comedy drama."}, {"id": 73, "text": "This movie shows Pete Davidson can act, and is loosely based on his life. It is a long movie that moves slow at times, however, the casting was spot on, and the cast had great chemistry. Marissa Tomei is her usual amazing self. My only issue with the movie was the absolutely horrible ending, of leaves you hanging, as if the writers did not know how to tie everything together and just end the movie, think of the disappointment of the Sopranos ending."}, {"id": 74, "text": "Judd Apatow dramatizes the tragedy/comedy of Pete Davidson's past history - and ongoing - thoughtfully. It's an interesting exercise to explore a life that is well-known and I applaud Apatow's effort to squeeze as much from this story as he did. That's also a credit to the cast he assembled, that being Marasia Romei, Bill Burr and Maude Apatow. Davidson's vulnerability is on full display but his charm is prime reason you feel comfortable watching.A few scenes drag on a bit too long with awkward dialogue when it should've been paced better according to how interesting what they were talking about was. That's my only complaint: that it could've been a streamlined two-hour movie without characters explaining every moment three times over. That usually detracts the drama.I like Judds directing of the dramatic moment when Scott decides not to forgo his friends botched robbery but still maintaining the comedy aspect. The music and close-up on Davidson's face was an impressive turning point in his character arc.The best moment is the realization Scott has when other people with equally life-altering problems somehow have an equilibrium that he's missing. That was a positively unexpected lesson and one that showed him despite his serious problems, he can function like anyone else.Though he's not perfect and a young guy, after watching, I have sympathy for Pete. The public opinion, I think, is usually undeserved in his case considering where he's coming from and the fact that he's not really a completely deplorable human.After exiting my living room, I felt satisfied."}, {"id": 75, "text": "To make this simple, I believe Pete Davidson is a great actor and seems to be able to transition his comedy with real life. This movie hits a variety of generations and talks about depression and anxiety in a way where its taken serious but also made to be funny so others can feel open to talk and know its ok to feel that way.Great movie and not just a comedy."}, {"id": 76, "text": "Pete Davidson is a great fit for this. Makes sense since the movie is dedicated to his father.This movie is funny, heartfelt, and always cracks a good joke at the right time.Loved this movie even though there wasn't a ton of depth at times."}, {"id": 77, "text": "Just brutal. Bad acting, lame story. Trying way to hard"}, {"id": 78, "text": "This is such a great movie! Great acting, funny, and very touching story. Pete Davidson, Marisa Tomei, and Bill Burr were amazing in their roles. Very entertaining and I highly recommend it!! 10/10"}, {"id": 79, "text": "It realy was a cool movie with great acting. i enjoyed it."}, {"id": 80, "text": "I will have to admit this film was really good! The character development in this movie was really well done. Not usually a huge fan of Pete Davidson but I will admit the he did a great job in this film. Judd Apatow always does justice with his films! Bill Burr was hysterical and Marisa Tomei was amazing! The only problem I had with the film is that it was a little longer than it should have been but other than that it was a great film"}, {"id": 81, "text": "If I could I would give The King Of Staten Island a 6.5 rating on here. If it wasn't that long maybe I would give it a seven. The story does not have interesting elements enough to entertain us that long. It wasn't bad though, just not great. It's a dramady (drama/comedy), with more drama than comedy (which is subtle but not bad). As for the acting that was good, a well chosen cast that all delivered. I don't regret watching it, but I won't watch it again to be honest."}, {"id": 82, "text": "My expectations were not too high, as I never was a huge fan of his SNL performances, especially after all the drama that happened recently. This movie, on the other hand, is a great piece of art and a deep dive into his personal life and mental struggles. Throughout the movie, I was entertained by his, and every other actors', performances. I thought the ending where things tend to come together towards a happy ending might be a little cringey but it wasnt and I was actually able to be happy for the character/Pete. 10/10 movie in it's genre comedy/drama, indeed!"}, {"id": 83, "text": "Having kind of anticipated that I'll probably will be enjoying this movie from the moment it was announced, mostly due to the participants involved in the project, even I was still surprised by just how much. It is throughout well written, performed, directed and crafted. It's thought-provoking, witty, sad and hilariously funny in well proportioned measures. Even the soundtrack is very well chosen. Overall, the only thing for me left to do is to applaud and to highly recommend it!"}, {"id": 84, "text": "7/10 - while I am by no means a Pete Davidson fan, I couldn't help but appreciate the brutal honesty in this often-funny semi-autographical dramedy"}, {"id": 85, "text": "This film is really held up by its performances. Most everyone does a great job and portrays their respective characters very well. Pete Davidson and Bill Burr are easily the best parts about this film. I've never been a huge fan of Davidson but he really fits here. Burr brings his usual funny attitude here but shows a more sympathetic and kindhearted side which is nice to see. The biggest issue with this film is the screenplay. It feels like the first draft which means some of the dialogue is pretty rough. Some of the characters dialogue feels awkward and unnatural. I definitely would have enjoyed this film more if they had spent more time on the screenplay. The film is also about 30 minutes too long and that's a complaint I've heard about a lot of Judd Apatow movies. A lot of moments could have either been cut out or just shortened. With all that aside, the film is well shot and I did get a couple of laughs here and there. Check this out if you want or if you like Pete Davidson and Bill Burr."}, {"id": 86, "text": "I'm more familiar with Pete's movies because I don't watch much SNL anymore. However I'm a fan of his brand of comedy as well as many of Apatow's. It was definitely worth the Redbox purchase. It wasn't uproariously funny because it matched the level of drama. My favorite scene was the pharmacy robbery because it was the perfect mix of seriousness and humor. Nice casting too (must be nice to be related to Apatow he always has his wife of kids in his movies). I would most certainly watch this again!"}, {"id": 87, "text": "It was much better than i expected it to be, very realistic and entertaining especially for young audience"}, {"id": 88, "text": "Honestly, I've never liked Pete Davidson. I seriously thought I'd hate this movie because he was the main actor. I was pleasantly surprised, throughout the movie he grew on me and he was completely relatable. I seriously loved this movie. I dunno how anyone can watch this and not really like this movie. Please watch this!!!"}, {"id": 89, "text": "I've been watching a lot of movies lately due to the corona. Isolated at home and need to fill up time. I watch one movie after another and it just gets boring. The same cliches over and over again. No surprises.Finally here is a movie that just hit a home run for me. I have no clue how it will play out and I feel for the main characters. I grew up before there where letters assigned to peoples peculiarlys but I'm probably ADD myself, but I loved this movie.I love Bill Burrs comedy and was pleasantly surprised how well he fitted in this story together with Pete Davidson and Marisa Tomei. Great casting."}, {"id": 90, "text": "Amazing movie from start to finish. Brilliant casting."}, {"id": 91, "text": "Great film...well worth the time. Nice blend of heart and humor."}, {"id": 92, "text": "I hated catcher in the rye, but it was forced upon me in the 2000's. This is the coming of age story that millennials can resonate with. The movie takes you on a rollercoaster of emotions. The stomach hurting comedy never ends, but what surprises you is the the heartwarming drama. At one point I was trying to hold back a tear, in which I can only compare to Brian's song. The movie is an epic poem to the memory of Pete's father; it goes through all the stages of grief, while providing the hope for growth in any adolescent male. The director is able to being awareness to mental health in a new profound way that does not seem cliche like other recent movies. It portrays the honest real emotions and conversations that are associated with a mental disorder. Pete's growth as an actor is clear; if you like his stand up, you'll love this."}, {"id": 93, "text": "Terrible movie, not funny, really long and just boring. Skip it and thank me later."}, {"id": 94, "text": "2020's The King of Staten Island is my latest write-up. And no, I'm not talking about Staten Island residents like Gene Simmons, Vernon Reid, and Method Man. Staten is about a twentysomething who lives with his mom and doesn't really have a career or direction in his life. It also doesn't help that his firefighter father died when he was seven leaving him distraught with low self-esteem, a pot-smoking habit, and ADHD.Semi-autobiographical in its approach and blunt to the nth degree, The King of Staten Island is Judd Apatow at his most Apatow (yup, he's the director). Judd without the ability to yell cut, gives us his usual trademarks. We're talking long-winded scenes, longer than normal running times for comedy/dramas, and improvisation to the max. Staten with a wandering and bloated eye, feels like the film Apatow was born to make. No one probably refused him final cut and I'm sure that made big Judd real happy.Starring the likes of Marisa Tomei, Steve Buscemi, and Pete Davidson (he plays the troubled lead in Scott Carlin), Staten follows the Apatow badge in which an unknown trouper gets a chance to break out as a main character in a big studio flick. Seth Rogen did it in Knocked Up while Amy Schumer did it in Trainwreck. Davidson does it raw here in Staten as a sort of life-imitating-art suitor. He's perfectly cast but you don't quite root for him because his life courses of action and paths aren't fully defined (the romanticized yet pat ending is proof of that).Much like the journey Davidson's Scott takes, The King of Staten Island as a film feels jumbled and a little haphazard as well. I liked the authenticity of Staten Island's culture depicted and most of the actors in peaking in, slice-of-life mode, are ones you gravitate to. Still, Staten proves that Apatow can push the envelope but only in a drifting manner. Funny at times, depressing, and kinda touching, The King of Staten Island is no court jester but it's no crowned head either. Rating: 2 and a half stars."}, {"id": 95, "text": "A middle-class guy living in the suburbs gets into some shenanigans, smoking pot and making dry jokes (a few of which land), and then deals with grief and learns that being an adult means taking responsibility for one's actions. Yawn."}, {"id": 96, "text": "Anybody who likes this needs their head checked. really lame celebrating and glorifying laziness in america"}, {"id": 97, "text": "So damn boring, zero plot and a huge waste of money"}, {"id": 98, "text": "After 10 min I decided to clean the dishes. After 20 min i did more housework. After 30 min started I made myself dinner and hoping Marisa Tomei would do something to make this picture interesting. After 40 min Marisa Tomei started dating and f ing some ugly guy and it was not good... After 50 min I had a laugh... good acting Pepe! And after 57 min the movie starts... I thought... At 1 hour 10 min the movie again is about a little child 01.15 the little boy goes angry and makes a bad decision and I decided to end this movie... At 1.27 till 1.28.40 Marisa Tomei started saved the movie. Then the fire thing started and it was ok. In the end I googled it to see what the hell i watched... and saw some SNL guy made a movie. So... his one is for Americans and not the rest of the world.Giving it a 2 stars for Marisa her acting... The rest 99% is pure crap. But my house is clean."}, {"id": 99, "text": "Call me callous but, the protagonist has got to be one of the most unsympathetic characters I have ever seen. The movie itself is fine, but I expected more, much more...at no point did I root for the protagonist. I just wanted the damage he was causing to stop, for the entire excruciatingly long movie"}, {"id": 100, "text": "This movie was soooo good. I love Pete, there is a reason why Lorne Michaels keeps him in Saturday night. He knows the kid is amazing. I watched 2 movies of Pete and I swear he is so original and funny. The guy is amazing. This movie was epic."}, {"id": 101, "text": "Long, boring movie. Nothing really happens through the whole 2:17 hrs!!!"}, {"id": 102, "text": "The tattooed autistic child that stars in this movie is insufferable. The talented supporting cast wasnt enough to drag his adderall riddled performance to anything resembling a decent movie."}, {"id": 103, "text": "Amazing Biopic/Comedy movie detailing the depths of Pete Davidson's life mostly built off of facts and the truth, followed up with a bit of added fictional elements sprinkled throughout."}, {"id": 104, "text": "Why is this movie so long I love pete davidson and bill burr, but damm this movies long , did not even finish it."}, {"id": 105, "text": "The movie is over two hours long. With good writing, directing and editing perhaps they could have pulled it off. However, the acting on the part of all those other than Tomei and Buscemi missed the mark."}, {"id": 106, "text": "Great story. Great acting. Funny and charming.But Hollywood cannot help themselves by injecting politics into every single film. It stands out like a sore thumb. It turns off viewers. It is always out of place because creativity is not Hollywood's thing anymore. Propaganda is. That's it these days. Too bad.Dumpster full of dead horses. Keep beating that..."}, {"id": 107, "text": "Just not that good to be honest. Very little good humour, and a god awful script. The trailer was far better than the actual film. Don't waste your time."}, {"id": 108, "text": "I've been a huge fan of Judd's work I even liked Trainwreck when not being a fan of Amy Schumer. But this movie just didn't hit on any levels for me. I don't even think I laughed once. After seeing Judd's stand up it seemed like things went to his head but this movie proves that he might be on a downward slope."}, {"id": 109, "text": "Scott (Pete Davidson) has ADD and has severe self-esteem issues, worse than Amy Schumer on crack. His dad died as a firefighter which he blames for all of his woes. After 17 years when his mom (Marisa Tomei) finally meets someone, Scott has issues with it. Scott aspires to open a combination tattoo parlor and restaurant. Judd Apatow felt he needed to write another role for his daughter as she is having a hard time finding work.This is a dramedy that created an unrealistic situation with Scott going to the fire station. Scott did a lot of drinking for someone claiming to have Crohn's disease. Did Bel Powley get implants? The film tried to do too much and didn't do it well.Guide: F-word. Sex. No nudity"}, {"id": 110, "text": "Never goes anywhere just like the characters. And that is NOT cool. Aptow, et al might think so but it's not."}, {"id": 111, "text": "Sometimes you just now after a few minutes that you gonna like a movie. The King of Staten Island is one of those. The biggest question was if Pete Davidson can carry the lead and after a few minutes you know he definitely can. His performance is very natural. And don't downplay that by saying he is basically playing himself because I have seen a lot of people fail at that big time. For his first movie he gives a very strong performance.Even though they wisely chose to give him a very good supporting cast. Pamela Adlon is always great and Bel Powley was great ever since she did Carrie Pilby and Marisa Tomei is likable as always. But the real gravitas of course is given by Steve Buscemi. He gives this movie more depth. Otherwise it would have been just a fine little comedy.It could definitely be 20 minutes shorter for what it is and the story is not really well structured but the performances hold it together and make it real fun."}, {"id": 112, "text": "I love when the audience's perspective on a character shifts throughout the story. Those kinds of stories touch me the most and this movie has done the exact same. This is right out of our pure, simple yet over complicated and underrated lives. That does not mean the story resembles my own life. I don't have a tattoo and I don't have any of the problems that the main character Scott has (may be a few). But still I can fully feel connected to the story and that's the best thing about it. Watch it and wish that it doesn't end 'coz that's what I did. Cheers!"}, {"id": 113, "text": "One of the best movies of 2020. The actors are great as well as the director"}, {"id": 114, "text": "King of Staten Island follows Scott (named after Pete Davidson's real father), a deadbeat stoner in his early twenties who lives with his mum, has dreams of becoming a tattoo artist, and brings the grief and trauma of his father's untimely death around with him everywhere. An untimely death that mirrors his own fathers, making this a somewhat autobiographical story by Davidson himself. And that's roughly it. As far as plot goes, King of Staten Island just aimlessly meanders around as plot points snowball and develop into new plot points. As an example a kid wanders out of the woods on to the beach Scott and his friends are hanging out on, and Scott tattoos a line on the kids arm before the kid bails. Of course the kids father comes knocking on his door, one thing leads to another, and the father and Scott's mother start dating. The kids father being a firefighter, like Scott's father, dregs up some unwanted feelings for Scott and he endeavours to sabotage their relationship. This gets him kicked out the house, so he has to find somewhere to live, eventually falling into the local fire department where he learns about camaraderie, responsibility, and caring for others. It's just a series of plot points turning into new plot points like seeing a dull butterfly effect in action.But what about the story? Plot and story are different things entirely, so what story is King of Staten Island wanting to tell through these plot points? Honestly, I'm not really sure. Is this meant to be a movie about grief and trauma? About the arrested development of a grown man-child? And to what end? I stuck with it to see if the answers would come to me in the movie's final moments as everything gets tied together, but it just ends without much resolution at all. In fact it feels like it ends just as we're about to get that kind of resolution. He learns about responsibility, how to care for others, and how to express himself to those close to him, but there's no implication that this will have long-lasting effects. Him bonding with a bunch of firefighters who worked with his father doesn't mean he'll become a firefighter. Him helping a random guy on the street who was stabbed doesn't mean he's going to go into the emergency services. Him professing his love for his on-off girlfriend doesn't mean they'll have much of a relationship. Him finally being able to talk to his mother about his fathers death doesn't necessarily mean he's come to terms with it. He still suffers from the ADD and Bipolar the traumatic event has given him. He's still homeless and jobless. In fact not a whole lot has changed for him between the start and the end of the movie. He's still largely spinning in the exact same spots he was before the movie started. So as the credits rolled, I was left with the feeling of what was the point of all that?As I mentioned before, the comparison to Funny People is a pretty decent one to make. I remember back when that movie came out, it was heavily criticised for being too long and not funny enough, but that was kind of the point. It was about the misery and difficulties faced by comedians; that they're not all intrinsically happy people. King of Staten Island similarly prefers to focus on characters and the drama between them than on jokes and laughs. What jokes and comedy there are here are used to add flavour to the drama, rather than the other way round. There's some good ones for sure, such as Scott antagonising a white supremacist getting a tattoo, Steve Buscemi regaling unheroic stories about Scott's father to him, the choices and executions of some of Scott's tattoo work, and the dark humour of the various dead dad jokes. However for the large part I felt like I just wasn't American enough, or worse not New-Yorker enough, to understand half the jokes. Jokes about comparing Staten Island to Brooklyn and New Jersey meant nothing to me, jokes about American sporting teams meant nothing to me. Hell even the super important closing detail of the entire movie was lost on me simply because I'm not from New York City (Scott gazing up at the building his father (and Davidson's own father) died in). It would be like if I made jokes comparing Soho to Battersea or Lewisham and just expecting everyone who isn't a Brit (or worse a Londoner) to understand how funny I am. All right, yeah, we do make those kind of regional jokes over here too, so King of Staten Island just obviously wasn't aimed at me in the same way Mock the Week isn't exactly a show to recommend to Americans. But when such a large portion of your comedy is so specifically regional, in a movie with obviously international reach and interest to it, something's gone amiss.In truth, I was entertained through almost the entire movie's runtime. The relationship between Scott and Kelsey is a definite high point, in the way that true, humanistic relationships always are in Apatow movies. You just can't but root for every character in this movie, even those as unlikeable as Ray, Ricky, and especially Scott himself. He's narcissistic, self-absorbed, pathetic, lazy, and shirks any amount of responsibility, and yet you can't help but feel sympathy for his character and hope he finds a way to turn his life around. Marisa Tomei, Bill Burr, and Steve Buscemi all give great performances as well. It just felt like a deeply unsatisfactory movie that lacked direction and didn't really have a whole lot to say. It dangled so many potentials, but didn't capitalise on any of them. I give King of Staten Island a just fine 6/10."}, {"id": 115, "text": "It has a sweet ending but this was hard to sit through. It's not funny but not quite a drama. Drags along mostly. I couldn't see the love interest as anything other than The Wilding or a knock-off K-Flay. I don't watch SNL, so I wasn't familiar with Davidson. He's hotter than I thought."}, {"id": 116, "text": "This story is engaging because it pays a lot of respect to brave firemen. Family relationships are well portrayed. There are some laugh out loud jokes we well. I enjoyed it."}, {"id": 117, "text": "Apatows movies always feature lovable heroes basically. The problem with king of staten insland is that Pete Davidson is a loser without ever getting lovable. Even in turning his live arround he doesn't succeed in letting you as a viewer care. The movie was waaay to long and in the end felt pointless. I'm generous with giving it a 6 really."}, {"id": 118, "text": "One of my favorite movies. Imperfect people are angels. The dialogue in the film is also humorous. I like it."}, {"id": 119, "text": "Pete Davidson, usually too stoned on SNL for us to take seriously, is surprisingly good in this film. Great cast and warm hearted story lends to a delightful movie that I thought was just going to be another teen stoner juvenile comedy.... which is how it starts.... but morphs into something better."}, {"id": 120, "text": "I liked the script very much and the events were going so fast They told the sad story of the firemen's death in a funny way The negatives in this movie have not seen a strong musical background."}, {"id": 121, "text": "Great start for you young crew, playing top notch music choice was a huge added bonus"}, {"id": 122, "text": "So beautiful and kinda funny story. I didn't laugh much, but I smiled a lot. heart touching story! Btw. Pete Davidson will be new star of the movies, I believe that"}, {"id": 123, "text": "Someone reach out to his mom and tell her she has the choice."}, {"id": 124, "text": "You're forced to look at this guys ugly face for over 2 hours, what a gem......please. seriously, what a disgusting human being, how did he ever hook up with ariana grande"}, {"id": 125, "text": "Paying $20 to watch a movie in your home is a bit much. This movie though, worth every penny... if not to just support Pete as an aspiring actor. His style of comedy may not be for everyone; it is definitely for me. I think he is hilarious! And, I can relate to him on so many levels. I know he's more than capable of many things to come, and am looking forward to watching them all."}, {"id": 126, "text": "Wasn't expecting more than a buddy comedy but I will say, this movie delivers. Pete Davidson is great, and the story really hits home. Highly recommend."}, {"id": 127, "text": "I think the main reason I enjoyed this film was that I found it very relatable. I too lost a family member at a young age and it had a negative effect on my upbringing, so I can understand where Pete is coming from.I like black comedy so I enjoyed the moments of dark humour delivered in places, some parts had me laughing out loud. Loved the dynamic between Pete and Bill Burr's characters.It's a very heartfelt story, told in a laid-back, subtle, comedic manner, and I enjoyed the ride it took me on."}, {"id": 128, "text": "Yes I'm an old man and maybe out of touch with you youngsters, but you can still get a good story and a laugh and show respect without the constant F word even to your mother,come on now!.From a traditional ist."}, {"id": 129, "text": "This film is raw and beautiful. it portrays the struggles of losing a parent at a young age and mental health in an honest and wonderful way. pete davidson nailed it. if you didn't like the film and thought it was boring and slow, you COMPLETELY missed the point. no disappointments, loved every minute"}, {"id": 130, "text": "I really like the movie but I felt a lot of the time I would get distracted thinking of how much of an autobiography it might really be. If he found the making of it cathartic. Or am I just projecting what I think I know about him from news reports."}, {"id": 131, "text": "Tonally, this movie is all over the place, but that's what makes the film so great. You'll be belly laughing one minute and almost brought to tears the next.Pete Davidson and Judd Apatow make the perfect mixture of comedy and drama. Perfectly cast, as well. I will be telling everyone I know about this film. Easily one of the best comedy films I've seen in 10 years."}, {"id": 132, "text": "Good flick. Judd always delivers a good film. Pete and bill also had great performances."}, {"id": 133, "text": "Pete's dad was a hero. Firemen run into nightmares to save a life. And for that fireman's son, his nightmare was dad not coming home.Thank you to the fireman and their families, for everything they endure."}, {"id": 134, "text": "👎👎 with the acting and storyline didn't an over two hour feature."}, {"id": 135, "text": "The King Of Staten Island is a great movie, there isn't much of a story, but some how you are sucked in to the lives of these characters and some times that is better than a specific story. Pete Davidson is perfect in this film as well as Bel Powley. Over all this is a great film that I think you will enjoy, so give it a watch People"}, {"id": 136, "text": "I liked this movie alot it sort of reminded me of me and my family like my brother had a hard time finding his way if you know what i mean. like me and my other brothers and sisters got jobs out of hs but he never really figured it out.? this movie was good because in it Scott doesnt really have an y direction in life and then his mom (who is Marissa Tommei in this and is really good) starts dating a guy and i din't want to reveal the plot but through their fight and Scott learning more about himself he sort of gets raised by firefighters (his dad was a firefighter and was killed). I recommend it ,"}, {"id": 137, "text": "I love how this movie respects firefighters. Pete can act, and it comes across pretty legit. This is a super fun watch, the pharmacy scene is hilarious. Loved seeing glimpses of Steve Buscemi and Domenick Lombardozzi, among others. And Maria Tomei... man Pete's a lucky guy and I know his dad is shining down on him and is proud."}, {"id": 138, "text": "This film was a weird one for me, never before have I watched a film where it felt really long but I thoroughly enjoyed it at the same time. I honestly felt the slow pace fits perfectly here and theres no explosions or flashing lights, just a good solid story to keep you entertained. Wasn't a fan of Pete Davidson going Into this film but came away respecting his acting ability and learning alot more about his life. Really worth a watch as it's a truly unique film."}, {"id": 139, "text": "The King of Staten Island was an amazingly funny, inspiring and heartbreaking story all-in-one. A very well made film with all the right actors and actresses. Pete Davidson was brilliant. It's worth adding to your movie collection."}, {"id": 140, "text": "As someone who is a real life Scott's sister, this movie was incredibly relatable. I am blown away. I didn't know how badly I needed to see this sibling relationship played out on screen until I did. This is so much more than the typical brother/sister dynamics that are written for tv. That combination of love and happiness and pain and frustration due to someone's mental illness is very real.This is the best movie I've seen in years and I am better now because of having seen it. I can't say enough how much this meant to me. I didn't expect to love this as much as I do but it's my favorite movie now.THANK YOU to everyone who created this."}, {"id": 141, "text": "Pete Davidson was fine but he was better in big time adolescence. Bill Burr was good but not as funny as usual. The jokes are ok nothing laugh out loud. The direction from Judd Apatow was arguably aimless. Overall, I wasn't expecting much and my expectations unfortunately were met."}, {"id": 142, "text": "Surprisingly amazing with funny lines. This movie is one to watch while you want to relax and enjoy a movie."}, {"id": 143, "text": "I wasn't so familiar with Pete Davidson, but former SNL writer, Triumph The Insult Comedy Dog writer, and Roast Battle Champion, Dave Sirus, is very talented, smart and funny.It's a fun slice of life film, and you'll brag to everybody you saw it as Dave Sirus ascends to the level of cinema kings Judd Apatow and Adam McKay."}, {"id": 144, "text": "This movie was incredible. It was funny, touching, and real. There were scenes where it felt like it was Pete talking, instead of the character he played. It just made the movie so war."}, {"id": 145, "text": "Charming, funny, deep, with a breakout performance by Pete Davidson and featuring strong supporting work by Marisa Tomei and Bill Burr. I really enjoyed this film and didn't want it to end."}, {"id": 146, "text": "I should not have been surprised. Predictable. Raw. Funny, introspective, a movie that is not trying to be something it isn't not being preachy. Just a truthful movie and story. Loved it."}, {"id": 147, "text": "Everything is decent, engaging second half.Watched it for ole Billy Burr, does a great job of it. Mustache is fun! Marisa Tomei is fine too, their chemistry is nice to watch."}, {"id": 148, "text": "This movie could have been so much more. It's awfully slow, character flawed, and only a few minutes of the film is even slightly enjoyable or entertaining.I do not understand the films good reviews whatsoever."}, {"id": 149, "text": "Exceeds expectations. A strong finding yourself story that was hilarious but also emotional.. even more so due to the close parallels to Pete Davidson's real life. Enjoyable story, great cinematography and acting.. it felt vulnerable in the best way. Hats off to all involved, especially Pete. Stole the show."}, {"id": 150, "text": "Perfect amount of comedy and drama. Great acting across the board, great script, well done Judd &amp; Team!"}, {"id": 151, "text": "This is such a funny, realistic, and enjoyable movie for older people. I think that it's worth a great rating and I NEED A SECOND MOVIE STARTING WHERE IT ENDED."}, {"id": 152, "text": "I really enjoyed the bursts of true emotion mixed with comedy. I was able to absorb every sad moment without having to cry like a giant baby. If you've ever lost someone, there's parts of this that may be hard but you need to watch it. Thank you for sharing bits of your story Pete. I really enjoyed it. ❤You're only fan."}, {"id": 153, "text": "This movie is totally with the watch! Do not expect to watch a comedy. Expect to see a drama with some humor. It's a great, sweet story."}, {"id": 154, "text": "This film was really quite good! It really showed so many sides of Pete Davidson as an actor and as a person. Its totally a coming of age story in the era post 911 in a family affected by the attacks. Davidson is sweet, frustrating, quirky, lost and then found. At least in my eyes. Highly reccommend."}, {"id": 155, "text": "The King of Staten Island brings us the colourful story of Scott. After losing his fire fighter father at a young age, coupled with mental health challenges, Scott leads a dysfunctional life, which effects all those around him. Scott is a loveable, witty, self depricatinf character who will have you smiling and chuckling as he navigates his way through his relationships with the people closest to him. A worthwhile watch, and another enjoyable movie brought to us by the Judd Apatow brand of films."}, {"id": 156, "text": "When you think of a film, this is what you should expect. Delivers in all aspects. Excellent casting, great acting, and entertaining story. Great job!"}, {"id": 157, "text": "The film is light and relaxed. Despite this with a very strong plot. The best plot is the one taken from real life. In fact, a very positive and touching movie."}, {"id": 158, "text": "Forsure a top 10 movie of 2020. Pete is funny and the storeline is entertaining."}, {"id": 159, "text": "It was alright. A bit lenghty, had a few good laughs, some jokes seemed forced. It's a simple story. Bill Burr surprised with his performace. He is pretty good. Pete is just Pete. I imagine this is just him, not an act. I doubt I'll watch it again. I'm a bit disappointed as I thought it would be better, definitely funnier."}, {"id": 160, "text": "It has its funny moments, good moments and down moments as every movie does... Worth a watch on a rainy day."}, {"id": 161, "text": "This movie is some sort of adaptation to Pete's real life. the movie is casted well and the dynamics between the actors are amazing. he movie does not let you feel boring and there is always something to take from it at any scene. The story telling is amazing. Definitely worth a watch and a rewatch sometime in the future."}, {"id": 162, "text": "I watched this movie as MGK makes an appearance as a Tattoo shop owner and I actually enjoyed the whole movie for what it is."}, {"id": 163, "text": "Beautifully executed. Maybe a little long but it made up for it with the many funny moments throughout the entire movie. Great cast as well. Excellent job."}, {"id": 164, "text": "It's too long, and main character is very despicable and foul-mouthed,. He moan and complain about his life but do nothing about it. the story revolves around in circle and no goes nowhere. the supporting characters are more interesting."}, {"id": 165, "text": "THE KING OF STATEN ISLAND (2020) *** 1/2 Pete Davidson, Marisa Tomei, Bill Burr, Bel Powley, Ricky Velez, Lou Wilson, Moises Arias, Maude Apatow, Kevin Corrigan, Steve Buscemi. Director Judd Apatow delivers the goods with his patented way of mixing humor and heart with Davidson (who collaborated on the script with him and Dave Sirus) as a slacker facing the moment of truth to become something in his life whatever that entails including aspirations of being a tattoo artist while his mother (Tomei) begins a new relationship long after the loss of his firefighter father, whose memory hangs like a cloud over them both. Davidson shines in his first big role onscreen outside of SNL and has potential to be an even bigger comedy star in the making."}, {"id": 166, "text": "I think because this is a Judd Apatow movie that we go in with high expectations for a laugh fest, hijinks, great banter, degenerate but hilarious man-boys/girls. Most of these things either don't exist in this film or they are sparse. It reminds me more a small film such as Britany Runs a Marathon (recommend!) which is a sweet little film in a small NY setting with a simple but emotionally appealing character arc. Pete Davidson is definitely a competent actor and he looks good and healthy. (for Pete) Call me old fashioned, but his tats are so ugly, pure bodily chaos - and I like tattoos. They distracted me. There were so many throw away plot lines and it was too long, unnecessarily. I enjoyed the chemistry between Roy and Scott, I did not get the chemistry with the girl/love interest and the abrupt resolution to that story. Overall, I enjoyed it - enough and recommend it."}, {"id": 167, "text": "I didn't think to much going into this movie because I'm (unfortunately) only familier with Pete Davidson because the time he spent in the tabloids. I also didn't see much advertising for the movie so I expected a run of the mill comedy. I was so pleasantly surprised with what I got instead! I found this story so beautifuly told and heart warm without being sappy. The comedic parts were very funny especially with Scott's friends. Pete Davidson's acting was very good and I noticed really strong chemistry between and anyone he shared a scene with! My fav part of the movie was that the main character wasn't the main love story. The growth we got to see with this character while he accepted his mother's relationship and found himself &amp; then the last scene was his love scene... idk I call that writing perfection. Also if you're familier with Pete's father being a fighter fire, it makes it all the more heart warming and Genuine. My only bad take away was it was a little long but at the same time I didn't want it to end!"}, {"id": 168, "text": "First, I really want to love this one but after first hour it starts to sink by itself. The movie is pretty slow and nothing much happen in more than 2 hours. Second, acting is good but the script is pretty bad. Some cliches here and there. Last, the ending is pretty weak. All great movies have an amazing ending. Not this one. So, overall a wasted opportunity because of timing, script and ending."}, {"id": 169, "text": "The King of Staten Island is for sure worth a watch. It is a simple family drama. It tells about a trauma that Scott, the main character, never solved, but with time and meeting right people slowly he will heal. There is a really nice character development and you can see the gradual transformation from an irresponsible person, into a man that acknowledged the fact that is an adult and need to grow up, by stopping living in the past. The movie in fact is slow paced to appreciate this evolution, but in my opinion it was slightly too long. It would be perfect if it lasted 2 hours, the ending is a little bit dragged out.Cast is solid and I was surprised to see Steve Buscemi in this kind of production. Happy that such talented actor takes part to projects like this. The movie manages to tell about a trauma in a light-hearted, a perfect watch with family and friends."}, {"id": 170, "text": "I never really write reviews but this movie was hilarious and will be memorable for a long time. So many laughs and super relatable and heart warming. New level of respect and love for Pete Davidson after this tribute to his father"}, {"id": 171, "text": "I love this movie. It wasn't over the top like most Hollywood movies. It was real and authentic. I really hope we get a part 2 one day."}, {"id": 172, "text": "Best movie I've seen in a long time. Maybe I have a soft spot for Pete, or maybe it was just that good."}, {"id": 173, "text": "Thank you Pete Davidson for being real. Everything we watch makes you think you should be a certain way, love a certain way, act a certainway. This movie shows you real people have struggles and what we watch isn't real. Ongoing depression and anxiety is real yet brushed off. People who have mental struggles need to be made to feel they can."}, {"id": 174, "text": "The first hour or so kept me interested and had some funny moments as you are introduced to the different characters but the second half of the film becomes a bit cliched and more like a run of the mill feel good movie."}, {"id": 175, "text": "The humor was superficial and not very funny. Many of the situations were unbelievable and mostly just weird. Acting was ok but script was immature.But the worst part is that it lacked any emotion. The story had potential; it could have been explored in a different way, but no, it fell flat and had no soul.After 2 hours, it picks up a bit but still I came out none-the-wiser. Skip."}, {"id": 176, "text": "I knew about 5 minutes into it that I would want to watch it again right away..."}, {"id": 177, "text": "$5 movie. My snapchats are just as funny. It's like a night out with the guys that never ends. Very slow, very long... definitely funny but as I said so is a night out with the boys. ❤💪✊"}, {"id": 178, "text": "I'm not going to analyze the deeper meanings of this flick, I'm just going to say watch it, you won't be sorry. Give it a few minutes and let it come to you."}, {"id": 179, "text": "I expected a comedy movie. Instead I got a drama 30 minutes too long that was painful to watch as we got an intimate introduction to the dark corners of Davidson's mind."}, {"id": 180, "text": "Movie is a tearjerker for me, i'm not particularly one for reviewing movies but this deserves an award. the way it shows the handling of grief and being able to change over time, is beautiful and it really rubbed off as poetic to me.For a comedian to pull off quite a good emotional performance as that was amazing, especially for one of the first few things i've seen him star in. You can tell he pulls the emotion from his fathers death as a way to pull this character off."}, {"id": 181, "text": "Fun movie. I feel it holds Pete Davidson back a little like they softened him a bit but he was awesome. I thought Marisa Tomei and Bill Barr were hilarious! When she gets pissed at both of them that's Gold!. Laughs throughout and I appreciateD the dedication to Pete's father. Good movie. I'd like to see Judd Apatow work with this cast again!"}, {"id": 182, "text": "I have never seen anything with Pete Davidson....i have only seen headlines of him with hot actresses Instagram and people making fun of his looks. Tbh, I can see his charm under the facade.I thought that the movie would be more than what it was. It seemed like if it went a bit deeper it would have been more heartfelt.I loved the interactions with the children. It was pretty cute.There was absolutely no chemistry between Pete's character and the love interest. It didn't even seem like he was remotely interested in her, treated her like a friend that he had sex with only (didn't even seem like he enjoyed having sex with her either)... But by the end he said he loved her? (I think? By the end I was getting bored and playing on my phone) I didn't really buy that at all. Plus, the girl seemed pretty pathetic to put up with it and Then keep trying to get attention when he just didn't respond to it. But then he loved her and was scared? Boyfriend material right there! LololAnyway, back to the real plot of Scott's issues with dealing with his father's death in 9/11. That really sounds like a good storyline but it just stays too shallow for me to really care. And I wanted to care more. I wanted to cry I felt at sad... But I didn't! I cry at everything I watch these days but not this.. I know it's a truly Heartfelt to me when I get all choked up and/or cry.I did laugh a few times but this movie either needed to be more funny or more sad or both. Ie Ricky Gervais's Afterlife - I laughed, I cried... It was heartfelt. Or Schitt's Creek.. I laughed, I cried, it was heartfelt. This movie I laughed a little.Also, why does Staten Island seem like it's in the wrong decade? Marisa Tomei looked like she was in the early 80s with that hair and the glasses. I honestly didn't even recognize her at first. That hair cut was god awful! She's hot... She just played Aunt Mae in Spiderman and was super hot... And in this I could not get passed the haircut.Also, that guy Ray seemed weird and I agreed with Scott that his mother should not date him! First, I knew he would be back to hit on her because she said her husband was dead. (predatory behavior in my opinion) Then he makes Scott take his kids to school after Scott tattooed his son. Ray does not notify his ex wife or the school that a strange man would be doing this. That's bizarre to me. Also, he lied to Marisa Tomei that he was living in the fire house. Also weird. To me, he was manipulative and trying to worm his way into her house to have a place to stay and having Scott be kicked out. Not cool, Ray!I guess there's a happy ending? I honestly don't remember today. (I saw it last night) It was too long for not that much going on in the plot.But, I sorta like Pete Davidson now.This did not seem like a Judd Apatow movie aside from having his daughter in this playing Scott's sister. (she's not that great of an actress but she's beautiful at least)"}, {"id": 183, "text": "I support everything this man does. I know how hard it is to look into yourself and put it to paper. Good on you Pete and crew! Big fan!"}, {"id": 184, "text": "Really entertaining and endearing film. I think it did a great service to Pete Davidson's dad, Scott, while being true to the character and the comedy. Worth watching."}, {"id": 185, "text": "Excellent feel good movie its not a comedy and shud be judged otherwise it's not like knocked up or any other Judd apatow movie .. Bill Burr is excellent in this movie 4/5 for me .."}, {"id": 186, "text": "Great performance from Davidson and Burr. Excellent stuff."}, {"id": 187, "text": "There were some funny parts but Davidson's character is the typical snowflake of this generation. People's reviews saying the movie is relatable to them must be adults still living at home with their parents."}, {"id": 188, "text": "I enjoyed King of Staten Island a lot more than I expected to! A bit sad but so funny and heartfelt. Very entertaining, beautiful cinematography, well made, and great dialogue! I loved Pete Davidson I hope to see him in more projects in the future. Please stop disliking my review, I have autism and I'm a little quirky."}, {"id": 189, "text": "I found the movie to be both inspirational as well as a statement on youth. Taking the time to be there for someone and not giving up on them while still holding them accountable for their actions. Pete was surprisingly good in his role and supporting cast was top notch in their story telling. The underlying statement to this movie is to be positive and truthful, even if it hurts at times."}, {"id": 190, "text": "Pete Davidson painted a great picture of what it can be like battling depression when trying to achieve your dreams. It's funny, it's relatable, it's a movie 100% worth seeing. Thanks Pete, I hope you've got more in the mix soon 👍🏼"}, {"id": 191, "text": "Even though Pete Davidson was pretty much playing himself, he still did a great job. I didn't think it was the funniest movie, but it was still a good film. The story flowed well and was easy to watch. I can see Pete scoring some big roles in the future. Solid 7 star film. Give it a watch."}, {"id": 192, "text": "With Maude's great acting and Pete's dedication to making this project great, they hit this one out of the park! This film has everything from emotion, drama, comedy, sex, violence, and a wonderful cast. Judd, Pete, and Dave did a really amazing job writing this film and Maude Apatow is going to win an Oscar for best supporting actress."}, {"id": 193, "text": "Pete nails this on screen real-life character with ease. A nice mix of comedy and drama, but not overly done. Personally I found it more funny than not, but there's a real story with a heartfelt meaning behind it. It's worth every minute. I hope this is the one that catapults Pete to the Big time with all he's had to deal with, he deserves it. Do not miss this great movie."}, {"id": 194, "text": "Great rare autobiographical comedy, Pete Davidsons best work really believe he is the next special SNL gem, Bill Burr showing off his developing acting chops."}, {"id": 195, "text": "Really solid movie that I related to a lot. This is so true and a very Realistic story among young guys of today. Pete Dividson' s performance was so on point....and really felt for Igor his pal. Was a little disappointed at how it ended.... expected a more solid happy ending but a very enjoyable movie nonetheless👌🏾"}, {"id": 196, "text": "I'm a huge-huge Bill Burr fan so I was immediately drawn to this movie. Bill Burr shines, - but so does the rest of the cast. I enjoyed this film from beginning to end. It's raw, comedic, and weird at times but at all times entertaining. Personally I think it's a great film. This is the type of Judd Apatow content I love and appreciate. Plus I watched this with my uptight parents and younger brother and we all really enjoyed it.I enjoyed the score to the movie as well."}, {"id": 197, "text": "Had been anticipating this film from Judd Apatow and watched this on Prime Video. Was not that good definition as I though it should, being claimed as 4K UHD. Anyways, about an hour into the movie I was waiting for it pick up and it finally did, but it felt so late into the movie. I can't say it's not great or a bad film. I did enjoy it later into the film and it made up for the rest."}, {"id": 198, "text": "This movie was a great time, although it took a little while to get going. It was a very funny, very heartfelt coming-of-age story that showcases Pete Davidson's acting ability. With the added context of Davidson's past and how personal this is to him, you appreciate the movie so much more for how raw, honest and genuine it feels. Maybe it crosses the line a couple times and feels a little unfocused, but I had a really fun time with it.Recommended for: Fans of Pete Davidson, fans of coming-of-age dramedies, or fans of really bad tattoo ideas."}, {"id": 199, "text": "This movie embodies what it feels like to struggle with ADHD and/or mental illness. I laughed out loud and cried the entire movie."}, {"id": 200, "text": "Really liked this movie. Apatow (🐐) strikes again with one of his more special movies. Wasn't his normal type of movie, and there was a lot of emotion and heart in it from a great cast. I love Pete Davidson and he did great in his first big time role. He's so good at providing comedy in tough situations that just makes you laugh out loud. Marisa Tomei, Bill Burr, and Maude Apatow were really good. Steve Buscemi was my favorite part of the movie in his small role. The music was really good throughout the movie. Just an all around great movie, and one that met my crazy high expectations for it. Best movie of 2020 so far, but it could stay that way for the whole year."}, {"id": 201, "text": "This is a very good film, starts out like What you'd expect from the typical crude edgy comedy but very quickly grows into something heartfelt and impactful, it is very much worth a watch, after finishing the movie I immediately went to amazon to pre order the blu-ray."}, {"id": 202, "text": "Really enjoyed the movie. Great cast, well written, funny and heart warmibg"}, {"id": 203, "text": "While it must be disappointing that The King of Staten Island didn't have its chance to debut on the film festival circuit and in movie theaters, this rollout on streaming at home gives a fitting quirky twist to this offbeat but lovable film. While the film is not an autobiography or documentary, it does weave many personal details of Pete's life into a very compelling story with some hilarious moments. Two of my favorites were the rundown why college is a ripoff and the ringtones during a botched burglary that help the victims fight back! Great choices for the cast, especially Marisa Tomei iin the role as Scott's mom."}, {"id": 204, "text": "Super stoked for Pete, what an amazing performance, thoroughly enjoyed this one, great movie and deserves 8 stars"}, {"id": 205, "text": "I was really impressed with Davidson's acting in the movie. I was already a fan of Pete's comedic work, but whenever he needed to get dramatic, he did really good. Overall a very good story as well. Only complaint is that it went on a little long, but overall, one of the best movies of 2020."}, {"id": 206, "text": "This film start with a young man Scott listening song in the car while driving, and he accidentally hitting a car scene! As turnout, this film is about Scott trying to bonding with his three buddies, his sister, his mother, his mother's boyfriend, and his girlfriend, while he dreaming to open a tattoo restaurant! Entire film full of boring conversation, and annoying overuse scene! Such as, overuse of the song playing at the background scene, overuse of the partying scene, overuse of the smoking weed scene, and overuse of the arguing scene! Make the film unwatchable! Barely laughable scene is, Scott spit on the bread order by Ray! Barely intense scene is, Oscar been shot at the pharmacy while robbing the pharmacy! At the end, Scott accompany his girlfriend Kelsey to take her test! That's it! Another disappointed film!"}, {"id": 207, "text": "Great acting across the board. all seem to bounce well off of each other. it's promoted as being a comedy but it is so much more than that. if is a really good story that just makes you 'feel' something. feel good, feel sad, feel connected. apart from Pete Davidson, who was exceptional, the mum and girlfriend were equally so well acted that you forgot they were acting. original, quirky and deep. highly recommended. by me anyway.... :)"}, {"id": 208, "text": "No matter how bad you have it, know that there are ppl in the world like what's portrayed in this movie and breathe... you're going to be ok."}, {"id": 209, "text": "Greetings from Lithuania.The King of Staten Island (2020) is a well written, acted and directed comedy drama about a young man in search of him self. And as cliched as it sounds, this plot actually worked here pretty well because of the solid craftsmanship. I also was very surprised when i learned after watching this movie that the story of main character is more or less autobiographic.Overall, The King of Staten Island is a solid drama / comedy. Simple yet good story, good craftsmanship and good acting makes this film very watchable."}, {"id": 210, "text": "I'm not a huge fan of Davidson and I expected to hate this movie. Honestly? It was really good and Davidson is what MADE it good. His acting made the movie entertaining and believable."}, {"id": 211, "text": "Rented a copy of this recently not knowing what to expect but boy was i in for a treat pette davidson and bill burr work well feeding off one another and are a comedy dream team you feel every emotion in this movie laughter pain heartaich and its all beautifully done highly recommend it"}, {"id": 212, "text": "This film was almost exactly what i went into it expecting. Really well-acted by everyone involved, very funny, relatable, and sometimes extremely heartfelt. It was all that, but the movie suffers a bit from dragging too much at times and It would probably benefit from a 15-20 minute shorter runtime. But all in all, a really nice film!"}, {"id": 213, "text": "What can i say, the king of staten island is a great movie. It's a story about a guy in his mid 20's who's suffering from ADD and the pressure his environment puts on him to do something with his life. His sister is going to college and his deceased dad was a hero-firefighter, this resulting in putting even more pressure onto him to do something important. His dream is to become a tattoo artist, but things just don't seem to work out for him (he's also lacking human canvas to practice on ;-) ). Because of him failing to find a human canvas, he decides to tattoo a random 8 year old boy in the woods; but he doesn't get further than a single line. This leads to the boys dad visiting their house and getting into a relationship with the wannabe-tattoo-artists mother. The problem here is; his mothers new 'boyfriend' is a firefighter too, he puts more pressure on the guy, and acts like he's trying to fill in the 'father-role-gap' which the family was missing. All this results in a hot mess filled with prejudices about each others current and past lifestyle.The King Of Staten Island has a very clear message; never judge a book by its cover. It's all about being open, supporting each other and giving people a chance to prove themselves. Where tattoos can seem to give off a 'dangerous' vibe, they can also be seen as the clearest and most functional way of communication there is. The movie tackles the differences between people in the way they express themselves; where our main character is very (negatively) outspoken and filled with tattoos - his mothers new boyfriend is the complete opposite (acting very positive and has 0 tattoos). The truth is they both kinda suck(ed) in life, but they communicate it to the outside world in a very different way, leading to frustration between the two.Openness and communication is key in life, it brings opportunity and chances. The way you choose to communicate (for example through tattoos) is up to you, as long as you don't judge people for not expressing themselves in the same way (our main character for example surrounds himself with people who are just like him, rather than spending time with his mom or sister who really care about him but express themselves in a different way).The King Of Staten Island talks about these subjects in a very exciting, funny and entertaining way. It knows what its going for and doesn't try to be more than it is. It basically succeeds in what it's trying to achieve. It has a few scenes which eventually go nowhere and have 0 purpose, but they didn't bother me that much. Don't expect top notch acting or an amazing story, just a decent enjoyable movie!"}, {"id": 214, "text": "Ever since his dad died in a firefighter incident, Scott's life hasn't managed to go anywhere. He spends every day smoking pot and talks about opening a tattoo resturant (but never follows through on it), plus has a case of ADD and Crohns disease. He also has to take care of his mother by himself when his sister goes away for college. But one day a seemingly minor event changes everything...Besides Judd Apatow's brand of humor, I didn't know what to expect from this film. Not a lot of interesting movies were playing in theaters, so I thought I might as well give this one a chance.I had never seen Pete Davidson in anything before this, but after his performance in this film I won't forget him. While at first Scott doesnt seem like much more than a crazy manchild, I really started to feel affectionate for the guy after a while. You laugh at his inappropriately timed comments and shortsighted decisions, but Davidson also portrays how his impulsive behavior makes him doubt his own selfworth, that maybe he's too stupid to ever reach any higher.The conflict that stirs up after his mom (superbly played by Marisa Tomei) hooks up with a new boyfriend doesn't feel cliché in any way. You understand Scotts worry once he learns hes not only someone he got off with on the wrong foot, but is also a firefighter just like his dad. His stubborn inability to give him a chance to the fear of going through another loss or the idea that she goes for the same type just as a vain replacement for his father feels justified. We're shown Ray doesn't think highly of him either, judging by the conversation with Margie where he dismisses the tattoo resturant concept and thinks he'll never amount to anything. The fact that she doesn't even defend her son is even sadder, like there might be some truth in what he says.Since I mentioned Ray, I should also talk about Bill Burr. Even though his face looked familiar, not once did I recognize that was him since he completely disappeared into the character. He walks the line between likable and kind of arrogant, which is hard to pull off, but he manages to do so perfectly.But while the movie does get heavy, it's also hilarious much of the time. Not just Davidson, but also Burr, Tomei, Pamela Adlon, Steve Buscemi and the actors playing Scott's friend circle get moments to shine in terms of comedy. At times silly, other times deadpan, the humor always feel natural to the characters and progression of the story. It feels very hangout in terms of tone, where you are just observing these people sharing laughs and poking fun at each other. Additionally, there are times where it can get uncomfortable and funny at the same time, most of those momens owed to Davidson.Apatow's daughter Maude does a very good job as Scott's sister Claire. She's kind of a regular in his films, but this is her most memorable part so far.Does the plot take expected turns? Sure. Every relationship gets a happy ending, everyone gets along in the end (except for Ray and his ex-wife Gina) and even Igor's potential catfish girlfriend is actually real. But none of that matters as long as you're having a good time, which I certainly did.The King Of Staten Island isn't Apatow's most serious film (that would be Funny People), but I do think it's his most sincere. Whether you know who Pete Davidson is or not, I highly recommend it for anyone who wants a good laugh along with engaging characters."}, {"id": 215, "text": "The story of a 24 year old guy that lives with his mother, and whose father had died a hero rescuing lives in his work as a fireman. The person is a tatto artist wanna be . He is lost. Dont know what wants out of life. Resort to drugs most of the ime to slow things down. But later in the story after his relationship with his mothrer's boyfriend whose child he tried to tatto earlier he starts having good relationships with others and a more postive attitude toward life. Nice film"}, {"id": 216, "text": "Just great acting and just so real and it's his actual history and emotions he's somehow having to keep it together yet still act like he did when it happened. Loved all the actors and director, can't wait til his next movie."}, {"id": 217, "text": "Everyone did an excellent job in the making of this film! Saying job is an understatement. Pete is a very talented individual. This movie is very heartfelt and has a comedic value to it that keeps a smile on your face. Brilliant!"}, {"id": 218, "text": "I could type a million things about this movie from losing by dad to not 911 but from some drunk idiot but being taken care of by a honorable man who was a firefighter, I didn't whine and make a movie about it, yes it's hard but man up and instead of being portrayed as a victim, they were not us, we are still here, I gave it 4 stars out of respect not for pity"}, {"id": 219, "text": "One of the best movies I've seen in years. Takes a while to see what the point is, or why you should be watching..but it's refreshing honestly. Give it a chance. It's over 2 hours of a movie, you have to keep going until the 1 hour mark to suck you in."}, {"id": 220, "text": "Trailer didn't do this movie justice. I was surprised by how much I enjoyed it. Watch it 3 times since I rented it yesterday. Bel Powley is great in this. Definitely could have done without Judd Apatow casting his daughter again. Which is just a bit better than casting his wife. Feel like his daughter should have to work for her roles instead of just being privileged and getting them handed to her by her father. Think of all the young actresses that lost out on a decent role because Judd wants his daughter to act. Went on bit of a rant but I'm tired of these director/producers shoe horning their kids in."}, {"id": 221, "text": "Such a good watch. Pete Davidson was excellent, I mean, the guy might not have range, but he did great in basically being himself, loved that. All supporting cast were great, Marisa Tomei, Bill Burr. Great directorial by Judd Apatow. The film has enough emotions to make you laugh as well as cry. So funny to watch, loved it."}, {"id": 222, "text": "Considering I am squarely in the camp of Pete Davidson cannot act (watch him try to say any lines on SNL, this guy definitely benefits from the multiple takes available to movie actors), me rating this film as highly as I have is saying something.The film itself is semi-biographical of Pete's own life, although it (surprisingly) excises the fact that Pete's real dad died on 9/11, although I'm guessing this was due to timing (this film was set in modern day, although the real Pete would've been living on Staten Island (as portrayed) in the 00's).What follows is a pretty by-the-numbers coming-of-age tale, despite the real connection, it's no different than many loser finds purpose stories that have been told a million times before.However, the story itself is told in a truly heartfelt way, and there are some minor laughs, so it's not a complete waste.2 points of contention:1) As much as I make fun of Pete's acting, in comparison to the woman playing his sister, Maude Apatow (the director's daughter), Pete is Tom Hanks, because she simply cannot act, her Staten Island accent is so thick and overdone it's painful to listen to. This trend of directors casting their no-talent kids in films (I'm looking at you, Kevin Smith), needs to stop. Yay for nepotism!2) The film could've used some heavy handed editing, it definitely didn't need to be nearly as long as it was. Judd Apatow is famous for making very long comedies, but I don't think some of the scenes really add anything to the film, in the end. They just drag.Is this film worth seeing? Yes. Paying the full price theater-to-home streaming option? Probably not. Wait until it's free on Netflix, would be my suggestion."}, {"id": 223, "text": "Such an awesome movie!! Very funny and heartwarming!! I will definitely be watching it again!! Well done guys!!!"}, {"id": 224, "text": "This falls perfectly into indie category. Some bits a bit unrealistic but otherwise a perfectly crafted film that will make you feel good. Maybe if you are from 20 to 40 years of age you will relate into that situation in life when nothing that you do feels meaningful enough. And you still think life is good enough but might need some focus in finding out what you really want to do in life. I gave it ten because it was well made and I had not seen many good movies recently. Because these kind of movies about ordinary lives are hard to make interesting and meaningful. A bit like Juno or other small tales that make life a little bit better."}, {"id": 225, "text": "If you like drama and comedy with a bit of an edge. This movie is perfect. If you want action then watch an action movie. Almost faultless from start to finish, with a nice touch from Buscemi and Burr along the way"}, {"id": 226, "text": "This movie gives a good insight as to what has made Pete Davidson into who he is today, sprinkled with bits of 'what would have been' without the comedy career. This movie made me laugh, cry, and also had me on the edge of my seat at moments. The entire cast was phenomenal, but Pete really stole the entire show with his performance! However, the on screen chemistry with Bel Powley made that storyline incredibly special, along with cameo's from Pete's family members and some of his best friends. You can tell throughout the entire film that this was a very personal and vulnerable project for Pete and was very important to him. The movie is a bit long, but I was so engaged the entire time that it didn't feel like it was 2 hours. It's definitely one of those movies that I wish I could erase from my mind and watch it over again for the first time all over again!"}, {"id": 227, "text": "By far the best movie I have ever seen if I could give it more star I would it was so good it deserves such a better review from the critics I would watch this over and over again i wish they would have made it a 4 hour movie"}, {"id": 228, "text": "Every character is great and genuine. I couldn't stop watching."}, {"id": 229, "text": "The movie is inspired form the tragedy thay happened with Pete Davidson in real-life and I suggest you watch it because it's all about how tough life can be. The movie is Extremely Overwhelming ❤ and Pete Davidson really knows how to act. He's just brilliant."}, {"id": 230, "text": "7.1.... People may be high rating this movie but I think it's very mediocre and lacks an ending. Nice soul and propose...but let's be real, it's okay-ish but gets scored positive due the why of the movie and not the movie.Ps: I want to marry Hanne VL."}, {"id": 231, "text": "Judd Apatow at the top of his game and doing drama? It's flawless like this is his forte. I want to see him tackle drama again and maybe sci fi and horror could be really interesting too. Maybe he is the director/screenwriter that can save these genres from the expected mess being produced."}, {"id": 232, "text": "So funny I felt the need to right my first review in years. The same style of comedy as Seth Rogen, but this movie is funnier than anything I have seen of his lately. The expectations were low, and they were far exceeded, worth a watch for sure!"}, {"id": 233, "text": "One of the best of the year. Funny and dramatic as to a lot of Judd's other films. Like the rest this one works really well."}, {"id": 234, "text": "I'm a huge fan of Pete Davidson and Judd Apatow so I planned on watching this from the second I saw it advertised. The price of the rental originally made me skeptical, but I'm so glad I did it anyway! I've since rented it again and have probably watched it about 4 times now. As someone around the same age as Scott (Pete) it resonates with me deeply. It is such a great coming of age, and coming to terms with personal trauma story. Mix that with the comedy and awesome acting and you have yourself a truly heartwarming, exceptionally raw and very very funny work of art. Great job to all those involved! Definitely recommend watching!"}, {"id": 235, "text": "Mate this film is just so lit i cant stress it enough, i rented it for 2 days and watched it like 5 times not even joking. pete davidson is just god disguised as a human i think."}, {"id": 236, "text": "Reading the backstory on Pete Davidson, clearly the subject matter resonates with him. Unaware of his previous work, but he strikes a very likeable, amusing character in a piece directed by Apatow sensitively without tipping too much into schmatlz. Great ensemble, just could easily have lost 20 mins or more"}, {"id": 237, "text": "There is really not that much happening in this movie yet there is happening so much. All felt very natural and had a very nice flow to it. The drama isn't too dramatic. The humour is more subtle, don't expect to be slapping your knees but it is funny. Most of all though, you can expect great performances by almost everyone involved (except one nude fireman in one scene). Very real, very relatable and sensitive but not in a pathetic way. Congrats, Pete, great flick..."}, {"id": 238, "text": "Roger Staubach graduated from the US Naval Academy! Otherwise, solid flick!"}, {"id": 239, "text": "I really love Pete so I know all about his suffering his father's tragic story his mental and physical illnesses and tbh I was expecting so many cliché stuff but everything was represented in a fresh and interesting way . The story was great and Pete is SOO TALENTED ! He is so honest in his emotions it reaches the heart immediately. Sending love to Pete from Egypt ❤❤❤"}, {"id": 240, "text": "This was a very enjoyable movie to watch. It has excellent pacing and none of the scenes feel out of place or out of beat. The movie is funny in the right places but can also be very emotional if it needs to be. I though all the performances were great except for Scott's friends, Oscar, Richie, Igor, and Tara. They seemed quite flat and in need of some more character development. Pete Davidson seemed very real, probably because this story is very personal to him. I was worried that Bill Burr may seem out of place but he was surprisingly tame throughout the movie. He never went over the top which helped the film a great deal. The only gripe that I had with the movie is it's runtime. It is 2 hours and 16 minutes and you can feel every second. If the movie was cut to around 1 hour and 45 minutes, it would be great. All in all its a fun watch but make sure you have enough time to sit through it."}, {"id": 241, "text": "I liked it. It was funny and good. And very real of our society today. I love Judd Apatow movies. Very funny and he always puts a message in his movies. He is one of my best directors that I like. Please check this movie out."}, {"id": 242, "text": "Movie was great all and all, such a feel good movie, original concept with a lot of funny moments and interesting scenes. The movie production may not be the best at some parts, and people may think that it looks a bit amateurish, but that's just a fraction of the movie. I really enjoyed the movie, it gave me some insights on how the real world can be, because I am a young dude myself trying to fit in and find my place in the society."}, {"id": 243, "text": "It's rare to come across a comedy that doesn't just recycle the same old tired 1950's jokes (sexism, body shaming, toxic masculinity, in other words- kicking downwards). The King of Staten Island has a lot of original, funny scenes and jokes that originate in reality and serious matters, taking them to an absurd level, but still keeping it believable enough that you actually know people that would almost act like this (except not being nearly as witty). Even the women (except the sister) are allowed to be funny. Excellent acting all around. Examples of what I think is funny: Get Him To the Greek, Silicon Valley, The Heat, Unbreakable Kimmy Schmidt, Greener Grass, Nanette. Examples of what I don't think is funny: The 40-Year-Old Virgin, everything with Adam Sandler (and the whole slew of movies/series like that). It kind of reminds me of Oscar Wilde's plays, where all characters are witty in the same way. Very entertaining and lots of laughs and giggles throughout the film."}, {"id": 244, "text": "Movie is ok, but the interesting part is bill burr playing as bill burr. that man is authentic and funny. magnificent"}, {"id": 245, "text": "I saw the trailer and thought it looked fun..and it was. An extremely entertaining movie with heart. Pete davidson really did a good job, and he's definitely a rising comedy movie star. Love the dynamic between all the characters and the story was simple and the movie itself was just an easy watch. I would recommend to anyone who likes Judd Apatow."}, {"id": 246, "text": "I would say it's very interesting movie to watch. Not too complicated to catch main idea and fallow plot. Still the ending wasn't strong part of this film. I'm still missing ending, it wasn't very clear."}, {"id": 247, "text": "Its a really good show I love it so much its tell alot"}, {"id": 248, "text": "A beautifully told story about being a late bloomer, coping with loss, and a journey to open yourself to the thought of being worthy to love. Pete Davidson's vulnerability in this movie was nothing short of courageous. He put his heart on the big screen and took us through his insecurities. I signed up with the expectation of a raunchy comedy that would hopefully make me break a rib and what I got was substance. This movie will grip you with is authenticity, unexpected acting brilliance from Bill Burr and Pete Davidson. Bravo Judd, Bravo Pete."}, {"id": 249, "text": "Honest and funny. Completely worth the watch. Davidson does a great job."}, {"id": 250, "text": "All in all, not a bad movie. Def not a great one either. It's obviously about Pete Davidson's real life so it would help to keep that in mind before watching the movie.I felt like the parts that they were trying to make funny weren't funny and the parts that weren't trying to be funny were funny.Also, what's up with Pete Davidson being so suicidal? Like I get it, he's had a rough life but enough with that stuff. If I were an actor I would wanna pursue things that were creative as opposed to creating things that were based on my real life. Anyways the movie was so long. They could of cut it in half and that's a fact. There are numerous scenes where two characters have conversations that are just way too long and that just doesnt happen in real life. Kind of a try hard film."}, {"id": 251, "text": "I've always had a special spot in my heart for Pete. I loved this movie, and the ending made me so happy. It's been a while since a movie made me smile like that. Check it out."}, {"id": 252, "text": "Where's the big screen, popcorn and drinks. Really. I'll wait."}, {"id": 253, "text": "I really wanted to see this, but I don't want to support a movie company who would force us to see it on Prime and yank it from the drive-ins."}, {"id": 254, "text": "I have never been that big of a fan for Pete Davidson but watching this movie really got me to see how funny and competent an actor he really is. He seems to really feel like his characters he plays and that's probably because the characters he plays have been pretty identical to who he is as a person.Although this movie is not a typical Judd Apatow movie where it is full of hilarious scenes that make you bust out laughing the whole time, it still has it's good laughs from time to time. The story is very intriguing, keeps you engage, while also having feelings for the main characters.Overall I would say this is one of Judd Apatow's best works from a theatrical standpoint as it has a good blend between comedy and drama. Overall score would be a 87/100."}, {"id": 255, "text": "I hated leave a star rating, because I did not get this movie. And hence, it seemed unfair to rate it, so I went neutral 5 plus 1 for benefit of the doubt. I think my kid nailed it with the comment I bet guys who hang around drinking with their guy friends a lot love this movie."}, {"id": 256, "text": "Loved this so much. Great family (teen) watch. Great cast, great soundtrack and portrayed real, imperfect relationships, and doubts about those typically imperfect relationships. Marissa Tomei is just lovely"}, {"id": 257, "text": "2020 Movie Of The Year All Though There Hasn't Been Too Many Too Check Out This Year And For Some Reason I Kept Putting This One Off. It Was Outstanding Did Not Expect It To Be As Funny As It Was. And Also The Actor Where All Really Good A Must See"}, {"id": 258, "text": "Covid banished to streaming, The King of Staten Island is too long. The lead Scott is a thinly veiled version of Davidson, whose own firefighter father died in 9/11, and who has been open about his struggles with Crohn's and his mental health. The blurring between fact and fiction is the film's real hook. Marisa Tomei is characteristically empathetic and warm as Scott's mother, and Buscemi adds depath as a kindly firefighter.It's a mess of a film, that eventuially finds its way and has some funny moments. Scott is both adorable and unpleasant, and his trajectory ultra scattershot."}, {"id": 259, "text": "Judd apatow and pete Davidson at their best. Definitely worth a watch and one of the better films of 2020. The movie is relatable and hits the perfect match of drama and comedy. It goes from suspenseful to big belly laughs, it's a must see. Also amazing acting by Pete Davidson he truly is the king of Staten Island"}, {"id": 260, "text": "Great movie! It has a little bit of everything, it's funny, sad, serious, silly and is about real feelings and emotions many face in life. Well worth the watch."}, {"id": 261, "text": "I enjoyed this movie, it was one I've been wanting to watch since I saw the trailer. I was not disappointed. There was a great story and great character development which we don't always see these days. Honestly the movie wasn't 100% what I was expecting but I enjoyed it. I wasn't a fan of the ending at all. When the credits started I was like wait what? It's over? I wanted more and I didn't think it was a great ending. But overall it was a great movie."}, {"id": 262, "text": "After 2+ of this I wanted to bully the protagonist myself. Not sure who Pete Davidson is but I have zero interest watching him act again. Marisa Tomei and Bill Burr were decent support. Steve Buscemi was severely under-utilised. Should've ditched the comedy and dialled in the drama with a different lead and this might've been.. alright."}, {"id": 263, "text": "Slow, but not boring. Great math questions though. It's very hard to prove you're not stupid in NY"}, {"id": 264, "text": "The King of Staten Island is the 5th feature film directed by Judd Apatow, singular and sparse sex comedy author whose previous Trainwreck (2015) was reviewed in these pages August 24th 2015.The King of Staten Island tells the story of Scott (Pete Davidson, who also co-wrote the reportedly semi-autobiographical script), 24 and still living with Mom in the eponymous borough, a loser of Lerean proportions hell-bent on living up to Bart Simpson's underachiever and proud of it motto, wasting time away with a group of outcast nerd friends - or what for Staten Island standards might actually be perfectly normal people - and half-noncommitting to nice girlfriend Kelsey (Maude Apatow, the director's daughter, remind me sometime to expand on nepotism in Hollywood). Scott does have ADHD and Crohn's desease, which he uses both as excuse and badge of honour to dodge even the remotest opportunities to straighten up.The Staten Island connotation may not register fully outside the Big Apple. Think sub-suburban no man's land, a 15 minute ferry ride to Manhattan but for all you know you could be in North Dakota. Apatow, to his credit, brings it to life, or rather lets it live, as he does Scott, who carries on with aloof and amused indifference to all who don't realise there is nothing wrong with him being who he is. Similarly, the film flows Proustian to nowhere, affectionately portraying the characters till (spoiler alert) half-expectedly a Capraesque open ended happy end offers closure."}, {"id": 265, "text": "The people giving this film bad reviews have absolutely no soul. I mean this is real life. It's the way life is; not some crazy BS. The twists and turns in the storyline are genius. Perhaps not Oscar or Golden globe material but I loved it. The 2+ hour run time was no problem."}, {"id": 266, "text": "Despite the length of over 2 hrs, the movie kept me intrigued and never felt boring! I liked the story arch very much - it is about subtle changes in life. so even although very subtle, it still has the main points of a classical story development. The soundtrack is very well chosen and the cast is amazing. All in all, the movie is very personal, but also witty and heartwarming. I recommend it to all my friends."}, {"id": 267, "text": "Wow, no stars bad reviews. give it more than a chance. Amazing film, if you have a heart and a brain........ Capitulated from 5 mins and great acting from all."}, {"id": 268, "text": "The open dialogue about mental health will help so many people. The realness of the characters and the caliber of the acting was so unexpected and so believable. I was sucked into the storyline throughout the entire film. I think the firefighter scenes were some of the best I've scene as far as the realism of a tight-knit firehouse. The action scenes were very well done. I know it's a Judd Apatow film, and I shouldn't be surprised - but as a big SNL and Pete fan, I was so pleasantly surprised by Pete's performance and the plot of this film. Well done movie, in a time when movies give us so much comfort."}, {"id": 269, "text": "This was the most average movie of my life. I would not recommend it"}, {"id": 270, "text": "Pete Davidson looks like he stole my papa's dentures those teeth are too big for his face. Not sure how this guy is in movies, was James Franco not available? Bill burr I should of dropped my rating just for that mustache hahaha. There's some feel good moments with Pete and burrs kids. There's some cheesy parts with Pete and burr fighting. But overall the movie is worth watching, all jokes aside, definitely some funny parts."}, {"id": 271, "text": "Ol' Billy Read Face shines in it like his bald frecled head on a sunny afternoon!"}, {"id": 272, "text": "The King of Staten Island was a nice surprise to me ,it had some very good fun moments in it and some very funny jokes that worked in a very good and entereteining way,Pete Davidson was able to surprise me a lot in this film,not just in comedic situations but with dramatic also to,and he showed that he is talented young person,story was simple but effective and some deep staff in it but done in such a way that even younger generations could understand it,cast was also great ,Merisa Tomei was great as mom character and Steve Buschemi was as usually awesome,The King of Staten Island was a great comedic film with some very emotional and real story that will impact many people who will decide to see movie"}, {"id": 273, "text": "With a little editing I think this could have been great. The lack of structure does replicate the feeling of having a structureless life, but the length of certain scenes (sometimes thanks to the Apatow-ey improv) means you forget about certain subplots, only to be surprised when they re-enter the picture.Still, everything else is great or close to it. Davidson and Burr were particularly good in an overall strong cast, it balances comedy and drama well, and told a story I could relate to fairly well at this point in my life.In time I could see my score being raised, but for now it's a very strong 7/10."}, {"id": 274, "text": "Too bad this movie had to come out right in the middle of Covid. A lot more people would've seen it, and it's worth watching. Definitely. Pete Davidson was my main concern about liking this movie. I love SNL and he's an also-ran in an also-ran era for them currently. He's funniest playing himself on SNL. Not a good thing for the show really. But Apatow harnessed that in this film. I guess this movie is based on Davidson's real life(surprising? Haha) growing up. It's got all the hallmarks of an Apatow film. Kinda deep at times, heartwarming and pretty funny at several points to not make you feel guilty about actually feeling real human emotions. The ensemble cast he always puts together so well, he has done so again. Marissa Tomei is always beautiful and awesome. Steve Buscemi is great in a small role. Bill Burr is both funny and touching. The British girl from The Morning Show is good(with a hilarious Staten Island accent). Special shout out to his oldest daughter Maude Apatow, who again thanks to dad, shines in another of his films."}, {"id": 275, "text": "I really enjoyed this movie. Pete Davidson and the supporting cast were all great. It did have a couple of wince-worthy moments but the fact that I was so genuinely satisfied afterwards speaks lengths about how good it is overall. I especially enjoyed Pete's journey (because that's essentially what it is) and I could feel myself realting a lot. You should definitely give it a watch."}, {"id": 276, "text": "To be honest I only really review movies that are either really bad when I was expecting fan faire... or if the movie is exceptional when I was expecting a good 2 hour nap. I really enjoyed watching this, to the point that I found myself smiling throughout and I didn't mind hanging out with Pete for 2 hours and 15 minutes. He was so relatable and oddly likeable, that I now want to have a joint with him and laugh until my cheeks hurt (and I don't smoke pot). It wasn't a role far from who he is, and I don't really think Pete could ever be a great character actor, that wasn't the intent. So if you're looking for a Forrest Gump kind of transformations from his persona don't bother. Nonetheless his portrayal of him-playing-himself with a different name was an excellent casting."}, {"id": 277, "text": "You know, I liked this movie more than I ever would have thought. I've disliked nearly everything Pete Davidson has done on Saturday Night Live, seeing him as, at best, a one-note stand-up jammed into a show where the best he can do is look sleepy and break in nearly every sketch.Yet this movie, a semi-autobiography as Davidson's father was also a firefighter who died on 9/11, was moving and well-done.It's not without its problems. Like every Judd Apatow movie, there's no reason for it to be two hours and sixteen minutes. The guy has no idea how to end a movie on time.Marisa Tomei again shows why she really did deserve that Oscar and wow, Bill Burr was a revelation. The guy is so natural and perfect here, as is Bel Powley as Davidson's love interest.Pamela Adlon, who plays Burr's ex-wife, is actually the voice of Bobby Hill on King of the Hill, which is a shock. And Steve Buscemi, who was a firefighter while beginning his acting career, is great as usual.I was expecting a self-indulgent mess and got a thoughtful film. I promise not to judge Davidson so harshly in the future."}, {"id": 278, "text": "The good thing about Judd Apatow's movies is that you always get warm cosy optimism at the end. It was rather long but the growth of the protagonist Scott took time to develop throughout the movie. Definitely worth watching."}, {"id": 279, "text": "Great casting and acting, story was okay but the pacing was really slow. Bel Powley, Pete Davidsson and Bill Burr were all great in their roles and after watching I felt like warm inside wich is probably thr gayest way of saying it."}, {"id": 280, "text": "I love it. I laughed throughout the movie. The actors and actresses acts really well. The plot seems simple, but actually (for me) it was really deep. It is kinda like coming-of-age movie. I get attached to all the characters, and it is really nice to see them growing and developing to be the better version of themself."}, {"id": 281, "text": "I was skeptical at first, but started to get into it again the first 15 or 20 minutes.Excellent performances by Pete Davidson, Marissa Tomei and surprisingly, Bill Barr.Another Apatow win."}, {"id": 282, "text": "Director &amp; Co-writer Judd Apatow may be The King of Staten Island, but he still needs to learn how to edit. At 2 hours 16 min this movie tends to drag on for about 30 minutes too long. We all need a good laugh in 2020 and this movie delivers in spades, if you like black comedy. Luckily I do and can't enough of this smart, dry wit also co-written by the films star Pete Davidson. He carries this semi auto biographical movie brilliantly. Playing Scott the son of a fire fighter who died on the job, just like his real life dad did in 9/11. He's an aspiring tattoo artist with big dreams of opening a themed Restaurant/Tattoo Parlour. The guy knows what he's doing he's googled it and no ones done it before...for good reason. It's comedy with heart, but not in a sickly sweet way. Watch out for: Steve Buscemi, Bill Burr and Marisa Tomei 3.5/5*"}, {"id": 283, "text": "Among the engaging writing itself, there's a lot of heartfelt moments here during the meticulously amusing dry humour. I will say it does take quite a while until you believe that the protagonist truly learns something during this film, but when those scenes finally arrive, it is thankfully not disappointing in the slightest."}, {"id": 284, "text": "I am already a big fan of David but this was too good. A drama with a great sense of humor but still bot a comedy in its classic definition. You feel like you're watching a real life story. I absolutely loved it."}, {"id": 285, "text": "Funny in parts - rambling and lost in others. The film had potential that it didn't quite reach. A bit long for no apparent reason. Some of it didn't make much sense and the ending was a bit baffling. Worth watching but don't pay the pre-release rental fee."}, {"id": 286, "text": "This movie is worth seeing, a brilliant film that is funny and has a big heart. Directed by Judd Apatow and starring SNL Pete Davidson, Marisa Tomei, Bill Burr, Bel Powley and Steve Buscemi. Fantastic ensemble cast where every actor gets to shine. I think Pete Davidson will surprise many people who may or may not be aware of this talented SNL cast member and stand-up comic. This movie deserves to be seen and is worthy of your time."}, {"id": 287, "text": "Down to earth coming-of-age with some legitimately funny jokes. Felt a little long."}, {"id": 288, "text": "Pete Davidson is fresh take at a modern loafer. A Rip Van Winkle who smokes pot, or The Dude in his earlier years. The sort of a day in the life aspect of the movie compliments the loafer arc superbly. I felt a message saying that although a person, who like Pete's character, may not really do much, life will still move you. Things will happen whether you like it or not, and you'll have to react. Sitting around getting high in your parents only works out until you're kicked out, and then what?Haven't really read any reviews for it (as I typically never do), so I'd love to hear if anyone agrees or disagrees with my claim.Otherwise, generally solid film. Felt realistic and genuine."}, {"id": 289, "text": "Beautiful film that is so significant to Pete, that it is very hard not to read it as a full biography. Surprising, tear-jerking, and fun -- the only thing missing from this film is more people of colour... (Why is this still a thing, in 2020???).Fantastic performance from Pete."}, {"id": 290, "text": "Movie has a rough beginning and appears to be very shallow and hard to watch at times. But if you stick it through the end you will see how deep it actually is. I felt emotions I didn't expect to feel and definitely recommend it."}, {"id": 291, "text": "Davidson and Apatow deliver a hilarious and poignant film about family and the 'journey to self-discovery' theme that shouldn't work on paper, but it does. The chemistry between the cast is movie magic. Marisa Tomei and Bel Powley absolutely shine in their respective roles. Steve Buscemi kills it in his small but critical part, which hits all the right notes. It has restored my faith in Apatow to direct a comedy with a beating heart. Bravo."}, {"id": 292, "text": "I love it! Obviously emotional performance is very casual, but unexpectedly moved, there are comedy points, just good poke me, frequently smile even laugh, too cute movie. Like Scott's tattoo, like his stupid, his stupid, life is like this, always confused, but there is always a way of their own, how about walking slowly? The screen is always sunny, the color is also very vibrant, the music is very young, the dialogue design is very noisy but very cute, I really like this movie!"}, {"id": 293, "text": "I am not a fan of Pete Davidson. I did not want to watch this movie, but my wife did. I was shockingly pleasantly surprised by the storyline and all of the actors. The only thing I didn't like is that it occasionally stirred up my allergies..."}, {"id": 294, "text": "Very funny. I really liked Pete Davidson in this film. Its a good time if you wont take everything he says to heart."}, {"id": 295, "text": "Pete Davidson playing as himself, mostly. It's a charming, funny and touching movie. If you see the work of the director you would easily understand were it comes all this smooth and funny scenes, which has been working for a lot of time. It's definitly a movie worth to watch, for a summerday with your friends or family."}, {"id": 296, "text": "Pete Davidson stars in this semi-autobiographical story of a young man dealing with his fathers' death in this coming of age dramedy. After a few misfires recently, Apatow comes back strong with this movie; he surprisingly generate quite a lot of heart from Davidson, who definitely appears more comfortable in the jokester role. All-in-all this was a very enjoyable film."}, {"id": 297, "text": "It is a light movie based on true story which you can relate on, the comedy, the character, the plot, it is very solid and good. Despite of comedy genre movie, there are so many quotation or wise word that we can get from this movie. We can watch it as night movie after a long day of working, and still can laugh, cry, and inspire at the same time.."}, {"id": 298, "text": "Pretty good. I hope they make a sequel. okay test test test"}, {"id": 299, "text": "The King of Staten Island is a beautiful and full of life. Pete Davidson is surprisingly good actor in this heart warming piece that will make you eyes water. This movie starts slow so be patient. Let it get up to YOU."}, {"id": 300, "text": "I can't (couldn't) stand Pete Davidson. I saw him in a few skits on snl &amp; then his tabloid stuff &amp; labeled him a social media mumble rapper type.. i was wrong. I came for Bill Burr &amp; left absolutely loving this movie. I'm now a fan of Pete &amp; his comedy style really makes sense after watching this. This is a wonderful movie &amp; i loved all the actors in it... &amp; Ol Billy Freckles is still crushing it!"}, {"id": 301, "text": "Judd Apatow does it again. Impressive cast, soundtrack and dialogue."}, {"id": 302, "text": "A perfect mix of comedy and heartfelt drama. Brilliant cast with fantastic performances all around, not to mention the brilliant writing and incredible screenplay. Definitely a must watch this year."}, {"id": 303, "text": "Turned out to be totally not bad. Hope the feeling was not a result of seeing a ruined life get back on track."}, {"id": 304, "text": "Far too long, and meanders away from the plot - an excellent story which should have been more closely adhered to - but overall goodhearted and entertaining. Bill Burr shows what a capable actor he is developing into and Marisa Tomei is, as ever, beautiful and affecting."}, {"id": 305, "text": "I didn't have high hopes for this movie, but it pleasantly surprised me as the title suggests. There was good and there was bad as with any other movie. So let's start with the good. The characters were excellent and well casted. Pete Davidson and his posse were great. The best part about Pete Davidson's character was his character arc. Bill Burr did an excellent job despite not being the comic relief and his character src is very well done. The story was good as well. It was funny at times yet dramatic and heartwarming at other times. And the film had a good message. But with any film there is the bad. Luckily the list of things that are bad about this film aren't too long. You could tell the budget was slim considering the lack of depth when it came to the sets and a large number of B list actors. This didn't make the film suffer too much, but those better actors would've been better in those dramatic situations. All in all it was a good film. I enjoyed it and I am not a Pete Davidson fan. It is worth a watch it is funny yet heart warming at the same time."}, {"id": 306, "text": "The cast acting was wonderful. I just feel the ending could of had more to it but I guess you just hope the main character becomes accomplished."}, {"id": 307, "text": "I have followed Judd and Pete's careers pretty closely so naturally I was exited to see this movie. I wanted to see it in theaters but renting it for 20 dollars in my living room was my only option for now.Pete has proved himself to be a funny guy and a competent actor, and even though he's playing a similar character to his role in Big Time Adolescence, this is a big step forward in his career.I think this movie will probably receive criticism for not being as funny as some of Judd Appatows other movies, but I don't think this movie was aiming for a the same thing as Superbad and The 40 year old virgin. Judd often talks about how the key to making a good comedy is to make a good drama and add humor to it, this is the perfect example.Pete's story is intriguing and feels completely worthy of a movie like this. Some people wanting a non stop laugh fest maybe not like it, and it does have flaws, but I really enjoyed it.This is probably Judds best movie in 10 years. And I highly recommend giving it a watch."}, {"id": 308, "text": "It is a fine day for something funny, relatable and wholesome &amp; The King of Staten Island delivers a rather enjoyable package in that department. Judd Apatow's most famous include The 40-Year-Old Virgin (which I loved) and Knocked Up, and the last before last, whole 5 years ago, was Trainwreck, which I happened to catch on the big screen, it was okay but not a fan... This time around Apatow directs a story co-written with its standout star Pete Davidson, dedicated to his dad Scott Davidson, and quite heavily inspired by Pete's own life. Though not without its flaws, I can tell You The King of Staten Island is easily my favorite Judd Apatow piece since 2005.To most probably known as a member of SNL, now rising comic, actor and cool dude Pete Davidson is portraying Scott, a 24 year old who has been a case of ADD ever since his firefighter dad died when he was seven. Jobless and living with mom, Scott spends his days smoking bud, hanging out with friends and dreaming of being a tattoo artist. When some new characters enter his life, he is forced to grapple grief, trauma and take his first steps towards redemption. In real life, Pete Davidson's father was a firefighter who died in the line of duty, rescuing victims of the 9/11 attack. Cast member Steve Buscemi used to be a firefighter in the wake of the 80's, and returned to help on the day of the same tragedy.The King of Staten Island is mainly a story about growing up, finding the good things, learning to accept those good things, and taking responsibility over one's life. There's genuine sentiment in its heart, which rests in just the right place, and it can also be legitimately funny. It's not structurally perfect, and can feel a little too scenic, focusing on the quality of separate sequences that do not add a lot of story. The big turning point starts manifesting itself as late as 100 minutes into the movie, and in the end the 2 hour and 17 minute runtime is a little too tall. Having said that, it is a dramedy that's never boring, always pleasantly amusing. This kind of plot, I believe, is pretty predictable by default, so enjoy the substitute, the always-present-low-key-charm. As a 23 year currently stuck in my hometown and great friends with Mary Jane, I felt like an appropriate audience member for The King of Staten Island, and that's what I meant with relatable and wholesome. Some might say that a big part of this movie isn't about a whole lot of anything, but I beg to differ, perhaps the idyllic view on such simplicities tells a lot.I think it's apparent Pete Davidson is a pivotal part of why the movie works so well. In what might very likely be his best performance to date, he plays a likeable, decent guy with a good heart and some troubles in it, plays him so authentically one could guess some of it comes from a place of past pain. But that's not it, the supporting cast delivers well above average performances as well - do not miss the chance to see Bill Burr in a bigger role and rocking an impressive moustache, and the female counterparts for both - Bel Powley and Marisa Tomei, anchor the balance perfectly.Judd Apatow is arguably one of Hollywood Heavyweights, making a film with a cast that don't fall back all that much, so the level of these ingredients resemble themselves also in every technical and aesthetical department. It's visually very well orchestrated, subtle and perfect in its simplicity, never once anything distracting catches the eye. Soundtrack has a couple of real nice tunes in it, of which one dear-to-my-heart nostalgia song ended the film, but I won't spoil it.Even now I wonder why not more, because I really, really dug it, but I believe that it deserves a good, flavorful, perhaps even memorable 7/10. I recommend it, well, just about everyone who's not too young for it, even one point of intrigue is enough."}, {"id": 309, "text": "Not really a fan of Pete Davidson prior to this film and frankly still not a fan of him after it, but I respect his transformation in this movie. If you don't know (which at this point, I'm not sure how you couldn't) Pete's real dad was FDNY and died on 9/11. Whether or not he was able to use this to catapult his comedic career is something I don't know, but I never found him particularly funny. When he first got to SNL I thought he was going to be the next Andy Samberg, but his appearances seemed to fizzle and he was often relegated to doing pre-recorded bits on the show. It made me a little sad because I think his potential was and is wasted at SNL but perhaps it's one of those situations where they can't really fire him due to FDNY connections. I know it sounds kinda conspiracy theory-ish but those are my personal thoughts.Now back to this film. I absolutely hated the first 30-45 minutes and was regretting my decision to watch the film, but I eventually finished it and I actually thought it was a decent story about personal transformation, something I definitely could relate to. Seeing the cherry picked reviews about how it was so funny and Apatow's best film are now confusing as it is neither hilarious or Apatow's best, but still very good. If you're like me and think the first half of the movie is awful, just hang in there and finish it. Everything comes together at the end so the beginning of the movie doesn't seem as awful as it is."}, {"id": 310, "text": "Don't let the fake, 1-week old accounts rating this 9's and 10's fool you, this is a stinker. File this under movies that didn't need to be made. The King of Staten Island is slow, uneventful, but even worse it is a waste of a solid core cast of veterans. Unfortunately, casting Davidson, in what appears to be some sort of ill-advised vanity project, as the lead doomed this movie from the start. How Davidson landed a role on SNL is baffling enough, but how Apatow then thought he was fit to star on the big screen can only be explained away as Apatow owing Lorne Michael a big favor for some past transaction.The rest of the cast didn't fair much better, with the fiery (no pun intended) firefighter played by Bill Burr being the exception. Tomei, who is usually a guaranteed casting choice if for nothing else than the stability her experience provides, also falls flat. Perhaps that's due to the weak writing of which Davidson also took part, or perhaps the film just sucked the life out of her like it sucked the life out of me while watching it. Finally, the pacing of the movie was sluggish, if not at a crawl at times, and the 2+ hour runtime starts to feel more like 4 hours. It's quite clear that a lot of reviewers (the real ones, not the brand new ones created solely to boost the film's rating) are trying their best to justify the fact that they spent $20 to watch this on their couch... That justification will likely never come for them, but it doesn't have to come for you.Skip this stinker. 4.3/10"}, {"id": 311, "text": "Expecting more of a crass story, with an rough and unlikable character - happily I was wrong!The movie isn't a laugh a minute but instead has a very realistic flow that one could find if you had a temporary look into someone's life. Sometimes there are funny, light, silly moments but there are also sad, frustrating and regrettable ones too. Such is life. They balanced it beautifully.My biggest worry was that the main character (Scott played by Pete Davidson) would be wildly unlikable as that is often the case with these types of films. To sit through 2 hours of a movie you have to enjoy the character enough to root for them. Luckily that is the case. Scott is played as a thoughtful, sensitive, funny guy who truly wants to do the right thing. When he does screw up it's not to an extent where you dislike him. Few actors know how to show that balance in a movie like this. They often oversell their ugly moments so well that the redeeming or sweet ones don't make up for it. Pete does a perfect job at presenting a likable guy who is just a bit lost, in doing so is endearing and relatable. By the end of the movie he felt like a friend, someone you can't help but cheer on.The whole cast was perfectly placed, authentic and enjoyable.I thought the length would be complete overkill as is so often the case with movies today. However I can happily admit, I didn't notice the time. It flowed well, didn't linger on one thing too long and felt light.A surprisingly sweet movie that is more heart than 'har har'. I'll remember this one."}, {"id": 312, "text": "Everyone knows director Judd Apatow for his movies The 40-Year-Old Virgin and Knocked Up (rightfully so), but I've always appreciated some of his other outings as well, like Funny People, Trainwreck, and for creating the Netflix series Love. This may seem like a big statement and I've only just watched his newest film The King of Staten Island, but I believe it may be my favourite film of his. Full of sharp comedy, raw emotions, and packing a strong punch of reality, I was sucked in from start to finish. With such a touchy subject that may even offend some viewers, this movie chooses a slightly comedic take on loss and I thought that made the film even better. Here's why I highly, highly recommend The King of Staten Island.Beginning with the fact that Scott (Pete Davidson) has not gotten over the death of his father, he sits around all day, doing nothing except smoke weed and hang out with friends. With his sister off to college and his mom beginning to date someone he doesn't approve of, his hardships become even deeper. Slowly learning ways to cope and move on, he discovers things about himself that were hidden. This film hit me really hard. Not because I related to him in any way, but the fact that Pete Davidson also had a hand in the screenplay, spoke volumes.In real life, Pete Davidson lost his father in the fires of 9/11. While names, scenarios, and overall lifestyle of Scott in the film was changed to fit a feature film, every line of the dialogue felt like it came from the heart. I could feel the inner pain very present throughout the entire duration and his central performance brought me to tears by the end. The way he handles his grief and bottles it up, trying to make everything into a joke, felt very authentic. I've only ever seen his appearances on Saturday Night Live, but if he's able to channel emotions and comedic chops in other projects like this, I can't wait to see more of him.Now, this may be slightly biased, but I'm a huge fan of movies that are done well, with hardly any score. The characters are what make this movie what it is and the lengthy 136-minute run time flew by for me. From the terrific direction by Judd Apatow, to the supporting cast like Marisa Tomei and Bill Burr holding up the raw, central performance by Davidson, I just found myself engulfed in the emotion of it all. Yes, I laughed on multiple occasions as well, as this really is a comedy at its core, but it's so much more than that. While not a lot happens other than the arc that Scott goes through, The King of Staten Island had a lot to say.In the end, looking back on the film as a whole, I don't really have anything that I would say took me out of my experience. The care taken to the subtlety of the camerawork by Robert Elswit was also a nice addition. His work in the past has won many awards though, so that shouldn't come as a surprise. This may seem like a review of something gushing about all the best elements of a movie and not even choosing to touch on a negative, but that's because any minor issues I may have had aren't even worth it. I loved every second of this character study and not only do I believe it's Apatow's best and not authentic film to date, but it's also my favourite film of 2020 so far. I haven't been this positive about a film in 2020 yet, so I believe a round of applause for the entire cast and crew on this one is in order. I can't recommend this one enough."}, {"id": 313, "text": "It has been five years since Judd Apatow directed a film, with 2015's Trainwreck, and eight years since he had written and directed a film, with 2012's This is 40. Apatow has a great return to form here as the jokes hit for the most part in an overstretched 137 minute runtime. This is more or less customary in any Apatow film made in the past 15 years. This time, he collaborated with the up and coming talent of Pete Davidson who is most notably famous for his stint on SNL for the past five years. Pete Davidson is fresh off of the success of Big Time Adolescence, a Hulu film that showed he has tremendous talent, even if his performances feel very one-aided. There are excellent performances all throughout the film with Marisa Tomei, Bill Burr, Steve Buscemi, Maude Apatow, and Bel Powley. The semi-autobiographical story is a strong, genuine, and heartfelt film that shows the struggle and grief that a young adolescent can carry when they lose a parent. This is echoed brilliantly in Maude Apatow's performance who never met her father and was young enough to not be broken by the accident. This is a strong film and something that I would recommend as being worth the $20 to rent."}, {"id": 314, "text": "This was confusing. Performances are solid all around, there's nice, subtle character growth and I actually found myself enjoying a Davidson performance, which I never thought would happen.By all accounts, this should be better than the pretty middling affair it is.It's reported at 137 minutes but I would've swore it was 6 hours. I think that's the biggest problem, the people behind the camera lacked discipline. This thing is a bloated, meandering and overindulgent snooze ride that doesn't really go anywhere. Everyone's solid in front of the camera, so I don't necessarily mind seeing them but around 2/3 of the way through I just wanted it to be done.There's no big revelations, no climactic moments, no grand finale. Stuff just keeps happening until it stops. It'sa nice exploration of a man's life and it shows his journey, it just doesn't make for overly compelling narrative as it's presented.I feel like I want to recommend it, but at the same time I can't blame anyone for not wanting to bother. You won't miss anything if you skip it, can't say you'll gain much if you watch it, which I suppose is the issue. It feels like something should be here and it's just not. No rousing applause, no impassioned jeers, just an indifferent shrug as the credits roll."}, {"id": 315, "text": "Pros: 1. The humour, when it lands, produces some genuinely funny moments. 2. Both Bill Burr (Ray Bishop) and Pete Davidson (Scott Carlin) have fantastic chemistry together. 3. The score and soundtrack, even though it's nothing spectacular, provides a fun and lively feel. 4. The last 30 minutes become really enjoyable as Scott Carlin finally sees some character progression for the better, as well as concluding with a suitably uplifting tone.Cons: 1. Pete Davidson's performance is inconsistent, as at times it feels like he's forcing the intimate emotions. He's better when acting jovially, or nonchalantly. 2. Some of the comedy feels pointlessly inserted for cheap laughs, which mostly fails anyway. 3. The cinematography is incredibly flat and stale. 4. The plot device which sets up the third act is conveniently and idiotically placed, wherein Ray Bishop and Margie Carlin (Marisa Tomei) openly disparage Scott Carlin in front of him. 5. The relationship between Scott Carlin and Kelsey (Bel Powley) is boring, poorly developed, and takes up far too much screen-time. 6. The cameo of Machine Gun Kelly (Tattoo Shop Owner) is massively distracting because the entire scene is pointless, and thus it only revolves around shoving him into the film. 7. The character of Scott Carlin is unlikable and uninteresting as he is irresponsible, lazy, and pig-headed for the majority of the movie (1 hour and 40 minutes), and only sees some character progression in the last 30 minutes."}, {"id": 316, "text": "Judd Apatow has a new film out called The King of Staten Island where he collaborated and wrote it along with SNL's Pete Davidson. It's based on Pete Davidson's real life where he lost his father during the terrorist attacks on 9/11 when he was just seven-years-old.Scott (Pete Davidson) is still living at home in his mid-20s. He doesn't have anything lined up in his life, even though his dream is to be a tattoo artist. He just hangs out with his friends and drinks and smoke weed. He has a hidden relationship with one of them, Kelsey (The Diary of a Teenage Girl's Bel Powley), that is his childhood friend. When she tries to take it to the next level, he can't handle it and gets anxiety knowing that he has to acknowledge it.This film was well cast making all the characters believable. Apatow is trying to capture something raw and poignant with comedy around it, but it doesn't quite get there, which it should with a runtime of 137 minutes. Pete Davidson's acting is fine, but the film starts out with him driving down a freeway with his eyes closed obviously having suicidal tendencies, but you never see him crying or having a breaking point about his father. That would have given the film grit and substance. It's probably exactly how he has been about the situation his whole life, but since he is playing a fictional character, maybe if it had something more moving, it would be the endearing film that I think Apatow truly wanted to capture. What's wrong with making a drama about depression with some comic relief here and there? But it's quite the opposite and they kept it light. It almost felt like it is an extension of Big Time Adolescence, which Davidson did last year which had more of an emotional tone. Bel Powley added to the humor and was one of the most interesting characters. And Tomei perfectly played opposite of Davidson. - Ken The Critic, CBS Austin"}, {"id": 317, "text": "I was looking forward to this release knowing it was a Judd Apatow pic. We need some laughs and levity in this time. I sat through the first third or so waiting for the funny that never came. The movie had a few chuckles but soon descended into unremitting self pity as the lead character whined and moaned about how hard his life was even though he did absolutely nothing to stop the downfall. His problems were everyone else's to solve. This situation could have been good fodder for humor, but the jokes never came.When Bill Burr appeared I thought 'alright! here we go!' but his talents as a comedian were never utilized and anyone could have played his character.The acting is good, but story lines like the best friends that seemed to be so important to the main character in the beginning are just dropped. Did this a-hole just let his best pals rot and the one friend's cat die? Why put that into the movie if you don't ever mention it again?I found the main character to be a disgusting waste of time through most of the film but in the end was glad just to see him put some effort into something...anything! Of course he had to be practically forced into it.I guess the message is that everyone around you needs to pull you up so that you can have a fruitful life. Not a message I want to see rewarded. We all have troubles - life's hard - but the only way out is to work through it. I don't know why Judd Apatow thought it worth boring and annoying his audience with this guy. Even his family had had enough of him when we meet him.The acting is great from supporting characters, and especially the firehouse guys and Marisa Tormei, but in particular, Bel Powley who is a real bright spark in a fairly bleak movie. Although God knows why she loves this guy.Give this a miss if you think you are getting a comedy, or even a tragicomic film. If you want to see an entire community pull together to help a guy who can't be bothered to put in a modicum of effort into his own life while he pulls the energy out of everyone around him, this is a film for you!"}, {"id": 318, "text": "Some people will describe this basically as a what could have been narrative about Pete Davidson's life if he ended up as an adult stoner with no purpose in life and still living at home. I felt it was also a bit more than that though. I think the semi-biographical approach to the movie was a good call. It definitely has some laugh out loud moments. It can also be dramatic and touching at times. There's also a bit of coming-of-age thrown in there as well.As for the acting, despite what people say about Pete Davidson and his comedy, I actually thought his acting was pretty spot on in this. The lovely Marisa Tomei is excellent as usual and Bill Burr brings quite a few laughs to the table, as well as Steve Buscemi in a small role with one in particular impactful scene that Steve nails.It's definitely far from a perfect movie. The editing could have been done better, some plot holes, and probably 30 minutes too long. On the other hand, it didn't seem to strike a false cord one single time. All of the characters seemed real to life and the actions they took weren't far-fetched or overly dramatic which is a relief to see.Overall, if you enjoy Pete's dark sense of humor combined with Bill Burr's comedy along with a solid supporting cast in addition to a movie that pays tribute to those who gave and still give their lives to save others everyday, then I'd say you'll have a positive and enjoyable experience with this one."}, {"id": 319, "text": "Well, I don't know how to start this, or even from where to start it... But here it is. I've watched Pete from his first appearance on SNL... As an actress, my first thought was - Wow, finally there's some new fresh blood in the house. As the years passed by, I've watched all the stuff he kept pushing himself to and the responses afterwards. And I must say, that I am impressed by this gorgeous young man. I was anorexic for many years, so I know how hard it is to live with the depression and anxiety, and all the stages of the healing process. Your strength of standing out, and bringing your story the most human way possible, made me really appreciate the movie. And Pete, I am sorry of what happened to you, but you must know that you're doing a great job! Don't ever dare to stop!Hope this message would reach you somehow.All the hugs for you! Fa"}, {"id": 320, "text": "The King of Staten Island has been the first movie in months that I've truly been excited to watch. The trailer was spectacular. So spectacular, I didn't blink an eye at the outrageously high $20 it cost to rent the movie.I'm a huge Pete Davidson fan, and before viewing the movie, I was inspired by the fact that this fictional movie closely resembled the actual story of Pete Davidson himself. The finished result did a great job taking what was almost an autobiography of Davidson himself, injecting strategic inclusion of metaphoric, encrypted details that put the viewer in the shoes Davidson wears in real life.I believe the intentions and vision of the movie was to take the comedic genre to a new level, being the first dramatic comedy that revolves around an actor that wasn't truly acting. This movie was Pete Davidson, and his performance was his true self.However, I was left disappointed with the end result. The comedy aspect was spot on; I rarely invest time in a comedy that makes me laugh out loud, and this movie left me laughing the whole way through.I felt as if the original vision was robbed of the end result. The movie felt very dry all the way throughout, and the emotional journey I had been convinced I would endeavor was truly disappointing. The complexity of the movies inspiration lacked appearance.I don't regret the time I invested of over 2 hours watching this movie, but I'm ultimately disappointed with the fact that I was prepared to watch a story that would truly move me, and was left feeling as if I just watched another average movie.I'd recommend the watch, but don't expect to be moved the way the trailer and the involvement of Pete Davidson's true story to provide the experience that it had the potential to provide."}, {"id": 321, "text": "The King Of Staten Island is seriously funny, moving and compelling. A hat trick that only the great Judd Apatow can pull off, alongside the help of Pete Davidson. . In this comedy-drama based on Pete Davidson's life, a young man must get his life together after his mom starts dating a new man; a firefighter like his deceased father. . I without a doubt loved this film. Those of you who know me know that I'm a huge fan of Apatow's, and The King Of Staten Island is a great addition to his filmography. Apatow is one of the only comedic directors that can really capture the humanity in comedy. He's able to make you laugh when necessary and make you feel something deeper at other instances. The star of this film is of course Pete Davidson. He bares his soul in this semi-autobiographical role, and he is so great. As the viewer, there is no way you won't fall in love with his character. Marisa Tomei and Bill Burr are surprisingly a perfect match, and their chemistry plays well off each other. Overall it's another win for Judd Apatow and true home run for Pete Davidson. One of the best films you'll see this year. . Follow @snobmedia for more reviews!"}, {"id": 322, "text": "This movie was very relatable for me. Not the exact same circumstances or even similar circumstances, but I've struggled with depression and other mental health afflictions for some time now. Pete Davidson's portrayal of those afflictions was extremely relatable for me and I can assume many others.I know Pete is very outspoken about his mental health and his story and I commend him for that. That takes courage. He did incredible in this role I think because he lived it and continues to live aspects of it on a daily basis.The rest of the cast was outstanding and made for wonderful support. Big shoutouts to Bill Burr and Marisa Tomei and the cast that plays Scott's friends.My only complaint about this movie is that it wasn't longer. I loved these characters all so much that I wanted at least another 30-60 minutes with them.I know some will be hesitant to rent this with the $20 price tag for the VOD premiere, but I can assure you it is worth it."}, {"id": 323, "text": "This movie has some great actors and acting in it, but Pete Davidson is not one of them. You can tell he isn't trained as an actor. He has some parts that are believable, but mostly it's mediocre acting from him.The movie was about 1 hour longer than it needed to be. It's extremely slow and dry to the level where I almost turned it off about an hour into it.The writing was terrible through the majority of it besides where I could tell Bill Burr gave himself some good jokes.Judd throws some of his family and Pete Davidson's friends into it so they make some money; and while their acting wasn't bad, most of their parts and scenes with them were unnecessary like this entire movie.I thought it was going to be about a drug dealer's rise in Staten Island or something more interesting like that, but it turns out to be Pete Davidson's life story which I felt was boring and didn't need to be told.There might be some kids who have never heard some of these jokes before that find them funny or relate to a main character with so many problems (ADHD, depression, etc), but most of the character's problems are due to himself just like many of the kids who relate. Using a depressant when you're already depressed isn't going to make your life any better. It'll lead to you sitting around on your couch watching cartoons or movies like this. I suggest you watch the cartoons instead since they're funnier and more entertaining.Cue Pursuit of Happiness at the end and roll credits. This movie fits into the stereotype of a Judd Apatow movie, but not in a good way. More of a cheesy, drawn out, I could have guessed that ending type of way."}, {"id": 324, "text": "I'm not sure why it wasn't good. I have some theories though.1. Bell Powley - she should never be allowed to do any American accent ever again. This is so forced and distracting, and quite frankly sucks. If I had to pinpoint the single worst part of this movie, it would be her accent.2. Maude Apatow - They make a joke about Nepotism in the movie, about it being a disease. Well they clearly lack any sort of self awareness, because this girl is not a good actress. Honestly, someone needs to tell her that she's just not good.3. Other than that the writing and plot construction was abysmal. And they did not effectively utilize the acting skills of Marissa Tomei.4. Bill Burr and Buscemi were pretty good, I enjoy them a lot. I also think that Pete Davidson was like able in this role.In summary this movie could have been a 6 or 7 if its flaws were removed. Under different circumstances such as using the same director and writing staff as Big Time Adolescence, this movie had the potential to be great. I still like Pete Davidson but I have to be honest here."}, {"id": 325, "text": "The King of Staten Island has Judd Apatow written all over it-witty, warm, affectionate, and wildly eccentric. Scott (Pete Davidson: full bore confessional humor straight from SNL) is a 24-year old arrested-development slacker with a smart mouth, charming smile, and dreams of opening a tattoo restaurant called Ruby Tattuesday's.He lives with his youthful mom, Margie (Marisa Tomei, a go-to Oscar-winning actress for this kind of role). For her he's a blessing and a curse.Although nothing that happens to Scott is ordinary, Apatow makes it Seinfeld believable-nothing into something. While Scott rebels against just about everything, he displays a big heart (see him walk the kids to school) and rapidly fires off some humorous lines.Smoking weed in his basement with stoner buddies (Ricky Velez and Moises Arias are especially funny) is typical low-brow Apatow humor. They may be lines not as memorable as in Knocked Up but still warmly funny. Because Davidson co-wrote the script, it has a real-life energy and melancholic tone influenced by the death of his fireman dad.The plot energizes with the arrival of his mom's new boyfriend, Ray (Bill Burr), who is as mouthy and loving as Scott and reminiscent of Scott's deceased dad. That Davidson's real-life FDNY dad gave his life in a 9/11 rescue only adds to the authentic feel for an almost self-parody. The arc of Scott and Ray's relationship can be seen long before the denouement, resisting formula through the talents of the actors to make the characters fresh and likeable.Because many of those around Scott are, like him, out of alignment with where other white guys are fast heading, Apatow captures a sweet longing for the characters to belong even if their humor is better when they are outlaws. In a pandemic when the audience's developments are arrested, it's nice to view The King of Staten Island as everyone's story as well, only with more laughs.On Prime"}, {"id": 326, "text": "If you enjoy reading my Spoiler-Free reviews, please follow my blog :)Judd Apatow has directed/produced some hilarious pieces of cinema: Trainwreck, Bridesmaids, Superbad, Knocked Up, The 40 Year Old Virgin... He's got quite the filmography, there's no way of denying it. Therefore, his name alone is enough to grab my attention when a comedy co-written and directed by him comes along. Add Pete Davidson as a co-writer and the main star, plus a really fascinating cast with Marisa Tomei and Bill Burr, and I'm definitely interested. The King of Staten Island holds a formulaic premise (the whole dead parent entails a bad kid who needs to learn how to be a better person has been done to exhaustion), but is it able to elevate it in some way?First of all, the dark humor really works for me. For anyone who doesn't appreciate this type of comedy, Apatow's film might be too excessive. Tons of unrestrained jokes about the most sensitive subjects, and characters with no limits to where they can go with their wicked sense of humor. So, if you're not a fan of dark comedy, this movie might turn out to be a very unpleasant experience. However, if you have no issues with laughing at a bad joke, this comedy might just work well enough for you to have a good time. I had really good laughs.Scott takes the bad kid who does bad stuff to a quite terrible (and sometimes illegal) level. He possesses all kinds of psychological issues that you can think of plus some more. He says the most depressing, sad, offensive things to anyone that crosses his path. Pete Davidson absolutely shines in this role, it really feels like he's having an outstanding amount of fun. However, his character goes through such an overlong and exaggerated route that I could neither relate to nor feel sorry for him. This will make or break the film for any viewer: your emotional connection with the protagonist.As I said in the beginning, the narrative follows a pretty cliche story that people have seen thousands of times. So, from the get-go, it's fairly easy to understand where the movie is going, what's going to change within the characters, and how it's going to end. Screenplay surprises don't come often in this genre, and even when they do, very rarely, they're able to impact the audience in a way that completely changes our perspective on the film or its characters. The King of Staten Island is a movie that tells its viewers everything they need to know in the first ten to fifteen minutes, and then there's nothing remotely new throughout.It's just way too long. A bit over two hours seeing someone trying to figure out what he's going to do with his life is not exactly the best entertainment ever. There's more than one way to try to relate to Pete Davidson's character, but I really needed to dig deep to find one. As people probably know, Davidson's father was also a firefighter who died in the 9/11 attacks, and this film clearly takes inspiration from Davidson's life. It's not his biography, but he definitely puts a lot of his own personal issues into Scott's personality. Some people even state that he's just portraying himself, and that's not that far from the truth.In my opinion, the best aspect of the movie is undoubtedly the incredibly realistic dialogues. It genuinely feels like the characters are having real conversations. The editing is so impeccable that I forgot I was watching a film for a couple of moments. The chemistry between every member of the cast is so vibrant that every single dialogue between any two characters always feels extremely lifelike. Marisa Tomei and Bill Burr are astonishing, they truly are. I wish more time was given to develop a bit more of Bel Powley's personal subplot, but I understand that she's far from being one of the most relevant characters.In the end, The King of Staten Island employs a very well-known (and a bit overused) formula that goes on for way too long, but Judd Apatow balances it with a hilariously dark sense of humor, with the help of his co-writers, Pete Davidson and Dave Sirus. Most of the comedy really works, which helped to get through the least entertaining (and predictable) portions of the narrative. Davidson shines in a role that many addressed as he's just playing himself, but I find him incredibly engaging and captivating to watch, even though I can't quite relate to his character. The emotional attachment to the protagonist is the major component that's either going to make you love this flick or spend a couple of hours just watching someone trying to figure out what to do with his life. The realistic dialogues (elevated by perfect editing) and the cast's phenomenal chemistry just tip the scale to the positive side. I definitely recommend it, but with the small warning that if you're not a fan of dark comedy, then it's better to skip this one.Rating: B-"}, {"id": 327, "text": "Knock-knock! Who's there? Not your dad!The first act of the movie honestly was a real slog to get through. I doubted whether I should bother to finish the film especially considering the runtime looked intimidating for its tone. It didn't help that it wasn't particularly funny either. Worst still, it wasn't for lack of trying. Most of the jokes just didn't land, which became a worrying trend throughout the movie. However, once the first act was over, I realised there was something more to this movie. The characters started taking center stage. An important transition that allowed the film's more mature moments. It's then that the movie became gripping, soulful in a way and gave it heart. It's where you can really experience King of Staten Island's core, and where some of the comedy started to flow naturally too. Which really leads me to believe the film should've fully committed itself to its character driven narrative right from the get-go and allowed its comedy to come second.Extra Note: The music was pretty hit or miss with me too"}, {"id": 328, "text": "I absolutely love Pete Davidson and Judd Apatow's,  The King Of Staten Island. I honestly didn't know what to expect, but I did find myself laughing out loud throughout the movie. Yes, there's a few poignant moments, but the film never gets too maudlin. I'm sure they did their best not to get too syrupy. Although, this real life meets art presentation must have been great therapy for Pete Davidson. I've always enjoyed him on SNL, but you just can't help but love the guy here. Seriously, this is a wonderful, well-written dramedy. I wouldn't be surprised if Marisa Tomei gets another supporting actress Oscar nomination. She is adorable in this film.. she's perfect as Pete's mom. Pamela Adlon, popping up in a couple of scenes was a nice surprise too! Bill Burr's strong performance is deserving of a special mention too. The movie gives plenty of room for his character to grown on you. In fact, there's of great performances throughout the entire film. Moises Arias is instantly lovable...as is Steve Buscemi. By the way, I honestly thought the tattoo reveal was going to be Harold's enhanced superhero creation. If you're looking for something original to entertain yourself, I'm sure you'll love The King Of Staten Island too."}, {"id": 329, "text": "My Review - The King of Staten Island My Rating 7/10 Once I got the gist and heart of this Comedy Drama and realised it was much more than a coming of age teen rom -com I really enjoyed The King of Staten IslandThe main character Scott Carlin played so well by (Pete Davidson a well known stand up comedian ) lives with his family and friends live Staten Island just a ferry ride to Manhattan . Scott is a troubled adolescent man child who's only motivation is to become a tatoo artist. He lives on the island with his Mother Margi played by the delightful Marisa Tomei in another excellent performance. Scott's Sister Claire leaves home to go to College and Margi gets romantically involved with a homeless Firefighter Ray Bishop(Bill Burr) . Scott who is still feeling and dealing with grief at the loss of his Firefighter Father killed in action while fighting a fire feels abandoned and this leads to more rebellious behaviour. This film is semi autobiographical because Pete Davidson who plays our main character Scott also tragically lost his father Scott Davidson a firefighter who died in the line of duty. The story is based in-part on Pete Davidson's life, depicting what it might have been like if he had not become a comedian. Pete's father Scott Davidson's unit, Ladder Company 118 in Brooklyn Heights, responded to the call to the World Trade Center after the terrorist attacks of September 11, 2001. They were rescuing people in the Marriott World Trade Center Hotel when the tower collapsed on the building. Pete was seven years old. The role of Grandpa is played by Pete Davidson's grandfather, Stephen Davidson. The other link to a FireFighter in this movie I was surprised to read is Actor Steve Buscemi in a supporting role as Papa . Steve Buscemi was a New York City firefighter before becoming an actor. In November 2000, Buscemi told Salon interviewer Stephen Lemons that he was with Engine 55 in Manhattan's Little Italy for four years in the early 1980s. He took acting classes after about a year on the job, and stayed with the FDNY while acting in plays and movies. Buscemi quit firefighting in 1984 to pursue acting full-time. After the terrorist attacks of September 11, 2001, he returned to his old fire station to help search for survivors in the rubble of the World Trade Center. Steve Buscemi has some good scenes in this film as he helps Scott gain more confidence and convinces the other Firefighters that he shows promise and helps him find a community and learn more about his Dad. It's a good script written by Pete Davidson, Judd Apato ,who also directed the film and Dave Sirus and I really enjoyed it."}, {"id": 330, "text": "The King of Staten Island (5 out of 5 stars).The King of Staten Island is a great comedy drama film. The latest Judd Apatow film which carries a strong dramatic script and some humor that is carried by Pete Davidson. To make the movie even better. The story is based on similiar events on Pete Davidsons life. After losing his father from firefighting. He was troubled growing up. Has difficulties learning cause of his ADD. Is trying to be a tattoo artists but after practicing on his friends and family with a tattoo design with terrible facial designs. He lives with his mother and sister. Until his sister grows up and off to college. His mother meets another guy Ray. Who is also a firefighter. Petes character has difficulties accepting his mothers happiness with Ray. While dealing with the life changing event of growing up and trying to find yourself as a person.Great story. Pete Davidsons performance was great. As a amateur and trying to be charming. The cast is great. Marisa Tomei was great playing his mother. The script delivered a powerful drama. About a young guy struggling from loss. And suffering an illness. Judd Apatow direction is great. Relatable drama. Some dark humor. It does have a feel good dramatic ending. Judd Apatow did not disappoint with this comedy drama film."}, {"id": 331, "text": "I understand that this movie isn't for everyone. I feel that the reason for this, unfortunately, is because Hollywood and casual viewers have been brainwashed by decades of how a movie must be formatted. I don't want another neatly packaged, happy, unrealistic swamp monster...This movie was damn good. I never felt i was losing the plot because, in the best way possible, there really isn't one. Its a story with many sub-plots and quite simply, a linear story with insight into FDNY (or all FD) culture, what it is to be a Man, strong Woman, black/white... and like most movies with top comedians, the idea that gender and race roles really have no impact on our daily lives.I am totally fine with The extra run time; it really added to the fun. This movie was released for us to be viewed at hoMe during these crappy times. Its not a cash grab. Sit back and enjoy."}, {"id": 332, "text": "First of all, I should say I am not exactly a fan of SNL or davidson, yet I have always enjoyed watching his bits on Staten Island on that show.So, I had no expectations before watching the film.Yet, I have to say it is very well (if not brilliantly) written, the editing is truly great in addition to well-balanced cinematography. The performances by Marisa Tomei (almost in the focus of the movie) and Steve Buscemi (very short though it may be) are amazing.I might have missed some subtle details as I am not a New Yorker, and I am sure people will be poing them out.It is an ordinary story of everyday people on Earth who happen to reside in Staten Island.Having watched this, you will either love it or hate it.Possible Oscar nominations for: Best actress in a supporting role (Tomei); Best actor in a supporting role (Buscemi); Best original screenplay; Best editing; Best cinematography.Editing &amp; adding: I am going to watch it again for Bill Burr!"}, {"id": 333, "text": "He is my new favourite , because like buster keaton did, he has it in the eyes, and wouldve been a star like lloyd, keaton and chaplin in the slapstick silent movie era...just a hint for future products.in addition to that he has a cataclysmal verbalistic talent, along with loads of the others in the large main cast, and thats newage comedy, usually i dont like that linguistic workout in comedies, but this was a nice exception.its also about a man with a set of bad genes in the mental framework, and it has a load of ad/hd in its demeanors. ad the group dynamics of weed puffing group of friends you are really in for a yum yum.the only drawback to this flick is the ver long playtime, not that it isnt nescesarry, but it can be tiring at the late night attendance. but the rest 90 % of the film are just a race over the life of a man on staten island n.y., its filled with surprise and a lot of laughter, for some even tears.so the grumpy old man had a good time, you wont regret a view, and mr davidson will be on my notepad for the years to come. a big recommend"}, {"id": 334, "text": "The King of Staten Island has some issues, mostly having to do with tonality. The film is classified as a comedy but it delves into some very serious human issues, and every so often the acting goes from serious to comedic. I think the humor was great in this film, I laughed numerous times but the humor should be introduced when it should and not moments after a street fight for example.Thank goodness it barely happens in the film but it does from time to time and it feels like the film has two separate tones to it. Minor gripes aside, the script was fantastic. It's heartfelt and very human. I loved this film more because I was raised on Staten Island and still live here and that many moments of the film reminded me of when I was in my 20s, living a similar life to this movie's protagonist. Despite my bias, it's a film that everyone seems to be enjoying and I'm glad! I hope Pete Davidson gets the career he deserves. He's a natural. His humor is dry, and sneaky, and he's likely to be consdered the next Adam Sandler."}, {"id": 335, "text": "His first feature film since the extremely forgettable 2015 commercial hit Trainwreck, respected comedic mastermind Judd Apatow returns to his more serious comedic stylings of Funny People and This is 40 for his latest effort, The King of Staten Island.Released directly to streaming in the United States and facing a delayed cinematic release here in Australia, King marks the most high profile role yet of stand up comedian and Saturday Night Live regular Pete Davidson, who alongside Apatow explores a semi-autobiographical narrative of Davidson's lost soul Scott Carlin who has been left in limbo ever since his firefighter father was tragically killed when he was a young boy.Playing very much a version of his real life self, you sense Davidson isn't so much acting here as reliving his own memories and experiences and viewers enjoyment of King will be wholly dependent on how much they can tolerate Carlin's bleak and sometimes tiresome antics, that see this man-child battling his mental demons whilst failing to take charge of his stalled life.In many ways its a brave performance, Davidson willing to tackle his own traumas and issues head on in such a raw manner, with many likely to be surprised by just how few genuine laughs exist here with the comedian and Apatow more interested in the drama over cheap comedy moments, but Carlin is an often frustrating and unlikeable creation, even if its rare to see such a figure lead a big-scale Hollywood dramedy.Luckily for the over-long film (one that should never have been ticked off at over two hours), Davidson and his often hard to love creation are surrounded by some fantastic support turns with Marisa Tomei great as Scott's long-suffering mother Margie and Bill Burr as Margie's new partner and spanner in Scott's stay at home lifestyle Ray.Always a director that has managed to handle ensemble efforts as well as any one could, Apatow gets a lot from his films supports and when combined with the intriguing addition of regular Paul Thomas Anderson D.O.P Robert Elswit as the films mastermind behind the lens, King is always impeccably crafted and watchable (with a lovingly low-key final scene), without ever becoming a truly gripping or ground-breaking affair.Final Say -A solid addition to Apatow's growing collection of more deep-thinking drama's with touches of comedy, The King of Staten Island is good without being great, with the verdict still out on whether Davidson will be able to forge a successful career in narrative films.3 1/2 shoddy tattoos out of 5"}, {"id": 336, "text": "I really liked the King of Staten Island but dear Mr. Apatow, pleaaaase edit more? Every Judd Apatow movie I watch there's this sweet spot I hit where I'm in absolute love with it, but then I realize there's still 45 minutes left and I'm scratching my head on why he it insists for things to keep going. That's really the only negative thing I can say about this movie otherwise I honestly loved it. I feel how personal this story is to Pete Davidson and he gives such a real and genuine performance that doesn't feel sappy but doesn't feel fake either. When we deal with grief, we look to the things that help articulate our feelings and for me that's looking to art, this spoke to me on that level really profoundly. Davidson has a really dark sense of humor but you realize that's how he copes with tragedy and I really respect him for that. This movie was genuinely heartfelt, funny, and human. Even if the plot wasn't moving fast, I felt engaged strictly based on the character interactions and that's worth a praise in my book. Apatow knows how to write people and make them feel real so that's very present here, but man just edit the films down a tad, there's no reason for his movies to go above 2 hours, not for me at least. The King of Staten Island is a true reminder of what it means to cope with grief, pursue what you love, and find the good moments in the little things, it's absolutely one of my favorite movies of the year so far, even if it runs a little overlong in length. 8/10."}, {"id": 337, "text": "The King of Staten Island - B+ (Memorable)I'll be honest, I wasn't keen on watching Pete Davidson being King of anything maybe due to media's attention to his private life. I find the guy funny but more lost and feel lots of SNL and Standup stuff above average but not memorable. I am glad to see that I was proven wrong as it's not a piece glorifying drugs or recreational marijuana usage. The movie dealt with being a guy whose is lost, weird and has no direction per societal standards but still is a Human. He doesn't hurt people purposely and tries to be perfect but unfortunately not considered normal as the choices he makes is not being committed to social norms of perfection like education, house, girlfriend etc etc etc.Pete Davidson is pleasant to watch, he is not only playing himself but makes you understand that guys who don't want normal stuff may have issues but it doesn't make them Heartless they do deserve chance and understanding from family, friends and society. Talk about perfect casting is Marissa Tomei and Bill Burr as they bring the perfect humour and care to the story. The scene Pete goes back to Marissa his mom that he learned his lesson after cleaning and cooking for firies was hilarious, how moms do this day after day but rarely gets acknowledgement.The only thing I think movie would have benefited from making it under 2HRS, as it felt bit long maybe due to being on VOD directors can go with their cut instead of theatre. Still, the movie is an easy watch with heartwarming message into accepting yourself with time and overcoming it. You don't have to perfect to be part of society, you can be who you're and still can be valued."}, {"id": 338, "text": "What is there to say about King of Staten Island, besides the fact that I found it excellent...? Weird as it may be, it made me want to explore Staten Island, honestly.Really. I'm only familiar with Pete Davidson through his stint on SNL. So, knowing what I know about his brand of comedy, I was expecting to be entertained; if also a little weirded out. I'm pleased to say, I found this to be even better than I had expected. The trailer paints Staten Island as a quirky/sentimental dramedy, which I think is a totally refreshing light for Pete Davidson. He's kind of kooky, foul-mouthed and inappropriate, but he's got heart, and he brings his own personal history to this movie. King of Staten Island is R rated, and has that casual indie vibe, but I would've expected a lot more graphic content here, given the fact it's a Judd Apatow project. Instead, we are treated to a good helping of sincerity, and soul: a beautiful surprise.I fully expect Pete Davidson to book some more major roles now; after this truly affecting gem!"}, {"id": 339, "text": "This film hit demand last week and I have now had the chance to watch The King Of Staten Island and here is my review for it. The premise of the film sees A 24 year old weed smoker Tatooist with no ambition have to face his grief and try and make a step forward in his future. Main Character I feel that Pete Davidson is one of those people that comes across as either a love or hate mentality and honestly I find him really funny and I thought he really worked for this film. Yes he basically plays himself, but I found him really interesting here and I felt plenty of sympathy for him as a character. I like his dark humour here and it is clearly seen as a defence mechanism which just adds to his performance and character. Supporting Characters Marisa Tomei plays his mother in the film and she is fantastic, the chemistry the two of them have together is really good and I actually felt a bond between these two as in they were believable as mother and son. She is such an important part of his life and so nice that you see Davidson's point of view and want to just see her go the film and be happy. Bill Burr plays her love interest and he is awesome here too, he has great chemistry with Tomei and they just have a really nice relationship here and you want to see everything work out. His dynamic with Davidson is also a real highlight and does a great job of pushing both of their story arcs. Steve Buscemi has a smaller role here and he does a really good job in the role adding quality to his character. Story The story of trying to see Davidson's character trying to get his life together is the driving force of this film. You do sympathise with him and you really want to see him get his life started and turned around and that is the real highlight here. However, this film's first act takes a bit to get going and tehre are some parts of the story that aren't concluded and feel open ended with a bit of an abrupt ending to boot. Script The script is really good, there is just fun dialogue. Not a lot of really funny moments but this film is consistently chuckle worthy and that is enough to get you through easily. Plus there is a suprisingly large amount of heart and drama here that rises this above a pretty generic comedy that they make plenty of. Style The film just looks really cool, it has a fun style mixed with some really tension filled moments that will keep you on the edge of your seat. However, this film is way too long, it could easily have had 20/30 mins chopped off and it would have been paced perfectly but it just ends up dragging at times. Overall Overall, this is a great suprise for me and is easily a great film to watch. If you are looking for a fun comedy with a bit of heart to it then The King Of Staten Island is worth a watch."}, {"id": 340, "text": "SYNOPSIS: Scott (Pete Davidson) is a 24-year old living at home having trouble figuring out what he wants to do in life other than sit comfortable and smoke weed. After his mom starts dating Ray (Bill Burr), Scott is forced to start figuring out his life.REVIEW: I knew that I was going to like this movie due to it being Pete Davidson and honestly it felt like something he really needed to get out. A film for himself to vent. If you know Pete Davidson, you know he's had his fair share of mental struggles and it was clear he was lost for a while. This gives fans like myself a look into how his life was and what he struggled with. As far as aspects of the film, I'm not so sure why there was a choice to change the story of how his father died, maybe it wouldn't have meshed well with the rest of the film (which then I'd totally agree with the change) or maybe because 9/11 is a touchy subject. That could've been a decision on Universal's part, I'm not sure. I thought the acting was really good. Obviously, from Marisa Tomei, but I was really surprised with how well Bill Burr did. I thought he played the role as Ray, perfectly. Then you had some smaller roles like Bel Powley as Kelsey and Maude Apatow as Claire who had very wonderful performances. It's funny, however, that for some reason I feel like Pete Davidson... didn't act too well. Crazy to think since he was literally playing himself and so it's quite possible that it was a perfect performance, but some notions just didn't seem genuine. Maybe that's exactly how he is and if that's how he is in private than he was spectacular. He did give a good representation that he may not always know where he's going in life, but he truly has a kind heart and it's a very passionate person. This film was a good watch with a lot of funny moments and with maybe a slightly slow moving act two, but regardless it's a recommend from me. 7.4/10."}, {"id": 341, "text": "Although it certainly is a longer film in terms of comedy projects, The King of Staten Island graces the screen with genuine emotion and genuine laughs, that truly make it hard to not enjoy. Since I first discovered him on SNL, I have always been a fan of Pete Davidson's work as well as his standup, and seeing him act in this film- along with his other great coming of age story this year Big Time Adolescence truly shows how talented of a performer he can be. Not only is he funny and sweet throughout, but he provides a very clear view of growing up, letting go, and the emotions that come with it. I also enjoyed Bill Burr's performance as Ray Bishop, as well as several other performances, although none quite stick out as much as Davidson. The film is long, but that isn't to say its boring in anyway, it has its slower moments about 2/3 of the way through, but for the most part I was rather entertained and delightfully amused at how funny this film was, as well as how grounded the story was in general. What I like about Apatow's direction in this, similarly to the likes of his other film Knocked Up, is that he takes somewhat absurd situations and provides a platform for them to be realistic and grounded, which I feel is very important in any film, especially a comedy today. The look of the film isn't anything special, but it's a sweet and fun surprise that I wouldn't mind catching again sometime. My Rating: 9.75/10"}, {"id": 342, "text": "I've always liked Judd Apatow's style of mixing humor with situations that feel super relatable and appreciated his talent in writing characters who can all have separate movies of their own. This one's about a 24-year-old weed-smoking, conventionally good-for-nothing manchild named Scott (played by SNL's Pete Davidson, who's also co-writer). All he does is chill with his mates, smoke pot, play games, and conduct tattooing experiments on his friends.That opening scene was a major curveball though - I was thinking this is Apatow trying to tackle the much-talked-about subject of depression. But, in a matter of minutes, we get to Apatow's familiar playground. The dialogues are almost always the best thing about his movies, and The King of Staten Island is yet another example in that regard. It's filled with authentic, self-deprecating, situational humor that keeps things engaging even with a runtime of 137 minutes.Scott, a semi-biographical version of Davidson himself, throws the harshest comebacks every single time he's cornered, like it's the only skill he's got, apart from creating art with his tattoos. He is surrounded by many equally well-written characters such as his widowed mom (a stupendous Marisa Tomei), her new boyfriend (Bill Burr, who gets a meaty role and makes good of it), his friend-with-benefits Kelsey (Bel Powley, who steals every scene that she's in), and a mentor-of-sorts in Papa (the ever-reliable Steve Buscemi). While it's Scott's issues that form the centerpiece of the film, it's also about how all these characters are affected by his presence around them, at various points.And needless to say, Apatow uses his films to offer fascinating social commentary. He takes a dig at nepotism, makes an old-timer exclaim that reputed colleges nurtured people like Bill Cosby, Donald Trump, and Ted Bundy but college is also where youngsters have the 'time of their lives'. Heck, there's even a Jay-Z joke that'll make you more than just chuckle. Along with that opening scene, there's also a bizarre, out-of-place robbery scene that clashes tonally with the rest of the film. Disregard these minor problems and you have one of the finest loser learns to live life films out there that I'd love to see a sequel to, sometime in the future. Call that the 'The Emperor of Staten Island' if you must, Judd.P.S - Enjoyed seeing Machine Gun Kelly in a cameo."}, {"id": 343, "text": "If you know the answer to the title question then you'll understand that this movie isn't going to be some incredible masterpiece and enjoy it for what it is.The premise is basic and common, but it's based around real events, not some fictional, laugh out loud, unrealistic Hollywood movie.It's well cast. I was surprised by Bill Burr's acting chops. He's not an accomplished actor, but played his role perfectly. The casting of Steve Buscemi was perfect since he's a firefighter IRL, having worked for a department during the 9/11 terror attack.I didn't get Scott's friend's, though. They seemed phony and poorly written, but they were non-factors for the second half of the movie.Overall, a pleasant movie. It'll be one you can pull out from time to time, but won't be one you're talking about much in a few months."}, {"id": 344, "text": "The King of Staten Island is a Comedy - Drama movie in which we watch a young man changing his lifestyle due to some new parameters that were added in his life. From smoking weed, relaxing with his friends and dreaming of becoming a tattoo artist to the real life in which you have to work in order to receive money to do whatever you want.I have to admit that I was really surprised by this movie and I did not expect to like it so much. I enjoyed it very much because it had a nice and very interesting plot, a very good direction which was made by Judd Apatow who is one of the writers and some very good interpretations made by its cast. Regarding the interpretations, Pete Davidson who played as Scott Carlin (and he is one of the writers), he was simply outstanding and I believe that his interpretation made the difference. Some other interpretations that have to be mentioned were Marisa Tomei's who played as Margie Carlin, Bel Powley's who played as Kelsey and Bill Burr's who played as Ray Bishop. Finally, I have to say that The King of Staten Island is an amazing movie and I strongly recommend everyone to watch it because I am sure that you won't just find it interesting but also simply beautiful."}, {"id": 345, "text": "A star vehicle it's true, but SNL's Pete Davidson is winning deserved praise for his turn in a tale about childhood bereavement and its lingering aftermath. Drawing on his own experiences, co-writer Davidson carries this soulful New York story into an arena that trades gags for hard truths and it's all the better for it.Yes, there is a certain spaced-out lethargy in the storytelling and an overlong running time, but Davidson is persuasively raw in a performance that becomes increasingly textured and interesting as his character finds a father figure in his mother's ex-boyfriend. It's his bruised charisma that compensates for the frustrations of pace.It has heart. Bucketfulls of it. When the story leaves you, you realise you kept on with it because it spoke to you from its heart, and you listened.Davidson had earned my laughter some time back, with this he now has my admiration and respect."}, {"id": 346, "text": "Story - 8/10 pros: Apatow actually manages to derive quite a lot of heart out of this semi autobiographical story of Pete Davidson. It's a little more raw than most of Apatow's movie, which worked in grounding the goofball stylings of Davidson, who is actually quite competent in some of the more serious moments of this film. It's definitely interesting to learn a little backstory on Davidson, and understand him a bit more. cons: it's definitely not a laugh fest, in fact it is probably one of Apatow's least funny movies.Cast - 7/10 pros: Davidson is surprisingly good in this. I've always felt he was the type of comedian that tried just a little too hard, but Apatow definitely reigned him in and he provided some surprisingly touching moments in this film. Tomei continuing to embrace the second half of her career does well in the mom role, and Bill Burr turns from actor that you know his face into an actor that deserves you to know him by name as well. cons: there's some nepotism with Maude Apatow playing Davidson's sister.Direction - 7.5/10 pros: This is probably Apatow's best work as a director. It almost appears as though he takes a step back as this film in a lot of ways feels more like a first time director lower budget indie movie type thing, but that more raw authentic feel to this movie goes a long way in grounding such a huge personality like Davidson. Apatow is unafraid to linger in a moment or extend a beat to make it feel real, maybe something in the past he has shied away from going for the quick entertainment instead. cons: maybe I was expecting a little more comedy and was surprised by what the movie actually was, not sure that's a negative just more of a preconception that took me a second to get used to.Pace - 7/10 pros: the movie is rather long, but never felt like it was plodding along. Apatow extends moments and really grounds the movie into a very powerful truth that seemed real and authentic. For normally such a comedic duo (Apatow/Davidson) you might expect fast paced jokes stacked on top of each other, but instead Apatow takes his time and lets moments and environments live out and thereby creates a very believable and heartfelt world. cons: it is a long movie coming in at 2 hours and 16 minutes, but for the most part earns that time or the story needed it.Atmosphere - 7/10 pros: everything felt incredibly authentic and genuine to this movie. You totally believed the small town feel and people that lived in it. The camera work was simple but appropriate and allowed performances to come to life. The sets, costumes, and decor all seemed perfectly authentic and in place and helped ground the world. cons: the world felt a little small, but that is also what the story called for and needed.Overall 7 out of 10, worth the rental price but not an all time classic rewatch."}, {"id": 347, "text": "Having seen Judd Apatow's previous directed films and knowing his type of comedic humor, and after seeing the trailer of this film, had somewhat an expectation as what to expect.The King of Staten Island is quite apparently a semi autobiographical film about the upcomings of Pete Davidson's life. With that in mind, it was expected as he would deliver a great performance as this film may have a deep meaning to him.With an original intended theatrical release, this film was unfortunately slated to straight to streaming. Perhaps they could have waited several months later to release this in theaters- as it would have don't more justice.As a film, very solid doses of comedy and drama which Apatow is always great at. There are many light hearted funny scenes, but also sad and touching scenes. There is a good balance. And as a story there are enough little subplots to keep engaged all the way though start to finish.This is the film which may be responsible for Pete Davidson becoming a star, although with its limited release the question still remains. Perhaps in 2-3 years from now we will have our answer."}, {"id": 348, "text": "If you have money, why would you ever live in Staten Island?Not gonna lie, I wasn't sure if a movie starring Pete Davidson would be any good. I like him enough on SNL but he never seemed like leading man material to me. But who else could they have got to play, what is basically, a version of Pete Davidson? He's really exceptional in a movie that squeezes you in the feels and is awkwardly relatable on several levels.Davidson helped put this together, it's based on his own life. He seems like a goofball, and he is, but he makes you really care as well. Bill Burr is so good as the fireman dating his widowed mother, his best role yet. You get a bit of his stand up mixed with F Is For Family in this character. Marisa Tomei as the mother is believable and genuine. Director and co-writer, Judd Apatow, has combined all this and more to make a memorable dramedy that deserves to be seen, let's hope it reaches an audience in this strange year for new movies."}, {"id": 349, "text": "The King Of Staten Island is so raw and real, I feel like I grew up with these characters. And I'm not even from Staten Island.Maybe because the story is inspired by Pete Davidson's life-or maybe it's just the superior screenplay-but all the characters live and breathe and do sweet, random funny things that made me laugh out loud nearly every minute. Marisa Tomei and Davidson are outstanding. It's another iconic portrayal by Tomei.Davidson distinguishes himself as the voice of a generation with a new take on the loveable druggy loser character that we all know (or are). There's a lot of subtlety and avoidance of obvious turns here that hooked me right in.Bill Burr shines too. Even though I wanted to punch his character, I ended up rooting for him... and his kids and ex-wife too. Brilliant. Then, mid-movie the film morphs into a Steve Buscemi/firefighter flick and somehow, I loved that too!Bottom line: if you are looking for har dee har type throwaway laughs, this isn't for you. If you are looking for a great film with great characters and funny moments that stick with you after its done, The King Of Staten Island is the loveable underdog you want to be friends with."}], "reviews_amount": 350}