{"name": "First Cow", "titleId": "tt09231040", "reviews": [{"id": 0, "text": "I appreciate the thoughtful reviews of those who found value to this movie, but for this viewer it was a trying experience. It's very dark in terms of lighting, as some pivotal scenes are virtually impossible to see. There's a huge disconnect with the way the story opens and what it's eventually all about, so don't go looking for continuity there. The principal characters, once things settle down, are an immigrant fur trapper (John Magaro) and a Chinese wayfarer (Orion Lee) who hook up by accident, and with no other resources available to them, decide to team up to make a go of it in the 1820's Oregon wilderness. The title of the picture directly relates to the introduction of a cow into the territory by a wealthy trader, and it's jarring each time it's mentioned that the animal lost her 'husband' on the trip over from England. Who talks like that?Essentially, Otis 'Cookie' Figowitz (Magaro) and King Lu (Lee) team up in an enterprise of surreptitiously stealing milk from Chief Factor's (Toby Jones) prize cow and using it as an ingredient in making baked goods that they trade for money at the local fort. This worthwhile venture into capitalism is disrupted when one night, Factor's servant discovers their endeavor, and the chase begins to hunt down the malefactors. Separated while on the run, the pair eventually team up again down river, and the story ends abruptly when the injured Cookie requires some rest and both men fall asleep in the woods. At that point the end credits roll, and the sequel to the movie is left to the viewer's imagination.If you've never heard of a clafoutis, you'll learn at least one thing watching the movie. And if you don't, no use crying over spilt milk."}, {"id": 1, "text": "I always thought what people where doing in old times, what was their life-style etc this movie show that slow paced life where litle things matter and some can make you happy and some angry.Recommend this movie for those who hate movies with fighting, shooting etc for those who like relaxing experience - true movie lovers."}, {"id": 2, "text": "The camera work and the scenery are great. The period settings look good, but I cannot confirm that because I was not there.Other than that the story in simple with no excitement or anything special about it.The editor, which is incidentally also the director, should have cut it to 90 minutes. Alas, I did skip through the many dull parts and was disappointed by the ending which hinted to, but did not really explain the beginning.A mediocre attempt at a romantic story about friendship and the hardships of life on the frontier."}, {"id": 3, "text": "In the newest indie gem from a24 we see a little retouched version of Jonathan Raymonds novel The Half-Life. In the screen adaptation one of the character is turned into a chinese emigrant. This works fine for me and doesnt seem to take away from the story in any way.While a lot of people are complaining about the slow tempo of the film i think thats exactly what Kelly Reichardt is going for. If anything, the story actually could be prolonged even more allowing us to see more of the lives and personal philosophies of Cookie and King. The plot is minimalist, but it suits the message.To me Fist Cow seems like a critique of capitalism and a moral story about how we shouldnt take too many chances. You get lucky ones or twise, but you wont be lucky forever so dont push your luck too much. In that sense it is a fatalist story, because were aware that things will probably turn bad eventually. And when they inevitably do it seems like justice is served. Despite that we still sympathize with the main characters because their struggle is not to take advantage of others, but to make their dreams come true and finally get out of the misery they exist in.The movie does a great job of not being black and white with its ethics. A great deed is followed by an act of stealing. People are complex and the choices they make are often the result of their environment and the circumstances they live in.Many people will milk your cow in a lifetime and this story goes to show how you cant really hate anyone that you understand. Regardless of that greed is also a factor here. Dont be a fool and grab the opportunity while you can. Maybe youll never have another one. And milk it while you can."}, {"id": 4, "text": "The acting and the cinematography were superb but is was almost excruciatingly slow and I felt like I'd been cheated as to the outcome of the whole film. I'm sure the director could direct a good, watchable film, unfortunately this wasn't quite it"}, {"id": 5, "text": "This film is super slow. The story is interesting, but it is not even enough to fill one hour, let alone two hours."}, {"id": 6, "text": "This is a marvelous film, that leaves out all the parts that are unnecessary, and includes the real life bits and pieces that add up to a wonderful story. It highlights the value of generosity, and creativity, while also unflinchingly telling the story of a hard life on the frontier. The intensity of hunger in the world, and the value of food are beautifully exhibited."}, {"id": 7, "text": "Oregon territory. 1800's. cookie hooks up with king lu. they strike it rich making fried dough. stealing milk from the only cow in town is their sin. they pay. that's it folks. it doesn't sound like much, but it definitely has the feel of mccabe and mrs. miller. a warren beatty film from the 70's. anyway, it's very atmospheric and it's like being there. not for action buffs. but if you love movies, go."}, {"id": 8, "text": "Is it okay to steal from a wealthy landlord to survive in this capitalist ladder?First Cow is a brilliant tale about friendship and the necessary things we do to make hay. The central performances are brilliant and slow narration with pleasant country music really gives you the The Straight Story and Lone Star vibes. Haven't seen Kelly Reichardt's previous works but after watching this I am more than interested to complete her filmography. This film probably wouldn't receive a lot of noise during awards season but is definitely going to end up in many top 10 lists regardless."}, {"id": 9, "text": "...charting the early beginnings of bovine ecological damage, with the introduction of the Eve cow who would go on to breed the future generations that cause so much damage to the environment today. Can't sleep, don't rely on a warm glass of milk when a ready made anaesthesia already exists."}, {"id": 10, "text": "Nothing happens in this dragged on bunch of nothingness except two pelters in ealier times steal some milk from a rich man's cow to sell some cookies at a high price. The rich man eventually finds out and runs them off. It could have been 5 minutes rather then 2 hours of your time. 2 hours I am not getting back."}, {"id": 11, "text": "Wow, when I woke up, I started watching dirt...MUCH more exciting than whatever this was..."}, {"id": 12, "text": "This is an utterly boring movie with fixed shots, poor lighting and a so so story. I really won't recommend you to watch this. There are cooler boring movies than this one. If you have insomnia this may be good medicine."}, {"id": 13, "text": "The film's visual style is impressive but it's story and pacing is what really drags this film down for me. The cinematography is the one aspect I found to be excellent. The framing is on point and impressive and it adds a lot to the film's style. The production design and costumes are also really good here too. These characters look and feel as if they in the 1820s. The performances are also great too. Each character feels believable and works to help tell the story of the film. Although I like all that, the pacing is not very good. It feels incredibly long and tedious without any real majorly satisfying payoff. It's a 2 hour movie that feels like it goes on for 2 and a half hours. If they had cut down some of the scenes, this issue wouldn't be as major as it is. There were some elements of the story I enjoyed and some I found to be pointless. If you like A24 then check it out but don't have your hopes incredibly high for it."}, {"id": 14, "text": "This was the 1st movie I had seen in a real theater in months. Otherwise, I might have bailed after 10 minutes. It is slow to develop, with a prologue that doesn't make sense. The forests of Oregon is a wonderful character, but I'm not terribly interested, especially since the natural-light shooting makes everything dark. The story is told in fragments, with missing explanations of the intervals.The two guys meet in the forest, then later in a saloon, where they form a bromance / business partnership, the latter of which requires stealing milk from the 1st cow in the territory. In turn, each guy bounces between greed and wariness of being found out.I suppose as an art movie, things don't have to make sense, including the backstory of the 1st meeting."}, {"id": 15, "text": "Unless you want to be bored to death, don't even think about watching this soooo sloooow piece of nonsense. As a previous poster said, the positive reviews are almost certainly written by friends/family of the directors/producers/actors"}, {"id": 16, "text": "God, the boredom! It's no wonder that the director who brought you Certain Women also put out this dud. First Cow is about as engaging as listing to some bore drone on at length about nothing on NPR or CBC Radio. Unless you want to fall asleep in the theatre like I did, you can give this one a miss."}, {"id": 17, "text": "In one scene, there's just one idiotic choice after another made by the characters... honestly, no normal person would be so idiotic as what was shown in the film, and that makes for a large plot-hole as far as realism goes (this particular scene happens at night, perhaps you'll know which one I mean).There's also several other plot-holes in the film, that once again deals with the characters in the film making extremely illogical choices, but since I have not read the book that this film is based on, I can't say if that is indeed the way that the story unfolds in the book, or if the director of the film simply took some very idiotic creative-license when they directed the film.Either way, the film is OK. It's not great, or good, it's just OK. You can watch it if you don't have anything else to watch."}, {"id": 18, "text": "If you can spare the melodrama in a movie, you will surely like it. Many would say it's boring because those gaps which are usually filled by background music and unsolicited emotions are to be remained gaps in this movie. I loved it! A24 did it again!"}, {"id": 19, "text": "For those viewers who believe the pace of the film is slow, yes, there are no car chases. Instead, this film has a depth of character and original development that creates a mood so beautifully of the time and place. It is refreshing to have a plot that keeps the viewer's interest throughout. When the majority of movie offerings out there are pure trash, this film is a real treat."}, {"id": 20, "text": "First Cow instantly pulls you in with its incredible cinematography and recreation of the American West in the 1800's. While this film takes its time getting into the meat of the story, when it does, it becomes an absolutely absorbing film with two great lead performances. On top of the striking visuals, the chemistry between the two leads is what elevates this film. Overall, a great watch."}, {"id": 21, "text": "I was hoping for an intelligent Native backed story of interactions with settlers, miners, etc., but the story and acting were just not believable with no focus. The only thing authentic was the period clothing. Everything else seemed contrived. Never did figure out the central theme. Maybe that milk is delicious."}, {"id": 22, "text": "This is not a film for everyone, just like Kelly Reichardt films are not for everyone. So if you've seen her films, you kind of know what you're getting into, except this one is more plot-driven than many of her films."}, {"id": 23, "text": "People who watch films like Marvel Avengers, or mainstream cash cow movies will not enjoy this eloquent piece of film making. This is a very well acted film with some surprising actors appearing. The story is very original, and the acting is quality. This is not a movie, it's a film. There is a big difference. The film sequences, editing is excellent. The camera shots are all quality. Directing is very good, and those uncomfortable silences in the film are brilliantly done. If you enjoy art films this is for you. I was very satisfied with the film, and the ending was excellent. Recommend for those who enjoy good films."}, {"id": 24, "text": "The usual undersides of the frontier life, incivility, fisticuffs, treachery, barbarity, malevolence, etc., all transpire in the story, but either on the sidelines (a disgruntled old man with a raven on his shoulder, played by the recently departed Auberjonois, for instance, whose wanton menace never comes to fruition) or in the murkiness (the uncouth trappers' bellyaching), or completely off-screen, like its sublime ending, where Reichardt tentatively intimates us the one who would end both Cookie and King-lu's lives, but she tactfully saves us from witness the gory and cruelty by simply leaving it in omission, instead, focusing on the tender, amicable, wordless moments precede that, especially when King-lu fleetingly contemplates whether to leave a wounded Cookie alone in the woods, before thinks better of it and decides to stay with his pal, come hell or high water.read my full review on my blog: cinema omnivore, thanks"}, {"id": 25, "text": "Fantastic, beautiful, slow paced, filled with memorable characters, great directing/cinematography, interesting editing, and a suprising amount of depth.I don't think this is the greatest movie ever made, but it's a fabulous work of art that deserves to be seen &amp; appreciated. I loved how slow and chill the experience was, it was a refreshing experience to just unwind and let a film work it's magic without 7 million cgi explosions blowing out your eye sockets."}, {"id": 26, "text": "King Lu says things are getting dangerous. Cookie wonders if they should hold back for a while, on stealing the rich mans milk. And yet, they go on, and things fall apart. It seems that thieves and neer-do-wells never know when to stop, while they're ahead, and haven't been caught. Happens over and over again. Will they never learn? This film features a sweet friendship that might have lasted a lifetime, but their life time was cut too short by their obliviousness of when to cut and run. It does make you appreciate how difficult life was before electricity and air conditioning. Not for the action oriented crowd, but very nice."}, {"id": 27, "text": "The more understated arthouse cousin to 'Parasite' (Bong Joon-ho, 2019) and 'Hustlers' (Lorene Scafaria, 2019), Kelly Reichardt's 'First Cow' is a brilliantly moving drama about friendship and capitalism. The casting is excellent, the two leads are sympathetic and have perfect chemistry. The film also features excellent production design and an effective period musical score. Like all Reichardt's films, 'First Cow' requires the viewer's attention, and patience with the leisurely pace and attention to minor detail - but such patience is rewarded."}, {"id": 28, "text": "It's ok but young minds won't be liking it. I'm near 60 and barely can stand the long periods of inactivity."}, {"id": 29, "text": "A visually stunning film, with a pace that reflects the era, First Cow offers viewers a glimpse of what frontier life in the Pacific Northwest may well have looked and felt like. Engaging protagonists, realistic crises."}, {"id": 30, "text": "Why? Because it seems real for the period. Yes, there are some anachronisms, but overall the feel is right, and the story is about real people doing real things, I.e. trying to survive in a world that is not overly friendly. It helps to have someone you can count on, and that's what the film is really about."}, {"id": 31, "text": "The movie was fun after the first 30 min, little drag throughout the movie. Make a run, Just stealing jug of milk the risk is death. True friendship, helping each other to survive til the end."}, {"id": 32, "text": "It seems that bizarre name movie First Cow (121m runtime) is about racial (Asian/White) bromance on the old, old west. I disliked so much the beginning of this minimalist styled period piece drama (early 1820s) that I stopped watching it soon after its runtime (15-20 minutes). I did find it to be boring, slow-burn movie, not to mention unusual aspect ratio (4:3) that made me feel like I was watching old VHS film which was frustrating. In addition, for me, actor John Robert Magaro here was very unlikable to watch. It might be that Jonathan Raymond novel 'The Half Life' - on which First cow is based - is more interesting, but now I even do not want to read it because of this quirky movie endeavor. To conclude, I presume movie critics will adore this quasi artistic endeavor, but it's not my cup of tea."}, {"id": 33, "text": "I can't explain it, but there's something just so warm and homelike about the way this film is shot, edited, and acted. It's not an edge-of-your-seat thriller, but it holds your interest well and is a nice, easy watch for an afternoon."}, {"id": 34, "text": "I thought the idea of this movie was amusing, but gosh was I wrong. Rarely has a movie managed to bore me this much. The whole story can be summarised in 2 lines. And then it also lacks any kind of aesthetics to keep you awake. I just don't know what this was made for."}, {"id": 35, "text": "Pointless beginning and the ending is.never explained. Essentially they steal milk from a cow, this is shown endless times, they make cakes with milk. They are caught stealing milk. Go on the run, one trips and bangs his head, they meet up again, lay down together, maybe one dies straight away. Then it ends....oh yeah and it is s l o w ...."}, {"id": 36, "text": "First cow is a new film from a studio that bringed us some great films in a past,and even if First Cow isnt one of their best ,it is still a very good film with a story that is exploring beauty of friendship and also showing us how hard is to suceed in our own bussiness but if we try hard ,we will maybe be able to achieve that,when we talk about film it is obvious that pacing is very slow and films lenght doesnt help with it,to some people that would be a massive problem but i love to see a films like this once in a while,characters were also very deep and i felt connected to them,First Cow was for me one of best films i saw entire year and A24 did a good job again"}, {"id": 37, "text": "This could have been a good story but they didn't flesh it out at all. Anticlimactic ending. Didn't tie the beginning in. What a bunch of amatures."}, {"id": 38, "text": "Possibly the worst film I've seen in years. Half of it is so dark you can't even tell if there's anything happening at all. Wanted to quit, but kept watching since we'd already paid for it and since we hoped it might somehow lead to something. It didn't."}, {"id": 39, "text": "Everyone has a past and everyone's past has a story to tell."}, {"id": 40, "text": "This film start with a woman digging the skull, and a man Cookie searching things to eat in the forest scene! As turnout, this film is about Cookie and a Chinese King-Lu start of a selling oily cakes business with the milk they stole from Chief Factor's cow! Entire film too slow, and full of boring conversation! The overuse of the walking, and milking scene, also make the film unwatchable! Barely intense scene is, a bunch of intruders destroying King-Lu's house! At the end, Cookie and King-Lu rest in the forest, and waiting to escape with the money they earn together! That's it! Wasting time to watch!"}, {"id": 41, "text": "The story are from the wildfrontier in the west, among hunters and scavengers in oregon, where the taste of milk is like the taste of gold. and those who owe the milk can bake a wide variety of buns and cakes, steal the spilled milk, and make a fortune on empty stomachs.its a slow story and its very very dark in its visual presentation, so use darkness when viewing. the filmo and scenic additional photo are lovcely, the acting gears up as toby jones enters the screen otherwise cast and extras work like on a modern day norwegian viking camp at bukkøynå on augvaldsnes karmøy,norway.the most actionlike are the milkstealing, the darkness and the final hunt. it has something stuttering vibes over it, maybe its the lack of white female that lacks from the plot. anyway, the grumpy old man do recommend even though its compressed and slow."}, {"id": 42, "text": "The story of this film doesn't a bout first cow , if this cow was a second cow the story still the same . for me ( Small Idea ) is better"}, {"id": 43, "text": "Storyline is ok and totally fit for broke back mountain elements. Both actors have the qualities....."}, {"id": 44, "text": "Impressive cinematography (Christopher Blauvelt) and editing (by the director herself). Appropriately chosen music. Shall watch out for other works of this director.The opening quote in the film is well chosen: The bird a nest, the spider a web, man friendship--William Blake in Proverbs of Hell. Evidently Blake has influenced other directors as well--Jim Jarmusch in Dead Man, and Martin Scorsese in Mean Streets.Had I seen this film in 2019, it would have been one of my top 20 films of the year."}, {"id": 45, "text": "Don't spend your time for watching a slow , cold , inactive movie. In other hand a piece of sh.."}, {"id": 46, "text": "When it comes to A24 Studios, you can always expect an interesting and authentic script and, beautiful production value. This is a gorgeously shot film (and as A24 does, it's filmed in a unique aspect ratio of 1.37:1) which I think deserves some high praise for its cinematography. However, a lot (well I'll presume most) of viewers are going to find this film extremely slow paced and well - plain boring. I had a really hard time being invested in the story but I was totally captivated by the performances, cinematography, and the brilliant direction. I expect this may have the chance for some nominations come award season next year but for the average viewer, they will probably never watch it or will have ever heard of it when that time comes."}, {"id": 47, "text": "I'm actually angry at myself for having wasted time on this. There's no dynamic to this movie. The dialogue is unnatural - intended to slow down an already painfully slow movie. The acting is anemic, as if the actors were themselves bored making the movie. Don't waste your time."}, {"id": 48, "text": "They didn't ask the cow for consent. I guess she didn't seem to mind as she didn't kick him in the head when he touched her. He was a smooth talker too. Just kidding.This is a great movie. If you love it too, watch Certain Women by the same director. CW has a heartbreaking performance by Lilly Gladstone."}, {"id": 49, "text": "I don't really care how many stars a film gets, or how highly IMDB rates it, I gave First Cow 15 minutes to pique my interest. Even that was being generous. I had absolutely no interest in continuing to watch, in addition to the fact that it was so DARK AND BLURRY that it was hard to figure out what was going on. First Cow is should be renamed First Skunk because it stinks."}, {"id": 50, "text": "This is a tough movie to rate. On the one hand, it is gorgeous! Beautifully shot, wonderful sets, awesome costuming! It's slow, methodical pace let me sink into it - almost as if I were in that place, at that time. Tranquil, peaceful, and soothing to watch.And, at times, I almost fell to sleep. There is basically no plot beyond a baker making biscuits with stolen milk. For TWO hours. That's it! Oh, and friendship. Actors are good, movie is wonderful to look at. Plot is biscuits, stolen milk, friends.So, if you want to just immerse yourself in an amazing looking film, and two hours of peace, grab this! If you want a plot, move along..."}, {"id": 51, "text": "Plot Spoilers. Cookie (John Magaro) is a cook who has found himself in Oregon working for trappers who don't like him. He helps an immigrant in trouble. Later they meet at the fort and become friends. They steal milk from a neighbors cow and cook biscuits with it that they sell at the fort. They get caught and leave. The ending ties into the opening which was typical indie film clever. I was bored and kept waiting for something to happen. Long boring scenes opening with a boat going down river."}, {"id": 52, "text": "Did not see any of the birth of a nation thing that a lot of people here are mentioning. There's a little here and there, but no more than in any other western. Instead you see the 2 main characters doing everything in their power to die! It like watching a western version of dumb and dumber! You know they're gonna die because of the beginning of the movie.... You just aren't expecting they try so hard for it to happen."}, {"id": 53, "text": "A story about two outcasts who find friendship and a business partnership with each other in the American frontier.John Magaro plays a gentle baker who begins the movie as cook for a prospecting expedition. He's too thoughtful and sensitive to really fit in with the macho wild men he's with, who bully and threaten him. Orion Lee is a Chinese immigrant who befriends him and suggests that they go into business selling the baker's biscuits at a local trading post. The biscuits are a sensation, but the enterprise is a dangerous one -- the only place to get milk is to steal it from the cow (yes, THE cow, not A cow) that belongs to the local aristocrat, played by the always welcome Toby Jones. The film begins in the present day with a hiker in the woods discovering something that hints at how the movie will end, and how the movie then circles back to that find is a small miracle of narrative storytelling.Kelly Reichardt, who's made a career of quiet, understated films, remains true to form here. First Cow shows much more than it tells, which should please fans of art house fare but will probably frustrate more casual moviegoers who have less patience for the way stories are told. The two main characters don't talk much, but we learn much about them, not from what they say, but from how they act. The first time we see Magaro's character, for example, he's hunting for mushrooms in the woods, and he takes the time to set a salamander he finds back on its feet when it's struggling to flip itself over. And when Lee's character shows him to his cabin in the woods, the first thing Magaro does is find some wildflowers with which to decorate the small space. Little flourishes like these reward the patient viewer, and we come to like the two men so much that the end, though we've been warned of it in advance, feels that much more tragic when it comes.Covid has seen to it that 2020 hasn't exactly been the most robust year for movies, but of movies that have been released so far this year, First Cow is one of the best I've seen.Grade: A"}, {"id": 54, "text": "Thanks to constant mental stimulation due to social media, cell phones, and online content always being available, the majority of people now have an extremely short attention span. If that sounds like you, then don't watch this.I personally consider myself to be a very patient person, and if you are willing to just be patient and actively appreciate the film you will find this film to be a rich cinematic treat. The cinematography is exquisite, meticulously framed in a 1.33:1 aspect ratio. The performances are extremely watchable - these characters could easily have been rather dull or boring but the brilliant actors elevate them to near-mythological status. The plot, while cliched, is supported so well by the aforementioned elements that it feels like a completely new experience to the other films that have similar plots.If you only watch films for a quick dopamine hit, this is not the film for you. In order to get anything out of this film, you must put in some of your own thought. Under the surface, the film is rich with ideas about capitalism, the American Dream, and especially male friendship. It's left up to the viewer to interpret the work for themselves, which is what I appreciate most about Kelly Reichardt - she doesn't try to force a message down your throat, she just lets you interpret her films however you want to. But you need to be patient if you want to get a good experience, which many people, especially on this website, don't quite seem to understand."}, {"id": 55, "text": "If you've ever seen a Kelly Reichardt film you know the well-regarded director is in no rush to get her audience anywhere fast or in particular, as she instead lets her camera linger on her characters and setting, well and truly the less is more approach to narrative storytelling.Since her debut with 1994 effort River of Grass, Reichardt has steadily plowed away across her career with character driven dramas that will either have the audience in a trance like state of anticipation or others struggling to stay awake as things ever so slowly transpire in front of their eyes.With her newest effort First Cow, Reichardt doesn't change her style in the slightest in adapting Jonathan Raymond's book, as we follow John Magaro's Cookie and his new business partner King-Lu (played by the films MVP Orion Lee) deep in the woods of the early American Oregon frontier where they search for fortune but settle for a small-scale business venture that sees them stealing milk from the areas sole cow.The film feels and and breathes like its from the era it is set in, there's no flashy Hollywood style over substance here, this is a muddy and lived-in woodlands set tale that is further enhanced by Reichardt's stoic directing and 4:3 aspect ratio but while its alive in this sense of time and place, there's very little energy or enthusiasm coming from its tale or characters that feel as though they had a lot more to give.There's nothing wrong with small and intimate character study's that act as metaphors to much larger explorations of the human condition and our history but First Cow constantly feels as though its beggining to be something more, something that never eventuates, never more so evident than in the relationship between Cookie and King-Lu as friends and business associates with Magaro and Lee doing fine work but finding themselves unable to escape the shackles of a film that doesn't let them fly free.It's a hard film to hate, you can sense that Reichardt and her crew poured their love into this A24 distributed drama (one that I'm sure they will be promoting come awards season) but there's not a lot to love here as our central friendships, characters and story slowly plod along to a destination that never eventuates into a finale that makes it all truly worth your while.Final Say -A sure-fire hit with Reichardt fans, First Cow continues on with the form and product that has made her name but this snail-paced drama feels as though it had more to give with a bunch of colorful characters and situations that feel only half-explored.2 1/2 broken branches out of 5"}, {"id": 56, "text": "A positive surprise. At first the film feels that it doesnt know where it goes and shows a VERY detailed introduction of its two protagonists. But detail is the key word for this newest feature by Kelly Reichardt. The visuals are extremely detailed and so are the characters in general. We get a lot of information just by watching them in their daily lives and slowly the plot thickens and has some unexpected turns. Kelly Reichardt really did a fantastic job telling that story. She proves a fantastic eye for visuality, showing off some fantastic nature shots that really add a lot to the atmosphere of the film. She did everything right with this film, although she might once in a while loses herself a little bit too much in her details. The actors were wisely chosen and the leading roles filled with rather unknown actors who are usually in secondary roles. First of all there is John Magaro who is very subtle and effective. The better performance came from Orion Lee who is extremely charismatic and does a lot with the role given to him. I think he might have a very interesting future. I loved how he handled that role and gave it many different facettes. There is a good supporting performance by Toby Jones who does wonders with his rather one dimensional character. Ewen Bremner is a bit wasted, but not as much as Lily Gladstone which was insulting. Gladstone was brilliant in Reichardt's previous film, and ended up in my Top 5 Supporting Actresses so I was shocked how misused she was in this film. But thats just one of the very few flaws the film that. Another very positive note goes to the score, which is fantastic and as mentioned before the cinematography. Give it a try and try to read as less as possible about it so you have the chance to perfectly soak into it."}, {"id": 57, "text": "Half of the audience that watches this film will likely hate it. I'm starting with that because this film is incredibly slow in terms of pacing, which will easily turn off the impatient viewers. Personally, if a film like that has an interesting story, a slow pace actually helps to suck me into a story. First Cow, which is one of A24's most recent releases, has just become available on-demand. While I wouldn't rank it among their best when looking at their stellar catalog of films in recent years, it's still a great movie all around.First Cow follows a highly skilled survivalist/cook in Cookie Figowitz (John Magaro), as he stumbles upon a group of traders. Becoming close friends with King-Lu (Orion Lee), they illegally take an opportunity to earn themselves a profit. Once a cow arrives on one of the farms, they steal milk in order to cook biscuits for the townspeople. All seems well and good, but they can only keep it a secret for so long. This premise held my attention so well because the film continuously gave you reasons to care about the two main characters. It was that, on top of the slow pace that really kept me invested.Films like Meek's Cutoff and Night Moves are what had me keeping an eye on director Kelly Reichardt because I found those films showed her true potential as a filmmaker. She's wonderful at bringing out the best in all of her performers. What kept me from loving those two films overall though, was the fact that I found them to be a little too drab in terms of sound design and music. That's clearly her signature because First Cow once again feels a little too much like that. I loved watching this film and everything that happens felt earned and satisfying, but the overall movie can feel a little lifeless at times. That's really my only issue with most of her film that I've seen. She's otherwise an award-worthy filmmaker in my eyes.Yes, John Magaro and Orion Lee are both terrific and hold this film together from start to finish, but the real star of the show here is cinematographer Christopher Blauvelt. Having worked on her two aforementioned films as well as a few others, his work on Don't Worry, He Won't Get Far on Foot and Mid90s is when his name truly jumped out at me. Blauvelt is someone that I will begin researching and anxiously awaiting his next project, simply due to the fact that his work on First Cow was his best yet. The camerawork felt like a character in its own right. From certain ways, characters are framed to extreme wide shots that clearly have deeper meanings, the way this film looks pulled me in more than anything else.In the end, there are things about the tone that bothered me throughout the entire movie, but the story, characters, and especially the way the film is shot held my attention throughout. It's hard to recommend this movie to those who are casual viewers and were looking to be entertained because I can almost guarantee that you won't be unless you're a film buff and know what to expect. If it wasn't for the dour feel of the whole thing just not clicking with me, I might be saying that I loved this movie. Overall, it's a very, very well-made film that deserves attention, but from the proper audience."}, {"id": 58, "text": "First Cow (2019 release; 122 min.) brings the story of Cookie and Lu, two pioneers in the Oregon Frontier. As the movie opens, we are today, and a woman is taking a walk in the woods. Her dog inadvertently discovers the remains of not one, but two human skeletons... We then go back in time to the early 19th century. A guy named Cookie is harvesting mushrooms and bumps into a Chinese guy named Lu. They strike up a friendship... At this point we are 10 min. into the movie but to tell you more of the plot would spoil your viewing experience, you'll just have to see for yourself how it all plays out.Couple of comments: this is the latest film from writer-director Kelly Reichardt, whose previous work includes the excellent Meek's Cutoff and Wendy and Lucy. Here she adapts the novel The Half-Life for the big screen. I have not read the book and hence cannot comment on how closely firm film sticks to the book. What I can tell you is this: First Cow is a spellbinding look at what life was like on the Oregon Frontier in the early 19th century: a slow pace of life, very rural/brutal/harsh living conditions, lots of poverty, and famine. Get the picture? This ain't for the meek or the weak! It feels as if nothing much happens in the film in the first hour, as we simply get to understand the context of these lives. But then in the film's second hour, we understand which direction this is going, and it all becomes spellbinding, but certainly not for anyone in a hurry. Two technical aspects were striking: one, the photography (in a rather unusual 4;3 picture ratio, instead of the typical 16:9 ratio) is stunning. Each and every frame has a purpose. Two, the film's score, even though only incidental, is absolutely outstanding, courtesy of guitarist William Tyler. Last but not least, kudos for the lead performances by John Magaro (as Cookie) and Orion Lee (as Lu).First Cow premiered to immediate critical acclaim at the 2019 Telluride Film Festival (16 months ago), in what now feels like a different era altogether. It was released in theaters literally the week before COVID-19 struck. I had seen the trailer at my local art-house theater here in Cincinnati but the film never made it here, sadly. The movie is now available on SHO On Demand (where I saw it earlier this week) and other streaming services. If you are in the mood for a top-notch indie movie about life out on the Oregon Frontier back in the 1820s, I'd readily suggest you check this out, and draw your own conclusions."}, {"id": 59, "text": "If you like immersive cinema that takes its time and lets you embrace the setting, First Cow is for you. This is a slow-moving portrait of two men happening across an opportunity in 18th century Oregon. To be perfectly honest, early in the movie I was not especially interested and concerned it would just meander along, focused on establishing the setting. Thankfully, it develops into an elegant story of risk and capitalistic exploitation. Everyone in 18th century Oregon is there for some sort of venture, and it is just starting to boom with people moving in. Cookie and King Lu seem like unlikely friends, a soft-spoken cook and an opportunistic Chinese immigrant. Both characters are very well acted, drawing out subtleties in how they view the cake making opportunity and how they deal with their guilt. The class divide is clear as they know the Commander is so arrogant as to assume nobody would dare steal from him, as he is so high and mighty. It's quite a simple story, but it's a compelling metaphorical tale, with the cow representing the beginnings of the modern economic era. I'm not sure if Reichardt's style is quite my bread and butter, but I like the ideas and the third act was quite well realized. I'm happy to see this quiet, contemplative movie get such critical acclaim; while I certainly don't like it as much, it reminds me somewhat of 2018's fantastic Leave No Trace."}, {"id": 60, "text": "First Cow (2020) is a strange film, in the sense that there is no other movie that I can think of that is similar to it. That isn't surprising because it was made by my favorite film company, A24, which specializes in strange, unconventional movies (Midsommar; The Lighthouse; Hereditary; The VVitch; Moonlight; The Killing of a Sacred Deer...). It is set in 1820 in the early days of America, and follows the story of two society's outcasts: a skilled cook and a Chinese immigrant, who are both lost in life and looking for a shelter and a purpose. Through small acts of kindness they find true connection to each other, becoming not just friends and each other's business partners, but reciprocal beacons of light, which brought them both hope for a brighter future. Two people connected not by mutual interests, or race, or any kind of group identity; but by their misfortunes and the way they view life. I personally thought that their friendship, considering it is the films essence, wasn't accentuated well enough. It all seemed very vague and obscure; and there could have been a lot more subtle, short scenes which would have further explored their relationship with each other. Apart from that, this film is reaaally slow, but it was conceived that way, and many people found it unhurried, peaceful and meditative; which is really the same thing, it's just a question of subjective perception. To fully appreciate a film like this you have to get yourself in a proper mood, and set your expectations accordingly. I went into this films (just like any other film) knowing absolutely nothing: I don't watch trailers and I don't read descriptions; so naturally I had no expectations in any direction apart from that the film should be good. Looking back on it, if I knew how consistently slow it would be, I probably would have enjoyed it a bit more. Calm, pleasant, but unremarkable."}, {"id": 61, "text": "The movie begins with a modern day scene, we know the period only because we see a modern ship on the river. Then soon a skull is discovered and then two adult skeletons laying side by side in either a shallow grave, or maybe just covered by debris over the past 150+ years.Most of the story is in the 1800s as explorers travel west to build a new life and perhaps find some of that gold. Gradually two men become friends, one a Chinaman the other a man from Maryland trained as a cook after being orphaned. When the first cow shows up, owned by a wealthy man, the two hatch a plan to form a business.It is a nice story of friendship and cooperation to overcome obstacles, but as the period would dictate the men are dirty, the scenes are unattractive, and the story often moves quite slowly. It is almost 2 hours and I found myself wishing it had been 80 to 90 minutes.The user reviews are quite polarized, many love it while many hate it. I can understand both extremes, I am somewhere in the middle.My wife and I watched it at home on BluRay from my local library."}, {"id": 62, "text": "Kelly Reichardt's (Certain Women) First Cow is a song to nature, a tribute to intimacy and friendship, and a solid rebuke to Hollywood's image of the gung-ho masculinity of the Old West. As the director laments, The heroism of masculinity, white masculinity, it never dies. It just doesn't die, that image in filmmaking always gets a roar of applause. In First Cow, however, Reichardt quietly explores a male friendship that is built upon kindness and mutual acceptance and offers a vision of an American dream not yet corrupted by self-interest or exploitation.Based on the 2004 novel The Half-Life by Jonathan Raymond (Night Moves) and adapted by Raymond and Reichardt, First Cow is set on the Oregon frontier sometime in the early 1800s. Shot in a boxy 4:3 ratio similar to the Westerns of the 1950s, the cinematography by Christopher Blauvelt (Meek's Cutoff) and a haunting score by William Tyler reveals the pristine beauty of the Oregon wilderness as well as the primitive conditions in which most trappers and explorers lived. At the beginning of the film, a quote from poet William Blake, The bird a nest, the spider a web, man friendship sets the tone as the opening shot introduces us to a barge slowly making its way down the Columbia River, which is where the story takes place.In a brief prologue set in the present, a young woman (Alia Shawkat, Izzy Gets the F*ck Across Town), out walking with her dog, discovers a human skull partially buried in the dirt. Upon digging, she uncovers the skeletons of two men holding hands. Without further explanation, the scene then shifts to the beginning of the nineteenth century as Otis Cookie Figowitz (John Magaro, Overlord), a cook for a team of trappers at the Royal West Pacific Trading Post discovers King-Lu (Orion Lee, Only You), a Chinese immigrant hiding naked in the woods. After providing the fugitive with clothes and shelter, we learn that Cookie is from Maryland where his mother died when he was born, and his father died shortly after and he's been on the road ever since.King-Lu is from northern China and claims that he is running away from the Russians who are seeking to revenge the killing of one of their own. After some time has passed, the two men find each other again inside a bar at the trading post and develop a close, if unlikely friendship. When they witness the arrival of a cow with huge, soft eyes (the breakout star of the film) that belongs to wealthy landowner Chief Factor (Toby Jones, Jurassic World: Fallen Kingdom), King-Lu devises a scheme to secretly milk the cow late at night and use her milk to bake honey-covered biscuits which they market to the occupants of the settlement, starved for anything that reminds them of home. Chief Factor noticeably remarks when biting into one of the biscuits, I taste London.The enterprise is successful and perhaps is reflective of the idea that a successful commercial venture in our society requires a certain degree of larceny. This notion is reinforced by King-Lu who proclaims that, We have to take what we can when the taking is good. His plan is to accumulate enough money to go to San Francisco and set up a business while Cookie dreams of opening a hotel for travelers and a bakery. When Cookie is persuaded by Chief Factor to bake a Blueberry Clafoutis, a special British desert to impress a visiting Captain (Scott Shepherd, X-Men: Dark Phoenix), Factor discovers that the dish requires milk and, in perfect Sherlock Holmes fashion, puts two and two together, sending Cookie and King-Lu on the run for safety.Like most of Reichardt's films, First Cow requires patience and a willingness to explore character development at the expense of a fast-paced narrative. While the film is not religious, the presence of spirit is felt in its journey among the rivers, the woods, and mountains of the Pacific Northwest, and in a narrative attentive to mankind's need for friendship. In Reichardt's 2006 film, Old Joy, one of the characters shares an old Chinese proverb that sorrow is nothing but worn-out joy. While our society is often permeated by the sense that our joy is wearing out and that we are in danger of losing our connection to other human beings, Reichardt's sensitive and haunting film renews our understanding of the deep and abiding companionship we can still share with each other - in moments of beauty and tragedy,in an age that feels closer to the end than the beginning."}, {"id": 63, "text": "Americans have always been enterprising. Sometimes to their own detriment. If anyone ever made a movie about the origin story of the American Dream then this is it. Its about the hustle in the new world for creating something truly original. Yes there is a bit of a scheme involved. The First Cow in its whole serene presence and bovine grace represents the vastness of opportunities and the inherent urge of those in power to limit its access to those who may be more skilled, more persevering, more aspiring and perhaps more deserving.The First Cow is a movie set in a time which is often depicted in the confined cinematic universe of gun toting cowboys and the audience is usually never exposed to this side of the wild west which tends to focus on the people who really survived the time preserving their sanity. I think people like Cookie and King were the kind of people who truly built America. Btw, there's a nice ring to the name Cookie King! A restaurant and a bakery by that name may actually work.On a different note, being a Hindu born in India, I'm naturally inclined to call this movie an evidence on how important a single Cow could be for the community. Divine maternal nature of the Cow which the Hindus have come to worship over thousands of years isn't the least bit irrational.Well, in terms of the acting, the two lead men have done a splendid job. This is the first time I watched a Kelly Reichardt movie and I find it astonishingly rich and character driven despite its slow pace and sparse dialogue. It reminded me of Satyajit Ray movies such as Pather Panchali. It is that visual storytelling and stillness which just pulls you into the story. First Cow is all about chewing the cud on good cinema."}, {"id": 64, "text": "Very sincere effort, deserving sincere review. Meticulous re-construction of Northern frontier life in the 19th century. We know the Californian gold rush dragged countless souls to NW ex-Mexico, but before that was the rush for Fur. This film captures that Silas Marner moment, where beaver-felt in Europe was on the wane, in favor of Silk. You really need some of the frontier on the inside to appreciate how well done &amp; intricate are the details here. A man on foot is far less effective than one on horseback, making our two fellow-pioneers poor; though you'd expect the Squire, at least to own a horse? And I've never met an oriental man who can't cook better than ANY Westerner - a fact of life that's hard to ignore. As for the pace of this artistic film, if you complain about that it's slightly missing the point. You see a lot of this in the work of the French cinematic school, mid 20th Century, long scenes with minimalist dialogue (perfectly spoken) &amp; punctilious for the tiniest of details - something Hollywood ought to consider as an alternative to effects for FXs-sake, big-star Egos, oppressive self-censorship and disarmingly gratuitous violence. I liked First Cow, not only for its cinematic endeavor, but also for its a-u-d-a-c-i-t-y to be different in an age of in-your-face predictable-ness. As for the ending, the viewer needs the intelligence to figure this one out without having things spelt-out."}, {"id": 65, "text": "The films of Kelly Reichardt are not for everyone, but for those who enjoy a steady, contemplative, poetic and flowering story that stops to smell everything small, she may be the one.First Cow is a simple tale of early American settlers with big dreams, barely scraping by in a lush and promising, but inhospitable wilderness. Cookie Figowitz and King Lee form an odd couple of dreamers who get by on clever schemes and the milk of the lone piece of livestock in the area. Their struggles present the already existent class struggles that an early Capitalist system festers, and though politically intriguing, the core of the film is the buddy buddy relationship born out of necessity, and nurtured by an unspoken craving for companionship.The pair realize that to make money, they need money, and their cash cow could be a launching pad to a grand and profitable future. Along the way they discover a common bond of humanity, which they don't learn to cherish properly until the final, fitting frame.Eschewing grandiose adventure in favour of minute details, Reichardt's pace is deliberate and sure. The result is a gritty western without horses, saloon brawls or gunfights. One that feels pretty damn true to the time. Turns out the early settlers were dealing with a pretty mild mild west, which was pretty sweet and awfully harsh in alternating doses.First Cow is perfectly bovine.hipCRANK"}, {"id": 66, "text": "I am usually skeptical of industry hype, but this wonderful frontier indie is as every critic said- easily the best film of 2020 (as of July). It is a story of rising up when circumstances conspire to keep you down. It is a story of ingenuity and downfall from greed. It is a bromance for the ages.Pacing is slower than necessary, but no more than one would expect from a Studio A24 production. You can fast forward through the first few minutes and not miss anything, but I enjoyed wondering why there was a modern ship passing through a movie about 1800's Oregon.Audiences who appreciate cinematography and leisurely strolls through the lives and struggles of 1800's settlers will be entertained. Those expecting modern pacing, shootouts, and explosions will be sorely disappointed.I am glad there wasn't much swearing or overt racism except for the scene where everyone stared in disbelief that King dared to talk to the Factor. Every character is a lovely shade of gray. I wanted everyone to wash their dirty hands while eating, but germ theory was still 50 years out.A few caveats- this is shot in letterbox and is nowhere near 4K resolution. The story is predictable, and the main characters make some very dumb decisions. You have to be in the mood for darkness, both literal and creative. This isn't a Disney movie as you will realize within the first 5 minutes."}, {"id": 67, "text": "Kelly Reichardt doesn't make movies that move or if they do, they move very, very slowly and First Cow is no exception, (it has just won the New York Film Critic's Best Picture of 2020). It begins in the present day before moving back in time to the Oregon of the Old West where a cook to a bunch of trappers and a Chinese immigrant he meets hiding in the forest strike up an unlikely friendship before going into business together making cakes with milk which they steal from the cow of the title.This is an art-house western and no mistake, moving at a pace that makes Terrence Malick seem like an action director, (did we really think it would be otherwise?). Of course, you could say that Reichardt, who shoots the film in Academy Ratio, gives us the truest picture of life in the West since Altman's McCabe and Mrs. Miller, though Reichardt doesn't go in for 'star' names, (the nearest we get to 'stars' here are Toby Jones, Ewen Bremner, Scott Shepherd and Rene Auberjonois in his last film role). The cook is John Magaro and the Chinese man is Orion Lee and you will be forgiven if you haven't heard of either of them. and yet for all it realist trappings it often feels like 21st Century people playing at being cowboys. That said, and despite its funereal pace, this is a western like no other, (it's certainly the most original since Jim Jarmusch's Dead Man). Of course, you might also be surprised that a movie like this is being tipped for Oscar glory but then, 2020 has been a year unlike any other and it's independent movies like this that are stealing the limelight. It's also Reichardt's most accessible film to date."}, {"id": 68, "text": "Greetings again from the darkness. A modern-era woman (Alia Shawkat) is hiking along an Oregon river with her trusty dog. Something catches her eye and she begins tentatively brushing away decades of leaves and soot. Ultimately it turns into an excavation of two human skeletons nestled together. How many years since these two laid down for the last time? Why in this spot? It's a terrific way to begin a story, and does justice to what follows ... all of which takes place in the early 19th century.Director Kelly Reichardt has already made her mark with such standouts as CERTAIN WOMEN (2016), MEEK'S CUTOFF (2010), and WENDY AND LUCY (2008), and this time she adapts the screenplay with Jonathan Raymond from his 2004 novel, The Half-Life. Cookie (John Magaro, also seen in this year's SYLVIE'S LOVE) is initially seen traveling west with a band of trappers. Skirting the law as they make their way in this new world, the men act as bullying brutes towards Cookie, a quiet and sensitive man. During one stop for camp, Cookie is rummaging the brush for food when he stumbles upon a naked Chinese man who is hungry and running from Russians (aren't we all?). Cookie provides King-Lu (played by Orion Lee) with food and shelter, a Golden Rule act that comes full circle not long thereafter.Cookie and King-Lu begin establishing something more than a friendship. It's a life bond (but probably not in the way you might be thinking). It's more natural instinct - a 'two heads are better than one' partnership. Despite the hardships of early frontier days, the two men share their version of the American Dream, and it's about this time that our titular bovine makes her entry stage left. The cow belongs to Chief Factor (Toby Jones) who is eager to create a more refined life in this untamed wilderness. Cookie views the cow's milk as the key to creating tasty biscuits (a rare treat), and King-Lu immediately recognizes the possibility of profit. The nightly heist features Cookie's one-directional conversation with Evie the cow ... presumably making her first screen appearance.Ms. Reichardt's film is not nearly as simple or slow moving as it appears. She fills it with a slow-build tension, especially in the second half. The film requires patience and attention to detail from viewers. How can something so quiet and peaceful be filled with such danger and difficulty? That's the brilliance of the film. Supporting work is provided by Scott Shepherd as a military officer Factor tries to impress, the late Rene Auberjonois (whose presence seems a tip of the cap to Altman's classic MCCABE AND MRS MILLER), Ewan Bremner (whose accent requires subtitles for comprehension), and Lily Gladstone as Factor's Native American wife.This is the first film I recall where a clarfoutis plays a key role, and there are sprinkles of dark comedy throughout ... which plays well off the rugged characters and environment. William Tyler's score and Christopher Blauvelt's cinematographer mesh well with the fine performances throughout. Ms. Reichardt opens the film with a William Black quote, The bird a nest, the spider a web, man friendship. We witness the friendship, and by the end, we wonder if it's also a web. Now streaming on Netflix"}, {"id": 69, "text": "IN BRIEF: Highly atmospheric but sluggish character study of a frontier bromance, a cow, and the American Dream.JIM'S REVIEW: (MILDLY RECOMMENDED) First Cow is an independent film that celebrates friendship, capitalism, and the American Dream. Set in Oregon Country, circa early 1800, the film is all atmosphere, with minimal dialog and even less action. It is leisurely filmed as it tells its simple tale about two enterprising drifters who try to turn their hard luck into a lucrative business proposition.John Magaro plays Cookie, a baker who may have qualified for Top Chef Frontier Edition, and Orion Lee is his Chinese immigrant friend, King-Lu. The actors are quite good and create a nice bond. Solidly directed by Kelly Reichardt, the movie is written by the director and Richard Raymond and they do provide some fine conversational interludes when prompted. Ms. Reichardt creates a strong character study of two idealistic men wanting more than they are able to achieve and convey their eagerness with some lyrical imagery of a bygone era, reminiscent of Robert Altman's western, McCabe and Mrs. Miller. William Tyler supplies a melancholy guitar-strumming score than adds to the sensitive handling of this movie.But the film is so slowly paced, it could be a movie still. Not much happens in the first 45 minutes until their scheme (involving dear Elsie) takes flight. (Actually, First Fritter may have been a better title. Let's just say...imagine the townsfolk's reactions if our gourmet duo had invented a quiche or a crepe back in those days. Bon appétit!)First Cow would have been a terrific short film, but stretching it out to 3 times its length made this an excruciating journey for me. Its visual look impresses, but it is basically an exercise of style over substance that bores rather than soars. (I must said that I am in a minority with my review, as many critics have surprisingly named this movie on many of their best films list for 2020.). I found the film to be overrated, but well made; a appetizing presentation if slightly undercooked with too many large portions of dull. I just expected more. Waiter...check, s'il vous plaît! (GRADE: C+)"}, {"id": 70, "text": "Simple in structure, mindful in approach, unhurried in execution and restrained in presentation, First Cow is a story of survival, friendship &amp; enterprise success that doubles as a silent &amp; graceful rumination on the American dream, and captures it through the exploits of two outcasts who together come up with a formula to earn easy money in early 19th century America.Co-written &amp; directed by Kelly Reichardt, the story features an interesting setup but the snail-paced treatment, occasional meanderings &amp; overlong runtime can make it a difficult sit for some viewers. It does come full circle in the end but it takes a while to get to that point, not to mention that there are bits in the final print that it could've discarded entirely without hurting the main plot or character dynamics.The untainted land &amp; floral surroundings do fit the period setting Reichardt plans to transport us to. Overcast ambience adds its own touch but the night scenes are so poorly lit that it is near-impossible to make out what's going on the screen. And it is infuriating coz nearly half of the plot unfolds in the darkness. John Magaro &amp; Orion Lee deliver solid inputs, share a good camaraderie and are finely supported by the rest.Overall, First Cow is a quiet, reflective &amp; understated drama that's crafted with deft care, exudes a certain warmth, and is sprinkled with a delightful dose of wit but not everyone will be enamoured by it. Reichardt's humble direction &amp; sincere writing is evident but a better pace &amp; shorter runtime would've only enriched the experience. Just like the oily cakes, the script doesn't rely on a lot of ingredients yet the cookie that comes out in the end tastes a bit bland."}, {"id": 71, "text": "First Cow is my most anticipated movie of the year and when this was finally released today I was happy as it actually met with my expection and wasn't disappointed by the hype and this movie is one more proof that Kelly Reichardt is one of the best American filmmaker working today. She returns to the meditative style of her earlier works which has been absent in the last two movies and the result is astonishing, on up there with some of her finest works.Setting in 19th Century Oregon Territory the story follows two men: a skilled cook and Chinese immigrant businessman who formed unlikely friendship and decided to start a pastry business by stealing milk from the cow of the powerful landowner.While it is the longest film set to date for Reichardt, this might be the easiest film to digest. Reichardt movies are always about time &amp; place/ nature and it's habitats, and here she reconstructs ancient Oregon Territory with meticulous care and vividly portrayed the lives of Oregon's First People and gives a glimpse into an earliest form of capitalism taking place in a wild frontier while covering the growing friendship of two men which got interrupted when they saw an opportunity (Cow) and starting to chase the never fulfilling american dream. As always cinematography is mesmerising and peacefully capturing all powerful natural landscapes (forest, riverbank) and most of the moments of the movie without moving an inch. Direction from Reichardt is immersive and quietly unfold the drama, and as much as I saw it coming the ending still hard hitting and connecting to the opening it is contemplative. Two lead performances are terrifc, I especially enjoyed that from John Magaro and Orion Lee is a delight. Conversations and interactions between the two are very natural and added so much to the movie. There are also a lot of excellent actors in this too (Toby Jones being the biggest) including Lily Gladstone of Reichardt's own Certain Women."}, {"id": 72, "text": "It may be because of how I watched this - First Cow and Reichardt's films in general call for seeing it in a cinema if at all possible, she simply has that eye and ear for the minutest details and for the time she takes with every shot and many scenes to draw out the feeling of a place as well as for the actors to settle in, that you want to sink in to this film as a sensory experience, and instead I saw it at home where (I don't know about you but) I have too many distractions, not least of which the phone on a busy weekday - but it took me about fifteen to twenty minutes or so to get into the mood of this film. I wasn't sure if it might go anywhere really, as it follows the Cookie character as he is part of this fur trapping outfit (or almost on the outside, just barely with it, but enough to be in it without, say, getting into scraps/fights like the others), and it was frankly slow-going.But then the story, as much as it is, kicks in and it becomes this very simple tale of a friendship and what may be a fairly minor crime in the grand scheme of things - taking milk from a cow that isn't there's so they can make oily cakes, basically the 1820's rural Oregon equivalent of what I assume is Krispy Kreme - and how it gets tested and firms as they become more successful and gain the employ of the wealthiest man in the area (Toby Jones), who... also happens to own the cow that they've been milking. It's so engrossing because of its simplicity, the delicacy and yet the immediacy of the world that Reichardt has recreated for us. Like all the best period filmmakers, she and her collaborators bring this part of America/the Pacific North-west to life in almost a humble sort of way: it isn't ostentatious, it's just... what it was, and that makes it special.Aside from the performances themselves from these two, I have to wonder if the power of this film comes from something that maybe Reichardt was conscious of or maybe she wasn't, but this story makes me think about filmmaking itself, especially of the independent kind (or art creation in general). You have to assemble the right ingredients, and it most often takes some tenacity for it to all come together like it should (and how many times have you heard of someone on an indie movie shoot going guerilla or stealing a shot from some such and such a location they didn't have a permit for, etc). It feels like a story that Reichardt has lived at some point in her life, and she gets to deepen on the themes she worked in on Old Joy, also about a male friendship that gets tested by cirumstance.And what's fascinating is how because of the slow-burn-ness of the pacing, by the time it gets to the last half hour or final quarter, it has some real suspense as we wonder how our two great lawbreakers will get out of this as they get hunted down. It's not quite to the same level of poetic grungy-frontier depiction heights as a McCabe &amp; Mrs. Miller, but it has that same looseness and understanding about humanity, and if anything is less pessimistic about equality between people of different backgrounds and races. What happens after the end credits start to roll? I don't know, and I don't need to is the point - they've gotten through some s***, and they're together."}, {"id": 73, "text": "First Cow is my favorite movie of the year... thus far. I've been patiently waiting to catch this flick and it did not disappoint. Set during the 1820s, Oregon Territory, a crossroads of cultures and personalities, smack dab on that frontier life as the beaver trapping trade was beginning to exhaust, and the northwest was yet to be cracked open with gold fever and big timber dreams. This is just the kind of period piece post-western (yet proto-western) poetry I've grown to deeply enjoy. A sense of time and history and civilization's inevitable yet ever-ephemeral boots are resounding in this picture. A respectful portrayal of a couple of hearty fellows etching out a life on the unfettered frontier of yesterday, which has since transformed into the much fettered parking-lot of today. And even though I'm giving it my stamp of approval, I understand that this film will not be for everyone, it is a meditative, strolling thing, untroubled by romanticized gestures of western drama, but more so inspired by a messy, yet honest, proletarian perspective. Qualities of director Kelly Reichardt at her best. For if you are a fan of her laid-back man vs. self vs. nature narratives this will be your biscuit. Also of note, First Cow was filmed on the Sandy River and other locations near Portland, not too far from where I live now. Oh, and did I mention? There is a cow. 8/10"}, {"id": 74, "text": "Based on the novel The Half Life by Jonathan Raymond: In 1820 in the U.S. territory of Oregon, Cookie aka Otis Figowitz (John Magaro) is a chef from New England, travelling with fur trappers. He later hooks up with King-Lu (Orion Lee), a Chinese immigrant who is also a fugitive. The two succeed in selling biscuits whose ingredients include milk stolen from a cow that is owned by a neighbouring rich English settler, Chief Factor (Toby Jones).Director Kelly Reichardt (the film's co-writer along with Raymond) successfully uses her usual form of subtle story-telling with prolonged, extended scenes. While it can take a while to get used to this style, it pays off greatly in the film's last two-thirds as it did with another of Reichardt's gems, Meek's Cutoff (2010).Much of First Cow is simply the day-to-day events of people struggling to get by in difficult circumstances but once conflict and danger set in, the film turns into a great thriller. And Reichardt is greatly aided by beautiful cinematography by Christopher Blauvelt.As with Wendy and Lucy (2008), Reichardt shows concern for the under-class in a scene that greatly contrasts the classes. When Cookie and King-Lu are in the residence of Chief Factor, they hear a conversation between Factor and a local captain discussing the varying successes in disciplining (aka torturing) insubordinate workers in the presence of their peers. The privilege of even being able to have such a discussion is light-years from the life circumstances of the film's heroes and most of the film's other characters. The same can be said of further discussion between Factor and the captain regarding current fashions in Paris and London.First Cow is an outstanding film in a year with few films released in theatres. Even in a regular movie year, it would have still stood out. - dbamateurcritic"}, {"id": 75, "text": "Another movie that is glanced over by many people. This movie defiantly deserves a watch if you are a movie fan.The First Cow is about a skilled cook named Cookie (John Magaro) who travels with a group of fur trappers. He comes across a Chineses immigrant named King-Lu (Orion Lee) who has nothing so Cookie helps him get to a good place. Many months later they both meet at a bar and decide to start selling baked goods in town with a cow that has just came to the land but the cow is owned by Chief Factor (Toby Jones) and doesn't know about this yet.The First Cow was a movie that surprised me. I thought it was going to be your typical run of the mill indy movie that wasn't all that impressive. After I pressed the off button on the remote I was quite surprised with what the movie offered. There are many great things in this film. The story was really engaging. It was different than a typical story you find in movies now. The only problem I had with the story is the start to the film. It starts off in present day and then transitions into the time period that the movie is set in. The transition is really good but that scene didn't really need to be there. That was the only problem I had with the movie. The story was really well done. The characters were marvelously written and you felt for all of them. The structor of the story was also different. It did many things you just don't see anymore.The acting was also fantastic. John Magaro had the best performance in the film. His character was written really well, but without him I bet I wouldn't feel the way I did about the character. Orion Lee's character was more of a comedic guy but it didn't take away from the story. Sometimes in films now, the comedy feels like a kid who makes a joke at a funeral. This movie placed all of the jokes in the right place and none of them felt out of place. Toby Jones was also in this film. He does a lot of main stream movies like Jurassic World The Fallen Kingdom and Captain America The First Avenger but he still makes time for smaller movies like The Snowman and this. He didn't have a whole lot to do in this film but when he was in the film he ate it up. Overall the acting in this film was just magnificent.The cinematography was enticing to watch. They did a lot of lingering shots in this film. I know it sounds like it might be boring but it never was. Many films do lingering shots like 2001 A Space Odyssey, Unbreakable, and The Visit. Two of those movies were directed by M. Night Shyamalan which with his film, they make the movie even scarier. There were a few suspenseful scenes in the film but nothing on the level of those movies. They used the lingering shot so you could soak up the background. I love when movies do that. It shows how lived in the environment around the characters is. They also added a grainy texture to the picture. At the start they had normal picture but about five minutes in it changed to a more grainy picture. Sort of like what the First Man did. Thats what indicated at the start that this film took place in a different time period.The First Cow was a film I would recommend to anyone because of the great cinematography and the magnificent acting. The story is also something to take notes on."}, {"id": 76, "text": "I had heard about this movie by the buzz it created when it first came out early this year and decided to give it a go.The film is basically a slice of life period drama. It's realistic, it's slow, at times it's uninteresting, much like everyday life... in the 1800s. The characters are well established, the plot is well developed, dialogues are realistic. And much like real life it doesn't have a simple beginning or an ending. I understand that this was an intentional decision but after watching the film this leaves one with a feeling like having read some chapters from the middle of a book, but not the whole book itself.Even though I do want to pick up the story from where it left off and see where it goes, the movie as it is, is fulfiling nevertheless.Definitely worth watching."}, {"id": 77, "text": "If you enjoy reading my Spoiler-Free reviews, please follow my blog :)As you should know by now, I love watching films as blind as possible: no trailers and a minimum amount of information about the plot (or none at all). A24 became such a popular studio that I don't even need to know anything else about the movie, I'm always in. Universal, Paramount, Warner Bros., Disney, and Columbia might be the Big Five of film studios, but gradually people are starting to shift their attention to smaller, independent ones who deliver fewer movies per year, but a higher ratio of great films. This is also the very first movie I watch from Kelly Reichardt. The simplest of research will show everyone that her films are meant to heavily divide critics and audiences, so which side do I fall on this time?I'm not trying to patronize anyone, but First Cow belongs to that category of movies that audiences hate and critics love simply due to the slow pacing and minimalist story. Audiences will look at this flick as a dull, long, uneventful story, while critics will not only appreciate its remarkable technical attributes, but also the sweet, simple narrative that delivers quite a nice message about friendship, loyalty, but also greed and power. I'm not on either extreme, but I did enjoy this flick. Overall, I actually agree with each group's praises and criticisms.On one hand, this small story feels refreshing and pretty relaxing, having in mind Hollywood is packed with visually overwhelming blockbusters. It's a weird yet therapeutic couple of hours where the viewer follows two friends trying to get by. Cookie has the cooking abilities and smart ideas, while King-Lu uses his sense of opportunity to bring his friends' ideas to life. The chemistry between John Magaro and Orion Lee is phenomenal, making their characters' friendship feel incredibly authentic. The dialogues seem spontaneous and realistic. The editing (also performed by Reichardt) contains few cuts, letting the conversations flow naturally and the action to unravel at a slow, calm pace (in life, things don't arrive fast one after the other).On the other hand, the simplistic narrative is also rather predictable, and it loses the viewer's attention occasionally due to the constant dragging out of several sequences where nothing truly happens, story and/or character-wise. It's undoubtedly a slow-burn, nothing wrong with that, but it just isn't able to be effective throughout the entire runtime. Christopher Blauvelt's cinematography looks gorgeous, and William Tyler's subtle score is particularly pleasant, but visuals and atmosphere can't carry a screenplay for more than two hours. When the story gets going, it's definitely captivating, but it gets itself stuck during short periods spread throughout the whole film.In the end, Reichardt and Jon Raymond's well-written screenplay transmits a pretty kind message developed through two characters who need to find a way to make a living, to improve their lives. Their personalities are distinct, balancing their friendship with both their personal qualities and flaws. Reichardt picks up the co-written narrative and gives it an excellent direction, which apparently has given this duo great success. Hopefully, they'll keep making movies for everyone to enjoy, some more than others.All in all, First Cow possesses one of A24's trademarks: unconventional storytelling. Kelly Reichardt and Jon Raymond deliver a well-written screenplay, telling a minimalist story that will probably divide critics and audiences due to its purposefully slow pace and uneventful narrative. Reichardt, who also edited the film, takes a simple premise and gives it a realistic, grounded, layered direction characterized by genuine conversations and a true friendship. John Magaro and Orion Lee offer flawless performances, elevating their characters with emotionally palpable chemistry. Beautiful cinematography and a subtle score help the movie create a relaxing atmosphere different from the usual Hollywood flicks. Nevertheless, its runtime features dragged out moments, a predictable development story-wise, and while the film's message is quite sweet, it can become a bit of a tedious journey to experience. Overall, I recommend it to anyone who just wants to peacefully watch a simple movie with a great message without caring about how long it takes to reach the end.Rating: B"}, {"id": 78, "text": "Finding myself bored of reading the low-scoring reviews of their purported boredom whilst watching this film, I decided to give it a chance and judge for myself. Happily, I can say this is a thoroughly enjoyable representation of the era the filmmakers set out to re-create. Excellent work there! The pace allows one to be mentally immersed, a sense of time-travel to a previous world, a world which was here before you or I existed.Instead of relying on the cliched Wild West rough-and-tough shoot-'em-up manly man, the film focuses on two intellectual, creative entrepreneurs who, from absolutely nothing but their creativity and wit, made something people wanted, then needed, and paid good money for. Both from extremely different backgrounds, yet through mutual respect built a lasting friendship; something we all can learn a thing or two from. Flawed decision-making led to dire circumstances, but the compassion they had for other living beings, and an understanding of a human's need for relief from harsh conditions (in this instance, through delectable baked goods) is a refreshing reminder for us to be aware of other's needs.Despite the cries of boredom from some viewers, I found this art house piece from Michael Bay full of explosive bovine action: the scenes when our hoofed hero dashes headlong into mobs of knife-wielding thugs and thrashes them with her whip-tail; when our courageous cow leaps off of thatch-roofed structures and drops cow patties onto the masses of violent men; and especially the scene when First Cow uses her laser vision to disintegrate the covered wagons, shacks, outhouses, and feeding troughs of the human's makeshift village of idiots. True to form, Bay's direction in these action sequences is unsettling, confusing, yet ultimately satisfying.If you have even an inkling of desire to engage yourself in a film tackling the existential dilemmas of life on the western frontier, genuine themes of friendship and compassion, and large-scale napalm-like explosions all along the Oregon Trail, then this film comes highly recommended."}], "reviews_amount": 79}