{"name": "Brahms: The Boy II", "titleId": "tt09173418", "reviews": [{"id": 0, "text": "Why ruin a franchise with something we've seen a million times? The boy was good because there was no supernatural stuff going on. The very alive and crazy Brahm's coming out of the mirror with a creepy mask and a childlike voice was different, scary, and interesting. Doll from first movie ends up being alive and getting boys to do it's dirty work, not even a little bit. I repeat...WE HAVE ALREADY SEEN THIS A HUNDRED TIMES! Child's Play, Annabelle, all of their many unnecessary sequels...why make another one? Why ruin what was unique about this film? Oh, the movie was enough of a hit that you want to make more money with a sequel, but you've supposedly painted yourself in a corner with the ending of the last movie? How about using your imagination. I'm a writer. Here's an idea, off the top of my head. Brahms survives knife attack from first movie. Keeps hiding in the wall with his doll that he put back together. Family comes thinking house is abandoned. Instead of latching onto the boy in the family, he becomes obsessed with the mother, which goes along with his serial killer persona from the first movie. He starts with the manipulating with the doll again, the mother finds the woman from the first film to get the backstory, she comes back to the house to take care of the unfinished business with Brahms, and...go from there. Something like that is more in line with the first story, and if you have the imagination, you could do a lot with that premise to make it a good sequel. Just stick to the first one. Pretend these unnecessary sequels don't even exist. Sigh."}, {"id": 1, "text": "I don't see the horror behind this movie, it feels to me - at most - like a slow haunted doll thriller with the lack of scares. The story is limited, a traumatized family moves to guest house where their kid, Jude finds Brahms the doll in the near forest and things starts to get weird around the family for not following the doll rules.Nothing new here, the screenplay is dull and you can skip full minutes without losing any of the storyline, the character development is awful, the movie is well shot but with the lack of a strong plot it doesn't add much. I think it'd have been a very good film if it was summed into a short film because clearly if they wanted this to succeed as a feature film they could've gone through the trouble of coming up with an interesting new idea or at least a single twist in the story, I believe this movie is an effort and a chance gone wasted. over all it's watchable but won't be enjoyable unless you watch it in 2x speed."}, {"id": 2, "text": "There's a lot to consider when reviewing 'Brahms: The Boys 2'. It would be impossible to do so without going into spoilers for both films unfortunately, so please be warned. As its own film I actually kind of liked it. The problem is that it kind of ruins what made the first film so great. The first film had a great twist where we are led to believe the doll is evil the entire movie, when it reality it is someone in the walls controlling it. Even though that movie had other flaws, that's still a great twist. This movie says screw that the doll was possessed the entire time and was controlling the man in the walls.The film is riddled with dream sequences and needless, unearned jump-scares. The jump-scares were always going to be there, but I still feel dream sequences are the worst thing a horror film can do. They are so lazy and such a cheat. Having one is bad enough, but having multiple ones is inexcusable. The film is never overly scary. There is one sequence where Katie Holmes' character is behind the walls herself that is reasonably tense, but that's about it. The film works more in terms of being an interesting mystery. You know the original's twist and so what you are seeing is not making sense and you are asked to work out what is going on.I had forgotten what a terrific actor Ralph Ineson is. He isn't in a lot of scenes but when he is he is captivating to watch and listen to. I'm a little torn on this film and how I feel about it. It was probably better than I expected going in. I do wish they had kept the supernatural element out of it though, because to me that was the biggest strength of the original. There are a million possessed doll films out there already. All I do know though is that this series is in a better place than the 'Annabelle' one."}, {"id": 3, "text": "The first movie was an astonishing thriller realistically accomplished with just a china doll. Nothing supernatural, what so ever...The squel ruins the whole heritage which the first movie built of."}, {"id": 4, "text": "The story follows a boy who stops speaking after a hime invasion, and finds Brahms buried in the woods. In the original, we were led to believe that the doll was created for the Heelshires after they lost their son, who ended up living in the walls. This movie changes that, and takes away tbe elements that made the first movie good and creepy.This film is predictable with no real plot twist that catches you off guard. The kid is really good though, and if you enjoy movies with cute but creepy kids, then it's worth Redboxing for that.Katie Holmes is okay, the camera angles used in this film were not very flattering a lot of the times, and did not pull off what they were trying to do. Instead of making her look scared or in suspence, she just looked constipated.If you enjoyed the original, don't bother with this one. If you just want a movie with a creepy doll and kid, with a few cheap scares, then I guess you'll find it interesting."}, {"id": 5, "text": "I really dont know why this movie doesnt seem to be appealing to a lot of people I thought it was decent.The acting was good, it kept up a suspenseful atmosphere and managed to make sure you felt tense at all the right times. It was a continuation (obviously) of the boy and while I will admit I thought the first one was better this was still a decent sequel.My suggestion would be to give it a try at least, while i dont think this was a spectacular classic it was in my opinion an enjoyable watch and worth the time to give it a try."}, {"id": 6, "text": "This wasn't the best movie ever but it's an enjoyable hour and a half.There was nothing wrong with the film, it was well made, the acting was fine, had the jumps in all the right places. It did lack a little tension but it was fine. If you're a fan of the scary movie genre it's worth a watch."}, {"id": 7, "text": "Let me start by saying, I LOVED THE FIRST ONE! It was so fresh and creepy and that TWIST! OMG! 😲So I went in having high hopes for the sequel, especially since I saw it was same writer and director as the first one and they managed to attach Katie Holmes.But I had to say I was highly disappointed with this movie. It checks off all the boxes, but it's kind of slow and pretty predictable. The plot could have been ramped up more as there was no real danger and the scares were pretty generic. And the final twist / 3rd act felt lackluster, especially when you compare to the 3rd act of the original.Again, it's not a bad movie. You'll be entertained. It's just a missed opportunity in my opinion. The script needed a another pass."}, {"id": 8, "text": "Not a matter of weather it's as good as the original. It's seems that both movies are different enough to stand on their own. So I'm guessing the original made enough money to do a sequel, but the original's story does not give much wiggle room for a squeal, so they alter the purpose of the boy so that they can make more movies. It's a story change similar to Friday the 13th part one and part 2 (if you seen those movies, you'll understand ) As for the movie as a stand alone It takes a while to really get to the point where I'm scared. These ghost stories are starting to get lame. They need to go back to killing people without mercy. Not really sure if it's worth just watching Katie Holmes be cute but old for like 70 mins before something horrific happens."}, {"id": 9, "text": "The first film was fairly surprising imo though many hated the twist ending. I thought it worked rather well. This new film rewrites the story with the doll quite a bit and it will work with some and won't with many. The film has an overall similar feel to the first I. Ambience and scares and even gets a bit more demented at times. The cliches are there but if you know what you're getting into it shouldn't be surprising. Overall there are some interesting moments and enough creepiness to be decent enough."}, {"id": 10, "text": "It's a horror film about a doll. Once you accept that, it's hard to see how one could make a better one. Well acted, produced, directed and filmed."}, {"id": 11, "text": "Above average creepy atmospheric horror.Well acted and filmed."}, {"id": 12, "text": "Dont know where the bad reviews came from! The movie is actually good in terms of main characters structure and logic of the scenario. It also links very well to its prequel. Note that this was almost the only way to make a sequel to The Boy I, as the the prequel ended with no possibility to continue the same drama line. Worth trying, and not less than 6 any way."}, {"id": 13, "text": "I saw it last night ~ it was fun! Not the best I've seen but I liked it better then fantasy island and the turning ~ I wasn't expecting more then what I got. There were a few jumps but all in all I liked it."}, {"id": 14, "text": "This movie was much better than the score. Sure its not perfect, but it flows really well and keeps your interest throughout. If you like horror thrillers you will probably like this one.."}, {"id": 15, "text": "Brahms get 6 stars from me. It's a classic horror formula. Well acted and beautifully directed. There a couple jump scare moments and Brahms is such a handsome chap. If you're a fan of horror movies (it's my favorite genre) definitely go see Brahms: The Boy 2 in theaters so William Brent Bell can continue to make horrors! 1 👍🏻 And 1🤘🏻 Up"}, {"id": 16, "text": "I am not sure why the reviews are so bad on this one. If you saw the first and one enjoyed it this one is more of the same with a new story and new conclusion. A story about a creepy doll has been told a million times but The Boy series takes a different and some what okay approach to it."}, {"id": 17, "text": "Brahms the boy 2 2020 15 Director: William Brent Bell Starring: Katie Holmes, Owain Yeomun, Christopher Convery, Ralph Ineson, Anjali Jay etcOverall rating 84/100 Brahms the boy 2 is based on a young boy called Jude ( Christopher Convery) who refuses to speak after witnessing his mum being beaten from a home burglary. He finds a doll in the woods that he connects and bonds with, but after a while a bond becomes an obsession and strange events are happening all linking back to Brahms. The boy 2 surprised me at how good it was. Great acting and building of tension and much more so lets talk about this.First of all I thought the cinematography and set pieces were great. The films visuals were so intricate and detailed it was really great. They really made you pay attention to the surrounding of the house. And just simple things like the doll blinking, moving its head or smiling were really unsettling and done really well. And the set pieces were fantastic as well. There were some really good locations that were perfect playing grounds for horror. Whether it was the forest, the normal house or the house where boy lived, they had a few good locations instead of sticking to one which was great.They also had a fantastic use of tension throughout and well executed Jumpscares. This film-built tension throughout excellently. As the film progressed, I got more and more tense and on the edge of my seat as the events that were happening got more and more unsettling, I rarely feel like this with horror movie, so this shows how good the film was. There was also some very well executed Jumpscares they managed to balance predictable Jumpscares that you didn't know when they were going to happen and Jumpscares that genuinely took me by surprise and startled me which was very entertaining.My only negatives would be the films lack of plot and rushed beginning. This wasn't the films main priority so I get that they didn't need to deep of a plot as they wanted to build tension over an extended period of time but it would have been nice if they had explored certain things with the plot a little bit more deeply. But my biggest issue for me was the rushed beginning. They set up a really interesting family dynamic rarely seen within horrors but it then very quickly went to them going to the woods and finding the doll. So it would have been better if the film was slightly longer so they could flesh the characters out a bit more at the beginning.My next two positives would be the performances, and the chemistry between the characters making them not the usual dumb character in a horror. Everyone in this film did very good performances. Therefore making all there fear much more believable and just genuinely making the film better as you could invest in the characters more. But the obvious key standouts would be Katie Holmes and Christopher Convery who were both fantastic. The family dynamic and chemistry between the characters was also very believable making you genuinely connect with the characters which is sadly very rare with horrors. It was also a breath of fresh air to have the characters actually think and make good decision throughout. There was no searching through rooms because you hear a sound or anything like that. Brahms followed Jude everywhere, so this helped and the mum only went in the house from the first film when she wanted to rescue her son.My final two positives would be the films attention to detail with social issues involving a traumatic experience and the ending. The film actually tackled some interesting social issues about how children cope with trauma, In this case it was Jude refusing to talk which is how a lot of children cope with these things, this was well explored and a really interesting element to the movie, the ending was also incredibly satisfying, when everything came together and the final showdown with Brahms happened in the house from the first film all the tension and fear that had been built throughout exploded into an action packed and frightening finale where they did some interesting things with Brahms leaving it open to a sequelOverall, despite a couple of issues with the plot and pacing, Brahms the boy 2 was a surprisingly good movie. That built tension very well, tackled interesting issues and had great performances of the year. Considering the lack of competition with the grudge and the turning, the boy 2 is the best horror of the year so far."}, {"id": 18, "text": "I'm givingthis a 6 for, will wait for it 5 minutes before the ending.What crazed mind thought of that!?Bizarrely, hubby like it and it scared him. He didn't see the first movie. He might think differently.The movie is generic. Seen a million times before. Having seen the first one, I was surprised when it was obvious the doll was indeed moving itself. WTH?Katie Holmes tries hard. Camera angles indeed were not flattering as another reviewer mentioned. So much so, I had to look up her birthdate and was shocked to see she was born the same year (1978) as her movie husband. I hate when actors do awful things to their faces. It's distracting on a big screen, but it's distracting, too, when someone isn't aging well. Maybe subtle age-appropriate changes are the best way?But I digress.Anyway, the somewhat shocking reveal was, well shocking.What crazed mind? That disgusting sight is still freaking me out."}, {"id": 19, "text": "Decent horror movie.. This is way above a 4 rating. I can't believe people would rate this that low. Ridiculous."}, {"id": 20, "text": "Brahms: The Boy II: The doll is back and this time it has supernatural powers! A family traumatised by a home invasion move to the Heelshire estate. The son Jude finds the Boy doll buried and soon becomes attached to it. But the Boy can move and influence Jude, it also has poltergeist powers. Some good shock/jump scenes as well as sequences of genuine horror which are really disturbing. The parents should have heeded the dog who snarled at the doll. A bit unevenly paced in the middle section. Directed by William Brent Bell from a screenplay by Stacey Menear. 6/10."}, {"id": 21, "text": "What's the point of sequels? Isn't it to explore the movie more and explain it further and give the answers to the wondering audiences? By the viewpoint of the producers of this movie, NOOO!!! It's to confuse you more and make you wonder what the hell you've watched.Wasn't the doll lifeless and everything was actually orchestrated by the man called brahams living in the walls? That was the twist as far as i can remember. No the doll suddenly decided to be completely supernatural in this part, and no it was not meant to be psychological, the end almost confirmed the doll is supernatural. And this is the biggest hole in the movie. It was confusing all the time, the doll was moving its eyes and smiles, that was creepy but it is not what this doll was supposed to be! And the story had an open end, Please there is no need for a third part, this movie have died back in 2015 and remained there, this wasn't even a movie, it's cash grab."}, {"id": 22, "text": "Not a bad movie. It has enough to keep you entertained, the acting is good and the there's enough mystery to keep you guessing. I'd definitely recommend it. It isn't a horror but more of a spooky drama."}, {"id": 23, "text": "After seeing the horrible The Grudge, the overly feminist and dull Gretel and Hansel and the comedy-thriller-revenge horror Fantasy Island being released in just the first two months of 2020, one could think: things could not be going worse for the horror genre. But Brahms: the boy 2 proves it can."}, {"id": 24, "text": "Brahms: The Boy II (2020) sequel of The boy has some good moments but nothing will blow your mind. It's just another doll movie,the jumpscares are good but most of them are predictable, not only the jumpscares even a lot of acts are. The movie felt rushed but i was okay with that because a movie like that should not be slow because it has no reason to do that. Actors are good especially the mom &amp; Jude. Other than that it's a fun movie with an acceptable ending( not that good, not that bad) + an interesting final scene!"}, {"id": 25, "text": "Have it's moments. Could've been a little more creative with the plot. Overall a nice date night film. Writers need to add more creativity in plot for and if it's going to be a third."}, {"id": 26, "text": "Brahms: The Boy II takes forward the story of the creepy porcelain doll, seen in The Boy(2016). Liza(Katie Holmes), her husband Sean(Owain Yeoman) &amp; their son Jude(Christopher Convery), move into a house next to the Heelshire Mansion. Jude befriends a porcelain yet realistic looking doll, called Brahms.Brahms: The Boy II is a below average film. It totally disregards everything that made The Boy(2016) a memorable horror/thriller movie. Returning director William Brent Bell should not have made this film, in the first place. If it was studio pressure, they should have only made this movie, if the script was as unique as its predecessor. Katie Holmes is great as Liza. Owain Yeoman is brilliant as Sean. Christopher Convery is a complete letdown, as Jude. Ralph Ineson is effective as Joseph. Brahms: The Boy II is not at all worth watching. Give this complete disappointment a miss, and re-watch the first one instead."}, {"id": 27, "text": "I can't understand the low ratings of this film, I loved the first one and was really looking forward to watching this film, and I wasn't disappointed, in fact I think it's better than the original. It's a slow burn but definitely worth sticking with it, and the twist at the end, I didn't see that coming"}, {"id": 28, "text": "Old house, family that moves, doll that gets possessed. The story is tired and you know it. However, it has to be said that this horror movie was the best one that has been released in 2020 so far. Of course, there is nothing new in this sense, but fans of the genre are already well served. Relatively yet some twists and there are definitely worse Demon Puppet Horror Movies..."}, {"id": 29, "text": " . . . NOT your doll! Jude's mother splits hairs after weeks of setting a place at her dinner table complete with Real People food for her pampered son's pampered doll, BRAHMS: THE BOY, JR. This toy is so stupid that he does his best tricks FOR FREE, when NOBODY is looking! Instead of hiring an agent and headlining a Las Vegas gig during which he overturns solid wood furniture and other heavy objects without lifting a finger, this diminutive android (as revealed during the lame finale) prefers to be buried with the termites in the woods or chucked into fiery furnaces. This porcelain-biological hybrid is pictured with literal spit for brains (or something close to it). BRAHMS: THE BOY, JR.'s one big dream is to hunker down and hole up in a ratty old fire trap which looks like it's not even wired for three-prong plugs! This picture might play well among the coffin crowd, but beyond THE ADDAMS FAMILY it's not going to pack many fannies (or even Raggedy Annies) into theater seats!"}, {"id": 30, "text": "The cast is game and the film is nicely shot, and has plenty of production value. What it lacks is any sort of real tension, at all. It also appears to have absolutely every second of footage they shot, in it, to keep the running time from being even shorter. The cast and the audience deserve better."}, {"id": 31, "text": "Not sure what all these bad revews are all about and good thing I never pay any mind to them because they are usually wrong. I saw the first one and was totally let down by the usual, and then came this second outing and I was glued to the movei scree. Great story followed by some good organic frights! Run, don't walk to go see this gem because its that good. Kudos to the filmmakers. I a die hard horror fan and love to see fresh takes of already conventional formulas. This film left me totally satisfied. I hope there is a third installment."}, {"id": 32, "text": "This is a stand alone sequel that features a hot Katie Holmes and a story centering around a home invasion and a creepy boy doll that could be Annabelle's rival in top creepy doll in movie history. Make sure you see it in the theaters as it's being killed by Sonic at the box office this weekend."}, {"id": 33, "text": "I liked this one better than the first one to be honest. They were both good but enjoyed this one better. The cast was better as well. They ended it where it's possible to make another. I hope they do."}, {"id": 34, "text": "Don't watch the movie if you expect the Man-Child Brahms, he isn't there. Our precious boy has been completely disregarded off the movie entirely.So, it's just basically just one kid getting bullied by a supposedly possessed doll. Ordering him around and what not.In the first movie it wasn't like that! It was just some man moving his 'toy doll' around. Making sure that Greta was completely losing her mind, forcing her to think the doll was possessed by the spirit of the young Brahms who 'died' in the fire. That was a great idea from start to finish.The second one however, was completely off the scales of origins. It didn't even mention how Brahms dealt with Greta escaping with Malcolm. They just mentioned that he just ended his own life, the directors and writers completely throwing our precious man-by Brahms.I don't even think this movie deserves any ratings at all to be honest, completely throwing the crazy man manipulating those who enters the house out the window! It's boring! It's just another 'Annabelle' movie where the doll had 'supernatural' powers from the start."}, {"id": 35, "text": "At one point I was like  Is something going to happend ? . I asked myself that 1 hour into the movie knowing they had only 25 minutes left to finished with something that makes sens. The first movie really had an impact on me because I was not expecting the end at all and I was hoping to have the same feeling about this one. Or at least something that make sens with the end of the previous one. But I feel like they used the easy way out with that predictable ending."}, {"id": 36, "text": "The Boy II isn't really a movie anybody asked for. Whilst it's not a flat out awful movie. it's painfully generic and dull and more lifeless than a dead corpse.It has some moments of atmosphere but usually it's filled with annoying jump scares which doesn't work whatsoever. The film uses every trick in the book and it never succeeds.The performances aren't that good. Everyone tries their best especially Katie Holmes. Ralph Ineson is the most talented of the lot but it's one of those films where even if you got the most talented of actors, they wouldn't be able to save it. It's only 86 minutes (including credits) and I think the story feels fine without being stretched out, but at the same time, not much decent character development happens. The final act is really bad thoughThat being said I did have a lot of fun and it's kinda enjoyable in a so bad, it's good way. It's not a terrible film, it actually does try to be good even if it doesnt feel like it.But it's seriously not one to watch. I'm hoping The Invisible Man and The Hunt can redeem the horror genre."}, {"id": 37, "text": "4.3? That seems much to low to me. I enjoyed it. It's not too much gore. Fun to see Katie Holmes in a haunted doll movie. What's not to like. Worth a watch."}, {"id": 38, "text": "Everything was going perfect. Especially, when we know that the doll is not controlled by human, but the doll controls! I loved it. I can't say It's masterpiece or can be compared to It chapter two but It's still a good movie. But to be honest, I didn't like the end. You could've made it in another way, like something tragedy happens but It finally ends! So, anyways, I loved it, as I said, It's still better than the stupid, completely not understandable movies like Evil dead and Doctor sleep (I still can't understand why they're so overrated?)"}, {"id": 39, "text": "I remember watching The Boy (2016) and thinking, 'hey, alright-that's not a half bad concept' when it was revealed that there was no supernatural element whatsoever, just a grown man with next-level babytalk scurrying through the walls. Watching them ignore a perfectly good, unique concept in favor of making Brahms: The Boy II into Scary Doll Movie #5987 was such a bizarre letdown that I'm still having a hard time wrapping my head around it. Scary dolls have been done. We've all seen that movie before in countless different packages. Why would you undo such a great set-up established by the first movie just to tell us a story we've heard already?As far as the acting and the technical aspects, it was all fairly unremarkable. Christopher Convery's a really creepy kid, Katie Holmes is a stressed out mom of the creepy kid, Owain Yeoman is The Supportive but Unhelpful Dad(tm). Typical horror stuff. There's nothing that stands out about anybody's performance, but that's really only due to the fact that they're all stuck in the most generic roles possible. There's some obligatory spooky musical cues and intense doll shots that were to be expected. The usual, the usual, the usual. It's just too bad that anything that was unique or engaging about the first film is missing from this one. I wouldn't necessarily call Brahms: The Boy II a horrible movie, it's just one that everybody's seen before."}, {"id": 40, "text": "This part is so disappointing! It destroyed the first season! It was no need to put SUPERNATURAL stuff!! We're bored from this please!"}, {"id": 41, "text": "To be honest I liked it, predictable, yes, but also slow burn haunted doll element thas kinda fun still"}, {"id": 42, "text": "It had already been four years ago when a little film entitled The Boy (MY REVIEW) came out and became a moderate sleeper hit. This year, director William Brent Bell and writer Stacey Menear join forces again to come up with a new horror adventure featuring the titular the haunted porcelain boy doll Brahms.Severely traumatized by a burglary in their London home, Liza (Katie Holmes) was taken on a long respite in a countryside rest house by her husband Sean (Owain Yeoman). Their son Jude (Christopher Convery), who witnessed the violent assault on his mother, was so shocked that he totally did not talk to anyone anymore after the incident. He could only communicate by writing on his sketchbook.One day, the couple wander from their vacation home to the neighboring abandoned mansion left behind by the Heelshire family. While outside, Jude dug up a porcelain boy doll out from the forest floor, calling him Brahms. From then on, Jude would be obsessed with Brahms, obeying the rules he said the doll set and expecting even his parents to obey them. When an incredulous Liza began to disregard the rules, sinister things begin to happen.Unlike the first movie with the all unknown cast, there was a well-known actress playing the female lead here, and that was Katie Holmes. While she still had film projects over the recent years, she had not been in any popular film ever since she played Rachel Dawes in Batman Begins (2005). She was the target of most of the jump scares and psychological torture throughout the film, and she brought us along her harrowing ride.Owain Yeoman played the supportive and patient husband Sean. Conveniently he was usually absent when something strange happens to Liza, lending doubts to her precarious sanity. Christopher Convery played a very creepy Jude, especially in that grim silent mode whenever Brahms possessed him. Ralph Ineson played Joseph, the mysterious watchman of the grounds, who turned out to know more about things than he was letting on at first (but of course he did).This film was as much about mental health and post-traumatic stress as it was about a good scare. Since Brahms was inanimate, much of the scares were reliant on the indicative musical score, with all those sudden crescendos which were designed to startle. The scene which had me at the edge of my seat was that rough play Jude had with his bully cousin. Even if I already sort of knew what was going to happen, but I still could not bear to watch it play out.While the creep factor was still there overall, this followed a more typical and predictable story line than the first. 5/10."}, {"id": 43, "text": "I was very skeptical when I first saw that they were even making a sequel. The first one the twist was decent but really made me not like the concept. After finally watching this sequel I am glad they actually brought the horror aspect to the movie that the original lacked. They should have just left the original as a suspense thriller and not horror."}, {"id": 44, "text": "Great sequel better than i thought it was going to be as i really couldn't think were they could take the story after the first one, but they did a good job with a creepy ( not so scary ) film and maybe a third film could be in the pipeline. Watch it you'll enjoy It"}, {"id": 45, "text": "It sucks. The plot sucks. Katie Holmes sucks. The setting sucks. The fact that the guy from the man in the high castle is not in the cast sucks. The dog is kinda lame. The plot twist sucks.10/10."}, {"id": 46, "text": "The first movie was not a bad movie . The element of surprise was even pretty good . But this one ...?!?! So boring , so predictable and so bad . So so bad ..."}, {"id": 47, "text": "The first movie may not be the greatest horror film ever made, but it was wise and kind of shocking...who could expect that it was not the doll the evil one, but the kid (a grown up psycho behind the walls) ? That plot was unexpected and maybe never seen before in a horror movie with a doll, now that's what I mostly remember from The Boy, so..are you telling me that this sequel regrets that awesome plot by flushing it down the toilet so they can make an usual movie about a god damn doll? That's the whole mistake, they had gold in their hands and decided to use it with clichés and normal stuff of a normal horror movie."}, {"id": 48, "text": "Unoriginal paint by numbers amercian horror. Desparately trying to be English, but fails miserably. This is not an exercise in creative and imaginative film making, its yet another cynical attempt to part you from your money. Stop giving crap like this the oxygen it desires and instead support original and creative film makers."}, {"id": 49, "text": "I actually can't believe I paid money to see this. The first film was ok. Moderate creep factor, fairly decent twist. But this film..... There were no scares here. None. Not one. No twists or turns. It all seemed pointless. I don't know how else to describe this film. Normally I would recommend you watch a film and make your own mind up no matter how bad. But I can't do that here. Please don't waste your time."}, {"id": 50, "text": "Nothing really happens I need more drama more peaks this film was so lacking I think the only scary thing about this film is the way his bedroom is decorated I mean I couldn't sleep in there"}, {"id": 51, "text": "Lacks everything the original had.A very weak and predictable story. No suspense, no atmosphere like the first one.Pretty amazing the doll's clothing was so intact and clean after being in the ground for so long. That's when I thought, This is going to be pretty bad. And it is."}, {"id": 52, "text": "This movie sadly has no originality.. It's like they have copied the same or similar story from another movie.. I have to say it was very much predictable. By the way part 2, does not seem to have any continuation from part one. In part one when the doll was broken, it was simply a ceramic doll and was hollow inside, whereas in part two, the doll was possessed by an evil ghost and was able to move around and when the doll was broken, there was a skull and flesh inside the doll. I can only give it 4* for no originality and for not keeping the same continuation from part 1."}, {"id": 53, "text": "Me and my friends were literally thinking the whole movie that the boy grahms who is hiding inside the walls will come out and kill everyone anytime soon but naa it was that supernatural thingy...they absolutely ruined the movie....after i saw the first movie i thought it was a little interesting and creepy that a man child has been living inside the walls the whole time but this movie just ruined it...."}, {"id": 54, "text": "When movies are successful enough they now generate sequels. With any luck they go even further and create a franchise, a series of movies made for cheap that generate tons of money for the film studios releasing them. This is great for fans of a movie and even better when the movie is a solid flick. But most second features in a series end up not quite as good as the original. Such is the case with BRAHMS: THE BOY II. If you remember the first film it involved a young woman hired by an elderly couple to watch their son while they went on vacation. Except when she got there the little boy turned out to be a doll. Eventually we learned that there actually was a young boy who had been scarred during a fire now living in the walls wearing a porcelain mask. As the film ended we saw he survived a stabbing by our heroine and was repairing the doll she shattered. The sequel kicks off with mother Liza (Katy Holmes) and her young son Jude (Christopher Convery) surviving a home invasion, leaving both of them traumatized with Jude now not speaking but writing anything he wants to say. Thinking a new setting will help they move to the Heelshires' property with husband/father Sean (Owain Yeoman). This is the property from the first film but not the main house, instead still on the grounds. Once they move in strange things begin to happen. Jude finds Brahms, the doll, buried on the property. Taking him home and cleaning him up his attachment to Brahms deepens daily. He wants Brahms to eat with them, to be served a plate of food. Liz can hear voices coming from Jude's room. Out of the corner of her eye she can see someone run by, thinking it is Jude, only to have Jude come up behind her. Is something actually taking place of is this Liz' method of dealing with the trauma of the break in? Also disturbing is the presence of a caretaker on the grounds named Joseph (Ralph Ineson). Walking the grounds with his shotgun, accompanied by his dog, Joseph talks of things from the past but seems to be hiding something. A shadowy figure, could he be behind some of the things taking place? Eventually Jude finds the old mansion from the first film, guided there by Brahms. Liz finds him and takes him home but not before the feeling of something strange going on there. As things begin to escalate at home, the feeling of security the relocation was supposed to bring declines as does the thought that Brahms is a good way for Jude to communicate. Before decisions can be made by both parents, their options become limited. Is it Liz? Jude? Or is Brahms really making it happen? The movie does a decent job of keeping the tension at peak level throughout. Knowing what we do of the first film we're aware of the dangers that this family is facing. At least we think we do. But this becomes part of the issue, we already know that Brahms survived the first film. But do we? Or have they chosen a different path where Brahms is nowhere to be found and some new evil force is making things happen? Or was Brahms the doll really the cause of everything in both films? All of these options are on the table before finally being revealed. I've always said the sign of a good actor is when you believe they are the character they are playing and don't notice that this is acting. All three of the main actors here do a great job. Holmes has developed into an actress that deserves more and better roles. She's convincing here as Liz and you are concerned for her and the safety of her family. Convery, for his young age and playing most of the film in silence, is perfect as the wide eyed innocent whose life is being taken over. And Yeoman shows again how good he is, something I thought back when he was featured in THE MENTALISTS TV series. So does the film work as a sequel? Yes and no. It is a solid story, the performances are well done and it looks good. But it doesn't have the same impact as the first film did and that film didn't feel worthy of a sequel. Taken on its own the film might be better, without the baggage of the first film. If you go in that way the odds are you'll enjoy this one better than someone who saw that film. It's good for a night's rental and entertainment but I don't see this one moving forward into a complete franchise. Better to stop here."}, {"id": 55, "text": "Bad Ronald anyone?? I liked Bad Ronald as a kid but it wasn't horror to me; it was just unsettling and creepy. Which is why I was not happy when the twist occurred in the first one. I wanted a scary Supernatural story. Not some backwoods-esque, overgrown, boy/man inside a wall....again. (Plus, I can just turn on the Crime Channel for that). He even looked like something out of the People under the Stairs even though his parents were proper and elegant. However, if you didn't see Bad Ronald I can see why you were pleasantly surprised. And using the Boy as a way for him to still feel a part of the family was a good, weird, idea. But to me it was more of a bizarre Criminal Minds episode rather than a Horror movie.Which is why I was happy about where this production was going. I do think it was done well and the acting was good. But yes it was slow and not a lot happened. It could have used more scares, atmosphere, and a kill or two. But I enjoyed it. Including the back story. It kind of reminded me of a 1970's horror back before things got gory. The ending was predictable but most horror movies end that way more often than not. Its rare to have a unique ending this far into the game. It's just something we have to accept with the genre.My suggestion is rent it from Red Box or your Library once they open again. Don't pay full price if you don't want another Supernatural Doll movie. I happen to love them but I get why not everyone does."}, {"id": 56, "text": "Good horror movie having sufficient materials to bind you till the end with horror, thrill and suspense. It is sequel to The Boy (2016) which also was a good horror. Compare to previous we here now gets the revealing secret of the ghost doll and realising its power whereas in last part there was horror of the big and mysterious house. Acting is perfect by all, especially Catie Holmes (mother) and the boy. Background score is well and fearful while we are seeing credits. Also another sequel is waiting. Must watchable for horror lovers and for them who already seen first part. Here again hopeless low rating for such good and high ratings deserve movie. It seems IMDB loosing its standard day by day as new foolish viewers are joining recently. Leave aside this, if you are horror lovers then must watch you will definately enjoy."}, {"id": 57, "text": "Chilly, frightening, good acting albeit with a slightly predictable plot. Better than a lot of other shlock I've seen. Basic scary fun."}, {"id": 58, "text": "I thought it was just as good as the first one and agree with the other reviewer that it was well acted, produced, directed and filmed, so not sure the basis for low ratings. If you liked the first one, I would recommend watching this one."}, {"id": 59, "text": "Is it the best i have ever seen? No, definitely not. I would say it's a 5/10. You hopefully won't regret seeing it at least, gives you something to watch while you are in quarantaine."}, {"id": 60, "text": "I dont normally review any films but this one impresses me. Try it. New storyline but it might requires you to watch the first one before this one."}, {"id": 61, "text": "The first movie was a good horror with twists and a creepy doll and atmosphere. This has none of that. It's just a build up to absolutely nothing. Where you feel the movie should start it ends. Worst movie I've seen at the cinema and I've seen a lot of cheap Blumhouse movies. Wish I'd waited for the digital version."}, {"id": 62, "text": "We're just going to go ahead and take the continuity from the previous movie and throw it right out the window and do something else instead for the sake of making future movies.That's what the synopsis of this movie should've been.I can't even begin to get into my genuine thoughts of this movie.Just know that I HATED it in its entirety."}, {"id": 63, "text": "This absolutely ruined the first movie. I'm not the type to give spoilers but the ending of the first movie made it more of a messed-up-thriller and less of a ghost or ghoul movie. The second movie was such a lame ending, the last 20 or so minutes were terrible."}, {"id": 64, "text": "Well, let me start saying that i did like the first one. Everything that you tought it was, it really wasn't. The plot twist made it even more interesting.In this one, you start thinking that the background of the movie still represent what you learned from the first one, but just in the final minutes you realize that the first one was a lie and the reality is that the originality from it didn't existed, making this movie a full cliché. I wasted almost two hours watching another possesed doll movie, when it was supposed to be everything but that. The uniqueness of the first one is erased with this sequel.AWFUL."}, {"id": 65, "text": "Brahms:In 2020 version, the porcelain doll (Brahms) is evil, unlike 2016 version. Everything gave the audience a sign that it's always been the doll. From the beginning when a whisper was calling Jude to find the doll or until the end Brahms and Jude became one. One more thing about the rules, Brahms set one new rule - No.11: Jude has to be with Brahms always and forever . So obvious Brahms was sinister.Brahms' new family:In 2016 version, the target of Brahms was a nanny (Greta), in 2020 version was a boy (Jude). This time Jude was traumatised by a night that he and his mother faced a burglary, after that he had a selective mutism. Brahms not only wanted a company like Greta but a family, to find someone that it will never have to be apart. TBH, Jude perfectly matched the doll, like his innocent face, and especially he and Brahms were sitting on the couch with same grey suits.Frightening and intense scenes:This time jump-scares were showed more than 2016 version. The director grasped good chances to scare the audience"}, {"id": 66, "text": "This is a horror movie but turns out to be an unbearable spectacle of a dysfunctional boy. This boy really riles me up throughout the movie which does not mean it is not good. It makes me stick up to the movie to know what happens to that  boy. The cinematography is good but there is so much plot holes but it is understandable in order to increase the stake of the scene. It's not amazing but not bad as it still connects with the original movie and left me want to see a different kind of ending and where the writer wants us to go through. Thanks for the read."}, {"id": 67, "text": "Possibly the worst film I have ever had the misfortune to sit through.Allow me to qualify....Zero continuity from the first, well crafted, genuinely interesting, ultimately non-supernatural story of the original film.Weird casting! Why we're the wives of the English brothers, American? No mention of that in the story.No threat or horror. A table gets turned over. A boy writes down spooky messages from a doll that don't get backed up (ok, a dog dies). The parents do NOTHING to stop the obvious weird behaviour of their child! Take the doll away, throw it in the bin, smash it in front of him.....no parental guidance at all! It's helping him, Bruce he doesn't talk....NO! It's making him act weirder than he did before! Bin it!!!While we're on the not talking....the parents hear him talk to the doll through the door, then go in to the room, and he clams up again and goes back to writing notes. They decide to leave him to it, and then hug each other in joy when they leave the room!! NO!!!! You haven't spoken to your own parents for 6 months....they hear you talking to a doll you dug up in some woods you've never been to, you acknowledge that you were talking to said doll, but then won't put your, obviously distraught, parents out of their misery by saying anything to them afterwards!? I wouldn't be hugging each other! I'd be furious, upset, and, again, smashing the doll to tiny fragments!!Please don't get me started on Old Crazy Joe!Forced into this tripe from start to finish, is every horror movie trope since the 50's, including dialogue lifted verbatim from other, far superior films......and then there's the ending....I mean.....well.....Did someone really sit there and present this proudly to someone else, who then, in turn, said....Well this ending, I mean, you've outdone yourself!! Allow me to throw some real money at it, so we can get someone with real gravitas to play a major role....really pull in the crowds....Margaret...can you get that agent on the phone please? The one who looks after the old Dawson's Creek actors. I've got a real winner hereI could go on, but really...is there any point?Avoid. Do me a favour, and just avoid, before you become as glassy eyed and pointless as Brahms."}, {"id": 68, "text": "This story will largely annoy you. It's long on irritating plot devices and short on good scares. It relies on weak parents and a stupid little kid who chooses to speak through a notepad after a not-so-convincing-trauma to drive the story. Yes I said it the kid is stupid and annoying and it gets tiresome that anything goes so long as an irritating little kid is doing it and his overly indulgent weak parents allow it.A quack weighs in saying the doll is good at one point and then later saying perhaps the doll is bad. Nobody can put 2 and 2 together and of course we get the Dad doesn't believe the Mom subplot for as long as they can lean on that trusty old trope as a writer's crutch.My god someone be an adult in this movie. No, being an adult doesn't mean making a million excuses for stuff it means having some enlightened compassion but putting your damn foot down when the time comes."}, {"id": 69, "text": "The story line is completely different. Not a real sequel. Add another doll that try's to kill a family to thr books"}, {"id": 70, "text": "I am deeply disappointed in this film. If this was a stand alone, I do not think I would be as upset as I am. But this is supposed to be a sequel to a story. Only it feels like the writers read the script for the first once then based this one completely off of memory in the worst way possible. The Boy had established the doll as to be just that, a doll. The real horror was the man who lived in the walls. The Boy II completely spits on that like it never happened. Instead they just water everything down to another boring haunted doll story."}, {"id": 71, "text": "If you like the original don't do it. It's a typical Katie Holmes disaster. The boy was an original film with unique premise. the boy ll screams of cash cow. Just another haunted doll movie with bad acting. The actor who played Will was terrible and the sort of thing you'd expect of a low budget B movie. The storyline was shoe horned in, in an attempt to drag as many sequels out of it as possible. A really bad movie with a typical sequel bate ending"}, {"id": 72, "text": "I loved the first one because of the twist that it wasn't actually a ghost, it was an actual man in the walls. And now the second movie is saying it actually is about ghosts? Ruined it completely"}, {"id": 73, "text": "This movie is so much worse than the first one, which is a shame... The first one wasn't an amazing movie, but at least had a more decent script. I would avoid unless is the only thing available on a rainy saturday night and you like the horror genre."}, {"id": 74, "text": "Me who is a big fan of the 1st One had big expectations of the 2nd movie. But when I finished watching it, I wanted to erase it from my memory. 1st off: This movie completely ignores the 1st 1. How can the Doll be possesed if it wasn't even possesed in the 1st? Also it really doesn't even show anything which points to the 1st 1. Nothing, NOTHING. 2nd: It's not even scary or confusing. It has cheap jumpscares and it doesn't try to make it confusing for the viewer. My final thoughts? Total Piece of Garbage which should have remained behind the walls. Don't watch it."}, {"id": 75, "text": "This sequel was absolutely unnecessary and just terrible. Stick to the first one where the creepiness is about a man not just the doll. The original had a much better script. They could've made this movie about the doll being possessed by Hillshire's son after he was killed. But no they tried making this movie like Christine whose origins are unknown. But even in the movie version of Christine we see it kill the factory worker as the first victim not much back story but better than just seeing newspaper headlines saying the same thing over and over again. There was no explanation or point of origin. This whole movie was useless as a sequel or even a stand alone movie."}, {"id": 76, "text": "I actually enjoyed this movie. Strong acting particularly from Katie Holmes. Never seen the first movie so was happy to watch this as a stand alone. Good story line and not overly long. But come on guys. Why waste it with such a cliched ending. Can we for once end a horror movie properly. None of this leave it for us to make a sequel again and again. Such a spoiler. They could have given it a proper sassy ending. Give it a go if you can be bothered with the end. The rest of the movie I'd have given a strong 7 nearing onto an 8 had they sorted the end. Disappointed"}, {"id": 77, "text": "But he didn't. He was shown in the movie several times to turn his head. When the father, Sean. was coming to finish him off, you would have thought he would have fought for his life and then the son,Jude,burning him up. This was a bad sequel that leaves you wanting way more.......Even Katie Holmes can't rescue it!"}, {"id": 78, "text": "Garbage. Film undoes the twist at the end of the first film. Makes no sense given the events of the previous film. Don't bother."}, {"id": 79, "text": "Garbage. Absolutely rubbish from start to finish. Watching paint dry is much more entertaining than this."}, {"id": 80, "text": "Basically this feels like it could be at home with the cruises. The rules the bad wardrobe the tiny man, it must have been like purgatory filming this for Katie. Boring movie otherwise"}, {"id": 81, "text": "I can see all the work they put in that sequel, and it's good, but to release a very good sequel, they should have worked it more, much more. The first part is too slow and long, and the second part lack of imagination and they filled the holes with clichés and characters bad decisions in order to feed the suspense. They had an opportunity to make a nice sequel, but they probably lack time and money... But overall it's a nice try."}, {"id": 82, "text": "Jude (Christopher Convery) is a young boy that has remained silent after witnessing his mother (Katie Holmes) victimized in a home invasion. The family moves into a mansion for a fresh start for the family. While exploring the woods on the massive property, Jude finds a lifelike doll buried in a shallow grave and takes him home. Everyone thinks that the doll, now named Brahms, will be good therapy for Jude, who starts using his new friend to express his feelings. All is well, until Brahms becomes a bit sinister. Slow in places and predictable. Very lacking in scares, but sustains your interest."}, {"id": 83, "text": "Good fun. Nice and tense. Nothing like the first one but still fun. Have it."}, {"id": 84, "text": "A family traumatised by a home invasion move to the country to try and recover and move on. They move to a house on the estate of the Heelshire family. The son (Christopher Convery) has been a mute since the incident and finds a porcelain doll of a boy buried on the grounds of the estate that he befriends and calls Brahms. The boy's obsession with the doll begins to trouble mum (Katie Holmes). She uncovers the dark history of both the estate and the doll.The sequel to the original 2016 film changes gear from the original film, that itself changed gear midway through. In this film the doll itself feels more possessed a la Annabelle that serves to give a little more power to the doll which while it does make the film feel a little more claustrophobic, it also opens it up to a whole raft of cliches."}, {"id": 85, "text": "I wasted an hour and a half of my life on it What did they thought when they were Making it? It sucks so bad never watch it everyone"}, {"id": 86, "text": "The movie is just boring. Nothing scary about it or interesting. Totally predictable. I would have rated higher if it didn't ruin the first movie, which was not the typical horror movie. 10/10 disappointing"}, {"id": 87, "text": "It's scarier to see the exorcist for the tenth time. Brahms: The Boy II does not appear to be a sequel despite what the title says."}, {"id": 88, "text": "The good points: I liked the mystery and intrigue surrounding the doll (again), and Christopher Convery does a great job acting as the innocent but troubled Jude. There was also a good build-up of tension and dread and I found the doll and its influence on Jude disturbing.Otherwise it's a bit average. And this is just a personal opinion but I don't like it how the story cut out the actual Brahms. He was still alive by the end of the last movie and there was room to include him effectively. He's arguably the best part of the first movie and they left him out."}, {"id": 89, "text": "What a disappointment ! Seriously there is no suspense in this movie and it's completely forgettable . I like jumpscares this movie has a lot but every single one of them were predictable and not scary . The whole movie was predictable and not scary . Oh and suddenly the boy is supernatural . The acting is ok and the ending is just bad . Don't watch this movie"}, {"id": 90, "text": "I thought we are over garbage storylines. How do you want anyone to expand their brains thinking a freaking doll flipped a dinner table and other crap. This is unbelievable 😂"}, {"id": 91, "text": "The story is too repetitive and I got bored when watching it. Maybe this movie is more interesting for somebody has never watched like this movie."}, {"id": 92, "text": "Brahms: The Boy II is an appropriate, although disappointing, sequel that ventures away from the atmospheric tension that the first primarily relied on, and leans closer to the cheap thrills employed by many of it's peers in the same genre. In that regard, it's not nearly as unique and unpredictable as it could have been, especially in a Post-Annabelle world. From the get-go, fans of the genre will immediately be able to predict where this film is headed. Although it tries it's hardest to throw the viewer some twists and turns, it ultimately fails and one could see the climax coming from a mile away (or 40 minutes in). Sometimes sequels aren't necessary. This is one of those times."}, {"id": 93, "text": "Really good horror movie, I'll give it 1 star out of 1......."}, {"id": 94, "text": "I didn't see the first part until I got to the movies. In short: low budget, unknown actors, three or four locations, camera work horror standard. The boy's mother plays her role surprisingly well, while the father plays the, well, rather (horror movie typical) carefree. There are scary moments, but they probably worked because a friend and I were alone in the cinema ;) Conclusion: I don't have to see it again, it was rather the lower average"}, {"id": 95, "text": "Brahms: The Boy II is a Mystery - Horror movie and the sequel of The Boy, in which we watch a family experiencing strange events after their move to a remote house for vacation where their child becomes friend with a doll whose name is Brahms.Since I had already watched the first movie which I found very good, I was expecting something equally good or even better but I was disappointed by the result. I believe that the second movie was worse because of the things that they changed in comparison with the events of the first movie. It was changed the main core of the movie and they just kept the doll, it was liked a bad version of Annabelle and nothing more. Finally, I believe that Brahms: The Boy II would be a far better movie if the main theme of the first movie was kept as it was and it was just adjusted a little bit in the events of the second movie. If you have already watched the first movie then you should lower your expectations on this movie otherwise you will be disappointed."}, {"id": 96, "text": "Was a really good watch &amp; horror... except for the last 15 mins... completely disregarded the first movies plot in order to now make a few more movies! Completely ruined the first movie for me altogether now as apparently the twist in the first movie is irrelevant. Generous with 5/10.... could've been a 9/10 had they kept to the original story line."}, {"id": 97, "text": "I wasn't a fan of the first one but I thought it was ok. Brahms the boy 2 was more suspense of what is happening.The only thing I don't like is that this doesn't connect to the first one that much apart from little bits from it."}, {"id": 98, "text": "Acting: Decent acting and cast. Not very different from the first one and the characters weren't well developed. The mom is traumatized and so is the son, that's all the background you get.Story: The plot of this like most people have statted has been done a million times and offers nothing new. However it is still somewhat creepy and interesting. You see everything coming but at least it's done half way decent. This film is what I call a background film. Something that isnt that interesting or great on it's own. So you do something else with this in the background. This isnt bad. Its just typical and mediocre.Summary: If your a horror fan and dont mind repeating stories I would reccomend this. Otherwise there is a lot better horror films out there."}, {"id": 99, "text": "I really like the first one (esp the first 2/3, not the ending so much), so I was interested to see they made a sequel. Ehh, maybe they shouldn't have! My 5/10 is erring on the generous side.This movie took a different direction than the first and contained some cool new plot elements, but overall it was pretty poorly done, predictable, not scary, etc etc. It would have probably made more sense as a prequel but wouldn't have mattered much either way with this movie. Unless you really loved the first one and have 80 minutes to burn, I would sit this one out!"}, {"id": 100, "text": "It was a good movie until they had to kill the dog"}, {"id": 101, "text": "Shocking that this is the same writer as the first one, as the first had nothing supernatural to it. Now, all of a sudden, the doll is possessed and moves on it's own like we're too stupid to remember what originally happened. There were so many interesting things that they could've done with this story; it's sad that they went the lazy route and simply relied on possession and jump scares. Not my cup of tea, at all."}, {"id": 102, "text": "Not scary at all ❌ And I think they don't add to the movie any new ideas"}, {"id": 103, "text": "I could not believe they gave us this after 4 years . The first movie has a different plot from the other horro movies and i found this really interesting but this one was a huge mistake you just have to keep the first movie unique . Unlike the previous movie this one was full of the same boring thigs . A hunted house , a happy family moved into a new house , and a crazy man who just walked around ."}, {"id": 104, "text": "End was predicted same as all the movies in this genre"}, {"id": 105, "text": "Wasn't expecting much of this film but was pleasantly surprised. Quite creepy at times and very atmospheric. Great acting by all the cast. Not really scary but overall a good watch and alot better than the first film."}, {"id": 106, "text": "At first I was so hesistate to watch this because of the negative reviews but i was curious and i wanted to know the whole story of the part2. And it didnt disappoint me! i think theyve made this brahms2 to build up the story! when i first saw the boy1 and it ends nicely, Im expecting for the 2nd one and its was quite good! Yes it turns out to be a haunted doll in part2 but theyve still connect this in the boy1 which is Joseph the Boy in 1 is still connected with brahms2. see? they still wanted us to remember the first movie and it turns out to be a creepy yet good movie! Thumbs up!"}, {"id": 107, "text": "If you can imagine being a kid and having Jared Kushner as your buddy, you will love this film. Katie Holmes adds a nice pedigree to the movie. It's your basic hysteria and mystery. Not too bad."}, {"id": 108, "text": "This film wastes 86 minutes of your time only to completely disregard the twist that made the first movie so unique and interesting. Resorts to the cliched possessed doll trope that we are already oversaturated with in horror. Extremely disappointing."}, {"id": 109, "text": "I actually enjoyed the first movie, yes it's flawed, but I like Lauren Cohan and the twist was actually pretty decent. This movie however completely retcons the entire first film, and acts as if the first movie never happened. The acting is fine, the movie is competent with its cinematography, but beyond that, there's nothing that this film brings to the table. It insults fans of the original and does nothing new or interesting, it's obvious that the soul purpose of this movie was to make money, which is shameful. If you even mildly enjoyed the first movie, don't watch this. If you're a fan of horror, don't watch this. If you're a fan of movies in general, please don't support it."}, {"id": 110, "text": "What started as a fairly decent first film dives into unnecessary supernatural and lackluster second one. I'll make this quick. Nothing happens for an hour. Then there's some semblance of suspense and a very rushed ending. Was this even a movie? Just seemed lifeless. Katie Holmes does class it up a bit. But the Material is so dry. Husband is like a wooden statue. Nothing. Kid is the same creepy kid model. I swear they all come from a factory. Can we can get someone who has emotions. Facial expressions? Just anything? But no we get the same quiet performance like all the others. Again I don't blame the actors. They do their best. I enjoyed the annoying commentary of a theatre patron a lot more than this. Big spoiler I guess. The doll was real the whole time and caused kids throughout the decade to kill their families. Oh goody. How dumb.If B was an evil demon from the beginning. Than at least set that up in the first film. It breaks its own rules (much like Brahms list) to make it work. But it doesn't.Stick to the first one. That at least had some atmosphere and a pretty good twist. This was just..nothing."}, {"id": 111, "text": "The Boy had such a good story line. The angle they went with this one upset me. I don't like that they were saying the doll was haunted all along. I like the other version that the kid went crazy and they had to hide him and that the doll was a way of keeping him around. This was just your typical haunted doll movie. Nothing special about it. I'm so sad."}, {"id": 112, "text": "Quite possibly one of the worst movies I've ever seen! I really enjoyed The Boy but they completely disregarded the premise of the first movie and turned it into a wannabe Annabelle flick! This is the first review I've ever written and I feel compelled to do so because this movie was so bad. Very nearly walked out of the screening. No story, no substance, no characterisation, no horror, no nothing!"}, {"id": 113, "text": "If you really like the First movie, don't watch the second movie. It totally ruins the first one. This movie is trash. I'm usually a scaredy cat, but I wasn't really scared while watching this movie"}, {"id": 114, "text": "...this film shouldn't have been made. The first one was more like Psycho and I was fine with that. Seems no one wants to tackle mental health but instead blame it elsewhere. Now I get another Annabelle and Chucky when a modern Psycho was good."}, {"id": 115, "text": "I saw Brahms:The Boy 2, starring Katie Holmes-Logan Lucky, Batman Begins; Owain Yeoman-Emergence_tv, The Mentalist_tv; Ralph Ineson-Ready Player One, Guardians of the Galaxy and Christopher Convery-The Girl in the Spider's Web, Gotham_tv. This is a sequel to the 2016 minor hit 'The Boy' and it is clearly a complete money grab-trying to cash in on the former's popularity. Two of the actors from the original-Lauren Cohan &amp; James Russell-declined invitations to reprise their roles from the original for this turkey. Does that tell you anything? Katie plays a woman that is attacked by house invaders when she is home with her son, Christopher. Both Katie &amp; Christopher are mentally scarred by the attacks, Katie can't sleep without having nightmares and Christopher just quits talking-he can still talk, he just won't. Owain-the husband-decides to move and take the family to live out in the country for a while and guess what abandoned house he chooses? Yep, and when they arrive, Christopher finds Brahms-the doll-and becomes real attached to it. Ralph plays the groundskeeper that walks around with a shotgun. Katie keeps seeing the doll move-is she just imagining it because of her trauma?-but no one else does. Is the doll influencing Christopher? It doesn't matter because it's just not scary. It's rated PG-13 for terror-Ha!-violence and disturbing images and has a running time of 1 hour &amp; 26 minutes. It's not one that I would buy on DVD. I wouldn't rent it either. If you really want to see it, I'd wait until it comes to cable."}, {"id": 116, "text": "Any film with Katie Holmes is always lousy. I knew going in that this film was going to be a stinker, for the simple fact the Katie Holmes was in it. But I proceeded to watch anyway and my suspensions did not fail me. What a terrible film. The first Boy film was ridiculous and this one was just more ridiculous icing on the cake. I will say it and keep on saying it, this is so why I stopped supporting the theater 15 yrs ago buying movie tickets and wait for the torrent to download. The only thing wasted on crap films is time."}, {"id": 117, "text": "The scariest part of this movie was how they held their silverware.I am pretty sure I even fell asleep midway through it."}, {"id": 118, "text": "1/10 would not watch again. Not scary. Ridiculous story. Back to film school."}, {"id": 119, "text": "Very Not scary.. Just many Shock effect like Anabelle  weird doll... Bad Ending.. Very Not Recomended"}, {"id": 120, "text": "I don't see many horror films, but I know a bad one when I see it. In what is most definitely one of the more unnecessary sequels Hollywood has ever attempted, The Boy II is unoriginal, bland, and just plain dumb. Sure it will have you jumping a few times here and there, but you never truly feel any sort of danger for the lead characters. And even if you did, it's not like the film made you care about them anyway. Especially after now seeing The Invisible Man, this is not how you should spend your time at the theater.3.5/10"}, {"id": 121, "text": "An Excellent movie! It's very cool, interesting and not entirely terrifying. And It reminds me of (THE CONJURING 2).It is also much better than the movie before it (THE BOY)!10/10!!! But I don't understand why most of people do not like this movie ?!"}, {"id": 122, "text": "It turned out worse than I expected an embarrassing movie I hope it doesn't continue"}, {"id": 123, "text": "I don't understand why horror movies are so underrated. This movie was a decent sequel, with convincing acting and nice story along with considerable amount of tension throughout the movie. It's definitely worth a watch for horror fans like me"}, {"id": 124, "text": "Although the story is supposed to continue from the original, I would say it's actually just a remake rather than a sequel. This one is more of a supernatural kind of movie while the other one wasn't at all.Overall a good movie can't complain, enjoyable."}, {"id": 125, "text": "That was good, i enjoy it. I enjoy the first movie too, so i think that was a good movie. Not too much special but good"}, {"id": 126, "text": "I get it, The Boy 2 is almost a different genre than the boy 1 but it's not that big of a franchise anyways, if you can even call it one. I for one enjoyed a decent horror flick and was satisfied."}, {"id": 127, "text": "This movie is honestly underrated. I enjoyed watching and it was kinda scary at times, but certainly not too bad for people who are easily scared. Definitely worth watching if you're in the mood for a movie that isn't too complicated but still enjoyable."}, {"id": 128, "text": "I really enjoyed the first film and was intrigued by how they would continue the story, but boy did they drop the ball on this film. Truly a shame."}, {"id": 129, "text": "The most ridiculously bad sequel I've seen in a long time . I have nothing more to add apart from a shocking film"}, {"id": 130, "text": "I liked it a lot Good atmosphere scary for moments It is a good fantastic movie"}, {"id": 131, "text": "The boy one was good.This II it's badI don't recommend.Sorry"}, {"id": 132, "text": "Way better and scarier than the first. Was really acted well but a little bit short of story diversity; maybe cuz it involved few actors."}, {"id": 133, "text": "I think the rating needs to be a little higher. I thought it was a great follow up to the first film. Should of had a little more horror but that didn't ruin the movie. Still made for a good thriller. I also thought the doll was creepier in this film. Definitely worth checking out. 7 stars"}, {"id": 134, "text": "When I first saw the ratings, I thought it wouldn't be good at all. It's absolutely not as good as the first one, but to be honest it's watchable."}, {"id": 135, "text": "I think it was OK!!, i actually did expect much but it was good not more not less"}, {"id": 136, "text": "The film is terrible..dont waste your time n money"}, {"id": 137, "text": "Although the teens sat next to me in the cinema might have a different opinion to me, this film didn't come anywhere close to the first one. It made no sense; the ending was just blah and stupid and the plot was really weak. So predictable and it relied on loud noises for jump scares...no thanks.Not worth paying to see at all. Wasn't needed to be made, in my opinion. They don't make scary films like they used to..."}, {"id": 138, "text": "First one was terrible and the sequel was worst I considered walking out but didn't should have."}, {"id": 139, "text": "This move is awful, that's all I have to say. If I could&lt; i would give i a 0 star rating."}, {"id": 140, "text": "To be fair, the film The Boy was by no means a masterpiece, it was never going to win awards, receive acclaim from the critics or gain infamy in years to come. It was however a decent enough Horror film that had an interesting story, a nicely executed plot twist, it was well shot in excellent settings and the acting was perfectly fine; even the characters, bar Cole, seemed to have avoided the one dimensional curse of the Horror film. By all rights The Boy should have been allowed to slip into the forgotten space where all 'just fine' Horror films go, largely omitted from the public conscience in ten years or so leaving the greats such as 'Nightmare on Elm Street', Exorcist' and more recently The Conjuring' to be remembered. So when it was announced that The Boy would be getting a sequel it was a bit perplexing as to why. Whilst The Boy was technically a financial success, earning over $60 million against a $10 million budget it was nothing overly impressive and despite the ending being left open for a sequel it would have hardly been the first film to not follow through with such a promise. However the possibility of a good story in a sequel was there, a new family moving into the Heelshire manor and having to suffer Brahms' tyranny, spurned perhaps by his jealousy at watching a young mother dote on her children, or him once again falling in his own twisted version of love would have made for decent viewing. A game of cat and mouse viewed from both sides could have offered an interesting and refreshing film, especially if effort had been put into exploring Brahms' psyche and how months of isolation after Greta's escape had made it deteriorate even further. Seeing how the villain from the previous film functions and works behind the walls would likely be what anyone who had watched the previous film expected when they went into the cinema. That is not what they got however; rather than focusing on arguably the best part of the last film, Brahms the human, the film decides to undo everything the last film did and instead reveals that Brahms the doll, is the villain of this film and was in fact, retrospectively, the true villain of the original as well. The film offers Brahms the doll as a possessed effigy that has been convincing children to murder loved ones for literal centuries because, well just because. In the last ten minutes it is revealed that Brahms the doll, who was destroyed with no consequence beyond angering Brahms the human in the previous film, is a vessel for a demon, monster, ghost; what it actually is is not explained and even if it had been it wouldn't matter. When the head of Brahms is smashed by the father in the film, an attempt at something frightening and grotesque is discovered underneath despite being absent in the last film, however even this revelation falls flat as the design of the creature is not effective and is simply not frightening, looking more like a melted red jelly baby than anything worth loosing sleep over. The acting is what you would expect, acceptable, I wouldn't ask any actor to read a script like this and give an all consuming performance and even if they did the glaring flaws in the script would simply detract from it. Katie Holmes as the mother does just fine, the father is typical and the son hardly speaks so bad child acting is largely avoided at least until the cousins arrive. Visually the film is at an extreme disadvantage, rather than also taking place in the Heelshire manor which comprised of dark hallways and leering portraits of psychotic children this film is set in one of the never mentioned before guesthouses. Never mind that anyone from England would look at the architecture and laugh if you expected them to believe any guest house on any historical estate anywhere in England would look like that but the guesthouse is nothing but white walls and large windows, its simply too bright to be ominous. At first I thought that perhaps they had changed locations for budget constraints but both films had the same budget and the original manor features later in the film so why they moved away from a setting that added tension and atmosphere to their project for a setting that would fit nicely into a romantic comedy remains a mystery. It's simply another example of this film taking the best working elements of the previous film and burying them in the dirt with only a single hand sticking out. All in all this film failed miserably. There where definite elements of the original film that could have lead to a perfectly acceptable sequel. However for reasons unknown the writers decided to do a complete 180 degree turn and back track on the revelation that there was no supernatural element in The Boy. We have endured the doll being possessed by the spirit of a dead child to the child never died and has grown into an adult who has been manipulating the whole situation to the doll is possessed and it was controlling the boy who didn't die. It is for lack of a better word stupid. Unfortunately for The Boy, a perfectly acceptable movie, it's descent into the forgotten has now been halted. I'm not going to suggest that Brahms; The Boy 2 is going to make it so that The Boys will be remembered however it will always be associated with its much lesser sequel. There was more than enough left after The Boy to make a good film, with honest work it might even have been able to be better than the first however any chance of an enjoyable sequel was thrown away by a stupid plot and confusing choices. Lets be honest, no one really cared that much in the first place so it speaks volumes that despite such low expectations people have still been left so disappointed."}, {"id": 141, "text": "The movie was very very boring and all the events are expected even the speech, No production cost has been paid. I think if I and my friends made a movie in our house we would have done better than this."}, {"id": 142, "text": "I don't know what's hardest to believe: that they made a sequel to mediocre doll horror The Boy, that the film has had a cinematic release, that Katie Holmes is in it, or that I actually dragged myself off the sofa and out of a nice warm house to go and see this steaming pile of derivative crap.The first film was a moderately entertaining take on the old creepy doll format, but Brahms: The Boy II is so clichéd and predictable in virtually every way that it had me groaning in exasperation rather than yelping in fear. For the majority of the film, very little of interest happens: youngster Jude (Christopher Convery) glowers menacingly as antique doll Brahms slowly takes hold of him, he draws worryingly violent pictures, and refuses to eat his dinner. Brahms switches on the television, and turns his head when no-one is looking. Hardly what I would call bowel-loosening horror!After much dull stuff and nonsense, in which Holmes, as Jude's mother Liza, struggles to look suitably concerned or scared, and absolutely no-one dies (a boy has a nasty accident, as much his fault as it is Jude's or Brahms'), director William Brent Bell delivers a rushed final act in which the demonic doll is easily defeated by being thrown in a furnace.A dumb ending sets things up for a third film -- straight to DVD/streaming service next time, I suspect.2.5/10, rounded up to 3 for the subtle changes in Brahms' expression as Liza checks the doll for a serial number, but minus one point for all of the sudden loud noises that take the place of genuine scares."}, {"id": 143, "text": "This film start with woman Liza attack by an unknown person, and her son Jude suffering mutism scene! As turnout, this film is about a doll possess by a violent soul Brahms, causing havoc in the house, Jude and his parents move into! Entire film full of boring conversation, and annoying overuse scene! Such as, overuse of the walking scene, overuse of the calling name scene, overuse of the searching things scene, and overuse of the dreaming scene! Make the film unwatchable! Barely intense scene is, Brahms lifted Joseph and burn him to death! At the end, Jude burn the doll to kill the spirit! Jude still talking to the spirit even he move to another house! That's it! Wasting time to watch!"}, {"id": 144, "text": "This isnt the best of movies but is decent. I dont understand why people are giving it bad ratings hince the 10/10 ratings from me. The acting was good, a few jump scare here and there and a good plot which we have seen so many times but yet captivative. Over all is a decent movie and deserves atleast a 7/10"}, {"id": 145, "text": "The original one was amazing because it was unpredictable and did not contain any supernatural redundant elements but this one is sooo cheesy and predictable and ruined the firt. Really disappointed!"}, {"id": 146, "text": "You know what,i am tired of this kind of films and overall unneceserey sequels and also the films that ruin the meaning and entire story of first one,even if the first boy was far from being the best doll horror film in fact it was pretty mediocore but it also had a nice lead and cool plot twist,but this one ruins that all with lame decisions and story that has been seen for a thousend times,also the whole thing with title it is defienetly one of worsest i ever saw,this film is full of cliches,stupid decisions and weak scares that can only put as on sleep,brahms the boy 2 is another bad horror that fails in every way possible to the man"}, {"id": 147, "text": "The original movie was pretty good, for its type. I watched it a couple of times as I quite enjoyed it for what it was. This effort though...oh my god. The worst acting I have ever seen, the most clichéd script, terrible music and zero scares. Where they dragged the actors up from I just don't know. The director should be ashamed. Doesn't even deserve a 1."}, {"id": 148, "text": "So this is the 2nd (and hopefully last) part of The Boy: Brahms' series. The first one was original and this film just blew every originality the first film had right out of the window. Now it purely was just another haunted doll film with the most cliché scenes ever. The whole film was very dull; the writing, the acting, the plot; everything. They really shouldn't have made a part 2 like this..."}, {"id": 149, "text": "Where is the originality? Another hopeless horror(comedy)"}, {"id": 150, "text": "I NEVER write reviews and I also almost ALWAYS love any horror movie that i watch. Im not picky. But this movie is so boring that i need to warn people about it. Please save your time and watch something else. Just trust me on that. The whole movie was the doll turning his head or moving his eyes in short scenes throughout the whole movie. Extremely bland. Please dont watch it lol"}, {"id": 151, "text": "The first movie was one of my favourite horror movies the ending was personally really surprising to me. So going into this movie I was expecting a good twist to surprise me, but there really wasn't one unfortunately. Other than that the movie was somewhat good, definitely better than the horror movies that have been coming out so far this year. Wish they never turned the doll into a demon and kept it like they did in the first movie. Ending was not very climatic and felt rushed."}, {"id": 152, "text": "Another movie about dolls that are alive. Do someone has other things to than do this type of horror movie, so boring"}, {"id": 153, "text": "I thought the first movie was seriously good! It was a cool, unexpected idea-no ghosts, just a demented guy pretending to act as a doll. I had high hopes for the second movie, what with the first ending with a promising cliffhanger.... but now, after watching the sequel, I though that it kind of ruined the story of the first. The plot felt forced and took away the originality of Brahms the boy by making the doll possessed. I also feel like the two storylines don't fit together very well. There was so much possibility with this movie and I was pretty let down."}, {"id": 154, "text": "Thisbbn movie was sp greg It cure my cancer. Then when the doll turned it adam sandler it was weird. Gotta be honest linda ruined it for me 1/10 movie bad"}, {"id": 155, "text": "Doll films aren't bad as a rule. But if you're gonna do one, you had better be original.This is just another gutless, uninspired generic piece of ineffective fodder for the masses. Weak, feelgood ending with the most eye roll inducing of twists. Your grandma might find this scary.What garbage."}, {"id": 156, "text": "This movie gets to the point where it's downright hilarious. There are really odd camera effects trained on Katie Holmes at times where I think they wanted the viewer to be scared but they couldn't be bothered to make whatever was happening actually scary. I was more interested on finding the loose change I saw in the theater prior to the film starting than the actual movie. Another reviewer said that this movie is long for a short runtime and they're not lying. Invisible Man felt shorter than this. I turned my phone BACK ON during this movie to check the time (nobody else was in my theater, so I didn't care). I was thinking about leaving but I went ahead and read the Wikipedia article on the movie to spoil myself on the ending and decided to stay around for a good laugh. I strongly recommend not seeing this movie at all and just pretending that The Boy (which I didn't think was all that amazing to begin with) is a standalone movie like it was probably intended. None of the performances are that good, the plot is stupid and underdeveloped, and the ending is a riot. Not to mention the fact that the bit before the end credits start rolling I was asking myself that's a rip from Halloween IV's ending, y'know just without any of the blood and fun of Halloween IV. Just don't do anything with this film. Not worth the 86 minutes."}, {"id": 157, "text": "Jude (Christopher Convery) becomes a mute after a robber attacks his mom (Katie Holmes). The family goes on a getaway to the house next to the house used in the first 'The Boy film. Jude digs up a doll and takes him wherever he goes. If you are trying to remember which Boy/Doll film this one follows it was the one where the doll wasn't haunted and there was a guy living in the house between the walls. This is all explained again in the feature.It is nice to see Katie Holmes doing horror films. She is a good actress and deserves better. However, this film about a haunted doll didn't make it. It needed a solid plausible twist and it didn't have it. The family was basically boring. It needed a moody teen girl.Guide: No swearing, sex, or nudity. Doll never spies on mommy in the shower."}, {"id": 158, "text": "This movie will screw with your psyche demanding an explanation why you picked a deplorable movie sequel in the first place!"}, {"id": 159, "text": "Okay so cinematography was great no doubt about that, but there was no plot at all. It can't even be called a horror movie! Sure there was one or two moments that startled me but not enough to stop my heart. Thus, it was the worst horror movie to start 2020 with! The doll didnt even do much that could be amounted to anything scary. This was a waste of my time and money."}, {"id": 160, "text": "This is not a scary one. This is a silly one. The title of the film could have been called Kramer's Worst Nightmare. However, it is not as good as the original Twilight Zone episode it tries to rip off. Even the silly Chucky is better than this crap."}, {"id": 161, "text": "Enjoyed the original quite a bit. My now 18 yr old says it's one of his top movies, so asked if we could see this one. Going in we had high hopes that it was a continuation of the first, boy were we wrong. See it only if you haven't seen the original, you'll only be disappointed."}, {"id": 162, "text": "Not a bad movie. It has enough to keep you entertained, the acting is good and the there's enough mystery to keep you guessing. I'd definitely recommend it. It isn't a horror but more of a spooky drama."}, {"id": 163, "text": "Puppet horror - did Annabelle bring them back to life? Did they ever go away? Chucky pops up every now and then anyway ... haven't seen the latest outing, but generally there seems to be this nightmare of these inanimate things coming to life - or are they? Since this is a horror movie, I think the answer is pretty clear, even if our main characters need a little bit more time to realize certain things.Wouldn't be interesting or suspsensful, at least not to the same degree, if they were all completely aware of everything happening now, would it though? This is straight horror and while some may find certain things ridiculous, the movie is quite serious about what it shows us. So if you buy into it, you will get a decent effort to say the least ... does not mean you will like it though"}, {"id": 164, "text": "This is a awesome sequel! You should watch this movie for sure!!!!!"}, {"id": 165, "text": "If you want a on edge movie with a hint of darkness. Watch this. It's perfect in everyway. Dark, on edge, cliffhanger. I would rate it 11 stars if I could. Best movie I've ever seen. (Watch number one first.)"}, {"id": 166, "text": "The Boy from 2016 was an AMAZING movie. Absolutely well done with a great twist that felt truly surprising with a gripping build-up. I feel so, incredibly depressed to have watched this sequel as it has completely ruined the story from the first one- they totally destroyed the lore and originality in their story and made it a horrible cliche of a doll, possessed by a ghost with a pension for haunting the lives of children. I could not be more disappointed with a sequel, and usually I do enjoy watching continuations."}, {"id": 167, "text": "I wasn't expecting much here given the score it gets!I have to say that I was pleasantly surprised, but I totally get the reasons for the hate.The boy 2 undermines the very essence of the first movie and twists the plot to fit a far more generic mould.As a stand alone film this would have worked better, but as a sequel it languishes in mediocracy6/10"}, {"id": 168, "text": "Its still a nice passing time movie but it had failed to really grab my horrifying mood. A nice story but when it involved the old man, the story became bad. The director and writer should not play this old man to be a part of this junk story. Its only a normal movie trying to be scary but failed to do it to the best."}, {"id": 169, "text": "I usually love puppet horror but not this. Puppet is good but story is bad."}, {"id": 170, "text": "Trauma or not the kid was 11-12 when this was filmed. I get it, they are playing the traumatized little kid thing...but this kid is going through puberty and still wants to carry around this doll?? Take him back to the therapist. Just dumb...his parents are just terrible. You better not do this or else? Or else what? You'll let me have whatever I want? I love Katie Holmes but this is dumb. The minute the doggy hate became apparent, they should have gotten rid of the little creeper. But, unfortunately the dog was smarter, than the parents. Literally, a dog is found gutted and you think it's the kid and then you say he's fine, let's let him play with his cousins and then you watch him injury his jerk of a cousin. Are you really that stupid? This sequel ruined the first movie, with a storyline that didn't just derail the first story it was a completely different track."}, {"id": 171, "text": "First one was good this fell apart completely at the end and kind of negated the first one. First one has you believing the doll is possessed but it turned out to be a real person behind it. This movie explained things as if the doll was always possessed and made whomever was its caretaker do its evil bidding. So that is convoluted.I like Katie Holmes but her mug looks like it's melting. No fillers for her. She's still ok for her age but she looked busted in this. The husband was a dud and added nothing. The groundskeeper's acting talent was wasted in this drivel. And why did they have to kill the dog?!I cannot believe they are trying to drag this crap out like another horror franchise. The premise is just too stupid and the story def got too weak in this movie. The more they try to get out of this thin storyline the lamer it will get."}, {"id": 172, "text": "This is a dull, uninteresting, tedious, generic, unnecessary, unsuspenseful, redundant, bare and worthless excuse for a film, that lacks story, acting, character, wrting, directing, and pretty much everything else. In the end, Its idea doesnt even make sense to the original"}, {"id": 173, "text": "This was so cheap I was going to donate them some money to at least put an effort in. 1. Definitely way below Child's Play, Chucky &amp; Annabelle. This genre is running out of steam; just repeating itself, same motif. 2. 75%+ the way through the movie what do you get? The doll scares us (if this scares you you must be three years old) with one of two movements, and that was it, either turning it's eyes or turning it's head (you can almost see the puppet controller's arm in the background). towards the end it can, with much fakery and with it's mind make things move (gee, that's novel). 3. Most of screen/nonscream time is the usual disbelieving parents; then some believing; followed by some research (the usual newspaper clippings of past boy doll deeds); followed by doll kinda really takes over their son; followed by the usual closure to make a sequel &amp; more money."}, {"id": 174, "text": "I was excited to see this movie for quite some time and boy...was I let down. The movie completely relies on jump scares. Nothing else. Even the main performance was a disappointment, though he wasn't given much to work with. The most disappointing part of this movie was the ending. Or lack there of. It abruptly ends explaining nothing. Save your money. Wait for Netflix."}, {"id": 175, "text": "I had lots of expectations from this movie and i think it would give me some creepy moments but not even a single goosebump, horror movie should create some scary moment for viewer but it doesn't have any...."}, {"id": 176, "text": "Thought the first movie was OK, but I was writing this review half way through this sequel,so you can tell I wasn't engrossed. Thought the acting wasn't great Katie Holmes just doesn't convince me was out performed by Brahms the doll that's how bad she was. If you seen the first movie leave it at that because this brought nothing new to the original at all. If you must see the film for yourself go ahead but you will wonder why after thirty plus minutes of no scares and no tension."}, {"id": 177, "text": "A boring film where nothing horrific happens, I wouldn't even list it under the horror genre."}, {"id": 178, "text": "Brahms: The Boy 2 (2 out of 5 stars).The Boy 2 was lacking the scares and thrills the first movie set up. The story was focused on a family who has had some trauma which they thought it was a good idea there son should keep the boy doll he found in the woods.The story was dull. The acting was flat from the cast ensemble. The script and direction was lacking thrills and suspense. This sequel is a missed opportunity from improving from the first movie."}, {"id": 179, "text": "It is so bad it's almost good. It's basically the same as the original but had enough twists to keep me entertained. It definitely won't win any awards but me and my friends enjoyed it and if you're looking for a rubbish horror to enjoy, here's your pick."}, {"id": 180, "text": "PROS: ~Ralph Ineson's performance is solid as always and Katie Holmes does a decent job, I guess.CONS: ~The film is inconsistent as a sequel to The Boy and destroys the whole concept of the first one. Here, the doll is presented as a spirit vessel but in the first movie there was actually a human being living in the walls that orchestrated the whole situation. The irony here is that the script is written by the same person who chooses to turn the film into a generic uninspired supernatural movie. ~The movie is unsirprisingly based on cheap and unearned jump scares instead of creating a creepy atmosphere. This is made clear from the first minutes when the boy hides from his mother in order to scare her. ~The dream sequences exists only to give more jump scares and not to flesh out Holmes's character. There is even a dream inside an another dream but the most laughable moment is a vision of the doll vomiting bats. ~The movie unfortunately embraces all the cliches of the genre. From the kid that draws weird pictures and doesn't speak or the TV that is unexpectedly turn on. ~The film could have focused more on the traumatic experience of the mother and the kid. Furthermore, the interaction between the family members is underdeveloped (the father is literally useless). ~The ending of the film is lame and predictable."}, {"id": 181, "text": "The first one was good. Yes! I'm sure many would agree. But this sequel is not that bad &amp; I would think that a 4.5 rating for this movie would be rather unfair. This sequel was decent, there are elements of creepiness minus the jump-scares &amp; overall I did enjoy the movie. This sequel also ties up some loose ends in the first movie &amp; I liked how things unravelled. Overall, I would recommend it. It's certainly worth a watch, compared to a lot of the horror genre garbage out these days. 👍"}, {"id": 182, "text": "Always a hard thing to do to top off, like how things start and where it lead. After that when the dolls comes in the scene it starting to start going down hill. Could be such a good movie but it went traditionally with the horror story line. Hate really how it ends and what the plot is, ugggh. Even good actors cannot save a bad story line. waste of such a talent."}, {"id": 183, "text": "If they were ever hoping for 'The Boy' to become another franchise, I think 'Brahms: The Boy 2' shattered that dream. The film received all-round negative reviews, and only took $20 million at the box office, compared to first film's $74 million.THIS REVIEW CONTAINS SPOILERS. So, at the end of 'The Boy', we learnt the doll was not possessed. It was, in fact, just an ordinary doll, as Brahms was an actual person - still very much alive - living within the walls of the mansion. So, if it was just a doll, why is it possessed now? Is the film now going the direction we all thought it would in the first film? It felt all too much like an 'Annabelle' or 'Child's Play' wannabe.We have the same director. The same premise. The same location (at times). So why does this film feel so different? The haunting atmosphere that was so effective in the first film, is gone. The effective jump scares are gone. The originality is gone. Instead, the film contains cliche upon cliche and felt like a rehash of films I've seen before, notably the aforementioned films. There's even a feeling of 'The Amityville Horror' here, especially with the house's back story.It's also a bit disconcerting seeing a boy of Jude's age so attached to a doll. It was completely understandable in 1988's 'Child's Play', as the child was very young still. Or did Jude become possessed himself? By a possessed doll? I didn't find the acting all that believable. The father, Sean, was a very calm, understanding character - pretty much the same throughout the film, regardless of what happened. The mother, Liza, was an unpleasant character for most of the movie. There was very little character development. For such a short film (86 minutes), there was an incredible sense of deja vu, as if they indeed had run out of ideas. As if they quickly wanted to cash in on the success of 'The Boy'.By the time the film reached the climax, the final scene was so reminiscent of Chucky's death in 'Child's Play' that I was convinced they wanted to create another doll franchise. Enough already.Would I watch it again? No"}, {"id": 184, "text": "Brahms: The Boy II is a 2020 American film starring Katie Holmes, Ralph Ineson, and Owain Yeoman. A stand-alone sequel to the 2016 film The Boy, it is directed by William Brent Bell and written by Stacey Menear, the respective director and writer of the original film. The plot follows a young boy who, after moving into a mansion with his parents following a traumatizing incident, finds a life-like doll he becomes attached to. Release date:February 21, 2020 (United States) Running time:86 minutes Budget:$10 million Box office:$20.3 million"}, {"id": 185, "text": "This is basically a terrible version of Child's Play mixed with Annabelle. It has nothing to do with the first The Boy but that isn't a bad thing.This movie is probably as good as the first one. It is never creepy, scary or atmospheric. It is just there going through the by now old motions.Red Letter Media made me watch this as I watch the films they discuss before I watch the new episodes and this was by far the worst one.This isn't good. Not even good for a make out session Netflix and chill as you will both end up hating each other."}, {"id": 186, "text": "A little spoiler ahead to get ready.I was expecting the appearance of the man who was manipulating the doll in the prequel. This movie was not originally paranormal. This was not supposed to be the same as Anabell the Doll but that's how it was seemed to be on the sequel.It's disappointing how the same writer and director moved away from the original concept of the movie. Brahms was psychotic and the doll wasn't possessed at all. But I don't know the goal of this sequel. Just terrible."}, {"id": 187, "text": "It's not a bad movie, but it is not scary. The name Jude (the kid's name in the movie) is a bit strange. Why would you name a kid Jude? (Jew in german) I think the movie the boy is a little more boring in comparison with this one."}, {"id": 188, "text": "I saw the trailer for this movie, and the trailer felt so dull so I kind of knew the movie would be bad. I gave it a watch, and as I predicted, terrible. But, there are a few things that made it redeeming.For starters, they made the doll supernatural. In the first one, I felt very disappointed when I learned the doll wasn't moving on its own, but a male in the walls moving it for him. But in this movie, the doll is supernatural, as in, more controlling the boy's mind. It sometimes moves its eyes and head but not a lot. Another redeeming quality was the ending, which I felt like was fairly crafted together.The movie is boring and there are some things that needs to be worked on."}, {"id": 189, "text": "In the first film, Brahms was not a haunted doll, however in this film he's now haunted for some reason? The only reason I give this film two stars is because the cinematography is on point and the actors are too. It's the fact this film's storyline makes no sense and the characters are poorly written. A huge let down."}, {"id": 190, "text": "I never saw the the first film and don't usually watch these type of films, I find horror films usually the most predicable of all. This proved to be no exception. Every cliche played, predictable to the very end, actors doing a solid job without going over the top, But it just didn't grab my attention. I remember seeing what may have been the first of these type of films many years ago, an African doll if I remember, sure it was part of three stories, that scared the life out of me and I suppose I always remember that film. Die hard horror fans may enjoy it but I think it's well worn a path for most of us. Gets four for the acting rather than anything else, would've been a two or three."}, {"id": 191, "text": "5/10 - it had a good first two-thirds, but went off the rails with an ending that felt stupid and inconsistent with the original"}, {"id": 192, "text": "That's all this movie deserves, a big MEH! Lazy script, makes no sense, just another lazy money grabbing Hollywood trash production."}, {"id": 193, "text": "If you've not seen the original, I'd recommend catching it before watching Brahms: The Boy II. A lot of reviews indicate there is little carried over from the original, but in fact there's quite a lot. Also remember most of the critics hated the original as well, a fact I've never been able to reconcile.The original worked so well because, unlike most thrillers in this horror subgenre, most notably Annabella, The Boy plays out on a more psychological level of horror and pure mystery. It also helped that Lauren Cohan's performance was good enough to stretch believability when Greta, the heroine she played, fell under the doll's spell herself. To have her on the run from an abusive relationship was a subplot that worked to the original's advantage, spiking the tension and the stakes for all involved.With The Boy II, we have another good structural, psychological subplot and a another above-par actress, Katie Holmes, without whom, quite frankly, I don't think this picture would be worth a watch. Holmes has been known to elevate shaky material in the past (Abandon most notably) and she doesn't do the celebrity-walk-on here --- she's committed to portraying a damaged character, this time the victim of a brutal home invasion, which adds a creepy weighty touch of brutality and danger to a film that's lightweight by virtue of genre alone.In this sequel, the doll effects are subtler and perhaps more creepy because of it. The big problem with Boy II is that, unlike the original, it relies on demonic possession --- whereas the original explained everything away in non-supernatural terms, increasing the horror and power of the story considerably.If you're looking for a movie with the scare factor of Child's Play, neither Boy movie measure up.... they're simply on another, less visceral creep-out plane.There are good performances by Christopher Convery, as Jude, who smartly underplays the bad seed role convincingly, and the always fine Ralph Ineson.It's in the last third of the film where Brahms history is unearthed that things go awry and the SFX team goes into full-tilt overload trying to impress each other and things go downhill fast. I was hoping for a suitably non-happy ominous ending --- what we get is yet another predictable pasted on excuse for another sequel --- that tied back to the home invasion in some way, but it's probably too much to expect.I have a hunch that, as the writer and director are the same as in the original (never a bad thing) that this ending was forced on the filmmakers. iTunes has a director's cut and an alternative ending (that I have yet to explore) if you purchase the movie. I wouldn't recommend that unless you're a fan of the original, but it will be interesting to see if the vision of the creators of The Boy produced something a bit more satisfying than what we've gotten in the theatrical cut."}, {"id": 194, "text": "The writer of this movie should stay away from making new movies as far as he can. Don't waste your time. Turn on your microwave and watch it because it has a better story."}, {"id": 195, "text": "Another sequel that fails miserably. It ain't scary and it sure isn't original. The first one was okay, but this did never get close to the original. Acting was okay, but the storyline was dull and boring as most horror movies these days are. Predictable from start to finish, no good scares whatsoever."}, {"id": 196, "text": "Slow, very few scares and just another poor sequel that should never have been made when they could have spent the money on something original and makes a bit of a mockery of the excellent first film but it has made back double what it cost to make so no doubt there will be a Brahms III."}, {"id": 197, "text": "This was boring, unoriginal and such a disappointing sequel to its predecessor. I'm sick to death of scary movies thinking quick movement and a loud burst of music equates to horror. Guys, it's not scary. It's just loud. Really, really too loud. There's an art to generating fear or terror. You don't have to announce to the audience that it's time to be scared with creepy music or a deafening roar. And it seems the writers couldn't think of a way to keep the doll in the movie long enough without calling upon the dumb parent trope. At every given opportunity that it becomes clear someone should remove the doll from the house because of the creepy events or the child's unhealthy relationship with the doll, there the son goes--carting away the doll like a spoiled brat whilst the mother is left to clean up an eerily destroyed living room after getting a morbid threat from the doll. The father was a useless, unsupportive dolt. I couldn't even route for the kid--it was THAT frustrating to watch. Disappointing."}, {"id": 198, "text": "I don't know why any studio green lit this, the first wasn't exactly a box office smash and the first film was okish. I know Katie Holmes isn't exactly a big name especially these days but why she agreed to do this is beyond me. It is so boring not remotely scary it's just drag and drags. The acting from every one else bar Holmes is like something you'd watch on channel 5 on a sunday morning, the film looks like it's been shot in about 2 week. Bad and not so bad it's good."}, {"id": 199, "text": "I think the author of this movie was his first job. This movie just wasted my time"}, {"id": 200, "text": "I found this film funny rather than scary but I still enjoyed it. Brahm's was like Annabelles cousin and there were some good scenes. I also liked Katie Holmes I thought she was good, I thought they overstated the English setting though, her husband always saying mate and fella. You're English we get it. Third one for trilogy!"}, {"id": 201, "text": "The Boy movie was ruined by the ending according to me when they showed us that all the creepy things are not done by the doll but the man who hide himself in the house but the boy II Brahms rectified that mistake by telling us the story that it was always doll behind all the weird stuff that was going on. The Boy II Brahms should be the first one and not the sequel. Fun one and half hour ride."}, {"id": 202, "text": "Sooo predictable, long lead time before nothing happens (lol), leaned heavily on the first movie (The Boy, which i loved) and desperately milked that film's mood and mystery bringing nothing of its own and added absolutely zero of merit or scares or surprises to the original. so why exactly was this made??also points off for having a great setting and great actors (katie did her usual good job) and still failed stunningly. and that ending, boy, sure was absurd.so this is who may like this movie: someone who has never seen a horror film. someone who has never seen a possessed doll film. someone who did not see The Boy.3/10"}, {"id": 203, "text": "A film with a little sounds and not scared at all Worst film ever"}, {"id": 204, "text": "The sequel we've all been waiting for, Brahms: The Boy II manages to rival The Turning as the most offensively pointless horror movie of the year. Brahms may be one bad boy indeed, but his company would be preferable to another viewing of this sad cliche of a film."}, {"id": 205, "text": "Very slow to start this movie, a few jump scares and suspense but no actual horror till the end.So the caretaker gets levitated by the doll at the end and killed but that's about the most supernatural thing that happens. Not sure what was in the doll at the end as it was broken open but this is about the creepiest part of the movie. They try to destroy the doll by tossing it in a fire and they go back home. Oh yeah and Jude may be possessed by the doll at the end. Pretty bad movie, I wouldn't recommend spending money on this."}, {"id": 206, "text": "The Boy II is not as bad as Fantasy Island, but even with that achievement the film struggles to stand out from nothing more than a generic horror flick that belongs in the trash heap that is January."}, {"id": 207, "text": "Don't waste the money on the ticket at the theater. If you're just dying to see it, wait until you can rent it. Story line was terrible and jump scares were all in the trailer so we expected them already."}, {"id": 208, "text": "Just came back from a screening of this &amp; have to say compared to the first film, it wasn't that great, it lacked &amp; didn't have the grounded slasher theme like the first film did.So following on from The Boy, this film centers round a family who after being terrorised by a burglary one night decide to get away for a few days at a remote Heelshire Mansion. Their son Jude, who is a mute after the trauma of the burglary finds a porcelain doll called Brahms. But not long after keeping the doll, Sean &amp; Liza start to see odd behaviour from Jude along with strange occurrences in &amp; around the mansion.I found the to be a little on the dull side. Not a lot happens &amp; when it does it's only for a short time before the film begins to plods along again. I mean don't get me wrong, I was enticed as to what was going to happen, but felt the build up went to nothing. I would've wanted more to happen. A body count. Gore. Violence. More sinister goings on etc.I even was confused as to what type of film this was, like was it a prequel, was it a sequel? Was it a slasher or was it supernatural? The film itself seemed to have no point to it or why it was needed in the first place. At least if it offered some gore, a decent body count or more scenes like the one with the cousin bullying Jude would've been ace. That scene itself was great to watch &amp; was probably the only scene out the film worth watching never mind the only redeeming feature of the film.Overall, not a great film. Watch the first The Boy film. Least that one was actually pretty good. 4/10"}, {"id": 209, "text": "After seeing the first one a couple days before watching the sequel, I can only express how disappointing it was. I would honestly rather bake my own into a pie than see this film again. Terrible plot, hardly scary."}, {"id": 210, "text": "William Brent Bell directed the original The Boy, a movie that pleasantly surprised us when it was released in 2016. This follow-up has been on our radar for some time, yet has been knocked around schedule-wise. Originally set to play theaters in July and December 2019, it finally made its way to the graveyard of films that are the first two months of the year.I wanted to absolutely adore this movie, but I walked away only liking it. That's because the beauty of its predecessor was that while it seemed like a supernatural film, there was an even more unsettling reality as to why Brahms, the porcleain boy, could move, communicate and impact his surroundings.In this installment, the film goes all-in on the otherworldly, sometimes to its credit (the gleefully unhinged look of the villain once his face has been destroyed) and often to its detriment. In all elevated horror, it seems that the true enemy isn't the gnawing unknown existing just on the side of our consciousness, but bad marriages and worse parenting. Liza (Katie Holmes, of whom my wife inquired, Why is she doing this movie?) and Sean seem as if they've had a divide between them since their son Jude was born. He's a sensitive soul, the kind that enjoys pranking his mother for no good reason before a home invasion renders their lives worse than it was before.Between Liza's head injuries, Jude getting shellshocked and Sean seeming not to care at all, the family moves to the country. Obviously, money is not one of their dilemmas. Settling in at the guest house of the first film's Heelshire estate, they soon meet Jospeh (Ralph Ineson, who post-The Vvitch is the go-to for strangely off UK-based character acting).Moments later, Jude has stopped his precious handwriting instead of speaking and unearthed Brahms from his earthen grave. While Jude's therapist sees having the plaything as a positive at first, by the end of the film, the rules of owning Brahms have led to a brutal game of croquet and canine decimation.While the film has a call back scene to the drowing in the first movie, you don't need to know that story to watch this. Neither Laura Cohan or James Russell returned, due to scheduling conflicts and not wanting the role.This will probably be streaming by the time I finish writing this review, but it was a pleasant enough filmgoing experience. There's an end sequence that reminded me of the much more harrowing doll scene in Argento's Deep Red, but I really did enjoy the closing moments.So few modern horror films get the opportunity to become franchises, compared to the movies of my teen years. Brahms: The Boy II engages in world building and trying to place a reason for all the madness, but in my opinion, the unanswered nature of the first film was a much more horrific experience."}, {"id": 211, "text": "Brahms: The Boy II is a 2020 American supernatural horror film starring Katie Holmes, Ralph Ineson, Owain Yeoman, and Christopher Convery. A stand-alone sequel to the 2016 film The Boy, it is directed by William Brent Bell and written by Stacey Menear, the respective director and writer of the original film. The plot follows a young boy who, after moving into a mansion with his parents following a traumatizing incident, finds a life-like doll he becomes attached to.I was looking forward to watching this film, the original was a pleasant surprise for me and a film I have rewatched several times since it's release. This film would've benefitted more from a little better direction - the film follows Liza (Katie Holmes) trying to rebuild her life after a violent burglary took place whilst she was home with her son. Who, now traumatised by the ordeal only speaks with a notepad.The film relies too much on dream sequences and jump scares and not enough on genuine frighting moments, which are much more effective. I felt the film for the most part was more about the family dynamic of the two parents and the son, with horror moments placed in between without much effort.As the film begins it's third act, some revelations are revealed that, as other users have mentioned, tarnish the original films ending and make you question what the filmmakers were thinking. The films strong points in my opinion are the performances of the three leads, who are clearly giving their all despite what they are working with. Katie Holmes is great in the lead role and I've always wished she was in more films and the actor playing her son is also rather good. The film as a whole though is disappointing.5/10"}, {"id": 212, "text": "Well this movie was a pleasant Surprise, I didn't expect much from this movie after all the awful reviews but after seeing the movie I can say it's not amazing but i still had a fun time watching it and it's easily so far the best horror movie outta 2020 so far. The cast in this movie all shine and give a great performance everyone does great. The music also in this movie gives the creepy automspehere It's full effect. The characters are also have great character development. The production design is also really great and also help the creepy automsphere. The runtime is great and doesn't overstay it's welcome. The pacing although slow is great and is very much like childs play. But where the movie really starts to fail is with its scares, THIS MOVIE IS NOT AT ALL SCARY, there is potential there to be scary but I feel with it's pg-13 rating it limits the scares that could of happened. Also the dialog at sometimes can be over the top and all over the place. Overall, Brahms the boy 2 was a movie that took me by surprise with how much I did enjoy it, yes it's not that scary but this movie I did find enjoyable. If you have any Interest in seeing It, I say give it a try."}, {"id": 213, "text": "When I first heard about this movie, I was intrigued to see what they were going to do with it. I was late to the game with the first one, but after seeing it, I really enjoyed it. I didn't necessarily think it was the best film, but it did some really good things. I ended up having an afternoon off from work and decided to check this out. The synopsis is after a family moves into the Heelshire Mansion. Their young son makes friends with a life-like doll called Brahms.We start this movie off with Liza (Katie Holmes) coming home from work. In the background we see someone out of focus as she is calling out to her son. She goes into the kitchen where he scares her. His name is Jude (Christopher Convery). The both of them call her husband and his father, Sean (Owain Yeoman). The two settle in for the night, but something wakes up Liza. They're the victim of a home invasion.It then shows us the aftermath. Liza is having nightmares and refuses to talk about it to anyone. Jude hasn't talked since the incident. He's going to see a Dr. Lawrence (Anjali Jay) to help get over the events of that night. It is decided though they're going to move out of the city for awhile.This takes them to what used to be a guest house to a large manor. They take the place and try to settle in with this change of pace. The family goes for a walk through the woods and Jude hears whispering. This leads him to digging up an old porcelain doll. The parents also find the house from the original movie and together they encounter Joseph (Ralph Ineson) and his dog. Jude is allowed to keep the doll, but after his mother cleans it up.She notices during this that it's been broken and repaired. I don't recall if that happened in the previous movie, but I feel like it did. Regardless, she gives it to Jude and he also discovers a letter that comes with it giving its 10 rules. Liza isn't a fan of it, but when Jude starts to make progress, it becomes a struggle of the fear of the creepy doll that tells Jude his name is Brahms or preventing him from getting better. Things start to get quite weird with some of the drawings that Jude does or he's slowly starting to look more and more like his new favorite doll.What is really interesting to me is how low of a rating I saw for this after leaving the theater on the Internet Movie Database. I was also equally shocked to see that the director was the same from the first movie, William Brent Bell, and the same writer, Stacey Menear. The reason I say this is the fact that nothing gets under my skin more than violating continuity for a movie with a sequel. I think there might be slightly some of this, but I actually think this does well in deepening the story without doing that in major ways.I'm going to be non-spoiler here and I don't really think there's enough to go spoiler either. This movie though does do some things I really liked. What I want to go over first would be our three leads first. First we have Liza. She's 'normal' until the attack through the home invasion. I like that she becomes the one who is more against Brahms, but she's also an unreliable person. Even her husband gets to the point where he is questioning her more than Jude and I like that. It is subtle though where it is believable.I want to shift to Jude next here. Much like his mother, he's traumatized by this event and his way of coping is to not talk. He has a pad of paper he writes things down on to communicate. His parents are being patient and even more so when Dr. Lawrence tells them not to push so he doesn't go farther into his shell. It becomes a strange duality that Liza is noticing some dark aspects to her son, but he is also showing progress. I thought that was an interesting thing to explore here.Since I'm not going to spoil, I'll tip toe around what happened in the first and how this works into this one. I do like they're using the same place, doll and that the events really did happen. We even get them introduced through some investigation and explanation. That was all good for me. It would be hard to do something like they did in that one so I like what they do and the history that is revealed about this doll as well. For me, it worked. I do think it is slightly a cheat, but I'm willing to overlook if I'm honest.Moving this to the pacing, this is where I had my biggest problem. I just had trouble paying attention to this for the most part. That's not to say it was boring, because I don't feel that is the case. I think that it really does well in establishing our characters, getting them to new place where the doll is found. This section is where I lost some interest. It is funny though, the original had the main character that was following the rules where this one they're being violated pretty much constantly. I think that's where part of my issues comes from. There really isn't much in the way of repercussions for that. It might have been better suited to have Liza or even Sean tormented differently than what we got. I was on board though for the research and thought that the ending worked as well.Taking this to the acting I thought it was pretty solid. There's something interesting that Holmes stars here. She seems to be the only one that is not British, even though it takes place in the United Kingdom. It doesn't hurt anything and I think she had a good performance. It was something I just thought of while watching this as it is never addressed. Yeoman was solid as the 'stable' parent who tries to be peace keeper. I also thought that Convery was really good. What is interesting is we see him normal briefly, then for most of the movie he has to convey things with his facial expressions. We slowly see him change to be more like Brahms as things progress which I thought was great. Ineson was solid along with the rest of the cast to round this out for what was needed.As for the effects in this one, I actually really don't have much negative to say if I'm honest. From what I remember in the original, the doll seemed to move, but we never saw it. This one we actually get to see the doll move and with the explanation that comes, it makes we wonder now if that was also possible in the original as well, at least at times. This can be subtle sometimes which makes it even better. I say this with a scene in the dark with a flashlight that I thought I saw something that did creep me out. There is a bit of CGI, not enough to bother me. It really seemed to enhance if memory serves. The last thing would be something that happens at the end I thought was a cool look. The cinematography I thought was really good though. They really use the whole frame where we will see things in the background that are blurry to be a bit unnerving, as well as seeing things move as well.The last thing to go over would be the soundtrack. From what I can remember, it fit for what was needed on the whole. What I wanted to bring up is that early on, Jude is playing a little piano and I'm pretty sure the song he's playing was used in the previous film. That is a good callback and then we get to see something at the main house as well which I'm assuming was that sheet music. It is an older song which makes it even better.Now with that said, I tried to come in without any expectations and having only seen the original once, I was a pretty blank slate. Do I think this is a great film? No, but I think it does some good things. I like the depth of the characters and the actor performance in bringing them to life. There are some interesting back-story elements that are introduced with minimal violation of continuity. The effects worked for what was needed and I'd say that the soundtrack fit as well. The only issue I really had here was that I found it to be a bit boring for whatever reason and I think it is what they focused on. I would say though this is slightly over average for me. Not great, but as a sequel it works and could be watched as a stand alone which I find impressive."}, {"id": 214, "text": "It's too my extreme surprise that I'm going to say this. Especially considering it's the sequel to a overly mediocre disappointment. But not only is it the best horror film released this year but also the scariest that I've seen since the original conjuring. The film centers around a family that survives a traumatizing home invasion. They decide to take a trip into the country unfortunately to stay in the guest house by the mansion from the original movie. Almost as soon as they get there the young boy, Jude played by an impressive Christopher Convery who has been mute since the incident discovers Brahms buried in the woods. Upon bringing him home stuff gets weird. Now I don't want to spoil anything by saying to much but this is the movie I wanted the first time around. The movie is smartly directed by William Brent Bell and has stunning cinematography and an atmospheric score. All of those goods are accompanied by some of the strongest work from Katie Holmes in a while. And Owain Yeoman who stars as her husband Sean is just gorgeous. For the first third the film is filled with a lot of jump scares and loud musical ques. But by the middle its build an effective atmosphere of mounting dread. If I had one complaint I would say that the ending is just a touch lackluster. That being said this is a scary movie. It might be because I went in with no expectations but I really liked it. Finally something that frightens me in that good classic horror way."}, {"id": 215, "text": "Not to spoil it for you, but the first film made only a modest profit, and that is because it had a very low budget. That first film makes the events in this film impossible. So it looks like this is just a reboot attempt since Brahms is a very spooky looking doll and could probably sell horror movie tickets if the theme is franchised, except, to tell you the truth, this film is a bit of a bore.The backstory is that there is a burglary that somehow traumatizes the young son in the family, although the details of this trauma are never told. So the family goes out to the country to regroup. The young son, who has simply stopped talking due to the burglary/assault, digs up the porcelain doll Brahms. He begins to bond with Brahms, as his parents sulk around the house, I guess feeling bad that they could not protect their son? So they let things go since at least the son is showing interest in something, but things get weird. Oh, and all you see of the burglar in the short scene dedicated to the incident is a shadow that makes it appear that the perpetrator was Popeye the Sailor.There are some dream sequences that go nowhere as far as the story goes because it seems that there is not enough story here to flesh out a feature film length production. I would say don't waste the price of a movie ticket on this one. Instead, just stream it when it becomes available.I gave this one 4/10 points because the atmosphere, cinematography, and acting are all very good. It's just too bad that the plot is boring and aimless."}, {"id": 216, "text": "After a burglary in their house in London, Liza (Katie Holmes) and her son Jude (Christopher Convery) are traumatized: Lisa becomes frigid with her husband Sean (Owain Yeoman) and Jude a speechless boy. Liza and Sean decide to rekindle their lives moving to a house in the countryside nearby the Heelshire Mansion and Jude's psychiatrist Dr. Lawrence (Anjali Jay) agrees that it would be benefit for him. While walking through the woods with Liza, Jude finds a buried porcelain doll and decides to keep it. Then they meet the groundkeeper Joseph (Ralph Ineson) and his dog Oz that walks with Liza and Jude home. Jude becomes obsessed for the doll that he calls Brahms and shows rules to be followed by the family that Brahms told him. Further, he changes his behavior and weird things happen in the house.The Boy (2016) is a surprisingly good horror film. The sequel Brahms: The Boy II (2020) is inferior to the original film but is a decent horror movie that uses many clichés, but startles in many scenes and entertains. The performances are good, the atmosphere is creepy, and the screenplay is acceptable. My vote is six.Title (Brazil): Brahms: Boneco do Mal II (Brahms: Evil Doll II)"}, {"id": 217, "text": "401. Brahms: The Boy II. What little kid doesn't want a creepy doll? Mom, Liza, and son, Jude are hanging out at home one night and they get attacked and robbed in their home in a very PG undramatic scene. Jude suffers from PTSD and doesn't say a word afterwards, and Liza gets the nightmares, so hubby Sean and Liza decide the best thing to do is get away from it all and vacation at a completely secluded guesthouse of a completely empty creepy mansion! Fun! Oh, and there's a creepy groundskeeper walking around with a shotgun and a big ol mean dog! Nice! Out of the many activities that they can do on this vacation like, looking at the woods, admiring the woods, or exploring the woods, they decide to take a walk in the woods. And this is when Jude discovers a hand sticking up out of the dirt, and he uncovers...a dirty old extremely creepy looking doll, and he obvi falls in love, and names it Brahms, well, that is the name Brahms told him to call him. Mom and Dad are like, eww gross, but it makes him happy, let's take it home clean it up! Within a short time, Jude starts turning around, while Liza thinks the doll is alive causing mischief, cause it can't be Jude doing these things. What to do, what to do... Internet investigation montage scene to recap Part I, give a little more backstory of course. It's not a great movie, honestly it felt they were going to go one way with it, felt rushed then went with a different route, it wasn't a terrible way to go, just felt they changed gears all of sudden. I liked it, i do like bad horror movies, add a creepy doll, makes it better. I personally now want a Chucky Vs. Chucky movie! Filmbufftim on FB"}, {"id": 218, "text": "Creepy dolls always make for good horror if done right and I think this one was a very good following of the 2016 movie. It was not a typical sequel and really could be a stand alone film and maybe it would have been better received if it had been. Katie Holmes give a solid performance as does Ralph Ineson who give it a very authentic vibe as both an Englishman and what I would call a tragic character. . It references the first movie without overdoing it in a way that makes it mysterious and something to be solved. The ending of the 2016 movie is not only explained but also has a twist that I don't think most saw coming. A good performance by Owain Yeoman as a caring and loving husband and father. Christopher Convery plays the part of the young boy Jude and makes it believable which is not always easy for a child in a horror/thriller movie. Sequels are always hard to pull off without it becoming a clique so I was surprised that it didn't follow the typical sequel movie. While it may have had some over dramatic touches it was not done so often that you get bored with the tension building. It does suffer some of modern day horror/thrillers and it is that of the loud noise jump scare which is used too much in modern horror and there was some of that in here. But, I don't think it was overly done IMO and someone else may think it is because it is hard to tell or know how many are too many and I did not think it took away from the story. I really like the history or mythology that is explained in it. I thought it made for a more interesting movie. There was at least one scene I would have done differently because the scene can be seen as too coincidental on purpose and I would have had it come about in a more believable way. All in all, it was a solid movie that told a story. As for the ending, that is for discussions on YouTube and other places. I would recommend it."}, {"id": 219, "text": "*NON-SPOILER*To start with, I'll say I was torn between a 6 rating or a 7 rating, but the average of 4.9 (at the time of writing) is far from a fair score.So, after the original film I thought Brahms the doll was gone for good, that was probably true until Jude discovers him buried in the woods and welcomes him into the family as his new favourite toy. One thing is for sure, you can't go around breaking Brahms' rules else you'll make him extremely mad! The film takes the typical cliché role that one parent (the mother) can see everything and the other (the father) is completely clueless and deep down, he thinks she's going a little bit mad. As the Mother gets whacked over the head by burglars in the beginning of the film, it has you questioning whether what she is seeing/experiencing is actually real or is she simply having repeatedly nightmarish visions/flashbacks of the earlier attack? When the family get a visit from their relatives, it goes without saying that Brahms isn't happy with anybody encroaching his space. I feel the film has had some unfair criticism. I can't really pick any fault with the acting, it's carried out with a lot of realism and sincerity. The story takes you on the usual horror adventure of loud sounds, mysterious actions and jump-scares. That said, there are some excellent effects towards the end and if you can get into this film properly like I was able to, then it will be enjoyable to watch.They're always so curious the littles ones are... Like moths to a flame."}, {"id": 220, "text": "I remember the original 'Boy' movie. I say down with absolutely no expectations and came out of it really surprised at how good it was with a small cast, creepy vibe and plot point that I didn't see coming. Therefore, I was only too happy to give the second one a go. I wish I hadn't.This time another family end up 'looking after' the creepy doll of an old fashioned little boy and the young child of the family starts acting weirdly. About the only person I knew in the film was Katie Holmes, who - sorry! - is looking very old these days. Plus there's a guy in the UK version of 'The Office' who is normally very funny (but wasn't here).If you've ever watched any sort of media that makes fun of the horror genre by pointing out every cliche and trope associated with such entertainment then you might as well be watching this film. It's amazing that a story can be written (unironically) that thinks it can be taken seriously while conforming to every stereotype known to the genre. The mother suspects something's wrong. No one believes her. Father blames the son. Plot points are started and don't go anywhere. The acting is substandard in places and there's a 'bully' who comes into the tale about half way through who is about the biggest cliche every known to film. Seriously, he's so one-dimensional that you can't help but laugh - then you remember that this is supposed to be serious and then everything bursts. Luckily, he's only in it for about five minutes, but his performance is so awful the film can do little after that to redeem itself.'Brahams: The Boy II' isn't really a bad-bad film. Put it this way... if it was the only horror film ever made it would be the greatest in its genre. However, it's so mediocre that it's just not worth bothering with as it's one of those hundreds of horror films that end up being sold off cheap in bargain bucket bins in petrol stations. Please no 'Boy III' movie."}, {"id": 221, "text": "REVIEW - BRAHMS THE BOY 2Have you ever noticed that these porcelain dolls seem to be spooky, they actually do freak me out with their eyes seemingly following you around the room.Imagine finding one which was actually possessed and which could actually move and possess a young person.Basically a simple horror (but I use the word horror very loosely) but not simply because it's so slow and not scary at all.Certainly a film to watch when you're doing nothing much else but other than that literally the first hour could be easily skipped through and you've missed nothing.Rating 4 out of 10"}, {"id": 222, "text": "Oh how I wanted this to be better! And it's not even that it's bad, it's just that it's so painstakingly average that it ends up being disappointing. I mean, you would think a sequel that literally nobody asked for or expected would have something really impressive up its sleeve but nope it's just vanilla and white bread all the way.A supernatural twist is added into this sequel and it's actually a pretty good idea, but it's all handled as generically as possible. There were so many times when I just thought well if I had made this I would have (insert better idea here) and that's never a good thing, especially for someone like me who doesn't tend to dissect the technical aspects of a movie on the first or even second viewing.I do adore Katie Holmes, but she's given absolutely nothing to work with here. It really makes me wonder what made her take this role although I'm glad she's willing to do horror of any sort. I also wonder what the hell she did to piss off the costume designer because she has the worst series of ill fitting sweaters this side of a 1997 Sears holiday catalog. Like girl, where the hell were your gays while you were filming this because I know you have plenty of them!Really the only saving grace is that it's a very visually good looking film and that would possibly be enough for a home viewing, but it left me with a total yawn in the theater. And yet......I'd still watch a 3rd one if it happened because if there's one thing I'm great at, it's not learning my lesson.Oh and Owain Yeoman has a very nice round ass and there's a scene where he's wearing grey sweatpants but awkwardly keeps his hands in his pockets and based on other scenes I'm pretty sure it's a directorial decision made to keep us all from clutching our pearls and passing out if you know what I mean. Take those silver linings wherever you can get them."}, {"id": 223, "text": "Of course I wasn't expecting anything much, even less than that. Perhaps it helped, but the result and verdict in the end is still below average. William Brent Bell has had a rocky road as a director in the horror genre, his most famous work is probably the first part of The Boy, which was certainly a notch or two better than its sequel. Having seen all of his movies, my personal favorite of his is the indie werewolf flick Wer. However, Bell's newest, Brahms: The Boy II, is a lackluster, an uninspired, slow and dull exercise of clichés with some amount of lost potential in the middle.I noted somebody somewhere saying how Brahms, as a sequel, nicely expands the mythology. Sure, it does, with the help of a story that feels both poor as an original plot and a poor excuse for a sequel. Brahms starts with a short introduction to a family, which suffers a violent house robbery. The tragedy-stricken family then moves out to the countryside, right beside the house of trouble from the first movie. Boy finds the doll, the evil flourishes slowly so slowly until the predictable and short-fused climax &amp; a typically pushed-in setup for another possible continuation. Brahms exercises all the usual horror tropes, it's not on-the-nose bad or cheap about it, but does it in a tedious run-down-the-mill manner with every next step more predictable than the previous. For many inexperienced genre fans Brahms could work like a decent thriller. The man, excuse me, doll of the hour has a creepy aura about it, and, perhaps, given a better story and more extreme direction, it'd make a decent modern horror icon of sorts. The actor ensemble does a decent job at portraying their rather familiar type of characters. Katie Holmes owns the highlight, and I always love seeing Ralph Ineson in just about any horror movie - the man deserves more roles, bigger roles. The technical/aesthetical departments of the movie work on a standard level, there's nothing truly impressive or anything that'd suggest and extraordinary creativity, but the production design and cinematography sure are done well enough.I fail to see the fear, scares or much of anything of memorable value in Brahms: The Boy II as it is just a standard, cliché pg13 horror movie about a creepy doll and happenings around it. My rating: 4/10."}, {"id": 224, "text": "LIKES:Some nods to the Original Tale Moves At A Decent Pace The Creepy Atmosphere And Look Of Brahms A Solid Opening To A Franchise The ActingDISLIKES:Predictable Not Scary The Lackluster Suspense Stories That Have Little Details Mediocre Character Development Trying to Retcon Part Of The Story The Set Up Of the Franchise FocusThe VERDICT:Brahms' second installment proves that money talks, and this film is a set up for a new face in horror in the near future. This story thrives on the creeps, acting, and franchise frenzy, hoping you'll ignore the previous installment and welcome the new direction. Some of these things work well, but overall the movie suffers from focusing on potential franchise and skimping on the stories and development other movies have succeed in. Throw in that the scare factor and the suspense are very lacking and you are once again bored in this tale that held potential and dropped it again. The Boy legacy continues to dance around maximizing scares and hybridizing other franchises to craft a haunting legacy that can leave more of a print. Yet, the movie will continue to be mediocre movie productions without tightening up the story and injecting a little originality and development into it. As such, this film would best be left to the Netflix viewing, rather than hitting the theater.My scores are:Horror/Mystery/Thriller: 5.5 Movie Overall: 4.5"}, {"id": 225, "text": "It has long been believed that a wide variety of objects, ranging from amulets to expensive stones, has ways to absorb negative energy and even become a haven if not for restless souls, but for demons and other sinister creatures from other worlds. In particular, all kinds of otherworldly guests adore children's toys, so that with their help they will interest the kids and, perhaps, try to take hold of their body and mind. That's why various dolls for many centuries have become objects of increased attention from occultists and demonologists of all stripes, who have written more than one book based on their research. In addition to folklore and frightening stories later told around the campfire, the cursed dolls also firmly occupied themselves with cinema, where they could boldly single out their own sub-genre of horror. At one time, the infamous Chucky, the main antagonist of Child's Play brought a serious rustle to the audience. Then in his footsteps went the cursed Annabelle, fluttering out from the Conjuring universe, having her own trilogy of box office spin-offs. When the abundance of deadly mystical toys reached truly sinister limits, the director William Brent Bell decided to join in with his movie under the title  The Boy. The film turned out to be very unusual on the one side in terms of frightening elements, but on the other it contained an element of scenario surprise, partly deconstructing a sub-genre of damned demonic dolls. And five years after the premiere, Bell returned to the big movie again with a completely new sequel Brahms: The Boy II, which, unlike the first part, brought an unexpected turn in the story of the doll named Brahms. Honestly, I even thought to skip the film, because based on the story that have been told in the first movie, it was supposed that everything should be pretty clear, and also if considering the fact that the film got a lot of negative reviews. But it wasn't there, I didn't expect anything, but as a result I loved the film. Great sequel no matter what other say! Of course, the film is a little meager of frightening moments, if comparing it with the first film, but it definitely deserves attention. So I really hope to see a new sequel, like Brahms: Creation to complete the story as the trilogy."}, {"id": 226, "text": "It's not often I'll give a movie 1 star. If I could have given this 0 stars I would. It's absolute garbage.What makes this so bad is the that first movie was excellent. But in what looks like a purely money making spin, the director and screenwriter decided that the first part of the original movie, with its suggestion of a supernatural doll, might have been the way to go. But it wasn't. The way to go would have been to write a prequel and gives us a backstory on the real Brahms who got locked behind the walls in the first movie. What could be more horrific than a child with mental health issues locked away to become a man damaged beyond all repair? But no...they went down the Chucky/Annabelle route and cocked it up.The acting is dismal. The 'frights' trite. The special effects juvenile. The plot predictable. It might scare a five year old but that's about it.Director, William Brent Bell should have looked to the fans of the original movie, studied their feedback and worked from there. I've seen better plots written by fans on Wattpad."}, {"id": 227, "text": "There isn't a single aspect of this movie that I can point at as being notably bad: the acting was okay, the basic premise was fine, the dialogue didn't make me cringe, the characters were more or less believable. However, it felt like nothing was quite what it should be. The initial trauma didn't seem nearly traumatic enough to cause the effect it had. Jude, the son with the doll, never felt very threatening. There was no significant escalation in the tension -- it started rather dull and stayed that way. The guest house they were in for most of the movie didn't add anything to the atmosphere -- it was just a normal, vanilla house. The twist at the end wasn't much of a twist.There were also a number minor details, things that had no bearing on, or relevance to, the plot, that didn't seem right. Like, who would take a framed family photo on a family vacation? I mean, if you were having trouble remembering what your spouse/child/parent looks like, you could just turn your head slightly and see the real thing. Who wears all of their jewelry and make-up to bed, especially in the apparent safety of their own home? Who doesn't start turning on lights immediately when something repeatedly goes bump in the night?This movie was creepy, but there was no tension. Not once did I find myself on the edge of my seat. Even things that I assume were supposed to be jump scares didn't elicit more than a few rapid eye blinks, if that. There were about 10 other people in the theater when I saw it, but I didn't hear a single scream or even a startled gasp. I did hear more than a few yawns, though.I guess if you want to see a horror movie but hate being scared, this might be the movie for you."}, {"id": 228, "text": "To my surprise before watching the movie I've seen only one poster and had no prior knowledge about the plot, so didn't have any expectations, but the desire to spend an hour and a half trembling in the seat was strong.Cannot say that memories of Owain Yeoman goofing with British accent in The Mentalist completely destroyed my perception of him speaking Queen's English, but the atmosphere got huge crash each time I heard his lines. Katie Holmes also didn't help with her futile tries, but at least they both delivered a decent performance around the backbone of the film.I don't know whether this is a sequel of a completely different story, but even after sitting through the whole movie I didn't understand a thing. It is always good to have plenty spooky props, however, if you stuff the frame only with creepy stuff it will soon get boring. That's exactly what was bothering me entire movie: no backstory or simple unveiling of reasoning - just events that mostly happen behind the scenes relying on your imagination and a confusing finale.The actual horror stories of the past were quickly mentioned and this gave hope for at least a bloody massacre but again the gun was loaded with blanks. This teasing simply delivered a killing blow and left a huge emptiness in the place where I was supposed to harbor my before sleep terrors.I will say only this: if it was some kind of origin story - it has miserably failed to hook us with a cheap plastic bait. If it was a sequel and everything was explained in the first movie - then relying on people knowing the backstory was a fatal mistake. In any case, I am hugely disappointed and afraid only for the future of horror if this kind of movies will keep on appearing."}, {"id": 229, "text": "SYNOPSIS: After a break-in and robbery occurs, Liza (Katie Holmes) and her family decides to move. They end up moving into the Heelshire Mansion and find a doll where things then strange things begin to happen.REVIEW: To be honest, I had no idea anyone asked for a sequel to The Boy and I didn't even think the first one was successful enough to green light a second. On top of that, I swear not the writer nor director knew there was a first film, because it's like this film completely changes all of the plot lines the first one set up. I didn't mind The Boy at all, but I definitely felt it should be left alone after one. Everything from beginning to end was simply not good for the lack of giving constructive criticism. I didn't feel scared one time and I was bored throughout. The direction and writing were atrocious and the child actor Christopher Convery was not good. I always say I don't like to go down too hard on child actors, but this was just so bad. I don't understand why the Director (William Brent Bell) didn't help guide him more. I blame that completely on the director. This should not have been green-lit and the Writer (Stacey Menear) and the Director should not have been signed on for the film as it's clear they have never done a horror film and don't have a real idea of how to make one. 1/10."}, {"id": 230, "text": "Really disappointed. First of all i'm surprised the first film even got a sequel, i personally liked it but know that it wasn't amazingly received and i don't know a lot of people who've seen it.Without spoiling anything, what i liked most about the first film was the massive twist surrounding brahm &amp; the doll.This film took what made the first film standout (possessed dolls, especially anabelle, have become very popular) and it took a big steamy sh*t on it.There is nothing original about this film, it's predictable, not scary &amp; very underwhelming as a whole. The only reason I gave it 4* is because I liked the actors in it (even though no one particularly acted impressively) and the film did keep me engaged until the third act.I'm just going to pretend this film isn't canon and the story ended at number 1."}, {"id": 231, "text": "I had absolutely no expectations going into this one at all. Which I think helped me, because I don't think it's that bad. However I do have some issues with itAs I'm sure you've seen in the other reviews, people saying that it ruined the original. I'm likely to agree with this, because what made the first one so good is the twist that it wasn't actually the doll but a bloke living in the walls. This film goes more supernatural and completely off track to the first. Would have been better off making this a new film entirely than a sequel.The film itself isn't too bad in all honesty. My main issue was what I've written above and the ending was proper flat. It leads to this big ending scene and it just fell a bit dead for me. It's kind of a running trend throughout to be honest, thought it was just slightly flat throughout. Needed a bit more depth and action if you will. The kid is exceptionally annoying as well. Genuinely wanted to punch his lights out on several occasions. Just a heads up for youOn the whole though I do think it's watchable, I wouldn't bother watching if you are only watching if enjoyed the first, because of the differences, but if you are feeling a relatively simple horror to watch this ticks the boxes. 5/10 from me, average."}, {"id": 232, "text": "An incredibly pointless, dull, and incoherent sequel- The Boy II makes the worst of its charisma from the last film, and offers absolutely nothing new or worth your time to the fullest extent. There are many flaws with this film, so I will start with the positives. Katie Holmes tries her best. Granted her lines, character, and situations her character gets into can all be rather predictable- but she does give the performance all she can, and I have to give her credit for at least trying. Besides that, this film is honestly a joke. Most of my complaints of this film come from the films final act, but the first two acts of this film are incredibly dull and provide nothing but a dragged out setup to make this film even exist in the first place. It feels like a cash grab so often, that I honestly wondered if anyone making this film behind the camera did it for any other reason than money. Finally, the main issue I wanted to address, was the last third of this dreaded film. Not only does this film contradict the original in so many ways that it begs some questions, but it also contradicts itself. There are a few moments to the end that clearly make no sense, with the dad acting like he just found out about everything he had already been told. Not only is this moment ridiculous, and serve only as a reason for him to come into the frame when needed, but the constant illogical measures it goes through trying to counter the original film is incredibly annoying and honestly ruins it all together. I won't spoil what they did exactly, but needless to say it doesn't make any sense, as with the very last scene of the film where all logic just seems to be completely thrown out the window. In the end, Brahms: The Boy II is a completely useless and forgettable sequel that really is better left for the bargain bin at your local Walmart than in any major theater. Trust me, if you are a fan of the first film, enjoy horror, or just like even remotely good films, don't see this one. Chances are you'll have the very same response. My Rating: 2.5/10"}, {"id": 233, "text": "Better than I thought it'd be, but it's still not good!The main adult actors all did good and I have no complaints and Ralph Ineson was a scene stealer due to his performance. The beginning scene was amazing, I loved how it preferred longer takes and some kind of subtle scares that I thought would appear once in a while in the rest of the movie. The production dragon was also good and, while not Oscar worthy, did compliment the tone of the movie. I guess I also liked the editing, but with an asterisk, I like the editing* because some of the dialogue was weirdly shot with too many close ups for minutes and it wasn't my favorite.Complaint time! The scares were not good, like I said I liked that the beginning had things in the background that weren't presented with jump scares to make you tense up then feel nothing afterwards. However, the rest of the movie was jumpscare and REEeEeEeE, that gets old quick as always and I wished they were better. Same goes with the music, the music could've used some more originality and less of the, you know, ReEEeEe? The continuity with The Boy was non-existent, the movie almost completely forgets the other movie except for creepy doll is creepy. I never watched The Boy but I have seen scenes of the movie and I know that there's nothing supernatural with the titular folk, there's a person in the wall. This movie has the doll looking around, moving around, and talking to people telepathically? Really? Also this movie is remarkably cheesy, it has two times where a person does a Google montage where they find out things about the doll and it's a very lazy trope to give expositions, I'd say the only exposition that kind of works for me is when local townspeople tell tales about the doll, but it goes on for too long.Overall, not a bad movie for one that came out in January, but this came out in February so it doesn't get the January pass. I'm tired now, I might watch some good movies..."}, {"id": 234, "text": "The Boy: Bramhs Curse is the sequel to The Boy from 2016. This sequel is again directed by William Brent Bell, who also directed the first film. Jude with Bramhs In the film, mother Liza (Katie Holmes) experienced a violent robbery and therefore decided to move with her family to the remote Heelshire country house. Here they try to process the robbery. Her son Jude (Christopher Convery) is so traumatized that he hasn't spoken a word since the robbery. When Jude finds a buried lifelike doll in the garden of the mansion, everything suddenly seems to go better with him. Liza is happy that Jude is doing better now thanks to the doll he has found and calls Brahms. As Jude starts to behave more and more strangely, Liza Brahms starts to blame and so she gradually learns about the diabolical powers of the doll.This film was made by the same film crew who also made the first part, but still know how to make a completely different film. That way you could watch this new film without ever having seen the first part. Both films don't really feel like a film series either. The film soon loses tension, because Katie Holmes's character is doing more research on Brahms instead of Brahms doing scary things. Brahms also copies many actions from other horror puppets from other horror movies. If you are familiar with the Chucky or Annabelle films, many moments from this film quickly come across as familiar. Because of all the familiarity, the film quickly comes across as a long-winded one.The acting is good, but not that special. Katie Holmes does her best as the lead actor, but because of the bad script she sometimes seems a bit stupid. Christopher Convery has little text and is not as credible as a traumatized young person who is influenced by a doll. Ralph Ineson plays a ranger from the Heelshire estate, but his character appears to be from a completely different film."}, {"id": 235, "text": "This is, in a lot of ways, the mirror image of the first movie to me. In The Boy, I found the first two acts to be mind numbingly boring with a final act that was flawed but moderately entertaining. In The Boy II, the opening acts are interesting and the finale is just a hot mess.I really wonder how my experience would have been different had I not seen the first one. The only real redeeming factor in The Boy, to me, was the concept and in this one, in an effort to up the stakes, they completely ruin what made the original interesting. There's one moment especially that's just groan inducing because of how much nonsense it is in this universe.Rules are a big thing for me. A movie can build whatever universe it wants, establish whatever rules it wants, but then it has to live in those rules in order to work. The Boy built this universe and set the rules. Brahms takes those rules, crumpled them all up and tosses them in the trash and that just doesn't work.We have Katie Holmes here as our leading lady and she was just bad. Her partner in the film, Owain Yeoman, is doing what he can and he's ok? The child actor, Christopher Convery, does some child acting. The bigger problem is that this screenplay/script is ridiculous and these parents are awful. At no point do I care about any of them as individuals or together as a family.Still, there's some mild entertainment to be had for the fans of bad horror movies. This really felt like it should have been a straight to home video or streaming movie, does NOT warrant the big screen treatment."}], "reviews_amount": 236}