{"name": "Trauma Center", "titleId": "tt09625664", "reviews": [{"id": 0, "text": "Okay movie. The female lead Madison was great. Her acting was great, the things she did in the movie were smart and believable so her character was written well. The actor who played pierce however was weak. Tulls portrayed a believable dirty cop. Bruce Willis man this is hard to write bc I am a true fan, but he slurred his words and appeared drunk in most of his scenes. Unfortunately this movie is only 5/10 bc it has a weak storyline (dirty cops shoot good cops with their police gun) so the bad guys were a bit too dumb. They should have added 10 more mins to the film to give it more background/depth and it could have been a great movie. It's still worth watching. I was entertained throughout and actually watched the whole thing without getting distracted. Better than most Netflix films."}, {"id": 1, "text": "Slick shots and the slow build up of atmosphere turn a mundane hospital into something threatening and scary for the heroine. Bruce's character wasn't needed but I get why he's in it. Otherwise, the story kept my attention and was done well as a single location thriller. 5/10 for me."}, {"id": 2, "text": "If you overlook Bruce Willis talking very strangely this Puerto Rico based thriller is an okay TV movie. After witnessing a cop getting killed a pretty waitress played by Niki Whelan gets shot in the leg and is sent to the hospital. The bad cops who shot her go after her and it's a watchable game of cat and mouse in the hospital. Things get a bit too much for one woman."}, {"id": 3, "text": "This movie is OK but Bruce Willis' acting is very ham. I have no idea why all of a sudden he seems to have lost the ability to portray a believable character.Apart from that, Nicky Whelan carries this movie from start to finish with superb acting. Unfortunately, the story is a bit sparse in depth.OK to watch if it comes on telly, but I wouldn't go out of my way to see this again."}, {"id": 4, "text": "The story has been told many times and the script is simplistic, bordering on clichés - but with some deft direction, camerawork and a great lead actress to anchor it all, it gels nicely into a tight 80 min thriller. Don't expect a Bruce Willis star vehicle, he's not in much and probably would have done without but that's not how these movies get made. The Puerto Rico vibe added some fresh environments to it as well. Overall, I'd say this was a decent thriller that hits all the right notes for a bread and butter genre fare."}, {"id": 5, "text": "After the film kicks off in the hospital, there is really no stopping. It became almost unbearable at the end, nearly reaching the point of overkill. When you have a thriller filled with so much tension throughout its running time, there's only so much you can do before you start yelling you gotta be kidding me at the screen.The cinematography was beautiful and moody and the performances were fine, except maybe Bruce, who I felt was too wooden, making his character a little bit unlikable.Trauma Center was a solid effort and a great addition to the chase/thriller genre with a little twist."}, {"id": 6, "text": "Matt Eskandari's Trauma Center is another example of those quickie Bruce Willis' VOD releases that clocks in at 87 minutes. This somewhat entertaining suspense thriller, however, features a splendid performance by Australian actress Nicky Whelan as a woman in jeopardy. She is the heart and soul of Trauma Center. Madison Taylor (Nicky Whelan of Inconceivable) witnessed a crime, and two corrupt Vice cops, Pierce (Tito Ortiz of Cradle 2 the Grave) and Tull (Texas Battle of Hard Kill), wind up stalking her at the local hospital. Madison is awaiting surgery to have a bullet removed from her thigh. Pierce wounded her in the thigh during a shooting incident behind the restaurant where she works as a server. Pierce and Tull are desperately struggling to clean up their mess once they have murdered Bruce Willis' partner.Neither Pierce nor Tull cannot put Madison out of their misery because Lieutenant Steve Wakes (Bruce Willis of Die Hard) arrives like the heroic cavalry. He sends these two thugs packing with several pistol shots, but he cannot identify them because the shooting occurs at night. Now, the screws come loose in Trauma Center, because the only doctor on duty (a bespectacled Steve Guttenberg of Police Academy) at the Puerto Rico Hospital where Madison winds up says they have no surgeons on call to remove the slug. Pierce and Tull slip into the hospital and spend about 45 minutes tracking down our beleaguered heroine. Meanwhile, Lieutenant Wakes is off elsewhere trying to solve the crime and about to discover something more surprising that he thought. Little does Wakes know Pierce and Tull were involved in the murder of his partner. Indeed, as a measure of safety, Wakes has confined Madison to a floor on the hospital designated for infectious diseases, and he has stationed a uniformed officer, Jacobs (newcomer Jonathan Galanis) to watch over Madison. This character might as well have bullseye painted on his forehead. You know he won't be around long. Indeed, Pierce and Tull have no problem disposing of Jacobs, but Madison proves to be a major headache for these two trigger happy killers. Their chief problem with Madison isn't that she has seen their faces. Instead, when Pierce wounded her, he put a bullet in her that can be ballistically traced back to his pistol on file at the police department!Eskandari and sophomore writer Paul Da Silva milk the suspense factor for everything it's worth as Madison tries to fend off these fiends. Naturally, Wakes is away from the hospital trying to take care of business, while Tull and Pierce tangle with Madison. Considering her dire circumstances, Madison is pretty damned heroic herself and relies on her ingenuity to save herself. Predictably, she is trapped on a hospital floor where nobody other than the defunct Jacobs has been murdered while our villainous scour every nook and cranny for her. Preposterously enough, Madison resorts to climbing up into and crawling through the air conditioner vent to elude them. This amounts to nothing more than a delaying tactic. Earlier, Eskandari and Da Silva set up a situation that they pay off after Madison finds herself stuck in the hospital. It seems her impressionable teenage sister, Emily (Catherine Davis of The Truth About Lies), suffers from asthma, and she visits her big sister at the restaurant where she has an asthma attack, but she forgot to bring her inhaler! Emily winds up in the hospital, and Madison refuses to spend the night with her scared sister. Naturally, when Tull-the thinking one of the pair-learns about Emily, he decides to use the teen as a bargaining chip. The action gets rather lively during the third quarter. Once the crooked cops catch Madison, they zip tie her to a friction board and use a defibrillator on her to loosen her tongue. Eventually, she returns the favor. The cat and mouse game of survival that Madison plays with Pierce and Tull qualifies as the high point of this boilerplate thriller.Trauma Center has enough moments to make the grade. Although Bruce Willis appears in it, Nicky Whelan has the choice role and her example of empowered womanhood stands out. Let's not overlook the villainous duo played by Texas Battle and Tito Ortiz. You will hate them by the time Trauma Center runs out of trauma."}, {"id": 7, "text": "Shot in just a short time frame, the filming was actually good. The story was predictable but entertaining. I simply could not get past the poor acting of Bruce Willis! I love him as an actor, ever since Moonlighting on TV. He was just emotionally absent, his voice stilted and monotone. In no way, shape or form believable. Steve Guttenberg as the Dr. was also a disappointment. These are veteran actors that we expect to sell the character they portray and neither of these actors delivered. Even in a lower budget movie, you expect these actors to deliver a great performance of their character. Nicky Whelan actually carried the movie and kept you determined to try and finish it. I've watched many movies repeatedly, this will not be one of them. Don't pay to watch it, wait for it to be free somewhere on TV and only if there is nothing else to watch."}, {"id": 8, "text": "Its highly enjoyable with a few fun chase sequences and some decent action but it takes two steps backwards in its simple script. Still worth watching but lacks the charm it could have needed to go over the top."}, {"id": 9, "text": "Decent acting, great camerawork and at 85 minutes the pacing is brisk. For what it is, it's actually one of Bruce's better recent action/thriller programmers. Granted the lead actress carries the show. It's mostly about her suspenseful and tense chase from the bad guys who are after her inside the hospital."}, {"id": 10, "text": "Very catchy story, several nail biting moments waiting for the shock that nearly knocked me off the couch, but this is by far THE most awkward acting from Bruce's side, felt the character were misplaced compared to many of the past great movies he attended / roles he played. Where'd the spark go?. However it won't change the way I see Bruce as a God talented actor."}, {"id": 11, "text": "(Trauma center) Positives - * Good Low budget Thriller * Decent cast * Good enough Acting * You get what the movie title says, nothing more nothing lessNegatives - * Could have done a better job with Bruce Willises characterOverall worth watching 👍"}, {"id": 12, "text": "I like it, there is tension in the movie. Bros vilis is not in it best, but still the movie not so bad."}, {"id": 13, "text": "Has to be one of the worst movies ever made. Don't waste any of life's precious minutes on this loser show."}, {"id": 14, "text": "This would have to be the worst Bruce Willis film I've ever seen in my entire life half the time while he's trying to act he sounds like he's on drugs and spaced out or acting like he's slow or something. He seems to be on something during the filming of this movie because it is completely different to a lot of his other acting and its absolutely bloody terrible. The amount Of plot holes are unbelievable And some of The situations this film portrays are so far-fetched and downright ridiculous. If I can stop one person from watching this film that would be a Small success! You can watch anything else that's out at the moment and I can guarantee you it would be 100 times better than this garbage movie . It's such a shame because this could've been a Great film And done so much better but clearly they're trying to Cruise through dropping certain names on this film when clearly it's a money grab and hopefully they won't get rewarded for such a bad script"}, {"id": 15, "text": "WHAT happened to Bruce Willis and his acting?! This was a disaster from start to finish."}, {"id": 16, "text": "Comes across mostly as a clever low-budget thriller with a brilliant set-up which almost works but is ultimately let down by a flawed execution. The drama of this main event starts off well and the lead actress Nicky really delivers a stellar performance, but the terrific scenes of suspense are undone by inexplicable plot contrivances or wooden acting. Flaws aside this is a good, solid movie, it has just the right running time and plenty of suspense. Worth a watch if you can overlook the inconsistencies."}, {"id": 17, "text": "Took down a glass of ice cold bourbon and sat down to watch this with no expectations. A simple but compelling premise which obviously harkons to die hard in a type scenarios. From a technical standpoint the movie is very competently designed. Stylish camera moves, NO annoying shaky cam or constant fast editing that destroys so many of these low budget action thrillers. The single location was well utilized to maximized effect.The director elevated the look/tone and style in a great way. The acting was decent as well, Nicky as the heroine being the standout. Bruce is playing Bruce(John McClaine) as usual but nothing of standout from him here. The major weakness was from the script, it works as a boilerplate chase thriller but needed a couple more surprising twists or turns. I almost expected Bruce might even turn out to be a villain but that never happens. A missed opportunity imo. Otherwise, this is worth a watch if you want something tense, suspenseful and unexpectedly well crafted. 6.5/10"}, {"id": 18, "text": "The film starts of bad and only gets worse. Terrible story, shoddy directing and a actor who has forgotten how to act.The final straw for me is at the point when one of the police officers just realises he's lost a micro SD card. It is the biggest load of drivel I have ever seen."}, {"id": 19, "text": "Not a bad movie overall, well worth the watch.Dropped a few stars because of some of the bad acting. Not sure what is going on with Bruce Willis, but it's like he's forgotten how to act. I hope that he wasn't paid a lot for this movie, his performance almost wrecked it. Shame on you Bruce. He wasn't the only actor having issues."}, {"id": 20, "text": "I think some of the reviewers are being a bit harsh. I was surprised by this movie. Yes, it is still a lower budget movie, but what they did with it, elevated it. The acting wasn't that bad, especially from the main lead actress she really showed a ton of range. The production and cinematography were very good, providing for a very suspenseful settings, and at times creepy surroundings in the hospital. It had a GREAT soundtrack that help elevate the suspense. My only complaint throughout this movie was the Bruce character. Was he needed? No... but I doubt this movie gets made without him. He's only in 15 minutes so not a big deal.If you are a big fan and follower of Bruce skip this, but if you like tense suspenseful thrillers this is a movie you want to see."}, {"id": 21, "text": "Trauma Center is definitely a B budget film. Truly the only redeeming part of the movie is the acting of Nicky Whalen. The rest of the cast were painful to watch and Bruce Willis was at the level of Steve Guttenberg, which is just sad to even type. I'm not sure if it was the writing, the directing, or just his I don't give a dang approach to movies anymore...but it was painful to watch. He used to be a favorite of mine but lately...no.The overall premise of the movie is good, but lots of ridiculous portions of the film that caused it to be unbelievable. The main character spends the movie trying to avoid the bad guys but the entire time she is about the loudest person trying to escape...and also goes between doing the dumbest stuff to being really smart at the flip of a switch.Big plot gaps include things like she's bleeding profusely but no blood trail is ever on the floor for the bad guys to follow; The good cop knows she has a sister in the hospital but never puts her under protection or checks in with her; bullet isn't removed from her leg in the ER but is planned to be done the next day; SD card drops from a pocket and is noticed missing (you aren't going to feel that drop out of your pocket).If you can ignore the major issues, and the bad acting, it's not a complete waste of time on a rainy day. But it better be a last option in my opinion."}, {"id": 22, "text": "How dumb are the vice cops / bad guys. At every turn they miss this woman, make the wrong decision.Movie would have been better and more believable if they aren't such idiots.The main actress is quite good. Lala from Vanderpump is in it, so that's funny. And Bruce Willis gives like a C+ effort performance.All in all, it being short, consumable, I'll give it a 5. Could have been higher with better bad guys."}, {"id": 23, "text": "It is truly unbelievable how this movie managed to get released. It is with all honesty really really bad. The acting was probably the biggest disappointment. While turning on this movie I didn't have many expectations. It was supposed to be the movie you play in the background while doing something else. But this movie could not even fulfill this role. It was cringe worthy and honestly just sad to look at."}, {"id": 24, "text": "The story is chase into the maze of the abandoned levels of a trauma center hospital. There isn't a lull in the action although, to be honest, the premise is fairly straight forward. That doesn't take away from going along for the ride. Madison Taylor (Nicky Whelan) is a struggling waitress trying to take care of her younger sister Emily (Catherine Davis) after their mother has passed. Taking a bullet to the leg she is rescued by Det. Steve Wakes (Bruce Willis).Willis pops up periodically as a policeman trying - and mostly failing - to keep Madison safe. But he ultimately proves to be a distraction from the scenes in the film that work best, in which the heroine tries to make use of the scant resources of an under-stocked medical facility to beat the bad guys and survive.Nothing crazy or surprising but it works as a well executed and tense action thriller."}, {"id": 25, "text": "Isn't not hard to jump into this one from the premise if a brisk/tense thriller is what you're after. It's got a well acted ensemble and of course Mr. Willis has small cameo as a grizzled Detective. Best parts are watching Nicky as the heroine doing her best to survive and fight back against the corrupt cops. Tito surprised me with how menacing he was. Impressive action and well shot cinematography for whats a smaller budget."}, {"id": 26, "text": "Trauma Center is hardly a perfect film as others have mentioned, there are plenty of things here that feel tacked on, implausible, or even ridiculous. But surprisingly, we find ourselves left with an impression of overall integrity and artistry which is quite the feat, considering the obvious low budget (12 day shoot schedule) and a number of otherwise un-subtle elements in the mix.Above-average cast, great character arc for the lead heroine and outstanding cinematography make this one stand out from the usual B movie action progammer fair. Making a single location thriller work take skills and that's on display here. Worth a stream."}, {"id": 27, "text": "This movie is badly made, all actors and actresses are not performing, they are just reading their lines. The movie is full of errors, flaws, contradictions and exaggerations. It seems like it was directed by 10 years old kid."}, {"id": 28, "text": "I'm a sucker for tense single location thrillers and this delivered everything in the genre. The acting from the cast all around was superb Bruce while not his top shelf self was better then expected for the few scenes he's in, the action is very well done and the pacing and atmosphere was top notch. Awesome seeing Nicky own every scene she's in and build up to end where she kicks the guys asses!"}, {"id": 29, "text": "But after making this film, just retire...It looks like you've forgotten how to act Bruce (not that you were a good actor anyway), and those idiot cops who can't even talk properly are just as bad.How can you pat your jacket and realise an SD card is lost? Ha! This film is a joke from start to finish. In fact, just as bad as those balloon lips on Madison's sister.OMG - dreadful, simply dreadful!"}, {"id": 30, "text": "Never gonna be an Oscar winner but an easy watch to stick on with the parents.Bruce Willis has a bit of a strange accent at times and acts a bit wooden but you let him off because it's him!Nicky whelan is very easy on the eye but at times her actions are not believable.Some of the writing is poor and at times it's very cliche. Got a home alone vibe to it!"}, {"id": 31, "text": "This is another recent Bruce Willis makes a cameo action/thriller flick, but a definite notch above many of his other films, at least in production values. The photography and acting from the main actress is above par and shows some range from scared to emotional breaking down. The direction is tight and I lked the score also. Anyway, it's fairly low-brow entertainment, but at least it is entertaining and fun to watch."}, {"id": 32, "text": "No shaky cam, no fast cuts, just a great build of tension and suspense and solid pacing. Nicky as the main lead really owns this and kept me engaged as she slowly comes through it as weak/scared and then into a badass. One of those thrillers you can watch and just enjoy. Well done all around."}, {"id": 33, "text": "Bruce willis was definitely not into this part and was merely reading the script, one of his worst acting jobs to date. Why signup if your not willing to get into the part!"}, {"id": 34, "text": "In terms of action, and hence entertaining, it delivers. The film uses a limited setting and a limited timeframe for its story, not many nonsense distractions, it's rather straight to the point about a girl on the run from a gang of corrupt cops. That's what I personally like in action thrillers.Of course, the story is simple, characters not complex and dialogues rather basic, but who watches a film like this for that? What do some people expect here, Shakespeare?You want something simple that won't win Oscars, just to sit back and relax, then you could do a lot worse.Normally I would give it a very solid 5, but now a 6 it is."}, {"id": 35, "text": "Loved this, felt like a breeze at 80min, Nicky was a badass and I wanted even more from her. Stylized and the best sequence has to be when the lights go out and it's flashing!"}, {"id": 36, "text": "Was Bruce Willis broke and was forced to do this? Bad or there was no director doing this movie. This movie deserves to be trashed forever."}, {"id": 37, "text": "From script to acting to directing, hard to choose what was worse."}, {"id": 38, "text": "The story is pretty damned stupid. A massive and all night chase inside closed floors of a hospital, by 2 burly, armed cops who can't outwit a slim young unarmed woman several times. Several people are killed including a policeman and a security guard and no-one seems to notice. The action is piecemeal and not very well directed, although you can't help feeling a bit of sympathy for the main character, Whelan. Bruce Willis is the 'hero' who's acting is absolutely 3rd rate. I was actually slightly ashamed for him, it was embarrassing to watch and I am sure that on many occasions he was reading his lines (badly) from a screen in view. This is a 3rd rate B movie which was probably just a payday movie for Willis. Oh how the mighty fall."}, {"id": 39, "text": "Imagination to use every single way to create tension through the movie in every single scene (once the action starts).The movie is short and doesn't try to do more than it should. And that's not a bad thing, and makes the movie really good, but also doesn't make it a 10.There are some twists (little twists), and the first one comes too early. The characters are beyond shallow, which again, it doesn't really matter, but could've used just a bit more depth. There is no point, really. Not even a thin one.What's the point of the movie? It's about something? Again, even a thin theme or idea?It's really good, but it's so shallow I can't consider this one more than that."}, {"id": 40, "text": "Did you loose a bet? One of the worst films I've ever seen."}, {"id": 41, "text": "I would warn of spoilers but you can't spoil something this rotten.. Bruce is the new Cage, you would not believe this is the same guy that was in Pulp Fiction and Die Hard, nothing good about this one.. anyone that scored this more than a 2 is deluded.. utter crap... Go to your sock draw, stand on one leg put a peg on each nipple and lift your left hand above your head, now open the draw and watch your socks for 90 mins while holding that pose.. I guarante you'll have more fun doing this than watching the movie.."}, {"id": 42, "text": "Sort of reminded me of those old school 90s Die Hard in a insert xxx place scenarios. This one is a female waitress on the run from two corrupt cops in a hospital. Lots of tension/suspense set pieces that were well executed for the limited location and were the highlight of the film. If you're gunning for Bruce he's not in it much but the few scenes he's in there's some decent chemistry between him and Madison(played by Nicky Whelan) Worth a check out if you're into a cool/tense action programmer."}, {"id": 43, "text": "This surprised me. Didn't know a simple concept could keep me on the edge. The hospital was well shot and there was only a couple gory scenes.... when Madison had to perform surgery to remove her own bullet(ouch). Otherwise it's mostly some horror/chase sequences and couple fight scenes. Honestly was a little too predictable in the end and too short."}, {"id": 44, "text": "Great acting, well shot and nice use of the hospital location to create atmosphere and suspense. Fun thriller to throw on for a rainy day."}, {"id": 45, "text": "The story is very well know but the problem is the Acting this is one of the worst Bruce Willis movies ever . I have seen kids play that were better performed."}, {"id": 46, "text": "I normally love ALL of Bruce Willis' movies but this one is the worst! The acting is absolutely horrible! Aww Bruce whyy?????"}, {"id": 47, "text": "This is possibly the worst all round movie I have ever had the misfortune of sitting through, it's films like this that can finally push people over the edge. Watch at your own peril!"}, {"id": 48, "text": "The dialog and the script of this movie is absolute bonkers; loose a micro sd card in a major hospital, oppositie party finds it on a floor midst action fighting for her life... and rather randomly the bad guy midst another dialogue suddenly pads his chest and bursts out i lost the memory card!?! How the hell did he feel that. I cant even find a micro sd card on my desc if i placed it there myself.... Ha ha ha, this is the the worst movie i have seen in a very long time. RIP Bruce Willis"}, {"id": 49, "text": "Lots of suspense and atmosphere. Great shots for single location thriller."}, {"id": 50, "text": "I only gave this 2 stars that is only and only for Bruce Willis. I seriously don't get why the hell did he even do this movie? no proper background information pathetic acting and editing and overall a huge disappointment."}, {"id": 51, "text": "Brucie fan but he slept through this one - or at least I wish he had! Hammy acting from the off. Give it a miss!!"}, {"id": 52, "text": "Wow this wastoo crummy to finish. bad acting. bad writing."}, {"id": 53, "text": "If you want to watch a movie plenty of inconsistencies, lame edition and a failed script, this is it. The most accomplished character is the one performed by australian actress Nicky Whelan. Bruce Willis did not know how to compose his character from the beginning till the end with the artificial lines he had to say. The two corrupt cops seemed taken from a home alone movie."}, {"id": 54, "text": "I registrered an account at imbd just to leave a review for Trauma Center. This is by far the worst film I have ever seen. Every single thing about it sucks, poor acting, poor story, everything is just so terribly bad. 10 minutes into it, the only thing that would save it from a 1 would be if all involved making it self-ignited and died at the end. No such luck though."}, {"id": 55, "text": "What hospital can't remove a bullet 1 inch under the skin? Use some hemo stats or tweezers . Wow this movie is as bad as courier, all takes place in one area. Please Bruce no more. Once respected now rejected"}, {"id": 56, "text": "It's probably the directors fault but within 5 minutes I experienced the worst acting ever. Did not even bother continuing the movie..."}, {"id": 57, "text": "I love it just the type of movie I have been waiting for. Go for it you won't regret it"}, {"id": 58, "text": "Definitely not something I would pay money to see but on the whole it wasnt a bad movie. Someone else mentioned Die Hard in a hospital and that's pretty much what you getNicky Whelan is great in everything she does IMO and she carried the movie prety well. Bruce Willis' acting was horrendous and it makes me think he owed someone a favor and just mailed it in.Other than that, if you're bored and devoid of something to watch, this one isnt a horrible choice"}, {"id": 59, "text": "This must be one of the worst movies i have seen, or tried to. Had to turn off after 20 minutes. Even Willis was bad. Acting and dialogue was horrible, stay away."}, {"id": 60, "text": "I don't know i saw this movie when it was clear that it was garbage by the reviews. After this i will have to see Die Hard again, because it can't be the same Bruce Willis. It just can't."}, {"id": 61, "text": "It was as if I was watching a bad play ... terrible acting of Bruce just like he was a robot, just like the other actors."}, {"id": 62, "text": "Every single actor, even Bruce, was terrible. This probably had a lot to do with the script which was probably the worst I've ever heard. The two killers remind me of Tweedledee and Tweedledum. Or maybe kids in a middle school play."}, {"id": 63, "text": "Embarrassing and nonsensical drivel from start to finish. At times bruce willis seemed drunk. The plot could have been ok but so much didn't make sense. To be perfectly honest i couldn't wait until it was over."}, {"id": 64, "text": "Don't spend your valuable time with this nonsense. He is getting worser than worser in his each film... for his next film imdb should start to put minus figures for the evaluation"}, {"id": 65, "text": "Haven't seen this movie yet so I would not rate for it. Just that the plot summary looks very familiar to a Chinese movie released couple month earlier, 'Chen mo de zheng ren', which tells a story of some criminals try to retrive a bullet from a corpse and a medical examiner and his assistant try to prevent it. Will see if these two are identical."}, {"id": 66, "text": "This might be the funniest movie I've ever seen.The acting is something else. It seems like the scenes that includes Bruce Willis are filmed with body doubles. Its like he is just reading the lines from a teleprompter.The plot is extremely bad.It is so many errors and bloopers that it deserves cult status!! Thriller rating: 1, Comedy rating: 10"}, {"id": 67, "text": "Bruce Willis' last nail in the coffin as an actor. Isn't it better to quit when you are on top of your career instead of play in this low budget crap? This is the stupidest movie i have ever seen. Garbage acting, Garbage writing, and garbage plot."}, {"id": 68, "text": "I didn't follow Willis' carrier for a long time and was curious what could he offer. No worries if you want to watch a boring performance full of shouting. And the script is just horrible, very predictable. It was a waste of time. Te only actor somewhat okay is the heroine. Good luck with you carrier after this one Nicky Whelan!"}, {"id": 69, "text": "Weak plot, bad director and casting. Bruce William in anothed B movie.👎"}, {"id": 70, "text": "Says shot in 12 days, so the only question is, what did they do the other 11 days?"}, {"id": 71, "text": "The plot holes are so big a ship can go through. All the plot is based on the killers to retrieve a bullet that incriminates them when they shot a witness. The fact that the killed guy has another in the chest and another hundred they also shot in the alley seem irrelevant. Besides by the time the killer arrive the witness already had the bullet removed Stupid plot"}, {"id": 72, "text": "Only for low IQ viewers! A disgrace for Bruce Willis who does not know when to quit. Scenario is totally stupid, acting is a joke, dialogues are like a 10 year old wrote them (and not a clever one bu the way). If you want to waste your time watch it. Actually I could not stand after 45 minutes watching and felt the need to write a review. Must have been one of the worst movies I have ever seen!!!"}, {"id": 73, "text": "Its so boring and the acting is the worst I've ever seen. Even Bruce willis 🤢"}, {"id": 74, "text": "Bad acting all around. Bad production and so fake. Unbelievable that such an awful movie was even made. Don't waste your time and money."}, {"id": 75, "text": "It is unfortunate that Willis began to act only in such cheap nonsense."}, {"id": 76, "text": "The worst movie i ever seen in my entire life. What happened with Bruce Willis?"}, {"id": 77, "text": "I realy think this is home movie for some of Bruce Willis rich friends that want to have members of his familly appear in a movie with Bruce Willis. It's incredible what money can do. Bruce in now on his way with Nicolas Cage."}, {"id": 78, "text": "I cannot understand any of the reviews that suggest this movie entertained the writers. The script is appalling and the acting is the worst I have seen in years, even Bruce Willis looks like he has never acted before - just reading lines and pulling random faces. If you enjoy B-movies (I mean E-movies) where the acting, ridiculous, massively flawed plot idea and fake action makes you laugh then maybe this is one for you."}, {"id": 79, "text": "Dumb implausible plot and really bad acting. A waste of an hour and a half, IMO."}, {"id": 80, "text": "In a future where Puerto Rico became the 51st state and everybody speaks English, a woman with a bullet in her leg due to doctor negligence must survive with the help of a drunk detective (Bruce Willis) against a guy who really hates doors and some other pathological liar."}, {"id": 81, "text": "Horrible Movie I will never recommend it to anybody and I feel bad for the time that I wasted on watching this movie and I hope nobody would watch it, The script was horrible the actors was terrible"}, {"id": 82, "text": "Movie sucked. I wouldn't recommend wasting your time watching it."}, {"id": 83, "text": "Good film editing can do magic, helping to suspend belief. But unfortunately, it takes the viewer less than 5 minutes to realize Bruce Willis filmed all his lines by himself. It explains the lack of emotion in the dialogue that one normally expects from Bruce Willis. To say Bruce Willis and steve guttenberg star together in this movie only pertains to the credits. And then there is the attempt to apply the die hard template which fails with a thud. Literally."}, {"id": 84, "text": "I saw already this movie,is good best...i love it..."}, {"id": 85, "text": "Lame, predictable, unbelievable garbage of a movie. Bruce Willis must be getting desparate for roles. He along with everyone involved with this film should walk away from the film industry with what little respect they have left."}, {"id": 86, "text": "Don't waste your time!!!!! I cannot believe this production and names in this movie... How any actor would get into this.. I WOULD DELETE THIS MOVIE FROM ANY PLATFORM THIS SHOULDNT EXIST AT ALL"}, {"id": 87, "text": "The lack of effort put into this film is dizzying to say the least. Every cliché from any action movie that you've ever seen is deployed and deployed poorly. You never begin to engage with any of the characters even the once mighty Bruce. This is lazy writing, directing and acting at its zenith. Unless you are in prison and have no other options available avoid at all costs."}, {"id": 88, "text": "Within the first few minutes you can see the acting. Made it to 17:23. The head slap when finding the deas cop was a sure miss. Completly un-natural. Had to stop it as two bad movies in one night is too much (just watched 6 underground which was laughable with a other good actor - Ryan Reynolds.) Going to watch the Prestige - a fav to change the energy."}, {"id": 89, "text": "I gave one star because I have seen worst things before, and because there is no such thing as a zero star! The plot is dumb and inconsistent. The acting is bad - Willis might be needing some money at the time - the story is devious, full of flaws. There is an awful lot of procrastination in order to keep the movie going. Don't you even waste your time seeing the opening titles!"}, {"id": 90, "text": "It's bad.. really bad...I'm not sure how this even made it past the cutting room floor 👎"}, {"id": 91, "text": "Welcome to the worst film ever made in this century. women have nevner been more helpless, stupied and patetic as they have made it in this movie. the character is portrayed as a brain-dead blonde who seems to be waiting to be photographed every single second ready with duck face and deer eyes. Not to mention that the whole movie is one big predictability. If you have seen all the movies in the world, there is still no reason to watch it."}, {"id": 92, "text": "I can't recall since i last seen a movie this bad. The acting just gets on your nerves. It is really annoying. How dare they even release this? If i was an actor i would never want this to be shown to the public. This is not one of those movies that is so bad that its good. Its just terrible."}, {"id": 93, "text": "I paid 50 kroner to see this movie , i want my money back"}, {"id": 94, "text": "Poorly written Garbage. The Dialogs were truly awful. Bad guys had to a lot of non-necessary things first just to go kill a witness, one of the bad guys holds a gun like he's never used one before. The hospital is smoked filled for no reason at all. Why bruce willis is even in this independent badly written film is anyones guess."}, {"id": 95, "text": "Directing and acting are both very poor. Even Willis is acting like a drunk sailor."}, {"id": 96, "text": "I really don't understand why Bruce Willis keeps agreeing to do these quickie direct to DVD movies where he only appears for a few minutes. Granted, getting a few million dollars for just a few days of work would be tempting even to me. But after doing so many of these movies, Willis has severely damaged his reputation.This particular one (yet another by the prolific producing team of Randall Emmett and George Furla) is, I admit a little better than usual. Willis, for one thing, shows up for about ten minutes this time instead of his usual five minute limit. (Though he continues to use the same awful sleepwalking performance he uses for these quickie efforts.) Production values are also not bad for a movie where most of the budget had to be designated to pay Willis his exorbitant salary. And occasionally there is a little suspense.However, the movie is saddled with an incredibly dumb script, one that constantly brings up questions that are never answered as well as characters making incredibly stupid decisions. Do emergency doors really have internal locks that can make escaping from a building impossible? Why wasn't the entire hospital alerted when the fire alarm was activated? Why didn't any other security guards arrive after the security guard radioed to his command the request to send more security guards? Why did the heroine just stop at calling Willis' character when she got to a phone instead of calling other avenues of help? Why didn't she use the Internet on the computer to send the contents of the memory chip to the authorities?I could go on and on for quite some time illustrating this movie's stupidity, but I think you've got the point by now. Even the (limited) merit to be found here and there is not enough to make this worth a look even for the biggest fans of B movies... or the few remaining fans of Bruce Willis."}, {"id": 97, "text": "This movie was bad in every aspect. The script the actors, the complexity...ughhhh! The movie was very predictable. Bruce Willis acting was horrible! Was his acting always like this or has he really lost his touch! Either way it's time to hang up the towel."}, {"id": 98, "text": "Bruce Willis will do about anything for a paycheck, where did Mr Die hard go. This movie is utter rubbish. The dialogue seems to written by a six year old. The story is so predictable. Two bad cops, Really original. Nicky Whelan really should go to acting school or decide to stick with modeling. Everything about this movie is terrible from the acting to the writing you have been warned."}, {"id": 99, "text": "... but don't worry, the main character's hair and makeup stay in place from start to finish."}, {"id": 100, "text": "It bothers me.This film seems like it should have been low budget.Lifetime would never.The plot and seemingly every last detail have are lacking in plausibility.How, Sway?"}, {"id": 101, "text": "It won't work. Just like this movie. It doesn't even work as mindless entertainment. Fire alarms, gunfights in the hospital, and it doesn't seem to bother anyone. Total waste of time."}, {"id": 102, "text": "Bruce Willis must have been down on his luck to take a part in this film. I turned it on when I was exercising, knowing it wouldn't be anything great but thought it might be a diversion. I'd say it was the worst 1 hr and 38 minutes I ever spent watching a film but, truth be told, I often fast-forwarded through many of the incredibly predictable scenes that were intended to be suspenseful. (In fact, a number of the scenes intended to provoke tension just made me laugh.)There was so much that was ridiculously improbable. Here's just a very small sample. Why didn't Pierce and Tull go into Madison's room immediately after killing the guard? Why did they walk around acting as if they were confronting a dangerous person with lethal weapons as they pursued Madison when they knew she was unarmed? Why didn't Pierce ever wipe the blood from his cheek? Why was Madison apparently able to run faster with a bullet in her leg than were two fit police officers? Why, when Madison got on the computer, didn't she use the computer to get help.This was a low budget film (except, I assume, for Willis's fee), horribly written and badly directed. Don't waste your time. Even if you're looking for cheap thrills, this isn't a film for you."}, {"id": 103, "text": "This was truly a master class in horrendous filmmaking. Both the writing and directing were so monumentally cringeworthy that Bruce Willis would have a failed acting career on his hands if this were his debut. No matter how many allowances you make for nonsense as a moviegoer, plan to make more. Yikes."}, {"id": 104, "text": "Bruce Willis shows up once every 30 min to collect his overpaid salary and sucks. The filming, directing and dialogue are terrible."}, {"id": 105, "text": "I wonder if anyone is directing Bruce Willis these days. It looks like he's not even trying in pictures like this, and I've run across a few of them lately, like 10 Minutes Gone and Acts of Violence. His total screen time takes up no more than fifteen minutes, with his appearances scattered throughout the movie to make it seem like a Bruce Willis picture, but it's not really. Here he's a detective who's partner is shot and killed after being set up by a couple of rogue cops from Vice within the same police department. Serpico would have had a field day.Only slightly better is Nicky Whelan in the lead role, she portrays a waitress who gets caught up in an alley shootout and takes a bullet to the thigh. Because the bad guys want to get at that bullet, they do an all out siege of a local hospital's seventh floor, closed down due to damage from a hurricane some time prior. Though some tense moments are allowed to build, you have to wonder how a person like Maddie Taylor has the smarts to attach a defibrillator to a metal door handle to shock one of her assailants. Not to mention that scene with the halon, or how she manages to stitch up her leg wound. Scumbag detective Pierce (Tito Ortiz) is no better, he shoots himself with a ricocheting bullet, is on the receiving end of Maddie's halon attack, and eventually gets shot by her to put the bad guys down by one.But the guy I have to admire in this story is Detective Tull. This is actor Texas Battle's (love that name!) second movie in a row in which he gets shot dead by Bruce Willis. Check out 10 Minutes Gone for the prior flick. He's in another one with Willis titled Hard Kill which I haven't seen yet, but if I were a betting man, I'd be thinking maybe three times the charm. In short, the only trauma center you're likely to experience is the room you're sitting in when you watch this film."}, {"id": 106, "text": "I wish I never watched it. This is the worst movie ever. I don't know why Bruce Willis even decided to join this cast. Come on now! The writing and acting is deplorable!"}, {"id": 107, "text": "This is such a poorly written movie with bad acting. No intro story to understand and nothing to make a story just like Hard Kill."}, {"id": 108, "text": "I only watched this because my favorite action film of all time is Diehard and I have always thought Bruce Willis was a great actor. This movie SUCKED! The writing was terrible, there was so many questionable things happening...For instance where the heck was everyone in the hospital?!?!?! This seems like an abandoned or apocalyptic hospital, not the busy hospital it tried to portray itself as. it was just too unbelievable. My Husband and I really thought it was like a bad made for TV movie on a low budget network! Also, Bruce's acting?!?! What the heck happened to him? We were soooo confused? I really don't know HOW I made it through this movie, I really wish I had shut it off. NOT worth it!"}, {"id": 109, "text": "Storyline itself is not bad and most of the characters were ok, but Bruce Willis was absolutely shocking in this movie, it's like he forgot how to act or something. Very dissapointing."}, {"id": 110, "text": "Long time Bruce Willis fan thought he was unbelievably flat throughout this movie. He was a huge disappointment! Too bad for the other actors that Bruce was out to lunch throughout this otherwise good movie. Maybe he was contractually obligated to be in this movie but he made no effort whatsoever to act. It seemed he went out of his way to not act. No emotion, no expression, no energy. Dull with a capital D! Shame on you Bruce, you lost a lot of loyal fans with this movie. You owe the other actors and your fans a big apology. If I was only voting for your performance it would be a negative number!I feel really sorry for the other characters. They really tried to carry Bruce but he was dead weight!"}, {"id": 111, "text": "The Maddie character was done well. She's in great pain and can't hide it, which is realistic. She made a lot of noise for trying to be quiet but in that much pain it made sense. It did keep me guessing as to when Maddie would be found, with her being so loud. I'm a huge Bruce Willis fan and the way he acted seemed like this was one of his first movies not a newer one. It feels like his character was written in as a background character. He was barely in it (compared to other movies he's in) and when he was the dialogue seemed off to me."}, {"id": 112, "text": "The bit of Bruce Willis in this was unrecognizable. He sounded drunk in every scene. Very disappointing and the script was terrible and things that didn't make real sense were overlooked in the writing of it. Don't waste your time."}, {"id": 113, "text": "Please, watch this movie. Sure, Bruce sounds drunk in the first few minutes of the movie. He was perhaps drunk through the whole thing. Probably spent two days on set. He was barely in it.Overall, terrible movie. A few scenes had us dying. When he realizes the micro SD card is gone. It's like realizing a penny wasn't in your leather jacket. Lmao. Omg, too good. This movie is trash and you must watch it."}, {"id": 114, "text": "I expected so much more from a Bruce Willis movie. His character is not believable at all. It's as though he put zero effort into it. The other actors in the film pulled their weight throughout."}, {"id": 115, "text": "I stopped watching when I realized there was a door leading from one hospital room (to another hospital room) through the bathroom. Also, why the shower curtain?"}, {"id": 116, "text": "I think it's time once and for all to tell the world to leave Bruce Willis alone. Lol. The guy was 63 when this movie was filmed. He's old and tired. And he STILL acts better than tons of actors half his age. So zip it and enjoy the flick! The heroine, Madison is amazing in showing abject terror. The actress is 100% believable. The only part a lil overdone, and only slightly, is the constant dripping blood bleeding from the wound. She's had a tourniquet so that wouldn't happen as much realistically. Bruce wasn't amazing but he was serviceable. The 2 heavies - Tito Ortiz and Texas Battle were about a 5 out of 10 so not terrible. All in all the movie ticked all the right check boxes."}, {"id": 117, "text": "Of course, Bruce Willis catches your eye in the glossy promo pic, which never occurs in the movie. Bruce Willis tends to make good movies, so I bit, and I don't mind that I did. He steps out of his typical 3 steps ahead of the bad guys, wise-cracking typecast to play a more realistic, imperfect, reactive cop who persists. Nicky Whelan does a fine job as a resourceful waitress caught in a bad place. This appears to be low budget. I almost wonder if Willis did this as a donation to post-Hurricane Maria Puerto Rico recovery (where it was shot), on a percentage basis of gross. At the tail end of the credits, you see that the script is loosely based on real life events, but an internet search so far is not telling me what those events were, which is disappointing, as it could have explained Willis's character more. By the way, the little caption on Amazon describes Willis's character as vengeful. I disagree. Just a guy trying to survive while doing his job."}, {"id": 118, "text": "The film is actually carried out by one person, Ms. Nicky Whelan, who does a very good job. All others, Bruce Willis included, aren't but supporters. The film is to naivety simple, predictable, however, watchable.My vote: 4/10 for Ms. Whelan only."}, {"id": 119, "text": "Bruce Willis is my favorite actor. I was disappointed with his performance. The director apparently did not know his acting skills or they wanted to portray this as a B movie. The acting was horrible. Nicky was the only one that put effort into this movie. Why Bruce you a class act - Actor Director thumbs down, Writer thumbs down"}, {"id": 120, "text": "What this film tells you is that Bruce fails without a decent director. And you can only watch a movie so long thinking constantly that wasn't thought through... could not finish it... too much brain pain."}, {"id": 121, "text": "Bruce Willis is losing his acting abilities with age, no joke! The 2 bad guys, the sister, the friend, and even the extras (female Dr. &amp; laundry guy) all acted horribly. The main character (Maddie) was acceptable. I kept watching just because I'd already invested so much time but not worth watching."}, {"id": 122, "text": "Usually like anything with Bruce Willis, but talk about phoning it in. He literally just read his lines, all one syllable words, no emotion whatsoever. I wondered if he'd been drinking. Plot line said the patient/star was in the 7th floor,and yet pix of the hospital showed a 5-story building. And it was almost as if there were NO other patients or staff in the hospital...really unbelievable."}, {"id": 123, "text": "Ok, Movie moved along reasonably well. Predictable plot, but there were a couple twists. Big take-away here I think, is that Bruce Willis' acting seemed particularly ... wooden, His acting always had that natural feel. It got a little better towards the end, but just saying the biggest actor name did not carry the movie."}, {"id": 124, "text": "Don't do it! Unless you just need some background noise while you surf the internet on your phone. Not sure what sedative Willis took before filming but they should have let him sleep it off. The dirty cops were complete idiots so not sure how they became the 'top' bad cops. The action between them and Madison was like Macaulay Culkin taking on the bad guys in Home Alone. Madison was a patient in a hospital and yet everywhere she went in the hospital was completely empty and no one seemed to be looking for the missing patient."}, {"id": 125, "text": "Bruce Willis playing a cop again? No way... Just knowing that makes me turn it off 20 minutes into it. Same character as hes been playing since 1988. Next..."}, {"id": 126, "text": "Good God that was horrible...from the plot to the acting and everything in between. What happened to Bruce?! Even with the terrible lines, he still could have acted!"}, {"id": 127, "text": "I like Bruce Willis but this is one of the worst movies I've ever seen. It played like a comedy skit making fun of a over the top thriller. All the actors were hammy and unbelievable. I couldn't even finish it."}, {"id": 128, "text": "I'm not exactly sure what happened to the acting in this movie but it's shocking. I don't normally give bad reviews but this was terrible. If this redeems back enough money to buy the cast a can of coke each I'll be surprised. What a shambles. More holes than a sieve . !!!!"}, {"id": 129, "text": "I respect Bruce Willis, I adore Bruce Willis, but this film is inappropriate in his career. Poorly directed, poorly played and close to stupidity. If you consider it for viewing, expect that you may have a trauma..."}, {"id": 130, "text": "The story is as if 4th-grade children wrote it... complete disrespect for common logic and common sense.I am worried that this is the end of him..."}, {"id": 131, "text": "This film start with a man dragging a woman Madison, and a man kill on the floor scene! As turnout, this film is about Madison trying to survive from the killing of two cops(Pierce and Tull), because she had a traceable bullet in her leg and she accidentally possess a memory card contain the video of the two cops killing an informant! Entire film full of boring overuse scene! Such as, Madison keep having flashback, and Madison keep running room by room but two of the cops keep struggle to catch her! Pierce even hurt himself just to open a freaking door! He eventually using an ax to break the doorknob! This scene really stupid and bored to freaking death! Both of the cops keep searching Madison room by room like playing hide and seek, they never try to shooting randomly to force her out! Ridiculous! Maybe the director want to frustrate the audience or maybe no budget! Barely intense scene is, Detective Wakes killing two men at the alley! This scene had car's window broken and bloody shooting! At the end, Wakes fight with Tull with super messy martial art, Wakes eventually shot him death! Madison signal her sister to spray Pierce with her asthma inhaler, and Madison shooting at Pierce! Pierce eventually died! That's it! Another boring action film! Not recommended!"}, {"id": 132, "text": "Stupid, predictable film. It would be hilarious as a comedy, but it's supposed to be be an action movie what makes it just pathetic."}, {"id": 133, "text": "This was a bit low brow and unpolished. There wasn't much attention to detail or making sure that what was happening verbally was in line with the physical movements the characters were making.Not impressed. Pass if you're looking for quality."}, {"id": 134, "text": "I have never seen a poorer acting job by Bruce Willis. I at least that Bruce Willis would redeem this low budget disaster. Boy was I wrong. Worst over-acting I've seen by him."}, {"id": 135, "text": "I've always loved Bruce, but I swear he was drunk during filming. His speech rhythm is slow and slushy and the words he speaks are unnecessary, at best. The makeup is awful and the acting is worse. Take my advice and avoid this one."}, {"id": 136, "text": "I could watch Bruce Willis in anything. Except this movie. I think they had a look alike playing him. His lines were wooden and forced almost as if someone forced him to play this character against his will. Poor script so nothing saved this movie."}, {"id": 137, "text": "Wow, how did this get made? The major draw card here is Bruce Willis, but he moves and sounds like he's under sedation. Even his dialogue has him talking major plot points to himself, to save the director having to do any work. One of the bad guys has a supernatural growl inspired by a random horror film. The set is like a live action version of Fallout76, and the climax to a lack of medical guidance was the idea that you could use acetone to clean a gunshot wound.You should probably watch this because it's so confusingly bad."}, {"id": 138, "text": "This movie was almost nothing, unless you've never seen a suspense thriller of any type. It's like a cheap made for cable movie starring an actor working on a court order for some unspeakable crime. Bruce Willis seems medicated with something that slurs speech. The main actress is fine but has next to nothing to work with. Nothing original and no real character development. It's unfortunate as all the talent was on the set, but the script was doomed to fail and it's played as though they all knew it."}, {"id": 139, "text": "One of the worst movies I had ever seen. Bruce Willis looks like he was acting a cop while being drunk instead of acting a drunk cop. The acting, directing, shooting, music, all were terrible. As a fan of Bruce Willis, this was a huge disappointment."}, {"id": 140, "text": "The first half of a movie was extremely stupid. The second half was even worse."}, {"id": 141, "text": "I dont understand why people dont resign hero roles when its more than obvious they cant deliver anymore.The whole thing looks like Bruce cashing out his hard earned name, not giving a damn about the quality of scenario.Actually walks the same destructive path as Steven Seagal.The scenario also has so many plot holes as Swiss Cheese does.To recap, the whole movie has a feeling of a mediocre B movie."}, {"id": 142, "text": "Two words sum up this movie, God and Awful. I think Bruce has forgotten how to act, or just could not be bothered"}, {"id": 143, "text": "Decent thriller,but a more then abysmal performance by Bruce Willis. I suppose the only reason was to have his name in. He probably should have paid to be allowed to perform."}, {"id": 144, "text": "I can't believe i didn't fall asleep on this movie, the only thing that kept me up was to see if this movie could get any more worse and it sure did. This must I say was the worst movie of the decade, I cant really just blame Mr Willis for this incredible bad movie. Everyone on this movie should start doing something else. Just dont do any more movies,, and What the hell Liongate...Really??"}, {"id": 145, "text": "Don't believe any rating over 3/10. This is a really bad movie. Bruce seems to be phoning in his performance. Poor script, inept direction, the list goes on."}, {"id": 146, "text": "This movie would make a great drinking game. Every time you see a blooper you take a shot of your favorite drink. Just be ready to be completely buzzed by the first hour."}, {"id": 147, "text": "Time pass movie but got to question Bruce Wills's acting. He either looked high on booze or pills but never seen him act this bad. His speech was dull &amp; heavy."}, {"id": 148, "text": "This is the very worst performance for Bruce Willis I've ever seen. As the movie progresses his acting just continues to decline. And what kind of policeman would leave two girls who were hurt with blood all over sitting on the floor in an closed off hallway of a building, just turn and walk away when no one else was around to help. Too many scenes that were just too unbelievable. Put anyone else in his role and the movie would deserve at least an 8 or better because Nicky Whelan played her part to the hilt. She was fantastic."}, {"id": 149, "text": "Is Bruce Willis acting while medicated? What on earth is going on? Between him and the main female actor, I don't know whose acting is more embarrassing. Unless you want to kill most of your brain cells, I wouldn't recommend this movie in any situation. Not even lock down boredom."}, {"id": 150, "text": "Just a waste of my time. Bad acting, bad story, bad everything."}, {"id": 151, "text": "Waste of time and money. 12 days it took to shoot this movie!!! Should have been more critical to accept each take.Worst performance from Bruce Willis ever. Has he forgotten how to act?Nicky whelan and Catherine Davis was the only decent actor in this movie."}, {"id": 152, "text": "Wow, really bad acting, even from willis, just awfull. The script .... It's a no go, unless you're really desperate with an hour to waste on a junk action movie. I did..."}, {"id": 153, "text": "The production seems good, but the story and the acting is terrible. Nicky does a good job, but everybody acting as a cop is just awful. Even Brucw willis does a really bad job in this.... Not sure why his acting skills can be 10 in one movie and then 2 in another? This movie is a waste of time and didnt even bother finishing it.."}, {"id": 154, "text": "Apparently Bruce Willis can not say no to a script. It shows 2019 as production date, but this has to be been filmed during the COVID lockdown where all actors and crew were related shared the same germs. Why it was set in San Juan is another question. More people speak Spanish in Salt Lake City than in this film's 'San Juan.' Watch this only if you have seen every other movie on every other streaming service...twice."}, {"id": 155, "text": "I downloaded the app just to say this. What a cheap movie."}, {"id": 156, "text": "Nicky Whelan, despite playing the victim with a gunshot wound, runs circles around Bruce Willis' character who appears to be trialling a stick stuck up his geriatric, 'stoned' and disinterested a** throughout the movie. The only thing he gets right is finally pulling the trigger... But they could have very well let the girl shoot both villains and drop his character entirely from the movie - then I would at least up it the rating. Bruce should take the time to watch The good Lair to see how seasoned actors kicks serious backside."}, {"id": 157, "text": "I should have looked at the worldwide gross (75K) before killing valuable brain cells. The acting is stunted and predictable. The story-line contrived and the outcome exactly as a 10 year old student writer getting a c- in school would have created. Don't walk .... run away from viewing this. Even a re-run of a 10 year old film would be better. So disappointing!"}, {"id": 158, "text": "Reading many other reviews, I'm glad I'm not the only one confused by Bruce Willis's strange acting and speech...he even talks aloud to himself in a slurred, slow exaggerated over acting dialogue. Predictable plot. Low budget. Forgettable."}, {"id": 159, "text": "I actually forced myself to sit through this garbage. Wow, when did Bruce Willis become such a trash actor? This is like the stuff Nicholas cage does because he's broke. Honestly, the entire premise is stupid, the acting belongs on a soap opera, the script is painfully awkward, and it's almost like this person has never actually stepped foot inside a hospital. Did they not bother consulting a single person about a single aspect of this movie? The only reason I made it through was the same reason you slowdown at the scene of a car crash or a train wreck... You just can't look away from the carnage, and this was like a movie equivalent of a dumpster fire."}, {"id": 160, "text": "Bad acting And there is some scenes that really showing stupidity in directing the movieAnd Bruce was over acting in the way he is talking not like any other movies for him he was a legend in the way of his talking"}, {"id": 161, "text": "The music/score is right out of the 80's action movie. The first 30 mins are just the setup to justify the action sequence. It's not a bad thing it's just stupid how things where set up. Anyone who has had a asthma attack without meds and ended up in hospital never does it again. Drowning on land as your lungs fill with liquid and thinking your about to die is not something you forget or want to experience again. 3 times in a month! BS. Doctor taking his glasses off. BS. Robbers leaving $40K and only taking the phone. BS. It's just a bad script with bad music/score. Looks like Bruce Willis will be in anything now."}, {"id": 162, "text": "I felt that I've been cheated. If you did by art love, I think this is not art. Very bad movie. Worst acting. Sorry."}, {"id": 163, "text": "This movie is a badly written D grade action thriller about a woman who is being chased in a hospital by two corrupt vice detectives because she has a bullet in her leg that can lead to them being identified as murderers of another policeman and his informant. It could have been interesting but it isn't since the story is pathetically cliched and the actions of the characters make no sense. Even with the relatively short run time the movie drags on and on and becomes more implausible. For example: why did the doctors leave the woman with a bullet in her thigh instead of taking it out? How is it possible that she is bleeding profusely but seems to get stronger as time goes on? Why do the two cops in the hospital who are trying to retrieve the bullet that could identify them leave fingerprints absolutely everywhere? They end up locking down certain floors of the hospital and shooting two uniformed police officers who were there. Who were they going to blame for those murders?The acting is not great but to be fair the characters are so wooden that the actors had very little to work with. Bruce Willis as the good cop investigating the crime phones his performance in as he tends to do in most movies these days. There is one especially bad scene where his character talks to himself basically explaining what's going on to the viewers. Overall this is a poorly acted and badly written movie so it would be better to skip it and watch something else instead."}, {"id": 164, "text": "I grew up watching Bruce Willis on TV and in movies... enjoyed everyone of them... that is until he stared making these B movies. This is among the worse I've seen. I'm a huge fan of his so I keep watching these hoping to see a glimpse of the Bruce Willis of old. No such luck... if you're a fan and want to stay a fan, don't watch this or any more of his movies. At the very least, read the reviews before watching."}, {"id": 165, "text": "Just another waste of film or electronic space. I know I've seen Bruce Willis act but this was not one of those occasions. I think there was some guy with a hand in an unmentionable place doing the motions for him and moving his lips because he was so wooden...yes, like a dummy. I had to skip thru to the end so I wouldn't have to endure the whole sordid mess. Even Steve Guttenberg (Police Academy) acted like a newby to the screen. Someone (maybe the director) should be taken out and shot and then be delivered to the Trauma Center."}, {"id": 166, "text": "Characters are forgettable and the story is not engaging and the thrill is barely present. Good idea but poor implementation."}, {"id": 167, "text": "Honestly this is the first time I sign into to write a review because I do not want anyone else to come out of the movie feeling like they just wasted their time. This movie was nothing but an action movie, if anything, we spent most of our time laughing out loud on the lousy acting and silly script. Bruce Willis make it seem as if he was joking in this movie. I really can't believe what I just watched."}, {"id": 168, "text": "Title says all! DONT waste you time with this crap......."}, {"id": 169, "text": "I it is a waste of money and time Where neither the story nor the actor were good"}, {"id": 170, "text": "Good cast, bad movie. A 2 minute story stretched into a 85 minute film."}, {"id": 171, "text": "There is absolutely nothing good about this movie. Even Bruce's acting is crap. Don't waste your time!"}, {"id": 172, "text": "Cant blame other actors wanting to work with Bruce, but dahm.. how low can you go."}, {"id": 173, "text": "Sadly not a great film in my opion, got bored. Basic storyline with barely any action based around a lady being tracked down in a hospital. Thought as Bruce Willis was starring it would be good, sadly not &amp; a waste of my time."}, {"id": 174, "text": "From the beginning to the end, this movie was absolutely horrendous. I couldn't believe it was Bruce Willis! And to add insult to injury, they mention that they're in Puerto Rico, but as you probably guessed, the representation of Puerto Ricans or Hispanics was practically nonexistent. What was the point??"}, {"id": 175, "text": "Slow moving, poor dialog, Bruce Willis must have been hard up for a paycheck."}, {"id": 176, "text": "I watched the who movie hoping it would get better. It Didn't! Pour acting by all actors"}, {"id": 177, "text": "Bruce Willis acted like he was on drugs or drunk. He slurred his words and moved slowly. I think it's time to retire. He can always look back and know he WAS a great actor back in the day."}, {"id": 178, "text": "This movie had bad acting, bad writing, bad scenes! Everything in it just seemed faked and forced. Bruce Willis seemed to even forget how to act"}, {"id": 179, "text": "My wife and I are huge Bruce Willis fans.....until we saw this movie.....now we are the ones that need a Trauma Center to get over this. We have never seen such bad acting, thin plot and terrible directing. My wife say I look a little like Bruce....and after watching this movie she now hates ME as well :).Bruce is a Hollywood heavyweight.....why on earth he would do this D grade movie is beyond us.There are too many ridiculous scenes to mention them all.....however here's a coupleThe micro memory card...from it falling out of the bad guys pocket (how??)...to her finding it on the floor while being chased and terrorised and thinking that must be important enough to pick up and keep....the bad guy realising he's lost it after a quick pat down of his jacket pocket....didn't even put his hand in his pocket to check.Bruce's last line.....they are there bleeding on the floor.....he say's 'behave yourselves'....and leaves them there.Blood running down her leg....but magically didn't leave a blood trail on the floorI have to stop....there are too many....We watched this about a week ago.....and still talking about how bad it is LOL."}, {"id": 180, "text": "Poor Bruce. He got saddled with this lame script. You can tell he knows it, and he's not enjoying the experience. The lead actress gives a good performance, but let down by the substandard screenplay."}, {"id": 181, "text": "I dont usually write reviews. I actually stopped this movie within the first 15 minutes and signed in here just to say how bad this movie is. 100% DO NOT waste your time. Within the first few minutes there are gun shots hear can hear over the phone while its still calling. The acting is terrible. The plot is laughably predictable and follows no realistic rules. Total trash. Do not watch. Its actually so bad that I just cancelled my netflix subscription for having this in the top 10."}, {"id": 182, "text": "Awful script, grotequely stupid plot, lame, dead and daft dialogue limply and lifelessly delivered by unconvinced and unconvincing actors - altogether a truly terrible movie .... begs the question, who, why, where and how do people get to make something which, surely from the outset anyone could have told, was going to be a sad squandering of time, talent and all other resources, to make. Bruce Willis (particularly!), Nicky Whelan (much less so) et al should be ashamed of themselves."}, {"id": 183, "text": "Bad acting by everyone Can nit believe Bruce made this crap"}, {"id": 184, "text": "I don't know how they convinced Bruce to be in this movie. My toes can write better scripts than this. Absolutely horse$hit. I only watched it on Netflix when I ran outta things to watch during quarantine. I hope the writer has a backup job. The story line has so many holes not super glue can even fix it. Gosh I wish I didnt waste my time!"}, {"id": 185, "text": "OMG has Bruce lost his ability to act ? Its like he is a new actor from days of our lives. Really bad acting by all involved, the 2 bad guys are so unbelievable. 3 stars if that."}, {"id": 186, "text": "1 star because its in colour. Weak script, acting, LOL, and i did, you d get better on THE OZ SHOW Neighbours, im not kidding, we are 3 adult women, barely watched it all but did under duress and we all agreed, Trash.....thumbs down NETFLIX .."}, {"id": 187, "text": "What was all this BS about? weak in wherever you see it."}, {"id": 188, "text": "This movies is not even a b-movie. The dialogue seems to be amateur work with descriptic lines. It a movie not a radioplay. And therefor bad acting as well. Left hand work from Willis."}, {"id": 189, "text": "Shame that Bruce is playing in such bad films with such bad actors that can not act at all !!"}, {"id": 190, "text": "So many plot holes. Horrible acting. Bad guys that have zero IQ. And the writing I'm guessing they went with rough draft number one. I still have no idea how movies like these get green light."}, {"id": 191, "text": "Don't believe the positive reviews. Everything about this movie is weird. Willis look, yells and acts weird, as if he is drunk and has nothing to do with this movie. Maybe he was just passing by and accidentally ended up in the movie. Scenes just start, happen and stop randomly. Characters are incomprehensibly stupid and every piece of dialogue will make you cringe.The story might be about a girl trying to stay ahead of criminals in a hospital, but I think it's a scheme to make you forget how bad Steven Seagal is."}, {"id": 192, "text": "I believe Bruce was abducted by aliens and an exact double of him was placed in this movie. It looked like him but didn't sound like him at all, and this person couldn't act or was over-acting I'm not sure. The movie was really bad! but back to Bruce. It seems obvious now that he needs to have cocky one liners while looking over his shoulder smirking, if he doesn't do that and then he is awful?"}, {"id": 193, "text": "Pretty average film with terrible acting by the lead actors."}, {"id": 194, "text": "I saw Hawkins hawk which was a terrible movie and this movie is worse. Bruce wills looks like he is sick or drunk. His acting was so bad that he even hated saying his lines. The action was bad, the direction was bad. It was just a bad movie."}, {"id": 195, "text": "Every scene in this movie is just bad. Not one part would happen in real life. Bruce Willis is way off his game in this movie."}, {"id": 196, "text": "From the start to the end... bad! It was so bad, that I was thinking could be a good comedy movie"}, {"id": 197, "text": "Bad dialogue, bad acting, bad directing, bad everything. I truly believe Bruce Willis was drunk in every one of his scenes. Can't blame him, though."}, {"id": 198, "text": "It was okay, not Bruce's best at all. Definitely not the worst movie I've ever seen. Kept me entertained but not one I'd watch again. I also can't seem to get over the fact that it's set in Puerto Rico, yet every single person is white except for the criminals...."}, {"id": 199, "text": "The only one there who can actually act in this terrible movie is Nicky Whelan and the rest of them are just a bunch of amateur actors from local theatre including Bruce Willis who's the worst. Only watch it if you like Nicky otherwise stay away !!!"}, {"id": 200, "text": "This movie is garbage. Did it make it to video? The actress must have had a makeup artist following her around that didn't get shot. The director should have made a cameo and got shot. Bruce, wake up and stay away from the C-graders... unless you're broke. What's next? Adverts?"}, {"id": 201, "text": "I watched this movie because of bruce willis in the poster. But total disappointed with the movie. So many unreasonable things happen and yes, only in this stupid movie. Bruce willis character acts as a stupid clown. It is a waste of time."}, {"id": 202, "text": "I wouldn't be surprised if this was written by ten year olds. Characters either know way too much or are complete idiots. The acting is most likely first take material since the budget probably didn't allow for multiple takes. The setting is Puerto Rico, for some reason, and yet it's not until halfway through the movie that anyone shows up that would make you think it's not Los Angeles or some other American town. It was like the setting was an after thought when the movie was finished."}, {"id": 203, "text": "I wasted precious time on this movie and I'm asking myself whyyyy? I never knew Bruce Willis was capable of really bad acting...I mean really bad."}, {"id": 204, "text": "Is that the same Bruce Willis that did films like Die Hard? Does he switch his acting on and off depending on the pay check size? Film was ok, but ultimately ruined by Willis's acting - or lack of. Should have gotten someone else to play his part."}, {"id": 205, "text": "Nicky does a good job trying to hold this crap together. The acting is horrendous the directing is bad the script is lacking and the scene continuity and flow is so bad it's comical. I gave 3 stars for Nicky only."}, {"id": 206, "text": "Let's destroy this whole movie quickly and surgically. The bad cops hunted down the main female character to retrieve a bullet that was 'in the system' and would identify the shooter. Apparently where she was shot and the many bullets fired before she was shot (including the dead police detective) didn't matter. Just the one that hit her. Movie dead. Terrible writing, far too many flaws to count and boy, did I count them. A hospital that doesn't have surgeons on at night, no nurses that I could see, mostly empty, losing a micro SD card, female finds said SD card, micro SD card goes into a computer without adapter (all mine are USB??), an old Bruce Willis defeats a younger fit black guy in a fist fight and doesn't even end up with a wrinkle in his shirt (true go see!), can kill police and security from a distance but can't kill a women with a shot up leg...blah blah blah. Bruce put in his usual 'mailed in' lack lustre performance. I'm guessing doing it for the money aye Bruce.All in all, just a waste....a 2 for actually managing to convince someone to put up money for this crap."}, {"id": 207, "text": "On 7 level in a 5 levels hospital, mistakes after mistakes in this movie the 2 bad cops cant open a unluck door, ther enter the same door twise and so on and on but this movie is bether than Cheat the Hangman"}, {"id": 208, "text": "Story sounds great but the movie is 💩 bruce willis is acting like this is his movie debut and trust me he's as wooden as wood can be, terrible film the acting is the worst ive seen and brice willis wants to retire from acting while he still has some dignity lol"}, {"id": 209, "text": "Maybe the unincorporated Porto Rico allows US police standards to be loose....of course cops get overweight for eating so many donuts but not at an early age like the two chumpy villains.....as for the leading actress she turns from waitress to more resourcefull than a top rank commando of the Expendables team...last but not least a very tired Willys that goes from REDS to this (shorter trip than the one Zeus had to make to visit his brother Hades)..it is a joke of a film and must be avoided ..period"}, {"id": 210, "text": "Acting is the worst Why Bruce Willis accept to be part of the movie ?"}, {"id": 211, "text": "Stupid movie with stupid story felt they tried to copy home alone"}, {"id": 212, "text": "Unlike the majority of reviews I have to say that it was terrible on all fronts.At his peak Steven Seagal made some half decent movies, however his latter films have lost everything that made them appealing. This movie takes Bruce Willis in a similar route and I hope it was a one off. The storyline is extremely weak and to make a movie it has been drawn out adding to its problems, the action would have been better suited as a one hour program.The acting was stiff and he dialogue Mr. Willis uses is like a throwback to an old gangster movie in fact I had to look closer to see if it was even him speaking! The main perpetrators are supposed to be Police officers and if their acting wasn't so bad it might have been amusing.The props department went all out to issue them with silencers sticking out of shoulder holsters and badges from a candy store. The way they searched for the victim was like watching two keystoke cops.The victim, a 5 foot waitress was able to overcome two wrestling sized officers. An amazing feat on its own, but even more so given she had been shot in the thigh and still had the round in her leg. At one point she managed to climb/jump up into a ventilation shaft in the roof that was 2 feet higher than her. As she made her around the bullet wound was clearly getting visibly worse, without leaving a trail of blood. I caught her on two occasions walking without any limp and covered in a white sheet that didnt get marked by the blood she was loosing.I might sound somewhat picky but I honestly feel that this was the worst Bruce Willis movie I've seen."}, {"id": 213, "text": "I can't understand the Okay reviews, this is an absolute horrible movie!Never have i seen Bruce Willis seem so retarded, and that is using nice words here... He seem like he is completely wasted on drugs, when he talks, it sounds like a horrible voice-over for a cartoon, and it is just not the cool Bruce as you're used to :*(The dialogue / monologues in this movie, is also just thrown straight out of a bad script, it is so depressing, so dissapointing.Oh damn, i lost the memory card which he just knows without even checking if he lost it? What the heck?!If cops potentially could be as stupid as the ones in this movie, i would say we get rid of the police force... Force is a strong word, there is no real force in these idiots!This movie is not just the worst of the year, it is most likely the worst of the decade, as you would have to look a long time, to find something that is as stupid as this movie, seriously... Trump's speeches borderline seems to make more sense than this movie, that's how awful it is!The acting all over is bad, the directing is awful, camera-work was nothing to write about, and if i had to give this just a 1+ star (Being i can't give it a minus 100), it would be the fact that, Nicky Whelan, is looking very pretty as expected.Do not waste your time on this movie, it has borderline made me wanna do something drastical like hang myself in boredom, it is absolute nonsense!"}, {"id": 214, "text": "Horrible movie, no story and very bad acting. No sense at all in any scene. It shouldnt even be released in theatres. Bruce Willis what were you thinking?!"}, {"id": 215, "text": "Everything is just so bad into the level that you can't stand the movie anymore! All the scene is unreal and so stupid. Actor doesn't even try to do their job. It's all like they just try to finish their job ..."}, {"id": 216, "text": "This is a low budget movie which I am usually in favour of but this was just embarrassing. The only saving grace of the movie is that Willis is in it but once you watch his performance you will wish you hadn't! Extremely bad acting and poor plot, script and location this is one of the worst films of 2019."}, {"id": 217, "text": "This movie is so bad. It's just incredible. I cannot figure out why they didn't stop shooting the film in the progress. But even more I cannot figure out why would anybody gives this 3 stars of higher. Beats me. The acting is not terrible. Its just not there. And logic."}, {"id": 218, "text": "A quote from the movie watch some trash TV I believe they meant the movie it self!"}, {"id": 219, "text": "I have never seen Bruce Willis walk through a role as he has in this film. The dialogue is expected to be found in a B-movie but to hear Willis deliver his part in a bored tone throughout is sad. Pathetic best describes his role."}, {"id": 220, "text": "Perhaps one of the worst movies in a generation, the actors appear to be reading half speed, the dialogue is atrocious, the set is awful. Bruce Willis has little to do with the show, when he does appear the leading actress would have been safer on her own. I just want to gouge my own eyes out."}, {"id": 221, "text": "Bruce we love you, we grew up watching you. We see your work since Moonlight tv series from 1985 and appreciate it meaning it has been 35 years. We've been to Look Who is Talking not for Travolta acting, but you for dubbing. But I am afraid you are losing the touch. Watching you is became painful in the last decade. I guess you are the second most declined actor after Nicholas Cage. About the movie; Bruce can not act, Nicky finds time to change her hair style 3 times in the first half hour (there is a hair saloon inside the hospital I guess). The two polices must be the dumbest two officers I have seen, it is a miracle for them to pass any tests to be an officer :) Bruce; please get better soon..."}, {"id": 222, "text": "You're a witness. Yeah I was a witness too. I witnessed one of the worst pics of 2019 in Trauma Center. Prepare to be traumatized if you choose to see it (VOD is probably your only vested option).Anyway, have you ever viewed a film in which the present day lighting looks and feels like a flashback? And have you ever taken in a Steve Guttenberg performance with two short scenes that scream acting 101? Trauma Center is that film and it makes hospital fodder like Coma, Halloween II, and John Q. seem like Citizen Kane in comparison.Trauma Center, with its muttered line deliveries by star Bruce Willis and its idle production values, feels like it was made by amateurs for amateurs. Director Matt Eskandari (who should know better) favors cue card, soap opera performing over capable casting. He also favors Michael Bay aerial shots over baseline camerawork. Finally, he favors short cut scripting over well, a decent script.Probably made feverishly on time and on budget (what budget you ask), Trauma Center's story involves a woman who witnesses two corrupt cops kill another cop. The woman (Madison Taylor played by Nicky Whelan) survives a gunshot wound and is taken to an isolation ward for her safety. Sadly, said cops know she is alive. They plan to find her, kill her, and take a piece of evidence she has that will implicate them in the murderous crime (the attestation is a bullet in her leg, hilarious).As a critic, I have a long-running rule. The rule is never give zero stars to a movie. Why? Because film-making is hard work and involves a lot of hard-working bodies. With Trauma Center's minuscule character development, bad consultation, and nonchalant way of short-changing the audience, I nearly broke that rule. Bottom line: Stay away from Trauma Center and stay away stat! Rating: 1 star."}, {"id": 223, "text": "Definitely bad directing here. Acting and script were good.Scenes should've been handled another way: 1. You don't leave your witness on an isolated floor where there isn't even a nurse. 2. When the witness realizes something is up, she doesn't go to her cell phone to call the cop who put her there. (Bunch of running around and they catch her) 3. She gets away, has something to eat and watches the memory card she found. THEN she calls for help. Completely ignoring the fact there was a phone the whole time she does this. 4. They catch her, she ends up with a knife one of them had and cuts herself free. Instead of using the knife on the guy, she DROPS it and runs away with his gun. 5. Because she didn't use the knife before on the guy, he comes back and she starts running away (with her sister they'd used a bait). Instead of using the gun, he grabs her and the gun goes flying. 6. The good cop comes, says she did good and WALKS AWAY. What cop would do that. You're on an isolated floor two feet from a dead guy you just killed."}, {"id": 224, "text": "Am I the only person to notice that Bruce Willis' speech is slurred and almost impeded every time he's on the screen? Something is definitely up with him--whether it's on this film or all the time, I don't know but somebody correct me if I'm wrong. Other than that, this low-rent thriller/crime drama was better than I expected and not a bad way to spend 90 minutes. As usual, Bruce Willis was in it just for his name and his acting was simply horrible, going from a screaming lunatic to a lifeless zombie with no room in the middle. Damned shame and a damned waste of what used to be real talent. The other actors were okay--nothing great, but not as bad as Willis, and Nicky Whelan was actually good. Steve Guttenberg was a laugh, too, but did the best he could do with a script that needed a complete re-write. Still, all-in-all, you could do worse."}, {"id": 225, "text": "I love me some Bruce Willis, but this was the absolute WORST acting that I've ever seen him do! The script sucked bc there was just.... too much stupidity! Meaning, very very unbelieveable choices. Hey, bloody girl being chased, make as much noise as possible bumping into stuff and knocking things over! Dude, you have NO IDEA where you dropped it, but you assume she found this little piece of something; THAT, in NO WAY could you feel missing from your person merely by patting your chest! Bad script, bad acting, ridiculous decisions... must be nice to know EPs with money to waste!$!"}, {"id": 226, "text": "So sorry I never stopped watching it, when I suggested it to my wife after 15 minutes. A Legend of the screen... Can't believe the level he has stooped to! Tito Ortiz? FMP... Absolutely brutal acting.."}, {"id": 227, "text": "I had to Google Bruce Willis's age to see how old he was to determine if he was old enough to have cognitive loss related to advanced age. He was 63-64 when he shot this. Not old enough. Then was he under the influence of some drug/s or is suffering from some terrible degenerative brain/neurological disorder? He was slow and off. It was quite sad to witness the terrible acting. The rest of the cast was not far behind. The main female star was laughable in how loud and obnoxious she was while trying to get away from the bad guys. Most everything about this movie was full of cringe."}, {"id": 228, "text": "I am a huge Bruce Willis fan but I didn't recognize him in this moving. His acting did not even rank B movie. It was so fake and he barely phoned in his performance."}, {"id": 229, "text": "This movie is not good for thrills it's simply boring. Do not waste your time watching this movie, I rather watch Shrek on repeat."}, {"id": 230, "text": "We felt like we were watching a B movie. Brice Willis's performance was amateurish. We turned it off at about the 40 minute mark."}, {"id": 231, "text": "I watched this because Bruce Willis was in it and I quickly realized why the acting was so bad even on his part. It was because he was never there with the actors during the scenes. He was never in the same room with anyone seems like."}, {"id": 232, "text": "Bruce Willis being in this movie was completely superfluous. He served absolutely no purpose and his acting was horrible. It seems with every low budget movie I see him in, his acting abilities diminish. Yet I always watch his movies. The supporting cast always tends to outshine him. I am not a movie snob and it does not take much to keep me engaged. For those that are, this is not the movie for you. You have seen it a thousand times."}, {"id": 233, "text": "You might be tempted to rent this movie because Willis is in it but DONT TORTURE YOURSELF. This has officially at the top of my list of worse movies ever."}, {"id": 234, "text": "Absolutley painful to watch. What a joke and waste of time. Horrible story, horrible directing and ridicules acting. Bruce Willis must be running really low on cash to accept this role and act the way he did."}, {"id": 235, "text": "Really really bad acting. It is over the top bad acting like a 1980s B rated movie."}, {"id": 236, "text": "Yes, you know what kind of movie I'm talking about. The kind of movie with a protagonist so stupid, you're gonna facepalm multiple times.Well, the movie wants us to think that she's smart, by pulling some covoluted Home Alone traps. But on the other hand, she makes stupid decisions after stupid decisions. So many times, the girl was perfectly safe and hidden, but she kept running and drawing attention.Oh, and yes, Bruce Willis was in this movie."}, {"id": 237, "text": "Avoid it if you can, there are thousand other things that you can do, like staring to a wall."}, {"id": 238, "text": "Bruce Willis is pathetic in this movie. A total waste of time. Worst movie ever"}, {"id": 239, "text": "A poor film, with no real action, the plot might have been good but the performances sucky and to say of Bruce Willis really a disappointment"}, {"id": 240, "text": "This movie is awful. The leading actress is literally the worst actress ever. I wish she got shot in the head in the first 2 minutes. How Bruce Willis got into this mess is amazing to me. Poor guy. She's so bad it's like a train wreck...you can't look away. Don't waste an hour and a half of your life guys."}, {"id": 241, "text": "Totally a waste of time bad acting too bad actually the young sister maybe the best in this, the 2 bad cops this stupid gang made me laugh when i should not be I waited alot to see if there is better or any diversion but it kept till the end with full of non logic and silly thriller if i saw an action hindi movie would be more enjoyable"}, {"id": 242, "text": "Watching your scenes seems like you are laughing of us.... This movie is a trap with your name in...."}, {"id": 243, "text": "This was the worst movie I've seen in a lot of years. Bruce Willis could barely read a line coherently. I swear he was either drunk or on something. He really looked 'off'. The script is ridiculous. The acting was simply awful....by every single character. The two 'main' bad guys looked and sounded like total idiots. Not one believable character in this flick. The writer should find another line of work.....as should the actors. The director had to have been absent or asleep. This movie has been the deciding factor in that I WILL NEVER BUY ANOTHER MOVIE without first paying closer attention to all reviews and the list of actors. These were all horrible. What was the budget on this disaster of a film? They had to have lost money. I know that I've seen movies that were stink bombs before, but this one is so bad it's eclipsing all the others together! DON'T WASTE YOUR TIME OR MONEY. I'm going to write Lionsgate. I want to send my movie back!!! I wasted $12.00 buying this and I think I damaged some previous brain cells while watching it. Buyer beware! Ugh!"}, {"id": 244, "text": "To be honestI don't remember seing such a bad movie like this one."}, {"id": 245, "text": "I was looking forward to a new Bruce Willis movie but this was a total waste of time. The lighting and film work where shabby and the writing and directing both total garbage. The cast was awesome, jr high acting at best. Was Willis drunk or was it just the directing was REALLY THAT BAD?"}, {"id": 246, "text": "All I'm going to say is Wow! This was HORRIBLE!! It's very unfortunate that Redbox put this in their machines, because had they not, I would have never seen it. A complete waste of $2 to rent&amp; 2 hours to watch it! No stars given here. The acting was traumatic &amp; pure trash!! I wish Redbox gave refunds for movies that completely suck...."}, {"id": 247, "text": "I had high expectations but was, sadly, very disappointed.While I understand that we're all on the aged conveyor belt and eventually past our prime but poor Bruce seemed barely able to deliver his performance. He really didn't come across as very well, perhaps he should have been in a hospital bed getting some rest?The premise was okay, a little predictable perhaps, the storyline was, well, borderline to say the least but delivery and acting of most members of the cast was not at all convincing and there were plot holes you could have driven a London bus through.Not at all impressed, I only got about half way, maybe I'll try again some rainy Sunday where there is nothing else to do, although perhaps not."}, {"id": 248, "text": "A struggling waitress (who did not even fully witness a murder) is chased around an isolated hospital floor by a couple of bad cops, who are desperate to retrieve the bullet in her leg that can tie them to the crime scene whilst not bothering to pick up the shells that one of them sprinkled around when he went berserk to kill her. This is basically the whole plot! Evidence is scattered everywhere, but hey, everything is possible in Hollywood! Even terrible films can get decent ratings!So, what's so horrible about this Die Hard wannabe? Firstly, the script is full of plot holes and continuity errors that at one point it ceases to be entertaining. The witness who was shot in the leg and brought to the ER is treated with a crude bandage over the gun shot wound (where the doctors should have removed it right away to prevent infection. Besides, they already stated the bullet hadn't hit any major arteries). As for the continuity errors, there are so many to count, but my favorite is where the witness steps on a puddle of blood with her white sock and in the next scenes the bloodstain just disappears until a later point in the movie where it resurfaces as dirt, then to become a bloodstain again. Oh! and let's not forget about the memory card evidence they decide not to destroy initially and later lose the tiny card somehow, which is conveniently found by the victim on the run in a steam covered room. Characters are not plausible... a waitress (without any other kind of survival skill set) outwitting two professional killers every time... the two bad apples who are always acting like idiots and... a good cop (Bruce Willis) who sounds like a tough guy but appears to be nothing more than a pointless cameo as he is never in the main action line. Besides, he acts like he had retired long ago.Stay away... Watch Die Hard series... with a proper Bruce"}, {"id": 249, "text": "What a monumental fall, from an A-rated actor to this! Film is trying hard but Willis isn't helping. Did Willis lose a bet?"}, {"id": 250, "text": "I was 10 minutes into this movie and I thought to myself, is this,- could this be-, I mean-really be Bruce Willis? Omg he is so weird in this movie and it is seriously such a bad movie! I just couldn't watch past 15 minutes of this garbage film, and again I say Oh Brucie WTH??????"}, {"id": 251, "text": "Steve Gutenberg acted like he was reading his lines while someone off camera was holding them up for him. Bruce Willis called it in! The two crooks were every cliche. Total waste of my time. Don't bother."}, {"id": 252, "text": "Standard wrong place wrong time on the run from the bad guys film. Bruce Willis seems to be reading his lines directly from the script (saying incredulously Where are you?). The other actors seem to be doing only a shade better. Bare bones plot without any really mystery or thrilling elements makes for a plodding movie with boring retreads of almost every other film like this."}, {"id": 253, "text": "I am so dissapointed about recent actings of bruce willis and dont know why he is trying so hard to burrey his legecy these days. By the way movie and story with two stupid bad guys and stupid police is nonsence Dont waste 5 minutes of your time for this movie."}, {"id": 254, "text": "Really bad acting.. Bruce willis forgot it's a movie and probably left acting at home. Waste of time"}, {"id": 255, "text": "More of 0.5 out of 10. It was a poor plot and poorly acted. The funny thing is I was expecting it to get better but somehow I knew that it was not going to get better. I grew up on Die Hard and this movie makes me sad on his behalf. Not worth it even on a rainy day."}, {"id": 256, "text": "Probably one of the worst movies ever. Scenario is unbelievably stupid. Female actress Nicky is really like a little hysterical girl. Waste of time."}, {"id": 257, "text": "Bad screen play, a waste of resurces... This review dosn't worth more words."}, {"id": 258, "text": "Still don't know how an average woman can take out 2 cops by herself, while she has a bullet in her leg. She also somehow was able to accurately fire a pistol with a silencer without ever firing one before. You can tell feminism is taking over Hollywood."}, {"id": 259, "text": "Worst movie ever stupid A silly story, boring acting, and unrelated reality"}, {"id": 260, "text": "Another semi-okay Willis film that makes me ask what was he thinking."}, {"id": 261, "text": "The acting is fine, but the directing is that of a toaster over."}, {"id": 262, "text": "The film takes place in San Juan. Jimmy Gonzo is a snitch who informs Lt Steve Wakes (Bruce Willis). he is killed in the first scene by a pair of dirty cops who use Jimmy's phone as a setup. Wakes' partner gets killed. In a subplot, Madison Taylor (Nicky Whelan) works as a waitress to pay the bills for her and her sister Emily (Catherine Davis). Apparently the mainland US doesn't have any crappy waitress jobs. She happens to be in the alley talking out the trash when the shoot out happens and she takes a bullet to the leg. As a witness, the two killers, who are also cops, want her dead leading to an inevitable game of cat and house in the hospital where Madison doesn't use her waitress skills to survive.This was a pretty crappy Bruce Willis film. The one where Willis dies in the first scene was a little worse. Nicky Whelan's eyes and cheekbones in the opening scenes gave me Susan Oliver flashbacks. This is a film that doesn't bring anything new to the genre and I found it overly predictable. Willis phoned it in.Guide: F-word. No sex or nudity."}, {"id": 263, "text": "This movie absolutely sucks. I had high hopes but found myself so disappointed that I turned it off halfway through the film.. The acting is cringey &amp; hard to watch &amp; none of the characters are believable. Either the directing was bad or Bruce Willis has lost his touch. They're overacting in every scene."}, {"id": 264, "text": "Drab story, wooden acting. Willis seems permanently drunk and slurring. Only good bit was when heroine used defib to zap baddie!"}, {"id": 265, "text": "WOW, that was the first thing that came into my mind after watching this movie, WOW in how bad it was. WOW was the expression I used the most while watching this movie, in WOW how much worse can this script get. WOW when I saw Bruce Willis acting, in WOW how is it possible that he suddenly can't act anymore. I never thought very highly about Bruce Willis, just an okay actor that has been in a couple good movies, but in this movie it's just unbelievable how bad he acts, and that was not only due to the horrible script. I won't write anything about the bad scenes, as I never want to spoil a movie, but I'm sure you will find it out by yourselves. The biggest name in this movie was Bruce Willis, not the main character though, but for sure the worst actor in the movie. The main character is played by Nicky Whelan, a former actress from the Australian soap Neighbours, I think that sums it about the quality of the rest..."}, {"id": 266, "text": "Poor argument, worst performances, not believable at all!"}, {"id": 267, "text": "Terrible movie. Bad script, completelly nonsense. Bad acting from all actors. And Bruce, please, if you need money, set up a crowdfunding, we can help you."}, {"id": 268, "text": "Low-equipped silent witness, Lao Bu once again just bad money, the whole time in a drunk state of acting, the heroine a mobile phone without a signal to let him row the whole way, fortunately, this time a good person also with two minutes of action play, the director's scheduling and mirror sense, as well as the grasp of Lao Bu's role positioning than those two. A Miller is stronger. Up to now, my requirements for Lao Bu movies are very low. As long as Lao Bu can play a good person waving his fist in the film, I can satisfy a lot. It is sad to see that he has made such a movie now that he has starred in undead McLean."}, {"id": 269, "text": "The worst actress of all time! How Bruce Willis did not se that?"}, {"id": 270, "text": "This so so bad! Why didn't Bruce Willis stopped at his peak!? Dont waste your time on this, it was a rainy day so I thought this was oke.. boy was I wrong. So so sad."}, {"id": 271, "text": "A bad cop just shoots a ci with his documented firearm and shrugs at the faux pas,the writing just gets worse from there,the only real acting was from the women, the men were all hurr durrr i have gun i shoot you, and bruce had one big die hardish scene and that was it the rest was like he was on holiday chillin, anyone supporting / praising this movie must be new to action/ thrillers and not seen die hard yet..the writing was stupid, the characters of the supporting cast and bad guys was woeful, for example if a high up detective tells staff to secure a floor of the hospital and to keep her identity a secret why does NO ONE raise an alarm when two cops from a different division show up asking about her ? Oh yeah just walk right in guys and here's all her info no probs!Oh and we'll just post a rookie outside the only occupied room, that'll be fine"}, {"id": 272, "text": "Poorly done. Weak acting. No attention to details.Time waster."}, {"id": 273, "text": "I feel for the rest of the cast, honestly. they did their best to rescue this production. The story was good enough to might have achieved more, but when you have a big name on the cast, with or without intent, the audience is redirected to a single cast member. I was in shock. Bruce Willis has become bad with the years... but this was the cherry, awful participation, because performance was not."}, {"id": 274, "text": "What a dissapointment. It looked like Bruce was on tranquillizers the whole time. I do not know what the movie was about. The whole story could aldo be done in 20 minutes."}, {"id": 275, "text": "Trauma Center could have been a decent movie because leading actress Nicky Whelan plays her part well. Unfortunately, that's the only good thing this movie has to offer. Like his recent flicks, Bruce Willis has limited screen time and does look bored as hell without any emotion.The story gets boring soon when you realise that most of it takes place in an abandoned ward of the hospital with our random waitress outsmarting two crooked and professional cops time after time. It's as believable as a Roadrunner cartoon. They must be amongst the most incompetent cops ever put on the big screen. The dialogue is cheesy and the few fight scenes aren't convincing at all.Well at least we got to see not one but two big movie stars from the '80's: Steve Guttenberg (Mahoney from the Police Academy franchise) also has a glorified cameo !"}, {"id": 276, "text": "I have always been big fan of Bruce Willis, but it is obvious he is not reading the full script in these past few movies he has done. This is only 5 out of 10 because it had pretty good action and a really good plot. But the writing was horrible, and fact checking things you put in a movie is #1 to detail, cops dont drive mercury's they drove crown vic's, there were just a lot of issues. other than that decnt plot line and decent acting."}, {"id": 277, "text": "Managed to get thru 30 mins before I gave up. Right about the time I saw Bruce Willis' tired face. Tired at having to go thru another hour of this crap.I feel you bro...Over and out."}, {"id": 278, "text": "Gave it a 3 only because I stayed 'til the end when the director put this turkey out of its misery with a bone saw. Beyond bad: plot holes so big you could drive a semi through them; the dumbest, most incompetent assassins on file; a victim who repeatedly defies the laws of physical science when she should have died or lapsed into a coma long before her deliverance... Willis appears so jaded with the business of acting, it's almost unbearable to watch him go through the motions in this Keystone Kops caper with sound."}, {"id": 279, "text": "Bruce Willis must have a lot of time on this hands cuz he sure is showing up in a lot of Lionsgate pics.This one is no different than any of the others. Tense set up with throbbing music and schizoid directing and actors who read their lines as if they were just handed them."}, {"id": 280, "text": "Worst piece of crap I have ever seen Bruce Willis in. Not that he's the best actor in the world, but his acting was really bad in this movie."}, {"id": 281, "text": "This is one of those new amateur movies. But at least not the worst. No obviously fake stuff. Topic is realistic and actors look somewhat immersed. But besides that there is nothing to interesting to see in this movie. Just another day in somebody's life. Crime, getting hurt, statistics, corruption. Maybe too amateur. Cops especially the bald one look like real cops. Kind of unfinished or too quickly finished. Not worth a watch. Also I hardly recognized Bruce...but I knew it was somebody known to me...just maybe not expected to see him in low budget movie."}, {"id": 282, "text": "Poorly written. The female lead was very believable and did a good job with what she had to work with. I should have guessed the movie was not very good considering I found it buried in a load of B rated movies."}, {"id": 283, "text": "The movie is terrible. I loved it. It's so terrible at so many layers. I had my laptop open, and have happily done laptoppy things with this movie on. I do believe all the actors knew how terrible this movie was and still wanted to put in half decent performances, and it's kinda good for that. However I'm not completely convinced that many of the actors in this movie can act, but that's alright, Bruce W. is pretty much cardboard narrator. It has Nicky Whelan in it so....Dunno how else to say it: It's a terrible film but was nice to watch.... whilst doing laptoppy things."}, {"id": 284, "text": "Bruce Willis seems to have forgotten how to act. in sympathy with the rest of the cast ! One 'unfortunate' baddy suffers Home Alone style 'damage' throughout the movie, the only reason to continue watching turns out to be 'What happens to him next' !"}, {"id": 285, "text": "This movie it's one that I will not forget soon. Bruce Willis is acting like he's drunk; I'm not a good english speaker, but when I drink 5-6 beers and I speak english, my voice sound like his voice in this movie. Some scenes are so bad that make me wonder if the whole crue decided to make the movie after a long party. When Willis come at the place where Maddison was hurt, he shout 'Stop' and it's sound like he want to say: 'don't run, I apologise for my behavior; I just want to talk with you, don't be like that!. The scene where the black guy realized he lost the micro SD card is hilarious! The cherry on the cake is when he realized that Maddison found the card: I know that you found it, It's a huge SD card, it's impossible to not see a card like this, and I know that you put the card in a safe place. Obviously, not in your socks! The movie stinks from beginning to the end but the good part is that I will remember this movie and I will lough every time!"}, {"id": 286, "text": "I think Bruce Willis is in this just to get people to watch it. What a disappointment. Looked like he was sleepwalking through the movie as well as having bad dialogue. The two bad cops gave a better performance but still couldn't save the movie."}, {"id": 287, "text": "I do not understand why all of the reviews have to do with Bruce Willis. You act like all of his performances in the past didnt matter, I can see this is 100% directors fault. I thought I was watching a movie from 1970. The story is good, not original. I chose it because it had Bruce Willis in it. I did not look at the director. I have no idea how a movie made in 20019 could look exactly as a movie made in 1970. I wonder if the star of the show can decide not to go forward after seeing a preview?"}, {"id": 288, "text": "They shot up dude, riddled him with bullets, but they only care about the bullet in her leg? I'm confused."}, {"id": 289, "text": "It's as if Bruce Willis is forcing every line...and I couldn't figure out why! What happened to this guy? And someone please don't let Tito Ortiz act...every again! I started this and stopped about 20 minutes in...after I kept laughing thinking 'what in the heck?' but started it again while I was cleaning up around the house. It didn't get any better. The lines, the acting...it's all just so awful."}, {"id": 290, "text": "I created an account on IMDb just to write a review on this movie. It was so bad. The jump scares are predictable and annoying. If you watched a few standard action movies (especially those from the 90's and 2000's) then you always know whats going to happen next. Oh don't forget the mandatory child with asthma, conflict between the protagonist and his/her protection  and the no cell reception. But the worst part are the huge plot holes. I starts with (spoiler alert) the two bad cops having the whole floor sealed of and prepare everything. Kill the cop in front of the targets room and then? They hide the body first? Why? Why not kill the target that was oh so important and then clean up both at once? Nooo, let's give her time to figure it out and flee the scene. Also as if you could seal up an hospital floor like this (even if its empty). Especially they can lock all emergency exit doors (and on all the floors, even the active ones?) And the security guard is doing this why (as a security guard I would start asking a lot of questions if two cops would demand that, instead of just going up there and arresting the helpless shot victim). By the way, they manage to shoot the security guard with a perfect double tap while their target is in front of him but somehow she magically can escape and they are suddenly like miles away? WTF? Bruce Willis (I love him) does not save this movie at all. This movie is to good to be so bad that you can watch it for fun (like those really cheesy Z movies) but way to bad do be watchable."}, {"id": 291, "text": "What a waste of time. Worst script. Worst acting (do you think you could do better than just read out the lines?). Bad continuity. Bad plot. So many inaccuracies (halon drop should call fire dept. Why no cell service in the entire hospital? Etc). Utter trash."}, {"id": 292, "text": "If there was an award for a major celebrity making the greatest number of bad movies, Bruce Willis would certainly get a nomination. The plot is the familiar bad guys try to kill the pretty girl but the pretty girl get tough and fights back film. This one has all the usual cliches where the pretty girl always manages to escape death just in the nick of time. Worse still, Bruce plays this whole movie like he's drugged or half looped. Maybe he just doesn't care. And maybe he doesn't care if we know he doesn't care. It's a paycheck, after all.If you can't find anything else to watch and you're looking to waste 90 minutes of time, here's a movie for you."}, {"id": 293, "text": "Corny as hell! This movie sucks. Why Bruce Willis chose to take this role?...I don't know."}, {"id": 294, "text": "Absolutely horrible acting even for Bruce Willis! Like wtf! Do not waste your time watching this unless you just want to cringe at something."}, {"id": 295, "text": "Terrible plot. And anyone who is familiar with Puerto Rico 🇵🇷 would and should be embarrassed that it was filmed there. Bruce Willis' worst movie ever."}, {"id": 296, "text": "This whatever it was, was a joke. Dumpster scene free, hospital top 2 floors probably 1,000. This so called movie was a disgrace. 3 cops total n the movie. How cheap can u go. A waste of time.... u can do better than that. Pandemic or no pandemic. Damm... major disappoint n i expected more out of Bruce Willis...Bruce didnt even have mamy lines... wtf"}, {"id": 297, "text": "Joel and the Bots on Mystery Science Theater 3000 would have had a blast riffing on this movie, it's so bad it's an unintentionally funny movie. I can't disagree with those who are begging people not to see it, yet it's worth a rental just to see that Ed Wood-quality movies are still being made."}, {"id": 298, "text": "Bruce Willis sucked me into this one. I persisted then had to give up. At first I thought the terrible acting was a joke. After 30 mins I realised it wasn't getting any better and I switched off. I feel dirty for even giving it a go past 2 minutes. Would give a zero if possible."}, {"id": 299, "text": "First off Nicky Whelan was the ONLY thing good about this movie. Bruce's acting just plummeted in thia. All of the acting was awful, especially Bruce and the younger sister, Emily. I stayed up to start watching this.... wish I'd a just gone to bed!"}, {"id": 300, "text": "The story is typical but what was remarkable was Bruce Willis. Seems like he was drunk throughout the shoot. Definitely an uninspired performance!"}, {"id": 301, "text": "Absolutely awful acting, stopped watching after 10 mins, makes Bill and Ben and the Wooden Tops look great."}, {"id": 302, "text": "Bloody terrible movie. Bruce Willis lines are trivial and inane. Heroine is capable of climbing on a table and getting into an air shaft whilst seriously injured beggars belief!, She must have super human powers to evade two large males who can't follow her whilst she is making an incredible racket where ever she goes. One evasion might be believable , but there are so many escapes."}, {"id": 303, "text": "Worse movie Ive seen in a while. Bruce Willis is attrociouw the 15 minutes he is on screen. Rest of the cast is horrendous. Was actually hoping the bad guys would get her. Thats how frustrating this movie was. The laugh factor is undeniable from the first 5 mins. Literally didnt care about the characters. Rubbish. A joke. Watch if you want a laugh. Drama Thriller. Yea right."}, {"id": 304, "text": "Simple plot, but with the exception of Whelan and Battle the acting is hilariously bad. Willis and Guttenberg appear to be medicated... or recovering from a recent stroke. Ortiz is just hopeless. Even the extras are overacting. The editing and lighting are horrible. Why is the woman in hiding making so much noise? Congratulations to anyone who made it to the end of this pitiful effort."}, {"id": 305, "text": "This is the worst acting I have ever seen from Bruce Willis and the rest of the cast were not much better. What happened to the Bruce Willis from the 'Die Hard' movies? I don't know why everyone has given this particular movie any higher rating than 1* and even 1* is too high of a rating for this trash."}, {"id": 306, "text": "What on earth was Bruce doing in this movie? His acting was worse than an 8 year old in a school play. This is comfortably in the top10 worst movies I've ever seen. Make that top 5."}, {"id": 307, "text": "Do not waste your time! B grade acting from everyone and I want that hour and a half of my life back."}, {"id": 308, "text": "Bruce. The almighty bruce. Sir Brucester the bruceiest of Brucetown. What were you thinking! Were you drunk? Dog sheet!"}, {"id": 309, "text": "As a big fan of Bruce Willis - I am not quite sure what happened here. For some reason Willis had this slow drawn out way of talking. It wasn't like he was using an accent, he was simply just talking super slowly as if he'd had a stroke. I actually questioned if his parts were filmed in a seperate studio and then he was added in later. Gutenberg was obsolete. The goons were stupid. Their general acting, movements and 'acting at searching' were terrible. I've never known a hospital to have it's morgue on another level other then the basement and in true frustrating form the proverbial government run hospital employes had incompetent security and nursing staff. The hospital must have been lead-lined, or something as the character's mobile phone held no signal despite being in the middle of the city (can we make surviving in a hospital any harder for patients?). Nicky Whelan was quite a good heroine, but was really the best out of a bad bunch."}, {"id": 310, "text": "I've always been a Bruce Willis fan. I also really like movies with a strong female lead.This movie was just irritating as the female lead mostly just acted like the dumb damsel in distress, and did nothing to ensure her own survival the vast majority of the time. I realize the dumb thing adds titillation, but you can let her make smart choices and still add suspense by simply having some of the choices not work out. Just sitting and crying and making too much noise is unnecessary.In Bruce's last few movies, including this one, he's seems subdued and slow. Not the charismatic and energetic personality we're used to. May be time to retire."}, {"id": 311, "text": "I didn't even recognized Bruce Willis at first - his acting was shocking! Everybody elses acting(?) wasn't far behind either. Story line hard to believe. I only watched it because it was so bad."}, {"id": 312, "text": "This is EASILY one of the top 10 worst movies I've ever watched. Literally everything about the movie is poorly done, the acting, the setting, the script, all of it."}, {"id": 313, "text": "I don't know what's worse the entire acting or entire plot, I thought it was a comedy to start but soon realised it's just a poor corrupt cop movie. It's light , ok to watch but don't expect much."}, {"id": 314, "text": "Film is a pass but Bruce Willis was horrible. It was like he has forgotten how to act...."}, {"id": 315, "text": "I'm giving four stars for the performance and effort of Nicky Whelan. Bruce Willis didn't need to be in this flick, it could have easily been any generic actor."}, {"id": 316, "text": "That was terrible from start to finish. Bruce obviously needed a quick pay day and forgot to turn up!"}, {"id": 317, "text": "And I thought Santa Claus vs the Martians was bad."}, {"id": 318, "text": "It really felt like I just watched a flat movie. I kept watching it in hopes of a change at some point. Bruce was there for 5 minutes and I feel like the main focus was on Nicky (which I didn't mind). Very poor action and easy to predict scenarios, a movie without surprises is like getting a present that you already have."}, {"id": 319, "text": "I love him but the time has come to up his boots. The acting is pathetic as he painfully slowly paces from scene to scene moving only his lips and talking to himself. I just can't stay until the end. What a shame he's come to this"}, {"id": 320, "text": "I'll start with the positive. The concept was good. Nicky Whelan was the only bright light in this movie. Every other aspect of this movie was bad. Either Bruce Willis has developed dementia and forgotten how to act, or he just couldn't be bothered, or he spent the whole movie doing a bad impersonation of John Malkovich as a joke. Whichever it was he was bad, and I like Bruce Willis."}, {"id": 321, "text": "Plot was thin. Acting was bad. Tension was slack. Also the bad cops had no idea the bullet was still lodged in her leg, but told the woman all they wanted was the bullet back. Bruce Willis acted like an amateur, awkward and unconvincing. Maybe shampoo your cat instead of watching this."}, {"id": 322, "text": "Willis I'm sure was drunk slurring words, just aweful acting from him. The director was probably on the drink with him. Don't bother."}, {"id": 323, "text": "Bruce Willis had little facial or voice expression in this low budget movie made for tv. Where were his signature looks and sounds. It is watchable but better acting would have been helpful towards earning a higher score. I expected to see the usual performance from BW but sadly it was a shadow of his previous acting roles. The other cops also failed to deliver convincing performances. The two girls were better in their roles but at the start their voices sounded off too. Was it something to do with the sound? It could have been much better if more time was taken to polish the characters' voices and expressions. It was fairly predictable but that could have been forgiven with better performances. Where were you Bruce?"}, {"id": 324, "text": "By the first 30 minutes of the film I was considering sticking bamboo shoots both in my eyes and under my finger nails, certainly would have been less painful than sitting through this absolutely appalling movie. Save yourself the pain and go watch a better written movie like The Goonies. Bruce should publicly apologize for taking part in this film."}, {"id": 325, "text": "Not the best acting and there are so many holes in the storyline. I think Bruce Willis forgot how to act in this movie."}, {"id": 326, "text": "Can't believe how bad the acting is by Bruce Willis &amp; the others."}, {"id": 327, "text": "How is it possible that his acting is so bad? Not that he have been super before but this a really low mark. Decent acting from The female maincaracter is the only reason this movie doesnt suck even more."}, {"id": 328, "text": "If I had my time back I would have watched something better. I watched it because of Bruce Willis. I love Bruce Willis but this was not a good movie."}, {"id": 329, "text": "Oh Bruce what happened to you. Where did your talent go. I have watched 2 recent movies on Netflix and you are terrible in both. Now Nicky was amazing she did a terrific job. Now to the rest of the cast such terrible acting."}, {"id": 330, "text": "What a mess. What plot, dumb villains and Bruce Willis..what is the point? Save time, watch a rerun of COPS. Bruce Willis must need money for Rumor and Demi."}, {"id": 331, "text": "This so-called movie plays more like an episode of a third rate TV show. Very boring. At first I thought that it was a vanity project for Willis - that is, one of his children directed or produced it or he is dating the leading lady, but, I could find no evidence of this. Maybe it's just that he is getting too old to find quality work. Not up to his usual standard."}, {"id": 332, "text": "More of a cameo for Bruce Willis! The heroine seems to survive through everything dispute a bullet in her leg that continues to bleed! The bad guys are inept at killing the target in a closed floor with no witnesses! Sadly I will never get that hour and a half back!! Sad to see where Bruce Willis's courier has gone! Take a bow and move on Bruce !!!!!!!"}, {"id": 333, "text": "Listen, I'm a huge Bruce Willis fan, I loved him in Tears From the Sun, all the Die Hards, etc, but this, this, THIS film? What happened? Was it the directing? Storyline? Script? The acting? An actor generally is as good as the script. So I'll go with the script. Yeah it's bad! There weren't enough scenes for me to really comment on Bruce's acting, he's barely in it. As far the other actors? Blame it on the script."}, {"id": 334, "text": "I felt very sorry for the actors in this show. I couldn't tell which was worse, the script or the directors end result."}, {"id": 335, "text": "I like bruce willis as an actor but this show was the worst movie I've watched in a while. He was drole in his role as an officer. It's like he forgot how to act. The other actors that played, although didn't recognize the names weren't much better. The story line was boring and I do not consider this a thriller. Most of the show, I was saying aloud or in my head how stupid it was what was happening or it didn't make sense."}, {"id": 336, "text": "I hope Bruce got paid a lot for this nonsense. Fancy building up a great reputation and then letting it all go for a film like this. I should've realised when I saw he was the only name I recognised that this film was a turkey. Ah, well."}, {"id": 337, "text": "What has happened to Bruce! Quite possibly the worst acting ever. No words other than don't bother."}, {"id": 338, "text": "This is a bad movie. So unreal. 2 killers are walking armed to try to kill a blessed woman in a closed department of a hospital and they are walking like they could be killed themself. Unrealistic, stupid, no brainer. Not funny, not exciting, not clever, predictable, bad acting even by Bruce Wilis. Not recommended..."}, {"id": 339, "text": "Victim who knows too much being hunted by crooked cops. Crooked cops who cant shoot, have zero tactical knowledge, and do bunch of dumb stuff. The dumb starts off early when our incompetent duo fire a doz rounds at our victim, who is no longer visible. Maybe they had a grudge against that masonry wall, not sure. Crazy idea, walk down alley and cap your unarmed victim who is hiding behind cover. Having hit her once earlier, they are after the slug inside her, as it can be traced back to the crooked cop who fired it, because we all know when you're on a hit you carry your city issued piece. Bruce shows up and fires several times at the fleeing suspects. Totally illegal in America, but apparently not illegal in B movies.Later our victim is in hospital, in a secret room with police guard. Unfortunately not so secret that our killers find out and kill the incompetent guard. Our victim is crafty enough to escape. She steps in a big puddle of blood that she cant see for some reason. Shes wearing a sock or something on her foot but luckily doesnt make bloody footprints to her next hiding place. While barricaded inside she has idea to electrocute bad guys on other side with an AED. Fortunately for her, doors have a shockable cardiac rhythm, because it worked (AEDs only deliver a shock after recognizing V-fib, or VT without a pulse. Trust me, im a medic). Later we have another scene with a defib but i dont have time to get into difference between joules and volts. Our victim encounters another cop, but he is dramatically shot. For some reason our victim is not, even though shes 2 feet away. Again our villains dont even enter room, just shoot a but shoot bunch of rounds at unarmed victim. They finally get her and zip tie to bed. She manages to free herself buy cutting restraint with bad guys knife. Thats great for zip tie #2, but how was she able to get the knife as a sec earlier both hands restrained? Anyway instead of attacking our villain with the knife she chooses to electrocute him which wouldn't have worked in reality (see explanation above). This movie was weak. Real disappointed with bruce who i consider a good actor. I guess it could have been worse, as i actually watched it all the way to end. Decent acting, real bad script, and obviously no tech advisor for law enforcement or medical subjects."}, {"id": 340, "text": "There are so many things wrong with this movie. The one thing right with it was it made me laugh. That's not a good thing when the movie is supposed to be serious. I thought, this can't be Bruce Willis, it must be a double. His acting was horrible, and all the police portrayed were made to look ignorant. I couldn't give it one star. Come on Bruce, what were you thinking? A woman runs around a hospital with a bullet in her leg tryin to escape two bad cops trying to kill her while taking time out to eat a cupcake. Willis doesn't come to help until the end of the movie after she's done all the work to save herself. Bruce says, stay put, I'll get someone to help you. Really? Good thing she didn't wait for Bruce to save her, she'd be dead. I wondered what year it was made and looked it up, 2019. What? Maybe it shouldn't have been made at all."}, {"id": 341, "text": "There are No thrills on this rather boring film in this deja vu film."}, {"id": 342, "text": "Please tell me what happened to Bruce Willis?!? Good god. It was like he was purposely trying to deliver his lines as poorly as possible. Shouldn't even have to sit and think he's delivering lines.  Don't worry we haven't had a spread of ebola .....Yet. Good grief. I ketpt thinking is this just ad writing but I did the lines and yes but they could have been delivered with more gusto. It was like he was drugged the whole movie. Sorry to go on but he use to be good. Lala Kent was better. The movie.. Typical you know what's going to happen thriller where everyone makes poor choices and it's just cliche. I went in watching for what it was but I'm going to look back thru my reviews because this isn't new with Wilis. This level of bad yes. And edit to add... Lets put her in an infectious disease ward and she goes running around touching things everywhere.. Omg I have to edit again. After reading the multiple reviews that Bruce seemed drunk I'm going to go with that and hope that he has developed some drinking problem over the last few years and that's why his acting has gotten do awful."}, {"id": 343, "text": "He looks like a new and young actor. Dialogues are weak. Is this his first movie? Disappointing."}, {"id": 344, "text": "I want to know first of all, how can Bruce Willis not act outside major movies?? This baffles me! He is a seasoned actor!! Watch out for him putting his number in a mobile (cell) phone and you will see what I mean...The movie is watchable and intensive. Storyline is unique, a resemblance between Halloween 2 and Home Alone... (Trapped in a hospital and fighting two criminals by electric shocks, gassing and other methods).The acting on the other hand is just traumatic.Watch out for a cameo appearance by Steve Gutenberg (Mahoney from Police Academy). The only decent actor in the movie."}, {"id": 345, "text": "I like Bruce Willis, i grew up watching him along with other Action stars &amp; often check out some of his straight to dvd flicks &amp; sometimes it's a terrible cheap mess &amp; other times it could be a little Gem &amp; here with his latest effort it sits more on the Gem side. Now, Trauma Center is not a great film but it's not a terrible one either, i liked the one-location setting in the Hospital &amp; reminded me of Halloween 2 (1982), i love films that are based in a single location, also like Carpenters 70's Classic Assault on precinct 13 now this film is nowhere near as good as those two films but it's an easy watch with some good suspense bits &amp; a cool atmosphere. Basically an injured witnesse to a murder is being hunted by two corrupt Cops in an isolated part of a hospital. It's shot well &amp; the cinematography has a hazy smokey look like a low-budget Horror. Aging old-school Action hero, Bruce Willis has small but important part as an exhausted looking cop named Detective Wakes. Willis is fairly good here in really simple &amp; easy role, he has just come off of a long double shift &amp; is thrown into a conspiracy of corrupted cops &amp; an injured witness, played by Nicky Whelan, who gives a good solid performance here as Madison &amp; Willis just has to do by the book typical Cop stuff which he's done tons of times!!! Willis looks knackered &amp; it suits his character intentional or not? A tired Willis as an old grizzled Cop is fine by me &amp; he's still an interesting watch. Trauma Center is a basic Low-budget &amp; B-movie Thriller but it is made well &amp; is stylish looking with some good suspense-filled scenes with the cat &amp; mouse stalking through the empty hospital, it's a decent cool Thriller"}, {"id": 346, "text": "Trauma Center is your basic Die Hard in a hospital with the John McClane character being replaced by a waitress (Nicky Whelan), and the terrorists are replaced by some corrupt Vice cops (Texas Battle &amp; Tito Ortiz).The Good....this film is only 87 minutes, and the story moves along at a decent pace if you find yourself quarantined with a rain storm outside. Nicky Whelan also gives a damn about creating a compelling character that one can cheer for.The Bad...the corrupt cops played by Battle and Ortiz. The circumstances of why they have to chase down this waitress/witness is almost laughable. The two lunk heads clog around the entire film in moronic fashion. Battle attempts to portray a charismatic villain, but can't due to the fact that he has to lower his acting ability to balance out Ortiz. There are portions throughout this film where I thought these two guys were doing their best Three Stooges imitations.And Finally The Ugly.....Bruce Willis. Trauma Center is the 1st of a three picture deal that Willis signed with MoviePass film, however I can not find an exact figure for the deal. Hopefully MoviePass will get some acting out of Willis for the final two films of the contract. His supposed acting in this one was cringe worthy. I understand from reading about past film sets that Willis can be very difficult and it translates to I don't care performances, but he certainly takes it to another level in Trauma Center. I can almost bet that he never read the script, never studied his lines, sat in his plush trailer drinking and counting down the days till the end of the shoot.His performance comes across as someone who told Director Matt Eskandari that he (Willis) was obligated to do only one take and had his assistant (who was responsible for studying all of his lines) just off screen telling him his lines for the 1st time. No magic editing can fix that.Bruce Willis has never been thought of as a great thespian, but when the best performance that you can muster in Trauma Center is standing behind a shot up unmarked police car holding a gun in silence...the movie viewing public deserves better."}, {"id": 347, "text": "In Puerto Rico, the waitress Madison Taylor (Nicky Whelan) is dropping her garbage in a dumpster during the night when she witnesses the murder of a police detective by two men and is hit on the thigh. Lt. Steve Wakes (Bruce Willis), who was the partner of the killed detective, takes Madison to the hospital to remove the bullet to look for marks to identify the killers. However, she needs to spend the night in the hospital and goes to an empty floor under the protection of a police officer. But the two killers are indeed the corrupt cops Pierce (Tito Ortiz) and Tull (Texas Battle) and they will do anything to kill Madison and recover the bullet.The underrated Trauma Center is a tense and entertaining low-budget thriller. The plot is not an Oscar winner and has clichés, but the film is not bad as many reviews indicate. Nicky Whelan steals the show with a great performance and Bruce Willis is also good in the role of a veteran detective. My vote is seven.Title (Brazil): Centro de Trauma (Trauma Center)"}, {"id": 348, "text": "Judging from the low rating, I didn't expect too much from this movie but turned out it was a bit more than decent.Yes, Bruce Willis somehow talks funny. I even think the role should have been given to a not-so-well-known-actor so that people don't focus on his sloppy acting and criticize the entire film because of it. However, in my opinion, that doesn't tarnish other good parts of this flick.I really like thriller/horror films with a strong or clever female lead, the kind which the protagonist outsmarts the antagonist(s). This is it. She has a good hunch and makes good choices. I see why some people complain about the script. It is not great, but I could overlook most of it because I was concentrating on how the heroine cleverly managed to get out the situation. Towards the end, the script gets corny and cliched. Yes, it can be cringe worthy. The lead actress is not just pretty but also gave a convincing acting. She made me want to see her other works as well.If you can overlook Bruce's drunk acting and the stereotypical portrait of antagonists, instead focus on how the main character find a way to get back to villains despite her limited situation, you'll enjoy this movie.If you are seeking Bruce Willis's solid action, you don't find it here. In fact, he is not even adequate in this one. Maybe if you are open-minded and can laugh at his acting and corny dialog of some of the characters, that's one of the way to enjoy this film.This movie certainly kept my attention till the end. It doesn't deserve 1or 2 stars. The heroine deserves more, I'm giving 6.5/10."}, {"id": 349, "text": "It's not one of greatest films I would watch it all over again but hey at least thankfully I wasn't disappointed of film I had fun I enjoyed it it was Unstoppable Action-thrilling film it was Intense and watchable as well, I personally think it's not that of bad movie at all to honest the only thing I was Bruce Willis lead instead because I haven't seen a single Bruce film when he was a lead role since (2018) Death Wish film and Terrible film Glass (2019). I love Bruce Willis, I grew up watching him along with other Action stars &amp; often check out some of his straight to DVD flicks &amp; sometimes it's a terrible cheap mess like with Prince and Precious Cargo and First Kill &amp; other times it could be a little Gem &amp; here with his latest effort it sits more on the Gem side just like with this and Reprisal, 10 Minutes Gone, Survive the Night, Hard Kill those ones were a little Gem same goes with this movie but their aren't big blockbuster big films something you don't take too those direct to DVD films too seriously. sadly he gets second role films rather then being lead sadly I miss him as lead role movies just like my favorite Remake Death Wish (2018). I liked the one-location setting in the Hospital &amp; reminded me of mix Combination of Die Hard with lead chick mixed with Halloween 2 (1982), I love films that are based in a single location, also like Carpenters 70's Classic Assault on precinct 13 nowthis film is nowhere near as good as those two films or Die Hard films or any other bigger Budget films unless I would say any of those direct to DVD films are better then Glass (2019) but it's an easy watch with some good suspense bits &amp; a cool atmosphere as well I wish it was a darker thriller witch it would be cool if it's a mystery serial killer in it in a Bruce Willis film that would be sick chasing a lead girl around while Bruce character Investigates it would be a lower Budget with Die Hard and with Halloween 2 (1982) but anyway it is what it is, the acting wasn't bad it wasn't sloppy and it wasn't bland either so acting was good nothing wrong with script. story follows a witness Madison Taylor (Nicky Whelan) saw someone got murdered by crooked cops a former UFC fighter who is now an actor (Tito Ortiz) Pierce and Tull (Texas Battle) who appeared in 4 Bruce Willis films like awful Marauders, 10 Minutes Gone, and this film, Hard Kill recent film. Madison got shot on leg for trying to save guy who got shot then she got shot on leg then Lt. Steve Wakes (Bruce Willis) found a dead guy he is investigation and in really simple &amp; easy role, he has just come off of a long double shift &amp; is thrown into a conspiracy of corrupted cops &amp; and girl got shot on leg Madison to ask about dead guy and 2 crooked cops she knows nothing about then suddenly building was under lockdown from some pandemic and 2 cops broke in Hostpal looking to kill Madison because she is witness and she is on run while being injured witch that would be very difficult running and walking with a injured leg after being shot but she has no time to rest because 2 crooked cops are after her she has to surviveIt's shot well &amp; the cinematography has a hazy Smokey look like a low-budget Horror. Aging old-school Action hero, Bruce Willis has small but important part as an exhausted looking cop he is investigation looking for crooked cops that killed guy he is in case while Madison is getting chased by crooked cops at Hostpal and yeah Bruce did some damage in film he was involved in some action in film so yeah he does some things in film. Trauma Center is a basic Low-budget &amp; B-movie Thriller but it is made well &amp; is stylish looking with some good suspense-filled scenes with the cat &amp; mouse stalking through the empty hospital, it's a decent cool Thriller fast pacing and it's watchable non-stop action this is type of movie you will see on Netflix. At least Willis wasn't bored or falling asleep in this one film just like with Prince his skull was burning as hell like he doesn't want to be their, like with Vice he looks like sleep bored tried, I remember other awful Bruce Willis films got terrible and horrible got worse with Rock the Kasbah he looks like I don't want to be here oh dear got Precious Cargo horrible, then when he got in Marauders he looked bored like if he was sleep walking then with First Kill he doesn't want to be their anymore in set then after that he did rest of direct to DVD films he did Death Wish remake was big hit then after other theatrical film released at theater 3rd terrible Glass film then after he did alright good direct to DVD films just like with this film I really wish they hire him in better bigger films again but sadly.with this film NO annoying shaky cam or constant fast editing that destroys so many of these low budget action thrillers. The single location was well utilized to maximized effect. The director elevated the look/tone and style in a great way. The acting was decent as well, this is time waster film that is decent to time waste with believe me it's worth of seeing this film 6.10"}, {"id": 350, "text": "This film was clearly a 'very' low budget B-grade film based on the few location sets, but had a fairly decent supporting cast for a change. Good to see Tito Ortiz and Steve Guttenberg, but Nicky Whelan definitely stole the show. I'm not sure why Willis was even in this film, but at least he didn't seem bored or falling asleep in this one compared to the previous bunch I've seen him in.Novice director Matt Eskandari was fairly decent behind the camera, but needed to direct his cast better. The writing by newb Paul Da Silva was atrocious. Sure it was his first writing credit, but out of the almost 30 producers, you'd think at least one would've suggested a read-through by a seasoned screenwriter before going to action.The 87 min is normally a decent runtime, but to have that time in such a plot-riddled nonsense seen-it-many-times-before unnecessarily long dragged out scenes wannabe Die Hard in a hospital *finally takes a breath* story, made me begging for the ending many times. As predictable as it was, I was hoping at least for a fun twist or something, but instead, we got Willis a role for a character that wasn't really even needed.For an amateur extremely low budget B-grade film, it still had its moments. It's a generous 6/10 from me, and certainly undeserving of all these 1's and 2's, especially considering some new filmmakers gave it their best.To see more of my 1000+ ratings and 700+ reviews, click on my username."}, {"id": 351, "text": "I would certainly classify this as more of a thriller than an action film. What makes a thriller good? It's the suspense, the nail-biting, tense situations the film presents that have the audience at the edge of their seats at all times. The intimacy of the film is the main thing that makes it so fresh and interesting as a thriller, if it was taking place around a city or in a town it would not be half as suspenseful as having it all take place in a hospital. There's a couple great set pieces that use the location to its maximum. And the wonderful cinematography creates a frightful atmosphere for the audience to get engaged in.It did, on the other hand, make some cliché plot developments. There are some moments that were so typical they took me away from a movie that was clearly trying to stand out, but was clearly forced by the studio to have some predictable plot points.Let's move on to the actors. Bruce sadly only has a few moments and he's dreadful to watch at this point in his career. There's flashes of his brilliance but its mostly late stage Marlon Brando syndrome where he looks like he's reading cue cards. Nicky carries the movie and her performance in this film was much more nuanced. You could see that she was a much more complex character. She showed vulnerability, sadness, anger, depression and hopelessness, all through her eyes and expressions, as his role did not require extensive dialogue. She was the star of the film."}, {"id": 352, "text": "Man, what happened to Bruce Willis? I watched 'Pulp Fiction' again a couple of nights ago and it was a stark reminder that the man could act. I mean he was never going to be an Oscar winner, but he was able to be extremely watchable and usually in some pretty good films. In 'Trauma Centre' you could be forgiven for thinking he had a stroke the day before filming. His line delivery was appalling (and it wasn't exactly great dialogue he was working with to start off). I wondered whether he was trying to put on an accent or something, but I don't think he was. It was very off-putting and what should have been a strength of the film turned into a massive negative.I felt sorry for Nicky Whelan because she was giving it her all here. She was the bright light of the film and made what would've otherwise been a pretty unwatchable film bearable. There are a few reasonably well recognised actors attached to this project which makes me think the film probably looked a lot better on paper than in reality. There are even parts of the film that come off quite well and are quite tense and well shot. They are too few and far between though unfortunately.The whole premise of the movie makes no sense. These cops need to get a bullet out of a woman they shot so they can't be caught, but they didn't just fire the one bullet that hit her, they fired dozens of them. I couldn't wrap my head around that. Deep, deep down I think there was the hint of a good film here, but it's a long way from reaching the surface I'm sad to say."}, {"id": 353, "text": "Movie review : Storyline and script good. It's a good thriller, and one that will keep you on the edge of your seat. (The Good).Acting review : Terrible. I'd normally give the actors within the movie the benefit of the doubt, yet Bruce Willis is a seasoned actor and should know how to act. He took literally less than 5 seconds to put his phone number into a stranger's phone. His conversations both on the phone and in person were CHEESE. He walked into the end scene holding onto the wall after a weak fight, where as the woman who had been through 100 times worse was in comparison in better condition. (The Bad)Bruce Willis did not need to be in this movie. The woman had it covered.Oh.. and no! Don't be deceived by other comments. This is NOT a Die Hard in a Hospital. It's more of a Home Alone in a Hospital. (The What??)"}, {"id": 354, "text": "What I want is not on you. It's in you.It looks a bit like Die Hard in a hospital wing. Only the adamant John McClane has been replaced by the brave waitress Madison Taylor (Nicky Whelan) who has to save her own skin (and admittedly, that skin belongs to a beautiful, well-shaped body) while two mean-looking fellows are chasing her. And yes, the action hero par excellence, Bruce Willis, admired in days gone by for his contributions to action films and of course idolized during that period, is also present. This time, however, he's not competing for the main prize as Most valuable actor. His contribution is quite limited and in the end you can say it's insignificant. A negligible character who clearly has to drag himself through every scene while running behind the facts.What's wrong with star actor Bruce Willis? The sympathetic actor of yesteryear, who during his heyday was able to transform every crap film into a blockbuster, is slowly but surely working on destroying his status. In recent years it seems as if he has consciously opted for bland, uninspired B-movies with a flimsy screenplay. When looking at the list of films, with him in a central role, that I've seen in recent years, there's really nothing worthwhile to discover. The films The Prince, Vice, Extraction, Precious Cargo, Marauders, First Kill, Acts of Violence and Reprisal are all monstrosities of movies that aren't even worth viewing. The only movie I liked was Once Upon a Time in Venice. It's the only film in which Willis demonstrates an unforced enthusiasm. Apparently, being an actor is precious to Willis. However, I recommend that he makes the honorable decision himself and quietly use his hard-earned dollars to enjoy a well-earned vacation for the rest of his life. And it'll spare most of the film fans a lot of annoyance.Anyway. So if you forget the lifeless contribution of Bruce Willis, ignore the many improbabilities, won't see the ridiculousness in some situations, and accept the shameless copying of some corresponding situations from Die Hard, then this movie isn't all that bad. Admittedly, there's no longer a lot of credit left. And no doubt, lead actress Nicky Whelan deserves the remainder of this credit. Although it's sometimes annoying to see how her condition can radically improve from one scene to the next. One moment she stumbles through a room while bleeding profusely. The next moment she seems alive and kicking again. Incidentally, I still don't understand why the bullet wound wasn't treated decently in this hospital immediately. Applying only an emergency bandage and waiting till after the weekend for someone to be present there to close up the wound, doesn't seem a patient-friendly procedure to me.So as a whole, this isn't a terrible movie, besides the disinterested and sleep-inducing acting of Willis. Can't stress that enough times. The idea of the incriminating buller in Madison's thight is an original idea in itself. The concept of corrupt agents and the one-location idea, where the victim has to fight for her life, can't be called very creative. This (and the resulting storyline) has been used countless times in better movies and television series. Also, the movie isn't really intense or exciting either. Although Texas Battle (heck of an artist name) and Tito Ortiz aren't school examples of actors, due to their impressive appearance and no-nonsense attitude they still provided the necessary entertainment. In short, despite its (limited number of) positive points, Trauma Center was already doomed to be offered as an On Demand film. If you are an avid Bruce Willis fan then, of course, you should watch this movie. Only I'm afraid he won't rise in many fans their opinion.More reviews here: movie-freak.be"}, {"id": 355, "text": "Whew, I'm often very forgiving &amp; I do more than just occasionaly enjoy B and even C tier thrillers, horror movies etc., but Trauma Center surprised me unprepared, surprised me in all the worst ways. After having seen nearly 2600 movies, this has very unexpecetdly become one of the worst movie watching experiences I've ever had the displeasure of taking part in.It's really impressive actually - just how bland, effortless, cliche and uninspiring Trauma Center is, it's sub-par or worse in every filmmaking aspect in use ever. And the only side that's at least sub-par is the visual side, the absolutely boring but at least functioning cinematography - on the background of everything else it stops having any importance already 20 minutes into the movie. The plot is unengaging, much more cliche that most movies I'd described as cliche, it doesn't have any ups and downs, all goes as a single straight line of the most conventional boredom. Writing's a knock-off of everything with not one splash of life. The characters are dumbed down to primitive levels, as cliche as any other ingredient in Trauma Center - not one of them will make you sympathize with him/her much. Every 2 minutes or so somebody does or say something stupid. It's no secret most movies are unrealistic, but Trauma Center is unrealistic on a ridiculous level. It doesn't help that the movie take itself seriously. The acting's not much better, average and restrained for the most part, with Bruce Willis acting like he's just there to pay the bills &amp; to do it as fast as possible. It's the worst role of his I've ever seen, no doubt. As you can probaly guess, the sum of all the big and ugly flaws makes up for an annoyingly draggy pacing, to the point that watching it feels like work.Trauma Center is, by general standards, an every-day thriller, an extremely conventional piece of filmmaking, a truly generic type of movie. Personally, I'd wish to give it no more than 1/10, but I know it's not earned that low of a mark, not when trying to be objective. Somebody somewhere will get a kick out of it. I don't recommend this movie to anyone, only to those who wish to see how movies shouldn't be made - on every and all levels. My rating: 3/10."}, {"id": 356, "text": "Madison Taylor (Nicky Whelan) is a waitress in Puerto Rico. She takes care of her younger sister by herself. She gets shot by two killers. She is brought to the hospital and police Det. Wakes (Bruce Willis) puts her in isolation for her protection. The killers arrive to retrieve the bullet which could be tracked back to them.The premise is simple enough. The acting is nothing to write home about. Willis barely cares nowadays. This movie never had a hope with so many little flaws. It starts with the bullet in her leg. That's not the only bullet out there and the bad guys don't spend enough time at the scene to be sure that all their bullets shattered. Quite frankly, it's a silly flaw that could be solved by announcing that they have to kill a witness. Locking her in isolation leaves the issue of the medicine. She would need doctors and nurses but nobody is allowed to see her. There is no monitoring of her. There's nobody on the floor other than one policeman. She pulls the fire alarm but it's a weird fire alarm which doesn't alert anybody outside the floor. What kind of scrub area would be bulletproof? They don't need to do that. Even if they shot out the window, they can't reach the inside handle. She can still shock them. The fact is that these flaws keep happening and they could all be solved. I don't know why the elevator only goes down one level. I don't know why that janitor screams like a little girl who has seen a ghost. I don't know why Madison doesn't talk to that nurse in the morgue. I don't know why security isn't crawling all over the hospital. The bad guy who dropped the chip has no way of knowing that Madison has it. A lot of this movie doesn't make sense if one digs too deeply. It makes no sense that Madison wouldn't shot once to make sure the bad guy is dead. The final confrontation looks stupid with the bad guy taunting Madison. The list goes on and all the little flaws add up."}, {"id": 357, "text": "This isn't a comedy, but the premise is the same as Home Alone, in that someone is completely isolated as danger lurks.In this case, a young woman (Nicky Whelan) witnesses a murder and as she tries to get away, is shot in the leg. She winds up in the hospital, where, under the supervision of a police officer (Bruce Willis) she is isolated in an empty unit for her own safety. Unfortunately, the two guys after her are police officers and don't have much problem getting into the unit and killing her guard. Nicky claims she didn't see anything, but they don't care - they want the bullet that's in her leg.Very tense with a terrific performance by Nicky Whelan.To tell you the truth, the movie seemed a little cheap - the sound had an echo. Bruce Willis wasn't the usual Bruce Willis - he was sluggish and spoke slowly. The police officers were appropriately menacing.Standard entertainment with some clever touches and gory scenes."}, {"id": 358, "text": "People who know me tend to tell me I over-analyze.I agree, I do over-analyze. Inaccuracies in film though I mostly overcome. There are exemptions...The hospital on more then one occasion can be seen from wide outside shots. CLEARLY this building doesn't have a 7th floor. Yet our protagonist spends 30 minutes + on this non-exicisting piece of concrete.A security guard gets shot from around a corner, let this sink in, bullets which magically defy obstacles in front and swerve around them.A cleaner/janitor inexplicably gets scared/confused when meeting the lead actress. He runs away from the fearsome, size 2 blonde women in distress straight towards the 2 villains who couldn't more look like villains if they tried.Bad on all fronts. Nicky Whelan is the only one who comes out of this with some kind of credit. Although even this praise is probably down to my bias towards blonde.Oh yeah, Bruce Willis is in this one. (For approximately 2 minutes)I'm out, peace, Enjoy! ( u won't)"}, {"id": 359, "text": "From the beginning, you can tell there's going to be poor quality acting, but more than that, as the movie progresses, you'll beging to see it's because it's likely very low budget, for a movie.Bruce WIllis doesn't make the show good. Heck, he kind of makes it worse because we are all used to his smart mouth. In this movie, he sticks to a badly written script and delivers an uninspiring performance. Steve Guttenberg, well....shame on him for becoming a hack.The real star is Nicky Whelan, but even that is giving her too much credit. For a non lethal puncture wound, she walks like her leg is about to fall off and the amount of blood is beyond ridiculous.All in all the movie felt like Home Alone but without the humor. There is one scene where keys are found to be missing and one character then pats his chest twice and states his micro card (think micro hd card) is lost. No one would feel that through a leather jacket. It was just a ridiculous moment in a long line of ridiculous scenes.I forces myself to finish watching this one because all movies deserve at least that much from us before we critique them.It's a low 3 for me."}, {"id": 360, "text": "To a casual viewer, this film might have little to recommend; however, for the thespian afficionado, Trauma Centre is the pinnacle of Bruce Willis's acting career. In this masterpiece if cinema, Willis takes on the gritty role of Detective Wakes. There is a pun in his name, for Wakes seems half-asleep throughout the narrative but this is merely a ploy: he is actually very much awake to the corruption surrounding him on the police force. The skillful subtlety with which Willis plays an ostensibly utterly disinterested and bored police lieutenant needs to be seen to be believed. With any lesser man, one could be mistaken in thinking the dull delivery of lines, the half-witted shouting, and the constantly squinting eyes were the result of a drunken actor just phoning it in. But this is Bruce Willis and we can be assured any apparent laziness is actually genius in dusguise. He speaks the artistically crafted dialogue with the perfect pitch of blandness to convey the ennui of modern life through the eyes of the tired vexation of a cop who has seen just too much crime in the poverty-ridden streets of Puerto Rico. Now, it takes a trained eye to notice the nuances of this performance but I can tell you, it's Oscar-winning stuff! Nicky Whelan's performance, by comparison, is flat and lacking emotional realism, evidencing how Neighbours just cannot prepare an actress for the big screen; unlike Willis, who has honed his chops to perfection through acting classics such as Breakfast of Champions and Colour of Night."}, {"id": 361, "text": "Woman empties trash in alley behind restaurant. Sees bloodied man crawling towards her and two men began shooting at the man and then at her wounding her in leg. Two men shooting take off as police come responding to scene.Woman is taken to hospital and hidden by police lieutenant Bruce Willis who then takes off to find those who murdered his C.I. after assuring woman she'll be safe and giving her his cell number. Will she be safe? You got it.With the exception of the woman's acting, other character's acting are negligible. Most dialogue is stunted and barely tolerable. You find yourself questioning WHY the characters aren't doing this or that.Bruce Willis is mundane and barely afloat is his role. NOTE TO SELF: Avoid wasting any more time watching any movie starring Bruce Willis."}, {"id": 362, "text": "An elementary school 4th and 5th-grade class decided to collaborate in writing a screenplay. They decided to write a police action, bad cop/good cop saga since that's all they really knew about from playing video games most of their young lives. Hollywood has been fairly light on movies in this genre lately and decided that they'd script and shoot it as a favor to the kids. After reading the script and determining just how ridiculous it was, as the theme followed tried and true movie flops in the past, they decided to cast unknown actors and needed at least one well-known name to put on all the movie posters that would be mailed to all the movie theaters to hang in their lobby.It was problematic to find action heroes that were available for this shoot so they determined it best to get someone who hadn't produced a good action film in years. Although retired, and had forgotten how to act, Bruce Willis, after some arm twisting, decided that this was a good comeback film for him.You've seen this bad cop/good cop film a dozen times and Trauma Center delivers with the same garbage that has been found in previously bad movies for decades. Give the elementary school kids credit, at least, for learning how to write a screenplay without adult guidance and selling it to Hollywood."}], "reviews_amount": 363}