{"name": "Triggered", "titleId": "tt09419976", "reviews": [{"id": 0, "text": "If this was marked as a comedy horror, I would give it a ten, not even joking. This movie is funny as hell"}, {"id": 1, "text": "It's a comedy horror. Kinda fun. No scares. Couple chuckles in here. Needed a few more twists. It will entertain you somewhat. Pretty okay!"}, {"id": 2, "text": "Ok this movie is bad, very bad. My only question is why somebody rate above 5. Specially 10! What is going on guys?"}, {"id": 3, "text": "I really loved this movie, I wasn't expecting much when I decided to watch this on a gloomy afternoon , but was I surprised, I really was. The production value is great , casting is good, story and direction too. This is what can be achieved when you have a good director, good story and super cast who know how to act. Not only does this movie deliver bunch of kills and buckets of blood for the gore hounds but also has a good enough story to keep you engaged and entertained till the end. Watch is for the sheer fun value. You won't be bored it's a guarantee."}, {"id": 4, "text": "This thing will catch you by surprise. Very funny, very dark and almost certainly not for everyone. But if you're up for something wacky then this is for you :)"}, {"id": 5, "text": "This film does not seem like a comedy, but then they start talking, and this is some of the funniest dialogue I've heard in a horror film in a long time. There is a silly and very bloody thriller going on that will keep you on your toes, but it's the wit that makes this one worth watching."}, {"id": 6, "text": "Is this movie going to win an Oscar? No. Is this movie fun &amp; entertaining from start to finish? Yes. Sometimes, that's all you need."}, {"id": 7, "text": "This movie has a great cast, good looking people who can act. The campfire scene in the beginning sets up characters nicely, with understandable dialogue and the viewer quickly gets to know the protagonists sufficiently. Unfortunately that's everything the film has going for it. First of all it's simply too hard to watch with the constantly shaking and zooming camera. The editing is so erratic, immersion can never happen for the audience. I was looking forward to see how they solved the logistical and continuity problems that would arise from the preposterous premise, bomb vests which transfer remaining time to anyone who kills the wearer, since I am a big fan of the Saw franchise. But given the bad camera work I'd rather read the story than watch this."}, {"id": 8, "text": "Yip it is one of those where the advertising poster looks better than the movie was!What can we say but utterly atrocious waste of time. Teens running , screaming and killing each other in the woods for an hour and a half of mindless twaddle!It triggered a headache after 30 mins with the constant screaming and shouting it was really pretty abysmal and the dialogue was just beyond bad then add to that some truly pitiful acting and you have a movie with aspirations to movies like Saw and it becomes laughable - The end scene with the girl screaming.....oh my!!!A sad 3 out of 10 hatchets on the horror scale and that is being overly generous!"}, {"id": 9, "text": "Wow! 2 stars for the gore and that's it! I wasn't expecting a masterpiece but this is awful just awful. Not one of the characters can act. How they got the parts I don't know. Just avoid."}, {"id": 10, "text": "Its your typical college kids get together and go camping and everyone is having fun getting along. I'm not going to tell you more than, they end up turning on each other. Same ole story."}, {"id": 11, "text": "Is this movie going to win an Oscar? No. But is this movie fun &amp; entertaining? Yes. Sometimes that's all you need."}, {"id": 12, "text": "I keep seeing 'teens' but it's stated more than once they 'were' in high school. Yeah I don't get the 'very bad acting' I've seen a lot worse. There are moments though that a character here Or there literally makes me cringe but it's not throughout the entire film. The concept is good and there was a point of clarity In the film. I haven't focused on the editing and film direction especially if it's not in my face that's just wasteful time. As a B horror movie lover it was good and not just ok. The score to be settled was to Murder everyone while giving them hope they would survive the game. Hint: Mr. Peterson aka the Old science teacher does tell them they'll be only 'one' left at the end. I guess technically that's not a lie. Also it was better to find out who was the Cold blooded murderer from high school that gave Caleb the overdose of speed. Like most horror movies they don't give you a reason to like the characters as they set them up to just be victims with no true character base. I enjoyed watching the wanna be Patrick Bateman of the film get his just deserved. The only character I felt bad for was Caleb. As he was a victim Of the privileged teenager with a cop for a dad getting away with murder. Overall it's a watchable movie."}, {"id": 13, "text": "I really enjoyed this movie, and I love how the characters changes due to the intense of the situation and also love the last person standing. I won't mind a sequel"}, {"id": 14, "text": "For a normal person probably 6 out of 10 but this is exactly my kind of movie so I'm giving it a ten very entertaining if you like this kind of film"}, {"id": 15, "text": "This was great fun. Got a huge amount of miles and enjoyment out of some well used themes. More than I expected could be the case. Well acted, good pacing and humour to boot cheers"}, {"id": 16, "text": "Didn't know what to expect going into this film, but it did make me laugh out loud...a lot. Not so much because it was bad, but some of the lines and their deliveries were hilarious. Reminds me of Bruce Campbell in Evil Dead kind of funny. None of the characters were really that bad to the point that you were really rooting for their deaths, but neither were there any really really good guys that deserved to live. I think it's worth the watch, sure beats some of the other movies I've seen during this pandemic."}, {"id": 17, "text": "Yep, kept me watching until the end. Characters were were not really developed enough for you top care about them. You basically watched and waited to see what happens. Overall, an enjoyable movie, doubt very much this will have a cult following. If you've seen any of the Evil Dead movies with Bruce Campbell, this is what it feels like, with the evil dead."}, {"id": 18, "text": "It's hard to find a good thriller with a good plot it kinda reminded me of the lord of.the flies but in the woods when it became survival for everyone else, the movie touched up on everything a regular movie would have without high budget actors and &amp; high budget quality and i liked every aspect of this movie the perfect thriller. Definitely a good watch."}, {"id": 19, "text": "The eternal modern horror film question remains... what is the survivor going to tell people happened??I suppose wearing the vest, the other bodies having the vest, the exploded remains... that makes it easier than a supernatural killer. And the survivor never actually killed anyone. Maybe it will be easier than most sole survivor situations."}, {"id": 20, "text": "A sly mix of 80's slasher/Battle Royale &amp; some crazy video game i used to play back when i played video games. The cast were good, the directing excellent and the writing top notch, some good laughs and some nice movie refrences in a knowing script. Good fun."}, {"id": 21, "text": "Good idea....very,very, very bad acting. And when i say bad acting, i mean ridiculous."}, {"id": 22, "text": "Not bad at all, it was a good movie. Nothing special, but good nonetheless."}, {"id": 23, "text": "This may not be a masterpiece, and it is not an outright comedy , but it is a grizzly , fairly suspenseful, action packed, interesting , well written , witty horror film. The young actors, playing young adults 5 years out of high school all do a great job and the story is genuinely interesting, throwing in a few mysteries to keep you guessing. There are so many movies that have people stumbling around in the woods but this one is genuinely different. There is plenty of dialogue, at times some unrealistic situations and some of the humor comes at you a bit too fast, but if you really listen , the writer David D. Jones, seems to have put quite a bit of effort into making this entertaining and the movie is well directed and shot. Much better then I expected it to be. Loads of gore too."}, {"id": 24, "text": "45 year old female and I loved it! Very well written and the cast had some hotties in it!"}, {"id": 25, "text": "This film start with a man Peterson stabbing a man tie up beside a tree, and a bunch of people camping at the woods scene! As turnout, this film is about Peterson trigger time-bombs at a bunch of people camping in the woods, to find out who killing his son Caleb! And we eventually found out is Rian causing the death of Caleb! Entire film full of boring conversation, and annoying overuse scene! Such as, overuse of the drinking scene, overuse of the smoking scene, overuse of the shouting name scene, overuse of the arguing scene, overuse of the song playing at the background scene, and overuse of the searching things scene! Make the film unwatchable! All the killing scene, overall portray by sideways and just show the blood after the killing! Make the film quite painful to watch! Barely intense is, Kato been blown up at the end of the film! At the end, only Erin survive! Still have a post credit scene! A man in a car refuse to help Erin! That's it! Another disappointed film!"}, {"id": 26, "text": "No need for the controversial comment about Johnny Depp and Amber Heard it's ruined the whole vibe of the movie from the start."}, {"id": 27, "text": "Nine old High School friends are out camping in the woods. They are in town for a football game. (Filmed in South Africa so I am thinking soccer.) They are knocked out with gas by their old high school science teacher and wake up with suicide vests with all having a different countdown time. The one with the highest time lives and everyone else will have to die. The teacher blames them for the death of his son. And they discover if someone dies, the person closet to them gets their remaining time. Let the game begin.A bunch of young adults running around the woods pointing fingers, knives, axes, and guns. Seems like something similar has been done before, several times. Not bad, but gets old waiting to see who survives.Guide: F-word. Sex. No nudity."}, {"id": 28, "text": "Ok, someone wrote that in their review. haha. No it's not even close. It was ok at best. Someone wrote that the cast couldn't act. No, they were all fine. This was more than a b movie with good production and gore and ok acting. The story was stupid like most horror/thriller movies. The bomb thing was really stupid. It can detect who died, who's closest, how many left, and then auto shut off for the last person. haha."}, {"id": 29, "text": "Stumbled upon this film last night, knowing nothing about it I decided to watch it and see what happens. What I got was a typical teen horror but a step in a different direction. For one the usual group of friends, the jock, the loner, the girl that all the guys fancy, etc. Then they wake up with bombs attached to them. Hence the title. So the good, the acting not to bad, the storyline was okay as well. The pace of the movie was good and the movie itself went by quite fast. Now the endpoints. Why oh why do people when they're going to kill someone starts talking and let's their opponent get away also when one if them is trying to bash a guy's head in, he keeps missing by the guy moving his head from side to side all the time, this would never happen in real life. Please have scenes like these realistic, we the audience are not stupid. Not a bad one overall."}, {"id": 30, "text": "Some bad acting, but overall it is an entertaining movie."}, {"id": 31, "text": "Just Finished Watching This Awesome Low Budget Thriller With Great Acting Cinematography And Interesting Characters.I Really Enjoyed The Plot Of The Film And Kept You Guessing Who Was Going To Die Next This Film Had My Full Attention And I Was Not Disappointed By The EndingMy Only Complaint For The Film Is That There Were Obvious Zoom Ins At Times But It Was Never Jarring If Anything It Reminded Me That I Was Watching A Lower Budget Film Which Impressed Me With How Everything Looked And Sounded Great.I Would Definitely Recommend This Film For Anyone Who Enjoys Thrillers And Wants To Be Immersed For 90 Minutes!!"}, {"id": 32, "text": "Jesus. What was this supposed to be? A comedy gone wrong? A diabolical storyline with a terrible script apart from a few comedy classic one liners. If you have a life move on."}, {"id": 33, "text": "This movie is nauseating to watch and the execution is just so bad.Senseless and incoherent. Why was this movie even made? Such a waste of time."}, {"id": 34, "text": "Screaming teens screaming at other screaming teens. Pointless....boring"}, {"id": 35, "text": "The whole movie of violence, blood and brutality is not suitable for children or adults! I wasted my time with a brutal movie, unfortunately."}, {"id": 36, "text": "What makes Triggered great is it's synchronization of sound, visuals and showing great attention to detail. Not only that but Triggered has an unnerving atmosphere right from the beginning. Triggered is one of the most original, terrifying movies of all time. Triggered is A cinematic masterpiece. 10/10"}, {"id": 37, "text": "Nothing new here. Characters you can't wait to see die. All unlikable. Script was lazy and predictable.Dumbest decisions made. Yes. All the usual cliches are present and correct. Campy in places.Redeeming feature was the gore FX which were fun.Ok if nothing else on."}, {"id": 38, "text": "This film has been done many times before. The best example of this is the classic Battle Royale &amp; to a lesser extent &amp; arguably inferior Hunger Games.It follows the same premise in that a bunch of friends are pitted against one another with the end goal is that there can be only one surviver. Each character has a bag strapped onto their bodies (that cannot be removed without an explosive consequence) with a timer that counts down &amp; they die when said counter reaches zero a bomb goes off... All the participants have different available/remaining time on their counter but can inherit the remaining time of others onto theirs if they choose to kill other contestants.There is a reason for this wicked game but I shall not ruin the twist... The characters were so clichéd but that's to be expected. There is one person among this group of reluctant participants that is a killer &amp; also one that is the catalyst for this killing game to be designed &amp; implemented.It is watchable although one of the stoic character beggers belief in that his friends are trying to murder him yet he tries to appeal to their humanity &amp; convince them to not do it. It also shows the length to be which a seemingly ordinary person will go to ensure their own survival in this enforced predicament. It is watchable if nothing else."}, {"id": 39, "text": "Do not let the cool poster trick you. This product is bad.Here is the thing that ruins this product: They do not consider to remove the Vests.The actors are bad and unbelievable. There is not a single character. Everyone is just a one-sentence summary or just a prop. A lot of repeated and/or meaningless dialog. The writing is next level awful. There are so many continuity errors, it is unbelievable. Camerawork is really cheap. Editing is just a bunch of quick cuts. It is impossible to know what is happening. (Drink every time the editor does a digital zoom) The story makes no sense. Just joking, there is none. They just run aimlessly in the woods. This video-game thing that is going on, is extremely cringe and makes no sense.For a thriller, there is very little that actually happening. There is no tension and if there is any, the bad dialog and editing just makes it comedic.It is like a D-Version of Saw.The only positive is, that I got some really good laughs out of it. Not intentional by this product."}, {"id": 40, "text": "This movie does have a comedic sense to it - even if it weren't meant to be there. Many people complain about the camera cuts but..hello, the entire movie is in one setting, the woods, not too much you can honestly do there over the span of an hour plus without me falling asleep. The story behind it all was fairly bland, I called the correct killer in just moments, it wasn't hard because they put FAR too much emphasis on a particular aspect of one person (not trying to give away spoilers for those interested).For us horror movie fanatics I believe this would fall short of our expectations BUT it is 100% WORTH the watch. The gore alone kept me interested for the next kill, the actors did their job, sometimes the script just doesn't give them the best name. It is horror after all, even the classics have some pretty bad dialogue at best so..cut them some slack.Perfect movie to watch with a few friends to crack some jokes at while still getting a decent viewing...split, right down the middle."}, {"id": 41, "text": "Actually the more they talk the lamer the film becomes, bad directing en masse'.the spit and bloodfilled dialouges makes the actors tounges and lips go dry its like a frothing volcano that runs outof steam, so they have to lick the lips like a psychiatric ticksing patient, or like brundle in ''the fly''. so the acting are frenetic and stern, and as a gate into the moviebusiness its average ok acting.its a gamef flick on life and death. its armed bombwests, tikking clocks on the chest, the rules is learned in situ, and everybody quite coincidentaly has a grudge to eachother nevertheless. so when its game time its killtime, and everybody is evryones foe..if you try gto give up youll blow up, so the wests are probably heatsensored or pulsdriven. there are vast amounts of blood and gore, actually some of the better ive seen from octane actually.its really a silly production when thinking story and plot, it aint there at all. there are crazy coloured illuminated piece of woodland that sorrounds the senior hi schoolers, and the lack of real ambient light are really gutwrenching. the vest do also have colourcodes, and will tell you with either blue,red,green or yellow colours how your position in the game are, and a metronomic ticking sound that spins of at an increasing pace when you become closer to the extremes, which are ...win or die.its a film for the young audience that do games wearing goggles, everything happens fast, with not much caracterbuilding and dynamic, so its not severely intelligently made. it might be shown on a norwegian tv-channel within a year late at night. will i view it again, no the grumpy old man thinks.a small recommend though"}, {"id": 42, "text": "Interesting concept. The comparisons to Battle Royale aside, thank you for at least trying something new(ish) and not recycling something old and tired. The production values are pretty good as well. That means real cameras, and not cell-phone quality junk. And real shots, not handheld shaky cam. The plot is actually pretty good. Once you get to the 'reason' everyone gets strapped up. It's not just a crazy guy with a grudge (and some pretty good explosive and tech skills).The acting is a mixed bag. Some scenes called for more experience and it shows that these are all not veteran actors. The characters start off REALLY not likeable. I know it's intentional so that the viewer either doesn't form a connection to them or doesn't feel bad when they (possibly) die, but some of them are over-the-top douchey. They do get more depth later, which is refreshing and not usual for this type of movie. The dialog swings from typical barely out of adolescent nonsense to serious conversations about mental illness to some intentionally funny moments. There are some misses, but mostly it all fits pretty good.Girl 1: You don't wanna kill me! Girl 2: Yes I do! Girl 1: That's the herpes talking!Overall, I wasn't expecting much, but I was pleasantly surprised and liked it."}], "reviews_amount": 43}