{"name": "Black Bear", "titleId": "tt09601220", "reviews": [{"id": 0, "text": "I noticed a lot of bad reviews because the film was confusing or pretentious. I felt the same way as soon as the credits rolled. But then I think I figured it out and found a deep sense of satisfaction and appreciation for the story.Here goes: Part Two is real life. All these things happened to Aubrey Plaza's character (Allison). She was an actor with a manipulative director husband who cheated on her. She catches him in the act but is diverted by a black bear - seemingly ominous but a bit of a MacGuffin. (In part because there's only been one black bear fatality in NY in the last 100 years.) The next morning after a swim she has a clear head and comes up with an idea for a film. Part One is that film. She gets to star in it as the other woman - a version of Blair in her real life. She also got to increase the stakes with a pregnancy and heighten the drama with the unfortunate miscarriage, all the while painting Gabe - the stand-in for her husband - as a total piece of garbage, not to mention further vilifying Blair and absolving herself with the characters.The order of parts makes it confusing and the actors playing the characters obscures the intent. I also can't account for the name of the films - the one they make in Part Two and the one she writes on paper in the final moment. But if it was too nicely wrapped up in a bow, that would make it less satisfying when you piece it all together. It's a little bit of a Fight Club moment. If you hate the film because it seemingly makes no sense, try out this theory and you may appreciate it more.Also, Aubrey's performance was great. I thought that watching her meta-breakdown during the final filming scene through her husband and the film crew's eyes made it even more powerful. Aubrey was acting as Allison acting but informed by Allison's real-life. Just amazing.Anyway, I hope my theory stands up. Feel free to correct, dispute, or add on."}, {"id": 1, "text": "A woman starts writing in her journal two different stories featuring the same three people.The first half of this is well done, building the tension and our curiosity with some sharply observed portrayals of a strained relationship and a third party entering the battleground. Good acting and dialogue, but it builds up to nothing unexpected and there's not a meaningful enough payoff.Then the second half begins, and the story now moves to a film set and similar emotions are played out, though to no clear or satisfying end. The three leads all act very well, and Aubrey Plaza is particularly powerful, but the acting really is all this film has to offer. The rest is only meandering self-indulgence: there's no there there, and I'm here to tell you the bear - which appears onscreen for about 4 seconds total - means nothing."}, {"id": 2, "text": "The acting was actually beautiful, well done! Um, plot... I have no idea... and I love art films but this one actually lost me. It's a shame the acting was wasted on such a dull rock of a broken story. Either it's a pretentious, convoluted mess or my brain sucks."}, {"id": 3, "text": "Rather than dig too deep I'll just write that some truly outstanding performances couldn't save this film from stunt-scripting to cover up a really weak idea, just not plot-wise (though a film doesn't need a strong narrative to be good), but nothing worked *but* the acting (this film really was under-edited as well as another really weak point that jumped out. This film had enough juice for a good short, but was even as a feature way too long for whatever pay-off it gives.The whole thing struck me as really pretentious and derivative. I didn't see anything here original or that I haven't seen done before and much better. Worth a watch if you aren't expecting more than some really great acting and none of the structure required around that to make a decent film."}, {"id": 4, "text": "I just love this type of movie, having a such smart and incredible writing, make you think every moment of it. it was a well time spend, unexpected and twisted, playing with things taken to far. Audrey plaza was amazing on her roll. Following by a great cinematography"}, {"id": 5, "text": "It's beautiful but not if you're expecting a traditional or typical kind of a thriller. The plot is awesome and intriguing, it's beautifully confusing. Although there's no clear explanation for what's going on and everyone will get it from their own perspective, you'll just love and enjoy what's going on and you'll feel involved all the time. Black Bear is definitely a movie that will affect you and you'll keep thinking about it for a long time after the credits start rolling. Performances by the three leads are nice. Cinematography is beautiful with many physical beauty. One of the best thrillers this year."}, {"id": 6, "text": "This is definitely a film that leaves you with more questions than answers. There are some high points in the acting, but, in the end, there is just way too much dialogue and not enough story. That being said, the strongest part of this film is Aubrey Plaza. She is absolutely mind-blowing in her role as Allison, and the only reason I am giving this a 7/10. If you watch this film for anything, watch it for Aubrey Plaza's performance."}, {"id": 7, "text": ".. and at least you would have a cleaner shot at the targeted demographic. Plaza has a huge following because of her clever media promotions and her fans might possibly enjoy this. As a standalone film, however, it is a throwback to the ragtag non-linear experimental films of the early 70s. Which is a polite way of saying that it probably works better if the viewer has pre-ingested an assortment of mood modifiers."}, {"id": 8, "text": "I love and adore films that get you thinking, that require untangling, decrypting, unravelling and reassembling - they challenge your sense of perspective and try to take you to places previously unimagined. Sadly, on this occasion, the writer and director has chosen to stare eye to prostate, with head fully inserted and plugged, swimming in what can only be found in Cahya, after her upset colon has evacuated its diabolical contents into a metaphorical film reel container for you to consume - cut!"}, {"id": 9, "text": "Guess the new standard in movie genres is neurosis. All the characters regardless of the stories are all neurotic. The last thing we all need nowadays is watching a bunch of neurotic actors."}, {"id": 10, "text": "This is terrible. No actual story. It was an absurd waste of our finite time on this earth."}, {"id": 11, "text": "Unlike so many passion projects, Black Bear is experimental in a deeply interesting way, while also being grounded enough not to require semiotics degree to understand.Centring on three main characters, the narrative comes in two parts, but played in two different ways. Are they related? Probably, maybe?In the end it doesn't matter because you get something far more engaging than a literary puzzle; a genuinely well-made and acted movie with a genuinely different structure. I cringed and laughed (sometimes at the same time!) all the way through, but I was never bored.A real cinema-lover's movie, I'd happily watch it again. 9/10"}, {"id": 12, "text": "Bad just bad...a night in Jail would be more fun. gtried ffwding throiugh to half way but still nothing..gave up."}, {"id": 13, "text": "A film that cuts deep into the psychological experience of creating. I hate reviews. I just wanted to write that. Well done."}, {"id": 14, "text": "The first half of the movie had potential with a proper story line, then in the second half it turned into a mess with a complete different story that had no real dramaturgy. So disappointed. I didnt want to finish it."}, {"id": 15, "text": "Love Aubrey Plaza, but I hated every minute of this steaming hot garbage."}, {"id": 16, "text": "I am endlessly obsessed with puzzle-box narratives within films. Not mystery movies, per se, but films that use the very design of the narrative itself to challenge the viewer. Black Bear is the ultimate in such filmmaking.For a very basic overview, Black Bear sees struggling actress Allison (Aubrey Plaza) embark on a sort of airbnb retreat with couple Gabe (Christopher Abbott) and Blair (Sarah Gadon). One night, the wine gets flowing and the tongues start wagging, and events spiral out of control. Right at the climax, however...the scene completely changes. This time, Plaza's character is the drunken, unreliable actress wife of film director Abbott, who may or may not be having an affair with Gadon's character. Which narrative is reality and which is the story? That is for the viewer to parse out for him/herself.If the above paragraph sounds a bit confusing, I can't really blame you for thinking that. It sort of has to be seen to allow some measure of comprehension. But basically, director/writer Lawrence Michael Levine sets up two narratives featuring the same trio of actors in slightly different roles. Presumably, one is reality and one is fiction, but few outright answers are given on which is which.The unique frame narratives are clearly the draw here, but any narrative is only as good as the performers that give it life, and that's another area where Black Bear is spectacular. Plaza, Abbott, and Gadon are absolutely perfect in each of their dual roles. Even during the times when you might be a little confused (and trust me, that'll happen here from time to time!), the superb chemistry keeps everything on the screen riveting.One thing I will readily admit about Black Bear is that it is made for a certain type of viewer. One, like myself, who enjoys the scope and uniqueness of the screenplay just as much as the literal plot/dialogue. I wouldn't necessarily call this a metaphor film, but rather one that discards a straightforward narrative and instead plays around with alternate storytelling styles. If that's your thing, Black Bear will almost certainly stand out as one of the best films you'll see in 2020. My closest comp is 2013's Enemy for uniqueness of narrative supported by strong acting."}, {"id": 17, "text": "This is one of those movies where an actor who wants to prove she can be a more respectable Hollywoid actor does to try to get bigger roles in the future.Sure, Aubry Plaza does a great job of acting through the film, it certainly does let her shine her talent, but the script and plot is a complete snorefest and muddled up trying to be artistic, or too indie, or I dunno, whatever it was trying to do didn't work at being a decent movie."}, {"id": 18, "text": "I could literally watch Aubrey grocery shop tbh but this was not it."}, {"id": 19, "text": "I didn't really understand Black Bear. I may as well make that clear from the outset. I also admit that my lack of comprehension hindered my enjoyment, for lack of a better word.The movie is told in two parts. The first is much shorter than the second. In the first, Aubrey Plaza is a filmmaker and actress who goes to stay in a rural setting with a guy played by Christopher Abbott and his wife. This couple seem to be trying to give the one in Who's Afraid of Virginia Woolf a run for its money in terms of dysfunctionality. The husband cannot say anything without being contradicted by the wife, and vice versa. We are not at all surprised when they have a fight, and that Aubrey's attempts to defuse the situation only heighten the tension, and Aubrey and Abbott end up in each other's arms. This story only becomes more harrowing when, upon discovery of the two cheating on her, the wife intervenes, things get physical, and the wife, who was apparently pregnant (I didn't notice) goes into labour. The trio have to rush to the hospital, and have a car accident on the way. This segment ends with the collision.Part two feels like the same actors in the same location doing a different story. In this one, Abbott is the filmmaker and Aubrey is the actress. Abbott colludes with his wife to drive Aubrey crazy behind the scenes, and thus elicit a genuine madness on set. Perhaps they push her too far, and she goes missing, getting drunk. They find her again, for some reason naked except for a bra, and get some pants on her and make her finish the take, while other crew members are stoned and one has diarrhoea.Some other stuff happens after that, I think. I can't really remember. I don't understand how these two parts fit together. And I don't understand the second part. The movie has great acting from Aubrey and Abbott. Aubrey could be an Oscar contender, but they don't give Oscars for weird movies like these... and probably so they shouldn't. I hope she gets in a movie with a better script that also lets her cut loose like this one did."}, {"id": 20, "text": "It's not very often that I call a movie a 'waste of time'... In fact, I can only think of one other time that I've ever done that, and I've done hundreds of reviews... This movie builts intrigue and a story for 1hr30mins and then the movie just ends... It's honestly the weirdest turn in a story that I've seen in a long time, and it's just a big waste of the viewer's time in the end.. I would definitely not recommend that you watch this movie... You can find MUCH better movies to watch for 1hr30mins"}, {"id": 21, "text": "Really nice little movie. Well written, funny, very well acted....and with a healthy dose of ambition. More movies could use that."}, {"id": 22, "text": "What happens when a bunch of young filmmakers get drunk and stoned and party during the production then do their best to edit the mess together. When it simply doesn't work call it an 'art' film.All reviewers that rave about great acting and a great surprise plot twist are exposing themselves to be as shallow as this film is.Great Acting? Aubrey is pretty and she stares a lot. She can deliver lines like anyone. Acting drunk or throwing a fit does not automatically mean great acting.Great Plot Twist? Completely senseless change in direction with no explanation. We're supposed to feel like we're not smart enough to get this artistic 'leveraged synergy' but oh we better praise it or it'll look like we're not 'with' it."}, {"id": 23, "text": "The first part of this film is utterly insufferable. We were about to turn it off when it took a welcome turn and actually became interesting."}, {"id": 24, "text": "The film has two parts. It is up to your interpretation to decide what part is an actual event and what is the script. However, both could be two versions of a script that Aubrey Plaza's character Allison concocted. She is a guest of Gabe and Blair, who is pregnant, Who's-Afraid-of-Virginia-Wolf like couple 2.0 in a new but already highly dysfunctional marriage. Part One, real or not, but Allison is clearly the one in control here. While she seems like an innocent by-stander who just randomly got herself in an unwelcome situation, her behavior pokes (a bear, get it?) out the worst reactions from her hosts revealing a monsterous relationship that will destroy not only them but everyone around them. As real as it feels, all of it also could be just in the imagination of Allison - it could be just a script, a sort of therapy/ revenge fantasy with cathartic resolution that Allison wrote after her life as an actress on a set.Allison mentions she has been a difficult actress who has a hard time finding work, so she turned to screenwriting, so Part Two of this film could be a pre-story of what happened to her or it could be just another script interpretation of it (perhaps written during but before the finale of Part One?). In that part the film director and the main lead actress with the same names as in Part One, mess with her head on the set to get her jealous and somewhat get the best performance out of her, bringing her to a total meltdown in front of the whole crew (all of them are quite a mess themselves - they could have had a film of their own; an amazing group of supporting actors here). What's reality? What's fiction? All? Some? Or none? This film is for those who do not need to have clean cut answers and are happy when a film opens a door for interpretation.Aubrey Plaza gives a jaw-dropping performance - the best role of her career in my opinion. She is a revelation here. Christopher Abbott and Sarah Gadon are fantastic at making you gravitate towards a theory that Part One MUST be real. Part One belongs to them but the whole film belongs to Aubrey Plaza. One of the best films I have seen in 2020."}, {"id": 25, "text": "The only reason I rented this film was because it starred Aubrey Plaza. If you are considering doing the same don't. It is another Hollywood film where you can not find one character with any redeeming qualities. By the end of the film I was hoping the black bear would break in and kill everyone, it didn't but it might have made for a better film."}, {"id": 26, "text": "Aubrey Plaza delivers a powerhouse performance in a film that I hate the more I think about it."}, {"id": 27, "text": "Caught this at a film fest. Aubrey Plaza is just a gift that keeps giving. Swinging from sultry and manipulative to emotionally obliterated, she embodies the character of Allison. It's usually pretty hard to not see Aubrey Plaza when you see her in a film but in this role she truly fades into character. Beautifully filmed, it not only keeps you riveted but is also utterly uncomfortable and at times, raw. Is she the writer, the star, or the director? Is she the temptress or the jilted lover? Is she none of these things? It will keep you guessing and thinking well after the credits role. Well done!"}, {"id": 28, "text": "This movie never stops delivering. It might be a laugh, a gut punch, a 180 turn, a bear in the trees, Aubrey Plaza without pants, psychological manipulations, emotional manipulation, this movie has it all. Dense narrative that seems to be lies on top of performative actions, rolled in role playing, and gaslighting. Everything was a win, directing, cinematography, sound, music, and Aubrey Plaza might actually BE the voice of her generation. Highly rec. Saw it at a film festival."}, {"id": 29, "text": "I had high hopes heading into this movie and maybe that contributed to my now dissatisfaction with the story and directing choices. Having only watched the trailer prior to the movie - it seemed like it would be a dramatic experience delving into the lives of 3 artists. I thought it would show us how fast things can go array when our emotions get the better of us. The first half of the movie was great. The second half ruined it for me. It was self indulgent and peculiar; and tore apart any attachment I had to the story. I wanted reasons for why the crew were included so much in the story and it ended up just being to provide commentary on the life of an independent film maker and what independent films look like to make. The other theme of the second half - the destruction of Allison's mental well being to benefit art - was alright on it's own but since it serves no greater purpose, this too was lost in the mix. After watching the movie, the confusion of what was real or fake - missed the mark and I wasn't left curious - I was just left angry. As most are saying, the acting is fantastic. If I separate out both pieces, the acting was spot on I loved Aubrey Plaza in this movie. I really enjoyed Sarah Gadon's character in the first half (she is barely featured in the second half). Trying to decipher the relationship history between Blair and Gabe was fun and thrilling in an attempt to make sense of her actions. I would give this a 6.5 but I can't - so I went for 6. Excellent acting - but I wish the directing and writing choices cut out on the vanity and added more story."}, {"id": 30, "text": "This movie is fantastic, well acted, impeccable cinematography, unsettling score, and a very interesting and thoughtful (and thought inducing) plot. I truly don't get the extreme negative reviews, it's one thing if it's not your cup of tea but you can recognize that it's a very well made movie and so give it a 6 but come on, 1--4s?! If you like a well-crafted movie, aren't afraid of a slow burn, and are okay with a story that's not tied up in a neat little bow upon conclusion, then this is the movie for you!"}, {"id": 31, "text": "Mostly because the second half was more interesting and more realistic. The first half was not, and was filled with blah, blah, blah drivel. They should have eliminated the first half.Trying to pull off a film trick is great when it works, but it doesn't work here for several reasons. I'm supposing the film is trying to ask which half of the story is the real one, and which half is the supposed script the Aubrey character is supposedly writing.That fails on two levels. If the first half of the movie is the reality, it doesn't work. A famous actress going to a B&amp;B retreat that isn't actually a B&amp;B at all, and then instead of actually writing a script spends all her time drinking, dancing, and arguing about feminism with the hosts makes no sense. And then immediately having an affair with the male host? It is not believable that she could have been writing an awesome script while spending all her time with the hosts.If the second half is reality (which was absolutely the better half), then it means the Aubrey character wrote the first half at the B&amp;B, which was crap, and gave no insight into what had really happened previously. The film shows her at the end of each part supposedly writing at the same desk.I'd like to imagine she wrote two scripts, the first of which was rubbish, the second of which was believable. The problem is that the film keeps trying to reference Black Bear in various ways that seem to have nothing to do with the story at all.The film is a hot mess. The kind pretentious people claim to understand and excuse."}, {"id": 32, "text": "If only this movie had remained with the realistic and interesting vibes from the first segment it would have been great, the second half where it becomes a movie about the movie is still fun to watch but it made the movie kinda pointless. Aubrey Plaza is amazing in this tho, but when isn't she?First half 9/10 Second half 6/10"}, {"id": 33, "text": "Part 2 came as a surprise, but the cast transformed and turned this into a surreal rollercoaster. Aubrey Plaza was phenomenal."}, {"id": 34, "text": "This film was so fabulously overindulgent it seemed like some studio freak looked at the script and said oh my God I can't believe how inventive and creative this idea is! But in reality it was a millennial geek with absolutely no background of film history who green-lighted this piece of garbage.The first Act was pretty good. The second act was horrific, and literally represents every aspect of Hollywood that makes me cringe. It was a behind-the-scenes look at something that no film fan ever needs to see in their entire lifetime. Enough said, avoid this film like the bubonic plague."}, {"id": 35, "text": "The first half has a few sharp lines and some passable but stagey acting. From then on it declines into 'clever' incomprehensibility. I'd eat bear poo before I'd watch this movie again."}, {"id": 36, "text": "Its a gaslighting story full of crying screaming loud and repeating those in a effect that defeats its purpose. such a theme should use those but here the effect its only annoying and disturbing. i watch to learn not to be violated myself. for example, after the director/husband calms down his wife in bed, the fade is silent but next scene is like a jump scare due to first loud noise. if i watch a movie about, lets say war, i dont want to feel PTSD. its a mistake to direct like that ill finish the movie but i dont recomand it."}, {"id": 37, "text": "I gave it a 7 because I was impressed seeing Aubrey Plaza play dramatic and unhinged instead of her usual straight face comedies. I would have liked to have seen a more traditional horror ending (bloody death, torture or at least disembowelment) especially after such a build up, it seemed like the writer/director was almost too afraid to show how things would have actually ended given the situation(s) (see above endings). I wouldn't recommend this as a horror date movie night unless you like the awkward feeling of being caught in the middle of a couples fight."}, {"id": 38, "text": "In this post Parks and Rec world I'm really happy that Aubrey Plaza is finally getting roles that really suit her and make the best use of her talents (Black Bear, Legion, Ingrid Goes West)."}, {"id": 39, "text": "Went into this movie oblivious of what to expect, after reading so many mixed reviews. I guess you'll rather really love this film, or really hate it. And I really loved it."}, {"id": 40, "text": "Is it just me, or did this movie resemble Who's Afraid of Virginia Woolf? It certainly wasn't as intense but I felt a connection between the two movies immediately."}, {"id": 41, "text": "The movie started off good and I was interested. Then came part two and lost me. Sad, I thought it was going to be good. It was okay. Wish they went all the way with part one."}, {"id": 42, "text": "Seem the movie look like interesting start from the end but it's just twisted to audiences with the wrong way and gave nothing. Rating 6.6 right? I trusted the rating, that's why I choose to watch this movie but it's just waste of my time."}, {"id": 43, "text": "This has to be the most confusing, or alternately pointless movie ive seenMade me want to go and watch Nolans Inception, because that makes more sense than this......Its two stories in one? i think and neither fleshes out any reason for existingDisappointing given i came to it for Aubrey Plaza, who is transfixing even on her worst dayBad idea, even poorer execution"}, {"id": 44, "text": "My first thoughts were I didn't understand anything. But after watching interviews, I understood this is something we can make of ourselves. The movie is not perfect but Aubrey Plaza is."}, {"id": 45, "text": "Wow this is a multi-layered film. It consists of 3 scenes. Aubrey plaza is immense in this, she not only carries this film, but she is the shining star. She deserves an award for this!The first scene just involves 3 characters that are in a sort of triangle but ends abruptly with a bear... This is followed with the next that seemingly involves the whole cast and filming of different scenes... It appears to be the making of... But then again this ends the same way. The final scene needs to be viewed to understand the brilliance of it all.The ending was mind blowing... This is a writer's dream."}, {"id": 46, "text": "I mean movies where actors play actors that feels so pretentious or derivative. What was the second half of the movie about anyway?"}, {"id": 47, "text": "Filmmaker Allison (Aubrey Plaza) goes on a retreat to a remote cottage owned by bickering pregnant couple Blair (Sarah Gadon) and Gabe (Christopher Abbott). And there's a bear.I like the My Dinner with Aubrey section of the movie. I like its uncomfortableness. I like the built and then I really like the switch. I like the acting from all three actors and their changeover. I would use a different actor for the fake man of the house. He looks too similar to Gabe which may be the idea but that's a mistake. He needs to look completely different. I would also use more of the conversations from the first section in the second section. They could argue and rewrite some of it on the fly. She should be the writer anyways."}, {"id": 48, "text": "I knew going into this movie that it was going to be allegoric and I honestly love that in a movie when it is like a puzzle that you have to pick apart and find the meaning of like many Charlie Kaufman films. But I honestly just couldn't wrap my head around this. I looked up the meaning after and was like oh that is sort of cool but I don't think I would ever got there on my own.I know it had some good ideas but they just didn't get me to where it wanted me.Aubrey was great as always. She was the best part for me I guess.I think I wish the meaning was a little looser and more in the background or even tighter and was more of a clear picture.It will probably click for some people but it just didn't for me maybe I just want paying enough attention or something but then again I'm not sure because I was mostly confused."}, {"id": 49, "text": "Aubrey is a great actress, every single role I have ever seen her take on has added to the amazing list of credits she has built up through her life. This one, sadly, is not one of them.She does a fairly competent job taking on a couple of difficult roles in this film, but the entire storyline is completely destroyed by a bit of stunt writing in the second half that supposedly is there to wow the Sundance crowd, but just comes off as a purely self-indulgent parody of real life. There is nothing that redeems the film as it plods on towards the inevitable ending, which anyone can see coming well in advance, and the film lasts over an hour and 45 minutes, which is at least 20 minutes too long. My advice to the filmmakers: hire an Editor who doesn't kowtow to the so-called Director's Vision (as if it is a secret manuscript delivered from the Gods to us mortals).As a testament to the qualities that make Aubrey a National Treasure, this film is a bump in an otherwise brilliant career. Thank you Aubrey for taking us on your roller coaster of a ride, but please, next time, stay away from the stunt writing."}, {"id": 50, "text": "Stars for the performers, including the supporting cast. Another for the brief but ambience-rich scenes featuring Plaza contemplating a fog-shrouded lake. Also a star for showing cast and crew activities while a second movie is being made within the overall Black Bear framework. That was interesting and even educational, at least for those of us who hope to produce a movie ourselves some day.Big applause for the writer/director's departure from a normal drama by having his lead actors radically change roles about half-way into the movie. Two related stories in one.Unfortunately, what probably seemed like a clear high concept to Levine actually isn't, judging by reviews here at IMDb and many other sites. Are one or both stories simply the imaginings of Plaza's character, since both start and end with her returning to a table to write a new screenplay? What's up with that odd look she gives the camera in the final scene? And the 'Black Bear' title? One bear is seen twice in this film, for a grand total of maybe five seconds. The bear thing was significant to Levine, but not necessarily to an audience.Even one unresolved enigma can irritate a viewer. It's like authors who throw an occasional foreign word (often French) into the text, but leave it undefined. The implication is that people who really count would know what the word means. As for Black Bear, people who really count will figure out the enigmas, no problem. The rest should maybe go watch reruns of Smokey and the Bandit."}, {"id": 51, "text": "This was the final film to become available as part of the Nightmares Film Festival for 2020. Both Jaime and I were intrigued to see Aubrey Plaza starred in this movie. We both came in pretty blind aside from that. The synopsis here a filmmaker at a creative impasses seeks solace from her tumultuous past at a rural retreat, only to find that the woods summon her inner demons in intense and surprising ways.We start this off with an image that we will come back to a few times. It is of Allison (Plaza) in a one piece, red bathing suit. She gets up and walks into the cabin behind her, going up to a room where she has a journal on the table.The movie is then told in two different chapters. The first one is the bear in the road. Allison shows up where she's met at the gate by Gabe (Christopher Abbott). He's there with his girlfriend of Blair (Sarah Gadon). She is currently pregnant and supposed to be on bed rest. There are some issues between them, which seems to be he's controlling and she is fed up with him. Regardless, they're still together.This place belongs to Gabe's family. Their goal is to convert it into a retreat for their creative friends. Blair was a dancer and Gabe is a musician. Neither is currently working though. Allison is a former actress and is a director. Gabe seemed to have done some checking up on her before she got there and his assessments seem to be off. Or at least that's what Allison states.The night doesn't go as planned. The couple keeps bickering and Allison in her awkward fashion says things that upset Blair. She goes up to go to bed where Allison decides to go swimming in her underwear. Blair accused Gabe of wanting to sleep with her, which he tries to convince that is not the case. He is lying though and Blair catches them in the act. Things get worse from there.We then shift over to chapter two, which is the bear by the boathouse. We get some of the same images and shots, but this time around Allison is an actress. Gabe is directing a movie and Blair is the co-star. The events follow very similar paths, with just the roles of the women have changed. This version of the events leads Allison down a very dark path, but the question becomes, is this real?That's where I want to leave my recap for this as I do feel that gets you up to what you need to know for this movie. Now of course, one of the reasons that I was excited to see this movie was for the fact that it starred Plaza. Her performance is really good in this movie and it is interesting that knowing her early work I wouldn't expect some of the things that she is able to do. That's not to say I thought she was a bad actress, but when you see someone in specific roles for some time, there is a bit of a typecast.Where I should start this is that this is another movie where I don't know if most people would consider this a horror film or not. It really isn't in the traditional sense. What we do have here though is this extreme feel of awkwardness and dread. There are a couple of horrific things that also happen that push it closer. It is at least adjunct so that is why I'm covering it here.What really stuck out to me here for sure is the fact that this is uncomfortable. There are a few movies I've seen at this same festival for this viewing that really embody that as well. What makes it funny though is the fact that Plaza does this so well in the role of Allison. From the opening sequence where she meets Gabe, he is asking her questions and she's saying to make it awkward. It is even funnier though when it turns out that he's right. Things get even weirder when we introduce Blair into the dynamic.From that sequence I've brought up, I could feel the chemistry between Allison and Gabe. Blair notices it as well, even though he tries to convince her that is not the case. This really drives this first chapter, even more is that Allison makes things worse siding with him. She is doing it as a joke and it doesn't help that Blair comes off not only crazy, but also a bit too much as a militant feminist where it is hard to side with her. It does almost feel like she is driving Gabe away and into the arms of Allison. Gabe brings up that he doesn't think she actually loves him and I believe it. It is a toxic relationship that has run its course with both parties no longer really have love for each other, but stay together as it has been for so long and they're comfortable.The second chapter plays with similar things, but does things differently. I don't want to delve too much here as not a lot of people upon reading this probably haven't had the chance to watch yet. What I will say, I do really like that they're playing with the same actors and characters, but twisting it. This is really where I think we see the range of Plaza. What I can say is that Allison is married to Gabe where she is suspecting that Blair and him are having an affair. We get very similar things that happened previously happening here, just subbing in the woman differently. Things go a bit differently though with the reactions and here, a movie is being made. I have a theory what is going on here, but again, I'll keep that to myself until it is a bit more widely seen.Since I've been going on and on with it, I want to move to the acting. I've already said that I think Plaza steals the show here. This is her movie and really carries it. What I would say is that in the first chapter, Allison is the third wheel for the marital problems there. Abbott and Gadon play well there with just her making it worse. Where she takes off is in the second chapter, with again these other two helping progress the events. There are other actors there as well as there are more characters, which help to round out for what is needed.So with that said here, I don't really have much more that I want to delve into with this movie. This really is driven by the acting as well as the situation that they are in. The telling of it in two chapters is quite interesting, since they are different while being very similar still. There aren't a lot in the way of effects, but it also doesn't need them. What we do get there was practical and looked good. The cinematography is well done, as this is a beautifully shot movie. It framed well. Aside from that, the soundtrack fit for what was needed. It didn't necessarily stand out, but it also didn't need to. Overall I would say that this won't be for everyone. It is more of a slow-burn and feels similar to something like Who's Afraid of Virginia Woolf? It is also another one that many not consider horror. For me, I think it is mostly the imposing feeling of dread and the effect it has to drive these people mad is enough for me. I found this to be a good movie overall and would actually recommend to horror and non-horror fans alike."}, {"id": 52, "text": "An intricately layered, fiendishly plotted &amp; anxiety-inducing thriller that's further bolstered by Aubrey Plaza's powerfully captivating performance, Black Bear is an emotionally charged &amp; increasingly unnerving ride that's clever &amp; confounding in equal measure and offers an interesting insight into the behind-the-scenes chaos of art creation.Written &amp; directed by Lawrence Michael Levine, the film only gets more n more intense &amp; uncomfortable as it progresses, and sustains its uneasy aura from the first frame to the last. Levine's enigmatic treatment keeps the viewers guessing and although he doesn't provide any answer, he does manage to create just the right kind of intrigue for us to continue looking for it.Assisting the psychologically scarring drama is the haunting sound design that never allows us to settle. And then there are fabulous performances that make this journey even more worthwhile. Christopher Abbott &amp; Sarah Gadon deliver strong inputs while Aubrey Plaza steals the show with a phenomenal rendition that's impressive enough to qualify as arguably her career-best work.Overall, Black Bear is a dark, delirious &amp; disturbing delight that's as subversive as it is solipsistic and while far from an easy film to decipher in one sitting, it is able to keep our interest &amp; involvement alive throughout its runtime. One of the most challenging &amp; stimulating films of the year, this meta-thriller paints a fascinating portrait of art imitating life imitating art, and is worth viewing for Aubrey Plaza's commanding showcase alone."}, {"id": 53, "text": "Yes there's a bear, or is there? Be prepared to be unprepared for what's actually going on here. In a good way of course.Aubrey Plaza is involved, so chances are sailing won't be smooth. In her gloriously snarky best, Plaza is Allison, a blocked writer finds her retreat in a picturesque cottage on a lake run by struggling dancer-musician couple but hopeful B'n'Bers Gabe and Blair. Blair is pregnant. Gabe's eyes wander. Trouble brews. Fun, banter, flirtation and arguments develop quickly in razor sharp dialogue jabs. Alcohol is poured, and it is drunk. Lips loosen and away we go. Our trio of frustrated artists releasing tensions over high brow arguments in beautiful tension. Day one doesn't just end, it just explodes in a heart racing climax.Part two. The twist. Yes there's a twist, but a clever one, in that it kinda twists back on to itself. The barking, manipulative, seductive triangle remains, but writer-director Lawrence Michael Levine turns the table to revisit the first act from a different lens. That reveal is left to the viewer. You.What is reality, or whose reality it is, might not be the point of Black Bear. Going along for the ride, and the actual film experience may be. And it is pretty impressive, especially Plaza, who stretches her chops to become something of a screen force. Black Bear is a witty, banter-filled psychological drama peppered with snide humour and, uh, a black bear. Maybe.hipCRANK"}, {"id": 54, "text": "An absolute certifiable snoozer that comes from no-where and goes no-where, unfortunately wasting my time, which i regret. why?because i read the bad reviews and i ignored them.instead, i told myself maybe those people sometimes can't appreciate art...it turns out that those people really can appreciate what is art and what is not.this film black bear is not. i did not like it one bit, and i'd never watch it again, unless you pay me, ha ha ha...about you, you may watch it, if you want. but i do not recommend it. do it at your own risk. so now you know.take care, stay safe"}, {"id": 55, "text": "I think I'm actually so easy to read that people get confused.Earlier at Sundance this year I skipped out on seeing a documentary to try and get on the waitlist for this. The sad fact is I didn't make it onto the waitlist and I missed out on the documentary wasting a whole afternoon. Finally, I understand what everyone was talking about. People either really liked this or didn't like it as much for how this story is told. I think Black Bear is brilliant. A filmmaker at a creative impasse seeks solace from her tumultuous past at a rural retreat, only to find that the woods summons inner demons in intense and surprising ways. Describing Black Bear is hard without giving too much away. There's just so much to it. It's times like these where I wish the Academy would like at small indie films. The screenplay is some of the most elaborate and diligent work I have seen in quite some time. Lawrence Michael Levine has made a Kaufmanesque film. Writing this must've taken years. Just the idea is something I've never even imagined. His direction is so meticulous and you can see a clear vision. My sister pointed out during the first 40 minutes that it could easily be a stage production. Not that the direction is so stage-like but rather the dialogue. There are some hefty conversations that are so engaging and entertaining. Everything just flows nicely in the script and there's meaning behind it.The acting is phenomenal. Aubrey Plaza gives the performance of her career. I love her in basically every role. She's mainly worked in comedies so the switch to this dramatic role is exciting to see. She just nails it and is my second favorite actress performance this year right behind Carey Mulligan in Promising Young Woman. Christopher Abbott also give the performance of his career. He had Possessor just a couple months ago where he essentially played two characters. This goes much more in depth and showcases a huge range. And wouldn't you guess it? Sarah Gadon gives the performance of her career also. She isn't as popular as her costars but maybe this will get her out there. I loved her in Enemy. Enemy is similar in style to Black Bear so I believe she's just drawn to these types of movies or roles. My god, the performances are just stellar. I would also like to mention Paola Lázaro as another great performance. What's so great about these performances is how real they feel. The script has very real dialogue it's just the story that's so insane. I'm glad the performances translated well on screen.Here's the thing about Black Bear, the film starts and it's like Woah ok. I'm going to compare it to the first half of Waves where it's a roller coaster. There's a moment where you're like I understand what's going on. Then something happens. It's the moment where I went I understand what's going on? That's the moment where I realized I loved this. The transition into what comes next is a little strange and it doesn't run in acts like a typical film setup. It's awkward to grasp at times but the experience is just so unbelievable that it doesn't matter. I watched this twice within 24 hours just to explore more to what it offers (and to get away from finals work). You could watch this 50 times and still discover clever techniques and small things within the story that make it so much better. The aesthetic makes the experience an actual experience. I found particular interest in the cinematography, score, sound design, costumes, and production design. All I can say is experience this ride. And go in without knowing anything about the story. If you spoil it for yourself, you won't get the full effect. Black Bear currently stands as my 4th favorite film of the year."}, {"id": 56, "text": "Yes I gave it 10.Why?Cause it was the most refreshing movie I had seen probably since Inception.The way the movie is articulated, the actor and the twist is really something unique. I ended the movie wanting more, yes, part 3, part 4, part 5... went straight to youtube to watch reviews and explanations about it, simply amazing on its own world.Its an open ending movie which leaves you hanging but at the same time fulfillment with an unique and very rich artistic experience as you fill you are part of it.Congratulations for the producers, director and actors for this unique and exquisite movie.It should win the Oscar for original plot, at least."}], "reviews_amount": 57}