{"name": "An American Pickle", "titleId": "tt09059704", "reviews": [{"id": 0, "text": "But more of a 'how can you not like this?'I loved the actual idea for starters, very different. Then there's not one but two Seth's which is great. The film has both comedic value and sentimental value and I thoroughly enjoyed it from start to finish. It made me laugh at various points throughout and also made me put myself in both characters shoes and see it from their perspective - 8/10Maybe it was kind of a review."}, {"id": 1, "text": "As others have pointed out this is not your typical Seth Rogen film. This is his attempt to make a fish out of water story in the style of Splash or Big and while he doesn't reinvent the wheel in doing so there were some enjoyable moments. This is obviously meant to be a film which you can watch with you family, it is not vulgar and it focuses on the importance of family values and relationships. There are many moments/jokes in this film that have to do with Judaism which Seth has joked about previously, but here this is much more of a love note to that part of his life. I think maybe some of the negativity being directed at this film is because some people don't understand that aspect of it. They instead are expecting the normal stoner humour Seth Rogen. I think this movie is worth watching if you want to see a different side of Seth and don't mind seeing the things I mentioned."}, {"id": 2, "text": "This movie was not bad but not good either.It kept my attention but wasn't anything spectacular or anything I'll even remember watching for that matter."}, {"id": 3, "text": "The movie started off good with the scenes from old world Europe but the transition to life in America was too fast and more could've been brought out before Herschel fell in the vat of pickles. After that, the movie was pretty slow and just not that funny or enjoyable. There was a heart warming moment at the end very in line with Rogen's other heartfelt comedies but that was pretty much the only highlight in the movie with the rest being barely watchable. Almost seemed kind of fetishizing Jewish shtetl life outside the final scenes of the movie which as mentioned above, were nice and heartfelt. Surprised this was on HBO to be honest. 4/10"}, {"id": 4, "text": "It is not completely bad movie, the beginning was promising, but then after 15 min the screenplay becomes quite stupid and most importantly, not funny. I liked some other Seth movies, so he can definitely do a better job. Just boring mess..."}, {"id": 5, "text": "This is a fun, harmless tale that has some light humor and family charm. Seth Rogan gives 2 very good performances and holds the screen attention the entire time. The Brooklyn setting is well done. I don't get all these low grade reviews. People press play and enjoy."}, {"id": 6, "text": "I started watching it hoping to have a good laugh with friends after we got stoned. Couldn't watch it past 30mins and had to switch to a different movie because it was boring. But after watching it alone and sober, it seemed quite impressive. Seth Rogen did a great job, although the story is silly. It's a heart warming movie and resembles 'Forest Gump' or 'The pursuit of happiness' to an extent if you are into those kind of emotional movies. You'd be disappointed with the movie if you expect it to be a classic Seth Rogen comedy, otherwise it's pretty good. P.S: Definitely wouldn't be the movie that you'd like to watch with a bunch of friends or when you're high."}, {"id": 7, "text": "Movie stupid and unfunny, like Cossacks smashing village and killing peasants. Funny movie, it say, but not funny. No jokes. Why no jokes? Tell me joke from movie. I wait. You no tell me joke because movie no have joke, not even little tiny joke. Movie come from very funny story I read in American magazine, New Yorker, but movie not funny. Movie not good. I give one star and spit on movie.You think this review bad, wait and see movie. I not finish movie and go back to ditch digging."}, {"id": 8, "text": "An American Pickle is a decent film. You'll get a couple good laughs, and the run time is short enough to not waste your time. The premise (as you already know) is ridiculous, but the movie doesn't take itself too seriously. That's a good thing. At the same time, you'll probably completely forget all about this movie come next Tuesday.(PS look for the author of this review around the 59 minute mark)"}, {"id": 9, "text": "And I liked this movie too. Rogen movies are either good or bad, I was happy that this was on the good side. You won't be wasting your time by watching this."}, {"id": 10, "text": "It's not a comedy like Pinapple Express or Superbad. Ok, that's out of the way. I liked it, it's a unique premise and I thought Seth did a good job putting himself out on a limb. Pretty good accent considering his usual style of acting. The movie puts out some laughs and makes you think a bit. If you enjoy it, great. If not, pick something else."}, {"id": 11, "text": "This movie was a pleasant surprise. Well acted, the plot goes from ridiculous to surprisingly becoming a battle between old values and new. Great movie night movie. 8/10 would recommend."}, {"id": 12, "text": "A truly awful, self-indulgent waste of time. Uninteresting, dull, boring yet worst of all it stars Seth Rogan on a narcissistic road trip. This film, like the pickles it features, should remain well and truly sealed in a jar and put to the furthest reaches of the pantry."}, {"id": 13, "text": "A thoroughly enjoyable little film, excellent performances, a bit uneven here and there but overall a nice Sunday afternoon flic to watch curled up on the couch. The music was wonderful, probably my favourite part."}, {"id": 14, "text": "An American pickle is definitely a lot different then all other Seth Rogen movies. That does not mean that it is bad. It is a heartwarming and pretty funny movie.I think a lot of the criticism that is said about this movie is very unfair. Simon Rich is a great writer, and Seth Rogen plays both main roles very well. saying that this is anything below a 5 is ridiculous in my opinion.Being rated Pg-13 I can see how some Seth Rogen fans would be disappointed that this isn't more like all of Seth Rogens other movies, but I like this movie and I'm glad they made it.If you know what your going into, I honestly think you will enjoy it."}, {"id": 15, "text": "I really enjoyed this movie especially because I was brought up old school religious. Catholic though. But honoring your dead relatives is a big deal with Catholics too. Anyway the movie was funny and Seth did an excellent job portraying both leads. I could have watched more."}, {"id": 16, "text": "Lets start this off by saying Seth Rogens dual performance is great and I really hope he does more roles like this. I love the character of Hershel but I feel like his relationship and eventual rivalry with his great grandson Ben is a bit rushed and a little hard to believe. But i can't be too hard on it. Its about a guy being brined in pickle juice for 100 years for Schlopsk sake.6.5/10"}, {"id": 17, "text": "A phallus pickle, coated in the scent of putrid roll mop, then left to soak in a fetid cesspit of manure during an excessively long heatwave, finally marinated in a cadavers colon and served with a side of cat vomit."}, {"id": 18, "text": "It is mostly harmless. It was interesting, in a positive way, to watch a film where Seth Rogen is restrained and does not resort to vulgarity. But, American Pickle could have been so much better if the fish out of the tank premise was explored a little further and if it was a little less politically correct. As it is, American Pickle is as bland and generic as cucumber pickle without spices and herbs."}, {"id": 19, "text": "I am baffled by how many people dislike this movie. It deserves at least a 7. It's a brilliant script from Simon Rich (the writer behind Miracle Workers), brilliantly acted by Seth Rogen. It made me laugh; it made me tear up; it got me thinking on multiple levels. It's an over-the-top feud movie in the vein of Tin Men; it's also a clever satire with heart. Yes, the plot is absurd, but it's a satire! That's the point. If you liked Tin Men and/or Miracle Workers, if you were raised Jewish or with any other religion, if you had immigrant parents, if you like satire, if you simply enjoy thinking and watching intelligent films...you will like this movie. If you just want a dumb comedy, you won't."}, {"id": 20, "text": "This eminently pleasant film is about the premium importance good family relationships play in a healthy life. It is sort of told as a lightly comedic fable based on the Rip van Winkle/Futurama premise of a man finding himself displaced in time and culture. From the negative reviews and sub-6 rating, I expected to watch 15 minutes and consign it to the wastebasket of unfinished films, but it kept me entertained throughout and had the added pleasure of having a sweet resolution."}, {"id": 21, "text": "Not much going on here. Your typical romcom this time between great great grandfather and great great grandson. Low on the laugh scale for Rogan. If you pass on it you wouldn't be missing much."}, {"id": 22, "text": "This had the opportunity to be really good. The idea was intriguing but unlike the pickles it had no zest and only the bad after taste of garbage and rain water."}, {"id": 23, "text": "Nice movie. I was a bit unsure of the current 5.8 rating here on IMDB, but glad I did the dice-roll and gave it a shot. It was well worth the time because It made me laugh more than Good Boys."}, {"id": 24, "text": "Seth Rogen could not deliver what is expected from him . Poor script , Poor screenplay , Poor dialogue acting and casting was moderate .This flip will no not be successful both in business and from critics perspective . Complete waste of money as well as time ."}, {"id": 25, "text": "Not something you'd expect from Seth rogan, very different from his past movies. I found it very entertaining. Funny and a simple story. I would say give it a chance."}, {"id": 26, "text": "More like utter rubbish..... premise was good. Execution was awful. Not at all funny. Tried to take itself seriously....a very boring film."}, {"id": 27, "text": "Lazy writing, lack of creativity, boring movie. they're just pushing them out these days,.. terrible movie."}, {"id": 28, "text": "This is one of the most amazing moving movies I have ever seen. The outlandish plot is part of it and it is able to get over itself perfectly and tell a beautiful and hilarious story about family, religion, forgiveness and the climate of America. Seth Rogen's performance as Hershel Greenbaulm is his best acting work I've seen."}, {"id": 29, "text": "Couldn't really get into it, its just too much Rogen. He's funny but not 90 minutes funny."}, {"id": 30, "text": "Not what I expected. Good that I ignored the ratings and gave it a chance. The premise is obvious, but Seth Rogen gives an understated performance. Definitely try."}, {"id": 31, "text": "The movie sets off with a really distinguished and intriguing look at the 1920s which I very much liked, but then transcends into a somewhat-basic new age comedy with the cliche fish out of water storyline. It does manage to get in a few laughs and sets a nice heart-warming message about family."}, {"id": 32, "text": "Having read most of Simon Rich's work, I must say Sell Out was one of his best stories in my opinion. The movie changes quite a bit from the book, cut's out the main character's girlfiend, and focuses much more heavily on the bonds of family. They create a much clearer arch for Ben's character, than Simon in the book. The opening of the film set up the scenario quite nicely. The film is much more political than the book, and sympathetic to the modern generation. In some ways this leads to some positive changes to the story, I do miss Herchell's awe at Simon's lazyness in the book, and I think making Ben a hard working entrepenuer undermines Herschell being able to show Ben how much he takes modern technology and convenience for granted. The movie also makes it seem like things just come easy to Herschell, and you don't see him working hard in the movie, nearly as much as he works in the book. Overall I like this version of the story, it has more heart, but it does weaken the criticism of the modern generation that the book so hilariously gives."}, {"id": 33, "text": "If you want to watch a movie starring Seth Rogen where he doesn't smoke weed and is really enjoyable and somewhat funny, this is the movie for you."}, {"id": 34, "text": "I'm a big Seth Rogen fan. But I am surprised that he did this film. Lots of Jewish stereotypes in the film...the worst being when our hero, the pickled hero, earns a fortune by enslaving interns so all the money goes into his pockets instead of paying the very young workers. The problem is It. Is. Not. Funny. The film gets so bogged down in sentimentality that all satire is lost. Great lead(s). Fun idea. Bad Script. Sad, by the end, we all hated it."}, {"id": 35, "text": "Such a good movie. Great storyline and sooooo funny."}, {"id": 36, "text": "This is a really awful movie with absolutely no point to the story. It was advertised as a comedy ??? Where are the jokes at ?? Granted there are some very lame and bad jokes in it. It does not even have a decent sci-fi edge to it. So it is not a comedy, not a sci-fi , not a fantasy flick, guess that leaves it to be a drama and a really boring one at that. As a matter of fact there is NO DRAMA in this movie either."}, {"id": 37, "text": "The story is really cool. The film is light hearted which is nice. Easy to watch movie with A short run time so you don't feel like you have to get too heavily invested. While it's still a comedy this is a different vibe for Seth Rogen, it's really nice to see a different side of him in the film."}, {"id": 38, "text": "Unfortunately the movie fell flat. I thought Seth did a decent job of acting. Not always believable though. At times I found myself it's just Seth speaking with a heavy accent rather than a character.I did not find any humor in the dialogue, the supporting cast, or interaction with Seth and Seth. It feels that his humor is best with his normal supporting cast. James Franco, Jonah Hill, Craig Robinson, and of course McBride.A comedy that doesn't standout gets a poor score. Plain and simple."}, {"id": 39, "text": "A spark of genius in this movie would be an over statement. Rogen, arguably one of my favourite creative minds missed an opportunity to have fun with a old plot.The concept is stolen (poorly) from the 1967 tv series The Second Hundred Years starred Monte Markham in a dual role as grandfather and grandson. There is nothing new or interesting in Rogen's take on the subject. To a 10 year old boy The Second Hundred Years was funny and enjoyable, this movie is not kid friendly and will adults to tears with its boring presentation"}, {"id": 40, "text": "First review as i felt the need to warn others. do not waste your time on this movie! I normally like films with Seth in, but this one was just rubbish!"}, {"id": 41, "text": "This is not going to get any Oscars, but it's fun and enjoyable. You can watch it with your parents, even your grandparents, especially if they're Jewish."}, {"id": 42, "text": "Dont go into this thinking its a typical seth rogan movie some comedy aspects are in there but its a very different take within the comedy genre its not for everybody but it is enjoyable"}, {"id": 43, "text": ". . .bexause there is no other explanation for it. I like Seth Rogan I watch all his movies and this is truly terrible! Seth like wt actual f? Your name ends with Rogan not Green."}, {"id": 44, "text": "Unfortunately I was at an appointment and had no choice but to watch this horrendous movie. I'm absolutely floored how anyone can find this movie funny or remotely worth watching. I can't believe a customer actually requested to watch this garbage for a second time"}, {"id": 45, "text": "Gosh I wanted to like this movie, huge Seth fan. Even signed up for HBO just so I could see it. Super disappointing, boring, would rather watch hour &amp; half of pickle making YouTube videos."}, {"id": 46, "text": "Seen it all before, formulaic story, not particularly funny . I like Seth Rogen films but this was a big let down, way too sentimental and just plain boring."}, {"id": 47, "text": "Its basic virtue is the large freedom proposed to viewer. The liberty to chose the fair perspective, from nice comedy, clash between generation, best performance of Seth Rogen, decent descending in Jew tradition, sentimental portrait of a life face to new challenges, the life lesson, the nostalgia about lost worlds and irony about present one, the old influence of Hibernatus by Edouard Molinaro . So, generosity as the precious gift ."}, {"id": 48, "text": "All the 'laughs' or barely chuckle worthy moments were in the first fifteen minutes of this movie. It has a good premise but after 20 minutes this movie leaves you wondering where the plot is even going. After this point the movie faces a nosedive in quality and is just a huge message about religion or about the dead or something. Please do mot waste your time. I pirated this movie and I still want a refund."}, {"id": 49, "text": "This film start with a man Herschel digging the ditch, and he met a woman Sarah scene! As turnout, this film is about Herschel after wake up 100 years from the ancient world to the modern world, he struggle to success in his pickle business, because his grandson Ben keep ruin his plan! Entire film full of boring conversation, and annoying overuse scene! Such as, overuse of the narration scene, overuse of the punching scene, overuse of the walking scene, overuse of the close-up facial scene, and overuse of the news video footage scene! Make the film unwatchable! Barely laughable scene is, Herschel keep breaking his shovel, while digging the ditch! At the end, Herschel reconcile with his grandson! Still have a post credit scene! Herschel and his grandson watching Barbra Streisand movie! That's it! Another disappointed film!"}, {"id": 50, "text": "Not more than 5 minutes of this movie didn't totally suck. really, really bad."}, {"id": 51, "text": "This was the best acting i have seen by Seth Rogen, unfortunately thats not saying much, poor acting and an even poorer weak story, could have been a great movie with a good actor and a good script, dont waste precious time from your life watching this drivel"}, {"id": 52, "text": "My wife and I were really looking forward to a normal night out at the cinema amid this Covid-19 pandemic but were really disappointed.Apart from 2 or 3 amusing moments it was a bore.It lasts 88 minutes but it seemed like 188 minutes.Waited and waited for something to happen but sadly it didn't."}, {"id": 53, "text": "Sold as a comedy. Its not. At all. Its quite ridiculous and was a total waste of time. Myself, wife and all 3 kids were thoroughly disappointed."}, {"id": 54, "text": "It's such a shame that people today are looking for constant action and dumbed down plots for entertainment.This is the way movie should be made. This was a film."}, {"id": 55, "text": "An exceptional film. I can't even believe that in modern America someone could make such a film. we change throughout the entire generation, but deep down everyone still has a soul and it is unchanged, neither politics, technology nor progress in any area can change our eternal soul, it sounds pathetic, but it is these feelings that this film evokes. besides, I really liked the color scheme and camera work thank you!"}, {"id": 56, "text": "I am not a fan of Set Rogan, and I am not a fan of man out of his time movies. But I wanted to see this. And I didn't make mistake. While most of the movies about accidental forward time travel gives us comical characters that seem not to have a sound mind or common sense, this movie does not do that. It gives us two flawed human beings. Flawed, but human. The only reason I did not give this movie a honorary 10 is that movies really need to stop painting Eastern Europe as a big gypsy village. Come on, learn some history, and google up how Easter Europe looks before making a dumb scene in a movie. Yes, there are slums, but there's those in all parts of world. Otherwise, nice movie."}, {"id": 57, "text": "Watching paint dry is more exciting than this crap! This is a bore fest! I'm disappointed in Seth Rogan for even considering taking on a stupid role like this..... It may ruin his career, yes, it's THAT BAD!"}, {"id": 58, "text": "Laughed my head off. Lot of topics on point. Judging people of the past by today's standards, mob mentality, the ridiculousness of social media, the vacuous build up and tearing down of people. Clever movie. Daft. Stupid. Funny. Well done Seth! Think one people maybe more fond of in a few years."}, {"id": 59, "text": "Has he just realised he's a Jew? Has he found God? Has he given up weed?This is by far the worst movie I've seen in the last year and without doubt the worst Seth has ever done.Boy, take a break; become an accountant."}, {"id": 60, "text": "Decent film. A few funny moments here and there. I didn't really care for the ending, but the movie itself wasn't bad. Seth Rogan was actually really good in this. The great grandfather character was great. At times you kinda forget it's Seth Rogan playing the character. Solid 6 star film."}, {"id": 61, "text": "Funny, original and sweet (not sour); An American Pickle delivers wholesome laughs and a modern day message we can all relate to.In this comedy, an immigrant worker at a pickle factory is accidentally preserved for 100 years and wakes up in modern day Brooklyn.Seth Rogen gives one of his best performances in this duo role that will have you laughing. In a world where we're all about cancel culture; An American Pickle couldn't arrive at a better time. This film speaks to the modern work we live in and delivers a message about ethics, technology and adjusting to the real world. I truly enjoyed this film more than I expected - stream it if you can.Follow @snomedia for more reviews!"}, {"id": 62, "text": "It's not a goody comedy. It's the standard Seth Rogen dramedy, there friends, then not friends, then friends, not friends and ends with friends again. If you've watched his movies they follow similar formats, this isn't a raunchy laugh out loud comedy, it's a drama with a few jokes and lighthearted moments"}, {"id": 63, "text": "This movie was good. Unique concept, some pretty funny bits, and a heartwarming story line. The things that brought it down for me was some of the political jabs and some of the cheesier moments that made the story a bit unbelievable. 7/10"}, {"id": 64, "text": "This is an old ripped of concept film that makes no sense whatsoever. seth rogan plays a 18th century jewish person somehow in 1900 then in 2020, he also hates other jewish and europeans for some reason. The plot has more holes in it than a jar jar abrams flick to many to explain all of. Jokes fall flat and are phoned in so laughs are minimal. cinematography is filmed terrible similar to a single camera sitcom if the camera was a phone"}, {"id": 65, "text": "Not funny, bad acting, and just simply boring. Don't waste your time on this snooze fest that try to be funny, but just simply just plain stupid."}, {"id": 66, "text": "Seth Rogen does a good job playing two characters, even to the point of you forgetting it's the same guy, but the real issue is it's utter lack of reality. Aside form the silly idea of a human being being pickled and living for 100 years to emerge totally healthy, the legalities make no sense. He would never be fined $12k for having a pickle cart, he would not be an illegal alien since he came to the US legally and would literally be the longest living person in the US. Going to Canada would just make him an illegal alien in Canada. A prosecutor can't call for a defense's case to be dropped since the defense has no case bought. There would be a ton of ways to prove who you are in court, from DNA to just knowing your bank passwords, and in his case answering any questions about history a 140 year old pickled guy would not know. Any strip mall lawyer would have gotten him off.And how does an illiterate Russian speaking peasant speak perfect English, let alone understanding modern slang which Ben uses constantly? And people in 1919 did not eat garbage pickles in filthy jars with bird poop in it.An OK attempt with some funny lines but overall pretty dull."}, {"id": 67, "text": "Nice movie, storyline istcslow so it's easy to watch, never a boring moment, funny movie."}, {"id": 68, "text": "Overall it's a up-beat kind of movie, it's got it's funny moments but don't go into it expecting it to be a serious movie and you'll enjoy it. It's Seth Rogen after all"}, {"id": 69, "text": "I love Seth Rogen and really wanted this to be good, but I was disappointed. Besides Seth Rogen's charm, good music with an even better score, and some funny moments, there wasn't much else to like here. The story being told was odd, but the movie never fully embraced that. Instead, it went for a predictable and cliché story with very few memorable moments. The plot was thin, the character motivations stupid, and the humour unfunny. The movie was only 90 minutes long, but it felt much longer than that. Ultimately, you wouldn't be missing much if you skipped this one.Score: 3 out of 10 Overall: BadRecommended for: Fans of dramadies, fans of pickles, or fans of Seth Rogen embracing his inner Jew."}, {"id": 70, "text": "Its a Seth Rogen filmIf theres one takeaway from it, it should be the familiar realiasation that you just wish someone would stop greenlighting him and giving him moneyIf you wish to avoid laughing, watch this or any other Seth Rogen film"}, {"id": 71, "text": "It's entertaining, it's enjoyable, it's funny, Seth Rogen is awesome, his acting and his accent is awesome, I really love the way they start the movie, the 1900s set is really cool, not great in the whole movie there's some minus in here too but I still recommend this one"}, {"id": 72, "text": "I gave the film a 10, but it really deserves a 7.5. It is an enjoyable film that is quite funny at some points while being oddly touching in others. The reason I am giving it a 10 is to try and balance out the reviews. Most other reviews I have seen on here are 1 and 2 stars because it isn't Pineapple Express, or This is the End. People were going into this movie expecting it to be something it isn't. If you go in not expecting anything, and with an unbiased opinion of the film based on Seth Rogan's previous work, it is actually quite enjoyable!"}, {"id": 73, "text": "Not a comedy. Stupid story. Haven't seen a worse movie since 'The life aquatic with Steve Zissou'."}, {"id": 74, "text": "Who funds some of these films? One of the worst films I have attempted to watch."}, {"id": 75, "text": "The plot immediately sounded absurd but I absolutely love Seth Rogen and was really hoping I would find his unique humor in this movie but I just didn't. This film had to have been written for Adam Sandler. It just seems like something Sandler's exhausted a million times. It was just really stupid. Still love you Seth but, this was dumb. 3 stars instead of one because I did chuckle twice."}, {"id": 76, "text": "He could do a lot better with the drama but it's still kind of entertaining"}, {"id": 77, "text": "Some of these reviews are making this movie sound unbearable. It's not funny or original but at least it's somewhat watchable."}, {"id": 78, "text": "This movie was pretty funny from the beginning to start"}, {"id": 79, "text": "This movie is an abomination.Clearly Seth Rogen, who has now made several huge bombs in a row has used up his 15 minutes of fame.This flick is poorly made, horribly written and looks like the budget was ten grand."}, {"id": 80, "text": "Ridiculous plot, ridiculous cast, totally unfunny if that's even possible."}, {"id": 81, "text": "Seth certainly has become less funny the older he gets. The concept for this film has been done countless times. Nothing new under the sun. Especially in Hollywood."}, {"id": 82, "text": "This film is literally not a comedy and is very misleading in saying that it is. I'm not sure how they didn't think it's classified as a drama first (or only). I didn't laugh ONCE."}, {"id": 83, "text": "I don't get how is this so badly reviewed i almost didn't watch it given all the 3 and 5 stars. But man am glad i did,its a sweet little movie,highly enjoyable,yes there are some over the top moments but it didn't ruin the movie for me. do yourself a favor and give it a watch."}, {"id": 84, "text": "This film had so much potential with Seth Rogan playing two very unique parts that he pulls off in the beginning of the first Act very well. But then it suddenly changes into this dull boring plot of childish revenge and then out of the blue becomes a Religious theme of trying to convert him back to Judaism which seemed a real stretch. Seth Rogan as religious person is a big stretch but who knows what made him try to make this serious dull movie. Best to stick to straight comedy. A 4 mostly for his acting. Watch it ready for boredom."}, {"id": 85, "text": "I sat down anticipating laugh after laugh. I got seldom and few laughs out of this comedy!"}, {"id": 86, "text": "Laughed, cried, smiled and the movie makes you think about your family. I loved the lighting scene and Seth rogen is just an amazing actor. ^_^"}, {"id": 87, "text": "I felt the movie was well done.Seth did a great job And played the two part well. Was funny . I especially liked the ending."}, {"id": 88, "text": "Hershel (Seth Rogan) works at a pickle factory and gets trapped in brine. After a 100 years or so they open him up and he is still alive. He goes and lives with his grandson who is also played by Seth Rogan. The relationship has issues.This is an ego-fest for Rogan. He is just not that good to be on the screen all the time. He does a Monte Markham thing in the story. It would have been better if young Rogan had a girlfriend who likes gramps better. The gender/religious slurs were idiotic and did nothing to help the feature. It would have been different if they were funny. Slurs that are not funny are just that. Poor plot line.Guide: No F-words, sex, or nudity."}, {"id": 89, "text": "And I am done. Quality work and has great potential but m o v e s s o s l o w l y..."}, {"id": 90, "text": "Why can't I rate this movie zero stars?The corny parts and 'funny' parts are equal in lameness. I don't think the one or two smiles (*read: grimaces) that you may get are worth watching it for."}, {"id": 91, "text": "My friend saw the movie before me and hated it, so I went with pretty low expectations into this. And well, it's a mixed bag, tbh. I'm gonna be very sort here, but it starts pretty well, it's weird, but mostly funny, and the whole thing of the guy been from 100 years in the past is a clever concept, but the thing is, they don't explore it very much after the first half of the movie. Some of the jokes start to fall flat mid-way through it, and... it kind of transforms itself into a weird movie about... selling pickles? For a while.But I thought the last 15ish minutes of it were cute, they go to a more emotional side of the characters we hadn't seen up to that point, and I thought it worked! I like the ending, even tho it's a complete different movie when you compare it with the first half of the story. Overall, I wish they would have gone to a more emotional side, as they did in the end, and also, explored more the aspect of outsider that Herschel brings to the table, it was definitely the funniest aspect of the whole thing."}, {"id": 92, "text": "I love Seth rogen and everything he does,I think this movie had lot to offer but instead of that ,the plot it's just unorganized."}, {"id": 93, "text": "A sobering view of Seth Rohan. By that I mean Seth stay away from sober roles."}, {"id": 94, "text": "If you have been waiting for movie where someone imitates the accent of 80s Russian comedian Yakov Smirnoff for 90 minutes, this is for you!What a country!*One disclaimer before you watch this. Although it is labeled a comedy, it technically is not as it is not funny at all."}, {"id": 95, "text": "It was a tall order for Seth Rogan, whose acting chops consist of playing himself, to bring Herschel Greenbaum to life. More was required than a nondescript accent and beard to create a character. I suspect that a lot more depth lay in the pages of Simon Rich's short story than we find in this film. Unfortunately, it is depth that distinguishes a memorable cinematic experience from a forgettable formulaic dramedy. To rub salt in this wound, the production quality pretends this is more than an episode of New Girl, which only leaves us more disappointed, perhaps even feeling a little cheated."}, {"id": 96, "text": "Seth must be meshuggeneh to think this script worked.... only his talent to deliver made this film tolerable."}, {"id": 97, "text": "I liked this, and not just because i recently got a new HD projector and i'm still marveling at the level of detail. the only thing that added was a feeling of presence in the scenes and helped bring me to a fuller experience. that being said, i would say this film has some wonderful atmosphere, especially with indoor scenes, but i'm partial to those. it is COZY when it needs to be. my original title was it's all it ever needed to be, which is a pickle. what do you expect? i'm not sure or even want to get trippy enough to imagine that this was the intention at any point, because it's actually more than that.i would recommend this to the crowd who is around 40 and enjoyed superbad, horrible bosses, and maybe pineapple express. this one is actually effectively poignant where pineapple express gets points for being pathetic.7.3/10"}, {"id": 98, "text": "I thought Seth did a great job with the characters, acting was surprisingly decent. Unfortunately the movie was a failure, I laughed at one joke and the rest of the movie I found myself bored and wanting to skip to the end. Predicable and simple, a straight to TV movie is the best way to explain it."}, {"id": 99, "text": "Rank system i use is it can only be ONE movie that is the best and then get 10, to get a 9 it have to be something extraordinarily like Alien and so, a 5 is a ok movie nothing more nothing less its simple a mainstream movie. You laugh about 5sec off the movie so nothing about it is a comedy it is from start to end drama, it is a interesting story but if you as I did want to see a comedy you will be disappointed."}, {"id": 100, "text": "I'm a big film guy and this movie's not that bad. If you like Seth Rogen and wanted to watch it, you should. It hits what is going for quite well and is surprisingly funny. Definitely don't regret watching it"}, {"id": 101, "text": "20 mins in and had to quit too lame. Did not find myself caring what happened"}, {"id": 102, "text": "I know that it is a comedy. But still, if you take any historical information you need to check at least the simplest things... Kozaks were Ukrainians(Kyiv Rus) they weren't Russians. They actually gated Russians 😡And they were respectful and brave warriors with strong patriotic feelings. They want wild and cruel as in this movie 😡"}, {"id": 103, "text": "This movie is great. But it isn't an Oscar winner... it's just a really offbeat dramedy that requires a thorough suspension of disbelief and lota of empathy.If you can palette the absurd, you'll love it."}, {"id": 104, "text": "I think the concept is fabulous. It wasn't as entertaining to watch the character navigate the new world, but where the entertainment was lacking in one area, it made up for in another area. I like how they incorporated modern ideology with past morals and beliefs, which made me grateful to see how times have changed. Though I didn't like the ending. I was hoping for more, but it was still a bittersweet ending."}, {"id": 105, "text": "The plot seemed to be so promising, but the result left me cold and with no feeling for any of the characters. Such a shame. Without going into to any specific detail and removing all reality, how were the two main characters funding themselves? Hopefully it will be remade in the not to distance future."}, {"id": 106, "text": "The story is funny, sweet and even confronting at times. It has got everything to make you laugh, smile, cry and reflect. I enjoyed it."}, {"id": 107, "text": "I really liked the introduction, quite absurd, my kind of humour. Great performance from Seth and liked how the movie points out the stupid trendy/hype things of our society. Some lengthy parts from time to time though."}, {"id": 108, "text": "I would put zero but I cannot. The least is one. Total waste of time. Another arrogant Jewish movie (comedy) with no smile."}, {"id": 109, "text": "Easy watching with great filming and acting from Seth Rogen.Good, simple plot with interesting and very learning power of investing and satire in common people life.Worth watching !"}, {"id": 110, "text": "This film is revolting as cucumber itself. It has no real story, boring characters and is extremely slow and boring. Its not funny, is it supposed to be? I would say only an American would like this, and it would have to be a special kind of American. If any Brit has given this a good score, it was definitely with the assistance of someone in a white coat. Awful movie."}, {"id": 111, "text": "If I could rate this movie lower than a 1 I would. It's not funny at any point and I wish people would read Seth Rogen's script before green lighting it just bc he's Seth Rogen. Anyways don't watch, it's a waste of ur time. Seth Rogen do better."}, {"id": 112, "text": "The premise of this film made me so excited for a hilarious story, unfortunately once we reach current day I felt like we switched down a few gears into overly conceited mumblecore territory. To middling for me I would have loved way more over the top hilarity or a much more dramatic direction. I do love Seth Rogen I think this was a pretty sparse overview of what he can do."}, {"id": 113, "text": "A nice film with high potential to be a good one. Unfortunatelly, the potential is wasted. Against Seth Rogen beautiful acting, against the many ways to be more than an acceptable comedy with some spices not bad used. The end is a small consolation , reminding the fair spirit who was ignored for be a remarkable film. Its virtue - it is a beautiful film about family. The sin - it has all the ingredients to be a good drama and a melanchollical Jewish wise lesson or hommage to old shtettle face to contemporary Brooklyn . But the ambition of director to give a comedy , modest in essence, was, maybe, to powerful."}, {"id": 114, "text": "I won't bother writing a lengthy review discussing the good and bad points because really this is just utter bilge. Comments like That's x amount of time I won't ever get back are normally unfounded but with this it really was the case. Even reviewing it feels like I'm just prolonging the agony."}, {"id": 115, "text": "Great Grandpa comes back from the dead which is a huge surprise (how could he not be?). He reminds you of the things you've lost: Your family, your heritage &amp; maybe even your common decency...and you didn't even notice. Wow dude, just wow.This film is incredibly poignant &amp; very amusing. Watch it right away."}, {"id": 116, "text": "An American PickleOverall I enjoyed it, it was well acted and well written and perhaps improves with a second watch. I did feel we had the same gag repeated throughout but perhaps that's just me.I say give it a chance and Seth Rogan is on top form, a very hard 6"}, {"id": 117, "text": "Unexpectedly enjoyable starts off a bit bleak then gets pretty silly and peaceful. I really appreciate the 2 Seth Rogen's they are unique yet odd definitely should say drama with comedy it's only got a few funny moments. Delightful experience better than most said!"}, {"id": 118, "text": "I have seen Seth before in several comedy films and I gotta say, I wasn't really impressed. But this one is different. His acting is on a Whole nother level. The film, with the help of the music and visual effects, is sometimes very sentimental. Although the entire premise of the film is goofy, I wouldn't even categorize it a comedy. It's actually a great film, in a category all by itself."}, {"id": 119, "text": "I laughed quit a lot during this movie. I must say I didn't expect much going in to this movie. But its quit good. Instead of the typical Seth Rogen movies with over the top komedie and a wired story. I can say that this movie is a step in the other direction. With a little more seriousness( not that of a serious movie)But overall i really enjoyed the movie! And i think you would too."}, {"id": 120, "text": "If you like Seth Rogan, you should like this movie. He does a great job acting both roles (his other character is believable as being someone other than the first, without giving too much away), but the plot could be a little more unique after the initial twist/element (again, without giving too much away).It's one of the better movies I've seen lately for sure, however. This pandemic seems to have brought a lot of cheap content with it, or at least not much new content. HBO Max is a blessing during these times, but wish they had more stuff like this (that's where I saw this movie). Movies like this is why I think HBO Max will be good later on, but it's seems like not as many of my friends know about it as they should. I really hope we'll keep seeing more high quality movies with a good budget like this, though.Edit: I originally rated this a 7 or 8, but once I watched it again and realized I wished they made more comedies like this, I gave it a 9. The plot isn't that unique, but at the same time it's a lot more unique and entertaining than half the movies coming out lately (except for huge movies like The Invisible Man, obviously)."}, {"id": 121, "text": "This was an odd movie that is part comedy, part sci-fi, part satire and part social commentary. It's a complex film that's unlike any other Seth Rogan film that you'll see. Hence, the wildly varied reviews going from 1 to 10. It has its ups and downs and you really have to watch from start to finish without blinking or turning away to get the entire experience. There were times in the movie that I thought 'this is stupid' and came close to turning it off. But, in the end, my day was enriched for watching it. Because, in the end, it's about family. And, even with all the backstabbing in modern families, family endures. This film will go in the library to be watched at family get togethers."}, {"id": 122, "text": "I expected a silly comedy but in reality, it was a serious film with some seriously silly bits. Themes of family, generational differences, community, ethics and forgiveness all had deep roots in the plot."}, {"id": 123, "text": "Not an action, yuck it up flick. Thoughtful character development, sentimental, but still comedic. Props to Seth for playing divergent roles very effectively (especially Ben, who was less caricatured and developed more emotional intelligence as the film progressed.) Surprised no one has compared the film to the 1991 Late for Dinner, with a similar plot line, but less anachronistic, more of a scifi RomCom, but very enjoyable. If you enjoyed the Pickleappetizer, you'll love Dinner."}, {"id": 124, "text": "A truly genius move to take a man from the past and let him say all the fun things. In this day and age, it might be the only way with getting away with it, without anyone suing you for feeling violated. Since everyone back then actually did say these things.The movie is also ultimately for free speach, which is great.Apart from that it is quite heart warming also. And quite fun, since with this genius draw we are finally served something to laugh about, instead of bland bullocks."}, {"id": 125, "text": "We often see films which tries to engage us with it's abstract and fun moments but at the end that turns out to be the only interesting thing in the whole movie. Director Brandon frost and the double role of Seth Rogen gives us the same treatment with American Pickle. The screenplay of the movie makes it feel like rushed and in it's entirety the movie looks like an episode of a TV series. Overall An American Pickle is a one time watch movie that you will forget after watching but as a time pass movie it's worth a shot."}, {"id": 126, "text": "In the modern world, surrounded by distractions like social media, politics etc. - we have lost a meaningful connection to faith, our ancestors and family. I loved how the movie does an excellent job of exploring what it means to belong and have a cultural identity. .The movie felt poignant with sharp, funny satire on the ridiculousness of out social and political landscape. I ending was the best - the two protagonists connect and finally see the best of one another.The movie has a heart - it makes you laugh and tear-eyed at the same time."}, {"id": 127, "text": "It is strange that in times when so much talk about racism and equality, the Jewish director had no problems calling Poles the stupidest people in the world, and Poland itself as a country with no normal cars, roads or even the Internet."}, {"id": 128, "text": "If you're looking for something you haven't seen before, this is the flick. It won't win an Oscar, but it kept my attention the whole way through. Thank you Seth Rogen, keep doing what you're doing. 👍"}, {"id": 129, "text": "At first I wasn't feeling it but glad I stuck with it ....quite a few funny moments - worth the watch."}, {"id": 130, "text": "If you got nothing better to do and want to watch something light hearted, also funny, stuff this is the movie for you. As it was for me.It's unrealistic at many times but it also leads to funny stuff.Seems like I'm in the miniority and actually enjoyed this movie... The religious stuff I did not like."}, {"id": 131, "text": "I was debating between rating this movie a 6/10 or a 7/10, really I would prefer to rate it a 6.5. The humor was charming but there were a few times, especially in the second half of the film, that it started to sort of go off the rails. Seth Rogen did a good job with his double duty. Worth a watch but nothing groundbreaking."}, {"id": 132, "text": "Its not THAT funny but its very enjoyable and the movie idea was really brilliant."}, {"id": 133, "text": "The plot wasn't that good that if it was longer i would've given the movie a lower score... 4.5/10"}, {"id": 134, "text": "So far. Opposite of woke. Half way in. Thank you Seth. Wow, Hollywood guy going full MAGA! You saw it here first guys, Seth Green is Trump 2020!"}, {"id": 135, "text": "I love this film because it is a unique and funny story that also taught me more about Jewish culture and history. I thought it was a wonderful representation of the struggle a Jewish man in the modern world goes through while he connects with his roots. Highly recommend to anyone with a soul"}, {"id": 136, "text": "The film begins nicely but quickly goes downhill once Herschel falls into a vat of pickles. There's no explanation for his 100 year survival and he doesn't seemed to amazed at what has happened to him and his lost wife.There are brief momentts of humor. But, for the most part, the film is rather silly and even boring. Even the way Herschel makes his pickles isn't correct.This coulld have been a good character study.,mixed with comedy, on the level of Woody Allan's Sleeper, has it been produced more competently."}, {"id": 137, "text": "Love it funny and so entertaining and Seth done a great job its a must watch movie"}, {"id": 138, "text": "It's a Seth Rogen comedy, people. Stop being so sad. He did not promise you an Oscar winning movie.Weird and wholesome, like him. Would recommend if you like his style. Also, the play on old and new generations is so so good."}, {"id": 139, "text": "How can Herschel make pickles if in the factory 100 years ago the owner wouldn't let him mix the salt nor sort the pickles? The only skills he had was killing rats and ditch digging. He is no expert on pickle making.Also, he needs 200k to buy the billboard to take down (or whatever). He'd have to sell 200k in pickles, at least. The same pickles that were beeing thrown out by the grocery store NO ONE WANTED.They would've been better off if Ben becamse Herschel's agent andd he went on the talk show circuit making 10 k per appearance. After all, his biggest asset seemed to being from 100 years ago and speaking to that."}, {"id": 140, "text": "Its much better. This should have been made as a short."}, {"id": 141, "text": "I wanted this to be good, love Seth Rogen. But a lot of it was just over the top stupid humor with a story line that took too long to develop."}, {"id": 142, "text": "I think Hollywood has given up, is it because COVID has decimated the industry? Very disappointing."}, {"id": 143, "text": "Stop giving this man a budget 🔫🔫🔫🔫🔫facts facts faks here"}, {"id": 144, "text": "This is not a comedy. If it is, the comedy is very subtle. 45 minutes into it, didn't laugh once. I smiled a few times, but other than that, it's just not funny. the only comical part is he gets preserved in pickle brine for 100 years.Maybe if it was directed by a reputable person and written by one, it would have a chance, but the script/dialogue is so terrible. If anything, they could've made this into a single season dramedy series.Trust me, don't even waste your time, even if you're out of options. I give it 2 stars just for the effort."}, {"id": 145, "text": "An American Pickle reminds me a collection of short stories that critique the modern society but with shortcuts that did not make that much of a sense.Authors seems to know what to do and where to go, but the way there is annoying, boring and kinda nonsensical.If you turn off your brain and take just the moral lessons after every short story it is a nice movie to watch. And nice in the meaning of empty boring way that tells you nothing actually."}, {"id": 146, "text": "I really liked this movie, it had a intresting theme and i thought Seth Rogen did a good job to be in the two leading role. It had charm and charisma. The story was intresting about a man who ( yes i know a bit silly) traped in a pickle factory and come Alive again after 100 years. I really liked this movie and somehow it moved me. Dont understand why people give it a negative review. And no i am not jewish"}, {"id": 147, "text": "I really like this movie. I thought Seth Rogen done a Great job. Loved how he's pushing his Jewish heritage in this movie. It had all the great perks of being a fantastic movie. I felt it lacks story and the end came up really fast. Feels like there is a lot of unanswered questions. I would have like to have seen a proper relationship blossom between Hershall and Ben show a much more deeper bond. Rather than just a cut hand and a hug in the cold. I was really getting into this movie but like I said wasn't enough in it to make me wanna rewatch or suggest to others."}, {"id": 148, "text": "A movie to kill time, the plot of the movie is really good, not seen this before. Also is not a seth rogen performance that we are used to."}, {"id": 149, "text": "An American Pickle was a Seth Rogen comedy that was actually in some ways funny and it had a interesting idea and premise about it,we also know how in some films idea like this one easily fails expecely when a actor plays a two roles and they are very similiar to each other,but here Seth was able to pull it off and he give one of his best performances and he was funny in some scenes,script was also solid but it had some very poorly written lines and a predictable moments in it,An American Pickle was a watchable film,it is also one of better Seth Rogen films and i would say that you should watch a film just because of his presance"}, {"id": 150, "text": "While Seth Rogen is a likeable comedian ....especially when cast as the underdog trying to win the girl etc....this bis not the case here.......the film tries to capitalise on the Fidler on the Roof stereotypical jewish character and goes over the edge insulting some devoted Christians.....itis not the first time in entertainment business...we see a lot of stand up jewish comedians doing that and be tolerated but enough is enough...some sympathetic biblical figures thrown in to make things up are not enough.....the film is a total failure"}, {"id": 151, "text": "An odd, but quite funny film, An American Pickle may not be as even as you want it to be throughout, but for the most part, it is a rather enjoyable and surprisingly simple comedy and satire about family, beliefs, and the world we live in today. Seth Rogen plays the main two characters in the film, Herschel and Ben Greenbaum. He plays both roles rather well, though unfortunately, the script does not do wonders for the character of Ben throughout most of the film, as he seems to be less of the character and more of a engine to keep the plot going. Nevertheless, Rogen and co. bring there A-game to this flick. It is the first PG-13 film from Rogen, and surprisingly, it shows how the film doesn't need to be raunchy to be a good time. It's thoroughly entertaining throughout, and though it struggles a bit to keep its plot afloat for a reasonable length film, An American Pickle is never a burden to watch, and will certainly have you smiling throughout. My Rating: 8.25/10"}, {"id": 152, "text": "This movie was the most funny I have seen in years!!! But it was more than just a funny movie, it actually makes us millenials see our reality from a different perspective and realize how lucky we are of having everything we have. I just loved it would recommend it to anyone that wants a fun and light movie to watch after a long working day :)"}, {"id": 153, "text": "I think the bad reviews are due to the fact that everyone was expecting this to be another stoner Seth film when it actually turned out to be a comedic drama. The film was very enjoyable and I was surprised to see that he can actually act when he wants to. A heart-warming film I'd recommend any day!"}, {"id": 154, "text": "After years of playing pot-smoking slackers who comment on bodily functions,* Seth Rogen plays a more serious role in An American Pickle, as an immigrant preserved in pickle brine for 100 years and the man's great-grandson. The movie gives a sense of the different values of different eras, and also how experiences color interpretations of things. It's not a masterpiece, but I'd say that Rogen is one of the undeniable comic geniuses of our era. I recommend it.I also recommend a recent interview with Rogen in The Guardian in which he reveals a major lie that he got taught as a child.*Rogen also played a fairly serious role in the 2011 dramedy 50/50."}, {"id": 155, "text": "The story is good and inspiring of this man who been pickled for over 100 years as in the movie trailer, but there is no explanation why and how did he survive all this time in pickled.There was no need for the movie to be raciest to pass an idea, it could be presented better than this during this crisis happening and protests about it.the movie is good if you want to pass some time but no languages as I might think it will be, no comedy in this movie as I thought it will be, much more drama and at some point, you might cry or have some tears if you are so sensitive."}, {"id": 156, "text": "Really enjoyed this, I went in cautious because of the concept but it was perfectly executed, as well as witty one liners and physical comedy the film also touched on satire of the current zeitgeist like hipsters and cancel culture. It was very funny and heart warming, I left the cinema with a smile"}, {"id": 157, "text": "This movie is so sweet, more films like this need to be made. Wacky and original with a heartfelt message. Really loved it. Seth Rogen is a joy to watch, kept forgetting it's him playing two parts. Highly recommend to anybody who'll listen!"}, {"id": 158, "text": "A really enjoyable movie. It's very sentimental yet it also has some very funny, maybe even hilarious moments. The standout of this movie is definitely Seth Rogen, I think by far his best performance and he really proved himself as a heavyweight dramatic actor. The movie also has some amazing soundtracks."}, {"id": 159, "text": "The whole thing is ridiculous, not airplane ridiculous, but ridiculous in its entire premise and the ease in which that any kind of due process is ignored. However, I enjoyed it. Will I watch it again? Maybe but that will be because I will have forgotten about it in a few days"}, {"id": 160, "text": "I never thought I would watch a comedy about a man selling pickles but Seth Rogen made it work and I found the film hilariously stupid, it's a good movie but one with many problems so it isn't for everyone but it was entertaining to say the least. You're in for one of Seth Rogen's best performances as Chester and Ben Greenbaum, he successfully created two interesting and different characters with help of the writers.Brandon Trost directed An American Pickle and it was mostly fine directing from him, he nailed the comedy elements but the more story driven things was lacking but then again if you watch this for the story you are watching the wrong movie. There's nothing wrong with the story except how ridiculous and unrealistic it is so again it's not for everyone.Seth Rogen saved this movie for me, I couldn't think of any other actor to play the two roles he did, it's his characters."}, {"id": 161, "text": "I mostly watched this movie because of its premise (a guy who's preserved in pickle juice? i mean how can this not be funny?), and the first 30 minutes really didn't let me down. the 4:3 ratio in the beginning and the slow morph into a 16:9 while new york city transforms from 100 years ago until today were pretty amazing. it took me a few minutes to get used to the whole atmosphere of the movie, and decided to not take it too seriously, and i did have a good time. my biggest issue was the plot/the plot development though; while the first third felt consistent, the rest of the film felt more like an indecisive mess to me. there were moments that were funny and unique to this movie, but overall, i personally just couldn't really follow the story, the characters' motivations and the writer's intentions. i wish they'd focused more on the original setting instead of trying to push this movie into different (political?) directions. still a fun watch though, just didn't really do it for me personally!"}, {"id": 162, "text": "Nothing about this movie is funny, and the dramatic/emotional parts of the film are cringe."}, {"id": 163, "text": "Instead of continuing and building on the whole 'man from 100years ago, discovers the modern age' plot device... the director rather turned the story into a convoluted 'bad guy vs. bad guy' story with both bad guys trying to one-up each other in a series of schemes and childish ploys.The movie was honestly not bad at all until about 40minutes into the movie, and I was interested in the movie up until that point... but then this whole 'tit for tat' story started and the movie derailed badly.Overall, the movie could have been a 7/10 if it stayed away from the petty plot-line that it adopted in the latter part of the film, and instead kept focusing on the 'bright side' of the plot. Unfortunately, it results in a poor 5/10 showing, not really worth even watching once."}, {"id": 164, "text": "It was a cute movie , it had a decent story and it was a good pass of time"}, {"id": 165, "text": "An amusing little film to pass away some time but, to me, in part it's a rip-off of Peter Sellers Being There and a poor one at that. For that reason I can give it no more than 4, if you've never seen Being There do so and you'll see what I mean"}, {"id": 166, "text": "The film starts off reasonably. There is some very strong and obvious stereotyping of the main characters, with heavy unconvincing accents, but that's kind of the point. It's not supposed to be an accurate portrayal or drama, its supposed to be a comedy. There were a few small chuckles at the beginning when Herschel and his wife discuss their 'impossible' dreams and when he first awakens from his pickle incident, finding himself in modern America 100 years later. As for the remainder of the film, it doesn't really have that many funny moments and certainly no laugh out loud ones. The film starts to get a bit silly and runs out of steam to the point that I wasn't really that bothered how it was going to end. Okay, but I wouldn't watch it again and it's pretty forgettable."}, {"id": 167, "text": "When I saw the trailer, thought it looked interesting / different with a unique plot.A different type of movie for Seth Rogen, where some parts are funny, rest of it feels a little awkward, heart of the movie being about family history and the legacy we pass on but just felt movie lagged a little but decent set pieces with some funny moments, just hopped it had more gags and picked up the pace otherwise I'd make this a 7"}, {"id": 168, "text": "I am not a fan of SR, always same characters, but this movie is great. Great message for new generations."}, {"id": 169, "text": "What a huge shame. Great story at the beginning. Echoes of the Forest Gump experience. Humour. Well set up characters. Critique of the USA. Descends into silly religious schmaltz and a frankly insulting view of Eastern Europe in the 21st century. This could have been a great movie. Where were the pickles at the end? Who got to this movie before the final cut? Someone did."}, {"id": 170, "text": "Really enjoyed the first half of the movie. Seth Rogen excellent in dual role. Movie kind of goes off the rails in the middle with the whole pickle business and billboard removal storyline. Gets back on track at the end."}, {"id": 171, "text": "I am not exagerating ...found it funny and well cast it s not easy to make some plot like that funny i give credit to whomever realized it. He knew how to make something funny without feeli g the need to go gore/deviated/daring/unethical. Yuppp loved it"}, {"id": 172, "text": "Erm, cant believe I watched it. Usually Rogen is ok but this is somewhat a stupid copy of Mel Gibsons Forever Young, only very stupid and yet it gets over 70% RT... Seriously dont think those guys down there have a clue. Terrible film."}, {"id": 173, "text": "I enjoyed the movie for its clarity. Peppered with just enough old world charm and backstory to help viewers understand, it shows the shortcomings of our modern age, where political correctness and electronics have turned people physically soft and passive aggressive. Modern lifestyle is certainly scrutinized here and mocked.Seth Rogen's portrayal of both Herschel and Ben was masterful and seamless. The scenes were very well done and kudos to Brandon Trost on his directorial debut. Well done,, overall!"}, {"id": 174, "text": "In continuing to branch away from the stoner comedy genre, Rogen delivers an excellent performance of both a man preserved in pickle for 100 years, and his great grandson"}, {"id": 175, "text": "Okay I should like this because it has a Jewish theme and has Seth Rogan in it, but I really can't give it a complete thumbs up. It has its moments, some laugh out loud at work moments. It's not Sandler, nor Borat. Rogen has done better in almost every movie he's been in."}, {"id": 176, "text": "I rather enjoyed this light-hearted comedy. It was entertaining. I don't get all the negative reviews, like what do you expect from a movie with this kind of premise? Don't take this movie too serious because it's not that kind of film. If you like Seth Rogan then go ahead and watch this film, and keep your expectations rather low."}, {"id": 177, "text": "Thoroughly enjoyed it. I laughed, i cried and Seth Rogan was amazing. Would recommend."}, {"id": 178, "text": "Having remembered when this film was during its beginning stages of production and reading its brief plot description, wondering as to how it would turn out. It seems relatively silly and simple but the performances by Seth Rogen make this film worthwhile.It isn't overly funny but also does not try hard either, as it is very tame for a Roger picture (no cursing, no smoking). It is a good balance of both comedy and drama."}, {"id": 179, "text": "Quite A Pickle ! Once you get Past the Buy In and Swallow the Premise, this is a really Funny Flick. Seth Rogen plays both Lead Roles in this wacky Story about a Jewish Man who spends 100 years in Pickle Brine and comes out without having aged a Day. Preserved by the Brine. His Voice is Funny on it's own, but with this unique script and dueling characters. 😉 on HBO MAX who should have added some Blues to the Soundtrack"}, {"id": 180, "text": "Seth shows some range, and that he isn't a one trick pony in this fish out of water tale. It covers most of the cliches, tropes, and cheese associated with this type of film, but I found the plot a little unexpected and it does a decent job of keeping it fresh, even if the finish is nothing unexpected. Far from perfect, but it knows that, and delivers what it needs to without being preachy.I thought the lack of a love interest was an excellent editorial choice.I wouldn't go out of my way, but if you stumble on this it is worth a watch."}, {"id": 181, "text": "Herschel Greenbaum, a humble emigrant worker from the '20s in Brooklyn, falls into a vat of pickles, staying for a century perfectly preserved, until he wakes up, in a world totally different from the one he knew. Brandon Trost's debut feature film. A comedy a la Seth Rogen, with his typical goofy style. Despite being a very basic film, in terms of writing and at visual level, it's fun, with a pertinent social criticism, about social media and the hollow and populist speech that circulates on the internet, leading to disagreement between generations. For me, the best role of Seth Rogen as lead actor."}, {"id": 182, "text": "Herschel Greenbaum is a struggling ditch digger from Shtetl who, after falling in love and wanting a better life for his family, decides to find a better life in America. While working at his new job at a pickle factory, Herschel falls unnoticed into a vat of brine, perfectly preserving him for 100 years (don't question the science). His only successor in present-day is his great-grandson, Ben Greenbaum, who meets Herschel. Herschel doesn't understand Ben's lifestyle, and Ben is quick to dismiss any advice given to him by his great-grandfather. 'An American Pickle' explores the family dynamics of different generations of the same family, and while not the balls-out comedy we are used to seeing from Rogan, is a charming and entertaining watch from start to finish.Both Herschel and Ben are played by Seth Rogan, who leads this adaptation of the book Sell out by Simon Rich impressively. I enjoyed watching Rogan play both a serious role as well as the fish out of water role which is both endearing and impressive to watch. The technical achievements of playing against your own character in the same scene are always magical to behold. Ever since Lindsey Lohan's 'The Parent Trap', to Paul Rudd's Netflix series 'Living With Myself', I never get tired of the camera trick that is used in a unique way in playing with the idea that your ancestors and you look alike.I've always had an interest in family genealogical work. Tracing your roots back to where you came from eventually leads to the question; If they saw me today, what would they think? What An American Pickle' does by exploring this concept as well as how would the modern-day world reacts to someone from a different time is incredibly topical. How would someone who never grew up with technology, social media, or even modern-day health regulations, learn to survive in the 21st century?The weaker moments in 'An American Pickle' are where the film goes against it's set rules for the world you are in. In some moments it seems incredibly topical and accurate to the world we are in with consequences for actions. But when it serves the story progression forward, those rules no longer apply to the characters which kind of underminds the films established guidelines. While Rogan's performance is very impressive, there isn't a lot of characters other than Rogan's that maybe could've been interesting to explore in a b plot.Overall, I had fun watching An American Pickle. I would recommend you watch this if you're a fan of films like 'The Disaster Artist' or '50/50, and want to see both a comedic and heartfelt performance by Seth Rogan"}, {"id": 183, "text": "I didn't expect a lot from this movie I just wanted to laugh, then it impressed me at the beginning. The movie started with an amazing narrative style as the cinematography was fascinating then the exposition of the love story was both funny and beautiful. And that's all what I loved about the movie and I raised my expectations after that (I wish I hadn't)The way of turning him to a pickle was ridiculous and that's okay I'm not watching a comedy movie to look at this kind of things but it should have been funny at least.Then the second act, Herschel's reaction after he had back was cold and it was supposed to be much funnier (another missed opportunity) Then the movie reached the maximum level of the lazy writing, the hole pickle project was ridiculous then Ben's continuous attempts to ruin Herschel's life were illogical.The director Brandon Trost and this is the first long movie he has ever directed, didn't show me that he knew how to direct a comedy movie, he cared a lot about the cinematography (as he's a cinematographer) and forgot about the music. The music was terrible, the most of the movie was quiet and have that sad vibes, there was a track that can be fit in a thriller movie, and the movie's colors were dark, also the cuts was super weird, all of that didn't help to get the comedy movie mood.Seth Rogen as Herschel has only one facial expression and as Ben was overreacting most of the time, neither of them was funny for me.In the end, I think that Brandon Trost has totally missed up and didn't know how to come out with a comedy movie."}, {"id": 184, "text": "The character placed out of time trope is a classic plot device to write a story around. It has been done a lot of times for a very good reason because it allows to explore a vast array of topic by juxtaposing the old and the contemporary.This story is a comedy first, but in a semi-subtle way, it also is a scathing critique of modern day society. It addresses problems with group-think, zeitgeist, economic inequality, immigration hypocrisy, privatization of everything, social media and privacy concerns and the socio economic knife-edge we are willing to balance on just to fit in.It doesn't as such have a message about it, but more a mirror. It navigates the various pitfalls of, for instance the American dream, which is correctly portrait more like a nightmare, where the playing field is savage, based on mostly luck, where image is the most fragile and valued commodity. It shows the petty existence of people deluded into thinking this is freedom, while it is clear they are all slaves to image, group-think and fashion.If there is a message to be had, it probably is that without a proper balance between individualism and an emphatic society, everybody is a monster, everybody is a hypocrite and everybody is a self-centred maniac. So help yourself to help others and help others to help yourself.Competently written, well shot, acting was fine. easy 7."}, {"id": 185, "text": "After falling inside a pickle tank Herschel Greenbaum stays there during 100 years. One day two kids accidentally open the tank. The first thing that pops out is the obvious confrontation of the different generations, been this difference represented by Herschel and Ben Greenbaum (his great great son). The movie shows the different approach that both generations choose to face life. To be honest I think the movie would gain more if the drama aspect was more into the movie to be more balanced because sometimes it feels that the comedy aspect downgrade the emotional investimment of the audience. I like the critic that the movie does to some people that interpretes some opinions of the past with the values of today and it critics the people who tries to interpretate some opinions making them more that what they are. The criticism of egoism of the new generation in any ways, since the fact that people want everything for themselves and the fact that people don't want anyone to succeed. This movie is great, despite going throw a road that I think is not benefit for the movie and it downgrade the emotional potential, the picture give us some criticism to society since the religious obsession, to egoism and it give us one funny experience envolving two different generations"}, {"id": 186, "text": "An American Pickle (2020) is possibly the least offensive Seth Rogan film since Monsters vs. Aliens (2009).It is a truly heartfelt metaphor for the way American immigrants find their way in a country where they don't speak the language and have no supports they can turn to.There is a very personal message about family pride, tradition, and religion built-in. Credit to writer Simon Rich on that one.The comedy is strong. It is built on silly slapstick instead of Seth's usual variety of anatomy and fart jokes.And the acting is incredibly skilled (for a Seth Rogan piece).The only frustration I had with the movie is the weak representation of gender roles. One of the messages involves wifehood and the fish-out-of-water character's narrow view of women's' roles. The writing shows how off base he is but does not demonstrate any more refined examples for the 21st century. Most of the good representation is reserved for same-sex relationships. But these are a little too overwhelming. There should be a good spot between under-representation and blatant over-representation.Don't be afraid of this film. It's not the usual Seth Rogan fare. And keep an eye on writer Simon Rich. He has a great future of thoughtful storytelling ahead of him."}, {"id": 187, "text": "Seth Rogan makes a good Eastern European Jew circa early 1900s. He looks the stereotypical part. Big beard, OTT Russian accent. He's a ditch digger. Dirt poor, literally. It's a Rogan film though, so of course it's silly, with Herschel Greenbaum (Rogan) playfully narrating, seeing him and his wife, with all her own teeth, head to America. If it continued in this vein, I might be onboard, but... well it's not going to is it. No, Herschel falls in a vat in a pickle factory and is inexplicably pickled, only to be discovered and reanimated 100 years later in modern Brooklyn. Oh dear. Herschel is alone in a scary new world, full of crazy new adventures. He's accompanied in these by his great great grandson Ben, also played by Rogan (sans beard). I don't really like Rogan. Two of him at once is a bit much. Herschel gets to experience Alexa, cabs, fizzy water. None of it is remotely funny. There's a mildly interesting thread about how Judaism differs for different people and the relevance of religion in modern culture, but I'm projecting really, trying to find some worth. Anyway, for Herschel religion is his world. For Ben, well he couldn't care less. After oh I don't know, a day or two, they fall out. Partly over Ben's lack of faith, partly due to Herschel ruining Ben's none existent app developing career. Herschel sets up a pickling business, obviously and becomes internet famous thanks to a load of hipsters in Williamsburg. This pisses Ben off and... oh dear god what the hell am I watching. I'm watching Seth Rogan fight with himself! Then it tries to get all post-modern with a commentary on hateful online culture, as Herschel discovers Twitter and becomes a far right poster boy, gets Ben deported and blah blah blah. It goes on with this ridiculousness for 90 minutes, with the predictable redemptive ending. I can't bring myself to say any more, I just want to forget it and never speak of it again."}, {"id": 188, "text": "Bravo!Not vulgar, not R rated - and demonstrates Seth Rogen's acting chops as he pulls off two very different roles/characters convincingly.Moving at times, witty at others - and some well-times sarcastic jabs at modern society peppered throughout.Many reviewers who did not like the movie - can't seem to handle the cleaner more serious Seth Rogen.Anyone offended with any parts of this movie needs to stop taking themselves so seriously.Clean enough to watch with your grandmother."}, {"id": 189, "text": "I started watching how quirky it was at the beginning and humorous. I was especially impressed with Seth Rogan's performance as the immigrant. But as the story line progressed it became very evident what the message of the movie is. That as Americans we are family. Some of us are from an older school of thought and some of us from a newer school of thought. How the new school wants to point the finger and accuse the old school of its plain to see out dated mode of thinking- but no one else sees it until it's revealed by the the new school. Wreaking havoc and financial demise on the old school. And the story basically follows this line until it's revealed to the old school that the new school actually perpetrated all of this on him. But by the end of the movie the old school tries to look like the new school, they look very similar, but you can still tell they're different. The new school recognizes that the old school still has something to offer what the new school is lacking- work ethic. While they work out their differences they know they're from two different worlds but need to learn to live with other. After all, the old school begat the new. It's really an age old story. We just happen to find ourselves smack dab in the middle of it."}, {"id": 190, "text": "If you enjoy reading my Spoiler-Free reviews, please follow my blog :)HBO Max arrives to become one more proof of how vital streaming has been to new filmmakers and writers all around the world. An American Pickle is the very first original film released by the respective service, and it gives the opportunity to Brandon Trost (solo directorial debut) and Simon Rich (feature film screenplay debut) to demonstrate their talents. Despite my curiosity about what they could offer, my eyes were obviously focused on Seth Rogen's double performance. Even though he's not the greatest living actor, I always enjoy his comedic roles, most recently in Long Shot and The Lion King. Possessing a premise with tremendous potential to deliver amazing laughs, how did it go?Well, I'm surprised by how grounded and realistic Trost and Rich's approach ends up being. In the first twenty minutes, everything points to a straight-up ridiculous story where the most absurd things occur. Basically, I love every single thing until the title card shows up plus a few more minutes. Herschel's life goals, his relationship with her lover, what leads to him getting brined for a century, the (technically brilliant) scientific justification that they give after he's found out to be alive and that he didn't age a day... Everything is ludicrous, but what would you expect from the already crazy premise?Never forget: having the wrong expectations (unrealistic, overhyped, nonsensical) can quickly turn your experience into a nightmare. An American Pickle has an absurd narrative because it develops an absurd concept. That's what's so incredibly entertaining about it: the possibilities are infinite as long as the people at the helm are creative enough. This is why I feel somewhat disappointed that primarily Rich couldn't take this story even further, both character and story-wise. In fact, as soon as the end credits started to roll, my first thought was is it over already?Throughout the whole runtime, the viewers have to deal with only two characters who aren't deeply explored. Herschel is a man out of his time, but with his impressive determination and hard-working personality, he seems to surpass every challenge thrown at him. On the other hand, Ben struggles to get his product/idea on the market, but he doesn't seem to have the same will that his great grandfather holds. Therefore, the whole narrative is stuck on a loop of Herschel doing things right, and Ben getting jealous over it and trying to mess with his success. Each reiteration becomes less funny, less entertaining, and less plausible (I can accept most plot points, but some are indeed way too nonsensical for the world it finds itself in).Obviously, the comedy bits are almost all linked to Herschel and, as expected, to his dated cultural knowledge. It's a matter of time until he says something he shouldn't, mostly stuff related to his views on religion, racism, and every sensitive subject you can think of. Some viewers might even get offended by a couple of jokes, which are precisely the ones I laughed at the hardest. Unfortunately, Rich's screenplay doesn't have the imagination a premise like this demands (too focused on stereotypes and easy jokes), but having in mind this is his first writing role in a feature film, it's a good start. Trost does a pretty decent job, especially when it comes to film two characters interpreted by the same actor, so I wouldn't mind seeing these two working together again.Nevertheless, it all comes down to Rogen's double performance, and he nailed it. He's the main reason why I'm giving this movie a positive review. He's able to dive into these characters in such a compelling manner that, at some points, I genuinely thought this film was written and directed by him. It feels like a personal project, something that I can easily picture as a Seth Rogen's movie. He's hilarious when he needs to be, and extremely serious when the time calls for it. Finally, I don't look at this film as a comedy because ultimately I don't even think it is. It's strangely a sweet story about family and why it should matter so much to every single one of us.All in all, An American Pickle surprisingly takes a grounded approach on the man out of his time concept, making the whole message about family, even though its premise is absolutely bonkers. The first act sets up a logically ridiculous yet hilarious story that unfortunately doesn't quite reach its potential. Debutants Brandon Trost and Simon Rich do a reasonable job with the narrative, but Rich could have explored the main characters a bit more, having to ultimately thank Seth Rogen for such a fantastic double performance. The style of humor present in the movie will not work for everyone, but it definitely did for me, even though it lost steam throughout the runtime. Its comedy is at its best when it tackles the dated cultural restrictions in Herschel's mind. It's a short, fast-paced story, with a neat score by Nami Melumad (Michael Giacchino wrote the themes), that anyone can enjoy just as long as they have the right expectations.Rating: B-"}, {"id": 191, "text": "Everythiing in america is big, the slogan has flashed over us for nearly 200 years, and this pickeled time traveller really grasps the big apple head on.its a witty, and actually quite funny look at how the american world have changed for a methusaleh aged eastern jew, they have made great vfx and done a pretty good research on product development, i remember the first time i used the seltzer water machine myself , a prototype soda stream 1980 model, and how my finger and body waited for the snarling stuttering puffs when the machine hgad done it ready, shock and awe, made in america.its pretty well acted, the jokes hangs really loose, the irony at its best and the opening section really shuffles the way open into maybe the comedy of the year.the grumpy old man, not a seth rogen fan usually, opens up his doors for more of this neolittic fus farsing. its well worth a watch. a recommend"}, {"id": 192, "text": "'An American Pickle' is one good HBO Max original movie to watch from Seth Rogen, the star and producer of 'The Disaster Artist', '50/50', and 'The Night Before'.The movie is an adaptation of a 2013 short story, 'Sell Out'.The story is about a Ashkenzai laborer, Herschel Greenbaum (played by Seth Rogen) who fell into a vat of pickles and is bribed for 100 years. Then, the brine has preserving him and when he has emerged him in present-day Brooklyn, he realizes he hasn't aged a day. But, he is shocked to find out that his only living relative is his great-grandson, Ben Greenbaum (also played by Seth Rogen), a mild-mannered computer programmer in which Herschel can't even begin to understand.Seth Rogen's double role is very satisfying; the casting is very talented; the setting is great; the story is very good; the cinematography was impressive; the humor is very hilarious to laugh at; and the story is perfect.If you love comedy-dramas, then 'An American Pickle' will be one of the perfect dramedies to watch!"}, {"id": 193, "text": "An American Pickle is about a Jewish Romanian who seeks a better life in America, but once he arrives he finds himself pickled in a freak accident, only to be awoken a hundred years later. The meat of the movie follows his interactions with his great grandson Ben, who's been caught up working on an idea for an app for five years. Hershel gets himself back into the pickling business and causes a stir on the streets of New York City almost overnight, and a rivalry between the two men bubbles to the surface. If this movie is really about anything, it's about family and grief. Ben still hides in the shadow of his grief for his parents who died in a car crash, while Hershel's main aim in the movie is to restore his family graveyard plot so he can properly pay his respects to his wife. Tied into this is how the dead are respected in Judaism, and how Ben's more modern approaches to his religion have taken by the wayside, much to his great grandfather's disappointment. These are all meaty themes to tackle, but An American Pickle gets distracted by other things it wants to say, like the dangers of social media as the modern-day mob rule, and the kind of people that use it as a mouthpiece. But what An American Pickle really struggles with is deciding whether it wants to lean into the inherent silliness of the concept and go all-in on the comedy, or whether it wants to be more serious and sentimental, focussing on the emotional drama between two men from different times. Rather than making a decision, it toes the line in the middle, never truly committing one way or the other, and thus both sides suffer for it. There's some great moments for humour throughout, but the movie only really makes the most of it in the first act, such as the scientists explaining how he was pickled making perfect logical sense. There's of course some great moments of drama as well, particularly in the third act, as Ben confronts his latent Judaism and makes peace with his parents death once and for all, and finding worthy family in Hershel. But the second act is where things completely fall apart. The rivalry between the two men just doesn't feel right. Ben comes off as unnecessarily cruel, while Hershel rides a rollercoaster of acceptance and rejection by the general public. Its inherent themes of family and grief disappear almost entirely, the interactions between Ben and Hershel are reduced to basically nothing, and the comedy value takes a nosedive by the worst offence of just not being all that funny. It's an entire act of padding, to ensure it can meet the ninety minute runtime. To make matters worse, Seth Rogen is at his best playing off other actors, but here he just plays off against himself, and half hour of just Seth Rogen is too much. This movie needed a side-character, or some sub-plots, to keep it interesting.The movie's best moments are, without a doubt, the opening montage back in 1919, filmed in an old-timey aspect ratio, muted colour pallet, and some pretty cool painted backdrops that gives these sequences their own visual identity above and beyond what you'd expect from a movie of this calibre. The relationship between Hershel and Sarah is beautiful, and I'd definitely clock in for more of that. Once he awakens and meets Ben we get some great fish-out-of-water moments, and again I would have loved to have seen more of these moments. An entire movie of this would've kept me more entertained.Yeah, I'll say it, An American Pickle was a little disappointing. It wasn't a bad movie by any means, and there's still plenty of laughs and sentimentality bumbling around for it to hit most of its goals. I was never particularly bored or turned off, and in fact I almost felt the movie ended too early. But I don't have much inclination to go back and watch it again. Ever. There's no hook. I give An American Pickle an underwhelming 6/10.My wife enjoyed it though, so there's that."}, {"id": 194, "text": "An American Pickle has such an outrageous plot that can only be justified by Seth Rogen. I can't stress enough that this movie was so perfect for Seth Rogen. What surprised me though, was how well acted this movie was. Seth Rogen has never been taken seriously because of his roles, but in An American Pickle, he gives one of his best performances so far.Surprisingly, An American Pickle doesn't have that much comedy. Yes, there are funny bits, but a good 95% of the runtime was just about the story. So, if you don't like Seth Rogen comedies or comedies in general, you might enjoy An American Pickle. The pacing was also really good too. An American Pickle is just 1.5 hours long, and it never got boring; honestly, the time really flew by. With all the good, An American Pickles does have its issues. The second and third acts weren't nearly as good when compared to the first act. If An American Pickle was more consistent with its acts, then it would've been a solid 7/10, or even 8/10.The characters were really likable, especially Herschel Greenbaum. What I love so much about An American Pickle was how it didn't go for the cliches. In Hollywood, when a character gets introduced into an entirely new world, they act mesmerized and blame it on magic or something goofy like that. Fortunately, An American Pickle doesn't do that with Herschel.If you like Seth Rogen comedies, or just comedy, An American Pickle is worth a watch. Granted, a lot of people aren't going to like this movie, and I can see why. But since 2020 has been such a poor year for movies, An American Pickle really stands out in terms of comedy this year."}, {"id": 195, "text": "I love Seth Rogen, his stoner movies especially. He's good in everything he is in and everything he produces has value, including this movie. It's not going to win an Oscar, but it's a fine story about family, history, dreams and modern society. Nothing too deep, but it has some commentary.The story is very predictable and gets muddy somewhere in the second act, even tho you know where it's going. Seth does a great job playing both characters and is fair at being earnist and his characterization of his own great grandfather is amusing and non-offensive but in the end one dimensionalI much prefer Pineapple Express, This is the End, and even The Interview over this movie, but if you've seen those recently and just want to turn your brain off with some Rogen this movie will do just fine. He is a hilarious guy but his acting is pretty much just him, so his range is limited."}, {"id": 196, "text": "Despite heading straight to HBO Max in the States, UK cinema's thirst for new content since reopening after the Corona closedown means that An American Pickle hit the silver screen. Though probably better suited to the smaller screen and, maybe because I was just happy to be out of the house, I found to be a decent enough experience.Herschel Greenbaum (Seth Rogan) accidentally falls into an industrial pickle vat at literally the moment the factory is condemned and sealed up. Awoken 100 years later, Hershel must come to terms with the death of his wife and son whilst trying to start a new life alongside his great grandson Ben Greenbaum (Seth Rogan) and the strange conceptions of the 21st century.When I say that it might be better suited to the smaller screen, it's because An American Pickle isn't the broad 'stranger-in-town' comedy that it might have been. It's a much more quirky affair than that, and offers more in terms of . . . well, not quite drama . . . pathos maybe, than you might anticipate. Both the Greenbaum's end up having to deal with the deaths in their lives and the role that Judaism plays. Both of them have good and bad traits too, so it's not a case of an obvious wide eyed innocent vs. cynical modern villain, although there are some moments of that.There are a few laughs along the way, Rogan is great in both roles and the way the doubling is done is decent enough that there are only a couple of times you can tell it's someone else. There are plenty of digs at modern life, artisanal culture, about the role personal opinions have on business opportunities. It just doesn't amount to very much, it's not quite funny enough to justify a trip to the cinema (or at least it wouldn't be in normal times). It's definitely worth a chance though, when you can see it at home."}, {"id": 197, "text": "An American Pickle had some entertaining moments, but it also had some major issues that stop me from recommending the film. Granted, maybe I'm looking a bit too much into things for a Seth Rogen comedy, but I would have a least appreciated some of these issues to be cleared up a little.There was an absurd amount of coincidence towards the beginning of the film. I understand that coincidence is an essential part of some story-telling, but An American Pickle contained one convenient plot-point after another.They also didn't do a very good job of explaining how Herschel managed to survive for an entire century inside the pickle brine. They mentioned that it preserved him, but nothing more than that. It's very unbelievable as it is, but Herschel wouldn't have been able to survive without food or drink. He also didn't have a problem walking after getting out of the vat, which I didn't buy.Again, I'm probably looking way too much into all of this, but it took me out of the film. There are also too many silly moments. Silliness is to be expected in a Seth Rogen film, but these moments slanted more towards slapstick than humourous and I wasn't a fan.The screenplay on the whole wasn't great, but it could have been worse. There were some genuinely comedic moments, although they were few and far between, and I actually really liked the fish out of water elements where Herschel was trying to learn how to cope in this day and age.The narrative wasn't particularly compelling, but it was never boring and so that was a major positive. If a film's boring, I feel like my time has been completely wasted. Whilst An American Pickle had some major problems and it's on the verge of being a bad film, I was entertained throughout and that's why my score is going as high as it is.The editing, pacing, cinematography, and musical score were all adequate. Nothing special, but far from bad. It's just a shame about the negatives that I mentioned, because An American Pickle could have been a really good film.It has the structure to be something more, and there were some elements which I really enjoyed, but it's tough to recommend it. If you're in the mood for a silly film to stick on in the background, you can do a lot worse that An American Pickle. If you're looking for exceptional filmmaking, this is definitely not the film for you.SCORE: 56%"}, {"id": 198, "text": "Who is this guy related to? Seems like it's *gotta* be nepotism: there's no other way such utter nonsense could be made and released - like a post-Taco Bell bowel movement - upon an innocent and unsuspecting public. This alleged comedy has exactly zero laughs and as a drama, well....let's just say a movie starring Seth Rogen with this plot ain't high art.The *cough* message is unclear: people were racist and biased in the old days but that's somehow charming and something we should strive for? All this science, technology and convenience is bad while a primitive, suffering life and - notably - religion hold the *true* answers to happiness?If hipsters/millenials are lazy and entitled is the message, then Rogen is near the top of hypocrite mountain - that this very movie exists is the result of laziness (the writing) and entitlement (while other talented artists struggle to get their work made, this character apparently has to snap his fingers and we're blessed with yet another cinematic discharge from him), and Rogen would not even have an audience if not for pothead millennials.Check out Rogen's resume here on IMDB - SuperBad was good, but the rest were just super bad. This guy's been coasting on that rep for over a decade now.P.S. - Don't trust the 10/10 shills here! An enjoyable romp etc. Now *that's* comedy! Pretty difficult to enjoy something that makes the viewer angry at the parties that thrust this used TP under our noses. But, hey - don't trust me either - watch it for yourself and if you also truly believe this Burger King of movies is equal to Citizen Kane, well then, I wish you luck."}, {"id": 199, "text": "Seth and friends come a long way towards making a sound little buddy movie. This must have been one Rogen wanted to make for a long time - probably as much as Barbra Streisand wanted to make her own identity movie, which is referred to in an end title scene. No cheap laughs, and no big effects here, but a double identity that really needs developing, and some finetuned humourous comments on today's society. The Jewish cementery is now under a higheay bridge, the romantic lake now looks out to an ominously rumbling nuclear facility... 21st Century Ben Greenbaum is a man unconnected to family or values, 19th century Herschel teaches him a few lessons. The scenes in the ghetto are slightly awkward, since Sacha Baron Cohen's exploitations, but no cynicism here. Somewhere in the middle developments become a little predicable, and it is a pity that a big plot movement, speeding up the scenario (no spoilers here) happens so late in the film. Some things I didn't get: how can Ben survive for 5 years in New York on no income? How can a 19th centuty man fly to Schlupsk without assistance? But all and good, we had to suspend our disbelief anyway, seeing a guy survive 100 years in pickle brine..."}, {"id": 200, "text": "Despite all the signs, pointing to it this movie is not a comedy. It is more of a drama with funny moments. For all its faults, at least it is technically competent. The cinematography and special effects are surprisingly well done. It is not necessarily nice or visually interesting, but there is a lot of visual variety and it supports the story well. The acting is good as well. Not necessarily that Seth Rogen gives a great performance, but he plays these characters sufficiently far away from his own persona that it is nice to see and enjoyable.Yet, this movie left me with a bad taste. So what is the problem?The problem of the film is not the humour, the visuals, or even the acting; it is the story. The story on the surface is how an isolated hipster living in Brooklyn comes at peace with the death of his parents and the loneliness of his life thanks to the intrusion of his anachronistic relative in his life. Most of the movie is showing how Herschel upsets the life of Ben by applying his last-century logic to the modern world.My problem is not that the plot is razor thin and relies on cheap characterisation of modern society. My issue is that by doing this the movie paints a worldview that is ultimately very alt-right. At the end of the day, this movie presents us with a far-right might makes right mindset and does nothing to challenge it. Presenting him as a sympathetic character, Herschel's attitude and actions are validated by the movie.The movie shows that: sanitary and labour regulations are bad, hipsters are naïve imbeciles, aspiring to a socially responsible business is hypocritical, freedom of speech is a fallacy, conservative religious views are the only thing defining your identity so you can only be yourself and become realized if you embrace them. The movie hints at being about Jewish identity, yet it has nothing to say about it. Ben gets saved by the brotherhood of Judaism, and it offers an explanation of why religious community might have been important in Tsarist Russia. But, in the context of the movie it is mainly the reason of his demise. Ben's American Dream is destroyed by Herschel's attitude, which culminates with his intolerance.Of course, I am being willingly unfair. Of course, the movie did not intend to have a political message. The movie is a lazy drama with Seth Rogen. Yet, the point is that by not being accurate, the movie lends itself to promote this worldview. Granted it is the worldview of the past century, but it blends worryingly well with modern political discourse.The movie needed to rebuke Herschel's worldview. At least, it needed to balance it out with something else, for instance slapstick humour. As it stands, the movie's tone is somewhat austere and serious in a way that does not allow for the kind of levity that would dilute the message. The movie's humour is not only very dry, but it is secondary to the family drama. The movie tells the story of Ben grieving his dead parents, peppered with jokes and funny situations that inadvertently support right-wing ideology."}, {"id": 201, "text": "HBO Max's (low key production) ridiculous dramedy An American Pickle is Seth Rogen's most Jewish film by far and the type of movie that will probably appeal more so to Jewish viewers than a rest of audience. His character, Herschel is a religious and family-rooted man just trying to make an honest living and bring pride to his family. 100 years ago, this was seen as the typical American, but in today so called modern age some might consider this character offensive or outdated. An American Pickle might not be to everyone's taste, my wife liked it (because it is different), I didn't. To conclude, for me, it was a disappointing way to kill some time during 2020 pandemic. Film didn't produce the laughs I was expected, no matter it's one of the safest PG-13 rating ever for a Seth Rogen-produced comedy. Basically, movie is just decent-enough dramedy endeavor in which comedy works occasionally. A whole film of just Herschel adjusting to modern gentrified Brooklyn and Herschel grandson not understanding anything about his own background would've been a far funnier movie.Rating: 6-"}, {"id": 202, "text": "First of all let me say to just ignore the bad reviews. These people are obviously reviewing poorly for a one of a few reasons: They were expecting the typical late night seth rogan comedy and do not have the mind for something more refined, they are easily bored, they are not intellictual and do not appreciate art, or perhaps all of them.This movie is practically a masterpiece. It is in fact laugh out loud funny. And there is something funny in every scene. Not only that but it is amazing story telling. The writing is very good. And it is an intelligent and refined comedy that is extremely meaningful. It is not just about the laughs it causes, but the messages. This is a movie that is more wholesome, and is about family values and the importance of family. It is about the changing times and how different the world is today than it was 4 generations ago (it has changed more in the past 100 years than it did in the thousands of years prior), and just what the culture shock would be like if someone came from 100 years ago to today. It is about entrepreneurship and being a self starter and using business to give your life purpose and pursue something important to you. It is also about how in spite of the fact that most people these days do not feel like religion is relevant anymore, there is still a need for spirituality or at least some sort of meaning in life beyond the superficiality of the mundane world, and especially to help us with things such as grieving over the loss of loved ones or falling on hard times.So you are probably wondering, with such great wholesome meaningful messages, how could there be such bad reviews? Yes, as I said, those people are obviously extremely vapid. This movie is a very great film. It is not only meaningful, but it is clever and funny. It is well written, well acted, well directed, well produced, and all around well done. Here is a movie that is not only extremely entertaining but extremely thoughtful and touching. This not only made me laugh out loud a real lot, but it made me tear up at the end too. And it touched me so profoundly that it left me thinking about it for weeks afterwards. I kept on playing parts of it in my head that I found inspiring. I found myself wanting to make pickles (which I did by the way, and was awesome), and listen to the music from the movie. Until eventually I had to just watch the whole thing over again not much more than a month after seeing it the first time (and I rarely ever watch a movie over again, and if I do it would have to be only after a long time, like a year or two at least).I'm telling you that this is a great american film. One of the cinematic works of art of the modern era. I hope you watch it and will appreciate the fine points. Just don't expect another late night seth rogan comedy."}, {"id": 203, "text": "Initially when I sat down to watch the 2020 movie An American Pickle from director Brandon Trost I wasn't really having much of any anticipation, given the fact that I am not overly keen on Seth Rogen as an actor. But still, this being a movie that I hadn't already seen, and I was given the chance, I ended up sitting down to watch it.I will say that An American Pickle was actually an entertaining and enjoyable enough movie for what it turned out to be. Sure, this movie was by no account groundbreaking or particularly innovative, but it definitely did have its moments. And I will say that Seth Rogen was actually good in his two roles in the movie.The storyline was adequate, and it definitely had some interesting aspects to it. I just feel, however, that the entire movie was too shallow. It just felt like writer Simon Rich didn't really delve into the full potential that was readily available with the script and storyline. So the movie came off as being sort of half-hearted most of the times. There were so much potential for delving deeper into many things and exploring them further.I am rating An American Pickle a six out of ten stars. It was watchable sure, but it just wasn't an outstanding or particularly memorable movie ultimately. Nor do I think that this is actually a movie that I will be watching a second time ever."}, {"id": 204, "text": "A toned down version of Seth Rogan, which is not a bad thing. Rogan of course plays both the main characters, one from 1919, and the other in the present.This is not a mindless raunchy film, but instead tries to look at how different our society and culture has changed in the last 100 years. Organized religion is almost a thing of the past, and other traditions and values have seem to have been tossed to the wayside. It helps us remember some things that are actually worth our attention, such as family. As I was watching I thought that it had similarities to 'Being There' with Peter Sellers, especially during the TV interview. If you've seen 'Being There' you'll know what I mean; two people that are getting huge public attention without actually knowing what's going on.I had some slight issues, not with the story but just with the overall realism. Being from Canada, as I know Rogan is as well, I would expect that just because they hike to the Canadian border it does not become a winter wonderland in a 10 mile span (it was fall weather when they started hiking). Also, when present day Rogan gets deported because he is accused of being pickled Rogan. They were both arrested and it was noted that he now had a criminal record. Your fingerprints are taken when you are criminally charged and if there was any question with identity this would be checked. Although, we are talking about a movie where a guy is brined and perfectly preserved for 100 years after all, so I suppose I can forgive the minor details.It has its comedic moments where I chuckled here and there, but it is by no means gut busting. It's mostly a light comedy with heartfelt moments."}, {"id": 205, "text": "An American Pickle is a comedy-drama film based on the short story Sell Out by Simon Rich. Starring Seth Rogen in a dual role, it's a quirky, sweet-natured tale about the importance family and traditional values with a nice touch of humour for good measure.In 1919, Jewish workers Herschel Greenbaum (Seth Rogen) and his wife Sarah (Sarah Snook) immigrate to the United States from Europe after their village is brutally pillaged by Russian Cossacks. Upon settling into their new lives in America, Herschel finds a job at a pickle factory in Brooklyn, where one day he accidentally falls into a large vat of pickle brine just as the factory is being permanently closed down. One hundred years later in 2019, Herschel wakes up perfectly preserved and unaged thanks to the brine and soon discovers he has one living relative named Ben (also Seth Rogen), his great-grandson who has an apartment right there in Brooklyn. Ben allows Herschel to stay with him as the latter tries to adjust to a brand new futuristic world much different from his own.By this stage, there have been a decent amount of stories that involve both time travel and a fish-out-of-water protagonist, with the animated sitcom Futurama and the 1992 film Forever Young perhaps being the best examples of this genre. Much of the entertainment value can be found in watching the main character growing accustomed to their startlingly new environment and the ways in which their older methods of thinking may not sit right with current trends. An American Pickle doesn't really break new ground in this regard due to its predictable outcome but its heart is certainly in the right place. Despite beginning as a typical foreigner working in a new land style of film, this all changes when our lead character Herschel meets Ben for the first time, which then turns it into a nice bonding story with a welcome amount of warmth. Each scene these two were interacting, I couldn't help but feel touched at seeing them grow closer to each other as they found comfort in their shortcomings throughout their lives, even though their plights are separated by many generations. This is quite unusual for a film starring the likes of Seth Rogen, as he is often cast in raunchy and often lowbrow comedies that only mean to make us laugh rather than offer any deep emotional connections. That's not to say this film doesn't have its fair share of humorous moments, although they are mainly lighthearted chuckles rather than belly laughs.Like with most works of this nature, we get a good juxtaposition of life from several years ago versus life today. The customs and core values that Herschel holds true to his character naturally yield mixed results when applied to the modern world of those who are constantly plugged into social media. This is especially noticeable with how politically divided America has become in recent years and how virtually everything you say or do can be uploaded for the whole internet to see. Thankfully, the film doesn't seem to pick sides as both conservatives and liberals are mocked for the extreme reactions some of them may have regarding how someone may simply be acting the way they were raised and aren't necessarily making a personal attack. Scenes like this are clearly played for laughs but I could definitely see that there is some kind of social commentary here on how some elderly people must feel when trying to cope with their beliefs now being questioned by the current generation.It's great fun to see Seth Rogen play these two different characters in the way that he does. Rogen is often typecast as the loveable chubby stoner in most of his movies so it's quite rare to see him show his dramatic side from time to time. As previously mentioned, this film marks something of a change from Rogen's usual style of comedy, as the humorous scenes here are relatively clean and dry, so much so that I'd just about say that this film could be viewed as one for the whole family to watch. He plays these polar opposite characters so well that I even found myself believing they actually were separate people at certain times. I hope Rogen ends up being cast in more dramatic roles in the future, as like with Adam Sandler, he can give a solid dramatic performance when given the right material.Overall, what the film lacks in surprise it more than makes up for with its emotional centre. This oddball story involving a man being preserved in pickle brine for a hundred years has such a kind-natured tone that it is easy to overlook most of its shortcomings. Like I said, hopefully Rogen will consider doing more movies in this style, because who knows, he might just convince the detractors who didn't believe he was capable in the first place. Not that I ever doubted him to begin with but even I have been won over by this shift in change.I rate it 7/10"}, {"id": 206, "text": "Released in America direct to streaming via the HBO max service, An American Pickle gives Seth Rogen the most his had to work with over the last few years in a dual role job that allows the funnyman to deliver one of his best singular performances in a film that would've benefited from a tighter focus and more belly laughs.With well and truly one of the years most outlandish premises, a Jewish immigrant awakens after years upon years of laying in a state of suspended reality due to being incarcerated into a vat of pickles only to discover his last living relative is a wannabe APP developer failure with no prospects or family, Pickle embraces its utterly over the top nature and allows Rogen to get his hands dirty as both the old school Herschel and the modern day Ben but there's never a feeling like we are watching a new comedy classic in the making.Directed by D.O.P by trade Brandon Trost in what acts as his feature debut, Pickle enlist's the help of screenwriter Simon Rich to bring his short story to life but in doing so you can sense the film struggled to find its real identity or vocal point as it wavers between drama, comedy and family centric tale with a sense that a more improvised or loose vibe would've helped the film that goes from depressing to bonkers often in the space of mere minutes of screentime.What at first appears to be a fish out of water tale and mismatched buddy affair gives way to a more scheming comedy as Herschel and Ben try to one up each other in a battle of wits and business smarts and while this at times provide Rogen with some great little moments, such as selling pickles on the sidewalks of New York or getting himself in trouble at public Q and A sessions, there's a sense that we are just watching a series of skits and ideas play out other than a fully formed plotline that would've helped elevate this quickfire affair to another level.One undoubted positive about this exercise that has its share of good little moments is the dual performance of its leading man.After a few so-so years in mostly forgettable exercises, Rogen is as good as his ever been in a leading role with his ability to neatly play off against himself as the brash Herschel and the more mild mannered Ben provides the film with many of its most enjoyable comedic moments.Final Say -A fun, forgettable and unfocused comedy that has a lot of nice ideas that never get time to play out the way you'd have hoped, An American Pickle is an enjoyable watch but one that won't stick in the memory for very long.3 unsanitary jars of pickles out of 5"}, {"id": 207, "text": "Seth Rogan is Herschel a Jewish gent who, along with his wife Sarah (Sarah Greenbaum) is forced from his home by Cossacks. Arriving in New York, he is employed as a rat catcher in a pickle factory that is as likely to bottle botulism as it is cucumbers! Anyway, the rats turn on him, he gets trapped inside a vat of his vinegary produce and 100 years pass. When he is finally released into his new world, he manages to track down his great-grandson Ben (also Rogan) and the two start down a pretty bumpy road. This is essentially a drama, at times quite poignant, about a man so far out of his comfort zone, but who has spirit and determination and a fair degree of humanity too. Sadly, once the joke was worn a bit thin (after 20 mins or so) the rest of it is all just a bit too fluffy; the plot twists truly implausible and though it does take a gentle swipe at political correctness and all things artisanal it's all just a bit predictable with a last half hour that is just plain daft. It isn't a terrible film, and fans of Roagn will probably appreciate it more, but for me it was a nice to watch 90 minutes that I don't see the need to watch again."}, {"id": 208, "text": "An American Pickle is a breath of fresh air - or rather, a jar of fresh pickles. Seth Rogen plays Herschel, a Jewish immigrant from 1919 who wakes up in 2019 after being preserved in a vat of pickles. He meets his only living relative Ben - also played by Rogen - but tensions rise and he attempts to launch an old-timey pickle empire, sparking an envious rivalry between differing eras. While the fish-out-of-water concept is done-to-death, I found the offbeat charm of Rogen's performances and the film's offbeat concept to be disarmingly quirky. It could've very easily had a villain, but the only kind of conflict we witness is a form of jealousy that we all recognize and that's enough to tailor effective drama. I feel the humor could've been stronger, though. I mostly found myself smirking, never laughing out loud. While Rogen proves to be an engaging actor when given the adequate material, he's definitely been funnier in many pictures before this one. However, I still recommend An American Pickle for its peculiar sweetness. It's got a simple but valuable message to chew on: Despite radical differences, family is family - appreciate it while you have it."}, {"id": 209, "text": "An American Pickle is a nice movie, light-hearted, with a few dramatic moments. I really like Herschel with the typical eastern Europe accent. Seth Rogan did an amazing job overall. Movie had really good premises and I have enjoyed the intro, that reminded a fairy tale, I was expecting that the movie would be made with this style, but unfortunately, they decided to shot it like a typical movie, and it lost immediately its magic.There are a few scenes that are funny, I liked how the movie mocked the traditional media, the internet and the American and Jewish cultures. Jokes made me laugh, they are not offensive, even if sometimes can be subtle.Seth Rogan did something a little bit better than his average movie and I am happy to see him in this hybrid role, in the middle between comedy and drama and he managed to represent both sides pretty well. It is a nice watch, I recommend it. I gave 5 stars out of 10 as we are talking about a pretty basic movie, with nothing new to propose"}, {"id": 210, "text": "Seth Rogen continues to surprise me as an actor. Sure, he's the raunchy comedy guy with the trademark laugh that you either love or hate, but he's also proven capable of turning in an impressive dramatic and emotional performance. An American Pickle, although not a great film, definitely stands above some of Rogen's other works as a worthwhile dramatic performance peppered with affectionate comedy that really moves the heart, even if it may feel a bit too unrelatable for some.OBLIGATORY PLOT RECAP: A Jewish immigrant from the early 1900s gets locked in a vat of pickle juice during a factory shut down where he is preserved for 100 years, awakening in modern day New York where he meets his great-great-grandson.Rogen plays both characters in this movie, the immigrant with a hilariously thick accent and extreme traditional family values, and his modern day descendent, a lonely app guru who has lost his family, his faith, and is on the brink of professional ruin. Rogen slips into both roles effortlessly, bringing a strong emotional arc to both characters. I mean, he's not getting any Academy Award for this, but for the type of dramedy this ultimately is, he surprises.The movie's plot sounds like a zany comedy, but at its core this is a movie with a profound message about the importance of family, faith, and overcoming loss to become stronger, better people.BUUUUUT.... THE MOVIE DRAGS: Without giving too much away, I'll just say that things don't always go smoothly between the two characters. They certainly have their differences which leads to a sort of war between the two with each trying to one-up the other. It's old vs new. Traditional vs modern. But this back-and-fourth between them gets old fast. Even when the competition slows down and you think they've both learned their lesson, it ramps up again.The movie has a fulfilling emotional climax with--like I said above--a profound and somewhat surprising message about family and faith, but the plot seems to fizzle out. There wasn't any kind of big event that made the ending memorable. It just sort of... ended... and that ending, unfortunately, because it's steeped in rich Jewish tradition and faith might go unappreciated by too many.I feel like there were other aspects of the strange family dynamic between the two characters that could've been explored, but the movie seems almost afraid--or maybe even oblivious--to tell the truly magnificent story that COULD be told. Don't be surprised if by the time the credits role you find yourself wondering about all the possibilities the movie wasted.Is this a must see? No. Is it funny and upbeat? Sure. Will you remember it once you brush the flavor of pickle juice out of your mouth? Probably not. But it's a great stepping stone for Seth Rogen and I look forward to seeing what he builds next."}, {"id": 211, "text": "An American Pickle gets a double dose of Rogen and doesn't go all the way with it. The film is a clean family watch that plays around the equation between a pickled-for-100 years great grandfather and a liberal, non-religious grandson in present-day New York. I liked the concept for its unlikelihoods - it attempts to shed some light on generation gap and how society, religion, and attitude towards life have changed in a timespan of 100 years. Herschel is a ditch-digging Jew in 1919 and Ben is a freelance app developer in 2019. When these two contrasting personas collide, what can happen?Well, to answer that simply, a number of laughs (the raunchiness of Rogen's R-rated films is completely absent here), some feel-good vibes, a few realizations, and some totally over-the-top Jewish-isms &amp; American-isms. When perceived in totality, I felt An American Pickle balances out its thematic lows with its comedic highs. We don't get a lot of scenes with the two Rogens together, but they play each other off superbly. When they're dealing with their individual lives, the fun quotient is a little less.While religion is satirized early on with a decent dose of circumstantial humor, in the end, the script turns on its head and uses (the nicer side of) religion to reunite the duo. It felt more like a 'Seth Rogen thing' than something universal. Maybe, that's the case with religion all over. Thankfully, the film doesn't take itself too seriously. It'd have done the film a tonne of good if Herschel's fish-out-of-water scenario had been explored beyond its uneven surface. Instead, it shifts focus to Ben's attempts to ruin Herschel's life - a stretch that doesn't fully deliver.It definitely isn't Rogen's most memorable comedic outing (more of a dramedy tbh), but An American Pickle holds up just fine as a comfortable one-time watch."}], "reviews_amount": 212}