{"name": "Wheels of Fortune", "titleId": "tt09735976", "reviews": [{"id": 0, "text": "Wheels of Fortune is not a good movie. It's not a good story. It's 100% predictable, and the main character is an idiot and only moderately funny.But it's not really that kind of movie. It's for watching when you are hungover and need something that a three year old could follow. You get exactly what you expect."}, {"id": 1, "text": "This movie was the only thing that grabbed my attention on this Election Day 2020. It distracted me 100%. My husband and I laughed out loud."}, {"id": 2, "text": "Plot idea used from Brewsters Million's director seems to be stuck on close ups only one long commercial for Lucas Oil. Could have done a better film a 2 rating at best"}, {"id": 3, "text": "Not a serious movie. It's goofy, good enough for a watch. A movie tool to promote motorsports."}, {"id": 4, "text": "A slapstick comedy that is rather stupid. If you're hung over maybe it might be enjoyable. Synopsis is the main character need to complete a series of tasks to claim an inheritance. This movie wouldn't have done any justice to the actors. Maybe more of a kids movie??"}, {"id": 5, "text": "This movie is not a sophisticated, elite comedy.It's a rowdy, raucous, irreverent carnival ride of whacky fun and silliness.Kooky characters and goofy situations abound.A perfect antidote to all seriousness, responsibility and adulthood.As John Lennon once implored: Turn off your mind, relax and float downstream.Enjoy the ride!!"}, {"id": 6, "text": "Greasing the wheels again, Netflix has another great tragedy built purely around product placement. Simple movie for those who choose not the complexity's of life."}, {"id": 7, "text": "It was a funny story with fun loveable characters. It's absolutely ridiculous, but I loved every moment. I couldn't stop laughing."}, {"id": 8, "text": "If you like one of the actors you can make it through this movie. If you don't I wouldn't bother there's no substance and just very idiotic."}, {"id": 9, "text": "OK. Where do I start. The lawyer about the best actor in the movie. Nope scratch that the lawyer the girl he falls in love with and noodle are the only characters worth paying attention to. The bo character. He makes you not like the movie all the way through. From the way that he carries himself to all his responses to life in general even on a comedic scale suck. If you really don't have anything to do go ahead and lose life and time on this movie. Everything that you think this movie can be it completely runs itself over like a rat in a rat wheel."}, {"id": 10, "text": "The movie was funny, entertaining, just wonderful! It was so dumb and stupid but it made me laugh. Maybe not that appropriate but it was worth a good laugh! Would most definitely recommend. If you want a laugh I would totally recommend this movie!"}, {"id": 11, "text": "Hollywood must be desperate to give this guy a lead role. He is definitely not funny, and his voice is annoying. This movie is poorly written, characters are unlikeable and the amount of cursing is a little over the top.Do yourself a favor and skip this film. Unless you are bored or looking for background noise."}, {"id": 12, "text": "This movie is bad, really bad. So bad it's good. Watch it with no expectations and you'll be fine. The plot is ridiculous, and calling the plot 'a plot' is a stretch. The acting is petty sad, the cinematography is pretty bad, the soundtrack doesn't work and the dialogue is juvenile. But there are some jokes that work. Yeah, it's stupid and cliche, but it beats the snot out of watching election coverage."}, {"id": 13, "text": "I feel like this whole movie took place real time on 1 backlot. Everything moved so fast. It's like a fever dream mixed with a racing movie."}, {"id": 14, "text": "My brain hurts. Is this the new baby shark da doo torture song but in film version? Jeeeeeezzzzzuuusssss! There's been some sht films in 2020."}, {"id": 15, "text": "And more of a future too, for all the actors and the director. No Robert Pattison, (Thank God) and it was nice that all the dirt discombobulated in the right directions. Seriously looking forward to the next effort from this gang. Did I mention the cohesion."}, {"id": 16, "text": "I'm a big Lucas Oil Motor Cross fan and love and support all things related, so I was excited to learn they make movies. HUGELY DISAPPOINTING. Wow, hire people with talent please, where did you find these movies makers, bargain bin at a gas station? Embarrassing. Cant believe I wasted my time with all these movies."}, {"id": 17, "text": "Bo Knows!! What does anyone expect with a movie like this? I got what I expected and loved it! Bring me more Matt Jones! Bring me more Breaking Bad humor. Loved this!"}, {"id": 18, "text": "Yes, it's dumb. It's supposed to be. I really don't think they were going for groundbreaking esoteric cinematic masterpiece. It's just dumb and funny. Movies are made so that people who are capable of suspending disbelief can be immersed in a story without needing to read it. This is not art. It's just silly. And yeah, it feels like 1:46 of Lucas Oil Ads, but there's a pretty funny little cameo in there if you watch for it. The bloopers during the credits are worth watching and everybody played their parts well."}, {"id": 19, "text": "Its light-hearted. Its cheesy. Its just....fun. its a great way to spend an hour and a half. Its slapstick humor, and my kids loved it."}, {"id": 20, "text": "I never laughed as much since Happy Gilmore Perfectly funny movie. A great watch!"}, {"id": 21, "text": "A stupid comedy that is funny and feel good. Recon this is what the producers and writers were going for! Loved the actors and actresses, casting was spot on IMO. Loved it"}, {"id": 22, "text": "Looking to check your brain at the door and laugh your butt off during 2020? This silly movie is the cure. Sure it's a pretty stupid plot but that's the point. If your a fan of Talladega Nights, Dumb and Dumber, Zoolander, Hot Rod or even Borat this is right up your alley.It's exactly the stupid, silly fun I needed right now."}, {"id": 23, "text": "Dumb but enjoyable movie. Matt Jones plays the part perfectly"}, {"id": 24, "text": "I thought it was funny! I had never heard of it but came across it on Netflix. I enjoy Matt Jones in other things so I thought I would give it a try. Wasn't disappointed!"}, {"id": 25, "text": "If your in the pick apart mood to disect everything in a movie and or in a serious mood, this isn't for you. If you want a feel good laugh out loud movie thats fun to watch from start to finish, you will enjoy it. I love comedies, my wife thinks they mostly corny but she loved it. We both did!"}, {"id": 26, "text": "This movie was so good I watched it twice in a row!!! It's so funny. Love all the characters. So entertaining and the perfect movie to make you laugh in 2020!"}, {"id": 27, "text": "Looking for help with the catchy whistling background song 3:02 minutes into the movie until 5:35 minutes in with a break in between! Unless it was just a jingle created. Thanks!"}, {"id": 28, "text": "Decent watch at best, probably won't watch again, and can't recommend people that watch this unless they're just into racing and have run out of movies to watch involving racing.I have such mixed feelings about this movie. I honestly want to like it, having a sweet bundle of reconnection stories at its core, just presented in such an awful manner. I'm not saying that the southern, poor, redneck angle was a bad choice, but it could have been done in a more positive light. Having it be an idiot-redneck comedy was more painful than funny when it came down to it.The cast was actually pretty well selected, everyone hitting their marks, but I'm still not over Noureen DeWulf not being Jasmine, and to she her and the rest of the cast in such narrow roles, odd roles just felt very forced. Enough so that the movie brings it to your attention as part of the intended humor, but it is more distracting: making me think more about the movie when I was actually trying to turn my brain off and enough the movie.The story, the cast, the production, the general comedy are all fine, but for whatever reason, most of it just doesn't land."}, {"id": 29, "text": "If anything, Wheels of Fortune lands in the stupid funny category that also shelters Talladega Nights, Hot Rod, Jackass and Joe Dirt. By no means would it ever be a masterpiece but it's the kind of thing you put on when you're either stoned/hungover or really, really bored and don't want to focus on anything substantial. Personally, I had a different reason but still.Bo Jackson is a Tennessee-born and bred loser. Ever since he gave up his chance at winning a race as a kid, everything for him is a loss. As an adult, Bo and his best friend, known only as Noodle, are mechanics for a jerkass racer. But, unbeknownst to the duo, the very wealthy Phineus Davis has died and his will reveals that he has an illegitimate son. You guessed it, it's Bo. And so his unbearably mean-spirited daughter Chrissy, clueless son Oswald and their lawyer Jason are off to find Bo, whose inheritance relies solely on winning a series of sporting events.It hits every cliche note in the head but the chemistry between the protagonists, as well as some committed performances from its C-list cast. Matt Jones seems like he and Danny McBride should do a movie together. Jeff Fahey is one of the film's few saving graces. Of course, the female character with the most screentime, Bo's crush and Noodle's stepmother (it makes as little sense as the movie overall does) Mandy, is possibly the best of the leads. I watched it once to find myself among the extras. I did (look for the guy who reacts to Bo crashing a moped) and I don't need to watch it again."}, {"id": 30, "text": "He was easily the worst in breaking bad and Jesse and Pete were phenomenal partners and his exercise comedy was the pits this guy is just poor. His voice is grating, his look is off and he has no comic timing, acting ability or anything to make me understand why he gets cast unless he writes it.This is unfunny, slow and has no real redeeming features other than calling a specific part of America stupid beyond function, the rest of the cast were ok I guess, the plot and situations were awful, the reveal of the dad was idiotic and the feel good factor none existent , the stupid American does good angle might be funny over there but it's dead at this point, this film had an ok premise that could've maybe worked but it was just poor from minute one.I love daft humour, I saw the jokes coming, they just weren't funny or well delivered or clever.Boring and not interesting"}, {"id": 31, "text": "The reviews that i read, but as the humble man i am, i took wrong. this is a funny film with an unbelievable consistent comedy, with a fun moment in nearly every scene and take, a cast well chosen, and with a lawyer caracter looking like harrison ford .so if youre high on petrol, breathing exhaust, love to remove callipers, and wears a mullet styled with oil and grease, then take part in this hilarious movie sideshow upon some of the most american lifestyles you wont find anywhere else on this olanet, where fast is good furious is good big is gooc and the stakes/steaks are bigger than you can dream of. it a well made ironic comedydrama like smokey and the bandit and a little bit of her bie in the bends, and a legendary bagger vance doing the enginewhispering to fine tune the horsepowers.so if your not too old and grumpier than me, i can guaratee a good laugh from this one. wheels of fortune may enrich your life and sole. a big recommend"}], "reviews_amount": 32}