{"name": "Relic", "titleId": "tt09072352", "reviews": [{"id": 0, "text": "The Babadook (2014) had an underlining meaning of a grieving single mother's struggle in raising a child in a ruthless society, all told through a horror genre. RELIC reveals the agony of dementia in a dark and twisted atmospheric visual and audio assault of the senses in a nightmarish tone.Kay visits her neglected mother, Edna, who has gone missing. Kay's daughter, Sam, tags along and they are greeted with an old large home, perfect for a haunting. Edna's home has a life of its own, as seen through effective dark visuals and eerie sounds that mother and daughter encounter. They also notice hints of Edna's forgetfulness with post-it note reminders around the home.A search begins for Edna, who eventually appears after a few days, just like coming out of a stint in the prison of dementia. Edna cannot recall her whereabouts, so mother and daughter quietly put it down to the beginning of Edna's mental disintegration.This sets the motion of conflict between mother and daughter with issues of caring and the dreaded decision making of nursing homes. Meanwhile, Edna's mental state deteriorates as she eats away at the memories of photos and buries a photo album in the forest. Just like her memories being buried by the black muck that is growing through her body.Edna's granddaughter is confronted by the horrors of the onset of her grandmother's dementia. Confused and frustrated she investigates the dark hole of the disease and finds herself trapped in a horrid maze within the nightmare realm of the home. In actual fact, Sam has fallen into the mind of her grandmother's dementia, experiencing the state of confusion and horror of the dreaded disease while fighting through scattered dead memories boxed up in the thin corridors of memories.Kay has been observing Edna's onset of dementia in a silent stupor. Eventually she is forced to act in order to not only save her daughter, but Edna from self-harming. Mother and daughter manage to fight through the confronting maze of dementia, only to see Edna succumb to it and become an unrecognisable empty shell, similar to a monster. Kay is unable to walk away from it and accepts the outcome of Edna's now full-blown dementia.Sam does not recognise her grandmother anymore, as is the effect of the disease. But what Sam discovers is the dark murky stain that was growing on her grandmother's body has now appeared on her mother, stating that this disease is hereditary, which is the real horror to this tale!RELIC is a journey through the mindset of dementia, not only for the victim but for the loved ones coming to terms with it. All this delivered in a highly intelligent and subliminal work of perfect filmmaking."}, {"id": 1, "text": "Another one of these films where most reviews here say a lot more about the reviewer than the film.This is quite an intelligent debut. Not a masterpiece, but obviously not the worst movie ever or incredibly boringIt's just a bit more original than the average Blumhouse blueprinted copycat."}, {"id": 2, "text": "The 4 out of 10 stars is generous. The acting was great, that's it. Let me save you some trouble here. The whole movie is a metaphor for Alzheimers. I give one star because I can connect in that I had a grandmother with Alzheimer's, and it was an accurate protrayl, but my grandmother was far less boring. All the questions they ask have very vague answers, and I don't think many people could guess the answers to them. I could list 3 somewhat spooky things that happen, but why they happened? I don't know, either black mold or Alzheimer's, maybe both. This movie isn't scary, it isn't clever, and it draaaagged. An hour and a half long movie. 5 minutes of blank staring and 3 minutes of dream sequences that have little point. This movie makes me want to have Alzheimer's so I can forget I watched it."}, {"id": 3, "text": "It's so rare that anyone uses the horror genre to tell you something you needed to know about life. I'm absolutely overwhelmed at how elegantly this film horrified me, how totally it drew me in, and the *work* being done by the cast.A really beautiful, touching, absolutely terrifying movie, that hit me across nearly every note. My gosh. Worth a watch."}, {"id": 4, "text": "Honestly couldn't see half of what was going on. Greatly overrated, which is sad because I love a good Australian movie."}, {"id": 5, "text": "Apparently this one is not for everyone but I found it terrifying. This descent into dementia is both troubling and shocking. It portrays the overtaking of this disorienting madness creeping on the victim leaving them into a state of decrepitude and their powerless loved ones left to watch. It's a different kind of horror, one that suggests how a disease slowly seeps and infects everything until the inevitable end. Everything familiar gets corrupted by an overpowering darkness that parasites the afflicted until they're unrecognizable, a shadow of their former selves. It rots all identifiable elements of who they were until all is left is a bare core. A vessel submerged by a lifetime accumulation of stuff, a demented mess hunted by the only thing that remains, the sum of all its fears. It's scary because it's inevitable and the poisoned gift transcends time like a curse raking havoc and destruction throughout generations."}, {"id": 6, "text": "I'm literally going through this with a family member and it really made me think. Is this what she goes through everyday? It's scary. More of a thriller than a horror movie, but I liked it. For all the people giving it a crappy rating, for not explaining, it was explained, it was just over your head. They stepped into what she was seeing. Every rotted piece, was another memory forgotten. The walls closing in, in her mind. The way she saw her home, now. Symbolism, people, symbolism. I wouldn't say, it was a 10/10, but it did shine a light on the ugliness that waits for some of us."}, {"id": 7, "text": "Here we go again....Another attempt of a slow burn horror but the only thing that burnt out was my patience. I mean it's one thing if after all the build up made suspense we would actually get some genuine scares but here it is just not there. Nothing, Nada, not a single moment of fear.At the end of the day the movie can look good, have fine actors and possess a decent story but it would be nothing without the actually horror which turns out to be the title of the genre.Avoid."}, {"id": 8, "text": "Slow and boring right up until the end is all i can say about this movie.Almost nothing happens, and even in the end we are left wondering what happen, and why....."}, {"id": 9, "text": "A young director clearly inspired by the great Aronofsky writes and directs a masterpiece about death and loss using craftily symbolisms.The movie is not for everybody to comprehend and clearly has an average of 6/10 cause most people expecting to see a cliche haunted house story."}, {"id": 10, "text": "This is well done and I can't say I have seen anything like it. The actors are very good and the script is creative and well timed. It's a fairly slow burn but not enough to lose your attention. I love a good horror but this one hit too close to home. I couldn't handle it. That's never happened before. When I was a teenager, my best friend and I, used to get rocked and go see movies like The Exorcist. So, when I say I couldn't handle THIS movie, that says something. If you love a good horror and you are the target audience, this one will give you nightmares. If you're not the target audience, it probably won't phase you. For instance, if you are afraid of flying, then movies about aircraft accidents will effect you. If you are not afraid of flying you can mentally step back and not get nervous watching a movie about airplane accidents. It's like that. If something like this has even remotely touched your life, this movie will rattle your cage big time."}, {"id": 11, "text": "Why do these awful artsy fartsy contrived dramas keep being passed as horror when they're absolutely not. Are critics just that clueless and deluded? This plays by the numbers like so many other critically hailed horror films of the last decade. Apparently to get great reviews you can just follow the same dry uninspired formula of symmetrical camerawork and supposed dread inducing overacting. Then add a deep metaphorical message that is just as effective as an actual visual monster because  what you can't see is scarier. No that isn't true horror. It's drama. It's just such a miserably lazy film even though Mortimer salvages it from being truly terrible."}, {"id": 12, "text": "A solid debut for Natalie James. This is a slow burn horror that builds with each minute, and by the third act is full blown terror. All of the acting was surprisingly phenomenal, extremely impressed by Bella Heathcote. The third act is a fun ride, claustrophobic and even a little gore. Give it a shot, you wont be disappointed."}, {"id": 13, "text": "Then the plot takes turn into an uninteresting inexplainable mess. If you're looking for horror movies without context you might like this"}, {"id": 14, "text": "...and yet so boring and totally pointless!Classed as an horror but there is nothing horrific apart from a woman suffering from alzheimer's and yet gives absolutely no insight in to that condition (last 10 minutes excluded when the film decides ohhh lets try to be an horror and yet still fails miserably - I get this is supposed to be an analogy of the former person but it doesn't work)Badly lit throughout, terrible dialogue, some off the cuff examples of losing your memory, obscure weird scenes that never connect up or seem to even have any relevance and never touched on again...the list goes onIf you want to see a film about alzheimer's then watch Still Alice - a real horror film without all the pretentiousness of this one"}, {"id": 15, "text": "Disappointed in the plot despite a great cast. No real riveting storyline and a waste of time. Generally love a good Australian thriller but this did not live up to expectations"}, {"id": 16, "text": "I give this film 8/10 for the atmosphere and the fact that although not a classic horror/no jump scares the atmosphere is so creepy and the ending so unsettling it makes for a great watching experience. I still have a few unanswered questions but so far this is the best I've seen this year"}, {"id": 17, "text": "Just a whole film of nothingness....the annoyance of every shot in complete darkness makes it unwatchable..."}, {"id": 18, "text": "... although I don't think it's meant to be that way. Could also be called shoegaze horror, not because of any need to look away but you'll probably get more reward from examining what you're wearing on your feet. There could be a growing old and senile metaphor in there somewhere but probably only in relation to the people who dreamt this nonsense up."}, {"id": 19, "text": "Greetings again from the darkness. Anyone who has a friend or relative afflicted with dementia knows it's often like living in a real life horror film. It's frustrating and claustrophobic and guilt-inducing and above all, frightening. The first feature film from director Natalie Erika James deals with dementia, amongst other topics, in the guise of a horror film. Is it a haunted house movie? Is it a demonic presence movie? Well, yes to both. The script from Ms. James and Christian White blends multiple familiar aspects of horror films into something that ends up quite original.Ends up is the key, because the first two-thirds of the story moves slower than a glacier in the middle of winter. Don't get me wrong, the film looks great - the house and the atmosphere are ultra-creepy. It's just that almost nothing happens during that span, and that's an eternity for set up. Kay (Emily Mortimer) receives a call that a neighbor hasn't seen her mother in a while. Kay and her 20ish daughter Sam (Bella Heathcote, PRIDE AND PREJUDICE AND ZOMBIES, 2016) take the drive over the hills and through the woods to grandmother's house. Their initial measured walk-thru of the house tells them (and us) much. Post-it notes are stuck everywhere, including one that says Don't follow it. Spoiled fruit on the counter, a favorite chair moved, and food for a pet long ago passed, are all indicators that something is off. If that's not enough, the house that grandma is missing from has mold on the walls and ceiling, and strange locks on doors.After an unsuccessful search party through the nearby woods, Grandma Edna (Robyn Nevin) reappears with no recollection of where she's been. Of course, this doesn't really improve things for anyone. We sense that workaholic Kay and her mother have never really been close, and the same can be said for Kay and Sam. Generational disconnect is on display. And poor Edna has lost her husband, her pet dog, and most of her essence ... except for the few moments when she snaps back to lucidity.Dread and impending doom dominate every scene for the first hour. Kay has dreams of an old cabin from her past, and Edna has an unexplained bruise on her chest. The stained glass window on the front door is a key, and the sounds coming from the walls are unable to be tracked down. As disoriented as Edna is, the house itself has that impact on us and Sam. Is it the house that's haunted, or the characters?The cinematography from Charlie Sarroff plays well off the stillness and unknown, and the sound design and music (Brian Reitzell) work hand-in-hand in establishing the creepy atmosphere. The three actresses are superb, and I especially enjoyed Ms. Nevin and her piercing eyes, as she is known mostly for her live theatre work (and also as Councillor Dillard in The Matrix movies). For her first feature, Ms. James has delivered a high-concept Australian horror/suspense film with a very original (and weird) ending. Others may be a bit higher on the film, but we likely all agree that Ms. James is an intriguing filmmaker."}, {"id": 20, "text": "Granma gets lost in the woods. Daughter looks for her. Granma comes back after 3 days. Absolutely nothing happenes next 2 weeks. Granddaughter drops LSD and start tripping in the house. Granma attacks everyone with a knife but gets her ass kicked instead. Daughter forgets about the bad LSD trip instantly and acts like nothing happened. Granma turns into an alien mummy. Everybody fall asleep because it was a busy day. Still better than the Last Jedi."}, {"id": 21, "text": "The movie is good in the sense that it makes you feel how does it to have a family member who has dementia illness, alzheimer.The movie depicts the feelings of being lost, and helplessness in the face of an illness that can turn a person into something else, to a different person. And it also teaches you to deal with it, you need to embrace it.Good visual scenes, and sound effects. Normally, I don't like movies like this but I liked this one."}, {"id": 22, "text": "The story in this movie is allegory to mental disease such as dementia or Alzheimer's. Dealing with a family member that transforms from a person you knew your whole life into a creature that doesn't remember its own name IS a horror in real life. So although idea of this movie is not bad, the execution could be better. I agree with others: it is too slow and dull. And, no, it is not really a horror flick, i am sure many horror fans will agree. I still recommend it for home viewing. Another spoiler: the fact that they show three generations of women in the same family kind of suggest that disease is hereditary (like Alzheimer's), that is why in the end the daughter has a black spot too, meaning it will happen to her like it did to her parents."}, {"id": 23, "text": "Any negative reviews come from people who do not have a real appreciation for cinema. This movie was unique and thought-provoking. I wanted to start it again as soon as it ended. If you liked The Babadook, this is for you."}, {"id": 24, "text": "Go make a horror movie, gurl. Don't use any lights on set, and make pointless metaphors about old age and neglect. That'll surely scare people! And yes, Don't reveal what's the big mystery because it's deep, just like The Babadook. Utter Trash. Thankfully, IMDb ratings/reviews will save us from paid/clueless Metascore."}, {"id": 25, "text": "I am so tired of horror movies where the characters move to a new house and walk in dark corridors for 80 minutes. What's that sound? Oh it's a washing machine. It doesn't matter. What's that sound? Oh it's just grandma being a weirdo. Go to bed grandma. What's that-- It's all a meaningless barrage of random nonsense. We need the first 80 minutes of the movie to get to the actual reason why this movie was made - the pretentious last 10 minutes. Just release that allegory for dementia/depression as a stand alone short film and don't waste my time with filler."}, {"id": 26, "text": "It's a metaphor for dementia, but as a die-hard Horror fan, it's missing what I crave: unsettling atmosphere, chilling imagery, well-executed scares (if necessary to story and style), and a true sense of dread. I never felt any sense of peril and I found myself not really caring about the characters, despite how well-acted they are. If strong female performances is what you crave, go for it. But for Horror fans, I'd say skip it."}, {"id": 27, "text": "The trailer is a masterpiece though.But seriously, spend the 90 minutes this turkey lasts, doing something more fun, like, watch paint dry."}, {"id": 28, "text": "Horrible movie. No plot, slow. waste of time and money"}, {"id": 29, "text": "Making movies for today's horror audience is a tricky proposition, but Relic impressed me with it's commitment to telling an emotional story that resonates with issues which you may recognise from our lives outside of the fantasy-horror tropes. The movie is a slow burn which devotes the majority of its time to establishing the central 3 characters (impressive performances), who make up 3 generations of women from an old family in an old house in rural Victoria. If you enjoy thoughtful film-making with a less is more approach, you'll be rewarded by a masterfully disturbing and shocking third act climax with an emotional kick that will give you closure but leave you thinking. It should be noted though, just the like characters in Relic, you'll have to give attention to the people in front of you to reap the rewards."}, {"id": 30, "text": "I just saw this at Sundance 2020 world premiere I didn't realize I was sitting behind the filmmaker! it was truly great! very great deep scary compassionate true blue #trueblueep #hummingbullrising"}, {"id": 31, "text": "Hey Natalie Erika James (director), learn how to LIGHT your scenes. I gave up bothering trying to see what you were trying to show when something supposedly creepy was happening.What was truly insufferable was your actors WALKING AT A SNAILS PACE in every scene. Its been done to death, does not create any tension and you just abused it to stretch out the films running time. Not impressed. Sick to death of lame characters walking in slow mo. Hurry the F up and get on with it.A 50 year old and 20 something year old are over powered by an 80 year old, and then run terrified from her. Seriously? LOL. I was itching for the old bag to die, I really was. I could not stomach her.Constant mum...mum...mum....mum....mum? dialogue then playing cat and mouse. It truly gets BORING watching the daughter and grand daughter walk in slow mo after the old bag over and over and over.This movie is a 'The Babadook wannabe (which wasn't that great either), using pretentious metaphors for depression and Alzheimers. Yawn. Also, the tilting camera shot of the hallway has been done to death and SUCKS.The dream sequences were nonsensical and the grannys dementia materialized as an entity/whatever in the house was never fully utilized in my humble opinion.The ending? Shes a shell of her former self I take it and her sanity dead in the water. Everything that was her has gone, leaving a corpse. Again, made no sense.Also, couldn't stand Bella Heathcote (Sam). Typical millennial bore with zero charisma. Emily Mortimer (Kay) phones in her performance.An utter dog turd from start to finish. Have a nice day. Please don't make any more movies, thanks."}, {"id": 32, "text": "Waste (or wastes) are unwanted or unusable materials. Waste is any substance which is discarded after primary use, or is worthless, defective and of no use. A by-product by contrast is a joint product of relatively minor economic value. A waste product may become a by-product, joint product or resource through an invention that raises a waste product's value above zero.Examples include municipal solid waste (household trash/refuse), hazardous waste, wastewater (such as sewage, which contains bodily wastes (feces and urine) and surface runoff), radioactive waste, and others."}, {"id": 33, "text": "Definitely one of the better slow burn horror flicks out there. The cast in this one did amazing."}, {"id": 34, "text": "Very slow and boring. Long stares before talking. I am also sick of modern film making where the whole screen is filled with just a face and you have to guess what's actually happening. AND what the hell was that at the end? What has this to do with Alzheimer's?"}, {"id": 35, "text": "The trailer seemed great. I like horror films but this one was confusing and I kept waiting to get some sort of explanation on what is going on but nothing. Waste of time and the ending was confirmation that I wasted over an hour of my time."}, {"id": 36, "text": "Not my cup of movie. It put a sinister spin on dementia. Anyone that has delt with that subject would not find this movie to their liking."}, {"id": 37, "text": "An absolute waste of time, dull and without any meaning to it."}, {"id": 38, "text": "Despite some graphic self-mutilation, this effort is a waste of everything: their time, your time, money, etc. It's pacing is so slow I fell asleep twice. This is one of those films you have to turn your brain off otherwise you're repeatedly yelling at them Why are you doing that?! Such stories have no basis in the reality of how people would behave in such contrived situations. Skip."}, {"id": 39, "text": "This movie is another great example of why i love slow burns. People say it's to slow and boring, but i think it does it well. The first 2 thirds of the movie take some time and tell the story with a lot of creepy scenes sprinkled in, and the final 30 minutes go all out, and i love that. The last few minutes where kay is peeling off edna's skin is a great metaphor for how dementia slowly turns the person you love into someone that barely remembers you. It made me cry thinking about it. In real life it really is like the skin of that person is peeling off, and they've turned into a different person that can barely remember their family and live on their own. This movie is very good at being scary, and very emotional. 9/10 for sure"}, {"id": 40, "text": "Wanted to support an Ozzie movie but was so dark in terms of lighting. Shouldn't have to adjust screen brightness, and it was fairly slow"}, {"id": 41, "text": "Boring + Moronic.I'm being generous. This is so tedious, so uninspired and so subcultural it has pride of place in a Roman vomitorium."}, {"id": 42, "text": "So apparently this movie made me cry:( but honestly the story goes into the depths of the human mind. It's so much more than it meets the eye."}, {"id": 43, "text": "Strong performances by three brilliant actors, amazing screenplay, cinematography and directing. Hard to believe and exciting that this is Natalie Erika James' debut feature. I was on the edge of my seat the whole way through and literally bit off my nails because I was so nervous. I haven't seen a movie like this that kept me thinking about it for days afterwards in a long time. An important story about ageing and dementia and I hope all Australians will get behind it to support home-grown local talent. I can't wait to watch it again and am excited to see how it is received by audiences as it is released around the world."}, {"id": 44, "text": "I'm an Aussie, I like to supoort Australian films, but I couldn't watch it all.I found myself picking up my phone to check the time, and notifications. It's a slow burn. Unfortunately I found it it quite boring and stopped watching.A lot of effort goes into making a movie like this, and so it's sad to say this."}, {"id": 45, "text": "And what was that thang in the bed at the end and no explanation or closure. Really?"}, {"id": 46, "text": "Why are people smoking these days? I want some!!! I just finish watching into the void a few days ago and the rating is above 6.5, I just saw it and went down to 5.9/10 but I still think is 4.0/10. Relic is classified as drama/horror but for me is more drama/mystery, why they do this? then people like me get upset about spending time for a movie that is what not appear and gave it less rating of what the movie deserves. Relic is pretty much well directed and the acting is decent, but for the first hour just drag, and the rest of the time is kind good but still, a movie is always about the beginning, middle, and ending. I think this movie is 4.5/10 but my wife told me to give it a 2.0/10. HEY, YOU HAVE TO LISTEN TO YOU WIFE BECAUSE IF YOU DON'T YOU KNOW WHAT HAPPEN :/"}, {"id": 47, "text": "Patience is needed. Like most Australian made movies, it burns slow and shots are framed similarly. There are long silences between dialogues and it seems like the movie is about indulging on the director's attempt to take all the artistic shots he can squeeze in. It forgets that it would have been better if the director could pull away from using this movie as a vehicle for and stick to storytelling. The audience would appreciate this approach more. It's a dud."}, {"id": 48, "text": "Absolutely boring!!!!Totally waste of time, definitely one of the worst I've ever seen!"}, {"id": 49, "text": "Firstly - I was so frustrated and annoyed by the end of this movie that I actually created an IMDB account to leave feedback -- I feel so robbed of time I'll never get back!So the biggest issue is actually the way this film was shot - the director has tried to evoke a certain tone - I'm not sure if they were going for Lynch overtones but the fact that nearly every single bloody shot was in darkness - oftentimes you couldn't even SEE the actor's faces/reactions at all as they were enshrouded in so much darkness, it was ridiculous. My husband and I probably spent the best part of 30 minutes!! trying to improve the brightness, contrast, color - anything we could to make the movie more watchable so we could tell what the hell was going on! but to no avail. We went back and watched the trailer and that had clearly been edited as that was entirely watchable. We ended up trying it on two different screens but we couldn't significantly improve the display.So in a nutshell, the director truly sacrificed the film (and her actors' performances - which overall, were fairly solid) in order to present a nearly unwatchable film purely because of how dark it was. There were moments we presumed were meant to be scary - but we couldn't tell - we couldn't see a bloody thing! Or providing us with visual information -- i.e. when Nan turned around in the kitchen and we had the camera angle on her feet. We could not discern if her feet were dirty or bloody etc... the lighting made it impossible! This happened so many times throughout the film it rendered the entire thing utterly impossible to enjoy (or follow properly).And by the end we still had no clue as to what had happened. Was this a haunting as the log line had hinted at? If so, it did not appear so. Was Nan possessed? We didn't think so. Only AFTER the film finished and I googled did I read that essentially the house was a manifestation of the old lady's dementia. That said, it didn't make sense as to why the other now has been afflicted with the same 'rot' (per the end of the film) and WTF dear ol' Nan turned into at the end.We couldn't tell what Kay was doing with her mother on the bed - was she trying to destroy the creature, remove layers of rotten flesh -- we couldn't see it, only hear it and see dark outlines.And frankly, in the actions of Nan in the third act, when her increased acts of dementia had escalated, it made absolutely NO sense that her daughter wouldn't at least pick up the phone and appeal for medical intervention or at the very least, a medical evaluation.Oh, this movie was so dreadful on so many levels. My only positive comment is that Emily Mortimer transcended the material she was given with her strong performance.But overall, just woeful.Also, I live close to Ballarat so know Creswick quite well... it was a cute homage to a town not really known that well outside of the Western Grampian region, even if the house (and the area, looked nothing like Creswick).I don't mean to sound so negative but I was soooo looking forward to getting behind this film and supporting it, especially having heard so much hype and of course, hearing how well it was received on the festival circuit.TBH, I feel the lighting hurt the movie more than even the poor script. IF we could have actually SEEN what was going on - including and importantly, key moments where the audience needs to know or understand something via a reveal, or an actor's visual response - it might have made for a better film.Hoping the director's next work allows their DP to light the scenes properly."}, {"id": 50, "text": "The movie has potential but in the end does not deliver. Although I enjoyed the dark brooding atmosphere of it, I felt that the movie jerked the audience around too much. It seemed more focused on being metaphorical and making some kind of social statement that in making a real movie with an understandable plot."}, {"id": 51, "text": "I'll never get back the time &amp; money wasted on this garbage. So slow, so boring. The end."}, {"id": 52, "text": "While the movie is slow at the start, it gets crazier and disturbing scene by scene, but I did feel like the movie was weak towards the end giving one of those 'I kinda get it' moments in horror movies. Overall good performances and great directing."}, {"id": 53, "text": "If I had known the director was trying to make the movie a metaphor for dementia then I would have definitely avoided it! Any movie that the director wants to create as an artsy metaphor is guaranteed to be total poop, and this is no exception.It is so slow and so dull, that everyone who was watching kept checking their phones. The only decent part in the movie was about 3 minutes of a little action near the end and the make special effects were pretty good.Overall, definitely not worth watching! However if you can't sleep put this on and it will put you right out from incredible boredom."}, {"id": 54, "text": "Not that scary... Bored andnothing is there..i saw a trailer and I thought would be good but it's waste of time"}, {"id": 55, "text": "It starts off with a promising eerie atmospheric mood which ultimately leads no where. Like the movie was about 1 hour 29 mins long and literally nothing happens until the last 10 minutes and even then nothing really happens.I. Was. So. Bored.I kept waiting for the scary horrific ending. But all i got was a terribly boring one.If you want to watch slow eerie movies The Witch or It Follows were much better movies. This one was a big miss for me.I really wanted to like this. The trailer also looked promising. Oh well. Next!!!"}, {"id": 56, "text": "I wait all thé movie to realy underatand but nothing good come dont wasted times 😡👎🏿"}, {"id": 57, "text": "No where close to what some professional critics praising it for. Trying to be clever when in fact it's just a metaphor of a film that is not scary at all and in fact laughable at times. The fact that they used old people's health and mental state as a fearful topic is distasteful as well. Don't waste your time on this one."}, {"id": 58, "text": "Mum?mum...Mum?!Mum!MUM!!!!!! Pretty boring stuff..."}, {"id": 59, "text": "The movie starts out with a long, very long introduction to what leads to nothing. It's confusing, it's very boring and it took me to 10 different places at once. Expect a lot of mom and expect girls running into trouble voluntarily. I paid to rent this movie because of the reviews and hope to enjoy it as the rating said. Just leads me to think that those who gave it a high score are simply family and friends of the cast and production team. So disappointed. I want my 2 hours back!!"}, {"id": 60, "text": "So so slow ... the whole time. Very boring and no story line at all. And at the end the scary thing is water damage to the house and walls. I'm so sorry that wasted my time and that of my boyfriend to watch this stupid movie. And the trailer is far more interesting than the movie itself. Very misleading .... doth worth the time."}, {"id": 61, "text": "This film start with a bathtub been flooded, a woman only show by her rear side, and another woman Kay searching for her mother Edna scene! As turnout, this film is about Kay and her daughter Sam need to rescue Edna from the possession of a ghost! Entire film full of boring conversation, and annoying overuse scene! Such as, overuse of the searching things scene, overuse of the blackout scene, overuse of the dreaming scene, overuse of the slow motion long angle scene, overuse of the song playing at the background scene, and overuse of the calling for Edna scene! Make the film unwatchable! Barely scary scene is, Kay tear off Edna's skin at the end! At the end, Edna been take down! Kay tear off Edna's skin! Kay, and Sam sleep with Edna on the bed! We know that Kay also been possess at the very end! That's it! Wasting time to watch!"}, {"id": 62, "text": "The story is very slow, and it is not so scary until the very end. The ending is bizarre and I don't understand it."}, {"id": 63, "text": "Well I will say it is not one of the best but it still was well worth watching, this will make you think about family and how you should stick together. Not for every one but I recommend it. James Welch Henderson, Arkansas. 11/24/2020"}, {"id": 64, "text": "As a horror movie this lacks a lot at best its a bit creepy, having said that if the intention of the movie maker was to highlight the devastating effects of dementia then its ok.I found the movie very slow going with a lot of loose ends and very little explanation of the strange rooms and black mould in the house."}, {"id": 65, "text": "I feel like in a generous mood so I'll rate it with six stars but that's definitely the top end. I was entertained watching Relic because there's some mystery and it takes a while before you figure out what is going on. That said the outcome was a bit stupid and made me realize the plot wasn't really well thought of. The story didn't make much sense to me towards the end so it was a bit disappointing, but the acting wasn't bad. The small cast did a good job, the writer of the script a bit less."}, {"id": 66, "text": "This movie was pretty good all throughout. We did not find it boring in the least. Although I understood the message in the movie, the ending ruined it for us, It was kind of stupid and made no sense."}, {"id": 67, "text": "The atmosphere is really creepy and slow to be honest, and I love those elements in movies when they're executed well, which in this case they were. Great acting by the actresses too. 6 stars for these aspects.I got problem with the script though. What was the point of the young girl getting in that maze in the house? Did she entered the mind of the old lady? Did she experienced her dementia? I really didn't get the point of that scene. And I'm singling this scene out because it is a crucial scene in the movie that actually lost me at the end.Also what was the point of picturing dementia as making old people creepy charred evil demons? To me, none. It actually made me laugh.Nothing more than a thriller drama. Not even passable as a horror."}, {"id": 68, "text": "Didn't expect much, especially with the other reviews ranging from adoration to grumpy disappointments. I was bored so I decided to watch it. Maybe with no expectations it became good? It can be a bit slow for some but not really, it's not even 90 minutes long and it told enough in that time. I think I got chills one time but maybe it's just because my window was open and I haven't had dinner yet, or maybe not. Feels like there is a lot of backstory to this that isn't told, or maybe that's left for the viewers own imagination. Mine is great so I could enjoy it as it is. Maybe some need more specifics to enjoy a story. Overall I'd say good job at not being a bad horror movie."}, {"id": 69, "text": "Slow pace, nothing wrong with that, it it led me to somewhere. Good acting, good atmosphere, the movie had everything to be great, but slowly built up to nothing. No explanations in the end, I thought it was yet another case of humidity. Perhaps that's it, it all comes down to humidity, slowly building up until the actors, story, scenery and even the viewer is wrapped up in humidity. Let's build a mystery and confuse the audience in the last 20 minutes with nonsense, delusional and an unexplained ending, full of.... humidity. Perhaps this is scary for some, what scares me is that people are losing their minds for the past 15 years, with such ridiculous scripts, failing to delivery anything worth remembering."}, {"id": 70, "text": "I loved everything about this eerie slow burning horror movie. Right up to the end and after really your questioning everything. It's thrilling and scary and takes psychological to a new level. As I lover of the horror/thriller genre I truly hold this movie in high regard. It's original, thought provoking, and beautifully atmospheric."}, {"id": 71, "text": "It is just a 'mum!' script. They said Let's make a movie with mixing all horror movie cliches and that can not be understood easyly Attention! If you try to understand you will have a terrible nosebleed. I have given 4 for labor of actresses and crews."}, {"id": 72, "text": "So my problem with this film isn't the film itself. But the fact that this is labeled and marketed as a full blown horror movie, this is more of a family drama. This was on my watchlist for a little while. It was hyped as one of the best horror movies of the year!!! I'm thinking wow, just like they said about Hereditary. I saw that at the very beginning of the buzz and absolutely loved it. Critics were right about that movie! I thought this would be the next Hereditary with the familial and horror connections. But the horror elements were symbolic only. Which is fine for some but in my opinion, not enough to be classified as a full blown horror movie. I needed more direct horror and jump scares, story, etc. All of the actors are great! Love Emily Mortimer. Just not what I hoped for!"}, {"id": 73, "text": "Slow start and then a ridiculous ending! How does something that can attack you then become a mindless loving zombie thing? Stupid!"}, {"id": 74, "text": "I love drama-horror and this *almost* delivered. The movie is pretty creepy and the whole house thing was pretty cool. Unfortunately the ending is kinda meh."}, {"id": 75, "text": "Not a lot of dialogue.No jump scares.Good acting and cast.No idea what was going on. Something about dementia. And then the end was super weird with the alien thing. The only thing I got was dementia is genetic and the mother will get and you could say the daughter will get it to. Is the Film maker saying that dementia is born from mouldy walls?"}, {"id": 76, "text": "One of the must stupid movies ever seen..what is the meaning?? Just time waste"}, {"id": 77, "text": "I'm surprised that people are giving this film negative reviews. I read a review that read along the lines of 'I wish that I hadn't seen the last ten minutes' but, upon seeing the film, I realise that it is a compliment. This film brilliantly projects the realism and growing awareness of dementia. The faith in loved ones lost, the distrust, the anger and frustration; but most of all, the unconditional love that is thrust upon you, particularly during times of family turmoil. This film is riddled with metaphors and analogies of the disease dementia, plaguing even the most sound of minds to the point that the sane viwers doubt themselves, yet it is done in such a subtle methodology that you will be doubting your own sanity. A truly deep conveyance in film, beyond superficial recognition that I would undoubtedly recommend. 10/10 Jack"}, {"id": 78, "text": "I normally don't write reviews, but I had to on this one. Though it was shot well, it was super slow and ended with a WTH moment. I would have been better off playing online games. Not sure how movies like this keep getting funded???Don't waste your money or time!!"}, {"id": 79, "text": "Putting it plainly, just another 'demon in the dark' movie that starts off slow and works to a single 'scary' end scene."}, {"id": 80, "text": "It's definitely NOT a horror and after watching it I completely didn't get the meaning behind it! So it's based on Dementia... But the movie was aggravatingly slow! Finally towards the end something happens and then what the hell were the girls laying next to?? The previews are misleading and we were excited to watch this movie. So very disappointing."}, {"id": 81, "text": "The ultimate scene of this horror film recalls the ending to the highly influential feature film 'Under the Skin', in which it is revealed that Scarlett Johansson's character is merely wearing the visage of humanity, and is in fact a matte-skinned alien humanoid. Like Edna, the alien of Under the Skin reaches across a chasm in search of human connection - an effort that seems doomed. Though Under the Skin is not overtly a horror movie, its imagery has found its way into many successful works in the genre, such as Get Out and Stranger Things.I think the biggest challenge this film faces is the establishment of a solid thematic basis. This shaky foundation manifests in an obscure backstory of the apparent similar fate of the older generation of the family, and the confused metaphysics of the labyrinth, which feels tacked on to the third act rather than embedded in the total story. Is the house inside the mind of Edna, or is the house haunted? Ambiguity isn't a negative necessarily, but in films like 'The Shining' (a touchstone to recent so-called 'elevated horror' films like the influential 'Hereditary') the ambiguity is constructed in such a way that the viewer can provide multiple poetic interpretations. If the mystery is resolved (they literally broke out of the decaying haunted house of Edna's mind) then it shuts out the viewer's imagination.The image is rendered excessively dark at times, to the point that it becomes difficult to see what is happening. This may have been done to smooth over bumps in production however at times it forces the view to strain to comprehend the scene.I want the Australian film and TV industry to generate excellent genre films, because industry is founded on such work. I fear that many will come to this film hoping for a scare and feel baited by this film that can be successfully marketed as one thing while being another. Yes, horror can be profitable, and that is because it is founded on that dedicated part of the audience who like to be put in a state of fear and dread, who willingly suspend their disbelief in a supernatural scenario that holds meaning. Stories can mean things, but not when they are overt: 'we inherit the relics of the older generation, whether we like to or not'. If the audience can walk out of the experience and quickly do the math in their head that 'the the real monster was the dementia' then what you have is a personal essay, not a story.Australian filmmakers have been coached into embedding signposted cultural virtue into their films in order that government bodies can make a moral argument for film financing, rather than a financial one. But if we are going to begin to contribute to the global streaming market, we must refocus on the primacy of entertainment and put the audience first."}, {"id": 82, "text": "This movie obviously has a deeper meaning. But my god... it was sooooo boring! I kept waiting and waiting for anything remotely horrifying to happen (aside from mental illness), but to no avail. I am extremely angry that I spent 7 dollars to rent this. How this movie got 92% fresh on rotten tomatoes astounds me."}, {"id": 83, "text": "I think I have watched in ten years, only one really decent Aussie film. Relic was slow, boring and could have been good if the characters were just written better and the story was more substantive. In my opinion the demented mother at times were the best parts of the film. Other than that, this was just another poorly executed Aussie film. When will they ever learn ."}, {"id": 84, "text": "I found this movie very unique. Its visual portrayal of dementia was both terrifying and heartbreaking. The acting was excellent, and I found it emotionally convincing. Not necessarily suited to all viewers, but if you enjoy your scares to be more psychological you may well appreciate this one."}, {"id": 85, "text": "Horror movies means the movies should make scares in you but in this movie , the movie was not horror movies you don't seance any scary thing , the 4 pout that I give to movie is just because of one scence of it , around last 30 minutes of movie until 20 minutes was good but not awesome , I expect the better movie ."}, {"id": 86, "text": "Not a horror movie rather seems boring and weird. Story of daughter, his mother and grand mother in only house with some mystery. Both daughter and mother was sick about granny's erratic behavior after reappearing after mysterious disappear. I again wonder about high ratings for this foolish movie as there is nothing to watch. There is less horror and more weird drama. You would nothing find at the end. There is no explanation about granny's behavior. Photography is poor with whiteness all time and I had to adjust brightness to see properly. This is unacceptable point in current technology era because other movies are having crystal clear photography now a days. Also beware from ending scene. It is very weird than scary and some viewers would be disturbed. Overall movie is avoidable. Do not go with ratings they are fake or over hyped. Skip this meaningless movie."}, {"id": 87, "text": "I normally don't make any reviews about movies whatsoever but I do not believe I can get my time back for this movie and incredible make up artist should be the only one to get credit in this entire movie. First of all the storyline is ridiculous and very on reasonable there is no way I could see my parents falling apart and do absolutely nothing. Also if I were a child to a grandparent and saw them slipping into senility I would not challenge my mom on taking them to a home.I really expected this to be a great horror movie I will never believe rotten tomatoes rating of 91% I believe it was backwards and this movie should have received a 9% the only thing that's worthwhile is if you are an aspiring make up artist you may get some tips and tricks if you reach out to this movie is special a fax coordinator. Please don't trust the reviews of other people ever."}, {"id": 88, "text": "The film begins reasonably well. The sets and mise en scene are aesthetically creepy. The actors do their best but by the second half of the movie it becomes generic and lazy and you find yourself rolling your eyes. Horror is always a tough one to pull off and this movie is a classic example of that. It would have been a 5 or 6 for effort but the final scene was so ludicrous that i had to switch it off before the credits rolled. That brought it down to a 3 star movie. If you're going to set the best part of a movie in one location with 3 main characters then you'd better offer something a little different and ensure the main protagonists are not so one dimensional. Poor show I'm afraid. Watch if you feel like viewing a generic horror which goes nowhere and leaves you thinking. Wtf!? Yawn"}, {"id": 89, "text": "The first half of the movie is nothing but bump-scares and a house that gurgles like it ate some bad oysters. Apparently the mom is...changing....for lack of a better word. Evil spirit? Alien? Who knows. But take this premise, skip ahead exactly 60 minutes and you might actually like it a little. Maybe."}, {"id": 90, "text": "Was actually really interested to watch this movie from the marketing build up. It looked creepy and haunting.It turned out to be neither of these. There's obvious influence from movies like Hereditary (far superior movie) in the pacing and tone but it never really goes anywhere. There's an attempt at some kind of emotional drama cross over but that to feels limp, it's a bit of a mishmash of better done movies badly stitched together to create an incoherent crawl to the end, never really growing into something that you care about. It was a relief that the film ended and not something that will be revisited, all in all it was just poor movie that didn't know what it really was."}, {"id": 91, "text": "Although it sucked me in, there was no scary sections at all."}, {"id": 92, "text": "The Wife wanted to watch a 'boo' as she calls them, and sometimes I give in.This one was worth the time. 'Relic' is based in Australia, so there it a bit of the exotic already. It opens with a butt shot of a lady just standing in a puddle of water from an overflowing bath, and then cuts to the daughter/granddaughter team looking for the grandmother. Trying not to spoil too much, but she's alive.It takes a while to get where it's going, but the directing is tight and the acting by the actresses is solid. The behavior of the grandmother surprises in a variety of ways. The final third of the movie is a trip, and definitely makes up for the lull of the first hour. That it wraps up nicely (and strangely) in slightly under 90 minutes without a lot of horror cliches makes it worth recommending."}, {"id": 93, "text": "This movie is boring, isn't really scary and as other reviews mentioned it's a simplistic metaphor you can summarise in 5 words. Don't bother watching."}, {"id": 94, "text": "Not to bad of a film. that's about the best i can say if it. very dim filming, lots of people shuffling around in a gloomy old wooden house. grandmother, mother and daughter. lots of creepy noises. an ending that doesn't make any sense at all. i watched this film in the strength of good reviews. I'd have been better off watching something else. not a terrible film but i can't really recommend it. I've given it four stars but that's being generous"}, {"id": 95, "text": "Just wanted to write a simple review for this movie. It was well cast and the acting was on par.The ending seems to be the most confusing or controversial part of this movie but in my opinion, when it's striped down (no pun intended) is that it's simply a case of this horrible disease of dementia/Alzheimer's that leaves the mother on one side and the daughter and granddaughter completely devastated by simply not knowing anything about what it is they'd known or loved about this person or thing to put it more crudely, but probably more on point.It's always going to be hard to fit in dementia as a story to be used for common tropes in horror in the original horror sense, but the the truth is that this disease is worse than anything paranormal that could possibly happen. It's devastating.Well done to the first time director and the cinematography was beautiful. I look forward to to seeing more."}, {"id": 96, "text": "Slow movie! So I might have been half asleep and missed the part about why there seems to be no electricity in this house but I guess its for the better to try and add some atmosphere to this terrible wannabe horror film! So many holes don't know where to begin! No substance! The movie goes no where with the plot other than three women bumbling around a dark house! ....Skip this one!!"}, {"id": 97, "text": "I get it. Dementia is a horror in and of itself. I am very sincere in this statement. But this film expended way too much effort trying to show itself an artistic allegory for dementia that Relic comes across as more mess than mystery. It is roughly 70 minutes of extremely boring set-up (save for one single, macabre dream sequence), followed by about 20 minutes of confusion disguised as euphemism."}, {"id": 98, "text": "Relic takes notions of dementia and does disturbing things with it.I could not warm to this film. The characters are far too bleak and the presentation of the elderly, I found troubling.The ageing granny comes across as Norman Bates grandma. She's genuinely frightening, in a way I have not seen in people with symptoms of dementia.Most I have encountered are confused and understandably a little afraid. I'm not sure this film does them any favours, in a world, where the elderly are not treated with the respect they deserve.Its subtly suggested that granny's condition is inherited, in the closing scenes of the film, using black mould as a metaphor. At least that's my interpretation.All in all, I can't say I liked this film. I generally have a very high opinion of Australian cinema but this ones too dark and I simply don't like the way it portrays the elderly.5/10."}, {"id": 99, "text": "The first hour is really good and then the last 30 minutes is really bad. But I overall liked it. I didn't like it enough to make me want to see it again. But the ending to this movie was complete bad and total 180 degree turn from its natural direction, and not in a good or obscure way that really made you wonder. The way she's just peeling off the skin as if its no big deal, and the granddaughters no big deal I'll just lay down too reaction. Give me a break. It went from a good dark haunting feeling to some alien supernatural. Like yeah no worries, granny just seems to be morphing into a demonic alien type thing, we wont act any more surprised or discuss it even for 2 seconds."}, {"id": 100, "text": "People respond to horror movies in different ways. What makes some scream makes others snore. Those who crave horror movies awash in gallons of fake blood and gore will abhor the scarcity of splatter in freshman Japanese-Australian director Natalie James' Relic. starring Emily Mortimer, Bela Heathcote, and Robyn Nevin. This creepy, claustrophobic, but credible psychological chiller affects three generations of women in the same family. Confined under the same roof, they are menaced by an unknown entity sowing evil like the pestilent black mold that has infested their ancestral home. Basically, Relic is an allegory about the hereditary nature of Alzheimer's disease. Eighty-year-old Edna (Robyn Nevin of The Matrix Reloaded) suffers from bouts of Alzheimer's and lives in a perpetual state of paranoia. She insists an anonymous presence has been lurking around in her secluded two-story house. Edna's middle-aged daughter Kay (Emily Mortimer of Shutter Island) and her twentysomething granddaughter Samantha (Bella Heathcote of Dark Shadows) move in with her to supervise the octogenarian's daily regimen. The first 30-minutes tackles strictly procedural problems, with Kay and Sam arriving at Edna's house and the local constable interviewing Kay. Afterwards, everything goes to Hell for these dames, before a contrived but surreal finale that seems wholly incompatible with the events preceding it. James makes an auspicious directorial debut with Relic and cultivates a mood of dread throughout this macabre yarn should keep audiences on tenterhooks. Clocking in at an eerie 89 minutes, The Relic smolders with a mesmerizing slow-burn intensity that underlines its spooky aura of unease. James knows the grief and the guilt that relatives face when one of their own is stricken by this insidious brain disorder. Apart from serving as a primer about Alzheimer's and an inventory of the symptoms, Relic ranks as a better-than-average horror about a genuinely horrible disease.Relic opens in large, two-story house ablaze with a constellation of colored Christmas lights. Meantime, water gushes ominously from a bathtub faucet, overflowing the tub, rolling like a tide across the floor, running out of the bathroom door, along the hall, down the stairs, and finally pooling in the living room. Standing in her living room at night clad only in a towel is an 80-year-old, white-haired matriarch. This marks the first time we see Edna, the lady of the house. Beyond the living room window on the periphery of the screen, something presumably human approaches the Christmas tree with considerable stealth. The first time you see Relic you might overlook the evil silhouette because the image is so fleeting. Considering the extent of the damage done when she forgot to turn off the bathtub faucet, it is surprising Edna's daughter Kay didn't have her committed to a nursing home. Of course, if Kay had put Edna away, there would not have been a movie. Later, when Kay and Samantha explore the house, both have close encounters with this mute evil humanoid. This silent intruder and the malignant evil that it appears to spawn in the house generates most of the hysteria in this Gothic style tale. No, you don't have to worry about cheap, obnoxious jump scares startling you like in a shallow, teen-oriented, PG-13 nail biter. Instead, James and White immerse us in the narrative, and we experience the old woman's anxiety and find ourselves in a fight or flight narrative. Mind you, just because the horror may be something truly plausible doesn't mean that it is any less traumatic than the horror in either outlandish creature features or a slasher sagas. The horror in Relic develops just as gradually as the protagonists realize it isn't entirely a figment of Edna's dementia. Rather than tangling with gut-munching zombies or maniacs wielding razor-sharp kitchen cutlery, the protagonists struggle not only to save their mother but also to survive the ordeal themselves.Relic is in every way a subtle, sophisticated, but eloquent, sleight of hand horror movie that builds up to its surprising finale by suspensefully parceling out its chills. You can only truly appreciate this head scratcher of yarn when you've watched it a couple of times and spotted things you might possibly have overlooked initially. Anybody who succumbs to the spell of this white-knuckled chiller will feel the icy talons of fear penetrate their flesh and paralyze their muscles. After Kay learns her mother Edna has been reported 'missing' from the local constable, she rushes to the police station. Later, she participates dutifully in a search party. A large party of searchers fan out to comb the terrain beneath lofty pine trees towering overhead. A couple of days after Samantha and her daughter have moved in Edna's home, Kay awakens to discover Edna standing in the kitchen. She is brewing tea as if nothing catastrophe had occurred. Kay notices that Edna's feet are filthy from having roamed barefoot in the woods. Edna has no idea about the great commotion she has caused. Initially, she behaves as if Kay and Samantha are encroaching on her life. Later, Kay tours a prospective 24/7 assisted living facility for Edna. In the long run, however, this alternative doesn't turn out to be a viable option.Director Natalie James doesn't wield horror like a cudgel to scare the daylights out of us. Instead, she relies on Edna's deteriorating condition to generate the kind of horror you've seen in demonic possession movies. Comparably, demon possessed victims do share considerable similarity with Alzheimer's patients who end up deprived of any shred of rational thinking and can often turn homicidal. Sadly, the grand finale-as incredibly spectacular as it is--sacrifices all pretense of authenticity and the film concludes with evil far from vanquished. Anybody who has seen director Adam Robitel's The Taking Of Deborah Logan (2014) will discover a lot in common with Relic. Ultimately, James and co-scripter Christian White have fashioned an unforgettable saga which benefits from not only Steven Jones-Evans's evocative production designs but also Charlie Sarroff's sinister widescreen cinematography."}, {"id": 101, "text": "Relic: An old woman goes missing. Her daughter and granddaughter go to her home. Strange noises during the day and night, odd stains on the walls. The old woman turns up, gives no explanation for her absence but it's obvious that she is suffering from intermittent dementia. A very odd type of horror film, maybe a riff on the haunted house trope but more than that. The house itself has hidden depths which can entrap the unwary. A little gore and some disturbing scenes but the horror is mostly psychological. A tale of three generations of women which is also an allegory about decay and mortality. Moving performances by Robyn Nevin, Emily Mortimer and Bella Heathcote. Written and Directed by Natalie Erika James. 8/10."}, {"id": 102, "text": "While I watched, I was intrigued, anxious and had all the right feelings for a horror. I'm so grateful for the explanation, I understood it was a metaphor but didn't grasp all the concepts but now I know - really good film. And really moving if you have dealt with this condition with someone you love - which I have but I only experienced it at the Sam level. The Kay level is heartbreaking to consider."}, {"id": 103, "text": "This is typical yet not typical of the horror genre. I can't quite put my finger on why, but I really liked this film. The acting was excellent as is normal with English and Australian actors. It is understated. Let it unfold and try to figure out what it is all about. I think it's worth it."}, {"id": 104, "text": "Everything a movie could ask for...except the script. It made no sense, and left a lot of questions...But, you be the judge."}, {"id": 105, "text": "The acting is good (aside from kay who is basically monotone the entire film), the setting is good, the photography is good, the only problem with this film is that the metaphorical work is so obvious and blatant that hiding the meaning on a metaphor like that is useless. this film would be way better if it was just a realistic drama rather than an aronofski wannabe (which usually suffers from the same problem)"}, {"id": 106, "text": "Forced to sit through previews of other movies courtesy of Scream &amp; IFC Midnight. Usual cheap opening scenes of overhead view of car traveling on road - a dead giveaway to cheap.Really slow (90% of the movie) spending time on the relations between Gran (nie), daughter &amp; granddaughter. Eventually we get to a rather well done creepiness, although seen many times before, of being confined in an endlessly repeating dark hidden passage (although the house itself looked fairly normal); the growing creepy mold everywhere; of course sounds &amp; shadows; finally grannie is getting weirder. Fairly abrupt ending didn't make the why &amp; how clear."}, {"id": 107, "text": "This is a difficult review. The movie is very good in some areas: the cast does an excellent job, the light and color fits the atmosphere and the atmosphere created is perfect.On the other hand, it feels like there is no story behind. It's like putting a very eerie soundtrack with people looking scared and no background or story behind it. Mix it all and serve it cold.At some point it seems like the movie is about a haunted house, at some other points it seems like it is about spirits possessing the people. You will never know.I would never say this is a horror movie. But there is no scare or horror scenes whatsoever. The most scary scene is when they discover a moldy wall and when the niece gets trapped inside the house which, at this point it felt more like she took some drugs and tripped (because this is the only moment the movie suggests the house may be haunted).The movie may be read as a metaphor for Alzheimer, probably, but it still doesn't fit with the haunted house scene or the terrifying mold.You end up feeling they didn't tell you any story and you just watched a random and unconnected pieces of footage with no purpose.It could have made a fine short movie, but this is too long for such an empty and vague story."}, {"id": 108, "text": "This movie unfortunately caught my attention for all of the wrong reason. It truly was the worst film that I have ever seen in my life. If I was allowed I would personally rate it a -4/10 but I am only able to give it a 1/10 at worst. The Rot zone and the fact that the Grandma slowly turns into E.T. by the end of the movie also are just evidence as to why this movie is not a horror film but rather a horrific one. I hope this got my point across. Shmeagal was much better I would definitely recommend that instead."}, {"id": 109, "text": "Whenever you look at the feedback for a movie and see people using reviews as comments to smugly tell everyone who didn't like it that they just aren't smart enough to understand the great masterpiece, you should know what to expect in the actual movie.This one does not deviate from that rule, although it is a bit more solid than most pretentious style over substance flicks due to it's good use of allegories. Where it does fail, as is to be expected is the overall plot as it is riddled with holes which the director seems to have almost purposefully ignored in order to deliver their message.The movie is really two different movies into one. The first part is pretty engaging, ambitious and even clever at times as a psychological horror. The second part is the movie's intellectual capitulation and devolution into a zombie horror as it realizes it cannot coherently finish the message from the first part.In part one we get introduced to the family with a grandma suffering from dementia and her daughter and granddaughter who try to figure out how to help her. Of course here you have your pretentious violin shredding, uncomfortable close-ups and dark shots of the interrior meant to make you wonder if every shadow isn't something else. The grandmother engages in erratic and disturbing behavior so it definitely creates tension, although I would not credit the movie with it since even a documentary of a person with dementia is pretty unsettling without being a horror movie. This is where the movie sets up good imagery - a stained-glass window represents the clarity of the mind and in several shots we see it slowly get overtaken by a dark rot. the house itself has patches of the same rot spreading to represent the advancing disease. The grandma's hobby is to carve wax candles, representing her struggle to maintain her light in the encroaching darkness of dementia. Cool stuff so far. But here's also where the movie just shrugs and doesn't know where to go from that point. First the grandmother sees a human-shaped shadow moving in the house - OK it's her mind slipping. But then her daughter and granddaughter also see it? OK, maybe they also suffer dementia? But it isn't hereditary in the vast majority of cases, let alone three straight generations...Also it does not manifest in 20-something year olds. And just as you're ready to overlook this you see a few shots when only the audience can see the shadow, giving it credibility for being real...unless the movie means WE ALL suffer from dementia? There's even a doctor that comes in to examine the grandmother and sees a patch of rotting flesh on her chest, calling it a bruise, leading us to believe that it is in fact real and not just an illusion (more on that later). OK, plot holes aside let's see where it goes.The second part of the movie is when the granddaughter finds a somewhat hidden section of the house and explores it. Here reality breaks down, halls start shifting, doors disappear, walls block previously accessible paths and push her further and further into a narrowing corridor which eventually becomes the size of a coffin. Pretty cool sequence, except it completely does not fit with the tone of the movie so far. If the supernatural effects are real then we're not talking about a metaphor for dementia. And if it isn't real, why does a third generation 20 year old experience this? Soon the mother joins her and experiences it the exact same way, leading us all tot believe it is in fact real. Here the movie, having written itself into a corner, decides to double down and portrays the grandmother as a rotting zombie. She breaks a leg, revealing a rotting black bone, stabs herself with a knife, dropping pieces of rotting flesh, crawls jerkily towards the other two while growling and making Zerg sounds. I thought this was all a metaphor, so how can everyone experience the same? Long story short they beat the zombie-grandma up and just as they leave the mother has a fit of conscience and decides to stay and care for her anyway. What follows is a disturbing sequence of the mother peeling away the rotting flesh of the grandmother to reveal a shriveled mummified (but living) corpse underneath. They embrace lovingly, the daughter joining in to represent three generations together, and she discovers the same black rotting patch starting to form on her mother's back as well. But...it's not hereditary! But the doctor saw it! But if it's real then it's an evil entity in the house and not a metaphor for dementia! Oh who cares, don't think about it too much and just enjoy the pretentious cinematography!I won't fault the movie too much as it does undertake a fairly ambitious task and an important message to deliver, and in the end it's better to try and fail than to stick to simple and pretentious with no message in sight. It just tackles a topic well above its pay-grade and ends up flopping in its delivery as it teeter-totters between the multiple things it tries to be."}, {"id": 110, "text": "Natalie Erika James' debut feature 'Relic' is a journey through the mindset of dementia - not only for the victim but for the loved ones coming to terms with it. The tension is built up slowly and without the aid of easy jump scares, but more using of sinister atmospheres to prepare for the maddening (but seriously heart-wrenching) finale. All this delivered in a highly intelligent and subliminal work of perfect film-making."}, {"id": 111, "text": "Not a great film, by all means, but not a bad one either. Incorporating horror elements to highlight the grotesque misery of many aspects of old age...For the first full length movie, quite an achievement! I liked it! Would I ever rewatch It? Definitely no! But a very decent film for one time watch."}, {"id": 112, "text": "Why you ask, would I do that? Because the slow burn as some have called it was getting close to the point of becoming a sudden flash fire, or so I feared.Only 3 movies have done this to me, this one, and two others titled The Descent and The Descent 2. Any movie that puts me is a state of fear as to what will happen next gets high marks from me, especially if I had to watch it from a considerable distance with the room lights turned on.Even the ending, which I didn't quite understand is OK, since I sometimes enjoy being left with questions about what the ending was trying to tell me. Not knowing the answer is an interesting feeling, and I enjoyed that unanswered question.The acting was great, and it was wonderful to see a well done movie such as this!"}, {"id": 113, "text": "What is this?? A Psycological Thriller, a Horror Film What? The only Horror i find is that this is the Worst movie i have seen this year by far... Nothing relevant really happens throughout , has really a weak plot, the actresses are not that good and there is no tension whatsoever... What i am really Terified is that is watched it till the end, and i am still waiting for something to happen... Some might consider this movie, an abstract idea, some a Labyrinth of the Mind... I just think is just a dull concept for the weak minded, to get some chills... And i just could´t fell any emotional attachment to the characters... If you want to see something related to Alzheimer see Alice instead. If you want to see a Psychological Thriller, there are a million times better movies.If you see this movie, get Alzheimer and Forget it, like it never existed"}, {"id": 114, "text": "This movie has all the generic scares but when it gets towards the end and goes weird you wait for an explanation and then it ends. Its not hard to make a interesting movie that has no end. Other films like this exist the cube is an example. To get to the end and there is nothing is annoying. Apparently its a methaphoer what a easy get out that always is.II thought of a perfect ending which would be the police kicking down the door and arresting them for the worst abuse case ever. the mould was in the house and they was the ones harming the gran because the mould was posinous and made them see things"}, {"id": 115, "text": "This movie honestly wasn't bad. It definitely is slow but the scary scenes are actual, edge of your seat, ready to jump kind of set up. Found it in Redbox and not mad I gave it a try"}, {"id": 116, "text": "The movie is about alzheimers and the fear of it. The grandmother has it and it is getting worse and worse troughout the movie. She has gotten a black bruise on her body, and the house also has alot of these dark/black marks. So i think the house represent her alzheimers/mind. That fact that it she is getting more and more bruises and the house is getting more and more rotten, i think symbolises that the alzheimers is taking more over. And the part when the granddaughter got lost in that room i think symbolises the disorientation and how scary it is from alzheimers. And that the room she is in and where the grandmother does not want to go inside is where the alzheimers evolved. Where all the forgotten things are.The strange ending where they all was laying on the bed, and the daughter had ripped all the grandmothers skin of and ended all black-«skinned» i think represent that she peeled off the old her, and now she was just dying of illness, and that the daughter finally excepted it. The last seconds the granddaughter sees a small black bruise on her mothers shoulder, that could represent that alzheimers is an inherited disease, and she will also develop it over time.So good and cool idea, but could maybe have been done in an other way to make it scarier and better. It has some poor dialogue and poor reactions too. But with these symbolism I liked it!"}, {"id": 117, "text": "Idk how to start. The trailer was right but the thing that make me pulse start was the reviews (91% rotten tomatoes) it was a little too much so since minute 1 I expected something surprisingly good. As a person who loves cult movies, with a good plot and a lot of spicy horror, gotta say I'm a little disappointed. But if it wasn't for this weird hype, i could say is a really good movie. This film is not for everyone, is a little slow, and doesn't have those loved screamers (which is not necessary a bad thing) What I do have to say is maybe they could had explained everything a lot better, because the ending leave you with some doubts. (I didn't understand until I saw an explanation) so, in general, good movie, good plot, confused but it's ok. Ppl exaggerate everything, go and see it but, again, everything is better if u don't expect anything from it."}, {"id": 118, "text": "Slow, tense, and genuinely creepy... . . . . . . . . ."}, {"id": 119, "text": "WORST MOVIE EVER...STAY AWAY!!!!!YOU CANT SEE IT..ITS SO BORRING AND MEANLESS.......I LOST 1,5 HOUR OF MY LIFE FOR THAT THING:.........."}, {"id": 120, "text": "Feels like a trip to hell itself. Don't judge, see it for yourself."}, {"id": 121, "text": "I'm only reviewing this movie because people didn't understand it was A METAPHOR and didn't get the ending, therefore they gave it a 1. Seriously folks, if you can't grasp from the beginning that this was a film about the loss of self due to dementia and loss of the person you know &amp; love then I have no idea what to tell you. Go watch Halloween or a Conjuring movie because you're obviously too low-IQ for this one. I thought it was rather good. There wasn't anything obscure about it; they pretty much got their point across in a creative, dark, and incredibly sad way. I have not had a family member with dementia/ Alzheimer's and I understood it perfectly. Yes, even the ending. Actors were incredible, I didn't think the lighting was bad at all (maybe some need to turn their brightness off auto) and the story was fresh and gripping. I won't spoil the end in case there is intelligent life reading the reviews."}, {"id": 122, "text": "Relic is a fantastic debut film and an incredible metaphor for dementia. It really takes you in a journey that for many who have grandparents or parents suffering with this horrific disease understand. The performances are incredible, and very mature. I also loved the domesticity of the film and utilising domestic elements to fulfil the horror conventions. The third act of the film is very satisfying which for me is usually a let down in most horror films. The claustrophobic aspect is very symbolic and the ending has a bittersweet feel that elevates the film from its genre status. I highly recommend this film."}, {"id": 123, "text": "I couldn't disagree more with the bad reviews of this movie. Had me unnerved through the whole 2nd half. I admittedly had to look up reviews because I didn't understand the ending, but once I understood, it hit me like a wall. Superb movie! Must watch!"}, {"id": 124, "text": "It is a creepy flick. people may not find it to be crazy scary, but it was. I never felt the need to fast forward, which I usually do, but this movie didn't make me feel like it was slow. Each scene plays a part of the story and either reveals, or builds you to put the pieces together while you watch. It doesn't just give the audience what you want right away. The climax was one of the most emotional experiences I've felt in a horror film. The scenes leading to the ending of the movie was probably my favorite part. This is one of the best films I've ever seen in this genre."}, {"id": 125, "text": "One of the biggest turds ever dumped on my retinas. Thanks for nothing Stan."}, {"id": 126, "text": "I guess all negative reviews come from Americans who cannot understand what allegory is. Excellent film."}, {"id": 127, "text": "This is a brilliantly constructed film. So beautifully shot, directed and performed and the sound and lighting design is incredible.Such a claustrophobic, unsettling and intense horror movie that builds to a really distressing finale.A slow burn that gets under your skin and stays with you.A stunning feature directorial debut from Natalie Erika James"}, {"id": 128, "text": "You may just watch the last 15 minutes of the film.Even those 15 minutes will bore you death."}, {"id": 129, "text": "I must say, I found the movie was very creatively made; starting from the very first title sequence to the very last scene. For those who were disappointed by horror movies like Babadook and Hereditary, you're going to get disappointed by this one too. But for those who loved them, it's a whole new story."}, {"id": 130, "text": "I get the feeling that the negative reviews came from people who just wanted a slasher flick and didn't want to be bothered with fiddly stuff like plots. Make no mistake this IS a horror movie, but it is also partly a metaphor about aging and the way families and society treat the elderly. Ultimately whether you like this film or not depends on what you want in a horror movie... if you want something with a little more depth this is an excellent choice. The acting is great, the characters are great. It was certainly successful at creeping me out, which a lot of films just don't anymore, and I hope we'll see more like this in the future."}, {"id": 131, "text": "After an hour barley anything had happened. There was finally some action in the last half an hour, but it was so ridiculous. All of their reactions were ridiculous. The hidden meaning was ridiculous...I never would have known there was one if I hadn't come into imdb and read other reviews! I'm so disappointed and wouldn't waste my time."}, {"id": 132, "text": "Stuck in lockdown with nothing to watch so we thought we'd give this a go. WTH we thought. It would have been more entertaining mopping the floors again or staring blankly out of the window. Starts slowly. Had a mediocre story that never grips at all. Throw in some average special effects/makeup and carpentry work and they called this a wrap? It is terrible"}, {"id": 133, "text": "Wasted almost 90mins on this ridiculous movie. If i could give a zero i would."}, {"id": 134, "text": "Whoever rated this film a 10 was obviously paid to do so. Easily the worst movie I've seen in theaters. Hands down. No plot. Horrible acting. Absolutely horrid !!!!!"}, {"id": 135, "text": "Claustrophobic, genuinely unsettling and emotionally devastating. This is an extraordinary movie."}, {"id": 136, "text": "This was so disturbing. The final scene was too much for me. Oh my god. What did I just watch. By far one of the greatest horror movies of the last years. I am so... weirded out by it."}, {"id": 137, "text": "Yes, a slow burn psychological horror set in the complicated relationship dynamics between three generations of women, with the eldest seemingly suffering from a dementia onset. Nothing is over the top in the film nor the character's relationships dynamics. They are conflictual, but they only overtly heat when in context of the elder's emotional outbursts associated with cognitive issues. Then, toward the end, there is a tilt to the world and the apprehension that was present earlier in the film may just be something greater than a simple neurocognitive decline. Elements of feminism and the barriers that women can create for each other seem to speak quietly. The horror element is more psychological and only toward the end does it start to take shape, leaving us with a quiet and low resolve of love and acceptance and inevitability."}, {"id": 138, "text": "The movie had a great potential but failed to use it. I don't recommend the movie cuz its trash."}, {"id": 139, "text": "At last, a good Austrailian film that had me glued to the screen for the first hour. Then its like day and night, the film slam dunked itself down the poop-chute!What on earth is happening to the quality of films these days? Whats with telling a good story just to muck it all up with some nonsense ending that leaves one completely disgusted to have wasted an hour and a half of a persons life.This film should have just remained Down-Under! Very bad and very disappointing. 3 stars for this Oz Bust!"}, {"id": 140, "text": "Relic is eerie, to the point and offers viewers a deeper message than most horror films today. . In this horror film, a daughter, mother and grandmother are haunted by a manifestation of dementia that consumes their family's home. . Running a little under 90-minutes, Relic doesn't waste any time to get your pulse pounding and your mind thinking. The film offers a very deep message about the horrors of dementia and some of the scenes might be difficult to watch. I did think something was missing throughout but I can't nail it. I thought the script could've been stronger and maybe the film a tad longer, simply to get to know the characters more. Other than that, definitely haunting and a horror film that will get you thinking. . Follow @snobmedia for all reviews!"}, {"id": 141, "text": "I decided to give this a try seeing a rating of 6.1. People have become clever these days. They suffered and now in return want you to suffer.Movie is frustatingly slow, boring to death and nothing ever happens in the movie except some weird wood thumping noise. Aimless and pointless. Watch only to spoil your mood."}, {"id": 142, "text": "This is a low budget, atmospheric film that explores 3 generations of a family: the grandmother, daughter and granddaughter.You can see it took inspiration from &amp; paid homage to classic films like The Babadook &amp; Hereditary. I did not think it came close to matching the quality of those films but I must say it is enjoyable enough to watch."}, {"id": 143, "text": "Heard the working title for this flick was Dark &amp; Boring: The Movie."}, {"id": 144, "text": "Shot in such dark lighting I had to squint at times and it still didnt make it scary. They tried to be deep with meaning and it really didnt translate. And I work with dementia patients so I was willing to get the messages. I hated it, personally. But it did make me wince a few times from gore, and my spouse liked it so I gave 4 stars. Wouldnt watch again."}, {"id": 145, "text": "2.5 out of 5 stars.Relic is not a good horror film but it does offer some unsettling creepy scares. You would have to sit through a very dull and boring direction. It is eerie. It is one of those horror films thats very slow moving. And it builds its tension slowly.The plot is weird. And gets weirder in the final moments. Without giving away spoilers. About a mother and daughter visiting there grandmother who was missing. And something evil is lurking in her house.The movie spends its time setting up creepy eerie camera shots with something moving in the background. I found the movie to be boring than entertaining."}, {"id": 146, "text": "But only part of the problem...If someone I knew\\loved was missing and I found a hand written note in a coat of theirs saying Don't Follow It I would immediately share it with everyone else looking! Am I the only one into communicating?Soooo many movies and TV shows have characters NOT telling other characters who have the samne vested interest important things they find, hear, or discover that you would think all of us keep important details about everything to ourselves.Do we?? Again am I alone in the info sharing department??Refusing to fully disclose (again) the black mark on her chest to even the nurse who notices it but makes only a passing remark about it... I dunno I'd be at the docs asap if a black mark the size of an apple appeared on my chest!!AND that the black mold marks on the wall and interior of a closet sound like rats in the walls... AND no one calls anyone to check it out! Then the pool. Before grandma pops up NO ONE from the police thought of checking the full murky water pool??No one tells anyone anything in this movie. Not even when grandma tries to stab granddaughter does the latter tell her mom about it!And when it is even more obvious grandma needs to be put away...no call to the home visited or to police or to... you get it.As for any supernatural element, one hour in and we still did not know what was going on. If it was rats in the walls, ghosts, dead people, or what (Stephen Kings short story Rats in the Walls came to mind often).Then I paused. I looked up affects of black mold. They include mood swings and... hallucinations!! Finally an explanation! Somewhat.Then the movie takes a turn and gets into some old fashioned horror but never fully explains what is really going on. The mold seems the best guess culprit tho it is a monster mold - weaponized!As with most of these slow burn\\boring horror films (Heredity did more damage than I thought) the acting is good, the cinematography is good, but as we used to say in legit theater, that is Applauding the Scenery.Avoid."}, {"id": 147, "text": "This movie started with promise, but that quickly deteriorated. This was a terrible horror movie made mor confusing by poor directing. Skip it and watch something else."}, {"id": 148, "text": "This is what a horror movie should be. It's a gradual descent into a living nightmare. In fact, it's so well done, it even reminds me of some of my own nightmares.Looks like another win for Australian horror, after the Babadook."}, {"id": 149, "text": "I consider Still Alice a horror film. Relic touches the same issues - dementia, senility, slow degradation of human mind, the way it affects the whole family and carries from one generation to the next. Your grandma's mind is rotting away. So will yours one day. It's inevitable. Using the tools of a typical haunted house horror movie the story is brilliantly told and scary as hell."}, {"id": 150, "text": "I'd love to know what this movie looked like, but it was made so ridiculously dark...I can't tell. Not the theme, the actual non-existent lighting.No lamps, no overheads, perennially gray outside and shot so dark you can't see anything.If the movie theaters open after the virus, go see this movie with a date. You can make out, do whatever. No one will notice because you'll be sitting in pitch black.Very annoying."}, {"id": 151, "text": "Can't believe I payed 7 dollars for a artsy take on dementia... I guess its creative, original, sure but don't market it as a horror movie... Now that I know what type of movie it is, I still can't say it was even any good. It's extremely slow, literally nothing happens for the first hour. Wish I read reviews before I chose it. Hopefully if you're looking for an actual horror movie you will read this first or one of the many other reviews that have the same complaints."}, {"id": 152, "text": "Being a huge horror genre buff, there were parts of this movie that got me excited and others that were a little..meh. The whole house slowly collapsing in on itself and the doors and walls repeating themselves made me yell out House of Leaves more than once (and I thought that was well done). The idea behind the mold/disease Transforming the mother/grandmother into a demon as an allegory to dementia has an interesting twist to the genre and fits with the feelings associated with that disease. This use of literal transformation to explain a real-life issue reminds me of It Follows. My only complaint is the mix between metaphor and reality starts to get a little skewed. There were some solid horror/supernatural topics explored (although not addressed until the end) that could have been developed more to make a solid gothic story. But with the use of a supernatural entity/disease in movie real-space on top of the symbolic real-life topic of dementia, it gets difficult to fully understand the story behind the movie."}, {"id": 153, "text": "It's an all Australian cast, directed/produced in Australia, however thjey went all out with the production team which apparently consisted of Jake Gyllenhaal, and both RUsso brothers (Marvel movie universe fame)The primary premise is the downward slide of a family mamber battling dimentia but then take it into an alternate route adding in horror elementsThe acting across the board for the most part seems very realistic for how people would react in the situation of dealing with a loved one that appears to be losing it and of someone who no longer knows what's happening to them.Robin Nevan as the elderly mother/grandmother Edna really shines, she is truly creepy in the movie."}, {"id": 154, "text": "This movie definitely has potential, but just doesn't meet the mark. The overtones of the movie are good, it is definitely creepy. However, it seems to get right to the verge of being scary, then...NOTHING! If the filmmakers had just gone the extra step, this could have been the best horror film of the year. The ending is also bizarre and if there was any explanation as to what it symbolized, I totally missed it.The bright spot of the movie was the performance of Robyn Nevin, as Edna. Her performance was magnificent."}, {"id": 155, "text": "Studid. Stupid. Stupid. Every horror cliche you can think of, but no real story. Don't even think of watching this crap."}, {"id": 156, "text": "The movie had great effects, sounds and production. There was no plot... At all. Nothing explained. So many things happened and you don't understand it. With a plot it would probably be a great movie but it was pointless. It takes an hour for ANYTHING to happen. You may as well fast forward and watch the last 30 minutes."}, {"id": 157, "text": "After watching this I felt as through a big chunk of the film was missing.It started out being intriguing and ended up being disappointing with little explanation in the story of why the film ended as it did.The acting and general atmosphere of the film is good, but the story really doesn't cut it as an interesting horror."}, {"id": 158, "text": "Actually regret wasting time watching this movie of the cursed door, which led everyone passing the door into a nightmare of rotten black, the house has a hidden door that led to place when you passing on it, you can't get out, or hardly find the way out.I didn't say it's a bad movie, but not worth the time watching it.there I a lot of shots in the movie that should be cut as it just extending the time of the movie for no reasonthis movie reminds me of a recent movie You Should Have Left that I've watched, which has the same concept but in a different way, expect this movie does not have time travel and not as powerful as it."}, {"id": 159, "text": "An elderly woman, her daughter and her grandaughter live in the same house. One day the old woman disappears for a couple days and then reappear at home without givig any explanations. Her behaviours become increasingly scary to the daughters. She finally attacks them and reveal her secret identity: a black skinned creature hidden under her skin revealed by the daughters peeling of the skin. The granddaughter notices a black spot in the mother which is unforboding.."}, {"id": 160, "text": "Don't have much to say here... I wanted to watch a horror movie and wound up with a regular movie. I had to quit before it ended. I like Australian movies, but this one is a no go! 😉😆"}, {"id": 161, "text": "Slow and painful , not a great advertisement for our dim industry 😡"}, {"id": 162, "text": "Relic just like The Lodge tries to be a hipster horror movie on the lines of Hereditary and Get Out but ends up being underwhelming. Its sad because the plot has so much potential even if it has similarities to The Visit. Natalie Erika James should have changed the tone of the movie and made it with generic thrills rather than adopting the self indulgent over used atmospheric darkness tone. The first and last 10 minutes of the film are quite good but otherwise its very dull. I hope Natalie Erika James' next film tries to have a different and new tone."}, {"id": 163, "text": "So this Australian movie was filmed on a set in California? Ok then. Not so much a horror film as billed but more of a dramatic depiction of a family dealing with what would appear to be the onset of dementia. Some mildly mysterious goings on but nothing that shocked me, seemed to be no reasoning as to why the mother turned out the way she did! Family horror/drama done way better in Hereditary."}, {"id": 164, "text": "Devoid of tension, pace, and for the best part, script, what some are calling a 'slow burn' was actually torturously boring. The 3 protagonists are highly unlikeable, and I just wanted them to die so I could stop watching."}, {"id": 165, "text": "It's so disgusting. It's ugly. It's NON SENSE. And there's a lot of HOLES.THIS. IS. THE WORST. FILM. I. HAVE. EVER. SEEN. IN. 33. YEARS. Can I have an Obliviate spell to forget this sh**?"}, {"id": 166, "text": "Lots of suspense and thrills in this film. Nicely acted and we'll written dialogue. The director, cinematographer, and editor deliver a well crafted horror film in a very artistic form. However.... The movie is too metaphorical for my taste. Overall I enjoyed it very much."}, {"id": 167, "text": "This film is dull. It drags and drags between moments where nothing really happens. It definitely wasn't even remotely scary."}, {"id": 168, "text": "Technical credits, acting all above competent but the writing, pacing and direction leave much to be desired. The movie starts out well, but swiftly dwindles down to by-the-numbers, PG-13 scares by way of direct-to-video blumhouse fare.The entire time I was watching this, I was asking myself 'What is Emily Mortimer doing here? How much is her mortgage that she'd agree to do this? Maybe she is friends with the director or the producer? Charity?' She is so talented. Kudos to producers though. She was the only reason I rented this. So they win. Unfortunately, the movie is uninspired and ultimately a waste of time and money."}, {"id": 169, "text": "Honestly, in the beginning I was starting to wander when the plot will actually thicken. Time passed, wandered even more. The movie ended and the only thing that stuck was that I will never get back those 90 minutes...Dementia is one thing to dwell about but after one point the story just became pointless."}, {"id": 170, "text": "Absolute stinker of a movie doesn't make sense, do not recommend. Plain slow and tried too hard to make it scary though failed bad. Such a waste of film to describe the damages of dementia could have done something better."}, {"id": 171, "text": "Wow a total waste. It's the ending for me. Don't bother"}, {"id": 172, "text": "Trying to be deep but has no substance. just because its a slow-burning movie with a psuedo cheap symbolism doesnt put this movie in the same league of other horrors like hereditary, babadook or the lodge. i guess using metaphors sometimes is only to hide amateurness in storrytelling. honestly i would rate it 3 star but it tries to trick you to believe it has something more in it or there is meaning. what a cheap horror drama and directing."}, {"id": 173, "text": "An hour and a half of my life I will never get back. I understand the creativity behind it but after all the hype from advertising to then be followed by limited details on the movie and what they wish to portray and then to watch it, I really got nothing out of it"}, {"id": 174, "text": "Yes, lots of blank staring, took forever to het going. i would have never realized the underlying point until coming to imbd. literally came on here to find out what on earth i just watched because it made no sense. not worth my $7.99."}, {"id": 175, "text": "The only thing worth watching from the movie was the last 20 minutes"}, {"id": 176, "text": "Movie is Crap, STAN promotes this movie like its the next Marvel movie.There is no explanation to the movie &amp; that's fine yet the movie doesn't explain anything.Am happy for a movie (that doesn't explain certain things). Yet this movie doesn't explain how, why and the end!! I was looking forward to a horror movie, that is not more a mystery that is unsolved. (A - big disappointment) ....... Ask OMG why make this crap!"}, {"id": 177, "text": "Fun Fact: Mold can cause all sorts of wacky wild mental problems to people who are genetically disposed. This is the story of what happens when things get weird, when you can't trust your own senses, and when you don't even know it. What you fall back on will determine your fate. This is not horror, this is what happens to people who fall down the rabbit's hole. I've been into a few."}, {"id": 178, "text": "Let's be honest. One of the major reasons we go to scary movies is to be scared. Likewise, another major reason make you give up watching is due to the overused formula. Tha's not the case here, I suppose. The devil is not only on the details. I mean, It's really there. I promise you won't pass over the dreadful and well made scenes. Also, the character development is quite good, and I found myself wholly immersed in this story."}, {"id": 179, "text": "Relic is a slow burn but a good movie. My only complaint is the way it's filmed, it's very hard to watch because it's so dark and this alone took away the experience for me as you're left at times wondering what's going on (even when watching on a very good tv)."}, {"id": 180, "text": "The first half of this movie feels like a psuedo deep dive into dementia and could deal with some real themes. The second half of the film feels more like a horror but a really bad one. It gives 0 motivation or back story for Sams character to be afraid when trapped and explains nothing about why Gran is the way she is. Unresolved plot points and an ending that has a black voldemort leads to an utterly disgusting film that fails at anything it tries to avhieve."}, {"id": 181, "text": "Difficult to believe this is the directors first feature film... What a beautiful and haunting portrayal of the affects of dementia as it creeps in to a family member.If you have ever had someone you know go through this horrible condition, Relic will leave you both terrified and saddened by the end. The actors do an amazing job of portraying their emotions of dealing with a family member who transfroms into someone unrecognisable and their own guilt and fear of how to take proper care of them.The cinematography was also stunning throughout, the water coming down the stairs in the beginning was gorgeously shot and the scenes in the forest were ghostly atmospheric.Also the moment where the house becomes a labyrinth and the corridors get tighter and smaller was so clever! The art department must have had such fun making it!I really enjoyed watching this movie, my housemates and I were screaming by the end and it left us all thinking about what the ending meant to us individually.All in all I would highly recommend watching it... Watch it alone if you dare!"}, {"id": 182, "text": "The movie starts with a realistic and all too familiar premise: Kay (Emily Mortimer)'s elderly mother Edna (Robyn Nevins) hasn't been seen in a few days, so Kay and her own daughter Sam (Bella Heathcote) go home to look for her. There's signs that Edna might be getting worse than just getting a little forgetful. There's rotten fruit in a bowl on a table, and little notes all over the house as reminders to do basic tasks. When Edna reappears, Kay begins to not be able to tell if she's slipping into dementia or something more sinister.The last 20 minutes had me absolutely riveted and holding my breath from the tension. The movie is carried ably mostly by these three actresses, who take a common family drama element and add much more. If you liked the found footage film THE TAKING OF DEBORAH LOGAN, this is a much more stylish and brooding version of a similar idea."}, {"id": 183, "text": "A fresh look at traditional monster horror films, this film depicts the gradual turning of an old woman with dementia into a monster, with her daughter and grandaughter acting as wittnesses. But the genre of the film ( horror ) is a mere vehicle for the action, which is based entirely on the relations between the three female relatives. As a typical good horror film the timing of the film is excellent. The directing is a bit conventional and the music use is a bit bad for the genre, which usually makes heavy use of the element of unexpected surprise. Despite its flaws, it is a completely realistic depiction of dementia and mental health issues."}, {"id": 184, "text": "Really slow film, didn't understand the meaning until I googled it after and found it very offensive because it depicts people with dementia as evil or possessed. Was not well portrayed."}, {"id": 185, "text": "I love the ideas this film has, it just feels pretty half-baked considering it isn't even 90 minutes long. The characters are pretty flat because of this, it's not all that scary, the plot is just running with this one idea the whole time, and although it is really well directed and shot, I really wish it had a bit more time to explore itself, and I hope the director gets that for her next film. Then I'm sure we'd have something really special."}, {"id": 186, "text": "Have never written a review, but this movie is just so bad I had to. Don't waste your money. This movie is incredibly boring for the most part and can't choose which genre it wants to belong to. No character buildup, I found myself not caring for the fate of the characters at all. The plot twist was confusing at first but the ending made my eyes roll."}, {"id": 187, "text": "I have lost the will to live I'm half way through, but you know what it's like, once you started you have to see it through. So by halfway through the only thing that had happened was the washing machine turned on by itself and that was it. I have about 26 minutes left to watch and still nothing's happened except granny has been caught by her daughter trying to firstly eat her album of photographs and secondly then bury them in the garden, Like ya do !! I'm writing while watching it because I know I won't miss anything 😜 A tedious, boring, bland and low budget blomp of a film. If I'm never seen again it will be because I died of boredom watching this dreadful film."}, {"id": 188, "text": "This film is one of the worst movies we've seen in centuries. After finishing the movie we felt as if we stil missed half of the movie. The plot is no good ending to any movie and thus is not worth your time or money. My tip: find another movie to watch!"}, {"id": 189, "text": "While offering a promising start, especially given a captivating trailer, it descends into oddity when the writer tries to over-artistically connect the decay of dementia with an evolving house. Up until this point there is an expectation of something supernatural. A side story of the great grandfather decaying like a hermit in a summer house on the property may represent the hereditary condition. The final scenes show the mother now caring for the grandmother (moments after fending off her attacks using a conveniently placed iton pipe) by peeling off her decaying skin, head to toe and leaving her looking like she forgot her factor 50, before spooning, quickly followed by the daughter joining the moment of bonding."}, {"id": 190, "text": "A mess of metaphors and ambiguity pile up like the boxes of old stuff in the spare room.This one fails on all fronts and was highly disappointing given the great recent period for mature Aussie film content (see Sweet Water/Nightingale instead).Very difficult to pick some positives, but there should be sympathies passed onto the 3 leads who do what they can with the very little the script gives them.If you like your horrors (hah) painfully slow with an abundance of ambiguity and lack of cohesion...this is probably for you.Just like Gran from the film, no one who watches this is going to remember it tomorrow either."}, {"id": 191, "text": "Now with this was a movie that I didn't hear about until I saw it getting some buzz on social media. Some people that I really do respect in the horror community were speaking highly of it. It was interesting that I was going to watch another 2020 horror film for this week on my podcast, but when I saw this movie fit better with the 1950 movie I picked, I asked Jaime if she was interested and we gave this a viewing instead. The synopsis here is a daughter, mother and grandmother are haunted by a manifestation of dementia that consumes their family's home.We start this movie with what looks like Christmas lights. It shows us a bathtub overflowing and then to a naked old woman. It then shows us a figure in all black pop up in the background, but it is blurry.The movie then takes us to Kay (Emily Mortimer) and Sam (Bella Heathcote) heading out to a house in a small town. They're looking for Kay's mother and Sam is her daughter. They break into the house and there's no sign of her. They check around and eventually have to involve the police in a search of her in the woods.Kay begins to have a nightmare of a cabin and of an old man inside of it. He is being consumed by mold where we see him pass away. We then learn later, this cabin was what was originally on this property the house now sits. The stain glass that is in the front door was also on the front door then and was preserved.Then as if nothing happened, Edna (Robyn Nevin) shows back up. She is making tea that morning and Kay asks where she had been. Edna seems annoyed that she is asked, but it is ignored when Sam comes into the room to hug her. This then becomes a struggle of Kay wanting to help her mother, but her mother resisting. She doesn't want to give up her house or her way of life. Sam offers an alternative and Kay struggles with doing what is best for her life as well as what would be best for her mother. There is also this entity that Edna is seeing. Is it real or is it something else?That's where I want to leave my recap as that gets you up to speed with what the movie is really about without going into spoilers. What I really dug about this movie though is the underlying allegory that it is trying to relay. I will admit that I did read an interview of the director/co-writer of this movie, Natalie Erika James, so I'm going to incorporate aspects that were relayed in my analysis. I did pick up on some of things, but there was more that I didn't correlate that helped to deepen what I enjoy.The first thing that I really liked with this movie is that we have three generations of women in this family. Edna is living alone since her husband passed away. She is dealing with Alzheimer's and has to leave notes to remind her of the mundane tasks of daily life. She's at a difficult age where she wants to continue her way of life, but she's losing that ability.Then we have Kay. She's a busy woman that has her own life. She can't 'babysit' her mother and she needs more intensive care. It is a difficult decision, but she's looking at nursing homes for her mother. This causes her to butt heads with Sam, who is willing to take on the burden. She no longer wants to go to college and is currently working at a bar. Her mother wants what is best for her, but is doing that motherly thing where she is interjecting her thoughts on what her daughter should be doing with her life.Without going into spoilers here, since I'll do a spoiler section later, we have the entity that keeps popping up. I'm not going to lie, I thought what they did here was effective in having it be seen by us and not the characters in the story. I know not everyone is a fan of this, but it is creepy to me for sure. What I also like is they play with other dimensions a bit as well. There's a closet where Edna believes it started. Sam goes into it and we see a mirror of the house that is in worse shape. It is covered in mold and it seems this world is bleeding into ours. What I like here though, Edna claimed earlier that the house seems too big now that her husband is gone. There might be some truth to this.Since I've already moved into it, I thought the effects of this movie were well done. Everything was done practical for the most part. The allegory of the mold we are seeing was one I really dug and if there was CGI, it was used seamlessly in my opinion. The entity we see creeped me out as well. Influences are of Asian cinema and I know while watching this I said I had the vibe of like Ju-on or Ringu so that makes a lot of sense. I do need to give credit to the cinematography as well. It was shot very well and I enjoyed the use of mirrors. It plays in with the other world as an allegory as well.Next I want to take this to the acting of the movie. This is really a cast of three with some support from others. Mortimer was really good as this middle generation that has her own life and is trying to do right by the woman that raised her. She is just a solid actress in general and I'm not sure I've seen in her a bad role. Nevin is really good as the old woman. I love how natural she plays this as someone who has Alzheimer's. She is one person and then different in the next scene which is in line with what I've heard about this condition. Heathcote is interesting as well in her role. She does some investigation, but I also like that she's not jaded by the world yet.Now with that said, I really dug what this movie was doing. I will say that I had my expectations a little bit high as I heard how scary this was. I even braced Jaime for it. I did find that it had creepy parts, but it definitely wasn't as scary as I was expecting. That is not to say I was disappointed or anything like that. I think there are some really good concepts and I dig the underlying allegory. The effects were good and I thought the acting was as well. The soundtrack fit for what was needed and the use of sounds from things in the movie did help make scenes even creepier in my opinion. Overall I would say this is movie is good. I will probably try to give this another viewing before the year ends to see if this is a contender for my final year end list.My Rating: 8.5 out of 10SPOILERS:The truth of what we're getting here is that Edna has dementia. This isn't new as it is in the synopsis. What it is though the entity we're seeing is a manifestation of her disease attacking her and trying to take over her body. I found this to be rather interesting as James was dealing with the grief of her grandmother who dealt with same type of ordeal and what decision needed to be made.To take this even farther, I believe that the hallway that Sam goes down is a representation of going into the mind of Edna. This hallway and the other house is where she as missing when they got there. When Edna goes back in, she completely succumbs to the disease. She isn't the same person that she was when she went in. I also like that there's a bruise on her chest when was found earlier in the movie. It is spreading and she is stabbing herself later, pulling off skin. This is her trying to stop it, but finally giving in.The last bit that made me tear up here is Kay and Sam finds their way back as well as the new Edna. They go to leave, Edna says Kay's name. This causes her to stay, as her Great Grandfather passed away alone. Kay helps remove the skin and comes to terms with her new mother. She won't let her die alone. Sam also joins them and we see that Kay has a mark on her back, signifying this ordeal will carry on in the next generation. It is an interesting movie dealing with grief and the struggles of someone changing due to dementia."}, {"id": 192, "text": "Slow burn horror, right? OK, this whole movie could have been, should have been the idea that sparks A MOVIE. It has no concept, no answers, just loose ends and very elegantly ignored things that happen. I was so happy when the girl has found that mirror evil side of the house. Finally, yes, SOMETHING IS GOING TO HAPPEN! But no... and the mold... that bloody mold... what? Why? Who were that couple (was it a couple? Or a man? Or a woman?) who had died in that cottage? Whose was that cottage? Where was it? Why did that stupid stained glass window transfer ze evil from that cottage? Was grandad an occultist? A maniac murderer? Or he just died... or did he go black too? What happens after you go black? You die? Are you going to scare your family? A movie has loose ends, open endings to you too ponder. This... thing... lets you imagine the whole script, because there's none."}, {"id": 193, "text": "Was excited when I saw the trailer and was wondering how a director would get a feature film debut with a big budget with a known British actress and Jake Gyllenhall produced. This film explores dementia but with no heart or emotion at all. Where is the soul of the film? I felt nothing. At moments there are cool creepy moments but its so disjointed in storytelling. It jumps from flashbacks to present time and trying to be super stylistic to cover up the lack of a compelling story. Give me something to remember, something I can talk about. Shot extremely well, great lead actress but wasted here. Great VFX but thats it, there is no story here worth your time. So disappointed. This is another poor attempt at an Aussie supernatural film. Dont be fooled by the great polished images, sound and VFX, money buys those things but you cant jazz up poor storytelling. This was so slow, you cant call it a great slow-burn film. Great slow burn storytelling is Better Call Saul."}, {"id": 194, "text": "All we can see in this entire movie is 3 faces and a evil house."}, {"id": 195, "text": "Irrelevant title ok, slow and boring first 45minutes ok, but also in the ending not explaining anything ? too much . good potential good atmosphere, but nothing else. waste of budget and good camera and producers"}, {"id": 196, "text": "First off there are few things done right in this movie such as tone and acting, I should give it to that and deserves a 5 stars for that. But the rest is all over the place.Whenever indie writers can't find a proper way to go on, art comes to the rescue. This movie is clearly a drama about fear of death, guilt, solitude etc. probably it was a short story at first. But of course it would be so dull and some horror elements added to make it more..Some other poster said ending might be explained as accepting change (one idea). But it doesn't explain the place inside the walls and shadowy figure that grandma scares a lot. Dark figure might be grandpa, alright but why no one can see it except grandma. In the end grandma becomes one and in order to justify this problem, dark figure was hiding under the bed at one scene. But mother didn't see it or see it and ignore it, we don't know. So it might be real or grandma's hallucination, we'll never know. Cheap manouver if you ask me. Also if it was all about change, why grandmother was attacking them, almost to kill. Her daughter got those bruises at the end. How about her granddaughter? I mean list goes on and on.Genre doesn't matter at all. After you watch something for 90 minutes, you want it to be fulfilled. I'm fine with slow burners however I need consistency at least.In short, touching both reality and spirituality means you're threading on thin ice and metaphors won't save those unexplained so-called horror tricks."}, {"id": 197, "text": "This Movie Deserve More Stars Than 6..Cause It Added In My List Of Movie With A Message_The Movie Focuses On Dementia With Great Hidden Meaning..It Showcases That How Actually Dementia Occur? It's Various Stages With A Great Contradictory Horror Scenes That Actually Not Horror Rather Than It's Showcases True Condition...The Movie Is Literally Amazing_I Like Those Movies Have Hidden Details Like It Follows."}, {"id": 198, "text": "I'm a big horror fan and I feel like I've seen it all. I love horror but it pretty much never scares me anymore. The overuse of jumpscares and clichés in horror is overwhelming and mostly makes me annoyed. I selected this movie to watch just out of curiosity, and that I simply can't find any good horror to watch anymore. It blew my mind. Was a long time a go I felt so much unease as I felt during this movie. So different and so refreshing. So many emotions mixed into it. Only downside was that it ended too fast.I truly recommend this movie."}, {"id": 199, "text": "The worst horror movie I've seen in my life nothing scary , all the movie we just her mom mom mom !!!!!"}, {"id": 200, "text": "Can someone please explain what that was all about? Bizarre plot, trying to be mysterious, suspenseful, but failed, by being too clever, and unfortunately, didn't get the message across to the audience."}, {"id": 201, "text": "What questions burn unsaid in a family's past? Will the flames grow until all is ablaze? This film explores why people act the way they do, how searching for the truth can lead to answers that are impossible to accept and how we might all be doomed to end up like our parents. In the Sundance theater I know we were all stunned in horror for the last 15 minutes! There is a difference between boring storytelling vs foreshadowing and slow suspense building. Action and substance with a phenomenal women cast!"}, {"id": 202, "text": "The movie is just Carrie but not as interesting, it tries to be woke but fails. This movie is one of those movies where you keep checking how long is left, the ending is so stupid, WHY WOULD THEY HUG THEIR KILLER GRANDMA???? The ending really shows how retarded the characters are. Overall the scariest part of the movie is how long it takes for it to actually be scary, this movie should be a drama, and ONLY a drama, I watched this with my family and my dad hates horror movies, but he didn't even flinch, so yeah, not the best."}, {"id": 203, "text": "What an amazing and unique horror movie this is. No any ghosts, spirits or supernatural stuffs. Just pure horror and terror with an unimaginable and fantastic ending, along with maintaining a sufficient level of tension throughout the movie. Definitely worth a watch!"}, {"id": 204, "text": "Probably one of the worst movies i've seen. Omg just awful ! I'm literally thinking who should get nr1 in the hall of shame . Is it babadook or this ? Please save yourself the time !"}, {"id": 205, "text": "This was a waste of time. It has so much potential and it was completely wasted. Storyline changed twice, scenes didn't make sense. I want my $7 back!!!"}, {"id": 206, "text": "I was practically jumping from my seat during the last half hour. How creepy was that? Were it not for other viewers interpretations I would not have concluded the events were possibly a metaphor for dementia sufferers terrifying experience with the ailment. Or another point of view suggested in a review was that the family members have a genetic disorder.This film definitely leaves me puzzling over whether there is a definitive conclusion we viewers are expected to reach, or was the intent for viewers to question and determine what occurred to three generations of women in the family on our own. The house itself evolved becoming more and more frightening as well.I cannot say I enjoyed the movie but I'll be thinking on it instead of sleeping. I recommend Relic but for me this film a one time watch due to the rather chilling claustrophobic feeling I had during the last half hour or so.The three actresses were great especially Emily Mortimer and the story was quite original."}, {"id": 207, "text": "RELIC (2020) ***1/2 Emily Mortimer, Robyn Nevin, Bella Heathcote, Jeremy Stanford, Chris Bunton. Disturbing domestic horror with overtones of Poe - a woman and her daughter (Mortimer and Heathcote, both excellent) are informed by authorities that her mother has been missing, prompting them to visit her home to search for her. What follows is a bleak, sad and ultimately terrifying discovery of possession, a family curse and an apt metaphor of one's home for one losing their mind. Newcomer filmmaker Natalie Erika James - who co-scripted with Christian White - vividly captures the haunting of a family and the devastating outcome in the process with able support by veteran actress Nevin as the matriarch unravelling. Beautifully shot by Charlie Sarroff and an epic sound design by Robert Mckenzie underscores the pinpricks of good flesh expertly."}, {"id": 208, "text": "The acting was 10/10 the quality was 10/10. All the stuff you need to bring someone in we're great.My biggest issue wasn't with how slow the film was, that's fine. My issue was the final 5 minutes of the film. You're dealing with a subject that every single person on Earth will suffer with, the death of a parent. To some, this is the worst day of their life, and while I'm a massive horror fan, the fact that they made a mockery of the death scene rubs me wrong. This thing, demon, monster...whatever has taken over the mother, and yes there is still a sense she is in here (hand holding scene)...and some could argue that this was an act of undying love...I just felt it makes a jokes out of this issue. Here's the crazy thing though...I can't put my finger on WHY. I can't figure out why this was just sick.Did anyone else watch this scene, and think I feel so awful for anyone who has lost a parent to this illness that they decided to turn into a demon possession and the daughter hugs the thing??Maybe that's what turned me off...was that they had a very serious story going, and then you throw in some cheese ball plot twist.I know this will confuse many as to my dislike for the ending...and I'll likely get hate for it, but I know there's someone else out there who just felt this was a tasteless ending."}, {"id": 209, "text": "SPOILERS EVERYWHERE!I found this movie beautiful and dark. Scary and sad. The acting was very powerful and sound was used in such a way to make up for the dark lighting throughout. You must suspend your disveirkd to watch this, not expect jump scares and just settle in for the ride. If you're expecting a horror with lots of murder/blood and guts - THIS IS NOT IT.I was expecting it to be about some kind of entity for most of the movie, especially with the reference to the window from the old house that was put on the new, and the primordial clicking/throat noises throughout, but as time wore on it became apparent that this was more like the Babadook and cemented in the horrors of dementia.So brilliantly done with the earlier generational aspects of the family. I think the decay/moul/rotting is a metaphor for the decay of the mind, the weird corridors making the viewer feel like the walls are closing in and gravity is shifting, we don't know which way is up or down.What Sam experiences in there is a physical expression of what her Gran is going through, and she can likely look forward to. She'll go through this with her mother first and then it will be her.I was most frightened during the corridor scenes, I stared feeling all Blair Witch panicky when Sam was first lost in there and then it kept getting worse, I felt so claustrophobic and sick- what about you? Brilliant of the writer/director to make me be able to experience a bit of what it feels like having dementia.Poor Gran/Edna. I just wanted to hug her when she was asking Sam where everyone has gone.I think the James, the neighbour with Down syndrome served 2 purposes: 1. To throw us off the trail and keep thinking it was an entity. Like when Sam asks him in the house and he acts scared and says no and 2. To help Sam's journey in realising what is going on with her Gran. The story about him being locked in the cupboard makes us, the viewers, angry at Gran, and when she calls him the name', in the same way it does to Sam. And before all of that Sam was stubbornly siding against her mother with her Gran. And poor Sam is weighed down with burdens and doesn't know what to do, but is trying her best, even with no one on her side.The dreams that Kay was having about the old house (and the great grandpa who died the same way, that also throws us off trail) are her fears of the same, being much closer to the time. And that's why she can't leave her Mum there in the end, she shows compassion not only because she loves her mum, but she realises the weight of all of this, it's her future.I loved the use of the window as a symbol of heritage &amp; family.So in the end there is no entity, despite the gory reveal of what's beneath Gran's decaying skin. I love the juxtaposition of emotion in this scene: how repulsive the skin peeling is, and how lovingly Kay pulls it away, finally accepting that this is now what her mother is.The very end where they all lay on the bed and Sam finds the bruise on her Mum is such a great finish, the three generations of women laying there, exhausted, frightened but still wanting to care for each other."}, {"id": 210, "text": "There are very few movies that everyone loves. Some of the best ones are hated as well as loved. This is one of them. I thought this was a great way of exploring dementia in a very visceral way. It takes the audience on a journey and makes them explore the mind of someone who is a victim of this degenerative condition. It all seemed to be very straightforward and easy to understand . I can't understand why so many are scratching their heads. Give this a chance. It has something to say."}, {"id": 211, "text": "More a drama than a horror movie that I cried at the end of it because I was so impressed by it and how it pictured the Very tragic effect of dementia, Alzheimer or senility on our beloved ones and make them into aliens for us but that's when they exactly need our love and support to the most."}, {"id": 212, "text": "You would appreciate this film if you have an aging family member dealing with dementia and/or even Alzheimer. At times, especially toward the end, I found it emotionally difficult to watch, not because it's too scary (it's really not) but rather because it reminds you of the depth of damage inside the mind of a person dealing with dementia, and the suffering of loves ones. At the very end you get a nice little reminder that this condition may very well come to you one day.Nice work. Thank you."}, {"id": 213, "text": "... much better if you know the true story behind the movie. I recommend you search the internet for the explanation of the director, AFTER watching the movie. Then the movie makes much more sense."}, {"id": 214, "text": "Like THE BABADOOK, VERONICA and THE POSSESSION this film makes a real-life crisis manifest itself as a supernatural apparition. Here the horror of watching a loved one physically and mentally decay and eventually die is given the form of a haunting. I believe that if you have been through something like this yourself you will recognize it and be reminded of these situations. That certainly is how it was with me. It made watching the film painful and hard sometimes. This is not popcorn fare but an intelligent and relevant use of horror elements to tell a story worth telling. I wish they had toned down the sound effects though, Most horror films use bass rumblings, but this one overdoes it."}, {"id": 215, "text": "Full of depth, metaphor and atmosphere!!This movie stuck with me right through the night with it's heavier take family dissociation, mental health and the manifestation of some more super natural.Another Aussie horror classic."}, {"id": 216, "text": "This is not meant to be the usual horror movie, and if you see it that way, you're not getting it! This is a brilliant movie depicting the horrors of dementia, through the eyes of one having dementia, and also through the eyes of family / carers. Excellent portrayal of such a debilitating disease."}, {"id": 217, "text": "Lots of reviews describe it a a slow burn and then they are angry about it. Isn't that the point of a good horror movie. It should slowly draw you in. I think this does a good job of getting you introduced to the characters and then presenting - slowly - the conflicts and they oddities of the house. It is very real in the way the two girls are handling the elder care situation of their aging mother and what todo with this old house. And then things start to really unravel. I thought it was believable. If you are looking for chainsaws and blood splatter, this is not it. It you looking to get lost in a very realistic creepy story, here ya go! Family Friendly?... Some swearing Some smoking Tough situation for children or anyone if they are upset by elderly people involved with violence and dementia"}, {"id": 218, "text": "A film about dementia and Alzheimer and how families are not prepared to deal with these situations as soon as the transformation caused in the patient, dementia transforms and deteriorates the body and the mind, it is a drama with a little touch of terror fantasia.I liked if seen has a figurative drama.the performances are excellent."}, {"id": 219, "text": "A very strong cast and performance by all. It was beautifully shot with such a sinister feel. The music and sound design really pulled you into the film. The metaphor was very obvious throughout the movie but the execution and set pieces sold it well.It was a scary look at what countless individuals go through and I only hope that people never have to suffer as much as this. Its a hard watch but an important one. Here's hoping more people can see past cheap thrills/jump scares and give this movie credit where it's due. A solid suspenseful horror."}, {"id": 220, "text": "Very clever film dealing with a very upsetting condition. Late-onset dementia and its affect not only on the sufferer but their loved ones.Edna is an eighty something who lives alone in a typical wooden house in the Victoria, Australia countryside.The film implies she is unwittingly neglected by her busy daughter Kim who doesn't contact her from one week to the next.When Edna goes missing Kim is forced to intervene. Revisiting the home for clues to her whereabouts and helping police enquiries admitting her weeks on end last discussion with Edna.Edna reappears a couple of days later with seemingly no idea where she has been. Part of her mental condition.Kim makes an exploratory visit to a nursing home in Melbourne that may provide Edna with the care she needs.Meanwhile Kim's own daughter Sam offers to move in with Edna allowing her to stay at home.The film deals with the impact of Edna's dementia on three generations.Directed by first timer Japanese-Australian Natalie Erika James, the film reminded me of a psychological Japanese horror film.The crescendo of the film involves haunted goings on at the house, the appearance of mould like marks throughout the film and the mental loss of Edna even though she is physically still alive.We see Kim peel back the layers of Edna's skin to reveal a smaller, timid shell underneath. To signify her mother's descent to the dementia condition.Finally the film has an opening for a sequel when Sam spots a patch of mould mark on Kim as the three generations sleep. A revelation that Kim to will be afflicted by dementia?Interesting, little psychological 'horror' more independent art house than your jump scared filled Hollywood B movie even though there are a couple of jump scares in this film!"}, {"id": 221, "text": "A disciplined and stylish slow-burning nightmare. While it does feel similar to most contemporary horror, it stands it's own ground by focusing more on atmosphere and tension than cheap jump scares and bad CGI. When it was over, I felt like I literally had just awoke from a long, creepy dream. Just as certain inanimate things in the film seem to be alive, the movie itself retains a similar value - it somehow feels more like a living thing with a mind of it's own. rather than just another film. Still, it's an immensely slow-moving experience and in the end there aren't really any blatantly cohesive points, but the eerie vibes are off the charts."}, {"id": 222, "text": "If a horror movie visualizes something that otherwise would not and cannot be seen, is it something you like? And I'm not talking monsters in particular. Rather something that Imdb itself reveals almost instantly under the title. Having said that, the visual treatment and the allegories are there and ripe for picking an depicting. Doesn't mean it will float your boat or that youl will like the movie, especially considering the slow pace.Having said all that and with 3 female leads, this can annoy some people for different reasons. It would be a shame though, because if you are in the right mindset, you will be scared, entertained and have some food for thought too. Great performances all along from everyone involved. Try to go with the slow flow to get the most of it"}, {"id": 223, "text": "I really liked the first half of the movie - it was dark, atmospheric and unsettling, however it quickly fell apart in the second part as it threw all the plot and realism out of the window in order to be artistic and metaphoric, which might be ok in some movies, but in this one I just didn't feel it.Scenes, which should have been unsettling started to drag and became almost comical. I just couldn't get over the fact, that characters were not reacting to what's going on like real people and in the end it all felt like one drawn out dream sequence.I'd still give a soft recommendation if you like atmospheric horror, not riddled with jump scares and copious amounts of gore, but have in mind, that overall this is a very hit and miss experience."}, {"id": 224, "text": "Watched this with my cancer stricken 59 year old mom and 22 year old younger sister.One day we will all grow old and crazy.The character's names are Kay (Mother), Sam (daughter) and Edna (Grandmother)The story centers around a an Australian family. There is a mom who comes back to her mother with her daughter. It turns out that this house is infected with a black mold that causes senility. The elderly mother was missing and then one day she reappeared. But she wasn't quite there.She grows mad threatening the mother and daughter's life. By the end of the movie there is a secret other world that encloses on the daughter. But then she escapes.Relic doesn't end well. Kay refuses to leave so she stays in near the grand mother as the mold devours their house. Kay peels back all of her skin revealing and old withered black corpse that still breaths. The family lie in bed. Sam realizes that her mother has the same mold illness as Gran has.Relic is so sad and disturbing I could not fathom it. We are all weak beings slowly dying."}, {"id": 225, "text": "Film was boring. Characters were boring. I even paid $10 to Stan for that crap 😔"}, {"id": 226, "text": "Relic is a well shot movie with three main actors doing really well. The only thing I really missed (for such kind of movies), are some intense horrifying scenes or goosebumps moments, that I got e.g. in the first Conjuring movie - but maybe as a strong connoisseur of everything regarding the art of horrors, my nerves are too hardened by watching too much horror, but on the other hand, getting some terror in the hearts and minds of your audience is in my opinion the true art of making a horror movie. Anyway, Relic is a solid contribution to the genre and for sure you can waste your time on many far less entertaining movies.Last note: of course, one could take the story of Relic as a metaphor to dementia or such kind of illnesses (or just getting old: the last scene reminds me strongly of the Triple Goddess: the Maiden, the Mother, and the Crone), but this would not change my rate or my review in general."}, {"id": 227, "text": "Disturbing and suspenseful. That house creepy. Acting was great. I'm not sure if it is a real condition that exists but it is sad"}, {"id": 228, "text": "This is a movie that's been my radar all year long. It's got solid reviews, it's a horror movie, and it's a movie that seems like one that is handled with complete class. Where the director-writer cares about what they are making.And after watching the movie I can safely say that the movie definitely was handled with class. Let's first start out with the acting, everyone is this one movie is incredibly solid. With the actress playing the Grandmother probably being my favorite of the main three. She really manages to perfectly convey the complete emotional and mental swings that a person with dementia goes through. One moment she's her normal self and absolutely refuses any help from her daughter or granddaughter, and the next she seems like she's barely there and she almost is like in limbo. Where she's alive and breathing but her mind is in a completely different place.Next, let's talk about the cinematography. While I liked the cinematography quite a bit, I will admit that these low-budget classy horror movies nowadays seem to always follow the perfect center of framing shots. While I'm not complaining as I love cinematography that seems well-planned out and has some structure to it (as I do for screenplays), it's just that I guess I would like some variety in how the shots are framed. But, overall a very well-shot movie that is also very well-lit, too.And of course let's talk about the writing and screenplay of the movie. Every character is well set-up in this movie, with each character having their motivations, and the audience getting to know where they are in their lives and how their relationships are with one another. But one of the best parts of the screenplay for me is definitely the underlying metaphorical stuff that is written into the script.While yes there are people out there that will want to and will interpret this movie as a literal horror movie, it most definitely isn't. With both the Grandmother's body/skin and the house serving as physical representations of dementia and decaying of the mind. And while I don't want to get too personal, I will say that the themes of this movie certainly hit incredibly close to home, to the point of the movie bringing genuine fear and emotion out of me.And there are some people who will be confused by the ending, as well. I'm not a big brained individual, so if I got the message/ending of this movie I'm certain most people will, too. With the overall message and ending being that with dementia comes a complete new version of that person, which is why Grandma turns into a completely different being when all of her skin is pealed off. And the daughter decides to stay with her, saying that they cannot leave her, and she finally comes to terms with her mother's dementia and accepts it (like the final stage of grief).Overall, this movie is very well-acted, well-shot, well-written, and just overall well-made. I would very much recommend it to people who are into dark character dramatic movies, but I would not to people who want a horror movie like a It:Chapter Two.Final Rating: Flip flopping between a 7 or 8, and it will probably take me awhile to decide."}, {"id": 229, "text": "Just watch the last 30 minutes from the end trust me the early are wasted"}, {"id": 230, "text": "The only reason I gave this movie 2 stars was because it was I focus. This movie try's to be moody, and mysterious. But it all fizzles our in the end with a totally underwhelming, lame, ending. Don't waste your time."}, {"id": 231, "text": "Did you ever want to experience the misery of watching your beloveds to pine in front of eyes suffering of an hereditary disease that you will probably inherited and to be completely powerless to help them? That's your movie. It's a masterful crafted movie, Gothic, beautiful and sensible and I would recommend it to anyone to likes to being sad."}, {"id": 232, "text": "The story feels incomplete or not fully realized. Such a disappointment, production and cast did an amazing job, they all deserved better than this script imo"}, {"id": 233, "text": "This movie was actually pretty good. Is it the best I've ever seen? No, but it's worth a watch, especially if you have had someone suffer with Alzheimer's, Dementia, Cancer, or something that eats away at who they are. This movie was allegorical and in that it was a bit of a slow burn, but movie raters/critics are so jaded these days that if things aren't exploding or popping out at you every 30 seconds from the opening scene they're bored. Get over yourself. Watch a movie and appreciate it for what it is and the story it tells, not just it's special effects and scare factor. I watch plenty of movies that move fast and have scary scenes that suck because the story had no purpose and didn't make sense. This one did. It showed the journey of a women and her daughter and grand daughter slowly being affected by her undiagnosed Alzheimer's Disease. It is represented by a creature like entity taking over her and her house transforming into a strange dark place the longer they stay there. It was satisfyingly eerie. I would say it is similar to Aronofsky (who also usually doesn't get great reviews because most people that watch his stuff, it flies right over their heads, and how are you expected to like something you didn't even grasp? Lol) I feel sorry for all the people missing out on great movies, stories, or messages because all they care about it entertainment. It's not all about the beat, it's about the lyrics. Give this one a chance."}, {"id": 234, "text": "Disappointing all the more because of the potential it had. Good cast, atmosphere, but nothing ends up making sense. It would have been much, much better keeping it a drama about getting old, lonliness, family relationships and guilt, and dementia."}, {"id": 235, "text": "Had potential. I get it... movie is a representation of dementia.. but could be done better."}, {"id": 236, "text": "The description is deceiving. This isn't a Horror movie or a thriller. It's someone's take on the fear we experience watching our parents grow old. Not scary. Not interesting. Just sad."}, {"id": 237, "text": "I was so surprised watching this film.I was expecting something more horror-driven but was surprisely pleased on how good it handled the story and delivered at the ending. An excelent mix of horror, suspense and human inner conflicts."}, {"id": 238, "text": "Relic is one solid Australian horror film that has some creepy vibe around it and use of darker surrendings was a great touch in it,i know that some people complain that they didnt seen nothing but to me it added a very good dose of unsetteling moments and nice use of atmosphere ,characters were little weird and because of that you may not be able to connect with them,but i was somehow able to do so,and i felt every emotion they felt and every fear they experianced,this is also very good drama that showcases how demantia can easily ruin families and how much people suffer because of it,Relic was a interesting horror drama"}, {"id": 239, "text": "This movie screams METAPHOR ALARM throughout, and I knew that film buffies - being suckers for ALLEGORY (this word gives them boners) - would praise the movie just because it is about dementia as much as about creepy crawlies. Film buffies get excited over movies that have a deeper, socially relevantunderlying message. The irony is that when buffies get a truly intelligent, profound movie they don't seem to get it; such a film goes way above their heads. They only like metaphors for the simple-to-understand, common every-day things such as dementia, which many people may have been in contact with through a relative.Me, I am not that bothered with the underlying layers of this film, let alone its social relevance. Dementia is such a depressing subject, why would I want to muse on it during a 90-minute haunted house flick?The film opens eerily, quickly establishing music and especially sound as its main communication devices. Most horror film directors underestimate the effectiveness of SOUND, which often can be far more unnerving than blurry cliché images of shadowy figures moving through a house. The use of sound is the best thing about the movie.The use of almost colourless, drab grey tones, however, places it squarely into generic ugly modern horror movie territory. There was no need to do that. You can apply colorful images for a drab, gloomy story, but I guess most directors are too insecure about their own abilities hence resort to playing it safe by making the movie look crap and depressing to reflect the mood and the themes. So stupid and unnecessary.The beginning is good, and most of the conclusion (all the running through mazes), but the script gets lost in-between which is when it kind of meanders somewhat aimlessly as a basic female drama as much as a haunted house film.I'm not too crazy about the last scenes though. Ugly and depressing, but not in a fascinating horror way, more in a dreary sort of let's accept that granny is now a monster kind of way. Still, the ending is original, I'll give them that.The movie stays away from annoying jump-scares and other such garbage, and features a Down Syndrome actor which I found interesting and refreshing."}, {"id": 240, "text": "This unexceptional and pointless horror attempts to combine the fear of an unknown and malicious entity with the terror of having to care for an aging parent. It begins promising enough, with a mother and daughter worried about their missing matriarch and her empty house. The mystery of where she's been doesn't end when she shows up at the house unexpectedly, apparently fine and with no interest in talking about where she's been. The movie does a great job initially, ratcheting up the tension and creating a strange, ominous vibe, but it doesn't take it anywhere. There's not much to be afraid of and the climax, if one can call it that feels empty and hollow. I was very disappointed with how this film ended."}, {"id": 241, "text": "This is potent film making. The horror is acutely felt. The truth about old age and the state of Mind (due to dementia) of the person suffering it is portrayed in such a way that it is disturbing. No, doubt watching this one would relate to his/her own parents, which makes it all the more dreadful.I think this is Oscar material."}, {"id": 242, "text": "I went to see this thinking it was horror in the traditions way. It just isn't. It's a story full of symbolism. Three generations together, pondering on the same problem: the degrading consequences of loosing control in every aspect. Which make the youngest so confused, she looses her way. The real horror is that Alzheimer is a family thing, to grasp barely that the person that once was loved isn't there anymore. What provokes hefty emotions, this horror is played out, and that takes the time as these processes are slow, in the beginning, but go faster toward the end. The pace of the movie echoes that tempo. I felt cheated at first, no traditional horror. But I was rewarded afterwards having seen a different kind of horror, that many of us experience or will be experiencing."}, {"id": 243, "text": "A laboriously long drama with a dash of lacklustre 'horror' to make the journey worth it? It didn't."}, {"id": 244, "text": "This is a slow burn crap film that I slept after 30 minutes. Then I continued watching and found nothing was happening in the film just some weird sound but nothing else. Not creepy or scary at all. I recommend to watch Babadook and don't waste time with this one. I give 4 star for acting. 4/10"}, {"id": 245, "text": "A children can make a movie better than this. the story line the characters the story,everything was meanless.what the point?grandma changes to a what?a black what?why?this movie was awful."}, {"id": 246, "text": "A waste of time you need....foolishness should be the genre"}, {"id": 247, "text": "Meaningless, boring, blurry, total waste of time. It is like the worest movie ever made."}, {"id": 248, "text": "I watched this movie thinking it was a typical horror flick. I enjoy those, so there's nothing wrong with that. But this was something else and I am grateful. I actually watched it with someone who did not understand the 'message' of this film and it's really important that you do. Dementia or alzheimer's will but both parties in an uncomfortable and horrible position. The person you love, and have always known, will change and become unrecognizable at times but they are still there. In need of love beyond all that. I feel like the final scenes of this movie portrayed that beautifully. So I loved it."}, {"id": 249, "text": "A boring non starteer, no start , no middle and a poor attempt at an ending, just drab, dull lifeless for 90 percent of this bore fest, a few moans and groans and a cracked bone or two from the old woman at the end. its just meh, dont bother , honestly."}, {"id": 250, "text": "This movie is a pleasantly surprising family drama with a dark artistic twist. I really enjoyed how it culminated and genuinely felt rewarded for sticking with the movie until the end. Good tone throughout. Good direction.. It's worth a watch if you like atmospheric horror that leans on a more artistic edge."}, {"id": 251, "text": "Can't believe they cud have done so much better....the accent is overly aussie to put off global audience and the acting is omg just the crappiest for a slow burn horror and the sounds music are not done correctly..."}, {"id": 252, "text": "If you're into gore, slashers, jump scares, and/or creatures, this is not the film for you. This film is packed with symbolism and very little actual horror. If you liked The Babadook, you might like this one. I really enjoyed this movie, it isn't perfect, but I think it's worth a watch. The pacing was a bit slow, but it was a slow burn to a fitting ending. The film is filled with unease and builds as it goes. If you can sit through one viewing, I think it's worth a second to see what may have been missed. The real horror in this film is dementia. I have someone in my life with dementia and it was heartbreaking to see what the grandmother went through, especially at the end. Dementia will turn someone you love into someone you barely recognize as it consumes them."}, {"id": 253, "text": "This movie's boring, nothing happens = I can't appreciate genuine film making and need loud noises paired with fake scares for cheap thrills to be entertained because I can't be left alone with my thoughts.'Relic' is not for everyone, not even for those who will enjoy it unless they are in the mood for a movie that artistically depicts the horrors of generational mental illness without making it look cheap or trivial. It gets into your guts and leaves you feeling terribly. It makes you think as well.An intriguing character study, 'Relic' is a well-executed movie that makes the best use of everything it's got despite a modest budget. It's not a feel good movie, it's true and authentic horror that will make you dread getting old and going demented. Polarizing and haunting. Worth a watch on a rainy day"}, {"id": 254, "text": "This has an ok concept but script could of been a lot better and execution much better. Has some ok moments but it just doesn't quite work."}, {"id": 255, "text": "The release of this film was really good timing, while we are witnessing our senior citizens dying in the care homes during the pandemic.It, the monstrous aging process, when coming, is so difficult to look at, we prefer to leave it in the ruining old houses or care homes, instead of keep it in our own household and take our responsibility. Then something like pandemic disaster happen, we can just blame it to the health care system or to the government. I guess this film probably make a lot of people uncomfortable.The dim lighting and the setting were just perfect to make the wistful statement. The three main actrices were excellent in their acting. Bravo Natalie Erika James."}, {"id": 256, "text": "Very slow movie and the characters are shallow. Barely get to know them before the movie ends. Nothing unique to it, and the horror elements are limited."}, {"id": 257, "text": "Dark, strange and extremely well executed. I quite enjoyed this creeper. You can sense this is a personal theme the director is dealing with. An interesting metaphor of dementia in the form of a horror mostly drama film."}, {"id": 258, "text": "Normally I find myself siding more with film watchers then with film critics but this one definitely went against the norm for me. So many of the reviews posted here seem like the reviewer must have been watching a different film from the one I viewed. It is definitely a slow burn kind of movie but I found it to be quite gripping. The last 1/4 of the film had my adrenaline pumping and I found myself on the edge of my seat, literally. The atmosphere and cinematography were absolutely phenomenal and the performances from all actors involved were top notch. I have had the experience of caring for a loved one that suffered from dementia/alzheimers and this film depicted many aspects of that experience to a t. I dont want to give anything away but if you are a fan of atmospheric horror with a deeper meaning then do yourself a favor and invest the time to watch this. I dont think you will be disappointed, I know I wasn't."}, {"id": 259, "text": "Love the soundtrack and the creepy atmosphere, but that's it. All characters are charmless and not much is happening through out the movie. I love me a slow burn, but please give me something."}, {"id": 260, "text": "Good movie up until the last 10 mins, the writers must have runout of ideas clearly!!!"}, {"id": 261, "text": "How many families are overwhelmed by dementia as it takes hold and tears the family home apart, terrifying those diagnosed and their loved ones.This film faces that frightened reality that the western world has tried to sanitise and hide away.Rip the face of such fear, face death with dignity and love... we are all heading towards it and we all need our loves ones fighting for us as we loose touch with mind, physical self, memories and what we loved.."}, {"id": 262, "text": "I got an early start on Relic, (because I live on my own I didn't want to watch in the dark). But really, I needn't have bothered. The scariest thing about it was the eerie, unsettling music...it was the only thing that signalled a sense of foreboding and menace. The performances were good but it didn't do what it set out to do. I wasn't scared at all! I was a bit disapponted."}, {"id": 263, "text": "Excellent horror movie. It has everything, the suspense, the scares, the atmosphere, some gore, a good story and the moral or social commentary if you will. It's amazing what they've been able to do with so few actors. I don't want to reveal anything specific and ruin it for you, but you should be able to understand the title of my comment by the end of the movie. I don't get all the negative comments. I have been watching and enjoying horror movies for 30+ years, I know a good one when I see it. I highly recommend this one."}, {"id": 264, "text": "A subtle horror drama that tries to ride on the Herediatary wave but really does not come close to its perfectionism. It has interesting characters and some good performances, especially noteworthy is Robyn Nevin who really steals every scene she has in and has a great character she even pulls to perfection. Emiliy Mortimer is good as well. Bella Heathcote is okay but she feels a bit miscast. The film slowly builts up its mystery and is thrilling up to the climax when it somehow loses control over itself and just exaggerates. I think the concept deserved a better execution. It does have scares. It does have good characters. But it also disappoints at the end. Watch it for the great performance of Nevin."}, {"id": 265, "text": "Well this movie is pretty decent and kind of underrated. I didn't catch whole movie because it wasn't some kind of generic or basic with the same plot as all the movies. It's pretty nice to see that dementia was included in the movie also the ending was very deep seeing 3 generations and time lapse between them. I think this movie is not for ordinary person that is watching MARVERL/DC and etc. it's more like Bafta but deeper meaning movie."}, {"id": 266, "text": "Why is every movie these days ending without explanation??? Why does granny turn into e.t.? And now it got me wondering,was e.t. really just a crazy old lady?"}, {"id": 267, "text": "I mean the acting is good, it's a decent movie, but it's just a bit all too depressing, it's really a documentary or the horrible disease dementia. Set in a lovely scenic spot with good acting. I hate how they made this out to be something that it isn't. The stupid sound and creaking is too over the top as well."}, {"id": 268, "text": "From the start, I will say this movie will be altogether too slow for a few viewers, but in my opinion, people who can't watch horror slowly unfolding are really missing out on the best horror can provide. There are no jump scares here, no heavy handed soundtrack, blood and gore or horrifying monsters, or even, with the exception of the ending, really all too much action at all. What it has is carefully crafted atmosphere slowly dished out until the claustrophobia is palpable and the loss and despair is oozing from every surface, and remarkable performances by the leads that make us really believe the drama as it unfolds and make us invested in their lives. It also has, at its core, subject matter that may be all too personal for anybody who has dealt with the slow decline of a loved one, so I want to clearly warn any possible viewer that this is, in a manner of speaking, a commonly true story that might be very uncomfortable for some viewers.On the surface the tale is a familiar one... a house under a curse passed on through generations. The cinematographic elements are carefully chosen to make the home genuinely feel aged, imposingly looming, inevitably encroaching, and in a specific way, hungry. All of this is done with just directorial choices; well framed camera angles, creaks and shadows, the occasional off center lurking entities which you might even miss if you aren't looking in the right place. Our characters... 3 generations of women in a family, have come together when they thought the eldest one had gone missing, and once she is found they play out their relationships trying to deal with the obvious impending decline of her. The subtleties of this drama is, like real family dynamics usually are, told more through subtle observations of body language than any direct narrative devices, and all the while the house figures heavily into every aspect of it. At this level alone it is a superbly executed ghost story of sorts... but it is not this level that brings the real meat.I don't want to say too much about this deeper level but I need to say something since this aspect increasingly becomes so engrossing, so I will try to make it as enigmatic as I can. The house and the elder's decline are linked... the house is changing along with the state of its master, the forgotten passageways molding and becoming labyrinthine, and it becomes obvious escape is somehow essential. But how can someone escape the decline of age? Can you preserve anything from ultimately being lost: as time consumes all is there anything that can be salvaged? This is a tale of love and loss, memory and forgetting, pride and degradation, and time... and entropy. It is a depiction of a kind of relentless horror, saturated into everything around us... in the very atmosphere. It is what lies beneath our busy lives and our all too human skins. It is honest, horrific, and even, at times, beautiful from a certain perspective. I strongly recommend it to anyone who is wanting to slip into something deeper and darker than the average haunted house tale. But be warned, it isn't a thrill a minute, but it does go right for the heart."}, {"id": 269, "text": "I don't like obscure artsy movies. Also not a fan of comic 'book obviousness'. So if either of those forms of entertainment are your thing, go away, don't watch it and leave this brilliant movie to those of us who appreciate talented acting in something that is different without being unreachable. This movie is beautifully shot, the actors are involving and believable. Most importantly, it leaves you thinking, even days later I am having 'Aha' moments. I highly recommend it. It works on the obvious level, but if you recognise that every word, every frame delivers meaning beyond that you will have a more fulfilling experience."}, {"id": 270, "text": "Wowee wow wow. I clutched my pearls most all the way through the, well, the whole flick. Yikes. Ms. Natalie Erika James knows how to hold the tension forEVER. I couldn't look away. An elderly grandmother begins acting out in a demented sort of way out there alone in her old country house. Her daughter and granddaughter come to her aid but things could not be more difficult. Mostly all they do is say, Mum? Because it is all outside their realm so to speak. We hear bumps in the night and the beautiful old grandma seems to not be herself now and again. She shifts from sweet and loving to vicious and suspicious and back."}, {"id": 271, "text": "Beautifully filmed... great cast... LOVED the score. THIS is what good horror looks and feels like."}, {"id": 272, "text": "I've been awaiting the arrival of this film ever since watching the trailer a few weeks ago. It had that depth of darkness and a feeling of realness to it that I look for in a good horror film. Relic explores the subject of dementia in a unique fashion that will pull at your heart strings. Especially for those that have dealt with the illness first hand.Relic is essentially a drama which disguises itself as a horror film by using a few of the classic horror conventions and clichés. The metaphors provide the real horror here.The three main actors do a great job of conveying the story and deliver a wonderful performance that will leave you emotionally gripped throughout. Where Relic lacks, is in pace. At times it can be rather dull, long winded and only finally picks up in the last 1/3rd of the film.The climax of the film will have you on the edge of your seat and is easily the best part of the film. Those that don't like thought provoking, symbolic conclusions will probably want to stay clear of this one. Still, it's one of the more memorable endings to a film I've seen in a while and undoubtedly uncomfortable.This one is worth the runtime just for the brilliant score, ambiance and composition. You definitely need a decent pair of headphones or a nice sound system to get the most out of this one. The film is very dark, visually, it can be hard to make out specific details in most scenes. Obviously this is done to expand the creepy and unpredictable atmosphere but if anything, makes the film seem duller.It's not a 10/10 movie by any means but it does serve as a mildly entertaining way to pass an hour and a half of time. Especially if you don't have anything else to do or watch. Give it a go, you may like it.My retrospective on this one: sometimes you have to discard the old version of a person you knew and learn to love them for what they've become."}, {"id": 273, "text": "To start off, I've read a lot of good reviews about this movie, so I was hopeful that it would be a promising first movie by a new director, but it's just......eh. Twenty minutes in and I wanted to watch the movie sped up, it felt slow and nothing was really happening, I think that it was trying to go for a slow build-up but it just didn't work for me. I didn't care about the characters, I knew little to nothing about the ghost or whatever the whole black ash stuff was, and there was really nothing new or unique about this movie, sorry that this seems harsh but I felt like I watched a live-action version of a run-of-the-mill indie horror game. The dream sequences felt like they meant nothing and they were just repeats of the same thing, a cabin in the woods, a glass window, and the grandmother. I'm just disappointed and confused about how this movie I wasted money on got so much praise.It would've been fine as a short, indie, horror game, whispering voices, a few jump scares, and a few TURN BACK notes, and then an ending with a jumpscare. I get that it's supposed to also be a metaphor for Alzheimer's but I didn't really get to know the grandmothers past enough to feel bad for her memory loss, no flashbacks, pictures, or videos. I completely think that this movie would've been better off being a drama about a woman and her daughter dealing with the grandmother's Alzheimers instead of this weird supernatural mess. A good example of a movie that was able to perfectly do family drama and horror is Hereditary, there were enough arguments and somber moments to keep your attention as a family drama and there were enough creepy moments to keep you interested in how the horror was going to play out. However, hereditary is a movie that took a lot of detail, money, and had a lot more behind it than this movie probably had, no offense of course.But the director didn't use what they had to their best ability. On a positive note, I did think that there was one good emotional moment that displayed Alzheimer's, and I kind of liked the last scene in the movie even if I didn't understand what the hell it meant. But in the end, skip this one, keep your money, or watch a better movie instead."}, {"id": 274, "text": "Do you know the word Boring is the worst thing you can say for any artwork ? Better say its not interesting or has no substance or not inspirational.One hour and 5 minutes into the movie and absolutely nothing has happened. I should have gone for take out food eat it have a bath and let the movie play.Im saving you 1 hour of your life. 3 women wondering doing nothing inside a house for an hour. I can do that myself. Why do I have to watch it in a movie ??Movies are made to entertain you keep you company have a good time and something to talk about. Nobody has ever talked about anything that is boring in the entire history of the world.Movie has faded colours, shot in darkness, no soundtrack, nothing happens. I have more fun relieving myself in the toilet than watching this movie.If this was a stage play in a theater there would be more people drinking soda in the lobby than people inside the theater. Probably I would throw empty cans of soda at the actors for doing nothing because I paid for a play and nothing happens.Excuse me people Im retiring to the toilet where I have more fun there. Or anywhere for that matter."}, {"id": 275, "text": "RelicThis movie was just about ok, the director used the same tired tricks throughoutWaiting outside doors when I would just walk inWalking down dark corridors slowly with a frightened expression, when I would merely turn on the light and smileCreating unexplained actions and behaviours that could do me harm, I would just get the hell outta dodge.At the end of the movie we just had a bundle of unresolved questions with no attempt at any answer, I can give this at most a soft 5"}, {"id": 276, "text": "I may not be the sharpest tool in the shed, but I know a good horror movie when I see it, even if the ending leaves you scratching your head, which this one did. This movie dragged me in, peaking my curiosity with all of the flashbacks, weird sounds, and an older woman who you think in the beginning has been through some traumatic event and emerges out of nowhere without explanation. Pretty good setup. The acting is awesome from all characters involved. The plot is a slow burn, but you feel it building up to something although you're not given a clue as to what. Which brings me to my problem with the movie and why I only gave it a 7. It left way too many things unexplained satisfactorily to me. Just when I think we're getting to the climax of the movie, and things earlier in the film are going to make sense, well, they just don't. Not to me, anyway. And the gratuitous, suspenseful very last moment of the movie threw the entire alzheimer's premise out of the old cabin window. Why was that even necessary to add to the ending? Too many questions unexplained, so I assume it's either over my head or some things could have been left on the editing room floor."}, {"id": 277, "text": "I didn't really know what to expect when I sat down to watch Relic from writers Natalie Erika James and Christian White, aside from it being a horror movie of sorts. And a horror movie was all that was needed to make me sit down and watch this 2020 movie.Well, now that the movie has finished, I must admit that I am left with an overwhelming sense of 'was that really it'' and a feeling of having sat through an ordeal that felt like 5 hours and not just an hour and 29 minutes. Yeah, this movie was incredibly slow paced. And it wasn't really before 1 hour and 10 minutes into the ordeal before anything even remotely worthwhile happened. And by that time, it simply was too late; I had grown severely bored with the storyline. And with less than 20 minutes left of the movie, I can't say that the events that transpired then were enough to make up for the previous 70 minutes of slow paced torture.Now, I will say that the acting in the movie was really, really good, especially by actress Robyn Nevin - she really carried the movie phenomenally with her performance. It was just a shame that the storyline was such a mundane drag to get through.It should be noted, however, that there is a great atmosphere throughout the movie, one that the film makers were able to maintain throughout the course of the entire movie.Visually, Relic was adequate. Now, it wasn't an outstanding movie by any means. But I did like the make-up effects in the closing segment of the movie. But again, it was too little, too late.There is a good production value to the movie, if that matters on any account or level.I am rating it a mere three out of ten stars, and I do feel slightly generous here actually. I wasn't particularly impressed with Relic and it was just simply way too uneventful for my liking. This is by no means a movie that I will be returning to watch again."}, {"id": 278, "text": "Just when I wasn't sure where horror could go next we get Relic to show us a way. Natalie Erika James has smashed it into next week. This is one of the best horror films of the past decade. An Australian answer to Ari Astor and Robert Eggers, and as brilliant a debut film as Jennifer Kent's Babadook. These two women are the gods of Australian horror today. Relic is a film to be experienced! Firing on all cylinders and in total control. The dance between audio and visual is glorious. The intense, pulsing sound design with it's guttural mix pulls you into another reality, while the gorgeous cinematography plucks your goddam eyeballs out and and uses them like motion-controlled go pros. The shallow depth of field and masterful play of light and shadow throughout narrows your world into sharp focus. The editing has a palpable rhythm to it, knowing just when to linger, and when to cut away. The whole film breathes in concert of it's parts. The performances are nuanced and intense, particularly the incomparable Robyn Nevin who rides a fine line, often needing to say so much with the merest lingering of an eye. And that goddam ending! There is so much to unpack throughout this film but it's impossible to do so without spoilers. But folks, I am not embarrassed to tell you I fist bumped the air. A number of times. Because this film went all the places I hoped it would and I just had to punch something. Fellow humans; please, if you love horror just stop all the things and go hit play for this experience. Lights off. Phones off. Sound up. Base speaker under your couch cushion, and remember to breathe. Do with my hyperbole as you will. Just see it."}, {"id": 279, "text": "Relic is a new horror film directed and partly written by Natalie Erika James, the director of the horror short films Drum Wave and Cresswick. In the film, mother Kay (Emily Mortimer) and her daughter Sam (Bella Heathcote) travel to Kay's old family home, because Kay's mother Edna (Robyn Nevin) has gone missing. Together with local residents they try to find Edna. When Edna suddenly reappears without being able to tell where she was, Kay and Sam wonder if she's getting dementia. Kay goes to look for a suitable nursing home for her mother, while Sam keeps an eye on her grandmother. Sam sees her grandmother starting to act strangely and wonders if there's something supernatural going on with her. When she tries to convince her mother of this, the two must decide what can be the best help for their (grand) mother. This horror film is very similar in story to the 2014 horror film The Babadook, which was directed and written by Jennifer Kent. Coincidentally, both of these films were made by Australian directors and script writers. Jennifer Kent just seemed to have more of an idea where she wanted to go with her movie and what the real purpose of the movie was. Natalie Erika James seems a bit hesitant with Relic. She has had personal experience with Alzheimer's and dementia in her family. However, it is not clear enough whether or not the film tries to tell a hidden message about this as a metaphor. The film may appeal to people who have had to deal with or are still dealing with this a bit more. As a viewer you can be left with some unanswered questions after the end of the film. If Natalie Erika had given James some clearer information, the film would have been a bit more comprehensible and less lengthy. For a horror movie they only know how to bring out some horror moments by using certain sounds and shadows. Thanks to a suitable film set, they know how to create a spooky atmosphere. Lack of further explanation of some of these moments leaves you with some unanswered questions. Of the cast, Robyn Nevin delivers the best acting. Just like the other characters, she knows how to make you doubt whether she suffers from dementia or whether she is possessed by something. Emily Mortimer and Bella Heathcote also do good acting, as her concerned relatives. Because they are both insecure about Edna's condition, they and their characters sometimes seem a bit insecure, so that as a viewer you do not always know what to think of them and their situation."}, {"id": 280, "text": "This movie clearly personifies the guilt a mother feels as she realizes she was not there for her mother as dementia sets in. The guilt the young woman feels is glaringly apparent in the first few minutes when she could not even bear to tell the police officer the last time she saw her because it had been too long. As her guilt progresses, so does the elderly woman's condition. There are some creepy manifestations throughout the film, although cinematography was bad - many scenes were too dark to view. The young woman begins to research 'retirement homes' and the elderly woman finds out about it. Of course, this begins an even deeper rift. The grandaughter decides to move in to help out and is a source of light and hope in the movie, reminding her mother that we must care for our aging parents if we can; they changed our nappies, and one day we are to change theirs. They stay in the house and things get very strange. The vibrant, pretty elderly woman becomes not herself and begins to age rapidly. The young woman's guilt spirals; I am sorry I wasn't there for you. The ending is deeply profound, chilling and beautiful. If you don't appreciate it, you haven't been there."}, {"id": 281, "text": "* There is no end credit scene *Natalie Erika James in her feature-length directional debut plus crew brought an unforgettable psychological horror film. The story is about a daughter, a mother, and a grandmother being haunted, and how it consumes them. This was one of the brilliant ways to show a perspective of a terrible disease set with a horror atmosphere. The way it unraveled had a creepy pace and it kept me with a great tension of fear in which never disappeared. I loved the way it was thorough on grasping every aspect of it, and how terrifying it was to be able to have a sense of what this disease does. Also in this kind of genre, it made it feel a version of realness because the disease is true horror. This movie had one of the best opening scenes and the ending as it was beautiful it was also frightening in an incredibly disturbing emotional way.The composer Brian Reitzell brought this film to its brilliance as well due to his music. The horror atmosphere never strayed away not even for a second because the music never faltered to bring the hair-raising element in every corner.The cast, Bella Heathcote, Emily Mortimer, and Robyn Nevin were breathtaking, all of them deserve to praised. Their characters were fantastically written and acted, all of them projected the complexity and fear of being in that situation. The emotions were felt in their decisions and confusion about understanding this kind of disease."}, {"id": 282, "text": "Unnecessarily slow and boring, Relic drags the life out of you minute by minute. One of the most frustrating and boring movies I've seen in recent years.As for the screenplay, it's poorly written, average at best, with no attempt to be engaging or entertaining for its audience.The direction is worse. Sadly, the director just doesn't have the skills to make this movie work. The director lacks the ability to make interesting and engaging moments happen on screen. The poor script doesn't help, but a better director would have at least been able to make the most of a poor foundation. Unfortunately, the directors attempt to be artistic, just comes across as self-indulgent filmmaking. The dark, sometimes pitch-black, visual choices are a significant obstacle for the viewer.Against all odds, a couple of acting performances help claw back some integrity but its too little too late. There's really just nothing enjoyable about Relic at all.It was an interesting idea but unfortunately poorly executed, leaving the viewer frustrated and unsatisfied."}, {"id": 283, "text": "Not everyone is frightened by ghosts, not everyone is frightened by brain-gobbling hordes of zombies, and the recent wannabe-edgy hype around serial killers has made for damn sure that not everyone's scared of those either. For more universal and inescapably real fears, we have horror films as stirring and remorseless as Relic.Slowly but surely losing a loved one, especially during their proverbial sunset years, is something we all must face - a claim I cannot make as confidently about ghost attacks and scary monsters. It is difficult to imagine anyone being spared of this experience; the grief, the rage, and yes, the insurmountable fear (accompanying the realization that we all share the same final destination, no matter what manner of sequel we've been promised by -INSERT BELIEF SYSTEM HERE-).If you, like everyone else on the planet right now, are peckish for something new to enjoy in this unprecedented summer-movie drought, here comes a unique Australian horror movie to hopefully hold you over. Then again, I cannot guarantee you'll enjoy it per se, as it's a harsh one to process.This film is remarkably well-made and nifty in its communication as it is, but since it also constitutes Natalie Erika James' moviemaking debut, some additional applause is in order. The way the shots are framed and moved; the increasingly maddening editing and production design; the sounds that suck us in further... you name it and James has probably got it. The biggest strength, however, may be that of the three leading actresses (Robyn Nevin, Emily Mortimer, Bella Heathcote), each of a different generation with a different approach to the facts of the world; the elder woman vanishes for a brief time and confounding sights reveal themselves upon her return.Even at its most fantastical, Relic functions as a parable for losing someone to the confusions and rough realities of age. Even as the character of Edna seems to briefly pass into another plane of existence, surely that's not too different from how those final years often seem to us onlookers (soon to be given our own dues by Father Time)?The most effective parts of the movie have major influences from Mark Z. Danielewski's House of Leaves (which occupies my Top 3 books of all time alongside Cloud Atlas and The Hitchhiker's Guide to the Galaxy) but the maddening maze we're thrust into may yet represent the maze of the human mind, doomed to be impossible to navigate, or retrace, once we all reach that point. This is one of those films where I hope the younger and more mainstream horror fans stay clear, both for their own innocence's sake and for the sake of mature viewers' enjoyment.Much like The Lighthouse and It Comes At Night, this is a horror film that goes beyond what most are used to; it's not about weird monsters and gore, but about the fears and anxieties that we all share in common and yet might make us hate each other (at least in the case of those other two films, which concerned paranoia, isolation, and distrust). This is what horror can do to us if we let it. It needn't all be ghouls, masks, and pop scares - not that I mind the more simple entertainment within the genre, if it's done well.The pacing of Relic isn't the most fine-tuned and there are a few cheesy and inevitably clichéd moments; we do need to endure a few jump-scares but they are surprisingly effective here. A horror-based take on age and dementia is certainly an interesting one - even if the best movie on the subject will always be Haneke's Amour, which is more of a love story and an ultimate one at that.Still, by Jove, James needs to continue making movies and continue to tap into the fears that unite us all."}, {"id": 284, "text": "Natalie Erika James has crafted a well made, purposeful, horror movie.When Edna (Robin Nevin) has not been heard from for a few days, her daughter Kay (Emily Mortimer) and her granddaughter Sam (Bella Heathcote) leave Melbourne to check on Enda at her house in the rural countryside. Edna is found only to see that her mental state is deteriorating as it starts to physically manifest itself within the house.Relic depicts the deterioration of the mind of an elderly woman and asks what would this be like if this manifested physically outside ones psyche. This movie is similar to The Babadook as it takes a mental illness and depicts it physically in the confines of the created world. This works very well at times creating a very suspenseful atmosphere and an engaging story. Where this movie falters however, is it breaks it's own physical rules that it establishes. Edna's daughter and granddaughter begin to experience some of the similar things that she is experiencing. I get this is trying to depict that mental illnesses such as dementia are hereditary, but in some instances what happened in the movie does not work. In The Babadook, the creature is a manifestation of the main characters depression that only physically effects her and everyone else experiences the direct result or direct effects of that depression. In this movie, the mental deterioration physically effects everyone else as well.This movie does create a very eerie atmosphere that carries the movie. This is complemented with good cinematography and a mostly haunting score that can sometimes be derogatory. The performances are mostly good but Robin Nevin, who plays the deteriorating old lady, gives a very creepy and dark performance. The movie is at its most interesting when exploring the effects of her mental state.The best thing going for Relic is it's suspenseful atmosphere combined with its engaging story. Besides the plot details mentioned above and some strange editing choices, Relic is an enjoyable movie. This is not something that will remain with me but I had a great time watching it."}, {"id": 285, "text": "I found the premise to be quite novel and compelling - a rarity in modern horror cinema. The acting was very impressive. The female trio were very convincing with particular props to Robin Nevin who, at times was incredibly menacing.The biggest criticism for me is the poor lighting. I really struggled to see what was going on because the faces of the characters were so poorly lit and most of the time the rooms were in complete darkness. I get that this is a horror film and darkness can be a powerful tool but here I found it overkill to the point that it really hindered the viewing experience.I won't give away spoilers but I think that the ending could have been executed a little better. Great acting made up for certain inconsistencies/ holes in the script but it wasn't enough to really pull off the crescendo ending.Massive congrats to the director for their first film. It's great to see a fresh face on the Australian film scene and Relic was certainly a powerful debut."}, {"id": 286, "text": "One thing there are to say, the makers have studied quite comprehensively the life of dementia, ive experienced all the signs due to my work, and its very well done.its a slow burning , but extremely spooky film, with a whole lot of darknes, and searching thereafter, to such an extent nthat it is hard to see whats being imaged..but thats the way with old houses, dark cold and spooky, and this collosus of relics do contain a lot more than just what it seems to be, and that you can observe in the latter half of the story. very strangling and claustrophobic.the actors are more than good, even the disgusting special effects are better than good, so if this film are made by a newbie in the horror business, than horray to that. its just physically a bit dark, but the cinematographic and editing work are good. so are the production design too, and along with an always there spooky score and sound effects, you will have it , like the grumpy old man miself. its a recommend"}, {"id": 287, "text": "Mediocre .. because it falls for typical suspense/horror movie tropes - poor/non existing communication between the characters, decisions that are not based on any shown traits and problematic reasoning.It is not a bad movie - but i only give it 5 out of 10 because it did not exceed the average. It is kind of bitter-sweet .. which is novel enough maybe ... but i would have loved to see much, MUCH more character development in a movie that is ultimately about character.All in all, i assume the black spot is a metaphor of course? maybe even a double meaning of the black mark and well, what the movie is all about (dementia - which, i think is hereditary? or has a chance to be.. something something)I can recommend this movie as a slow burner with surprising suspense/gore .. but no actual gore, but metaphorical gore (does that make sense?)"}, {"id": 288, "text": "This isn't your typical 'horror' in that there's no blood and guts and very little in the way of jump scares.It's moody and as creepy as hell and builds tension as it goes. For me, I like these types of horrors. I think sometimes, little is more. This is where Relic excels. It's about atmosphere, dark, sinister and builds relentlessly until the excellent ending.The dark and ever shrinking corridors of one's mind is terrifying and tragic in equal measures.This movie is ultimately about acceptance. To peel away the layers of the person you once knew and to accept that that person has changed and will never return.Utterly stunning piece of work."}, {"id": 289, "text": "I really hope this movie is ushering in a new era of atmospheric creepy movies, that avoid any semblance of a loud-noise jump scare completely, and just opt for a consistent and frequent tone of absolute creepiness. There's none of that childish loud-noise jump scare bs here. Not once. This movie is CREEPY, in a very classy, very cool way.ButFor the first 30 minutes or so, it is SLOW. I barely paid attention at all for this time, but I wish I did. Man I wish I did. The whole remainder of the movie I was kicking myself for not having paid attention to the slow 30 minute start, because this is one of the best horrors I've seen on Netflix. It's like I was resisting the urge to pay attention and instead surf facebook on my phone, but eventually the movie just got too cool, and too creepy. I had to put the phone down; the movie demanded it.Check out my other reviews and see if my taste in movies jives with yours.If you aren't watching this movie alone with the lights off then you are doing it wrong."}, {"id": 290, "text": "A dour pseudo-horror movie about a daughter and granddaughter faced with the burden of caring for their mother and grandmother during her inexorable slide into dementia.This is a horror movie in the same vein as The Babadook, where the scary thing at the film's center, given literal shape, is really a stand in for a mental state. In this movie, the literal monster is the mother herself, and the claustrophobic, haunted house atmosphere is meant to be a visual representation of her daughter's and granddaughter's desperation and fear. But this movie is a total slog, a slow burn that never actually ignites into a fire, but instead peters out into a smolder. It consists of what feels like endless scenes of either the mother or daughter wandering around the house going Mom? Mom? or Gran? Gran? and sometimes finding something a little weird or off, but many other times not finding anything at all. There are all sorts of creepy images thrown in here and there that tempt us with the places this film is going to go and the secrets it will reveal, but none of them cohere into anything at all and the film feels like a lot of buildup for a climax that never comes. Most of the movie feels like filler to qualify it as a feature length movie. I wonder how this would have fared as a short film.I usually like Emily Mortimer a lot, and really mostly watched this on the basis of her being in it, but she doesn't get much to do. She certainly doesn't get to create a character -- no one does, at least not characters that we learn anything about.What a dud.Grade: D"}, {"id": 291, "text": "Relic begins in unassuming fashion. A mysterious disappearance. An empty house. Unsettling dreams. A malicious presence. It's nothing horror fans haven't seen many times before, though it has a tender restraint and steady-handed direction which promise something greater than the traditional setup would suggest.Low and behold, it delivers on that promise. As it draws near its finale, the film deftly veers away from the supernatural and warps into a disorienting, surrealistic portrait of dementia. The house itself becomes a clever metaphor for the declining psyche with maze-like corridors littered with misplaced memories and shards of personal history. The family of the affected wander the labyrinth, desperately seeking an impossible connection with their unrecognizable loved one. Eventually, it builds to a hauntingly somber, wordless sequence in which the profound despair of the loss is articulated entirely through visuals. It's a powerful conclusion which solidifies Relic as a resonant and effective addition to the psychological horror cannon.Strong 4/5"}, {"id": 292, "text": "Relic (2020) is not a horror film in the classical sense of the word. It's not a haunted house film and it's not a ghost story. Despite the fact that the film is very atmospheric, full of interesting events and good acting, most of the film does not indicate that something is going on at all and that the plot is progressing (except through Edna's deterioration).The film itself is short but slow, and since the acting was really good, I'd enjoy more character stuff in this instead of semi-dream sequences (even though I know why they are there).I did understand and relate to this because I've had my experience with my grands slowly aging and eventually dying. This is an interesting take which is done relatively well. Even the 'horror' element is used interestingly in this. I loved the way aging, family, house and inheritance was handled in this.This might sound arrogantly, but this film clearly is not for everyone. Just open your mind and don't approach this as a horror story. It's not perfect but it is well done after all."}, {"id": 293, "text": "Firstly, just to address all the 1 star reviews. I fully accept that people like different things, and I have no problem with those who don't like the style, direction of pace of the movie. Horror means something very different to different people.However, a lot of these reviews claim the movie is nonsensical with a completely random ending, that nothing happens, and similar statements.None of this is true - even if you don't like the film as a whole - if you actually think about the plot and ending in the context of what the movie is really about, it does make sense. In a really disturbing way.Now, the movie itself - just amazing, an expertly crafted slow burn that really gets under your skin and lingers long after the movie has ended. I'm not going to say much about it as it's best watched blind and I don't want to give any spoilers, even mild ones.But it is one of my favorite horrors of recent years now alongside Hereditary and Midsommar. Again, those types of movies aren't for all horror fans, so there is a good chance that if you disliked those movies, this one won't fully work for you either.But really, giving it 1/10 is just incredibly unfair. I completely respect the reasoned 4/10, 5/10, reviews, and appreciate different tastes.But 1/10 is wrong. There are plenty of films I don't get even within the horror genre that are immensely popular, but I wouldn't consider them 1/10 simply because they didn't gel with me."}, {"id": 294, "text": "No it's not a metaphor for dementia. A metaphor is one situation or statement that passes for another. Or a hidden meaning. Relic lays it out for all to see within the first few minutes.It fails because despite a subject matter worth exploring, we really know little about the grandmother's prior life. We can't feel for her loss of memory and self without knowing the type of life she has led. For that matter we learn literally nothing about the daughters too.If this film had some story or some actions that took you on a journey or something of any relevancy to pass the time, the lack of backstory might not matter so much. Where are the men for example? What happened to them? Does anyone care? What do they do with their lives that they can so easily give up to hang around in rural Victoria?Sadly the first five minutes is no different than from minute 55 to 60. The writer/director tries the old red herring about a cabin in the woods (cliche), to throw us off track. That perhaps this is really a horror after all and a haunting is in place. It's a rookie error. Hitchcock called it the McGuffin, though even in his films, it didn't exist without some meaning. Here it's just a purposeless device.The last fifteen minutes is very good. Especially the last shot. But the audience is far too bored by then to really care. Unless they, like some reviewers, think they're so intellectual, because it's a 'metaphor for dementia', and people who don't like it must be stupid. There's some irony. It's pure arrogance. No metaphor here. Just a lack of content.Emily Mortimer is a great actress but is given nothing to worth with. The relationships between all three are not developed in any way. It's style over substance. Yet there's really nothing that hasn't been seen in a hundred horror films, so the style in and of itself, is not enough.There was potentially a great film here but it's underdeveloped and shows a lack of experience and foresight. It might have worked as a short film or even a short story but its prompt setup and subsequent meanderings is its undoing."}, {"id": 295, "text": "This movie is such a slow burn it gets boring real quick.I don't know if i watch too many horror movies but the old people who have a mental health issue becoming demonic/crazy trope (but it's actually a metaphor DUHHH!!!!) are being annoying real quick to me.Dosen't feel original at all.The movie is very slow i feel i watched it for 3 hours when it's a 1h30 movie.The acting isn't bad the effects aren't bad like nothing is really bad about this movie.. it's just meh..and pretty boring if you take out the ending which more stuff happen and it get actually suspensefulSaw many people compare this to like hereditary and i don't agree not even close.5/10 the ending is good the whole movie tho bore fest."}, {"id": 296, "text": "This movie doesn't know what genre it falls under. At first it seems like it's a sad family drama. But then no. It starts becoming a horror one. But then no. Not fully a horror movie. By the end it becomes some pretentious artsy junk.So many unanswered questions. Won't be going into it.The good thing was how they showed this old lady having memory problems and how her family deals with it. Then there's the makeup or the visual effects thing. That's also very well done.Some horror movie tropes were done extremely very well. They should make a movie based on just the few tense scenes in which the granddaughter is there. That'd be a good movie to watch.Watch this movie if you like ambiguous, artsy flicks. Otherwise avoid it."}, {"id": 297, "text": "If you enjoy reading my Spoiler-Free reviews, please follow my blog :)COVID-19 impacted the number of movies released in 2020, but the horror genre didn't seem to really suffer from it. Quality will always be subjective, but in my opinion, this year has examples at every point of the spectrum. I've witnessed some shockingly awful horror flicks (Fantasy Island, The Grudge, The Turning, You Should Have Left), a few wasted potential examples (Gretel &amp; Hansel, The Rental, The New Mutants), some pretty decent ones (Underwater, Antebellum, Come Play), and more than just a couple of incredible films, some might even end up in my Top10 of the year (The Invisible Man, The Lodge). I didn't know much about Relic, but its premise got me interested.This is Natalie Erika James' directorial debut, as well as her first feature-length screenplay, co-written with the also first-timer Christian White. Boasting a relatively unknown cast (to me, at least), I can't hide my surprise regarding how much I enjoy this film. Ambiguous horror movies with underlying themes are far from being an audience-favorite subgenre, much on the contrary. Usually, this type of film possesses traits that a regular moviegoer doesn't really look forward to: a slow pace, a series of suspenseful sequences that don't lead to the generic jumpscare, and finally, an ending that apparently might miss some sort of explanation, leaving the audience feeling underwhelmed.Well, guess what? I love this subgenre, especially when it really hits me in the heart. It has all the ingredients above that I know will make most people think this didn't make any sense, it's so boring. Many viewers will expect just another spooky, supernatural, psychological horror flick, and disappointment will meet them at the end. However, its narrative carries so much more than what's on the surface, and honestly, this is made clear pretty early in the movie. At its core, Relic is quite a realistic depiction of what happens to the older members of some families (unfortunately, more than what it should be), and it approaches extremely sensitive themes such as dementia and the abandonment of old people in nursing homes.Natalie and Christian's screenplay doesn't hide from delivering a few messages concerning these two topics. Dementia is a terrible disease that, amongst other things, makes people lose what makes them unique, what makes them human, and forget who they truly are. If our parents take care of us throughout our young life, it's only fitting that we take care of them when/if they begin to fail to do so themselves. Not only should we do this because they already did the same for us when we were young, but also due to the possibility that our descendants might have to do the same when we grow old. It's a variation of the known circle of life.Love should always be present, no matter the circumstances. A little piece of my personal life: my grandfather wasn't quite there at the end. He gradually became unable to drive, walk, and eventually speak. I chose to not see him as much as I did in his last few weeks, simply because I didn't want to remember him as someone he wasn't. My memory of him is intact with the best moments I've spent with him, and not that depressing phase at a nursing home, just laying in bed, waiting for his time to leave our world... It's a small portion of my life that I share with you, so you understand how Relic can impact so many viewers if people give it a legitimate chance with adequate expectations.The acting is phenomenal across the board. Robyn Nevin can be scary as the grandmother Edna, but in the end, she's the emotional trigger that made me tear up. There are little nuances in her expressions that elevate her overall performance. Emily Mortimer is also outstanding as the mom, Kay, who has to go through all stages in dealing with a parent with dementia. From rejection and separation to acceptance and unconditional love, Kay is the character that gets a more significant focus. Bella Heathcote might have less screentime than the other two, but she's also fantastic as Sam, particularly in the horror sequences. Nevertheless, it's precisely this last point that hurts the film.The house's atmosphere is incredibly suspenseful, but the third act brings out an unexpected level of horror, which I believe to be exaggerated. The balance between horror and family drama was excellent throughout the first two acts, except for short periods here and there, but the last twenty minutes go through such an over-the-top, eerie, extremely fictional path that ultimately ruins that near-perfect balance. It's almost like the producers came in and said we need more horror, so they filmed a bunch of crazy, mind-bending, physics-defying scenes. This movie didn't need any of that, and it should have stuck with the intriguing drama instead of forcing the disturbing horror.Technically, Charlie Sarroff's camera work is impeccable. With the help of Denise Haratzi and Sean Lahiff's editing, long takes strongly improve the build-up to the scary sequences, generating exceptional levels of tension and suspense. Brian Reitzell's score is interesting, but there's a point in the film where it gets a bit awkward, having in mind the scene taking place, but it doesn't hurt his overall work. Great pacing control, adequate runtime, and a beautiful, heartfelt, relevant ending that, unfortunately, some viewers won't be able to see past its apparently underwhelming climax.All in all, Relic is one of those typical horror movies that will divide critics and audiences all around the world. This time, only false expectations can lead to disappointment. Natalie Erika James' directorial debut is far from being a generic horror flick, but a family drama with a very sensitive matter at its core. With the help of the also debutant Christian White, both deliver an exceptionally well-written, genuinely sad yet realistic story about dementia and how old people are treated once they can't live by themselves anymore. A remarkably ambiguous narrative filled with underlying themes leads to an emotionally powerful ending if the viewer is able to understand the implicit messages spread across the runtime. Emily Mortimer, Robyn Nevin, and Bella Heathcote all deliver exceptional performances. Technically, the lingering cinematography plus seamless editing create an extraordinarily suspenseful environment. However, the third act dives into horror way too much, holding unnecessary sequences that only ruin the film's tone, raising questions that don't belong in the movie. Still, I sincerely recommend it to anyone who enjoys this type of film, but please manage your expectations as fair as possible.Rating: B+"}, {"id": 298, "text": "Not a bad one, that reminds me of 'Babadook' a lot.In the end there are two stories running here, the demonic possession and transformation of an old lady into something evil... and on the other hand a metaphor for dementia. The transformation of the mother as she goes slowly mad is a sad tale and one real for many people. The daughters trying to cope with a difficult task.With both meanings of the story playing out, I felt something there for the actors involved and the story. It was nothing spectacular, mind, but enough to recommend a watch.The general presentation was good, creepy scenes, good acting and music. But nothing much happens outside of the tale of three main characters.6/10 good watch similar to 'Babadook' but not as terrifying or original perhaps."}, {"id": 299, "text": "I went into this flick not knowing anything about it except that is was classified as a horror. You need to watch it until the last minutes to really know what is happening.It's the kind of flick that needs it from the creepy and eerie atmosphere done with the sound and the house itself. When gan is missing mother and daughter are out to find gran. And they do but something is wrong with her. Nothing is explained but it worked out fine as this is a directorial debut.Effects at the end are just on the edge of gore.If you like creepy horrors in stead of slashers then this is worth picking up. Slow builder but it do delivers. Gore 1/5 Nudity 0/5 Effects 3/5 Story 2,5/5 Comedy 0/5"}, {"id": 300, "text": "When a grandmother goes missing, her daughter and granddaughter turn up at her isolated home to begin the search ...Unsettling drama that presents us with an eerie absence, then an uncanny presence. When I heard dementia, I expected to compare this to Deborah Logan, but the experience is entirely different.The editing and score/sound design are excellent, with good performances and skilfully laid clues, so the story is atmospheric, well paced, and sets up promising developments. Also, the dialogue is smart, as you find out the relationship between the three women without being told. The dementia is gentle, with the odd flash of insanity, and what really seems to drive the story are the relics of a dark past.Does it elevate into horror? The dream sequences definitely lay the ground, and at about the hour mark we go through the looking glass - but that sequence feels like a climax, with 20 mins still to go. My guess was we'd calm down, then suck it up and go again, but the whole thing just glides to a comforting end. It is a touching reflection on death and the generations, but I was really puzzled by the restraint, and by the failure to follow through on the other dimension foreshadowed by the dark secret in the cabin in the woods. Maybe I missed it - or maybe the resolve was absent. There is the comparison with The Babadook, which I found too metaphorical and shying away from horror's freedom to make things literal - to go from thinking about it, to screaming over it. Here, the metaphor is brought to life - how convincingly depends on your taste.I noticed the cinematography was also restrained, with a few lighting effects passed over - the christmas tree should have revealed the ghostliness of the figure, and the reveals from switched on lights had no effect. No jump scares either - I know, I know they're cheap, but they do get the adrenalin going, especially with skilful sound design. But then there's an excellent effect in a scene descending the stairs, where it feels every moment a fall is going to come, and when we go through the looking glass the light switches to candle and torch.You could compare this to Hereditary, which has a similar family dynamic. In that movie they do lay on the horror effects, but overrun the tarmac with the engine roaring. Here, it's like they took the key out of the ignition and ended up on the side of the road.Overall: Quality drama that dips its toe into horror, then shakes its head."}, {"id": 301, "text": "Natalie Erika James, who made her directing debut, put on a metaphorical, yet powerful horror film. Erika James has this beautiful sense of direction, by giving us a few unanswered questions from the start, crafting this meaningful story into one of the best films of the year. The premise of the film wasn't the most original, borrowing some aspects from films in the past, but Erika James utilized a lot of nifty twists and turns to keep the narrative as original as possible. The most successful aspect to this film was the consistent unsettling tone &amp; score that was set right from the beginning, giving each scene great depth, other than relying on jump scares.The performances by our three female leads were great! They showed great emotion with every piece of dialogue, making you actually care for them, and how they turn out.The only things I can take away from this film would be that some scenes were a little weird &amp; overkill; also, if you went into this film looking for a definite villain, with a clear cut message, you're probably not going to enjoy it that much; If you sit back and break down each event, you would see that the story was well structured, with great heart."}, {"id": 302, "text": "There's at least 3 times in this movie where the characters in it do something completely unrealistic ie. seeing a ghost/demon/zombie and then just acting like nothing out of the ordinary has happened... that extremely unrealistic since no logical, normal, ordinary person would react in the same way... and if the characters in your movie are going to NOT act in a realistic and believable way to the events that happen around them, then you're left with an audience that doesn't believe your entire film... and THEN, you're left with an audience that will not get scared at whatever they're seeing on screen, because they know it's not real (realistic).And the characters in this movie simply act in non-believable ways too often, for anyone who's watching the film to get scared at all. IF the characters in the film reacted logically and normally to the events shown in the film, then the film would have been over at the 35minute mark already...Overall, it's a semi-scary horror film dealing with a supernatural theme, but the viewer is shown one impossible event after another, and that turns this semi-scary horror movie into an absurdist 'what-if-i-had-horse-blinders-on' film... 5/10, just skip this film completely and watch an actually scary horror film like Devil (2010) or Shutter (2004)."}, {"id": 303, "text": "Natalie Erika James makes her feature film debut with Relic, a horror film that, like many films of the genre, offer more if you scratch beneath the surface. When Edna (Robyn Nevin), the demented and widowed matriarch of the family, goes missing, her daugter Kay (Emily Mortimer) and granddaughter Sam (Bella Heathcote) travel to their family home to try and find her. What they find upon arrival is a sinister presence haunting the house and slowly taking control of Edna.Obvious comparisons can be drawn with Ari Aster's Hereditary but then again it definitely deserves to be judged on its own merit because Relic certainly does enough to stray away from being labelled an exact replica. Natalie Erika James possesses the ability to create a tense and haunting atmosphere that lingers over proceedings, making the impending sense of dread predictable but shocking nonetheless.The fact you can see where the film is going doesn't take away from the film as a whole, Relic being a predictable yet impactful depiction of how dementia inhabits and tears away at the people we love. It's not just the people either, as the family home deteriorates too, James ensuring it becomes a character as much as the female trio that take centre stage.Coming to the performances, Relic features three very diiferent but equally strong performances from Robyn Nevin, Emily Mortimer and Bella Heathcote. Each of them bring different qualities to a generational horror that culminates in a beautifully fitting and muted manner.So, consider me impressed by Natalie Erika James' first feature film and her effective approach to covering such a condition as dementia. There's plenty of things that go bump in the night and darkened corners in every room but it's the real heart of the narrative that make Relic such a haunting piece of work."}, {"id": 304, "text": "A dark, disturbing &amp; disquieting horror that offers an unsettling take on the curses we may have inherited from our parents, Relic relies on its slow-building &amp; silently escalating atmosphere of dread &amp; delusions, and makes for a thoroughly arresting &amp; consistently chilling cinematic ride that's neatly crafted, skilfully told &amp; is finely steered by a trio of sincere performances.Co-written &amp; directed by Natalie Erika James in what's her directorial debut, the story at first appears to be cut from the same fabric as Ari Aster's Hereditary but develops into a different kind of nightmare as it progresses. Erika James' direction exhibits poise &amp; tenacity, and the way she allows the foreboding mood to set up gradually &amp; permeate every frame shows the clarity &amp; confidence she has in her script.The remote setting, muted colour tones &amp; quiet camerawork do ratchet up the tension to an extent but the glacial pace at which the plot unfolds is going to test the patience of many and may leave some viewers frustrated. Robyn Nevin, Emily Mortimer &amp; Bella Heathcote play three generations of a family, and they all chip in with fab inputs in their respective roles, with Mortimer impressing the most among the trio.Overall, Relic is a slow-burn chiller that's going to fascinate some and infuriate others with its snail-paced narration but it nonetheless serves as a promising start for its debutant filmmaker. Very slow &amp; a tad too dimly lit yet gripping for the most part if not all, this story of family, guilt &amp; dementia advertised as a haunted house horror is as moving &amp; heartbreaking as it is menacing &amp; unnerving. A solid effort for a debut feature."}, {"id": 305, "text": "Director: Natalie Erika James Writers: Natalie Erika James, Christian White Stars: Emily Mortimer, Robyn Nevin, Bella HeathcoteIn 2014, writer/director Jennifer Kent created The Babadook. It was a tale of a demonic presence, and while Kent was very clear with her spooky intent, she was also painting a portrait of parenthood, which is often an experience of unrelenting horror. It was a sharp, stunning feature with a delicious claustrophobic atmosphere. The type of viewing experience is found in Relic, which turns its attention to the various challenges of dementia and how the personal experience of such degeneration greatly taxes all those involved. Co-writer Natalie Erika James impressively merges the real-world agony of aging with a haunted house story, coming up with a complex film that's richly detailed and performed, reaching above and beyond a simple ghost story to tap into deep emotions involving the nightmarish decline of a once vibrant loved one.Stunning performances from all three women. Robyn Nevin and Bella Heathcote really steal the film for me. Robyn as matriarch Edna, missing for days only to turn up out of the blue disheveled and battleworn. Bella as Sam, the innocent granddaughter who uncovers the truth of the situation. Emily Mortimer as Kay is also great here but she's given the mission of distraught daughter unsure of what is going on.The last 30 minutes are just...beautiful. Impressively cinematic . What a stunning, haunting film. This is a masterpiece in filmmaking. I can't believe this is the directors first film. I can't wait to see where she goes from here."}, {"id": 306, "text": "Very rarely do I have as much difficulty rating a film as I did with 'Relic'. Even now while writing this I am torn as to what a fair rating should be. You see, I love the concept of what 'Relic' was trying to portray, but I didn't know it was portraying that until the final moments of the film (and even then I wasn't 100% sure). It was around the halfway point in the film where I thought to myself - what exactly is the concept behind the movie I'm watching here? In fact at that point I wasn't even entirely sure what I was watching could be considered horror.This is a pure slow-burn of a movie. There are very few jump-scares through the movie. The horror, particularly early in the film, come from a creepy looking old lady doing odd things, and from random bizarre things happening around the house. None of it is really all that scary to be honest, but it does set things up for when the film picks up the pace more towards the end.Dementia is a horrible disease, and whatever the film puts on screen, that will always be the true horror here. I liked the idea behind this, in a similar way to 'The Babadook' being related to depression. I might have liked to see it executed a little differently in an ideal world, but I can also understand why it is a very tricky thing to get right. Australian's tend to make very good horror movies, and while 'Relic' isn't going to find itself in the top echelon of those films, it is still well worth a look."}, {"id": 307, "text": "This is a non BS review for anyone with a bit of common sense.This is yet another heavy handed allegorical horror movie for folk who love to state the obvious and have the obvious stated to them.He's the rub; no spoilers here. ( If you have read any blurb at all or any reviews, I'm not telling you anything you have not read already) Daughter and Grandaughter care for Gran who has Alzheimer's or some other form of age related mental degradation.....and it's a horror movie. It wears it's influences clear as day; Babadook, Hereditary etc Now you know what to expect and the movie is exactly that predictable.The first 25 mins are a waste of time for anyone who knows anything about the movie, has looked at a poster, a cover or a still of the movie. 25 mins to find gran who we know is in the movie. 25 mins of absolute tedium.Nothing much interest happens until the 62nd minute and the last 20 mins are decent.That's the movie.It's not extraordinary. It is not clever. You could have the script yourself in about a week.Not a bad movie, but like most of these modern 'elevated' horror movies it is completely overrated by a bunch of pseuds"}, {"id": 308, "text": "Following in the footsteps of the likes of The Babadook, Relic takes a haunting look at Dementia manifesting and a family of women trying desperately to support one another.When Edna (who suffers from dementia) disappears, Kay and her daughter, Sam, travel to the old family home to find her. With no clue where she is, they decide to stay and clean up the house that has fallen into severe disrepair. Just as suddenly as she disappeared, Edna comes back, sporting some ugly wounds and quickly deteriorating in mind. As her condition worsens, the younger generations are caught up in a power play, and the undeniable sensation that something is in the house with them.Slow burn is an understatement. But Australian director Natalie James keeps the pressure constant from the first entrance into the house until the final, haunting, yet breathtaking, tableau. Dank, dark and damp, the house they inhabit has as much character as the cast, and is just as able to reveal secrets as it is to indulge in claustrophobic horror. The combination of the house's decay and the increasingly erratic behaviour of Edna creates a dread of what's buried under it all. A nightmarish sequence involving an ever encroaching crawlspace will make any slight claustrophobic person shudder and reach for the remote.That's not all the film offers, though. Quite simply, the movie shows the horrific nature of a family coming to terms with mental illness - the frustration, the fights, the confusion, the ignorance, the moments of catharsis. Even as it goes balls to the haunted house walls in its closing moments, Relic remains a movie about family and the bonds that cannot be broken, no matter the horror we are put through."}, {"id": 309, "text": "A mother and a daughter return to their family home to take care of their grandmother, who is being possessed by a manifestation of her own dementia.Relic is a horror film about dementia. In conventional circumstances, the topic of dementia would be explored in the independent film drama genre. Someone slowly losing their own identity is something that would seem heartbreaking in a drama is now subverted to being something horrific in a horror movie. It's a great concept. However, Relic struggles to put its audience through its intended scares.The underlit murky cinematography made the scare sequences very hard to follow. At first, your imagination takes over and you scare yourself for a while in the dark until you realize it was a technical miscalculation. The camera would often track behind the characters slowly walking through hallways but as the actors make their turn at the corner, I couldn't distinguish the darkness from the walls to see the turn. The cinematography ruined this film.The atmospheric sound design provides a lot of the scares but is eventually overly relied upon. Initially, the soundscape was unnerving in a David Lynch type way. The first five minutes of the film was actually the scariest part of the entire film. You are put right into a creepy space filled with ominous sounds not knowing what's happening. However, the film took such a long time in communicating its allegory and establishing its monster that in the latter sequences, the impact of the sound design wore off. It's a shame because the sound design was effectively creepy.The film had solid technical foundations to build its scares but didn't know how to progress them to build suspense. Filming the backside of an old lady doing something ominous can only be tense so many times before the effect wears out. This brings me to the core problem of Relic: the grandmother character is just not scary. Creepy? Yes. Sinister? Sure. Scary? No.The three actresses, Emily Mortimer, Bella Heathcote, and Robyn Nevin, give convincing solid performances that would have otherwise belonged in an indie drama about dementia. They work hard trying to sell the film's allegory but are undermined by the oddly timed script. The slow build ended up killing the suspense instead of building it up. It's too much setup and too little payoff.First-time director Natalie Erika James has nice concepts but needs to time and punctuate her stories more precisely. I like the horror allegory of using an old lady's dementia as an evil entity. Watching a loved one deteriorate into a shell of their former self is horrifying. However, the monster in this film is not well defined or how it works. Which one is the actual monster, the grandmother, or the physical manifestation of dementia? I don't know."}, {"id": 310, "text": "A woman is asked to check in on her mother, who has recently ceased all contact with the outside world. Her daughter travels with her. Upon arrival, the two slowly become involved in a frightening series of events.I went into this film armed only with this knowledge and was pleasantly surprised when the credits rolled.What I enjoyed most about this film was the very human drama at its core. There was some real emotional weight to the latter half of this film and the performances by the entire cast made it that much more devastating. I appreciated the willingness of the film to make me sit uncomfortably with my emotions and the subtle reveals throughout that made it more difficult to do so.I think my biggest issue here is that like others have noted, this film does feel very slow at times. Much too slow. It is one thing to use slow pacing effectively and another to drag scenes that do not say anything out for what felt like no reason. The last thirty minutes or so of this film is where it really gets moving and shines brilliantly.For a directorial debut, this film was beautifully done. Recommended to anyone with a love for cinema."}, {"id": 311, "text": "Truly, truly, absolutely, positively, boring. I'm being generous with the 5 too. I'm half way through and everyone in the house has walked out of the room. And I live in a State under curfew. There's nowhere to go and nothing to do.This could be a good 2nd half. It could be building into something, but I'm. it going to know, because I'm going to go to bed.49 minutes in. And nothing under the bed has been the scariest thing so far.Big. Fat. Yawn.Goodnight"}, {"id": 312, "text": "A beautiful looking orange rotten from inside. Unless it gets peeled completely and taste it, you will not know how good is the fruit.The same way, the movie claimed to be looking good and creepy, but as the time goes by, you will have an unexplained story left over.The climax is meaningless, as I do not understand why the mum and daughter do not take their granny out for a walk or just make her talk to people to come over the fears and problems she has already being reeling under due to loneliness so far. And why the hell they need to stay back in the same house as shown in the last scene.The horrific events are never explained in the movie.Yet, what I still liked about the movie is the performances of granny, mum and daughter."}, {"id": 313, "text": "A woman and her daughter head to gran's house when they learn she's not been seen in recent days. What's going on with gran? This is your plot.This film is a bit hard for me to review. It has an outstanding atmosphere that feeds tension and concern for these 3 women. I love that. When you care about the characters, no matter the film, the horror becomes more pronounced. They did a great job with that and it keeps you invested in the slow burn.I didn't care for how some of the pieces of the puzzle were presented. It felt like I'd missed something but admittedly, I understand that this is a deeper type of horror. You have to pay attention and understand that not all horror can be solved by simply taking things at face value. Sometimes you have to read between the lines. If you don't, the ending may be a real head scratcher.The tension is what sells me on this one. I appreciate how it was crafted. So, no blood, guts or gore here. If that's what you're looking for, this won't get the job done. This is more slow burn, psychological horror. Not a bad watch."}, {"id": 314, "text": "When first hearing about this movie, the premise intrigued me and upon viewing the trailer, I was absolutely ready to dive into this movie. While it's not a bad movie by any means, Relic is the definition of a film that you shouldn't judge by its cover. It's mentioned as both a drama and a horror on many of the entertainment websites and although there are some eerie scenes and a few chills to be had, this is first and foremost, a psychological drama from beginning to end. This was actually jarring to me as it really does seem like a pretty scary film on its surface. If you're looking for a film to simply scare the hell out of you, this isn't that, but some viewers may find the dramatic aspect to be quite fulfilling.Relic begins with a mother and daughter living in the grandmother's house, as they search for her whereabouts. After she mysteriously and randomly shows up back home, she doesn't seem right. Dementia has clearly overtaken her in a severe way and it's not only affecting her daughter and granddaughter but the house they are in may just be expressing the side effects of that dementia to them all, creating visions and dreams that may or may not actually be there. I could see what they were going for here and the movie ends on a note that felt very strange, yet earned at the same time, but I walked away wishing that more had been done with the premise overall.Writer/director Natalie Erika James has crafted a very well-rounded story with a lot of character development. The thing that impressed me the most was that I was able to retrieve a lot of that character development, simply due to the images being shown on-screen. Her writing abilities here worked wonders for the story itself, but I truly don't think the tone of the movie matched the premise all that well. I think how everything was lit just felt like a darker and scarier movie than what was given to audiences. That was a creative decision by the filmmakers, clearly, but it felt off to me.Bella Heathcote as Sam and Robyn Nevin as Edna are both terrific in their respective roles, but Emily Mortimer, who's usually always great, may have given the best performance I've seen from her yet. Her calm, concerned mood throughout the entire film never once waivered. I was completely enthralled by her performance, even though she probably could've been given more to do. This film feels like a much larger story wants to break through the cracks of this well-done drama. I just kept wondering what the point of it all was, and even though there is a point by the end, I'm not sure I cared enough by the time the film finally arrived there.Overall, Relic is a movie that's hard to rip apart, because all the right pieces are there and movie, narratively, is quite effective. Sadly, the horror aspect was a huge failure for me and the tone of the movie in comparison with what was actually going on was a little too dark to latch onto. The cast is very solid, as well as the direction and screenwriting, but nothing about this movie felt special enough to praise more than that. This is a very watchable movie that feels its length at even 90-minutes, but if you're up for some psychological sequences and a solid little story, this one may be for you. Personally, I walked away thinking Relic was okay as a whole."}, {"id": 315, "text": "I high anticipated the release of this movie, and because of the over anticipation, I was slightly let down. This is not to say the movie isn't good, it is just not GREAT, like I was hoping.The small cast does a great job portraying a distressed family and you really feel for them. The colors and disorienting scenes were also effective. The plot was also solid and was an excellent allegory for a specific (no spoilers) disease. The score was similarly eerie and effective.My only fault with the film is that the pace is a bit off; I don't think that this movie should should have been fast-paced, but I would have liked a little more scares, adrenaline, and/or action scenes.Side note- If you liked this movie, please do yourself a favor and watch The Taking of Deborah Logan.Well worth watching [7/10]"}, {"id": 316, "text": "This reminded me a lot of another allegorical film, The Babadook.In that movie the story revolved around deep grief, whereas this one focuses on the living loss of dementia.It probably isn't as creepy as The Babadook, and certainly isn't filled with jump scares. It works on a much slower level, of growing dread and the inevitable bereavement of losing somebody as their character and personality disappears.Ultimately it's a meditation on just how dreadfully sad dementia is, stripping a person of their character, and a family of the relationship they once had.I can see that this isn't going to sit well with horror fans. It's not really a horror film. There are scary, unsettling bits, but ultimately it's an exposition of the dreadful cost of dementia on our human relationships and families."}, {"id": 317, "text": "Slow burn with originality. It is both supernatural and psychological. It has a suspenseful build up and doesn't end up with a happy ending. The ending, without giving it away, is compassionate and heartbreaking. That's how I like my horror movies. I want them to drive a message to the audience and not undermine itself with dumb down happy endings.This is one of those films you have to look deeper for meaning and create your own interpretation of what it all means. You really have to analyse it from the point of each character in relation to the others. Three generations of women in different stages of life. If you ever had a loved one with dementia, you will get it. If a horror film with a point to get across doesn't appeal to you and you are looking for a dumb down Blumhouse jump scare flick, this isn't your movie.So far, this might be the best horror film in 2020, as far as the beginning of the year to the current summer. That might not be saying much considering the circumstances we are all living in 2020 and how little movie entertainment there is out now, but a genuinely liked it. Great acting; beautiful and haunting cinematography. The ending got to me."}, {"id": 318, "text": "People need to come off it. this movie's monster scared the hell out of methere's a lot of relationship dynamics coming from grandmother - mother - daughter and how strained and uncomfortable they can be in the uncertainty of what your duty is in each rolethe effects in this film are grotesque and made my skin crawl. its body horror in that fashion. can't even think of a scene as disgusting and beautiful as the final one. and then it leaves you with a smack in the face about how we all kind of fear the same thing to an extent.Natalie Erika James is a talent to watch and seeing her vision of what family horror is makes me excited for her future work. she brings a meaningful performance from Emily Mortimer and an endearing one from Bella Heathcote.If you're on the fence whether to watch this film, ask yourself if you are willing to stare death in the face for a full hour and a half? some people find this dull and depressing, i found it horrifying"}], "reviews_amount": 319}