{"name": "The Pale Door", "titleId": "tt09178402", "reviews": [{"id": 0, "text": "A gang of outlaws successfully pulls off a train heist, but instead of gold, the chest they steal reveals a young woman inside. Now it looks suspicious why wud somebody put a girl inside a trunk n lock it, chain it n guard it but the girl claims she was taken from her home n says that there would be a handsome reward for the gang if they return her home.For a low budget, the director did a decent job. It is a nice genre mash up n fans of western n horror films will enjoy it. I am generous with an 8 cos i enjoyed it. Simple, aint no wannabe critic. It has good effects, lots of demonic witches, a lil nudity (blink n u miss some good busty boobs) n one of the best scene involving boots with spurs."}, {"id": 1, "text": "They have burned me twice this week with this film and The Barge People. Both are really, really bad. I have never fast forwarded dialogue in any movie I've watched before-this was the first. Skip this, please. Horrid. Actors are all wearing brand new clean western clothes, throughout."}, {"id": 2, "text": "The trailer made it look like it was going to be interesting but this movie is not good at all. The acting is wooden, the story isn't interesting even though it could have been, the costumes look brand new and there is nothing scary or funny or thrilling or moving about it at all. Is it impossible to find a good low budget horror these days? i know small budgets come with limitations but that shouldn't have an effect on creativity. As somebody else said, watch Bone Tomahawk instead if you want a good western set horror movie."}, {"id": 3, "text": "A really laughable, amateur film. The sets are really fake, or poorly lit. Or both. The costumes are freshly pressed and not a scuff on them. For outlaws, these bandits look like they were on their way to church. Acting was on par with any low budget horror. Maybe a little better, but not good enough. Story is disjointed and poorly written. Add all of this up, and you've got nothing you'll want to sit through. I was excited for a Western Horror, but this isn't it."}, {"id": 4, "text": "There is nothing very original here. A gang high jack a train and find something unexpected. The cast is a joy and there are some neat ideas here and there. But sadly, it is a slow and slightly boring movie, that never lives up to the premise of cowboys vs witches. You could do worse, but if you want good Wild West horror, watch Bone Tomahawk instead."}, {"id": 5, "text": "The Pale Door has a somewhat cool poster and had a decent idea or two. Unfortunately that's about it in terms of the positives of the review. The negatives far outweigh them. The story takes close to 40 minutes to actually get going and is mostly boring. It's about a group of western outlaws who end up trapped in a cursed town inhabited by witches. They want to capture the youngest gang member who is the brother of the wounded leader and had only joined the rest of the gang in a heist for the first time. He is apparently pure hearted and would sustain the witches for a long time.The acting is nothing to write home about even though most of the main cast has worked on some very good movies in the past so the problem must be with the bad story, script and dialogue none of which are engaging or exciting. The action is kind of funny at times and so are the effects but not in a good way. More in a cringeworthy way. The sets look very fake and as someone already pointed out the clothes are all too clean. The story has a few similarities to From Dusk Till Dawn but that movie is superior in every possible way. It would be better to watch that instead. Overall this is best avoided or forgotten as soon as possible."}, {"id": 6, "text": "Why would you trust RLJE Films to begin with is the obvious question as this is clearly a low budget horror western. How this movie is above 4 stars, makes you wonder if it could pass as a mystery as well. Don't bother watching, you've likely seen the type alreadyI"}, {"id": 7, "text": "Why just why would anyone do this. Will someone please start making good movies again because this is an abomination to cinema."}, {"id": 8, "text": "How bad does this film stinks? Think of piles of trash filled with restaurant leftovers after three days of a 98-F heatwave in New Jersey bad. It might make you angry enough to smash your remote against your new TV bad.I wish I could give it a -10"}, {"id": 9, "text": "So, right of the start, there is no explanation to what happens in the beginning, then there is no further explanation. I laughed out loud when one gentleman is wearing a bright,turquoise bandana in the bar. I couldn't even place what time period this was supposed to be in. I watched this and Unhinged. God help me."}, {"id": 10, "text": "The film looks like it was written and shot by a high school drama class. All the cowboy clothes are from Old Navy. The sets look like they're one street removed from a subarb."}, {"id": 11, "text": "I like the plot even though it slightly mirrors the same plot of Robert Rodriguez' 1996 film called From Dusk til Dawn but with witches. Plus acting was pretty fair."}, {"id": 12, "text": "This is one strange film that could have done with much needed exposition rather than allowing/forcing the viewer to solve a metaphorical rubik's cube with missing sides and no guidance on where anything fits.This is set in 1800s and the first scene involves a family that is about to be home invaded. However, the family has strangely prepared the whole family for such a scenario &amp; they execute the escape and children find their hiding place and guns &amp; ready themselves to use them against the intruders. One of their parents does not survive this ordeal..Next scene is the children all grown up with Duncan (Zachary Knighton) &amp; Truman (Noah Argan) and are part of some Western outlaw group that plans to hijack a train for loot but instead they open a box containing a live, chained teenage girl &amp; Duncan is injured during all of this. She promises them that they'll get their rewards &amp; also they can help Duncan if they take her back to her home. The group agrees, mostly thinking they will receive a cash rewards, and makes the journey there. But they get more than they bargain for...It felt like 2 films haphazardly combined into one. It doesn't work as a film. This is done better as a TV series in particular Wynonna Earp which has everything devoid in this film: likely characters, great humorous dialogue &amp; action scenes that fit well in its storyline."}, {"id": 13, "text": "I was disappointed after seeing the trailer at the start of the month. A western horror with devil worshipping occult witches? My kinda film. However there is a serious lack of creativity here. The dialogue is clunky, the acting is wooden and the clean clothes bugged the life out of me. Im not looking for high art but the film makers clearly didnt care about an engaging story here. Avoid if you dont want to be bored and frustrated."}, {"id": 14, "text": "Extremely disappointing! Jake the little brother literally killed the movie! The movie could have been much better than what it is. Cheap movie even though the idea was good. You could tell that the producer is not good. I am very disappointed to have wasted time watching this movie."}, {"id": 15, "text": "Could of been a decent film if it had a higher budget. The story isn't bad, it was just hard to watch. The camera work and sets looked too low budget. I turned the movie off about half way in. Pass on this one unless you like low budget horror films."}, {"id": 16, "text": "And that's a shame because I actually had some expectations for it.I won't bother to leave a long review for this one. Just know that it's better avoided."}, {"id": 17, "text": "There are actual actors in this movie - it has to be the material they're working with. Everyone comes off looking like they can't act or are overacting. Terrible terrible direction and script, the big problem is this thing looks like it was shot on a camcorder from 2006. When your cinematography is this bad, everyone looks worse.The cliched characters and bad dialog are cringe-worthy. Hard to get through, I defy you to watch this and not find yourself fast forwarding. I also defy you to make it to the end. I could not. It was terrible."}, {"id": 18, "text": "All around bad script. Bad acting. I think it could have been better. Concept wasn't unbelievable. It didnt deliver."}, {"id": 19, "text": "The western/horror genre probably isn't utilized as often as it should be and when it is it's rare that it delivers anything worthwhile. That is not the case with The Pale Door by writer/director Aaron B. Koontz.The film does leave a little to be desired when it's over but that doesn't stop it from being an entertaining thrill ride, especially when you consider the limited locations available to spread it out and make that interest easily maintainable. I think this movie shows a director with real promise in the future. There's a handful of good scares and the performances are great.Ultimately, this probably won't go down in history as a classic but it's very much worth the watch."}, {"id": 20, "text": "Enjoyable. A little more character development was needed, but entertaining to say the least."}, {"id": 21, "text": "As the characters develop and you get that Bond, makes it tough to watch the Church scene but I was impressed with the Cast and the Story. Western Horror combo has punch. The Brothers Bond and Love is strong ! Stan Shaw plays Lester. Witch Costume Design Very Cool. Eery Sounds. on Amazon Prime."}, {"id": 22, "text": "A gang of train robbers who are not the Daltons tangle with a coven of witches who were killed 200 years ago (to the day) by Cotton Mather. They needed a better title like Dalton's vs the Salem Witches. That way they could run it with Jesse James Meets Frankenstein's Daughter (technically the granddaughter) and Billy the Kid Versus Dracula.The film started out great and once they got to the brothel it unraveled.Guide: F-word, sex, no nudity."}, {"id": 23, "text": "I so wanted to like this film, but it drags and once you get to the witches there isnt much else... If they had made this gorier... it may have been cool, but it just drags. Im giving this a 6 because its better than elevated slow burn horror garbage... Now if only we had talented filmmakers who understood the dynamics of pacing, music choice, and impacts of scares/gore..."}, {"id": 24, "text": "I watched The Pale Door first then looked at the reviews and was utterly shocked at such low and dishonest reviews. I like westerns and I am a huge fan of horror. There was nothing on this movie that disappointed me. I understand it's not a 10 but under a 4? Never!"}, {"id": 25, "text": "Not the best of its genre, but I appreciated this movie. The characters are well defined and the witches are ugly enough. What I didn't like much is the ending, leaving me with a hm. I would have appreciated a sudden twist at the end, like a final boss or the main witch transforming and fighting against the 2 brothers."}, {"id": 26, "text": "RLJE has once more disappointed me what a boring and slow movie cowboys vs witches not my type of movie but lacks in many ways."}, {"id": 27, "text": "One of the worst horror movie I have ever seen.no storyline.bad acting"}, {"id": 28, "text": "This movie is good. Different and witches are well made and performed. Not scary but still a good horror"}, {"id": 29, "text": "A wild west gang runs into trouble when a member is shot and they are lead to a town that is merely a front for a coven of witches.Yeah. Not a lot going on here. The cast is fairly decent but the script is a mess, the plot is shaky and the pace is slow. Just a disappointment. I say pass unless you're trying to kill time."}, {"id": 30, "text": "The review on top of this list right now says this movie is not that bad. That reviewer must have been related to the directors. It's pretty awful to say the least. The acting is bad, the story is bad, everything is bad. But if you like cowboys, horror, and witches, and preferrably all mixed together, I guess you don't have a lot of other options. So unless that specific mix is your cup of tea, better to just stay away."}, {"id": 31, "text": "Man, this could have been so much better. It had potential- cowboys vs witches- come on! Unfortunately some of the choices that were made, just lead to something just so so.The script had issues. The dialogue is bad enough to stunt the actors acting, so it makes them look bad. The story could have made different choices to make it more interesting and give a much better ending. The make up effects just brought the creepy factor down with their choice in classic witch caricature vs something actually scary. If they just lost the big fake noses and chins, it would have been less goofy and more scary. There was minimal action and minimal gore. And the ending was anticlimactic and dull.Overall, it was okay and seemed to have potential, wasn't horrible to watch, but the witches goofy make up was a bit distracting and irritating and the lackluster ending made for a so so flick."}, {"id": 32, "text": "Movie was decently made but don't watch with children. Takes place in a brothel that shows full shot of a woman's bare breasts. Absolutely zero parents guide was provided for this movie. Pretty disappointed for allowing this content to go unmentioned."}, {"id": 33, "text": "I'm a sucker for historic horror films. It's just interesting to see a mixing of two genres. That being said, I was all in with cowboys robbing a train and getting into something else they didn't bargain for. I have to admit, I did give a damn for the outlaws. I wanted them to come out of this in one piece. However, the fight scenes just seem so lifeless. By the third act, I was rooting for the witches. However, if you got absolutely nothing else going on, give it a twirl."}, {"id": 34, "text": "I got up from my seat when the movie was over and brushed away the little pieces of popcorn left on my shirt. I said to myself, ' it was all right; I wouldn't see it again.' It was filmed well, the actors did a good job but just beneath the mediocre score. As I said before I wouldn't see it again and I wouldn't recommend it."}, {"id": 35, "text": "The story is good. If you tell a friend there's a western/horror movie that sounds intriguing. As a screenwriter I can tell you is a good plot, bad developed! Direction and photography is awful (amateur at best), FX so so, Casting (if there's any Casting director) is soooooo lame. Overacting everywhere! Outlaws and witches should reconsideration their careers. The main witch is such a bad performance and the starring brothers are paler than the door. Supporting actors are kind of extras. If this screenplay would have been sold to a major studio with top-A cast, probably you would seen a great movie. I said probably 'cause you watched the disaster called Cowboys and Aliens."}, {"id": 36, "text": "As a film lover and a horror freak, I give every horror movie a chance. I love indie and b horror just the same as the rest and I usually appreciate lowly rated films more than most people. However, sometimes there are true stinkers released and it's sad to me when i see a director with potential release a bad film because it leaves a slight stain on their name and typically removes them from my radar. An example of this would be Corin Hardy, who, directed the suspenseful and action packed The Hallow but then went on the release the AWFUL single location flop The Nun in 2016. Id imagine studios are hesitant to work woth Hardy after his last epic failure. The same goes for this film, The Pale Door directed by Aaron Koontz who previously made the decently conceived Camera Obscura. The Pale Door is a western horror film that follows a group of outlaws sometime in the early 1900s as they attempt to execute a high stakes train robbery one dark and foggy night. One of the main characters are injured during the robbery and from there we are lead to a brothel inhabitated by a coven of witches where suspicions arise and and demises befall. The plot has been dome numerous times but this is still MY type of plot in a film. I love that creepy ambiguous sense of dread in a film. Often what you don't see is the scariest part of a film. However, there was something afoul since the title credits began. The movie has a very hokey vibe to it. A vibe very similar to Ted Geoghan's films but I actually truly love Geoghan's two films so this movie still doesn't even hold a candle to them. The clothing worn here is all freshly pressed and uber clean as if they were just taken out of the wardrobe bags minutes before filming began. There was no dirt, no dust, and no sweat on any of the characters clothing through out the entirety of the film. There was also no grit or rawness here. Everything felt so..b polished. The witch creatures we're awful looking and were more funny than scary. Their big long noses were a joke. The director is clearly an airhead and has awful taste. There are several iconic names involved in this movie and I feel quite bad for them that they now have to add this film to their resumes. In my opinion, every cast and crew member should Alan Smithee themselves from this piece of garbage so it doesn't affect their future careers. Itd be funny to see a movie with a complete cast of Alan Smithees. Overall I feel bad for the director, cast, and crew of this movie because you'd have to be an idiot to actually like the turn out here."}, {"id": 37, "text": "PROS: The story was original. Cinemaphotography Special Effects grossed you out Iconic Imagery is Original Nice set design.CONS: Graphic Design/Intro at beginning should have been more research. The intro is clunky and not what the film is like. They could have set a different tone by choosing different typefaces.Music is too modern for the time period, the music director should have payed more attention. It felt like a Tarantino tone minus the actionAll in all this is above average even though you could tell the budget was minimal. The producer used what resources available to his advantage. The producer is not horrible as people are saying if this was the producers first movie I'd say A+ for effort. There is not another movie out there with this tone &amp; setting, so its worth watching for that reason alone."}, {"id": 38, "text": "Well, initially all I knew about The Pale Door was that it was allegedly some sort of horror movie. And truth be told, that was essentially all that was needed to have my interest. But I must also say that the movie's cover/poster definitely had caught my attention as well.So I sat down to watch the 2020 movie titled The Pale Door, not really knowing what to expect from it, so writers Cameron Burns, Aaron B. Koontz and Keith Lansdale had all the possibilities to impress me with this movie.Sadly, they didn't really manage to do so. Sure, I will admit that The Pale Door definitely had potential, but director Aaron B. Koontz just dropped the ball before the movie hit the halfway marker, and the movie never regained its momentum after that. And it ended up being a less than mediocre movie, actually.The storyline told in The Pale Door started out adequately, but it was fast sliding downhill before hitting the halfway milestone, and director Aaron B. Koontz didn't manage to bring the movie back on track. And then suddenly there were crisp and burnt women milling about, just to add to an already befuddled storyline.It should be said that the acting in the movie was adequate, but it was a real shame that the actors and actresses had precious little to work with in terms of a proper script and storyline. And it reflected poorly on the overall impression of the movie.I am rating this western horror a less than mediocre four out of ten stars. This was a movie that came quietly in under the radar, and it will leave just as quietly as well, never to be seen a second time. I suppose if you have absolutely nothing else to watch, The Pale Door can suffice. But don't get your hopes up for a grand moment in cinematic history."}, {"id": 39, "text": "Deciding to pull off a train-robbery, a group of outlaws is shocked to learn their target is not gold but rather a chained-and-shackled young woman who offers to take them back to her home-town as a thank you, only to realize too late they've stumbled into a coven of witches and must fight to get away alive.This was a decent if overall flawed effort. Among its better qualities is the enjoyable and explosive change-over that occurs where it stops being a western and turns into a witchcraft effort. Using the ravenous witches as more of a creature feature due to the unusual abilities they are shown to utilize, from turning into burnt-skin deformities and crawling on ceilings to prancing through the trees which makes for a great time overall here when mixed with more traditional spell-casting. That this livens up the final half with some solid confrontations and tons of gore as the viciousness of their straight-forward attacks or the eeriness of the supernatural spells in general really works nicely for this one this is really what the film does best is dish out the blood and gore for the action. There are some big flaws featured here. One of the main problems is the utterly dreary and slow-going pace that keeps this one stalled out for long periods of the running time. The first half takes forever to get into the main story, going overboard on overly talkative scenes showing the various problems and issues the family has in town with the bar confrontations and discussions that don't spell anything out as to what's happening or provide this with any kind of explanation as to what's going on. The opening invasion and shootout that tries to provide this with some action yet ultimately are so confusing and disjointed that there's nothing useful about it other than eating up running time, which is the issue. As well, the film tends to struggle with how to resolve itself because it can't mix the genres together all too well. The idea of the witchcraft angle taking place in the old-west could've been far more significant here but it just comes across as slightly lazy and uninspired with the finale resorting to maudlin speeches and tender reflections about the past which are incredibly contrived and cringe-inducing. They have so little room to be had placed inside a film about the goings-on in place as the series of revelations about what's going on just stops the pace dead and could've been removed without meaning anything. They manage to hold the film down quite a bit over the positives.Rated Unrated/R: Graphic Violence, Graphic Language and Brief Nudity."}, {"id": 40, "text": "The Pale Door is not a horrible film, but it is seriously undermined by the budget, the production quality, the story, and sometimes - the acting.The story is quite predictable, and even though the film is not overly long, the pacing is questionable. The film starts and stops, starts, then stops again to serve some dramatic elements.The production quality is low, but it's not really the budgetary issues, but more like the overall believability of the costumes, looks, accents, and backgrounds. It felt more like cosplayers or reenactors just starred in a film, rather than an actual real environment with real people. I think it would've been even cooler if they would use this as a premise like reenactors wanted to shoot something in some ruins of some old city, and coincidentally ran into real witch-zombies.There were some cool scenes, mostly borrowed from other films though. And as much as I wanted to like it, I still can't recommend it.I haven't seen a lot of old-time westerns, but you don't really have to see those in order to understand how unconvincing those elements were.Maybe it was my bad that I've seen Bone Tomahawk, cause it really impressed me and I wanted this film to be something similar."}], "reviews_amount": 41}