{"name": "Wander", "titleId": "tt09689696", "reviews": [{"id": 0, "text": "Good actors wasted in this. direction poor plot weak and dragged along like a wet blanket"}, {"id": 1, "text": "It's like the script was written by someone who wanted to make money off the popularity of 'conspiracy theories' but they didn't know anything about conspiracy theories. So the writer(s) got together one weekend and surfed a conspiracy theory message board for a few hours, jotted down a few frequently used phrases, then forced them into a nonsensical story.I finished it wondering who it was made for...because people who loathe conspiracy theorists aren't going to like it. And actual conspiracy theorists are going roll their eyes at all the cliches.Lastly, I'm a fan of Eckart's but his bug-eyed 'crazy conspiracy theorist' character looked like something I'd see at my local community theater."}, {"id": 2, "text": "One day in the far distant future mankind will uncover all the secrets of the universe. The last thing uncovered will be what the heck this movie's about."}, {"id": 3, "text": "I love detective movies set up in the rural or sun soaked settings but this one is far from it.6 stars only cos of the two lead actors and that too, coincidentally both played Harvey Dent/Two-Face.A mentally unstable conspiracy theorist and private detective is hired to investigate an accident in a small town. The detective suspects the accident to be a murder n part of a conspiracy cover up that caused the death of his daughter. Sounds good uh. But the execution is not at all interesting or captivating. Sneaking in and outta Fox Hole so easily, everything served on the table n no threat involved, directly or indirectly, cud have at least put some sense into our detective. A very weak n predictable ending."}, {"id": 4, "text": "This movie is comically stupid. Honestly, it is a complete and total waste of your time. It is not suspenseful and just poorly made. I have no idea why sensible people in the studios don't veto garbage like this. Anyone giving a positive review is providing false information or affiliated. Trust me. Horrendous."}, {"id": 5, "text": "I found this Movie to be a Wander what its all about  effort,oh Tommy Lee,what did you get mixed up in this for ? It was Very hard to figure out what it was getting to,that was the reason I kept watching it,very glad when it eventually Finished.."}, {"id": 6, "text": "Other than an excellent performance by Aaron Eckhart, there is nothing special about this movie. Decent conspiracy theory plot. A decent way to pass the time."}, {"id": 7, "text": "I saw Wander, starring Aaron Eckhart-Sully, The Dark Knight; Tommy Lee Jones-Jason Bourne, Batman Forever; Katheryn Winnick-Big Sky_tv, Vikings_tv and Heather Graham-Angie Tribeca_tv, Scrubs_tv. This is an off the wall detective story. I say off the wall because the detective-or actually, former detective turned Private Investigator-has mental issues and is seeing conspiracies everywhere. Aaron plays the heavily medicated P.I. that is asked to check out the death of a woman in Wander, New Mexico-in case you were wondering what the title meant, yep, it's the town's name. Tommy plays his best friend and co_worker-they both do a radio show together in their spare time that is mostly about conspiracies. Aaron thinks his client's death might be connected to the death of his own daughter-years earlier-because, among other things, he sees Katheryn at both crime scenes. Heather plays Aaron's friend and lawyer and she thinks Aaron is taking too many drugs and that he might just be hallucinating a little bit. The question remains, is he hallucinating or is their any truth to the conspiracy ideas floating around in his head? There are times when even Aaron doesn't know which is which. It's rated R for violence and bloody images and has a running time of 1 hour &amp; 34 minutes. It's not one that I would buy on DVD-once was enough-but it would be alright as a rental."}, {"id": 8, "text": "My brain refused to recognize her troughout the flick &amp; it's only after the credits rolled that I went on here to, sadly, confirm my suspicion. So sure it's not a disaster, &amp; i would have enjoyed it like a neat B-movie, were it not for the opening dedication, that sets the tone for something far more serious, i'm a second gen migrant &amp; tbh felt kinda insulted ;) I get from her bio that the director is a native &amp; even maybe a feminist, but immigration &amp; displaced populations are subjects more deeply treated in The Daily Show than in this descent into madness wannabe thriller... Oh &amp; for those praising the twist, it's literally spelled out mid movie, so yep, good effort tho."}, {"id": 9, "text": "This movie is going to end up in art schools for what not to do. I wrote down the writer and director's names. I then created an alert, so that if they ever do another movie I will not have to see it. How do you get that much talent in a movie and just blow it?"}, {"id": 10, "text": "I don't understand which people rate this any lower than 6*??? If its not your genre just don't watch it. If you like comedy this is not for you obviously, but then don't watch and don't write nonsense poor reviews which make no sense.Due to people giving nonsense reviews a lot of movies have totally ridiculous ratings on here. From very poor ones rated 9 stars and very good ones rated 2 stars. Dont write about your taste, but be objective. Rate it for what it is, not on what you want it to be.Its a Solid proper 8*, great original story and proper acting!"}, {"id": 11, "text": "What a film! Very stylistic so it's not for everyone. They did an exceptional job exploring the manic nature of grief. Those who can relate will like this."}, {"id": 12, "text": "I love conspiracy thrillers! Wander has tons of energy and manages to keep the same pace right to the end. There is great cinematography as well with a few memorable images in the New Mexico setting. The music, sound and thunder are all well managed and put to good use. The critics just don't like this because it's not a typical Hollywood!"}, {"id": 13, "text": "Crappy movie cheaply made . Sound track sucked what a bunch of pretentious music in inappropriate scenes and editing. Acting is good actors high quality . But that said writing and directing sucks ."}, {"id": 14, "text": "Probably written and made in 2 days to profit on the mass hysteria of the idiots who shout conspiracy at everything connected to covid-19. this film brings out all the rubbish published in social media about the chips that are supposed to be inserted into the bodies thru the immunization. This movie should be banned by US government just because of the mean and evil message at it's beginning stating that it's made to honor those who were killed by those people who guard our borders. Disgusting!"}, {"id": 15, "text": "Aside from maybe Shelley (Heather Graham), none of the characters in this movie were very likeable. Together with a disjointed storyline that wasn't very satisfying, by all means this is a movie a movie most will never miss. Some credit is given for cinematography and settings."}, {"id": 16, "text": "The ending really got me! Don't read the bad reviews and watch it. Solid storyline and the acting is exceptional. One of the best films i've seen this year"}, {"id": 17, "text": "I saw the premiere at Deauville and the message to the audience from the director and producer before the screening was that Aaron Eckhardt put his heart and soul into every scene he was in, and I couldn't agree more. While the story can be a little cliche at times, and a twist that reminds me of a certain Russel Crowe film, I enjoyed every minute."}, {"id": 18, "text": "Arthur Bretnik (Aaron Eckhart) is into conspiracy theories. He is paranoid and has a touch of PTSD after a car accident killed his daughter and made his wife a vegetable. He operates a remote broadcast from his desert trailer aide by his friend Jimmy (Tommy Lee Jones). He is friends with Shelly (Heather Graham) an insurance agent who throws some investigative business his way. A caller to his radio broadcast wants him to investigate a murder. Arthur takes off to the town of Wander with its strange inhabitants.The film had a lot of stars but as a conspiracy film it leaves a lot on the table. It was not well done. Arthur's paranoia and flashbacks became more annoying than entertaining.Guide: No swearing, sex, or nudity."}, {"id": 19, "text": "Don't get me wrong, I enjoy a film that does some time jumping back and forth, like Pulp Fiction, when done properly. The problem with this movie is that the plot just isn't that interesting or cohesive. It is just kind of a mish mash that doesn't really come together in my opinion. After we watched it we did not really think it was worth the time."}, {"id": 20, "text": "Some people are too critical. This movie may not be a masterpiece, but it's well made. The pace is great, never much slows down, keeps going to the next scene and keeps you wondering what's going on. Sure, you start getting ideas in your head about which characters are in on it but EVERYONE can't be, so you're never really sure.Not so much a thriller as you might expect, but kind of a mystery....is the main protagonist just crazy? Is he on to something?Who can he believe in? And that, I believe is the message here...careful who and what you put your trust into."}, {"id": 21, "text": "Without giving away the plot, the last third of the movie becomes very confusing. By the end, you'll either think to yourself, 'what did I just watch?' or you might try to make sense of it all.Almost everything in this movie seems to be on point in terms of the quality and production, except for the plot near the end. Definitely has great acting with this cast.It's a decent and watchable movie up until the last third that didn't click with me"}, {"id": 22, "text": "I never (ever!) write reviews. I felt compelled to write this one after losing 90 minutes of my life to this terrible movie. I'm pretty easy to please with movies, and thought with a rating of 5 this one would be ok. Absolutely not.This was hands down the worst movie I've seen in a decade.Story meanders (wanders?), characters were just flat out not believable and the overall plot was just stupid.Don't waste your time. Re-watch something... anything... before investing time in this god awful flick."}, {"id": 23, "text": "Have no idea, why everybody hates this film ?By any means it is not a master piece ,but it is pretty well done,with a very good acting and ok story,Not a bad one time watch!"}, {"id": 24, "text": "Why the low ratings? Don't listen to these people and give the movie a try. It's a fun crazy ride with amazing acting and a great story. Definitely worth the watch"}, {"id": 25, "text": "FIN! I loved the ending, totally unexpected. Great performance by Eckhart, and great to see Tommy Lee Jones still killing it."}, {"id": 26, "text": "If you're looking for the typical movie, this isn't it! This psychological and mentally stimulating thriller keeps you on the edge of your seat wondering what's next and speculating about who did what and why and when. It's fully immersive and is definitely worth the watch. Get ready to be shocked, surprised, and a bit confused at different times as timelines are moved back and forth, and characters that seem one thing turn into another. It definitely keeps you thinking, and Aaron Eckhart delivers an authentically spectacular performance! A great lineup of excellent actors!"}, {"id": 27, "text": "A good thriller keeps you on your toes. Wander handles the misdirection well, resulting in an actual shocking ending."}, {"id": 28, "text": "The brilliance of this film in correlation to its current rating (5/10) is making me reconsider what the critics use to measure art and intrigue."}, {"id": 29, "text": "Wat a moving performance by Aaron Eckhart .. simultaneously the story and screenplay cudve gone better side by side but still ... A promising topic and the end does justice to the movie."}, {"id": 30, "text": "All actors deliver a stellar performance in this gripping thriller that keeps you guessing until the final scene. By far one of Aaron Eckhart's finest roles and he executes it flawlessly."}, {"id": 31, "text": "It attempts to beat you over the head with a metaphor, but you're uninterested because it's needlessly confusing and grotesque."}, {"id": 32, "text": "The director, April Mullen, decided to work on a conspiracy film after watching Shutter Island and getting her experience directing tv episodes. This is her first real attempt at making a movie and it shows. Lots of cut scenes, scatterbrained plot and everything is supposed to be edgy as it's about conspiracy. It doesn't have to make sense. To her credit she was able to persuade some popular actors to be in her film and I'm guessing they took a pay cut in exchange for a percentage of the profits, which will be slim. Katheryn Winnick from Vikings fame is the most disappointing of them all, and she seems to act wooden in everything she does here, zero emotion, no effort and just spits out her lines like a robot. The story is really over the top once you reach the end and it doesn't lead to any revelations the viewer can't predict at the mid point. In general, you don't get a pass for making a terrible, confusing rattle brained movie just because you label it a conspiracy and therefore it doesn't have to make sense."}, {"id": 33, "text": "Aaron Eckhart mumbles his way incoherently through this poorly thought out thriller. The story line is thin, the timeline appears to be all over the place and the only reason I saw it to the end was to see if there was any remote possibility that it might improve. Shame, could have been a good film given that the actors are generally of high calibre"}, {"id": 34, "text": "Although I figured out the plot twist about halfway through, this was an enjoyable ride and good to see some of the possible conspiracies that could be happening in our nation as we speak."}, {"id": 35, "text": "I was very pleased to see this film, it had a mixture of Lynch/Tarantino/Coen touch to it. The acting was superb, the twists were a complete turn around, from a conspiracy theory to a full circle, does the mind play tricks on the individual or are they set upon? You'll find that you'll want to watch it again, to pick up from where things go weird. I watched it with headphones, which I usually do, and it prompted me to write this. I'll be seeing this again,I'm sure some of you will too...//Jimbo"}, {"id": 36, "text": "This film start with a woman Zoe been killed, and the introduction of the main character Arthur scene! As turnout, this film is about solving the mystery of the killing of Zoe! Zoe actually kill by the chip implant in her chest! Entire film full of boring conversation, and super annoying overuse scene! Such as, overuse of the super annoying song playing at the background scene, overuse of the recording audio log scene, overuse of the hallucinate scene, overuse of the flashbacks scene, overuse of the taking medicine scene, overuse of the searching scene, and overuse of the calling names scene! Make the film unwatchable! Barely intense scene is, Arthur constantly shot at Canton to kill him! At the end, after revenge for his daughter, Arthur gouge out the chip inside his chest! That's it! Wasting time to watch!"}, {"id": 37, "text": "Good storyline but bad Directing and Editing plus absolutely a waist of good characters. Looked like they didn't have a direction to tell the story. Camera work wasn't great as well but atleast the acting is up to parr as that they had good actors to start of with."}, {"id": 38, "text": "This is yet another B script that somehow got made with a terrible story that's all over the place and has less to do with conspiracy and more with delusional psychotic writer that thought this would be entertaining. Aaron does a great job so it's a shame it's wasted on such a poor script and directing. The ending tries to wrap up the silly chip implant and border/immigrant and I guess something totally not explained which is tossing in Indians lands. It's so far fetched you just wonder if they though this would be some artsy film like Memento but it fails on all levels except main actor Aaron. Watch it with a large cocktail and you might just enjoy the first half but the 3rd act is ptsd laughable. A 3 star mostly for Aaron trying his best to make the story work. Hope the director finds a better script next time"}, {"id": 39, "text": "Really good actors in this one - I give credit for that. The story is good, but its told in a not convincing way. And the result is confusing. They could have told the story in a better way, and we would still get the point! I would spoil the plot if I told you what I mean....."}, {"id": 40, "text": "Yes, the movie WANDERs all over the place, Confusing, disjointed. Incredibly hard to follow. The plot is revealed near the end but quickly and it's rather formulaic. We've seen this kind of stuff before. I like Tommy but in this movie it's hard to look at him. He needs to retire. And the other main actor goes through the whole movie as if he drank 6 cans of energy booster before each take."}, {"id": 41, "text": "Surely this is not a normal detective story. It's not Psycho either. The camera changed from beautiful scenery to the shaky handycam. It just got so many pieces put together that you normally won't find in one movie alone. Before the end it gets a little weird who is the good and who is the bad, that part was a bit weak, but the all over movie experience was interesting and there was always a good pace to not let it get boring. I enjoy movies that I think I haven't seen before, which of course is difficult, because you have seen this in another movie before. There are very less new ideas out. But at least the composition of this one makes it feel like something I haven't seen before. Oh, and I liked the music."}, {"id": 42, "text": "Private investigater Arthur Bretnik (Aaron Eckhart) and best friend Jimmy Cleats (Tommy Lee Jones) are paranoid podcasters living in a couple of trailers in the Middle of Nowhere. Arthur is mentally disturbed after suffering a personal tragedy. His friend Shelley Luscomb (Heather Graham) is concerned. He gets hired to investigate a questionable death in Wander, New Mexico. He is confronted by Sherif Luis Santiago (Raymond Cruz). There is the mysterious medical examiner Elsa Viceroy (Katheryn Winnick). Arthur may indeed have uncovered a vast dark conspiracy or may be his delusions have finally taken over.These are good actors and the potential is there. There is an issue of reality. The characters bring out the first question themselves. Why would they lure him to town? These bad guys are presented as almost omnipotent and yet they let a wild card loose among them. The movie tries to give an explanation but an easier move would be just kidnap him and lay him out after the massacre. The other explanation could be that it's all a hallucination but that's waylaid by Shelley opening that envelope in the end. There is simply no explaining the initial move of the movie. It's asking the audience to believe in conspiracy theory and I can't be that delusional."}, {"id": 43, "text": "Just seen it. Good acting and directing.. not sure why people are rating this low. Film starts slow but really speeds up. Give it a go"}, {"id": 44, "text": "This is at least a 7 honestly. Great acting and the storyline was perfect. Nice to see Tommy Lee Jones still doing his thing. He's still got it! Watch and support this film!"}, {"id": 45, "text": "(Aaron Eckhart gives a brilliant, unhinged performance as a conspiracy-obsessed detective with a very good dog.)I can understand why this conspiracy flick garnered reviews across the spectrum. Eckhart is fantastic as the unhinged fanatic private investigator who is chasing down the person he believes is responsible for his daughter's death.This is very much a B-movie that attempts to be off-beat but ends up hitting all of the detective stereotypes. This is one of the more mediocre neo-Western detective films we have had in the last few years in the same vein as Mystery Road and Wind River.It was good to see the two two-faces actors on screen together albeit they are both past their prime."}, {"id": 46, "text": "Firstly I'll start off by saying I think Aaron Eckhart, Tommy Lee Jones and Heather Graham are all good actors and they do a decent job in the movie. However, Eckhart's acting is a bit over the top sometimes that it almost comes across as a cheesy B-movie, especially the shots when it's zooming out from his face when he's having flashbacks or waking up.The story itself was quite predictable, at about the halfway point you can hazard a guess about the main character, although they don't explain much in the movie. At times I found this movie a bit boring and slow despite it being only 90mins.Some of the shots and the sequencing also weren't enjoyable either as it was just all over the place much like the story. I also wasn't a fan of the ending. When it all happened I didn't feel any emotion for the character at all other than being glad the movie was over.Finally, this was just a small nitpicking thing, but if you are paranoid like the main character and afraid of being spied on that you are constantly changing your phone SIM card, you definitely would not plug a random usb stick into your laptop that has been mysteriously slipped through your door."}, {"id": 47, "text": "I'm still baffled as to what the heck this movie is all about. Immigration, murder, PTSD, mystery or what? Great actors whose talent was nothing more than wasted. It was written for anyone with at least a sixth grade education. As conspiracy theories go, most of them are the product of unmedicated schizophrenia, but this movie doesn't even reach THAT level. The direction was lacking a director to direct the director. The camera work failed completely. The entire movie is an unmitigated mess. I was thinking the whole thing was sloppily put together to turn over a quick buck, but even then, it would have to garner viewers to make that possible and I can barely see this making back the money used to produce it. I can only believe that the actors did this out of friendship to one or more of the producers, not really caring about the money. There is no mystery to it, and PTSD has been done to death, and far better than this movie. As to illegal immigrants, well then, it's illegal. If there are no consequences then anyone and everyone who has ever been convicted for doing anything illegal should be freed immediately. I'm truly at a loss to figure just where this movie was going and what it was trying to say. It certainly leads me to wonder."}, {"id": 48, "text": "I was not expecting anything when i watch this movie, thinking, another conspiracy movie, but i was enjoying drowning myself into the madness of this man with an excellent script and a very Very good direction and montage.The plot is totally nuts, the actors are amazing. The ending is excellent!The story is classic, but the way they put the elements in place for us to discover the story, and mix up reality with dreams, and nightmares are very good!You will be confused, you will be uncertain if it is real or not, only the ending of the movie will gives you the answers.When i watch this movie, i re-think about other tv shows like: twin peaks. Some parts of the movie will made you uncomfortable because you will be close to the madness of Aaron Eckhart.And it remember me conspiracy theory 1997 with Mel Gibson, but this one was too funny and not really realistic. This one is really realistic."}], "reviews_amount": 49}