{"name": "Skylines", "titleId": "tt09387250", "reviews": [{"id": 0, "text": "Absolutely awesome low budget alien sci-fi franchise. This one is as good as the first film. Loved the post credit scenes, that's great stay-at-home entertainment."}, {"id": 1, "text": "This is an honest review. No this movie will not win any Oscars but its not has bad has people say.Its the third instalment of the skyline movies and its not so bad.The FX are pretty good, the acting average, its packed with b movie actors so what did you expect.And the story is nothing to rave about... its not a bad movie but i was clearly made to cash up on the other 2.Its an ok way to spend 2h and after its over highly forgettable."}, {"id": 2, "text": "It is what it is. A TV movie with a cast that act according to the budget and ability. A poor story and direction, It's too long so don't waste 2 hours."}, {"id": 3, "text": "I actually watched it for Lindsey Morgan. But i once started i watched without skipping it! watch it"}, {"id": 4, "text": "I enjoyed the movie, it's got a few plot holes and things that could be improved here and there. Lindsey Morgan kicked butt so I bumped it up a few stars just for her."}, {"id": 5, "text": "The third instalment of the Skyline series is not as bad or as great as some reviewers are saying. Some of the dialogue is pretty bad, but the acting is OK and the effects aren't terrible. You could watch a lot worse."}, {"id": 6, "text": "It set out what it set out to do it was entertaining - dont listen to people who bash this.not bad at all I hope we get more down the line. Maybe a stronger alien race will come to try to wipe out earth and Rose will have to save us."}, {"id": 7, "text": "Yes there are moments where the CGI isn't the best or the acting, but underneath it all is actually a pretty good movie. I recently rewatched the first two movies in anticipation for this and I'd say this one is definitely better than the first one but a little weaker compared to the second one. It helps to have watched the other ones as well. Overall I enjoyed Lindsey Morgan's performance and there are some great visually looking scenes."}, {"id": 8, "text": "You've got a little girl lead actress playing dress up as a man in charge, and seems to have been made on someone's phone."}, {"id": 9, "text": "I've seen a lot of reviews saying Lindsey Morgan shouldn't have been the lead, calling her « little girl » « poor lead »...Lindsey Morgan is the most hardworking person I know, she's talented and her acting is great. She deserves to be the female lead more than anyone! I truly loved Skylin3s!I recommend it!! If you don't like this movie, maybe try to write a helpful review on how they could improve it instead of criticizing someone's acting and whole career. Anyways can't wait for skylines 4!"}, {"id": 10, "text": "The whole premise to the trilogy is pretty good and the first two are enjoyable. However, Lindsey Morgan is a poor poor lead, she was rotten in The 100 and that was truly horrific TV so having her be the lead in a movie is too much. Alexander Siddig is his usual class and tries to offer some credibility but to no avail. As for Rhona Mitra, she scared the bejeezus out of me, they should have her play the 'bad guy'."}, {"id": 11, "text": "I really love it, the story is really nice and the cast is so good ! They played very well, and Lindsey Morgan playing the main caracter is just so great. Really good !"}, {"id": 12, "text": "As a sci-fi fan, I enjoyed this movie. Far better than many others I've seen this year."}, {"id": 13, "text": "Im pretty sure I'm the first review since the movie hasn't even comed out yet BUT just by watching the trailer I love it already . especially if linzz Morgan is in it , no explanation. This is a good movie . WATCH IT when it comes out !!"}, {"id": 14, "text": "I nearly didn't watch this when I saw the review score but after seeing all the others in the series I had to give it a go and I am pleased I did.The movie has some genuine funny moments especially with the alien dialogue and the special effects were great and up there with any other movie. Acting was good with some decent characters.If I had to have some negatives it would be the movie is a little to long at 2 hours and could have been shorter although saying that it did not drag or get boring. Also some parts of the story were a little vague in placesOne the whole a good movie and worth a watch"}, {"id": 15, "text": "I don get the hate from many, that give that low figures for this movie Oke its not like Battlestar Galactica or 1 of the Marvel movies, but overall its a fun scifi movie to watch. What do you expect from a lower budget movie. I think the acting and special effects are really oke. Story was good and really entertaining, i give this movie a higher rating cause of the haters. I really liked it, period."}, {"id": 16, "text": "Graphics like for children, boring details, wasted money for this movie."}, {"id": 17, "text": "Lindseys acting is great and awesome and even though i dont like aliens or just that kind of content in movies lindseys acting just makes the hole movie ten times better."}, {"id": 18, "text": "Everything is awful !The first movie was good. The second was 50/50, this one is awful.CGI are correct, everything else is just a pile of crap. The story is ridiculous at best, the ost are not very good, the acting is really bad, Lindsay Morgan do is best to save this movie, but it was pointless at start because of the story.Not a good skyline at all. Not a good scifi movie at all.By miracle they destroy the aliens planet at the end. This is the only good point of this movie, they do not open the door for a n° 4. Good idea to close this franchise, like, FOREVER."}, {"id": 19, "text": "The cast and crew did an amazing job. Their acting are incredible. Lindsey Morgan is an amazing actress, her face expression shows 100 different emotions. I hope to see her more in skylines franchise. Aliens, planets, cinematography, camera, make up, etc are 10/10."}, {"id": 20, "text": "This should have a lot better ratings that 4.5\\10 this is one of the best sci-fi movies i ever seen! The actors are amazing, the effects are good everything in this movie is amazing Definitely watch! Also don't listen to the bad reviews!!!!!!"}, {"id": 21, "text": "It was full of Sci Fi Action. Kept me on the edge of the seat throughout. Good acting by all and the setup and costumes were awesome. It is not at all a low budget movie. Graphics are best made. Must have a watch if you like first two parts. Its better than the two. Forget about low ratings. Watch for yourself."}, {"id": 22, "text": "I have a weak spot for the skyline trilogy - this is the worst of the three but that doesn't make it any less enjoyable - the lead is great - the plot is terrible but it's skyline so I love it - say fi channel worthy but way better than sharknado - looking forward to the 4th instalment! And I think I have a new hall pass nominee haha"}, {"id": 23, "text": "I really loved this movie, there's so much action you can't feel bored at ANY moment. Also the acting is pretty good, I'm in love with Lindsey Morgan."}, {"id": 24, "text": "Lindsey's Morgan acting is AMAZING- I loved that movie so much it's one of my favorite"}, {"id": 25, "text": "I personally found this movie great!! Filled with action and suspense! The actors portrayed their characters amazing and i love to see a incredible, strong women portray Rose so well. It's like watching a sci-fi superhero movie but not knowing if the superhero will win! I loved it!!"}, {"id": 26, "text": "Y'all are being so negative?! This movie is so badass and amazing! The acting is perfectly fine and Lindsey Morgan did such a great job! Definitely recommend watching this movie."}, {"id": 27, "text": "The 3erd movie of skyline , and the best in my opinion .but all 3 movies were great.deserves better ratings."}, {"id": 28, "text": "It has mostly pretty cool visuals, decent acting, some interesting/innovative concepts, some really cool fighting/action, but it also has some weak and corny scenes (especially at the end)."}, {"id": 29, "text": "I love every part of this movie. The graphics, special effects, the story, the decors and backgrounds were incredible!! The cast was phenomenal and did an amazing job. Lindsey Morgan did a wonderful job portraying Rose. She showed who Rose truly is and the emotion was real and there during the whole movie. Her performance was powerful and she did a wonderful job; which added more to the movie. Liam O'Donnell is a brilliant writer and director. The movie wasn't to long as everyone is saying the 2hr was filled with emotion, action, and everything you're looking for in a Sci-fi. I will be watching the movie again and I hope they make a 4th movie!!"}, {"id": 30, "text": "I loved this movie! If you love 80s sci-fi then this movie is for you. It's not trying to be anything other than a good time. If you are expecting intense drama, massive sets and explosions galore than Michael Bay is your cup of tea. But I love Indy movies and this one checks all the right boxes for me!"}, {"id": 31, "text": "It's a real story of science Fiction the story is original and the movie it really Taking when we started we can't stop to watch it !!"}, {"id": 32, "text": "The first hour is slow! If you can muster patience it gets really good and turns into a really great movie.The CGI, sets, lighting was super great. Really well done and visually pleasing!I really wasn't feeling it in the first hour at all. Glad it turned around!It definitely had an overall made for TV feel for the first half. The Alien dialogue was cheesy which didn't add to it, although I can see how it would be funny for other viewers - and yet it works in the last half.Good stuff. I'd give it a higher rating, but the first half wasn't awesome at all."}, {"id": 33, "text": "I loved this movie it was really awesome and lindsey morgan acting was just amazing ❤😍"}, {"id": 34, "text": "If you want to watch a weird remake of, or at least heavily inspired by, Aliens then this is one for you. I remember the first film and had to read up on the second because I had totally forgot what happened.. If they make a 4th then I'll probably have to read what this was was about before I watch that one.It's about 30mins too long"}, {"id": 35, "text": "I started watching and thought: here's another proof that the next episodes are only getting worse. But in the end, I changed my opinion. This is certainly not the first episode, but it is better than the second. And I was surprised to see still young Daniel Bernhardt."}, {"id": 36, "text": "Well, I never was a big fan of SkyLine, the first film. It was ok, for what it was. Beyond Skyline was actually pretty good - I remember being surprised. But this was disappointing for the expectations I had. Slow at the start, cliche in parts. Felt I'd seen this story in many other sci fi films over the years."}, {"id": 37, "text": "All I can say is the negative feedback I've seen on here saying this is slow etc obviously haven't even watched it. Massively improved on previous 2 movies."}, {"id": 38, "text": "You guys are being awfully dramatic. The movie is fine and good . Nothing is wrong with it , it was actually very good AND I recommend watching it !."}, {"id": 39, "text": "I was quite disappointed with this flick. Rhona Mitra didn't have a real role, so her character was basically throw-away. Alexander Siddig gave the worst performance of his life ( he usually has an excellent screen presence ). The lead character was a 'Mary Sue' with glowing eyes and a weird killing hand ornament. The script didn't hold together. The character development was essentially non-existent. Too many movie tropes thrown in for no apparent reason. Lots and lots of bad acting. The film relied on lots of ugly special effects , but too many scenes were nearly black. One strange fight scene to another and a martial arts duel thrown in that made no sense and was completely unrealistic. The main driving force of the movie seemed to be deciding when stuff was going to start glowing blue or glowing red. The first Skyline movie was quite good. The second was OK. This one totally bit the dust. The ONLY thing I liked about this movie was Jonathan Howard. How is this boyo not an A-List actor ?"}, {"id": 40, "text": "A movie that is not terrible but it's not good. The worts part about is how predictable it is and how hard it tries way to hard to make cliches. It's just pathetic and annoying"}, {"id": 41, "text": "Having recently watched Beyond Skyline, this is a good addition to the trilogy. I do love Lindsay Morgan (Rose Chorley) as the main protagonist as the previous film she provided some exposition for that film &amp; only makes a brief appearance at the end. Who know that this Raven (100) would become an aliens killer?!Whilst I watched the beginning scenes, I did wonder why there was a copy of an Aliens scene. The action packed film is decent enough. The so called Antagonists are easily spotted before the ultimate reveal.It is not a ground breaking film but it worth a watch for sci-fi fans out there."}, {"id": 42, "text": "3 count them 3 there should not have been more than 1?!"}, {"id": 43, "text": "The film opens up giving us a lot of background information about alien Harvesters who want to harvest human life. Rose is born in the alien blue light and has some powers but ages fast. A crew is going after a power crystal off a destroyed alien ship (explained in the opening) light years away. This is so they can save the hybrids who have become rabid and are attacking humans.The story was not explained very well. The hybrids are thrown at us without explanation. Rose (Lindsey Morgan) laments over having to kill her own kind in the opening and I still don't know it they refer to the aliens or the human ship she shot through to destroy the aliens. Why would they say her own kind? Then she talk about looking for her father. Is this her biological father who has his brain removed from his skull or the guy who raised her? This made watching the film tedious. Lindsey Morgan has that Tomb Raider look going for her, but that was about it.Guide: F-word. No sex or nudity."}, {"id": 44, "text": "The first one was an okay, watch it once popcorn movie, the franchise becomes progressively worse, I never expected this one to even be made. I could only recommend this to big fans of the first 2. My GF normally watches anything but even she thought this was bad, I had to watch this over 2 sittings as it just seemed to drag forever."}, {"id": 45, "text": "I don't know what else to say tbh. Maybe if they didn't make the aliens look like rock em sock em robots, I might have given them 2 more stars."}, {"id": 46, "text": "Why oh why was this made?One of the worst movies of the year if not the decade.It has no redeeming qualities, not a single one. Don't waste your time on this ..."}, {"id": 47, "text": "Greetings,I'd like to start a review by saying that I absolutely enjoyed the first movie. It was genuinely scary, terrifying and frankly speaking well done. It had a good somehat heart braking story line.The second movie was a B type movie, that introduced unnecessary cheesy fighting scenes as shallow humour. However, it had an interesting (albeit not unique) idea of turning adversaries into allies. It could not live up to the first movie unfortunately.This third movie is a wasted potential. Various plot holes, unmemorable characters and oversaturated amount of poorly executed fighting scenes. The humour was inappropriate also.I am sad that the movie makers turned a genuinely scary movie into a parody of the first movie. It is beyond my comprehension why such a great deal of potential was wasted. This movie has very little to do with the first one.In my opinion this was the last nail to the coffin. Which is sad to say the least."}, {"id": 48, "text": "I won´t lie to you as many of those planted 10/10 reviews here. This is a small, cheap and simple movie. B-movie territory through and through. Acting is...average...and the story close to nonsensical. Godfather this is not, obviously.But, the designs, quality of CGI and the action scenes totally make up for that. If you want some neat little Aliens clone with an 80s vibe you will feel right at home. This stands proudly next to trashy fun like Corman´s Galaxy Of Terror."}, {"id": 49, "text": "First of all, let me say that the movie is not bad, but it's not the best of the trilogy. It worked as a closure to the franchise, but It felt like another episode of The 100, or some CW bulls@#t (it didn't really add anything new). The effects were ok, the visuals good and the fight sequences were the best. I was really hyped for this one, I even re-watched the first 2 movies before watching this and I actually liked those two better, especially Beyond Skyline with Frank Grillo. Even the first one was better than this one."}, {"id": 50, "text": "As a standalone movie the alien has a purely comic look, just an awful crazy predator like look and totally unconvincing. Thee wooden acting was only surpassed by the silly alien human dialogue. I am not convinced there was a plot just some loosely connected scenes with a Dr Who feel about it all, cheap sets, poor acting and nothing convincing about it all. Overall it was a miserable attempt at aliens and not worth watching"}, {"id": 51, "text": "How did they balls up this title? The first film was a surprisingly great movie, simple but brilliant, lots of action and a good survivor movie. 2nd one wasn't bad either, the let down with the 2nd was the lack of returning cast as the cast from the 1st movie played really well but again the 2nd was a good follow up, the 3rd movie should have been set straight after the 2nd with all cast returning for a final victory against the aliens but we end up with this mess of a story.. The lead cast is uninspiring and fails to grab the audience, the effects are good but that was to be expected, nothing stands out about it! The writers and producer really let this title down! They should have kept the plot grounded and true to the first 2. Bringing all the survivors together to fight back but instead we end up with this mess that looks more like a marvel comic movie.. Then again Hollywood have been failing for several years now because they always disregard original material.. A real shame and a waste of a potentially great franchise.."}, {"id": 52, "text": "I expected B movie category. Sadly this movie didn't even get that far. The plot is childish and full of holes. The science is... Not science. The tech comes from a hodgepoge of pieces gathered from a 70's tech level dump lighted in blue or yellow. The acting is wooden. The cgi makes no sense. The progress of the story is best described with a ???I couldn't even make it to the end to know how it ends.Avoid at all costs"}, {"id": 53, "text": "Let me keep it short...! Watch it if you have nothing else to watch for some action and CGI. QUITE AN EMPTY movie."}, {"id": 54, "text": "For a low-budget, practically independent, finalized and edited during quarantine, this movie it is what it is: confident and with heart.They have a decent cast and sfx that looks way above what the money could have supplied them with. The story is a little out of focus in some parts but it follows through just fine in the end for our hero (Lindsey Morgan). There are a few scenes of questionable CGI but for a movie that is mostly practical effects and alien suits, it's very obvious where the budget went to keep it from looking too cheap. Not everything is perfect.The characters are fun and the actors clearly enjoyed their roles. It's nice to see B-Movie action stars and familiar faces brought together for this flick.Obviously it won't be for everyone who is looking for a giant epic third installment compared to other movie sagas. Might be out of place for those who haven't seen the previous movie, but the beginning does give you an introduction."}, {"id": 55, "text": "I mean, it's in the title.This is pretty much the concept of Aliens as a sequel to Alien but projected through the Skyline franchise.Most of the scenes and the bits are identical, slightly shuffled but mostly frame-by-frame. Lots of quotes and references are also present.'Skylines' is just slightly above the level of competence that makes it an average sci-fi film. Nothing really stands out in a bad way, it's not great or probably even good but's it's fine.It's purely personal, but I just can't hate on these Skylines films. The first one felt fresh but was heavily undermined by the writing. The second one was a fun trashy B-movie action thrill with a semi-competent story. This one is a frame-by-frame remake of the Aliens yet there's just something to it I can't explain.It never felt boring, too stupid, or too serious. The action was competent, the CGI didn't look good, but it didn't look bad either.You see, this is what's confusing about this series and this film in particular.I can recommend Skylines to the viewers, who are familiar with the franchise, those, who enjoy semi-budgeted sci-fi action, and those, who love 'Aliens' and low-budget space action films of the 80ties."}, {"id": 56, "text": "Well, the 2010 movie Skyline wasn't exactly the best of movies, though the 2017 sequel Beyond Skyline was a significant improvement on the 2010 movie, I must admit that I had mixed feelings about this 2020 movie Skylines. Yet, of course I sat down to watch it, with it being a new movie that I hadn't already seen and all.So how was Skylines from writer and director Liam O'Donnell and writer Matthew E. Chausse? Well, the movie was watchable that was for sure, but it was not an impressive movie. It felt like a mixture between the 2010 and 2017 movies, so it was a bland and mediocre result.Visually then Skylines is phenomenal, and I must admit that I really liked the visual effects and CGI in the movie. But hey, such effects can only carry a movie so far. And when a movie is weighed down by a mundane and mediocre storyline, then it takes a lot for everything else to lift up the movie.They had an adequate ensemble of actors and actresses on the cast list, with Lindsey Morgan in the lead role. The cast list also includes the likes of James Cosmo, Rhona Mitra and Yayan Ruhian. But for me it was definitely Daniel Bernhardt that carried the movie with his performance.While I did sit through the entire movie and feeling sort of semi-adequately entertained, Skylines just didn't break any ground for action sci-fi movies, nor did it bring anything new to the genre. It was a watchable movie, certainly, but it was hardly an outstanding or memorable movie.My rating of Skylines settles on a mediocre five out of ten stars."}, {"id": 57, "text": "Non-stop action, Great Sci-Fi flick which unravels -worthy of Skyline saga but independent in own right.On same par as Jupiter Ascending with the strong feel of Aliens in the mix! Indeed this movie is a gem among Sci-fi genre. Actors are professional, believable and sets + CGI well done expected of a big budget movie.Has an attractive leading lady and good supporting cast like Rhona Mitra and Alexander Siddig - his line I have become Death, the Destroyer of Worlds must of been a real joy for him to say!And being a Brit love the Union jack flags and London centred action. Just fabulous.To sum up, if you truly love Sci-Fi, you'll love this - best move thus far of 2020. One of the greats."}, {"id": 58, "text": "IN A NUTSHELL: This sci-fi adventure has a lot of action and will sound a little bit familiar because planet earth is threatened by a virus. Well, that and a bunch of aliens. See, 2020 could have been way worse with aliens! Combine Aliens with Starship Troopers and you get this movie. The name of the movie might sound familiar because it's the third installment of the Skyline movies, none of which I've seen. The first one was rated PG-13 but the subsequent ones are rated R. Fans of the franchise readily admit that this is a unique situation where the 3rd movie is actually better than the first two. Liam O'Donnell directed this low-budget action flick during quarantine, so critics who are ripping the movie to shreds should try to do that themselves.TIPS FOR PARENTS: Profanity, especially spoken by one of the aliens. You have to read subtitles, which often have profanity and F-bombs. Sometimes characters are used to replace profanity like #$#!!@?! Lots of fighting with weapons and hand-to-hand combat. Lots of destruction. A guy flips the bird. High body count with bloody, gory deaths of humans and aliens.THEMES: Courage Teamwork Humanity Tolerance Hope FamilyTHINGS I LIKED: Lindsey Morgan is the heart of the movie and seems to give it her all. I thought the special effects were actually really good, especially considering the limited budget. Some of the alien designs are really creative and you get to see a lot of them up and close. Rhona Mitra's performance is quite fierce and I would have enjoyed it more but the Botox or plastic surgery mouth was super distracting. She's so pretty that she doesn't need those treatments. It's got a rockin soundtrack and an effective musical score. I like Daniel Bernhardt. He has worked as a stunt man, model, voice-over actor, TV actor, and even directed. Some humor, especially in the conversations between Rose and her alien sibling, Trent. Lots of cheeky dialogue. Mention of the movie Big. A character says, You've never seen Big? It's a classic. I totally agree. Add it to your watch list if you've never seen it! Really good martial-arts fight scene with Cha-Lee Yoon. It's been a long time since I've seen funny outtakes at the end of a movie during the rolling credits, but this movie has them. Yay!THINGS I DIDN'T LIKE: There is a LOT of exposition, especially at the beginning, but it's actually required so we can understand what's going on, especially if you haven't seen the previous movies in the story. Because the plot is complicated, more exposition is required throughout the film which bogs it down. It's hard to really like the heroine because of her cranky personality. The one character I liked the most was her alien sibling with the potty mouth, Trent. Some overacting made me roll my eyes. Soooo many of the scenes are visually dark, which will make viewing the movie on small devices difficult once it goes to streaming. Act 1 is very slow but hang in there because it picks up speed. The scenes seem to jump forward and back in a confusing sequence. It's just too long. Honestly, I got bored. That giant blue Easter egg was a ridiculous prop. It literally looked like one of those big plastic eggs I bought at Wal-mart a few years ago. The actors didn't carry it in such a way to make it look like it had any heft. Sometimes the aliens really did look like people wearing big costumes. If you love Frank Grillo, you'll be disappointed that he's not in this third installment in the franchise, only in a few flashbacks. If you want to see him, check out his newest movie coming out on Hulu called BOSS LEVEL. Click here to see my movie review of Boss Level. It felt like the script could have used a lot more work. Some of the characters looked alike so I had to pay attention to which one it was.You can see the rest of my review on my Move Review Mom YouTube channel and website."}, {"id": 59, "text": "When the original Skyline came out the critics panned it as being a trashy action Sci-Fi. It may have been that, but it did it really well, that's what made it so popular.Then there was the obligatory sequel. That should have been it but of course someone thought you know there's a few dollars left in this dead IP, so let's flog it like a dead horse. This movie is awful and not in a good way. It looks like most of the budget went on average CGI, because the physical props are embarrassing, the acting is mediocre and the script is puerile.Once more a woman pretends to be a man. Why can't writers write for women anymore? We get the same old tired stuff, a script written for a man, played by a woman. Is it that hard to write a decent believable female character anymore? She literally needed a superpower to make her role more believable, what a ridiculous story.Watching this movie will make you a little dead inside, you've been warned.Computer says, No!"}, {"id": 60, "text": "Let's imagine you're hired to do the third installment of a franchise that already limped at the start. Let's also suppose that you don't give a damn and want to make this a mix of ALIENS, STARSHIP TROOPERS and your own original thoughts. Or no, better forget original ideas.But then, imagine that you have no real talent as a director and you have to work with a dumb script. Oh, and all the talented actors that you wanted just canceled. And, if you're still with me, imagine that the studio gave you a budget too low to drown everything in meaningless spectacle.That, ladies and gentlemen, is SKYLINES.The plot is stupid, the acting is mediocre at best, but mostly bad. Not because of the actors alone, though. The dialogue on many occasions is so cringy and childish that not even Daniel Day-Lewis could have saved it.Lindsey Morgan is pretty bland for a lead. Luckily, almost everyone else is even more wooden than her. I thought her alien brother to be more interesting than her most of the time. Spleaking of which - was it planned to have the aliens actually speak English with some Alien preset sound processor? I could still understand the dialogue underneath. If it was planned, why the subtitles? Oh well.The score was the definition of cheap and bland. The VFX were alright at times, sometimes even good. The camera work really wasn't that bad. The direction was at times alright, at times uninspired and lame. But the laughable plot and bad writing make this film a chore to watch."}, {"id": 61, "text": "I give you a clue, if you already don't know this: if a movie relies alot on music over dialogues that means the dialogue is terrible and empty, they have to fill it with distracting sounds somehow. Aliens are wondering around earth and they are being led by a human woman, a woke intergalactical invasion...Female lead in movies are fine if there's a good character, story, writing to support it, there are great and convincing ones the Alien series for example, even the female lead of Alien Vs predator was great and convincing!There's that cliché moment when there's a pause in the action and two characters starts talking about their past and families, this happens in so many movies. Why they have to talk about that in every movie? And all of a sudden someone storms into the scene saying: you have to see this! -- OHH MY GOD I DID NOT SEE THAT COMING!I think it all goes back to the writing of the role. The first Skyline was a cool indie movie, I really liked it. The second was meh...this one, watch it while cooking something is you want..."}, {"id": 62, "text": "It's fifteen years after the alien invasion and five years after the invasion fleet was destroyed. Rose Corley feels guilty for her failures despite being ultimately victorious. The new military tracks her down and recruits her on a dire mission to the aliens' home planet. The human Pilots are reverting back to their destructive alien self and they need a thingamajig from alienaplace to fix the thingamabob.I am utterly surprised that this franchise seems to be going full bore. The original is not the worst start to a franchise but it is undoubtedly a B-movie. Its bigger world construction has issues. For an one-off movie, a lot of that can be overlooked. As the sequel shows, the franchise intends on building on that construction. This is the third movie in the series and it seems to be doubling down with a healthy budget. Quite frankly, it may serve the franchise to pull back to do a smaller story. Going to another planet is not a smaller story. It's a hard thing to pull off and the third act is a mess. The movie is split into two locations and neither is that compelling. The trailer park could be a good small B-movie but this one insists on doubling up. All of that is to find a stupid looking egg. It makes the movie look stupid."}], "reviews_amount": 63}