{"name": "The Special", "titleId": "tt09118804", "reviews": [{"id": 0, "text": "Very predictable plot; Acting was poor; Not really much to say about this movie, other than that.It could have been 20 minutes long and we would have missed nothing.Skip it."}, {"id": 1, "text": "In a nutshell: A man is introduced to a whorehouse where he meets a gypsy woman who introduces him to a sexual object that she calls 'The Special'.This is a low budget movie and it shows. It's like a long episode of one of those classic horror tv-shows. Because of the sexual nature and twisted dual sided ending, it probably wasn't made an episode for one of those series. That leaves movies, so it had to be stretched. It has been written before: The movie could/should have been shorter. Acting really isn't that bad, neither is the script nor screenplay or pace. The overall picture is average but professional, at 3/4 of the movie you start to guess where it is going.This movie is however a must see because of the twisted plot and how that turns out, and not just for die hard horror fans."}, {"id": 2, "text": "All i have to sayI NEED THE SPECIALRight now ¨!!!¨"}, {"id": 3, "text": "Vintage TV style horror film. Poor audio, poor sets, poor acting, poor dialog. Too bad because it had a whacky premise that could have been somewhat funny."}, {"id": 4, "text": "Original, dark and funny. the acting was a tiny bit wooden at times, but personally i think it adds to the overall ambience of a dcecent dark horror film.. Well worth an hour and a half of your time if your sick an tired of cliched, made for money, genric horror flicks and want something that takes you back to when horror was full of originality and humour"}, {"id": 5, "text": "Take your arousal to another degree of degeneration. It is most definitely and acquired taste but one you have a thirst for it you will want more!!!!!!-ChronoPasta"}, {"id": 6, "text": "This was an interesting movie liked how different and unique it was as opposed from other movies. Wont spoil it too much just would recommend."}, {"id": 7, "text": "Harrison Smith never fails to entertain. His movies are unique and well written. As a fan of his I always find his movies very entertaining. I see some bad reviews but I personally think these people just didn't get it and don't get his vision.I love that his movies come across as old school. If you liked this one check out some of the other movies written/directed by Harrison."}, {"id": 8, "text": "A strong indie effort that keeps you wanting to know what is going to happen next. Old school horror fans will appreciate the practical effects. I think I would have liked to see more time spent on why The Special ... became such an obsession. 3.5 stars."}, {"id": 9, "text": "I started to give this a B for originality &amp; then I remembered a movie years ago with a talking hole in a wall. This was definitely a strange story that kept me interested wanting to know what happens next. I watched this by accident but couldn't turn it off. I just had to know what was in the box."}, {"id": 10, "text": "I can't say I've ever seen anything quite like this before, but this movie follows a new pattern of Indie film where the film makers really take an idea and run with it, creating something totally out there, not playing it safe, the type of movie Hollywood never makes. Bizarre, original, part drama, part horror, a bit of mystery, and at time humorous, it is still slightly amateurish. The soundtrack really does not fit the film and the acting is uneven, Davy Raphaely in the lead kept me watching but Sarah French as his wife I felt was only so-so. I certainly was intrigued as to what was going on and that too kept me watching. What it all means I can only guess at, sexual addiction ?, compulsion ?, the way men treat women as objects ?, these seem to be just a few of the questions it raises, but the fact that it had me thinking and wondering what was going to happen next is why I rate this at a high 7. Certainly it's entertaining. If you're expecting your average horror film, this is not it, but if you're in the mood for some slice of Indie Bizarro-Land stew, this is worth watching."}, {"id": 11, "text": "That is the first dialogue of this film so I watch this with sceptical cynicism. It is shot in low 2000 TV quality definition. The male characters are very unlikable. Having read other reviews, I do agree it is unintentionally hilarious. It is as scary as one of those alone in the dark episodes for children. This film seems like a rejected storyline for the Twilight Zone episode yet they somehow convinced a production company to make a film out of it. The result is a jumbled mess that should have been left well alone in a box."}, {"id": 12, "text": "No spoilers here - just a simple recommendation to go watch this movie. It is a small budget horror movie with a big budget attitude. You will be shocked, amazed, maybe excited at times, sick to your stomach, and of course thrilled with this movie."}, {"id": 13, "text": "It's not your average boy meets box story. It's actually an original and outrageous movie about addiction."}, {"id": 14, "text": "This movie is a waste of time, the script is boring and it ee repeating same thing. the actors are ok but the story is very poor."}, {"id": 15, "text": "I laught a lot in this movie, it was supposed to be a horror movie, but for me was more comedy and human nature. It's really make you don't want to lose any part because it was not predictable at all. Of course the best part is what is in the box? And you can't find it until the end of the movie."}, {"id": 16, "text": "I like horrors, thrillers, and syfy just like everyone else. Has the entertainment, film industry running out of story lines that they have to make crappy films like this? If you like horror movies that makes no sense and you don't care if its good or not this is for you."}, {"id": 17, "text": "I had waited a long time to see this movie. I remember seeing the initial trailer and I was intrigued immediately. The acting, the story, the effects, and especially the direction of Harrison Smith is spot on. This film is a must-see! I've watched it several times and I've recommended it to friends as well. Watch this movie now! You will not be disappointed."}, {"id": 18, "text": "Had a great time watching this. Davy Raphaely's performance is Extraordinary. This is a well-trained and talented actor. The ending of the film is shocking in all the best ways. Glad I rented it and have already recommended it to my friends not only who dig horror movies, but those who like good movies in general."}, {"id": 19, "text": "Suspecting his wife of infidelity, Jerry is persuaded by his best friend to accompany him to a brothel to sample 'The Special', which proves to be a lifechanging experience in more ways than one. The Special is one of those films that stays with you long after the credits role. Harrison Smith knows his horror. He understands how less is more and The Special is actually a quiet, dark film - no jump scares but a masterpiece, pure and simple. - @Aussieguy"}, {"id": 20, "text": "Watched this movie and loved it. I'm a die-hard horror fan and these types of weird and twisted films are right up my alley. Harrison Smith is an awesome director also.Handle: @ClawMyWayOut"}, {"id": 21, "text": "Based on a recommendation, he really wanted to check out The Special Pleasure or pain? Find out if you can predict what's next and if you might think twice next time you're offered what you think is the opportunity of a lifetime. I know I will. Glad to have found someone with a mind as sick and twisted as mine! -@GhostsScareYou"}, {"id": 22, "text": "A great movie made with the golden age of horror movies in mind. A fun awkward watch, made with love, which shows in the film. If you like em weird and cringey, this ones for you.Bad Mosquito Films."}, {"id": 23, "text": "A don't miss for us horror fans. A twisted plot that's refreshing to have, good acting and a director that's talented and needs to be recognized, Harrison Smith. Sit back, watch and you're gonna think twice about....well you'll see. A very good horror flick folks. See it."}, {"id": 24, "text": "Director B. Harrison Smith has hit another home run with this film. It's just as every bit weird, (extremely weird) as it is a story about love and obsession. It's a hidden gem that gets you going (no pun intended) from the start and just doesn't stop. Davy Raphaely who plays the lead role of Jerry in this film was absolutely fantastic. And then the special effects. Holy hell were they great. It's a perfect body horror film."}, {"id": 25, "text": "Can't say enough about this movie!! It starts at 100mph and doesn't let up until the end! It is a body horror shocker that takes you deep into the pit of obsession and shows that addiction hurts everyone. The score is beautifully done, the lighting is soft and ominous, and the special effects are AMAZING! Jerry (actor Davy Raphaely) is brilliant as he falls head first into his obsession with The Special. He does a fantastic job of making you hate him. His addiction leads him down a road that he can never come back from and its clear, he doesn't give a damn. Sarah French is beautiful and haunting in this film. She does a phenomenal job of conveying hurt and pain and heartbreak. I loved her performance. The entire cast is really good and the story hooks you immediately. The ending will blow your damn MIND!I really wanted more back story on the box and Madame Zhora... I hope that in the future we get it!"}, {"id": 26, "text": "This movie was a long time coming, I follow the director on twitter and ever time he he posted about it I got more and more excited to see it!Going to make this a spoiler free reviewThe movie explores the desperation an addict will go through regardless of how much it hurts people around you and the self-destruction it causes. This theme of this movie is very comparable to Eat, and in fact would make a group double-feature with it.The movie really comes full circle at the end, making what happened throughout the film even more disturbing when you realize the origin of the boxes content.@TipsyVersus"}, {"id": 27, "text": "Saw the movie last night. Interesting premise, which at first turned me off but was handled in a way that wasn't off putting at all. Absolutely gross at times. Accurately portrays just how powerful oxytocin is (kissing and caressing a slimy fungating mass)! Also, accurately portrays just how powerful addiction is. Addiction hurts the ones you love and yourself, paying no attention to the physical or mental effects it has on you ( think meth, with meth bugs, tooth loss, etc: dopamine is a powerful thing). I didn't see the ending coming (no pun intended), was a perfect circle back. I'm not sure what some reviewers are complaining about, the filming was great, majority of the acting was great. There wasn't gratuitous nudity at all (which I'm never a fan of in horror movies, and despite the premise of this movie) and there were a few great jump scares. Great movie, worth your time watching!"}, {"id": 28, "text": "Jerry (Davy Raphaely) suspects his wife Lisa (Sarah French) is cheating on him. His best friend Mike (Dave Sheridan) insists he cheats back at Madam Zhora's (Susan Moses) special. The special is a box and Jerry becomes sexually addicted to it to the point the obsession controls his life in a dangerous way.This is a story about obsession. I think it would have been better as a short feature as it dragged on and you suspected where it was headed.Guide: F-word. sex. Nudity (Sarah French)"}, {"id": 29, "text": "Well this puts Justin Timberlake and Jimmy fallon sketch to a new level. Great body horror but not much horror otherwise... and well.. wierd isn't the right word. Im not sure how I feel haha"}, {"id": 30, "text": "I loved this film from beginning to end. The cast is stellar and what can you say about Harrison Smith, he is an incredible director. I can't wait to watch this again with some of my friends"}, {"id": 31, "text": "...With a pretty big appetite! Or small...depending."}, {"id": 32, "text": "First let me start off by saying who will most likely enjoy this movie. If you are a horror aficionado, if you grew up watching Tales From The Darkside, Monsters, Tales From The Crypt, old school video nasties or enjoy reading magazines like Fangoria, then this movie will not disappoint you. What you have here is a well executed horror movie that pulls you in from the moment our main actor decides to take a walk down the dark side, until the very end when the proverbial S hits the F. This is one Pandora's box that even Pandora should not open. The acting is on par with movies in this budget range, but unlike other B or Indie horror movies I have seen, there is no cringe dialogue. Also, when it comes to the special effects used, it would seem that the better half of the budget was used for this. To say anymore would spoil key plot points. This is a journey best taken in the back seat of our protagonist's car.With the plethora of garbage that gets released almost on a daily basis, you will be pleasantly surprised to find The Special on your over crowded horror dining menu. Just be careful what you decide to do with the 'tip'."}, {"id": 33, "text": "This movie is an example of one of the biggest leaps of an indie horror filmmaker in recent memory. Harrison Smith treats us to a much more traditional horror film compared to his last movie, Death House, which felt more like a series of random scenes inside of a maximum security prison with a few good aspects to it. The Special surprised me since i was expecting something of a lower caliber. Something on par with his last film. I was wrong. This movie is quite good and again, is very traditional. It feels like a revisit to the recently forgotten traditionalist type horror films. Simple set up, simple pay off, with much to anticipate through out. This claims to be this big body horror movie but is actually not that body horror-esque. The story does revolve around something that the viewer knows will amount to something grotesque but it more so just has a good story and some good characters, with a splash of body horror in the end. The practical effects are great in this movie despite some overly rubber looking things. The message is strong and the script is daring. This is the type of movie that builds a filmmaker to become something great. I'm very impressed with the leap Harrison Smith has made and I am excited to see more from him."}, {"id": 34, "text": "Wow, this movie outrageous, funny, gross and scary. What more can you want?Director Harrison Smith gave us a gross-out body horror treat with this one.Poor sap Jerry thinks his wife is cheating on him. His drinking buddy Mike, played by the terrific Dave Sheridan, has an absolutely great idea. We'll show her, let's get hookers!But not just any hookers. Mike's gonna hook his good pal Jerry up with the best sex of his life. An erotic treat known as The Special.And this is where things go way off the tracks for our intrepid hero Jerry. His continued poor decisions and lack of impulse control lead him down a long, dark path of self destruction.If you take a bit of Lynch, throw in some festering bits of Cronenberg, add a blob of Chuck Russel, a maybe just an ooze of Lovecraft you'd find yourself staring down The Special.Once just isn't enough of The Special"}, {"id": 35, "text": "With halloween coming up soon, the release of films connected to death and the devil cums like a tsunami every year at the same time as the leaves rots and the world gets darker for what seems like an eternity.so why not lighten up with a good film to celebrate the jolly season. ''the special '' is a scifi horror erotic thriller that for sure will surprise you for sure. its made on a modest budget and the cast are merely of b-standards, but it has an idea that will be met with great disgust from the female audience, and wonder, laughter and surprise by the male part.its a film about sex and release, or lets call it the females reliever when sex becomes anevrotic thing and the needs from the male part cant be satisfied good enough. so we are into the fields of alternative ways to reach into the realms of the sex parlour,what we call a pandoras box to get sexual satisfaction, and its for sure not like having sex with imelda bosch or frieda miele, or Electro Vierne' in LUXembourg.no , because its far beyond that... the actors are periodically doing an A-job at the sets, espesially entering the hights of pleasure dome seems realisticly well done according to the soundwork. some blood and gore youll get too.what distracts negatively though filmographically are the zoom-use, or cronic panning the actors from chestheight and up, a bit more distant filming would have given the viewer a lot more opportunities.so to be a weird and twisted young mans tale of frustrated sexuality, the grumpy old man gives a hunky recommend"}, {"id": 36, "text": "Davy Raphaely is 'Jerry' , a Lucky Man with a High Paying Job , a Luxurious Home , &amp; an Insanely Beautiful Wife who Loves Him : but suspects She may have cheated on him . David Sheridan as his best Friend 'Mike' , takes him to a Bordello to get even for this supposed indiscretion . Susan Moses is 'Madame Zhora' , who runs the CatHouse , Doubles as a Psychic , &amp; may join in the Sordid Festivities on a Crowded Night ! Zhora's Sexy &amp; Amorous Ladies are Janae Palmer as 'Syn' , Aleksandra Svetlichnaya as 'Nada' , &amp; Christina DiNicolo as 'Erin' ; &amp; Doug Henderson is the Madame's Brawny Bouncer 'Ivan' . Drop-Dead Gorgeous Sarah French is the wife 'Lisa' , who recently learned that She's Pregnant ! The Relationship gets strained very quickly when the Seeds of Distrust &amp; a Disturbing Lust are Sown ! Tony Barber plays the un-caring 'Manager' of a Seedy Hotel , Sheri Fairchild Shines as the hotel 'Cleaning Lady' , who knows that something nefarious is a-foot , &amp; Nic Detorie is the Ever-Smiling 'Dick the Salesman' . There's Mystical Happenings that lead to Mass Murder &amp; a Serial Killer ! There's a Giallo Tone to this Terrifying Horror Flik that contains the Meanest &amp; most Brutal Monster of All ... MAN ! In Fact I've watched Horror Movies , Gangster Films , &amp; Slice &amp; Dice Cinematic Treats ... Heck , I even watched  ICHI  , &amp; I've never had a More Virulent Loathing &amp; Hatred of a Villain as I have watching the Waste-of-Life Villain in  The Special  ! Don't Delay ! Grab a Seat &amp; Don't Miss a moment of this Glorious Marvel of Terror ; &amp; let the Hating Begin !"}], "reviews_amount": 37}