{"name": "Vanguard", "titleId": "tt09695722", "reviews": [{"id": 0, "text": "Bad acting, bad action scenes, bad CGI, bad story... I could keep going on. There is so much wrong in this movie that I wish I haven't seen this. What's worse is that Jackie Chan is selling his soul to the China movie factory. It really hurts his amazing legacy. So many awesome HK movies and even some decent Hollywood movies. When judging a movie I rather want to keep politics aside but its very hilarious when all those new China movies try to sell how great China is. Like when they tell a story about an activist and portrait western people as wildlife hunters but don't say anything about a lot of Chinese people buying that stuff for health issues. 3 stars only because there is worse. China is so desperate to show the pretty Chinese people in their movies that acting becomes 2nd importance."}, {"id": 1, "text": "Most of the fighting scenes are just boring to watch and the actions in the movies are mostly absurd. The good guys never die and barely even get shot despite being outnumbered and under heavy fire. In many instances they could have killed the bad guys but somehow choose to just knock them out, and the bad guys soon come back chasing them again. The young female character playing the daughter cannot act! Her emotional scene with her dad seems so fake and the chemistry between her and the male lead is so forced it makes you want to stop watching the movie. And JC too many times trying to subtly show his praise to China, those moments just makes you cringe."}, {"id": 2, "text": "This is what I call a globetrotter. It's your generic action team going all around the world on a mission. And even if the stunts are good and the look of the movie is fine, there is simply nothing to it. Nothing stands out or is memorable, or would prompt a second watching. You can't even make fun of it (like the newest Charlie's Angels). At times, there's too many people shooting and you don't know who is who..And for such a serious movie, Jackie stands out like a sore thumb... and not in a good way. Don't recommend it, it's too boring and simplistic."}, {"id": 3, "text": "The CGI sucks big time. Lion look so fake. Even the car drift scene also fake like fark. Seriously what kind of attire Jackie Chan wearing in Africa. Lol maximum fail."}, {"id": 4, "text": "If you expect to see a movie in the style of those in which Jackie Chan is casual, and also a good fighter and acrobat, and the movie is engaging and funny, you are wrong. The positive characters are exaggeratedly devoted to the employing company, Vanguard, being such an exemplary discipline and obsessed with fulfilling their mission at all costs, like soldiers in the Chinese army. They are, at the same time, like a family whose guiding parent is Jackie Chan, thus becoming unbelievable and downright annoying. Many of the fight and action scenes curl up the absurd. The scenes that were supposed to have an emotional charge are so misinterpreted that they have become hilarious. And with the technique presented, it was exaggerated, being more than phantasmagoric. I didn't expect Jackie Chan to agree to star in such a poor quality film, although I'm convinced it wasn't a low-budget one, but he's not the only one doing it. I couldn't give the movie more than 3 stars."}, {"id": 5, "text": "Worst movie I've ever seen. I looked like it's made by some students with Microsoft Powerpoint. This earns an exclusive genre."}, {"id": 6, "text": "Terribly fake CGI all the scenes! Insult other nationalities and exaggerate Chinese people. He forgot that China destroyed world health and economy by COVID-19. I was in love with Jacky! I hate him now due to he showed us his real personality!!!"}, {"id": 7, "text": "From the first time I saw the trailer I know it would be a disappointment. Computer effect is too much and so unrealistic. The drifting Ferraris, the lion chase, limousine , explosion, water rapids even the fight scene. What a waste of big name such as Jacky Chan and director Stanley Tong."}, {"id": 8, "text": "Graphics are so bad,like a low budget movie. Never expected"}, {"id": 9, "text": "Although I am big fan of Jackie Chan since I was a kid and I think he is one of the most talaneted action actor ... but this movie is super shallow and an insult for movies junkies like me .. CGI is very bad .. no acting ... plot is shallow yet badly made .. in my humble opinion, this movie have should better been made as an animated film ... I would rated 3 if it was !"}, {"id": 10, "text": "I just don't understand how Jackie Chan accept to do this movie. it's like a movie for kinder garden children"}, {"id": 11, "text": "This is what a true 1 star movie looks like. Highlights include: Captain China, a giant DJI drone, horrible acting and a terrible script. If you are with friends and want to have a laugh, watch it."}, {"id": 12, "text": "What are you doing Jackie Chan? For one of the greatest martial artists out there, and for someone I have enjoyed watching in the past, to now wanting to enter a room full of people who are infected with covid 19, this says and shows you how crap this movie was and again I only manages 10mins of this. 10mins I will never get back. If this is what Jackie Chan has ended up doing B movies (and I'm being kind) well hang up your acting robe, enjoy the millions you have made over the years and STOP please STOP making crap movies like this. What a waste of time, just as well you can't give a zero star rating. Don't watse your time watching this crap, watching paint dry is more interesting than what this can only be called PURE CRAP..........."}, {"id": 13, "text": "One of the worse action movie I've ever watched. waste of time. even worse than Indian actions. CGI sucks!!! actors and action parts looks like childish cartoons."}, {"id": 14, "text": "There are a few good moments here and there in an otherwise terrible movie which also benefits from its visual aesthetic. For the first, Jackie in a secondary role doesn't work for his role isn't given prominence. Highlights include: The cool way Jackie gets into a car while it's in motion. A scene where Jackie talks to guy about getting into a fortress while wearing traditional middle Eastern garb. Jackie liquidating foes with a machine gun. Jackie knocking a guy into a tank of water and acting like he didn't do it The stairs gag.Those are the highlights. The main problem is that the movie is completely unfulfilling. Jackie in a secondary part, surrounded by dull, uncharismatic actors doesn't interest me or even work. The gold plated cats were admittedly flashy but the supposed fast and furious car chase left a lot to be desired. A Little better than Kung Fu Yoga, but that means very little."}, {"id": 15, "text": "Why Jackie Chan did what he did IDK. There can be many reasons, why such actor take part in this project. But my eyes... they hurts while watching this movie. Totally not worth the time was spent."}, {"id": 16, "text": "This movie is terrible. The dialogue is absolutely horrendous. They tried to make it funny but the acting was so robotic it was not believeable whatsoever. The storyline was ridiculous. Why do they always typecast the 'thugs' as big mean looking dudes who have no charisma? The fight scenes were good, but nothing you haven't seen before in all the other Jackie Chan movies. I gave it one star for that. I gave another star for Miya Muqi because she is hot. The problem with all international movies funded by China is that they always go over the top with the set because they have lots of money to throw around. Unfortunately, they also try to push the agenda that Chinese are good and 'ethical' which is far from the case. And what is with CGI made in china? Why is it so bad??"}, {"id": 17, "text": "Honestly I'm gonna give it 10 stars because it was so funny. I don't think it was meant to be a comedy but it was so unrealistic that I couldn't stop laughing the entire time. The cgi is pretty bad which is hilarious and it's so funny when movie production companies just hire Indians to play the role of an Arab, it's so freaking obvious that they're not arab and they don't even speak Arabic lmao. But honestly it's so refreshing watching a movie where Americans aren't the hero's. Also, the Chinese guy is so handsome. When I saw it in the cinema it was dubbed so that was HORRIBLE I hate when movies are dubbed, might have to watch it again with subtitles cuz i really can't stand when movies are dubbed."}, {"id": 18, "text": "This movie, in my opinion, was a lot better than his previous collaboration with Stanley. Kung Fu Yoga was okay. If you enjoyed that, you'll definitely have a romp with this film. It's the same kind of action heavy but also goofy comedy that you can expect from some of Jackie's movies. His role here is a little more subdued, however, as he lets the other actors take bigger roles. Although he's the highest billed actor here, he plays more of a secondary role as the leader of this agency. That being said, there's enough Jackie in this movie where I don't feel misled. He definitely has more screen time than The Foreigner, another movie where he received top billing but, imo didnt appear enough in the film.The action is great and it's definitely a good popcorn flick that'll distract you from the ongoing pandemic. It's what the world needs, really!"}, {"id": 19, "text": "Vanguard has some good comedy and adequate fight scenes!"}, {"id": 20, "text": "Nice Movie Best Action By Jackie Chan Best Action Movie"}, {"id": 21, "text": "Another epic action adventure created by Jackie Chan, that's why he's the living legend. Not as dangerous as his old time, but still well designed action scene.The scene in the rapid is stunning, you can see in the behind-the-scenes footage that this is not simply shoot behind the green screen (which everyone else will do so nowadays).Car chase scene is common, but you can see a new perspective in Vanguard.I'm not a Jackie Chan fanboy, but I would say you should not miss this."}, {"id": 22, "text": "This movie is disaster. Terrible CGI, woeful transitions in between scenes and cringeworthy dialogues. What is more worrying than the cheesy villain in the movie is the fact that the reviewers giving 8-10 stars are most likely paid to do so. Just take a look at their review history and you will know. Ridiculous."}, {"id": 23, "text": "It's miserable the CGI is disaster With funny cheap action sciences"}, {"id": 24, "text": "Can't miss film to watch during the lockdown, that can help you dive into the world of journeys, from London to Dubai, India and Africa!"}, {"id": 25, "text": "Jackie Chan is Jackie. Action scenes fantastic in this film. He is back with his awesome stunts and fast paced stylist actions."}, {"id": 26, "text": "Don't miss it! Very good movie:) Jackie best movie, that young actor Yang Yang is so handsome, OMG!!!!!!!!"}, {"id": 27, "text": "At first, i would like to say that Jackie he never disappoints us. A good thing is he takes care the young actors and actresses. I saw some BTS he teaches personally in every detail(y). Those young actors' action scenes are ok especially the handsome one made me search who he is. His name is Yang Yang,a traffic star in china. I am looking forward to his new project."}, {"id": 28, "text": "Watch this movie few times because of the handsome guy Yang Yang. His kungfu fighting and stunt action was great. This is ordinary Stanley Tong &amp; Jackie Chan style stunt action movie , very nice and full of fun. I like it!"}, {"id": 29, "text": "It's great to watch Jackie Chan on screen again, and his films with Stanley Tong are the best, and this one too.Can't believe Jackie is in his 60s and he still does his own stunts! Unbelievable! How many action stars can still do that?!The film is shot in multiple locations and is beautifully shot. It's great to see a film with so many shooting locations since we cannot travel anywhere under the pandemic. I feel like I've traveled to those places myself!Don't miss it! This film is great fun!"}, {"id": 30, "text": "Love the film! This film gives both comedic relief and stunned-packed action scenes. I feel that all the crew members did great and Jackie Chan, as always rock regardless of his age!"}, {"id": 31, "text": "Story is easy to understand + exciting action, it is a good film that the whole family can enjoy."}, {"id": 32, "text": "Jackie Chan never disappoints! Another great action movie by Jackie Chan. Can't believe he is in his 60s and still does his own stunts. Unbelievable! The story is straightforward and entertaining. Exciting action every 10 minutes. Probably one of the best action movies during the time of the pandemic."}, {"id": 33, "text": "I have read a bunch of negative reviews, which I think it is really meant to brush down the movie and its casts. Personally, it is really not that bad considering there is a story line and JC's action as always, humour us :) To all those negative reviewers, it is just a movie. Kudos to Vanguard and Stanley Tong."}, {"id": 34, "text": "Very good movie, so impressive by the production, worth to watch"}, {"id": 35, "text": "Cringeworthy lines, dull acting, horrible CGI, lousy plot...if you're planning on watching this movie for Jackie, save your money and watch his older works instead."}, {"id": 36, "text": "Very entertaining and exciting movie! Enjoyed it very much! Thumbs up!"}, {"id": 37, "text": "Another collaboration between Jackie Chan and Stanley Tong, another action classic that you cannot miss if you enjoyed their previous films!"}, {"id": 38, "text": "Yang Yang is so handsome. The young emerging star acts along with the super star Jackie Chan, and fulfill you double wishes of both action and handsome faces. It is just too good to be true."}, {"id": 39, "text": "Jackie Chan has been doing his stunts and entertaining fans in the last three decades, and he continues to shine despite being in his late 60's. Vanguard is another popcorn movie that will keep you on the edge of your seat just live every JC movie."}, {"id": 40, "text": "Tired of Jackie chan punching and then shaking his hand or rubbing his head when hit. The cgi is worst I've seen. This will probably appear to under 10s but way below par Come on Jackie. You're better than this. Loved him in the foreigner. If you're aged over 10 forget it!"}, {"id": 41, "text": "I was disappointed in the story, the director and the motion affect."}, {"id": 42, "text": "I left the Cinema after 15 mins- one word to describe this movie - garbage"}, {"id": 43, "text": "This movie not only has hard core Kung Fu like all Jackie Chan movies do, it also combine a lot of action sequences with CGI. Everything becomes more exciting and fresh!"}, {"id": 44, "text": "I went to this movie expecting great action &amp; I got more than great, fantastic action pieces. The casts are charismatic &amp; likable but that's all to it. I feel like this movie is a sequel to a movie that doesn't exist. The world set-up is intriguing but the execution is generic. The characters are actually interesting but their time of interaction were consumed by the action. Wished we got some backstory behind these characters motivation but sadly the duration is short.Jackie Chan was great &amp; he doesn't overshadowed the rest of the characters which I'm glad. The plot &amp; the villain motivation were so generic &amp; stupid hence they stop me from loving this movie. I don't get how everyone saying the CG is terrible, imo its really good. The action pieces are definitely the highlight of the movie."}, {"id": 45, "text": "Literally worst movie in my life Just showing us how beautiful Dubai is"}, {"id": 46, "text": "I will not write much. But trust me when i say that you will waste your money &amp; time watching this."}, {"id": 47, "text": "The movie is really bad I felt like I got scammed when i watched the movie it has the worst acting and worst editing techniques for the first time juke Chan was not funny at all and how would you say your dads fortune the was there years ago and there are new model cars I mean like was the writer or producer not thinking probably I think it's the worst movie I have ever watched in my entire life worst than Dora the explora"}, {"id": 48, "text": "It's unrealistic at times for sure, and the cgi is pretty bad, but the action is good. People complain too much. The movie takes place all over the world, and is a pretty fun ride. Not sure where the complaints about nationalism are coming from, I'm not really seeing it."}, {"id": 49, "text": "People seem to want too much for a movie these days this is just entertainment take it for what it is it's definitely entertaining"}, {"id": 50, "text": "Really weakest movie that i saw untill yet What a waste of big name such as Jacky Chan"}, {"id": 51, "text": "The chinese are not good with audio. They never have been, but this is seriously awful. The terrible rerecorded out of sync audio is very annoying. CGI is also terrbile....Some cool fightscenes made me watch the whole movie though"}, {"id": 52, "text": "This is a horrible movie I don't even know where to start. It is a story that we have seen thousands of times with stereotypes that is so disgusting! Full of cheesy lines it makes The Room looks great! CGI used is horrible taken from the 70s! Action scenes are so stupid, and they are not even funny stupid like some people suggest! And what is up with the Chinese new year fuzz?!! Is this some kind of a way to promote culture?! Simply horrible!"}, {"id": 53, "text": "Not the hoped from Jackie Chan Directing was very bad The comedy was not funny at all so waste your time and money watching the movie"}, {"id": 54, "text": "Speaking honestly, as someone who is not writing on behalf of the Chinese government, This is the greatest movie ever. It really shows the benevolent nature of our great leader Xi Jinping who wrote, directed, edited and marketed this amazing movie and tribute to the glory of the CCP.This movie stands as a tribute to what the great country of China can accomplish with the help of its VERY willing allies such as Hong Kong and Taiwan, when all willingly and with great desire, join the benevolent and god-like crusade of the humble Chinese government... willingly.Please support this movie and the humble Chinese Communist Party in our great effort to bring joy and laughter to the world, because a world that laughs together, is easier to conquer."}, {"id": 55, "text": "Captain China is mightier than Captain America?First, trying too hard to look westernize with the clothes and plastic surgeries. Second, stealing patented ideas. What's next? Stealing actual land? Oh yea, this has been happening all over too. People are starting to see the greedy-eyed monster of communism.I love Jackie Chan but he wasted his time &amp; talent in this movie. Horrible plot &amp; characters, horrible script, &amp; poor casting."}, {"id": 56, "text": "Jackie chan is one of my favorite action actors in his movies. I didn't expect that much going in and it was ok. It's not really bad, just go in expecting fun jackie chan action because that is what you will get"}, {"id": 57, "text": "Jackie Chan can be a good dramatic action actor. This is only when the movie is produced by the west, with the right direction and script. The Foreigner would be a great example. I'm not sure if he does these for the quick buck or what, but this is just another Hong Kong action crap fest. Same ole same ole, been there and done that, by him, a hundred times over. It's really too bad, I've been waiting some time for him to do another good movie. Unless you get a free presentation of this movie, I would advise against spending any money on it."}, {"id": 58, "text": "Why am I failing to download this movie😕I have tried to download it from different platforms but still can't work..... What's wrong with it,, it's not even fun..... Too much restrictions and slid of movies under the same name"}, {"id": 59, "text": "Jackie is a great actor... but this movie ain't worth it they only part I enjoyed was the dubai part cause I live there lol.... he should have kept it old fashioned that's I miss"}, {"id": 60, "text": "Apart from the chasing scenes at the beginning of the movie, the movie is rather silly, and poor production for the scenes taken in Dubai.Nothing wrong in using Omar name, but why they injected the name of Omar Bin Al Khattab in the movie !!Omar Bin Al Khattab is listed in The 100: A Ranking of the Most Influential Persons book. Why are they trying to make him among the bad guys !!"}, {"id": 61, "text": "One of the worst movies has been published last few years No story Too Animation scenes Bad presentation of Arabs Not realistic at all Bad is the most generous describing of this ***** movie"}, {"id": 62, "text": "The movie is poorly acted, edited, and everything sucked.Worst CGI and after effects. Worst editing, felt as if it was edited by windows movie maker. It felt as if the entire movie was shot and edited on a Huawei phone."}, {"id": 63, "text": "Compared to Vanguard, latest FFs are physics seminars. V is a full action movie with actors looks coming out of a wax museum or statue maker. Everything is so clean and beautiful. Not a drop of blood despite all this shooting. Aimed as a family entertainment, looks like Kung Fu Yoga part 2 in Middle East instead of India. Jackie's role is limited, giving his place to what might be future Donnie Yens: Yang Yang and Miya Muqi. I would have preferred some gore, but it wouldnt be watchable in family, so it is ok like that."}, {"id": 64, "text": "I saw Vanguard, starring Jackie Chan-The Foreigner, the Rush Hour movies; Miya Muqi-Kung Fu Yoga, Tomb Robber; Brahim Chab-Abduction, Dragonwolf and Ruohan Xu-this is her first movie. I guess it depends on whether or not you are a Jackie Chan fan-I am-but if you are, you should enjoy this movie. It does have a little less Jackie-he is getting just a tad bit older, being 66-but the stunts and fights are pretty amazing. Jackie plays the head of a security and VIP protection service called Vanguard-that is one of the excuses for less Jackie, being behind a desk. An accountant has been kidnapped and Vanguard are called in to save the day. Vanguard saves the book keeper but his daughter Ruohan, is taken as a hostage/leverage to get what the bad guys want. Jackie does participate in some action/fight scenes but leaves the majority of it to his younger and highly trained agents, such as Miya. Brahim is the kidnapper that has to face Jackie's elite squad, but Brahim has his own mercenary soldiers that really love to get into scraps. There are lots of cool stunts-I really liked the flying skateboard-and fights, as well as car chases and gun battles. Oh yeah, the screening I was attending had sub_titles and there are the usual bloopers and out takes during the end credits that accompany a Jackie Chan movie. I didn't notice a rating but it had violence-not too bloody-and had a running time of 1 hour &amp; 48 minutes. I really liked it and would buy it on Blu_Ray."}, {"id": 65, "text": "A lot of action, a lot of fighting. But the story is weak. It's a Chinese copy of an action film, nothing less."}, {"id": 66, "text": "While some rate this movie high and then question the negative ratings - I question the high ratings. Although the action scenes were fun to watch at times, they were full of terrible CGI - worse than a low budget made for TV movie. Script was awful, and the acting was worse, save for a few funny bits. Incredibly high capacity gun magazines used only added to the ridiculousness of this film. I question even whether this was shot on location or just stock footage used to give context. Despite some giving high ratings...I warn you...the only reason this movie is even in theaters here is because good movies are not being released."}, {"id": 67, "text": "Jackie chan can't pick his movies anymore but the action did leave me with a cringe due to the shoddy China CGI but they can improve though."}, {"id": 68, "text": "In a Jackie Chan movie, you wouldn't expect a good plot or a logical storyline, but the least you would expect was a bit of fun.But man, did this one fall flat on all accounts. For an action movie jam packed with explosions and rattling guns, this one was surprisingly dull and sleep inducing. If you came in expecting Rush Hour or Shanghai Noon, turn away. This one is closer to Rush Hour 3 and The Spy Next Door."}, {"id": 69, "text": "The movie is good but not awesome like the rest of Jackie Chan movies. But loved it coz Jackie Chan was funny as always. The girls were hot."}, {"id": 70, "text": "This is a poorly executed film, it doesn't know what it wants to be, the plot is thin and predictable as it gets. I never bother to care about the characters, since the movie already glorify the good guys, and the bad guys are either clichèd or stereotypes, and all seem to speak with some ridiculous accent. The action sequences takes more than half of the movie, and while some well-done and fun to watch, others are cartoonish, literally. They overuse CGI so much that it takes away the fun. I was surprised Jackie Chan take part in this film."}, {"id": 71, "text": "Pretty sure this whole film was directly commissioned by xi jing ping. It's like they heard about captain American got jelly and invented captain China that wears a cute little ccp hat lol. Nothing about this film was well done. Most final scenes looked like first takes."}, {"id": 72, "text": "Just when you think Jackie Chan can't set the bar any lower, he excels and sets it... lower.Awful."}, {"id": 73, "text": "You know i have a big expectation to this movie but i'm really dissapointed, too much cgi and ridiculous scene. fyi cendrawasih bird is only live in Papua forest not in africa forest dude.."}, {"id": 74, "text": "I think everyone reviews says everything I want to say about this movie. The acting is bad, the action is bad, the visual effect is bad, and mostly the story is so bad. Don't waste your time watching the full hour of this movie because the movie poster put Jackie Chan name on it. What a shame, a living legend end up like this in this movie."}, {"id": 75, "text": "This is atrocious on every level, generic, boring, such a bad shadow dropped on amazing hong kong cinema legacy which is Jackie Chan. Movies like this must not exist. Avoid at all costs."}, {"id": 76, "text": "Just another average movie standard, nothing special but lots of disgraced artificial software made scenes and stunts. This is end of 2020 and software enhancement had been far better since 1998 but this movie still lack and too far behind. Jackie's acting is not good and his comedy still showed he is a lousy clown. He is still bad at comedy and those stunts are no special new. The whole storyline is just normal and lacks the real kicks and reality. Why a Jackie Chan movie had not progressed over the years? Why he still stubborn sing and he is so bad at it?"}, {"id": 77, "text": "He totally lost it. bad actors. bad script. couldn't watch more than 15 minutes🤕"}, {"id": 78, "text": "This movie is perfect but only for girls, kids, younger people, who don't like serious stuff. Funny, positive, and cool machines (weapons and cars). End is the best because of so much cool stuff shown suddenly and reminds me of GTA and Need for Speed. But story is not that good. Lacks reality, depth, seriousness."}, {"id": 79, "text": "Jackie Chan stars in this extremely bad CGI political chinese propaganda movie b/c no movie, no mansion."}, {"id": 80, "text": "First, let's put it in perspective. Chinese movies nowadays have gone off the rails. The bad stuff: The plot is janky. There is no backstory, nothing, the characters are plain, the setting is nonsentical. The filming locations, obviously, very limited. CGI is awful. I don't know if they didn't have any money, or the production was rushed, but the quality of the CGI is lower than what most videogames have nowadays. The overall cheesiness. In general, a certain degree of cheesiness in Jackie Chan's movies is a given and is, actually, welcome. But here because of the lack of character development, it looks like a fondue of a movie. The good stuff: The story doesn't break continuity, as it happens with many modern Chinese movies. The choreography and the stuntwork. It is actually good, the fighting scenes are well-set and look pretty decent. Jackie Chan. Well, what can I say, the name says it all. Overall, it's very similar to Armor of God III: Chinese Zodiac. I'd say it's an improved version of it. Were this movie made by an indie studio, I'd say it's a solid action movie. But it wasn't and it's just not good enough to get more than 5 out of 10..."}, {"id": 81, "text": "It's a Chinese Fast and Furious with karate. stay for outtakes"}, {"id": 82, "text": "Never a dull moment. The movie played in 4dx (moving chairs, wind/water in your face, etc) which I usually hate. But this time I really did not mind. The movie is full of explosions that do not hurt and bullets always miss the good guys. But that did not make it less fun. Best part was the chase on the river with the (surprise!) waterfall to make it more scary. They really filmed this in serious rapids. Well chosen exotic locations."}, {"id": 83, "text": "The CGI scenes is really unimpressive. It's so easily noticeable. Especially the scenes with the lions and when they are in the rapids. However moving on from this part, the movie picks up and it becomes all through entertaining from there. Great fight scenes. It's nice to see Jackie make room for the younger cast to also shine. The humor is also on point . Not a bad movie generally. I'll definitely watch it again"}, {"id": 84, "text": "This your typical Jackie Chan movie with lots of action and elaborate scenes in exotic places. Who could ask for anything more? I don't think anyone is going to watch a Jackie Chan and Stanley Tong movie for Oscar winning performances. The CGI is a bit larger than life and the shows action sequences rely a lot younger more spry and nimble actors and stuntmen. And yes you can tell that Jackie is getting older but I applaud him for being able to still do exciting fight scenes and stunts at his age. Just enjoy the movie for what it is and appreciate the amount of talent that is in it."}, {"id": 85, "text": "Jackie Chan brings fun, excitement to our screens yet again. And boy did we need it!"}, {"id": 86, "text": "Like most of Jackie chan great movies Very funny and awesome action And deserved to be watched more than once"}, {"id": 87, "text": "I can't say Vanguard is boring, because like someone waving a toy in front of a baby's face, its color and movement make it distracting. As well as expensive (though why so many of the CGI effects are so bad given what this movie must have cost, I have no idea). But it is senseless and ridiculous, even by the most lightweight fantasy-action-movie standards. It really feels like they said OK, we have about a dozen ideas here for generic ripoffs of other movies...hey, let's cram them all into ONE movie, and stick Jackie Chan on top! From one scene to the next, this film has no idea what it wants to be--so it tries everything, badly. I laughed out loud at some things that were meant to be taken seriously.I'm not sure bloodthirsty terrorists need to be heavily featured in a movie geared towards 10-year-olds, but that seems the approximate age group targeted here. Yet at the same time Vanguard isn't exactly a family film--or anything else, for more than a few minutes at a time. What it is, is a mess. A loud, expensive, busy mess that does Jackie no favors, or any of the younger cast members either.Please note that if you click on their names, every single user here who gave Vanguard ten stars has mysteriously never reviewed another film, and only been on IMBD for a month. This movie flopped even in China, but Chinese bots sure are working overtime to try to push it here."}, {"id": 88, "text": "Remember 90's b-movies? Now this feels like people responsible for those, miraculously time traveled to 2020 and shot this. At first that was how I felt, like the movie is 20 years old. But through its runtime it just gets worse and worse eventually reaching the level of the most absurd bollywood action. It really feels like a bollywood movie with Chinese and some white actors.The plot is of course dumb and simple. The dialogues seem to have been written by a child a decade ago. CGI is atrocious, especially car physics, oh boy this must be the most unrealistic way cars jump and roll that I've seen, not sure which was the funniest (as in most idiotic) - limo drifting in superspeed or golden suv crashing everything.You probably can't find a movie made this century with more cliches than this one.The editing is just the WORST. They must've outsourced it to a student or somebody's toddler made it. Haven't seen this many fade-to-blacks anywhere. There's no excuse unless they edited in in a single day. Editing is so bad that the whole movie doesn't even feel like a movie. It's more of a set of different scenes that were lazily stitched together. Not sure if the script was this bad or the editor is to blame but it often feels like a videogame, in one scene they finish planting a mine at night and it fades to black, just a second later a new scene appears when it's morning and an energetic music pumping. Like in those open world game where you come to the location at the wrong time so the world shifts to whatever proper time it has to be and then the cutscene begins. Pain to watch.Score is laughable. They literally put on funny music when something is meant to be funny, like it's a sitcom or something. Music is all over the place, not consistency, a complete mess.Gunshots though sound pretty cool and punchy at times.There was one genuinely excellent Jackie-style trick when he entered the car while it was moving, reminiscent of his old ladder tricks and window jumps.Conclusion: if you haven't seen an action movie (and any movie for that matter) in 20 years, or if you're a fan of Bollywood, or maybe if you're 10 years old, then Vanguard should please you. Otherwise, you better avoid it, even if you're a Jackie fan.P.s. unwatchable. Can't unroll my eyes back."}, {"id": 89, "text": "Vanguard was supposed to be released on 25th January, 2020 but due to global COVID-19 pandemic this movie has been delayed, and now it has finally arrived.After a long time Jackie Chan has returned to his form even though it's a multicast movie. Other younger actors couldn't bypass his role in Vanguard. He is growing old but his performances won't allow to reflect it. His accurate timing in both comic scenes and actions are really entertaining.The story is written in such a way with visually super VFX and CGI action stunts that you will be amazed to see it on the theatre. Stanley Tong is always at his best with a mixture of actions and hilarious comedy scenes. Locations are selected very wisely for high octane chasing scenes with combinations of captivating fights.Don't miss this movie if you want to enjoy an on-the-edge thrilling ride in time of pandemic.Highly recommended 👌🏻"}, {"id": 90, "text": "______________________________________________________Protection Beyond Frontiers {Vanguard Tagline}. ______________________________________________________ A ~{ Mini }~ Review . So, as you've probably gathered by now, by way of my ' profoundly { Un }-enthusiastic title ' ; this, the -{ Sixth ✅ }- , no less , collaboration between Chinese cinematic 'All-rounder' Jackie Chan &amp; veteran Action-filmmaker Stanley Tong ; Vanguard, is Doubtlessly, Unquestionably, and Unequivocally... ~{ Nothing 🔴 }~ to 'write home about'. Needless-to-say, the very -( Glaringly )- obvious dubbing issues in the film tend to feel ( decidedly ) bothersome through the ~{ Entire }~ course of the film. And as a result, -Many- of the film's -Frequent- attempts at humour... { 👉Also👈 } feel cheesy, badly timed, &amp; simply 'Perfunctory' ( at -Best- ). ~{ Unless }~ of course, you are fortunate enough to be a ~{ Mandarin }~ speaker, { which, the vast majority of the -English- Movie Watchers here in the U.A.E, ( where I'm based at the moment ), are most certainly -Not- 😞 } . And speaking ~{ Of }~ the U.A.E, I suppose the reason that I forced' myself to watch this somewhat overhyped picture, would be the rather -glaring- fact that the ~{ Entire }~ Final Act of the film is filmed in Dubai 💙 , ( the Crown Jewel of the U.A.E ) , with -Several- of the sequences having been shot ~{ Literally❗}~  7 minutes up the street  from my -Previous- apartment. Unfortunately, However... having now -Seen- all those -( Genuinely memorable 😃 , I daresay )- places in the film ...&amp; consequently having ~{ Contextualized }~ their relevance to the -Actual- narrative of said movie ; I would be remiss to 👉Not👈 point out to you that this ~{ Entire }~ bespoke Final-Act feels very much like a sort of promotional 'tourism type' video for The Burj Khalifa &amp; The Dubai Mall { i.e the 'World's Tallest Tower' &amp; the 'World's 4th Largest Shopping Mall', respectively } ...not to mention the  Dubai Swat Team  , &amp; quite frankly, the 'Entire Dubai Police-Force' ...Itself . But for those readers ( and writers ) amongst you who have come to  Know  -( and understand ) , my particular brand of ~{  Constructive Only ✅❗ Review }~ by now....... well , here's three ' REALLY FUN THINGS ' to look out for over the course of the film ; ( - All - ) of which are featured in the official trailer. 1 : The mindblowingly good 'Whitewater Rapids Chase-Scene' filmed in South Africa..... { where the  Supremely 💥 Dedicated  Jackie Chan is said to have almost -DROWNED- }. 2 : The 'Extraction' scene set in an Indian village, which features some ~{ Truly 🌠❗}~ Dazzling hardcore-action scenes. 3 : A few decidedly ~{ Novel }~ Super Hi-tech  Surprises  -( &amp; mind you, I'm -Not- referring to the tacky looking bumblebee drones here )- that you will -Just- have to go &amp; discover for yourselves, I'm afraid . Summary : I'm going to be ~{ Incredibly }~ Gracious, &amp; give this film a 5.25 ....Hey, it's a 'Dubai Film' ...what can I say 🤷‍♂️ 😉 ."}, {"id": 91, "text": "Jackie Chan is at an age that he's not going to be prominent in action films. And that's OK. This film is pretty bad for several other reasons.First, it's obvious that China and the UAE funded this film. It smacks of propaganda from start to finish.Overacting/bad acting. Maybe it's because none of the actors are native English speakers but everyone seems to be shouting their lines even when the scenes don't call for it and they also exaggerate their facial expressions. It's almost how the silent film actors used their expressions to make up for no sound.Post production. From the CGI lions to the scenes where they speed up the film to make the cars go faster, it makes the whole production look amateurish. The sound was pretty bad, too. Not sure if dialogue was redubbed in the studio but it sure seemed like it.Bottom line, the movie is a major disappointment."}, {"id": 92, "text": "As a Jackie Chan fan I enjoy watching his movies for his onscreen actions and funny set piece fight sequences. Having said that Jackie Chan is taking a senior role in this movie, leaving most of the actions to the younger teen idols and rising chic stars.I enjoy the exotic locations here - outside of western metropolises. The story/plot is very fast pace as this is an action film - and it makes heavily use of CGI. However, the physics of the CGI is a let down - they may be good in older computer games and the teens/younger generations may find it easy to believe, but for an older person like me... I caught myself saying Aw that's not possible. (physics wise) a few times - and I still play computer games! The astute movie viewer can also spot a few pieces of Chinese propaganda thrown in to make the Chinese look good. However, that is obvious and expected of a Chinese state funded/sponsored film. e.g. Chinese taking an interest in shutting down African elephant poaching vs. ivory in black market demand, etc. It's also disappointing to not see anyone coming close to replacing Jackie Chan's action fight sequence, with his funny and smart use of the environment to his advantage.The film makes up with beautiful exotic locations and costumes/customs, fast paced set-piece action (reminds me of the Kingsman series) fight/shoot scenes.Overall Vanguard is good to burn time and generate a good amount of talk amongst youngsters and showcase what the mainland Chinese in partnership with the Arabs/Dubai are capable of. It is not for movie goers who expect deep meaningful plot with twists and turns and mysteries/romance. One thing is for sure... the Chinese may have some of the world's fastest supercomputers, but their CGI/special FX rendering in movies is still lagging way behind the other world famous VFX houses such as ILM/Weta Digital, in terms of physics and realism."}, {"id": 93, "text": "A big improvement on the previous Stanley (Tong) and Jackie (Chan) film, Kung Fu Yoga. The younger actors/actresses get slightly more screen time (but not too much) than Jackie in this crazy action outing; it is probably in his long term movie plans to wind down his previous fast paced wild action now that he is growing older (I watch a lot of Chinese films but I honestly have no clue about who could step into Jackie's role for the next 20-30 years).There are lots of little details (i.e. CGI special FX are not too good) etc that are not up to the usual high grade of his films but, they are not so bad as to ruin the enjoyment; I could not stop laughing at the funny scenes throughout the film yet I am sure it wasn't meant to be a comedy!Its going to be interesting to see how his future films unfurl as regards to his action acting. Having said that however, if he makes films in the future that are lesser in action such as The Foreigner (2017) then it will be fine by me. Watch or don't watch is always your choice to make but I think its worth a watch!Silicone Tourist signing off till next time."}, {"id": 94, "text": "Vanguard is probably one of the corniest action flicks I've seen this year but it has enough non stop action, to pull it off.From start to end there's lot of martial arts and weapons play to keep the viewer happy. Jackie Chan's trade mark is everywhere to be seen with a large doses of the kind of semi comical, choreographed fight scenes, that made him famous.On top of this is are large dollops of sugary, overly sentimental family and very tame romance scenes. I know from my time in China audiences there love this stuff. That said, it doesn't travel well and many Western viewers, like myself, will see it as downright corny.If you can look past this and I think you should, there's enough excitement, fun and pure entertainment on offer here, to keep the majority of action fans more than satisfied.6/10 from me."}, {"id": 95, "text": "Considering how little movie offers Hollywood industry is showing to cinemas; it is really a miracle somebody is still going like me. Weeks pass with shallow romances, un funny little comedies and so so horror movies. No serious movies, no blockbusters or anything else to motivate people but cinemas. But happily with little publicity came a Jackie Chan movie; which guarantees high production values, lots of action and healthy fun. VANGUARD does not disappoint in any of these aspect. Sadly Jackie has grown old but he is able to get a few younger actors doing the best they can to keep up with the legend; they did not succeed but still on the good path. VANGUARD is Mission Impossible / James Bond type of movie; with very sophisticated gadgets, lots of action. exotic places and mostly fun. Jackie does some stunts and fights but not too much while the rest try to compensate. There are very good fights and some very good action scenes in different exotic places and even a Fast and the Furious car chase in Dubai. On the pros side, the gadgets are far more believable than in MI movies; the fights are spectacular and the stunt work is unbelievable. Many people hated the attack of the U.S. ship; but it is basically a failed attack and besides U.S moves destroy most the work well known areas so this is just a very little retribution. On the cons; the car chase could have been better and some scenes could had benefit for more development.In any case; is the best action movie showing and you can take your kids too and enjoy with them. Basically a win win"}, {"id": 96, "text": "Vanguard is a quirky action movie that convinces with exotic locations in Europe, Asia and Africa, excellent fight scenes featuring martial arts elements as well as vibrant shootings and great action sequences including fast-paced car chases as well as dangerous watercraft races. The movie has been created with expensive accessories, excellent special effects and a collective of popular actors and actresses who always manage to look sharp and beautiful even in the most eventful situations. The film also includes a few amusing moments and a slightly romantic side story which make it an entertainment for the whole family. It's also noteworthy that Jackie Chan confronts once again a CGI lion as in Kung Fu Yoga which can either be interpreted as a clever running gag or an incredibly stupid coincidence.Some people might claim that this kind of movie is shallow and they wouldn't be wrong. The characters are so thin that they are almost inexistent. The plot is so weak that it can barely be called that way. The actresses and actors look great but don't showcase any talent beyond some stunts and stylish looks. The fact that Chinese security guards in this film can freely roam the entire world, intervene anyplace without any restrictions and shoot up dozens of foreigners to save a greedy businessman who backstabbed his own dangerous partner should tell you everything you need about the questionable self-perception of the filmmakers. The fact that this film has many top-rated reviews from critics who have only ever contributed one single review to this website should tell you the rest.However, what is to expected from a movie like Vanguard isn't a profound story, social criticism or brilliant acting. This movie delivers action, entertainment and eye candy from start to finish. That won't win this film any significant awards but it's refreshingly carefree in a time when many people are worried about many things. This movie gives a welcome occasion to switch your brain off and have some fun for almost two hours. In times like these, one should be thankful for this. If you like action films, my recommendation for you is to watch this movie on the big screen with some drinks and snacks before the next lockdown comes."}, {"id": 97, "text": "Liked because of the Action sequences at Nations I have lived at, been to.Liked because the Actors, Actresses do their own action sequences including Jackie Chan as to why they get injured. Makes everything look real.Liked because unlike Hollywood's extensive Use of CGI, this movie you cannot see that much CGI. Was that Real or CGI?Disliked because they need to add the category Fiction not only Action.Facts not FictionDisliked because after the Vietnam war Stationed at Federal Republic of West Germany to U.S. Embassy London England, from U.S. Embassy to British Ministry Of Defense to British SAS School to Update their Training to reintroduce Strategic Special Reconnaissance and Strategic Special Surveillance back into the British SAS that they were originally created to do during World War 2, the British were at that time more concerned with Counter Insurgency Warfare and Counter Terrorist Operations as having to do something about the Bombings of London England. After graduating from the School, and reintroducing what I knew from Surviving the Vietnam War as a U.S. Army Special Forces Long Range Reconnaissance Patrol Platoon Sergeant, was assigned to the British Ministry of Intelligence 5/6, from there to the Queen's Own British SAS Detachment. The British are very strict as to who can Operate as Para Military, Security Forces or anybody that is Trained and Armed, ESPECIALLY FROM OTHER NATIONS.Disliked as a U.S. Military Officer because after the President Obama Budget Cuts 2009 to 2016, U.S. Laws, National Defense Authorization Acts, because of money Obama had to choose either fund Democrat President Clinton's Declared War, Iraq Liberation Act of 1998 or Afghanistan, Obama lost U.S. Ally Iraq's Centuries of Oil to Iran and the Russian Federation, Iran made Deals to buy 21st Century Technology the Deals were made at Dubai, New Nuclear Centrifuges, Russian Intergrated Anti Ballistic Missile Systems including the S-400 capable of Deteching 5th Generation Stealth and shooting down Ballistic Missiles and Russian Military Maintenace Crews, from the Chinese also thru Dubai the Iranians bought Chinese Rocket Assisted Self Rising Mines to implace at the Strait of Hormuz, Chinese Long Range (Over the Horizon) Anti Ship Ballistic Hypersonic Missiles that were designed to kill U.S. CVNs (like I was trained on as a U.S. Military Officer) and just about any U.S. Navy Ships and some U.S. Navy Boats (Submarines),Obama still did not have enough money for U.S. Ally Afghanistan, so the Afghans made deals with the Chinese to buy Afghanistan's High Tech Mineral Wealth, the Chinese being smart then refused to sell the High Tech Mineral Wealth to the U.S. to force U.S. Businesses like Apple Corporation to Manufacturer at China. The Chinese were within my Area of Responsibility and Area of Operations at Afghanistan doing extensive Mining Operations, they first put up fences with sensors, guard towers with heavy machineguns similar to the U.S. M134 Minigun equipped with Thermal Imaging, Electro Optics, Night Vision, Telescopes, a gunner and assistant gunner and a sniper. They wore no insignias on their Uniforms even though we knew they were just like Us as Special Warfare just below the CIA's SAD and SOG, that we routinely work with, they get the best of the entire Nation of China, and are of a lot large Force than we are. Regardless of who's Special Forces of whatever Nation we all do non lethal things to each other, so their shooting near Us is similar just to make Us react or if we don't react they know we are just like them...didn't flinch. The Chinese then expanded the Old Silk Road above Northern Afghanistan to haul all the High Tech Minerals back to China from Afghanistan, meaning they destroyed the Villages, Towns at the Old Silk Road.$800 Million compared to the Iraqis Oil negotiated at Dubai and the Russian Federation estimated to be nearly multiple $Trillions. 2011 Obama lost the Decades of Libyan Oil as negotiated by Qatar and Iran, estimated to be Hundreds of $Billions, that per 2006 U.S. Alliance Agreement with Libyan President Gaddaffi was to be Exclusively sold only to U.S. Allies, with this Obama Loss (Obama Overthrow of U.S. Ally Libya), Iran sells to The Russian Federation, the Russian Federation sells to U.S. Allies making U.S. Allies Indebted Financially and Politically to The Russian Federation.$800 Million is nothing compared to the amounts going thru Dubai's Hawala Secret Banking System. 2010 another Nation sent their Agents to kill Hamas Leader Mahmoud al-Mabhouh at Dubai, living quite well on the money ($900 Million) that President Obama and Vice President Biden gave Hamas 2009, and the money ($Millions) Secretary of State Clinton gave to Hamas."}], "reviews_amount": 98}